{"url": "1,001st_stormtrooper_division", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Jedi hunters", "Category:Stormtrooper units"], "nodes": [{"tag": "h1", "text": "1,001st stormtrooper division"}, {"tag": "p", "text": "The 1,001st stormtrooper division, known as the Knighthunters, were an elite group of stormtroopers serving in the Imperial Army of the Galactic Empire of the One Sith, an order of Sith Lords under the leadership of Dark Lord of the Sith Darth Krayt, during the Second Imperial Civil War. As Krayt and his Sith assumed control of the Empire, the One Sith enacted a purge of the New Jedi Order, eliminating Jedi throughout the galaxy. The Knighthunters became a key part of the Sith's purge."}, {"tag": "p", "text": "The specialized stormtroopers who comprised the Knighthunters fell under the direct command of the Sith. To aid their commanders in their crusade, the stormtroopers of the 1,001st division underwent specialized training to aid in the capture or killing of Jedi. They were armed with lightsaber-resistant phrik-laced electrostaffs and protected by jet-black armor based on that of the Coruscant Guard of Palpatine's Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the conclusion of the Sith–Imperial War between the Sith-backed forces of the Fel Empire and the Galactic Federation of Free Alliances, the Dark Lord of the Sith Darth Krayt led a coup that merged his One Sith with the deposed Emperor Roan Fel's forces into a single Sith Empire. Simultaneously, the Sith enacted a galaxy-wide purge of the New Jedi Order, forcing any surviving Jedi to go into hiding. To aid the Sith, the soldiers of the Imperial Army's 1,001st stormtrooper division were drafted to hunt down the remaining Jedi and capture them—or kill them, if necessary."}, {"tag": "p", "text": "Command of the Knighthunters, as they came to be known, was transferred from the Army hierarchy and placed into the hands of the Sith. Personally trained by Sith Lords, the Knighthunters learned to defend themselves against any trick a Jedi was capable of. By the completion of their advanced training, the elite stormtroopers were more than able to block lightsaber attacks, negate the effects of Force powers, and counter the extreme athleticism of Jedi and similar foes. However, this training was not without its risks—Knighthunter training boasted a high fatality rate."}, {"tag": "p", "text": "Regardless of the hazardous training they received, Knighthunters performed exceptionally well at their job. Upon the discovery of a Jedi's location, a Sith Lord would procure a detachment of Knighthunters to accompany him or her in confronting the Jedi. The Knighthunters' presence increased the odds of capturing or killing their opponent; likewise, it also decreased the odds of the Jedi either escaping or killing the Sith. The elite troops would do whatever was necessary to complete their objective."}, {"tag": "h2", "text": "Armor and equipment"}, {"tag": "p", "text": "Like other elite units, Knighthunters had access to an assortment of equipment that standard stormtroopers did not. Their durable armor, painted jet-black, was modeled after that of the Coruscant Guard, which watched over the Imperial capital world Coruscant during the days of Palpatine's Galactic Empire. It also combined elements of storm commando armor. Knighthunters' helmets also featured a special device capable of disrupting Force mind influences: a small connector located at the base of the neck sent electrical impulses, which negated the effects of Force mind tricks, into the wearer's brain and spine."}, {"tag": "p", "text": "To stay true with their philosophy of swarming Jedi with a flurry of melee attacks, the Knighthunters utilized weapons that would provide adequate when fighting a lightsaber-equipped opponent. The elite stormtroopers' most commonly used weapon was an electrostaff, laced with phrik so as to deflect lightsaber attacks. When forced to engage in ranged combat, the Knighthunters employed sonic weapons rather than traditional blasters, as lightsabers were not able to deflect the output of sonic weapons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Knighthunters first appeared in 2009's Legacy Era Campaign Guide, published by Wizards of the Coast."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}