{"url": "Bink_Kitik", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Bink Kitik"}, {"tag": "p", "text": "Bink Kitik was a female Human ghost burglar who aided the smuggler Han Solo during a complex heist on the planet Wukkar in 0 ABY. She was often aided in her exploits by her twin sister, Tavia Kitik, who possessed considerable electronics expertise. The sisters often exploited their resemblance to confuse their marks, but while Bink enjoyed her criminal lifestyle, Tavia was a reluctant, if highly-adept, participant in their heists."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bink Kitik was a female Human ghost burglar who lived during the reign of the Galactic Empire and was the identical twin sister of the electronics expert Tavia Kitik. By the time they were ten years old, Bink and Tavia were already orphans. Their father was killed in the Clone Wars and their mother died a few years later. At some point, the pair traveled aboard a luxury liner on a voyage to the planet Kailor V, and Bink began wooing the business man Cristoff in an attempt to steal his jewels, and she sat next to him at the captain's table during meals on multiple occasions. She initially hoped to receive an offer from Cristoff to visit his stateroom aboard ship, so that could break into his safe and take his gems, but while she received multiple requests from him to visit her cabin, he never offered to take her back to his own room. During her dalliances with Cristoff, Bink wore a sensor mesh that had been designed by Tavia beneath her dress, to detect on what part of his body Cristoff was carrying the keycard to his room."}, {"tag": "p", "text": "On the last night of the cruise, while the liner was docked with the Kailor V transfer station, Tavia distracted Cristoff while pretending to be her sister, and Bink gained access to his stateroom using a copy of his keycard that Tavia had created with the sensor mesh data. Through chemicals released from his body due to his prior consumption of falpas sauce, Bink was able to detect which numbers on his safe keypad he had keyed in and amount of times had touched them. Using knowledge she had gained of his personal history, she worked out that correct password was the date and CTE market number of a corporate takeover that brought Cristoff wealth and power, and she opened to safe and stole some of the gems that lay within."}, {"tag": "p", "text": "At some point, Bink and Tavia traveled to Danteel City, planning to rob the vault of a prominent casino owner, Veilred Jydor. They were also working with a Balosar con artist named Zerba Cher'dak. While there, Bink spotted a human gambler named Lando Calrissian, who was there for a high-stakes sabacc game that Jydor was holding as a way of selling a highly-valuable statue, a Tchine. However, when they realized that Jydor's business manager Darim Chumu had committed murder to obtain another Tchine, Bink, Tavia, and Zerba teamed up with Calrissian to implicate Chumu."}, {"tag": "p", "text": "In 0 ABY, Bink and Tavia became part of a group of criminals that were gathered together by the smuggler Han Solo to steal the riches of the Black Sun official Avrak Villachor from a vault on the planet Wukkar."}, {"tag": "p", "text": "Solo and his Wookiee companion Chewbacca found the sisters as they were completing a heist. As Bink returned to her sister, Solo made his offer: a share in 163 million credits if they successfully robbed Villachor. Intrigued, Bink and Tavia took the job. Villachor had stolen the credits in credit tabs from a local man named Eanjer Kunarazti after murdering Eanjer's family, and the man had hired Solo to recover them. Solo recruited a large team to pull off the heist, including the twins."}, {"tag": "p", "text": "Bink's role as ghost thief was to help with intrusion into Villachor's vault. One of her first assignments was to penetrate a suite of hotel rooms at the Lulina Crown Hotel reserved by visitors of Villachor, who the team soon discovered were Black Sun Falleen. Bink used a manual cable rig to cross the trees of a courtyard successfully broke into the hotel rooms, discovering a safe. Bink cracked into the safe to find it contained a cryodex encryption device, but not the credit tabs they were looking for. Thanks to a diversion from Dozer Creed, another member of Solo's team, Bink was able to escape without detection from Villachor's associates."}, {"tag": "p", "text": "The next stage in the plan was for some of Solo's people to discreetly approach Villachor in an attempt to incite a defection, however; the plan was a ruse to gain access to Villachor's vault. As part of this process, Bink was given a cover identity as a local businesswoman and assigned to attach herself to Lapis Sheqoa, Villachor's security chief, and discern the security measures guarding the vault from him, during the Festival of Four Honorings, a Wukkar festivity."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bink had a more casual and relaxed approach to life than her sister Tavia. She was a skilled thief and she was experienced at manipulating members of the opposite sex in order to aid her crimes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bink Kitik was created by Timothy Zahn as a character for his novel Scoundrels, which was released in January 2013. Prior to the novel's release Kitik was referenced in the guidebook The Essential Reader's Companion and she appeared in Heist, a short story published in the magazine Star Wars Insider 138 that was written by Zahn as a tie-in to the novel. She is also featured in the e-book novella Winner Lose All, another tie-in to Scoundrels that was written by Zahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}