{"url": "BioWare", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Real world company stubs", "Category:BioWare games", "Category:Computer and video game companies"], "nodes": [{"tag": "h1", "text": "BioWare"}, {"tag": "p", "text": "BioWare is an electronic entertainment company best known for its computer roleplaying games. It is based in Edmonton, Alberta, Canada, with a second studio in Austin, Texas, USA, and a third in Montreal, Quebec, Canada."}, {"tag": "p", "text": "BioWare's first Star Wars game was Star Wars: Knights of the Old Republic, released for both Microsoft Xbox and PC in 2003."}, {"tag": "p", "text": "On November 3, 2005, BioWare announced a partnership with Pandemic Studios, the developers of Star Wars: Battlefront and its sequel, Star Wars: Battlefront II. Though they now have common ownership and pool their expertise to develop games, both companies retain their individual staffs and brands. In 2007, both studios were bought by electronic entertainment giant Electronic Arts, a sometime rival of LucasArts."}, {"tag": "p", "text": "Years of rumors and wishful thinking by fans surrounded the possibility of a BioWare-produced Star Wars: Knights of the Old Republic 3 or some other Star Wars project. BioWare's spokespeople typically responded to these rumors by stating their intention to focus on original titles (such as Jade Empire, Mass Effect and Dragon Age: Origins) rather than licensed games. However, in 2007, a LucasArts-BioWare partnership to produce a \"ground-breaking interactive entertainment product\" was announced, though details were vague."}, {"tag": "p", "text": "In the following months, rumors persisted about the development of a new Knights of the Old Republic video game, spurred on by leaks from within BioWare and LucasArts and the registration of \"Star Wars The Old Republic\" and \"The Old Republic\" as LucasArts trademarks. During the E3 2008 expo, Electronic Arts executive John Riccitello confirmed that the game Star Wars: The Old Republic would be connected to the Knights of the Old Republic series of video games. It was released in North America and Europe on December 20, 2011."}, {"tag": "h2", "text": "List of Star Wars games by BioWare"}, {"tag": "h2", "text": "List of non–Star Wars games by BioWare"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}