{"url": "BioCruiser", "categories": ["Category:Legends articles", "Category:Colony ships", "Category:Liners", "Category:Starships", "Category:Transports", "Category:Treasury ships"], "nodes": [{"tag": "h1", "text": "BioCruiser"}, {"tag": "p", "text": "The BioCruiser was a massive, nomadic ship owned by Offworld Mining Corporation (UniFy) and commandeered by the philosophical leader called Uni (the former Kad Chun, brother of corrupted Jedi Bruck Chun). The ship's day-to-day operations were financed by a collective onboard treasury contributed to by its resident passengers."}, {"tag": "p", "text": "The ship, almost self-sustaining, served as a galactic refuge for many species who were disenchanted or disillusioned with the galaxy's state of crime and corruption that, driven by corporate greed, sought to bleed planets of their natural resources with no thought or concern given to their inhabitants―the disenfranchised of the galaxy who, having come aboard to follow Uni and his philosophical teachings, sought a new beginning filled with hope."}, {"tag": "p", "text": "This sentiment, however, was contrary to that which came to be adopted by Obi-Wan Kenobi, who in 29 BBY had been sent by the Jedi High Council with his Padawan Anakin Skywalker to investigate the onboard situation because of family-member complaints made to the Galactic Senate that the passengers were being held against their will. The Jedi Knight eventually came to believe that the BioCruiser held, rather, \"a gathering of disillusioned idealists\" holding \"a philosophy of withdrawal ... based in anger and bitter disappointment.\" Kenobi staunchly professed the Jedi belief of \"engagement\" with the galaxy as key to solving conflicts, spurning the idea of \"isolation\" or a perceived need to \"abandon the galaxy.\""}, {"tag": "p", "text": "Nevertheless, the titanic BioCruiser, a colony ship with no destination, was undeniably a marvelous vessel. It boasted, in addition to the collective treasury and a state-of-the-art defense system, tech centers, scientific labs, and service industries, in which the passengers labored for the common good. Apart from its many technological innovations, it was outfitted for safety as well, with \"escape liners\" for mass evacuation should the need arise. A cosmopolitan array of restaurants and cafés featuring foods from many worlds, together with game rooms, libraries, music rooms, and a giant Collection Center that housed plants, flowers and animals from just as many diverse planets, completed this organic-socio-technological wonder that traversed space."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The people of Telos IV held their natural resources in very high esteem. Vox Chun, the treasurer of Telos, joined forces with Offworld Mining Corporation (UniFy) to plunder the natural resources and start various mining projects on Telos. When the people of Telos discovered this, UniFy/Offworld was expelled from the planet. Unfortunately, years later, the planet was ruined further by other corporate enterprises and ventures. Thus did the people loyal to the planet and its preservation create the BioCruiser, to escape this corruption run rampant."}, {"tag": "p", "text": "The ship traveled to many other planets that had also succumbed to waste, corruption and corporate greed, taking aboard their variously skilled refugees, who likewise wanted to escape the desolation and find a new lease on life. Eventually, however, the families of the ship's passengers contacted the Senate and, by default, the Jedi Council to investigate, as it was thought (because the ship's residents had since failed to contact their families), that the passengers were being held against their wills."}, {"tag": "p", "text": "The Council therefore dispatched Obi-Wan Kenobi and his Padawan Anakin Skywalker to investigate the situation; it was Anakin's first mission. After several days aboard the ship, the Jedi duo (with friends Den and Andra) discovered that the passengers were not being held captive after all. There was, however, a surprising revelation: the ship's leader \"Uni\" turned out to be Kad Chun, the brother of Bruck Chun, a former Jedi student from Telos who fell to the dark side of the Force and became the apprentice of Xanatos. Bruck had died after dueling Kenobi in the Room of a Thousand Fountains while he was still a Padawan."}, {"tag": "p", "text": "Xanatos was the founder of Offworld Mining, otherwise known as UniFy, a Telosian combine; he was, however, also the first Padawan of Jedi Master Qui-Gon Jinn. He'd fallen to the dark side, to wreak havoc on the galaxy and, ultimately, to bring about the tragic deaths of both himself and his unfortunate Padawan, Bruck. Kad (Uni) was, not surprisingly, the self-proclaimed arch-enemy of Kenobi, as he immediately hated Obi-Wan for being cleared of all responsibility for his brother's death."}, {"tag": "p", "text": "Going through some personal records, Obi-Wan and Anakin discovered that Vox Chun, Brock and Uni's father, intended to have the ship destroyed by Offworld. Offworld droids would then rescue the residents and appear to be the heroes, while actually having been engaged in stealing the vast treasury—a collection of all the valuable personal assets of the residents of the BioCruiser."}, {"tag": "p", "text": "Vox was ultimately killed in the Offworld attack by Kern, a spy who managed to escape in a pod after battling with the Jedi. The Offworld battleship attack force was destroyed by the expert piloting of Jedi Knight Garen Muln and Skywalker, saving the onboard residents. The ship—escorted by the two Jedi pilots to the Tentrix system—would have been lost, but for Uni, Obi-Wan, and four crew members who stayed aboard the dying transport long enough for it to reach the planet Tentrix for repairs."}, {"tag": "p", "text": "As the sun rose over Tentrix on the morning after their arrival in the Tentrix system, Anakin Skywalker, standing with his Master on a docking platform above the vast blue planet, reflected upon his very first mission:"}, {"tag": "p", "text": "Kenobi and Skywalker's next mission was to the planet of Zonama Sekot, where they engaged in the Second Battle of Zonama Sekot."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}