{"url": "Bioscan_Unit", "categories": ["Category:Legends articles", "Category:Athakam Medtech products", "Category:Medical sensors", "Category:Personal sensors", "Category:Surveillance equipment"], "nodes": [{"tag": "h1", "text": "Bioscan Unit"}, {"tag": "p", "text": "The Bioscan Unit was a bioscanner originally produced for medical uses, allowing doctors to quickly diagnose a patient's injuries and illnesses. It was developed Rhinnal State Medical Academy in conjunction with Athakam Medtech. Following its introduction the unit also found a role in espionage and was utilized as such by the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Bioscan Unit consisted of a slim sensor suite which could be mounted on an examination bed and an analysis computer small enough to fit in a briefcase. The suite included a full-range scanner, vapro-sampler, doppraymagno scanner and a medtox detector. A complete and comprehensive scan could be completed in less than two seconds, listing everything from the patient's species, gender and weight to body temperature, muscle-tone index and respiration rate, and display the information on the analysis computer's flatscreen or holographic projector. This information could then be saved as a permanent record and compared at a later date."}, {"tag": "p", "text": "The scanned information would be compared to the bioscan's library of over eighty-six thousand alien species, noting any anomalies in metabolic, chemical and hormonal levels, along with any diseases and viral infections detected. The library could also identify three thousand different types of droids, and entries for newly-encountered species could be added by the user. Standard data ports in the computer allowed for information to be transferred between the bioscan computer and other computers, droids and datapads, while an internal battery allowed for a year's worth of use before requiring recharge."}, {"tag": "p", "text": "The detailed nature of the Athakam/RSMA unit's scans also made it as an espionage tool for covert agencies. Operatives can have their identities verified at the genetic level if necessary, while anything from cybernetics, weapons, energy cells to communication transmissions and encoded chips and datadots as small as a millimeter in diameter will be detected. The system's only limitations were that the suite must be firmly secured less vibrations foul the sensor readings, and the six-centimeter-wide scanning surface must be within forty centimeters of the subject. Otherwise the unit could be easily concealed in ceiling panels, below deck platings, or adjacent to a door frame."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Princess Leia Organa used an Athakam/RSMA bioscan unit during her meeting with the mysterious Black Sun operative Guri while on Rodia. Though she appeared outwardly normal, the bioscan revealed that she was in fact a Human-replica droid."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}