{"url": "Black_Bha%27lir", "categories": ["Category:Legends articles", "Category:Black Bha'lir members", "Category:Smuggling organizations"], "nodes": [{"tag": "h1", "text": "Black Bha'lir"}, {"tag": "p", "text": "The Black Bha'lir was a society of smugglers who lived by a strict code of ethics. Their name was derived from the large, pack-hunting cats of Iyred known as the bha'lir."}, {"tag": "h2", "text": "Smuggler's code"}, {"tag": "p", "text": "The Black Bha'lir was unusual among criminal organizations in that it expected all of its members to adhere to a very demanding code of ethical conduct. This code consisted of four principles."}, {"tag": "p", "text": "Those who broke the code or otherwise disgraced the Black Bha'lir were no longer considered to be members and were frequently hunted by the Black Bha'lir according to the Rites of Retribution. Those members of the Black Bha'lir who carried out retribution on behalf of the society were often revered by their fellow members."}, {"tag": "h2", "text": "Benefits of membership"}, {"tag": "p", "text": "A member of the Black Bha'lir enjoyed benefits unlike most other criminal organizations. The Bha'lir were focused on mutual support and the common good rather than individual success and selfish greed. While disputes between members did occasionally occur within the Black Bha'lir, a member could typically depend on the support of his fellow members no matter how dire a situation they found themselves in. As long as a member adhered to the ethics of the smuggler's code, they had only allies within the society. Members of higher rank, such as Master Smugglers, Mentors, and the Old Guard would often provide safe havens for downtrodden Bha'lir. Members of the lower ranks were willing to cross the galaxy to fight alongside their brothers and sisters in need. Reimbursement was sometimes expected, but was rarely more than a returned favor or customary gift."}, {"tag": "h2", "text": "Bha'lir ranks"}, {"tag": "p", "text": "Every member of the Black Bha'lir was expected to start at the bottom and earn their rank within the society. This ensured members gained power within the society based solely on the merits of their actions, but also helped to guide prospective members into the positions for which they were most suited."}, {"tag": "p", "text": "Apprentice: This was the lowest rank a member could hold within the society, and where all members started out. Becoming an Apprentice was not easy, however. Most Apprentices were brought into the society by relatives, but others were approached by the Black Bha'lir because they had already demonstrated the honor the society expected of its members."}, {"tag": "p", "text": "Forbidden by the society to own a ship of their own, Apprentices were usually expected to work under the tutelage of another member until they were promoted. In many cases, the Apprentice was made first-mate on a ship with a Bha'lir captain. There they learned the morality and responsibility expected of all members, as well as tricks of the trade."}, {"tag": "p", "text": "Pilot: The rank of pilot was awarded to Apprentices that stood out from among their fellow members. Many members of the Black Bha'lir never made it beyond the rank of Apprentice not because they lacked the skill of a smuggler, but because they were found lacking in their understanding of the code."}, {"tag": "p", "text": "Although they were not prevented from owning their own ships, Pilots often worked under a Master Smuggler and were assigned to one of the Master Smuggler's ships. Those who remained Pilots were often very skilled smugglers, but poor businessmen."}, {"tag": "p", "text": "Prince: The rank of prince was a rare honor awarded to Pilots who had earned a reasonable degree of fame in the underworld. Princes almost always owned their own ship, and their skills as a smuggler were rarely matched by any Pilot. Both male and female members of this rank were called Princes."}, {"tag": "p", "text": "Master Smuggler: Master Smugglers were most often minor crime lords or information brokers. They had proven themselves as Pilot or Prince and earned a less risky, but often more demanding life. The Master Smuggler usually owned more than one ship and kept several Pilots on their payroll."}, {"tag": "p", "text": "Mentor: While all members of the society taught and learned from one another, members of great wisdom and skill were promoted to the rank of Mentor by the Tribunal. Mentors were tasked with teaching new generations of members the skills of the smuggler, and guiding them in their understanding of the code."}, {"tag": "p", "text": "Old Guard: Only the most venerated members were promoted to the rank of Old Guard. Old Guards were most often Mentors who continued to serve as Master Smugglers or even Pilots. Once a member had obtained the rank of Old Guard, they were eligible to be on the Tribunal."}, {"tag": "p", "text": "The Tribunal: The Tribunal was the ruling body of the Black Bha'lir. They were responsible for settling disputes within the society as well as preserving the ethical code that was central to the Black Bha'lir way of life."}, {"tag": "p", "text": "The tribunal consisted of three members who were elected by a silent ballot open to all members of the society, but the identity of those who are elected remained a fiercely guarded secret among the highest ranking members of the society. Once elected, a member would serve on the Tribunal for life."}, {"tag": "h2", "text": "Rivalry with the Hutts"}, {"tag": "p", "text": "In the history of the Black Bha'lir, only one Tribunal member has ever been successfully assassinated. When the head of the Ramesh clan refused to pay a docking tax at Meril Power Station, a docking facility controlled by the Black Bha'lir, a dispute erupted between the Ramesh Hutts and the Black Bha'lir. The Ramesh invited a representative from the Tribunal to meet with them in their stronghold to resolve the conflict. The Black Bha'lir obliged and the Tribunal member was eventually slain by the brutal and over-confident Hutts."}, {"tag": "p", "text": "The Ramesh considered the matter resolved, expecting the Black Bha'lir to retreat from further conflict or crumble under the loss of one of their leaders. Instead, the Black Bha'lir exacted retribution. As a gift, they sent to the Ramesh a black bha'lir cub which the Hutts foolishly accepted as an offering of service, and the clan met to discuss what to do with their new tool, the Black Bha'lir. Unbeknownst to them, the Black Bha'lir had implanted a device within the cub's lungs which would release a deadly toxin known as trauger gas. The result was the near destruction of the Ramesh clan, and a lasting bitter rivalry between the Black Bha'lir and the Hutts. This story would come to be known among the Black Bha'lir as \"The Tale of A Tiger and A Worm.\""}, {"tag": "h2", "text": "Other affiliations"}, {"tag": "p", "text": "The Black Bha'lir were forever enamored of the underdog. Although they were never officially affiliated with any other groups or organizations, the Black Bha'lir often supported worthy causes for comparatively little cost. In rare cases, they even offered aid to struggling groups such as the Rebel Alliance without any expectation of reimbursement; a practice virtually unheard of in the criminal underworld."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}