{"url": "Black_Eight_Squadron", "categories": ["Category:Legends articles", "Category:Imperial Special Forces units", "Category:Imperial starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Black Eight Squadron"}, {"tag": "p", "text": "The Black Eight Squadron was an Imperial military unit composed of pilots who were highly trained in flying TIE/LN starfighters and TIE/sa bombers for the Imperial Navy. The Sith Lord Darth Vader maintained the squadron under his direct command, and personally supervised the selection of its lead pilot. Captain Juno Eclipse and other ace pilots with exceptional flight records were assigned to Vader's personal squadron."}, {"tag": "p", "text": "After the Battle of Yavin, Darth Vader reorganized the Black Eight Squadron into a group of convicted pilots led by Nas Ghent, a former ace pilot of the Confederacy of Independent Systems. By 1 ABY, the squadron was headquartered on the Imperial-class Star Destroyer Crucible as a result of the Rebel Alliance's victories in minor space battles."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "In the aftermath of the Clone Wars, the Sith Lord Darth Vader emerged as the Supreme Commander of the military forces of the newly formed Galactic Empire. In addition to the 501st Legion, the Black Eight Squadron was also under the personal command of the Dark Lord of the Sith. Under Darth Vader's leadership, the Black Eight developed into an elite unit in the Imperial Navy and was especially noted for their obedience and brutality. Vader carefully maintained the unit's composition by personally handling the selection of its leaders and TIE pilots, mainly to ensure that the squadron continued to live up to its reputation. As such, service within the Black Eight was brief for all members, a fact obscured by the mystique surrounding their highly classified assignments. Its members never revealed the identities of their wingmates or the details of their missions; outsiders never speculated about the squadron either. The core objective for any Black Eight pilot was to give Vader success in every mission, no matter the circumstance."}, {"tag": "h3", "text": "Bombing of Callos"}, {"tag": "p", "text": "By the year 3 BBY, the Black Eight Squadron's commander was Juno Eclipse, a Human female officer who joined the Imperial Navy after graduating as the youngest cadet in the history of the Corulag Academy. Impressed by the young woman's record for fidelity and competence, Darth Vader appointed Captain Eclipse as squadron leader. The wingmates under her command included \"Chaser\" Cartha, Youngster and Redline. Eclipse regarded the Black Eight Squadron as an elite unit and was immensely proud to serve as its commanding officer."}, {"tag": "p", "text": "Eclipse's pride in the Black Eight Squadron was brief, however. Shortly after her promotion, the Black Eight was deployed on a mission to invade the planet Callos. Although she followed her initial orders to the letter, conducting a bombing raid over enemy targets, her reaction to Darth Vader's next order was one of shock and apprehension. The Callosians' ability to offer further resistance was effectively broken, but the Sith Lord instructed the Black Eight Squadron to proceed with a full bombardment on the planet's defenseless inhabitants. Sensing her disapproval, Vader instead ordered Eclipse's squadron to destroy Callos's planetary reactor, and only then would he consider the mission a success. Eclipse complied with the new order, believing that she had averted genocide."}, {"tag": "p", "text": "The Black Eight fulfilled its mission objective with a surgical precision attack on the reactor; each strike found its target well before the defenses could be activated. However, the reactor's destruction unleashed pollutants into the planet's atmosphere, contaminating all of Callos and rendering it uninhabitable."}, {"tag": "h3", "text": "Post-Callos"}, {"tag": "p", "text": "Following the destruction of Callos, Vader rotated Eclipse out of the Black Eight Squadron and selected her as the eighth pilot of his secret apprentice's starship, the Rogue Shadow. Chaser was personally recommended by Eclipse as the next squadron leader, but was passed over in favor of Redline, a callous man whom Eclipse described as \"psychopathic.\" Youngster, a pilot noted for his optimism, had followed Eclipse into the Black Eight and left to fly transport ships soon after her reassignment. In addition to Redline and Chaser, who remained in fourth place on the squadron's roster, only a third of Eclipse's teammates were still part of the Black Eight in 2 BBY; another third was listed as deceased while the remainder advanced via promotion in the military hierarchy."}, {"tag": "h3", "text": "The new Black Eight Squadron"}, {"tag": "p", "text": "The Black Eight Squadron was reorganized in 1 ABY by Darth Vader during the Galactic Civil War. In response to the Rebel Alliance's unorthodox tactics, the Sith Lord chose to reform the Black Eight's composition by replacing its pilots with non-military personnel. Unattached to the Empire's cumbersome bureaucracy, Vader believed that the new Black Eight would be more effective as an unconventional unit, unhindered by the normal chain of command. The task of overseeing the squadron's development was entrusted to Commander Dorin Millavec, the fighter operations officer of the Imperial Star Destroyer Crucible."}, {"tag": "p", "text": "In addition to the conscription of Nas Ghent, a smuggler who previously served as a Separatist pilot during the Clone Wars, the rest of the squadron was composed of independent-minded pilots who could operate outside of the command structure. Those recruited into the squadron's ranks were chosen by Millavec, who had been told by Vader to search through the Imperial penitentiary system for ideal candidates. Although Millavec complied with Vader's orders, he harbored much resentment toward the pilots of Black Eight due to their renegade backgrounds. He especially hated Ghent because of the former Separatist's disdain for military discipline."}, {"tag": "p", "text": "Millavec, convinced that the Black Eight Squadron was a threat to his promotion prospects, secretly tried to sabotage Ghent's progress. While conducting a test flight, Millavec ordered the squadron's other pilots to kill their leader during Ghent's familiarization with the TIE/IN interceptor. Ghent instead destroyed his wingmates, however and soon became reinvigorated as a pilot due to Millavec's duplicity. After Millavec excused his actions by claiming that the attack had been staged as a test by Vader, Ghent promised to establish the Black Eight Squadron as the best aerial unit in the Imperial Navy. As the rivalry grew between the two, Millavec released some of the most unstable psychopaths from incarceration and recruited them as Ghent's new wingmates in a new plot to assassinate the wayward TIE pilot."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Black Eight Squadron possessed a high turnover rate for its leaders and pilots alike. Juno Eclipse served as head of squadron for less than a year before her reassignment following the Battle of Callos. Her predecessor lasted only a little longer than Eclipse did. His own predecessor commanded the Black Eight for a single month before his rotation to another unit. Although the three former squadron leaders were listed as deceased by 2 BBY, Eclipse remained alive as a member of the Rebel Alliance."}, {"tag": "p", "text": "Qualification to be a member of the squadron included loyalty and ruthlessness, the two defining traits of the most feared TIE fighter squadron in the Empire. Though pilots such as Eclipse, Chaser and Youngster were obedient to the chain of command, their apprehension to Vader's brutal tactics led to Eclipse's and Youngster's removal from the Black Eight; Chaser remained with the squadron, but was effectively barred from rising beyond fourth place. Those who possessed no ethical concerns for the use of excess force were rewarded with advancement, such as Redline who succeeded Eclipse as squadron leader."}, {"tag": "p", "text": "The new structure of the Black Eight Squadron under Nas Ghent's leadership reflected the unit's detachment from the chain of command. In accordance with Darth Vader's wishes, the squadron comprised rogue pilots whose disregard for authority was seen as an unconventional asset by the Dark Lord of the Sith."}, {"tag": "p", "text": "The Black Eight Squadron's primary complement was TIE/LN starfighters and TIE/sa bombers, although they have used at least one TIE/IT Interdictor starfighter during their missions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jeremy Barlow hinted that a future Rebellion arc could feature Ghent recruiting BoShek into the squadron. However, Rebellion was later cancelled in favor of Star Wars: Invasion."}, {"tag": "p", "text": "There is a discrepancy regarding which squadron Juno Eclipse served with prior to her reassignment to the Rogue Shadow. In the video game version of Star Wars: The Force Unleashed, both PROXY and Eclipse's Databank profile state that she was the leader of the \"Black Five Squadron,\" a fact also mentioned in the game's sequel. Yet the first and second novelizations state that her unit was the Black Eight Squadron. Because novelizations supersede video games in Star Wars Legends, this article refers to Eclipse as the leader of the Black Eight rather than the Black Five."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}