{"url": "Black_Eleven_(shipyard)", "categories": ["Category:Legends articles", "Category:Core Worlds shipyards"], "nodes": [{"tag": "h1", "text": "Black Eleven  (shipyard)"}, {"tag": "p", "text": "Black Eleven was a shipyard assigned to the Imperial Navy forces of Black Sword Command, later captured by the Yevetha."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Davith Sconn visited the Koornacht Cluster during the Imperial occupation, Black Eleven was based at the Yevethan world of Zhina. In 4 ABY, eight months after the Battle of Endor, the Galactic Empire evacuated the Duskhan League systems, and the Yevetha seized the opportunity to capture a number of Imperial vessels and facilities. Black Eleven thus came under their control, and was later moved from Zhina to a more secure location."}, {"tag": "p", "text": "By 16 ABY, the Yevetha had moved the Black Eleven Fleet to the Doornik-1142 system, on the edge of the Koornacht Cluster. This hidden base was almost discovered when the New Republic scout ship Astrolabe arrived in the system on a mapping mission at the start of the Black Fleet Crisis, but the interloper was destroyed by the battle cruiser Purity in order to protect the fleet. The New Republic became aware of Black Eleven's existence from Davith Sconn, but they failed to locate it in the initial phase of military recon missions conducted by the 21st Recon Wing after the Battle of Doornik-319."}, {"tag": "p", "text": "Ultimately, however, the action by the Purity betrayed the Doornik-1142 base to the New Republic, as it allowed Admiral Ackbar to surmise that the Astrolabe had stumbled upon one of the ex-Imperial shipyards. In 17 ABY, the New Republic Fifth Fleet accordingly sent a squadron of capital ships to Doornik-1142 to investigate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Black Eleven shipyard is only mentioned in passing in Shield of Lies, the second novel of the Black Fleet Crisis trilogy, where the facility is said to have been in orbit around Zhina during the Imperial occupation. The Black Fleet novels make clear that a number of Imperial yards in the Koornacht Cluster were captured by the native Yevetha, but do not categorically establish whether Black Eleven was among them."}, {"tag": "p", "text": "In the same passage in which Black Eleven is named, the character of Admiral Ackbar infers that the destruction of the Astrolabe at Doornik-1142 (an event in the previous novel Before the Storm) betrayed the presence of one of the captured shipyards there. In the third novel of the series, Tyrant's Test, there is a passing reference to the New Republic subsequently dispatching a strong force of capital ships to investigate this possibility."}, {"tag": "p", "text": "The inclusion of Black Eleven among the shipyards captured by the Yevetha is only made explicit in a series of secondary reference sources, beginning in 1998's the Star Wars Encyclopedia and repeated in subsequent works including 2008's The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "These reference sources also describe several Imperial warships captured by the Yevetha as members of a \"Black Eleven Fleet\" based at Doornik-1142, including the Purity of Yevetha which acts as guardship in that system in Before the Storm, and also the Victory-class Star Destroyer Valorous, and the Dreadnaught and corvette renamed Blessings and Beauty of Yevetha."}, {"tag": "p", "text": "It is unclear whether these statements derive from behind-the-scenes notes from Michael P. Kube-McDowell, the author of the Black Fleet novels, or whether they represent inferences made by Stephen J. Sansweet or another contributor to the Encyclopedia. Some associated continuity references to the Black Sword ships in these sources certainly seem to be incorrect, for example, a claim that that Beauty of Yevetha was destroyed during the Battle of Doornik-319."}, {"tag": "p", "text": "Although the presence of the \"Black Eleven Fleet\" at Doornik-1142 implies that the shipyard was also cached there, the Encyclopedia does not state this directly, and Tyrant's Test does not mention whether the reconnaissance-in-force mission did in fact discover the shipyard there, focusing instead on the discovery of Black Nine in the ILC-905 system by elements of Task Force Aster, and the resulting battle there."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}