{"url": "Black_Fifteen", "categories": ["Category:Legends articles", "Category:Core Worlds shipyards", "Category:N'zoth locations", "Category:Type II Orbital Repair Yards", "Category:Yevethan culture"], "nodes": [{"tag": "h1", "text": "Black Fifteen"}, {"tag": "p", "text": "Black Fifteen was the code-designation of a Type II Orbital Repair Yard assigned to the Imperial Navy's Black Sword Command and placed in orbit above the planet N'zoth in the Koornacht Cluster. The facility was renowned as the finest conscript facility in the Farlax sector, in which the Koornacht Cluster lay; this was due to the work of the native Yevetha, who were adept at the construction and modification of space vessels. The yard was taken over by the Yevetha in 4 ABY, shortly after the Battle of Endor, and the facility's staff and officers were captured."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built after the Imperial subjugation of N'zoth, Black-15 was attached to the planetary occupation force under Commander Jian Paret, and manned by a Yevethan work force that outnumbered their Imperial overseers nine to one. As with all Type II yards, the facility possessed nine shipways arranged in a massive square formation. It was not capable of constructing Star Dreadnoughts, but it was possible to dock these massive ships at some of the facility's outward berths, and the Intimidator was moored here after she was transferred to Koornacht from the Core for the final stages of her fitting-out. Black-15 was primarily designated for the construction and fitting-out of new warships, as opposed to repair operations. However, the reputation of the Yevethan technicians was such that captains in the local Sector Group who needed repairs done on their ships eagerly seized any available docking slots, and by the time N'zoth was lost to the Empire, eight months after the Battle of Endor, a sizable proportion of the work being done at Black-15 involved the rebuilding and reconstruction of old or damaged ships. At this point, however, the guardship Harridan was withdrawn to serve at the front, and Commander Paret received his orders to pull out of the system. Seizing the moment, the Yevethan underground, led by Nil Spaar, launched a coup and killed or enslaved the remaining Imperial forces. They seized the warships present and captured the shipyards, and, forming a government known as the Duskhan League, put Black-15 to use upgrading and maintaining the captured ships of the Black Fleet, and constructing new warships to the old Imperial designs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}