{"url": "Black_Fleet_Crisis", "categories": ["Category:Legends articles", "Category:Battles of the Black Fleet Crisis", "Category:Galactic Civil War campaigns", "Category:Yevethan culture"], "nodes": [{"tag": "h1", "text": "Black Fleet Crisis"}, {"tag": "p", "text": "The Black Fleet Crisis was the local conflict in the Koornacht Cluster between 16–17 ABY that saw the New Republic intervene against the Yevethan Duskhan League in response to the xenocide of all non-Yevethan sentient life. The crisis was further defined by political upheaval within the New Republic."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "When the Galactic Empire expanded into the Koornacht Cluster following the end of the Clone Wars, they discovered the Yevetha species and also noted the Yevetha's rapid ability to learn new skills. The Imperials subjugated the Yevethan homeworld of N'zoth and its nearby star systems, built the Black Fifteen shipyards and put the Yevetha to work as skilled slave labor building, repairing and modifying vessels of the Imperial Navy."}, {"tag": "p", "text": "About eight months after the Battle of Endor, the Imperial garrison at N'zoth was ordered to retreat and destroy the repair yard. Before they could initiate their withdrawal, an assault led by chief commando Nil Spaar took advantage of the Empire's view of the Yevetha as mindless labor and seized control of the vessels undergoing repairs, the operational warships and the yards. All Imperials were killed."}, {"tag": "p", "text": "Over the next decade and a half, the Yevetha developed their technical capabilities, developed advanced technologies in the form of starship shielding, gravity bombs, Aramadia-class thrustships and D-type fighters. They established the Duskhan League, which grew to encompass thirteen worlds."}, {"tag": "p", "text": "In 16 ABY, the Duskhan League came out of its isolation to engage the New Republic, which was enjoying a period of peace marked by increased member applications, economic prosperity and military innovation, as well as the development of a bloated and divided bureaucracy.\nA delegation led by now-Viceroy Nil Spaar arrived at Coruscant, supposedly to seek a peaceful coexistence. Given their xenophobia and view of all non-Yevethan species as 'vermin' however, it is more likely that they were there on a mission to sow confusion and disruption prior to their planned war of extermination."}, {"tag": "p", "text": "Using the New Republic's lack of intelligence on the Dushkan League and Senatorial political infighting to his advantage, Nil Spaar extended his negotiations with Chief of State Leia Organa Solo over a period of weeks. Pressured by military and intelligence advisors who sought answers, and potentially an ally against the Core Imperial strongholds, Organa Solo entered the discussions, only to find herself on the receiving end of a political plot to throw the New Republic into confusion. During this period he played into her empathy towards a species subjugated by the Empire, allowing him to cultivate assets on Coruscant."}, {"tag": "p", "text": "Unfortunately (or fortunately perhaps for the Yevetha), the Commander of the Fifth Fleet, General A'baht had sent astrographic survey ships to the areas around that of the Dushkan League. The New Republic had lacked accurate Star Charts of the deep core areas formerly belonging to the Empire, a fact which had made the General uncomfortable in the Fifth Fleet's search for the missing Black Fleet. The fleet itself, and the Prowler, were searching outside the space claimed by the League, but that did not stop a Yevethan warship from destroying the unarmed surveying ship, claiming it had violated their space."}, {"tag": "p", "text": "Spaar used this as his opportunity to set off a series of political machinations that sowed confusion amongst the New Republic. First, he accused Organa Solo of \"warmongering\" and begged for the Yevetha to be left in peace. Weary of going to war, many New Republic citizens expressed outrage towards the Chief of State and several member worlds even went as far as submitting articles of withdrawal. With the diplomatic outcome a complete catastrophe, Leia ordered the Fifth Fleet to return from the Falax sector to Coruscant—leaving the Black Fleet now completely unhindered to carry out Spaar's plans."}, {"tag": "h2", "text": "The Crisis Begins"}, {"tag": "h3", "text": "The Great Purge"}, {"tag": "p", "text": "Finally, Nil Spaar returned to his people, and with the New Republic in disarray, the Yevetha launched a campaign of brutal expansion and colonization through the use of the lost ships of Black Sword Command. The Yevethan Purge, called the Great Purge, the Cleansing or Second Birth by the Yevetha, saw the elimination of entire species like the Corasgh and communities like the Norat Sovereignty, and the colonization of many nearby star systems in the Koornacht Cluster. Plat Mallar, a novice Grannan pilot, would be the sole survivor of one of these raids on his home planet of Polneye—and would later become the face of the Great Purge."}, {"tag": "p", "text": "When news reached the New Republic, Organa Solo was understandably furious at how she had been manipulated. Initially hesitant to do anything about it, she ultimately was convinced by the efforts of Alpha Blue director Admiral Drayson after he showed her footage from an Alpha Blue recon drone of the Yevetha moving in on some of the planets they had just exterminated the population from and she turned the Fifth Fleet around to head back to the Farlax sector."}, {"tag": "p", "text": "Finding out about this, Spaar used agents on Coruscant to hack the New Republic Holonet \"Channel One\" which he used to broadcast a message to the entire New Republic. Spaar claimed to be defending the Yevethan people against New Republic aggression from several planets in the Cluster, a plot which had been hatched against his people from Coruscant. He then declared that the Daughter of Vader was seeking to follow in her father's footsteps, that the Fifth Fleet was on its way to conquer his people. For the Chief of State, this was a disaster. Spaar preempted a public press release about the events Leia and her administration had been planning to make public that very day, turning public opinion against her instantly, the Genocidal actions utterly failing to rouse the New Republic, unlike Zsinj, Grand Admiral Thrawn's campaign, the Reborn Emperor Palpatine's insurgency, and Daala."}, {"tag": "p", "text": "Due to the Koornacht Cluster's remote location in the Deep Core, many refused to sacrifice the lives of countless New Republic soldiers to defend such remote worlds that were not even members of the Republic, and were furious with Organa Solo for suggesting so. However, the Chief of State presented the Yevetha with an ultimatum, ordering the Dushkan League to withdraw from conquered territories. If they refused, war would be declared on the Yevetha. Nil Spaar responded by calling her bluff. Thus, full-scale war would prove inevitable for the New Republic."}, {"tag": "h3", "text": "First Shots"}, {"tag": "p", "text": "At the colony world of Doornik-319 in the system of the same name in the Koornacht Cluster, the New Republic's new Fifth Battle Group and the Duskhan League clashed. Prior to the battle, Morning's Bell, a Kubaz colony world within the system, had been razed by the Yevetha during the Great Purge."}, {"tag": "p", "text": "The New Republic attempted to blockade the system in an effort to halt the Yevethan progress across the Koornacht Cluster, bringing in an impressive task force of overwhelming force when the Yevetha brought in their own small fleet, deploying the new K-wing bombers in one of its earliest combat missions."}, {"tag": "p", "text": "However, the Yevetha had anticipated such a response and having compromised the New Republic communications systems, they broadcasted a message across all wavelengths which contained the plea of countless captives inside the Yevethan capital ships, who begged for the New Republic to retreat from the Koornacht Cluster lest they die along with their Yevethan captors. This tactic worked and greatly demoralized the New Republic forces. Enough of the K-wing bomber pilots and enough of the gunners on the capital ships hesitated in the face of the pleas, and the Yevethan fleet attacked. Morale low, some ships spontaneously started to retreat while others fought back ineffectively.In the end, despite their superior firepower, the New Republic didn't manage to eliminate a single enemy ship and retreated in disgrace."}, {"tag": "p", "text": "In response, several disgruntled New Republic senators began petitioning a recall against Organa Solo on charges of incompetence and for the endangerment of the lives of Defense Force personnel. Though the petition failed, it was a harbinger of more to come. In the face of opposition, the Chief of State was unwilling to back down and the incident only increased her legendary resolve, but now she walked alone with very little political support from the New Republic Government."}, {"tag": "h3", "text": "The Confrontation Deepens"}, {"tag": "p", "text": "In the following weeks, deep range reconnaissance efforts by the New Republic into the Cluster revealed that every warship in the lost Black Fleet including the Super Star Destroyer, which had been renamed Pride of Yevetha, was in the hands of the League. The Fifth Battle Group was reinforced with task forces from many other fleets, bringing the fleet up to a level of two complete task forces, which were dispatched to patrol the borders of the Koornacht Cluster closely. The famous Han Solo was temporarily made a commodore and placed in charge of this force. However, on the way to take command of the Fifth, his shuttle was yanked out of hyperspace by a Yevethan Immobilizer 418 cruiser and he was brought before Nil Spaar on N'zoth."}, {"tag": "p", "text": "When word of this reached Organa Solo, one of her strongest remaining allies in the government, Senator Doman Beruss of Illodia presented a Vote of No Confidence to the New Republic Senate, with Borsk Fey'lya eagerly whipping up votes to support him as interim Chief of State. With her husband a captive of the enemy, some senators thought that the Chief of State would sacrifice the lives of countless Defense Force personnel in a campaign to rescue him while others believed that Organa Solo should be replaced with someone else."}, {"tag": "p", "text": "Despite this loss, with the encouragement of retired Chief of State Mon Mothma, Leia refused to back her stance on the Dushkan League and also refused to send in her brother Jedi Master Luke Skywalker and his Jedi on a mission to rescue Han and infiltrate the Dushkan League's territory."}, {"tag": "p", "text": "Meanwhile, on N'zoth, Han rejected an offer by Nil Spaar to convince his wife to back her stance on the Yevetha. Spaar warned Solo that the New Republic would fall to the fanatical Dushkan League and that his people would never ever surrender and that they would fight even to the last. Han was then moved to a cell onboard the Pride of Yevetha."}, {"tag": "h3", "text": "Black Nine demolished"}, {"tag": "p", "text": "While patrolling the star-dense cluster in Triangle-High Forward formation, Commodore Brand's patrol group discovered the ILC-905 system was being used by the Yevetha as a jump point. In addition, Folna was able to detect two docked starships at the shipyard around Prildaz."}, {"tag": "p", "text": "Indomitable and Vanguard engaged the docked thrustship, but were in turn engaged by another pair protecting the shipyards, Tholos and Rizaron. Vanguard engaged the two thrustships but soon found herself outclassed, unable to breach the advanced shields of the enemy starships. At this point, Indomitable and her bomber wings moved into engage."}, {"tag": "p", "text": "The battle lasted just 11 short minutes. Vanguard succumbed to a brace of enemy fire at the same time she and a flight of K-wings destroyed the lead thrustship, a K-wing of Red Flight, piloted by Esege Tuketu and Skids, got close to the shipyard and were able to find a weak spot in the shield grid to concentrate their firepower, destroying the shields and crippling the shipyards. Indomitable fired her main batteries against the shipyard, completely destroying it and sending the docked freighter thrustship spinning into the planet they were orbiting. Black Nine had been destroyed."}, {"tag": "p", "text": "This engagement proved crucial in the New Republic's campaign against the Yevetha by providing knowledge on how to defeat their advanced deflector shield technology, providing a solid victory against the Yevetha for morale purposes and destroyed a major strategic asset at minimal cost to the New Republic. But while a New Republic victory in the conflict, it further worsened the hostilities between the Dushkan League and the Republic."}, {"tag": "h3", "text": "War Declared"}, {"tag": "p", "text": "In retaliation, Nil Spaar transmitted a private hologram to Organa Solo which showed him brutally assaulting Han Solo for twenty minutes. At the end, Spaar spoke only three words: \"Leave Koornacht now.\" This wound up being the worst tactical decision Spaar ever made: Organa Solo's advisors united against the personal attack and supported a Republic invasion of the Koornacht Cluster. With her advisors at her side, Leia bypassed the Senate and addressed Beruss's petition of no confidence and declared war on the Yevetha by invoking Article Five of the Common Charter. During her speech before the assembled ranks of the Senate, she asked the senators not to forget the thousands killed during the Great Purge and to do something to stop the expanse of the Yevetha. This inspiring speech was given in the annals of modern oratory and received a standing ovation from just about the entire Senate, which had been ready to impeach her only days earlier."}, {"tag": "p", "text": "Luckily for the New Republic, several Wookiees including Chewbacca displayed the courage typical of their species by making a run on the Super Star Destroyer Pride of Yevetha to rescue Han Solo. Covertly aided by Alpha Blue, who had passed on such tidbits as NRI assault plans for an Executor-class Star Dreadnought through various third parties and a member of the White Current, who hid the Falcon from frantically searching fighter craft while Chewbacca and his young son fought their way forward to rescue Han. In the process, the young Wookiee achieved his Right of Passage into adult hood and it was discovered that there were no hostages on board the Super Star Destroyer, the White Current adapt had generated them as an illusion, sacrificing her life for theirs as she refused to leave the ship."}, {"tag": "p", "text": "With full-scale war inevitable, the Fifth Battle Group entered into conflict with the fanatical Yevetha deep in the Koornacht Cluster. The fighting grew fierce but the New Republic would receive help from two surprising sources: the Fallanassi and Camp Pa'aal Squadron—a secret group of surviving Imperials led by Sil Sorannan. Soon, the fight would take place at the Yevethan capital of N'zoth itself."}, {"tag": "p", "text": "The Fallanassi Wialu and Akanah Norand Goss Pell, found by Jedi Master Luke Skywalker, used their powers to generate an illusory \"phantom fleet\" at the Battle of N'zoth which made the New Republic fleet appear larger than it actually was and diverted enemy fire, saving the lives of many New Republic crewbeings. This cut off much of the coordination with other Yevethan warships in the Koornacht Cluster. The Yevethan fleet was severely beaten by the Republic's ships, due mainly to the data gathered by the Republic at the preceding Battle of ILC-905."}, {"tag": "p", "text": "As the Yevetha formed up their fleet, Sil Sorannan and the Camp Pa'aal Squadron used a hidden command override to retake the Imperial vessels in the Yevethan Fleet, including the flagship Pride of Yevetha, which had previously been Intimidator, in the name of the Empire."}, {"tag": "p", "text": "This left the Yevetha without a central fleet and without a leader, for their commander, Nil Spaar, was ejected into an escape pod and stranded in hyperspace by Sorannan. The remaining Yevethan ships refused to surrender, forcing the New Republic fleet to destroy them completely. Losses were heavy for the Republic, as midway through the battle the phantom fleet disappeared as Wialu became fatigued."}, {"tag": "p", "text": "Near the end, the remaining thrustships launched fighters on kamikaze missions, damaging a number of Republic vessels. Despite the heavy losses, which included the Star Destroyer Yakez and a number of smaller ships, the New Republic fleet destroyed the entire Yevethan fleet present at the battle, ending the Black Fleet Crisis."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The conflict concluded with a Yevethan loss at the Battle of N'zoth and the death of Nil Spaar at the hands of Sil Sorannan. A victorious New Republic disarmed the Yevetha and kept them under close watch. It is unclear how long the New Republic's close watch of the Yevetha continued, but active patrols were removed by at least 25 ABY. However, no one actually entered the N'zoth system in that decade, during which the Yevetha built up an even larger force than the Black Fleet, consisting of thousands of Aramadia-class thrustships."}, {"tag": "p", "text": "It was then that the Galantos Guard encountered the Yuuzhan Vong. In exchange for what the Galantos believed to be protection from the extragalactic invaders, they informed the Yuuzhan Vong of the brutal Yevetha and the threat they may pose. Taking heed, the Yuuzhan Vong invaded the N'zoth system. The details of the battle may never be known, but if the Yevethan and Yuuzhan Vong tactics say anything, the Yuuzhan Vong destroyed every single ship in the system, and unleashed a horrible orbital bombardment on N'zoth that rendered the planet a molten wasteland. At the end of the conflict the Yevetha were either extinct or severely endangered."}, {"tag": "p", "text": "Historians would compare the Black Fleet Crisis to the Stenax Massacres and note similarities between the two conflicts."}, {"tag": "h2", "text": "Battles"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}