{"url": "Black_Heth", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Black Heth"}, {"tag": "p", "text": "The Black Heth were a common Coruscant street gang that the Jin'ha used as a front in 32 BBY. According to Mace Windu, the Black Heth were considered petty criminals, and were known to terrorize innocent civilians around Elcor Station."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Black Heth was a violent criminal gang on Coruscant. Several weeks prior to 32 BBY, while still training under Qui-Gon Jinn, Padawan Obi-Wan Kenobi was dispatched as part of his ongoing training to gather information regarding the increase of gang activity in Coruscant's underlevels. He tracked a Trandoshan leader of the Black Heth to a hovertrain in Elcor Station where he defeated the gangster. Afterward, Kenobi was sent to rescue an undercover informant inside the criminal organization. Kenobi worked his way down from atop an unfinished building until he reached the level where the informant was being kept. Though he was swarmed by thugs of varying species, (Gran, Trandoshan, Aqualish, and even Kubaz) he was ultimately victorious. Afterward, the informant revealed that the Black Heth were in league with another group known as the Jin'ha, who were encouraging the gangs of Coruscant to violence, hoping that it would prove a distraction to the Jedi Order. When Kenobi went to the location where the Black Heth were receiving weapons from the Jin'ha, he was attacked by group of Black Heth gang members. After defeating them, he was attacked by Jin'ha warriors, whom he also defeated. Kenobi also encountered E4 baron droids during the investigation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Black Heth appears in the 2001 video game, Star Wars: Obi-Wan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}