{"url": "Black_Krrsantan", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Bounty hunters", "Category:Chelli Lona Aphra's crew", "Category:Desilijic servants", "Category:Gladiators", "Category:Kashyyyk residents", "Category:Males", "Category:Pilots", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Black Krrsantan"}, {"tag": "p", "text": "Black Krrsantan, nicknamed \"Santy,\" \"BK,\" or \"Black K\" by Doctor Aphra, was a male Wookiee bounty hunter during the Galactic Civil War. Originally captured from his homeworld Kashyyyk and trained by the infamous Xonti Brothers as a gladiator, Krrsantan later became a ferocious bounty hunter. He was a regularly hired by the crime lord Jabba the Hutt and at one point, was hired by Darth Vader to track down and capture an agent of the Emperor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Trained to be a gladiator"}, {"tag": "p", "text": "Early in his life, Black Krrsantan disgraced his people. Krrsantan was keen to flee Kashyyyk because of this and he learned that an acquisition crew, that captured aliens for the Xonti Brothers, was coming to Kashyyyk. Krrsantan set a trap for them by leaving an unconscious Wookiee as a bait. When the five Trandoshans took the bait, Krrsantan opened fired on them, killing one of the slavers. The others opened fire and Krrsantan gunned down two more of them, pinning down the last two, Noka and Kootan. Kootan attempted to kill Krrsantan when the Wookiee swung at him and threw him into a tree, killing the Trandoshan on impact. Krrsantan stood over Noka and ordered the slaver to take him to the Xonti Brothers. Noka put him with the other four aliens he had captured, a Talz, a Herglic, a Gamorrean and a Dowutin."}, {"tag": "p", "text": "Noka took them to the Xonti Brothers, who were surprised the Wookiee had volunteered. Krrsantan soon realized he chose wrong when they put him through harsh training against his will to be a gladiator. The five candidates were pushed and pushed and the Xonti Brothers started picking them off. The Talz fell first to a sarlacc. Then the Gamorrean was killed by a large monster. The Herglic fell later to a swarm of robotic insects. This left Krrsantan and the Dowutin. The Xonti Brothers altered the Wookiee's knuckles by filling them with metal to make them better when punching. Krrsantan tested it on the Dowutin and knocked it unconscious in one punch. He was then auctioned to the highest bidder. Krrsantan swore to affect the Xonti Brothers in the same way they had affected him."}, {"tag": "h3", "text": "Working for Jabba the Hutt"}, {"tag": "h4", "text": "Tracking Kenobi"}, {"tag": "p", "text": "Sometime later, Krrsantan became a bounty hunter for the crime lord Jabba the Hutt who resided on the desert planet Tatooine. In 10 BBY, Krrsantan was hired by Jabba to track down the man who stopped his water tax. He went to the location of the attack in the Dune Sea with Pagetti Rook and a Klatooinian guard. Krrsantan went to the moisture farm nearby and took Owen Lars hostage. Krrsantan then made Lars scream. He then saw the man, \"Ben\" Kenobi appear behind him. He was given a chance to leave by Kenobi. Krrsantan fought Kenobi, choking him and trapping him with a stun net. Lars fought back against Krrsantan but was easily knocked aside. Kenobi used the Force to cause rocks to hit Krrsantan and save Lars from falling. He then tried to kill Kenobi with a rock. Krrsantan was briefly blinded and scarred by Kenobi's lightsaber. He tried to shoot Kenobi with his electrified net gun, but it was destroyed. Krrsantan then punched and tried to kill Kenobi, as Kenobi attempted to rescue Lars. He continued trying to kill him with his bowcaster until he fell off the side of a cliff. Krrsantan then fled Tatooine, knowing that Jabba would be incensed at his failure."}, {"tag": "h4", "text": "Hired by Vader"}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Darth Vader traveled to Tatooine on a mission to negotiate on behalf of the Galactic Empire for supplies with Jabba. Vader also used the opportunity to take on a personal mission, and he requested two bounty hunters from Jabba. The Hutt provided his two best bounty hunters, Krrsantan and Boba Fett. While Fett was to track down Luke Skywalker, the Rebel who destroyed the Death Star and who was secretly Vader's son, Krrsantan was hired to find and capture an agent of the Emperor. Vader wanted this agent, whose identity and purpose Darth Sidious did not reveal to the Dark Lord, in order to find out why he was working for the Emperor."}, {"tag": "p", "text": "Krrsantan successfully tracked down Cylo and discovered that he was moving illegal alien parts to a secret base in the Outer Rim. The agent discovered Krrsantan was following him before he could find out where the base was or what he was doing for the Emperor. Krrsantan captured the agent and brought him to Vader aboard his Nubian starship, where he witnessed the agent, whose named was Cylo-IV, being killed by Vader's new torture droid, 0-0-0, but not before providing the information Krrsantan had previously failed to acquire."}, {"tag": "h3", "text": "Working for Aphra"}, {"tag": "p", "text": "Sometime after his contract for Vader expired, Krrsantan was summoned along with fellow bounty hunters Bossk, IG-90 and Beebox to a cantina on Son-tuul where, as he waited for his fellows, Krrsantan entered the cantina's fighting pits, where captured Wookiees fought each other for the entertainment of the customers. Krrsantan strangled a fighter and took his place to become a contestant, becoming one of the only Wookiees to enter the pits willingly. The Wookiee bounty hunter won the fight by beating his opponent to death."}, {"tag": "h4", "text": "Heist at Son-tuul"}, {"tag": "p", "text": "After the fight, Krrsantan joined Beebox, Bossk and IG-90 in the cantina where they were approached by rogue archaeologist Aphra, who had issued the summons. She told the assembled bounty hunters about her plans for a heist: the Empire had just broken the criminal element known as the Son-tuul Pride, which dominated Son-tuul's underworld. The fortune they had hoarded was in transit to the Imperial vaults. Aphra told the bounty hunters that she had inside information which would allow them to locate the transport, circumvent the guards and get away, and that she was offering them a part in exchange for their services."}, {"tag": "p", "text": "Krrsantan then piloted his ship during Aphra's robbery near Anthan Prime. There, Krrsantan was able to use an asteroid to penetrate the Arquitens-class light cruiser's hull. He and the others gathered what remained of the credits aboard the cruiser. He and Aphra used the ship to collect the credits floating in space. He went with Aphra to Anthan 13 where they met with Lord Vader for information on the people who cut him up."}, {"tag": "h4", "text": "Battle of Vrogas Vas"}, {"tag": "p", "text": "Krrsantan then went to Vrogas Vas, where he attacked the Millennium Falcon by colliding with the ship, grounding it. He then attempted to capture Skywalker, but was instead assaulted by Chewbacca, who had been recently poisoned by Triple-Zero and so could not best Krrsantan. However, Chewie was then shot with a needle by R2-D2 to counteract the poison, and Krrsantan was knocked down by Chewbacca. However, Krrsantan was able to knock Chewbacca out with brass knuckles. He then confronted Solo. After defeating Chewbacca, Krrsantan then grabbed Solo. However, a damaged C-3PO told him to stop his fighting. Krrsantan was then accidentally electrocuted by Threepio after punching him with the brass knuckles."}, {"tag": "h4", "text": "Shu-Torun War"}, {"tag": "p", "text": "Krrsantan survived the battle. He and several other bounty hunters were secretly hired by Vader to find Aphra; dead or alive. He then met up with Vader on Anthan 13 with a squad of commando droids."}, {"tag": "h4", "text": "Reuniting with Aphra"}, {"tag": "p", "text": "Krrsantan, along with 0-0-0 and BT-1 then went to Cosmatanic Steppes to retrieve Aphra. He then took her to Lord Vader's new flagship, the Executor. He then fought alongside Aphra and her droids against Cylo's forces. Krrsantan stayed with Aphra because she owed him money. After Vader retook the Executor and jettisoned Aphra into space, Krrsantan then rescued her from the vacuum of space."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Black Krrsantan was a male Wookiee. He had black hair and brown eyes, with decorative gold material covering his chest, as well as gold ornaments in his hair. He had a scar across his left eye. He disgraced his people on Kashyyyk, prompting him to get off world. When he first heard of the Xonti Brothers, Krrsantan did not hesitate to try and get to them, going as far as killing most of a Trandoshan acquisition crew to get to them. The last Trandoshan, Noka, was surprised of Krrsantan's willingness to join. However, Krrsantan soon found out what he really signed up for and after harsh training as a gladiator, he swore a life debt on the Xonti Brothers, a pledge to affect them in the same way they had affected him. Krrsantan eventually saw the Xonti Brothers again during the auction of Rur, where he attempted to capture them. After the Auction ended in the deaths of many members, Krrsantan used it as his chance to capture the Xonti Brothers and he did, taking them back to their gladiatorial pits to fulfill the life debt."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Black Krrsantan was harshly trained as a gladiator by the Xonti Brothers. It gave him exceptional skill in fighting, even though before he managed to take out most of a Trandoshan acquisition crew. According to Boba Fett, Black Krrsantan was one of Jabba's best bounty hunters. The Wookiee had the ability to wield a bowcaster. He was good fighter even against his fellow Wookiees, such as Chewbacca. He would also use brass knuckles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}