{"url": "Black_One", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Resistance starships", "Category:T-70 X-wing fighters"], "nodes": [{"tag": "h1", "text": "Black One"}, {"tag": "p", "text": "The Black One was a T-70 X-wing starfighter that was used by Resistance pilot Poe Dameron. Dameron was usually accompanied by his trusty co-pilot, the spherical astromech droid BB-8."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Black One was a T-70 X-wing starfighter manufactured by the Incom-FreiTek Corporation. Like all T-70 X-wing fighters, Black One was armed with four Taim & Bak KX12 laser cannons.Black One was also equipped with Ferrosphere Paint which was used to jam enemy missile locks."}, {"tag": "p", "text": "For the evacuation of D'Qar, it was equipped with an Overdrive Thruster."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Resistance pilot Poe Dameron used the X-wing during the Cold War with the First Order. During missions with Black Squadron the fighter became damaged several times: in the battle over a desert planet Dameron crash-landed Black One, therefore placing it out of commission for several missions until it was repaired by BB-8 and Ivee. When First Order Commander Malarus stole the fighter during the mission to Cato Neimoidia, BB-8 saw himself forced to crash-land Black One again to stop the enemy officer in the cockpit. While the fighter was being repaired onboard the Raddus and on D'Qar, Dameron flew a standard T-70. BB-8 eventually incorporated one of the processor units of the destroyed Ivee into the fighter."}, {"tag": "p", "text": "Dameron flew it during the Battle of Takodana and the Battle of Starkiller Base, where he used it to destroy the First Order's superweapon, Starkiller Base. Black One saw action during the Evacuation of D'Qar where he destroyed the Fulminatrix's defense turrets to clear a path for the Resistance bombers."}, {"tag": "p", "text": "Black One was destroyed by Kylo Ren during the attack on the Resistance fleet when he launched torpedoes into the starboard hangar of the Raddus from his TIE silencer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Black One appears in the 2015 saga film Star Wars: Episode VII The Force Awakens. It was later destroyed in the 2017 sequel Star Wars: Episode VIII The Last Jedi."}, {"tag": "p", "text": "In Poe Dameron 15, 18 and 19 Black One is mistakenly depicted as the X-wing Dameron uses."}, {"tag": "p", "text": "The queue for the ride Star Wars: Rise of the Resistance features an X-wing flown by Poe with the same color scheme as Black One, despite the ride being set after The Last Jedi. Though this was originally thought to be a continuity error, the X-wing is in fact meant to be a different craft with the same paint scheme as Black One."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}