{"url": "Black_Spire_Outpost_Market", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Batuu locations"], "nodes": [{"tag": "h1", "text": "Black Spire Outpost Market"}, {"tag": "p", "text": "The Black Spire Outpost Market was located in Black Spire Outpost on the Outer Rim planet Batuu. Merchants located within the Market included Black Spire Outfitters, Creature Stall, The Jewels of Bith, Toydarian Toymaker, and The Wooden Wookiee. Kat Saka's Kettle and Ronto Roasters were eateries."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Black Spire Outpost Market was an avenue on the Outer Rim planet of Batuu, located within the boundaries of Black Spire Outpost. The street was partially covered with tarps, latticework, and wires strung overhead. Local Batuuans lived in the upper levels, while the lower levels housed local shops, including Black Spire Outfitters, The Jewels of Bith, Toydarian Toymaker, and The Wooden Wookiee. Visitors to the area could also purchase a variety of pets or other small animals from the Creature Stall. The quick-service restaurant Ronto Roasters operated next door to the snackfood stand Kat Saka's Kettle."}, {"tag": "p", "text": "Water dispensers throughout the Market provided refreshment to visitors, who were often surprised to learn that the plumbing housed Tiny the dianoga. The Black Spire Outpost Obelisk served as a local landmark at the entrance to the Market."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 34 ABY, Remex Io of the Kendoh Gang once ran through the marketplace trying to evade members of the 709th Legion when they learned of his presence via a tip. Io narrowly evaded them by sending them on a wild bantha chase to the Batuu spaceport, although he ended up ambushed and threatened by Varg shortly afterward."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Market was first seen on one of a set of trading cards available at Disney's December 16, 2017 \"Galactic Nights\" session, which covered locations for the upcoming Star Wars: Galaxy's Edge attraction.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}