{"url": "Black_Sun", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Black Sun", "Category:Criminal syndicates and cartels", "Category:Shadow Collective organizations"], "nodes": [{"tag": "h1", "text": "Black Sun"}, {"tag": "p", "text": "Black Sun was a criminal syndicate that came into prominence during the Clone Wars as the Jedi Order focused more on military affairs and less on law enforcement. Black Sun was allied with the Shadow Collective and its leader, the renegade Sith Lord Maul. The syndicate maintained bases on Mustafar and Ord Mantell and had many of the Falleen species as members."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the syndicate was very influential throughout the galaxy and run by a group of Falleen noblemen from a fortress on Mustafar. One of its' members was Ziro the Hutt. During the war, Black Sun was coerced by the former Sith Lord Maul into joining his Shadow Collective after his brother Savage Opress killed their leader, Xomit Grunseit. Black Sun openly maintained a base on Ord Mantell."}, {"tag": "p", "text": "Under direction of the Shadow Collective, Black Sun and the Pyke Syndicate participated in the large Battle of Ord Mantell, defending against Separatist attackers led by Count Dooku and Grievous."}, {"tag": "p", "text": "Towards the end of the Clone Wars, Black Sun's leader Ziton Moj proposed merging with the Pyke Syndicate, which specialized in distributing illegal narcotics. When the Pyke leader Marg Krim rejected his demands, Moj retaliated by kidnapping his family in order to force Krim to change his mind. Krim then hired two independent bounty hunters—the former Sith apprentice Asajj Ventress and the undercover Jedi Master Quinlan Vos—to rescue his family. The two bounty hunters raided the Black Sun fortress on Mustafar and succeeded in rescuing Krim's family. During the rescue mission, Moj and his Falleen guards were assaulted by Ventress and Vos. Black Sun retaliated by sending a fleet to attack the Pyke stronghold of Oba Diah."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "After Palpatine transformed the Republic into his own Galactic Empire at the end of the Clone Wars, Black Sun formed a durable relationship with the new autocratic government and kept watch over the Outer Rim. A year after the establishment of the Empire, Black Sun took notice of pilot Ahsoka Tano—although they only knew her by her alias of \"Ashla\" and did not know she was a former Padawan—after she intruded in their sentient trafficking, as the secret Force-sensitive had taken to helping the people of the Outer Rim. Learning that \"Ashla\" had been hired by the Fardi clan, Black Sun knew they could pay her more than the smaller group, though they also wanted her to work to make back the thousands of credits she had cost them. Thus, Black Sun ordered their agents to either hire or kill the pilot. When one Black Sun agent found her on an Outer Rim planet, Tano rejected their job offer, escaping aboard her light freighter as the agent fired on her."}, {"tag": "p", "text": "Using their sleek starship, the agent pursued Tano, even as she concurrently realized her encounter with the agent had helped clear her mind of doubts. Tano and the agent's dogfight was interrupted by Chardri Tage's starship, having been sent by Senator Bail Prestor Organa to locate Tano, and the agent elected to escape instead of attack the larger craft. After boarding Tage's ship and reuniting with astromech droid R2-D2, Tano rested aboard her ship when she arranged for it to float above a nameless moon that orbited the planet she had fought the agent on; even though she figured the agent would be repairing their ship, she was certain they were not hiding where she was."}, {"tag": "p", "text": "During the Age of the Empire, Black Sun owned a Pantolomin cruiser. At one point, Duke Blazor of the Black Sun expected money from the Gatto Gang, leading to him hiring bounty hunter IG-88B. The former Imperial cadets Sabine Wren and Ketsu Onyo decided to join Black Sun as bounty hunters. However, Ketsu got \"greedy,\" left her former classmate for dead, and joined Black Sun by herself. Years later, Ketsu accepted a Black Sun job to collect a GNK-series power droid called EG-86, which was carrying information vital to the rebellion. This mission brought her into conflict with Sabine, who despised Black Sun for engaging in slave trafficking. However, the two former classmates reconciled and joined forces to escape the Empire and to deliver the droid to the Rebellion."}, {"tag": "p", "text": "Between 3 ABY and 4 ABY, the crime syndicate Crimson Dawn returned after a long absence and sent out a message to various criminal factions in the underworld. In the message, the syndicate's current leader Lady Qi'ra invited the other syndicates to join in an auction for the carbonite encased Han Solo. Black Sun answered the call and arrived at the planet Jekara, where one of their ships was hit by the Millennium Falcon. In response, Black Sun sent out their fighters to destroy the ship, though it managed to evade them and crashed onto the planet below. Gyuti, a Boss in Black Sun then entered the Vermillion along with Xet and a few other Falleen. Black Sun bid for Solo during the auction, but they were quickly stifled by a mind trick done unto them by Imperial Sub-Administrator Sly Moore. The auction was won by Jabba Desilijic Tiure of the Grand Hutt Council, but his victory was short-lived as it was interrupted by the arrival of Darth Vader. Guarded by two death troopers, the Sith Lord declared that Solo belonged to him."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "At the time of the New Republic's founding, Black Sun was one of several major crime syndicates operating in the Outer Rim. In 5 ABY, the Black Sun Boss Gyuti placed a bounty on the head of the Zabrak bounty hunter Jas Emari for debts incurred by her aunt Sugi. Underboss Rynscar and her henchmen ambushed Jas and Sugi while they were visiting Nar Shaddaa for information on Han Solo's whereabouts. Jas managed to convince Rynscar not to turn her in by offering to repay them double the amount she owed. Rysncar also provided Jas with information about Han Solo's whereabouts."}, {"tag": "p", "text": "Shortly before the Battle of Jakku, the bounty hunter Mercurial Swift decided to collect Gyuti's bounty on Emari's head in retaliation for her role in ambushing him on the planet Taris. Later, Black Sun conspired with the upstart Red Key Raiders to prolong the Galactic Civil War. They bribed and blackmailed five New Republic Senators Ashmin Ek, Dor Wieedo, Rethalow, Grelka Sorka, and Nim Tar into opposing Chancellor Mon Mothma's resolution to send New Republic Defense Force forces to the Inner Rim world of Jakku, where the Galactic Empire had retreated to. Their plot was foiled by a team led by Sinjir Rath Velus and Han Solo, who managed to rescue Nim Tar's child and convince the senators to change their votes in return for pardons and political favors."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "A major criminal power, Black Sun dealt in illegal ventures like sentient-trafficking. While that activity was considered awful by others, members of Black Sun simply called it a \"business venture.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Black Sun first appeared in the now-Star Wars Legends multimedia project Star Wars: Shadows of the Empire, released in 1996 as a novel, comic book, video game, and more. During the development of \"Eminence,\" the fourteenth episode of the fifth season of Star Wars: The Clone Wars, it was decided that Maul would be given a base of power within the criminal underworld. Dave Filoni, the show's supervising director, had remembered Black Sun from Shadows of the Empire, and knew that the Expanded Universe showed Maul as having fought against Black Sun prior to the events of Star Wars: Episode I The Phantom Menace. With that, Filoni and his team opted to bring Black Sun into the show."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}