{"url": "Black_Sun/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Black Sun", "Category:Criminal syndicates and cartels", "Category:Shadow Collective organizations"], "nodes": [{"tag": "h1", "text": "Black Sun"}, {"tag": "p", "text": "Black Sun was the most powerful and infamous crime syndicate of its time in the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Black Sun held a massive amount of reach and influence, extending its tendrils of corruption deep in the various galactic governments of each era. It was infamous for its involvement in piracy and smuggling. But smuggling was just the tip of the iceberg of the galaxy-wide organization. It was involved in every known type of illegal activity; its information networks surpassed even the accuracy and scope of Imperial Intelligence. The resources available to Black Sun rivaled those belonging to a large planetary army, including foot soldiers."}, {"tag": "p", "text": "Below the leader of Black Sun were nine Vigos (Old Tionese for \"nephew\"). Each Vigo ruled over his or her own territory and sector."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "Black Sun was formed at the end of the Great Galactic War. After the Sacking of Coruscant in 3653 BBY, Galactic City soon fell into chaos and rioting, overwhelming the already stretched thin Coruscant Security Force police officers. Taking advantage of the situation, several prominent gangsters joined together and began seizing control of neighborhoods in the lower levels. With this, in reference to the gangsters, denizens of the lower levels coined the phrase \"better a black sun than none\" and the Black Sun crime syndicate was born. Black Sun quickly carved out a territory for itself and developed spice and weapons trafficking operations. Though their advance to claim more sectors was halted by the Justicars' Brigade, the rioting and looting never stopped within their own territory. In the following years of the Cold War, Black Sun's influence stretched beyond Coruscant and the gang became a galactic criminal syndicate. The Galactic Senate soon came to realize the full situation and CSF forces such as the Special Tactical Unit began actively fighting back to regain the sectors under Black Sun's control. It was during this time that the Republic Strategic Information Service began joint operations with the CSF and Republic Military to counter Black Sun. SIS Agent Theron Shan tracked a small cell of criminals consisting of Teff'ith and others on Coruscant in an effort to discover who was funding the Black Sun slavery ring."}, {"tag": "p", "text": "Around this time, the syndicate began acquiring materials to create disruptor rifles. An individual dispatched an associate of theirs to fake a trade to expose Black Sun's dealers."}, {"tag": "h3", "text": "Late Republic era"}, {"tag": "p", "text": "Although headquartered on Coruscant, the influence of the Black Sun stretched the length of the galaxy. With tens of thousands of foot soldiers and hundreds of leaders based on safe houses and fortresses across the galaxy, the syndicate was both covertly and openly a force to be reckoned with on a galactic scale. By 33 BBY, Black Sun had come under the control of Alexi Garyn, who was killed by Darth Maul on Lord Sidious's orders. Other Vigos fell to the Sith Lord's lightsaber as well, and the organization was severely damaged in accordance with Sidious's plan. It would be about a decade before it had recuperated."}, {"tag": "p", "text": "During the Clone Wars, Black Sun exploited the Republic's focus on the war to drastically expand its activities. At that time, a faction of the syndicate was controlled by a cabal of Falleen nobles under Xomit Grunseit, headquartered on Mustafar. After Savage Opress murdered Grunseit and his ruling council, Ziton Moj assumed control of the faction and pledged allegiance to Darth Maul, the very man who had almost destroyed the syndicate thirteen years prior. Once in the Shadow Collective, Death Watch moved Black Sun's Mustafar weapon stores and equipment to their camp on Zanbar in preparation for the planned attack on Sundari. The armed forces commanded by Moj were deemed inefficient for a direct attack, however, and so were relocated to Zanbar until a sufficient force had been assembled. After the Pyke Syndicate heard that Death Watch and Black Sun were building an army, Lom Pyke quickly moved to join the Collective. The last to join were the leaders of the Hutt Cartel."}, {"tag": "p", "text": "Black Sun and Pyke forces (led by Moj and Lom respectively) smuggled themselves into Sundari in crates and launched an attack in the docks as part of an elaborate plan to take the city. Pre Vizsla and his Death Watch warriors faced off against them in a sham conflict which ended with the criminals displayed in cuffs before the New Mandalorian crowds in the Royal Palace. The support of the people allowed Vizsla to oust Duchess Satine Kryze in a quick and bloodless coup."}, {"tag": "p", "text": "During the war, Black Sun dealt extensively with the plant bota, found only on the planet Drongar. Originally, Admiral Tarnese Bleyd was the main contact with Filba the Hutt for the smuggling. He was later assassinated by Kaird, a Nediji, following the death of the former operative Mathal. Another partnership was later established with Thula and Squa Tront to secure the bota. Upon learning that the bota was losing its potency, Kaird escaped from Drongar with a supply as a gift for his Vigos; it was subsequently discovered that the case was filled with explosives, in attempt at betrayal by Thula and Tront."}, {"tag": "p", "text": "Following the war, Pistoeka sabotage droids were acquired by Black Sun, which utilized them in chop shops on Nar Shaddaa."}, {"tag": "p", "text": "Black Sun was known to have several hideouts in remote, scarcely populated planets of the Outer Rim Territories."}, {"tag": "h3", "text": "Humiliation at Tansarii Point Station"}, {"tag": "p", "text": "Black Sun had an interest in Tansarii Point Station. In 1 ABY, they had placed three bases of operations near Ord Mantell, the Salient Trinity, from which they would commit acts of piracy against traders and civilians. A team of Black Sun slicers even managed to infiltrate the station."}, {"tag": "p", "text": "Black Sun's dominance in the system changed with the arrival of an unknown spacer, brought there by Han Solo and Chewbacca. The spacer ended up in the employ of Car'das, who were responsible for law enforcement in and around the station; this proved to have serious consequences for Black Sun."}, {"tag": "p", "text": "The spacer was involved in an operation that successfully removed the threat from the slicers and would also fight against the local Black Sun pirates in the Battle of Tansarii Point Station, in which all of the Black Sun commanders in the system were killed and most of the local Black Sun wing destroyed. As a result of the battle, the Black Sun presence in the system diminished drastically and their influence disappeared totally."}, {"tag": "p", "text": "Shortly after, the Black Sun dispatched a heavy freighter and a X4 Gunship to exfiltrate Jabba the Hutt's fugitive droid RA-316 from the Tatooine system. However, the mission failed and all ships were destroyed by Jabba's pilots."}, {"tag": "p", "text": "Later, Black Sun tried to regain some influence in the Bright Jewel system, by attempting to purchase the Imperial-class Star Destroyer Blackguard off a rogue Imperial Captain, called Andal Sait."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the early days of the Galactic Empire, Black Sun was led by Dal Perhi, though his mantle was soon usurped by a Black Sun Vigo named Xizor. The Falleen crimelord would lead Black Sun to unparalleled prestige by the onset of the Galactic Civil War. Assisting Prince Xizor was the feminine Human replica droid, Guri. Guri acted as bodyguard and assassin for the Falleen Prince. Under Xizor's leadership, Black Sun became so powerful that the Prince was considered by some Coruscant courtiers to be surpassed in power only by Emperor Palpatine and Darth Vader. Black Sun's influence was tremendous. They had a practically limitless amount of credits; more than enough to finance any operation they wished to complete. They ruled the underworld and few individuals or organizations dared to cross them or pose a threat to them."}, {"tag": "h3", "text": "The Zann Consortium"}, {"tag": "p", "text": "Xizor also dealt with a rival criminal organization, the Zann Consortium. In 3 ABY, Xizor hired Tyber Zann, leader of the Consortium, to steal tibanna gas from a mining facility on Bespin. In actuality, Xizor had laid a trap to dispose of Zann. Knowing Vader had recently subjugated the planet and Cloud City, he hoped the Dark Lord would intercede and eliminate his competitor. Instead, the move backfired on Xizor. Zann betrayed Xizor by planting evidence that pointed responsibility for the theft towards Black Sun. Vader quickly learned of this, furthering the rift between himself and Xizor."}, {"tag": "h3", "text": "3 ABY"}, {"tag": "p", "text": "Xizor had a personal reason to hate Vader: after an accident at a biological weapons laboratory on Xizor's homeworld Falleen in 7 BBY, the Sith Lord ordered the area and all of the contaminated Falleen to be \"sterilized.\" The entire area and all living within—some 200,000 Falleen, including Xizor's family—were obliterated to prevent the spread of the deadly disease. It was a small price to pay for what could potentially have been, according to Vader, a planet-killing outbreak. Xizor deleted all records of his family's deaths to hide any apparent motives for a grudge against Vader. When Xizor learned that Luke Skywalker was the son of Vader, he planned to kill Skywalker, hoping to permanently discredit Vader in the eyes of the Emperor."}, {"tag": "p", "text": "By the Battle of Hoth, Xizor had found himself and his organization in close dealings with the Emperor. As part of a grand scheme to ultimately destroy the Rebellion and corrupt Luke Skywalker, Palpatine made good use of Xizor's legitimate enterprise, Xizor Transport Systems. XTS would contract 300 ships to the Empire to help transport construction material to the Death Star II construction site over the Sanctuary Moon of Endor. Palpatine's desire to involve Black Sun in his most personal orchestrations was to use the organization as a pawn to plant the secret construction plans to the second Death Star into the hands of the Alliance. Trusting Black Sun, the Alliance would believe that the plans they acquired were legitimate."}, {"tag": "p", "text": "Shortly before the Battle of Endor, Ororo Transportation tried to usurp control of spice operations in the Bajic sector, controlled by the Tenloss Crime Syndicate, an organization in league with Black Sun. In a move both to cripple Ororo and improve his stock with the Emperor, Xizor informed the Empire of an Ororo-owned shipyard in the Vergesso Asteroids being used by the Rebellion as a repair dock. The Empire, under the personal command of Vader, quickly destroyed the shipyard and the majority of Rebel forces there; simultaneously, Xizor personally dispatched Guri to assassinate the leaders of Ororo. In addition, Ace Azzameen and Emon Azzameen also planted a listening device, and got a Black Sun insignia for their troubles, to which the former would place at his room as part of his collection."}, {"tag": "p", "text": "When Vader finally had evidence of Xizor's attempt to kill Skywalker, he confronted him in orbit over Coruscant. In his personal flagship Executor, Vader destroyed Xizor's personal skyhook, Falleen's Fist, with Xizor aboard. Additionally, Xizor's castle had been destroyed by Skywalker, Leia Organa, Chewbacca, Dash Rendar, and Lando Calrissian. The loss of its leader and so much of its infrastructure crippled Black Sun to such an extent that it would not recover for nearly twenty years."}, {"tag": "h3", "text": "New Republic and beyond"}, {"tag": "p", "text": "Several attempts to restore the power of the syndicate were made, including one by Xizor's niece Savan and one by the Jeodu Dequc, who termed his enterprise \"Black Nebula.\""}, {"tag": "p", "text": "In 6 ABY, as part of the New Republic's attempt to liberate Coruscant, sixteen of the galaxy's most notorious criminals were released from the prison colony on Kessel in order to cause disruptions that were intended to allow infiltration by New Republic agents, including the members of Rogue Squadron. This tactic backfired, as the released prisoners (including Zekka Thyne and former Moff Fliry Vorru) went on to successfully resurrect Black Sun."}, {"tag": "p", "text": "By the time of the Thrawn crisis and the return of Palpatine, Black Sun was headed by Y'ull Acib. Working with Grappa the Hutt, he attempted to take control of the Imperial Interim Ruling Council, to no avail."}, {"tag": "p", "text": "In 24 ABY, Czethros attempted to bring back the criminal syndicate to its former glory and to dominate the galaxy. He planned to take over by sending spies and operatives in the most key points in it, and sending them out all at once. He sent them in many places including Cloud City, Ord Mantell, Anobis, Kessel, and Crystal Reef. In their failed Kessel uprising, the New Jedi Order retrieved Czethros and the signal he planned to send. The New Republic, then one at a time, warned the locals, sent the signal to a planet, and arrested thousands of Black Sun agents across the galaxy and effectively destroyed the organization."}, {"tag": "p", "text": "In 43 ABY, the New Jedi Order collected clues about a reorganization of the organization."}, {"tag": "h3", "text": "Darth Krayt's Galactic Empire"}, {"tag": "p", "text": "By the time of the Sith–Imperial War and the Second Imperial Civil War, Black Sun was active again,\nwith its structure unchanged over the centuries. However, the organization had abandoned its former secrecy and now openly displayed its symbol on ships and stations to intimidate rivals and victims. It was dealing in illegal Yuuzhan Vong weapons, extortion and was particularly active in the Outer Rim, where it was responsible for attacks on Imperial convoys."}, {"tag": "h2", "text": "Ships"}, {"tag": "h3", "text": "Space stations"}, {"tag": "h3", "text": "Capital ships"}, {"tag": "h3", "text": "Support ships"}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h2", "text": "Vehicles"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name of Black Sun came from an earlier Steve Perry book where it was the name of a mafia-type organization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}