{"url": "61st_Mobile_Infantry", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:61st Mobile Infantry personnel", "Category:Alliance to Restore the Republic companies", "Category:New Republic military units"], "nodes": [{"tag": "h1", "text": "61st Mobile Infantry"}, {"tag": "p", "text": "The 61st Mobile Infantry, also referred to as the 61st or Twilight Company was a military unit that served the Alliance to Restore the Republic under the command of Captain Micha Evon, Howl, during the Galactic Civil War against the Galactic Empire. Their headquarters was the CR90 corvette Thunderstrike, which was escorted by the Braha'tok-class gunship Apailana's Promise, which carried the company's two X-wings. The soldiers of Twilight Company fought against the forces of the Galactic Empire before and during the Galactic Civil War."}, {"tag": "p", "text": "During the Mid Rim Retreat Twilight Company battled on various planets to distract Imperial forces and allow the Alliance Fleet to gradually withdraw from the Mid Rim. When the company attacked the Haidoral Prime, the planet's governor, Everi Chalis, chose to defect to them. She offered to support Twilight Company with information that could help slowly cripple the \"Imperial war machine.\" During the Coyerti campaign, she gave them information on a distillery on the planet of which First Sergeant Hazram Namir and his squad destroyed."}, {"tag": "p", "text": "Following their departure from Coyerti, Twilight Company was attacked three times by Imperial forces. The Thunderstrike's chief engineer M2-M5 concluded that the corvette was being tracked due to a hyperdrive leak that came about during a run-in attack prior to the Coyerti campaign. To fix this, Twilight Company boarded an Imperial heavy freighter for supplies. The Thunderstrike and Apailana's Promise then rendezvoused with three other battle groups in the Elochar sector while Howl, Chalis, Namir and two others went to Hoth for an Alliance High Command strategy conference. However, the Thunderstrike was infiltrated by Imperial spies, who killed the high ranking officers on the bridge."}, {"tag": "p", "text": "After killing the Imperial spies, Twilight Company escaped the Elochar Sector and hid on Ankhural. Namir and Chalis returned from Hoth, having lost Howl and the other two soldiers in an Imperial attack. The company proceeded to repair their two ships and have a funeral for Howl. In the meantime, Chalis devised Operation Ringbreaker, a campaign targeting a number of Imperial worlds before ultimately attacking Kuat Drive Yards to cripple the Imperial Navy. Leaving Ankhural, Twilight Company began Operation Ringbreaker by attacking Mardona III. The company then continued by fighting the Empire at Najan-Rovi, Obumubo, Nakadia, and several other worlds."}, {"tag": "p", "text": "Twilight Company continued Operation Ringbreaker by capturing the Inyusu Tor mineral processing facility on Sullust. However, before they could be extracted, the Thunderstrike was shot down by a TIE fighter squadron, which . Being stranded on Sullust, Twilight Company set up defense on Inyusu Tor. Namir led mission down to the planet's capital city Pinyumb to find the Sullustan Resistance. Namir was able to meet with them and planned to holdout at Inyusu Tor and help the Sullustans in the city."}, {"tag": "p", "text": "After the Imperial II-class Star Destroyer Herald arrived, the Sullust Imperial garrison attacked Inyusu Tor. The defense, led by Namir held out against these forces and the Apailana's Promise returned to distract the Herald. Chalis, whom disagreed with Namir's decisions in defending the Processing facility, fled and allowed herself to get captured by the Herald in a shuttle, which she had rigged with twenty ion bomb. Detonating the bombs, Chalis effectively reduced the Herald's power, forcing it to retreat. Having defeated the ground forces, Twilight Company helped keep order at Pinyumb, but planned to leave to avoid a harsh Imperial attack."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The 61st Mobile Infantry was a infantry company and battle group that served in the army of the Rebel Alliance against the Galactic Empire and eventually the army its successor the New Republic. In the company's time in the New Republic, it was a part of General Hera Syndulla's Barma Battle Group during the campaign in the Cerberon system. The 61st was formed by Captain Micha Evon during or prior to 0 BBY. The 61st also went by its nickname, Twilight Company. The company's patch read, in aurebesh, \"Twilight survives\" along the top and \"Mobile Infantry\" at the bottom. The patch, despite its branding of the Alliance, was still worn during the time of the New Republic. The rebel troopers of Twilight Company were sorted into squads of four soldiers, which worked as individual teams. Squads were multipurpose, and specialized roles included heavy fire or sniper teams."}, {"tag": "p", "text": "Prior to the Battle of Hoth in 3 ABY, Twilight Company was commanded by Captain Howl, with Lieutenant Sairgon serving as his second-in-command. The naval-captain Commander Paonu was next in line of command, with individuals like Sharn and Chief Medic Von Geiz being after in the rank structure. 3 ABY saw the deaths of Howl, Sairgon, Paonu and the rest of Twilight Company's officers in the space of a day. Following these drastic losses, First Sergeant Hazram Namir took charge tenatively, although Von Geiz and Sharn were next in line. Paonu was replaced by Commander Tohna. Namir also included notable soldiers and squad leaders in his meetings such as Carver, Mzun, and Gadren as they had much experience in battles and leadership."}, {"tag": "p", "text": "When Twilight Company found itself split during its time in the Cerberon system, Carver assumed himself as the unit-commander for those on the planet Troithe whilst Namir and half of the company were stranded on an asteroid."}, {"tag": "h2", "text": "Equipment and vehicles"}, {"tag": "p", "text": "Twilight Company resided on the Thunderstrike, an old CR90 corvette that the company had heavily modified. The Thunderstrike had its own escort, the Braha'tok-class gunship Apailana's Promise, which flew with the corvette during the Galactic Civil War. The smaller gunship also carried two X-wing starfighters on its underbelly. Additionally, Twilight Company, used a number of dropships which deployed troops from the Thunderstrike to their targets and later extracted them. The company also used at least six boarding pods, which used drills to penetrate the hulls of enemy ships to allow troops inside the pods to board."}, {"tag": "p", "text": "During its time in the Cerberon system, Twilight Company was stationed aboard on the Acclamator-class transgalactic military assault ship Lodestar. The company also used juggernauts to transport large numbers of soldiers as well as hovertanks."}, {"tag": "p", "text": "The Soldiers of Twilight Company were usually limited to DLT-20A blaster rifles and had little to no armor on them. The company additionally received equipment when they recruited from local militias. More specialized troopers usually bore sniper rifles, heavy guns or ordinance equipment like the PLX-1 portable missile launcher, nicknamed the Plex. Twilight Company had various plex armed artillery weapons for defense as well, but they were rarely used because Twilight's tactics were typically offensive."}, {"tag": "h2", "text": "Operations"}, {"tag": "p", "text": "Under the philosophy of Howl, Twilight Company's missions were made to win the hearts of the people in order to muster more support for the Alliance. Howl believed this would give the Alliance a better advantage. Most missions Twilight Company endured during the Mid Rim Retreat were ones meant to distract Imperial forces, allowing the Alliance fleet to gradually withdraw from the Mid Rim. When the Imperial Governor Everi Chalis defected to Twilight Company, she advised them with more tactical missions intended to help cripple the Imperial war machine or benefit the company. Chalis's aim for Operation Ringbreaker was to take out the main source of the Empire's Imperial Star Destroyers, the Kuat Drive Yards, which would've crippled the Empire's military had the operation been carried out until the end. However, Namir eventually concluded that the operation contradicted Howl's ideas and overrode Chalis's plan to continue the campaign in favor of one which benefited the population on the planet Sullust."}, {"tag": "h2", "text": "Training and traditions"}, {"tag": "p", "text": "Despite being against Alliance security policy, Twilight Company held recruitment drives on the worlds they fought on known as open recruits. Willing recruits lined up to enlist for the company. Upon recruitment, they were sorted into various roles. Soldiers were trained with a DLT-20A blaster rifle which was modified to prevent the trainee from spraying fire at the Thunderstrike's range. The new recruits were also given a copy of the White Book, the military field guide which the Alliance High Command. Some recruits tried to go by the names of rebel heroes, like Leia Organa, although they earned a different nickname quickly after and most died victims of their enthusiasm."}, {"tag": "p", "text": "When a member of Twilight Company died, their body was typically not recovered. Under Twilight tradition, every fallen member had a simple funeral where the individual running the ceremony, typically Quartermaster Hober, announced the name of the dead comrade and then the individual closest to that comrade gave a one line eulogy of the fallen member. After this, a blaster power pack was always drained into the Thunderstrike's vehicle charging station. The simple ceremony was always broadcast throughout the corvette."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early Campaigns"}, {"tag": "p", "text": "The 61st Mobile Infantry was founded by Captain Micha Evon sometime prior to 0 BBY as a mobile infantry unit of the anti-Imperial military faction known as the Rebel Alliance after he and a number of others were assigned by the Alliance's high command. The 61st eventually gained it's more notorious name, Twilight Company, and Evon soon got the nickname Howl, shortened from \"howling mad.\""}, {"tag": "p", "text": "At some point, Twilight Company traveled to the terrestrial body Ferrok Pax, where their troops, barely two hundred strong, had the mission of rescuing captured rebels from a warrior group. The company lost many soldiers to starvation, local fauna, or the inability to keep travelling whilst trying to flank their enemy. When the subsequent battle came, Twilight Company won, but with only thirty-seven left, including the Corellian Besalisk Gadren."}, {"tag": "h3", "text": "Bounty on Howl"}, {"tag": "p", "text": "In the time that followed, Twilight Company was joined by individuals like Sairgon, who eventually rose to the rank of Lieutenant. During a recruitment drive on the terrestrial astronomical object Veron, a woman named Brand joined. However, Howl soon learned that she was a bounty hunter who was there to kill him and found out her backstory. After Twilight Company received more recruits off of the celestial body Dorvalla, Howl noticed that Brand became attached to them."}, {"tag": "p", "text": "Twilight Company soon attacked the Imperial outpost on the backworld planet Allst Prime. During the fighting, Brand saved the Mirialan soldier Lylee Anaraku. She then attempted to shoot Howl from afar whilst he filled for Forward Air Controller Cait, who had died during the fighting. However, Brand was distracted when Anaraku was attacked by an Imperial. Later that day, Brand accompanied Howl to the Imperial headquarters where they incapacitated Magé, the governor of Allst Prime. Brand then attempted to take the bounty on Howl. However, Howl revealed that he had foreseen this and told the bounty hunter what he knew of her past, convincing her to join Twilight Company thereafter."}, {"tag": "h3", "text": "Further engagements"}, {"tag": "p", "text": "Sometime after, Twilight Company fought on the planet Mygeeto, where the Alliance's Riot Squadron was also present and earned their name. In 0 BBY, the company attacked the transmitter tower on the Outer Rim planet Crucival. The Imperial forces armed a number of civilians from the planet and then hid under the particle shield around the tower whilst Twilight Company fought the army of armed residents. The Thunderstrike, the company's troop carrier, directly engaged the shield and fire on it, while TIE fighters attempted to defend it. The tower soon fell, and a week later, Twilight Company held another recruitment drive. Among the recruits was Hazram Namir, one of the armed civilians who had lost his comrades in the battle and blamed the Empire for it."}, {"tag": "p", "text": "Within the next two months, Twilight Company fought at the location Kor-Lahvan. A short while later the Galactic Civil War began in the wake of an Alliance attack on the planet Scarif, and shortly after the Empire used its new superweapon, the Death Star, to destroy the planet Alderaan. Howl broadcast the news across the Thunderstrike sending a wave of bitter morale through his company."}, {"tag": "p", "text": "Days later, Twilight Company fought on the planet Vir Aphshire as a part of Operation Mad Rush. During the battle, news came to light that Alliance forces had destroyed the Death Star, sending cheers across the trenches. The Empire was defeated shortly after, and Twilight Company gained control of the hives and orchards. That night, Sergeant Fektrin, returning from a scouting mission to a nearby settlement, gave his report to Private Namir to give to Howl. When Namir delivered it, the captain asked the private what the company should two before leaving the planet. Namir suggested looting the settlement, and so Howl told the private of Twilight Company's doctrine, to win the hearts and minds of people."}, {"tag": "h3", "text": "Mid Rim offensive"}, {"tag": "p", "text": "Twilight Company was deployed to a number of locations including Cartao, Vanzeist and Praktin. During a recruitment drive on the terrestrial body Demiloch, an Imperial spy posing as an enlisting civilian shot Howl. The captain woke three days after the incident, angered to know that Sairgon had stopped the recruitment early. During a battle on another terrestrial body named Blacktar Cyst, the soldier Pol Andrissus—nicknamed Charmer—was injured by shrapnel, developing a stutter as a result. Twilight Company also fought on the terrestrial astronomical object Dreivus, where they celebrated after with the fire dancers."}, {"tag": "p", "text": "Another time, on the terrestrial body Magnus Horn, Twilight Company took such heavy losses that the Alliance High Command attempted to reassign its troops to other battle groups. Howl fought to keep the company together and saved it from obliteration. During a bombardment at the location Asyrphus, Twilight Company suffered more heavy losses of soldiers including their comm tech and her droid. On the terrestrial astronomical object Thession, Twilight Company recruited a number of individuals including Maediyu. The grenadier Maximian Ajax also joined the company after his own group, the Thirty-Second Infantry, was obliterated."}, {"tag": "p", "text": "Around 1 ABY, the Alliance launched a campaign into the Mid Rim. Twilight Company fought at the vanguard of the offensive, fighting at the factory-deserts of Phorsa Gedd and capturing the Ducal Palace and the port Chenodra on the terrestrial body Bamayar. The company also established positions from which Alliance hovertanks could attack on beaches and and built makeshift bases from tarps and sheet metal. However, nine months into the campaign, the Alliance High Command ordered all forces to halt, reporting that the Alliance Fleet was overstretched. The order to retreat came soon after, and Twilight Company was among the rearguard, being deployed to worlds it had taken months before, evacuating bases extracting Alliance heroes and generals."}, {"tag": "h3", "text": "Extraction on Haidoral Prime"}, {"tag": "p", "text": "In 3 ABY, Twilight Company fought the Imperial forces on the Mid Rim planet Haidoral Prime. On the final day of the campaign, Namir, now a First Sergeant, led a squad which engaged some stormtroopers on a street. Later that day, Twilight Company held an open recruit, promoted by the capital city's public address system after Sergeant Zab and his squad smuggled an astromech droid into the city's control center. The recruitment drive at hand accepted twenty-eight recruits."}, {"tag": "p", "text": "Meanwhile, Fektrin and his soldiers received a message from the governor's mansion via a mouse droid, claiming that rebel prisoners were being held inside the mansion. Knowing that all the rebel soldiers had been accounted for, Howl feared that these may be civilians being held captive, and so Namir's squad was sent to infiltrate the mansion and investigate. After getting inside the governor's mansion, Namir and his squad killed numerous guards before reaching the main control room—a converted dining hall—where they found Governor Everi Chalis among the other senior Imperial military officers. Chalis claimed to be the prisoner mentioned by the message from the mouse droid and shot an Imperial colonel near her. After Namir's squad killed the other officers, Chalis was stunned and taken back to the Thunderstrike."}, {"tag": "h3", "text": "The controversial guest"}, {"tag": "p", "text": "Being interviewed by Howl, Namir and two others, Chalis offered the Alliance information on the supply lines and weaknesses of what she called the \"Imperial War Machine,\" promising to map these out for the rebels. The governor was subsequently held in a airlock on the Thunderstrike used as a brig. Namir, meanwhile, introduced the combat-able recruits from Haidoral Prime to their training as a soldier, advising them about the DLT-20A blaster rifle and the White Book, the Alliance's field guide. With Chalis's presence becoming unpopular, a Haidoral recruit named Corbo attempted to visit her cell holding a galley knife. After being urged away, the recruit was confronted by Namir and he explained his reasoning to the first sergeant, who decided to post a guard at Chalis's cell."}, {"tag": "p", "text": "Three days after departing Haidoral Prime, the Thunderstrike and its escort the Apailana's Promise stumbled upon an Imperial reconnaissance while travelling through the Kontahr sector, resulting in a short engagement. During this Chalis's holding area was damaged, injuring the guard, Maediyu. Namir rushed to check the situation there and locked himself and Maediyu in Chalis's cell with the governor. After the battle ended, Namir and Maediyu were rushed to the med bay, the latter being put in a bacta tank. Namir discussed with Howl after recovering whether Chalis was drawing attention to the company."}, {"tag": "h3", "text": "Coyerti Campaign"}, {"tag": "p", "text": "Twilight Company's next campaign was on the jungle planet Coyerti, where the Empire threatened the native species during their breeding season. On the first day, Namir and Sergeant Zab's squads stormed an Imperial scout post, killing the camps occupants before dispersing. On the second day, Namir's squad awaited an Imperial convoy, but received news from Lieutenant Sairgon that it had changed route. At the same time, another dozen squads, led by the soldier Carver, attacked an Imperial fort, with the battle dying down into the night."}, {"tag": "p", "text": "On the third day, Namir's squad made multiple attempts to bring down an AT-ST, eventually submerging it in a swamp after changing tactics and luring the vehicle through the marshy forests. The day after, the squad traveled towards a Distillery which produced and stockpiled bioweapons for the Empire according to intel provided by Chalis. Namir's squad attacked the Distillery the next day, creating a distraction for the guarding forces before entering the complex and setting it to detonate, destroying the distillery thereafter. The squad, though, suffered from the chemicals of a barrel they had detonated and called for a drop ship to rescue them."}, {"tag": "p", "text": "During the final actions of the campaign, Sergeant Maximian Ajax's squad was pinned down by an AT-ST whilst fighting the planet's Imperial garrison, the X-wings not being able to fly low enough enough to shoot the vehicle. They were saved by the Coyerti people who stormed and destroyed the Imperial garrison. After Twilight Company departed the planet, news spread of other engagements that occurred that week, with it being deduced by the soldiers that the Coyerti campaign was part of a larger operation to help escort the larger Alliance fleet out of the Mid Rim by diverting Imperial forces. Namir went and argued with Howl that the ambiguity of their objective, but the captain argued that their goal was in fact alchemy, making change occur where they came in contact with the Empire."}, {"tag": "h3", "text": "Imperial attacks"}, {"tag": "p", "text": "Three days after departing the Coyerti, the Thunderstrike and Apailana's Promise were attacked by an Imperial destroyer at the edge of the Metatessu sector. The Promise and its X-wings reacted swiftly and the two vessels soon escaped, although one X-wing took a glancing hit and went offline. Twilight Company then traveled to the Enrivi system, where Howl had hoped to have repairs made, when the rebel starships were ambushed upon arrival by an light cruiser and a squadron of TIE fighters just thirty hours after the first attack. The Thunderstrike and Apailana's Promise destroyed the enemy forces with ease, with the escape pods of the cruiser being obliterated when the Imperial vessel exploded."}, {"tag": "p", "text": "The Twilight soldiers celebrated and toasted their pilots and gunners, who did not attend as they feared that they may be needed again. These fears were confirmed nineteen hours later when the Thunderstrike and Apailana's Promise were attacked in the Chonsetta system by a squadron of TIE Interceptors which ravaged the starboard side of the corvette. A rumor arose that three Imperial battle groups had abandoned rebel engagements to hunt Twilight Company. M2-M5, Twilight Company's head of engineering, discovered that the Thunderstrike's hyperdrive was leaking a traceable trail of hypermatter."}, {"tag": "p", "text": "The senior staff of Twilight Company were gathered for a meeting an hour later, where they discussed how they would fix the matter of the Thunderstrike being tracked. Lieutenant Sairgon suggested abandoning Chalis, but Howl argued that she had given the Alliance the only real victory recently with the destruction of the Distillery on Coyerti. As more suggestions arose, proposing different methods of saving at least the most senior personnel of Twilight Company. Chalis when brought her own idea, that the company could board an Imperial cargo transport to seize the supplies to repair the Thunderstrike's hyperdrive."}, {"tag": "h3", "text": "Raiding a freighter"}, {"tag": "p", "text": "The Thunderstrike and Apailana's Promise traveled to the Redhurne system, where the vessels hid in the crescent of a shattered moon in wait for an Imperial cargo transport. An Imperial heavy freighter eventually arrived, and Chalis contacted the freighter to change the course of the transport. Once the heavy freighter did so, the Thunderstrike and Promise attacked from either side, with the former launching boarding pods carrying squads of rebel soldiers."}, {"tag": "p", "text": "While other squads held positions and pushed into the freighter's engineering section, Sergeant Fektrin and his squad led a trio of engineers to the command station, killing the personnel there and rendezvousing with Namir and Chalis. Chalis operated at a terminal with an astromech droid. When she had finished, Fektrin's squad led the engineers to the lower decks while Namir and Chalis tailed them, setting up a choke point to quell approaching Imperial personnel. Meanwhile outside, the Thunderstrike and Apailana's Promise were keeping the freighter in a weak position to distract the crew with repairs. Once Fektrin's engineers finished their salvaging job, the sergeant signaled the other squads to slowly withdraw from the freighter."}, {"tag": "p", "text": "After a Gozanti-class cruiser entered the battle, Howl gave the squads five minutes to return to the Thunderstrike. The frustrated squads moved to flee to their boarding pods quickly, with Namir splitting from Chalis to assist other squads. The first sergeant assisted Ajax and his squad, who were pinned into a corner by stormtroopers. Ajax was killed as the squad was released from the enemy pressure. Fektrin was also killed in the withdrawal, but the remaining troops successfully returned to the Thunderstrike, which fled the system."}, {"tag": "h3", "text": "Loss of leadership"}, {"tag": "p", "text": "While the Thunderstrike and the Apailana's Promise were set to rendezvous with an Alliance flotilla in the Elochar sector to make further repairs. Meanwhile, Howl and Chalis were invited by the Alliance High Command to attend a strategy conference at their secret base on the ice planet Hoth. Taking Namir and the soldiers Roja and Beak as their escort, the pair traveled to the base on Hoth, being greeted there by General Philap Bygar. While the conference took place, Namir, Roja, and Beak were given jobs around the base. Namir eventually got into a fight with the special forces soldier Kryndal, but the other two soldiers acquainted themselves with the base's personnel."}, {"tag": "p", "text": "Shortly after the strategy conference ended, the base on Hoth was attacked by Imperial forces led by the Sith Lord Darth Vader. Namir, Roja, and Beak defended Perimeter Outpost Delta until the outpost's main defenses fell. The trio then made their way back to the main base on a hijacked Imperial Juggernaut and found an injured Howl with Chalis at the command section. They attempted to make it to a hangar but Vader and his soldiers cut them off, killing Roja and Beak and incapacitating Namir. Vader briefly confronted Chalis before attending to primary mission. Namir awoke to find Howl had too died. He and Chalis then proceeded to the hangar and fled Hoth, with Chalis using her clearance codes to bypass the Imperial blockade."}, {"tag": "p", "text": "Around the same time, the Thunderstrike, stationed at the flotilla, took on survivors aboard the damaged light freighter Trumpet's Call. These survivors, however, were Imperial spies, who stormed the bridge and killed numerous officers including Sairgon and Paonu, but not before Sairgon warned the rest of the flotilla, which scattered. Brand was able to reach the bridge and killed the spies. In that time, the Imperial II-class Star Destroyer Herald arrived in search of Chalis, with the Apailana's Promise distracting the Star Destroyer. Brand had the Thunderstrike's remaining bridge crew take the corvette into hyperspace, with the Promise following."}, {"tag": "h3", "text": "Regrouping on Ankhural"}, {"tag": "p", "text": "Twilight Company fled to pirate backwater planet Ankhural, where the company repaired the Thunderstrike in an abandoned podracing track while the Apailana's Promise was repaired in orbit by a skeleton crew. Namir and Chalis eventually returned from Hoth, and meetings were held between the top staff with updates on the Thunderstrike's repairs as well as other agenda. Some soldiers, fearing that the Empire would find and destroy Twilight Company, considered leaving, but Namir learned of this and decided in a meeting that the potential deserters were to be split into separate teams. Twilight Company held a funeral for the late Howl, comprising of a short ceremony involving personnel who were not on duty. Numerous soldiers had drinks at a cantina after."}, {"tag": "p", "text": "After Namir and Brand purchased parts to repair the Thunderstrike's communications array. The first sergeant and Chief Medic Von Geiz were briefly able to contact another member of the Alliance, who informed them that the Alliance High Command was scattered and on the run. Some personnel from Twilight Company were then attacked by what Brand assumed to be the real powers of Ankhural sending a message. Wishing to give the company a new purpose, Chalis held a meeting with the top staff proposing Operation Ringbreaker, a campaign which sought to attack a number of Imperial installations along the Rimma Trade Route to force redeployments from the Kuat Drive Yards for a projected attack on the shipyards. Some of the meeting attendees were skeptical of Chalis's logic, but they were ultimately in favor of the plan."}, {"tag": "h3", "text": "Operation Ringbreaker"}, {"tag": "p", "text": "Twilight Company started this operation with the warehouse world of Mardona III where they lost Charmer and two of his men to an armoured worm vehicle. Namir, Twitch, Carver and a few others sought to destroy the thing and caught it off-guard as the crew were disembarking. They then decimated the Imperial garrison on Obumubo. After that they wrecked the Dockyards of Najan-Rovi and then took out the Plastic factory on Nakadia."}, {"tag": "p", "text": "After two more attacks on Naator and Xagobah it was just Sullust and Malastare left before Kuat. But when they took the factory Inyusu Tor on Sullust, the Thunderstrike was ambushed and shot down by the TIE Fighters of Vixus Squadron and the Apailana's Promise fled the system with its X-wings. Twilight Company was stranded with only a matter of time before the Herald would arrive."}, {"tag": "h3", "text": "Stranded on Sullust"}, {"tag": "p", "text": "With few other options, Namir went down to the nearby capital of Pinyumb to find the Sullustan resistance. He and his soldiers were attacked and they lost Twitch's soldiers. Twitch deserted them and Namir was rescued by Nien Nunb, the leader of the resistance. He took him back to the Sullustan resistance safe house where he met the very small group of freedom fighters. They helped him back to the rest of the 61st back at Inyusu Tor. The Herald arrived and the local imperial forces engaged Twilight Company at the factory. Luckily, the Apailana's Promise returned to keep the Herald from bombarding Twilight Company from above."}, {"tag": "p", "text": "Everi Chalis abandoned Twilight Company, stole a shuttle and let herself get captured by the Herald, not knowing she had twenty ion bombs inside the shuttle which set off and forced the Herald to flee. After Twilight Company fended off the rest of the ground forces using the lava flow from Inyusu Tor, the Sullustan resistance teamed with the once passive Cobalt Laborers' Reformation Front to take Pinyumb and revolutions broke out all over Sullust, liberating it for the 61st. The Apailana's Promise had barely survived and the soldiers began scavenging the Thunderstrike. The 61st planned to leave Sullust within time as the empire would return eventually."}, {"tag": "h3", "text": "Campaign in the Cerberon system"}, {"tag": "p", "text": "Twilight Company subsequently departed Sullust, with Namir remaining as captain. In 4 ABY, Alliance forces secured a major victory at the Endor system, one which saw the death of the Emperor. The military movement transitioned into the New Republic shortly thereafter, with Twilight Company serving as a part of the new government's army. Around 5 ABY, Twilight Company took part in a campaign in the Cerberon system, an assortment of planets orbiting a blackhole. There, the company was deployed on the planet Troithe, serving as the infantry strength of the battle group led by Twi'lek General Hera Syndulla. The company resided on Syndulla's flagship, the Acclamator-class transgalactic military assault ship Lodestar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 61st Mobile Infantry first appeared as the focus in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed, being identified as the Sixty-First Mobile Infantry. The company's more numerical name, 61st Mobile Infantry, was identified in the 2017 reference book and box set Star Wars: The Rebel Files, written by Daniel Wallace. In an interview with The Daily Dot, Freed described Twilight Company as a \"oddball company,\" claiming it's recruits had been shaped by Howl, who he viewed as the moral compass of the company. He also claimed that he implemented Roach to show the training and integration of the company's recruits, as well as proving a reminder that Twilight Company's personnel had been regular people before."}, {"tag": "p", "text": "According to Freed, he was eager to include Twilight Company in a later project of his, the Star Wars: Alphabet Squadron trilogy, which debuted with Alphabet Squadron in 2019. He was hesitant to include the company prominently over fears of being too self-indulgent or being distracted by with implementing the group. After receiving approval from his editor, Freed ultimately included the company in Shadow Fall, the sequel to Alphabet Squadron released in 2020, attempting to include them more naturally. He recounted this in an interview with video creator \"Star Wars Explained\" on Youtube."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}