{"url": "Black_Squadron_(Resistance)", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Black Squadron (Resistance) personnel", "Category:Resistance starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Black Squadron  (Resistance)"}, {"tag": "p", "text": "Black Squadron was a Resistance starfighter squadron founded by Commander Poe Dameron. Black Squadron played a key role during several engagements in the conflict between the Resistance and the First Order. The squadron mainly fielded T-70 X-wing starfighters, but flew other craft such a BTL-S3 Y-wing Starfighter. They notably participated in the search for Lor San Tekka traveling to planets such as Ovanis and Megalox Beta."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mission to Ovanis"}, {"tag": "p", "text": "After General Leia Organa recruited Commander Poe Dameron to search for Lor San Tekka, Dameron selected a squadron of four pilots and a technician known as Black Squadron. The squadron's members included the pilots Captain Temmin Wexley, Karé Kun, Jessika Pava, L'ulo L'ampar, the technician Oddy Muva, and several astromech droids including BB-8. For their first mission, Black Squadron with the exception of Muva traveled to the mountainous world of Ovanis. Dameron encountered the Crèche cult and questioned their leader about Tekka's whereabouts. Dameron learned that Tekka had visited Ovanis a long time ago. However, Muva had been blackmailed by the First Order Security Bureau Agent Terex into spying on Black Squadron."}, {"tag": "p", "text": "Black Squadron was subsequently involved in a skirmish with First Order forces led by Terex, who had been sent to recover the information that Dameron had acquired during Operation: Sabre Strike. While Dameron and BB-8 tangled with Terex and his landing party, Wexley and the other pilots engaged in a dogfight with First Order TIE/fo space superiority fighters in the skies above Ovanis. The skirmish was interrupted when the Crèche egg hatched and released two large flying creatures, which fought each other. Dameron and BB-8 managed to overpower Terex and forced him to call off his forces. After the Crèche cultists departed with one one of the flying creatures, Black Squadron refueled and departed. Unwilling to risk a war between the New Republic and the First Order, Black Squadron allowed Terex and his surviving man to leave."}, {"tag": "h3", "text": "Rescuing Grakkus"}, {"tag": "p", "text": "Continuing their search for Tekka, Black Squadron traveled to Megalox prison on the high gravity world of Megalox Beta to question the imprisoned Grakkus the Hutt. With Organa's help, Black Squadron managed to bribe Warden Luta into allowing them to enter the prison. However, Terex learned they were coming and bribed Luta into abandoning Black Squadron to the prisoners. Despite this setback, Black Squadron managed to fight their way into Grakkus' fortress. Grakkus granted Dameron and Terex an audience but refused to divulge the information on Tekka until one of them had freed him."}, {"tag": "p", "text": "In response, Dameron got BB-8 and the other astromech droids O-R10N, R2-HA, and R4 to disable the Megalox space station's gravity shield generator. Black Squadron also fought off an attempt by gangsters hired by Terex to storm the fortress and kill Grakkus. After disabling the gravity shield, Dameron managed to force Luta to let them and Grakkus leave the prison in exchanging for restoring the gravity shield. Before they could leave the system, Terex's starship Carrion Spike attacked Megalox station. Black Squadron drove off the Carrion Spike and obtained the data from Grakkus. In return, the Hutt was given hyperspace coordinates and allowed to leave. After returning, Organa instructed Dameron to suspend his search for Tekka to investigate the presence of a spy within Black Squadron."}, {"tag": "h3", "text": "Test of trust"}, {"tag": "p", "text": "Following the events on Megalox Beta, Poe undertook a solo mission to Pheryon to meet with the Galaxy Beacon journalist Suralinda Javos, who had information on the First Order's militarization efforts. After escaping First Order forces, Javos decided to join the Resistance. Still unable to trust his fellow pilots due to the presence of a spy, Dameron brought Muva, BB-8, and Organa's spymaster C-3PO on a mission to recover one of the Resistance's droid spies on Kaddak."}, {"tag": "p", "text": "Dameron and his team managed to rescue the BX-series droid commando N1-ZX, who was purportedly carrying vital First Order intelligence including the location of Supreme Leader Snoke. In truth, this was a trap set by Terex to use Dameron and the droid to track down the Resistance base. Terex wanted to destroy the Resistance with his Ranc gang forces. Dameron and the droids managed to flee offworld on Dameron's T-70 X-wing starfighter Black One. Terex gave chase in his flagship Carrion Spike and a fleet of \"Uglies.\""}, {"tag": "p", "text": "During the journey, Dameron realized that Muva was the spy and suspected that Terex had planted the information in order to find the location of the Resistance base. Dameron exited hyperspace above an uncharted desert planet. Terex and the Ranc gang followed and forced Dameron to ground on the desert planet. Meanwhile, Muva infiltrated the Carrion Spike and managed to reunite with his wife Sowa Chuan, who had been taken captive by Terex to exert leverage over her husband. Muva also encountered Terex's harem of slaves."}, {"tag": "p", "text": "Dameron and the droids fled into a cave. BB-8 and C-3PO managed to delay Terex long enough for the rest of Black Squadron to enter the desert planet's system. During the ensuing dogfight, Muva managed to reprogram the Carrion Spike's battle computers to target Terex's \"Uglies.\" Black Squadron provided cover for Muva and the escaped slaves' escape pods while fighting with Terex's Ranc fighters. L'ulo shot down one of the \"Uglies\" that destroyed an escape pod. However, he was shot down by another fighter. While Dameron and BB-8 fought with Terex, First Order forces led by Commander Malarus exited hyperspace and wiped out the Ranc gang forces and Terex's flagship but did not target the Resistance. Dameron's Black Squadron mates flew over Malarus' landing party while Dameron met with the First Order commander. After learning she had come to apprehend Terex for disobeying Snoke's directive to avoid open conflict with the Resistance, Poe handed the rogue First Order agent to her."}, {"tag": "h3", "text": "Mission to obtain fuel"}, {"tag": "p", "text": "Black Squadron were sent on a mission to obtain fuel. After rendezvousing with the fuel tanker Romary, Poe Dameron started flying it back to base, however BB-8 realised it was rigged as a bomb to detonate on decelerating."}, {"tag": "h3", "text": "Mission to Spalex"}, {"tag": "p", "text": "Black Squadron members Karé Kun and Jessika Pava along with the journalist Suralinda Javos were sent on a mission to Spalex to obtain propaganda that would show the New Republic what the First Order was really like. At the same time, Poe Dameron and Temmin Wexley went in search of Oddy Muva. On the recommendation of C-3PO's droid network, the trio traveled to Spalex where the First Order were attempting to mine the planet's thorilide."}, {"tag": "h3", "text": "Mission to Cato Neimoidia"}, {"tag": "p", "text": "Black Squadron were sent on a mission Colonies planet Cato Neimoidia, to rescue Lor San Tekka from a prison after he was arrested for breaking into secure vaults."}, {"tag": "h3", "text": "Rescue of Lor San Tekka"}, {"tag": "p", "text": "After Lor San Tekka was kidnapped by former First Order agent Terex, Black Squadron were put on alert to be ready to find Lor San Tekka as soon as Leia Organa's tracking bracelet alerted them to his position. Terex dropped Tekka into the Great Forveen Nebula and Black Squadron was sent to rescue him, tasked with protecting a shuttle with a retrieval squad from First Order TIEs."}, {"tag": "h3", "text": "Gathering allies"}, {"tag": "p", "text": "Following the Battle of Starkiller Base, General Leia Organa sent Black Squadron on a mission to gather allies and bring new systems into the Resistance. The squadron was also accompanied by its newest member, Suralinda Javos (Black Four) in an RZ-2 A-wing interceptor."}, {"tag": "h3", "text": "Battle of Grail City"}, {"tag": "p", "text": "As part of the mission to gather allies, Black Squadron went to Grail City on the planet Ikkrukk. However, when they arrived there, the city was under attack from a First Order heavy cruiser, Fortitude, which diverted all necessary TIEs it had to engage Black Squadron in an aerial battle over the city's shield, which was slowly weakening under the bombardment. Grail City had a FreiTek planetary defense grid with an integated central processor with multi-hemispheric tracking, which Pava had previously trained on in the navy. Pava suggested that if she could get to the command center, she could bring it online. A tiny section of the shield was opened, so Pava and Javos could slip down to the surface, while Wexley and Kun stayed outside to battle the TIEs. However, as they made the attempt, Pava clipped her X-wing and crash landed on the surface below. As Pava and Javos battled their way on foot to the command center, things turned for the worse and Javos was shot."}, {"tag": "p", "text": "Pava administered medical aid to Javos and convinced her to continue fighting. Outside the shield, Wexley and Kun continued their struggle with the seamingly endless number of TIEs, so Wexley suggested getting as close as they could to the heavy cruiser, so the TIEs chasing them would be less likely to shoot them for fear of damaging their own ship. Kun took a hit to her stabiliser, locking her heading and losing her weapons, and ended up tracking towards an enemy turret that had a targeting solution on her. Out of nowhere, Commander Poe Dameron arrived and destroyed the turret, saving Kun, who was able to restore full control to her ship. Dameron ordered their ships to pull away from the Fortitude and as they did so, the shield over the city disappeared and the planetary defense grid activated, destroying the heavy cruiser. For saving the city, Prime Minister Grist promised to provide support the Resistance."}, {"tag": "h3", "text": "Disbanded"}, {"tag": "p", "text": "At some point before the Resistance's Mission to Sinta Glacier Colony, the squadron was disbanded, though its legacy was embodied by Dameron and Wexley."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Black Squadron was created and developed for the 2016–2018 comic book series Star Wars: Poe Dameron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}