{"url": "Black_Vulkar_Base", "categories": ["Category:Legends articles", "Category:Lower City locations"], "nodes": [{"tag": "h1", "text": "Black Vulkar Base"}, {"tag": "p", "text": "The Black Vulkar Base was the headquarters for a swoop gang on the planet Taris known as the Black Vulkars, located in the Lower City. The Sith orbital bombardment destroyed much of Taris and the base in 3956 BBY during the Jedi Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the year 3956 BBY a complex of guarded rooms and levels within the Lower City of the planet Taris served as the base of a notorious swoop gang on Taris known as the Black Vulkars. From the base the Vulkars, led by a fresh leader and former member of their rival gang the Hidden Beks, Brejik, attacked civilians and rival gangs. Following the attack on the Endar Spire above Taris, the Black Vulkars captured and enslaved a Jedi survivor, Bastila Shan. Two survivors from the battle, the amnesic former Jedi and Sith Lord Revan, and a Republic soldier, Carth Onasi, attempted to rescue her, which led them through the Black Vulkar Base. There they hoped to acquire a swoop bike accelerator, which would help them win an upcoming swoop gang race and Bastila's freedom."}, {"tag": "p", "text": "A Twi'lek female, Mission Vao, offered to help Revan and Onasi enter the base once they worked together to rescue her Wookiee friend Zaalbar from Gamorrean slavers who had captured him. They found Zaalbar within the sewers of the Taris Undercity, and from there Mission used her skills to bypass a forcefield that would have prevented Revan entering otherwise, leading them to the underground entrance of the Vulkar base guarded by a rancor. Once the group killed the rancor they entered the base. The group killed every Black Vulkar member apart from a slave named Ada, whom Revan freed. Revan encountered automatic turrets protecting the locked elevator to the swoop garage although he used codes obtained from a Vulkar, who had doubts about being a member of the gang, in return for letting him go free. Inside the garage a Black Vulkar named Kandon Ark confronted Revan and his companions. He tried to convince Revan to kill Gadon Thek, the leader of the rival gang named the Hidden Beks. Revan refused, quickly killed Kandon, took the accelerator, and gave it to Gadon. Revan then went on to race and win in the annual swoop race, thereby winning Bastila's freedom. Shortly following the race, Taris came under orbital bombardment by the Sith blockade, destroying any building over two stories high, including the Black Vulkar Base."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The Black Vulkar Base had a main floor and a garage. The base had two entrances, one in the Lower City, which was locked when Revan was there and could only be opened from within the base; and a second via an elevator from the Sewers of Taris, which Revan was forced to use to enter the base. Beneath the main floor was the garage.\nThe garage had a large hangar with three swoop bikes parked in it. There were four maintenance bays in the lower section of the garage, one of which was where the prototype accelerator was stored."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Black Vulkar Base level originally included an upper floor containing a spice lab, staff housing, and the base's heating control system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}