{"url": "Black_hole/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Black holes", "Category:Compact-star types", "Category:Physics"], "nodes": [{"tag": "h1", "text": "Black hole"}, {"tag": "p", "text": "A black hole was an astrophysical phenomenon with gravity of sufficient strength that it prevented even light from escaping. Among the largest forms of black holes are supermassive black holes."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Black holes typically resulted from the supernova of extremely large stars (typically supergiants), which resulted in matter so heavy that it could push into the fabric of space, though some were thought to have been created in the initial moments of the formation of the universe. One section of the black hole was known as the Roche Lobe."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Black holes were common in the galaxy, particularly in a cluster known as The Maw. One existed in the center of the galaxy, and one was also located along the Hydian Way, near Dathomir. Their intense gravity, combined with the difficulty in detecting them (as they emitted no light) and the fact that smaller black holes could \"wander\" through space, made them dangerous navigational hazards which snarled hyperspace routes; hundreds of vessels were believed to be lost every standard year, and the effects of an object in hyperspace or realspace colliding with one were the stuff of every spacefarer's nightmare. Unidentified black holes were marked as Gamma Class navigation hazards."}, {"tag": "p", "text": "Black holes were used throughout much of the galaxy's history as sources of energy. Subatomic knots of space-time were created in encompassing unmanned energy refineries, and were an intricate part in the function of all manner of gravitational devices."}, {"tag": "h2", "text": "Natural black holes"}, {"tag": "h2", "text": "Artificial black holes"}, {"tag": "p", "text": "In c. 1 ABY, Imperial Doctor Arakkus once simulated the effect of a black hole. He utilized a negatron impact charge on a dwarf star, causing it to collapse on itself. The resulting collapsed dwarf star slowly sucked in its surroundings. Also, the dovin basals of the Yuuzhan Vong could generate small black holes, which they used as shields. By creating the black hole between a ship and enemy weapons fire, the hole could absorb the incoming fire, which was later dispersed harmlessly as low-intensity gamma radiation when the black hole would evaporate."}, {"tag": "p", "text": "A gravity well projector could also create a black hole. An unstable gravity well projector once collapsed into a black hole and consumed the ship, Elusive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}