{"url": "Black_market/Legends", "categories": ["Category:Legends articles", "Category:Criminal organizations", "Category:Economic systems", "Category:Phrases", "Category:Secret societies"], "nodes": [{"tag": "h1", "text": "Black market"}, {"tag": "p", "text": "The black market, also called the underground market, was an illegal underworld center where goods not publicly sold or traded could be found and purchased. Virtually every planet had a black market of some kind. Many forbidden droids, drugs, weapons, and other technological innovations could be found on the black market, as well as banned music and entertainment, bootleg holos and Twi'lek slave girls. On repressive or religious planets, items like alcohol or caffeine would be available only through the black market."}, {"tag": "p", "text": "Even planets allied to the Rebellion during the Galactic Civil War were known to have black markets containing pornographic holos, alcohol, or expensive clothing not carried in the Alliance Commissary."}, {"tag": "p", "text": "Black market technology was often employed by pirates and other criminal organizations such as the Zann Consortium. Although the technology was effective, it was sometimes outdated. Also, the users would have to be careful, as it was a crime to possess illegal items."}, {"tag": "p", "text": "Items were usually classified in three categories:"}, {"tag": "p", "text": "Planets such as Corellia, Coruscant, Eriadu and Thyferra all had thriving black markets."}, {"tag": "p", "text": "Goods did not necessarily have to be illegal or restricted to be sold on the black market, as some vendors would try to avoid taxes or notifying authorities."}, {"tag": "p", "text": "Certain goods that were normally not mass produced and not available on sale, such as lightsabers, could end up being sold and bought on the black market. An example was Ahsoka Tano's stolen lightsaber."}, {"tag": "h2", "text": "Examples of black markets"}, {"tag": "p", "text": "The city of Depatar was considered the biggest black market in the Cularin system. It had been built by five crime syndicates wanting a neutral meeting ground to deal, and later offered to any parties with similar needs. The A68 Market was a black market right under the nose of the Empire, located within the Death Star itself."}, {"tag": "h2", "text": "Notable products"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}