{"url": "Blackguard_(Star_Destroyer)", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:Imperial-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Blackguard (Star Destroyer)"}, {"tag": "p", "text": "The Blackguard was an Imperial-class Star Destroyer, that was captured by the rogue Imperial Captain—and self-proclaimed Grand Admiral—Andal Sait, with intention of selling it to the criminal organization Black Sun."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the Township of Aurilia there were contact persons from both the Galactic Empire and the Rebel Alliance, but also an independent investor called Hirael Chindiaye, who, unlike both the Rebel Alliance and the Galactic Empire, who sought to capture/reclaim the rogue Star Destroyer for military purposes, wanted to capture the Star Destroyer for personal interests."}, {"tag": "p", "text": "All three factions managed to recruit a team of spacers, who managed to intercept the Star Destroyer when it was stationed in the Ord Mantell system, and, with some assistance of surviving crew still loyal to the Empire, managed to force their way into the Hangar Bay of the ship, and fought their way through the Star Destroyer, and even though most of the crew that had remained loyal to the Empire had either fled, or been \"taken care of\". It proved to be a tough fight, as Admiral Sait had managed to gather several sympathizers among the crew, along with Black Sun members."}, {"tag": "p", "text": "The final fate of the Blackguard was unknown, which one of the factions that managed to wrestle the control of the ship, was quickly covered up by the Empire, information about the Empire losing one of their mightiest warships was nothing they would wished to see on the Imperial HoloVision. It was however known that Admiral Sait most likely perished in the ensuing combat aboard the bridge, along with other highly ranked rogue Imperials and Black Sun members, present to make sure that Sait did not break the deal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Blackguard was a \"heroic instance\" introduced in Star Wars Galaxies with \"Chapter 8,\" providing some interaction between pilots and ground combat-oriented players. And as the instance was repeatable, and could be attempted by virtually anyone above Combat Level 70, there was no real \"end\" to the quest-story."}, {"tag": "p", "text": "Through an in-game collection, the player can also be rewarded with a special painting of the Blackguard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}