{"url": "Blacklist", "categories": ["Category:Legends articles", "Category:Stub", "Category:Documents", "Category:Databases"], "nodes": [{"tag": "h1", "text": "Blacklist"}, {"tag": "p", "text": "The Blacklist was a highly confidential bounty list that existed during the Cold War and into the Galactic War. Only the galaxy's \"major players\", from government officials to crimelords, knew of the list and could put bounties on it, however the bounty hunters themselves were the only ones who could actually see what bounties were on the list. The blacklist was so secret that the newest Great Hunt Champion's companion Mako, a slicer who'd spent years learning about bounty hunting, and could gain access to nearly any database, had only ever heard a few sparse rumors about it."}, {"tag": "p", "text": "The bounties of the Blacklist were the greatest of them all, going after only the most dangerous and wanted beings in the galaxy. As such they were only available to the Grand Champions of the Great Hunt, bounty hunters who had proven themselves and been recognized as the greatest in the galaxy. The list was considered to be as old as the Great Hunt and thus tied to the Mandalorian clans."}, {"tag": "p", "text": "The blacklist had its own traditions, which were kept going by the Great Hunt Champions. The newest champion was expected to take the list's oldest contract, a mission to hunt down a banished Mandalorian on Taris named Jicoln Cadera, which no one had ever successfully fulfilled. One of the oldest and most important traditions in particular was that there was always a Mandalorian present among the Grand Champions."}, {"tag": "p", "text": "Given how limited the number of hunters able to pursue them were, it was not unheard of for a particularly difficult bounty placed on the blacklist to go for weeks, months or even years before they were finally completed."}, {"tag": "p", "text": "The only two bounty hunting contracts known to have been on the Blacklist included:"}, {"tag": "p", "text": "The Great Hunt Champions with access to the Black list included:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}