{"url": "64-Y_Swift_3_Repulsorlift_Sled", "categories": ["Category:Legends articles", "Category:Aratech Repulsor Company products", "Category:Galactic Empire vehicles", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "64-Y Swift 3 Repulsorlift Sled"}, {"tag": "p", "text": "The 64-Y Swift 3 Repulsorlift Sled was manufactured by Aratech Repulsor Company."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Manufactured by Aratech Repulsor Company, the 64-Y Swift 3 Repulsorlift Sled was a fast and light repulsorlift sled built with the same \"engine with a seat\" design philosophy as the swoop bike. Measuring 4.1 meters, advanced engineering design principles removed the need for bulky directional vanes to assist in steering, allowing the single rider to sit in a more comfortable upright position, using handlebars and foot pedals. Capable of reaching speeds of eight hundred kilometers an hour with a maximum flight ceiling of twenty-five meters, the Swift 3 was able to out-race anything short of an airspeeder. The modular design of the Swift 3 allowed engineers to refit the sled to deal with varying mission profiles. The repulsor coils utilized by the Swift 3 were made of refined durelium, which was illegal for use in civilian vehicles."}, {"tag": "p", "text": "The Swift 3 had a front-mounted Mk 2e/S medium blaster cannon, a single clamping hook launcher, and drop nets that were launched from a compartment on the underside of the sled. The Swift 3's rider would position the vehicle over a target, then drop the nets. The nets tangled around the target vehicle, giving off short pulses to disrupt the target vehicle's repulsor fields. The net drew energy from the repulsor field, causing the target vehicle to crash. The sled was also equipped with up-to-date scanning and communications jamming equipment. With a cargo capacity of four kilograms and a day's worth of consumables, the Y-64 cost 8,000 credits to buy new, and 1,800 to purchase used."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Swift 3 was commissioned by Army Command to combat the rise in swoop gangs terrorizing planets throughout the Outer Rim Territories. The sled had an exceptional success rate, leading to the Swift 3 being deployed along speeder bikes and All Terrain Scout Transport teams. It was employed as a patrol craft on Imperial-controlled planets."}, {"tag": "p", "text": "In the months following the end of the Clone Wars, a 64-Y was in use on Sel Zonn Station, an XQ2 Platform which orbited the Core World of Brentaal IV. It was employed by the Empire to move some special cargo and to spontaneously defend it from a group of Alderaanian Resistance agents."}, {"tag": "p", "text": "Brinaloy N'Vaari, the Devaronian fiancée of A'jidre Skrigatov, owned a heavily modified Swift 3 painted in flaming crimson adorned with black racing stripes. N'Vaari went into hiding to avoid marrying Skrigatov, paying Al T. Nadder to repaint the Swift 3 an iridescent green with purple racing stripes. She then traded the Swift 3 for a hydrobike at Phluche's Hydrobike Rentals, paying the Herglic owner Phluche Maltrid one hundred credits to not sell it for at least six days."}, {"tag": "p", "text": "On the planet Stend VI, a specially formed Storm Commando unit, the Dark Riders, was led by Lieutenant Irlyn Resk. Tasked with combating the numerous swoop gangs on the planet, the unit utilized Swift 3s alongside modified Ikas-Adno XR-10 Shadowhawks. Chop Harlison, a swoop tech based in the city of Gallisport on Shesharile 5, used the repulsor coils from a Swift 3 when building his custom prototype swoop, the Star Slinger."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}