{"url": "Blacktar_Cyst", "categories": ["Category:Canon articles", "Category:Astronomical objects"], "nodes": [{"tag": "h1", "text": "Blacktar Cyst"}, {"tag": "p", "text": "Blacktar Cyst was a terrestrial astronomical object where the Rebel Alliance's 61st Mobile Infantry, also known as Twilight Company, was deployed sometime prior to 3 ABY. During the subsequent battle, where the Galactic Empire's 204th Imperial Fighter Wing took part, the soldier Pol Andrissus received injuries that caused him to develop a stutter. Additionally First Sergeant Hazram Namir started an on going argument with Captain Micha Evon, known as Howl, and lost another argument with the fellow soldier Brand."}, {"tag": "p", "text": "In 3 ABY General Philap Bygar cited Twilight Company's troubles on Blacktar Cyst when commending their past service to Howl, Namir and three other company members at the Alliance's base on the planet Hoth. Caern Adan, a New Republic Intelligence agent, mentioned the 204th's presence at Blacktar Cyst in conversations with Lieutenant Yrica Quell and a reprogrammed IT-O Interrogation Unit some weeks after the Battle of Endor in 4 ABY. On the planet Troithe around 5 ABY, stories of the battle on Blacktar Cyst were told by an infantrywoman of Twilight Company at a refugee camp and among members of the 204th at the Taa Complex some days later."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The battle"}, {"tag": "p", "text": "Sometime by the year 3 ABY, Rebel Alliance's 61st Mobile Infantry, better know as Twilight Company was deployed to Blacktar Cyst, leading to a battle in which the Galactic Empire's 204th Imperial Fighter Wing took part. The Twilight Company soldier Pol Andrissus was wounded by shrapnel, which heavily scarred and disfigured his face, leaving the soldier with a permanent stutter. The rebel First Sergeant Hazram Namir lost an argument with another rebel soldier, the ex-bounty hunter Brand, about whether the company's Captain Micha Evon, nicknamed Howl, was a genius or not."}, {"tag": "p", "text": "In the wake of Twilight Company's deployment to Blacktar Cyst, Howl had a long lasting debate with Namir about whether the latter underestimated his men and their motivation to fight. The Alliance General Philap Bygar of Alliance High Command believed the company never should have been sent to Blacktar Cyst and voiced this to Howl, Namir and a few others from company during their visit to the Alliance's secret base on the planet Hoth in 3 ABY."}, {"tag": "h3", "text": "Stories of Blacktar Cyst"}, {"tag": "p", "text": "Several weeks after the Battle of Endor in 4 ABY, Caern Adan, a New Republic Intelligence officer, cited the 204th's involvement in the battle of Blacktar Cyst to Yrica Quell—a defector from the fighter wing who had fought at the battle for the Empire—at the shanty town Traitor's Remorse. In a conversation a few weeks later with the reprogrammed IT-O Interrogation Unit IT-O aboard the Acclamator-class transgalactic military assault ship Lodestar, Adan listed the battle on Blacktar Cyst alongside the destruction of Nacronis, which took place shortly after the Battle of Endor, as reasons why he believed that the 204th needed to be dealt with."}, {"tag": "p", "text": "Around 5 ABY, Twilight Company fought on the planet Troithe as a part of a campaign in the Cerberon system. During a social gathering between some of the company's soldiers and the New Republic's Alphabet Squadron at a refugee camp, one Twilight infantrywoman told her point of view of the fighting on Blacktar Cyst. Quell, who led the squadron, noticed that her memory of the battle was different to the soldier's, but decided not to admit to having taken part. At the Taa Complex greenhouse on Troithe some days later, Soran Keize, the field promoted colonel in charge of the 204th, joined members of the 204th's Squadron Three in telling stories, including the battle of Blacktar Cyst, around a fire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Blacktar Cyst was first mentioned in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}