{"url": "Blackwater_Systems", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Companies"], "nodes": [{"tag": "h1", "text": "Blackwater Systems"}, {"tag": "p", "text": "Blackwater Systems was a company opened on the planet of Falleen sometime before 24 BBY by the criminal Granta Omega and scientist Jenna Zan Arbor as a research and development facility for the Zone of Self-Containment drug. The company was known for ignoring environmental and safety laws, and was the target of a protest group that attempted to expose its illegal actions. In 24 BBY, several Jedi infiltrated Blackwater's factory, and Omega chose to destroy it rather than let his work be discovered."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Workers at Blackwater Systems wore red jumpsuits called unisuits and checked levels on machines that monitored the injection of liquid into canisters. Most of the workers were employed to double-check the machines for mistakes. The newest workers swept the factory floors before leaving. The managers were supposed to monitor the workers from a tier running around the upper level of the factory floor, but they rarely paid any attention to the workers. Blackwater was well-known for ignoring safety regulations and for bribing inspectors to overlook the infractions that led to the deaths of several employees. The company was not opposed to using lethal force on civilians."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime before 24 BBY, the criminal Granta Omega and scientist Jenna Zan Arbor founded a company using the name Blackwater Systems, which opened a factory in the Yellow District of the planet Falleen shortly before the Clone Wars. Omega, Zan Arbor, and a deposed dictator from the planet of Romin, Roy Teda, used the Blackwater Systems facility to test various water-borne delivery mechanisms for the Zone of Self-Containment, a drug designed to make those exposed to it too docile to respond to outside stimuli, as part of a plan to expose the drug to the citizens of the galactic capital Coruscant."}, {"tag": "p", "text": "In 24 BBY, Blackwater attempted to kill members of a group of protesters as they prepared to violently enter its factory. The attempt was foiled by the intervention of the Jedi Knights Obi-Wan Kenobi and Siri Tachi, along with their apprentices, Anakin Skywalker and Ferus Olin, as they saved the leader of the protest group, Mazara, from an assassination attempt. Mazara then introduced the Jedi to an employment officer, Wanuri, who gave them jobs so that they could infiltrate the factory to find Omega. As soon as Omega realized that that Jedi were in the building, he destroyed the facility with explosives in an effort to kill his pursuers. Destroying the facility also eliminated evidence of both the Zone of Self-Containment and a wing of the facility that housed a recreation of a section of the Senate utility tunnels, originally located under the Senate Building on Coruscant, which was being used to model the effectiveness of the drug if the original tunnels were used to distribute it through either the water or air to Coruscant's populace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Blackwater Systems appeared in the young-adult novel Jedi Quest: The False Peace, the ninth volume in the Jedi Quest series written by Jude Watson. Blackwater Systems was later mentioned in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}