{"url": "Blade-32_superiority_fighter", "categories": ["Category:Legends articles", "Category:Adumari vehicles", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Blade-32 superiority fighter"}, {"tag": "p", "text": "The Blade-32 superiority fighter was the craft of choice for many Adumari pilots."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "At 18 meters in length, the standard \"razor-wing\" shape of the Blade-32 lent it impressive atmospheric maneuverability. The twin engines peaked at 900 kilometers per hour in atmospheric flight, although the ship was considered less effective in space combat than its contemporaries in the New Republic. In more general terms, the Blade-32 was considered comparable to the Z-95 Headhunter, although more heavily armed and armored. It was also comparable to the BTL Y-wing starfighter in terms of maneuverability, durability, and number of weapons, despite lacking proton torpedoes and shields. Two pairs of fire-linked laser cannons and a pair of concussion missile launchers (with an impressive capacity of eight missiles per launcher) were the Blade-32's standard weapons. In an unusual design feature, one of the laser cannon pairs was mounted to fire backward. As with most fighter craft, cargo and consumables were at a minimum, at 150 kilograms and three days, respectively. For space combat, Blade-32s were upgraded with a pressurized atmosphere supply and two proton torpedo launchers, each with magazines of eight missiles. They could also be fitted with a Class 2 hyperdrive. The basic Blade-32 was purely an atmospheric fighter, with the starfighter version being the Blade-32 Alpha and the hyperdrive-equipped craft the Blade-32 Beta. While finding it generally inferior to the X-wing as a fighter, Tycho Celchu felt the Blade-32 would make a good bomber if refitted with shields and a gunner's position."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Designed, developed and produced by Tarrvin-on-Kallik, the Blade-32 was used for planetary defense and capital ship support. A direct descendant of the highly collected Blade-28 and Blade-30 fighters, the ship was popular in jet black, and after the unification of Adumar in 13 ABY, red in honor of Red Flight. New ships cost 82,000 credits, with used ones generally available at 46,000, although the ships were not made available off Adumar until after the treaty with the New Republic. Despite this, they managed to find their way into several private collections and mercenary squadrons that were willing to deal with the craft's use of Adumari measurements over standard. The Blade-32 was still the top-of-the-line strike craft of Adumar as late as 18 ABY while work on a successor model, the Blade-34 fighter, continued."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}