{"url": "Blade_emitter/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Lightsaber components"], "nodes": [{"tag": "h1", "text": "Blade emitter"}, {"tag": "p", "text": "The blade emitter was the part of a lightsaber that projected the blade from the lightsaber hilt. It consisted of the emitter matrix, which further focused the blade projecting from the crystal with a tightly wrapped magnetic field, and the emitter itself, where the blade actually protruded. The emitter possessed the magnetic ring that created the field that contained the plasma of the blade and arced it back to the lightsaber for reconversion back to electricity."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Positioned at the end of the hilt, the emitter contained the energy modulation circuits and the magnetic stabilizing ring, among other things. The modulation circuits controlled the amount and the intensity of the plasma that made up the blade, while the magnetic stabilizing ring controlled the length of the blade, which could be adjusted by a simple dial or a more radical dual-phase control. The exterior component of the emitter was the emitter plate, a superconducting metal from which the blade emerged. The plate was usually recessed into the casing, but sometimes it was flush with the end. In other cases, as with Obi-Wan Kenobi's lightsaber, the emitter was completely separate from the casing."}, {"tag": "h2", "text": "Specializations and modifications"}, {"tag": "h3", "text": "Mechanics"}, {"tag": "p", "text": "Many emitters featured modifications that changed the blade, some of which changed the thickness of the blade, others adjusting the properties of the blade plasma itself. Those that adjusted thickness allowed for greater precision, or increased the surface area to make deflection easier. The modifications that changed the properties of the plasma could adjust the cutting power, or cause the blade to emit certain kinds of energies that damaged specific enemies, such as droids."}, {"tag": "p", "text": "Damping emitter\nDamping emitters harnessed power from carefully modified power cells to create a stun setting for the lightsaber. Drawing on power from the crystal at a reduced intensity, damped lightsabers could still seriously injure a target depending on the strength of the crystal."}, {"tag": "p", "text": "Deflection emitter\nThis emitter was optimized for use against blaster fire, aiding in blast-deflection."}, {"tag": "p", "text": "Disrupting emitter\nDisrupting emitters produced an unsteady beam that could wreak havoc on a victim's nervous system, causing effects such as temporary paralysis."}, {"tag": "p", "text": "Phobium emitter\nAnother type of disrupting emitter, phobium emitters were heavier and less wieldy, but indisputably more effective. They were made for more aggressive duelists. The greater the quality of the phobium metal, the more effective was the blade. Refined phobium emitters were the pinnacle of this, but were also more easily used."}, {"tag": "p", "text": "Fencing emitter\nThis emitter was most suitable for parrying blade attacks."}, {"tag": "h3", "text": "Exterior fittings"}, {"tag": "p", "text": "Though not used by all lightsabers, emitter shrouds could help to prevent the wielder of a weapon so equipped from inadvertently touching the blade while in combat, thus injuring themselves. In the case of weapons specialized in Form V lightsaber combat, the shroud was designed to separate facets of the blade for either offensive or defensive purposes. Shrouds were usually quite simple, either a rounded or beveled extension of the casing or emitter housing. Some lightsabers, such as Ahsoka Tano's, possess a double-shroud, one on either side of the blade. Some lightsabers even featured \"triple\" shrouds, such as Darth Malak's hilt, the third shroud being an exterior plate perpendicular to the double set. Though not classified as such, an emitter recessed into the casing would constitute a \"full shroud\"."}, {"tag": "p", "text": "Emitter guards were an early innovation in lightsabers, seeing use as early as 4000 BBY. Like the emitter shroud, they were intended to protect the wielder's hand during combat, preventing him from inadvertently touching his own blade. Guards came in numerous variations, the most common being a simple tine extending one to two inches along the blade. Other lightsabers featured more elaborate double or triple guards, with multiple tines extending from the hilt. Exar Kun's lightsaber, for example, featured a quadruple guard. Some lightsabers featured \"wraparound\" guards, with rings circling the blade attached to the tines. Some were quite simple, such as the angled wraparounds on Starkiller's dual-lightsabers. Others were far more ornamental, featuring multiple rings all interlinking with one another. This ornamental guard design was exceedingly popular among Jedi just after the Great Sith War."}, {"tag": "p", "text": "Some lightsabers featured an unusual configuration that included both an emitter shroud and a blade guard. It remains unknown what the standard for such a combination emitter was, but the lightsaber of the Sith Lord Darth Baras featured an emitter shroud and a triple-guard assembly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}