{"url": "Blade_of_Ochi_of_Bestoon", "categories": ["Category:Canon articles", "Category:Weapon stubs", "Category:Daggers", "Category:Personal weapons", "Category:Sith artifacts"], "nodes": [{"tag": "h1", "text": "Blade of Ochi of Bestoon"}, {"tag": "p", "text": "The Blade of Ochi of Bestoon, or simply Ochi's blade, was a knife owned by the Sith cultist and assassin, Ochi of Bestoon."}, {"tag": "p", "text": "The Sith assassin and relic hunter Ochi used this melee weapon to kill many, including the Force-sensitive Rey's father and mother. As a result of such deeds of murder, the Sith dagger resonated in the Force with the evil imbued within, thus shocking Rey upon the human Jedi-aspirant's touch."}, {"tag": "p", "text": "The blade itself was capable of withstanding lightsaber blows, making it a formidable weapon. Additionally, it was inscribed with runes in the Sith language which recorded co-ordinates leading to the location of the wayfinder belonging to Darth Sidious. The droid C-3PO had his systems altered to decipher this inscription, having been prevented from translating the forbidden language by a programming block."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Another example of the Sith language inscription was provided in Star Wars: The Rise of Skywalker: The Visual Dictionary. It could be transliterated to the lines quoted above, using the real-world Jedi Journal product of unconfirmed canonicity from Dok-Ondar's Den of Antiquities at Star Wars: Galaxy's Edge, which provides a translation between the alphabet of High Galactic and a script similar but not directly comparable to that of the language of the Sith shown on Ochi's dagger."}, {"tag": "p", "text": "A Fandom article notes that the inscription's \"Isaiwinokka Hoyakuts\" has only slight deviations from becoming Tsaiwinokka Hoyakut, which meant Reanimated Dead in the Sith language, as per the Legends reference book Book of Sith: Secrets from the Dark Side."}, {"tag": "p", "text": "In addition, \"Itharii\" bears a similarity to Sith'ari, also from the Book of Sith, which meant Sith Overlord, and a title similar to that of the Jedi's Chosen One. The mantle was assumed by Darth Sidious, who saw himself as the ultimate Sith, just as his Canon counterpart did."}, {"tag": "p", "text": "Following \"Itharii\" was the mention of \"Exegol,\" which housed the Sith Citadel and its Throne of the Sith, lair of Darth Sidious' Sith Eternal, and finally \"Eternal One,\" echoing the ambition of Darth Sidious and the title of the Chosen One."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}