{"url": "1.4_FD_P-Tower/Legends", "categories": ["Category:Legends articles", "Category:Atgar SpaceDefense Corporation products", "Category:Ground-based laser cannons"], "nodes": [{"tag": "h1", "text": "1.4 FD P-Tower"}, {"tag": "p", "text": "The 1.4 FD P-Tower was a light anti-vehicle fixed emplacement artillery weapon produced by Atgar SpaceDefense Corporation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Manufactured by Atgar SpaceDefense Corporation, the 1.4 FD P-Tower was a light laser cannon employed as a fixed emplacement anti-vehicle weapon. It was designed to target a variety of enemy vehicles, including repulsortanks and landspeeders, although it had difficulty targeting fast-moving vehicles. The unit was quick to produce."}, {"tag": "p", "text": "The main bulk of the weapon was a 2.8 meter high energy dish that had sixteen micropower routers spaced evenly along the outer edge, and eight power conversion cells along the interior of the dish. Targeting sensors were placed on the upper edge of the dish, and a single light laser cannon emanated from the center of the dish. To fire the weapon, energy was fed directly into each micropower router which held the charge until the firing computer registered that the Energy Conversion Point had been achieved. The power conversion cells around the dish glowed once the weapon was primed to fire. At that point, the firing computer channelled the energy from the router into the main power converter located at the center of the dish, firing the weapon. The energy beam moved through the discharge barrel, into the galven circuitry and through the focusing lens to produce a low-power beam that was effective against repulsorcraft, landspeeders, and airspeeders."}, {"tag": "p", "text": "The 1.4 FD P-Tower was considered to be an all terrain weapon, and could operate in temperatures from minus 100 degrees Standard, to plus 120 degrees Standard. The entire weapon could rotate three hundred and sixty degrees on a rotation platform for a full field of fire. At a cost of 10,000 credits, the weapon was inexpensive, costing less than half as much as similar weapons on the market. A blast from the weapon was equal to a standard artillery unit, and was known to take down vehicles as large as an All Terrain Scout Transport walker. Although designed to counter repulsortanks, the armor on heavy repulsortanks and All Terrain Armored Transport were able to deflect blaster bolts. In practice, the weapon was often more effective against stormtroopers than repulsorcraft."}, {"tag": "p", "text": "At the rear of the unit was the firing computer linked to a targeting scope, along with a targeting and elevation mechanism that raised and depressed the dish. The P-Tower's hadrium-iode tracking system was capable of following targets through extreme weather. The targeting computer was unable to predict high-speed maneuvers from fast-moving craft, meaning that scoring direct hits on such craft was often down to the skill of the unit's gunners."}, {"tag": "p", "text": "The design of the 1.4 FD P-Tower had several drawbacks. The weapon's main power converter was calibrated to specific power needs, fed from the micropower routers. If a single router was to fail or malfunction, the entire firing mechanism would shut down. The 1.4 FD P-Tower utilized an Atgar C-6 battery, which only retained enough power for eight shots before needing to be replaced. The battery was easy to replace when handled by a skilled technician. When hooked up to a power generator, the weapon had unlimited fire capability. The weapon also suffered from a low fire rate, and required ten seconds to build up an adequate charge. The visible dish was also a tempting target for opponents."}, {"tag": "p", "text": "The weapon required a crew of four to operate, although the operators were all vulnerable to attack as the turret was not enclosed, leaving them vulnerable to enemy fire. The lead operator—known as the chief gunner—aimed and fired the weapon. The unit possessed an integrated targeting scope, but many operators were reluctant to stand so close to the weapon in an exposed position, so they used an artillery remote containing a small joystick controller attached to a portable firing computer with a readout screen. The other crew members were engineers who regulated the energy flow from the battery to the micropower routers and monitored the long recharge time between each shot, as well as replacing the battery once depleted. The weapon itself was protected by light armor plating."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Produced by Atgar SpaceDefense Corporation, the 1.4 FD P-Tower was introduced during the Clone Wars. A fixed emplacement weapon, it was deployed on military installations, space stations, and other facilities. By the time of the Galactic Civil War, the 1.4 FD P-Tower was outdated and readily available for purchase on the black market, and was used heavily by both mercenary and Alliance to Restore the Republic units, even though the weapon was no longer standard issue for the Galactic Empire who had progressed on to use more advanced models of anti-vehicle weaponry. In light of its continued use, Army Command was conducting a review regarding the inclusion of the weapon on the updated standard issue list for the Imperial Military, although it was found in service on some of the Empire's Outer Rim planets."}, {"tag": "p", "text": "Due to its inexpensive cost, it was primarily used by the Alliance, and it was their most common piece of field artillery. It was detested almost universally by Alliance infantry commanders, who considered the weapon underpowered and unable to damage heavier Imperial combat vehicles. They questioned the use of an artillery weapon that limited their mobility and provided no protection to their operators. Despite the inexpensive cost of the 1.4 FD P-Tower, the weapon was still too expensive to abandon on the battlefield. In addition, the Alliance had trouble securing an adequate supply of replacement batteries to keep their units in combat readiness, and the distinctive glow given off by the power conversion cells proved to be a detriment if using the weapon at night as it could give away defensive positions. Although the low price tag kept the weapon in service, the Alliance began to slowly phase out the 1.4 FD P-Tower."}, {"tag": "p", "text": "The Alliance utilized P-Towers to defend Echo Base on the planet Hoth, as well as in the defense of several other major bases and installations. The P-Tower's contribution to the defense of Echo Base on Hoth was crucial to allowing the Alliance troops to delay the Imperial advance long enough to carry out their evacuation of the base."}, {"tag": "p", "text": "The New Republic conducted experiments into improving the 1.4 FD P-Tower, such as improving the weapon's range, overhauling the power system, and adapting the unit to take a power feed from a larger-scale generator. All generally failed due to the incompatibility of the weapon's decades-old electronics with modern technology. The failure of these projects, slow rate of fire, and the vulnerability of the operating crew led to the decision to phase the weapon out of service, and the unit was found only in the service of mercenaries and pirates. With the conclusion of the Galactic Civil War, the New Republic decommissioned its remaining P-Towers in favor of repulsorlift-equipped weapons platforms."}, {"tag": "p", "text": "By the time of the resurrected Emperor's assault on the New Republic, the 1.4 FD P-Tower was an optional mounted weapon for SedriMotors Limited's Amphibion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A likeness of the Atgar 1.4 FD P-Tower was released as an action figure accessory under the name \"Radar Laser Cannon\" as part of Kenner's The Empire Strikes Back mini-rig toy line. Smaller than vehicles or playsets, the mini-rigs were fairly inexpensive and provided more play value at a lower cost to consumers than many of the larger accessories. As with many Kenner toys, a secret button caused the cannon to \"explode\"."}, {"tag": "p", "text": "The November 2003 The Empire Strikes Back expansion set of the Star Wars Trading Card Game features an image of the Golan Arms DF.9 anti-infantry battery on the set's \"Antivehicle Laser Cannon\" card, which actually describes the 1.4 FD P-Tower laser cannon. An image of the 1.4 FD P-Tower laser cannon appears on the \"Anti-Infantry Laser Battery\", which describes the Golan DF.9."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}