{"url": "Blaine_Hansom", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Blaine Hansom"}, {"tag": "p", "text": "Blaine Hansom was a human smuggler who flew an old YT-1300 light freighter. He was known for his trademark trenchcoat and long brown sideburns."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Despite the disapproval of his parents, Hansom enjoyed living the life of a free-trader, especially the ability to visit new worlds. However, as the Galactic Empire continued to tighten restrictions on trade and increase the number of goods listed as contraband, his ability to make a living was challenged. In order to avoid losing his treasured freedom, he was forced to take a considerable amount in loans from a mobster in order to purchase his ship. The identity of this creditor was unknown, and speculation ranged wildly on this point; it was known that the person behind the money was a real slimeball, with a violent sense of humor. Bounty hunters were set on his trail."}, {"tag": "p", "text": "When last seen, Hansom was hiding out in the Wroona starport, looking for a partner to help operate his ship. His only obvious goal is to pay off his debts and regain his ability to take on the jobs he desires. To this end, he took a job from an unnamed contact: simply deliver a datapad to a friend on Salliche. The \"friend\" turned out to be retired general Locus Geen, whom Hansom suspected was working with the Rebel Alliance. Hansom, however, concluded that the money was worth the risk and had arranged to meet the contact at the starport to make the pick-up. Immediately after receiving the datapad (and his money up-front), a squad of Imperial Stormtroopers arrived and interrupted the meeting. Hansom shot his way out of the encounter and fled into the alleys surrounding the starport. Ducking into a cantina, Hansom had close encounters with the Sullustan bartender Vanb, a Rodian bounty hunter named Tolga (who was after the bounty placed on Hansom's head), and the smuggler Platt Okeefe and her Twi'lek partner Tru'eb Cholakk. When the Stormtroopers pursuing Hansom came in the front door, Hansom, Okeefe, and Tru'eb headed out the back, where they parted company. At the end of the encounter, Hansom headed to the docking bay where his ship was parked."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hansom is known to be a smart, good-looking Human male. He started his career young, but by age 24 he had already become so deeply indebted that potential involvement in the Galactic Civil War could have been a prudent financial move as he was known to be a fine pilot. He is otherwise considered to be a fine businessman, with a cynical eye and a tough, straight-faced style. He was not above paying bribes—although he complained about the rate at which the cost of bribes had increased—and making sharp or shady deals. His biggest flaw was a belief that he could still make one, big score in order to reverse his fortunes."}, {"tag": "h2", "text": "Sources"}]}