{"url": "Blaze_of_Glory_(short_story)", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal fiction", "Category:Tales from the Empire"], "nodes": [{"tag": "h1", "text": "Blaze of Glory (short story)"}, {"tag": "p", "text": "\"Blaze of Glory\" is a short story written by Tony Russo originally published in Star Wars Adventure Journal 8 by West End Games in November 1995. The short story was also later compiled in the short story anthology Tales from the Empire which was published in November 1997 by Bantam Spectra, and most recently archived online at Hyperspace."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Brixie Ergo is on her first mission with the mercenary group known as the Red Moons. With her is pilot and über-merc Lex \"Mad Vornskr\" Kempo, demolitions expert and possibly insane Hugo Cutter, and their leader, the Trunsk Sully Tigereye. They are on a job to Gabredor III, a planet full of thick jungles and one of the strongholds of the Karazak Slavers Cooperative. On their way to land, their Corellian light freighter breaks down, crashing in the jungle below and forcing the four sentient crew to abandon ship in an escape pod. After a rough landing, the mercenaries make their way through the jungle."}, {"tag": "p", "text": "At the Karazak base, slave master Greezim Trentacal oversees the loading of the next shipment of slaves. Among them are the two children of the ambassador of Cantras Gola, a planet that is part of the Imperial faction known as the Pentastar Alignment. The children have been captured as hostages to keep Cantras Gola from defecting to the New Republic. Trentacal learns of the freighter crash from his Defel bodyguard Vex and orders a search."}, {"tag": "p", "text": "In the jungle, the mercenaries deal with the local wildlife, slaver scouts, and hidden traps. They soon reach the slaver camp and try to devise a way to defeat the superior forces and firepower. Using Cutter's demolition skills, the mercs create a sizeable distraction, allowing Sully to infiltrate the slaves in order to free them while Brixie and Kempo come up with a plan to destroy the command bunker. They decide to ram it with a grav-cart rigged with explosives. Realizing that one of them will have to pilot the cart-bomb into the bunker, Kempo volunteers, causing Brixie to see him and her chosen career in general in an entirely new and noble light. Kempo is successful in ramming the cart into the bunker, but is unable to escape before it explodes. Shocked and horrified, Brixie looks for Kempo or what's left of him in the wreckage and has to be dragged away from the fire by Cutter."}, {"tag": "p", "text": "On the Trentacal's ship Atron's Mistress, Sully meets up with Brixie and Cutter. They learn that their objectives, the ambassador's children, are in the slave master's quarters aboard. They enter to find darkness and everyone except the children dead. They also find the Defel, who attacks them from the dark. Before he can kill them, Brixie realizes what he is and Sully finds the lights, making the Defel an easy target."}, {"tag": "p", "text": "Some time later, the three remaining mercenaries fly the cargo ship full of freed slaves away from Gabredor III. As Brixie reflects on the loss of their friend and comrade and what her experience has shown her about life as a merc, she looks back at the planet to see a shocking sight. The fires of the slaver camp, the handiwork of Kempo, burn bright and red in the shape of a fiery crescent: a red moon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}