{"url": "Bleaks", "categories": ["Category:Legends articles", "Category:Mountain ranges"], "nodes": [{"tag": "h1", "text": "Bleaks"}, {"tag": "p", "text": "The Bleaks was the name of a mountain range in the planet Leritor, crossed by several rivers. It was locally notorious because of the big avian fauna inhabiting the area and the frequent, powerful storms affecting the area."}, {"tag": "p", "text": "At some point, a Sith spaceship crash-landed in the Bleaks, and its ruins were buried and partially submerged there. The surviving Sith crewmembers vainly attempted to subjugate the native Sauvax species. The ship was eventually lost and forgotten."}, {"tag": "p", "text": "Several combine-reapers, including the Nellist and the Gevion, farmed the plains to the south of the Bleaks. Around this time, a Dark Side Adept known as Profex Rynalla secretly traveled to Leritor to recover the Bracers of Najus, a Sith treasure in the lost starship. She mounted a slaving camp in the Bleaks, around the starships. Rynalla used pre-manufactured buildings, including barracks and guard towers, and readied an area to land her bulk freighter and her three Vedette snub fighters."}, {"tag": "p", "text": "She and her Klatooinian minions attacked a Sauvax settlement and a combine-reaper crewed by Humans, forcefully recruiting the survivors so that they could work as slaves unburying the ship. One Sauvax survivor to her attack saw her ship returning to the Bleaks."}, {"tag": "p", "text": "Rynalla also organized a lesser camp in the limits of The Bleak, only for two of her soldiers, with the specific purpose of capturing any slave who could have escaped the main camp. Three Human slaves and two Sauvax were captured and tortured to death."}, {"tag": "p", "text": "Rynalla organized the slaves to unbury the Sith starship: Walking in line, they mined stones from the ship's location and placed them near the perimeter of the camp, always watched by Klatooinians armed with heavy blaster pistols and stun baton. Amphibious Sauvax specialized in the deepest area, which was submerged. As they constantly left remains, sometimes including technology, in a stream, certain Sauvax noticed the increase of silt in the river and of fauna movement."}, {"tag": "h2", "text": "Appearances"}]}