{"url": "Bleeding", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Dark side powers"], "nodes": [{"tag": "h1", "text": "Bleeding"}, {"tag": "p", "text": "Bleeding was the process that a dark side adept used by way of the dark side of the Force to bend a kyber crystal to their will, turning it red. It was possible for some light side users to purify corrupted crystals, which would bring them back to the light side and change their color."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Bleeding was accomplished by pouring rage, hate, fear and pain into a kyber crystal by means of the dark side of the Force, until the crystal changed, resulting in the crimson-bladed lightsabers associated almost exclusively with dark side adepts. Since kyber crystals were inherently aligned with the light side of the Force, they could attempt to resist the forced corruption. When Darth Vader first attempted to bleed the green crystal within Jedi Master Kirak Infil'a's lightsaber, he experienced intense light side Force visions which nearly drove him insane."}, {"tag": "p", "text": "Any kyber crystal could be bled by a Force user, including one's own, for example, if they were a former light side practitioner and kept their lightsaber. However, some Sith believed that the proper method was to take a kyber crystal from a Jedi's lightsaber and bleed it."}, {"tag": "p", "text": "It was possible to \"heal\" the effects of bleeding on a kyber crystal, by using the light side of the Force, thus changing the crystal's color again. The process typically resulted in a white crystal."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Empire"}, {"tag": "p", "text": "During the High Republic Era, the Jedi Jora Malli found an ancient Sith lightspear powered by a bled kyber crystal. Malli healed the crystal primarily to see how it was done, but found herself tightly bound to the now-white crystal. She used the crystal in her lightsaber afterwards."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "h4", "text": "Darth Vader"}, {"tag": "p", "text": "Shortly after the formation of the Galactic Empire, Dark Lord of the Sith and Galactic Emperor Darth Sidious explained the bleeding process to his Sith apprentice Darth Vader. Having lost his Jedi weapon on Mustafar, Vader was in need of a new lightsaber. Sidious tasked his apprentice with tracking down and killing a member of the Jedi Order, as Sith tradition dictated that the kyber crystal of a Sith lightsaber must be taken from a Jedi they killed. Vader, having accepted his mission, was able to locate Jedi Master Kirak Infil'a on the river moon of Al'doleem. After killing Infil'a, Vader took his lightsaber with him when he departed."}, {"tag": "p", "text": "On his master's orders, Vader traveled to Mustafar, where he had recently suffered his greatest defeat. Sidious wanted the Sith Lord to bleed Master Infil'a's crystal on the surface of the planet. Upon reaching the planet's surface, Vader entered a cave that was strong with the dark side. He proceeded to dismantle Infil'a's lightsaber and place the master's kyber crystal on a rock."}, {"tag": "p", "text": "Using the Force, Vader began subjecting the crystal to the bleeding technique. However, the crystal resisted, subjecting Vader to Force visions of what his life could be if he chose to abandon the dark. In a vision, Vader returned to the light side of the Force and killed his Sith Master, before returning to his Jedi Master Obi-Wan Kenobi and begging for forgiveness."}, {"tag": "p", "text": "Vader, having been thrown against the wall of the cave by the living crystal, returned to his feet and refused to give in. Grasping the crystal with both hands, Vader unrelentingly subjected the crystal to his pain and regret. Vader screamed as the cave erupted in a stream of Force energy. Eventually, the crystal's will was finally shattered by the Dark Lord, who subsequently returned to Coruscant and presented his efforts to his master. Vader later traveled to Galen Erso's Office on Coruscant, where he found a stash of kyber crystals left behind by Erso and bled them."}, {"tag": "h4", "text": "Inquisitorius"}, {"tag": "p", "text": "The kyber crystals installed in the double-bladed spinning lightsabers wielded by members of the Inquisitorius had undergone the bleeding process. When the Inquisitor Sixth Brother travelled to the moon Raada after hearing of Jedi activity there, the \"Jedi\" in question, former Padawan Ahsoka Tano, had already fled, after ensuring her friends from the Raada resistance were in hiding. The Sixth Brother located and attacked the hideout, killing several rebels and taking Tano's friend Kaeden Larte hostage in order to draw her back to the moon. When Tano, who had by that point joined forces with Senator Bail Organa, learned of what had been going on, she prepared to return to Raada. However, she first travelled to the sacred planet Ilum in an attempt to acquire new kyber crystals, but was unable to land after she discovered that the Empire was strip-mining the world."}, {"tag": "p", "text": "Tano looked into the Force for a clue as to what to do next, and heard a song that led her back to Raada. Arriving, Tano informed the moon's residents of plans for the impending evacuation. During the battle, Tano confronted the Sixth Brother unarmed, and killed him when she pulled on the crystals in his lightsaber with the Force, which caused the weapon to explode. Claiming the crystals, Tano purified them, noting that they seemed familiar and suspecting them to have been looted from the Jedi Temple. After assembling her new white lightsabers, Tano rescued Larte and covered the evacuees as they fled into the waiting ships. She later showed Organa her new weapons onboard the Tantive IV, telling the Senator about bleeding and purification."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "In 28 ABY, proceeding a skirmish on the Minemoon of Mimban, the fallen Jedi and newly-minted Master of the Knights of Ren Ben Solo was traveling in realspace aboard the Night Buzzard. Having recently been seduced by the dark side of the Force, Solo removed his Jedi kyber crystal from his former Jedi weapon. Firmly grasping the crystal in his left hand, Ben began pouring all of his frustration and hatred towards his family legacy into the kyber."}, {"tag": "p", "text": "The Knights of Ren watched in awe as the Night Buzzard was engulfed in charges of dark energy. Remembering the faces of his former loved ones, Ben screamed as the crystal burst into a torrent of fiery energy. Although the crystal had been corrupted, turning a red-yellow hue, it had cracked in the process. Solo placed the crystal in his old lightsaber and activated it, however, due to the crack in the crystal, the weapon was unstable and subsequently short-circuited. In order to counteract the instability of the crystal, Solo modified his lightsaber, making it into a crossguard lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bleeding was first mentioned in the 2016 novel Ahsoka, written by E. K. Johnston. Bleeding first appeared in Darth Vader: Dark Lord of the Sith 5, which was authored by Charles Soule, penciled by Giuseppe Camuncoli, and released on September 6, 2017."}, {"tag": "p", "text": "In Star Wars Legends, Jaden Korr changed a red synthetic lightsaber crystal into a yellow one. The process was called cleansing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}