{"url": "Bledsoe", "categories": ["Category:Legends articles", "Category:Galactic Empire science and engineering personnel", "Category:Healers and doctors", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bledsoe"}, {"tag": "p", "text": "Bledsoe was a Human male doctor who lived during the time of the Galactic Civil War. He served the Galactic Empire as an expert in the areas of disease and medicine. He was an ardent supporter of the Empire's xenophobic policies. Sometime following the Battle of Yavin in 0 BBY, he was captured by members of the Alliance to Restore the Republic and transported aboard one of their CR90 corvettes. While the Corellian corvette was traveling through deep space, the doctor was rescued by a small team of Imperials dispatched by Colonel Darkstone. Doctor Bledsoe also shared the namesake with the deadly Bledsoe's disease, a virus transmitted by air and physical contact."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebel Capture"}, {"tag": "p", "text": "The Human male by the name of Doctor Bledsoe served the Galactic Empire as an expert in the field of disease and medicine during the time of the Galactic Civil War. The leading Imperial scientist was a staunch supporter of the Empire's xenophobic policies, and shared the namesake with Bledsoe's disease, a deadly virus created by Doctor Kaaldar which was transmitted by air and physical contact. Sometime following the Battle of Yavin in 0 BBY, Doctor Bledsoe was abducted by members of the Alliance to Restore the Republic, and whisked away for questioning on board a CR90 corvette towards a Rebel insurgent camp."}, {"tag": "p", "text": "Given Bledsoe's extreme importance to the Empire, his rescue was considered imperative. Ironically, given Bledsoe's xenophobic beliefs, it would be a Non-huMan Zabrak who oversaw the doctor's rescue. At the Imperial Oasis military base on the Outer Rim Territories world of Tatooine, the Zabrak Colonel Darkstone served as the main point of contact in regards to Imperial officers who found themselves in hostage situations. Although he was on the verge of retirement, Darkstone was not willing to give up his post until completing one final mission to rescue the defenseless Imperial scientist. Bledsoe's xenophobic beliefs appeared to have no personal effect on the Zabrak colonel. Darkstone likened Bledsoe's captors to terrorists and animals, and emphasized the importance of rescuing the doctor. To that end, Darkstone tasked an Imperial soldier with the responsibility of locating the Rebels' prisoner transfer orders, to determine the exact whereabouts of Bledsoe. After intercepting faint transmissions discussing Bledsoe's capture, it was believed that the transfer orders could be found at one of three locations, including the Woolamander Palace on Yavin 4, the Mokk Stronghold on Dantooine, and the Droid Engineer cave on Lok. After investigating these three locations, the Imperial soldier serving under Darkstone finally discovered the Alliance document detailing the prisoner information on Doctor Bledsoe, including scheduled times at which he would be moved. After returning this information to Colonel Darkstone at the Imperial Oasis, it was determined that Bledsoe was still on board the Rebels' Corellian corvette, traveling through deep space."}, {"tag": "h3", "text": "Rescue Operation"}, {"tag": "p", "text": "To enact a daring rescue, Colonel Darkstone's Imperial soldier assembled a ragtag group of Imperials and was instructed to travel to the Emperor's Retreat on Naboo to meet with a shuttle pilot. At the Emperor's Retreat nestled within the Gallo Mountains, a TIE pilot sat beside a Lambda-class T-4a shuttle. After handing over a travel authorization form provided by Darkstone, the TIE fighter pilot aided the Imperial soldier and their rescue team by piloting the shuttle and intercepting the Corellian corvette holding Doctor Bledsoe. After making contact with the corvette, and forcing their way on board, the Imperial rescue team fought their way through the many corridors of the small capital ship. Despite facing resistance from a large number of Rebel crew members, the rescue team successfully gained access to the prison cell holding Doctor Bledsoe and freed him. The doctor expressed his gratitude to his rescuers, and referred to his Rebel kidnappers as \"vermin.\" After securing the prisoner, Bledsoe and the rest of the Imperials used the escape pods to flee the besieged starship. For their part in saving the Imperial doctor, all members of the rescue team were awarded the Imperial Valorous Services Medal. Upon returning news of Bledsoe to Colonel Darkstone in the Imperial Oasis, members of the team were also awarded with schematics for an AV-21, a Mobquet high-performance landspeeder. Thanks to the success of the mission, Colonel Darkstone finally considered beginning his retirement, and mused that he would move to Naboo to get a little place near the city of Kaadara."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bledsoe was an intelligent scientist, and a whole-hearted supporter of the Empire's xenophobic policies. While he was being held prisoner on board a Corellian corvette, Bledsoe viewed his Rebel captors as vermin and rodents who needed to be wiped out to prevent them from breeding and spreading. Despite this extreme attitude towards his enemies, the accomplished Imperial doctor nevertheless expressed a measure of gratitude towards the team of Imperials who helped him escape his confinement."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his imprisonment, Doctor Bledsoe wore a bright orange trader's flight suit which doubled as type of prisoner garment. During his time within the holding cell of the Rebels' Corellian corvette, he also wore orange padded armor boots and a gray wide-buckle belt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name Bledsoe was first indirectly mentioned as Bledsoe's disease in Tatooine Sojourn, a comic strip published by the Los Angeles Times Syndicate between September 10 and November 5, 1979. However, Doctor Bledsoe did not make his first appearance until he was included as a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "Bledsoe was officially added to the game on April 13, 2004 as part of a new series of instanced dungeon quests featuring the Corellian corvette. Nine quests were added in total, including three destroy missions, three assassination missions, and three rescue missions for Imperial, Rebel, and neutral players. Bledsoe was featured in the Imperial rescue version of the quest. The quest could be initiated by speaking to Colonel Darkstone at the Imperial Oasis on Tatooine. From there, players were required to investigate three locations, including the Woolamander Palace on Yavin 4, the Mokk Stronghold on Dantooine, and the Droid Engineer's cave on Lok for clues regarding Bledsoe's whereabouts. At one of those locations, players would discover a prisoner transport order which needed to be delivered back to Darkstone to receive a travel authorization form for travel from the Emperor's Retreat on Naboo. Upon doing so, players would finally be allowed access to board the Rebel Corellian corvette holding Doctor Bledsoe. After fighting their way through the instanced dungeon, players could speak to Doctor Bledsoe, free him, and receive a badge and AV-21 schematic for successfully completing the mission."}, {"tag": "p", "text": "Although it was possible to complete this quest entirely alone, a feature article on the official Star Wars Galaxies website titled \"The Corellian Corvette\" indicates that the quest was intended to be a group effort. Therefore, this article assumes that a group of Imperials were responsible for rescuing the doctor, and not just one individual."}, {"tag": "p", "text": "When players conversed with Doctor Bledsoe, he would ask the player if all the Rebels were killed. If the player answered in the affirmative, Bledsoe would thank the player, and the mission could be completed. If the player answered otherwise, Bledsoe would urge the player to \"cleanse the ship\" of its Rebel presence. If the player refused by selecting the option, \"Genocide is not my thing, doctor. I think our work here is done,\" then Bledsoe would condemn the player, and promise to report them to their superiors. Regardless of which chat option the player selected, Doctor Bledsoe would still head for the escape pod, and the mission could be completed. This article assumes that the Imperial players acted dutifully, and did not disobey Bledsoe's wishes. Furthermore, although players could refrain from participating in the Corellian corvette quest entirely, this article assumes 100% game completion."}, {"tag": "p", "text": "Because Doctor Bledsoe spawned under the generic \"dr_bledsoe\" template utilizing five different Interchange File Formats, his appearance was randomized under one of five possible depictions. Bledsoe could appear as a male Rodian, Zabak, Kajain'sa'Nikto, or two versions of Humans. Because \"The Corellian Corvette\" feature article describes Bledsoe as a scientist who agrees \"whole-heartedly with the Empire's xenophobic views of the universe,\" this article surmises that he was a Human, and that one of the two Human male depictions may be canon in the Star Wars Legends continuity. Doctor Bledsoe later received an entry in The Complete Star Wars Encyclopedia, published on December 9, 2008 which included much of the information already mentioned in \"The Corellian Corvette\" feature."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}