{"url": "Blerx_Tango", "categories": ["Category:Legends articles", "Category:Bith", "Category:Males", "Category:Musicians", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Blerx Tango"}, {"tag": "p", "text": "Blerx Tango was a male Bith musician and leader of a band called the Dewback Ramblers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Battle of Yavin, Blerx Tango and the Dewback Ramblers operated out of the Lucky Star cantina in Mos Entha. Tango was the leader of the band and played kloo horn."}, {"tag": "p", "text": "Circa 1 ABY, he learned that a fellow band member named Jakko Mixon got stranded in the desert. Jakko had fallen for an old trick, a scam where he believed he would get a cheap ride to Bestine. Fortunately, Blerx managed to employ the help of a spacer, who sought out to find Jakko, and bring him back safely to Mos Entha. However, the troubles had not yet ended for Blerx's band members. His Ithorian ommni box player, Mellaw Doowon, needed to be escorted back safely after making some bad jokes with Imperial authorities. Once again, the spacer was tasked to find Mellaw, and bring him back to Blerx. Unfortunately for the spacer, a stormtrooper would not let Mellaw be escorted back. The stormtrooper opened fire, forcing the spacer to kill the trooper. Yet the ordeals were not yet over. Another band member, Baze Joz, ended up biting an agent from the Imperial Security Bureau. Committed, the spacer sought out Baze Joz, so that he too could be brought back to Jakko. When the spacer approached Baze, he was attacked by three Imperial sergeants. The three sergeants were ultimately dispatched by the spacer, allowing him to bring Baze home safely. In addition to the credits that Blerx provided the spacer, he was also awarded a nalargon for his service."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Blerx Tando was a Non-Player Character (NPC) in the MMORPG Star Wars Galaxies, prior to its closure on December 15, 2011. In the game, players aligned with the Rebellion could help Blerx rescue his three band members."}, {"tag": "p", "text": "It is likely that this Bith musician was intended to be the same as the Bith musician Blerx from the comic \"Nerf Herder\". Two other characters from the same comic, JillJoo Jab and Domo Jones, were used in the game, too."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}