{"url": "Blockade_of_Ibaar", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of the Galactic Civil War", "Category:Blockades", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Blockade of Ibaar"}, {"tag": "p", "text": "The blockade of Ibaar occurred in 4 BBY, during the Galactic Civil War when forces of the Galactic Empire blockaded the planet Ibaar, cutting the Ibaarian people off from vital supplies to lure rebels to their destruction in any attempt to help the people on the planet. The rebellion, through the Phoenix Cell and the Spectres, launched operations to deliver supplies to an underground network of Ibaarian resistance forces. The first attempt to deliver supplies failed, as the rebellion was outgunned, leading Captain Hera Syndulla to acquire a prototype B-wing starfighter known as the Blade Wing. The Blade Wing gave the rebellion enough firepower to succeed in their second run at the blockade, allowing them to deliver the supplies to the Ibaarians."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After taking part in relief efforts to alleviate the energy crisis on Rinn, the Phoenix Cell and the Spectres took part in an operation to deliver relief supplies to the planet Ibaar. The Galactic Empire had doubled their work quotas and cut their rations, causing a famine. Without any food supplies, the Ibaar resistance feared that the most vulnerable among them would perish. The Phoenix rebels loaded food supplies aboard a CR90 corvette and headed to the planet. However, an Imperial fleet under the command of Imperial Security Bureau Agent Kallus had blockaded the planet with a fleet of Arquitens-class command cruisers and TIE fighters."}, {"tag": "h2", "text": "The blockade"}, {"tag": "h3", "text": "The first attempt"}, {"tag": "p", "text": "During the first attempt, the Phoenix rebels and the Spectres tried to break through the Imperial blockade. After emerging from hyperspace, Phoenix Squadron and the Spectres' starship Ghost attempted to escort the CR90 corvette carrying the supplies through the blockade. Kallus dispatched TIE fighters to harass the rebel ships. After realizing that the corvette was carrying the relief supplies, Kallus ordered all ships to concentrate fire on the vessel. The Imperial laser fire damaged the ship's deflector shields. Just when the ship made it through the blockade, a blast from an Imperial warship destroyed the vessel and its supplies. With the corvette destroyed, the Phoenix rebels were forced to retreat. During the retreat, Phoenix Leader was killed when his A-wing starfighter was destroyed."}, {"tag": "h3", "text": "The Blade Wing"}, {"tag": "p", "text": "Despite this major setback, the Spectres were unwilling to give up their attempt to break the Imperial blockade of Ibaar. While the Phoenix rebel fleet prepared for another blockade run, the Ghost's captain Hera Syndulla and the rebels Sabine Wren and Garazeb Orrelios traveled to the planet Shantipole. From Captain Rex, the rebels had learned that a certain Mon Calamari engineer named Quarrie had developed a prototype Blade Wing starfighter. However, he was only prepared to discuss his starfighter on Shantipole."}, {"tag": "p", "text": "Meanwhile, Kanan Jarrus along with Ezra Bridger and Chopper took the Ghost to pick up supplies from another rebel ship in deep space. While picking up the supplies, Kanan informed the other rebels that the Ghost had been designated as the new transport ship for the second attempt. Back on Shantipole, Hera and her companions managed to find Quarrie after a dangerous flight. After ascertaining Hera's flying abilities, Quarrie allowed her to fly the Blade Wing starfighter. Hera flew the Blade Wing and deemed it a worthy starfighter. After reworking the prototype's engines, the rebels and Quarrie traveled back to Ibaar with the Blade Wing. Since the Blade Wing's hyperdrive was drained from the earlier weapons test, the fighter was ferried to Ibaar by the auxiliary ship Phantom; which had been upgraded with hyperdrive system by Quarrie."}, {"tag": "h3", "text": "The second attempt"}, {"tag": "p", "text": "Unable to wait for Hera to return with the Blade Wing, the remaining crew of the Ghost and the Phoenix rebels made a second attempt to break the Imperial blockade of Ibaar. Agent Kallus quickly realized that the Ghost was carrying the relief supplies and ordered his ships to open fire on the vessel and to block its path. Unable to break through the blockade, Kanan made preparations for a second jump. Fortunately for the rebels, Hera and the others arrived with the Blade Wing starfighter. Piloting the vessel, Hera used the starfighter's multi-cannon system to destroy one of the Imperial light cruisers. This cleared a path for the Ghost to breach Ibaar's atmosphere and airdrop the supplies to the Ibaar resistance. Having completed their mission, the Phoenix fleet jumped into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By delivering supplies to Ibaar, the Phoenix rebels were able to alleviate the famine and suffering of the Ibaarian people. Following the blockade bust, the sympathetic Alderaanian Senator Bail Organa took an interest in Quarrie's Blade Wing starfighter and found a shipyard that was willing to produce more of the starfighters in secret. Quarrie agreed to help the rebellion in return for being able to supervise the manufacturing of these starfighters. Quarrie's Blade Wing prototype became the basis for the Rebel Alliance's A/SF-01 B-wing starfighters. Due to her leadership and efforts to obtain the Blade Wing, Hera was promoted to the position of Phoenix Leader; giving her more responsibilities in the Phoenix Squadron. For Agent Kallus, the Blockade of Ibaar became one in a long string of failed attempts to apprehend the Spectres."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Blockade of Ibaar first appeared in the Star Wars Rebels episode \"Wings of the Master,\" which premiered on Disney XD on November 11, 2015. It provided an origins story for the B-wing starfighters which first appeared in Star Wars: Episode VI Return of the Jedi in 1983."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}