{"url": "Blockade_of_Corellia", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battles of Corellia", "Category:Battles of the Second Galactic Civil War", "Category:Blockades", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Blockade of Corellia"}, {"tag": "p", "text": "The Blockade of Corellia was a significant crisis that occurred during the Second Galactic Civil War."}, {"tag": "p", "text": "Once talks between the Galactic Alliance and Corellia were going nowhere, Jacen Solo and Admiral Cha Niathal proposed the blockade as a solution to the growing problem of Corellian terrorist attacks on the Galactic capital, Coruscant. Chief of State Cal Omas was reluctant at first, but he was faced with little alternative; he had already turned down the proposal to strike Corellia's shipyards. He declared the Blockade and Niathal ordered Alliance fleet elements to move in."}, {"tag": "h2", "text": "Creating the Blockade"}, {"tag": "p", "text": "Admiral Niathal granted Colonel Jacen Solo's request that he fight on the frontlines and gave him command of Rogue Squadron, with Lieutenant Colonel Jaina Solo and Zekk as his subordinates. There were several clashes during the Blockade as the Corellians attempted to re-supply the orbital factories and shipyards which still held thousands of workers. Colonel Solo was of the opinion that the more desperate the Corellians were to save the workers, the faster it would back down. On one occasion, several Corellian fighters attacked Solo and his wingmen. In retaliation, Jacen shot down his attacker with what could have been a disabling shot. It led Corellia and the Galactic Alliance into yet another tense moment of semi-war."}, {"tag": "h2", "text": "Escalation"}, {"tag": "p", "text": "Although condemned by rebellious governments across the galaxy, the Blockade proved an intelligent response. However, in an attempt to take supplies to one of the outlying stations, a freighter from Atzerri targeted Solo with its turrets. Acting quickly on her brother's behalf, Jaina Solo disabled the weaponry. Jacen ordered her to finish the freighter off as it retreated, but she refused to do so. Even though his actions were justified in the Rules of Engagement, Jacen shocked the Jedi Order and his family when he fired on the Atzerri freighter, destroying it, and then stripped his sister of her rank for refusal to obey orders. The Atzerri government were outraged at the action and declared it an 'act of war'. The Alliance blockade remained in place, expanding to the other four worlds in the Corellian system. Thus, the military zone around Corellia was merged into a new area of space controlled by GA forces."}, {"tag": "h2", "text": "Stalemate"}, {"tag": "p", "text": "The Corellian Home Fleet engaged in harassment runs against the stronger Alliance forces. Along with Prime Minister Dur Gejjen and other Corellian leaders, Wedge formulated a plan to break the blockade. Unbeknownst to Antilles, Gejjen planned to draw the Hapes Consortium into war by removing their Queen Mother, Tenel Ka, and her daughter Allana. His planned failed when Han and Leia Organa Solo warned the Queen of the plot. During the Battle of Hapes, the Corellian secret fleet was severely damaged."}, {"tag": "h2", "text": "Sith Manipulation"}, {"tag": "p", "text": "The entry of Commenor and the Bothan sector into the conflict on the side of Corellia allowed the blockade to be defeated. The combined fleets were able to force an Alliance withdrawal, although not before the Alliance ships had caused considerable damage to Centerpoint Station. With the GADF withdrawal from the blockade, the Exclusion Zone around Corellia was dismissed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}