{"url": "Blockade_of_Dantooine", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles of Dantooine", "Category:Blockades", "Category:Missions of the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Blockade of Dantooine"}, {"tag": "p", "text": "During the war between the First Order and the Resistance, The First Order blockaded the planet Dantooine, cutting off all communications. The Resistance, through Jade Squadron and members of Ace Squadron, launched an operation to extract three shuttles carrying recruits for the Resistance from Dantooine and successfully escort them back to the Colossus."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the outbreak of the First Order/Resistance War, the First Order occupied and took over the planet Dantooine. The First Order also blockaded the planet with at least one squadron of TIE/fo space superiority fighters. Despite the occupation, the planet was home to several Resistance sympathizers. The Resistance Commander Venisa Doza and her Jade Squadron including Hugh Sion and Norath Kev were tasked with penetrating the blockade and evacuating these Resistance sympathizers offworld."}, {"tag": "p", "text": "Seeking help, they visited the Colossus refueling tanker, which was home to Venisa's husband Captain Imanuel Doza and their teenage daughter Torra Doza. While reluctant to get involved in the war, Doza agreed to lend Torra and two other Ace Squadron pilots Kazuda Xiono and Hype Fazon and to provide temporary refuge for the recruits."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Breaking the blockade"}, {"tag": "p", "text": "Jade Squadron and the three Aces traveled to Dantooine on their starfighters. Upon exiting hyperspace, they engaged a squadron of TIE fighters and quickly wiped them out with no casualties. Having eliminated the opposition, Venisa contacted the Resistance recruits, who departed a spaceport in three shuttles."}, {"tag": "p", "text": "However, one of the TIE fighter pilots managed to warn Commander Pyre and Agent Tierny about the Resistance presence. Commander Pyre dispatched his Star Destroyer to Dantooine. For the operation, Pyre committed his ship's entire complement of TIE fighters including Lieutenant Galek, Second Squadron Commander Tamara Ryvora, and fellow pilot Jace Rucklin."}, {"tag": "h3", "text": "A difficult extraction"}, {"tag": "p", "text": "Jade Squadron and the Aces flew into Dantooine's upper atmosphere where they rendezvoused with the Resistances shuttles. Before they could flee into hyperspace, Commander Pyre's Star Destroyer and dispatched TIE fighters to intercept them. While Venisa, Kaz, and Hugh engaged the TIE fighters, Torra, Hype and Norath were tasked with escorting the three shuttles to safety."}, {"tag": "p", "text": "Venisa quickly took out three TIE fighters. Meanwhile, Tamara narrowly collided with Kaz, who was flying the Fireball. A conflicted Tamara attempted to shoot down Kaz but Hugh shot her starfighter in the rear, damaging it. Meanwhile, Rucklin received orders from Lieutenant Galek to destroy the shuttles before they could escape into hyperspace."}, {"tag": "p", "text": "As the shuttles and their escorts ascended into the upper atmosphere, a TIE fighter eluded Hype and managed to damage Shuttle two's hyperdrive. Torra managed to shoot down the fighter in retaliation. She told the shuttle's pilot to repair hyperdrive while Jade Squadron and the Aces bought them time to escape. With the TIEs losing half of their forces, Tamara tried to convince Lieutenant Galek to order a retreat but she insisted on proceeding with the mission."}, {"tag": "p", "text": "Galek attempted to shoot down the Fireball but was shot down by Venisa, depriving the First Order squadron of their leader. Rucklin exploited an opening in the Resistance formation and destroyed a shuttle's engine, causing it to crash onto Dantooine's surface. Venisa ordered Jade Squadron and the two remaining shuttles to escape into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though Jade Squadron and the Aces managed to break the blockade and evacuate two Resistance shuttles, the mission was blighted by the loss of one shuttle. Kaz, Torra, and Hype were upset at their failure to evacuate all Resistance recruits from Dantooine. Venisa managed to comfort the pilots by reassuring them that experiencing losses was an inevitable part of war and that they should not lose hope. Yeager added that the recruits they managed to evacuate represented a victory."}, {"tag": "p", "text": "Captain Doza also reappraised his non-committal stance on the First Order-Resistance War. He decided to commit fully to the Resistance's struggle and to host the Resistance recruits for the long-term."}, {"tag": "p", "text": "Meanwhile, Agent Tierny promoted Tamara Ryvora to Squadron Leader in the absence of Lieutenant Galek, crediting her squadron with destroying a Resistance shuttle. However, Rucklin, who had shot down the shuttle was bitter that he had not been given any recognition or promotion for his efforts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Blockade of Dantooine first appeared in the Star Wars Resistance Season Two episode \"Rebuilding the Resistance\", which first premiered on Disney XD on January 19, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}