{"url": "Blockade_of_Onderon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Onderon Civil War"], "nodes": [{"tag": "h1", "text": "Blockade of Onderon"}, {"tag": "p", "text": "A blockade of the planet Onderon was the opening skirmish of the Onderon Civil War, and was also a major event of the First Jedi Purge during that time. General Vaklu, cousin of the reigning queen of Onderon, Talia and commander of the Onderon military, had been dissatisfied with his cousin's policy of what he viewed as appeasement towards the Galactic Republic. Vaklu had secretly made an alliance with the Sith, and when they informed him that the Meetra Surik (The Jedi Exile) would soon be arriving on Onderon, he saw his chance to both take his cousin's place and to spoil the Onderon citizenry's view on the Republic."}, {"tag": "p", "text": "Vaklu placed his right-hand man, Colonel Tobin, in charge of the orbital defenses as he himself went to Onderon's capital, Iziz. Tobin authorized a blockade over the planet of Onderon; all Republic vessels were to be seized and searched, causing delays and frustration for pilots who wished to enter the planet to deliver their quotas. The arrival of the Ebon Hawk exacerbated the issue. Under the pretense that the Exile had fired first, Tobin ordered the Onderon military to open fire not only on her ship, the Ebon Hawk, but also on the other freighters that were in orbit around Onderon waiting to dock."}, {"tag": "p", "text": "Vaklu declared martial law and effectively took control of Iziz. He declared that Tobin was a hero who had been attacked first, and that fifteen (as opposed to six) of their defense ships had been destroyed. He also misinformed the public that the Hawk was a capital warship. The Exile fled to Onderon's moon, Dxun, and although most of the Onderon military remained loyal to Talia, they were no match against a Sith armada that quickly appeared to support Vaklu's claim to the throne."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}