{"url": "Blockade_of_Pantora/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Battles in the Sujimis sector", "Category:Battles of the Clone Wars", "Category:Blockades"], "nodes": [{"tag": "h1", "text": "Blockade of Pantora"}, {"tag": "p", "text": "A blockade was set up by the Trade Federation above Pantora during the Clone Wars. Senator Lott Dod told the Galactic Senate that the blockade was set up because of the planet was in debt to the Trade Federation."}, {"tag": "h2", "text": "The blockade"}, {"tag": "p", "text": "In 21 BBY, the Trade Federation blockaded Pantora, leading to unrest among the population who hoped to find aid from the Separatists. The Current Chairman of the planet, Baron Notluwiski Papanoida relied on Senator Riyo Chuchi to plead for assistance in the Senate in ending the blockade. However, Sib Canay hired Greedo and a Gotal bounty hunter to kidnap Papanoida's daughters, Che Amanwe, and Chi Eekway. Papanoida assumed that one of his daughters was being held on the Droid Control Ship blockading Pantora and dispatched Chuchi and Jedi Padawan Ahsoka Tano to go there under the pretense of a diplomatic mission."}, {"tag": "h3", "text": "Tracking Greedo"}, {"tag": "p", "text": "Baron Notluwiski Papanoida and his son Ion Papanoida came to Jabba's Palace looking for Greedo. The chairman asked a group of Twi'leks for the whereabouts of the bounty hunter, one of whom replied that Greedo was offplanet. The Twi'lek, Trella Bare'Ah, who was Greedo's girlfriend, departed and informed Greedo, who was playing a game of chance cubes in the back with two bounty hunters, Brainee and a Weequay, about Papanoida's inquiries. Following Greedo, Brainee and the Weequay attempted to capture Papanoida and Ion, but the Baron turned the tables on them an in turn captured Greedo, holding him at Vibroblade-point. Papanoida brought the group before Jabba the Hutt and presented evidence which forced Greedo to confess to his part in the kidnapping. When they arrived at Chalmun's Spaceport Cantina where Chi Eekway was held, Greedo had his men retrieve Chi from the back of the cantina. His Gotal accomplice, however, began questioning Greedo, who then turned on the Pantorans. As a firefight ensued between the Pantorans and the patrons, Greedo slipped out of the building, while the Gotal hid behind the bar, taking careful aim at Papanoida. Before he could fire his shot, however, he was killed by Chi Eekway."}, {"tag": "h3", "text": "Onboard the Droid Control Ship"}, {"tag": "p", "text": "While on board the ship, Chuchi and Tano secretly searched the vessel for Papanoida's daughters. Hiding in the ship's conference room, the pair overheard Canay and a Neimoidian envoy discussing their dealings with the Separatists. Chuchi nearly gave herself and Ahsoka away by gasping, though they were able to avoid being discovered. The two then began a search of the prison blocks, unaware that they were being monitored. When they found Che Amanwe, who was separated from her sister, they were confronted by a group of Super battle droids and Administrator Sib Canay. Ahsoka was able to dispatch them all before the Neimoidian Gunnery Battalion and the Neimoidian envoy arrived. Chuchi stepped up to point out that the Trade Federation claimed to have no involvement in the the kidnapping and yet Che was being held prisoner and implied that she may bring this matter to the Senate, blackmailing the Neimoidians into letting them leave. When they returned to Coruscant, Dod was forced to lift the blockade and revealed Sib Canay as a Separatist conspirator."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}