{"url": "Blockade_runner_0-9-9", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Galactic Republic starships", "Category:Pelta-class frigates"], "nodes": [{"tag": "h1", "text": "Blockade runner 0-9-9"}, {"tag": "p", "text": "Blockade runner 0-9-9 was the designation of a Pelta-class Transport Frigate in the naval forces of the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. During the Battle of Ryloth, Blockade runner 0-9-9, along with two other Pelta-class frigates. broke through the Ryloth blockade of the planet Ryloth to deliver food and medical supplies to the Twi'lek Resistance during the Battle of Ryloth in 22 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Blockade runner 0-9-9 was a Pelta-class Transport Frigate built by Kuat Drive Yards for the Grand Army of the Republic during the Clone Wars. It measured 282 meters long, had a crew of 900 officers and enlisted crew, and could carry 200 troops. It also had 5 months of consumables. It had a hyperdrive and a navicomputer, with a Class 2 primary hyperdrive and a Class 16 backup. Blockade runner 0-9-9 had point-defense laser cannons and deflector shield generators for defense. It had docking bays on its port and starboard sides. It was also equipped with 16 republic escape pods, which it jettisoned to the surface of Ryloth, filled with supplies, during the battle to help Republic forces. It had a maximum atmospheric speed of 800 kilometers per hour and cost 7,265,000 credits."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, the planet Ryloth had been invaded by the Confederacy of Independent Systems in an engagement that culminated in the Battle of Ryloth. Jedi General Ima-Gun Di and his forces, the Outer Rim garrison, along with the Twi'lek Resistance, had been overrun. Master Di then sent a message asking for help to Admiral Dao, who in turn asked the Jedi High Council for assistance, as he was unable to help Master Di due to the status of his fleet. Dao and his forces were then killed and destroyed during the transmission, and the Jedi Order began to organize a strategy on aiding Republic forces on Ryloth. Jedi Council realized that their standard frigates did not have the range to reach Ryloth unless they were dispatched from the planet Toydaria which would be used as a staging ground."}, {"tag": "p", "text": "The Council dispatched Senator Bail Organa of Alderaan to Toydaria to negotiate King Katuunko of Toydaria on the matter and also sent three Pelta-class frigates loaded with food and medical supplies that were accompanied by Junior Representative Jar Jar Binks of Naboo, including Blockade runner 0-9-9. Separatist leader Count Dooku intercepted the transmission and sent Senator Lott Dod of the Trade Federation to oppose Senator Organa's proposition."}, {"tag": "p", "text": "After a lengthy political debate, it was decided that Toydaria would not be publicly used as a staging ground for delivering relief supplies. In private, however, Katuunko said that the Galactic Republic could send the supplies brought with them to Ryloth as long as Senator Dod did not know. Jar Jar Binks of Naboo had also come and caused a distraction at a formal dinner allowing the frigates to escape unnoticed."}, {"tag": "p", "text": "Meanwhile, on Ryloth, the Republic forces right flank had collapsed, making it impossible to escape. They were stuck in a mountain pass with three ways to their location. Master Di came up with a plan that would involve the Republic forces staying behind. Clone troopers rigged a LAAT/i gunships to explode, collapsing one of the passes. Master Di stayed behind to hold off the Separatist Droid Army while the Twi'lek Resistance fled."}, {"tag": "p", "text": "General Di, Clone Captain Keeli, and their troops held off the droids long enough for the Twi'leks to escape, however, there was no Republic survivors from the skirmish. Despite this, Blockade runner 0-9-9 and two other Pelta's were able to drop supplies so that the Twi'lek resistance could continue on."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Blockade runner 0-9-9 first appeared in the 2010 Star Wars: The Clone Wars episode \"Supply Lines.\" Its formal designation was spelled in the show's subtitles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}