{"url": "Blood/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles needing additional sources", "Category:Anatomy"], "nodes": [{"tag": "h1", "text": "Blood"}, {"tag": "p", "text": "Blood was a bodily fluid that many species had. It provided a way for the body to transport oxygen, nutrients, waste and other things vital to survival over the body. The color of blood varied between species. Most species, including Humans, Chiss, Zabraks, and Aqualish, had red blood. Duros, Falleen, Rodians, and Trandoshans had green blood, T'surr, Rattataki and Talz had blue blood, Geonosians had yellow blood, Judd's species, Devaronians, Aleena, Massassi and Yuuzhan Vong had black blood."}, {"tag": "p", "text": "According to Han Solo, the taste of blood was roughly equivalent to the taste of liquid tin. A blood transfusion from a Force-sensitive to a non-Force sensitive would not grant the latter a connection to the Force. In 3645 BBY, Sith Lord and alchemist Darth Scabrous used a backpack-mounted intravenous device to transplant uncontaminated blood when he was infected by a zombie-creating virus known as \"the Sickness\". This slowed the rate of transformation, allowing him to survive much longer than others who were infected."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Blood is occasionally visible in the Star Wars films. In Star Wars: Episode I The Phantom Menace, Qui-Gon Jinn has blood stains on his shirt when he is stabbed by Darth Maul and a brief splatter of atomized blood can be seen when Obi-Wan Kenobi cleaves Darth Maul. In Star Wars: Episode II Attack of the Clones, Obi-Wan has blood on him after Dooku cuts his arms and legs, though these may be burns since lightsabers tend to cauterize flesh. In Star Wars: Episode III Revenge of the Sith, blood can be seen inside the canisters of the medical droid when Darth Vader is receiving medical treatment after losing the duel on Mustafar against Obi-Wan. In Star Wars: Episode IV A New Hope, Ponda Baba lost his arm to Obi-Wan's lightsaber, which produced a trail of blood. Following that, every subsequent time a limb is amputated on-screen or a wound of any kind is inflicted by a lightsaber, the lightsaber flash-cauterizes the wound, resulting in little to no blood loss or any visible blood. With each instance of mutilation, dismemberment, punctures, or other wounds scene in the Star Wars series, little to no hemorrhaging or gore can be seen, with Padmé Amidala getting scratched by a nexu, Cordé's bloody figure, and the bloody wounds on Shmi Skywalker being some of the last instances of blood in the Star Wars series. It was only until the Clone Wars series and Revenge of the Sith did blood and gore become truly absent from the series, with the exception of Anakin's burnt, mutilated figure after his defeat by Obi Wan. Also, usual deaths on Star Wars will include wounds that are cauterized or burned, with any bloody or gory injuries being shown on screen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}