{"url": "Blood_Carver", "categories": ["Category:Legends articles", "Category:Blood Carvers", "Category:Colonies species", "Category:Insectoid sentient species"], "nodes": [{"tag": "h1", "text": "Blood Carver"}, {"tag": "p", "text": "Blood Carvers were a sentient insect-like race native to the planet Batorine."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Blood Carvers were humanoids with gold skin, dark eyes and beak-like noses. They believed in the Art Beyond Dying, and had orange blood. Their noses served as both olfactory and auditory systems. Among Blood Carvers, extension was an extreme form of probation, a temporary exile from one's clan. Tribal tattoos were common for Blood Carvers, typically lining their upper lips. Changes in the position and coloration of their nose flaps indicated different types of emotions including but not limited to anger, rage, respect, compliance, and intent to kill."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Their name officially came from the statues they carved from blood red trees. When a Blood Carver presented a statue, it immediately wanted flaws pointed out, while compliments were actually tantamount to insults. Creatures had been executed for complimenting works of art. The statues were made for the betterment of the tribe, not the individual."}, {"tag": "p", "text": "The second reason for their name came from the fact that they were very skilled assassins, though it was quite rare for a Blood Carver to mutilate their target. A traditional Blood Carver prayer, offered before battle, ran, \"May my blade be sharp. May I sculpt a new fate for my enemies.\""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Hundreds of years before the Battle of Naboo, the Lontars invaded Batorine and nearly wiped out the Blood Carvers, who joined the Galactic Republic in 110 BBY. The survivors were taken to Coruscant, where they stayed in seclusion. By 29 BBY, there were only several hundred of them left on the planet. Blood Carvers also had a colony on Alderaan before its destruction. Blood Carvers exiled from Batorine sometimes gravitated to small pocket colonies of their own species, sometimes as remote as Nar Shaddaa and other Outer Rim worlds."}, {"tag": "h2", "text": "Blood Carvers in the galaxy"}, {"tag": "p", "text": "A Blood Carver by the name of Ke Daiv, an assassin in the service of Wilhuff Tarkin, and dispossessed by his own people, was, in 29 BBY, the \"first personal kill\" of Anakin Skywalker, then a 12-year-old Jedi Padawan on a mission to Zonama Sekot with his Master, Obi-Wan Kenobi. The mission was also Skywalker's first encounter with Tarkin."}, {"tag": "p", "text": "On Batorine, Blood Carvers were fiercely loyal to their tribes. Those who ventured offworld projected that loyalty on their new companions. Except for exiles, Blood Carvers rarely traveled alone. They found flattery and excess alike offensive and usually disdained egoism or material wealth. Those showing hints of greed or pride were exiled from Batorine. While there were Force-sensitive Blood Carvers, they tended to form their own groups of Force Adepts rather than joining the Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}