{"url": "Blood_Oath", "categories": ["Category:Real-world articles", "Category:Wookieepedia Good articles", "Category:Canceled novels", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Blood Oath"}, {"tag": "p", "text": "Blood Oath was a novel set to be written by Elaine Cunningham and released in April 2009. Issues beyond the author's control led to delays in the submission of the manuscript, which caused Blood Oath's release date to be pushed back first to December, and then to April 2010. In August 2009, Lucasfilm Ltd. and Del Rey had yet to receive a manuscript, and decided to cancel the book."}, {"tag": "p", "text": "Set in 41 ABY, the novel was going to star the Jedi Knight Zekk, who, after having been separated from the Jedi Order, would encounter a pirate captain who was involved in a brewing conflict. Zekk would team up with the Hapan sisters Trista and Taryn Zel to halt the conflict. Jagged Fel, the newly-appointed Head of State of the Imperial Remnant, would have been the focus of another plot that dealt with him settling into his role. However, Blood Oath's cancellation rendered its events non-canon."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "In 2008, Lucasfilm Ltd. extended an existing publishing contract with Del Rey books, granting them the rights to publish forty-five Star Wars books from 2009 to 2013. One of the novels slated for spring 2009 was Blood Oath, which author Elaine Cunningham had been hired to pen; Cunningham had previously written the 2002 Star Wars novel The New Jedi Order: Dark Journey. Prior to the official announcement of the contract extension on StarWars.com, a listing for Blood Oath appeared on Random House's online catalog in early September 2008. The announcement was made one week later, and Blood Oath received a press release on September 18. It revealed that the novel would star the Jedi Knight Zekk and would be set shortly after the events of the nine-book Legacy of the Force series, which had been published from May 2006 to May 2008. At the end of September, Sue Rostoni, the Executive Editor of Lucas Licensing, gave a release date of April 28, 2009."}, {"tag": "p", "text": "Cunningham was late delivering her manuscript of Blood Oath, which prompted Lucasfilm Ltd. and Del Rey to delay its release date to December 2009. It was a move they regretted, as they had hoped for the novel to be released concurrently with Fate of the Jedi: Outcast, a novel scheduled for March 2009 and set two years after Blood Oath. The new release date was December 29. On January 6, 2009, StarWars.com released a publisher's summary and artist Dave Seeley's cover art for the book."}, {"tag": "p", "text": "Cunningham had been blogging about the book, but the deletion of her blog and the removal of Blood Oath from the Random House catalog in June led to fan speculation that the novel had been canceled. Rostoni revealed that the manuscript had yet to be turned in due to events beyond Cunningham's control or wishes, and that although Lucasfilm Ltd. wanted to keep the novel in their lineup, Blood Oath would indeed be canceled if the manuscript was not submitted soon. Assuming that the manuscript came in, the book now had a projected release date of April 2010. By August, however, the manuscript had not been submitted, and Blood Oath was canceled."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Cunningham described Blood Oath as an adventure story that also contained political intrigue, humor, and romance. It was set to feature the Jedi Knight Zekk, who had made his debut in the 1995 young adult novel Young Jedi Knights: The Lost Ones and had played a sizeable role in the subsequent New Jedi Order, Dark Nest, and Legacy of the Force book series. In Legacy of the Force's finale, Invincible, Zekk and his long-time friend and fellow Jedi Knight Jaina Solo had been in battle with Solo's brother, the Sith Lord Darth Caedus, when Zekk's StealthX starfighter had gone missing and his Force signature had disappeared from Solo's senses. Blood Oath was going to begin with Zekk spinning in his StealthX and cover his quest to rejoin the Jedi Order."}, {"tag": "p", "text": "Desperate to contact the Order, Zekk would find himself at the mercy of a pirate captain and in the middle of a volatile conflict that he would work to halt. Along the way, he would encounter the Hapan sisters Trista and Taryn Zel, who had made their first appearance in Invincible. The Zels' cousin Tenel Ka Djo, the Queen Mother of the Hapes Consortium, would be the subject of an assassination attempt by the Imperial Remnant's Council of Moffs, who had uncovered an ancient secret capable of destroying all of the Hapan people. Meanwhile, Jagged Fel, the newly-appointed leader of the Remnant, would step into his role and make efforts to reign in the Moffs and their nest of intrigue."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Blood Oath's cancellation deemed the events that would have happened in it non-canon. The 2010 Fate of the Jedi novel Fate of the Jedi: Backlash, however, featured Zekk and Taryn Zel in minor roles. Set two years after Invincible, it established that Zekk had re-emerged six months after his disappearance romantically involved with Zel, and that neither of them had answered any questions regarding where they had been. The two went on to appear in several other volumes of the nine-book Fate of the Jedi series, as did Jagged Fel and the Imperial Moff Drikl Lecersen, both of whom played prominent roles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}