{"url": "Blood_Razors", "categories": ["Category:Legends articles", "Category:Pirate organizations", "Category:Smuggling organizations", "Category:Swoop gangs"], "nodes": [{"tag": "h1", "text": "Blood Razors"}, {"tag": "p", "text": "The Blood Razors were a swoop gang from Biivren during the time of the Galactic Civil War. Their activities also included smuggling and piracy, in paricular in the Karthakk system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Blood Razors were a swoop gang from Biivren, a minor industrial world in the Expansion Region. They were formed to assist outcast inhabitants of the planet when the big corporations took over. Their primary activity was to traffic black market goods in the guise of swoop races."}, {"tag": "p", "text": "The Blood Razors were also present in the Karthakk system, in the Outer Rim Territories, were they acted as pirates. They controlled the area of space known as the Crimson Talon where they had a small outpost. In space battles, Blood Razors pilots flew Ixiyen-class fast attack crafts and Rihkxyrk-class assault fighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Blood Razors were formed on Biivren during the Imperial Period. Their objective was to bring some justice to the inhabitants of the industrial sector of the world that was controlled by corrupted Imperial and corporate authorities. The gang was led by a swooper named Shirro and Vahcer served as his second in command. The Blood Razors used to raid and plunder Imperial and corporate installations, redistributing the stolen goods to poor citizens."}, {"tag": "p", "text": "The Blood Razors used to visit the Karthakk system long before the Battle of Yavin. At one point, one of their transport ships crash landed on the planet Lok, in the Karthakk system. The criminals soon established operations on Lok and turned their crashed ship into their planetary headquarters. The Blood Razors on Lok were led by Captain Jorund Saleem."}, {"tag": "p", "text": "The Blood Razors were also in conflict with the Kimogila Fanatics. After the Battle of Yavin, the once-peaceful Karthakk system became riddled with war, preventing civilians and freighters easy passage. The Kimogila pirates conquered the Umber Scale region from the Blood Razors, pushing them back to the other side of the Spine of Lok asteroid belt. Hence, the Blood Razors only ventured out from the Crimson Talon territory to attack the Kimogila Fanatics and sabotage their expansion."}, {"tag": "p", "text": "The Blood Razors on Lok were enemies of the Canyon Corsairs and Nym's Lok Revenants. Around 1 ABY, the Blood Razors stole munitions from the Lok Revenants. In an attempt to convince Nym to help the Rebel Alliance, Han Solo tasked a Rebel operative with finding and killing Mahar Spince who had betrayed Nym by helping the Blood Razors. The Rebel agent also killed the Blood Razor leader Jorund Saleem."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}