{"url": "Blood_Raptors", "categories": ["Category:Legends articles", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Blood Raptors"}, {"tag": "p", "text": "The Blood Raptors were a gang operating on Tolea Biqua and Varna Biqua. They wore black synth-hide jackets which had a blood-red claw depicted on the back."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A Blood Raptor ship was accidentally destroyed by the Rodian Teeloo when his approach vector to the Cularin system led to a collision with the bow of the Raptors' ship. In retaliation, seven Raptors under Scar Blenner took Teeloo's cargo, bruised and humiliated him, and forced him to participate in race through Eskaron. They planned on taking his ship, the Neeva-Beelo once they had had their fun with him, even if Teeloo won the race. During the beating, the Velkers were chased by visiting citizens who had almost been knocked down by the Raptors' skiff a few minutes before. Teeloo, who was a bad pilot and owned a battered ship, would have not had a chance in the race, but those same people selflessly offered their help. During the night, seven Raptors with grenades sneaked into Teeloo's docking bay. They aimed to sabotage the Neeva-Beelo, to ease their chances. In the middle of the race, the Blood Raptor pilot—Gael Kinner—destroyed one of Nirama's ships. Nirama's people, led by Len Markus, interrupted the Raptors' attempt to take Teeloo's ship, and took the Raptors and Teeloo's crew to see Nirama. Nirama had at least one of the Blood Raptors (presumably Kinner) fed to a rancor at the Bollin Exotic Animal Emporium. Markus suggested that Teeloo's allies took the Raptors' personal items and weapons before leaving, because the Raptors \"would no longer have use for them.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Living Force Campaign Guide, there was a gang active on Tolea Biqua and Varna Biqua called the Blood Velkers. They might have been a separate gang, or possibly the Raptors were the same gang, renamed between sources due to a typo."}, {"tag": "p", "text": "All the Blood Raptors that appeared were Humans (showing up multiple times in groups of seven, although some of those were probably the same Raptors coming back after escaping earlier encounters). While this was certainly done for ease of stat blocks, it gives the impression that the Blood Raptors may have been speciesism."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}