{"url": "Bloodsniffer", "categories": ["Category:Legends articles", "Category:Creatures of Kamar", "Category:Desert creatures", "Category:Herd and pack creatures", "Category:Mammals", "Category:Mountain creatures", "Category:Non-sentient species", "Category:Predatory creatures"], "nodes": [{"tag": "h1", "text": "Bloodsniffer"}, {"tag": "p", "text": "Bloodsniffers were vicious predators that were among the many dangerous beasts that could be found in the desolate Badlands of Kamar. Possessing a metabolism that consumed potassium at an incredible rate, bloodsniffers ingested their full body weight in fresh blood every two days, piercing the veins and arteries of their victims with their long, sharp tongues. Bloodsniffers lived in small packs, and the territorial creatures were known to attack each other over the blood they needed to survive."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A short, muscular predator native to the deserts of the Wild Space planet of Kamar, bloodsniffers were so named because of their keen senses and heavy consumption of their victims' blood: they consumed their weight in fresh blood every two days, owing to how quickly their metabolism consumed potassium. Bloodsniffers ingested blood to such an extent that they did not eat or drink water, as they received all the nutrients they needed from blood alone. Although they appeared lizard-like, bloodsniffers were actually mammals, and were distinguished by a long, sharpened tongue that facilitated their feeding. They moved about on four legs that ended in sharp claws, and had pure white eyes that sat just below a set of small horns."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Extremely territorial, bloodsniffers tended to live in small packs, ranging from two to eight adults, plus pups. These packs were known to fight each other to the death over  Commonly found within the desolate Kamar Badlands, bloodsniffers were known to favor mountainous areas as their preferred hunting ground, although they could thrive wherever they found enough prey to sustain their need for fresh blood. The bloodsniffer typically attacked its prey by tackling or clawing its victim, then using its pointed tongue to pierce a major vein or artery and drinking its prey dry. This behavior proved to be a boon for scavengers, who often followed bloodsniffer packs, knowing that the predators would leave the flesh of their victims behind once they had their fill of blood."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although bloodsniffers were native to Kamar, their reputation spread as far as the Outer Rim's Quence sector, where they were the namesake of a dangerous swoop gang that plagued local villages during the Imperial Period."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bloodsniffers were first mentioned in Han Solo's Revenge, a novel written by Brian Daley and released in 1979. They were first pictured by Mike Vilardi in 1993's Han Solo and the Corporate Sector Sourcebook, and later by Matt Hatton in 2004's Ultimate Adversaries."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}