{"url": "Blorash_jelly", "categories": ["Category:Legends articles", "Category:Creatures of unspecified diet", "Category:Species of undefined sentience", "Category:Yuuzhan Vong creatures", "Category:Yuuzhan Vong weapons"], "nodes": [{"tag": "h1", "text": "Blorash jelly"}, {"tag": "p", "text": "Blorash jelly, sometimes called quick-jelly, was a Yuuzhan Vong weapon that resembled a formless gelatinous blob, used to immobilize enemies."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Blorash jelly was a living creature, bioengineered by the Yuuzhan Vong to serve as a weapon which warriors could control in battle. The amorphous jelly was carried by a Yuuzhan Vong warrior in a specially-designed pouch, in which it took a compact form. In battle, blorash jelly was hurled at an enemy—usually in the direction of a foe's feet—at which point, the blob expanded. Though it appeared malleable, the jelly was surprisingly strong, and could bind almost any object in a near-unbreakable grip. Brute force could not even shift the grip of the blorash."}, {"tag": "p", "text": "Blorash jelly was able to wrap itself around an enemy's foot, snaking tendril-like globs further up, onto the victim's leg. As it moved, the blorash jelly caused damage to the foe, who was by now, stuck fast. The jelly began to devour the victim's flesh as it traveled, causing hideous injuries even if escape was possible. In some cases, the blorash's owner would not even have to enter the fight; the blorash jelly could kill an enemy if it was not removed quickly. The blorash jelly was not sentient, however it could move and react to body heat or food."}, {"tag": "p", "text": "It could actually be removed in some circumstances. The Yuuzhan Vong could control the weapon, luring it away from a target with food, often so he could engage his enemy in a fair fight, for the honor of the warrior. However, such a scenario was rare, and so the New Republic had to come up with counter-measures against the blorash jelly. Chemicals such as arsensalts broke the jelly's grip, freeing the victim before damage could be caused. Jedi Knights were also able to slice the jelly in half with their lightsabers—though this often worsened the situation, since they now faced two, living blorash jelly pieces instead. Tesar Sebatyne and another Barabel Jedi were able to break free of the blorash jelly by snapping off the ends of their tails, a trick used by their species to escape predators."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}