{"url": "7169", "categories": ["Category:Canon articles", "Category:B1 battle droids", "Category:Trade Federation military members"], "nodes": [{"tag": "h1", "text": "7169"}, {"tag": "p", "text": "7169 was a B1-series battle droid who served in the Trade Federation's Droid Army. In 32 BBY, it was part of the forces deployed to the city of Theed on the planet Naboo by the Federation during its invasion of the world. 7169 was part of a group of battle droids led by the OOM command battle droid 2163 that were tasked with guarding the Naboo Royal Starship in the Theed Hangar."}, {"tag": "p", "text": "The droids were soon approached by a group led by the Jedi Master Qui-Gon Jinn, who was attempting to transport Queen Padmé Amidala off world using the royal starship. After 2163 ordered Jinn and his companions be arrested, the Jedi cut down 7169 and the other droids with his lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "7169 was the designation of a B1-series battle droid manufactured for the Trade Federation. It served as part of the Trade Federation Droid Army and was amongst the battle droids that the Federation brought with them to blockade the planet Naboo over a trade dispute. The blockade then escalated into full scale invasion when 7169 and the rest of the army were deployed to the surface of Naboo, which quickly resulted in the Federation successfully capturing the capital city of Theed and the Monarch of Naboo, Queen Padmé Amidala."}, {"tag": "p", "text": "Once the city was captured, 7169 was part of a group of droids under the command of the OOM command battle droid 2163 that was stationed in the Theed Hangar to guard the Naboo Royal Starship and various hangar personnel who had been captured. 7169 was stood next to unit 1933 and 2163 by the entry ramp to the starship when a group of Naboo, including the recently liberated Amidala, approached accompanied by the Jedi Master Qui-Gon Jinn, his Padawan Obi-Wan Kenobi and the Gungan Jar Jar Binks."}, {"tag": "p", "text": "Jinn hoped to use the royal starship to transport the queen and her allies off planet, and introduced himself to 2163 as an ambassador of the Galactic Republic wishing to take those with him to the planet Coruscant. 2163 rejected the request and ordered 7169 and the other droids present to arrest Jinn and his companions, causing the Jedi Master to swiftly draw his lightsaber and destroy 2163 and 1933 in one motion, then cutting down 7169 and the other droids next to the ship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like all B1 battle droids, 7169 stood 1.93 meters tall and had black sensors and tan plating. It carried an E-5 blaster rifle and was equipped with a comlink booster pack that had the droid's designation written on it in Trade Federation Script."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "7169 first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. In the film, 7169's designation is not spoken, but the numbers are visible on the droid's backpack. In the Star Wars Legends continuity, the droid was additionally identified as 3B3-1204 on a card in the 2001 \"Theed Palace Limited\" expansion for Decipher's Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}