{"url": "Blue_(protocol_droid)", "categories": ["Category:Canon articles", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "Blue  (protocol droid)"}, {"tag": "p", "text": "Blue was a blue-plated protocol droid that belonged to the Koorivar black-market merchant Sheb Valaad. It was equipped with two specialized programs, \"Adul-8\" and \"B-Little,\" which made him particularly obsequious and pleasant. During the second year of the Clone Wars, his arm was severed when Sheb's black market business was attacked by the undercover Jedi Master Quinlan Vos and his colleague Akar-Deshu."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Blue was a customized protocol droid who served the Koorivar black market merchant Sheb Valaad during the Clone Wars. Sheb had purchased Blue equipped with two specialized programs: \"Adul-8\" and \"B-Little.\" While Adul 8 soothed Sheb, B-Little entertained the Koorivar merchant. Blue's master Sheb specialized in selling the stolen jewels, paintings, statues, and other objects of makers who had met \"unpleasant fates.\" Sometimes, Sheb even ordered his henchmen to murder artisans so that he could seize their property."}, {"tag": "p", "text": "Sheb's activities eventually attracted the attention of the undercover Jedi Master Quinlan Vos. Disguised as the Kiffar \"Master Tal, Vos regularly patronized Sheb's shop and bought some items to gain Sheb's trust. During these visits, Tal fraternized with the droid. On one such visit, Blue entertained Tal and informed the Kiffar buyer that his master had agreed to grant him an audience. When Tal told Blue not to call him master, the droid apologized that his current program setting did not allow him to override that designation."}, {"tag": "p", "text": "After the Gamorrean guard Thurg ascertained that Tal was unarmed, Blue allowed Tal to meet with his master. Knowing that the droid could speak multiple languages, Tal then asked Blue how many synonyms his name had in all the languages stored in his databanks. Before the droid could go on verbal overload, Sheb told the droid to ignore Tal's instruction and warned the visitor that he expected compensation should his droid incur any damages. One of Sheb's Twi'lek assistants then brought the small statuette of an aquatic creature for the benefit of Tal."}, {"tag": "p", "text": "Before Tal could examine the object, Tal's Jedi Mahran colleague Akar-Deshu (\"Desh\") entered Sheb's shop. Desh had been sent by the Jedi High Council to bring Vos back to Coruscant for a new assignment. Tal then took the opportunity to attack Sheb by levitating him with the Force. Alarmed, Blue ran out of the room and brought several body guards to rescue his master. While Blue chattered in the corner, the two Jedi quickly overpowered Sheb's bodyguards with their lightsabers and Force powers. When Blue attempted to reach for one of the fallen bodyguards' comlink, Tal sliced off one of his hands with his lightsaber."}, {"tag": "p", "text": "When Blue gave a high pitched shriek, Tal told him that it could be fixed and chided him not to be a \"baby.\" While Vos was annoyed with Desh for prematurely blowing his cover, he was satisfied that he had learned about Sheb's contacts during his time working undercover. Vos had also used his psychometric powers to trace the ill-gotten objects back to their rightful owners. Before leaving, Vos asked Blue to repeat every known synonym for blue, which numbered in the billions, in order to annoy Sheb."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Blue was a customized protocol droid who was equipped with two specialized programs—\"Adul-8 and \"B-Little\"—which were designed to calm and entertain his master. Blue was also programmed to communicate in multiple languages. Blue was programmed to help his master Sheb run his business by hosting visitors. He was also known to give Sheb's Gamorrean bodyguard Thurg a dressing down for picking his teeth and nostrils."}, {"tag": "p", "text": "Blue was also acquainted with the undercover Jedi Master Vos, who while operating under the pseudonym, had a regular habit of plying him with nonsensical tasks like counting the number of synonyms for his name \"blue\" in various languages. However, prolonged vocalization had the effect of short-circuiting his circuits, according to his master Sheb. Blue was stressed by conflict and the shock of losing his hand made him cry out in pain and shock."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Blue first appeared as a minor character in Christie Golden's 2015 novel Dark Disciple, which was based on eight unproduced screenplays from the canceled Cartoon Network TV series Star Wars: The Clone Wars. Dark Disciple is part of the Canon The Clone Wars Legacy, an ongoing multimedia project using material from the canceled TV series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}