{"url": "720_light_freighter", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Class 720 freighters", "Category:Freighter classes", "Category:Ghtroc Industries products"], "nodes": [{"tag": "h1", "text": "720 light freighter"}, {"tag": "p", "text": "The 720 light freighter, also known as the Ghtroc 720, was a model of light freighter manufactured by Ghtroc Industries and characterized by its tortoise-like appearance. A newer and larger model than the 690 light freighter, it was meant to compete with the Corellian Engineering Corporation's popular YT-series."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The 720 was a heavily armored, but lightly armed light freighter characterized by its unconventional configuration. Instead of occupying the rear mounting, its two banks of GI/80.b Overthruster ion engines were housed in heavily armored nacelles at the bow, on either sides of the bridge. The greater part of the ship's mid section housed its two main cargo holds, with a total capacity of 135 metric tons, and the aft section bore two angled escape pod tubes. Because of that arrangement, the Ghtroc 720 had a rather tortoise-like appearance. It was designed for a maximum crew of two, with room for another eight passengers."}, {"tag": "p", "text": "Although a solid and well-constructed ship by most performance metrics, the 720 had certain design flaws that turned off certain buyers. The most glaring deficiency was its weak armament, which consisted of a single turret-mounted twin light laser cannon. Among its other flaws were its display markings, which were adapted to Bith eyes but small and difficult to read for other species, its uncomfortable crew berths, and the system alerts that each had their unique alarm, which some buyers found irritating."}, {"tag": "p", "text": "As was the case with most light freighter models, the 720 was designed with customizability in mind."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The 720 light freighter was created by Ghtroc Industries, a respected shipwright headquartered on the Bith homeworld of Clak'dor. A scaled-up version of the Ghtroc 690 light freighter, it was meant to corner the light freighter market in the Outer Rim Territories, in a bid to compete with the Corellian Engineering Corporation's YT-series. Although the 720 never became as popular as Ghtroc had hoped, the ship managed to garner a small but devout following among smugglers and free traders in the Outer Rim, and its durability earned it the nickname of \"Pocket Gozanti.\""}, {"tag": "p", "text": "At some point during the Galactic Civil War, the Rebel operatives Sabine Wren, Rex, and Chopper went on a mission to retrieve an illegal modification program contained in the drive of the 720 light freighter Treadwater."}, {"tag": "p", "text": "During her youth on Jakku, Rey frequently practiced piloting the Ghtroc 720 via flight simulator."}, {"tag": "p", "text": "In 35 ABY, at least one 720 joined the fleet assembled in response to General Lando Calrissian's call to action against the Final Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ghtroc 720 light freighter was first introduced the second edition rulebook for the Star Wars Roleplaying Game of Star Wars Legends in 1992. The Ghtroc 720 was later canonized in Before the Awakening, a junior novel written by Greg Rucka and published in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}