{"url": "Blue_Shadow_Virus_(episode)", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Blue Shadow Virus  (episode)"}, {"tag": "p", "text": "\"Blue Shadow Virus\" is the seventeenth episode of Season One of the Star Wars: The Clone Wars television series. It is the seventeenth episode of the series overall. It is the first part of the one-hour special airing February 13."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Padmé and Jar Jar are captured while searching for a secret Separatist bio-weapons lab, sparking Anakin, Obi-Wan and Ahsoka to try and save their friends and halt the release of a deadly virus."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Padmé, Jar Jar and Threepio arrive on Naboo and are greeted by Queen Neeyutnee and Captain Typho. The Queen demands that she petition the Senate or the Jedi High Council to assist them; Padmé says that a scout team of droids is not enough proof, which is why they must analyze the tactical droid caught from the scouting party. After taking out the droid's eyes, they trick it into thinking it is with the Separatists and have it report. All the droid can tell is a top secret lab on Naboo before being crushed by Jar Jar's bumbling when the latter tries to catch a blue bug emerging from one of the battle droid's bodies. It is found the bug could have only come from the Eastern swamps, in whose mud the tactical droid is covered. They contact Master Yoda and Master Mace Windu and ask them to send two Jedi: Obi-Wan Kenobi and Anakin Skywalker. Padmé and Jar Jar then opt to personally search for this secret lab while the others extract as much information from the other droids."}, {"tag": "p", "text": "Out in the plains, a female Gungan shaak herder named Peppi Bow notices that a few of her shaaks start to collapse dead, so she ushers her herd away, realizing that the river they drank from is tainted. Soon after, Padmé and Jar Jar arrive, but they are attacked by Peppi until Padmé brings up her blaster. Peppi directs them to follow the river to find the source and offers to guide them, but Padmé declines, instead sending for an escort back to Theed. As they traverse the swamp, they are being spied on by a camera. Then they find a secret hatch, but there is no way to open it. Suddenly, they are surrounded by battle droids and captured, being placed in stuncuffs and taken to the lab. The man in charge, Dr. Nuvo Vindi, reveals that he has recreated the Blue Shadow Virus, a deadly disease that was wiped out from the galaxy long ago. He had also perfected it, able to turn it from a liquid strain into an airborne strain, which would be used to eradicate the warmongers."}, {"tag": "p", "text": "Upon arriving on Naboo, Anakin, Ahsoka and Obi-Wan learn of Padmé and Jar Jar's departure. Anakin sends Ahsoka with Peppi to find them, while the rest of them analyze the data from one of the lobotomized droids. They find out that Vindi is planning on deploying virus bombs to key star systems. Typho directs them to Vindi's secret lab, which has three entrances. Anakin fears the risk of contamination, but Obi-Wan states that one planet is less than the entire galaxy. Ahsoka and Peppi search the swamp, inadvertently find a spy cam and manage to hide from it. Ahsoka contacts Anakin and Obi-Wan, who instruct her to detonate a bomb in the south bunker while they enter through the hatches. Anakin then joins with Rex and his men to start the mission; Obi-Wan reminds him that the safety of the galaxy is worth more than Padmé's life and she may already be dead. Ahsoka levitates a thermal detonator, perfectly dropping it on the hatch and distracting many of the droids to her position; Rex and his team also arrive to assist her as they hack their way through droids before having to retreat with the entrance of droidekas. This allows the others to infiltrate the base unheard. But as Anakin enters Vindi's lab, he finds Vindi torturing his hostages with electricity, forcing him and his clones to surrender. As Vindi leaves Padmé and Jar Jar to suffer, he runs off with his virus bomb; Anakin breaks free and saves them. Obi-Wan arrives with the Bomb Squad. Unfortunately, as Obi-Wan and the bomb squad finds all the bombs, Vindi activates them. With Vindi and another droid each carrying a detonator, they split up between the two. Obi-Wan tries to catch Vindi, but the villain throws away a number of virus vials, forcing Obi-Wan to catch them while Vindi makes his escape. Meanwhile, Padmé and Jar Jar track down the droid, managing to prevent it from escaping. With the bomb squad's help, they are able to deactivate all the bombs, just as they capture Vindi."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Originally in the script, the tactical droid was a tripedal medical droid. This is why C-3PO says to it, \"We all want to hear your tale of medical heroics.\""}, {"tag": "p", "text": "Originally in the script, after Vindi's servant droid LEP-86C8 took the bomb, it left, never to be seen again. Padmé found the missing bomb in the greenhouse room, hidden for no apparent reason. The addition of the scampering droid with the bomb was made not only for story logic, but to add humor for when it startles Padmé."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}