{"url": "Blue_Squad", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Galactic Republic commando squads"], "nodes": [{"tag": "h1", "text": "Blue Squad"}, {"tag": "p", "text": "Blue Squad was an elite special forces squad of clone commandos within the Grand Army of the Republic that operated during the Clone Wars. Comprised of four clones of the Mandalorian bounty hunter Jango Fett, the commandos took part in a mission to the planet Ord Mantell where they were to recover a diplomatic package that had been bound for Supreme Chancellor Palpatine from a gang of Trandoshan bounty hunters who had stolen it with the intent to sell the item to the Confederacy. During the course of the mission, one of Blue Squad's soldiers was shot and killed by one of the Trandoshans, while the other three fell in an explosion when attacked with a number of thermal detonators. Their fellow commandos in White Squad were able to complete the mission and recover the package, but they too suffered heavy casualties in doing so."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The four members of Blue Squad were clones of Mandalorian bounty hunter Jango Fett, born on the aquatic world of Kamino, located in the remote Wild Space region of the galaxy. Trained as clone commandos and deployed in opposition to the Confederacy of Independent Systems as part of the Galactic Republic's Grand Army following the outbreak of the Clone Wars, Blue Squad served as part of the Grand Army's Special Operations Brigade with their commando comrades, and operated out of Arca Company Barracks on Coruscant. Six months after the Battle of Geonosis, Blue Squad's soldiers were summoned to the headquarters of Republic Intelligence, along with the commandos of White Squad. There, they were briefed by an Advanced Recon Commando intelligence officer who informed the squad that a diplomatic package from Malastare intended to be delivered to Supreme Chancellor Palpatine, had in fact been stolen by a group of Trandoshan bounty hunters. The yellow-marked ARC trooper tasked the squad with traveling to the planet Ord Mantell, where the bounty hunters intended to sell the package to the Confederacy, and recover the package from the Trandoshans."}, {"tag": "p", "text": "On Ord Mantell, White Squad took position on a nearby roof, while Blue Squad enacted a plan to hold the bounty hunters up in the midday traffic. Disguised as a civilian with a tattered brown cloak, one of Blue Squad's commandos blocked the road with a large truck, pretending to be attending to its maintenance. When the three-speeder convoy piloted by the Trandoshans arrived, White Squad's ordnance specialist opened fire with a missile launcher that destroyed the foremost landspeeder belonging to the bounty hunters. Seeing his moment, the disguised commando attacked, but was killed by one of the Trandoshans almost immediately. Now aware that they had fallen into a trap, the bounty hunters attempted to flee, but the remaining members of Blue Squad assaulted the closest speeder. Desperate, the bounty hunters ran down the clone soldiers with their speeder, before one of his associates threw a number of thermal detonators from the rear of the vehicle. The grenades exploded, killing the last of Blue Squad's troops. The commandos would be avenged, however, by the efforts of White Squad, and their sergeant, RC-1013. Although they, too, suffered severe casualties in pursuit of the Trandoshan mercenaries, White Squad's sergeant killed the last of the bounty hunters and recovered the stolen package for return to Coruscant."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The commandos of Blue Squad were armed with DC-17m blaster rifles, the standard issue weapon of clone commandos in the Republic's Grand Army. Also, like all clone commandos, Blue Squad's members were equipped with Katarn-class commando armor. Unlike their comrades in White Squad who each chose a unique paint scheme with which to decorate their individual armor, Blue Squad's soldiers emblazoned their armor suits in a uniform blue coloring with white markings, more in line with the matte-black armor shared by the commandos of Omega Squad, or Yayax Squad's dazzle camouflage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2005, the third volume of the Clone Wars Adventures comics introduced two squads of Republic commandos with the story The Package. Though unnamed in the story itself, Wookieepedia uses the conjectural title of \"Blue Squad\" in contrast to the equally conjectural \"White Squad\" for the squad led by Sarge, simply for the sake of reference."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}