{"url": "Blue_Squadron_(Jedi_Order)", "categories": ["Category:Legends articles", "Category:Galactic Republic starfighter squadrons", "Category:Jedi Order starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Blue Squadron  (Jedi Order)"}, {"tag": "p", "text": "Blue Squadron was the name of a Jedi starfighter squadron in operation prior to and during the Clone Wars. The pilots of Blue Squadron flew mainly A-6 and Delta-7 interceptors, as well as other craft."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 44 BBY, Blue Squadron was sent into battle during the Stark Hyperspace War, and was led alongside Red Squadron by Saesee Tiin. At this period in time, the squadron consisted solely of A-6 Interceptors. Though outnumbered, Red and Blue Squadrons defeated Iaco Stark's fleet through skill and sheer force in the Fifth Battle of Qotile."}, {"tag": "p", "text": "During the Battle of Kamino in 22 BBY, Blue Squadron consisted of Jedi pilots flying Delta-7 Jedi starfighters and was commanded by Jedi General Obi-Wan Kenobi under the call sign Blue Squadron Leader. The squadron was tasked with protecting Tipoca City from any Trade Federation C-9979 landing craft that penetrated Red Squadron's defense. General Kenobi was shot down over the ocean by a droid starfighter, and was rescued from enemy fighters and local fauna by the intervention of his padawan Anakin Skywalker and Kaminoan cloner Taun We. Their starfighters damaged in the process, the two Jedi returned to Tipoca City to battle the invasion forces on foot."}, {"tag": "p", "text": "In the second year of the Clone Wars, command of Blue Squadron had been handed over to Jedi Master Adi Gallia, while Generals Kenobi and Skywalker went on to lead Red Squadron in the Open Circle Fleet. Gallia's Delta 7 squadron was accompanied by V-19 Torrent starfighters and defended Bail Organa's transport from pirates above Coruscant."}, {"tag": "h2", "text": "Blue Squadron roster"}, {"tag": "h3", "text": "44 BBY"}, {"tag": "h3", "text": "22 BBY"}, {"tag": "h3", "text": "21 BBY"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}