{"url": "Blue_Squadron_(Rebel_Alliance)/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Blue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Blue Squadron  (Rebel Alliance)"}, {"tag": "p", "text": "Blue Squadron, also known as Blue Flight, Blue Group, or Blue Wing, was a starfighter squadron active in the Alliance to Restore the Republic during the Galactic Civil War. Its pilots flew T-65 X-wings and B-wings among other starfighters used in the Rebel fleet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Aboard Independence"}, {"tag": "p", "text": "When stationed aboard the Mon Calamari Star Cruiser Independence, Blue Squadron personnel such as senior flight leader Captain Ernek Marskan flew X-wings, BTL Y-wing starfighters, and R-22 Spearhead starfighters. While carrying the Death Star plans, Biggs Darklighter flew a Blue Squadron X-wing that was disabled by an Imperial ambush in the Cron Drift. The squadron later transferred to Yavin Base just prior to the Battle of Yavin."}, {"tag": "h3", "text": "Tantive IV"}, {"tag": "p", "text": "A group of fighters named Blue Squadron served as scouts for Princess Leia Organa's Tantive IV shortly before the vessel was attacked by Imperial forces led by Darth Vader, prior to the Battle of Yavin."}, {"tag": "h3", "text": "Battle of Yavin"}, {"tag": "p", "text": "Blue Squadron served at the Rebel base on Yavin 4, and participated in the Battle of Yavin under the command of Blue Leader Captain Merrick Simms. The squadron was made up of six pilots, all flying X-wings. It was essential in clearing the first Death Star's surface of turrets, and neutralized a larger laser cannon emplacement. Their main goal was to join Green Squadron in an attack run on the station's superlaser in the hope of distracting the Empire from the exhaust port attack."}, {"tag": "h3", "text": "Rescue of Domina Tagge"}, {"tag": "p", "text": "During the Yavin blockade, a Blue Flight led by Luke Skywalker was involved in the rescue of Domina Tagge. Tagge, along with other representatives of the Order of the Sacred Circle, were under attack by four Imperial TIE fighters. During the engagement, three TIE fighters were destroyed, while the fourth retreated back to its Star Destroyer, which fled into Hyperspace."}, {"tag": "h3", "text": "Mission to Arda-2"}, {"tag": "p", "text": "Five X-wings of Skywalker's Blue Flight traveled with Princess Leia Organa to the neutral world of Arda-2 to investigate the presence of T-6 diodem targeting equipment in the weapons systems of Imperial TIE fighters. When Imperial spy Mag Doum alerted Darth Vader to the Rebels' presence, Zon Zorad, a regretful accomplice of Doum's, flew with Blue Flight in injured pilot Cova's X-wing as the flight attempted to repulse Vader's forces' attack on Arda-2. Zorad was shot down by a TIE fighter, perishing alongside his father and Mag Doum in a collision with Vader's Star Destroyer, damaging the Imperial ship and forcing the attackers to retreat."}, {"tag": "h3", "text": "Battle of Hoth"}, {"tag": "p", "text": "During the Battle of Hoth, members from the Rebellion's Blue and Green Squadrons and Rogue Flight were cobbled together and pressed into service as a unified \"Rogue Squadron,\" doubling up as pilots and gunners aboard the Rebels' T-47 airspeeders. The remaining Blues and Greens either piloted evacuating transports or their fighter escorts."}, {"tag": "h3", "text": "Raid on Golrath Station"}, {"tag": "p", "text": "Blue Squadron was joined by Red Squadron for an expedition to an abandoned Rebel base on Golrath to destroy records of their activities contained within the rock of the base's walls. The two squadrons of X-wing and Y-wing starfighters conducted a diversionary raid against the occupying Imperial forces, while Princess Leia Organa attempted to infiltrate the station and sabotage the reactor."}, {"tag": "h3", "text": "First Battle of Bothawui"}, {"tag": "p", "text": "Following the Battle of Hoth, Luke Skywalker formed an unofficial Blue Squadron of Bothan Y-wing pilots for a raid on the Suprosa. Many Bothans died on that mission."}, {"tag": "h3", "text": "Aboard Defiance"}, {"tag": "p", "text": "Another Blue Squadron was assigned to the Mon Calamari Star Cruiser Defiance during the build up to the Battle of Endor. At least one pilot, Blue Eight, was killed in action at the time."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "Blue Squadron, otherwise identified as Blue Group or Blue Wing, flew heavily armed B-wing starfighters and A-wing interceptors at the Battle of Endor. The squadron's B-wings were maintained by Verpine mechanics, and were equipped with armor-piercing missiles. While the identifier Blue Wing was used to refer to the battle wing itself as a whole, it was also used as a call sign by Blue Leader Captain Merrick Simms' second-in-command."}, {"tag": "p", "text": "One of the Alliance's main attack elements in the battle, Blue Squadron's B-wings were given orders to attack Imperial command ships, with Blue Five Ten Numb leading an attack on the Star Deadnought Executor, and Blue Leader participating in an attack run on the Empire's damaged main communications ship."}, {"tag": "p", "text": "Captain Simms perished in the wake of the exploding Imperial communications ship, thrown by the shock wave against a smaller Imperial starship, which was itself destroyed. Later in the battle, \"Blue Wing\" led Blue Squad, an A-wing squadron within the Blue Wing attack element, in joining Gold Leader General Lando Calrissian's attack on the second Death Star, before breaking off  to draw a group of pursuing TIE fighters away from Calrissian and Red Leader Commander Wedge Antilles as they entered the Death Star's superstructure."}, {"tag": "p", "text": "Although the Alliance succeeded in destroying the second Death Star, the Battle of Endor inflicted the loss of their commanding officer on Blue Squadron. One week after the battle, Ten Numb had taken over as Blue Leader and flew a B-wing refitted to fight forest fires raging across the forest moon. He was recruited by Rogue Leader Luke Skywalker for a ground mission on Corellia, but was captured by Imperial forces and killed shortly thereafter on Tralus."}, {"tag": "h3", "text": "New Republic Service"}, {"tag": "p", "text": "After the reformation of the Rebel Alliance into the New Republic, a Blue Squadron of A-wing interceptors was assigned to the New Republic base on Folor to support Wraith Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During the making of Star Wars: Episode IV A New Hope, the X-wing squadron that Luke Skywalker was assigned to was given the designation \"Blue Squadron.\" When it was realized that the blue markings on Blue Squadron's starfighters would be replaced by background footage during shots that incorporated a blue-screen, Blue Squadron was renamed \"Red Squadron\" and the name of the Y-wing squadron that originally bore that name was changed to \"Gold Squadron.\" This change was not reflected in the novelization of A New Hope, which used the original designations for the squadron."}, {"tag": "p", "text": "The information concerning the Battle of Yavin and the names of the pilots is derived from the S-canonical game Star Wars: Rebel Assault and is given with caution. The squadron seen defending Tantive IV in Star Wars: Empire at War may also be non-canonical."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}