{"url": "10-4TO", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "10-4TO"}, {"tag": "p", "text": "10-4TO was a rogue TO-series protocol droid, also known as Bug Eyes, whose databank was rumored to contain vital plans for the Whiplash resistance against the Galactic Empire. The droid and its rumored data were in fact a lure devised by Darth Vader to attract the Jedi Knight Jax Pavan, whom he sought in order to obtain a pyronium nugget given to him years earlier. The droid was then set loose on the planet Coruscant in hopes of being found by Pavan, who was reported to be working with the resistance. Pavan's master began looking for the droid. The Jedi Master encountered the ex-Republic soldier Nick Rostu after being mortally wounded by Imperial stormtroopers and asked Rostu to pass on the mission to find 10-4TO to Pavan, which he did. Later, Vader had Rostu captured and sent him to find Pavan. 10-4TO could be controlled by the single phrase \"zu woohama,\" which would cause it to obey the individual who had most recently spoken the phrase. The droid was also capable of delivering powerful stunning blasts to organic creatures with a blaster mounted in its left arm."}, {"tag": "p", "text": "The ostensible value of its databanks made it the objective of crime lord Prince Xizor's final mission on the path to becoming a Vigo in the Black Sun criminal organization. The head of Black Sun, Dal Perhi, sent Xizor to find and locate the droid. However, Perhi had noticed Xizor's ambition and the mission to locate the droid was a ruse to have a Black Sun assassin, Kaird, eliminate Xizor. The plan failed, and Kaird was captured by Xizor, who had found and controlled 10-4TO by this point. Xizor took Kaird and 10-4TO to the Factory District, where he planned to have Kaird brainwashed, but instead, feral droids had destroyed his facility."}, {"tag": "p", "text": "At this point, the trio were found by Pavan and his party. Though initially subdued, Rostu, who had joined up with Pavan, used the control phrase to have 10-4TO release him. Xizor regained control of the droid and attempted to have 10-4TO disable the others in the party before they could escape. The droid fired on Pavan and closed on him when he hid behind cover, only to have the Jedi stab it with a vibroblade. 10-4TO staggered back and fell through a transparisteel window and dropped out of sight, where it was set upon by feral droids and destroyed. Pavan and his party later learned from an Imperial defector, the Elomin Haninum Tyk Rhinann, that 10-4TO and its rumored databanks had only been a trap for Pavan and were not actually of value to the resistance."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "10-4TO, also referred to as \"Bug Eyes\" due to its insectile appearance, was a TO-series protocol droid in the employ of the Sith Lord Darth Vader in 19 BBY. As part of the rise of the Galactic Empire in 19 BBY, the Jedi Order was largely wiped out, its survivors scattering into hiding from the Empire. The Human Jedi Knight Jax Pavan was one of these fugitives, hiding in the lower levels of the galactic capital of Coruscant. Vader took interest in Pavan due to a pyronium nugget that Pavan had once been given and sought to ferret him out from hiding. As such, Vader employed the Elomin aide Haninum Tyk Rhinann to assist in the effort to capture Pavan, though Rhinann was not privy to all of Vader's plan. Vader leaked word that a TO-series protocol droid designated 10-4TO had a malfunctioning operating parameter that had caused it to wander around Coruscant unattended, and furthermore was carrying information that could be vital to the fledgling resistance movement dubbed Whiplash that had arisen to oppose the Empire. 10-4TO believed that its destination was the headquarters for Whiplash, but its databanks contained no such data; the droid's entire purpose was a ruse."}, {"tag": "p", "text": "10-4TO was turned loose on Coruscant, while word reached Pavan of the droid's alleged importance. A former decorated Grand Army of the Republic soldier, Nick Rostu, had stumbled upon Pavan's former Jedi Master as he was dying after a battle against Imperial troops while looking for 10-4TO. The Jedi Master told the mission to Rostu and asked him to relay it to Pavan to complete. Rostu was successful and communicated the mission to locate 10-4TO to Pavan, telling him it was the last request of his master. Pavan accepted the mission, assisted by several others, including the emancipated droid I-5YQ, Sullustan journalist Den Dhur, Gray Paladin Laranth Tarak, and Rostu. Rostu also informed Pavan of the control phrase for 10-4TO, which would cause the droid to obey whoever had most recently said the phrase; the phrase was \"zu woohama,\" an impolite Wookiee saying. The ex-soldier volunteered to assist him, but Pavan declined, feeling that he needed to fulfill his master's dying request on his own. To find the droid, Pavan enlisted the help of Laranth Tarak, and the two sought out Rokko the Hutt for his services as an information broker to help them find 10-4TO, who was rumored to be in the Yaam Sector of Coruscant. Rokko agreed to partner with Tarak and Pavan to find 10-4TO, as the pair had framed the droid as being very valuable if recovered and returned to the Empire for credits."}, {"tag": "p", "text": "However, while Pavan was searching for 10-4TO, Rostu was apprehended by the Empire and Vader, knowing that the ex-soldier had known Pavan during the Clone Wars. Vader sent him to find Pavan, threatening to destroy his family on Haruun Kal if he did not cooperate. Rostu reluctantly rejoined the hunt for 10-4TO, conflicted about his choice to betray Pavan to Vader. He was given the droid's location and sent on his way."}, {"tag": "p", "text": "Pavan and Tarak were not the only ones searching for 10-4TO. The criminal organization known as Black Sun had also received word of the droid's alleged value from their contacts in the Imperial Palace. Underlord Dal Perhi dispatched one of his most promising members, the Falleen Prince Xizor, who was pursuing the position of Vigo, to recover 10-4TO, supplying him with information about the droid, including its control phrase. In fact, Perhi's mission was a ruse to have Xizor eliminated by the Nediji assassin Kaird, as Perhi saw Xizor's ambition as a threat to his own life. Kaird was also instructed that recovering 10-4TO would be an added bonus if he was successful in eliminating Xizor. Kaird tracked Xizor to the slums where 10-4TO was wandering and attempted to take his life, but his aim was thrown off and Xizor escaped. Kaird pursued him and the two fought, though an electrical surge caused by a torn power cable diminished their combat abilities. As Kaird closed on Xizor, 10-4TO, who was already under Xizor's control, ambushed the Nediji, stunning him with multiple blasts from his arm-mounted blaster."}, {"tag": "p", "text": "Xizor ordered 10-4TO to keep firing on Kaird, relenting only to attempt to interrogate Kaird and ascertain who had sent the assassin. Kaird was recalcitrant, and Xizor had 10-4TO resume discharging its weapon into Kaird. However, they were suddenly confronted by Pavan, Tarak, Dhur, and I-5YQ, who had been found and led to 10-4TO's location by Rostu, who had rejoined them without revealing his obligation to Vader. After a brief standoff where 10-4TO bought time with a crippling series of stun blasts into Pavan's party, Xizor and 10-4TO fled, bearing Kaird's supine body. They escaped by absconding with Kaird's ship, the Surronian assault ship Stinger, which Xizor flew to the Factory District on the other side of the planet. When they landed, 10-4TO asked Xizor why they weren't at Whiplash headquarters, but Xizor simply reasserted his command of the droid by speaking its control phrase."}, {"tag": "p", "text": "Xizor brought 10-4TO and Kaird to an abandoned droid-manufacturing plant, where 10-4TO was ordered to deactivate itself for ten minutes. The droid did so, missing an ultimately failed demonstration of a human replica droid by Xizor. When the droid reactivated itself, Xizor order 10-4TO to accompany him and Kaird to a secret laboratory, where he planned on having Kaird brainwashed to attack Dal Perhi in revenge. Upon arrival at the laboratory, they found that the scientists had been slaughtered by the feral droids that roamed the Factory District."}, {"tag": "p", "text": "Meanwhile, Pavan's party had followed them to the Factory District. Splitting off from the group, Nick Rostu located Xizor, Kaird and 10-4TO. Rostu attempted to convince Xizor that Black Sun had sent him to warn him about the approach of Vader, who was ostensibly en route to retrieve the droid. Xizor pretended to believe him, but instead used his Falleen pheromones to influence Rostu, who led the Prince and 10-4TO back to his companions, who were fighting off feral droids. Xizor then had 10-4TO advance and stun Pavan and the rest of his party. 10-4TO fired on I-5YQ, who returned fire in such a way that their beams intersected. The resulting explosion knocked I-5YQ offline while 10-4TO stunned the rest of the party so they could be bound with forcecuffs and restrained Rostu. The Falleen prince was preparing to execute Pavan with his own lightsaber when Dhur used a secret command to reactivate I-5YQ, who emitted a painful screech. Rostu then used his knowledge of 10-4TO's command phrase to command the droid to release him, and unsuccessfully assaulted Xizor. Xizor quickly regained control of 10-4TO by uttering its control phrase and ordered it to stop I-5YQ. The droids fired on each other and 10-4TO's beam was able to override the opposing blast and knock I-5YQ back."}, {"tag": "p", "text": "With that opponent momentarily disabled, 10-4TO turned its attention to Pavan, who had temporarily eluded it behind cover. When 10-4TO approached, Pavan lunged at the droid, stabbing it between its thoracic and ventral plates with a vibroblade. 10-4TO staggered back, tripped over a piece of debris, and fell against a transparisteel window that had been weakened in the earlier altercation with the feral droids. 10-4TO crashed through it and fell. It was set upon by feral droids and dismantled. I-5YQ investigated its fate and reported back to the others once they were able to escape from Xizor. Pavan and his party would later learn from Haninum Tyk Rhinann—after the Elomin defected from Vader's service in an abortive confrontation in the Factory District—that 10-4TO contained no vital data and was only a decoy. Vader had pursued Pavan to the Factory District, tipped off by a tracker implanted in Rostu, but the impending destruction of an unstable reactor—courtesy of Pavan's lightsaber—forced him to temporarily break off his pursuit, which allowed Pavan and his party to escape."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "10-4TO was a bipedal protocol droid of humanoid design, controlled by a central processing unit. The exterior of its chassis was glossy black, while its nickname \"Bug Eyes\" was derived from its large golden eyes, which were both insectile in appearance and covered most of its face as well as containing its photoreceptors. Two ten-centimeter-long segmented antenna joined at the temples of its head added to the droid's resemblance to an insect species. The droid had both thoracic and ventral plating over its torso. 10-4TO was rumored to contain vital information pertaining to the resistance movement in its databanks. The droid expected to be retrieved by the Whiplash movement, and was surprised when it was claimed by Prince Xizor instead."}, {"tag": "p", "text": "When it was set loose on Coruscant in 19 BBY, the droid was programmed to blindly obey anyone who spoke its control phrase of \"zu woohama.\" If multiple people spoke the control phrase, the droid listened to the individual who had most recently said the phrase. 10-4TO was armed with a retractable blaster in its left forearm, which was set on a stun setting, though multiple shots to a target in rapid succession could inflict serious injury or potentially death. The droid also had hands articulate enough to grip objects, including people, with sufficient strength that a trained ex-military Human was unable to wrest free. It was also equipped with sensors that allowed it to detect approaching people and had enough initiative to warn its controller of their presence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The search for 10-4TO provided the focal point of Michael Reaves' novel Coruscant Nights I: Jedi Twilight, which was published in June 2008. The search for 10-4TO served to unite Jax Pavan and I-5YQ. Unlike many protocol droids, 10-4TO is not described with gender-specific pronouns, and is only referred to as \"it\" throughout the novel."}, {"tag": "p", "text": "The death of Even Piell in Star Wars: The Clone Wars created a discrepancy over the canonicity of Jedi Twilight, as Piell's dying words in the novel are the catalyst for Pavan to search for 10-4TO. Lucasfilm Ltd. never resolved the conflicting information. This article treats Piell's actions as canon, but does not explicitly state his identity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}