{"url": "Bluefish", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Creatures of Corellia", "Category:Creatures of Dantooine", "Category:Creatures of Dathomir", "Category:Creatures of Endor", "Category:Creatures of Lok", "Category:Creatures of Naboo", "Category:Creatures of Rori", "Category:Creatures of Talus", "Category:Creatures of Tatooine", "Category:Creatures of unspecified diet", "Category:Creatures of Yavin 4", "Category:Fish", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Bluefish"}, {"tag": "p", "text": "Bluefish were a relatively common species of fish notable for their small size, and blue colored skin. They could be found on multiple worlds throughout the galaxy, including lush worlds like Naboo and Yavin 4, or even more arid planet's like Lok and Tatooine. Through the act of fishing, it was possible to lure and catch bluefish and use their meat as ingredients in various foodstuffs."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Although some species of bluefish were considered rare, they were for the most part quite common. They could be found swimming in the bodies of water of multiple worlds throughout the galaxy, including Corellia, Dantooine, Dathomir, Endor, Naboo, Rori, Talus, and Yavin 4. They could even be found in the sulfur pools and rivers of Lok, and in the few oases of the desert world of Tatooine. Small with beady dark eyes, one of the bluefish's most distinguishing features were their blue color, which could come in a variety of different hues. By affixing various forms of bait to a fishing pole, including grubs, insects or worms, it was possible for individuals to lure and reel bluefish out of the water through the act of fishing. After being caught, bluefish meat could be used as ingredients in various foodstuffs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Galactic Civil War, following the Battle of Yavin in 0 BBY, a spacer scoured the galaxy for fish, including a particularly rare variety of bluefish. Upon catching the bluefish, and six other species of rare fish, the spacer became recognized as a novice angler."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bluefish were included as fishable creatures in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players who used fishing poles could catch bluefish on all the original worlds of Star Wars Galaxies, including Corellia, Dantooine, Dathomir, Endor, Lok, Naboo, Rori, Talus, Tatooine, and Yavin 4. According to the game files, bluefish could have also been found on Taanab, but that world was cut from the final release of Galaxies, rendering that particular information ambiguous in the Star Wars Legends continuity."}, {"tag": "p", "text": "As with most other fish in the game, bluefish could be harvested for their resources. With the release of Chapter 7: A Collection of Heroes on November 1, 2007, a collection quest titled The Reel Life was added to the game. To complete this collection, players had to successfully catch seven fish, including a \"Rare Bluefish\" which could be found on any of the original aforementioned worlds. Completing this collection would award the player with the title of \"Novice Angler.\" Although players could choose not to complete this collection, this article assumes 100% game completion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}