{"url": "BoShek/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Corellians", "Category:Force-sensitives", "Category:Humans", "Category:Males", "Category:Mechanics", "Category:Pilots", "Category:Smugglers", "Category:Spies", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "BoShek"}, {"tag": "p", "text": "BoShek was a male Corellian smuggler with a talent for piloting and a tenuous sensitivity to the Force. BoShek left Corellia to enter the galactic underworld, eventually finding a job piloting ships to and from an outlaw tech transponder-slicing workshop on Tatooine which masqueraded as a monastery. There he worked successfully and learned of the Force, with which he became fascinated, frequently meditating and attempting to access it to little success. Shortly before the Battle of Yavin, BoShek set a new record for the Kessel Run, taking bragging rights from his friends Han Solo and Chewbacca. At the end of that run, however, BoShek was pursued by Imperial TIE fighters, which he destroyed, leading to the Empire issuing a warrant for his arrest. BoShek made it safely to Mos Eisley, where he conversed with Obi-Wan Kenobi in Chalmun's Spaceport Cantina. Kenobi advised him to move away from his shady position and embrace the light side if he were to wield the Force successfully."}, {"tag": "p", "text": "BoShek took that to heart, leaving his smuggling job and settling on the remote world of Stoga. There he lived honestly and simply, meditating frequently on the Force, but to no avail. Six months after the Battle of Yavin, BoShek came across Rasha Bex, who was attempting to flee a Rebel cell which wished to kill her. BoShek did not wish to be drawn into the Galactic Civil War, but agreed to give her a ride to the transport offworld which awaited her. The Rebels pursued them, however, and BoShek had to push his piloting skills and his swoop to the limit to escape them, while he and Bex developed a mutual attraction over the course of the escape. At Bex's rendezvous, BoShek discovered that she was in fact an Imperial agent, and despite her requests to join the Empire, BoShek refused, and was instead arrested. Within a year, BoShek escaped prison and attempted to trace a much-sought-after shipment of ryll spice, but was foiled by another spacer with the same objective."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Underworld career"}, {"tag": "p", "text": "A male Human from Corellia, BoShek left his homeworld before 0 BBY, seeking excitement and profit as a smuggler. The Corellian entered the criminal underworld, taking on smuggling and espionage missions and continually seeking to gain a reputation in fringe circles. He eventually found his way to Smuggler's Run, where he generated a large impression on his fellow smugglers, such as Clyngunn. In his pursuit of smuggling success, BoShek also acquired a debt to Black Sun, the galaxy's largest crime syndicate; Prince Xizor, its leader, took a personal interest in it, suggesting it was significant."}, {"tag": "p", "text": "BoShek became something of a regular on the smuggling scene, striking up a friendship with top smugglers Han Solo and Chewbacca, making the acquaintance of kingpins such as Clyngunn, and becoming familiar with the work of Klaus \"Doc\" Vandangante—one of the foremost \"outlaw techs\" in the galaxy—whose services BoShek frequently used, though he enjoyed the presence of Vandangante's daughter Jessa as much as he did Vandangante's quality of service itself."}, {"tag": "p", "text": "BoShek was eventually able to settle into a job piloting ships for the Dim-U monastery in Mos Eisley, Tatooine. The monastery was in fact less a place of religion than one of business, as Abbot Drayk and most of the \"monks\" ran a highly illegal transponder-slicing venture from within the cover of the Dim-U's bantha-worshiping beliefs. BoShek would pilot \"hot\" starships—frequently stolen, though sometimes belonging to smugglers or criminals—to the monastery, where the monks would alter the ships' transponder codes and emission signatures to keep them from official detection. While BoShek piloted them to Tatooine, however, the ships would still register as wanted, requiring BoShek's piloting and smuggling skills to avoid the authorities. Piloting was not BoShek's only skill set, however; he was also an adept mechanic and occasionally lent a hand among the monastery's technicians. BoShek was also aided by an astromech droid, R4-E1, which was a frequent companion to him but had a strong independent streak and was more likely owned by the monastery than BoShek himself."}, {"tag": "p", "text": "While so employed, BoShek heard of the Force from one of the few genuine monks in the monastery. Fascinated, he resolved to study it and attempt to cultivate its power within himself. He frequently meditated and attempted to access it, but never progressed very far, only getting occasional and tentative awareness of the presences of others. BoShek was, however, Force-sensitive, though he did not know it and his connection did not seem to be strong."}, {"tag": "p", "text": "During this period, BoShek retrieved the Dancing Goddess, a highly valuable statue, and delivered it personally to Xizor, paying off his debt. He also gave an interview to an Imperial Security Bureau agent in Chalmun's Spaceport Cantina, a popular Mos Eisley watering hole. BoShek offered a basic biography of Vandangante to the agent, though BoShek likely did not realize that the individual in question was in the employ of the Empire."}, {"tag": "h3", "text": "The Infinity affair"}, {"tag": "h4", "text": "Action"}, {"tag": "p", "text": "Shortly before the Battle of Yavin, BoShek was assigned to bring the smuggling ship Infinity to Mos Eisley to be serviced. BoShek fell in love with the ship, impressed by its layout, systems, and performance. BoShek's course allowed him to make the Kessel Run, and BoShek was highly pleased to find at the conclusion of his run that he had beaten Solo's previous record—a fact which he gleefully anticipated breaking to Solo, who frequently boasted of his accomplishment."}, {"tag": "p", "text": "Upon reverting to realspace over Tatooine, however, BoShek was highly surprised to find two Imperial-class Star Destroyers in orbit. Though he did not know it, they were searching for the Death Star plans. BoShek, running without his transponder active but knowing the Infinity's emissions signature would give him away, immediately dived for the planet. As BoShek entered the atmosphere, however, the Star Destroyers opened fire, rocking the Infinity and damaging the craft. Four TIE/LN starfighters were dispatched in pursuit, but BoShek hoped that he could shake them nearer to the surface; with their entry to the chase, the Star Destroyers ceased fire."}, {"tag": "p", "text": "BoShek skimmed low over the Dune Sea, pulling away from the TIEs with a trick maneuver and heading for the canyons of the Jundland Wastes. He navigated up a canyon at full speed, but as one of the TIE fighters closed in, it crossed BoShek's wake and was slammed into the canyon wall, taking out another fighter in the explosion. BoShek had not wished to destroy his pursuit, knowing how grave the consequences could be, but he knew he would now be held accountable for the deaths of both pilots. Now, both other TIEs were shooting to kill. The Infinity was not built for combat, but BoShek hit upon a strategy for escape, based on a trick Solo had once recounted using. BoShek waited until his shields were about to fail, then launched an escape pod as he rounded a corner, creating an explosion that he hoped would suggest the Infinity's destruction and possibly take out both of the remaining TIEs; it accomplished both. With his pursuit destroyed, BoShek cut his engines and glided into Mos Eisley undetected."}, {"tag": "p", "text": "He made it safely to the monastery, where he picked up a note which he passed to a Dim-U street preacher. With that accomplished, BoShek headed straight for Chalmun's cantina, where he knew he could find Solo and Chewbacca and brag about beating their record. He made it in and immediately found Chewbacca, whom he told about his new record. The Wookiee was not particularly bothered, and the two engaged in brief banter before BoShek sensed a powerful presence in the Force. He turned around to see a boy, an old man, and two droids in the doorway. BoShek did not know it, but the boy was Luke Skywalker, and the old man was Jedi Master Obi-Wan Kenobi, both strong in the Force. Kenobi walked directly up to BoShek and greeted him with the statement, \"May the Force be with you, my friend.\" BoShek had never told anyone of his fascination with the Force, but the old man told him that he could sense BoShek's struggles with the Force. He asked BoShek for passage offworld, suggesting he could train him to use the Force during the trip. As BoShek did not have a ship, however, he was forced to pass, suggesting Kenobi ask Chewbacca, just next to BoShek, about passage. Kenobi offered BoShek a parting gift of wisdom, telling him that he should beware the dark side and must resolve his alignment within the Force before he could call upon it successfully, urging him to hold to the light side."}, {"tag": "p", "text": "With that, BoShek bowed out, leaving Kenobi to converse with Chewbacca, and moved to the other side of the bar to get a drink and look for Solo. When Kenobi pulled a lightsaber to protect Skywalker in a bar brawl, BoShek was knocked off his feet in the rush away from the combatants. He focused on refilling his spilled bitter and asking about the unusually high number of stormtroopers in town—to no answers—before he finally saw Solo seated in a booth. BoShek wanted to sit down and talk, but a continual parade of individuals entering Solo's booth kept him from doing so. When the bounty hunter Greedo pulled a blaster on Solo, BoShek nearly drew on Greedo before noticing Solo easing his blaster out beneath the table. Amused, BoShek simply watched as Solo blasted the threat."}, {"tag": "h4", "text": "Reaction"}, {"tag": "p", "text": "BoShek moved to follow Solo out the door, but upon leaving was accosted by a local law enforcement officer. The man wanted to bring BoShek in for the earlier incident; he did not in fact know BoShek was responsible, but simply wanted to sacrifice someone to appease Darth Vader. BoShek lied that he had been inside the cantina all afternoon, and when the officer looked inside, BoShek kicked the blaster out of his hands and knocked him out."}, {"tag": "p", "text": "BoShek walked quickly away, but he heard a shout as the officer recovered and began pursuit. BoShek ducked inside the wreck of the Dowager Queen, where he doffed his flight suit and bought a shabby cloak from a vagrant, disguising himself. He moved to leave the wreck, but saw the officer waiting outside, blaster drawn, having seen BoShek enter the Dowager Queen. Not trusting his ability to avoid scrutiny, BoShek remained inside, searching for another exit. He found only a ramp up to where several street preachers addressed the crowds below. As more police arrived, BoShek decided he had no way out, and instead rubbed his face and hands with grime to darken his complexion, put up his hood, and began to preach to the crowd from a window, hoping to blend in with the other preachers. BoShek briefly considered preaching on the Dim-U doctrines, but knew extremely little about them and so decided to deliver a sermon on the Force. Borrowing liberally from Kenobi's words to him, BoShek strung together a series of vague doctrines and buzzword-laden promises, earning the ire of the other preachers, who felt he was mocking them and cutting in on what was for them a very profitable racket. The police moved up onto the observation deck behind BoShek, looking at all the preachers, but Het Nkik's attack on a stormtrooper patrol nearby caused a large commotion, drawing the officers out to examine the situation. As soon as they left, the other preachers began beating BoShek, angry at his perceived mockery."}, {"tag": "p", "text": "BoShek fled outside, where two preachers continued pursuing him. There, the first officer recognized BoShek and nearly shot him dead, barely missing. BoShek hurried down the street, preachers still chasing him—causing the officers to hold their fire for fear of harming the religious leaders. He made his way to a used-speeder lot, where he tossed a handful of credits at the dealer and leaped into a still-running XP-38A landspeeder that had just been purchased, claiming he was taking it for a test drive, and sped away."}, {"tag": "p", "text": "Now out of the reach of the police, BoShek slowed to a normal speed and was about to head to the safety of the monastery when he came upon a stormtrooper checkpoint. Unable to flee, he pulled up and the stormtroopers began questioning him. They were interrupted by the roaring takeoff of Solo's Millennium Falcon nearby, which gave BoShek time to think and turned his thoughts to Kenobi, who he knew had gained passage with Solo. BoShek wanted to use the Force to escape, but recalled Kenobi's words on only the \"pure of heart\" being able to use it successfully. Promising to the Force and himself to take the stolen speeder back and quit his smuggling career if only he could escape the Empire, BoShek hoped he could change just enough to access the Force. Reaching out with all his concentration, he urged them through the Force to let him go. His effort was weak, but these troopers had been touched by the Force shortly before, when Kenobi evaded their scrutiny. The brush of BoShek's Force presence caused them to replay their thoughts from Kenobi's earlier effort. Befuddled by their talk of droids but profoundly grateful that they let him pass, BoShek moved on, ascribing it to a miracle of the Force. Exposed to the reality of the Force and its power, BoShek vowed to follow through on his promise and to resolve his situation, driving the speeder back to the dealership and planning to leave behind his life of crime."}, {"tag": "h3", "text": "The quiet life"}, {"tag": "p", "text": "BoShek's role in the destruction of the TIEs quickly became known, leading to Imperial warrants for his arrest. He was the subject of an interview between an ISB agent and Clyngunn in which Clyngunn gave a very brief accounting of BoShek's career and suggested that BoShek had bought the Infinity, which was very likely a misunderstanding of BoShek's role in piloting it during his record-setting Kessel Run. The report was included among several on leading underworld figures compiled by ISB commander Maximillian Seerdon and forwarded to the office of the Emperor shortly after the Battle of Yavin. Ironically, BoShek's interview on Vandangante was included in a later addendum."}, {"tag": "p", "text": "BoShek himself successfully left behind the monastery and the smuggling life, making his way to Stoga, a remote world where he thought he could avoid notice by either faction in the expanding Galactic Civil War. There, he lived peacefully for several months, finding honest work and enjoying a simple, uneventful life. Tam, an old friend, lived on the planet as well in a junked freighter, and BoShek would drop in occasionally. BoShek also hoped that, in the peaceful surroundings of Stoga, he could connect more deeply with the Force. The harder he tried, however, the farther he felt from it, frustrating him and causing him to slowly lose the faith he had gained after the events on Tatooine."}, {"tag": "p", "text": "One morning, around six months after his escape from Tatooine, Rasha Bex entered BoShek's life. She told him that she had encountered a Rebel cell on Stoga loyal to Garm Bel Iblis, but disagreed with their methods and desired to leave, causing them to attempt to kill her. She had transport off-world arranged, but needed to get to their meeting site. Reluctant to get involved, but more reluctant to allow the attractive woman to be killed, BoShek agreed to give her a ride on his Flare-S swoop. The Rebel agents were in hot pursuit, however, and BoShek found himself dodging blaster fire while racing through Stoga's fields and canyons at high speed. Only after speeding through a small canyon and across a chasm did BoShek lose his pursuers, whose catamaran-style speeder was too large to fit through and whose launched missile barely missed him."}, {"tag": "p", "text": "BoShek made his way to Tam's home, where he planned to sleep a few hours and continue to the rendezvous point. He had a short conversation with Tam, who urged him not to fall back into his old lifestyle and risk the balance and happiness he had found, before going in to see Bex. She asked about his past, and he gave her a brief account of it. When he displayed his apathy towards the ongoing war, preferring to choose no sides and live without worrying about a future that may not come, Bex disagreed with him, claiming that the future was too important to disregard and he must make a stand for one side or the other. The argument did not go very far, however, and the two fell asleep against each other."}, {"tag": "p", "text": "BoShek awoke to the sound of whispered conversation in the next room and quickly realized that Tam, a Rebel sympathizer, had sold Bex out to Karn, the head of the local Rebels. He looked to the Force, but could find no answer. Going with instinct instead, BoShek burst through the doorway, blasters drawn, getting the drop on Karn and Lhira, Karn's lieutenant. With blasters to their heads, he forced them to disarm and then retreated with Bex through a back exit. There waited another Rebel, a burly Weequay who sought a bare-knuckle brawl. Instead, BoShek slipped a long, heavy implement from his tool belt and struck the Weequay across the face, downing him. With BoShek's swoop sabotaged, the pair set out on the Weequay's."}, {"tag": "p", "text": "Bex's rendezvous was directly across an old, rickety bridge left over from an abandoned mining operation. BoShek sped towards it and Karn, knowing he could not catch them in time, stopped and sniped the bridge's supporting cables, sending it falling. BoShek leaped the swoop across the falling bridge, making a last-minute jump as it plummeted down the chasm and snagging a cable attached to the far end with one hand, Bex hanging onto the other. Under fire from the Rebels, BoShek was surprised to find them driven off and himself hauled to the top by Rasha's contacts—multiple trench-coated and well-armed men. Once they were hauled to the top, Bex gave BoShek an intense kiss—and handed over information on the Rebel cells to her superior. It was only then that BoShek realized Bex was an Imperial spy. Furious and feeling betrayed, BoShek drew on the Imperial commander as Bex pleaded with him to lower his weapons, explaining she had never meant to get him caught up in the war. Downcast, he surrendered. Bex offered to drop all charges if he put his piloting skills to use in the Empire, but BoShek despised the Empire's methods and ideology and refused, preferring to do prison time than spend his life an Imperial officer. Instead, he urged Bex to disregard the Imperial propaganda and defect to his side—the unaligned."}, {"tag": "h3", "text": "Out of custody"}, {"tag": "p", "text": "BoShek's words took root, leading Bex to betray the Empire at Ahakista; the leader of the operation in which she became involved, Rebel spy Wyl Tarson, knew of her attraction to BoShek and used it to motivate her. BoShek himself soon escaped from prison, leaving Imperial warrants for his arrest active."}, {"tag": "p", "text": "In 1 ABY, BoShek met with Imperial Security Bureau agent Jeffren Brek in the city of Bestine on Tatooine; Brek wanted to know about a shipment of ryll destined for a Rebel medical facility that had gone missing, but BoShek told him little. BoShek was searching for the missing shipment himself, and upon hearing that a spacer was looking for him in connection with the spice, BoShek tracked the individual down and, in cooperation with a few friends, moved to eliminate his competition. The spacer proved good enough to outfight the Corellian, and after being threatened with being turned in to the Empire, BoShek was compelled to admit that he had heard the shipment was stored in Skip 52 of the notorious smugglers' hideout Smuggler's Run. BoShek's opponent locked him in a maintenance closet and departed to track down the lead."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "BoShek was a man who preferred to live in the moment, making the most of his present circumstances rather than worrying about the future. He also preferred to stay uninvolved in the civil war that was shaking the galaxy—though he sympathized with the Rebel Alliance and disliked the Empire, he did not consider it his fight and preferred to keep a low profile and live his life rather than make sacrifices when he was not forced to. He preferred to look out for himself and, after his encounter with Kenobi, to live a simple, honest, and uninvolved life."}, {"tag": "p", "text": "BoShek was not entirely cynical, however. His fascination with the Force revealed a willingness to accept the supernatural, not giving up his attempts to access it even after getting little in the way of results. After speaking with Kenobi and witnessing it in action, BoShek believed even more strongly. That belief was eroded when his further meditations on Stoga yielded only disappointment, but his successful leap across the canyon from the falling bridge restored some measure of faith in the Force."}, {"tag": "p", "text": "Despite his interest in the Force, BoShek retained a fringe mentality in which he was willing to shoot first to protect his own interests. With several Imperial warrants for his arrest active, he was fearful for his safety and longed to avoid Imperial scrutiny."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "BoShek was Force-sensitive, but by all indications his aptitude for it was fairly low. He meditated frequently for an unknown but lengthy period of time, but was unable to accomplish more than an occasional fleeting sense of others' presences in the Force. When Kenobi entered Chalmun's Cantina, BoShek was aware of a strong presence in the Force that he associated with Kenobi, though he may have in fact sensed Luke Skywalker, who was untrained but had an extremely high level of latent power. BoShek later attempted a mind trick to escape from a stormtrooper checkpoint, but was unable to fully succeed, merely re-triggering the effects of Kenobi's earlier mind trick. High on this relative success, he continued his frequent meditation with renewed emphasis, but found only disappointment as the Force seemed harder and harder to reach the more desperately he grasped at it. By 1 ABY BoShek's Force skills were better-developed, as he was able to read the minds of others."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BoShek was portrayed in A New Hope by Basil Tomlin, an uncredited actor who remained unidentified until 2016. The character was costumed with a high-altitude Windak pressure suit dating to the 1960s. Despite appearing in the original film, the character went unused until 1995, when a Star Wars Customizable Card Game card was issued naming BoShek and giving a brief outline of the events which would be fleshed out later in 1995 with the release of Tales from the Mos Eisley Cantina, which contained the short story At the Crossroads: The Spacer's Tale by Jerry Oltion featuring BoShek."}, {"tag": "p", "text": "Despite the story setting up BoShek as a Force-sensitive film character with links to Kenobi and a mission to change his life, BoShek did not appear for yet another prolonged period of time until Jeremy Barlow penned Empire 23, illustrated by Brandon Badeaux, in 2004, which showed BoShek after the events of At the Crossroads. Barlow indicated that BoShek's story would be continued in an arc of Star Wars: Rebellion in which BoShek is recruited into Black Eight Squadron by Nas Ghent in a follow-up to the Star Wars Tales story \"Walking the Path That's Given\", but Rebellion has since been canceled."}, {"tag": "p", "text": "BoShek's only further appearances were in 2006, in which he was featured in the Underworld: A Galaxy of Scum and Villainy article in Star Wars Insider by Abel G. Peña and Ryan Kaufman and illustrated by Joe Corroney. In the article, his name was incorrectly capitalized as \"Boshek.\" BoShek was also credited as the in-universe source of an entry on \"Doc\" Vandangante in the online supplement to that article, Underworld Appendix: Swoops, Spice, and Wretched Rogues. BoShek has since been mentioned briefly in the 2007 Rebellion arc The Ahakista Gambit, which contains Bex."}, {"tag": "p", "text": "In 2009, BoShek reappeared in a scenario for the Star Wars Galaxies Trading Card Game card set Agents of Deception, set after the events of The Bravery of Being Out of Range. In it, he is a free man but still wanted by the Empire; no explanation for the significant change in his circumstances is given. A later expansion, Threat of the Conqueror, resolved the issue by including a quote from BoShek indicating that he escaped prison."}, {"tag": "p", "text": "In the Star Wars Episode IV: A New Hope radio dramatization, Obi-Wan Kenobi is referred to Chewbacca by a character, with different dialogue than BoShek, simply referred to as 'Spacer', who is voiced by David Alan Grier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}