{"url": "74-Z_speeder_bike/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Aratech Repulsor Company products", "Category:Galactic Empire vehicles", "Category:Galactic Republic repulsorcraft", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "74-Z speeder bike"}, {"tag": "p", "text": "The 74-Z speeder bike, sometimes referred to as the Imperial speeder bike due to its use by scout stormtroopers of the Galactic Empire, was a speeder bike manufactured by Aratech Repulsor Company used for reconnaissance purposes, as well as rapid transportation in combat zones."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "They were capable of reaching speeds up to and beyond five hundred kilometers per hour, and had a flight ceiling of twenty-five meters. 74-Zs were the military variant of the civilian 74-Y. They were controlled by handlebars located towards the front of the vehicle, and foot pedals slung underneath adjusted speed and altitude."}, {"tag": "p", "text": "The highly maneuverable vehicles were equipped with sensor and communications devices located between the handlebars, including a comlink and a comlink-jamming device. The speeder was equipped with terrain-following sensors that linked up with the HUD in the driver's helmet. They were armed with a forward rotating blaster cannon for combat."}, {"tag": "p", "text": "They were also equipped with a very powerful boost that could propel them over vast distances in a shorter amount of time. In addition, the 74-Z was stripped down to just its fundamental components, namely the engine and steering vane, in order to increase its overall speed, and as such a single, scaled-down, forward-facing blaster cannon was fixed on the undercarriage. Rebel ace pilot Wedge Antilles admitted that he was uncomfortable piloting them due to being essentially an engine and a steering vane."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Used by the Galactic Republic during the Clone Wars along with the younger BARC speeders, these speeder bikes saw action on many worlds. The bike was first used during the Battle of Geonosis. The 74-Z was capable of being deployed from LAAT/i gunships. On the planet Saleucami, Jedi Master Stass Allie was killed by her own troops while riding a 74-Z bike. It was also used by the Confederacy of Independent Systems."}, {"tag": "p", "text": "During the Galactic Civil War, both the Galactic Empire and the Alliance to Restore the Republic utilized these speeder bikes, though Aratech primarily supplied the vehicles to Imperial forces. On the forest moon of Endor, Imperial scout troopers engaged in a vicious chase with Luke Skywalker and Leia Organa after the Rebels commandeered speeder bikes to pursue their foes. 74-Zs subsequently saw use in the battle that followed."}, {"tag": "p", "text": "74-Zs were later used in 9 ABY on Myrkr while Grand Admiral Thrawn obtained supplies for his campaign."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The speeder bikes appear in Star Wars: Episode VI Return of the Jedi, and were based on concept art by Joe Johnston and Nilo Rodis-Jamero."}, {"tag": "p", "text": "Hasbro Inc. later took a piece of the concept art and created the expanded universe vehicle the Aratech Military Speeder Bike Prototype for their Star Wars: The Power of the Force toyline."}, {"tag": "p", "text": "These speeder bikes were meant to be shown during the Battle of Geonosis in Attack of the Clones, but their scenes were cut at the animatics stage. Despite this, one was featured in a 2003, the 4482 LEGO AT-TE set as part of the Star Wars: Episode II Attack of the Clones line and another in the 2008, the 7676 LEGO Republic Gunship set as part of the The Clone Wars line."}, {"tag": "p", "text": "Star Wars: Behind the Magic erroneously states the 74-Z is three meters long."}, {"tag": "p", "text": "In the video game Star Wars: Republic Commando, a 74-Z is visible in one of Prosecutor's Docking Bays. It was referred to as \"a death trap\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}