{"url": "Boar-wolf/Legends", "categories": ["Category:Legends articles", "Category:Creatures of Endor", "Category:Creatures of unspecified biology", "Category:Domesticated creatures", "Category:Predatory creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Boar-wolf"}, {"tag": "p", "text": "The boar-wolves, or borra, were a predatory animal that lived on the forest moon of Endor."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Boar-wolves had been known to be three meters tall, and usually hunted in pairs for prey such as blurrgs and Ewoks. They had hair, sharp teeth, a humped back, and two tusks. They were sometimes domesticated by the primitive Gorax, usually by having their mother killed and then being taken away by the Gorax. They were often known to howl at the gas giant Endor when it appeared in the night sky. They may have been a breed of wolf. They were one of the many types of meat that Ewoks ate after successful hunting trips."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One domesticated boar-wolf chased Cindel and Mace Towani through the forest after they left the home of Deej Warrick, trapping them inside the hollow of a tree trunk. In the morning, Deej and his three sons Wicket, Widdle, and Weechee went searching for the children and found the boar-wolf lurking in the vicinity. Deej and his two elder sons fought the creature using spears. The boar-wolf was ultimately killed by Wicket, who shot it with a poisoned dart from a blowgun. Upon emerging from their hiding place (from which they witnessed the battle), Mace and Cindel found their father's life monitor attached to the boar-wolf's collar, put there as an ornament by its owner, a giant Gorax who lived in the Forbidden Fortress."}, {"tag": "p", "text": "After the Battle of Yavin, Doctor Maldien conducted illegal and highly dangerous bioengineering experiments in a laboratory on Corellia to create very aggressive and intelligent creatures. This included at least one engineered boar-wolf."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}