{"url": "Boarding_craft_356", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Captured starships", "Category:Starships of the Galactic Empire", "Category:TIE/br boarding shuttles"], "nodes": [{"tag": "h1", "text": "Boarding craft 356"}, {"tag": "p", "text": "Boarding craft 356 was a TIE/br boarding shuttle utilized by the Galactic Empire during their subjugation of Constancia."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "After the life boat for Luke Skywalker and Gamine was launched with Han Solo and Sharlee onboard with an S.O.S. signal indicating that the former two were onboard and injured from an earlier ambush by the Imperials, boarding craft 356 as well as two TIE Advanced x1s and three TIE/LN starfighters were dispatched to retrieve the lifeboat. Boarding craft 356 managed to retrieve the lifeboat, although shortly thereafter, Solo and Sharlee proceeded to put their plan into effect and managed to attack the crew, either killing them or causing them to surrender via their Constancian battle armor, with their armor's speed-setting being augmented to nine times the average speed of a human being also ensuring that they defeated the crew before they could get a chance to send a S.O.S. signal alerting the Imperials to their presence. Upon taking control of the ship, the Imperial Naval Command later relayed to the group that the Millennium Falcon had been spotted heading towards the planet via its ice rings, and gave orders for them to intercept immediately. Solo then bluffed his \"wingmates\" and claimed he'll take them on, although he also attempted to avoid doing critical damage to the Millennium Falcon and ended up causing the other TIEs to pursue the Millennium Falcon anyways due to his \"wingmates\" thinking he was inept, forcing Solo and Sharee to look on as there wasn't anything more they can do without risking giving themselves away to the Imperials."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}