{"url": "Bob_Hudsol/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance Military officers", "Category:Corellians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bob Hudsol"}, {"tag": "p", "text": "Commander Bob Hudsol was a Corellian male officer of the Alliance to Restore the Republic. He was a resistance leader in Bothan Space, and he developed connections to the Bothan Spynet. In 0 BBY, Hudsol was stationed in the Alliance base on Yavin 4 during the Battle of Yavin. In that battle, Hudsol kept small groups of starfighters separated from one another to allow multiple attacks on the Imperial Death Star battlestation. The battle was won when Rebel pilot Luke Skywalker destroyed the Death Star, and Hudsol was present at the ceremony held in honor of Skywalker and other heroes of the battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Bob Hudsol hailed from the planet Corellia during the Galactic Civil War. A member of the Alliance to Restore the Republic, Hudsol was a resistance leader in Bothan Space and developed strong ties to the Bothan Spynet. By the year 0 BBY, Hudsol had become a commander in the Alliance's military forces. That year, Hudsol was in the Great Temple, the Alliance's base on the moon Yavin 4. At that time, General Jan Dodonna, the base's commander, received the stolen plans of the Galactic Empire's first Death Star battlestation. Dodonna analyzed the plans and found that the Death Star had a weakness in its thermal exhaust port found in one of its surface trenches, which would be vulnerable to proton torpedoes. A successful attack would lead to a chain reaction that would destroy the whole station. Hudsol attended a meeting during which Dodonna discussed his findings, and arranged for the base's starfighter squadrons to attack the Imperial superweapon."}, {"tag": "p", "text": "During the battle, Hudsol was in the base's command center with Dodonna, keeping watch over the battle. He kept small groups of starfighters separated from one another to allow several different attacks on the Death Star. The battle was won when the Rebel pilot Luke Skywalker successfully fired proton torpedoes into the Death Star's exhaust port, effectively destroying the station. Following the battle, Hudsol was present alongside Dodonna in the ceremony awarding the Medal of Bravery to the Heroes of Yavin: Skywalker and pilots Han Solo and Chewbacca."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bob Hudsol was typical of hard-line Corellian military officers who were known for being cautious in battle. Hudsol had gray hair and brown eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bob Hudsol first appeared in 1977's Star Wars: Episode IV A New Hope as one of the minor Rebel characters seen first in the briefing before the Battle of Yavin, and then during the battle itself and in the ceremony honoring the Heroes of Yavin. Although uncredited in the film itself, Hudsol was portrayed by actor John William Ault. In 1978, a similar-looking Rebel officer appeared in The Story of the Faithful Wookiee, a cartoon that was shown in The Star Wars Holiday Special. Referred to only as a \"General\" by other characters in the cartoon itself, the character was identified as General Ristt in the Holiday Special's script. Hudsol was first identified by name in a card for the A New Hope Limited expansion set of the Star Wars Customizable Card Game. Despite that, as a result of Hudsol's resemblance to Ristt, Dr. Curtis Saxton mistook the two for the same character in his Star Wars Technical Commentaries. The two characters have also been mistaken as being the same on the fan site Starwarsholidayspecial.com. In addition, Alex Newborn, the author of the article I Have a Bad Feeling About This! published in Star Wars Insider 106, speculated that Ristt was a stylized version of Hudsol. Of note, the video game Star Wars: Rebellion portrays another Rebel character, Commander Vanden Willard, with Hudsol's likeness."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}