{"url": "Boba_Fett%27s_armor", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Mandalorian armor"], "nodes": [{"tag": "h1", "text": "Boba Fett's armor"}, {"tag": "p", "text": "Boba Fett's armor was a suit of customized Mandalorian armor worn by Boba Fett, a cloned human bounty hunter. The armor once belonged to Jango Fett, a Mandalorian foundling whose DNA served as the foundation for Boba and the clone troopers of the Grand Army of the Republic."}, {"tag": "p", "text": "The armor fell into Boba's possession after Jango was killed in battle by Jedi Master Mace Windu. Boba went on to paint the armor in distinctive colors and use it throughout his bounty hunting career. Although Boba survived being eaten by a sarlacc, his armor was scavenged by Jawas who sold it to Cobb Vanth. Din Djarin later claimed it on behalf of his people, causing Boba to track the Mandalorian to Tython where he reclaimed it while fighting against Moff Gideon's stormtroopers. Djarin recognized Boba's claim to the armor upon reading the chain code stored within it."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The customized Mandalorian armor that was worn in turn by Jango Fett and Boba Fett featured an arsenal of deadly weaponry. The wrist gauntlet included retractable wrist blades, a snare, a Czerka Arms ZX miniature flame projector, a BlasTech Industries Dur-24 wrist laser, and a Kelvarek Industries MM7 rocket launcher which was later replaced with a MM9 mini concussion rocket launcher. The gauntlets were painted red for the majority of their usage, despite being painted green for a time before returning to the prior hue. It also included a Z-6 jetpack that allowed the armor's wearer to engage in aerial travel and combat over short distances. The jetpack also contained an explosive missile that could be launched from it. In addition to the Z-6 model, Jango owned a JT-12 jetpack. Kneepad rocket dart launchers were integrated in the right kneepad of the armor as well."}, {"tag": "p", "text": "The armor was forged from durasteel and beskar. It was originally silver and blue while in Jango's possession. Its sleek design was eventually altered to a green and brownish red appearance after Boba inherited it. Despite its battle worn condition by the time of the New Republic Era, the armor was still an effective tool that allowed the individual who wore it to shrug off blaster bolts and defeat multiple opponents in a firefight. Boba replaced his father's destroyed Z-6 jetpack with a nearly identical model, as well as an additional pack distinguished by its green color scheme that he used interchangeably. After recovering his armor in 9 ABY, Boba promptly restored it, giving it a new paintjob."}, {"tag": "p", "text": "The armor contained a chain code within the left wrist gauntlets. The encoded file held information regarding the armor's owners, from Jango to Boba Fett."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Armor of Jango Fett"}, {"tag": "p", "text": "Boba Fett's armor was inherited from his clone template, Jango Fett, who received it from the Mandalorians after he became a foundling. During his storied career as a bounty hunter, Jango used his armor to great effect, collecting bounties for various clients. When Fett was hired to be a clone template, he was wearing the armor. He continued to wear the armor during the last days of his life, when he was employed by the Separatist Head of State Count Dooku. Regardless, Prime Minister Almec of Mandalore did not consider Jango a member of his people, but rather a simple bounty hunter who somehow acquired Mandalorian armor."}, {"tag": "p", "text": "With the armor, Jango was able to fight the Jedi Knight Obi-Wan Kenobi while attempting to leave the planet Kamino. His combat gear allowed him to compete against the Jedi's lightsaber combat skills and Force-sensitive abilities, but only for a time. After his Z-6 jetpack was destroyed, Jango fled from Tipoca City along with Boba, his cloned son, before Kenobi could stop them."}, {"tag": "p", "text": "Jango engaged another member of the Jedi Order, Jedi Master Mace Windu, whom he was no match against. As Windu advanced towards Jango, deflecting the mercenary's blaster bolts with his lightsaber, Jango tried to escape but his JT-12 jetpack malfunctioned. As a result, Jango was decapitated by a single strike across his neck by Windu's blade. While the Separatist Droid Army fought against the Grand Army of the Republic—clone troopers who were, like Boba, bred from Jango's template—on the field of Geonosis, Boba emerged from his hiding place and cradled Jango's helmet."}, {"tag": "h3", "text": "Boba Fett's inheritance"}, {"tag": "p", "text": "With Jango's death, his armor passed to Boba. During the Clone Wars, Boba tried to kill Windu with a bomb that he planted inside his father's helmet. Although the explosive was triggered by Jedi Knight Anakin Skywalker, Windu not only survived but also saved Skywalker in the process. While trapped under the wreckage of the Endurance, Windu inspected the damaged helmet of the hunter that he defeated on Geonosis, having realized that Boba was involved in the plot against him."}, {"tag": "p", "text": "Boba ultimately followed in Jango's footsteps, donning the Mandalorian armor as a bounty hunter during the reign of the Galactic Empire. He was one of several hunters hired by the Sith Lord Darth Vader to track a Rebel starship, the Millennium Falcon, during the Galactic Civil War. By then, Fett had a reputation for disintegrating his prey, which Vader, who wanted the Falcon's crew taken alive, warned him against. Boba later fought against the Jedi apprentice Luke Skywalker during the mission to rescue Han Solo on Tatooine. After  failing to kill or subdue the Jedi with his weapons, Boba tried to shoot Skywalker while he was distracted. During the fight, Fett's jetpack sustained a gash in the back. Before Fett could land a shot on Skywalker, a blind Solo accidentally hit Boba's jetpack, causing the bounty hunter to careen into the side of Jabba's sail barge before tumbling into the Great Pit of Carkoon where a sarlacc ate him."}, {"tag": "h3", "text": "Cobb Vanth, lawman on Tatooine"}, {"tag": "p", "text": "Fett's mostly-complete armor had been acid-scarred armor and ultimately fell into the possession of Jawas, scavengers from the desert planet Tatooine, who sold it to Cobb Vanth. Either the Jawas or Vanth patched the damaged section of the jetpack. Although he used it to protect the residents of Mos Pelgo as their marshal, the Mandalorian bounty hunter Din Djarin demanded that he surrender the suit to him when they met around 9 ABY. Vanth agreed in exchange for Djarin's help in slaying a greater krayt dragon."}, {"tag": "h3", "text": "Return to Boba Fett"}, {"tag": "p", "text": "Fett later tracked Djarin to the planet Tython, where he reclaimed the armor from the Razor Crest during a battle against stormtroopers loyal to Moff Gideon. After Fett presented the armor's chain code, providing proof of ownership and revealing that his father was a Mandalorian foundling, Djarin acknowledged Boba's right to the armor. Before a mission to Morak, Fett repainted his armor, restoring its vivid colors. Fett also produced the missing left kneepad, which was absent during the Jawas' and Vanth's ownership of the armor."}, {"tag": "p", "text": "Fett encountered the Mandalorians Bo-Katan Kryze and Koska Reeves when Djarin attempted to recruit them for his plan to rescue the foundling Grogu. Kryze denounced Fett, stating that he was not a Mandalorian in spite of the armor that he wore, although Fett countered that he never claimed to be Mandalorian. Recognizing the bounty hunter as a clone by the voice he shared with the clone troopers who fought in the Clone Wars, Kryze told Fett that he disgraced his armor. She also referred to the armor's original owner as Fett's donor rather than his father, causing Fett to threaten Kryze. A physical altercation ensued between Fett and Reeves, both of whom utilized their armor's weaponry against each other until Kryze stepped in to end the fight."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A clip of unfinished animation from a canceled episode of the animated television series Star Wars: The Clone Wars was shown during the Animated Origins and Unexpected Fates panel at Celebration Orlando in 2017. The segment featured Boba Fett donning his iconic armor for the first time in the show during a duel with fellow bounty hunter Cad Bane. The episode would have also served to explain the origins of the large dent on Fett's helmet, that being a mark from Bane's blast shot."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}