{"url": "Boba_Fett:_Crossfire", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Boba Fett books"], "nodes": [{"tag": "h1", "text": "Boba Fett: Crossfire"}, {"tag": "p", "text": "Boba Fett: Crossfire is the second in a series of young reader novels that chronicle the adventures of Boba Fett during the years between Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "His most important ally is his greatest enemy."}, {"tag": "p", "text": "Boba Fett is alone in the world. His father is dead. He's never had friends. The only thing that keeps him going is his desire to survive—and become a bounty hunter."}, {"tag": "p", "text": "Aurra Sing has taken him to Count Dooku's lair on the toxic planet of Raxus Prime. Boba thinks Dooku will help him. But Dooku has other plans…and the Jedi have their plans as well."}, {"tag": "p", "text": "The Clone Wars are raging throughout the galaxy, and Boba Fett is caught in a spectacular crossfire on Raxus Prime. What he discovers there will change the course of his life."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Young Boba Fett is brought to Count Dooku's lair on the planet of Raxus Prime by Aurra Sing. Boba Fett snoops around finding out what the Separatists are there for: the Force Harvester."}, {"tag": "p", "text": "Clone Troopers attack the planet's Separatist forces, rescue Boba Fett as an orphan taking him to a large ship in outer space. On board the Casanderri, Boba Fett hides under the name \"Heff\" and meets another orphan who he develops a friendship with. This bond is broken when Boba flees the ship when it lands on Cloud City. Boba Fett begins searching for his ship Slave I which was taken by Aurra Sing. Both meet upon a moon and agree to get Boba Fett his father's money, in exchange for half. The two leave for Count Dooku."}, {"tag": "p", "text": "Meanwhile, on Excarga, the Separatists seized control over the planet. The Galactic Republic manages to launch a strike force and take back the planet. Several prison camps were liberated, but some prisoners were not found."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Boba Fett: Crossfire."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}