{"url": "Boba_Fett:_Hunted", "categories": ["Category:Real-world articles", "Category:Boba Fett books"], "nodes": [{"tag": "h1", "text": "Boba Fett: Hunted"}, {"tag": "p", "text": "Boba Fett: Hunted is the fourth in a series of young-reader novels that chronicle the adventures of Boba Fett during the years between Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "His first mission may be his last."}, {"tag": "p", "text": "On the barren planet of Tatooine, young Boba Fett is surrounded by criminals, mercenaries, and thieves. In his quest to become a bounty hunter, he is searching out the greatest crime lord of all—Jabba the Hutt."}, {"tag": "p", "text": "But Jabba the Hutt is not easily found…or easily impressed. When Boba finally tracks down the crime lord, Jabba has an offer for him: one assignment, one chance. He must capture a deadly bounty…or else."}, {"tag": "p", "text": "It is the biggest test Boba Fett has ever faced—one that will determine his future."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Boba Fett is searching for Jabba Desilijic Tiure. Upon finding him he is hired along with Durge to take down Gilramos Libkath, wanted for stealing from Jabba and torturing children, including giving them devices that kill them if they ever leave Tatooine. Boba steals Libkath's hat while Durge opens fire on Libkath and shoots some crates which blow up taking out Durge, Libkath, and his droids. Boba gives Libkath's hat to Jabba to complete the contract."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Gab'borah Hise tells Boba that he was a successful chef at the Mos Eisley Cantina until Jabba Desilijic Tiure made him an \"offer he couldn't refuse,\" in a reference to The Godfather."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "External links"}]}