{"url": "Boba_Fett:_Enemy_of_the_Empire", "categories": ["Category:Real-world articles", "Category:Boba Fett: Enemy of the Empire"], "nodes": [{"tag": "h1", "text": "Boba Fett: Enemy of the Empire"}, {"tag": "p", "text": "Boba Fett: Enemy of the Empire is a mini-series of comics in the Boba Fett series."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Boba Fett is hired by Darth Vader to track down an Imperial colonel of the Lightning Battalion named Abal Karda. It seems that Karda killed his superior officer after the Icarii campaign on Vestar and was last seen carrying a kneedhide casket in Port-Esta. Boba leaves for Vestar immediately, fully knowing that Vader put a tracer beacon on Slave I but not knowing that he also sent three assassins led by Nevo to kill Fett once he's found the casket. Fett learns from some Lightning Battalion troopers that Karda went insane after he decimated a whole tribe of Icarii and decapitated their leader Selestrine. Then he plans on checking out the freighter Port-Esta Queen which is on a return route to Vestar and he suspects had something to do with Karda's escape. Boba Fett finds out from the captain of the freighter Port-Esta Queen that they dropped off Karda at Starstation 12, with braid of hair from the Icarii queen as proof. Darth Vader's assassins also find this information and follow Fett there. Fett finds out from a trading post dealer that a tattooist named Bojam Rees sold an identical braid of hair about ten days earlier. From the tattooist, he finds out that Karda was going by the name Mixxim and got a tattoo on his face. He recognizes the design of the tattoo as the tribal pattern of the Duhma. Before he leaves Starstation 12, Boba has an encounter with one of the assassins trailing him, a human named Gann, and he kills him after getting the info he needed. From his ship's computer, he finds out that a Duhman left the station about nine days earlier aboard the liner Orramas, and he catches up with the ship on the planet Rim 3. The captain of the liner tells Fett that the passenger was dropped off on Maryx Minor six days earlier. Meanwhile, at the hermitage of the Ancient Order of Pessimists on Maryx Minor, Abal Karda is going crazy knowing that Fett is coming for him. Fett and his pursuers are on Maryx Minor. They finally meet up while on the way to the hermitage of the Ancient Order of Pessimists, the likeliest place Abal Karda is hiding in. The fight is short, and Fett arrives at the gates of the hermitage. With a threat of death from Karda if they don't protect him, the hermits try to stop Fett but they're no match for him. Fett dispatches Karda easily and gets to the casket containing Queen Selestrine's head. From her he hears how the story of how she became into Korda's possession and why he tried to escape from the Empire. And Darth Vader is on his way to the hermitage, where he will have to confront Fett to get the casket. At the hermitage of the Ancient Order of Pessimists on Maryx Minor, Darth Vader and Boba Fett are fighting over the head of Queen Selestrine of the Icarii, who can foretell the future of any man who possesses her. To escape Vader's grip, Fett kicks the casket containing the head over a cliff, distracting Vader long enough for the bounty hunter to make his escape. Once aboard his Star Destroyer, Vader is contacted by the Emperor who is asking for the head just as Selestrine predicted. Vader then decides to kill Selestrine, as she wished it before she told Vader of the perils of knowing the future."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The series was originally titled Boba Fett: The Vader Job."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}]}