{"url": "Boba_Fett:_Pursuit", "categories": ["Category:Real-world articles", "Category:Boba Fett books"], "nodes": [{"tag": "h1", "text": "Boba Fett: Pursuit"}, {"tag": "p", "text": "Boba Fett: Pursuit is the sixth and final in a series of young reader novels that chronicle the adventures of Boba Fett during the years between Star Wars: Episode II Attack of the Clones and Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A father's death. A son's revenge."}, {"tag": "p", "text": "Boba Fett is emerging as one of the most skilled bounty hunters in the galaxy. After surviving his deadly battle with the fearsome General Grievous, there's one bounty he wants more than any other: Mace Windu, the Jedi who killed his father."}, {"tag": "p", "text": "When fate and Anakin Skywalker bring Boba Fett to the city-planet of Coruscant, Boba plunges into the Coruscant underworld and arms himself for the greatest confrontation of his young life."}, {"tag": "p", "text": "It's the bounty hunter vs. the Jedi as Boba Fett takes his one and only chance at revenge."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel opens with a twelve year old Boba Fett inside a Separatist stronghold on Xagobah. Fett lies on the ground, paralyzed by a toxin used to escape a near death experience against General Grievous. He is taken to a blast furnace to be destroyed, but escapes when his paralysis subsides and he destroys two droids. He leaves the stronghold and reaches Slave I. Once in space he spots his primary target, and attacks Tambor's vessel. After damaging the vulnerable vessel, he has to break off the attack because of Asajj Ventress, who nearly destroys him save for Anakin Skywalker intervening in time."}, {"tag": "p", "text": "Skywalker forces Fett to land on a nearby moon. Exchanging greetings, Skywalker begins repairing Slave I while Fett repairs his armor. Once finished, Skywalker moves to detain Fett, but a giant Space Slug incapacitates Anakin, leaving Fett to destroy the behemoth. He shoots the slug several times in the head causing it to whimper back into cover and Skywalker agrees not to arrest Fett, but tells him to go to Coruscant as Fett revealed he had information vital to the Galactic Republic."}, {"tag": "p", "text": "On arriving in Coruscant airspace, he is escorted by Governor Tarkin and Luminara Unduli to the Jedi Temple. Inside, Fett makes his way to the visiting quarters, passing Mace Windu (who he blames for his father's death) on the way. In his quarters, Fett contacts Jabba the Hutt's contact on Coruscant, Hat Lo. Boba waits at a landing dock for Elan Sel'Sabagno, who flies him to a bar that Hat Lo owns where Boba collects various weapons before returning to the Temple with Elan. Once inside, he races to Windu's quarters only to be too late. He breaks through a window and flies to the Senate Building. He breaks into Palpatine's quarters and finds Windu waiting for the Chancellor. They engage in a fight, with Windu eventually taking out most of Fett's weapons. The fight ends in stalemate with each about to strike when Palpatine arrives and scolds Windu."}, {"tag": "p", "text": "Boba then tells Palpatine about the trap that the clone army has become because of Count Dooku. Palpatine acknowledges that he knows and reveals his intentions indirectly to Boba. The Chancellor then gives Boba a cube of credits to keep him quiet. Boba returns to Slave I to contemplate his future, finally shedding his past."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "On the front cover, Anakin Skywalker's appearance is similar to how he looks in Revenge of the Sith. His glove is actually placed on the incorrect hand, however."}, {"tag": "p", "text": "Asajj Ventress and her Fanblade starfighter are also on the cover. She makes an appearance in a dogfight against Boba, despite the fact that she apparently deserted the Separatist cause after the Battle of Boz Pity only one month earlier."}, {"tag": "p", "text": "Two Imperial-class Star Destroyers are shown on the cover, but this would appear to be an oversight as these vessels do not feature in the story."}, {"tag": "p", "text": "Another apparent error has Boba's helmet being shown on the front cover bearing a dent it will not receive until after the events of this novel in a fight against Darth Vader."}, {"tag": "p", "text": "Wilhuff Tarkin appears in this book, prior to his becoming a Grand Moff."}, {"tag": "p", "text": "Boba Fett confronts Mace Windu to avenge his father's death. Many fans had expressed their wishes to see such a confrontation. Fett, then a hot-headed child, was able to match the Jedi Master, but the fight was ended before either was killed. Darth Vader's future impression of Boba Fett as a highly capable and reliable bounty hunter may have been shaped by this event."}, {"tag": "p", "text": "Boba Fett re-paints his father's armor in the green and red livery that will later achieve infamy."}, {"tag": "p", "text": "On the spines of later editions of this title, the word \"Wars\" was accidentally omitted from the name \"Star Wars\"."}, {"tag": "p", "text": "This book incorrectly states Boba Fett had never been to Coruscant before, but he in fact did so in Boba Fett: The Fight to Survive."}, {"tag": "p", "text": "The book incorrectly describes Jedi Luminara Unduli as having dark eyes and bronze skin, when she has bright blue eyes and olive green skin."}, {"tag": "p", "text": "At the end of the story Boba Fett entertains the notion of visiting the Regional Sector Number Four's All-Human Free-For-All on Jubilar, indicating that the events at the start of the short story The Last One Standing: The Tale of Boba Fett happen immediately thereafter. However, according to the timeline this story takes place at least six years earlier. Of course it would not be impossible for Fett to visit the games before that."}, {"tag": "p", "text": "In Star Wars: The Clone Wars, Boba attempts at getting revenge on Mace Windu by infiltrating his Jedi cruiser and when made the ship crash he used Jango Fett's helmet by placing a motion sensitive bomb in it. Boba at this time had no Mandalorian armor. Instead, he wore dark grey colored jumpsuit with a brown belt with a twin blaster holster and white kneepads with boots that seemed very similar to the boots his father had worn."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Boba Fett: Pursuit."}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}