{"url": "Boba_Fett:_Overkill", "categories": ["Category:Real-world articles", "Category:Boba Fett one-shots"], "nodes": [{"tag": "h1", "text": "Boba Fett: Overkill"}, {"tag": "p", "text": "Boba Fett: Overkill is a comic written by Thomas Andrews and illustrated by Francisco Ruiz Velasco. It was released April 12, 2006 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Boba Fett rockets onto the scene with blasters blazing in this stand-alone story featuring the galaxy's greatest bounty hunter taking on a dangerous contract that proves deadly for all involved!"}, {"tag": "p", "text": "Summoned to settle the score between two warring factions, Fett quickly shows his employers the importance of always choosing the right tool for the job, and the folly of underestimating just how much damage and chaos a single Mandalorian can inflict. Once unleashed, Fett's drive to finish the job is unshakable, and both groups quickly realize they're dealing with a bigger and much deadlier mutual problem—one that must be stopped before it obliterates everything!"}, {"tag": "p", "text": "Don't miss this essential piece of the Boba Fett mythos written by Thomas Andrews (Star Wars: Empire) and illustrated with the eye-popping art of Francisco Ruiz Velasco (Lone Wolf 2100)."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the Imperial backwater world of Troska, the local Imperial authorities are clashing with the local government. As the over-ambitious Commander Sev Buzk argues with Prince Torino Kyber over the latest in a series of fuel blockades, one young lieutenant named Manech decides to take matters into his own hands. Unbeknownst to his superiors, Manech has hired the legendary Boba Fett to deal with the planet's rebellious Royal Family. After destroying one of their fuel refineries and killing their crown prince, it is apparent they may soon have a war on their hands. Upon finding out about Manech's scheme, Buzk scrambles fighters in an attempt to make it to the Kyber Palace before Fett, but he is too late. Fett subdues the royals in time for the TIEs to arrive and finish the job. Afterward, an Imperial Admiral arrives to congratulate Manech with a promotion to Sector Commander, and to arrest Buzk for his abuse of Imperial authority. However Boba Fett warns Manech that with his new authority, he has made enemies who may one day call on Fett to kill him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}