{"url": "Boba_Fett_and_the_Assassin_Droids", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bands"], "nodes": [{"tag": "h1", "text": "Boba Fett and the Assassin Droids"}, {"tag": "p", "text": "Boba Fett and the Assassin Droids was an underground musical group. Named after the Mandalorian bounty hunter Boba Fett, and assassin droids, the band played on the planet Adarlon during the Galactic Civil War. Even though they lacked any real musical talent, they obtained a number of followers among non-Human communities. Although Boba Fett did not show any interest in his namesakes, they attracted the attention of the Imperial Board of Culture, who officially forbade several of their singles in an unsuccessful attempt to stop them from producing music."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Boba Fett and the Assassin Droids was a musical group named after Boba Fett, a renowned Mandalorian bounty hunter, and assassin droids. The band was considered to be newly formed soon after the Battle of Yavin, and were known as the \"Galaxy's original talent-free band.\" They performed a blaring, screechy version of Core Drive—a popular and energetic genre of music known for its bass lines mimicking the sound of a hyperdrive engine. While on tour promoting their first album, Boba Fett and the Assassin Droids clashed with Dead Rebels, who were performing as the opening act for the band. During Dead Rebels' rendition of \"Death Star Diva,\" their lead singer was knocked unconscious by a Mandalorian flute/weapon known as a bes'bev."}, {"tag": "p", "text": "Throughout the following four years, they obtained a regularly growing community of adherents, and even a cult following. Many of the followers were non-Humans, for reasons nobody could explain. Boba Fett and the Assassin Droids settled on the planet Adarlon, which was far from the Galactic Core and, thus, from the most stringent censors of the Galactic Empire. The Droids obtained success and became a fashionable act. Local merchants believed they could make money by ferrying audiences to the Droids' concerts."}, {"tag": "p", "text": "During the Galactic Civil War, the Droids released several singles to the galactic distribution nets, including \"IG-88, Where R U?\"—named after the assassin droid IG-88—and \"If You're a Biped, I Can Make U Limp.\" As their tracks were widespread, they attracted the attention of the Imperial Board of Culture, who considered at least two of the songs, \"Blow 'em All Away\" and \"Who Cares (If Freedom's Gone)?,\" to be anti-Imperial, and thus too dangerous to be broadcast. Those two songs were then banned. The Droids nonetheless were making advances in the intergalactic market, and publicly showed their intention to release a complete album in the near future. The band's detractors considered this to be a threat."}, {"tag": "p", "text": "Around 6 ABY, T-shirts of this band were available for low-income, small-sized humanoids in the planet Reuss VIII, as exemplified by the clothes worn by Mygo Skinto, leader of the Rust Rats gang of orphaned children, per the description given by shockboxer Lobar Aybock in his autobiography."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Boba Fett and the Assassin Droids was a band without any kind of musical talent, and a style that was far more violent than other underground bands to which they were compared. The group had not attracted the attention of the Mandalorian Boba Fett, and experts believed that he would not deign to take measures against the band if their activities somehow reached his ears."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boba Fett and the Assassin Droids were first mentioned in the role-playing book Galaxy Guide 9: Fragments from the Rim, written by Simon Smith and Eric S. Trautmann and published in 1993 by West End Games for Star Wars: The Roleplaying Game. It was later mentioned on a shirt in the short story Fists of Ion, available through Hyperspace and later Suvudu. The band was subsequently discussed in the second part of Slugthrowers: An Overview of Popular Music and Musicians in a Galaxy Far, Far Away, published on StarWars.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}