{"url": "Boco", "categories": ["Category:Canon articles", "Category:Chiss starships", "Category:Patrol craft"], "nodes": [{"tag": "h1", "text": "Boco"}, {"tag": "p", "text": "The Boco was a patrol ship in service to the Chiss Ascendancy's Expansionary Defense Fleet. It served under the command of Junior Commander Mitth'raw'nuru during a rescue of a luxury passenger liner that was descending into a gas giant planet, during which time it was Thrawn's first command."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While commanding the Boco, Thrawn saved the lives of 8,000 Chiss aboard a derelict luxury liner, aided by his commanding officer Mid Captain Irizi'ar'alani. The passengers and crew aboard the liner had been evacuated from the liner's luxury wings to the vacuum-sealed central compartment. Thrawn proceeded to shoot off the liner's luxury wings with the Boco's laser weapons, reducing the liner's mass enough for the Boco's tractor beams to rescue the passengers and crew from the central compartment. In the process, Thrawn saved the lives of Aristocra of at least five of the Nine Ruling Families."}, {"tag": "p", "text": "The luxury liner's owners in the Boadil family were livid at the loss of property. The liner's captain, a member of the Ufsa family, was responsible for the vessel succumbing to the upper atmosphere of the gas giant. The Boadil were allied with the Ufsa, as well as Mid Captain Ziara's Irizi family; so family politics concerns led the Boadil to scapegoat Thrawn for the loss of property. The Boadil family demanded Thrawn be demoted or even expelled from the fleet for property damage, but the grateful Aristocra of other Ruling Families whose lives Thrawn saved balanced out the Boadil's fury. Those families insisted Thrawn be commended and even promoted. Ultimately, Thrawn was neither promoted nor demoted; punished nor commended, with one crucial exception: command of the Boco was taken away from him."}, {"tag": "p", "text": "Having lost his first command, Mid Captain Ziara requested that Thrawn be transferred to her command to serve as an officer on her Parala."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}