{"url": "Bodhi", "categories": ["Category:Legends articles", "Category:Je'daii Temples"], "nodes": [{"tag": "h1", "text": "Bodhi"}, {"tag": "p", "text": "Bodhi, or the Temple of the Arts was one of nine temples of the Je'daii Order located on the southern coast of Masara, a continent on the verdant world of Tython. A two-story structure, the temple at Bodhi served as the Order's academy for the arts, instructing students in the ways of writing, calligraphy, dancing, drawing, sculpture, cooking, music, and theater."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the philosophers and scholars from across the galaxy first arrived on Tython, they were brought forth from the stars on giant pyramidal constructs called the Tho Yor. These nine massive ships scattered across the planet and landed in separate locations, releasing those held within to settle the planet. The Tho Yor themselves would serve as the very foundations for these travelers' new homes and places of study."}, {"tag": "p", "text": "One such Tho Yor touched down in one of Tython's verdant plains, near to a temperate forest and the southern coast on the continent of Masara. The philosophers, calling themselves members of the Je'daii Order, buried the Tho Yor and erected a low-lying temple on its face. Consisting of four identical buildings made of tan stone and red roofs, the structures surrounded an open courtyard with a large circular pool of water at its center. The Temple of the Arts at Bodhi focused on teaching its students, young and old, to understand the manifestations of the Force through the arts. The Je'daii Temple Master, the Je'daii who served as steward of the facility and oversaw its functions, instructed students in the ways of writing, dancing, and sculpture among many other arts. In 25,793 BBY Master Jake Fenn was the Temple's overseer. The Je'daii collected many Kwa, Gree and Rakatan artifacts from across Tython and stored them within the Tho Yor at Bodhi, which was buried beneath Bodhi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}