{"url": "Boelo", "categories": ["Category:Legends articles", "Category:Desilijic servants", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Boelo"}, {"tag": "p", "text": "Boelo was a Human male who served in the crime lord Jabba the Hutt's criminal empire on the planet Tatooine. For a time, he served as Jabba's right-hand man, before eventually being replaced by Naroon Cuthus several years before the Battle of Yavin. In 0 BBY, Boelo visited Chalmun's Spaceport Cantina, and shortly afterward accompanied Jabba to Docking Bay 94 in Tatooine's Mos Eisley spaceport, where the Hutt spoke to smuggler Han Solo over a debt the latter owed Jabba."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Boelo lived during the Galactic Civil War, a conflict between the Galactic Empire and the Alliance to Restore the Republic. At some point, he joined the crime lord Jabba the Hutt's criminal empire on the planet Tatooine, becoming the Hutt's right-hand man, and was eventually replaced in that position by Naroon Cuthus. He also owned a pet womp rat named Worra."}, {"tag": "p", "text": "In 0 BBY, Boelo was present at the bar of Chalmun's Spaceport Cantina within Tatooine's Mos Eisley spaceport when a farmboy named Luke Skywalker and a Jedi Master named Obi-Wan Kenobi arrived, looking for a pilot to take them and the droids C-3PO and R2-D2 to the planet Alderaan, ultimately meeting smuggler Han Solo. Boelo later accompanied Jabba on a visit to Docking Bay 94 in the spaceport. He stood near the entry ramp of Solo's YT-1300 light freighter Millennium Falcon when Jabba intended to collect a debt Solo owed the crime lord. After Solo arrived and made a deal with Jabba, the Hutt and his entourage, including Boelo, left the site."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Boelo would see what he wanted to see, and hear what he wanted to hear. He had brown hair and fair skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Boelo sported a blaster pistol, and carried an ammunition bandolier across his trench coat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boelo first appeared as an uncredited extra in the 1977 film Star Wars: Episode IV A New Hope, as a patron extra in the Mos Eisley cantina scene. He was also in a scene cut from the film, among Jabba's henchmen confronting Han Solo later on in the spaceport. The scene would be added into the film's Special Edition, released in 1997. One year later, in 1998, Boelo was first named, and given a brief backstory, on a card for the Star Wars Customizable Card Game's Special Edition Limited expansion set."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}