{"url": "Bog_Divinian", "categories": ["Category:Legends articles", "Category:Bureaucrats of the Galactic Empire", "Category:Confederacy of Independent Systems individuals", "Category:Galactic Republic senators", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bog Divinian"}, {"tag": "p", "text": "Bog Divinian, nicknamed Bantha Bog by Keets Freely, was a male Human senator of the Galactic Republic from 26 BBY until 24 BBY; he represented Nuralee. Later, he fell in with the Confederacy of Independent Systems during the Clone Wars. Afterwards, he became the Imperial governor of the Leemurtoo system."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time of his marriage, Divinian was a homesteader in the Outer Rim. The husband of Astri Oddo and father of Lune Oddo Divinian, he was elected to the Galactic Senate with backing from the Commerce Guild. In exchange, he kept quiet about their involvement in a scandal on the planet Euceron: Divinian had served there on the Games Council for the Galactic Games of 26 BBY, in which he initially served simply as an unwitting pawn, but later as a knowing accomplice—by his unwillingness to testify (spurning a Jedi team's request) against guilty high-profile Council members—in a conspiracy with the Commerce Guild to discredit certain respected Senators in exchange for untold wealth and power."}, {"tag": "h3", "text": "Games Council groveler"}, {"tag": "p", "text": "While it was noted that Bog disapproved of podracing, this may have just been consistent with his early behavior as an innocent \"Yes\"-man bowing to power, merely affirming the ultra-hypocritical attitude of the Games Council leadership as to the distasteful \"illegalities\" of the sport, in which the Council had intimately, albeit clandestinely, involved itself. Even so, in the end, Divinian's failure of integrity to disclose the truth about the Games scandal, transformed the power-hungry bureaucrat into a complicit criminal alongside his fellow Council-member perpetrators."}, {"tag": "h3", "text": "Anti-Jedi Senator"}, {"tag": "p", "text": "Divinian, caught now in the web of prejudice and political corruption, later joined Sano Sauro's anti-Jedi faction in denouncing the Jedi, debating heatedly with Bail Organa over Senate support of the Jedi in the Senate Hearing Chamber. However, his proposals lost all support when the Jedi stopped Granta Omega's vicious attempt to murder Supreme Chancellor Palpatine and thousands of Senators with their top advisors in the Senate Rotunda itself."}, {"tag": "p", "text": "At some point in the Clone Wars, Divinian had sided with the Confederacy of Independent Systems. What his position of power was during that time is unknown."}, {"tag": "h3", "text": "Imperial Advisor & Governor"}, {"tag": "p", "text": "By 18 BBY, Divinian had managed to rise to the rank of Imperial Advisor. Stationed on the desert planet Samaria, he was in charge of overseeing Ferus Olin's attempt to root out the saboteur in the planet-wide computer system. When Samaria fell to Imperial occupation, Divinian was appointed governor of the Leemurtoo system, encompassing both Samaria and Rosha. Later that year, Divinian wholeheartedly enrolled Lune in the Coruscant Naval Academy. When the instructor, Maggis, called him in for a conference later that year, Maggis told Divinian that eight-year-old Lune had been selected for an unknown project. Although Divinian showed some discomfort, he allowed his son to be taken away. Unknown to him, Lune would be the subject of scientist Jenna Zan Arbor's experimental memory drug."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}