{"url": "Bogan", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Locations of the Je'daii Order", "Category:Type I atmosphere moons", "Category:Tython system moons"], "nodes": [{"tag": "h1", "text": "Bogan"}, {"tag": "p", "text": "Bogan was one of the two moons of the planet of Tython. Observing both Bogan and Ashla, the other natural satellite, the first settlers of Tython recognized the light and the dark aspects of the Force. Later, both moons were colonized by non-Force-sensitive Tythans who built stone cities there and subsequently settled the rest of the Tython system. By the year 25,793 BBY, Bogan had been abandoned by the settlers and was used as a place of exile by the Je'daii Order for its members who had veered too much to the dark side of the Force. Those Je'daii would contemplate the light of the moon of Ashla, while the Je'daii sent to Ashla for straying too far to the light side meditated on Bogan in return."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Along with Ashla, Bogan comprised the pair of moons of Tython—the fifth planet of the Tython system that was located in the Deep Core region of the galaxy, at galactic coordinates L-10. From orbit, Bogan appeared to be mostly rusty-brown in color. The moon had an atmosphere that was breathable to Humans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the first settlers of Tython observed Ashla and Bogan, they developed the notions of the light and the dark side of the Force—which they also called Ashla and Bogan, respectively—and understood the necessity for a balance between those two Force aspects. These beliefs gave rise to a legend of the Je'daii Order which stated that the two moons were birthed by Tython from its fiery core in order to remind of the perpetual struggle between dark and light to all those who sought balance. In the second millennium following the settlement of Tython, the non-Force-sensitive Tythans colonized the moons, building stone cities there, and later settled the rest of the worlds in the star system.\nBy the year 25,793 BBY, Bogan had been abandoned by the settlers and was used as a place where the Je'daii would send those members of the Order who had strayed too far to the dark side of the Force. Those exiled Je'daii would meditate on the moon of Ashla in order to re-achieve balance between the two aspects of the Force, while, conversely, the Je'daii who had veered too much to the light side were sent to Ashla and contemplated the moon of Bogan."}, {"tag": "h3", "text": "Known Exiles"}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The first settlers of Bogan built cities on the moon, using stone as a building material. The ruins of those cities were used millennia later by the Je'daii who were banished to the moon. The exiled Je'daii Daegen Lok visited the ruins on at least two occasions in 25,793 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The moon Bogan was first depicted in Star Wars: Dawn of the Jedi 0, a preview issue of the Star Wars: Dawn of the Jedi series of comic books. The issue was published on February 1, 2012 and was written by John Ostrander and penciled by Jan Duursema. Bogan made its first in-universe appearance in the first issue of the series, published on February 15 of the same year. The moon later appeared in the second, the third, the fifth and the sixth issue of the comics. Bogan was mentioned in the 2012 reference book Star Wars: The Old Republic Encyclopedia, as well."}, {"tag": "p", "text": "In Star Wars: The Old Republic—a 2011 massively multiplayer online roleplaying game developed by BioWare—a single moon of Tython appeared in a cutscene depicting the player-controlled Jedi Padawan's approach to the planet; however, the moon remains to be identified as either Ashla or Bogan. This cutscene was later revised (as part of an update to all class introductions and planetary approaches) to show both moons, but both are depicted as light grey in color."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}