{"url": "Bogden_Jedi_chapter_house", "categories": ["Category:Legends articles", "Category:Jedi chapter houses"], "nodes": [{"tag": "h1", "text": "Bogden Jedi chapter house"}, {"tag": "p", "text": "A chapter house was located on the Inner Rim moon of Bogden 3, established by the Jedi Order sometime prior to the Clone Wars. As of 19 BBY, Jedi Master Du Mahn was the facility's administrator."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Occupied by a clan of Jedi Initiates during the Clone Wars, this facility hosted the Soaring Hawkbat Clan at the time of the Siege of Saleucami. Awaiting transport back to the main academy in the Coruscant Jedi Temple, the group's shuttle was delayed due to the battle that took place over the capital world. Waiting patiently, the facility's administrator and the clan's instructor, Master Du Mahn, continued the Hawkbats' education, with the assistance of Padawan Chase Piru. Their wait was interrupted when the damaged shuttle of Masters K'Kruhk and Sian Jeisel landed in the facility's courtyard. While their clone troopers made repairs, the two Masters recuperated in the facility as the younglings prepared a great feast for the war-weary generals."}, {"tag": "p", "text": "Following the feast, the clone troopers prepared to return to their repairs when they received Contingency Order 66 from the Office of the Supreme Chancellor on Coruscant. Raising their rifles, the troopers opened fire on the younglings as the Masters ignited their lightsabers and began to slay the traitorous clones. As Jeisel and Piru deflected blaster bolts, the great Whiphid Master leaped to-and-fro cutting down troopers in a rage. As Master Mahn shepherded her students to the main entrance of the facility, she fell victim to the troopers fire. In a last ditch effort, Master Jeisel used the Force to trigger a trooper's thermal detonator as K'Kruhk took the remaining students to the shuttle. As Jeisel and the remaining troopers died in the ensuing explosion, the facility's main building went up in flames. Master K'Kruhk flew off with the survivors, at a loss for the troopers' betrayal."}, {"tag": "p", "text": "Despite suffering damage during the execution of Order 66, the Galactic Empire was able to salvage the property and later agreed to terms with the Bounty Hunters' Guild, allowing members of the guild to use the facilities as a training ground."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Consisting of four main buildings, the training facility was made out of a cream-colored stone with green tinted windows. A stone landing pad sat outside the main building, a two story structure with a curving roof. Inside the spacious main building was a gathering hall that served as a dining area. Orange pillars curved down from the ceiling while a spiraling staircase led to kitchens and storage rooms. Colorful lanterns hung from the ceiling to illuminate the open room, while a wide, circular doorway led to the outside. In the rear of the building, another set of doors led out into a courtyard with benches and lamp posts."}, {"tag": "p", "text": "The training facilities surrounding the main building were all connected by single story hallways. Domed structures housed training facilities and dormitories, while an orange tower stood sentinel over the academy grounds. Most of the facilities remained intact following Order 66, though the main building's entrance was destroyed in the assault. The buildings were later used by bounty hunters for training exercises."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}