{"url": "Bogey", "categories": ["Category:Legends articles", "Category:Creature stubs", "Category:Creatures of Kessel", "Category:Creatures of unspecified biology", "Category:Creatures of unspecified diet", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Bogey"}, {"tag": "p", "text": "A Bogey was a kind of creature that lived in the Spice Mines of the planet Kessel."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "These beings were noted for being phosphorescent non-sentient creatures that floated through the black tunnels on Kessel. They seemingly fed on lichen and other forms of underground fungus. The more remarkable trait demonstrated by these beings was their capacity to pass through solid rock. However, they were unable to pass through the webs created by energy spiders, who spun the material to ensnare the bogeys in order to feed on them as their favored meal. Bogeys also had an effect on the black glitterstim strands produced by the spice spiders and gave them their blue photoactive nature. If these creatures would pass through machinery that contained energy, the machinery would power down, and sometimes never power back up. Only after their residual energies dissipated did the crippled electronics return to power."}, {"tag": "p", "text": "Some speculated that the creatures were not alive and could not be detected by the Force. Force-sensitives were only capable of feeling energy and intent from these beings. Large colonies, however, were able to be sensed by a trained Force user; though there was no life within them, hostile intent could be discerned. In reality, their closest function was similar to datacards with access to their contents being done by simple touch with its entire purpose being communication. A reservoir of energy was contained within them and had the ability to communicate. It was also a big store of fresh data that was linked to the machinery underneath Kessel. The information included thousands or millions of three-dimensional data that needed to be delivered."}, {"tag": "p", "text": "These creatures had a wide array of color schemes; they also emitted a musical-type of noise. The size of the bogeys tended to vary with some of these swirling balls of colored light being large enough to fit an R2-series astromech droid. A hand was able to brush across its outer nimbus with an individual feeling static electricity from this contact. When approaching beings, they simply hovered and made curious clacking chattering noise."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The source of the bogeys came from machinery deep in the caverns beneath the surface of Kessel with some speculation attributing these devices being the creation of the Celestials. They were responsible for maintaining variables and unimaginable numbers contained within the installation that served as a giant astronomical observatory of the galaxy which contained the coordinates of all gravity wells."}, {"tag": "p", "text": "Bogeys were pure energy and seemingly fed on the glitterstim found in the mines. They became the main diet of the energy spiders that secreted glitterstim. By the times the Spice Mines were being mined for glitterstim, these beings were long thought to have been the creation of many a scatterbrained prisoner or mine worker."}, {"tag": "p", "text": "In 43.5 ABY, Leia Organa Solo uncovered the true nature of the bogeys whilst exploring the underground levels of Kessel. Her contact with them allowed her to sense a feeling of futility among them as the bogeys began to feel that the data they were maintaining was going to be lost with the cycle ending. After the machinery in the caverns of Kessel was destroyed, the bogeys disappeared with their existence seemingly tied to those devices."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}