{"url": "Boiler_rifle", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Blaster rifles"], "nodes": [{"tag": "h1", "text": "Boiler rifle"}, {"tag": "p", "text": "The boiler rifle was a model of short-range blaster rifle that could be modified with an underbarrel spin-sealed bottle of tibanna gas that illegally doubled the weapon's fire power. In 0 BBY, the Rebel Alliance Special Forces commando Paodok'Draba'Takat Sap'De'Rekti Nik'Linke'Ti' Ki'Vef'Nik'NeSevef'Li'Kek used a black market boiler rifle during the Battle of Scarif."}, {"tag": "p", "text": "In 9 ABY, a group of hunters used one such rifle when ambushing the Mandalorian Din Djarin on the planet Tatooine. The weapon was later used by the Kanjiklub criminal group, with the group's Lieutenant Razoo Qin-Fee maintaining and modifying the weapons. Two members of the gang carried boiler rifles while boarding the smuggler Han Solo's freighter, the Eravana, in 34 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Boiler rifles were a type of short-range blaster rifle. The body, grip, and trigger were black in color, as was the weapon's stock, which attached to the body on an extended recoil-absorbing stalk. The barrel was silver in color and had a spin-sealed bottle of explosive tibanna gas attached to its underside, a modification that doubled the weapon's firepower but was dangerous and illegal. Such a modification quickly burned through the circuitry of the weapon's galven barrel, meaning that the weapon required constant upkeep. The rifles also had a scope attached above the body, although these were mostly for show due to the rifle's short range. When being prepared to fire, the rifle emitted a whirring sound."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Scarif"}, {"tag": "p", "text": "In 0 BBY, the Drabatan Special Forces commando Paodok'Draba'Takat Sap'De'Rekti Nik'Linke'Ti' Ki'Vef'Nik'NeSevef'Li'Kek used a black market tibanna-jacked boiler rifle during the Battle of Scarif, in which a group of Alliance to Restore the Republic forces traveled to the planet Scarif in order to steal the plans for the Death Star superweapon from the Imperial Citadel Tower."}, {"tag": "p", "text": "During the mission, Pao wore four replacement galven barrels on each wrist. The Drabatan proved himself with the blaster during the mission, but perished while fighting stormtroopers on the beaches of Scarif in order to create a distraction for rebels who had entered the tower to steal the plans. An artist compiling a journal of notes and sketches included a sketch of Pao carrying his boiler rifle in the book, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY."}, {"tag": "h3", "text": "Tatooine ambush"}, {"tag": "p", "text": "In 9 ABY, a group of four hunters in possession of a boiler rifle ambushed the Mandalorian Din Djarin and the foundling Grogu on the planet Tatooine. The group used a trip wire to destroy the speeder bike that their targets were traveling on and then attacked them with other blasters, leaving the boiler rifle in a large case to the side."}, {"tag": "p", "text": "After the Mandalorian managed to defeat one of his attackers and disarm another, the disarmed hunter ran to the case and picked up the boiler rifle, aiming it at Djarin as the Mandalorian grappled with two other attackers. Before the rifle could be fired, Djarin launched a fibercord whip from his gauntlet to pull the boiler rifle from its wielder's hands and whip it into the heads of the two grapplers, knocking them out. Djarin then defeated the final attacker and safely left with Grogu."}, {"tag": "h3", "text": "Kanjiklub"}, {"tag": "p", "text": "During the Cold War between the Resistance and the First Order, boiler rifles were used by members of the Kanjiklub criminal organization. Lieutenant Razoo Qin-Fee maintained the boiler rifles used by its members, constantly modifying and upgrading them."}, {"tag": "p", "text": "In the year 34 ABY, Kanjiklub members Tolomar Reez and Volzang Li-Thrull carried tibanna-jacked boiler rifles when they boarded the Baleen-class heavy freighter Eravana to reclaim a debt from the smuggler Han Solo; however, the rifles were unable to penetrate the skin of the deadly rathtars that the gang members encountered onboard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boiler rifles first appeared in the 2015 sequel trilogy film, Star Wars: Episode VII The Force Awakens. They were first identified by name in Star Wars: The Force Awakens: The Visual Dictionary, a reference book written by Pablo Hidalgo in conjunction with the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}