{"url": "Boles_Roor", "categories": ["Category:Canon articles", "Category:Males", "Category:Podracers", "Category:Sneevels"], "nodes": [{"tag": "h1", "text": "Boles Roor"}, {"tag": "p", "text": "Boles Roor was a Sneevel podracer pilot from Sneeve who had won two Boonta Eve Classic podraces, which had taken place on the planet Tatooine. Roor later participated in another Boonta which took place during the year 32 BBY. Yet, despite Roor's earlier victories, the podracer pilot was unable to claim the championship a third time, as the race was won by the human Anakin Skywalker, while Roor finished in sixth place."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A skilled Sneevel podracer pilot from Sneeve, Boles Roor was a regular of the Boonta Eve Classic podrace course, located on the planet Tatooine, near the city of Mos Espa. On two occasions, Roor managed to win the annual event, taking the victory cup away from the track's crowd favorite, the Dug pilot Sebulba. In 32 BBY, Roor participated in another Boonta Eve Classic race, where the pilot was to once again face down Sebulba. In addition, the competition included the competitive Xexto Gasgano, the Boonta regular Dud Bolt, the Gran pilot Mawhonic, and the human slave Anakin Skywalker, among other pilots. The race began in the Mos Espa Grand Arena, and Roor's pod was placed in between the pods of Gasgano and pilot Teemto Pagalies, and was directly behind the pods of Skywalker and pilot Clegg Holdfast."}, {"tag": "p", "text": "The opening ceremonies were conducted by the Troig commentators Fode and Beed, who introduced Roor to the crowd while mentioning his previous victories. During this time, Roor's pod was being maintained by several Ishi Tibs. After the ceremonies came to a close, the host, crime boss Jabba the Hutt, flagged the start of the race. Although Roor had a good lead, the former champion fell back to the middle of the pack, and was eventually passed by Skywalker shortly before entering a cave that sped into the Canyon Dune Turn during the first lap. Roor ultimately ended up finishing in sixth place and losing the race to Skywalker, while Sebulba, the crowd favorite, crashed in the third lap."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An alien with fur, Roor possessed pointed ears, beige and gray fur, light-colored skin, and yellow eyes."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Roor was a very skilled pilot, evident by the multiple Boonta championships the pilot had achieved. However, Roor was not a consistent racer, and fell behind the leaders during the Boonta race that was won by Skywalker. Podracers were known to possess quick reflexes, which Roor had, due to Roor's previous victories."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although Boles Roor was originally created for the 1999 film Star Wars: Episode I The Phantom Menace, which was directed by George Lucas, the character first appeared in the film's novelization, which was written by Terry Brooks. In the film itself, however, Roor only appears fleetingly in the pilot's cockpit, with the most clear representation of the character being seen on a viewscreen set behind Fode and Beed during the film's podracing sequence. Although Roor is mentioned by name, only Roor's empty cockpit is seen among the other pilots who are also named onscreen. The image of Roor on a viewscreen connected the cockpit with Roor's physical appearance. Whereas Roor in the cockpit, for mid-race sequences, was realized with the use of a computer generated graphic, Roor's face on the viewscreen was based on an image of a detailed sculpture created by the film's art department, which was created during the film's pre-production stages."}, {"tag": "p", "text": "Conceptual art of the character by artist Terryl Whitlatch dates back to the year 1996, and several drawing existed which detailed Roor's design, biology, and gear. This art was used as a basis to create the aforementioned sculpture. During this conceptual phase, Roor was simply referred to as \"Shaggy Podracer.\" Roor's vehicle was a full-construct that was moved to Tunisia for filming, although for in-race shots it was computer generated. A computer generated model of Roor's podracer also appeared in The Phantom Menace's sequel, Star Wars: Episode II Attack of the Clones, although Roor did not appear. Overall, Roor's early designs differed little from the character's final look."}, {"tag": "p", "text": "Boles Roor had several appearances in the non-canon Star Wars Legends continuity, including the 1999 video game Star Wars Episode I: Racer, where Roor was a playable character whose voice was provided by Peter Lurie. Roor also appeared in the Phantom Menace's comic adaption during the second issue. However, in the comic Roor's podracer is given to the podracer pilot Ben Quadinaros. In the tie-in comic Podracing Tales, Roor was mentioned as having finished the Boonta in sixth place. Although Roor's canonical placing is never revealed in the film, his sixth place finish was confirmed by the source book Star Wars: Absolutely Everything You Need to Know."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}