{"url": "79%27s/Legends", "categories": ["Category:Legends articles", "Category:Cantinas", "Category:Coruscant locations"], "nodes": [{"tag": "h1", "text": "79's"}, {"tag": "p", "text": "79's was a cantina located on the Galactic Republic's capital world of Coruscant. Offering alcoholic beverages, music, and several vidscreens for viewing sporting events, the bar was a bustling establishment popular with a segment of Coruscant's nightlife. Following the authorization of military leave for the clone troopers of the Republic's Grand Army, 79's became known for its frequent patronage by the clone soldiers during the later years of the galaxy-spanning Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located on the planet Coruscant, the capital world of the Galactic Republic, 79's was a cantina that operated in the ecumenopolis' entertainment district. At least two stories in height, 79's was nestled in one of Coruscant's enormous skyscrapers; the bar's main entrance was positioned at one of the building's corners, trimmed by wide walkways and supporting curbside traffic from speeders and air taxis. Two sets of sliding doors allowed customers entrance to 79's, above which the bar boasted a large, brightly lit sign displaying the establishment's name. Inside, an assortment of tables and booths were arranged for patrons to sit at across two floors. In the center of the first floor, a long, oval bar was tended by several 2-1B-series medical droid droid servers, led by BU-11. They offered various drinks, served by several BD-3000 luxury droids as waitresses. 79's maintained a number of viewscreens broadcasting sporting events from around the galaxy, including podracing, and the bar played energetic dance music for its patrons. At the back of 79's main room, on the first floor, was as a latrine for customer use."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "79's opened at a point in time prior to 20 BBY. In 21 BBY, the Republic Senate Head of Public Affairs, Mar Rugeyan, had authorized military leave for the clone soldiers of the Grand Army of the Republic at the behest of military contractor Kal Skirata. 79's soon became a popular destination for clone troops on Coruscant leave, leading many to identify the establishment simply as a \"clone bar,\" though 79's served numerous other customers who were not clone soldiers."}, {"tag": "p", "text": "Near the end of the Clone Wars, circa 20 BBY, the fugitive Advanced Recon Commando, CT-5555—known by the nickname Fives—came to 79's seeking a way to alert the Jedi Order to a conspiracy he had unintentionally discovered, and clear his name of the accusations lobbied against him by those who wanted the danger covered up. That night, 79's hosted several dozen off-duty clone troopers and non-clone Republic officers, as well as civilian customers of various races, including Twi'leks, Siniteen, and Dugs. Among the patrons in attendance, Fives located his former comrade from the 501st Legion, Kix. In the privacy of 79's latrine, Fives arranged for Kix to set up a meeting with Jedi General Anakin Skywalker and Captain Rex in order to help the troubled and framed commando. Soon after, shock troopers from the Coruscant Guard arrived in pursuit of Fives, forcing the ARC trooper to sneak out of 79's in order to evade capture. A probe droid which was outside 79's followed the speeder with Fives without him knowing and eventually led him to be found by the the Coruscant Guard shock troopers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "79's bar first appeared in the fourth episode of the Star Wars: The Clone Wars television series' sixth season, entitled Orders. The bar was later mentioned in Tim Veekhoven's Star Wars Blog entry Sports in the Star Wars Galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}