{"url": "Boles_Roor/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Males", "Category:Musicians", "Category:Podracers", "Category:Sneevels"], "nodes": [{"tag": "h1", "text": "Boles Roor"}, {"tag": "p", "text": "Boles Roor was a male Sneevel, a professional and successful glimmik singer, and a famous Podracer pilot, known for his strong voice and his daredevil driving. Initially combining both pursuits, this Sneevel became a star in each profession, singing in the Kallarak Amphitheater on Coruscant and winning the Boonta Eve Classic on Tatooine twice. He was considered a living legend, although not one without detractors. He eventually decided to concentrate on his musical vocation, but returned to sports at least twice on special occasions. Although by then his critics thought Roor's Podracing skills were not at their best, his performance was surprisingly good. When racing, Roor favored a Bin Gassi Racing Engines Quadrijet 4-Barrel 904E, even after the model had become obsolete."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "A male Sneevel from the planet Sneeve, Boles Roor was an accomplished Podracer, commonly racing in non-protective clothing. He was known to pilot his Bin Gassi Racing Engines Quadrijet 4-Barrel 904E pod. His high-output machine with modified cockpit could reach 790 km/h, and Roor could control it at that speed. Roor was the track favorite of the Zugga Challenge on the planet Mon Gazza, and during his career he twice won the prestigious Boonta Eve Classic on Tatooine. Critics, however, attributed his victories less to any real talent and more to sheer luck."}, {"tag": "p", "text": "Roor, who regarded himself a crooner before a racer, concentrated on his vocation as a glimmik singer, achieving a successful career. While Roor raced in full clothes, he was naked when singing or casual. Half-retired from Podracing by the time the highly-successful Dug Sebulba started in the sport, Roor instead sang in distinguished venues such as the Kallarak Amphitheater on Coruscant, a million-seat hall that regularly sold out for each performance."}, {"tag": "p", "text": "Neglecting his vehicle's upkeep, Roor hired a crew of Ishi Tibs to perform maintenance tasks while he was singing. At some point, he also hired Shrivel Braittrand, a Kulless, as his chief mechanic. Even with their work, the pod began to suffer: its dual combustion chambers failed to cool properly, its internal components were replaced by sub-par substitutes when needed, and the soldered seams were of poor quality. The racer also had low quality welding in its left engine."}, {"tag": "h3", "text": "Boonta Eve Classic, 32 BBY"}, {"tag": "p", "text": "After an important leave from the Podracing pro circuit, Roor returned to the Boonta Eve Classic for the race of 32 BBY. He was not the only old-timer in the race, but both his vehicle and his skills had grown rusty, and the racing scene had evolved without his knowing. Even then, Roor refused to replace his out-of-date pod."}, {"tag": "p", "text": "The day before the race, Roor and some of the Boonta Eve favorites, including the Xexto Gasgano, the Gran Mawhonic, the Nosaurian Clegg Holdfast, and Sebulba, were featured in the Fode and Beed Show, the talk show of race commentator Fodesinbeed Annodue. Sebulba taunted each of his challengers during the program, with Roor being the only one to reply to him. Roor also announced a glimmik performance for that same night during the show. While on Tatooine, Roor patronized the food stand operated by Gragra, the Swokes Swokes gorgmonger."}, {"tag": "p", "text": "On the night before the Boonta, Roor gave his glimmik show in the Poodoo Lounge, in the city of Mos Espa. During his act, Roor arrogantly and noisily taunted the rookie Toong pilot Ben Quadinaros, wagering five million peggats that a cowardly Toong like Quadinaros wouldn't enter the race. To everybody's surprise, including himself, Quadinaros accepted. Roor avoided public embarrassment by dedicating his first song to Quadinaros, and continued with a loud concert."}, {"tag": "p", "text": "In the Boonta Race, Roor was upset to see Quadinaros in the eighteenth starting block from Roor's own tenth post. By then, his bet with the Toong was public knowledge. However, Quadinaros's quickly-rented |BT310 quadra-Podracer was sabotaged by another pilot, Ark Roose, who was trying to damage Anakin Skywalker's vehicle. As a result, Quadinaros never advanced past the starting block, nevertheless winning his bet."}, {"tag": "p", "text": "Meanwhile, Roor was racing at high speed. He finished the race in sixth place, with a total time of 16:42:473 and an average speed of 781 km/h. His rival Sebulba did not even finish the race, as he crashed before reaching the finish, while the victory went to the young Skywalker. During a party after the race, Roor's bet with Quadinaros was the talk of the pilots. Roor was disgruntled, but promptly paid Quadinaros his money."}, {"tag": "h3", "text": "Later career"}, {"tag": "p", "text": "To compensate for his losses during the Boonta Eve Classic of 32 BBY, Roor put Podracing back on the shelf and took a tour around the galaxy performing glimmik. In this period of time, he gave his pod to his chief mechanic Braittrand, who modified the racer, and used it in further competitions."}, {"tag": "p", "text": "Ten years after the race, Roor had became a legend on his homeworld of Sneeve. He abandoned his retirement to publicly support Senator Jollin Resbin of Sneeve, a proponent of the Military Creation Act during the Separatist Crisis. Roor appeared in a series of holographic endorsements and ran in charity races in the Mid Rim to spread Resbin's message in the area. He was scheduled to run in the Dasoor Challenge the same day of the final vote on the Act, weather permitting."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "At 1.6 meters, Boles Roor was relatively short for a Sneevel, who commonly ranged from 1.6 to 2.1 meters in height. Like many others of his species, Roor was shaggy and gave off a pungent smell that was one of his personal trademarks. Another was his powerful voice, which he used to his advantage in his singing career. He was a talented musician whose performing flair made him quite wealthy. When singing glimmik, Roor played a pink instrument with a long neck that he carried nonchalantly."}, {"tag": "p", "text": "Many Sneevels felt a need for thrill. Roor was not the only one of his species who resorted to dangerous sports as a way of life. Although a capable, awarded pilot in his prime, recognized as such by critics, Roor's Podracing skills were less competitive by comparison as of 32 BBY, as the pilots he raced against had faster reflexes and the podracing circuit had changed since his times. As such, Roor was never considered to be a main contender to win the Boonta Eve Classic and was generally regarded as a second-rate pilot in comparison to the likes of Sebulba and Gasgano. Nevertheless, Roor considered Podracing little more than a hobby, finding much more interest in his vocation as a musician."}, {"tag": "p", "text": "For the Boonta Eve Race of 32 BBY, Roor chose to use his old Bin Gassi Racing Engines Quadrijet 4-Barrel 904E, even when other, newer and better models were available; Roor was criticized for this decision. Nevertheless, the racer's expensive price tag allowed Roor to show off his wealth. Although most Podracer pilots were also the primary mechanics of their own vehicles as of 32 BBY, at that point Roor had low skills in that field relative to his rivals'. Rather, Roor hired a crew of other beings to maintain his pod. When piloting, Roor wore clothes, something he did not do when performing glimmik."}, {"tag": "p", "text": "Roor's arrogance and bluster showed itself the night before the Boonta Eve in the Poodoo Lounge when he taunted Ben Quadinaros into accepting a five-million-peggat bet that the former would not enter the race. Roor was subsequently embarrassed by Quadinaros's acceptance of the challenge."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character Boles Roor was first mentioned in the novelization of Star Wars: Episode I The Phantom Menace, and first appeared in the second issue of the film's comic adaptation as one of the Podracers participating in Tatooine's Boonta Eve Classic. Notably, however, Roor is never clearly visible on-screen in The Phantom Menace film. When the Boonta Eve race announcer calls his name, only his Podracer's empty cockpit is seen. However, his face can be seen briefly on a screen during a previous scene in which the announcer welcomes the audience."}, {"tag": "p", "text": "During the film's development stages, Boles Roor was first known as \"Shaggy Podracer\" in the character's original Star Wars Episode I: The Phantom Menace concept sketches by artist Terryl Whitlatch. Boles Roor's character was voiced by Peter Lurie in the video game Star Wars Episode I: Racer."}, {"tag": "p", "text": "The revised rough draft of The Phantom Menace mentions the Podracer Boles Roor, from a planet named \"Ord Padrove.\" The name of the planet may have evolved to Ord Pedrovia, Gasgano's podracer."}, {"tag": "p", "text": "Roor appears in the computer game Star Wars: Jar Jar's Journey Adventure Book, released in 1999 by Lucas Learning, during a mini-game that takes place at Gragra the gorgmonger's stand. In the game, Roor is one of a series of patrons who approach the stand and order some food item in rhyme. The player must then select the correct order from a list of pictures to please the customer. Roor in the game is voiced by Peter Lurie."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}