{"url": "Bolo", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Ithorians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bolo"}, {"tag": "p", "text": "Bolo was an Ithorian male who was a regular patron of Cid's Parlor on Ord Mantell. Usually seen with the Weequay Ketch, Bolo wore a translating vocoder in order to speak Galactic Basic Standard."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bolo, a male Ithorian, lived in Ord Mantell City at the beginning of the Imperial Era. Alongside his friend, the Weequay Ketch, the two were regular patrons of Cid's Parlor, a cantina and gambling parlor run by the information broker Cid. The two frequently played dejarik there, and were doing so when the Bad Batch, a group of fugitive former clone commandos, came to the bar in search of Cid. None of the members of the Batch actually knew what Cid looked like, however. Hunter asked Cid, who was repairing a slot machine, if she knew the owner, but she denied it. Seeing Bolo and Ketch getting into an argument over their dejarik game, the Batch was at something of a loss as to how to find Cid before the child clone Omega managed to deduce Cid's identity, whereupon she took them into her office."}, {"tag": "p", "text": "Later, after carrying out a job for Cid as payment for some information, the Batch remained on Ord Mantell. Omega was training in the use of a Zygerrian energy bow she had acquired with Echo's encouragement when Bolo and Ketch showed up. The two took up positions drinking and watching, exchanging bets on whether or not Omega would hit the target. After Omega hit her target for the third time, Ketch passed Bolo some credit chips as the Ithorian gloated. Finding the duo annoying, Omega told Echo she had been doing better before they had arrived, but he told her she had to learn to tune out distractions. On the next shot, Omega missed wildly, leading Bolo to have to pay up Ketch. However, Cid shortly arrived and shooed the two out, as she wanted to brief the Batch on a job she wanted them to do."}, {"tag": "p", "text": "Some time afterwards, Bolo and Ketch were playing dejarik in the bar when the Batch returned from a mission to retrieve a lizard from the Rhokai gang. After Wrecker and Omega had gone on leave and Hunter, Tech and Echo were talking with Cid in her office, some other patrons left, leaving Bolo and Ketch alone in the bar with one other person, the disguised Captain Rex, a friend of the Batch who had recently tracked them down and had been sitting quietly and observing. Bolo took offence to Rex sitting in his seat and told him to move, a request which he pointedly ignored in favour of sipping his drink. When Ketch told his friend that the man was ignoring them, Bolo restated his demand. The situation escalated quickly, and Rex forced the two to flee by firing two warning shots with one of his blaster pistols. When Cid, Hunter, Echo and Tech burst out of her office in response to the noise, they saw Bolo and Ketch running out of the bar, Bolo demanding that Ketch get out of his way. Cid was exasperated to learn the newcomer was another clone, snapping at Hunter that her business was not a \"clone clubhouse\" before retreating to her office."}, {"tag": "p", "text": "Later on, Cid's Parlor had been seized by Roland Durand, but Cid had a plan to take the parlor back. Ketch and Bolo had a part in this plan: they were to distract Durand. Ketch walked past him, dropping some grains of Mantell Mix behind, enticing Roland´s pet Ruby to follow them. Soon after, Durand saw that Ruby was missing and went looking for her, giving time for Cid and the Bad Batch to enter the office and steal his spice. The duo fled when Durand found them."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bolo was a male Ithorian with orange skin and blue eyes. He was good friends with the Weequay Ketch, although they occasionally argued with each other. They found it amusing to exchange bets when Omega was training with her energy bow, leading her to consider them annoying. Bolo also had a preferred seat in Cid's Parlor, and would attempt to reclaim it for himself if he saw someone else sitting there. However, Bolo was not a fighter, and would run if someone he attempted to harass proved to be more dangerous."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Bolo wore a sleeveless and legless blue jumpsuit, as well as a translating vocoder on his neck to translate his native Ithorese into Galactic Basic Standard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bolo was voiced by Liam O'Brien."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}