{"url": "Bolvan/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bolvan"}, {"tag": "p", "text": "Bolvan was a Human male captain of the Imperial Navy during the Imperial Period. He captained the Imperial Star Destroyer Devastator under the command of the Dark Lord Darth Vader. In 7 BBY, when an Imperial-produced bacterial plague began to spread out of control on Falleen, Bolvan suggested the sterilization of the planet, but Vader ordered an orbital bombardment of the world instead. Later, in 0 BBY, while serving as gunnery captain, Bolvan participated in the Devastator's capture of the Rebel CR90 corvette Tantive IV, during which Chief Gunnery Officer Hija spotted an escape pod fleeing from the impounded Rebel vessel. However, Bolvan ordered him not to fire on the pod because the Devastator's gunnery sensors detected no lifeforms aboard."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Falleen bombardment"}, {"tag": "p", "text": "The Human male Bolvan was a member of the Galactic Empire's navy during the Imperial Period. By 7 BBY, he captained the Imperial I-class Star Destroyer Devastator, commanded by the Dark Lord Darth Vader. In that year, the Star Destroyer arrived at the planet Falleen as part of Vader's exploration tour visiting Imperial weapon development projects. Bolvan informed Vader of an accident in a biological research facility and the following spread of a flesh-eating bacterium across Falleen's surface. The Captain passed his datapad to Vader, showing him projections that were based on information salvaged from the laboratory and predicted the devastation of the whole planet in a short time."}, {"tag": "p", "text": "Bolvan suggested requisitioning the ordnance from Project X271 and incinerating the plague from orbit, but Vader disagreed, because he did not wish to wipe out the entire Falleen species. Instead, Vader ordered an orbital bombardment of the surface to halt any further spread of the leaking bioweapon. Chief Gunnery Officer Lieutenant Hija was responsible for firing the turbolaser bombardment from the Devastator that destroyed the weapons facility and everything within forty kilometers to cover up the mishap. Among the 200,000 Falleen casualties in the ensuing destruction was the family of Prince Xizor, who later led the Black Sun criminal organization."}, {"tag": "h3", "text": "Capture of the Tantive IV"}, {"tag": "p", "text": "In 0 BBY, during the Galactic Civil War, Bolvan still served on the Devastator. However, by this time, Captain Mulchive Wermis had assumed the position of the Devastator's commanding officer, and Bolvan was in charge of the main weaponry as gunnery captain. In that year, after Rebel agents transmitted stolen plans of the first Death Star to the Rebel CR90 corvette Tantive IV, Senator Leia Organa's consular ship, the Devastator pursued and captured the Rebel vessel over the planet Tatooine."}, {"tag": "p", "text": "Bolvan was listening to the reports on the proceedings aboard the captured Rebel vessel as the last pockets of resistance were dealt with. Several escape pods had been jettisoned from the Tantive IV during the battle, and, spotting another one, Lieutenant Hija called Bolvan for instructions. Hija spotted the pod that, unbeknownst to the Imperials, contained the Rebel droids C-3PO and R2-D2, the latter of whom carried the stolen Death Star plans in his memory banks. However, since the Devastator's gunnery sensors detected no lifeforms within the escape pod, Bolvan believed the pod's release mechanism must have short-circuited or received a false instruction. So, Bolvan ordered Hija to hold his fire in order to conserve power, allowing the droids to escape. Bolvan then returned to the reports listing the captured men and material coming from the Rebel ship."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a captain during the incident on Falleen, Bolvan was thorough and merciless in his desire to incinerate the plague from orbit, even at the cost of genocide, contrary to Darth Vader's final orders. He approached Vader, his superior, gingerly during the Falleen incident, pleading in opposition to the Sith Lord, who warned him to learn to offer his counsel at a more appropriate time."}, {"tag": "p", "text": "By 0 BBY, Bolvan served the Empire in a lower commission as gunnery captain. He was less thorough in dealing with the escape pod fleeing the Tantive IV, however. Bolvan relaxed considerably at his post once the Tantive IV was secured and listened with pleasure and satisfaction to the reports from the Rebel ship. He was confident in the firepower and total control of his command, and read the sensor data of the escaping pods casually. The gunnery crews of the Devastator had a surprising amount of autonomy, and Bolvan's poor judgment in ordering Lieutenant Hija not to open fire on a pod that showed no signs of housing lifeforms in exchange for sparing energy effectively allowed the droid R2-D2 to escape with the Death Star plans. Bolvan chose to wear the prominent sideburns that were popular among Imperial officers around the time of the Battle of Yavin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bolvan first appeared in the December 1976 novelization of Star Wars: Episode IV A New Hope, ghost-written by Alan Dean Foster. Although not credited in the film, he was portrayed by John Forgeham, according to the fan site Planet Dagobah."}, {"tag": "p", "text": "The revised fourth draft script of A New Hope, as well as the film's novelization, refers to Bolvan as \"Captain\" in relation to the Devastator. However, the March 21, 1979 Marvel Star Wars comic Star Wars 21 identified the captain of Vader's Star Destroyer as Mulchive Wermis. West End Games' Shadows of the Empire Sourcebook in 1996 named Bolvan the captain of the Devastator. In 2007, the fourth chapter of the StarWars.com Visual Guides feature first identified Bolvan as the black-uniformed officer from A New Hope who orders Hija not to fire on the escape pod and Wermis as the captain of the Devastator. Finally, in 2008, The Complete Star Wars Encyclopedia, in order to solve the issue of two captains on the same ship, established Bolvan as the ship's gunnery captain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}