{"url": "Bombad_Jedi", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Bombad Jedi"}, {"tag": "p", "text": "\"Bombad Jedi\" is the eighth episode of Season One of the television series Star Wars: The Clone Wars. It is the eighth episode of the series overall and is the first in a three-part storyline."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "On a diplomatic mission to the planet Rodia, Padmé; discovers that her old friend and fellow Republic senator Onaconda Farr has allied his planet with the Separatists. In exchange for food and resources for his people, Onaconda captures Padmé and promises to deliver her to Nute Gunray. Sensing Padmé is in trouble, Jar Jar Binks disguises himself as a Jedi, and with the help of C-3PO, courageously fights to rescue his friend and fellow senator."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Padmé Amidala travels to Rodia in an attempt to persuade Senator Onaconda Farr, whom she fondly addresses as Uncle Ono since a time when he had helped out her father, to keep his allegiance to the Galactic Republic. She brings along C-3PO and Jar Jar Binks, despite Supreme Chancellor Palpatine's advice to rather take along a bodyguard force. But upon arrival, she learns that Onaconda has already pledged allegiance to the Separatists and Viceroy Nute Gunray is delivering supplies as the Republic could not. Already, there are battle droids in his city. The droids shackle Padmé's arms to the wall, as Gunray ordered as a precaution before he personally comes for her."}, {"tag": "p", "text": "Jar Jar and Threepio get into even more trouble when droids come to arrest them. Though Jar Jar's bumbling with the magnetic crane destroys the droids, he also destroys their ship, ruining their chance to contact help. He puts on a Jedi robe Padmé had stored in the back closet (most likely belonging to Anakin Skywalker), but droids spot them and everyone presumes he's a Jedi. Jar Jar manages to escape to the water down below, where he promptly has to run from a marine monster, while Threepio is taken off to be scrapped. Word of a Jedi around gives Padmé an idea: while she bluffs the droids into thinking the Jedi has rescued her already, she slips out of her shackles using a key from her boot, roundhouse kicks the droid, steals its blaster and escapes."}, {"tag": "p", "text": "Padmé rescues Threepio but is dismayed to learn that Jar Jar is the presumed Jedi. She tells Threepio to find a communication station to call for help. Meanwhile, Gunray has arrived in his shuttle and tells Onaconda that the supplies will be delivered after Padmé is executed. Onaconda tries to protest but Gunray insists, declaring that Rodia is under his protection now. Onaconda then realizes that he has made a bad mistake siding with the Separatists."}, {"tag": "p", "text": "Jar Jar goes to rescue Padmé, only to be spotted and shot at. He again dives into the water as droids throw down thermal detonators and fire a rocket at him. While swimming away, he runs into the \"boogie monster\" he met previously, which swallows him up as the rockets are about to explode. Thankfully, the beast saves him thanks to its thick hide, and Jar Jar declares it his friend."}, {"tag": "p", "text": "Threepio manages to send out a message before being captured. Gunray has a trio of droidekas line up to execute Padmé and Threepio when Jar Jar and the boogie monster burst up from the swamp. In the ensuring chaos, Gunray tries to get away, but his shuttle is pushed into the swamp by the monster and Padmé holds him at gunpoint. Onaconda appears behind Padmé, his own blaster at the ready, and Gunray orders the Rodian to shoot \"the Jedi\" and then her. However, upon seeing Onaconda's expression, Padmé tells Gunray about their \"little secret,\" that Onaconda planned to trap Gunray all along. Onaconda agrees that he is with the Republic, and places Gunray under arrest."}, {"tag": "p", "text": "A Republic cruiser arrives with reinforcements to take Gunray away, while Onaconda thanks Jar Jar (whom he calls \"Master Bombad\") for his assistance, but Jar Jar states he is just a Gungan. Palpatine, via holoprojector, promises supplies to Rodia. Onaconda asks Padmé if she can ever forgive him, but she replies that it is the Republic who should ask him for forgiveness. Far too often they forget that their most important allies are not always the most powerful."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Quinlan Vos was originally slated to appear in an early draft of \"Bombad Jedi.\" He was to be working undercover and actually using his Force abilities to make it look like Jar Jar was a Jedi. He was eventually cut, because at the early stages of production the studio didn't have the ability to include many new characters because of the time it took to create a digital model."}, {"tag": "p", "text": "This is the only episode of season 1 to have Ahmed Best, the original voice of Jar Jar, in said role, as BJ Hughes voices Jar Jar in \"The Gungan General,\" \"Blue Shadow Virus\" and \"Mystery of a Thousand Moons.\" However, Ahmed reprises his role again in the season 3 episode \"Supply Lines\" and for the season 4 episodes \"Gungan Attack,\" \"Prisoners\" and \"Shadow Warrior\" along with the season 6 episodes \"The Disappeared\" Part 1 and 2."}, {"tag": "p", "text": "According to story editor, Henry Gilroy, the part where Jar Jar appears to vanish leaving the droids to find nothing but a the Jedi robes is a homage to the scene in A New Hope where Darth Vader slays Obi-Wan."}, {"tag": "p", "text": "Nute Gunray's arrival bears a heavy resemblance to Darth Vader's visit to the DS-2 Death Star II Mobile Battle Station in Episode VI. Both shuttles are escorted by two fighters that break off as the shuttle enters a hangar. Both Vader and Gunray emerge from the shuttles to meet a subordinate and an array of grunts."}, {"tag": "p", "text": "The Kwazel Maw is based on an unused Ralph McQuarrie design for a swamp slug creature on Dagobah."}, {"tag": "p", "text": "When Jar Jar is putting on the Jedi robe he says \"Mesa eyeball stuck in da sleeve,\" yet the Jedi robe shown in the episode has no sleeves and looks more like Count Dooku's cape, minus the clasp. Also, when he emerges from the water, he puts it on quickly and easily."}, {"tag": "p", "text": "When Jar Jar confronts Gunray and demands that Padmé be released, his ears clip through the back of his hood."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}