{"url": "Bombardment_of_the_Uba_system", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Pages needing citation", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Bombardment of the Uba system"}, {"tag": "p", "text": "During the New Sith Wars, the Galactic Republic launched a preemptive strike against the Uba system, the home star system of the Ubese species, to show the proud Ubese that the banned weapons they were constructing were inferior to the Republic's own. However, the orbital bombardment of the planets Uba I, Uba II, Uba IV, and Uba V accidentally ignited superweapon caches, ravaging the planets' surfaces with radioactive firestorms. The only survivors were found on Uba IV, some of whom were relocated to the Ubertica system. The event led to a deep-seated hatred of the Republic among the Ubese."}, {"tag": "h2", "text": "History and the purge"}, {"tag": "p", "text": "For centuries prior, the Ubese had begun manufacturing weaponry in a bid to become more competitive, and to spread their influence throughout the galaxy."}, {"tag": "p", "text": "However, among these were weapons banned since the foundation of the Republic. Upon further investigation by local sector observers, the combined worlds launched a preemptive strike in the form of a tactical planetary bombardment of the Ubese weapons manufacturing plants. Unfortunately for the Ubese, the bombardment set off the largest share of their tactical weapons of mass destruction, utterly destroying three out of the four inhabited worlds in the system (Uba I, II, and V), with the only survivors found on Uba IV."}, {"tag": "p", "text": "Ashamed of their actions, the Old Republic covered up the entire affair. The Republic sector authorities refused all relief aid in the aftermath, even going so far as to wipe the very coordinates of the Uba system off the galactic navcharts, and decades later, the average galactic citizen had never even heard of the Ubese near-extinction. Some of the Ubese, however, did escape, and managed to secrete themselves away on various worlds, blaming the Republic for turning their world into a radioactive ball and the Jedi for not acting in time to save them."}, {"tag": "p", "text": "These Ubese refugees managed to find employment with various crime lords and other shadowy figures, forging themselves into weapons: well-trained, highly disciplined, and utterly unstoppable in their hatred of the Republic and the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The timeframe of the Battle of Uba IV presented in The New Essential Chronology conflicts with the previous official account given in the game Knights of the Old Republic II: The Sith Lords—in the game's storyline, a number of the Ubese survivors from the battle had taken up employment with the Quarren Exchange crime lord Visquis on Nar Shaddaa, acting as personal grenadiers within his private sanctuary. The game describes their clan despising the Jedi for not interceding in the Republic bombing of their planet."}, {"tag": "p", "text": "The information presented in The New Essential Chronology does, however, more closely mesh with the account given in the role-playing game supplement Alien Encounters."}, {"tag": "p", "text": "Dan Wallace explains the discrepancy as follows:"}, {"tag": "p", "text": "The Essential Atlas finally dates the event to 1800 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}