{"url": "Bombing_of_Callos", "categories": ["Category:Legends articles", "Category:Artificial disasters", "Category:Battles in the Brema sector", "Category:Battles of the early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Bombing of Callos"}, {"tag": "p", "text": "The Bombing of Callos, also known as the Battle of Callos, was fought early in the history of the Galactic Empire."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "In 3 BBY, Imperial forces under the command of Darth Vader attacked Callos, after discovering evidence that the Callosians were developing a new offensive technology intended to oppose those who were spreading the New Order. Black Eight Squadron, Vader's personal fighter wing, was assigned to bomb the Callosian defenses."}, {"tag": "p", "text": "Once the military objective had been neutralized, Captain Juno Eclipse was ordered to continue the assault. Eclipse protested, saying that maintaining the bombardment would amount to genocide, since Callos was already defenseless. Vader offered her an alternative, stating that if she disabled Callos's planetary reactor, he would consider the mission complete. Eclipse was initially relieved, believing that a precision strike upon a single target would cause much less collateral damage than blanket bombing the entire planet, and carried out her orders."}, {"tag": "p", "text": "Although the bombing run on the reactor was a success, it came at a high cost: immediately following the attack, the damaged reactor began spewing pollutants into the atmosphere and flooding the planet's river systems with poisonous chemicals, triggering a chain reaction that would ultimately destroy Callos's biosphere. Eclipse provided data on the attack to a friend of hers with a background in environmental science; he told her that the planet's forests would be gone within six months, and would never return."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Eclipse had a natural interest in xenobiology, and admired and was fascinated by the wide diversity of life to be found in the galaxy; the thought that she was personally responsible for the destruction of a planet that had previously been teeming with life made her feel physically ill. For months following the mission on Callos, she was haunted by feelings of guilt and remorse and sometimes experienced nightmares about leading the attack itself. Although she had demonstrated her loyalty, Vader judged that Eclipse lacked the ruthlessness that he deemed vital to the command of Black Eight Squadron, and reassigned her to pilot the Rogue Shadow. She later remarked that the planet Felucia, with its abundance of life, reminded her of Callos."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}