{"url": "Bombing_at_the_Empire_Day_parade", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Events of the Early rebellion against the Galactic Empire", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Bombing at the Empire Day parade"}, {"tag": "p", "text": "On the fifteenth anniversary of the Proclamation of the New Order, the Spectres carried out a bombing during the Empire Day parade on Lothal. The bombing destroyed an experimental starfighter, a TIE Advanced v1, thus disrupting the tightly-controlled Empire Day festivities."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Near the end of the Clone Wars, Emperor Palpatine dissolved the Galactic Republic and established the first Galactic Empire. In addition, Palpatine also destroyed the Jedi Order during the Great Jedi Purge. For the next fourteen years, Empire Day was used to commemorate the birth of the Empire. Seeking to establish a new trade route to facilitate their expansion through the Outer Rim Territories, the Empire established a presence on the planet Lothal. The Empire exploited the agrarian planet for mining precious metals and kyber crystals, and recruiting new personnel for its burgeoning military. In addition, Sienar Fleet Systems also established a factory on Lothal to manufacture starfighters."}, {"tag": "p", "text": "As Imperial rule grew more oppressive, several loosely-connected rebel cells and factions emerged across the galaxy to oppose the Empire. One of these groups was the Spectres, a small cell consisting of the Twi'lek captain Hera Syndulla, the former Jedi Padawan Kanan Jarrus, the astromech droid Chopper, the Lasat warrior Garazeb Orrelios, the former Mandalorian Imperial cadet Sabine Wren, and the Lothalian Jedi trainee Ezra Bridger. These rebels harried the Empire by raiding Imperial convoys, disrupting Imperial projects, assaulting Imperial personnel and eluded numerous attempts by the Imperial authorities to capture them."}, {"tag": "p", "text": "Prior to the fifteenth Empire Day, the Imperials were also hunting for Tseebo, a Rodian employee with the Imperial Information Office who had gone missing. Tseebo wore an AJ^6 cyborg construct that contained highly sensitive information about the Empire's operations on Lothal. Fearing that Tseebo and his valuable information would fall into the hands of the rebels, the Imperial authorities had launched a manhunt. Unknown to the Imperials, Tseebo was an old friend of Ezra's parents who had stolen the information in order to make up for the wrong of having done nothing to save Ezra's parents."}, {"tag": "h2", "text": "The bombing"}, {"tag": "p", "text": "For the fifteenth anniversary of Empire Day, Imperial Minister Maketh Tua served as the master of ceremony at the Capital City celebrations in the absence of Governor Arihnda Pryce; who was offworld. Commandant Cumberlayne Aresko and Taskmaster Myles Grint were tasked with organizing the celebrations and parade. As part of the Empire Day parade, several Imperial vehicles including AT-DP walkers and Imperial Troop Transports drove through the streets of Lothal's Capital City, flanked by crowds of civilians. To emphasize Lothal's importance to the Empire, Minister Tua decided to showcase the new TIE Advanced v1, which was to be flown by the famous Baron Valen Rudor."}, {"tag": "p", "text": "Unknown to the Imperial authorities, the Spectres had planned to disrupt the festivities by blowing up the TIE Advanced prototype. Kanan, Ezra, Sabine, and Zeb mingled among the crowd and pretended to patriotic citizens engaging in the festivities. While Sabine and Zeb threw fireworks into the sky to provide distraction, Kanan crept towards the TIE prototype and planted an explosive. When he was spotted by a stormtrooper, Kanan pretended to be drunk and Ezra backed him up by pretending to lead his father away. Before Baron Rudor could climb into the TIE prototype, the starfighter exploded; bringing the festivities to an end."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Amidst the chaos, the Spectres made their way to a safe house which turned out to be the former Bridger household. There, the rebels encountered Tseebo. While Ezra was still angry at Tseebo for not standing by his parents, Kanan and Sabine insisted on rescuing him. The three rebels hijacked an Imperial Troop Transport and headed towards the outskirts of Capital City to rendezvous with the other rebels aboard the Ghost. They managed to break through one roadblock but were pursued by the Imperial Security Bureau Agent Kallus."}, {"tag": "p", "text": "Following a struggle, the Spectres managed to rendezvous with their comrades aboard the Ghost and fled into space. Their troubles were not over because they were then pursued by the Grand Inquisitor's TIE Advanced v1 starfighter and several TIE fighters. Despite some difficulty, the rebels managed to jump into hyperspace after Tseebo transmitted the coordinates into the Ghost's computer. However, their problems were far from over because the Grand Inquisitor had managed to attach an XX-23 S-thread tracker to the hull of the Ghost's auxiliary ship Phantom."}, {"tag": "p", "text": "After detecting the presence of the homing device, the rebels split up. While Kanan and Ezra took the Phantom to lure the Grand Inquisitor away from the Ghost, the other rebels brought Tseebo to the rebel leader known Fulcrum; who arranged for him to go into hiding. This plan worked and the rebels succeeded in eluding the Grand Inquisitor and his stormtroopers."}, {"tag": "p", "text": "In response to the Empire Day parade bombing and other insurgent activities, Governor Pryce ordered a planetwide crackdown on all sedition and dissent on Lothal. Imperial cadets were used to assist stormtroopers in several law enforcement operations which included reporting suspicious activity, detaining suspicious individuals, and placing the children of fugitives in protective custody. This crackdown preceded a planetary blockade imposed by Darth Vader."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Bombing at the Empire Day parade served as a plot element of the Star Wars Rebels episode Empire Day, which first premiered on November 10, 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}