{"url": "Bombing_of_Auyemesh", "categories": ["Category:Legends articles", "Category:Battles in the Outer Rim", "Category:Battles of the Almanian Uprising"], "nodes": [{"tag": "h1", "text": "Bombing of Auyemesh"}, {"tag": "p", "text": "The Bombing of Auyemesh occurred in 17 ABY, when the Dark Jedi Kueller had the moon of Auyemesh bombed as a demonstration of his power."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "After Luke Skywalker had traveled to Pydyr, his T-65 X-wing starfighter had exploded and injured him. Kueller used his powers to block the Force repercussions of this, so the Jedi Master's sister, the New Republic Chief of State Leia Organa Solo could only sense that something was wrong, but not know what that something was. Kueller then contacted the New Republic on Coruscant, via a holo-coded interstellar link and demanded to speak to Leia."}, {"tag": "h2", "text": "The bombing"}, {"tag": "p", "text": "Leia answered the call and Kueller claimed that he was behind the earlier destruction that she had felt. As a demonstration that this was caused by him and that he could do it again to any world that he wanted, he had Auyemesh bombed by droids with detonators concealed inside themselves. He did not reveal to Leia where the destruction had occurred or how it had been caused, but she could feel what had happened through a disturbance in the Force that it caused, which combined with a revelation by Kueller of what had happened to her brother, brought her to the brink of despair."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The bombing killed a least one million people and caused a large number of speeder crashes on Auyemesh. These were soon reported to the New Republic, which allowed the identification of Auyemesh as the site of the bombing. Kueller's message was traced to Almania and Leia decided to set out there with a taskforce to stop Kueller."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}