{"url": "Bombing_at_the_Jedi_Temple", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Battles of the Clone Wars", "Category:Battles of the Jedi Temple"], "nodes": [{"tag": "h1", "text": "Bombing at the Jedi Temple"}, {"tag": "p", "text": "A bombing at the Jedi Temple took place a few months prior to the end of the Clone Wars. The bombing was conducted by the Separatist Captain Rackham Sear. However, the Jedi foiled the bombing and Sear perished."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Separatist officers General Grievous, Kleeve, and their top explosives expert, Captain Rackham Sear planned a suicide mission aimed at the Jedi Temple on Coruscant. Sear then paid bounty hunter Cad Bane a hefty sum for Lord Sidious's layouts of the Jedi Temple. Sear planned to bring down the Jedi Temple's towers in order to show that both the Galactic Republic and the Jedi Order were not invincible."}, {"tag": "p", "text": "Sear then went to Coruscant, where he climbed the Temple's wall and entered the vents, where he planted explosives. However, Jedi Council member, Master Depa Billaba and initiate Caleb Dume sensed him as his explosives went off."}, {"tag": "h2", "text": "The Bombing"}, {"tag": "p", "text": "Despite the explosion, Billaba was able to protect Dume from the initial blast. Master Cin Drallig and the Jedi Temple Guards then saved Sammo Quid and the other younglings from Sear's other explosives, while Yoda pushed the rest away from the Temple. After confirming everyone remained safe, fellow council members, Masters Mace Windu and Obi-Wan Kenobi, soon began to investigate the bombing. Billaba and Dume, despite their hesitation, decided to find Sear. Dume figured that Sear was using the air ducts to plant his explosives, resulting in Dume rushing to stop him."}, {"tag": "p", "text": "Dume found and confronted Sear on the roof of the temple. After a brief exchange of words, Dume charged at Sear. However, Sear was able to knock him out with well-placed explosives. Just as he was about to kill Dume, Billaba appeared to stop him. Dume soon deduced that Sear's plan was to blow the temple's central spire. Sear attempted to set his explosives off, but Billaba was able to use the force to prevent the explosion and hurled the explosives far from the Spire."}, {"tag": "p", "text": "Sear then revealed his name to Billaba and Dume and flung his Electro swords at them. However, Billaba and Dume were able to destroy them. Sear then jumped off the Temple's roof and attempted to kill Billaba and Dume with last of his explosives while falling to his death. Billaba saved Dume and they both survived the blast."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Billaba decided to take Dume, despite his young age, as her Padawan. She and Dume were soon found by Masters Windu and Kenobi. Dume's friend believed he would not be safe with Billaba, but Dume accepted the offer of being her apprentice. With Dume at her side, Billaba took command of a large force in the Grand Army of the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}