{"url": "Bombing_of_Coruscant%27s_central_power_distribution_grid/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Coruscant"], "nodes": [{"tag": "h1", "text": "Bombing of Coruscant's central power distribution grid"}, {"tag": "p", "text": "In 21 BBY, the Confederacy of Independent Systems executed a bombing of a crucial Coruscant power generator in an attempt to stop a peace treaty with the Galactic Republic proposed by Confederate Senator Mina Bonteri. The ecumenopolis was infiltrated by demolition droids, which took out several Coruscant power generator engineers and planted themselves on the wall as bombs. The droids then exploded, crippling all electrical sources on Coruscant, which resulted in power outages and fires as well as civilian deaths."}, {"tag": "p", "text": "As a consequence of the attack, the Galactic Senate passed a bill that de-regulated the banking conglomerates, also rejecting the initiative to end hostilities between the two belligerents. The peace attempt was later formally withdrawn by Count Dooku."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 21 BBY, Padmé Amidala, who represented the Chommell sector in the Galactic Senate, visited Confederate Senator Mina Bonteri on Raxus, together with Jedi Padawan Ahsoka Tano. Bonteri recommended the start of peace negotiations in the Confederacy's legislative body. The Separatist Parliament approved this initiative."}, {"tag": "p", "text": "After Padmé returned and announced the same proposal in the Galactic Senate, Count Dooku became alarmed, and tasked General Grievous with disturbing the process."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Demolition droids were sent to execute the operation. These machines were capable of transforming into sweeper/maintenance units to infiltrate a location or combat units armed with two blaster cannons to secure a demolition points. Two such droids could connect into a bomb which exploded after a given time."}, {"tag": "p", "text": "The units, camouflaged as Coruscant Sanitation Department sweeper droids, exited a Taylander shuttle on Coruscant and proceeded towards their target: the power generator situated 5,000 levels below the ecumenopolis' surface. While en route, they encountered CC-1010 and two other members of the Coruscant Guard, who were checking the identification of a group of Coruscant power generator engineers. The droids displayed their holographic permission, which stated that their task was \"generator maintenance\". The clones allowed them through, with CC-1010 even showing them the correct way, which allowed Grievous' machines to travel to their target."}, {"tag": "p", "text": "Meanwhile, Padmé Amidala and Ahsoka Tano visited Supreme Chancellor Palpatine in his office, attempting to persuade him to accept the Confederacy's peace offer so that no more orders for clones would have to be paid. The Chancellor, however, replied that their past efforts at ending the conflict had been fruitless, as the Separatists rejected their previous proposals, but agreed to put the vote to the floor after Padmé told him that this particular suggestion originated from her old mentor, Mina Bonteri."}, {"tag": "p", "text": "As the dialogue proceeded, the demolition droids reached the generator's vicinity. After one of the engineers standing near the entrance of the control room questioned the need for their presence, the droids transformed into combat mode and began to slaughter the personnel in and around the area without loss, connecting into bombs as soon as they secured the room."}, {"tag": "p", "text": "As the Separatist machines killed the engineers operating the generator, Senators Padmé Amidala and Bail Organa were addressing the Galactic Senate, stating that there was no need for deregulating the banks or ordering further clones due to the start of the negotiations. Onaconda Farr proposed a vote on the matter, which Vice Chair Mas Amedda accepted (with the subject being \"lifting regulations on the Banking Clan\"), and the Senators were allowed to enter their vote."}, {"tag": "p", "text": "Only seconds later, the process was interrupted by the blackout caused by the explosion of the demolition droids, which destroyed the generator. Large areas of Galactic City turned dark in moments, and fires broke out in the vicinity of the Senate Building. The Senate's red emergency lighting turned on, and Orn Free Taa, Senator of Ryloth shouted that they were under attack. Soon, Senator Gume Saam announced that the attack had been confirmed as a Separatist one, and Halle Burtoni, Senator of Kamino proposed to vote on the bill to deregulate the banks. Padmé attempted to stop the process, but to no avail, as more and more Senators began to support Burtoni's proposal. Supreme Chancellor Palpatine approved the suggestion, thus ending the debate over the subject."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The regulations on the InterGalactic Banking Clan were lifted in order to finance more troops. Padmé Amidala's desperate resistance to this act turned the general mood against her."}, {"tag": "p", "text": "Furthermore, Count Dooku contacted the Galactic Senate, stating that Mina Bonteri had been killed in a recent Republic attack—in fact, she had been murdered by Dooku's agents— and officially withdrew the Confederate Senate's peace proposal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}