{"url": "Bombing_of_Gus_Talon", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Corellian sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Bombing of Gus Talon"}, {"tag": "p", "text": "The Galactic Empire conducted a bombing of the Corellian moon Gus Talon early during the Galactic Civil War in retaliation against a local Rebel Alliance cell. The mechanic Rallo secretly ran the cell from his workshop in a small settlement on Gus Talon along with his daughter, Mala Tinero. When an Imperial occupation force led by one Captain Turrant discovered the cell's existence two years before the Battle of Yavin and tried to shut it down, Rallo and his men fought back, killing five stormtroopers in a shootout inside the workshop."}, {"tag": "p", "text": "The Empire responded by unleashing fourteen TIE bombers upon the small settlement in a devastating bombardment that killed many Gus Talon citizens, including Rallo and his daughter. Stormtroopers entered the destroyed settlement afterward and took away most of the survivors aboard prison ships. Tinero's boyfriend, Wedge Antilles, who had resisted joining the Rebellion up to that point, had by a stroke of luck been away from Gus Talon during the incident or would have been a casualty himself, but his grief over losing Tinero finally motivated him to join the fight against the Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 2 BBY, the first year of the Galactic Civil War, the Galactic Empire established a provisional military occupation of Gus Talon, a moon of the planet Corellia in the Core Worlds. The occupation force included a stormtrooper detachment assigned to a small but bustling settlement with a majority-Human, mixed-species population that also comprised Selonians and Drall. Responsibility for overseeing the detachment fell to Captain Turrant, a harsh, middle-aged officer who developed a tense acquaintance with local resident Rallo, a mechanic who lived and worked on Gus Talon with his daughter, Mala Tinero."}, {"tag": "p", "text": "Rallo secretly ran a local cell of the Rebel Alliance out of his workshop in the Gus Talon settlement, ostensibly employing several other individuals, including Tinero. The girl tried to get her boyfriend, Wedge Antilles, also of Gus Talon, to join the Rebellion as well, but the young man could not be convinced. Meanwhile, intelligence of the Rebel cell's existence soon came to Turrant's attention. During a chance run-in with Rallo and Antilles on the settlement's streets, Turrant took the opportunity to insinuate his suspicions of the mechanic's involvement with the Rebel cell, but Rallo calmly maintained his innocence."}, {"tag": "h2", "text": "The bombing"}, {"tag": "p", "text": "Shortly after their encounter on the streets, Turrant and a group of five stormtroopers confronted Rallo and his men at the mechanic's workshop, interrupting their labor in the middle of the day. Turrant announced that he had come to seize the workshop and everything inside it in the name of the Empire, and that Rallo and all of his employees, including his daughter, were under arrest for their involvement with the Rebel Alliance."}, {"tag": "p", "text": "When Turrant suggested that he would send Tinero to be incarcerated off-world, away from her father's protection, Rallo immediately opened fire on the stormtroopers with a blaster pistol. A lightfight erupted inside the workshop between Turrant's troops and the members of Rallo's Rebel cell, who instantly produced blasters of their own and proceeded to kill all five stormtroopers—a heroic stand against an oppressive occupying force, it was said. However, Turrant himself escaped the battle and quickly called for reinforcements via comlink."}, {"tag": "p", "text": "The Empire struck back by sending in fourteen TIE/sa bombers on an attack run, which razed the Gus Talon settlement, leaving it in crumbling ruins. Rallo and his daughter were among the many citizens of Gus Talon killed in the senseless bombardment."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the bombing, stormtroopers entered the destroyed Gus Talon settlement and carried away most of the survivors on prison ships, although no one who remained knew where they had been taken. The Empire placed Gus Talon under official Imperial rule, declared all of its citizens to be Imperial prisoners, and stationed an Imperial-class Star Destroyer in orbital blockade of the moon to lock down the system."}, {"tag": "p", "text": "Wedge Antilles had been away from Gus Talon during the Imperial bombing of the settlement, having taken a brief job transporting machine parts off-system, but he would have taken part in the battle between Rallo's men and Turrant's stormtroopers had he been there. When he returned to Gus Talon aboard his small freighter, he encountered the Imperial blockade above the moon, which forcibly rebuffed his request to land. Antilles protested that he lived on Gus Talon, which only prompted two TIE/LN starfighters to engage his ship. Outraged at the sudden loss of Tinero, Antilles shot down one of the two TIE fighters, but he was forced to flee the system when the Star Destroyer sent more TIEs after him."}, {"tag": "p", "text": "With little left on Gus Talon worth guarding, the Imperial forces pulled out eight days after Antilles' initial attempt to land on the moon. He was finally able to get back into his home on the ninth day, when he saw for himself the devastation that the Imperial bombardment had wrought on the settlement. None of the survivors could tell him what had happened to Tinero, and he realized that he would have been killed or imprisoned too had he been there. Grieving deeply over losing Tinero, Antilles joined the Rebel Alliance soon after and would go on to become its greatest starfighter ace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The bombing of Gus Talon was featured in the comic story \"Lucky,\" which was included in issue 23 of the Star Wars Tales comic series. \"Lucky\" was written by Rob Williams and illustrated by Michel Lacombe, while Star Wars Tales 23 was published by Dark Horse Comics on May 11, 2005. The bombing serves as the tragic inspiration for Wedge Antilles joining the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}