{"url": "Bombing_of_Telos_IV", "categories": ["Category:Legends articles", "Category:Battles of the Jedi Civil War", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Bombing of Telos IV"}, {"tag": "p", "text": "The Bombing of Telos IV was one of the first battles of the Jedi Civil War. Meant by Darth Revan to be conquered, the civilian target was attacked without warning or provocation by former Republic Admiral Saul Karath under Malak's direct order, marking the beginning of the conflict."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "To prove his loyalty to the Sith, Republic defector Saul Karath, captain of the Leviathan, ex-hero of the Mandalorian Wars, and later commander of the entire Sith fleet, bombed Telos IV using his codes to bypass their scanners. Eluding Republic defense systems, Sith bombers were able to infiltrate into the Republic docks before any warning could be raised. In moments, half the Republic fleet docked at Telos was destroyed. This was only the vanguard of Karath's attack, and he soon arrived with the bulk of his fleet, the Leviathan at its head."}, {"tag": "p", "text": "The resulting attack was devastating. While some were able to escape on in-system shuttles, millions were killed, and more died soon after due to medical supply shortages. A nearby Republic task force in which Carth Onasi was stationed arrived in the system shortly after, but by then it was too late. They were left to pick up the witnesses aboard the drifting vessels Karath and Malak let survive so that their testimony would intimidate those who would stand against the Sith Empire."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The attack left Telos's environment devastated. The atmosphere degraded into acidic vapor and all plant and animal life on the surface was obliterated. After the end of the Jedi Civil War, the Republic decided to use Telos for a test to see if a restoration effort could be mounted on the Outer Rim to reclaim the other war-torn planets, and financed the Telosian Restoration Project and construction of Citadel Station to purify the atmosphere and rebuild the ecosystem."}, {"tag": "p", "text": "Republic soldier Carth Onasi was one of many left emotionally scarred by the attack. His wife dead and son missing, Carth swore revenge on Karath, who had been not only a hero to him, but his personal mentor. He came to fulfill this vow three years later on the bridge of the Leviathan."}, {"tag": "p", "text": "In 3951 BBY, Kreia predicted of Telos that \"complacent and peaceful, it would forget the time that Saul Karath orbited it and brought fire to its skies\"."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic II: The Sith Lords, a conversation between Jedi Masters Atris and Kreia marks Revan instead of Malak as the one who gave the order to destroy Telos."}, {"tag": "p", "text": "This content may have been cut to avoid confusion. Regardless of whether Kreia was guessing as to whether the order came from Revan himself or not, it somewhat concerns Revan's romance with Carth for the non-canon female gender option, as it would make her responsible for the destruction of his homeworld and all that came of it."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "The battle has been inconsistently dated in various sources. Carth's dialogue from Knights of the Old Republic places the battle at 3960 BBY—before the beginning of the Jedi Civil War and the defection of Saul Karath. The timeline within the Knights of the Old Republic Campaign Guide later retconned that dating by placing the battle at 3958 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}