{"url": "Bomu_Clan", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Bomu Clan", "Category:Rodian clans"], "nodes": [{"tag": "h1", "text": "Bomu Clan"}, {"tag": "p", "text": "The Bomu Clan was a large Rodian clan on the planet Rodia. With a large population and an endless supply of warriors, that \"there will always be more Bomu\" became a blessing and curse to many in the criminal fringe. Crossing their clan was often a fatal move, with clan members gaining a reputation for their willingness to hunt anything—or any being—that crossed them. The Bomus showed a clan tattoo over their left eye, and they preferred ambushing over direct confrontations. They were not widely considered a threat, unless they had an intelligent employer."}, {"tag": "h3", "text": "Employment"}, {"tag": "p", "text": "The Bomu Clan frequently worked for Popara the Hutt and the Anjiliac kajidic, performing dirty work for Popara and his offspring Zonnos and Mika. When Mika disappeared and Popara hired an independent team to rescue him, Zonnos hired at least two Bomu pilots to ambush the rescuers and avoid the return of Mika. The Bomus were killed in action, but at least Zonnos' implication could not be tracked because he had used middlemen. After that, the Bomus held a personal hate to the rescuers and harassed them, sending more and more heavily-armed Rodian soldiers after them."}, {"tag": "p", "text": "After Popara's death, Zonnos became the new head of the kajidic and continued hiring Bomus. Four Bomu soldiers were found on docking bay Q2214 GRB, alongside Wookiees and Niktos, to ambush the people Zonnos thought had killed his father. However, these Bomus were also killed by the fugitives—who were coincidentally Mika's rescuers. Finally, Zonnos' death left Mika as the head of the clan. Mika tried his best to stop the Bomus from harassing his \"friends\". He also sent Bomu soldiers to Varl to protect Mika's assets there. This work was so boring that the Bomus began to search for Hutt relics and complaining about not being paid enough instead of patrolling - which led to an eventual invasion that killed some of the Bomus there."}, {"tag": "p", "text": "The Bomus were still active after the end of the Tempest Feud crisis. One of their major rivals was the Kenu Clan, who dismissed them as rank amateurs."}, {"tag": "h2", "text": "Known members"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}