{"url": "Bongo_Marauder", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Aquatic vehicles"], "nodes": [{"tag": "h1", "text": "Bongo Marauder"}, {"tag": "p", "text": "The Bongo Marauder was a fast manned aquatic craft equipped with a powerful laser cannon capable of detroying enemies in the air and on the ground. It had a personal energy shield and a narrow, white hull with a thin railing installed along the bow. The boat was driven by a lone Human helmsman who steered the boat from a lowered seat at the stern. The Bongo Marauder's helmsman had light skin and wore a white captain's hat, a long-sleeved shirt, and an orange lifejacket."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Bongo Marauder appeared in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds, accessible by entering the cheat code \"scaryneighbor\" into the game's chat box. In an online chat session held on June 28, 2001, prior to the game's release, a user named \"Jedi_Bib\" asked Galactic Battlegrounds director Garry M. Gaber if any Jedi specific units were going to be included, such as a \"Force Boat.\" Gaber replied with a smiley face emoticon that there was no Force Boat. However, in another chat session on October 9, user \"OnlyOneCanoli\" further inquired about the Force Boat, and Gaber stated that players could enter the code \"Forceboat\" over water and discover what happens."}, {"tag": "p", "text": "However, entering \"Forceboat\" does not correspond to any cheat codes in the finished game. The Bongo Marauder only spawns if the player types the code while overlooking a body of water, and multiple Bongo Marauders can be generated at one time. The color of the helmsman's shirt changes depending on the player's team color; it can be blue, red, green, yellow, gray, purple, cyan, or orange. Clicking on the Bongo Marauder while controlling it shows a profile image of a Human male against a red background. Unlike most of the cheat codes available in the game, \"scaryneighbor\" was not revealed in the game's strategy guide, but on the LucasArts website instead. The website did not refer to the Bongo Marauder by name, instead calling it a \"Super-killer boat unit.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}