{"url": "Boomer_(astromech_droid)", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Astromech droids", "Category:R5-series astromech droids"], "nodes": [{"tag": "h1", "text": "Boomer  (astromech droid)"}, {"tag": "p", "text": "Boomer was an R5 astromech droid belonging to Sevox, a human on the planet Andelm IV. During a mission underwent by the human girl Zarro and the Wookiee Chewbacca, the two placed a thermal detonator inside the droid and named it \"Boomer,\" intending to detonate it aboard a Lambda-class shuttle. The duo succeeded in their plan, and Boomer was destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Boomer was a derelict R5 astromech droid who ended up in the tinkerer Sevox's bunker on the planet Andelm IV shortly after the Battle of Yavin. While on a mission to stop the local gangster Jaum from exporting dedlanite to the Galactic Empire, Zarro and her Wookiee friend Chewbacca visited Sevox's bunker. While exploring Sevox's storeroom, Chewie found a derelict R5 droid. Chewbacca managed to rebuild the droid and fitted it with several thermal detonators before slotting its head back on."}, {"tag": "p", "text": "Boomer traveled with Zarro and Chewie on Jaum's landspeeder to the Andelm IV spaceport. After Jaum and his droid I-7 had left, the droid and its \"masters\" infiltrated the spaceport. Zarro was able to get through the scout troopers outside by posing as one of Jaum's henchmen delivering Chewie, who was disguised as Jaum's new war droid. Once inside, Zarro planned to load Boomer onto a Sentinel-class landing craft containing Jaum's dedlanite shipment."}, {"tag": "p", "text": "However, they were stopped by Jaum who demanded that Zarro remove her helmet. A gun battle quickly ensued between Chewie and the stormtroopers assisting Jaum. Using a remote control, Zarro sent Boomer up the landing craft's gangplank. On the way, the droid was hit by laser fire and disabled. While Chewie flight with Jaum's enforcer Tyvak and an All Terrain Scout Transport, Zarro managed to push Boomer onto the craft. With the droid's remote fried, she activated a timer and fled the ship. Believing he had beaten Zarro and Chewie, Jaum escaped on the landing craft; unaware that the bomb-laden Boomer was aboard."}, {"tag": "p", "text": "Before Zarro and Chewie could leave the spaceport, they were apprehended by scout troopers and brought aboard Commander Kai's Imperial-class Star Destroyer. After overpowering their stormtrooper captors, they managed to make their way to the Star Destroyer's hangar and gain an audience with Commander Kai. Zarro managed to convince Kai that Jaum was a fraudster and rebel spy. She also claimed that Jaum had crammed Boomer with explosives and planted it on the landing craft docking in the Star Destroyer's hangar. Shortly later, the droid exploded, destroying the landing craft and damaging the Star Destroyer's hangar bay."}, {"tag": "p", "text": "Following Boomer's destruction, Zarro and Chewie fled back to Andelm IV on a TIE/sa bomber. Meanwhile, Kai arrested Jaum and had him tortured as retribution for the \"scam\" and damaging his Star Destroyer. Thus, Boomer helped foil Jaum's plot to establish a business exporting dedlanite to the Empire and ended Jaum's crime syndicate."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Boomer was a broken-down R5 repair droid who was rebuilt by Chewbacca and Zarro for the sole purpose of stopping the gangster Jaum's plot to export dedlanite to the Galactic Empire. He had no personality and was controlled remotely by Zarro. As an astromech droid, he had a rotating head built over a rounded chassis. He also had two wheeled legs. Chewbacca managed to cobble enough spareparts from Sevox's storeroom to restore the droid to some operation capacity. However, Boomer lacked any autonomy and was effectively used as a weapon by his new \"owners.\" In its last operation days, Zarro nicknamed the droid Boomer and fitted him with several explosives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boomer first appeared in Chewbacca 4 and was featured on its cover."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}