{"url": "Bora", "categories": ["Category:Legends articles", "Category:Plants of Zonama Sekot", "Category:Trees"], "nodes": [{"tag": "h1", "text": "Bora"}, {"tag": "p", "text": "Boras were large plant-domes on Zonama Sekot, resembling trees, growing to be hundreds of meters across."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Boras were large plants that grew up to the size of six hundred meters tall with a diameter of well over 10 meters at their base. The foliage that they formed was large enough to form an immense canopy over the planet that was colored green with dots of gold, blue, purple and red. Xenobotanists did not classify the boras as trees, though the native Ferroan's named them boras, which was their language's word for tree. These massive tree-like organisms grew at a highly accelerated rate when compared to trees from other worlds. Their enormous trunks spread wide through the environment and also possessed large sinuous tentacles capable of attacking harmful threats to the creature. They were also capable of channeling lightning which was used to fuel complex organic processes deep within their trunks. In fact, the tips of the branches consisted of iron which served as lightning forks capable of directing lightning. Their minds were not located in the higher up regions of the massive organism but rather in a more central position where a small mind directed the immense creature, capable of only simple thoughts such as protect or attack, which meant that the creatures could not be entirely reasoned with."}, {"tag": "p", "text": "The boras were notable for possessing a complex life cycle that caused some to consider them a magnificent species in all respects (Zonama Sekotan ships mimicked this same life cycle). Ancient boras dropped seeds onto the ground which moved about to feed on the dead limbs the boras tree dropped onto the tampasi floor. These bora seeds were noted for being more animal than plant and were mobile. This allowed them to commence the next stage of their existence by migrating to a nursery every summer (some would evolve to become seed-partners, the basis for the creation of Sekotan starships). During periods of thunderstorms, the boras channeled raw lightning through their branches onto the seeds in the ground which filled them with energy as well as cracked them open as part of a process known as forging. Once the seeds were opened, the special leaves of the boras trees shaped the seeds into the future boras, a process known as annealing. This meant that no two boras were alike and that there were many types of boras. It was not a flawless system, however, and there were known to be mutations amongst the boras. These roguish organisms were very dangerous and territorial if allowed to grow wild, which is why they were strictly contained. The mutant boras' aggression meant that they did not allow any inbound flying craft to approach them, preventing any form of landing."}, {"tag": "p", "text": "Different types of boras included the Annealers which possessed long spade-like shaping arms that were used in sculpting exploding seeds in a complicated process. However, once it was complete, the seeds turned into different kinds of boras that were moved out of the nursery to take their place within the tampasi. The wild boras were known as Rogues by the natives and also as Lost Ones; these were seeds that did not possess any nursery affiliations and scavenged off the communal fields with their fate being never to rejoin the commune. The origins of these boras were not known, with some believing that they escaped from burning nurseries to be shaped elsewhere, possibly by other rogues. They were notable for having their uses as they kept the communes on their toes, as it was known that sometimes they flew in to snatch seeds: either to eat or raise as their own. On some occasions, clouds of smaller wild-types came during the forging process, before the lightning was drawn down, and snatched at the pellets intended for the seeds. In general, there were not many rogues but some valleys were thick with them."}, {"tag": "p", "text": "The great trunks of each of the boras served as a miniature ecosystem, as they supported dozens of species of both animals and plants. The plants and fungi lived in such locations where they became prey to brightly colored insects who, in turn, were eaten by lizards and arachnids who were prey to larger predators such as birds. Beyond this, the boras also produced food and fruits that were located higher up their great expanse. In the nighttime, the lower branches of the boras served as resting places for bio-luminescent insects that brightened up the darkness for others inhabitants."}, {"tag": "p", "text": "Throughout the surface of Zonama Sekot was a vast root system created by the boras which linked the different organisms together (linking the tampasi therefore to one another as well). This led to the creation of a vast organic network known as the Boras Network which allowed communication to travel throughout the root system to far flung sections of the sentient planetoid. All of which allowed the inhabitants of the planet to communicate with one another and keep apprised of recent developments. The native Ferroans were capable of tapping into the network, which allowed them to receive information around the planet at almost anytime."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The boras were native life on the living planet of Zonama Sekot and existed long before the world gained self awareness. They were first harnessed as a living factory and used to control the art of shaping seeds during the initial colonization of the planet by Ferroans and Langhesi. In fact, it was the first Magister who had studied the boras and made friends with them. After this friendship was forged, the boras invited the colonists to observe the boras' nurseries in the tampasi, after which they were accepted as shapers. However, teaching the craft took twenty years for the first Magister to learn and he later trained the boras to move their dense canopies in order to serve as organic factories for the Jentari. This act which was made by Magister Leor Hal also had the added advantage of blocking the creation process of Sekotan ships from prying eyes."}, {"tag": "p", "text": "The natives of Zonama Sekot made use of Kybo airships to collect produce from the boras' higher elevations. At some point, the living intelligence of Sekot allowed a stand of rogue boras to sprout. These were kept in a region in the northeast and were permitted in order to encourage genetic diversity. These malignant boras were long allowed to flourish, as no one disturbed their seeding grounds whence they were known to attack intruders. Members of the Jedi Order first became aware of the boras before the outbreak of the Clone Wars when Obi-Wan Kenobi and a young Anakin Skywalker traveled to Zonama Sekot to learn the fate of missing Jedi Vergere. In their time on the living world, the Jedi duo learned of the nature of the boras from the Magister's daughter, Jabitha."}, {"tag": "p", "text": "During the turbulent times of the Crossings, the devastation caused to the surface of Zonama Sekot led to terrifying hurricanes that ripped entire boras from their roots. In the closing stages of the Yuuzhan Vong War, Luke Skywalker traveled to Zonama Sekot in order to enlist the planet's aid. Once there, he along with his wife Mara Jade Skywalker, nephew Jacen Solo, Saba Sebatyne, Danni Quee and Soron Hegerty learned of the boras. However, the living intelligence of Sekot sought to secretly test Jacen Solo by orchestrating a kidnapping of Danni Quee and Jabitha by Senshi who took them to a grove of malignant boras where their lives were threatened by the wild creatures. It was during this time that Sekot determined their actions of fight or flight and ultimately decided to aid them in fighting the Yuuzhan Vong."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}