{"url": "Bordok/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Creature stubs", "Category:Bordoks", "Category:Creatures of Endor", "Category:Creatures of unspecified biology", "Category:Domesticated creatures", "Category:Herbivorous creatures", "Category:Herd and pack creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Bordok"}, {"tag": "p", "text": "The bordoks were a vaguely equine herbivore native to the forest moon of Endor. They were used by Ewoks as pack animals and mounts when tamed. Bordoks were very sure-footed and, in spite of their size, capable of carrying very large loads."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Although somewhat similar in appearance to horses, bordoks were not true equines. They had upward-curving horns that were short on young females but could grow larger on an adult male. Bordoks also had split hooves that helped them climb through the trees of their arboreal home."}, {"tag": "p", "text": "There were two species of bordoks: The lesser bordok grew to no more than 1.5 meters tall at the shoulder. The rarer greater bordok could reach twice this size. Both species were fairly intelligent, and were not startled easily. However, they did instinctively become more skittish at night due to the various nocturnal predators that stalked the moon's surface."}, {"tag": "h2", "text": "Domestication"}, {"tag": "p", "text": "Adult bordoks were extremely protective of their young and, when domesticated, over their master as well. Herding instinct was so strong that adult males sometimes sacrificed themselves for the good of the herd, fighting predators while the others escaped. Young bordoks were commonly taken as pets and often developed lifelong bonds with their owners. Princess Kneesaa a Jari Kintaka had a pet baby lesser bordok named Baga."}, {"tag": "p", "text": "Toy bordoks were available in the galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}