{"url": "Borjak", "categories": ["Category:Legends articles", "Category:Feeorin", "Category:Males"], "nodes": [{"tag": "h1", "text": "Borjak"}, {"tag": "p", "text": "Borjak was a Feeorin warrior from the planet Odryn who in 3963 BBY ascended to the revered position of Exalted among his people. Over three centuries old by the time of the Mandalorian Wars, Borjak was a close comrade and lieutenant to the famed Feeorin warrior Feln, who became a Jedi Master and the Feeorin's Exalted, a title belonging to the oldest and therefore strongest of the species. Although Borjak came to resent the Exalted's disdain for the Feeorin's ancient traditions after Feln joined the Jedi Order, Borjak faithfully did his duty protecting Odryn's sacred Sanctum of the Exalted, which Feln had controversially opened to members of the secretive Jedi cabal known as the Jedi Covenant as a storehouse for Sith artifacts. In 3963 BBY, Borjak captured a pair of wanted Republic fugitives, Zayne Carrick and Marn Hierogryph, trying to sneak out of the Sanctum—Feln had been pursuing the two to cover his involvement in a high-profile massacre of several Jedi students on Taris. Feln arrived and prepared to execute the two captives, but Borjak stepped in and convinced Feln to honor Feeorin tradition and challenge Carrick to hand-to-hand combat. After a wild chase and fight, Feln, believing that Carrick's friends had come to raid the Sanctum, panicked and blew the structure to pieces to prevent knowledge of what was happening there from leaking out. The act was such a transgression that it led Borjak to turn on and kill Feln, taking the mantle of Exalted for himself."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A member of the primitive and traditionalistic Feeorin species, Borjak grew up into the life of a warrior on the isolated Feeorin colony world of Odryn. Born about three centuries before the Mandalorian Wars, Borjak cut his teeth in the days of intertribal warfare between Feeorin settlements—Borjak's home village carried with it a special significance, as it sat closest to the Sanctum of the Exalted, the holiest site on Odryn, where the spirits of the dead were believed to forge Odryn's seasons. During this time, Borjak became close comrades with another native of his village, Feln, who forged a legend as one of the greatest warriors Odryn ever saw. After years of fighting, Feln managed to conquer and unify all the warring villages of Odryn under his banner, along the way becoming the Feeorin's hallowed Exalted: a title bestowed upon the oldest, and therefore strongest, of the Feeorin. Feln's prowess in battle was such that Borjak and his fellows thought him magic, and not long after, a Jedi scout confirmed their suspicions: Feln was Force-sensitive, and soon left Odryn behind to study with the Jedi Order. When Feln returned, he was a changed Feeorin. Now a Jedi Master and a member of the secretive Jedi cabal known as the Jedi Covenant, Feln flouted the ancient traditions of the Feeorin by opening the Sanctum of the Exalted—traditionally open only to the Exalted—as a storehouse for the Covenant's collection of Sith artifacts, drawing many Covenant agents to Odryn. This new policy was highly unpopular among the xenophobic and isolationist Feeorin, including Borjak, but they were still obliged to follow the Exalted's word."}, {"tag": "p", "text": "By 3963 BBY, Borjak had become a grandfather and a leader in his home village, helping to watch over the Sanctum during Feln's frequent absences. However, this came with difficulties, as the weather around the Sanctum grew wildly unpredictable in the Exalted's absence, and as a result the village had seen much better days. Although Borjak felt a great disdain for Feln's treatment of the Feeorin traditions, he still reluctantly carried out his duties, \"welcoming\" offworlders bound for the Sanctum to Odryn. By this point, Borjak was the second-oldest of the Feeorin and the next in line for the title of Exalted. In 3963 BBY, what appeared to be a routine visit from a Covenant agent went wildly awry, and wound up changing Borjak's life forever. On one rainy evening, a new ship landed on Odryn, offloading a cloaked offworlder and two Ithorians. To that point, the deal the Feeorin had made with the Covenant allowed only one offworlder on Odryn per visit—the presence of the Ithorians was a breach, prompting a furious outburst from Borjak. However, the hooded stranger, going by the name \"Celeste Morne\", swiftly attacked and incapacitated Borjak, afterwards explaining that the two Ithorians were only there to transport an item to the Sanctum and would not enter the structure. Humiliated, Borjak assented and accompanied the group to the holy site, leaving them once they reached their destination. Two days later, Borjak happened upon another pair of offworlders—Republic fugitives Zayne Carrick and Marn Hierogryph—sneaking out of the Sanctum, having been smuggled into the structure by \"Morne.\" Something was clearly afoot, and Borjak and a party of several Feeorin warriors managed to seize the two trespassers and take them to the village's old blockhouse for interrogation."}, {"tag": "p", "text": "Borjak's questioning of the two fugitives was barely underway when they were interrupted by the sudden arrival of Feln, who had his own axe to grind with Carrick. The year before, Feln and four other Jedi Masters massacred their apprentices after misinterpreting a vision, and Carrick, the only one to escape, was publicly blamed for the murders. Carrick thus became a loose end the Covenant had to eliminate, and Feln fully intended to kill Carrick on Odryn. After stringing Carrick and Hierogryph up in their home village, Borjak and Feln returned to the Sanctum, where Borjak kept watch as Feln consulted with his compatriots in the Covenant. There, Borjak was horrified to hear Feln's contact suggest that Feln destroy the Sanctum to keep knowledge of what was going on there from leaking out. Feln protested, and the question was left hanging in the air as the two Feeorin stormed back to the village to take care of Carrick first. Upon their return, Borjak cut the two prisoners down, and Feln prepared to strike Carrick and Hierogryph down with his lightsaber—however, Borjak stepped in, citing the rule in the ancient Rime Feeorin that the fugitives could only be challenged to unarmed combat, as they had been inside the Sanctum. Although Feln was furious at Borjak's insubordination, he reluctantly agreed to follow tradition, only for Carrick to surprise him with a kick to the chest and run away."}, {"tag": "p", "text": "Carrick managed to elude Feln for a while in the subsequent chase through the village, but the Jedi Master eventually caught his prey, only for Borjak to once again step in when Feln was about to execute the fugitive. This time, it was to inform Feln that their radar device had picked up the ship that brought the outsiders at the edge of the system, causing Feln to fear that Carrick's friends had come to raid the Sanctum in force. In response, Feln detonated pre-set charges that completely obliterated the Sanctum, an explosion that in turn reacted with the dangerous artifacts within to create a firestorm that laid waste to the village and the entire surrounding area. With Odryn's holiest site nothing more than a hole in the ground, Borjak made his choice: he grabbed his knife and stabbed Feln in the back. Although Feln protested that he had been inside the Sanctum, Borjak, backed by a number of surviving warriors from the village, responded that as the Sanctum no longer stood, they were changing the rules. With that, they set upon the Exalted and ripped him to pieces, making Borjak the new Exalted. Borjak then quickly had to begin the recovery process, and a timely rainstorm helped put out the fires and allowed him and the other warriors to find many other survivors in the rubble of their village. During the excavation, Borjak found Carrick's lightsaber, which he returned to the former Padawan—Carrick tried to give him Feln's blade as a gift, but the new Exalted wanted nothing more to do with Jedi things and had his granddaughter chuck the weapon into the pit with the rest of the debris. Borjak and Carrick parted company shortly afterward, as the fugitive Padawan returned to Coruscant to attempt to clear his name."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Characteristic of his species, the gruff and rough Feeorin warrior Borjak was distrustful of outsiders, with his disdain for offworlders only overridden by his respect for the word of the Exalted. Although Feln was a long-time comrade of his and he was bound to follow his kinsman's bidding, Borjak still bemoaned what had become of Odryn since Feln's departure for the Jedi Order, and vocally criticized Feln to friends and offworlders alike. Over three hundred years old by the time of the Mandalorian Wars, Borjak paid great heed to the ancient Feeorin traditions and was taken aback when Feln broke the Rime Feeorin, seeing it as the reason why the skies over Odryn had become so furious in recent years. Despite his opposition toward Feln's actions and attitude, Borjak still faithfully did his duty, although he did not fear standing up to the Exalted to make sure tradition was being followed. Eventually his respect for Feeorin tradition proved more important to him than Feln's standing—once the Sanctum was destroyed, Borjak decided that it was his turn to change the rules, and he showed no hesitation in striking Feln down. Along the way, Borjak developed a grudging respect for Zayne Carrick despite his chilliness towards offworlders, although Borjak still actively tried to shun all connection to the Jedi after Feln's death. Borjak's muscular blue-skinned frame was covered in scars earned in a long life as a warrior, and the Feeorin also had yellow eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Borjak made his two appearances in the Star Wars Legends canon in Star Wars: Knights of the Old Republic: Exalted, a story arc of the Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2008. In his appearances, Borjak was illustrated by Bong Dazo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}