{"url": "Borna", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Alliance to Restore the Republic members", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Musicians"], "nodes": [{"tag": "h1", "text": "Borna"}, {"tag": "p", "text": "Borna was a composer who lived during the Imperial Period, a time when the Galactic Empire ruled the galaxy. Described as immortal, the composer's music furthered understanding between different species and cultures. A member of the Alliance to Restore the Republic, the composer's second symphony was a protest directed against the Empire's administration. The Empire did not take kindly to this, and Borna died sometime between 2 BBY and 5 ABY. In 5 ABY, whilst reflecting aboard his flagship, Imperial Inquisitor Jerec listened to the second symphony, enjoying it despite the piece's anti-Imperial connections."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Borna was an early classical composer who lived during the Imperial Period, a time when the Galactic Empire rose to power and ruled the galaxy. A member of the Rebel Alliance, Borna's second symphony was composed as a protest against the administration of the empire."}, {"tag": "p", "text": "Unfortunately for Borna, the Empire did not appreciate his activism, and Borna died between 2 BBY and 5 ABY."}, {"tag": "p", "text": "Borna's music furthered understanding between different species and cultures, and the composer was described as immortal. Despite the anti-imperial themes in the music, Imperial Inquisitor Jerec enjoyed Borna's work, listening to the second symphony whilst reflecting aboard his flagship Vengeance in 5 ABY, feeling the piece was dark and moody. Jerec expressed remorse that Borna died prematurely, but mused that art and politics did not mix well."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Borna was not a fan of the Empire, joining the Rebels and composed an anti-imperial piece with his second symphony. Borna's music helped further understanding between different cultures and species, as such the composer was not speciesist."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Borna was mentioned in a throwaway line in William C. Dietz's Dark Forces: Jedi Knight novella, published in 1998. In 2014, the composer received another brief mention in the first installment of Slugthrowers: An Overview of Popular Music and Musicians in a Galaxy Far, Far Away, an article written by Edward M. Erdelac and published on the StarWars.com Blog. The character's gender and species were not established in either source. Due to the date of his death, Borna lived during the Rise of the Empire era and possibly the Rebellion era, which started in 0 BBY, within the time Borna died."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}