{"url": "Borokii_camp", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Ansion locations"], "nodes": [{"tag": "h1", "text": "Borokii camp"}, {"tag": "p", "text": "The Borokii camp was a native tribal camp, extensive and mobile, pitched by the Borokii, the ruling Alwari overclan of the planet Ansion. Like many other Alwari clans, the Borokii nomads could efficiently disassemble their camp, as needed, and move around Ansion."}, {"tag": "p", "text": "Though entirely mobile, the camp was laid out like a permanent town, with temporary streets and designated areas for residential, commercial, and manufacturing activities, a great deal of which centered on the processing of large numbers of surepp carcasses for export—the means by which the many imported structures and high technology on prominent display was paid for."}, {"tag": "p", "text": "In 22 BBY, a Jedi diplomatic team seeking to achieve an accord between the Borokii Council of Elders and Ansion's urbanite government, the Unity of Community, was welcomed into the camp by a sentry patrol led by Bayaar. Achieving the accord was critical if the Galactic Senate hoped to retain within the Republic not only the Ansion system, but also, because of the extensive interplanetary treaties that existed with this seemingly insignificant world, more than forty other star systems as well: they would all secede if Ansion did."}, {"tag": "p", "text": "The Borokii camp-denizens, secure in their exalted position of overclan and with a reputation of courtesy to uphold, did not fear the challenge of outsiders and, unlike the lesser clans of the mistrusting Yiwa or the double-dealing Qulun, were secure enough to welcome foreign visitors."}, {"tag": "p", "text": "In the camp's \"visitor's house\" the Jedi were given comfortable accommodations, excellent food and drink, availing themselves of the abode's lavish trimmings and trappings, gratified to be able, after so long a journey, to relax in such pleasant surroundings—in which they all, with the possible exception of the ever-wary Tooqui, felt safe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}