{"url": "Boroklif", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Captains", "Category:Confederacy of Independent Systems individuals", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Boroklif"}, {"tag": "p", "text": "Boroklif was a male captain who worked for the Separatist Alliance in 19 BBY. Serving aboard the freighter Larkrer, Boroklif and his crew shipped supplies to a secret Separatist factory on the planet Mokivj from a transfer point on the Outer Rim world Batuu."}, {"tag": "p", "text": "Traveling to Batuu in search of Senator Padmé Amidala, Jedi Knight Anakin Skywalker defeated Boroklif's comrades with the help of the Chiss Commander Thrawn. The pair then took the Larkrer to the Separatist factory, relying on Boroklif having preset a course to Mokivj in his freighter, and explained to the factory's leader that the captain and his crew had been compromised to avoid any suspicion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Boroklif was a male individual who served as captain of the Separatist freighter Larkrer. In 19 BBY, he and his crew helped ship supplies on the Larkrer from a transfer point at Black Spire Outpost on the Outer Rim planet Batuu to a secret Separatist factory on the planet Mokivj. One day, the Naboo Royal Handmaiden Duja was caught investigating the Separatists that Boroklif worked with and was killed by them shortly thereafter. After Duja's superior, Senator Padmé Amidala of the Galactic Republic, disappeared while searching for her handmaiden, Jedi Knight Anakin Skywalker traveled to Batuu in search of them both."}, {"tag": "p", "text": "Accompanied by the Chiss Commander Thrawn, Skywalker defeated Boroklif and his comrades and took the Larkrer to the Separatist factory on Mokivj. When the freighter reached Mokivj, Boroklif's superior, Duke Solha, asked to speak to the captain. To avoid Solha's suspicion, Skywalker then explained that Boroklif and his men had been compromised. The Jedi and Thrawn further told Solha that Boroklif had preset the course to Mokivj in the Larkrer, explaining how the pair had reached the Separatist factory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boroklif was mentioned in the 2018 novel Thrawn: Alliances, the second installment of the Star Wars: Thrawn trilogy written by Timothy Zahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}