{"url": "Borsk_Fey%27lya", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Articles with elements from unlicensed sources", "Category:Articles to be expanded", "Category:Alliance High Command personnel", "Category:Alliance to Restore the Republic members", "Category:Bothans", "Category:Males", "Category:New Republic bureaucrats", "Category:New Republic Chiefs of State", "Category:New Republic Senators", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Borsk Fey'lya"}, {"tag": "p", "text": "Borsk Fey'lya was a male Bothan whose career spanned much of the history of the New Republic. A political activist from an early age, Fey'lya's prodigious skill at manipulation and strategy enabled him to emerge as a leading figure in the Alliance to Restore the Republic and retain a base of political power throughout the various crises of the fledgling New Republic. Fey'lya's ultimate ascension to power was secured in 23 ABY, and he led the government as its Chief of State during the Yuuzhan Vong's invasion of the galaxy. In the waning days of the New Republic, as the aliens conquered Coruscant around him, Fey'lya committed suicide in his offices, taking over twenty-five thousand Yuuzhan Vong warriors with him to his death and securing his place in history as a Bothan martyr."}, {"tag": "p", "text": "Throughout his time in the political theatre of the New Republic, Fey'lya won and lost many allies, as was his wont during his constant, ever-ambitious quest for power. His rivalry with the reputable Admiral Ackbar, dislike of the New Jedi Order and anti-Human sentiment led many to possess an unfavorable opinion of the Bothan, though Fey'lya's obsession in his pursuit of power was mirrored in his belief that his actions should enable the best for the most. His fear of the usurpation of his power was reflected in his antagonistic attitude to the armed forces, whom he perceived as a contender to politics, and, having failed to assume control of the New Republic military during the Thrawn campaign, the Bothan would consistently undermine its reputation, most notably during the early days of the Yuuzhan Vong War when it served his interests to refuse to acknowledge the existence of the alien threat."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Borsk Fey'lya grew up on Kothlis, a Bothan colony world, to the Fey'lya branch of Clan Alya. At a young age, he realized he had little aptitude in piloting and athletics, so he turned to politics. Since he was from \"second-rate\" Kothlis instead of the affluent Bothan homeworld of Bothawui, Fey'lya felt he had to push himself harder than others. He was known to have been involved in several business schemes prior to the start of his political career, including shipping, mining and merchandising, though he did not pursue such projects for long before turning to politics. With a few legitimate land deals on Bothawui, a number of Bothans latched onto him, and he found himself with a good deal of political support. Eventually, he was elected Chief Councilor of the Bothan Council. However, Fey'lya feared the anti alien bias of the Empire and joined the Bothan Spynet."}, {"tag": "p", "text": "Rising to a high rank in the Bothan Spynet and becoming a prominent diplomat, Fey'lya accumulated political power while his rivals were thwarted by manufactured scandals and their own lack of charisma. He soon commanded a faction of fellow Bothans who latched on to his success, and at this point, he began to pursue the goal of achieving control over the entire galaxy. Seeing the end of Emperor Palpatine's rule as an inevitability, Fey'lya began making overtures toward the Alliance to Restore the Republic. The Empire took notice of Fey'lya, designating him as a high-value target for observation or arrest as a suspected political advisor to the Rebels."}, {"tag": "p", "text": "Fey'lya felt confident enough to lend the Alliance his full support after the destruction of the Death Star, and shortly after the Battle of Yavin, he led a sizeable group of Bothans–including nearly 65 percent of Clan Alya's members–in fleeing Kothlis and joining the Alliance. The Bothans who followed Fey'lya into the Alliance also included most of Clan Ojia; Torel Fey'jia, an associate of Fey'lya who provided him with information and contacts, stayed behind and served as an inside connection for Fey'lya. Fey'lya's Bothans served primarily in support and reconnaissance, giving the Rebellion an advantage in espionage, but would occasionally see action as the war intensified. Fey'lya himself immediately began to seek power and position upon joining the Alliance and made deals with numerous beings, making it abundantly clear that he expected a high position in the fledgling political system being arranged by Mon Mothma."}, {"tag": "p", "text": "The Bothans' entrance to the Alliance roughly coincided with that of Gial Ackbar and the Mon Calamari–who, unlike the Bothans, possessed a fleet of star cruisers. Mutual enmity arose between Fey'lya and Ackbar, who regarded him as ambitious and self-serving and made no effort to conceal his assessment of the Bothan. Fey'lya, for his part, felt that the contributions of his people and himself were undervalued, while the Mon Calamari had been granted a position of undue importance. Dismissing Fey'lya as an opportunist, Ackbar would pay little attention to him over the next few years. Nevertheless, Fey'lya became one of the most important figures in the Alliance, especially after Garm Bel Iblis left the group."}, {"tag": "p", "text": "Sometime before the Battle of Endor, Borsk Fey'lya was the leader of Deep Ear, a faction of the Bothan Spynet. The group was responsible for procuring the second Death Star's plans aboard the Suprosa but were later captured by Imperial forces on the planet Gellefon. Borsk managed to elude capture and met up with his alliance contact, a Mikoan known to him as Watcher, and informed her of what had happened. The two of them, along with a group of rebels who were sent to help, helped free the members of Deep Ear from Pinnacle Keep and escaped the planet to meet up with Alliance High Command at Keff Base in the Sullust system."}, {"tag": "h3", "text": "With the Bothan Spynet"}, {"tag": "p", "text": "Fey'lya quickly rose through the ranks of the Bothan Spynet. Concurrently with his activities for the Bothans, Fey'lya hoped to achieve recognition for enlisting the support of former Senator and Alliance pariah Garm Bel Iblis, who had left the Alliance to Restore the Republic following a split with Mon Mothma. In 3 ABY, following Bel Iblis' successful destruction of an Imperial Intelligence Ubiqtorate base at Tangrene, Fey'lya entered into a long running, secretive campaign to draw Bel Iblis back into the ranks of the resistance, while continuing to champion his species' support of the Alliance to Restore the Republic. His attempts to secure Bel Iblis' support remained largely unsuccessful, even though he continued to supply the rogue Corellian, and at some point before 9 ABY he mobilized several Bothan vessels to defend the former Senator's interests on New Cov in the Churba sector. And yet, Fey'lya led a delegation to meet with elements of the Alliance Fleet shortly before the Battle of Endor, without having attained Bel Iblis' alliance, although he continued to extend clandestine overtures to the Senator over the years. Operating out of the Tal'cara, Fey'lya was escorted by famed pilots Olin Garn and Ace Azzameen to the MC80 Star Cruiser Liberty, though his shuttle was attacked by mercenaries purportedly hired by the Sullustans. The ever cautious Bothan immediately suspected foul play, although he and his delegation were successfully defended. The attack was in fact a ruse to drive a wedge between the members of the alliance, but the Sullustans were exonerated when the treachery of the mercenaries was uncovered. The Bothan Spynet, along with Fey'lya, went on to lend its full support to the rebel cause, with Borsk personally involved in the appropriation of the Death Star II plans. However, Fey'lya's obsession with the bravery of the Martyrs, the Bothan spies who perished obtaining information on the second Death Star, would still be utilized by him as a political tool long after the defeat of Emperor Palpatine at Endor."}, {"tag": "h3", "text": "Councilor Fey'lya"}, {"tag": "h4", "text": "Rivalry with the military"}, {"tag": "p", "text": "Fey'lya's rise to power might have ended with Ackbar's dismissal of him, but the retrieval of intelligence that revealed the existence and location of the second Death Star by Bothans who belonged to his faction assured his place in history. Fey'lya signed the Declaration of the Alliance of Free Planets and, in the aftermath of the Bakura Incident, attended a briefing given to the Alliance council by the historian Voren Na'al. While Fey'lya believed the Ssi-ruuk were a threat, he disagreed with Na'al over the magnitude of the threat, asserting based on available data that the Ssi-ruuk were likely to remain in their own region of the galaxy. Within four weeks of the release of the Declaration of the Alliance of Free Planets, Fey'lya signed the Declaration of a New Republic; to indicate that he was signing as a representative of Clan Alya, he did not include his personal signet under the clan sigil."}, {"tag": "p", "text": "Fey'lya became a member of the New Republic's Provisional Council, as well as its Inner Council; as such, Bothans looked to him as a source of guidance. As Councilor, Fey'lya proved to be an effective administrator when he abstained from games of political one-upmanship. Nevertheless he sought to debate Ackbar on every decision or proposal the Calamarian brought to the Council, and he did his utmost to pass legislation that benefited the Bothans. Fey'lya continued to administer some of his businesses while serving in the New Republic, but he usually attended to such ventures in his own time, and they rarely reflected on his Council duties. Much to the chagrin of Ackbar–as well as other members of the new government, such as Leia Organa–Fey'lya became one of Mon Mothma's most-trusted advisors."}, {"tag": "p", "text": "Six months after the Battle of Endor, General Airen Cracken of New Republic Intelligence received a report on the status of Imperial military forces from Dirk Harkness, a mercenary who had unexpectedly disappeared after Endor. Councilor Fey'lya expressed skepticism to Cracken regarding the accuracy of the so-called Harkness Report and questioned the motives of its author, who he suspected was providing misinformation and attempting to divert the Republic's energies. Fey'lya was also concerned that Cracken's informant Platt Okeefe could be a security risk due to Okeefe's association with the Black Curs mercenary group. When evidence indicating that Trell'yar–one of the Bothans who had been involved in the discovery of the second Death Star–was an Imperial spy emerged, Councilor Fey'lya stated for the record that he believed the allegations against Trell'yar were false."}, {"tag": "p", "text": "Fey'lya's lack of confidence in the Harkness Report would prove to be justified in at least one respect; while Harkness claimed that Imperial Grand Vizier Sate Pestage had been deposed and forced into exile within six months of the Battle of Endor, in reality Pestage was still in power approximately eleven months after Endor. Around that time, Fey'lya communicated via hologram with Leia Organa, who informed him that Pestage had offered to leave Coruscant undefended in exchange for being granted asylum, along with dominion over twenty-five other worlds. Fey'lya expressed some uncertainty regarding the ethics of the exchange, but promised to relay news of the development to Mothma at the earliest convenience. Approximately one month later, General Cracken informed Fey'lya and the rest of the Provisional Council of reports that Pestage had been deposed and arrested. Fey'lya assumed the deal with Pestage was defunct as a result, and reacted with disbelief when Organa proposed that the Republic should attempt to rescue Pestage."}, {"tag": "p", "text": "Despite Fey'lya's protests, Mothma directed Ackbar and Cracken to devise strategies to retrieve Pestage from Ciutric. After Ackbar and Cracken presented their plan, Fey'lya continued to question the logic of placing New Republic forces at risk for the sake of an Imperial defector, further alleging that efforts to rescue the Human Pestage could be perceived by non-Humans as an act of bias. Fey'lya ultimately agreed with Councilor Kerrithrarr's argument in favor of the plan, and voted to allow the mission to proceed. Cracken later notified Fey'lya and the other Councilors that, while Republic forces consisting of Rogue Squadron and Commando Team One had captured Pestage, they were trapped on Ciutric due to the arrival of Imperial reinforcements. Fey'lya sided with Doman Beruss in opposing Leia Organa's insistence on sending additional troops to Ciutric, agreeing with Beruss that escalating the Republic's investment in the mission would only weaken the Republic."}, {"tag": "p", "text": "Under Mon Mothma, Fey'lya's influence and prestige grew, his natural cunning and ambition marking him out as one of the dominant politicians of the New Republic. In preparation for the drive on Imperial Center, Fey'lya advocated extending negotiations to Warlord Zsinj, subsequently criticizing the pilots of Rogue Squadron for allowing a freighter owned by the despot to escape. Ever quick to undermine and belittle the actions of the New Republic military due to the threat to his species' status as martyrs he felt it posed, Borsk would enter into a long-running feud with Commander Wedge Antilles and his squadron, though his quarrel truly lay with the charismatic Admiral Ackbar. Any action Fey'lya could take to bolster his and the Bothans' own prestige, he would, and this drive would reveal itself in the years to come. The Bothan senator saw his own personal gain as one and the same with both the gain of his people and the gain of the New Republic. Any other member of the Alliance he saw as possessing too much power or influence, such as the Mon Calamari, he would attempt to weaken. Fey'lya took constant steps to chip away at Ackbar's power base, exemplified during the drive on Coruscant, when he organized a Council meeting on the planet of Noquivzor; reminiscent of Bothawui, but extremely uncomfortable for his opponent, the Mon Calamari Admiral."}, {"tag": "h4", "text": "Machinations on Coruscant"}, {"tag": "p", "text": "It was Fey'lya who called for the insertion of criminals from the prison world of Kessel onto Coruscant prior to its conquest, in order to weaken the Imperial grip on the capital, and Fey'lya who urged Ackbar to strike quickly, encouraging the Admiral to carry out his plan to conquer the planet, before inactivity could harm the Bothan's reputation. When Imperial Center fell to the Alliance, Fey'lya retained his position of power and his seat on the Provisional Council. He remained an opponent of Antilles and Rogue Squadron, strongly supporting the trial of war-hero Tycho Celchu which followed the planet's fall. The trial was in Fey'lya's interests; his fear of a Human-dominated New Republic was such that the inquisition into the affairs of a Human officer, and an Alderaanian at that, would weaken the hold of the Humans on the new government. It was therefore only a progression of Fey'lya's logic that the Krytos virus ravaging non-humans on Coruscant was linked to an anti-alien conspiracy."}, {"tag": "p", "text": "Fey'lya attempted to monopolize his power and retain his position by dominating the manner by which the New Republic responded to the virus' threat. His rivalry with colleagues Leia Organa and Ackbar continued to deepen as he felt they opposed his motions and practices, and thus his antagonism toward Rogue Squadron, which he perceived to be linked to Ackbar's power base, grew more outright. He attempted to intervene in the squadron's affairs, approaching Asyr Sei'lar, a Bothan ace in the unit. Fey'lya asked the younger Bothan to draft a report which stated that the destruction of a bacta convoy at the hands of Warlord Zsinj was due to errors made by Humans in the New Republic government, thus fuelling the conspiracy theory he sought to propagate; that alien species were being deliberately denied aid by Humans in the fight against the virus. In return he promised Sei'lar he would ease xenophobia among leading Bothans, and claimed that he was guarding her interests. In Asyr, Borsk saw a great asset. However she would disappoint him on this occasion by failing to carry out her task. Rogue Squadron became the heroes of the Coruscant campaign and the fight against the Krytos virus. Fey'lya's efforts to discredit Antilles' unit were thwarted. To the Bothan's embarrassment, he was powerless to prevent Antilles from leading his squadron against Ysanne Isard on Thyferra. He had intended to leave the former director of Imperial Intelligence to her own devices, as he did not wish the New Republic to be seen to involve itself in the internal affairs of non-member worlds. With Rogue Squadron's resignation en masse from the New Republic and their disregard for his authority, Borsk had earned himself a series of long term enemies in men such as Antilles, Celchu, Gavin Darklighter and Corran Horn."}, {"tag": "p", "text": "At some point during Fey'lya's tenure as Bothan leader, Brandis Turgah—a thief masquerading as a technician in the New Republic fleet—was captured while attempting to steal from a group of Bothans and brought before Fey'lya. Seeing the value in having a thief and informer in the New Republic fleet, Fey'lya released Turgah under the condition that he would regularly report to the Bothans with interesting news and classified data that would otherwise be unavailable to them. When the Bothan delegation subsequently learned of the formation of a task force to pursue Moff Kentor Sarne, Fey'lya arranged for Turgah to join the force."}, {"tag": "h4", "text": "Moving against Ackbar"}, {"tag": "p", "text": "Fey'lya's chance to discredit and remove Ackbar as a rival would come two years later, during the depredations of Grand Admiral Thrawn, the Chiss strategist who emerged from the Unknown Regions to lead the fight against the New Republic. Fey'lya soon suggested that the loss of an Elomin task force was emblematic of Ackbar's lack of ability as Supreme Commander of the military. However, Fey'lya soon made another enemy; he clashed with Han Solo over the incorporation of smugglers into the New Republic and a failed diplomatic mission to Bimmisaari. Many of his actions were carried out to undermine Ackbar, and his position as a member of the Inner Council allowed him to do this all too often. His campaign against the Admiral did not go unnoticed, however. Although much of the military had begun to see Fey'lya as a viable leader, leading politicians such as Leia Organa Solo began to realize that Borsk had his sights set not only on Ackbar's position as Supreme Commander, but also the office of Chief of State itself. Her fears were, a decade and a half later, eventually proven correct. Fey'lya's road to power would be a lengthy one."}, {"tag": "p", "text": "Following the Battle of Sluis Van, Fey'lya's faction accused Ackbar of treason. Money had been planted in the Admiral's accounts, in fact by Thrawn himself in his ploy to destabilize the New Republic government, and Fey'lya used the seeming coincidence to his advantage to finally obtain victory over his opponent as the Mon Calamari war hero was placed under house arrest and scheduled for trial. Fey'lya's actions were only to divide the New Republic; Ackbar still possessed a firm support base in the military which threatened to clash with Fey'lya bloc. For the moment, however, the Bothan's star continued to rise. The Council, at the Bothan's persuasion, allowed him to take over the running of several of Ackbar's internal security duties, though the politician did not push his luck, and remained relatively quiescent, until a hearing on the Battle of Sluis Van where he made his move. Having arranged the hearing through Mon Mothma, Fey'lya led the unofficial questioning of Captain Han Solo, passing up on the opportunity to criticize Solo on his tactics at Sluis Van—which had seen the New Republic vessels crippled by Lando Calrissian and Solo rather than be lost to the Empire—in order to lay the blame on Ackbar for dispatching the ships to the Sluis system in the first place. Fey'lya did not go so far to accuse Ackbar of treason, though he strongly suggested its presence in the Admiral's actions and openly denounced the Mon Calamari as inept. When Solo claimed at the same hearing that the Imperials were being led by a Grand Admiral, Fey'lya rebuffed the claim. However, other than his considerable support among the military, the Bothan's position was becoming increasingly tenuous. The investigation into Ackbar was still not underway, the Admiral retained a loyal support base, and Fey'lya had not presented any sound evidence against his opponent. To add to his humiliation, it was soon verified that the Imperials were being led by Thrawn, a Grand Admiral. To compound this, Delta Source, a mysterious Intelligence leak in the heart of the Imperial Palace, had still not been silenced; the responsibility for doing so was technically Fey'lya's. To correct the weak grounding of his fortunes, Fey'lya renewed his campaign to secure the allegiance of Senator Bel Iblis, hoping that drawing the Corellian back into the fold would garner support. His aide, Tav Breil'lya, was sent to New Cov to discuss the Senator's return. Fey'lya, now faced with the opportunity to amass political support as never before, was committed firmly to his pet project, and Breil'lya was nervous enough to advocate killing Solo and Calrissian when they stumbled upon the operation on New Cov during their investigation of Fey'lya's motives."}, {"tag": "h4", "text": "Fall from grace"}, {"tag": "p", "text": "Solo and Calrissian's return to Coruscant with news that the Katana fleet had been found, along with the information that Thrawn was attempting to attain knowledge of its location and may well have succeeded in doing so, was fiercely disputed by Fey'lya. Once again, he denied the threat, claiming that the existence of the enigmatic fleet was Imperial disinformation. The Bothan politician continued to wait to secure Ackbar's position, though having failed to attain Bel Iblis for the New Republic, he became desperate to secure the legendary fleet himself. Meanwhile, Thrawn had managed to remove the vast majority of the Dreadnaught-class heavy cruisers, and was in the process of manning them with rapidly-bred soldiers, birthed from his Spaarti cloning cylinders on Emperor Palpatine's storehouse world of Wayland. When the Jedi Luke Skywalker and Fey'lya's old opponent Wedge Antilles, along with Rogue Squadron, left Coruscant to scout the Katana fleet, Fey'lya ordered their arrest, under the pretense that they held vital knowledge on the location on the fleet and had to be sequestered. Once Leia Organa Solo had thwarted that objective, Fey'lya amassed much of his military support before grouping them aboard the Nebulon-B Escort Frigate Quenfis. With Organa Solo and Talon Karrde onboard, and he himself in charge of the situation, Fey'lya headed out to the fleet's location in order to rid himself of his troublesome political opponents. There, Fey'lya ordered the Quenfis commanding officer, Captain Virgilio, to arrest Solo and Antilles, along with Rogue Squadron. A heated debate between the two factions arose, during which Antilles threatened refusal of Fey'lya's demands and risked a court martial. The deteriorating situation was interrupted by the arrival of Imperial Captain Brandei's Judicator, one of Thrawn's Imperial I-class Star Destroyers. To Fey'lya's amazement, Antilles defied his direct orders and engaged the Imperial drops ships as they attempted to fight off the New Republic presence."}, {"tag": "p", "text": "Rather than risk his person, or his dedicated body of military support, for the lives of those he had come to arrest, Fey'lya ordered the retreat of the Quenfis. When the Princess Leia Organa Solo pleaded with him to remain and protect her husband, brother and friends, Fey'lya drew a blaster on the pregnant woman so as to silence her protests. Claiming that Organa Solo had to recognize the interests of the New Republic above her own, the Bothan failed to realize that the Force-sensitive had turned on the frigate's internal and external communications. Fey'lya began to find himself antagonized by Karrde, who maneuvered the Bothan into admitting his true feelings and designs not only for Rogue Squadron, Skywalker and the Solos, but also the entire New Republic military. Immediately, the Quenfis X-wings headed to support Antilles, and Captain Virgilio arrived with his men to confine Fey'lya to his quarters. Shocked, the Bothan reluctantly surrendered his blaster and was taken away by the guards. Had Fey'lya remained on the bridge, he would have seen his political fortunes take another turn for the worse; Garm Bel-Iblis arrived to carry the fight against the Imperials, encouraged to re-join the cause not by Fey'lya, but by the earlier visit of Solo and Calrissian. The combined forces of the New Republic and Bel-Iblis' six Dreadnaughts saw off the Judicator, and managed to destroy the second Star Destroyer Thrawn had dispatched, the Peremptory."}, {"tag": "h4", "text": "A slow recuperation"}, {"tag": "p", "text": "Fey'lya returned to Coruscant a much diminished figure. His ploys to take personal credit for the recovery of the Katana fleet, and the re-entry of Senator Bel Iblis into the New Republic, had both failed miserably. He had lost almost the entirety of his power base among non-Bothans, as his open admission of his contempt for the New Republic military's well-being was allowed to circulate. Lastly, he had badly damaged his credibility with Mon Mothma and the rest of the Provisional Council, as the evidence supporting his treason charge against Admiral Ackbar was revealed to be an Imperial fabrication by Zakarisz Ghent, within a few days of the latter's arrival on Coruscant. In keeping with Bothan political tradition, he went into a self-imposed penance, continuing to attend Council meetings but remaining silent and withdrawn. Leia Organa Solo reflected irritably that this sullenness was counterproductive, when they needed every voice of counsel, even Fey'lya's, to help analyze and organize their efforts, as Thrawn launched his final offensive in earnest."}, {"tag": "p", "text": "Fey'lya broke this silence only once, during a Council meeting, to unexpectedly support Organa Solo's suggestion that reinforcements be sent to support the sabotage group, which included Han Solo, Luke Skywalker, Mara Jade, Chewbacca, and Lando Calrissian, sent to destroy Thrawn's cloning facility on Wayland. Fey'lya even went so far as to suggest that the New Republic's planned attack on the Bilbringi Shipyards be postponed in favor of sending those reinforcements. At first he claimed concern for Solo and Skywalker's lives and emphasized the importance of destroying Grand Admiral Thrawn's source of clones. However, his actions at the Katana fleet skirmish - demonstrating both an open disregard for the lives of his political opponents and a feeble grasp of military realities - led virtually everyone present to doubt his motives, and he finally admitted that there were \"things\" in the Emperor's storehouse, besides the cloning cynlinders, that could be used by Thrawn to devastating effect, against the Bothan people and the galaxy. Since he refused to elaborate, his advice was dismissed."}, {"tag": "p", "text": "Fey'lya's fears persisted, however, and he was caught listening in on a conversation between Organa Solo and Talon Karrde by one of Leia's Noghri bodyguards, Mobvekhar. During the ensuing conversation, he absolutely demanded that Mount Tantiss be destroyed, though he still refused to say exactly what he feared was inside. Karrde agreed to go to Wayland, in the process forcing a payment out of Fey'lya for 70,000 credits."}, {"tag": "h3", "text": "Political recovery"}, {"tag": "p", "text": "Fey'lya regained power as the New Republic reorganized in the wake of the resurrected Emperor Palpatine's campaign, and by the time of the Black Fleet Crisis, Fey'lya's political fortunes had risen to a level of influence, resulting in becoming Chair of the Justice Council and a member of the Ruling Council. When Krall Praget submitted a summons of no confidence against Leia, Fey'lya opposed it, feeling that the time was not right. But when Doman Beruss submitted his after Han Solo's capture by the Yevetha, Fey'lya supported the Vote of No Confidence against Leia Organa Solo, and began whipping votes to secure his election as interim Chief. However, Leia declared war on the Yevetha before the vote came about, and the Senate supported her. After the crisis, Fey'lya was dispatched to Galantos, one of the Republic's new member worlds. Fey'lya was never known for his patience and the Fian's attention to detail drove the Bothan to the limits of his sanity."}, {"tag": "p", "text": "Fey'lya's darkest hour was the Caamas Document Crisis. Organa Solo had taken a leave of absence, and Fey'lya was not chosen as her successor. However, Ponc Gavrisom, Organa Solo's interim successor, was a close ally of his, and he served on the New Republic High Council. But the trouble was just beginning. Clan Alya, Fey'lya's Bothan Clan, was accused of complicity in the devastation of Caamas, and Fey'lya, as Chair of the Justice Council, was accused of letting off Bothans guilty of aiding the attack. Teaming up with Organa Solo and Gavrisom, Fey'lya managed to weather the storm, even briefly purchasing Leia's protocol droid C-3PO, so that 3PO could search Bothan bank accounts and look for those who were paid for the devastation of Caamas."}, {"tag": "p", "text": "Later that year, Fey'lya was an invited guest at the wedding of Luke Skywalker and Mara Jade. He arrived along with Talon Karrde, Mon Mothma and Elegos A'Kla."}, {"tag": "h3", "text": "Chief of State"}, {"tag": "p", "text": "After the resignation of Leia Organa Solo from the position of Chief of State, Fey'lya was elected her successor with a three-fifths majority in the first round. The Bothan brought with him his own council, which found itself in danger as the threat of the Yuuzhan Vong emerged. Thrown into the balancing act of maintaining peace within the New Republic, attempting diplomatic relations with the Yuuzhan Vong, and keeping Luke Skywalker's Jedi under his control at all times, Fey'lya made many wrong choices, particularly in light of the Yuuzhan Vong's desire for all-out war. As the war began, Fey'lya initially refused to believe that the Yuuzhan Vong even existed, and saw the destruction of Sernpidal as an elaborate plot by the Jedi and human politicians like Leia to take back control of the New Republic. He was, unfortunately, bolstered in these beliefs by several members of his Advisory Council, including Senators Pwoe and Niuk Niuv, who believed that, with Fey'lya's election, they had finally overturned the humanocentrism that had been the Empire's standard policy and which, in their eyes, had continued (albeit unofficially) under the New Republic, under the leadership of Mon Mothma and Leia."}, {"tag": "p", "text": "Fey'lya was deeply suspicious of the New Jedi Order, which was at least partially understandable, as the Jedi had failed to prevent the rise of the Empire and the fact that Darth Vader had once been a Jedi didn't help improve their image in his mind. He was hardly alone in his attitude toward them, however—over an entire generation had grown up since the end of the Clone Wars and billions of beings across the Galaxy had no memory of when the Jedi were considered champions of justice and peace. Several other New Republic politicians voiced wariness toward granting them any special treatment or support, even those in New Republic service. The prospect of a state-sponsored religion, composed of individuals with abilities far beyond that of regular beings, was, in the minds of many, an invitation to disaster, especially in light of the Republic's fall. An easier explanation, though, might have been simple jealously, and the uncomfortable fact that one of his main political rivals, Organa Solo, was the sister of the Order's leader."}, {"tag": "p", "text": "In the face of overwhelming evidence, he finally relented and committed the Republic to war, but his antagonism of the Jedi and the military severely harmed the overall war effort. For most of the war, Fey'lya's primary concern was the preservation of his public image, not the New Republic. After the destruction of Duro, and Tsavong Lah's ultimatum to turn over the Jedi to the Vong, Fey'lya seemed all too ready to accede, as he allowed Yavin 4 to fall the Yuuzhan Vong."}, {"tag": "p", "text": "Fey'lya also seemed willing to sacrifice other worlds as long as vital planets like Coruscant and the Core Worlds—as well as all of Bothan Space—were spared the invaders' wrath. At around this time, New Republic Intelligence Director Dif Scaur had begun working with the Chiss to develop Alpha Red, a virus designed to destroy the Yuuzhan Vong at a cellular level. It is possible that Fey'lya may have simply been trying to delay the Yuuzhan Vong until the virus was ready.[source?] He did, however, also rise to the occasion when given a chance to fight against the Vong-he took over communications for the flagship \"Ralroost\" during the Battle of Ithor after the previous communications officer was killed, showing he did have some measure of personal courage."}, {"tag": "h3", "text": "Epiphany and death"}, {"tag": "p", "text": "Eventually, he was forced to accept that there was no way of appeasing the Yuuzhan Vong, or of halting their advance into the Core Worlds with traditional military means, and that the Jedi were the only hope for the New Republic. When Nom Anor appeared before the New Republic Senate two years into the war demanding concessions and the lives of the Jedi, Fey'lya made a complete political turn around by stating Luke Skywalker had his full support, and lashed out at Anor, calling the Yuuzhan Vong a race of cowards. But it was already too late, as the Yuuzhan Vong launched their attack on Coruscant, forcing its evacuation in the face of overwhelming numbers. Fey'lya asked his old rival, Leia Organa Solo, to rally the New Republic to victory. Believing that he had lost everything, and that he only had a life of scorn (and worse, powerlessness) waiting for him if he lived, he stayed behind, attaching a bomb to a heart monitor and surrendering himself to the Yuuzhan Vong in hopes of taking Warmaster Tsavong Lah with him. The Yuuzhan Vong leader saw through his plan and sent Commander Romm Zqar, a subordinate, instead. Zqar attempted to force his surrender, and killed him when he refused. This detonated the bomb, killing Zqar and over twenty-five thousand Yuuzhan Vong Warriors, and destroying almost half of the Imperial Palace, including the data towers, thus preserving some of the Republic's most vital secrets. Although the invasion was a success for the Yuuzhan Vong, their losses were heavy, and Lah sourly remarked that they could scarcely afford to lose the twenty-five thousand warriors that Fey'lya had managed to take with him."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Whether or not this perfidious action redeemed him is questionable (indeed, some argued that he was irredeemable), Borsk Fey'lya essentially died a hero. To both his people and the New Republic at large, he had become a modern day martyr, and his death inspired the Bothans, for the first time in centuries, to declare a state of ar'krai—total war on the Yuuzhan Vong by the Bothan people. In addition to this, the Yuuzhan Vong also respected him for his actions and believed him to be a minor hero."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Borsk Fey'lya first appeared in The Thrawn Trilogy, though he is established in The Essential Chronology to have played a role in the Rebel Alliance since the defection of Garm Bel Iblis shortly after the Battle of Yavin."}, {"tag": "p", "text": "\"Borsk\" is Bothese for proud."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}