{"url": "Borvo", "categories": ["Category:Legends articles", "Category:Collectors", "Category:Crime lords", "Category:Hutts", "Category:Males", "Category:Naboo", "Category:Nal Raka Criminal Empire", "Category:Resistance fighters", "Category:Slavers", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Borvo"}, {"tag": "p", "text": "Borvo the Hutt was a powerful Hutt crime lord with a male personality who operated a large and profitable business, smuggling everything from blasters to spices. As an influential figure, he had dozens of strongholds on worlds located throughout the Outer Rim."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Like many ambitious young Hutts, Borvo left his home space early in his criminal career. He found a perfect hideout in the mountains of Naboo, a lush world with small police and security forces and far from the Galactic Republic's watchful eyes. He and his people established a base on Porso Hill, and also took over a N-1 starfighter base in the mountains. Borvo and his freighter pilot Adela Tyché easily evaded the pathetic tracking systems of the Naboo defense net, moving huge shipments of weapons artillery and even spice to the planet."}, {"tag": "p", "text": "As the young Hutt's business continued to grow under the nose of Queen Padmé Amidala and her administrators, he established semi-permanent operations on most other planets in the Outer Rim where he did illicit business; while on Naboo he would sell rifles and blasters to hunters, all perfectly legal, as fine cover in case his presence attracted the attention of the Naboo authorities."}, {"tag": "p", "text": "He was also employed by the Trade Federation."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "When the Trade Federation invaded Naboo in 32 BBY, droid scouts found Borvo's personal freighter and attacked it while it was cruising the mountains. Unable to defend itself, the ship's pilot made contact with Lieutenant Gavyn Sykes and his captain, Kael. Sykes saved the ship by destroying the attacking AATs. The treacherous Hutt pretended to help the Naboo, but he later betrayed the men by killing Kael and enslaving the locals. Lieutenant Sykes took his revenge by blowing up Borvo's freighter, starfighters, and depots. Borvo fled to Nal Hutta, only to return at a later date. His crime empire eventually recovered and grew during the Clone Wars."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "As the Clone Wars passed and the Galactic Empire rose to power, Borvo continued to run his criminal empire from Naboo and with the Empire's strict control of goods and weaponry, his smuggling and gunrunning operations flourished. At this time, Borvo was faced with much competition from various other criminal organizations on the planet. He was also an acquaintance of Jabba the Hutt and was known to gamble and place bets with him. Shortly after the Battle of Yavin, Borvo was known to relax in the Moenia cantina on Naboo. There he sent Mordran to the Gungan sacred place to destroy some Gungans that had crossed him. He had a hidden base just outside of the town. There, he stored excess weapons and droids. His personal ship at that time was a yacht called the Prosperous Secret."}, {"tag": "p", "text": "Circa 1 ABY, a spacer want to Borvo in order acquire an Old Republic decentralized autonomy chip droid module. The Hutt agreed to give the module if the spacer was able to pass through the defenses of his vault. The spacer accepted and finally succeed the test. Around that same time, a spacer carried out a number of assignments for Borvo and his guard, including killing the Hutt's former partner, Montrus. The latter helped the Corellian Security Force agent Niksel Frangee to infiltrate Borvo's organization. Afterward, Borvo rewarded the spacer by giving an antique Tusken King's rifle, a rifle stolen from Huff Darklighter on Tatooine."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Borvo was very similar to Jabba Desilijic Tiure, both had vast smuggling networks throughout the Outer Rim and started their crime careers at very young ages. Borvo was also the top crimelord on the planet he chose to call his home away from home, and, like Jabba, he was faced with much competition on Naboo. Also like Jabba, Borvo had an eye for dangerous creatures, such as the acklay and rancor which he kept in his underground base. However, these creatures were used more as guards and it is unlikely, but still plausible, that Borvo fed his enemies and prisoners to them in the way Jabba was known to. Borvo also enjoyed dancing girls just as much as Jabba, though it is unknown if he owned any himself."}, {"tag": "p", "text": "Unlike Jabba, however, Borvo seemed more active in his business in that around the invasion of Naboo he seemed to make at least some his smuggling runs personally rather than having others do it for him. Like most Hutts, Borvo was not above betraying and exploiting others to serve his own ends. He betrayed the Naboo security forces by selling rescued prisoners as slaves and stealing crystals from a Naboo mining site, even though they saved him and his ship. Borvo did, however, seem to hold great regard for those who impressed him and served him loyally, unlike Jabba. He hired Adela Tyché for her great piloting skills and being fluent in Huttese and other languages. He valued Mordran for his fighting skills and found respect for a young spacer when they killed an old business partner who betrayed him."}, {"tag": "p", "text": "These facts seem to support the claim that Borvo personally was not nearly as mean-spirited or cruel as Jabba, choosing instead to rule his criminal empire with generosity and esteem, much like Lady Valarian, which is most likely the cause of his great success. He even had some admiration for his enemies, when Lieutenant Sykes came after him, he admitted that he liked his attitude and offered Sykes a place at his side if he willingly surrendered, to which Sykes refused. Ultimately, despite his vast crime empire, Borvo himself seemed to keep a low profile, which he may have preferred as long as he made a profit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Borvo first appeared in the video game Star Wars: Episode I: Battle for Naboo, where he was voiced by Clint Bajakian. He later appeared in Star Wars Galaxies as an NPC, giving quests to the players."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}