{"url": "Borvo_the_Hutt%27s_starfighter", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Hutt Cartel starfighter classes", "Category:Nal Raka Criminal Empire"], "nodes": [{"tag": "h1", "text": "Borvo the Hutt's starfighter"}, {"tag": "p", "text": "This class of single-seat starfighter was a type of armed starship used by the mercenaries employed by the smuggler Borvo the Hutt around 32 BBY. They were equipped with two different engines. Borvo deployed these fighters during his temporary alliance with the Naboo Bravo Flight. After Borvo broke the alliance, Lieutenant Gavyn Sykes attacked Borvo's position and engaged a number of these starfighters."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "These starfighters were beige in color and had a small profile. The fighters had two different-sized engines on either side of the main fuselage and were equipped with multiple laser cannons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The smuggler Borvo the Hutt utilized this class of starfighters in his criminal empire; they were flown by his mercenaries around the time of the Invasion of Naboo in 32 BBY. At least one was stationed at Borvo's base on Naboo, the N-1 assembly site. It was used by Kol Kotha when Borvo allied with the Royal Naboo Security Forces. He flew it during several missions with the Naboo pilots, including the attacks on Comm 4 and a Federation base."}, {"tag": "p", "text": "Additional starfighters of this class were stationed on the Hutt's outpost on Porso Hill. They were used to defend Borvo's personal transport after Borvo attempted to sell captured Naboo slaves. Lieutenant Gavyn Sykes and his wingmates attacked Porso Hill in retaliation, destroying a few and driving off the rest. Kotha betrayed Borvo and went on to fly in his personal starfighter as Sykes' wingmate during the liberation of Camp Four."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This starfighter's first and only appearance to date is in the 2000 video game Star Wars: Episode I: Battle for Naboo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}