{"url": "850.AA_Public_Service_Headquarters", "categories": ["Category:Legends articles", "Category:Cleaning droid models", "Category:Fifth-degree maintenance droid models", "Category:Publictechnic products"], "nodes": [{"tag": "h1", "text": "850.AA Public Service Headquarters"}, {"tag": "p", "text": "The 850.AA Public Service Headquarters was a repulsorlift maintenance droid produced by Publictechnic as an all-in-one unit to combat urban decay."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Commonly used in large industrial areas in the Core Worlds, the Colonies and the Corporate Sector, the 850.AA was a boxy, thirteen-meter-tall roving maintenance and cleaner droid. The droid could hover up to twenty meters off the ground under repulsor power, but lowered to a height of one-and-a-half meters to engage three abrasive scrubbers mounted on the droid's underside. These scrubbers, working in conjunction with fourteen beamcleaners, were used to clean streets with precise scouring power."}, {"tag": "p", "text": "The 850.AA contained three separate stories housing a variety of droids and equipment. The lowest level was designed to store up to thirty smaller droids, and commonly had a complement of ten general-maintenance units, ten WED Treadwell repair droids, five worker drones and five EG-6 power droids. Retractable ramps on either side of the 850.AA's durasteel body allowed these droids easy egress and ingress."}, {"tag": "p", "text": "The second level housed within the 850.AA was used as a parking garage for two landspeeders and similar ground vehicles of approximately ten meters in length, used by the droid's Human crew members. An upper story rear hatch with extensible aft ramp provided an exit for these vehicles."}, {"tag": "p", "text": "The uppermost level was an open-air landing pad for airspeeders and flitters. The fore section also included a large sensorlink network system to scan the surrounding area for signs of urban decay. In addition, the 850.AA could dispatch a number of specialized droids, kept in contact through a tight-beam antennae, to carry out more detailed cleaning and repair tasks. The 850.AA maintained recharging facilities for these droids, and could itself operate autonomously for several weeks at a time due to the droid's efficient energy-conservation system."}, {"tag": "p", "text": "Older 850.AA units were known to have been modified to serve as firefighting droids or construction units on some planets. A notable incident on Carratos saw a street gang hijack an 850.AA and convert it into an armored hideout and a highly effective battering ram."}, {"tag": "h2", "text": "Sources"}]}