{"url": "Bossk/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with unencyclopedic tone", "Category:Bounty hunters", "Category:Males", "Category:Pilots", "Category:Slavers", "Category:Trandoshans", "Category:Zann Consortium members"], "nodes": [{"tag": "h1", "text": "Bossk"}, {"tag": "p", "text": "Bossk (whose name meant \"devours his prey\" in Dosh) was a male Trandoshan bounty hunter who was the pilot of the Hound's Tooth and held the title of monarch of the Qotile system. He was also an old enemy and rival for Chewbacca and his Human partner Han Solo. He would face them several times, and would unsurprisingly be one of the six bounty hunters Darth Vader hired to track down and capture the Millennium Falcon. Despite the fact that Bossk loved to hunt and skin Wookiees, he would unknowingly aid in the freeing of hundreds of Wookiee slaves on the island world of Lomabu III. He was also a frequent partner and foe of both Boba Fett and Zuckuss, both fellow bounty hunters. After being repeatedly beaten by Boba Fett, Bossk would eventually boost his reputation as a bounty hunter by defeating Fett on Tatooine."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Bossk was born on Trandosha, the son of Cradossk, the leader of the Bounty Hunters' Guild. After hatching, Bossk devoured each of his unhatched siblings, which made his father proud."}, {"tag": "p", "text": "In 44 BBY, Bossk chased down the bounty of a Stark soldier for desertion. This capture kickstarted his career at an incredibly young age, making him a viable option as a bounty hunter at so young."}, {"tag": "p", "text": "As was customary for a Trandoshan, Bossk began his career by hunting Wookiees, typically considered suicidal if attempted by any other species. During this time, Bossk made a name for himself and began accepting bounties on non-Wookiees as well, becoming one of the galaxy's most feared bounty hunters."}, {"tag": "p", "text": "Before his acceptance into the Bounty Hunters' Guild, Bossk prowled the Kashyyyk system in a Sabaoth starfighter during the Clone Wars. With it, he engaged in a dogfight with Jedi Master Bant Eerin and her apprentice during the Republic's hunt for the Confederate scientist Bitt Panith. However, Bossk was defeated in the scuffle. At some point during the Clone Wars, Bossk was a wanted individual, and a thirty-five thousand credit bounty was placed on his head for \"crimes against the Republic.\""}, {"tag": "p", "text": "Following that incident, Bossk teamed up with fellow bounty hunters Aurra Sing, a young Boba Fett—who was going under the code name \"Lucky\"—and the Klatooinian Castas on a hunt for the renowned Jedi Master Mace Windu. After Fett destroyed the engines of the Venator-class Star Destroyer Endurance, making it crash on Vanqor, the bounty hunters went inside and took three hostages: Admiral Kilian, Commander Ponds and a clone officer. However, the trio retreated after watching Windu's fighter escape them by making the jump to hyperspace."}, {"tag": "p", "text": "As the bounty hunters stopped on Florrum to request services of space pirate Hondo Ohnaka, Bossk was left in charge of the ship, the Slave I, holding their two Republic hostages which survived the trip. As he was about to kill the hostages, the Padawan Ahsoka Tano swooped in on a speeder bike, subdued Bossk and freed the hostages. Bossk was then held at gunpoint by Kilian, with the Trandoshan's own weapon. Aurra Sing then arrived in on a speeder bike, and during the brief battle that followed, Aurra tried to escape with Slave I, but crashed after Ahsoka cut off one of the wings. Later, both Bossk and Boba Fett were taken as Republic prisoners to the Republic Judiciary Central Detention Center on Coruscant."}, {"tag": "p", "text": "While in prison, Bossk opted to serve as a bodyguard to Boba. When he saw a fight take place between Obi-Wan Kenobi disguised as Rako Hardeen and his young charge he chose to stand up for Boba and threw Hardeen across a dining table creating a distraction for the prisoners to escape. Bossk and Fett escaped in the chaos."}, {"tag": "p", "text": "Bossk continued working with Boba Fett when they went to Tatooine. Bossk, along with fellow bounty hunters Dengar, C-21 Highsinger, Oked and Latts Razzi went to Chalmun's Spaceport Cantina. After seeing Oked killed, Bossk and Latts invited his killer, Asajj Ventress, for a drink and blackmailed her into taking Oked's place on their team for a job. After Ventress agreed, Bossk and Latts took her to meet their leader, Boba Fett, and the other team members. Fett's team had been hired by the Belugan Major Rigosso to protect a large chest while it was delivered via subtram to his Lord. While on the job, the tram was attacked by Kage Warriors. After several minutes of fighting, Bossk was sent to help Ventress defend the rear. On the way, however, a Kage Warrior blew blinding dust into his face. Unable to see, Bossk was kicked off the tram. He hit the ground hard, bellowing his fury. Later, he and the rest of the team collected their shares of the payment.."}, {"tag": "h3", "text": "Early Rebellion era"}, {"tag": "p", "text": "About a year before the Battle of Yavin, Bossk teamed with Boba Fett on a particularly difficult job that took them to the inhospitable, snowy planet Orto Plutonia. The following year, he worked with Skorr and several other bounty hunters in a hunt for the Rebel agent known as Kestrel. They caught up with her on Ord Mantell, but failed to capture their prey."}, {"tag": "p", "text": "Bossk then met up with rival Boba Fett outside a cantina during Fett's hunt for Connor Freeman. Bossk didn't think Freeman's bounty was worth enough and didn't want to be in the middle of Fett's fight with the League of Bounty Hunters. Bossk walked away and told Fett to have fun playing with stupid dead bounty hunters."}, {"tag": "p", "text": "At a point early in his career, Bossk had a run-in with Chewbacca and Han Solo that left him vengeful and angrier than most other Trandoshans. The hunter and his partners had uncovered a Wookiee safe planet and caught the Wookiees, led by Chewbacca, just as they were settling in. Just before Bossk could capture the entire group, which Bossk saw as a bounteous gift for his goddess, the Scorekeeper, Han Solo returned and destroyed Bossk's ship by landing the Millennium Falcon on it. The Trandoshan hunter was stranded and left to his own helpless rage. After his first ship was destroyed, Bossk purchased a YV-666 light freighter, which he named the Hound's Tooth, and continued his hunting. He continued to harbor a grudge against Chewbacca and Han Solo."}, {"tag": "h3", "text": "Taking control of the Guild"}, {"tag": "p", "text": "As the direct heir of the Bounty Hunters' Guild, Bossk had been plotting his father's demise for some time. The Guild was everything to the brutal hunter, and he refused to watch his father's senile claws destroy what was rightfully his. After enacting a brutally efficient plot to overthrow Cradossk and set himself up as leader, Bossk went on a bounty with Boba Fett, IG-88B, Zuckuss, and D'harhan where he narrowly avoided an assassination attempt by Zuckuss (who was working with Cradossk) by bribing the other hunter to his side. Bossk returned, to the surprise of his father, and violently murdered him using his father's own weapon, an ornamental dagger, and devoured him as the Guild complex erupted into a massive firefight. After this, however, the Guild had been split in half. Bossk was the leader of the Guild Reform Committee, which consisted mostly of younger hunters, and was fixed on destroying the True Guild, which he saw as old, lazy hunters."}, {"tag": "h3", "text": "Recruitment with Fett"}, {"tag": "p", "text": "Against his better judgment, Bossk again worked with Boba Fett to track down the rogue stormtrooper Trhin Voss'on't. After nearly dying, Bossk managed to help Fett capture the defect Imperial only to double-cross the other hunter. Bossk reasoned that Voss'on't's bounty could help give the Committee the upper hand in the Bounty Hunter Wars, and would do it much better if he collected all of it. After disabling Slave I's internal defense systems, Bossk captured Fett on his own ship. Luckily for him, Fett had foreseen this complication and had already hired Zuckuss to back him up after gaining the bounty. Bossk was subdued, and then Zuckuss was also double-crossed. Boba Fett forced the pair into the only escape pod, and then blasted both hunters out of Slave I. Angrily, Bossk threw a miniature thermal detonator into Fett's ship just before he was launched, which gave the pod enough time to escape."}, {"tag": "h3", "text": "Bounty on Skywalker"}, {"tag": "p", "text": "After the Battle of Yavin around 0 ABY, a mysterious person paid off his debts to Jabba the Hutt by telling him that Luke Skywalker was on Tatooine. Jabba did not care until he discovered that this person was friends with Han Solo. Jabba was angry at Solo since he had not paid off the shipment that he lost after running into an Imperial patrol. When Jabba realized this, he sent Bossk to capture Skywalker and Bossk took the job, having a grudge against Solo because of his friend Chewbacca. Since Trandoshans were enemies of Wookiees, Bossk was happy to capture Skywalker."}, {"tag": "p", "text": "Meanwhile, Skywalker had come to visit Tatooine with Princess Leia, R2-D2, and C-3PO to attend a funeral for Biggs Darklighter, Skywalker's friend, who was killed by Darth Vader in the Battle of Yavin. Later, Skywalker raced against a man he knew named Jaxson. Bossk used a Pulse Generator to disable the skyhoppers electrical systems causing Skywalker and Jaxson's skyhoppers crash and explode. While they were both unconscious, Bossk bound them together and dragged them to the Jundland Wastes. When Skywalker woke up, he asked why Bossk had done this. Bossk told him, though he didn't tell he did it for Jabba. Jaxson, who was thought unconscious, actually was awake, and later asked Skywalker who Solo was. Skywalker managed to escape by using his lightsaber to unbind Jaxson and himself. Then during the fight he cut off one of Bossk's arms and one of his legs. Though Skywalker thought that Bossk wouldn't come after him again, Bossk, being a reptile, regrew his arm and leg and went after Skywalker again. He later went in a cantina in Mos Eisley where Skywalker and his friends had gone for a reunion. Once there, Bossk tried to kill Skywalker and his friends. In the process, he killed some patrons in the cantina. Nevertheless, Skywalker managed to best him. Bossk surrendered and limped out of the cantina. Later, after Jabba's henchman had caught Bossk trying to get off Tatooine, he had to tell of his failure. Jabba had Bossk put in his rancor pit, but Bossk survived."}, {"tag": "h3", "text": "Emperor's Most Wanted"}, {"tag": "p", "text": "Following the battle of Talus, Bossk became involved in capturing Emperor's Most Wanted, individuals from a list of high-paid bounties on critical Rebel Alliance leaders. Bossk delivered his captive to Tatooine and escorted him to an Imperial prison facility near Dee'ja Peak on Naboo. He later escorted the captives being held there to an Imperial prison facility near Bestine on Tatooine. Back at the Bestine spaceport, Bossk was loading a repulsorlift stacked with cargo onto the Hound's Tooth, when he was approached by a Rebel agent pretending to be working for Borvo the Hutt. The agent tried to learn the location of the facility where Rebel prisoners were held, but Bossk was unwilling to share such information with whom he assumed to be Hutt's lackeys and, summoning some of the thugs who worked for him, tried to teach the messenger \"a lesson\". However, the Rebel did not come unprepared and, with a help of his backup, was able to defeat the thugs and subdue Bossk. The Trandoshan was asked about the location of the facility again. Bossk taunted the Rebels, but since he was already paid, he was losing nothing when he described the location. He was certain that the Rebel could not even get close to facility, but to prevent him from alerting the Imperials of the upcoming raid, he was temporarily held in Mos Eisley for a few hours of questioning."}, {"tag": "h3", "text": "A chance meeting"}, {"tag": "p", "text": "Around 1 ABY, Bossk was still doing some work for Jabba the Hutt. While taking a small break in the Mos Eisley cantina, he met a spacer, whom he thought could help him with some of his work for Jabba. Bossk's first task for the spacer was to find out which smuggler in Jabba's employ tipped Lady Valarian off on a spice shipment he was running. Bossk instructed the spacer to kill nearby Valarian supporters until they found the information they needed. The spacer eventually discovered the identity of Jabba's traitor and executed him. The spacer returned to Bossk for a 10,000 credit reward."}, {"tag": "p", "text": "Bossk ran into the spacer several days later in the Mos Eisley cantina and offered them another assignment. Jabba and the mayor of Mos Eisley had a disagreement, and Jabba wanted revenge. He planned to trick the Tusken Raiders into attacking Mos Eisley, but one of them had learned of this plan, and was on his way to his people to warn them of the trickery. Bossk instructed the spacer to go speak to one of his contacts in Mos Espa, a Jawa, to learn where the Tusken was. The Jawa gave the spacer for the Tusken's last known location. The spacer traveled out to the sand wastes, found the Tusken, and killed him. Bossk rewarded the spacer for a job well done with 20,000 credits."}, {"tag": "p", "text": "Bossk met the spacer a third time, and gave them yet another task to complete. This time, Jabba had made a bet with a fellow Hutt. The bet was to see who could acquire the greatest trophy in the least amount of time. Jabba could think of only one thing to come out on top - the shroud of a Nightsister. The spacer traveled to Dathomir, and after much searching, and an arduous battle with one of the Force-sensitive witches, was able to secure a shroud for Jabba. The spacer returned it to Bossk, but Jabba declared it not good enough, that he needed the shroud of a Nightsister elder. The spacer returned to Dathomir and somehow retrieved the elder shroud and gave it to one of Jabba's agents in Wayfar, who rewarded the spacer with 50,000 credits and a specially modified carbine rifle."}, {"tag": "p", "text": "Bossk met with the spacer a fourth and final time in Chalmun's Cantina. Jabba had become worried about the activities of the Black Sun criminal syndicate, and paid an informant to spy on them. Sadly, the informant was discovered. Jabba now needed someone to test the Black Sun's strength. The spacer infiltrated the Death Watch bunker on Endor and battled many of the Black Sun agents inside, gathering information along the way. Satisfied that they had tested the strength of the Black Sun's, the spacer returned to Jabba's agent in the Wayfar cantina and was rewarded with 100,000 credits and a special pair of gloves which improved the user's accuracy."}, {"tag": "p", "text": "A short time later, Bossk teamed with a fellow Trandoshan bounty hunter by the name Balfur Jhcor. Together they tracked three bounties on the planet Lok: Joti Laike, Sardeya Elgrin and Oono Mor'in. Bossk also colleced the bounty for Lucien Bender, the leader of the Bofa Treat Gang, on Corellia."}, {"tag": "p", "text": "Not much later, in 2 ABY, Dominic Raynor, former Baron Administrator of Cloud City, hired Bossk to hunt down the city's new owner, Lando Calrissian. Knowing that his target would be well protected, Bossk brought along an unsavory band of mercenaries and cutthroats. Bossk and his crew managed to slip through Cloud City's security and planned an ambush for Lando in one of the Maintenance Decks. Bossk sabotaged some vital equipment to lure the Administrator to a trap. Lando was unable to summon reinforcements, so he and his guards were forced to fight their way out."}, {"tag": "p", "text": "In 3 ABY, Bossk somehow ran afoul of the Corellian Security Force. The bounty hunter killed Hal Horn and the two men he was meeting, and was apprehended by Corran Horn shortly after. However, he was released from custody by CorSec's Imperial Liaison Officer, Kirtan Loor in exchange for taking a job for the Empire."}, {"tag": "h3", "text": "The Hunt for the Millennium Falcon"}, {"tag": "p", "text": "Even though Han Solo and Chewbacca again slipped through his claws due to help from Luke Skywalker, Bossk was one of six hunters hired by Lord Vader to hunt down and capture Solo. The Trandoshan hunter took it as a point of honor and revenge to capture his wretched Wookiee enemy and his weak Human counterpart. He grudgingly teamed up with the amateur bounty hunters Tinian I'att and Chenlambec, believing they had inside information about Solo's whereabouts. They also offered information on a Wookiee intelligence network that, if hacked, could give information to Bossk that would allow him to track down and kill thousands of Wookiees. They traveled to Lomabu III in the Aida system. They were able to hack into the Hound's computer, trap Bossk in a meat locker, and take over the ship."}, {"tag": "p", "text": "Using the Nashtah Pup they attacked an Imperial Wookiee prison, allowing countless Wookiees to rebel against their captors. They then used the Hound to transport the hundreds of Wookiee slaves and delivered them to the Rebellion. They then delivered Bossk to the Empire, who paid a bounty on him, for illegal Wookiee pelting, which was really a lie used by the pair of false bounty hunters to receive extra credits and get Bossk off of their hands. When given over, an Imperial planned to have Bossk skinned and made into a dress for his wife. Bossk escaped from his prison and retrieved his ship, which Chenlambec the Wookiee had taken."}, {"tag": "p", "text": "When Boba Fett visited a cantina on Gall, the bounty hunters Bossk and Zuckuss attempted to bring Fett to their side and work together in order to share the bounty of Han Solo. He firmly refused and shot a sniper placed to shoot him, then his system warned him that Slave I has been breached by 4-LOM and left the cantina."}, {"tag": "p", "text": "Sometime later, 4-LOM still inside the Slave I called Bossk who tracked Fett down. The Hound's Tooth approached them stranded in an asteroid field. Bossk sent Zuckuss and a team of colleagues to board Slave I and apprehend Fett in order to capture the carbonite slab for themselves. However Fett trapped Furlag and caused a havoc. Shortly after, Bossk received a message by Zuckuss that they are returning with the carbonite slab in their shuttle back to the Hound's Tooth; when Bossk's co-pilot looked inside the shuttle, he saw their fellows dead, along with a detonation device which exploded at the Tooth's bay. As Bossk cursed Fett, the Slave I jumped to hyperspace."}, {"tag": "h3", "text": "Under the Cartel and Consortium"}, {"tag": "p", "text": "Bossk then accepted a job from the Hutt Cartel to eliminate Tyber Zann after he deactivated the droideka Mark IIs on Hypori, but Zann later hired him away from the Cartel with promises of triple Jabba's pay. The Trandoshan then assisted Tyber in defending himself from the Hutt Cartel's landing forces. Bossk later assisted the Zann Consortium in several missions around the galaxy, up until Tyber came to Carida to meet Imperial Grand Admiral Thrawn. Bossk then stole a Sith artifact from the Consortium and sold it to the Galactic Empire—although this was apparently all part of a plan concocted by Zann. Afterward, Bossk was not welcome back to the Consortium."}, {"tag": "p", "text": "During the Heroes of Yavin's infiltration of Jabba's Palace in 4 ABY, Bossk was briefly spotted in the immediate vicinity of Boba Fett during performances of both \"Lapti Nek\" & \"Jedi Rocks\" by the Max Rebo Band. He later accompanied Jabba's retinue aboard the Khetanna making his escape sometime during the Battle of the Great Pit of Carkoon."}, {"tag": "h3", "text": "The final encounter with Fett"}, {"tag": "p", "text": "Quite some time later, after Boba Fett's \"death\", Bossk had another run-in with the hated hunter. He was forced to abandon the Hound's Tooth in a panic as a bomb calmly counted down the seconds remaining to detonation. Again, Bossk found himself in an escape pod because of Boba Fett and seethed silently to himself. Suddenly, a countdown began echoing in the escape pod. In a frenzy, Bossk tried to find the bomb, managing to discover just as the countdown reached zero, however nothing happened. It was then that the hunter realized that he had been scared off of his own ship, and he now knew that Fett hadn't in fact been killed by the sarlacc and was now using the Hound's Tooth as his own ship."}, {"tag": "p", "text": "Bossk landed on the surface of Tatooine, where he was stranded without any source of credits. Luckily for him, he had managed to steal an important piece of evidence from Slave I that led to another show down with Fett in the Mos Eisley Cantina. Bossk held his ground against the fearsome hunter, refusing to give the location of the evidence without money, even with Fett's blaster trained on his forehead. Boba Fett uttered the unthinkable words \"You win\" and transferred a large amount of credits into Bossk's account in exchange for the evidence. It was believed that Bossk used this money (not to mention the new respect he earned for defeating Boba Fett) to get back on his feet in the bounty-hunting world."}, {"tag": "h3", "text": "Retirement"}, {"tag": "p", "text": "Years after the Battle of Endor, Bossk retired from professional hunting. He later ran into Han Solo on a space station orbiting Ord Mantell during the Yuuzhan Vong War. When he heard of Chewbacca's death, Bossk rubbed it in Solo's face, receiving a broken snout in return. The encounter escalated into a fight, and both Bossk and Solo were put into arrest cells. Solo was allowed to leave shortly before the invasion of the space station, but Bossk had to stay. The station was later destroyed, but just before the explosion, an escape pod jettisoned."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bossk had a very controlling attitude with his partner, and eventually killing some of his others, and he worked better alone, coming up with some very snarky responses for aliens and humans alike who insult him. The reason he killed was because Trandoshans believed that there was a \"Scorekeeper\" at the end of an individual's life, and that for each kill they get points depending on how hard they were to kill, or how many kills they have themselves. If one were to be captured alive, their score would be erased and the Scorekeeper would \"turn her head away.\""}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Bossk's primary weapon was a Relby-v10 micro grenade launcher, though he would also use a standard blaster and made use of thermal detonators and a flamethrower. On one occasion, Bossk improvised and used other beings as weapons, once throwing Zuckuss at Boba Fett in order to decoy him. He also utilized a YV-666 light freighter, named the Hound's Tooth, as his personal headquarters. The ship was often described as having a repellent odor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Similar to Boba Fett, Bossk was one of the few characters who debuted in Star Wars Episode V: The Empire Strikes Back to have made a first appearance predating that of the movie's release. In Bossk's case, he appeared as an advance promotion mail-away by Kenner Products, with a flyer accompanying the mail-in flyer that revealed his role in the Empire Strikes Back."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "Actor Alan Harris portrayed the role of Bossk in Star Wars: Episode V The Empire Strikes Back. Harris also plays Bossk in Star Wars: Episode VI Return of the Jedi and LEGO Star Wars II: The Original Trilogy albeit uncredited. Trevor Butterfield also took on the role in Return of the Jedi when Harris was unavailable. Dee Bradley Baker voiced Bossk in the Star Wars: The Clone Wars TV series."}, {"tag": "h3", "text": "Costume"}, {"tag": "p", "text": "The costume is an unaltered 'High-Altitude Windak Pressure Suit' developed in 1962 by Baxter, Woodhouse and Taylor Ltd. to fulfill R.A.F. (British Royal Air Force) requirements. It is also the same suit used by BoShek and another unnamed extra in the Mos Eisley cantina. The white flack vest is part of the suit, so it is likely that those worn by X-wing pilots were based on these. The leg bands strapped around each of Bossk's legs are flare pistol cartridges similar to those worn by the German Luftwaffe during WWII. These flares were also worn by Rebel pilots."}, {"tag": "p", "text": "There is a continuity problem regarding Bossk's physical height. All previous sources put Bossk at 1.90 meters tall, while StarWars.com's Databank puts his height at the much taller 2.08 meters."}, {"tag": "h3", "text": "Video games"}, {"tag": "p", "text": "In the video game Star Wars Galaxies, the player can sometimes find Bossk inside Tatooine cantinas, where they are able to do quests on his behalf in order to gain rare items. In LEGO Star Wars II: The Original Trilogy and LEGO Star Wars: The Complete Saga, Bossk is a playable character. He also appears in Star Wars: The Force Unleashed, where in the Xbox 360 and PlayStation 3 versions of the video game, \"Bossk\" is an achievement for killing 200 Wookiees in the game's prologue level, set on Kashyyyk."}, {"tag": "p", "text": "In Star Wars: The Old Republic, there is a Bossk look-alike on the Ziost Shadow, complete with the other bounty hunters and a Darth Vader look-alike from the bounty hunter scene from The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}