{"url": "Bostuco", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Officers", "Category:Onderon military personnel", "Category:Onderon Royalists", "Category:Onderonians"], "nodes": [{"tag": "h1", "text": "Bostuco"}, {"tag": "p", "text": "Bostuco was a Human male who served in the Onderonian military, having earned the rank of Captain. He was the leader of the security detail that guarded the Sky Ramp, one of the passageways that led to the Iziz Royal Palace on his native world of Onderon. During the Onderon Civil War, he, along with Meetra Surik, led an assault against the troops of General Vaklu in the hope of saving Queen Talia from her cousin's coup d'etat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As of 3951 BBY, Bostuco had served in the military of his native Onderon for over twenty years. A veteran of the Mandalorian Wars and a resistance fighter who had served under General Vaklu, he had spent the decade after serving on the Wall of Iziz itself, which was considered an extremely prestigious position within the Onderonian military. During the period of civil unrest that led to the Onderon Civil War, Bostuco was removed from duty on the Wall and given command of a guard detail meant to keep the Sky Ramp secure against any attempted intrusions."}, {"tag": "p", "text": "Though he did not question the transfer or his orders, Bostuco nonetheless resented it. Bostuco knew he had many years of service left in him, and this transfer- from an honored and dignified command to a seemingly-meaningless one- made Bostuco feel as if he was being set aside. Bostuco longed to return to guard duty on the Wall, but remained steadfast and loyal, determined to carry out whatever orders he was given by his superiors."}, {"tag": "p", "text": "During the second battle of Vaklu's attempted coup, Bostuco, along with Meetra Surik, led a Royalist strike force up the Sky Ramp against the rear guard of Vaklu's troops who were attempting to penetrate the Iziz Royal Palace to kill Queen Talia. After the party, led by Surik, breached their defenses, he and his detail joined up with a larger group of Royalist soldiers who were attempting to retake the Palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Before the Second Battle of the Onderon Civil War, it is possible that Meetra Surik met up with Bostuco, where the two may converse about Bostuco's shift in transfer. If Surik sympathized, and reassured Bostuco by saying that considering the situation on Onderon, he was still in charge of a very important post, then Bostuco will thank Surik for his/her words, and the player will receive light side points."}, {"tag": "p", "text": "If the player takes the alternate dark path through the game than they would use Anda's security card to overload the nearby terminal ports killing Bostuco and many of his men. His position would almost immediately be filled by one of Vaklu's loyal captains."}, {"tag": "p", "text": "While it is not possible for Bostuco to die on the Sky Ramp if the player takes the light side path, it is possible for him to be killed by Vaklu's forces while inside the palace."}, {"tag": "p", "text": "When overloading the terminal port, it is possible that Bostuco will still live but with Anda thinking he's dead. You can then persuade him to ask for re-assignment, Anda will then give you money for two when you really only got rid of one. You will need a very high level, around 40 to do this though, meaning you would have to cheat or use a glitch."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}