{"url": "Bothan_Combat_Response_Element", "categories": ["Category:Legends articles", "Category:Bothan organizations", "Category:New Republic military units"], "nodes": [{"tag": "h1", "text": "Bothan Combat Response Element"}, {"tag": "p", "text": "The Bothan Combat Response Element was a task force concept created by Bothan tacticians during the Galactic Civil War, referred to good-humoredly as a \"micro-fleet\"."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally established by one of the more adventurous Bothan clans, the Combat Response Element was intended to serve as local fast-attack squadron for use in skirmish warfare with nearby Imperial holdouts, consisting largely of small capital ships that had themselves been captured from the Imperial Navy. However, four years after the Battle of Endor, Captain Kursk Mal'ia's squadron was co-opted by the New Republic for a long-range deployment to the Outer Rim, providing support for the corvette FarStar on its mission into the remotest reaches of Kathol sector."}, {"tag": "p", "text": "For this mission, augmented by some New Republic ships, the Combat Response Element comprised eight capital ships. As well as Captain Mal'ia's flagship, the escort frigate Boash'ua, there were two other reasonably large warships, the Assault Frigate Victory at Endor and the bulk cruiser Hutt's Ambition (perhaps outfitted as a carrier), plus the CR90 corvette Ast'ria, and four Corellian gunships, one of which was named Resistance. These ships were divided into a gunship line and a cruiser line, although the exact composition of the two groups is unclear. The unit's intervention at the Battle of Kathol System was essential to the destruction of DarkStryder and the defeat of Moff Kentor Sarne's forces."}, {"tag": "p", "text": "Bem Lyu'kij was also a member of the Combat Response Element."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It is not completely clear from Endgame whether the Bothan Combat Response Element is a specific squadron within the New Republic Defense Fleet, or if Captain Mal'ia's force is simply a representative of a more widespread Bothan \"micro-fleet\" concept known as a \"Combat Response Element\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}