{"url": "Bothan_sector", "categories": ["Category:Legends articles", "Category:Bothan culture", "Category:Bothan Space", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors", "Category:Mid Rim sectors", "Category:New Republic sectors"], "nodes": [{"tag": "h1", "text": "Bothan sector"}, {"tag": "p", "text": "The Bothan sector, also known as Bothan Space, was a sector located in the Mid Rim. Planets in Bothan Space included Mandell, Sennatt, Torolis, Bothawui, Krant, and Kothlis."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Bothan Space included some 150 settled star systems, most of them dominated by Bothan colonists, and was ruled by the Bothan Council, made up of representatives from hundreds of Bothan clans."}, {"tag": "p", "text": "The edge of Bothan Space was known as the Bothan Border."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Bothan Space joined the Galactic Republic sometime between 17,000 BBY and 12,000 BBY. The Space had a status of Allied Region that allowed it to conserve some independence from the Republic."}, {"tag": "p", "text": "In 11,198 BBY, the region was victim of the Twenty-Third Pius Dea Crusade."}, {"tag": "p", "text": "Sometime prior to the Clone Wars, the entire sector was saved from Wookiee bandits by Jedi Master Knol Ven'nari. During the Clone Wars, Jedi General Etain Tur-Mukan was operating around the Bothan sector."}, {"tag": "p", "text": "During the Imperial Period, the Galactic Empire allowed Bothan Space to retain its Allied Region status, as an Imperial client state, but kept a wary eye on the Bothans and their ambitions. In 18 BBY, the sector was invaded by the Separatist holdouts until its liberation by the Empire. The Rebel Alliance Bothan Sector Force was active in the sector during the Galactic Civil War. By the time of the early Galactic Civil War, passengers to flights at Spaceport THX1138 that had Bothan Space as the destination required that the passengers show their Imperial authorization form before boarding."}, {"tag": "p", "text": "The sector was represented by Polo Se'lab in the Galactic Senate; by Borsk Fey'lya on the New Republic Provisional Council; and by Mak Sezala in the New Republic Senate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Timeline 5: The Battle of Bothawui, the map indicates Bothan Space in the \"northeast quadrant\" of the galaxy while all other sources, including The Essential Atlas, indicate it is in the \"southeast quadrant.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}