{"url": "Botor_Enclave", "categories": ["Category:Legends articles", "Category:Allied Regions", "Category:Botor Enclave", "Category:Core Worlds governments", "Category:Core Worlds sectors", "Category:Galactic Republic-aligned governments", "Category:Galactic Republic sectors", "Category:Interplanetary governments", "Category:Southern Core sectors"], "nodes": [{"tag": "h1", "text": "Botor Enclave"}, {"tag": "p", "text": "The Botor Enclave was a Core Worlds territory that included around two dozen star systems, including the Botor system and the Kerensik system. It was home to the sentient Botori species, which had a millennia-long history of warfare against the Dawferim Humans of the neighboring Daupherm Planet States. Holding the status of an Allied Region with the Galactic Republic, the Botor Enclave declared its independence from both the Galactic Empire and the New Republic following the former's fragmentation at the Battle of Endor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Botor Enclave was a territory situated in the Southern Core portion of the Core Worlds. It adjoined the area known as the Daupherm Planet States as well as the southern edge of the Deep Core."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Since accepting the status of an Allied Region of the Galactic Republic during the early period of that government, the Botori inhabitants of the Botor Enclave and their ancient rival, the Dawferim Humans of the nearby Daupherm Planet States, engaged in at least forty wars, with some of them lasting for centuries. A large number of laws and traditions regulating nearly every aspect of the conflicts, including vendettas, privateering, and all-out war, emerged over the subsequent millennia. Both the Republic and its successor, the Galactic Empire, only intervened in the Botor-Daupherm conflicts when they began to spill over into the larger galaxy."}, {"tag": "p", "text": "The pirate who was the mother of the Dawferim Evram Darkmere died around 30 BBY, during one of the long wars between the Botor Enclave and the Daupherm Planet States. By 10 ABY, the Botori Enclave and the Dawferim had engaged in a five-hundred-years-long small-scale feud that attracted renegades and scavengers from nearby star systems. Also by that time, the systems of the Botor Enclave grouped together and formed a protective federation due to the lack of a centralized galactic government and the continuing conflict between the Empire and the New Republic following the former's fragmentation at the Battle of Endor of 4 ABY. In the process, the Botor Enclave also declared its independence from both the Empire and the New Republic."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The Botor Enclave was inhabited by an ursine sentient species known as the Botori. The population of the Botor system around 25 ABY numbered between 100 million to 500 million. The Botor Income Ministry was an institution that operated in the Botor Enclave by the time the Battle of Endor was fought."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Botor Enclave consisted of approximately two dozen star systems, including the Botor and Kerensik systems, that were located within the fringes of a nebula. The Kerensik system contained the frozen planet Kerensik. It was the homeworld of Kane Griggs, who enrolled in an off-world university of the Galactic Empire years prior to 0 BBY."}, {"tag": "p", "text": "The territory surrounding the Botor system was widely explored between 15,000 BBY and 8000 BBY and it had become a part of the Galactic Republic by approximately 12,000 BBY. From approximately 17,000 BBY to 3956 BBY, the Botor system lay on the hyperlane known as the Hidakai Pool, which connected it to the Abregado and Daupherm systems. That hyperspace route, however, had ceased to exist by 1004 BBY."}, {"tag": "p", "text": "The Botor system remained within the boundaries of the Republic during the final phase of the New Sith Wars from 1004 BBY to 1000 BBY, and later during the Clone Wars of 22 BBY–19 BBY. During the first campaigns of the latter conflict, the Twentieth Army of the Republic was tasked with protecting the vicinity of the system against the military forces of the Confederacy of Independent Systems. By 17 BBY, the Botor system had been incorporated into the territory of the Empire. Forty-six years later, New Republic military forces passed through the system as part of the war effort against the extragalactic Yuuzhan Vong invaders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Botor Enclave was first mentioned in the 1993 Dark Empire Sourcebook, which was authored by Michael Allen Horne and published by West End Games' Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}