{"url": "Botor_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Botor Enclave star systems", "Category:Galactic Empire star systems"], "nodes": [{"tag": "h1", "text": "Botor system"}, {"tag": "p", "text": "The Botor system was located in the Core Worlds' Botor Enclave, a small territory of space that had joined the Galactic Republic by 12,000 BBY. At one point located on the Hidakai Pool hyperlane, the star system remained a part of the Republic during such conflicts as the New Sith Wars and the Clone Wars."}, {"tag": "p", "text": "Eventually, the system became a member of the Republic's successor, the Galactic Empire. The entire Botor Enclave declared its independence during the war between the Empire and the New Republic, and the military forces of the latter passed through the Botor system as part of the Yuuzhan Vong War in 29 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Botor system was located in the Southern Core portion of the Core Worlds. It was one of the approximately two dozen star systems situated on the fringes of a nebula within the Botor Enclave, a small area of space inhabited by the sentient Botori species."}, {"tag": "p", "text": "From approximately 17,000 BBY to 3956 BBY, the Botor system lay on the hyperlane known as the Hidakai Pool, which connected it to the Abregado and Daupherm systems. That hyperspace route, however, had ceased to exist by 1004 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The territory surrounding the Botor system was widely explored between 15,000 BBY and 8000 BBY. The Botor Enclave eventually accepted the status of an Allied Region of the Galactic Republic, and the area, including the Botor system, had become a part of the Republic by approximately 12,000 BBY and was considered a part of the civilized galaxy seven millennia later."}, {"tag": "p", "text": "The system remained within the boundaries of the Republic during the final phase of the New Sith Wars from 1004 BBY to 1000 BBY, and later during the Clone Wars of 22 BBY–19 BBY. During the first campaigns of the latter conflict, the Twentieth Army of the Republic was tasked with protecting the vicinity of the Botor system against the military forces of the Confederacy of Independent Systems."}, {"tag": "p", "text": "By 17 BBY, the system had been incorporated into the territory of the Galactic Empire, although the entire Botor Enclave declared its independence during the struggle between the fragmented Empire and the New Republic more than two decades later. The population of the Botor system numbered between 100 million to 500 million around 25 ABY. Four years later, New Republic military forces passed through the Botor system as part of the war effort against the extragalactic Yuuzhan Vong invaders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Botor system was first mentioned in the 2009 reference book The Essential Atlas, authored by Daniel Wallace and Jason Fry, which placed it in grid square K-12."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}