{"url": "Boulo_Siesi", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Artists", "Category:Bith", "Category:Females", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Boulo Siesi"}, {"tag": "p", "text": "Boulo Siesi was a female Bith artist who lived during the time of the Galactic Civil War. Cerca 1 ABY, Siesi resided in the town of Wayfar on the Outer Rim world of Tatooine where she created three works of art, titled Golden Petals 1, 2, and 3. All of these paintings were subsequently featured in the Museum of Tatooine by curator Lilas Dinhint."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female Bith artist by the name of Boulo Siesi lived during the time of the Galactic Civil War, a major conflict between the Galactic Empire and the Alliance to Restore the Republic. By the time following the Battle of Yavin, cerca 1 ABY, Siesi could usually be found near the cantina in Wayfar, a town on the Outer Rim Territories planet of Tatooine. While there, she created three paintings, titled Golden Petals 1, Golden Petals 2, and Golden Petals 3. Each painting featured a slightly different abstract rendition of flower petals."}, {"tag": "p", "text": "Meanwhile, in Tatooine's Imperial capital of Bestine, curator Lilas Dinhint oversaw the Museum of Tatooine, which served as the planet's only museum. Dinhint sought to enhance the museum's collection by offering visitors something new. To that end, the museum selected a small number of artists who would be approached for an opportunity to have their art featured in Bestine. Boulo Siesi was one of the artists to be considered, along with Vanvi Hotne, Giaal Itotr, Kahfr Oladi, Klepa Laeel, and Kolka Zteht. In order to have her paintings featured in Bestine, however, Siesi required enough votes to win over her fellow artists. Lilas Dinhint held a Bestine Museum art competition every thirty days, allowing for a period of fifteen days in between in which individuals could vote for their favorite artist."}, {"tag": "p", "text": "During the course of her artistry career, Siesi was approached by a number of spacers, many of whom voted for her as their artist of choice. Siesi won the art competitions at various times, allowing her the opportunity to display her paintings in Bestine's museum for a period of thirty days. During the time her paintings were displayed, the corrupt curator Dinhint offered schematics of the artworks in exchange for a \"modest donation\" of 48,000 credits. This allowed the opportunity for architecturally-inclined furniture makers and traders to mass-produce copies of Siesi's paintings so that they could be purchased, collected, or displayed for personal use."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Boulo Siesi had pink skin, and black-colored eyes. She had a philosophical outlook on life, and believed that people needed to open their mind in order to truly see the world around them. She was liable to be somewhat hostile towards individuals who she believed were close-minded. She detested the use of alcohol or spice as a means by which to alter one's mental state. Instead, she believed that people simply needed to open themselves up to new ways of experiencing the galaxy. She specialized in creating paintings of common subjects in abstraction. Her goal was not to replicate the look of her subjects, but to instead use their shapes to find higher art."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During her time as an artist in Wayfar, Siesi wore a grayish-brown sports wrap shirt and pleated skirt. She also wore a pair of gray hide boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boulo Siesi was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. She was added to the game on February 11, 2004 as part of Publish 6 The Imperial Crackdown. The update featured a new Bestine Museum event, in which players could vote for a number of NPC artists in order to have one of their paintings put up for display in the museum. Boulo Siesi was one of these artists, and players who chose to vote for her were required to first converse with her in Wayfar. If Siesi got the most votes, one of her paintings, either Golden Petals 1, 2, or 3, would be displayed for about a one month period, and players could purchase schematics of the paintings during a two week period for a fee of 48,000 credits. The winning artist depended on the player's input, however as the competitions were held monthly, this article assumes 100% game completion, and that Boulo Siesi won the right to display both of her paintings on at least several occasions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}