{"url": "Bound_for_Rescue", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Bound for Rescue"}, {"tag": "p", "text": "\"Bound for Rescue\" is the eighth episode of the Star Wars: The Clone Wars television series' fifth season. It aired on November 17, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"With Ahsoka captured by Hondo's pirates, the younglings work together to infiltrate the pirates' den, using their wits and courage to deceive Hondo Ohnaka and launch a daring rescue.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After some effort, the younglings on board the drifting Crucible manage to establish communication with the nearest available Republic fleet. Jedi General Obi-Wan Kenobi hails them and promises to send a rescue team to first pick up the stranded younglings, then go after Hondo Ohnaka and his pirate gang on Florrum to rescue their hostage Ahsoka. Determined to aid Ahsoka as soon as possible, Petro boldly announces that he and the others want to get to her first, but Obi-Wan vetoes this, for the sake of all their safety. But before he and his men can even start their rescue attempt, they suffer a surprise attack by a Separatist battle fleet led by General Grievous. When their ship is finally taken, Kenobi and Cody set its systems to self-destruct, forcing Grievous to retreat but ultimately leaving them unable to come to the aid of both Ahsoka and the younglings as they flee in escape pods."}, {"tag": "p", "text": "With additional time on their hands, the younglings finish the assembly of their lightsabers aboard the Crucible, with only Katooni being unable to ignite her weapon following its assembly due to an error. An overconfident Petro suggests that they mount a rescue mission by themselves, and his proposal is seconded by Gungi and Byph but vetoed by the level-minded Katooni. The results of Zatt and Ganodi's inspection of the ship's systems, however, suspends her disagreement: the engines' cooling system was critically damaged during their scuffle with the Weequay pirates, forcing them to land on the nearest habitable planet — which happens to be Florrum — to let the engines cool down, lest they explode if left unchecked."}, {"tag": "p", "text": "Leaving R2 and Ganodi to fix up Huyang and prepare the ship for a quick escape, the rest of the younglings set off toward the pirate base. On their way through the Florrum wastelands, the younglings happen to come across a traveling carnival troupe en route to Hondo's base to business. Passing themselves off as junior acrobats, they manage to persuade the show's proprietor, Preigo, to take them to the pirate base. Held captive by Hondo in the same location, a manacled Ahsoka suffers under the pirates' taunts. While she tries to persuade Hondo to release her, she learns from him that he intends to sell her to a certain \"business man\" who will pay \"handsomely\" for a female Jedi-dead or alive."}, {"tag": "p", "text": "When Preigo's troupe arrives later in the evening, Hondo joins the expectant audience under the company of Ahsoka. The younglings appear before Hondo, disguised, perform an entry act and finally get a drunken Hondo to join in on the next stunt. Unnoticed, Katooni steals back Ahsoka's lightsabers and frees the Padawan from her binders as the act is underway. As the young Jedi run for it, they are recognized by the pirates who then fire at them, but they manage to steal one of the pirates's speeders and make off for the Crucible. Fortuitously, the troupe decide to leave, fearing that Hondo will kill them for allowing the younglings to infiltrate them, and in starting up their ship, they inadvertently create a cloud of dust that delays immediate pursuit by the pirates. As the Jedi head back to their ship, Ahsoka expresses her gratitude to the younglings, admitting to them that, as her master had taught her, \"doing the right thing sometimes means bending the rules,\" and Petro contacts Ganodi and R2 to ready the ship for immediate takeoff."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"Bound for Rescue\" is the third episode in a four-part story arc, which was titled \"Young Jedi\" and previewed as a full-length 80-minute feature at Celebration VI in August 2012 to family viewers. It replaced \"Crisis at the Heart,\" originally reported by Star Wars Insider 134, as the eighth episode in Season Five. Some of the ideas in this story came from a scrapped pilot script for a spin-off TV series."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}