{"url": "Bounty_(episode)", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Bounty  (episode)"}, {"tag": "p", "text": "\"Bounty\" is the twentieth episode of the Star Wars: The Clone Wars television series' fourth season. This is the second episode in a four-part storyline about the fate of Asajj Ventress, the Nightsisters, and two of the Nightbrothers, which began with the previous episode \"Massacre.\" It aired on March 2, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"An aimless Asajj Ventress joins a team of bounty hunters under the leadership of young Boba Fett. On an alien world, they undertake a dangerous but profitable mission that tests the limits of their skills, and the strength of Asajj's character.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "With her past life lying in shambles at her feet, Asajj Ventress's aimless drifting finally comes to a temporary halt in a seedy spaceport tavern on Tatooine, where she begins to drown her sorrows in alcohol. One of the patrons makes a pass at her, and when he does not take kindly to her rebuffs, Ventress is forced to emphasize her point with her lightsaber. Upon this, she is invited by two bounty hunters, Bossk and Latts Razzi, for a drink and a business proposition: The fellow Ventress has just killed, Oked, was their hired partner for an assignment on Quarzite. Now that he is dead, the bounty hunters need a replacement, and so they threaten to deliver Ventress to the authorities unless she takes Oked's place in the mission. Needing money to get by anyway, Ventress agrees to participate."}, {"tag": "p", "text": "Ventress then meets the rest of their partners: Dengar, C-21 Highsinger, and the team's leader, Boba Fett, with whom Ventress clashes with immediately about his youth and the resultant lack of skill she perceived came with it. Nevertheless, the six of them proceed to an orbital elevator station above Quarzite to meet their employer, Major Rigosso, and receive the details of their assignment. The six of them were commissioned to protect the contents of a large chest, which is to be delivered to Quarzite's despotic ruler, Otua Blank, via the orbital station and a subtram because the planet's atmospheric pressure renders a more conventional delivery by spaceship impossible. The chest is sought after by a band of raiders, which is why the bounty hunters were hired as additional protection. With these details and the chest under their supervision, Rigosso and Boba's team embark on their journey."}, {"tag": "p", "text": "Soon after their departure, the raiders board the train in mid-run and attack the escort. In the following struggle, Rigosso and the Quarzite guards are slain, and most of the bounty hunters are thrown off the train one by one, leaving only Boba and Ventress to contend with the raiders and their leader. While struggling with the leader, Boba inadvertently tips the chest over, revealing its contents to be a young woman by the name of Pluma Sodi. As it turns out, she is to be forcibly wed to Otua Blank, and the raiders' leader is her brother Krismo, who has come to save her from this dire fate. Before the siblings can get away, Ventress arrives on the scene and uses her abilities to subdue Krismo. But as the tram continues its journey, Pluma pleas her plight to Ventress, her entreaty about the unfairness of being ripped from her home seemingly striking a chord with Ventress. She and Boba begin to argue about their part in the mission and their share of the bounty; tempers quickly flare, and Ventress ends up Force-choking Boba."}, {"tag": "p", "text": "The tram arrives at its final destination, where Otua Blank is eagerly awaiting his prize. Ventress delivers the chest and collects the bounty before departing, but as Otua Blank opens the chest, his eyes are met with the sight not of his bride-to-be, but a bound, gagged and very angry Boba Fett. While the tram makes its journey back to the elevator station, Ventress releases Pluma into Krismo's care - after charging an additional fee for her safe return - before she regroups with the other bounty hunters at their ship. She delivers the bounty in full, after subtraction of her own agreed share, then parts company with the bounty hunters, but with a more mellowed disposition in her life and a stronger confidence in what the future may yet hold for her."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The episode's Director's Cut was included in the Star Wars: The Clone Wars The Complete Season Four DVD."}, {"tag": "p", "text": "The comic Mandalorian Memories serves as a prequel to the episode, though the comic is considered part of the Legends continuity."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}