{"url": "Bounty_Hunted", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "Bounty Hunted"}, {"tag": "p", "text": "\"Bounty Hunted\" is the sixth episode the animated micro-series Star Wars: Forces of Destiny' second season. It was released on March 19, 2018."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Seeking help to free Han from Jabba, Leia, Chewbacca, and R2-D2 travel to Ord Mantell to meet with Han's old friend Maz Kanata. Maz lures bounty hunter Boushh into a firefight so Leia can obtain his helmet and armor for a perfect disguise."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After their escape from Cloud City, Princess Leia Organa, Chewbacca, and R2-D2 travel to Ord Mantell to meet an old friend of Han Solo. Leia asks Chewbacca if they can trust this old friend and he roars in affirmation. Leia remarks that this place is \"charming\" and asks too hooded figures where she can find Maz Kanata. The two figures part to reveal Maz, who is squatting by a crate. She is delighted to see her boyfriend Chewbacca and allows the Wookiee to carry and hug her."}, {"tag": "p", "text": "Maz recognizes Leia as Han's friend and asks what happened to Han. Chewie tells Maz that he was frozen in carbonite. Maz walks away but Leia tells her that Chewie said she could help them in a tight spot. When Leia asks what is the plan, Maz counsels patience and tells Leia that the solution will present itself. At that moment, they are fired upon by the Ubese bounty hunter Boushh. While hiding behind a crate, Maz reassures Leia that is the solution. As Leia asks how, Maz replies that she needs a disguise and that a bounty hunter is perfect."}, {"tag": "p", "text": "Leia and Chewie exchange fire with Boushh while R2-D2 activates a nearby crane. Leia manages to shoot the blaster out of Boushh's hands. Boushh charges at Leia with his shock blade-tipped lance. Leia grabs Boushh's lance and the two face-off. At that point, R2-D2 whistles. Leia backs away as the crane slams Boushh against a wall. Boushh tries to activate his thermal detonator, but Maz knocks him unconscious with her electrostaff. Maz says that Boushh's armor would fit Leia, while Leia adds that a thermal detonator would come in handy."}, {"tag": "p", "text": "Later, aboard the Millennium Falcon, Leia thanks Maz for her help and admits that she was not what she was expecting. Maz replies that she very rarely is and tells Chewie that she likes Leia. She tells Chewie to tell Han that Leia is a keeper."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "At the 0:14 mark, figures resembling Jaxxon and Skorr, the latter of whom is the Legends \"bounty hunter we ran into on Ord Mantell\", can be seen on screen."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}