{"url": "Bounty_Hunters%27_Guild", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bounty Hunters' Guild"], "nodes": [{"tag": "h1", "text": "Bounty Hunters' Guild"}, {"tag": "p", "text": "The Bounty Hunters' Guild (BHG), also known as the Bondsman's Guild or simply the Bounty Guild, was an institution that regulated the complicated profession that was the bounty-hunting trade throughout the galaxy. Ensuring the legality of hunting for its members, it worked alongside galactic governments and curated bounties for its members. From the Republic Era to the New Republic Era, the Guild operated with members of various species and droid models, both with loyal and independent programming, and had a Code that hunters were mandated to stand by. During the Galactic Civil War and into the time of the New Republic, the Bounty Hunters' Guild had close ties to the Galactic Empire and its remnants, although it turned to favor the Resistance during the Cold War due to the First Order's reluctance to deal business with its hunters."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Legality"}, {"tag": "p", "text": "During the time of the Galactic Republic and its successor, the Galactic Empire, proper certification was required in the bounty hunting profession to ensure the legality of the processes involved, specifically the handling of wanted quarry and the delivery of a posted bounty by the issuing authority. Working alongside galactic governments, the Bounty Hunter's Guild, abbreviated to \"BHG,\" expedited much of the bureaucratic hassle required to obtain the necessary legal permits for Guild members, allowing them to hunt across the galaxy with an official license. In the Imperial Era, the Imperial Office of Criminal Investigations had an entire branch dedicated to working with the guild, and wealthy Moffs were willing to pay hunters to handle their issues."}, {"tag": "h3", "text": "Guild hubs"}, {"tag": "p", "text": "The Bounty Hunters' Guild maintained hubs on worlds such as Carajam and Nevarro that functioned as a cantina. Installed with a droid detector at its entrance, the cantina was populated with a multitude of species, including Cerean, Ithorian, Kel Dor, Morseerian, Neimoidian, Rodian, Togruta, and Trandoshan patrons. A Rutian Twi'lek served as an agent of the Guild, liaising with hunters on Guild bounties at the cantina's central bar. The Empire preferred to pay hunters by transfer register instead of hard currency, and after a successful hunt, Guild members could be payed directly to their account by the Guild agent, although the Twi'lek offered to deduct from Boba Fett's payout for a special deal on the Jorgan Spa, which she thought the hunter deserved. Bounties at Guild hubs were identified through holograms beside the bar. Larger bounties were advertized on poster; such was the case for the quarry Zingo Gabnit, on whom the Rutian agent provided additional information to Fett."}, {"tag": "p", "text": "On Imperial worlds, posting agencies were established as offices for bounty hunters. Posting offices were installed with computer consoles that permitted hunters to accept Galactic Empire–issued bounties, and individuals were employed at booths in posting agencies to oversee the offices, as well as to restrict research on the Imperial Enforcement DataCore to ranking Imperial officers and licensed bounty hunters."}, {"tag": "h3", "text": "Membership"}, {"tag": "p", "text": "The Bounty Hunters' Guild's membership was composed of bounty hunters of various species as well as independent droid models. In addition to recruiting hunters, Guild employed the services of bail bondsmen, individuals who brokered bounties with hunters. Serving as the intermediary between the hunters and the client, a bondsman offered jobs and paid out upon a successful hunt. Around 9 ABY, five years after the definitive fragmentation of the Empire at the Battle of Endor, Greef Karga was responsible for the bounty hunting trade on the planet Nevarro—a hub of the Guild in the early days of the New Republic—operating as a Guild expeditor and working as a middle-man between clients and hunters."}, {"tag": "p", "text": "Bounty hunting droids made ideal business partners for their internal toolsets, which could apply healing bacta sprays to organics or lift heavy objects. Bounty droids were also physically tougher than most organics, and approached their trade with machinelike efficiency, providing a potentially lifesaving alternative to living hunters when tracking down high-risk suspects. However, like many other droids, bounty hunting droids struggled with ambiguity and had a slavish regard for the rules, making them potentially ill-suited for the more complicated intricacies of the profession. Additionally, their programming forbid them from being captured, and bounty droids would engage their self-destruct protocols when if they thought apprehension was imminent. Droids from the IG family either served as private security or freelance members of the Guild. IG-11 was a fully-fledged member of the Guild, and although the hunter followed a strict programming as a bounty droid, IG-88, one of a set of five identical assassin droids manufactured by Holowan Laboratories who slaughtered their constructors and escaped their laboratories into the wider galaxy, had independent programming, and was feared in his bounty hunting career."}, {"tag": "p", "text": "Leadership within the guild was subject to elections. In the lead-up to guild elections, high-level communications containing holographic advertisements were sent out by various candidates to other guild members. Guild hunter Bossk ignored such communications as they swamped his inbox, and removed them as they appeared."}, {"tag": "h3", "text": "Acquisitions"}, {"tag": "p", "text": "The Guild regulated bounties that included criminals, thieves, murderers, and even bounty hunters. Zingo Gabnit, whom the Guild offered 100,000 credits for, was a bounty hunter who was listed by the Empire as a rebel collaborator, and, most importantly to the Guild, violated the Bounty Hunter Code."}, {"tag": "p", "text": "The Galactic Empire was a major client of the Guild. For high-level bounties, the Empire contacted guild hunters individually, with their bounty hunter selection based upon Guild recommendation. Bossk was offered a high-level bounty personally posted by Darth Vader, and while he could not locate the designated rendezvous coordinates with Vader's flagship due to technical difficulties, Bossk did not request the guild to help him pinpoint the Imperial address that sent him Vader's offer for fear of relaying his interest to the guild, which risked competition with other guild hunters if they were to be alerted to the bounty."}, {"tag": "h3", "text": "The hunt"}, {"tag": "p", "text": "The regulatory body of the complicated bounty hunting trade, the guild curated bounties for its members. Quarries were identified in individual holopucks, simple holographic devices that displayed an image of the quarry, their name, and the bounty payout. Used alongside a tracking fob, the information on the puck allowed Guild members to hunt down their quarry to the edge of the galaxy. Upon picking up such devices at Guild hubs, Guild hunters accepted the bounty and proceeded to their hunt."}, {"tag": "p", "text": "Members of the Guild were required to follow the Bounty Hunter Code, and, during the reign of the Empire, the guild was given authority by the Imperial Office of Criminal Investigations to issue Imperial Peace-Keeping Certificates, which allowed its holder to operate as a licensed hunter on Imperial worlds and access to the Imperial Enforcement DataCore at posting agencies."}, {"tag": "h3", "text": "The Code and other policies"}, {"tag": "p", "text": "Members of the guild were mandated to uphold the Bounty Hunter Code, which forbade members to slay another guild hunter, or steal another hunter's bounty. The Code also forbade hunters from asking about their bounties once delivered, requiring that events that transpired between the time of accepting and delivering the bounty be immediately forgotten. Additionally, when the guild assigned one of its members to pursue the subject of a government bounty, only that particular hunter was authorized to go after that particular acquisition. Although such restrictions were guild policy, Beilert Valance was a guild member who was known for flouting the Code. While the Guild's bureaucracy held members in check over policies, the Unbroken Clan criminal syndicate's General Vukorah had the ability to circumvent the bureaucracy by means of credits."}, {"tag": "p", "text": "Even by the aftermath of the Alliance to Restore the Republic's decisive victory at the Battle of Yavin, no official policy was published by the guild on accepting rebel jobs. As a result, Cynabar's InfoNet recommended to independent hunters willing to risk working with the Alliance to deal with third-party bounty brokers only."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "Bossk, a Trandoshan known for hunting Wookiees, was a member of the Bounty Hunters' Guild during the Clone Wars. Such information was known to the Jedi Master Quinlan Vos, who specialized in undercover operations."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "In the Imperial Era, the Bounty Hunters' Guild was allowed to issue Imperial Peace-Keeping Certificates to their bounty hunters, allowing them access to the Imperial Enforcement Datacore. Guild member Bossk took on bounties in Imperial territory, with one hunt involving a partnership with a street orphan named Ezra Bridger that resulted in the Imperial HoloNet News reporting of the Guild member's \"courageous\" actions, publicising Bossk as a hero of justice."}, {"tag": "p", "text": "During the Galactic Civil War, Alliance Intelligence agent |Cassian Andor gave an assessment of the Guild to General Davits Draven in The Rebel Files. In search of allies, the Rebel Alliance found that, through a rebel agent in the Guild, sentiment was trending negative amongst hunters regarding the Rebel Alliance, and as the Empire made greater use of Guild services against the Rebellion, Andor reported in conclusion that \"Cradossk is making a killing,\" and that the Alliance should seek other factions for support in their fight for freedom. After being discharged from Imperial service, Beilert Valance became a bounty hunter and began stealing bounties from members of the Guild, breaking the Bounty Hunter Code. Xonr, a member of the Guild, attempted to confront him along with several other bounty hunters over the stolen bounties. Valance, who had in fact lured them there, proceeded to kill them. In the aftermath of the Battle of Hoth, Darth Vader personally posted a bounty on the Millennium Falcon, a rebel vessel, attracting the guild hunters Bossk, Dengar, Boba Fett, IG-88, 4-LOM, and Zuckuss, all of whom were invited to the Imperial Super Star Destroyer Executor's bridge. The leader of Vader's personal starfleet, Admiral Firmus Piett, expressed his aversion to the Empire's employment of the guild hunters, declaring them as \"scum\" to a subordinate whilst on duty aboard the Executor's bridge."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "h4", "text": "The Mandalorian and the Child"}, {"tag": "h5", "text": "Hunt for the Child"}, {"tag": "p", "text": "Following the Empire's major defeat in Battle of Endor in 4 ABY, the Rebel Alliance reformed into the New Republic. Believing the bounty hunting trade was now under threat thanks to the new government, Dengar wanted to form a proper bounty hunter union. His prediction began to come true in 5 ABY in the aftermath of the attack on Chandrila, as the New Republic, trying to make sure its security forces look strong, stopped hiring bounty hunters. Later that year, the Empire fell in the Battle of Jakku. By around 9 ABY, the Bounty Hunters' Guild had operations on the volcanic world of Nevarro and was no longer operating on Tatooine. Greef Karga ran the operations from the cantina in the city."}, {"tag": "p", "text": "Around 9 ABY, all of the bounty hunters operating from Nevarro were hired by a member of an Imperial remnant known as \"the Client\" to capture or kill a target known as \"the asset.\" The asset was being held by a company of Nikto mercenaries at their encampment on Arvala-7. Two Guild members, the droid IG-11 and a Mandalorian named Din Djarin, arrived at the encampment and killed the mercenaries. The pair discovered that the asset was an infant of the same species as the Jedi Grand Master Yoda. Although the Mandalorian wanted to extract the Child alive, IG-11 intended to kill it, so Djarin shot him in the head to protect the Child."}, {"tag": "p", "text": "Taking the Child back to his ship, the Mandalorian was attacked by three Trandoshan bounty hunters, who were also from the Guild to kill the Child. Djarin defeated the bounty hunters, and after having to repair his ship, returned to Nevarro to hand the Child over the Client. The rest of the Guild despised the Mandalorian for bringing the Child back first, though Karga praised him as his best bounty hunter."}, {"tag": "p", "text": "However, having become attached to the Child, Djarin returned to the Client's facility and stole the infant back. After finding their tracking fobs were activating again, the members of the Guild on Nevarro confronted the Mandalorian, spearheaded by Karga. Djarin fought them, killing several before he was pinned down. His Mandalorian allies then arrived and began gunning down the other other bounty hunters. Karga attempted to seize the Child at the Mandalorian's ship but was shot by the Mandalorian, who escaped the planet."}, {"tag": "h5", "text": "Imperial takeover"}, {"tag": "p", "text": "With Djarin on the run with the Child, the Client took over Guild operations on Nevarro, occupying the city. Bounty hunters were sent out to track the pair. A Kubaz bounty hunter was able to find them on the planet Sorgan, but was shot by the former rebel shock trooper Cara Dune. The bounty hunter Riot Mar also found the Mandalorian and chased him in his Bounty Hunter Fighter. Djarin, though, maneuvered behind Mar and destroyed his ship with him inside."}, {"tag": "p", "text": "With Djarin having evaded the Guild's bounty hunters so far, Karga contacted him, pretending to want to betray the Client. In reality, he planned to kill the bounty hunter and take the Child for the Client. Bringing three loyal Guild members with him, Karga met with the Mandalorian in the Lava fields on Nevarro. Djarin brought his own backup, Dune and the Ugnaught Kuiil, and so the two parties began traveling for the city and set up camp for the night. That night, they were attacked by a number of native reptavians, which took away one of Karga's bounty hunters. Karga was poisoned by one of them, but was saved when the Child used Force healing on him."}, {"tag": "p", "text": "Because of the former night, Karga had a change of mind. The next day his final two bounty hunters made their move to kill the Mandalorian while they looked towards the city on Nevarro. Karga swiftly killed both of them, and revealed to Djarin that his original plan to kill him. The Mandalorian then decided to do the plan Karga initially intended to do which included killing the Client. Karga brought Dune and a cuffed Djarin to the city's cantina and to the Client. However, before they could kill him, the Client's superior, Moff Gideon, had his death troopers kill them before confronting Karga and the others with a battalion. Though Karga and his allies engaged the stormtroopers after being reinforced by IG-11, who had been reprogrammed by Kuill and, because the Ugnaught had been killed by Imperial scout troopers, was carrying the Child with him, they were forced to retreat back into the cantina. Escaping into the Nevarro sewers to get to the Mandalorian covert, they instead found that the Mandalorians had been massacred, so Djarin confronted Karga, demanding to know if the guild was behind the genocide. Karga told him that was not the case, telling him that the bounty hunters had retreated from Nevarro after the Child's rescue, and the Armorer soon arrived. She confirmed that Karga was telling the truth and revealed that the Imperials were behind the massacre."}, {"tag": "p", "text": "As they were meeting with the Armorer, who gave Djarin the task of finding the Child's species and a jetpack, IG-11 took out an advance Imperial team that had entered the sewers. With the exception of the Armorer, they then left to escape to the lava fields on a boat, but Djarin spotted a platoon's worth of stormtroopers at their exit. Following his new nanny droid programming to protect the Child and not allow himself to be captured, the former bounty droid IG-11 self-destructed to take out the Imperial troops. Afterward, Gideon arrived in his Outland TIE fighter, but Djarin used the jetpack to reach the starfighter before taking it down with a bomb. Djarin then met with his comrades, with Karga, impressed by the hunter's actions, saying his bounty rates had now increased. Dune, who intended to stay on Nevarro, and Karga both felt that the planet had been cleared of its Imperial occupiers. As such, Karga believed that the guild could return the planet, which he felt would make it respectable once again. Though Djarin felt differently, stating that the world would again become a bounty hunter hive, Karga responded by saying that some of his favorite people were hunters. He offered Dune a place in the guild as his enforcer and gave Djarin the chance to rejoin, telling the Mandalorian that he would now have access to any job he wanted. Djarin instead declined, instead leaving to find the Child's species as the Armorer had instructed."}, {"tag": "p", "text": "As he and the infant left the planet, Karga and Dune were walking back to Nevarro city. Unknown to them all, Gideon had survived the crash of his TIE and his remnant continued operations in an Imperial base located away from the city. Rather than let it become a home to the Guild once more, Karga and Dune, who became the city's marshal, focused on cleaning up the planet to make it respectable. In fact, the cantina where the bounty hunters had once met was transformed into a school."}, {"tag": "h4", "text": "Distancing from the shattered Empire"}, {"tag": "p", "text": "By the time of the Resistance, the Bounty Hunters' Guild had reformed into an organization Resistance Vice Admiral Amilyn Holdo saw as a potential partner against the First Order, an Imperial remnant with strong idealogical beliefs that the fellow Resistance member, Caluan Ematt, speculated to be the reason behind the Order's reluctance to do business with the guild. With reservations, Ematt agreed with Holdo's comment in The Rebel Files that the Resistance could form a successful partnership with the guild."}, {"tag": "p", "text": "Decades prior, with the Empire's defeat in the Battle of Endor, the Guild hunter Seleno Chandro eventually left the organization as he gained a reputation for capturing Imperial fugitives. This reputation had left the former Guild hunter paranoid of First Order reprisals, although Chandro heeded the Resistance's call for assistance over Exegol and aided in the destruction of the Sith Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Bounty Hunters' Guild was first mentioned in the 2014 canon junior novel Ezra's Gamble, written by Ryder Windham. It first appeared in Chapter 1 of Jon Favreau's 2019 television show The Mandalorian, directed by Dave Filoni, which aired on November 12, 2019. The Guild originated in the 1998 Star Wars Legends novel The Mandalorian Armor, written by K. W. Jeter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}