{"url": "Bounty_Hunters%27_Creed", "categories": ["Category:Legends articles", "Category:Bounty Hunters' Guild", "Category:Bounty hunters", "Category:Doctrines"], "nodes": [{"tag": "h1", "text": "Bounty Hunters' Creed"}, {"tag": "p", "text": "The Bounty Hunters' Creed were the unwritten rules of the bounty hunters."}, {"tag": "p", "text": "All bounty hunters were required to abide by these guidelines. A bounty hunter who failed to uphold these rules would undergo termination of their bounty hunting license."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Most hunters adhered, to some degree, to an unwritten code of ethics which, when spoken of at all, was referred to as the \"bounty hunter's creed.\" While the exact wording of these tenets varied from planet to planet, the Creed served as a loosely defined set of enforceable principles, by which hunters conducted their trade and lived out their lives."}, {"tag": "p", "text": "This rule emphasized that, no matter how great a reward, a hunter should never take any undue risks to his or her life in order to make a capture. They should also consider how much of a risk whichever bounty was going to be and to plan accordingly. (Of course, how much effort a hunter had put into pursuing a quarry, how great the reward, and if was worth the risk were all open to interpretation in the middle of a hunt.) A reward, even if enormous, could not be spent if a hunter was dead."}, {"tag": "p", "text": "This single, cardinal rule, more than any other, defined the way in which bounty hunters approached their chosen profession. It reflected the idea that sapient beings, to some degree, must be accorded respect. If, however, an individual had a bounty placed on them, he or she ceased to be an individual with rights. No longer a member of the galactic community, the \"acquisition\" became fair game. Tears should never be shed over the fate of someone that was, after all, only an \"acquisition.\""}, {"tag": "p", "text": "In keeping with the loosely defined hunter code of ethics, killing was sometimes necessary. That was business, pure and simple. However, unnecessary killing was still murder. The hunter, unless otherwise directed by those leveling the bounty, must attempt to deliver the acquisition alive. Often, those leveling the bounty had a vested interest in a live target — and the target might have been better off getting killed by the hunter."}, {"tag": "p", "text": "Simply put, whatever their origin, bounty hunters saw themselves as a special breed. They took their lives (and those of others) into their hands each time they hunted. One may agree with another hunter's motives or insult them for the manner in which they carried out their hunts, but no bounty hunter would ever take up arms against a fellow hunter. This law applied only to hunters who followed the creed, not to those who had a bounty posted on their head becoming merely acquisitions. In such cases, the ex-hunter was no longer seen as a member of the common fellowship and old scores could now be settled with impunity."}, {"tag": "p", "text": "While it was not unheard of for hunters to work as a team, the hunt for a given acquisition was most often seen as a form of personal duel between two sapient creatures. In such a deal, the hunter matched skill and courage against all the resources one's opponent could bring to bear. If the hunter won, it was a personal triumph denoting superior skill and intellect, and not simply a question of luck. To interfere with another's hunt, unless first invited, was to leave the question of \"who is better\" open and, perhaps forever, unresolved. Of course, competition between hunters was often fierce and there was often a very thin line between \"competition\" and \"interference\". This being true, while a hunter was constrained against taking direct action against another hunter, there was nothing to constrain a hunter from hiring others to do the dirty work. Of course, if such an action, successful or not, could be traced back to the original perpetrator, serious consequences inevitably followed."}, {"tag": "p", "text": "In cases where the acquisition had been taken alive, that \"choice\" could not be altered. To kill an acquisition in the course of the hunt was one thing, but to purposely kill an unarmed, helpless being already subdued and unable to resist was seen as simple slaughter and wanton butchery. An acquisition \"killed while attempting to escape\" however, would be an entirely different matter altogether."}, {"tag": "p", "text": "While no hunter had the right to interfere with another's hunt, there came times when even the best of master hunters required assistance. In extreme cases, any hunter could have asked for and expected aid and assistance from another hunter, even if it meant that the latter must temporarily suspend his or her own hunt in the meantime to render such aid. Whatever personal grievances or animosities that would be involved between the two parties, it is known and understood that hunters took care of their own. Of course, such assistance was not without its price tag, and the arbitration of payment after the fact could often put a substantial dent in any expected profit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}