{"url": "Bounty_Hunters_(episode)", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Bounty Hunters  (episode)"}, {"tag": "p", "text": "\"Bounty Hunters\" is the seventeenth episode of Season Two of the Star Wars: The Clone Wars television series. It aired on March 27, 2010 in the UK and April 2, 2010 in the US."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano form an uneasy partnership with four deadly Bounty hunters to help protect a local farmer from Hondo Ohnaka and his band of pirates."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A Jedi shuttle carrying Anakin Skywalker, Obi-Wan Kenobi, and Ahsoka Tano emerges from hyperspace to investigate the disappearance of a medical station orbiting over the fungi-world of Felucia. They immediately encounter an orbital Vulture droid deployer. The vulture droids attack the shuttle and force it to crash-land on Felucia. The Jedi eject from the ship once it enters the atmosphere and once the survival pods land, they look for civilization. They then find a nysillin spice farm village. It appears deserted after searching in the houses. They then find a ship in a barn. Anakin and Ahsoka discover Felucian farmers and their families in one of their houses hiding in the cellars. Anakin and Ahsoka are then surrounded by four heavily armed bounty hunters named Sugi, Embo, Rumi Paramita, and Seripas. Obi-Wan then joins in, but the village elder, Casiss, persuades the bounty hunters and the Jedi to stand down and listen to his village's plea for help. Casiss tells them that they paid the bounty hunters for protection against pirates who raid their village, demanding it as tribute. He also says that with the Jedi now there, the bounty hunters can fight the pirates off. Obi-Wan replies that he would like nothing better than to help the farmers, but their first priority was to find a ship and report the destruction of the medical base. Obi-Wan adds that doing so would only attract more Separatist attention, which would be much worse than pirates. Just then, some of the pirates arrive, demanding their portion of the nysillin. Anakin and Obi-Wan are surprised to see the opponent is none other than Hondo Ohnaka."}, {"tag": "p", "text": "Hondo acts friendly with the Jedi, then attempts to buy off the bounty hunters, although they refuse, stating they don't break deals. Obi-Wan says that he would pay the pirates to take them to Republic territory, but Hondo refuses, knowing that the Jedi would pay in Republic credits which have no value in the Outer Rim. Hondo tells the farmers to hurry up before the crops die. Obi-Wan then devises a plan, but Dilanni says they do not have enough men. Anakin states that the villagers would have to fight too. Following this, everyone begins preparing--putting up defenses, harvesting, and training. Meanwhile, Dilanni furthers his doubt by pointing out that the farmers weren't soldiers and lack the essential weapons for the upcoming conflict. Anakin proceeds to demonstrate that their farming tools can be used as weapons. Meanwhile, Ahsoka shows the farmers how to use slingshots against the pirates. Seripas, while cutting down a giant fungus, is nearly crushed to death, though Ahsoka is there to save him. Seripas then reveals that he is actually small and that he wears a suit to make him more intimidating. Ahsoka reassures him, giving him confidence and aiding in his esteem. Soon after, a pirate scout spies on the farmers during their training. Sugi spots him and orders Embo to take care of it. He shoots the pirate's speeder, causing it to explode. He then kills him, prompting Hondo to attack. The bounty hunters and Jedi manage to withstand the onslaught. Hondo then arrives with a tank that kills Rumi and injures Embo. In response, Anakin attacks Hondo and manages to knock him off the cliff. He begs for mercy as Anakin pulls up. Concluding that that the effort is \"no longer profitable,\" he retreats. With the battle over, Sugi agrees to give the Jedi a ride back to the Republic."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The episode is dedicated to Japanese filmmaker Akira Kurosawa, one of George Lucas' favorite film makers and largest inspirations. Kurosawa was the director, producer, and co-writer of such films as The Hidden Fortress and Seven Samurai, to the latter of which this episode is an homage. Like Seven Samurai, this episode features a group of seven heroes who are defending an otherwise defenseless town against a much larger group of invaders. Both the Samurai and the Jedi, knowing they are outnumbered, teach the villagers how to fight and defend their homes."}, {"tag": "p", "text": "Like \"Senate Murders\" and \"Cat and Mouse,\" \"Bounty Hunters\" was shown in Canada and the UK one week before it aired in the United States."}, {"tag": "p", "text": "Ohnaka's line, \"Speak softly, and drive a big tank,\" is a reference to Theodore Roosevelt's foreign policy: \"Speak softly, and carry a big stick.\"[source?]"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}