{"url": "Bounty_Hunters_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Bounty Hunters"], "nodes": [{"tag": "h1", "text": "Bounty Hunters 1"}, {"tag": "p", "text": "Bounty Hunters 1 is the first issue of the canon comic book series Star Wars: Bounty Hunters. It was written by Ethan Sacks, illustrated by Paolo Villanelli, and published on March 11, 2020 by Marvel Comics."}, {"tag": "p", "text": "The issue features the story \"Galaxy's Deadliest Part 1: Ghosts of Corellia,\" in which Nakano Lash, the treacherous mentor of bounty hunter Beilert Valance, resurfaces."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "VALANCE'S FIRST APPEARANCES, ALSO AVAILABLE- NEVER BETRAY A BOUNTY HUNTER – ESPECIALLY IF IT'S BOBA FETT! Years ago, VALANCE and fellow bounty hunters BOSSK and BOBA FETT took on a mission that went sideways in a bad way after Valance's mentor, NAKANO LASH, violently betrayed them. Valance's team barely escaped with their lives. He never thought he'd face his old mentor ever again-until Lash finally resurfaces under mysterious circumstances. Every bounty hunter in the galaxy wants a piece and Valance is hell-bent on getting to the prize first. He has score to settle-but so does Boba Fett! ETHAN SACKS (OLD MAN HAWKEYE and GALAXY'S EDGE) and PAOLO VILLANELLI (VADER: DARK VISIONS and JEDI FALLEN ORDER - DARK TEMPLE) are teaming up to bring you the bounty hunter adventure you've been waiting for this March!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Despite having previously worked together in the Star Wars: Darth Vader comic series, set before the events of this issue, Bossk and Chelli Aphra are presented here as meeting for the first time."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}