{"url": "Bounty_hunter", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Bounty hunters", "Category:Law enforcement occupations", "Category:Service occupations"], "nodes": [{"tag": "h1", "text": "Bounty hunter"}, {"tag": "p", "text": "Bounty hunters were individuals who could be hired to capture or kill a designated target. The target would have a price or bounty on their heads that would be collected by the bounty hunter upon successful capture or proof of death. Bounty hunters would sometimes team together as part of a larger mission or to handle dangerous targets."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A bounty hunter was an individual who could be hired to capture, hunt or eliminate a designated target if such target had a price or bounty on their heads that could be collected by the bounty hunter, either capturing or killing the target, depending on their clients' wishes. For the right price, most bounty hunters had no morals and did everything for the money. Aside from the highest bidder, bounty hunters were only loyal to themselves."}, {"tag": "p", "text": "Some bounty hunters acted like mercenaries and were hired to do jobs other than tracking down bounties. Hutts often kept these mercenary hunters on retainer so as to have more experienced and capable bodyguards protecting them; Jabba the Hutt was one such Hutt who kept several renowned hunters with him or within Hutt palaces throughout the Clone Wars and the Galactic Civil War."}, {"tag": "p", "text": "Independent-minded droids could also act as bounty hunters, to the dismay of the organic bounty hunting professional known as \"the Mandalorian,\" who simply referred to one, the assassin droid IG-11, a \"bounty droid.\" In cases such as the Haxion Brood Bounty Droid, droids could be reprogrammed to assist hunters in their work."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the last years of the Galactic Republic, Jango Fett was hired by Darth Tyranus to be the genetic template for the Grand Army of the Republic. During the Clone Wars, El-Les and Bric were hired to help train the clone troopers."}, {"tag": "p", "text": "By the reign of the Galactic Empire, many bounty hunters were affiliated with the Bounty Hunters' Guild, which was authorized by the Imperial Office of Criminal Investigations to issue Imperial Peace-Keeping Certificates, which gave bounty hunters access to the Imperial Enforcement DataCore."}, {"tag": "p", "text": "Following the Battle of Endor, the Zabrak bounty hunter Jas Emari attempted to collect New Republic bounties on the Imperial officers Admiral Rae Sloane, Grand Moff Valco Pandion, General Jylia Shale, the financier Arsin Crassus, and the Imperial adviser Yupe Tashu. Emari subsequently joined Norra Wexley's team and played a role in the rebellion on Akiva. In the months after the events of Endor, the bounty hunter Dengar predicted that the new government would start forcing bounties on other bounty hunters."}, {"tag": "p", "text": "In 5 ABY, Grand Admiral Sloane later hired the bounty hunter Mercurial Swift to assassinate Vice Admiral Perwin Gedde and to rescue Commandant Brendol Hux and his son Armitage Hux from Arkanis under orders from Fleet Admiral Gallius Rax. After the Liberation Day attack on Chandrila, the New Republic began denying services to bounty hunters in response to mass paranoia following the attack."}, {"tag": "p", "text": "Later, Swift decided to collect the Black Sun crime lord Gyuti's bounty on Jas Emari. He hired Dengar, Embo, and Jeeta as his crew. However, Emari managed to turn Swift's crew against him by convincing them that the New Republic would reward them for helping to hunt Grand Admiral Sloane. Due to their services during the Battle of Jakku, Dengar, Embo, and Jeeta received full pardons and some money from the New Republic. They then joined Emari's crew."}, {"tag": "h2", "text": "Stance"}, {"tag": "h3", "text": "Work with the Hutt Clan"}, {"tag": "p", "text": "From before the Clone Wars bounty hunters had notably worked for the Hutt Clan. For example, Cad Bane and his team freed Ziro the Hutt from prison, and Sugi and Embo protected the Hutt Council when the renegade Sith Lord Maul and Death Watch attacked."}, {"tag": "h3", "text": "Work during the Clone Wars"}, {"tag": "p", "text": "Prior to the outbreak of the Clone Wars, the Sith Lord Darth Tyranus hired Jango Fett to be the clone template for Kamino's Clone Army. Tyranus then hired Fett and Zam Wesell to assassinate Senator Padmé Amidala of Naboo at the behest of Trade Federation Viceroy Nute Gunray. Tyranus's master, Darth Sidious hired Cad Bane to steal a Holocron from the Jedi Temple. He also hired Embo to attack Senator Rush Clovis."}, {"tag": "p", "text": "Some bounty hunters, such as Sugi, Seripas, Embo, and Rumi Paramita were hired by the Felucian Casiss Midagatis to protect his village from the Ohnaka Gang Sugi and Seripas were then hired by Wookiee General Tarfful to take him and his fellow soldiers to rescue Chewbacca from Trandoshan hunters on Wasskah. The Kaminoans hired Bric and El-Les to train the clone cadets. The Republic also placed bounties on wanted fugitives during the Clone Wars, such as Savage Opress. Even the Separatists offered a million credits a head on any Jedi. Sib Canay hired Greedo and his Gotal partner to kidnap Pantoran Chairman Papanoida's two daughters to Tatooine and the Droid Control Ship at Pantora."}, {"tag": "h3", "text": "Work with the Empire"}, {"tag": "p", "text": "The Galactic Empire often employed bounty hunters to hunt down Rebels. Private individuals could also list bounties on people. Jabba placed a very large bounty on Han Solo who was captured by Boba Fett."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}