{"url": "Bounty_hunter/Legends", "categories": ["Category:Legends articles", "Category:Bounty hunter starships", "Category:Bounty hunters", "Category:Law enforcement occupations"], "nodes": [{"tag": "h1", "text": "Bounty hunter"}, {"tag": "p", "text": "Bounty hunters primarily worked to capture or kill fugitives and others with a bounty on their head. As mercenaries, they were also known to do other jobs for the right price, including the protection of clients. The most infamous bounty hunters were clever, resourceful, and relentless, making them very dangerous to those with wealthy enemies."}, {"tag": "p", "text": "As a profession, bounty hunting was organized and regulated by various guilds, such as the Bounty Hunters' Guild. Bounty hunters occasionally formed partnerships, though partnering with a fellow bounty hunter could be very dangerous business, as they typically valued their personal gain—and survival—above that of their companions. Despite their political neutrality and independence, many bounty hunters were effective \"Jedi killers\", which made their services desirable to the Galactic Empire. There were often rivalries between bounty hunters and smugglers serving the same clients, notably between Boba Fett and Han Solo."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "The Guilds"}, {"tag": "p", "text": "There were a number of guilds associated with bounty hunters, the largest and best-known being the Bounty Hunters' Guild. However, it was often plagued with infighting and a general lack of cooperation between its members, climaxing with its virtual self-destruction during the Bounty Hunter Wars. There were other organizations, such as the House Benelex, Qulok's Fist, the GenoHaradan, and the Granse Confederacy, that served a similar purpose."}, {"tag": "p", "text": "Most bounties were presented to a guild, unless the presenter was able to contact the hunters directly. Posted bounties would then be sent to hunters affiliated with the guild and the hunt would be on. With the exception of powerful beings like Jabba the Hutt, Prince Xizor, Darth Vader, or intermediaries like Kud'ar Mub'at, most beings contracted hunters in this manner."}, {"tag": "p", "text": "During the Jedi Civil War it was possible to merely walk into a bounty office and browse current bounties, as Revan did during his stay on Taris."}, {"tag": "h3", "text": "Permits"}, {"tag": "p", "text": "During the Imperial Era, the Empire issued Imperial Peace-Keeping Certificates to bounty hunters. In some cases, bounty hunters were required to lodge a B23-1-14 permit in order to collect the maximum possible bounty."}, {"tag": "p", "text": "Depending on the jurisdiction, a person without a permit could earn a bounty, as was the norm in Lamaredd."}, {"tag": "h2", "text": "Stance"}, {"tag": "p", "text": "Bounty hunters were almost always mistrusted and feared by locals around the galaxy. This was because their line of work was often very dangerous, and frightening. Many famous hunters earned reputations as fearsome as the most horrific Sith Lords and criminals. Hunters such as Calo Nord, Jango Fett, and Cad Bane became household names, though none neared the unparalleled infamy of Boba Fett. Bounty hunters were not universally reviled, however. Those who followed government regulations and targeted dangerous criminals were often seen as on the side of law enforcement. On Haruun Kal, many Balawai children revered bounty hunters as larger than life figures."}, {"tag": "p", "text": "Generally, bounty hunters remained neutral during times of galactic conflict. They were known to favor one side or another, although never officially joining any one group. For example, the aforementioned Calo Nord worked with the Sith during the Jedi Civil War; the Grand Champion of the Great Hunt worked the Sith Empire during the Cold War; Jango Fett worked with the Separatists prior to the Clone Wars; and Cad Bane worked with the Separatists during the Clone Wars. Boba Fett often worked for the Empire and even had a professional relationship of mutual respect with Darth Vader. The Rebel Alliance rarely dealt with bounty hunters, lacking the credits and finding the hunters' methods contradictory to their ways of battle."}, {"tag": "p", "text": "Most often, however, bounty hunters were hired by individuals—particularly criminals and crime lords. The Exchange, Black Sun, the Zann Consortium, and Jabba the Hutt were particularly fond of using them, both for their effectiveness and their availability."}, {"tag": "h3", "text": "Work with the Empire"}, {"tag": "p", "text": "Bounty hunters were hired by the Empire, and following the Battle of Hoth in 3 ABY, a group of bounty hunters were hired to find the starship Millennium Falcon."}, {"tag": "p", "text": "Other bounty hunters provided information to the Empire. One particular individual provided a tip which led to a raid to find Rebel pilot Luke Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}