{"url": "Bouris_Ulgo", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:House Ulgo", "Category:Humans", "Category:Males", "Category:Monarchs of Alderaan", "Category:Republic Army generals"], "nodes": [{"tag": "h1", "text": "Bouris Ulgo"}, {"tag": "p", "text": "Bouris Ulgo was a Human male who lived during the Great Galactic War and the Cold War, hailing from the Core World of Alderaan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on Alderaan to the members of the scattered noble House Ulgo, Bouris Ulgo enlisted in the Galactic Republic's military and quickly rose to the rank of General. A distinguished soldier, Ulgo commanded Republic forces throughout the Great Galactic War, and personally won the Battle of Rordak for the Republic when he boarded the battlecruiser of his opponent, Moff Ceptor. Retiring after a twenty-year career, he returned to his homeworld when it devolved into chaos following the signing of the Treaty of Coruscant."}, {"tag": "p", "text": "As contention began to spread throughout the planet's body politic, Ulgo became opposed to the Empire-backing of House Thul, who had returned from exile. But as the Alderaan houses were too fractured to see the obvious Imperial invasion, Ulgo allied himself with House Rist and usurped the throne from House Panteer, (more than likely planning the assassination of Crown Prince Gaul Panteer and his mother, Queen Silara) slaughtering most of the Panteer family. He then declared that Alderaan would be placed under martial law and that he would serve as the new king. This only caused all the houses to turn against him as well."}, {"tag": "p", "text": "Boris Ulgo was eventually removed from the throne by force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ulgo is voiced by Steve Blum."}, {"tag": "p", "text": "There are several phrases written in Aurebesh on his biography page at the official site. When translated, they read: \"Search for the Crown\", \"Panteer Blood\", \"for Trask\"."}, {"tag": "p", "text": "One of the last missions on Alderaan for both Republic and Empire is to confront Bouris Ulgo in the throne room of Castle Panteer. For the Republic, they are called upon to do this by Katei Panteer; Darth Viktus, acting to aid House Thul for its bid to take the throne of Alderaan, issues the quest for the Empire. Ultimately, the player is given one of two choices after defeating him. The light side choice is to spare his life, so that he may stand trial for his crimes; the dark side choice, of course, is to kill him. Regardless, his defeat at Castle Panteer ends his reign, leaving the other claimants to battle it out amongst themselves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}