{"url": "Boushh", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Bounty hunters", "Category:Males", "Category:Ubese"], "nodes": [{"tag": "h1", "text": "Boushh"}, {"tag": "p", "text": "Boushh was a male Ubese from Uba IV who worked as a bounty hunter. Following his little-known demise at the hands of the Black Sun crime syndicate, Princess Leia Organa impersonated him in order to infiltrate Jabba's Palace and free Han Solo."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Originally from Uba IV, Boushh secured a reputation for himself as a formidable and dangerous bounty hunter despite his small stature, and worked for many paymasters."}, {"tag": "h3", "text": "Ord Mantell"}, {"tag": "p", "text": "In 4 ABY, Boushh was located on Ord Mantell, where he encountered Princess Leia Organa, the Wookiee Chewbacca, and the astromech droid R2-D2, Rebel Alliance members who traveled to the world in the Millennium Falcon. The wanted fugitives sought help from Maz Kanata regarding the recently captured Han Solo, held in carbonite by Jabba the Hutt."}, {"tag": "p", "text": "Leading the rebels down an alleyway, Kanata assured an anxious Leia Organa that her solution would present itself with patience. Before Organa could respond, Boushh attacked the group, yet after a brief exchange of blaster fire and melee combat, Boushh was disarmed by a calm and collected Leia Organa, before being downed by R2-D2 with a nearby machinery and stunned unconscious by Maz Kanata. Boushh's armor was then taken by Organa as a disguise, per Kanata's suggestion, as a solution to her plans to infiltrate Jabba's Palace and rescue Han Solo."}, {"tag": "h3", "text": "Demise and legacy"}, {"tag": "p", "text": "Boushh's career ended that year when he tried to blackmail the Black Sun crime syndicate, which resulted in his death. Taking advantage of the fact that Boushh's demise wasn't widely known, Leia Organa used his armor and helmet for infiltration missions."}, {"tag": "p", "text": "On one such occasion, Organa utilized the armor on Arkanis in order to rescue Lando Calrissian from bounty hunters, including the infamous Trandoshan Bossk. Cementing Boushh's reputation with Bossk, Leia Organa's preparation for rescuing Han Solo neared completion."}, {"tag": "p", "text": "Once again employing her ruse at Jabba's Palace, Organa secured Boushh's stay at the Hutt's criminal headquarters. However, the desperate lover failed to fool Jabba who, prior to Organa's entrance into his Palace in demand for an audience with the Hutt, had been informed by Boba Fett that it would not actually be Boushh under the helmet. Jabba presumed that it was actually a smuggler using Boushh's armor and helmet."}, {"tag": "p", "text": "After having her identity exposed in the midst of attempting to extract Han Solo from Jabba's Palace, the clothing set was removed from Leia as she was put into slavery under Jabba's possession."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Heavily-clad in a distinctive bounty-hunter gear, Boushh wore an all-leather outfit, gloves, and a head-concealing helmet with a metal speech scrambler and head bracket equipped with a vision-plus scanner and built-in targeting laser. Boushh wielded a long lance tipped with a shock blade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boushh was created for the 1983 Star Wars film Star Wars: Episode VI Return of the Jedi. In the film, Leia Organa impersonates Boushh in an attempt to negotiate with Jabba the Hutt about the price of Chewbacca. Boushh's vocal sounds while communicating with Jabba were provided by Pat Welsh. In Star Wars: Forces of Destiny, Boushh was voiced by Matt Lanter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}