{"url": "Bowcaster/Legends", "categories": ["Category:Legends articles", "Category:Bowcasters", "Category:Magnetic acceleration weaponry"], "nodes": [{"tag": "h1", "text": "Bowcaster"}, {"tag": "p", "text": "The bowcaster (sometimes called the Wookiee Crossbow) was a Wookiee projectile weapon that fired a metal quarrel enveloped in energy. Some bowcasters were modified to fire pure energy. Some variants had a capacity of twenty-four shots."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "In use as early as the Jedi Civil War, the bowcaster could unleash a explosive bolt with impressive stopping power essential to defend Wookiees against the fierce predators of Kashyyyk's forests."}, {"tag": "p", "text": "The bowcasters were magazine-loaded with usually six to ten explosive bolts per magazine. However some Wookiees developed a bowcaster that fired pure blaster bolts and no magazine was required. A quiver of 10 quarrels cost 50 credits and weighed 1 kilogram."}, {"tag": "p", "text": "A polarizing orb sat at each end of the bow, generating a magnetic field used to accelerate the quarrels. After cocking the weapon, a simple trigger sped the quarrel forward and charged it in an envelope of plasma. To generate the requisite potential energy for conversion into kinetic energy, the cocking spring required the strength of a Wookiee to draw back, although some modern bowcasters featured automatic cocking mechanisms for use by other species."}, {"tag": "p", "text": "While decreasingly effective beyond 30 meters, the bowcaster was more powerful and accurate than typical blaster weapons. Some bowcasters could load multiple quarrels to create a spread-fire effect, further enhancing their close range effectiveness, while others could fire specially charged bolts that could ricochet off certain surfaces. They also shot pure bolts that were not engulfed in energy. These would sometimes have poison tips or explosive tips."}, {"tag": "p", "text": "Bowcasters appeared huge to many non-Wookiees and even Jedi such as Olee Starstone doubted they could lift one, much less fire it. The weight of the weapon, however, was no impediment to the massive strength of the Wookiees. In addition to its size, the exotic design of the bowcaster required a non-Wookiee user to have training in order to wield the weapon proficiently. One non-Wookiee individual who used a bowcaster was the Kyuzo bounty hunter Embo. However, all Wookiees were able to wield their cultural weapon with proficiency."}, {"tag": "p", "text": "Variants of the bowcaster included the Assault bowcaster used during the Galactic Civil War and the Ceremonial bowcaster used in ceremonial hunts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The bowcaster was originally inspired by an illustration by John Schoenherr for George R.R. Martin's novelette \"And Seven Times Never Kill a Man\", published in the July 1975 issue of Analog, on which Ralph McQuarrie's final Chewbacca concept art was based."}, {"tag": "p", "text": "Most sources, including Revenge of the Sith, depict bowcasters firing green bolts. However, in The Empire Strikes Back and Return of the Jedi, Chewbacca's weapon fires red bolts and in Star Wars: Galactic Battlegrounds, Chewbacca's weapon fires yellow bolts. This is due to the retcon that Chewbacca made his out of a stormtrooper rifle. In the Super Star Wars video game, Chewbacca's weapon looks like his usual bowcaster but is referred to as an FD-011 crossbow."}, {"tag": "p", "text": "In all Jedi Knight series of games, the bowcaster made an appearance. There, the user had two fire functions: one that could launch one to five bolts (depending on the amount of time spent charging up the shot) and one that launched a single, bouncing bolt. The latter was more accurate at far ranges, and could be fired at a faster pace. In both Jedi Knight/Dark Forces and Knights of the Old Republic games Wookiees are not the only bowcaster users. Many non-Wookiee mercenaries, bounty hunters, smugglers were equipped with this weapon in games, so did both Kyle and Jaden. Players are given the option of equipping Revan and the Jedi Exile with bowcasters. All Wookiee player characters in Star Wars Galaxies start with the ability to craft bowcasters. In Republic Commando: Hard Contact, Darman Skirata states that the bowcaster is his favorite weapon."}, {"tag": "p", "text": "There are significant differences in this weapon's range presented in the Star Wars Roleplaying Game Saga Edition Core Rulebook that differ from the range as listed in the The New Essential Guide to Weapons and Technology. Instead of an optimum and maximum range of 30 and 50 meters respectively, the Saga Edition treats the bowcaster as a rifle, giving it an optimum and maximum range 90 and 450 meters respectively. This is probably due to the fact that the role-playing game data is heavily simplified and modified for ease of play."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}