{"url": "Box_system", "categories": ["Category:Canon articles", "Category:Science"], "nodes": [{"tag": "h1", "text": "Box system"}, {"tag": "p", "text": "Box system was a colloquial term used to describe a star system with strong electromagnetic fluxes wrapped around its outer edges, which interacted with solar wind to obstruct hyperspace travel. The Unknown Regions' Rapacc system was one such system, containing the planet Rapacc."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Box systems were marked by uncharacteristically strong electromagnetic fluxes wrapped around the system's outer edges. These fluxes interacted with solar wind from the system's star, obstructing hyperspace travel and the performance of navigators, such as the Chiss sky-walkers. For a starship to enter the interior of a box system, it had to do so in space-normal."}, {"tag": "p", "text": "Planets, such as gas giants, could carve holes into the solar wind that allowed easy access into and out of the system. Such holes were difficult to notice from outside the system without detailed planetary data, but could be more easily exploited from within. The nature of box systems was advantageous for defense and preventing outside starship traffic from passing through the area, making them optimal for maintenance facilities, supply depots, or hidden staging areas."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rapacc system, located in the Unknown Regions and containing the Paccosh homeworld of Rapacc, was an example of a box system. After the planet was blockaded by the Nikardun Destiny, two Paccosh refugee vessels managed to leave the system with the help of Void Guide navigators, with Senior Captain Thrawn of the Chiss Ascendancy assuming they utilized shadows in the system's solar wind to exit. Thrawn used the same shadows himself when investigating the Nikardun alongside Admiral Ar'alani."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A box system appeared in the 2020 novel Thrawn Ascendancy: Chaos Rising, written by Timothy Zahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}