{"url": "Bozzie_Baranta", "categories": ["Category:Legends articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Mechanics", "Category:Podracers"], "nodes": [{"tag": "h1", "text": "Bozzie Baranta"}, {"tag": "p", "text": "Bozzie Baranta was a mechanic on Gasgano's pit crew around the time of the Boonta Eve Classic during the waning years of the Galactic Republic. Baranta had pink and tan skin, and blue eyes. Eventually, Baranta became a podracer himself."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early days"}, {"tag": "p", "text": "Working as a mechanic for Gasgano, in 32 BBY, he fostered dreams of becoming a podracer himself. He secretly practiced with the Ord Pedrovia until he felt he could at least hold his own on the Amateur circuit. At that point, he made his request to part ways with Gasgano. Once the Xexto saw how he could race, Gasgano agreed to let him off the pit crew, and even had a hand in funding Baranta's campaign to buy a podracer."}, {"tag": "h3", "text": "Becoming a podracer"}, {"tag": "p", "text": "After securing a Shelba 730 Razor podracer, Baranta painted the machine in bright colors such royal blue, silver and gold and began to live his dream."}, {"tag": "p", "text": "He performed quite well that he became the favorite in the track \"Abyss\" in Ord Ibanna. He was known to let worry affect his piloting, but could be a dangerous opponent, due to his tendency to stop regularly during a race to make repairs. As such, he spent more to repair the podracer than he did to purchase it."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Baranta's podracing impressed the likes of Gasgano."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Baranta was best known for worrying to much. He tended to stop in the pits too much, which normally kept him out the winners' circle. He had only won three times by 32 BBY. He spoke Huttese."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Baranta's Shelba 730 Razor podracer was considered one of the most flashy, beautiful and elegant pod ships of the Tournaments. He conisdered it his pride and joy. His podracer had average acceleration and good response, but it had below average handling. He installed a top of the line repair-module on his podracer to make sure his podracer got all the attention. He ended up putting more money into repairing it then he did actually buying it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bozzie Baranta was first mentioned in the Baranta's voice in the Star Wars: Episode I film novelization He made his first full appearance in Star Wars Episode I: Racer, voiced by Terence McGovern. In early drafts of Star Wars: Episode I The Phantom Menace there was a character named Bozzie Barada."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}