{"url": "Bpfassh", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Confederacy of Independent Systems planets", "Category:Desert planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Sluis sector planets", "Category:Type II atmosphere planets"], "nodes": [{"tag": "h1", "text": "Bpfassh"}, {"tag": "p", "text": "Bpfassh was an arid double planet in the Sluis sector orbited by a complicated system of moons, located near Praesitlyn and Sluis Van. It was the homeworld of the Bpfasshi."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Bpfassh was the site of a Jedi Praxeum. Near the start of the Clone Wars, Nejaa Halcyon chased Zozridor Slayke's Scarlet Thranta there in his ship, the Plooriod Bodkin. Slayke disabled the Thranta and stole the Bodkin at the price of only one of his men, leaving Halcyon and his crew stranded on Bpfassh for months, disgracing him in the eyes of many."}, {"tag": "p", "text": "Bpfassh's Praxeum joined the Separatist-aligned Jensaarai and was the site of a Dark Jedi uprising later during the Clone Wars. The Bpfasshi Dark Jedi were responsible for a rampage of terror and destruction throughout the sector before the insurrection was quelled by a Jedi task force led by Yoda. The Bpfasshi held a strong dislike for all Jedi since that episode. This uprising would be distorted by legend; some versions placing Jorus C'baoth on the front line, a Jedi Master who had died several years before the event."}, {"tag": "p", "text": "Decades later, Grand Admiral Thrawn feinted at this system to draw ships away from Sluis Van. Han Solo, Leia Organa Solo, Wedge Antilles and Rogue Squadron were later attacked by Grand Admiral Thrawn's Noghri here."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jorus C'baoth was originally set as the Jedi Master who defeated the Dark Jedi; however, after the date of the Clone Wars became clear, this became impossible. The Complete Star Wars Encyclopedia reconciled this by stating that legend had distorted truth."}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places the Sluis sector and, consequently, Bpfassh, in the Galactic Core."}, {"tag": "p", "text": "The planet's name is pronounced as \"Bip-fash.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}