{"url": "896_BBY/Legends", "categories": ["Category:Legends articles", "Category:Years in the Great Peace of the Republic era"], "nodes": [{"tag": "h1", "text": "896 BBY"}, {"tag": "p", "text": "896 before the Battle of Yavin (BBY) was part of a time period known as the Great Peace of the Republic. In this era, parts of the Deep Core of the galaxy were opened to the Galactic Republic, and previously unexplored regions of the Outer Rim Territories were settled. 896 is the birth year of Yoda, future Grand Master of the Jedi Order."}, {"tag": "h2", "text": "Proem"}, {"tag": "p", "text": "The conflict known as the New Sith Wars—which saw a thousand years of fighting between two major Force-user factions, the Jedi and Sith—finally ended in 1000 BBY. The Galactic Republic was in ruins and was reorganized by the Ruusan Reformation, announced by Supreme Chancellor Tarsus Valorum. The winning faction of the previous long war, the Jedi Order, was codified as a branch of the Republic's Judicial Department."}, {"tag": "h2", "text": "The galaxy in 896 BBY"}, {"tag": "p", "text": "The era of the Great Peace of the Republic began with the Ruusan Reformation more than one hundred years before the year 896 BBY. During these years, the Republic opened the Deep Core of the galaxy, and unexplored then Wild Space parts of space were charted by scouts and chartographers. The latter areas later became part of the Outer Rim Territories."}, {"tag": "p", "text": "Yoda, a Force-sensitive member of a green-skinned species, was born in the first quarter of the year."}, {"tag": "h2", "text": "Impact"}, {"tag": "p", "text": "After 896 BBY, the expansion of the Galactic Republic continued during the Great Peace of the Republic, which lasted nearly nine hundred more years. In the following years, economic forces acquired more and more power in the Republic, as companies established the Corporate Sector from star systems brought in the Tingel Arm."}, {"tag": "p", "text": "At one hundred years of age, Yoda became a Jedi Master. In the following centuries, he trained countless Jedi apprentices until they reached knighthood. His many years of contribution to the Order gained him a seat on the Jedi Council. Eventually, he ascended to become Grand Master of the Jedi Order. For centuries, he served as the leader of all Jedi, thus turning him into the \"face\" of the Council and the embodiment of the Order."}, {"tag": "h2", "text": "Notable events"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Return of the Jedi, Yoda implied to his apprentice, Luke Skywalker, that he was nine hundred years old. The movie was set four years after the Battle of Yavin, featured in the first Star Wars film, A New Hope. In 1998, LucasArts released Star Wars: Behind the Magic, an interactive database on CD-ROM, which was the first to state that Yoda was born in 896 BBY."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}