{"url": "Bpfassh_Uprising", "categories": ["Category:Legends articles", "Category:Battles in the Sluis sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Bpfassh Uprising"}, {"tag": "p", "text": "The Bpfassh Uprising was a Dark Jedi insurrection that wreaked havoc in the Sluis sector in 22 BBY, while the Clone Wars were beginning. It started when a group of Jedi from the planet of Bpfassh fell to the dark side of the Force due to the pressure of the war. To oppose them, the Jedi High Council formed a task force led by Yoda, the Grand Master of the Jedi Order himself. Thanks to his intervention, the insurrection was quelled, marking one of the first major victories of the Galactic Republic in the third year of the Clone Wars. The Dark Jedi from Bpfassh, however, had not spoken their last word."}, {"tag": "p", "text": "In 19 BBY, the Clone Wars concluded, and the despotic Galactic Empire was formed. Shortly afterwards, the Bpfasshi Dark Jedi resumed their attacks in the Sluis sector, engaging in a large space battle. At the end of that battle, the last of the Dark Jedi seized the ship of the smuggler Jorj Car'das ship and took it to Dagobah. Ironically, that planet was the new residence of Yoda, who was hiding from the Jedi-hating Empire. Once again, the Bpfasshi darksider was killed by the Grand Master."}, {"tag": "p", "text": "Despite Yoda's victory, the Bpfassh Uprising was best remembered as a fiasco. Many years after the events, the Bpfasshi still had a deep-seated resentment against the Jedi, and the incident was still discussed in the Imperial Senate."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the last decades of the Galactic Republic, the planet of Bpfassh in the Sluis sector hosted a satellite training facility of the Jedi Order. However, that chapter house had a long history of rebelliousness to the High Council, the governing body of the Order. In the third month of the year 13 post-Great ReSynchronization, the Sluis sector officially seceded from the Republic to join the Confederacy of Independent Systems. A few months later, the Clone Wars broke out between the Republic and the separatist Confederacy. Due to their superior combat experience, the Jedi were led to play a pivotal part in the conflict, becoming the generals and commanders of the new clone army of the Republic. However, there were Jedi who doubted the war and refused to receive their martial promotion from the High Council. Those dissidents formed an informal movement that was also joined by those who invoked the Right of Denial, a tradition that allowed Jedi to protest against a decision made by the High Council. The whole Jedi academy of Bpfassh ended up joining the movement too."}, {"tag": "h2", "text": "The uprising"}, {"tag": "h3", "text": "Initial insurrection"}, {"tag": "p", "text": "As the Clone Wars went on, the Sluis sector went trough continual fighting. Because of its affiliation with the Confederacy of Independent Systems, the sector was being pressured by the Republic forces based on Eriadu, in the neighboring Seswenna sector. Additionally, the Sons and Daughters of Freedom, a crew of Republic privateers led by Zozridor Slayke, kept raiding the sector. Ultimately, that situation provoked a spike of martial zealotry among the Jedi of the Bpfassh academy. Although they had initially refused to get involved in the ongoing conflict, the Bpfasshi Jedi gave in to their anger and fell to the dark side of the Force. They set themselves against Slayke's men and were responsible for a rampage of terror and destruction throughout the Sluis sector. Eventually, the High Council sent a task force of loyal Jedi to quell the Bpfassh uprising. Yoda, the Grand Master of the Jedi Order himself, was part of that force. At one point, Yoda was pitted against at least three adversaries armed with lightsabers. The Jedi Knight Ylenic It'kla was also part of the Jedi task force, and so was Nejaa Halcyon, a Corellian Jedi who had already fought in the Sluis sector in 22 BBY. The latter in particular was instrumental in putting down the uprising, although the details of his involvement would be lost in the mists of time. Eventually, Grand Master Yoda dueled the leader of the Dark Jedi and defeated him."}, {"tag": "h3", "text": "Post-Clone Wars resumption"}, {"tag": "p", "text": "A few months later, Supreme Chancellor Palpatine of the Galactic Republic, who was secretly a Sith Lord named Darth Sidious, revealed his true colors to the galaxy. As the Clone Wars were brought to an end, the Republic was replaced by a tyrannical Galactic Empire led by Sidious himself. As the Empire sought to exterminate all Jedi, Yoda, the former victor of the Bpfassh Uprising, retreated to a self-imposed exile on Dagobah, a swamp planet of the Sluis sector. At that time, however, the sector in question experienced a resurgence of Bpfasshi Dark Jedi activity, despite Yoda's earlier victory over their leader. At some point, a large space battle erupted between the darksiders and the combined forces of everyone else in the sector. A smuggler named Jorj Car'das, who ran the former business of one Booster Terrik, was accidentally caught up in the middle of the fray. As the space battle drew to a close at the darksiders' expense, one of the most powerful of the Dark Jedi captured Car'das' vessel, forcing the smuggler and his four crewmen to take off. He immediately killed one of Car'das' men by tearing his body apart, and turning the other three into mind-controlled puppets. However, the Dark Jedi left the smuggler captain himself mostly alone, presumably as the darksider needed Car'das' knowledge of ports and hyperlanes to make his escape."}, {"tag": "p", "text": "The Dark Jedi demanded passage to Dagobah, either seeking sanctuary or Yoda's hiding place. As soon as Car'das put down his ship at the edge of Dagobah clearing, Yoda himself made an appearance, as if he had been expecting a dark visitor. The resulting battle between the two Force-users lasted nearly one day and a half, during which, according to Car'das, \"the swamp blazed with fire and lightning.\" Eventually, Yoda got the upper hand. The Dark Jedi perished, disintegrating in a burst of energy. Car'das and what was left of his men had also taken part in the fighting, but only the smuggler had survived. Yoda then healed the wounded man and sent him on his way. The death of the Bpfasshi Dark Jedi left a lasting stain on Dagbobah, which further helped Yoda to hide himself from the Imperials."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the chaos of the Clone Wars and the rise of Palpatine's Empire, many historical records were either destroyed or tampered with. Historians still knew that the Jedi task force had succeeded in their mission and that the last Dark Jedi had made his or her way to Dagobah, but they surmised that the darksider had been destroyed either by the natural hazards of the swamp planet or by Halcyon and his men. Additionally, the Bpfassh Uprising was conflated with that of a similar event that had involved Master Jorus C'baoth. Indeed, when Luke Skywalker, the first of a new generation of Jedi, searched the Galactic Senate's records on Jorus C'baoth in 9 ABY, he read that C'baoth had fought the Dark Jedi on Bpfassh, while he had in fact defeated darksiders in the Elrood sector at some point before the Battle of Naboo. However, Jorj Car'das was still alive, and could testify on Yoda's decisive involvement. By 19 ABY, he had told his story to at least two individuals—Talon Karrde and Shada D'ukal."}, {"tag": "p", "text": "Although the Bpfassh Uprising had been efficiently brought to an end, the inhabitants of Bpfassh remained wary of all Jedi. Many years later, echoes of the incident were still heard in the Imperial Senate, the ruling council of the Galactic Empire. In 9 ABY, nearly three decades after the events, the former Imperial senator Leia Organa Solo still remembered what she had heard about the Bpfasshi fiasco during her years of service."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "The Bpfasshi insurrection was first mentioned in Heir to the Empire, a 1991 novel and the first entry in Timothy Zahn's so-called Thrawn Trilogy. In the novel, Luke Skywalker is advised to stay away from Bpfassh, as some of that its Jedi \"went bad\" during the Clone Wars, leading to resentment toward their order. Skywalker also learns that the cave in which he confronted a vision of his father was first tainted with dark energies years before, when Yoda killed a powerful Bpfasshi Dark Jedi on Dagobah during the Clone Wars. According to Princess Leia, that duel must have occurred thirty to thirty-five years before the novel's present time, which would put it between 26 and 21 BBY. In Dark Force Rising, the second entry in the Thrawn Trilogy, it was mentioned that Jorus C'baoth was part of a taskforce assembled to oppose a Dark Jedi insurrection on Bpfassh. In 1997 and 1998, Zahn published Star Wars: The Hand of Thrawn Duology. In the series' second an final tome, titled Vision of the Future, readers were told how the smuggler Jorj Car'das was kidnapped by a Dark Jedi who took him Dagobah, where the darksider got beaten by Yoda. According to Talon Karrde, those events took place 45 years before the novel's present time, which would still be 26 BBY."}, {"tag": "h3", "text": "Retcons"}, {"tag": "p", "text": "With the release of the prequel trilogy between 1999 and 2005, the course of ancient events invented by Zahn for his trilogy was compromised. Initially, the Clone Wars were supposed to have taken place thirty-five years before Star Wars: Episode IV A New Hope, but the prequels showed they only started in 22 BBY and ended in 19 BBY. Because of that, all the dates featured in the Thrawn Trilogy are off by sixteen years."}, {"tag": "p", "text": "In The Official Star Wars Fact File, a 140-issue magazine published from 2002 to 2005, two conflicting account of the Bpfasshi Uprising's endgame were given. According to the 28th issue, the death of the Dark Jedi leader was thought to have been caused by either the natural hazards of Dagobah or a Jedi task force led by Nejaa Halcyon and Ylenic It'kla. Despite that, the 86th issue of the Fact File confirmed Yoda's responsibilities in the darksider's demise.—while also mentioning Halcyon's participation in the mission. However, the Official Fact File were meant to be the real-life equivalent of a centralized database created by the New Republic in 27 ABY, which implies it may contain inaccuracies from an in-universe point of view. Incidentally, the 28th issue does state that many historical records were either altered or lost following Palpatine's rise to Emperor, and presents its information as surmises."}, {"tag": "p", "text": "Morever, the script of the 2005 movie Star Wars: Episode III Revenge of the Sith specified that Yoda had never been on Dagobah before his exile at the end of the Clone Wars. The reference book The New Essential Chronology, which was released a few months after the movie, included a retelling of the Bpfassh insurrection. While omitting the problematic endgame on Dagobah, that new account established a connection between the uprising and the Jedi dissident movement that appeared in other sources such as Jedi: Mace Windu."}, {"tag": "p", "text": "In 2008, the canonicity of the Bpfasshi uprising was brought up in the 98th issue of the Star Wars Insider magazine. Lucasfilm official Leland Chee stated that Yoda's battle against a Bpfasshi Dark Jedi as described in Zahn's novel was no longer part of continuity. However, Chee said that \"a mortally wounded darksider made it to Dagobah after a confrontation with Yoda, but the battle did not take place there.\" The problem was solved a few months later, when the roleplaying game sourcebook Scum and Villainy retconned the incident with Car'das, the Dark Jedi and Yoda to have happened after the Clone Wars. Since they do not contradict each other, the present article considers that Yoda fought Bpfasshi Dark Jedi both during and after the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}