{"url": "Bracchia", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Imperial Security Bureau personnel", "Category:Koorivar", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bracchia"}, {"tag": "p", "text": "\"Bracchia\" was the code name of a male Koorivar spy who worked for both the Galactic Republic and the Galactic Empire. During the Clone Wars, he assisted Wilhuff Tarkin's anti-Shadowfeed operation on Murkhana. In 14 BBY, Bracchia and his Imperial Security Bureau case officer Stellan were tricked by Vice Admiral Dodd Rancit into reporting a communications cache on Murkhana. This enabled the insurgent leader Berch Teller to steal Tarkin's ship Carrion Spike and embark on an insurgency."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars, Bracchia worked as a Galactic Republic operative, notably assisting Wilhuff Tarkin in his anti-Shadowfeed operation on Murkhana. At the end of the war, Republic Chancellor Palpatine proclaimed himself Emperor, and the galaxy entered the age of the first Galactic Empire. Bracchia remained in the service of the new government, becoming an intelligence asset for the Imperial Security Bureau."}, {"tag": "p", "text": "In 14 BBY, ISB case officer Stellan tasked Bracchia with investigating a cache located in a disused medcenter on Murkhana. The Koorivar agent found the cache and submitted a preliminary report of his mission, allowing the local Imperial forces to place the cache's location under observation. Later on, he was interrogated by Moff Tarkin and Darth Vader, the Emperor's enforcer. Bracchia answered their questions. After the insurgent leader Berch Teller stole Tarkin's corvette Carrion Spike, he played a role in helping them to procure a replacement starship, the Parsec Predator, from the Sugi crime lord Faazah."}, {"tag": "p", "text": "During the course of Teller's insurgency, both Bracchia and Stellan were interrogated by the Emperor himself, in an attempt to find conspirators within the Imperial security personnel. When questioned about the communications cache on Murkhana, he told the Emperor he had no knowledge about the communications devices but was merely following a directive from Coruscant. His case officer Stellan told the Emperor that Military Intelligence had sent the ISB a holovid of the communications cache on Murkhana. He then sent Bracchia to confirm the cache. The Emperor realized the holovid was a counterfeit that had been created by someone with access to the Imperial codes and to devices capable of subverting the HoloNet."}, {"tag": "p", "text": "Meanwhile, Lord Vader and Tarkin discovered that Vice Admiral Dodd Rancit, the Director of the Naval Intelligence Agency, had planed the communications cache and was colluding with Teller. Rancit had planted the cache with the intention of luring Tarkin to Murkhana so that Teller and his followers could steal the Carrion Spike in order to attack Imperial installations across the galaxy. This information enabled the Imperials to neutralize Rancit and Teller's rebel cell."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bracchia was a tall Koorivar man who towered over Wilhuff Tarkin. His cranial horn was of average size for his species. However, his facial ridges were scarred. The Koorivar also wore tattered robes. Bracchia was a useful spy for both the Republic and its successor state, the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bracchia appeared in James Luceno's 2014 novel Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}