{"url": "Braconnor_Bakiska/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Stennes"], "nodes": [{"tag": "h1", "text": "Braconnor Bakiska"}, {"tag": "p", "text": "Braconnor Bakiska was a male of the Stennes species who lived during the time of the Galactic Civil War. During the year 0 BBY, Bakiska was present in Chalmun's Spaceport Cantina, located in Mos Eisley on the planet Tatooine. Braconnor Bakiska was sitting inside the entrance to the cantina when the former moisture farmer Luke Skywalker and the Jedi Master Obi-Wan Kenobi came to the cantina looking for a pilot to take them to the planet Alderaan. During that time, Bakiska sat at a table with the Defel Arleil Schous, the Advozsec Bom Vimdin, the Arconan Hem Dazon, and the Siniteen Pons Limbic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Braconnor Bakiska was a mustachioed male member of the Stennes species who was alive during the Galactic Civil War fought between the Galactic Empire and the Rebel Alliance. During the year 0 BBY, Bakiska spent some time in the city of Mos Eisley on the planet Tatooine, shortly after the Corellian corvette Tantive IV was boarded by the Imperial Star Destroyer Devastator over the planet. During his time on Tatooine, Bakiska was in Chalmun's Spaceport Cantina when a former moisture farmer named Luke Skywalker and a Jedi Master named Obi-Wan Kenobi entered the cantina, searching for a pilot to take them and the droids C-3PO and R2-D2 to the planet Alderaan. Braconnor Bakiska was seated at a table near the entrance to the cantina with the male Defel Arleil Schous, the Advozse male Bom Vimdin, the male Arcona Hem Dazon, and the Siniteen male Pons Limbic when Skywalker and Kenobi entered."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Braconnor Bakiska had tan-colored skin and brown hair, including a mustache, which drooped from his upper lip. Bakiska wore a dark hood over tan clothing while at Chalmun's Cantina in 0 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A mustachioed individual first appeared in Star Wars: Episode IV A New Hope, a 1977 film. In the movie, the individual was seated at the table appearing at the start of the cantina scene. The mustachioed individual appeared in only one of the pick-up shots, and was quickly covered by Hem Dazon's head after it moved into the frame. The filming of this table was part of supplemental shooting for the cantina scene filmed in the city of Los Angeles in the United States after principal photography was completed. The masks used for the supplemental shoot were slip-on, made of rubber, and designed by makeup artists Rick Baker and Laine Liska. The mustachioed individual was based on a mask known as \"Terminal Man,\" one of Baker's pre-existing designs, which was an attempt by Baker to create an original Halloween mask of Frankenstein's monster."}, {"tag": "h3", "text": "Nameless"}, {"tag": "p", "text": "By the late 1990s, fans had nicknamed the character \"Fu Manchu\" due to his mustache, but no official source had named him. Leland Chee, the Lucasfilm official who maintains the Holocron continuity database, stated on the StarWars.com forums that he believed the individual's mask was the same as that of another character in the cantina named Trinto Duaba, with the addition of a mustache. This fact was confirmed by Rick Baker in an Official Star Wars Blog entry written by Pablo Hidalgo and posted on StarWars.com on September 26, 2012. However, Baker was unaware who put the mustache on the character's face, which he viewed as a stupid idea. Another one of the cantina makeup artists, Nick Maley, did not view the character as a high-quality design, and was one background character that he hoped people would not look at too closely."}, {"tag": "h3", "text": "Celebration VI naming"}, {"tag": "p", "text": "On August 25, 2012, the mustchioed individual was given a name as part of Pablo Hidalgo and Tom Spina's \"Behind the Scenes of the Cantina\" panel at Celebration VI, a Star Wars convention held from August 23 to August 26 in Orlando, Florida. In order to have some control over the name of the character, Hidalgo and Spina formed the individual's last name—\"Bakiska\"—from the names of Episode IV artists Rick Baker and Laine Liska. During the panel, cards for Tom Spina's design company, which were decorated with the face of another cantina character known as \"Snaggletooth,\" were handed out to the audience. One fan received a card with a mustache drawn on the character's face, which was Hidalgo and Spina's way of selecting a fan to form the character's first name. An audience member named Brandon Connors received the special card, and Hidalgo formed the character's first name \"Braconner\" from Connors' name, although the spelling differed because Hidalgo did not verify the spelling of the fan's name. As a prize for winning the contest, Connors also received a replica of the character's mask made by Tom Spina Designs during the panel. After the original naming at the panel, Tom Spina and Pablo Hidalgo changed the character's name to \"Braconnor Bakiska\" in order to better represent the spelling of Brandon Connors' name."}, {"tag": "p", "text": "On September 26, 2012, Hidalgo wrote an official Star Wars Blog entry discussing the process of naming and researching the character. The blog post confirmed that Bakiska was a male, and clarified that Bakiska's character used the same mask as Trinto Duaba, who was identified as a Stennes Shifter in the 1997 Star Wars Adventure Journal 12 article \"Shape-shifters.\" This identification confirmed that Bakiska was a Stennes, but it did not confirm him to be a Stennes Shifter, since they looked the same as the Stennes species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}