{"url": "Braha%27tok-class_gunship/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Alliance to Restore the Republic starship classes", "Category:Braha'tok-class gunships", "Category:Gunship classes"], "nodes": [{"tag": "h1", "text": "Braha'tok-class gunship"}, {"tag": "p", "text": "The Braha'tok-class gunship, also known as the Dornean gunship, was an anti-starfighter gunship constructed by the Dornean Braha'ket Fleetworks Conglomerate for use by the independent Dornean Navy. Designed purely for military use, the ninety-meter-long craft bristled with weaponry, including turbolasers and concussion missile launchers. At first, the gunships were used to defend Dornea from the Imperial Navy, but in 4 ABY, two of them were sent to Sullust to join Admiral Gial Ackbar's Rebel Alliance Fleet, which was poised to strike at the Galactic Empire's second Death Star over the Forest Moon of Endor."}, {"tag": "p", "text": "The two gunships were the Braha'tok and the Torktarak, under the command of the Dorneans Kiles L'toth and Etahn A'baht, respectively. During the Battle of Endor, both of the ships engaged the Imperial Carrack-class light cruiser Eminence, overcoming and destroying the enemy vessel. However, the Braha'tok was heavily damaged during the fighting, and Ackbar afterward ordered that it be scuttled. The Dorneans protested the order and had the Braha'tok shipped back to their homeworld, where it served as a war museum. The Torktarak was also sent back to Dornea to continue its service in the Dornean Navy."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Braha'tok-class gunship—also known as the Dornean gunship—was designed purely for anti-starfighter space warfare. To that end, it possessed no accommodations for ground-based infantry, and included only a small hangar deck."}, {"tag": "p", "text": "The Braha'tok-class gunship measured ninety meters in length. It was armed with eight double-turbolaser cannons and eight concussion missile launchers. The optimal crew number was seventy-five beings, with operations such as fire control, maneuvering, and command centralized at stations within the ship's bow. The gunship was long and narrow, and the vessel's bridge was crescent-shaped and was connected to the main hull by a thin neck, thus resembling the head of a rounded hammer. The Braha'tok-class had two pairs of projections coming out of its port and starboard sides: the first pair toward its center, and the second, thinner pair on the ship's stern. The gunship had silver plating and was equipped with engines, as well as a hyperdrive that was capable of making hyperspace jumps between star systems."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Use against the Empire"}, {"tag": "p", "text": "Built by the Dornean Braha'ket Fleetworks Conglomerate during the Galactic Civil War, the Braha'tok-class gunship was developed for the Dornean Navy of the planet Dornea, which had successfully held off the Galactic Empire for several years prior to 4 ABY in their own private war. In 4 ABY, the Rebel Alliance asked the Dornean Navy to lend them battleships for the Alliance's upcoming assault on the Empire's second Death Star, a superweapon powerful enough to destroy an entire planet. In response, the Dorneans sent a pair of Braha'tok-class gunships to the Alliance Fleet that was massing around the world of Sullust. The gunship class had been unseen outside the space surrounding Dornea before 4 ABY, and so as to not arouse the suspicion of Imperial Intelligence, the Dornean government claimed that the two ships were undergoing a \"shakedown cruise.\""}, {"tag": "p", "text": "The two gunships dispatched to Sullust were the Braha'tok and the Torktarak, respectively commanded by the Dorneans Kiles L'toth and Etahn A'baht. The gunships successfully met up with the Alliance Fleet, which was poised to strike at the second Death Star's construction site over the Forest Moon of Endor. From Sullust, the Rebel flotilla, under the command of Admiral Gial Ackbar, jumped into hyperspace and traveled to the Endor system, where they were met by a substantial Imperial fleet under the command of Admiral Firmus Piett, trapping them in the system. The Alliance Fleet also discovered that the deflector shield protecting the second Death Star, which was supposed to have been taken down by a ground unit that had already landed on Endor, was still in effect."}, {"tag": "h3", "text": "Battle above Endor"}, {"tag": "p", "text": "During the resulting Battle of Endor, the second Death Star's superlaser destroyed the MC80 Liberty type Star Cruiser Liberty, severely damaging or destroying several other Rebel craft in the ensuing explosion. As rescue craft scrambled to pick up the survivors, the Braha'tok moved into position to provide a defensive screen for the rescue craft. In doing so, the Braha'tok was engaged by the aging Imperial Carrack-class light cruiser Eminence, a warship three times its size. In spite of the natural advantage that the Eminence possessed, L'toth was able to successfully hold the Imperials at bay for a time."}, {"tag": "p", "text": "The Braha'tok eventually sustained heavy damage, prompting the Eminence to move in for the kill. Before it could do so, however, A'baht brought the Torktarak to the Braha'tok's aid, attacking the Eminence from the vessel's rear quarter. The Torktarak was able to destroy the Imperial craft and defend the waylaid Braha'tok as recovery operations continued. The Alliance Fleet eventually destroyed the second Death Star and won the battle after the battlestation's deflector shield was taken down."}, {"tag": "p", "text": "Following the Battle of Endor, the Torktarak, which had received minimal damage, returned to Dornea to continue its service in the Dornean Navy. When Admiral Ackbar ordered that the severely damaged Braha'tok be scuttled, the Dornean Navy protested the decision and had the craft shipped back to Dornea, where it was converted to serve as a war museum."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Braha'tok-class gunship originally appeared as a background model in Richard Marquand's film Star Wars: Episode VI Return of the Jedi, during the \"Battle of Endor\" sequence. During production, the kit-bashed model seen in the film was known only as the \"ROJ BG ship.\" In 2006, the ship was identified and elaborated on in the StarWars.com Databank by StarWars.com member \"Ello137\" through the Hyperspace feature \"What's The Story?\""}, {"tag": "p", "text": "Ello137 saw the \"What's the Story?\" competition as an opportunity to tie obscure elements of the Expanded Universe with background elements from the movies, prompting his use of the Dornean Navy from The Black Fleet Crisis novel trilogy by Michael P. Kube-McDowell. Initially, Ello137 conceived of the names Braha'tok and Torktarak as mythical Dornean names, but he was unable to fit the information into his final entry. The element of the Alliance searching for craft from independent navies was inspired by scenes from A. C. Crispin's The Han Solo Trilogy."}, {"tag": "p", "text": "To determine the size of the gunship, Ello137 studied a brief shot in Return of the Jedi in which the light freighter Millennium Falcon flies past the gunship, and made comparisons. For the Carrack-class cruiser that the gunships battle at Endor, Ello137 wanted to use a craft that had already been established in continuity. In doing so, he selected the Eminence, a craft identified in The Essential Chronology as having fought at the Battle of ThonBoka. Remembering depictions of the battle in the book showing Carrack-class cruisers, Ello137 incorrectly assumed that the Eminence was of that class; it was in fact a Star Destroyer. Realizing his mistake after submitting the entry, Ello137 attempted to resubmit, this time using the Integrity from Matthew Stover's novelization of Star Wars Episode III: Revenge of the Sith. The original entry was the one selected by StarWars.com. The information from the Databank entry was later used for 2008's The Complete Star Wars Encyclopedia, for its own entry on the Braha'tok-class gunship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}