{"url": "Braised_fork_tart", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Hutt food"], "nodes": [{"tag": "h1", "text": "Braised fork tart"}, {"tag": "p", "text": "Braised fork tarts, also known as \"jimunee ronto pagona\" in the Huttese language, were a type of food dish created by the Hutt species. They contained thorns which had to be removed before consumption. The scholar Ebenn Q3 Baobab wrote about the tarts in his book Galactic Phrase Book & Travel Guide."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Braised fork tarts, which in the Huttese language were named \"jimunee ronto pagona\", was a food dish considered a delicacy and produced by members of the Hutt species. The dish contained thorns which had to be removed before consumption by Humans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Despite the risk of the thorns, Ebenn Q3 Baobab, a Human scholar, recommended in his book the Galactic Phrase Book & Travel Guide, that his readers should try the dish in the Hutt eateries of the spaceport of Mos Eisley on the planet Tatooine, should they be in the area. The book, which was released in 6 ABY, also included the Huttese translation of the dishes name in the Huttese language section, in which Baobab listed the food amongst his favorite Hutt dishes. He claimed that Hutt cuisine, including the tarts, were expensive. He advised they be eaten causally in a random order using gloves, but wrote that utensils were optional. Alongside other Hutt delicacies, the dish was served in 19 ABY at a feast held by the Hutt crime lord Popara Anjiliac Diresto in his penthouse on the planet Nal Hutta."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Braised fork tarts were first mentioned in the 2001 book Galactic Phrase Book & Travel Guide, which was written by Ben Burtt. In 2012, they made their first appearance in the novel Scourge, which was written by Jeff Grubb as the novelized version of the Wizards of the Coast Star Wars Roleplaying Game adventure Tempest Feud."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}