{"url": "Brak_sector", "categories": ["Category:Legends articles", "Category:Brak sector", "Category:Confederacy of Independent Systems sectors", "Category:Expansion Region sectors", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors"], "nodes": [{"tag": "h1", "text": "Brak sector"}, {"tag": "p", "text": "The Brak sector was a sector located in the Expansion Region approximately twenty light-years from the Corellian Run on The Slice. On the Empire's official reports it was listed as containing 67 inhabited systems and 355 uninhabited systems. The actual number of inhabited systems was around 90 counting the small, undocumented colonies and unofficial operations that existed in the sector."}, {"tag": "p", "text": "The sector was home to only one native sentient species, the Aramandi. They were a fairly isolationist group whose home worlds were located in the Aramand Cluster."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the rule of the Galactic Empire, the sector was governed by Moff Lesan Ramier. The Imperial Navy only maintained a standard Sector Group of 2,400 ships (including 30 Star Destroyers) in the sector since most of the sector was owned or dependent upon the Lant Mining Corporation, a company loyal to the Empire. Admiral Garrik Trier was in command of the Navy's forces."}, {"tag": "p", "text": "Around the time of the Battle of Yavin the Rebel Alliance had begun building up a sizable presence in the Brak sector under General Trep Reskan. The Alliance maintained a number of small bases in uninhabited systems with their main operations point being Oracle Base in the Tel system."}, {"tag": "p", "text": "At the height of the New Order an independent shipyard, Bacrana Shipyards, operated in this sector yet remained free of the Empire."}, {"tag": "p", "text": "Following the Battle of Endor, the Brak sector was among the first sectors to throw off the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}