{"url": "Brand", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:61st Mobile Infantry personnel", "Category:Bounty hunters", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Brand"}, {"tag": "p", "text": "Brand, born Lauren Mel Coelho on the planet Tangenine, was a human female member of the Alliance to Restore the Republic's 61st Mobile Infantry, commonly known as Twilight Company. Prior to her service in Twilight Company, Lauren worked as a bounty hunter under her new name Brand following the death of her family under the Malandro syndicate. She brought those skills with her to Twilight Company, serving as a sniper and tracker for the company. Brand tended to be aloof and preferred working with a higher degree of operational freedom than her fellow soldiers in Twilight Company."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Lauren Mel Coelho was born on the planet Tangenine between around 40 BBY and 38 BBY, to Remba and Kelven, who nicknamed her Lau. She attended a school on the world. Coelho's family owned a norango farm but were being extorted by the Malandro syndicate. One day her parents called her over to her farmhouse and sent her away with her infant brother, Julien, to her gran. As Coelho fled the farm with Julien on her back, Remba and Kelven were confronted and killed by the Falleen gangster Annaz, as Remba had refused to pay protection fees to the Malandro syndicate. Coelho and Julien live with their gran until she died of a fever a few years later. When Julien fell ill Coelho took a job stealing a speeder for the Malandro syndicate to pay for the cure but was caught in the process and landed in jail. By the time she got out Julien was dead."}, {"tag": "h3", "text": "A new life"}, {"tag": "p", "text": "A few years later the Galactic Empire took control of Tangenine and soon realized how embedded the Malandro syndicate was and turned to bounty hunters in order to clean up the underworld for them. Coelho then reappeared with a new name, Brand. She took jobs almost primarily on the Malandro syndicate, including Annaz herself. But as order came back to Tangenine, Brand started to witness the more corrupt side of the Empire, a thief was given a life sentence and a gang leader and dealer was pardoned after bribing a magistrate."}, {"tag": "h3", "text": "Hunt for Micha Evon"}, {"tag": "p", "text": "Brand later got sick of the corruption on Tangenine and took a job off-world. Her target was Captain Micha Evon of the Rebel Alliance's 61st Mobile Infantry, better known as Twilight Company. She tracked Twilight Company to Veron and offered to join. She then smuggled in her kit and when the company was on backwater planet Allst Prime she got her chance. She and captain Evon stormed into the governor's office and Brand incapacitated Governor Magé. She then pointed her blaster at Evon but hesitated when he revealed what he knew about her past life. He then offered her to stay with the 61st and she accepted."}, {"tag": "h3", "text": "Member of the Rebel Alliance"}, {"tag": "p", "text": "For the next few years Brand fought with Twilight Company against the Empire on many different worlds. During the company's campaign on Haidoral Prime in 3 ABY, she, Sergeant Hazram Namir, Gadren, and Charmer infiltrated the governor's mansion and captured the defecting Governor Everi Chalis. She offered information on the Empire's workings to the Alliance and Captain Evon put that to the test with her information on a distillery of Coyerti of which Brand, Namir, Gadren and fresh recruit Roach destroyed. The Alliance High Command then decided to invite Chalis, Evon, Namir, and soldiers Roja and Beak to Echo base. In the meantime Brand and the rest of Twilight Company would rendezvous with a flotilla of a dozen ships to repair their CR90 corvette, the Thunderstrike."}, {"tag": "h4", "text": "Elochar Sector"}, {"tag": "p", "text": "During their time at the flotilla, the Twilight Company soldiers visited the other starships, Captain So-Hem of the vessel theSixmoon inviting troops to visit his ship. Near the end of their time there, the light freighter Trumpet's Call jumped to the rendezvous with its life support failing and most of its crew dead. Brand and the others rescued the survivors and when they were in a stable condition, Brand inspected the ships database. Brand discovered that none of the survivors they took in were from the Trumpet's Call's crew log and were Imperial spies. By the time she got back onto the ship the spies had killed Lieutenant Sairgon, Commander Paonu and most of the bridge crew. Sairgon had warned the rest of the flotilla before his death and all of the ships fled except for the Thunderstrike's escort the Braha'tok-class gunship Apailana's Promise. Brand helped retake the Thunderstrike from the spies and they narrowly evaded destruction from the Imperial II-class Star Destroyer Herald."}, {"tag": "h4", "text": "Retreat to Ankhural"}, {"tag": "p", "text": "Twilight Company fled to pirate backwater world Ankhural where it would continue the repairs on the Thunderstrike. Chalis and Namir returned from Echo Base where the Empire had attacked them and Darth Vader had slaughtered Evon, Roja, and Beak. For the next few weeks Brand and Twilight Company stayed there and continued the repairs until Chalis proposed Operation Ringbreaker where they attacked multiple Imperial locations to force redeployments of security forces away from Kuat Drive Yards, the final target. The senior members of Twilight Company approved of the plan and attacked various Imperial holdouts before their attack on the manufacturing planet Sullust ended with the Empire's Vixus Squadron ambushing and shooting down the Thunderstrike. With the Apailana's Promise fleeing Sullust the 61st was stranded at the factory Inyusu Tor that they had just taken and the Herald was on its way to help the imperial ground forces that were preparing to attack them."}, {"tag": "h4", "text": "Siege for Inyusu Tor"}, {"tag": "p", "text": "When the Herald finally arrived the ground, Empire's forces advanced on the entrenched rebels. Brand helped hold the line and fend off the advancing Imperials whilst the Apailana's Promise had returned to keep the Herald's cannons pointing away from the ground. Chalis abandoned Twilight Company and took a shuttle up to the Herald where she sabotaged the Star Destroyer upon arrival with an ion bomb in the shuttle forcing the warship to retreat. It left Brand and the others to fend off the remaining ground forces. Once the ground battle was over, the locals overthrew the remaining Imperials on Sullust."}, {"tag": "h3", "text": "New Republic service"}, {"tag": "p", "text": "Following the Battle of Endor, the Rebel Alliance transitioned into the New Republic. Twilight Company continued to serve as an infantry unit under the reorganized faction."}, {"tag": "h4", "text": "Siege of Troithe"}, {"tag": "p", "text": "Twilight Company was deployed alongside the General Hera Syndulla's battle group to the Campaign in the Cerberon system, and spend weeks fighting in the Troithe operation. Brand was present with other Twilight Company soldiers on Asteroid CER952B and stood with Namir when he spoke with the New Republic pilot Wyl Lark."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Brand first appeared in the 2015 novel Battlefront: Twilight Company by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}