{"url": "8th_Sector_Army", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Sector Armies"], "nodes": [{"tag": "h1", "text": "8th Sector Army"}, {"tag": "p", "text": "The 8th Sector Army was one of the twenty Sector Armies in the Grand Army of the Republic that were active during the Clone Wars. The Sector Army consisted of 147,456 clone troopers that were divided into four corps and was attached to one of the Republic Navy's twenty numbered fleets. Located in the northern quadrant of the galaxy, the army was headquartered on the Mid Rim planet Ord Mantell during the war."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As a Sector Army of the Grand Army of the Republic during the Clone Wars, the 8th Sector Army was responsible for the defense of their specific area. At the start of the war, the Grand Army was organized into ten Systems Armies. They in turn were split into two Sector Armies and were drawn from a specific area of the galaxy. As a result, the 8th Sector Army belonged to the same Systems Army as another. The 8th Sector Army served in the northern quadrant of the galaxy alongside the 7th–12th Sector Armies."}, {"tag": "p", "text": "Like other Sector Armies, the 8th Sector Army had one of twenty Galactic Republic Haven-class medical stations towed to them, and contained 147,456 clone troopers who were apportioned into four corps. Comparable to other Sector Armies, the army was attached to one of the twenty numbered fleets of the Republic Navy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the years that followed the Clone Wars' First Battle of Geonosis, the Mid Rim shadowport planet Ord Mantell hosted several Republic Military installations, including a storage facility, barracks, and a fleet support base. As such, Ord Mantell became the headquarters of the 8th Sector Army during the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the new Star Wars canon, the 8th Sector Army was first indirectly mentioned as one of twenty Sector Armies in the eighteenth issue of the De Agostini magazine Star Wars: Build the Millennium Falcon, published around May 6, 2015. It was later identified separately in the forty-eighth issue, released around December 2 of the same year. In the Star Wars Legends continuity, the Eighth Army debuted in the 2012 reference book The Essential Guide to Warfare, written by Jason Fry and Paul R. Urquhart."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}