{"url": "Bravaisian", "categories": ["Category:Canon articles", "Category:Bravaisians", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Bravaisian"}, {"tag": "p", "text": "The Bravaisians were a short, long-snouted sentient species that were native to Bravais. They had a dexterous tongue that they often used instead of their fingers. They were nocturnal, due to the intense heat of their homeworld and avoided daylight to protect their small sensitive eyes. When offworld, most Bravaisians wore goggles to protect their eyes. They also developed from a precursor species. Munduri and Sonsigo were two Bravaisians who were frequent sights at the castle of Maz Kanata."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Bravaisians were a humanoid sentient species that stood at a diminutive height, with blue, leathery skin and two arms that ended in four digits. They had snouts that faded to pink at their end. These snouts contained a prehensile tongue as dexterous as their fingers. Bravaisians would alternate between using their fingers and their tongues."}, {"tag": "p", "text": "Bravaisians were nocturnal due to the intense heat and lack of life on Bravais during the day. As a result, they had small eyes that could easily be overwhelmed by light. For this reason, most members of the species were rarely seen without protective goggles while offworld. Some even had their eyes surgically removed to combat this problem."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Bravaisians could make a squawking sound if disturbed. Due to them being nocturnal, Bravaisians viewed other species' insistence on doing business during daylight hours with a mix of pity and contempt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Bravaisians evolved from pack hunters, that used their tough, flexible snouts to dig through soil and dirt in order to find their prey, which were tubers and nests of insects. They would then suck up these with their long muscular tongues."}, {"tag": "h2", "text": "Bravaisians in the galaxy"}, {"tag": "p", "text": "During the High Republic Era, a Force-sensitive Bravaisian named Bibs served as a Padawan of the Jedi Order. Sometime prior to the Battle of Takodana, a Bravaisian was arguing with Gwellis Bagnoro in the castle owned by Maz Kanata on Takodana."}, {"tag": "p", "text": "Sonsigo and Munduri were two Bravaisian podmates who were frequent visitors to Kanata's castle. There, they would buy glittering gems and precious metals, and they would offer top prices for them. The pair were careful in the appraisal of their wares, which was a process that could involve using their tongues, fingers and an electro refractometer. They were both present at Kanata's Castle when the Astromech droid BB-8, carrying a portion of a map that led to Luke Skywalker, arrived at the castle along with the smuggler Han Solo, former stormtrooper Finn and scavenger Rey."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bravaisians were created for the Takodana sequence of the film Star Wars: Episode VII The Force Awakens, but were first mentioned in \"The Face of Evil\", a short story by Landry Q. Walker, which was released on December 1, 2015"}, {"tag": "p", "text": "For The Force Awakens, Sonsigo and Munduri were both hand puppets, controlled by their performers from underneath the bench the characters sat on. The performer responsible for Sonsigo was Olly Taylor, and Damian Farrell was responsible for Munduri. Both men were creature and droid performers. During the production of the film, Munduri and Sonsigo were known as \"snooty pirates\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}