{"url": "Bravo_1", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:N-1 starfighters", "Category:Naboo starships"], "nodes": [{"tag": "h1", "text": "Bravo 1"}, {"tag": "p", "text": "Captain Ric Olié piloted the N-1 starfighter Bravo 1 as the leader of Bravo Flight, a squadron in the Naboo Royal Space Fighter Corps. Bravo 1 was manufactured around the year 33 BBY, and Olié later outfitted the craft with a personalized control cluster. In 32 BBY, Bravo 1 and the rest of Bravo Flight were interned in a hangar during the Trade Federation's subjugation of Olié's homeworld, the planet Naboo. Once freed, Olié, in Bravo 1, led his pilots in an attempt to destroy transmitters on an orbiting Lucrehulk-class Droid Control Ship, the Vuutun Palaa, that controlled the Droid Army employed by the invading megacorporation. When one of Bravo Squadron's fighters destroyed the entire Control Ship, the Droid Army was deactivated and Naboo was freed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Bravo 1 was an N-1 series Naboo starfighter designed by the Theed Palace Space Vessel Engineering Corps and Nubia Star Drives, Incorporated for use in the planet of Naboo's Royal Space Fighter Corp, the dogfighting branch of the Royal Naboo Security Forces. As it was flown in royal service, the yellow starfighter was given a traditional chromium finish across the bow and on its underside. The three-pronged starship was eleven meters long. Captain Ric Olié, who piloted Bravo 1 as the commander of a squadron called Bravo Flight, outfitted the vessel with a customized control cluster."}, {"tag": "p", "text": "Along the central prong rested a cockpit that had room for a single pilot, immediately anterior to a space for an astromech droid and a pylon for connecting to hangar fueling stations. There was Futhark script on the outside of the cockpit to the pilot's left. Weapon systems were housed in front of the cockpit and consisted of a complement of eight proton torpedoes and two laser cannons that fired green bolts. The torpedoes, released from two internal dispensors, fired from a single launch tube located under the craft's bow. The outer prongs were Bravo 1's wings, each sporting a 221 sublight engine. For faster-than-light travel, it was propelled by a Monarc C-4 hyperdrive. Bravo 1 was also equipped with life support, communication systems, deflector shields, and a sophisticated autopilot."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "From his coronation, Naboo's King Ars Veruna worked with Nubia Star Drives, Incorporated and the Theed Palace Space Vessel Engineering Corps to design the N-1 starfighter. By the time of his abdication of the throne in 33 BBY, Veruna had had some of the starfighters constructed. One of the first manufactured, Bravo 1 was assigned to a new squadron, Bravo Flight, the first composed entirely of N-1s. Bravo 1 was piloted by the squadron's leader, Ric Olié, under the call sign Bravo Leader, and it saw combat at the planet Chommell Minor against a group of pirates. To test his new ship and the rest of Bravo Squadron, Olié led them on strafing runs destroying asteroids. At some point, Olié personally modified the craft's control configurations to his liking."}, {"tag": "p", "text": "In 32 BBY, the Trade Federation responded to increased taxation by the Galactic Republic with an invasion and blockade of Naboo. Bravo 1, alongside other Bravo starfighters and their pilots, was within Theed Hangar in the planetary capital, Theed, when the Federation took control of that building. After a month of failed negotiations, Veruna's successor as the Monarch of Naboo, Queen Padmé Amidala, was liberated from Federation custody by two Jedi, Qui-Gon Jinn and Obi-Wan Kenobi. The trio and Amidala's security detail freed Theed Hangar so they could use her personal craft to reach the galactic capital, the planet of Coruscant, where she could petition the Galactic Republic's Senate for aid. Olié and the other pilots fled the hangar in their Queen's vessel and the Federation retook control of the building, along with Bravo 1 and the other starfighters, in short order."}, {"tag": "p", "text": "When her efforts in the Senate were stalled by bureaucratic practices, the Queen decided to free her homeworld with force; she led a task force to storm her palace. One of her first steps was to free the hangar again so Bravo Squadron could claim its ships and disable the Vuutun Palaa, an orbiting Lucrehulk-class Droid Control Ship that was commanding the Trade Federation Droid Army forces stationed on Naboo. Olié boarded Bravo 1 with his personal astromech droid, R2-A6, and his Squadron took flight. While approaching the Control Ship, Olié transmitted the coordinates of the space battle to every N-1 starfighter in the area so any available ships could assist them. Bravo 1 and Bravo Squadron skirmished with enemy Vulture droids and, upon an order from Olié, split into two forces—one to continue to stave off the droids and another to attack the Control Ship's transmitters. Bravo 1 was part of a strafing run, but its laser cannons could not pierce the Control Ship's deflector shields."}, {"tag": "p", "text": "Meanwhile, a Bravo Squadron N-1 from the hangar that was not flown into battle, Bravo Fighter, received the coordinates from Bravo 1, and its autopilot propelled it to that location. After some time, Vulture droids shot down the fighter and it crash-landed inside the Control Ship. When it was brought to Olié's attention, he ordered his pilots to stay out of the Control Ship and to buy Bravo Fighter time to escape. Bravo Fighter's pilot, a boy named Anakin Skywalker, fired proton torpedoes into the ship's main reactor, destroying it. The destruction of the Control Ship deactivated all of the Trade Federation droids on the surface, giving Amidala leverage enough to compel the Federation to sign a treaty and release the planet. Olié continued flying with Bravo Squadron for the next few years afterward."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Ric Olié flew Bravo 1 while fighting with Bravo Squadron. He was born on Naboo, and at the time of the Trade Federation's invasion he was considered the best pilot on that world. Olié believed his R2-series astromech droid, R2-A6, was a good luck charm, so he made sure to fly with that droid when piloting Bravo 1."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bravo 1 first appeared in the novelization of Star Wars: Episode I The Phantom Menace and later in the film itself, both of which were released in 1999. A December 2001 expansion of the Star Wars Customizable Card Game, Theed Palace Limited, contained a card called \"Bravo 1\" that identified the ship as such. The ship's first appearance outside the card and other material expanding upon Episode I was in 2012's Darth Plagueis novel by James Luceno."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}