{"url": "90,000_BBY", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Years in the pre-Republic era"], "nodes": [{"tag": "h1", "text": "90,000 BBY"}, {"tag": "p", "text": "90,000 Before the Battle of Yavin, also known as 56,547 Before the Tho Yor Arrival or 86,347 Before the Treaty of Coruscant, was a year during the Pre-Republic era. Approximately this year, on the planet of Coruscant, Galactic City stood as a many tiered settlement. This was the groundwork for the 5,127 levels, which stretched kilometers from the surface, that would exist by the time of the Clone Wars."}, {"tag": "h2", "text": "Proem"}, {"tag": "p", "text": "By 90,000 BBY, the planet of Coruscant was covered by a cityscape, later known as Galactic City, that had begun to build upwards, layer upon layer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The year 90,000 BBY was mentioned in The Essential Atlas (2009). Coruscant had been established as having many levels of architecture for years before this release, as stated in Dark Apprentice (1994) by Kevin J. Anderson, and some of these levels were stated in The Courtship of Princess Leia—written by Dave Wolverton and published in 1994—to be more than ninety thousand years old by the year 8 ABY."}, {"tag": "p", "text": "The structure of Coruscant was planned to be changed with the release of the video game Star Wars: 1313, which would have extended the planet's stucture to several thousand levels, numbered from the planet's core. The story would have been set five to ten years before the Battle of Yavin, or approximately twenty years before Dark Apprentice, contradicting the preexisting figure of several hundred stories that existed at the later date. With the closure of LucasArts by its owner, The Walt Disney Company, and the cancellation of that game in April 2013, this idea was not adopted because of it. Instead, while Star Wars: 1313 was still in production, a 2013 episode of the Star Wars: The Clone Wars television show, \"To Catch a Jedi,\" was created to tie in obliquely to the game by including levels from 1312 to 1315. A trivia slideshow on StarWars.com that accompanied the episode established the new canonical number of levels to Coruscant, increased from Dark Apprentice."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}