{"url": "9000_Z001_landspeeder", "categories": ["Category:Legends articles", "Category:Landspeeders", "Category:Ubrikkian Industries products"], "nodes": [{"tag": "h1", "text": "9000 Z001 landspeeder"}, {"tag": "p", "text": "The 9000 Z001 landspeeder was a Ubrikkian model commonly used around the time of the Battle of Yavin. It was modified from the 9000 landspeeder, which had been aimed at Ugor customers but had flopped."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Six-point-eight meters in diameter, it carried a single pilot, two passengers, and 50 kilograms of cargo. It could be modified to sit up to six humanoids. The craft hovered up to three meters above the ground and its numerous viewports allowed its driver an excellent field of vision. While not the speediest of vehicles, able to achieve only 160 kilometers per hour, a ring of micro-thrusters around the hull granted exceptional maneuverability."}, {"tag": "p", "text": "The 9000 Z001 was the predecessor of the 9000 Z004 model."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point before 27 BBY, Feena Ghel was selling one unit of this vehicle, customized for the local frozen conditions, in Elesa, capital city of Ando Prime."}, {"tag": "p", "text": "One of these vehicles was seen parked outside Chalmun's Cantina on Tatooine in 0 BBY."}, {"tag": "p", "text": "The Mistryl Shadow Guard Karoly D'ulin used one of these vehicles to follow the pirate Zothip nearly two decades later."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This model appears to be a reference to Stanley Kubrick and his film 2001: A Space Odyssey, as noted by Pablo Hidalgo, whereas Ubrikkian was at one time spelled \"Ubrickkian\", and 9000 refers to HAL 9000."}, {"tag": "p", "text": "The July 4, 1982 Sunday Edition of the Star Wars comic strip's scrapbook section referred to the 9000 Z001 landspeeder as a \"low life droid\", even though it was actually a vehicle, not an actual droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}