{"url": "Bravo_Twelve", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Individuals of unspecified species", "Category:Males", "Category:Pilots", "Category:Resistance fighters", "Category:Royal Naboo Security Force personnel", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Bravo Twelve"}, {"tag": "p", "text": "A male N-1 starfighter pilot had the call sign Bravo Twelve in the Royal Naboo Security Forces. He flew in Bravo Flight around the time of the Invasion of Naboo in 32 BBY. During the invasion he was at a Naboo Resistance base and helped defend the base from the Trade Federation Droid Army. He then flew in a a raid on the Solleu Riverto rescue Naboo prisoners. Bravo Twelve also participated in the final battle of the invasion and destroyed several droid starfighters."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The individual with the call sign Bravo Twelve was a male N-1 starfighter pilot who flew with the Royal Naboo Security Forces' Bravo Flight during the Invasion of Naboo in 32 BBY. He was at a resistance base in the Naboo training canyon when fellow Bravo Flight pilot Rhys Dallows agreed to transport captured Trade Federation munitions to the resistance base. Bravo Twelve was supposed to escort him to the base, but when Dallows arrived, the escorts were not there. Dallows then led Reti into the canyon, where they found Bravo Twelve and Bravo Eight in a dogfight with Scarab starfighters, where Bravo Twelve boasted of the superiority of living pilots. Dallows destroyed the AMTs while the escorts finished off the Scarabs. Together, they continued down the canyon to the base and to the base, which was under attack from a large force of Multi-Troop Transports and Armored Assault Tanks."}, {"tag": "p", "text": "Soon after, the three Naboo Resistance pilots conducted a raid on the Solleu River to free Naboo prisoners from the Trade Federation. Bravo Twelve engaged the Federation forces while the Rescue boats proceeded to the rendezvous point with the freighter Mercatan."}, {"tag": "p", "text": "Bravo Twelve also participated in the final battle of the invasion. He attacked droid starfighters while fellow Bravo pilot Rhys Dallows destroyed the Droid Control Ship's Receiver Stations. When the Stations were destroyed, he engaged a mercenary until the mercenary and Dallows became trapped inside the ship. The Droid Control Ship managed to reroute the signals, and Bravo Twelve continued the attack against the fighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rob Paulsen provided the voice of Bravo Twelve in the 2001 video game Star Wars: Starfighter. Bravo Twelve was also mentioned in the game's strategy guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}