{"url": "Brazen", "categories": ["Category:Legends articles", "Category:Imperial II-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Brazen"}, {"tag": "p", "text": "The Brazen was an Imperial II-class Star Destroyer of the Galactic Empire's Navy that served in the Elrood sector under the command of Captain Alistar Dadefra."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Brazen was dispatched to aid Moff Villis Andal in the Elrood sector after the success of the Khuiumin Survivors pirates under Jacob Nive of raiding Imperial convoys. At first, Dadefra was successful in not only decreasing the number of pirate raids, but also to stifle the rivalry between Captains Tanda Pryl and Akal Zed of Thunderflare and Stalker respectively."}, {"tag": "p", "text": "However, the Brazen was then ambushed near the Degan Gas Clouds by the Khuiumin Survivors, who sought revenge for Dadefra's role in the Battle of Khuiumin. The pirates were defeated, but the Brazen suffered heavy damage: The concentrated attack destroyed the lower, portside Gemon-4 ion engine and heavily damaged the center and port Destroyer-I ion engines. The resulting energy spikes threatened the reactor core, but the engineering crew managed to divert most of the energy away, but they lost most of their lifes in the process. Although their efforts prevented a destruction of the ship, the overloads destroyed power feeds, armor plating up to two meters thick and buckled the superstructure."}, {"tag": "p", "text": "The Brazen, despite severely damaged, made its way back to Derilyn, where a large riot had broken out after Rebel agents had infiltrated the Arena of Games. The Empire put a complete lockdown on Derilyn and recruited every available technician for Operation: Elrood. All the Brazen's port engines had to be replaced, but the facilities of the Derilyn Space Defense Platform were too limited to conduct full repairs. The plan was to perform limited repairs on the Star Destroyer so she would be able to reach the Imperial deepdock in the Metharian Nebula."}, {"tag": "p", "text": "The same Rebel agents that caused the riot earlier, aided by the resistance group Friends of Paran, infiltrated the space platform where the Star Destroyer was docked and planned to destroy it using improvised explosive devices planted at the now exposed engines. Additionally, Rebel agent Shondra Del contacted the Khuiumin Survivors, who threw all their remaining forces at the Star Destroyer. The operation was successful an the Brazen was destroyed, the platform severely damaged and Captin Dadefra killed in battle."}, {"tag": "p", "text": "Imperial HoloVision later reported at 36:4:16 that the destruction of the Brazen was probably caused by a worker error near the main reactor, while the Imperial Navy conducted a thorough investigation on the incident. Moff Villis Andal and General Afren Hul, humiliated by this defeat, were on the verge of losing their positions, although the Elrood sector remained an Imperial stronghold until the Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Brazen was created for the Operation: Elrood adventure supplement for the Star Wars: The Roleplaying Game published by West End Games. The infiltration of the Derilyn Space Defense Platform and the destruction of the Star Destroyer served as the climax for a three-parted campaign set in the Elrood sector, with Captain Dadefra performing a similar role like Grand Moff Tarkin in the movies."}, {"tag": "p", "text": "The Brazen was pictured on the cover of the book using a modified stock image of the Star Destroyer Avenger from Star Wars: Episode V The Empire Strikes Back. Another image inside the book was drawn by Mike Vilardi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}