{"url": "Breha_Organa", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic members", "Category:Cyborgs", "Category:Females", "Category:Galactic Republic individuals", "Category:House of Organa", "Category:Humans", "Category:Martial artists", "Category:Monarchs of Alderaan"], "nodes": [{"tag": "h1", "text": "Breha Organa"}, {"tag": "p", "text": "Breha Organa was a human female who served as Queen of the planet Alderaan during the Clone Wars and the early days of the Galactic Civil War. At the end of the Clone Wars, she and her husband, Senator Bail Prestor Organa, adopted the newborn Leia. The girl, the biological daughter of the late Senator Padmé Amidala of Naboo and fallen Jedi Knight Anakin Skywalker, became Princess Leia Organa of Alderaan."}, {"tag": "p", "text": "Throughout her years as monarch, the queen personally mentored a select number of young Alderaanians to teach them the culture and heritage of their planet. During the reign of the Galactic Empire, Organa's Alderaan was considered by the Empire to be a source of rebellious activity. The planet became an early supporter of the Alliance to Restore the Republic. Organa and her husband were both killed shortly before the Battle of Yavin, when the Empire destroyed Alderaan with its deep space mobile battle station, the Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A member of the galaxy's Elder Houses, the girl who would become Breha Organa hailed from the planet of Alderaan, a peaceful and influential planet. She was related to Bail Antilles, who represented their home planet in the Senate of the Galactic Republic. As a child, she grew up in the Royal Palace of Aldera, the planet's capital city. She was introduced to Alderaanian pacifist values by her mother, and was first in line to inherit the mantle of Queen of Alderaan. At some point before she was fourteen, Princess Breha accompanied the queen to help her negotiate a treaty."}, {"tag": "p", "text": "At the age of sixteen, she underwent her Day of Demand ceremony, during which she claimed her right to the throne by naming three challenges she would have to complete to prove herself worthy. While completing her Challenge of the Body, Breha suffered a bad fall, and her injuries nearly killed her, if not for the quick action by the guards who were observing at a distance. Although she did survive, her heart and lungs had to be replaced by pulmonodes. Unlike most people who received such mechanized organ replacements, however, she refused to encase them in new flesh and skin, choosing instead to keep them visible as a reminder that she lived."}, {"tag": "p", "text": "At some point between 40 BBY and 28 BBY, Breha ascended to the throne and married Bail Prestor Organa, a fellow Alderaanian noble who was a distant kinsman to Lord Mellowyn of Birren. Although she and her spouse wished to have a child, the stress placed on the Queen's body from the incident led the couple to decide to adopt an heir instead of trying to conceive one."}, {"tag": "h3", "text": "Queen of Alderaan"}, {"tag": "p", "text": "By 28 BBY, Breha Organa ruled as the Queen of Alderaan. She was a relative of Bail Antilles, a former senator of Alderaan in the Galactic Senate, and the wife of his successor, the Senator and Viceroy Bail Organa. She also served as the minister of education for her planet. During Queen Breha's reign, and through her husband's efforts in the Senate, Alderaan advocated ending the Clone Wars between the Republic and the Confederacy of Independent Systems, due to the planet's pacifist beliefs, and hosted a conference to assist refugees displaced by the galactic conflict."}, {"tag": "p", "text": "When the Clone Wars came to an end, Supreme Chancellor Palpatine—secretly the Dark Lord of the Sith, Darth Sidious, who manipulated the conflict to his own tyranical ends—abolished the Republic and transformed it into the Galactic Empire, with himself as absolute ruler. He also issued Order 66, a command to all clone troopers to kill their Jedi leaders, thus destroying the Jedi Order. During that time, Senator Padmé Amidala gave birth to twins, Luke and Leia, before dying. The children's father, Jedi Knight Anakin Skywalker, had also turned to the dark side of the Force and become Darth Vader bringing an end to both the Jedi and the Separatists. Knowing that the children would be in danger if the Sith discovered their existence—both the Emperor and Vader believed that Amidala died before giving birth—it was decided that Jedi Master Obi-Wan Kenobi would take Luke to live with Vader's family on Tatooine. With the consent of both Kenobi and Master Yoda, Bail decided that he and his wife would adopt Leia and raise her as their daughter; the two had always wanted to adopt a girl. The Queen then received a letter from her husband, informing her of Amidala's passing and the imminent arrival of something that would \"change [their] lives forever in a profound way.\" When the Viceroy finally came back to the palace, he placed baby Leia in the arms of the Queen, who gazed lovingly at her new daughter."}, {"tag": "p", "text": "One day, as the queen had retreated to the palace's gardens to read a book, she welcomed her toddler daughter, who had escaped the vigilance of her attendant droid WA-2V. As an intrigued Leia pointed at a nearby statue of the late Padmé Amidala, Queen Breha started recounting the story of the Naboo stateswoman, from her days in the Apprentice Legislature to her tragic death. She ended the story with the lesson that Amidala had a spark of hope in her, and that Leia had it too."}, {"tag": "p", "text": "In the years that followed the Emperor's rise to power, the Queen personally mentored a select number of young Alderaanians, teaching them about the heritage of their homeworld. One of her pupils in particular, a girl named Evaan Verlaine, was so thankful for that privilege that she developed a staunch, lifelong loyalty to the House of Organa and became a committed royalist. Breha's husband, while still part of the ceremonial Imperial Senate, became involved in an underground rebel network, which ultimately evolved into a formal Alliance to Restore the Republic."}, {"tag": "p", "text": "Alderaan was among the earliest supporters of the Alliance, although its officials cautiously avoided supporting it openly. The Queen and her husband became close friends with Jan Dodonna, a General in the Alliance. In time, Princess Leia replaced her father in the Senate and joined the Alliance. At some point, the Queen passed down her necklace, the chalcedony waves, to the princess."}, {"tag": "p", "text": "In 9 BBY, the Queen officiated a ceremony at Aldera during which Miara Larte of the Alderaanian consular security was promoted to the rank of captain at the request of the viceroy. On that day, several other promotions were handed out as well."}, {"tag": "h3", "text": "Death and legacy"}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Vader—who did not know Leia was his daughter—captured the princess, who had been part of the theft of the plans to the Death Star, the Empire's planet-killing deep space mobile battle station. Leia was captured and brought aboard the Death Star, where she was interrogated for information about the location of the Rebel base—the Great Temple on Yavin 4. Because she refused to provide the location, Grand Moff Wilhuff Tarkin, the station's commander and Governor of the Outer Rim Territories, threatened to destroy Alderaan if she did not comply. The princess provided a false location and, though Tarkin trusted her, the Grand Moff nonetheless chose to target Alderaan; the Empire considered it to be a haven for rebellious activity, and Tarkin believed destroying it would be an effective demonstration of the station's power. The planet was destroyed upon being hit by the Death Star's superlaser, killing all who resided upon it—including Queen Breha and her husband. Breha had worried about Leia while she was on her mission, and as Bail was away, she could not talk to anyone else, due to security concerns. She was supposed to be planning for the upcoming equinox festivities, but had no enthusiasm for it. Bail's return home from Yavin 4 only amplified Breha's worry, as the Viceroy had learned that the Tantive IV, Leia's ship, had been captured and destroyed. The Queen knew nothing of her daughter's fate, and was intensely worried. Breha and Bail saw the Death Star eclipse Alderaan's sun, and the Viceroy, horrified, realized what was about to happen and told his wife. They died together, both hoping that Leia was still alive and safe."}, {"tag": "p", "text": "After the planet's destruction, which Alderaanians who were off-world took to calling \"the Disaster,\" the Rebel Alliance managed to destroy the Death Star during the Battle of Yavin. Statues of the Queen and the Viceroy were raised in the Rebel base on Yavin 4 as a tribute to the royal couple. During a ceremony commemorating the Rebellion's victory, Leia asked that the Rebels in attendance honor those who died on Alderaan, including her adoptive parents. Evaan, likewise, paid her respects to the royals in front of the statues. As Leia coped with her loss in a way that made her seem indifferent, Evaan resented the princess for not mourning her parents properly. Evaan nonetheless pledged her loyalty to the princess, and the two left Yavin 4 on a mission to save living Alderaanians from the wrath of the Empire. Eventually, Breha's chalcedony waves were bestowed upon the Sullustan Nien Nunb, as a reward for his help evacuating Alderaanians from Sullust."}, {"tag": "p", "text": "Eventually, a collection of documents pertaining to Queen Breha were stored in the archives of the Alderaan Memorial on Coruscant, including the letter in which she learned of little Leia's pending arrival. Breha was also prominently featured in a biography of Leia Organa written during the conflict between the Resistance and the First Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Breha Organa was a human female with tan skin, black hair, and brown eyes. Shortly after the end of the Clone Wars, she wore a blue metallic gown with slit sleeves and a collar adorned with a gold buckle-like brooch. When she wore that gown, the Queen braided a golden fabric into her hair, wrapped it around her head, and put on a semi-transparent blue shawl. She attached a great importance to education, taking time to teach several pupils in-person, in addition to her royal duties."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Unbeknownst to most people, including her daughter, Breha Organa mastered several forms of hand-to-hand fighting, and she mentored a group of selected pupils in combat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Organa wore a blue and bronze slash-sleeved gown that mirrored the beautiful oceans and tranquil valleys of Alderaan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character origins"}, {"tag": "p", "text": "\"Queen Breha\" first appeared in George Lucas's 1974 rough draft of what would become Star Wars: Episode IV A New Hope, where she was the wife of King Kayos of Aquilae, and the mother of a spoiled, fourteen-year-old Princess Leia. In this 132-page early story treatment, Breha was described as \"a warm, silver-haired matron.\" Leia's mother was absent from the final version of the story, which was released on the silver screen on May 25, 1977. However, in 2013, George Lucas's rough draft was adapted into a non-canon comic book series called The Star Wars. That series featured the character Breha of Aquilae, drawn by Mike Mayhew in a style that resembles a concept drawing of Princess Leia in Cloud City, originally made by Ralph McQuarrie for Star Wars: Episode V The Empire Strikes Back."}, {"tag": "p", "text": "George Lucas resurrected the character early in the production of Star Wars: Episode III Revenge of the Sith, the third installment of the Star Wars prequel trilogy. In December 2002, he informed his production staff that Princess Leia's surrogate mother would appear in the movie. Lucas described her as a trustworthy, peaceful woman in her mid-thirties, and illustrator Iain McCaig drew several conceptual artworks based on that description. In one of his drawings, McGaig gave Breha the traits of Padmé Amidala, in an attempt to explain how Leia could remember seeing the smile of her mother. In another piece of concept art, McCaig sought to recreate the likeness of his wife Leonor."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "In May 2005, Breha Organa made her on-screen debut in Star Wars: Episode III Revenge of the Sith, in which she was portrayed by Australian actress and singer Rebecca Jackson Mendoza. Despite being a fan of the original trilogy, Jackson Mendoza did not immediately realize the significance of her role in the Star Wars franchise. When her brothers helped her understand that the Queen was none other than the adopted mother of Princess Leia, her excitement over the role increased. Rebecca Jackson Mendoza remembered having watched the original trilogy as a child, wishing she could be Princess Leia. In light of all that, Jackson Mendoza came to regard that role as something of an accomplishment."}, {"tag": "p", "text": "A single robe, referred to as the \"Alderaan Palace Dress\" in Dressing a Galaxy: The Costumes of Star Wars, was created for Jackson Mendoza by Trisha Biggar, who worked as costume designer for all three prequel films. That robe, which Jackson Mendoza compared to a \"green wedding gown,\" was originally going to be made of velvet, until the fabric was changed for fear it would come off too dark on screen."}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "Queen Breha received her first significant character development in Claudia Gray's 2017 young-adult novel Leia, Princess of Alderaan. Gray said it actually staggered her to realize how little had been written about Breha, who had such a central position in the narrative of Star Wars, being Leia's adopted mother, and a queen at the core of the Rebellion. Therefore, she was keen on giving her a role and a personality."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}