{"url": "Brendol_Hux", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:First Order admirals and generals", "Category:Galactic Republic military officers", "Category:Humans", "Category:Leaders of the First Order", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Brendol Hux"}, {"tag": "p", "text": "Brendol Hux was a human male who served the Galactic Empire. Prior to his service in the Empire, Hux had served as a junior officer in the Grand Army of the Republic, communicating tactics and strategy as determined by Jedi Generals. Some four years before the Battle of Yavin, he was the commandant of the Arkanis Academy. Hux created the Commandant's Cadets, a secret society within his academy, made up of handpicked cadets. After the Imperial defeat at Endor, he was trapped by the New Republic during the Siege of Arkanis. However, he escaped with the help of bounty hunter Mercurial Swift, on the orders of Fleet Admiral Gallius Rax, who appointed him a member of the new Shadow Council. He eventually sired an illegitimate son, Armitage, who would go on to become a general of the First Order as one of its first leaders."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving the Republic and Empire"}, {"tag": "p", "text": "During the Clone Wars, Brendol Hux was a junior officer in the Grand Army of the Republic who communicated tactics and strategies devised by the Galactic Republic's Jedi Generals. Hux admired the combat prowess and dedication of the Republic's clone troopers and the Jedi Order, who had been trained from youth as soldiers and warriors. Following the transformation of the Republic into the Galactic Empire, Hux continued serving the Imperial Military and was eventually transferred to the Imperial Academy on Arkanis. To help run the Academy, Hux also employed the services of a servant droid called DDM-38 or DeeDee, who was charged with keeping the cadets in line. Dissatisfied with the caliber of the Empire's stormtroopers, who were normal human recruits, Hux conceived the idea of training stormtrooper recruits from birth who would be excellent soldiers and loyal servants of the Empire."}, {"tag": "p", "text": "Unable to find fellow officers who would support his ideas, Hux decided to create his own loyal cadre of officers from among the Imperial cadets at the Arkanis Academy. Eventually, Hux succeeded in creating a secret society known as the Commandant's Cadets which operated outside of the official Imperial hierarchy. To join the Commandant's Cadets, prospective members had to kill a fellow cadet while making their deaths appear to be an accident. As a result, several cadets were killed under suspicious circumstances during training exercises. Commandant's Cadets were given special privileges including being allowed to sit at a special table in the Academy's mess hall. About four years before the Battle of Yavin, Hux had recruited at least ten Commandant's Cadets including Orman le Hivre and Rav Horan."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "h4", "text": "Forging young officers"}, {"tag": "p", "text": "Shortly later, a promising young cadet from Lothal named Zare Leonis was transferred to the Arkanis Academy as a \"reward\" for his loyalty to the Empire. However, this was a ruse created by the Grand Inquisitor, who wanted to investigate Zare's ties to Dev Morgan's rebel cell. In reality, Leonis was a secret rebel sympathizer who had joined the Academy in order to find his sister Dhara Leonis, who had been forcibly inducted by the Grand Inquisitor into Project Harvester, which was based in Area Null, a secluded tower attached to the Arkanis Academy."}, {"tag": "p", "text": "Following Leonis' arrival, Hux identified Anya Razar as a prospective candidate for the Commandant's Cadets. Later, Anya was placed in charge of a five-member scouting mission during a field exercise that included the Cadets Leonis, Penn Zarang, Tigard Manes, Chan Harra, and Xan Lanier, a low-performing Cadet who had been marked for death by the Commandant's Cadets. As part of this field exercise, the cadets and their diplopod mounts had to navigate forward while under live-fire. During that exercise, Lanier was killed in an explosion that also killed his and Leonis' diplopod mounts. Lanier's death was subsequently hushed up and Razar was formally inducted during into the Commandant's Cadets during a night ceremony at Area Null. When Leonis tried to follow Razar and the Commandant's Cadets into the tower, he was stopped by DeeDee, who issued him with demerits."}, {"tag": "p", "text": "After Razar's induction, Commandant Hux convened an assembly at the banquet hall which was followed by dinner. During the dinner, the Commandant was visited by the Grand Inquisitor, who spoke to Hux privately. Leonis observed the meeting and noted that the two Imperial officials were arguing. When the Inquisitor noticed Leonis looking at them, he ceased arguing with Hux. Following the dinner, the Grand Inquisitor summoned Leonis for a private meeting at the Commandant's balcony, with the consent of Hux. During the meeting, the Inquisitor warned Leonis that he was close to uncovering his secret connection to the Spectres. Before he could interrogate Leonis further, he was recalled for a priority mission to Lothal which subsequently claimed his life."}, {"tag": "p", "text": "A few days later, Commandant Hux, with DeeDee's assistance, summoned the Academy's cadets to a cliff edge overlooking a nearby beach. A nerf calf had strayed from the Academy's grounds to search the beach for salt only to be devoured by a sea monster. Hux took the opportunity to lecture the cadets about the value of training and asked them to come up with ideas on how to prevent future incidents from recurring. When Tigard Manes suggested a gate, the Commandant responded that gates would delay those who had business on the sea and reminded the cadets that they could not wall themselves from all of the galaxy's dangers. He then challenged the other cadets to come up with other ideas."}, {"tag": "p", "text": "When other cadets proposed drone monitors and shock fields, Hux rejected them. However, he welcome Le Hivre's suggestion that they should allow natural selection to eliminate those nerfs which had a taste salt. Hux then asked his cadets if they could come up to a more proactive solution that simply letting nature do its work. When Leonis recommended buying salt for the nerfs, Hux responded that coddling their weaknesses would prevent the development of a strong herd. After Leonis contended that buying salt was better than dead nerfs, Hux took the opportunity to lecture the cadets that the best solution was training the nerfs to avoid the beach. Anya then pointed out that it was only the juvenile nerfs who craved salt. Hux reiterated that they had to train the nerf herd from young to avoid the beach. Having made his point, Hux then informed the cadets that they would be embarking on training exercise on the planet Sirpar the following day, which he regarded as an ideal testing ground for officers."}, {"tag": "h4", "text": "The rebel infiltrator"}, {"tag": "p", "text": "Following the grueling three-day exercise on Sirpar, Le Hivre identified Leonis as another candidate for the Commandant's Cadets and informed the Commandant. The conclusion of the Sirpar training exercise also coincided with the arrival of Lieutenant Chiron, an instructor at Lothal's Academy for Young Imperials, who had been transferred following a shake-up in the Academy's leadership. Unknown to Hux, Chiron had been dispatched by Grand Moff Wilhuff Tarkin to investigate rumors that Hux had created a secret society outside the official Imperial chain of command. Using his position as a prospective Commandant's Cadet, Leonis offered to help Chiron investigate the Commandant's Cadets."}, {"tag": "p", "text": "After Leonis learned that he had to kill a fellow Cadet named Penn Zarang in order to join the Commandant's Cadets, he informed Chiron who helped stage Zarang's death. After burying a rotten side of nerf in \"Zarang's\" grave, Chiron arranged for Zarang to go into hiding. This ruse satisfied Le Hivre and Anya, who subsequently informed Commandant Hux. One evening, Hux invited Leonis to attend a formal dinner with the other Commandant's Cadets. During the dinner, Hux described his vision for the Empire and talked about how the Commandant's Cadets would bring it to fruition. Following the dinner, Hux announced that they would be initiating Leonis into the organization. The initiation ceremony was to take place at Area Null."}, {"tag": "p", "text": "Before they could enter the building, another group was exiting the ceremonial room. This group turned out to be former dissidents who had been enrolled in an Imperial re-education program known as Project Unity. One of the participants was Beck Ollet, one of Zare's former classmates on Lothal and a rebel sympathizer. He promptly identified Leonis as a rebel infiltrator. As a result, Leonis was interrogated and subsequently confessed to working with Dev Morgan and his rebel cell. However, he withheld any information about Chiron's secret investigation into the Commandant's Cadets."}, {"tag": "p", "text": "Leonis was tried by a military tribunal with Colonel Julyan, an instructor at the Arkanis Academy, serving as both the judge and prosecutor. Commandant Hux, DeeDee, and the Commandant's Cadets attended the proceedings and watched as Leonis acknowledged his involvement in the rebellion and pleaded guilty to various charges including fraudulent enlistment, aiding the Empire's enemies, sedition, and treason. Hux and the Commandant's Cadets also listened to Leonis' speech denouncing the Empire but were unmoved by it. At the conclusion of the trial, Colonel Julyan expelled Leonis from military service and sentenced him to death. However, Leonis and his sister Dhara escaped due to a rescue mission launched by Dev Morgan's rebel associates and Leonis' girlfriend Merei Spanjaf."}, {"tag": "h3", "text": "Joining the Shadow Council"}, {"tag": "p", "text": "At some point, Hux, despite being married to his wife, Maratelle, sired an illegitimate son with a \"kitchen woman,\" whom he named Armitage. Hux would go on to abuse his son on several occasions, often emphasizing his disappointment through verbal and physical means."}, {"tag": "p", "text": "After the Battle of Endor, Arkanis was besieged by the newly-founded New Republic, the successor to the Rebel Alliance that Leonis' allies had helped forge, and was in serious danger of being lost. However, Fleet Admiral Gallius Rax, intent on rebuilding the Empire, ordered his de-facto subordinate Grand Admiral Rae Sloane to \"rescue\" the Commandant from the embattled planet. Rax planned to create a Shadow Council to replace the Imperial Ruling Council and to facilitate the resurgence of the Empire. Sloane then tasked bounty hunter Mercurial Swift to ensure Hux and his son made it off Arkanis safely, which he did."}, {"tag": "p", "text": "Swift brought Hux and his son to the Vulpinus Nebula, where Sloane commanded a sizeable Imperial fleet. Following his rescue, Hux attended a dinner aboard the Super Star Destroyer Ravager with Grand Admiral Sloane, Grand Moff Randd, General Hodnar Borrum, and the Imperial propagandist Ferric Obdur. When Sloane spoke to him and said that she was glad they had evacuated him from Arkanis, he responded that the Arkanis Academy was his life work which produced the best cadets in the Empire. Randd reassured Hux that they would pick themselves up and fight back."}, {"tag": "p", "text": "When Hux interrupted Sloane by lamenting about the dark days facing the Empire, Sloane responded by raising the subject of Hux's illegitimate son. Hux described Armitage as a weak-willed boy but insisted he had potential. Despite Hux's reassurances, the other delegates chuckled. After Fleet Admiral Rax entered the room and announced that the Shadow Council would serve as his brain trust, Hux questioned the relevance of propaganda when the Empire needed people, ships, and vehicles on the ground. Rax responded by revealing that he commanded other Imperial fleets in the Almagest, the Recluse's Nebula, the Ro-Loo Triangle, and the Inamorata nebulae. Hux then outlined his strategy to fight back against the New Republic."}, {"tag": "p", "text": "Following the disappearance of Grand Admiral Sloane during the attack on the New Republic capital Chandrila, Hux and his fellow Shadow Council members attended a meeting chaired by Rax. After Rax reassured the delegates that they would do everything to get Sloane back, Hux asked whether she was privy to the attack on Chandrila. Rax, who had secretly ordered Sloane's assassination, lied that this was the case. Rax then informed the Shadow Council that he had ordered the Imperial fleets to travel to the desert planet of Jakku in the Western Reaches. He also proclaimed himself Counselor to the Empire. In secret, Rax planned to use the upcoming battle to eliminate the other Shadow Council members with the exception of Hux."}, {"tag": "h3", "text": "Serving Counselor Rax"}, {"tag": "p", "text": "For several months, the Imperials on Jakku awaited their showdown with the New Republic. Though Norra Wexley and her team discovered Rax's Imperial armada, the New Republic delayed sending its military forces due to deadlock in the Galactic Senate. During that time, Brendol Hux trained at least two dozen local orphans and children as Gallius Rax's personal guard of child soldiers. These children had been kidnapped by Niima the Hutt, who had struck up an alliance with Rax."}, {"tag": "p", "text": "Since Hux was not a member of either the Imperial Army or Imperial Navy, he was unpopular with the other Imperials on Jakku. Hux also emotionally and physically mistreated his son Armitage, causing the boy to avoid his father. In the days leading up to the Battle of Jakku, Counselor Rax summoned Hux and inquired about the training progress of his new recruits. When Hux pleaded for more time, Rax told him to prove himself with the promise that he would tell him about the secret Contingency plan. When Hux expressed puzzlement, Rax warned that his failure would be punished with being forced to spend the rest of his days wandering the deserts of Jakku. In order to please Rax, Hux replied that he would do whatever Rax requested."}, {"tag": "p", "text": "Rax's child soldiers assassinated the propagandist Ferric Obdur aboard the Ravager. After Sloane and the rebel Brentin Lore Wexley had been captured, Hux brought Rax's child soldiers to a hangar where several stormtroopers were present. Hux witnessed as Rax gave the order for the child soldiers to kill the stormtroopers. Following the massacre, Rax announced that he was bringing about the destruction of the \"Old Empire.\" Pleased with Hux's competence, Counselor Rax ordered Hux and the child soldiers to escort Sloane and Wexley to a tent to watch the Battle of Jakku."}, {"tag": "p", "text": "During the Battle of Jakku, Hux, his son Armitage, the Adviser Yupe Tashu, and the child soldiers traveled on a transport to the Jakku Observatory, a secret site which contained a replica of the late Emperor's luxury yacht Imperialis, a computerized map of the Unknown Regions, and a deep borehole which led to Jakku's core. Prior to his death, the late Emperor had tasked Gallius Rax with carrying out the Contingency plan to destroy the Empire should it outlive him. Rax planned to take Hux and several other select Imperials into the Unknown Regions to rebuild the Empire."}, {"tag": "h3", "text": "In the Unknown Regions"}, {"tag": "p", "text": "Upon disembarking, Rax told Hux to take his son and the child soldiers aboard the Imperialis while he and Tashu went to trigger Jakku's destruction. When Hux tried to question him, Rax told him to trust in him. Rax ultimately killed Tashu before being killed by Sloane with the help of the rebels Norra Wexley and her husband Brentin Lore Wexley. Sloane managed to stop Jakku's self-destruct mechanism before fleeing aboard the Imperialis with the Huxes and the child soldiers. At the urging of the dying Rax, Sloane had decided to venture into the Unknown Regions to rebuild a more resilient version of the Empire."}, {"tag": "p", "text": "Using a series of safe coordinates stored inside a dataspike, the Imperialis traveled through the Unknown Regions for several months. During the journey, Grand Admiral Sloane befriended Hux's son Armitage and promised to protect the boy from his abusive father. Sloane found a despondent Brendol in his room and showed him Rax's bloody cape and the data spike containing the map coordinates. Despite their mutual animosity, Sloane wanted to forge an alliance so that they could rebuild the Empire. Hux tried to strangle Sloane but the Grand Admiral was an experienced martial artist and beat him into submission. Using the threat of physical force, Sloane then ordered Hux to work for her. She also warned him to stop mistreating Armitage and to teach him everything he knew about the Empire. After blubbering, Hux nodded his head."}, {"tag": "p", "text": "For the rest of the journey, Brendol bid his time by training his son and Rax's child soldiers in combat. During that time, Hux trimmed his hair and beard and lost some of his excess weight. Several months after the Battle of Jakku, the Imperialis rendezvoused with the Super Star Destroyer Eclipse, which Rax had sent earlier into the Unknown Regions as part of the Contingency. As they approached the Eclipse, Hux expressed his support for Sloane's plan to rebuild the Empire and remarked \"glory be to Grand Admiral Sloane.\" Sloane responded by corrected him that glory only went to the Empire."}, {"tag": "p", "text": "In Rax's absence, Grand Vizier Mas Amedda sued for peace and signed the Galactic Concordance with the New Republic, officially dissolving the Empire and ending the Galactic Civil War. With the Empire reduced to a remnant hemmed in by harsh war reparations and strict disarmament treaties, the New Republic turned its attention to reshaping the galactic order."}, {"tag": "h3", "text": "First Order"}, {"tag": "p", "text": "Brendol Hux and Armitage joined the Imperial exodus that fled the known galaxy into the Unknown Regions. In exile, the elder Hux raised his son on stories of great Imperials and how the Empire had saved the galaxy from the violence of the Clone Wars."}, {"tag": "p", "text": "Following the Galactic Concordance, many on Arkanis speculated on the circumstances of Hux's disappearance. While some claimed that he had given up, others like the First Order sympathizer and New Republic Senator Lady Carise Sindian believed that a hero of the Empire would not have surrendered so abjectly. While her First Order handlers had not disclosed Hux's fate, she believed that he was somehow aiding them."}, {"tag": "p", "text": "Brendol subsequently rose to the position of General in the First Order army. Hux also ran the First Order's stormtrooper training program and recruited children to train for the First Order. Hux also appointed a promising cadet named CD-0992 as his personal honor guard, gifting him with a suit of red armor. Hux gave him the nickname \"Cardinal\" and even served him a glass of water, something at odds with First Order protocol. Together, Hux and Cardinal ran the First Order's stormtrooper training program, which was based aboard the Resurgent-class Star Destroyer Absolution."}, {"tag": "h4", "text": "Mission to Parnassos"}, {"tag": "h5", "text": "A rough landing"}, {"tag": "p", "text": "At some point before 34 ABY, the now–General Brendol Hux led a mission to the planet Parnassos to recruit warriors for the First Order. However, Hux's starship was shot down by Parnassos' automated defense system. Hux, his droid DDM-38, and three stormtroopers PT-2445 \"Pete,\" LE-2003 \"Elli,\" and HF-0518 \"Huff\" managed to land in an escape pod on the lands of the Claw clan. Hux's ship crashed in the \"dead lands,\" which lay a considerable distance away. Four other stormtroopers escaped in a second pod but lost contact with Hux's group."}, {"tag": "p", "text": "After landing, Hux and his party were captured by the Claw clan, who were led by the Dug Balder. Back at the Claw clan's home, Hux told the Claws through his interpreter droid that he had been traveling the galaxy scouring the galaxy for warriors. Noting the poverty and squalor of the locals, Hux offered to give whoever who would help him and his men retrieve their ship a place in the First Order; promising that they would live in wealth and glory."}, {"tag": "h5", "text": "Phasma of Scyre"}, {"tag": "p", "text": "Before the Claws could consider his offer, a masked female warrior named Phasma claimed that she was the greatest warrior on Parnassos and offered to help Hux find his ship. Phasma was a member of the Scyres, a rival clan. When Balder objected to her presence, Phasma stabbed him to death. During the ensuing skirmish between the Claws and Sycres, Phasma convinced Hux and his troopers to escape with her back to the Scyre territory."}, {"tag": "p", "text": "During the journey, Hux educated Phasma about the First Order. Hux also learnt from Phasma that Parnassos had suffered a calamity which had devastated the planet and reduced its population to a primitive existence. Regarding Hux as her ticket offworld from her devastated homeworld, Phasma resolved to help Hux reach his starship."}, {"tag": "p", "text": "At the Scyre stronghold Nautilus, Hux and Phasma received a cold reception from Phasma's older brother Keldo, the leader of the Scyres who was unhappy that his sister had broken their truce with the Claws. Keldo dismissed Phasma's plan to help Hux and his troopers reach their ship. He also questioned the First Order's might by pointing out that Hux's people had been unable to disable the orbital defense system."}, {"tag": "p", "text": "Unable to reason with Keldo, Phasma, Hux, his stormtroopers, and four of Phasma's most loyal warriors Gosta, Torben, Carr, and Siv departed the Nautilus that night. They also stole the clan's tools and food supplies."}, {"tag": "h5", "text": "A perilous journey"}, {"tag": "p", "text": "After departing the Nautilus, Siv and her fellow warriors educated Hux about detraxors, machines used to extract nutrients from the bodies of the deceased and to convert them into a paste. Coming from a technologically advanced society, Hux expressed revulsion at the thought of harvest the bodies of the dead. He informed his Scyre hosts that the First Order obtained their food through merchants but avoided going into detail."}, {"tag": "p", "text": "The group climbed over a high mountain and landed on a sandy plain covered with volcanic ash. During the journey, Carr was bitten in the hand by a venomous gold and green beetle. Over the next several days, Carr's condition progressively deteriorated before his body disintegrated and imploded, leaving behind only blood, shriveled organs, and translucent bones."}, {"tag": "p", "text": "Over the course of their journey, Hux and Phasma's party fought off two attacks by raiders riding large lizards and a pack of skinwolves, mutated canine predators. During the skinwolves' attack, Hux was bitten in the arm by a skinwolf and he became ill. As the group made camp, Brendol complimented Phasma for her skills as a warrior and told her that she was a worthy candidate for the First Order's training program."}, {"tag": "h5", "text": "Recovering at Con Star"}, {"tag": "p", "text": "Before Brendol's injuries could deteriorate further, the group was led by the protocol droid TB-3 to the Con Star Mining Corporation's Terpsichore Station, the company's main mining facility on Parnassos. Mistaking Hux and his companions for the company's human employees, TB-3 gave them lodging for the night and arranged for Hux to be treated at the station's medbay."}, {"tag": "p", "text": "Since neither Hux's troopers nor Phasma's warriors had the funds to pay for Hux's medical bills, the group was forced to work as indentured miners by the malfunctioning Con Star droids. During their break, Hux and Phasma devised a plan to break into the control room and disable the droids. After two working shifts, the group managed to breach the control room and achieve their objectives. While Siv felt sorry for the droids, Hux blamed the droids' erratic behavior on a lack of regular programming."}, {"tag": "p", "text": "The group then departed Terpsichore Station in a Ground assault vehicle (GAV) while Hux's stormtroopers rode speeder bikes. With little sense of direction, Phasma convinced Hux to trust her and they traveled towards Arratu Station, which was home to a lush and seemingly thriving settlement. On the way, the group's GAV crashed into a ditch filled with spikes and they were captured by several armed warriors calling themselves the Arratu. The stormtrooper Elli also broke her neck when her bike crashed into a ditch."}, {"tag": "h5", "text": "Captives of the Arratu"}, {"tag": "p", "text": "Hux and his traveling companions were then imprisoned in Arratu Station's prison. From the guardian Vrod, Hux and the others learnt that the former mining station had become a city ruled by a tiny wealthy elite and impoverished commoners. The city's ruler, known as the Arratu, staged gladiatorial fights in an arena to entertain the population. Hux and the others were forced take part in these fights."}, {"tag": "p", "text": "Before leaving their cell, Hux allowed Phasma to strip the comatose Elli of her stormtrooper armor. Lacking the means to treat their comrade, they abandoned the dying stormtrooper to the starving prisoners. During the first fight, Phasma and Torben managed to win over the Arratu by defeating his champion Wranderous and several skin-wolves. As a reward, the Arratu gave the prisoners better living quarters and food."}, {"tag": "p", "text": "On the second day, Phasma, Torben and Siv managed to kill Wranderous. Phasma also killed the Arratu and Vrod, creating a leadership vacuum. Taking advantage of the chaos, Hux, Phasma, and the others escaped Arratu in a GAV. Following their escape, Hux privately chastised Phasma for her mistaken decision to travel towards Arratu. However, he also saw that Phasma had potential as a leader and trainer and counseled her to submit to authority in order to reach the top."}, {"tag": "h5", "text": "Back to the stars"}, {"tag": "p", "text": "Continuing their journey, Hux and the group encountered the Gand Churkk, who was completely covered in Parnassos vehicles. From Chukk, they learned that Hux's ship had crashed in the radioactive \"dead lands.\" Shortly later, Phasma's brother Keldo and several Scyre and Claw warriors caught up with the group."}, {"tag": "p", "text": "A fierce battle ensued with both sides suffering heavy casualties. Hux lost his two remaining stormtroopers Pete and Huff while Torben and Gosta also perished in the fighting. Phasma killed her estranged brother following a verbal altercation. Despite the casualties, Hux and the others managed to reach Hux's crashed ship. There, Hux managed to contact the First Order for help."}, {"tag": "p", "text": "Hux's son Armitage soon arrived with a Star Destroyer and an Atmospheric Assault Lander. Phasma accompanied Hux into the First Order and brought Frey, a five-year old girl who was the sole Scyre child. Phasma believed that Frey would make a good soldier. However, Phasma blocked Siv from coming because she had disobeyed her orders to kill Wranderous. Phasma abandoned Siv to die in the \"dead lands\" but she and her unborn child found shelter at Calliope Station."}, {"tag": "h4", "text": "A new protege"}, {"tag": "p", "text": "While departing into space, Hux used his shuttle's laser cannons to orbitally bombard both Arratu Station and the Scyre territory as a demonstration of the First Order's power. Phasma tearfully watched the orbital bombardment but accepted her new place in the First Order. Upon returning to the Absolution, Phasma and Frey were inducted into the First Order. While Frey was placed under the care of Cardinal, Hux placed Phasma in charge of the older stormtrooper cadets."}, {"tag": "p", "text": "Shortly after their return, Hux summoned Cardinal for an impromptu meeting. During the meeting he introduced Cardinal to Phasma and split the stormtrooper training program between Cardinal and Phasma. Phasma was tasked with training the teenagers and adults while Cardinal would continue to train the new and younger recruits. Impressed with her combat skills, Hux also appointed Phasma as his personal bodyguard. Cardinal came to despise Phasma as an outsider who had supplanted his position as Hux's protege and personal bodyguard."}, {"tag": "h4", "text": "Betrayal and death"}, {"tag": "p", "text": "Though Hux had raised Phasma to a position of great power and respectability in the First Order, Phasma was never truly loyal to him nor the First Order. Sometime after Phasma's recruitment and Brendol's return from his shipwreck on Parnassos, Phasma and Armitage met and conspired to assassinate Brendol. Both agreed that the time had come for Brendol to die, and Hux left the actual killing up to Phasma with his only instruction being that she make it untraceable."}, {"tag": "p", "text": "Phasma went on to kill Brendol with the toxin from the bite of a Parnassos beetle, which she had obtained during a return trip to Parnassos to forge her chromium armor. Brendol exhibited symptoms similar to those that Carr had experienced including bloatedness, bulging eyes, falling hair and fingernails, and translucent skin. As a precaution, Phasma also had Frey killed during a training accident since her fellow Scyre was one of the few people who would have known about the dangerous beetle."}, {"tag": "p", "text": "Prior to his death, Cardinal advised Hux to visit the medbay for a checkup. The ailing Hux told Cardinal to mind his own business and respect his superiors. Nevertheless, Hux visited the medbay but his disease was unfamiliar to the medical droids, who listed it as an unknown malady. With the First Order's medical droids unable to treat Hux's sickness, Hux dissolved in a bacta tank, leaving behind only a few shrunken organs, bare bones, and a patch of graying red hair."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Phasma's dark secret"}, {"tag": "p", "text": "Brendol Hux's death remained a closely guarded secret within the First Order. Hux's son Armitage informed Cardinal and an assembly of ten thousand troops that the elder Hux had passed on. Officially, the First Order claimed that Hux had departed on a secret mission for parts unknown. The Resistance, a New Republic–affiliated paramilitary organization, learned the truth about Hux's death when their slicers obtained an old First Order medical droid and managed to unscramble its data."}, {"tag": "p", "text": "In addition, Cardinal was considered to be one of Brendol's best recruits and right-hand man, someone who was spoken highly of by Supreme Leader Snoke himself. As the years passed, Cardinal grew to resent Phasma's role in the First Order stormtrooper training program, regarding her as ruthless and unprincipled. He sought an opportunity to bring down Phasma while still remaining loyal to the First Order."}, {"tag": "p", "text": "An opportunity arose when Cardinal captured the Resistance operative and spy Vi Moradi. In return for food and water, Vi revealed that Phasma had murdered Hux in order to conceal her past. Cardinal sought to inform Armitage about his father's murder only to discover that Armitage had conspired with Phasma. Armed with one of Phasma's daggers and a Parnassos beetle, Cardinal attempted to exact revenge on Phasma. However, his attempt to kill Phasma failed and a grievously wounded Cardinal was rescued by Vi, who spirited him off the Absolution."}, {"tag": "h4", "text": "Reconquering the galaxy"}, {"tag": "p", "text": "Eventually, the First Order arose from the ashes of the defeated Empire. Armitage Hux, having grown up hearing his father's stories about how the Empire saved the galaxy from the chaos of the Clone Wars, followed in his footsteps and became a general within its ranks. Armitage adopted his father's practices to ruthlessly train a new generation of specially-bred stormtroopers to help destroy the Republic and restore what he saw as order to a chaotic galaxy."}, {"tag": "p", "text": "General Hux, the commander of the superweapon known as Starkiller Base, delivered a devastating blow to the New Republic by destroying its capital of Hosnian Prime, but the base was destroyed by the Resistance that had been formed to combat the First Order. General Hux and the First Order, however, lived on to continue fighting."}, {"tag": "p", "text": "By 34 ABY, some First Order officers felt that Brendol would have likely been a preferred option to take the reins of Palpatine's Empire before Snoke rose to become the First Order's Supreme Leader. In 35 ABY, Armitage met his end when he was shot by First Order Allegiant General Enric Pryde after working as a spy for the Resistance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Brendol Hux had pale-white skin and graying red hair. He was a dedicated but ruthless Imperial military officer who wanted to create deeply loyal stormtroopers who excelled in combat. While he admired the combat prowess and devotion of the Old Republic's clone troopers and Jedi Order, he regarded the Empire's stormtroopers as sub-par in comparison to their historical predecessors. As a result, Hux conceived the idea of raising worthy stormtroopers from birth. While his ideas were rejected by contemporary Imperial officers during the reign of Emperor Palpatine, his ideas were readily accepted by the First Order and greatly influenced the military junta's stormtrooper training regime."}, {"tag": "p", "text": "In addition, Hux was a firm believer in natural selection and advocated weeding out \"undesirable\" individuals, whether cadets or nerfs, in order to create a strong population. Hux's adherence to natural selection led him to engineer the deaths of several \"low-performing\" cadets including Xan Lanier. Hux's efforts to raise a strong herd of nerfs led him to reject protective measures in favor of using punishment and the threat of death to bring the animals into line."}, {"tag": "p", "text": "By 5 ABY, Hux had gained weight and his jaw was covered by stubble. Grand Admiral Sloane regarded him as a \"big, blustering, ego-fed pig\" and disliked his habit of interjecting during conversations. Hux was embarrassed when Sloane raised the matter of his illegitimate son Armitage Hux. Hux took pride in his cadets and was annoyed when Sloane suggested that even they were not enough to save the Empire from defeat. While Hux regarded his son as a weak-willed boy, he believed that the boy still had potential. While skeptical of Fleet Admiral Rax's plans, he was mollified when Rax revealed that he commanded several Imperial fleets scattered across the Galaxy."}, {"tag": "p", "text": "The harsh desert conditions of Jakku took a toll on Hux. His hair became unkempt and he developed a paunch. Brendol spent little time with his son Armitage and mistreated the boy physically and psychologically. Brendol used his skills as a commandant to train local orphans into Rax's praetorian guard of assassins and child soldiers. Brendol came to put his faith in Gallius Rax's vision of a resurgent Empire and acquiesced to the Contingency plan. Hux had a poor relationship with Sloane, who disapproved of his harsh treatment of Armitage. Hux was no match for the seasoned Sloane in unarmed combat and became her subordinate ally. The older Hux also exhibited signs of sycophancy after being beaten into submission by Sloane."}, {"tag": "p", "text": "By his sixties, Hux had pale-white skin, graying red hair, slender limbs, and a big belly. He was known to like classical, traditional styles, elegant rugs, fine artifacts, and rich foods. Despite his age, Hux remained a strong leader who was able to command the respect and loyalty of his stormtroopers. Hux saw potential in Phasma as a warrior and leader and believed that she would make an invaluable asset to the First Order. However, he failed to realize that Phasma only cared for herself and her own interests, an oversight that ultimately caused him his life."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Armitage Hux"}, {"tag": "p", "text": "As a patriotic Imperial, Brendol Hux raised his son Armitage Hux on stories of heroic Imperials and how the Empire had saved the galaxy from chaos after the Clone Wars. The younger Hux also accepted the older Hux's view that the New Republic was too weak to save the galaxy from chaos and that the First Order was needed to save the galaxy from itself."}, {"tag": "p", "text": "Hux had a bad relationship with his son and showed him little love and affection. The younger Hux feared his father so much that he looked to Grand Admiral Sloane as his protector. Under pressure from Sloane, Brendol taught his son everything he knew about war and the Empire. Despite this, their relationship remained poor and Armitage hated his father, even conspiring with Phasma to kill him and claim his place in the First Order."}, {"tag": "h3", "text": "Cardinal"}, {"tag": "p", "text": "One of his recruits from Jakku, Cardinal, would notice that Hux tended to look at him in a much more closer and familial light than he did his own son. Cardinal would quickly grow to accept Hux's indoctrination and would take to heart the lessons imparted to him about loyalty to the First Order above all else. Hux respected Cardinal so much that he outfitted him with his own unique crimson set of armor. Cardinal was also placed in charge of the First Order's stormtrooper training program, a role that was later shared with Phasma."}, {"tag": "h3", "text": "Phasma"}, {"tag": "p", "text": "Brendol Hux was impressed by the martial prowess and leadership skills of Phasma, a Scyre warrior. He appreciated how Phasma was willing to risk breaking a truce with the rival Claws and betraying her own brother Keldo and tribe to help Hux reach his starship in order to call for help. While Hux disliked her pride and strong will, he believed that she could be molded into a warrior and leader worthy of the First Order. Phasma's combat skills led Hux to appoint her to manage the training of the First Order's older cadets. Hux's faith in Phasma was ultimately misplaced when she conspired with Armitage to kill him in order to eliminate the last person who knew her past and secrets."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a First Order General, Brendol Hux wore a finely woven black uniform and tall shiny boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Brendol Hux first appeared as a minor antagonist in Jason Fry's 2015 junior novella The Secret Academy, the last book in the Servants of the Empire series. He was later identified as the father of General Hux, a secondary antagonist from Star Wars: Episode VII The Force Awakens and the mastermind behind the First Order's stormtrooper training regimen. Hux was briefly mentioned in Claudia Gray's 2016 novel Bloodline. He later appeared as a supporting character in Chuck Wendig's 2016 novel Aftermath: Life Debt, the second book in Star Wars: The Aftermath Trilogy. He was also one of the main characters of the Journey to Star Wars: The Last Jedi novel Phasma."}, {"tag": "p", "text": "The character was created by Jason Fry, who upon being given story material for The Force Awakens to review for the reference title Star Wars: The Force Awakens: Incredible Cross-Sections noted that the character of Hux was very young. He saw an opportunity to introduce the character's origins and build excitement for the film, while showing the Commandant's Cadets as real threat for new readers following the film's release. He rejected another idea of tying the characters of Anya Razar from the same novel and Captain Phasma from The Force Awakens together by suggesting they were one and the same, but did suggest an idea of the droid DDM-38 pushing a red-haired baby in a pram. While this was rejected, he nevertheless enjoyed seeing a fan-art of the young Armitage Hux in the arms of a creepy nanny droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}