{"url": "91st_Mobile_Reconnaissance_Corps", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Grand Army of the Republic corps", "Category:Imperial Army corps", "Category:Members of the 91st Mobile Reconnaissance Corps"], "nodes": [{"tag": "h1", "text": "91st Mobile Reconnaissance Corps"}, {"tag": "p", "text": "The 91st Mobile Reconnaissance Corps, also identified as the 91st Mobile Reconnaissance Force or simply as the 91st Recon Corps, was a clone trooper corps in the Grand Army of the Republic. During the Clone Wars, a pan-galactic conflict between the Galactic Republic and Confederacy of Independent Systems, CC-8826 \"Neyo\" served as the clone commanding officer of the 91st after the death of CT-411 \"Ponds\" with overall leadership given to Jedi Generals Adi Gallia, Stass Allie, and Mace Windu. After Order 66 and the transformation of the Galactic Republic into the Galactic Empire, 91st Recon Corps then served under the Imperial Army."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Battle for Ryloth"}, {"tag": "p", "text": "The 91st Mobile Reconnaissance Corps, also identified as the 91st Mobile Reconnaissance Force, was part of the Grand Army of the Republic and fought in the Clone Wars between the Galactic Republic and the Separatist Alliance. Early during the war, the 91st participated in the Battle of Ryloth, when Jedi General Mace Windu, alongside Clone Commander CT-411 \"Ponds,\" led their forces to attempt to liberate the capital city of Lessu. En route to Ryloth's capital city on a cliff, General Windu's armored forces came under attack by a group of Armored Assault Tanks while traversing a road alongside a mountain. The contingent of Separatist Alliance forces were able to stop the Republic troops briefly, but were defeated by Lightning Squadron, which were deployed from the AT-TEs of the 91st. After that skirmish, Windu, Stak, and CT-6910 \"Razor\" came across General Cham Syndulla of the Twi'lek Resistance and his men after they took out a droid patrol. At first, Syndulla was hesitant to join Windu due to another possible occupation by the Republic, but when he learned that the Separatists were bombing Twi'lek villages with Hyena-class Droid Bombers, Syndulla decided to help the Republic."}, {"tag": "p", "text": "Reaching Lessu, Windu and the two ARF troopers then hid inside an MTTs that was part of a convoy entering the city. Windu then ordered Syndulla and Commander Ponds to commence the attack after bridge was on. The battle droids scanned the cargo on the bridge, and they discovered Windu and his men. After he subdued the droids, Windu pushed his troopers across the bridge as it was being turned off by the droids. As he fell, Windu was able to jump on one of the STAPs and get to other side of the bridge. Windu then held off the droids as Stak and Razor made their way to the control room. After destroying droids in control room They were then able to turn the bridge on and hold it against a few droid reinforcements, including a pair of commando droids. Syndulla and his men fought the battle droids as Windu went to capture Separatist Emir Wat Tambor, liberating Lessu."}, {"tag": "h4", "text": "Battle for Malastare"}, {"tag": "p", "text": "The Confederacy's efforts on the planet Malastare were successful, so Supreme Chancellor Sheev Palpatine ordered the use of an electro-proton bomb to deactivate the Separatists' droid army. The bomb worked, but had the unforeseen effect of creating a sinkhole. Windu, alongside Ponds and troopers; \"Hawkeye\" and \"Trapper\" discovered the Zillo Beast."}, {"tag": "h4", "text": "Crisis on Endurance"}, {"tag": "p", "text": "After the Battle on Malastare young Boba Fett infiltrate Windu's Venator-class Star Destroyer Endurance. Fett didn't kill Windu but he crushed the ship on planet Vanqor. Most of the crew evacuated, but Fett, with help of the Aurra Sing, Bossk and Castas, captured Admiral Shoan Kilian, Commander Ponds and a clone naval officer. Shortly after this, Ponds was executed by Aurra Sing."}, {"tag": "h4", "text": "Battle of Patitie Pattuna"}, {"tag": "p", "text": "Later in the war Gallia's Jedi cruiser was attacked by a Separatist fleet under the command of General Grievous. Gallia and her troops battled the cyborg when he boarded her cruiser, putting up a good fight but she was ultimately defeated and captured. Later she watched as Grievous attacked a pirate ship. Gallia was soon rescued by Plo Koon, \"Wolffe,\" and the 104th Battalion; again, Grievous escaped before he could be taken into custody."}, {"tag": "h4", "text": "D-Squad"}, {"tag": "p", "text": "In 19 BBY, Clone Commander CC-8826's DUM-series pit droid, WAC-47, transferred from the 91st to Colonel Meebur Gascon's D-Squad. The droid squad later saved high-ranking members of the Republic Military echelon, including CC-8826, from a Separatist attack on the Valor space station."}, {"tag": "h4", "text": "Siege of Saleucami"}, {"tag": "p", "text": "During the Outer Rim Sieges, the Republic deployed CC-8826 \"Neyo\" and the 91st to the planet Saleucami under General Stass Allie's command. At that moment, Supreme Chancellor Palpatine triggered Order 66, causing clone troopers across the galaxy to betray and kill their Jedi leaders. As a result, Allie was executed by CC-8826 and another 91st trooper while on a speeder bike patrol."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "After Order 66 and the transformation of the Republic into the Galactic Empire, the 91st Recon Corps continued to serve in its ground forces."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Organization"}, {"tag": "p", "text": "The 91st Recon Corps was a corps in the Grand Army of the Republic, and as such consisted of 36,864 clone troopers divided into sixteen regiments. The 91st Recon Corps was led by Jedi Generals Adi Gallia, Stass Allie, and Mace Windu. Clone Commander CC-8826 \"Neyo\" served as the Clone Commander after CT-411 \"Ponds\" death."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "The 91st Recon Corps standard clone troopers of the corps had deep red markings and characteristic mark on their armor. Standard clone troopers made use of the Phase I clone trooper armor, ARF trooper armor, and later Phase II clone trooper armor and phase II BARC trooper armor. Soldiers of the 91st Recon Corps were typically equipped with DC-15 blaster rifles and DC-15A blasters."}, {"tag": "h3", "text": "Vehicles"}, {"tag": "p", "text": "The 91st Recon Corps used a variety of vehicles. The corps' aerial component consisted of LAAT/i gunships. Ground vehicles consisted of walkers such as All Terrain Tactical Enforcers, All Terrain Reconnaissance Transports and BARC speeders. At times, members of the 91st Recon Corps were present aboard the Venator-class Star Destroyer Endurance. The corps also rode on blurrg, native beasts of Ryloth, when they assaulted the planet's capital city of Lessu."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}