{"url": "Brentaal_IV/Legends", "categories": ["Category:Legends articles", "Category:Brentaal IV locations", "Category:Brentaal system planets", "Category:Confederacy of Independent Systems planets", "Category:Core Founders", "Category:Culture of Brentaal IV", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Hydian Way", "Category:New Republic planets", "Category:Perlemian Trade Route", "Category:Sith planets", "Category:Terrestrial planets", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Brentaal IV"}, {"tag": "p", "text": "Brentaal IV, known more commonly as Brentaal, was a planet in the Brentaal system of the Core Worlds's Bormea sector and one that occupied what was arguably the most valuable location in the entire galaxy: the intersection of the Hydian Way and the Perlemian Trade Route, two of the galaxy's major hyperlanes. The fourth planet in orbit around the star Brenta, Brentaal had two moons and was located in the Ringali Shell, a string of star systems along the Perlemian that were near the Ringali Nebula. An arid world with warm and temperate weather, Brentaal featured two large polar caps and an equator marked by deserts and steaming oceans; most of the planet's available land was dominated by warehouses, cargo holding facilities, commerce exchanges, and other trade-related structures. Brentaal's capital of Cormond and its Trade Hall were the seat of power on the planet, with the hundreds of Brentaal Houses—the influential families that ran the planet's trade guilds—represented the citizens in Brentaal's democratic government."}, {"tag": "p", "text": "As a result of its location along the Perlemian Trade Route, Brentaal was a major commerce hub that became an economic power when it joined the Galactic Republic sometime before 22,000 BBY, as it served as a checkpoint for traffic entering the Republic along the Perlemian. A Brentaalan hyperspace scout named Freia Kallea further bolstered her homeworld's affluence and economic power when she charted the Hydian Way around 3700 BBY, making Brentaal the only planet to sit at the intersection of two galactic superhighways. Brentaal's economic importance made it a frequent target of military conquests; conflicts such as the New Sith Wars, the Clone Wars, the Galactic Civil War, and the Yuuzhan Vong War all saw the planet become a battleground at least once as various governments and factions fought to control Brentaal's vital hyperspace junction."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The fourth planet in orbit around the star Brenta in the Brentaal system of the Core Worlds' Bormea sector, Brentaal IV was often called simply Brentaal. Brentaal IV lay in the Ringali Shell, a string of star systems along the Perlemian Trade Route that took its name from the nearby violet-colored Ringali Nebula that lit up the nighttime skies of planets in the region. A terrestrial world with a temperate but arid climate and two moons, Brentaal occupied one of the most valuable locations in the galaxy—the intersection of the Perlemian and the Hydian Way, two of the galaxy's major hyperlanes. Brentaal's northern and southern poles were marked by large ice caps, and the rest of the planet was dominated by a chain of particularly salty seas that separated Brentaal's eight continents. The planet had a rotational period of 23 standard hours and an orbital period of 342 standard days, and a diameter of 11,242 kilometers."}, {"tag": "p", "text": "The Commenor Run was another hyperlane that terminated at Brentaal, linking the world with Caamas, Alderaan, Kattada, and Commenor. A number of space stations orbited the planet, including a dozen or so XQ2 Platforms that were built by Bengel Shipbuilders decades before 19 BBY. A dry and relatively young planet, Brentaal featured a large number of mountain ranges that had been raised by groundquakes and volcanic activity, and most of the planet's volcanoes were dormant by the time of the Galactic Republic's founding. The planet's weather was largely warm and temperate, though the equatorial band featured deserts and steaming oceans. Most of the planet's settlements were located in valleys, canyons, and deltas in the livable bands between the two ice caps and the equatorial regions, and they suffered from frequent overcrowding, though the planet's spaceports and storage facilities were primarily built atop flattened mountains."}, {"tag": "p", "text": "Brentaal's original colonists largely erased the planet's native flora and fauna over the course of many generations, replacing them with ecological systems found on other Core Worlds. One of the few native species to survive was the kundril, a massive, multisegmented flying insect that lacked eyes and hunted by sound. A number of variations of kundril existed, with most hunting fish and seagoing mammals in Brentaal's seas, and most of the land-based kundrils were wiped out by the planet's inhabitants over the decades. The large amphibians known as scranges, native to the planet Dagobah, could also be found in Brentaal's sewers. Air pollution was once a major concern on Brentaal, but the environmental damage was largely repaired, and the planet's air was made safe again, though it smelled slightly of methane."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The region around Brentaal IV, like much of the northeastern and eastern sections of the Core Worlds, was largely explored between the years 27,500 and 25,000 BBY. Brentaal was a member world of the Galactic Republic by the year 22,000 BBY, developing into a major economic hub as it served as a checkpoint for traffic entering the Bormea sector along the Perlemian during the Republic's early centuries. Around 24,500 BBY, Brentaal was the site of a battle between the Legions of Lettow and the Jedi Order during the Force-using Order's First Great Schism. For several thousand years, the planet served as a jumping-off point for ships exploring the Colonies region, and most of the goods that returned to the early Republic from the Outer Rim Territories passed through Brentaal."}, {"tag": "p", "text": "Besides the Perlemian Trade Route, the Brentaal–Denon Route was an early hyperlane that linked Brentaal IV with the planet Denon in the southern Inner Rim, and the Corsin Run spiralled northeast from Brentaal to the planet Corsin in the Expansion Region. Even early in Brentaal's history, the planet was controlled by the Brentaal Houses—merchant families that competed for control of the planet's trade and shipping industries. During the Manderon Period, Andel Tanner was a prominent inventor who worked on Brentaal IV around 6000 BBY, crafting a pair of slugthrowers that were valued at over 12.4 million credits by the year 0 ABY. Around that same time, the Antarian Rangers, a group of individuals who aided the Jedi Order, established a division on Brentaal. Around 4000 BBY, a number of Humans from Brentaal colonized the planet Muzara in the Expansion Region, barely avoiding conflict with the native Muza; the Brentaal League hoped that its settlement would make Muzara into a profitable agriworld."}, {"tag": "p", "text": "In 3705 BBY, Brentaalan native Freia Kallea—a daughter of House Kallea whose parents disapproved of her apprenticeship in the Brentaal Spacefarers League—began to work as a hyperspace scout. Over the course of the next year, Kallea linked together a number of pre-existing hyperlanes in the northern galaxy: the Corsin Run, Mandalorian Road, Sprizen End Run, the Spurs of Celanon, and the Morellian Trail. By 3694 BBY, Kallea had extended the Brentaal-Denon Route all the way to the southern rim of the galaxy, forming the super hyperlane that she named the Hydian Way, after her Duros friend Banu Hydia. The events of Kallea's trailblazing, along with the Brentaal noble Sival Brentioch's courting of Kallea during those years, were dramatized around 1500 BBY in The Kallea Cycle, a famous opera that endured for hundreds of years."}, {"tag": "p", "text": "The Human Satele Shan, the descendant of the famous Jedi Revan and Bastila Shan, was born on Brentaal IV in 3699 BBY, and the Jedi Knight Ardun Kothe worked with war refugees on Brentaal during the Great Galactic War between the Republic and the Sith Empire. The planet was the site of a Republic Military outpost during the Cold War between the Republic and the Sith Empire over fifty years later. That outpost was later wiped out by the Sith Lord Kavos, who killed the experienced Jedi Knights Ayesho and Nil in the process. During the Cold War, an anarchist group known as the Revolutionary Edge Brigade was active on Brentaal, and the group—including a Rattataki named Kaliyo Djannis—frequently robbed banks, blew up public holorelays, and kidnapped influential corporate and political figures. One such attack on Curovao became known as the Curovao Bombing."}, {"tag": "p", "text": "During the New Sith Wars, a series of conflicts between the Republic and various Sith factions that spanned the millennium between 2000 BBY and 1000 BBY, the Bormea sector was conquered by the Brotherhood of Darkness in the year 1002 BBY. Brentaal IV was captured by the Sith shortly after Corulag and Chandrila, with the planet's defenders only offering what the Sith Lord Skere Kaan considered to be token resistance. Kaan's capture of Brentaal forced his Jedi counterpart Lord Hoth to make his move and draw the Sith into battle at the planet Ruusan."}, {"tag": "h3", "text": "Unrest and the rise of the Empire"}, {"tag": "p", "text": "Brentaal was the intended target of a foiled acquisition attempt by Darth Sidious in 33 BBY, when the Sith Lord boldly attempted—via machinations between the Trade Federation, Groodo the Hutt, and Trinkatta Starships of Esseles in the adjacent Darpa sector—to seize this strategic cross-roads planet, that the Federation might utterly control two major galactic trade routes, the Perlemian and the Hydian Way. A team of Jedi Knights led by Adi Gallia and Qui-Gon Jinn, including Padawan Obi-Wan Kenobi, ultimately struck down the violent plot with its intended use against Brentaal of 50 Vulture-class droid starfighters modified with prototype hyperdrive engines branded as illegal by the Republic."}, {"tag": "p", "text": "In 22 BBY, the Allied Tion Historical Society's Cradle of the Galaxy exhibit began a Core Worlds tour on Ralltiir on 13:4:1, and the exhibit was showcased in the Cormond Museum of Arts on Brentaal starting on 14:3:1, almost a year later, before it moved on to Chandrila two months later. On 13:4:25, the Jedi Knight Reeft was involved in an altercation in a marketplace on Brentaal; Reeft had been pursuing the thief Rotar Lopani, who had allegedly stolen sensitive diplomatic datapads from Coruscant a month earlier, but the Xexto bounty hunter Tosinqas attempted to claim the 8,000-credit bounty on Lopani. Tosinqas fell several stories to land on Lopani, killing him, but the Xexto was startled by the sound of Reeft's lightsaber igniting and charged the Jedi only to kill himself by running into the weapon."}, {"tag": "p", "text": "The Clone Wars between the Republic and the Confederacy of Independent Systems erupted with the First Battle of Geonosis in 13:5, and unrest soon reached Brentaal when the Separatist Commander and Brentaal clan leader Shogar Tok captured a prison facility on Brentaal and converted it into his base of operations. Becoming a warlord on his homeworld, Tok rallied his fellow Brentaalans against what he claimed to be a corrupt Republic and establishing a Separatist military presence on the planet as early as 13:8. As part of the Jedi Knight Quinlan Vos's deep-cover mission to infiltrate the the ranks of the Dark Acolytes, the servants of the Confederacy's Count Dooku, the Jedi Master Tholme sent Vos to Brentaal. Vos infiltrated Tok's prison base as \"Korto Vos,\" and in 13:10 Vos sent a false message to the Republic claiming that Tok's rebel movement was unprepared for an attack. As a result, the Republic sent a fleet under the Jedi Generals Shaak Ti, Agen Kolar, Shon Kon Ray, and Plo Koon to drive out the Separatist presence there, but they found their enemy ready for the attack."}, {"tag": "p", "text": "Unable to bombard Tok's fortress on account of its heavy shielding, the Republic tried to land ground troops to take the fortress, but the building's ion pulse cannons took out a large number of the Republic's LAAT/i gunships. Kon Ray was killed in the early fighting, and the Republic lost more than a quarter of their forces in the first few hours of the Battle of Brentaal IV against the natives and the battle droids of the Trade Federation. Shaak Ti and her troops rescued Vos and three other former prisoners—Sagoro Autem, Lyshaa, and Ryyk—and convinced them to help infiltrate Tok's fortress in exchange for their freedom. While Kolar led a diversionary attack, Ti and her group infiltrated the structure through the sewers and split up to achieve their objectives of disabling the shields and cannons and capturing Tok, and Plo Koon withdrew the Republic forces to wait for Ti's signal. Ti's group was successful in all of their objectives, though Ti was forced to kill Tok, and the Republic quickly achieved victory."}, {"tag": "p", "text": "During the early Clone Wars, Brentaal was represented in the Galactic Senate by the Human Senator Arcel Mosbree, who planned to retire from the Senate in 21 BBY. After the conflict on Brentaal, a Republic government was installed with Jerrod Maclain as temporary governor, as Mosbree was considered an accomplice to the Separatist movement on Brentaal and removed from office. In 14:9, Supreme Chancellor Palpatine formally appointed Maclain as regional governor of Brentaal, a role which Malcain filled for almost twenty-five years. The Shoosha family escaped from Brentaal during the battle, and the young musician Bann Shoosha composed a work entitled the Vissencant Variations to celebrate their escape shortly afterwards. By 20 BBY, the Variations were considered to be one of the great musical works of the recent millennium, despite being less than two years old."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "The Clone Wars came to an end in 19 BBY, when Chancellor Palpatine declared himself Emperor and reformed the Republic as the Galactic Empire. In the months after the end of the Clone Wars, several agents of the former Senator Bail Organa fled to Sel Zonn Station, one of the XQ2 Platforms orbiting Brentaal, and Imperial agents pursued them there to prevent them from escaping and reaching Organa. Sel Zonn Station was minorly popular among some Brentaal nobles at the time, though the station had not flourished in the last few years. The famous Brentaalan smuggler Platt Okeefe was born to House Okeefe around 18 BBY on Brentaal, though she later left her homeworld to become a pilot in her teens."}, {"tag": "p", "text": "By the year 0 ABY, the Hutt Shettora operated a criminal faction on Brentaal, controlling the black market on the world and selling good-quality merchandise at only slightly higher prices than normal. The Hutt Puullo served at the group's forefront, using his expertise in business to oversee the black market. Due to the planet's significant black market, the Empire maintained a large Imperial Customs office on the world. In 0 ABY, the pirate Venslas Beeli conducted a number of raids against Brentaal and other worlds in the region, leading the Rebel privateering frigate Far Orbit to attack Beeli's pirates. The Far Orbit was later lured into a trap by Imperial forces near Brentaal, though it escaped, and some of the Far Orbit's crew later traveled to Brentaal in order to secure a datacard from an Alliance contact and managed to escape Imperial Security Bureau agents who pursued them."}, {"tag": "p", "text": "In 36:5, the Commission for the Preservation of the New Order moved to place new tariffs on luxury agri-exports from the Bormea sector, and the resultant tariffs negatively affected imports to Brentaal. Inspired by the popular holo Kallea's Hope by Neile Janna, which translated The Kallea Cycle into a popular and modern format from Old Brentaal when it was released in 1 ABY, Brentaal's Council of Human High Culture spent the next two years working on the opera to bring it back to what they called \"its classical roots.\" However, the Council's true goals were the promotion of Humanocentrism, as they reworked the opera to highlight the achievements of Humans and excluded alien performers from the show."}, {"tag": "p", "text": "On 37:2:23, Imperial Customs uncovered evidence of a smuggling scheme that was believed to be responsible for redirecting raw materials that were intended for Brentaal to the Outer Rim. Captain Dalea Trovin coordinated the investigation, and Customs raided a warehouse complex in the city of Votrad, discovering thousands of tons of raw materials that had been listed as missing or misrouted. The Brentaal Trade News published a report on Trovin's efforts, though the captain had not yet been able to determine where the raw materials were being diverted to. In 2 ABY (38:2), Brentaal began preparing for the premiere of The Kallea Cycle, in which Vessa Brentioch of House Brentioch would portray her ancestor and the famed Chandrilan singer Gelod Vothran would play Sival Brentioch. The production was performed by the Brentaal Hall Conservatory and funded by a number of the planet's most prominent houses, including the Dajaal Family, House Brentioch, and Hall Jo'uda, and it took place in Votrad Stadium—which had been outfitted with more than 100,000 seats and a 500-mete-long stage."}, {"tag": "p", "text": "The show had a premiere date of 38:2:13, and prominent dignitaries from across the Core Worlds and the Colonies traveled to Brentaal and Votrad in particular to attend, though security remained high to ensure that the production went smoothly. However, the notorious jewel thief Tanda Marelle, known in the media as the Tombat, struck at a banquet in Votrad on 38:2:12 that was attended by a number of famous guests; Vessa Brentioch, Gelod Vothran, the production's Maestro Trebian Shullos, Moff Jamson Caglio of the Bormea sector, Imperial Advisor Alec Pradeux, and Inspector Zanza Gata of the Imperial Office of Criminal Investigations were among the banquest's attendees. However, several of the guests discovered small quella stones—the Tombat's trademark—baked in their dessert bowls of shim-bay crispa, an act which many believed to be a statement on Gata's inability to capture the Tombat and one that raised questions as to whether Gata's true intent in overseeing the opera's security was to in fact set a trap for the thief. Moff Caglio publicly expressed his displeasure with the Inspector, but the production of The Kallea Cycle continued without incident."}, {"tag": "p", "text": "On 38:4:21, the Brentaal League of Guilds declared a Landmark Holiday to celebrate a record week of commodities trading, as more credits and stocks had passed through the Brentaal market than ever before during a five-day period. Governor Maclain, House Brentioch, Hall Jo'uda, and the Dajaal Family were among those that benefited from the market activity, which also boosted many corporations in the Core Worlds, and the week-long Landmark Holiday was filled with parades and parties sponsored by the planet's trading houses. The Brentaal Hall Conservatory presented an encore performance of The Kallea Cycle in celebration before the opera began a tour of the Core Worlds and the Colonies a month later, though Vessa Brentioch was replaced by Neile Janna in the role of Kallea for the Kallea Tour, and the Brentaal commodities exchange was closed during the holiday."}, {"tag": "p", "text": "However, in the weeks after the Landmark Holiday, Brentaal was wrought with scandal: five of the Dajaal Family's commerce officers were arrested after it came to light that they had breached market confidentiality, and the officers claimed that they had passed data to Governor Maclain in exchange for monetary incentives and political favors. Maclain was soon accused of underhanded dealings in the commerce exchange by two of his aides and numerous bureaucrats from nearby systems, and Emperor Palpatine himself dispatched Grand Moff Rufaan Tigellinus to head an investigation of Maclain, leading some to believe that Palpatine had assigned Tigellinus—a member of the exclusive Order of the Canted Circle and a major player in the politics of the Imperial Court—to the case because Maclain was funding the Rebellion. Tigellinus denied those rumors while assembling his staff for a departure to Brentaal, and he proceeded to interview several bureaucrats in the Bormea and Darpa sectors during his investigation."}, {"tag": "h3", "text": "The Battle of Brentaal IV"}, {"tag": "p", "text": "Brentaal was still under Imperial control in 4 ABY, when the Rebel Alliance won the Battle of Endor that saw the deaths of both the Emperor and his Sith apprentice Darth Vader. The Empire began to fragment in the wake of the Emperor's death, and the newly-formed New Republic began advancing towards the Core Worlds and Coruscant. In 39:12, nine months after the Battle of Endor, the elite New Republic starfighter unit Rogue Squadron was sent to recon Brentaal, and a group of five fighters entered the Brentaal system and began to collect data. By that time, the Empire had established a moonbase on the surface of one of Brentaal's moons and placed the Imperial Admiral Lon Isoto in command of the planet's military forces, and Imperial TIE fighters were deployed to drive off the intruders. The New Republic fighters emerged victorious and damaged the moonbase's interior before departing the system."}, {"tag": "p", "text": "Grand Vizier Sate Pestage had assumed control of the Empire after Palpatine's death, but Director Ysanne Isard of Imperial Intelligence desired the throne herself and advanced her cause by serving as a mediator in his dealings with the Cabal—a group of wealthy and politically influential citizens—and playing the two groups against each other. Isard advised Pestage to invite an attack on Brentaal, believing that she could orchestrate a New Republic victory there and bring about Pestage's downfall. As Admiral Isoto was considered incompetent, Isard sent part of the elite 181st Imperial Fighter Wing under Colonel Baron Soontir Fel to Brentaal, and Pestage agreed to her suggestion before issuing a public statement that the Empire would defend Brentaal from invasion. In response, Admiral Gial Ackbar of the New Republic began active preparations for conquering the planet, giving Rogue Squadron and Colonel Horton Salm's Aggressor Wing two weeks to prepare."}, {"tag": "p", "text": "As planned, two weeks later a task force under Ackbar's command entered the Brentaal system and attacked the planet's moonbase, capturing the facility and using it as a staging ground for an assault on Brentaal itself. The Imperial forces under Isoto's command made no attempt to retake or destroy the facility, though the admiral—who spent most of his days in with pleasure girls in the city of Vuultin—ordered the razing of the forests around the city in order to install missile sites and a bunker for Fel's 18st. Though the locals protested, Isoto ignored them, believing that his presence in Vuultin made the strategically-worthless city a prime target for the New Republic. Fel disagreed and sent most of his forces to nearby Oradin, as the city's spaceport facilities would aid the New Republic in landing troops on the surface. Fel was correct: Admiral Ackbar ordered Rogue Squadron to feint at Vuultin while Aggressor Wing accompanied their main forces to Oradin."}, {"tag": "p", "text": "When Rogue Squadron and the 181st began to dogfight among the skyscrapers of Vuultin, Isoto decided to pull his capital ships back to the night side of the planet. Baron Fel's fighters inflicted heavy losses on Aggressor Wing in the first minutes of the battle, but the panicked admiral demanded that Fel pull his fighters back to Vuultin and defend him, and the New Republic command ordered Rogue Squadron to withdraw in fear that the 181st would attack the main battle group. Oradin was heavily damaged but was captured by the New Republic, though Fel's second-in-command Turr Phennir took out a New Republic assault shuttle that crashed into a Brentaal school, injuring a large number of children. When Fel refused a medal for his actions, Isoto decided to declare a Brentaalan holiday entitled \"Fel's Day,\" and despite the desires of both the Cabal and Pestage, Isard's manipulations kept the two sides from knowing that they both thought Isoto should be relieved of command. When news of Oradin's fall reached Coruscant, Isard ordered a fleet of two hundred and five vessels to launch from Coruscant and head to Brentaal with the purpose of evacuating the planet's wealthy upper classes. By doing so, Isard hoped to make Pestage look foolish and deprive the Cabal of a potential power base."}, {"tag": "p", "text": "When the fleet arrived at Brentaal, the New Republic Provisional Council feared that the evacuation would mean the removal of Brentaal's wealth and cultural artifacts and as such ordered the New Republic forces to stop the evacuation. Rogue Squadron and Aggressor Wing worked to disable the evacuating ships over Vuultin while assault transports landed to capture the city, and Baron Fel—angry that Isard's manipulations had endangered his pilots—led his unit against Rogue Squadron in order to follow his orders and honor his duty. During the assault, Isoto was assassinated by his concubine Grania at Isard's orders after he complied with Isard's demand for him to issue an evacuation order. With the issuing of the evacuation order, every ship on Brentaal was given immediate clearance for vertical takeoff, but Fel was forced to order the 181st to retreat from the battle and protect the fleeing citizens."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "The Brentaalans who managed to evacuate were welcomed to Coruscant by Pestage, who publicly blamed the loss of the Battle of Brentaal IV on treasonous citizens who had died in the conflict. From Brentaal, the New Republic moved their forces up the Hydian Way in 6 ABY after conquering much of the western and southern galaxy, and Oradin had been rebuilt to its former bustling state by the year 9 ABY, when the astromech droids Whistler and Gate—the droids of New Republic pilots Corran Horn and Wedge Antilles—traveled on a solo mission to the city in order to locate the smugglers Talon Karrde and Mirax Terrik. The Grand Oradin Hotel was a major resort in the city, and the building's turbolifts played recordings of the history of the Battle of Brentaal IV to their passengers."}, {"tag": "p", "text": "The planet was briefly conquered by Grand Moff Ardus Kaine in 10 ABY during the offensive planned by the reborn Emperor Palpatine. Brentaal remained a part of the New Republic for the next decade and a half, and the Brentaal Academy hosted the 412th Proceedings of Galactic Anthropology and History, with the historian Vilnau Teupt as the keynote speaker in 24 ABY. During the Yuuzhan Vong War of 25–29 ABY, Brentaal was attacked by the extragalactic Yuuzhan Vong species, and like those of Ralltiir and Chandrila, the planet's inhabitants chose to fight the invaders, though several of the planet's cities were destroyed when the Brentaalans fought the Yuuzhan Vong."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Brentaal's society was focused entirely around commerce, with the hundreds of Brentaal Houses controlling the planetary economy and political environment. On Brentaal, politics were a means to advance one's interests in the commercial world, not a way to gain power, and the planet was ruled by a participatory democracy. Representatives of each Brentaal House met daily in the central Trade Hall in Cormond, where they made public policy and coaxed the economy in desired directions. The Houses, which were connected by thousands of intricate alliances and factions, were nearly all organized by family, as the ability to own a controlling stake in a Brentaal guild or House was originally restricted to family members and family-controlled businesses. A complex system involving permits and exchanges of massive numbers of credits later opened access to some foreigners limited access to certain Houses. Houses Kallea, Brentioch and Okeefe, Hall Ju'oda, and the Dajaal Family were among the more successful and influential Houses on Brentaal."}, {"tag": "p", "text": "With a population of approximately 65 billion, Brentaal was primarily populated by Humans, as they made up 88% of the planet's inhabitants, and the planet's primary language was Galactic Basic Standard. The popular Brentaalan folkhero was one who fearlessly trail-blazes new hyperspace routes as a spacefaring merchant, and Freia Kallea became a legendary figure in Brentaalan society for doing just that. Many major megacorporations maintained their headquarters on Brentaal, particularly in the capital of Cormond, and the planet also had a very well-regarded cuisine that was the result of thousands of years of interaction with other cultures. The architecture of Brentaal's cities was functional and stark as befitted a culture based on commerce, but as the Brentaalans favored organic-looking architecture, many offworlders considered their buildings to be oddly beautiful. As a result of its position at the junction of the Hydian and the Perlemian, Brentaal was home to many shipping companies and also had a thriving criminal underworld and black market."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Brentaal's inhabitants lived primarily in cities that were primarily filled with spaceports, trade markets, financial markets, industrial centers, and warehouses. The city of Votrad was home to the Votrad Independent Downport, an enormous spaceport, and the Votrad Stadium, which was large enough to hold 100,000 patrons. The Brentaal Academy and the Brentaal Commerce Academy were two learning institutions on the world; the Commerce Academy trained children for the planet's commerce-focused society, with some courses including advanced stock tracking, distribution theory, and speculative investing. While the planet's equatorial regions, plateaus, and flatlands were dominated by the commercial starports and warehouses essential to Brentaal's commercial society, the planet's polar regions were primarily devoted to recreational pursuits."}, {"tag": "p", "text": "Brentaal's capital, Cormond, lay on the coast of the Suporro Sea near the Gravaal Mountains, and it was home to the Trade Hall—the center of Brentaal's commercial interests and the seat of government. The Trade Hall featured a number of expansive trade floors, thousands of offices, gardens, and shipping centers, in addition to a private spaceport. While the rest of Brentaal was largely devoted to handling cargo, Cormond was responsible for directing the commerce as a result of the presence of the Trade Hall. The city of Oradin was located on a coast and was home to an Imperial-class spaceport, making it far more strategically valuable than the large city of Vuultin, which was located to the west in a forest and lacked a spaceport. Oradin was home to dozens of resorts and hotels, ranging in size from tiny hovels to the large upscale luxury of the Grand Oradin Hotel, which was known as the Grand Imperial Hotel in the years before the Battle of Brentaal IV during the Galactic Civil War."}, {"tag": "p", "text": "The Curovao family, which ran the shipping company Curovao ImpEx, lent its name to the city of Curovao, though Simith Gorofila, head of the so-called Brentaal Dissidents League, accused the family and the city of corrupt dealings with the Republic. The Favis Resort was an artificial island anchored in Brentaal's mild south polar sea, and it was one of the resort communities where Brentaalan nobles and guild officers retired to when the planet's heat became oppressive during summertime in the southern hemisphere. Numerous casinos, luxury hotels, and sports stadiums could be found at the Resort, and yacht regattas and glacier-climbing expeditions were conducted regularly. However, the Favis Resort also had a reputation for being the site of corporate espionage, as Brentaalan merchants rarely ever left their work behind while on vacation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Brentaal IV was first mentioned in the \"Galaxywide NewsNets\" segment of Star Wars Adventure Journal 3, published in 1994, and it received mentions in a number of sources and roleplaying guides in the years that followed. The planet first appeared in the roleplaying adventure Imperial Double-Cross in 1997, and the In the Empire's Service story arc of the Star Wars: X-Wing Rogue Squadron comic series was focused on Brentaal a few months later. The roleplaying adventure The Far Orbit Project, published in 1998, stated that Brentaal lacked moons, despite the X-wing comics less than a year earlier clearly depicting Brentaal possessing at least one moon with a military base on it, and all subsequent sources and appearances have stated that Brentaal IV has two moons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}