{"url": "Brentaal_Star", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Galactic Republic starships", "Category:Thranta-class corvettes"], "nodes": [{"tag": "h1", "text": "Brentaal Star"}, {"tag": "p", "text": "The Brentaal Star was a Thranta-class corvette in service with the Republic Navy during the Cold War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Cold War, the Brentaal Star participated in an illegal skirmish just outside of Imperial territory with a fleet of Republic warships. The ship was damaged and was forced to leave the battle after the defecting Imperial General was aboard holding military secrets of super weapons being created by the Empire. Knowing that such information in Republic hands would be severely damaging, Imperial Grand Moff Rycus Kilran tasked the Black Talon, an Imperial Gage-Class transport, to undertake the task, a task that the transport's Captain, Revinal Orzik, was less than thrilled to engage in. The Captain of the Black Talon disobeyed his orders from the Grand Moff which forced the latter to be more persuasive in the form of several of the Empire's Operatives on board bound for the Sith Capital world of Dromund Kaas. They were ordered to take the ship and attack the Brentaal Star which they did fighting their way to the bridge and confronting Captain Orzik, his fate would be in their hands his knowledge would help turn the battle. Once the situation of the Captain was taken care of, the Black Talon came out of hyperspace near the Brentaal Star location and attacked, an attack the Brentaal Star was already prepared for still recovering from the battle and repairing the damaged they had sustained. The transport was attacked and boarded by Republic forces along with Jedi. Operatives sent by Kilran, to assure the mission was completed, charged into the ship to secure the fleeing passenger—a General who had decided to defect to the Republic."}, {"tag": "p", "text": "Before the boarding action the Black Talon received a message Jedi Grand Master Satele Shan bringing in Republic reinforcements to the damaged Republic warship. The operatives made their way through the ship until they encountered the General being guarded by Padawan Yadira Ban who would meet her fate during the fight while the wounded General headed to the escape pods along with several of the remaining Galactic Republic troopers that were on board. The General was found by the operatives and executed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}