{"url": "Breslin_Drake", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:New Republic Intelligence personnel"], "nodes": [{"tag": "h1", "text": "Breslin Drake"}, {"tag": "p", "text": "Major Breslin Drake was a New Republic Intelligence Service officer who went rogue to chase down an Imperial spy known as \"the Wraith\". He later joined the crew of the FarStar during their mission to find Moff Kentor Sarne."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Drake served the New Republic with distinction as a commando and field intelligence agent before being transferred to administrative duties. Drake was tasked with building a network of agents and collation centers known as the \"Archive system\". Drake discovered that an Imperial spy, the Wraith had penetrated the security of one of his installations and was jeopardizing the whole operation. Denied permission to return to the field to track the Wraith, Drake watched in horror as the spy destroyed the network. Stealing a shuttle, Drake set off in pursuit of the agent."}, {"tag": "p", "text": "Tracking the Wraith to the Kathol sector, he spent two years tracking the spy. His cover was as a tech merchant, trading technology throughout the sector, and he spent several months on Tanquilla Beach, where he dealt with Spang. He found out that the Wraith was working as an assassin for Moff Kentor Sarne."}, {"tag": "p", "text": "Several months before the Battle of Kal'Shebbol, Drake lost the trail. Returning to Kal'Shebbol, he stopped over on Pembric II shortly before the Bombaasa Cartel took control, and subsequently lost his goods through bureaucratic procedures designed to keep independent traders dependent on the Cartel. Drake took a job managing the ThrusterBurn Tapcafe while he figured out a way to off the planet. When the crew of the New Republic CR90 corvette FarStar arrived seeking his help in locating a slicer that may have worked for Moff Kentor Sarne, a man Drake identified as Gaelin. Drake assisted the FarStar landing party in escaping the planet, and left with them. He joined the crew of the corvette as a tactical advisor and counter-intelligence specialist."}, {"tag": "p", "text": "Breslin later returned to New Republic Intelligence, joining the Special Threats Division and was promoted to the rank of Colonel."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Heavily muscles and tall, Drake's face and hands were heavily scarred. He was agile and a skilled close combatant, and had a sharp mind. Determined, and with a ruthless streak, Drake was either a dangerous opponent or a useful ally."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}