{"url": "Bria_Tharen", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Army officers", "Category:Archaeologists", "Category:Corellian Resistance members", "Category:Corellians", "Category:Diplomats", "Category:Females", "Category:Humans", "Category:Red Hand Squadron personnel", "Category:Resistance fighters", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Bria Tharen"}, {"tag": "p", "text": "Bria Tharen was a Human female and a commander in the Alliance to Restore the Republic during the early Galactic Civil War. Born to a wealthy family on Corellia, Tharen intended to study archaeology and pursue a career as a museum curator. When she was seventeen, however, Tharen experienced the Exultation performed by a t'landa Til missionary at a religious revival. Drawn in by the Exultation's effects, Tharen sold all her jewelry and booked passage to Ylesia, where she dedicated her life to the religion's service. Tharen spent a year on Ylesia before her religion was exposed as a front for a Hutt spice/slaving operation by a young Corellian pilot named Han Solo."}, {"tag": "p", "text": "Solo helped Tharen to escape from Ylesia and the two fell in love. However, Tharen struggled to cope without the Exultation and decided to leave Solo to confront her addiction. Finding a new purpose in life that helped her to eventually overcome her addiction, Tharen joined the fledgling resistance movement on Corellia, and devoted herself to fighting against the Galactic Empire and bringing an end to slavery. Tharen worked on several undercover assignments and helped make contact with rebels on other worlds."}, {"tag": "p", "text": "After the founding of the Alliance to Restore the Republic, Tharen was given command of Red Hand Squadron. She began planning a raid on Ylesia to end the slavery operation, recruiting a number of smuggler pilots to act as guides, including Han Solo, with the promise of a share of the Ylesian spice. Tharen and Solo briefly resumed their relationship, but when the Rebels betrayed the smugglers at the Battle of Ylesia, taking all of the spice, Tharen and Solo parted once more. Shortly after, Tharen led Red Hand Squadron on a mission to Toprawa to help retrieve the plans for the first Death Star. Though they were successful in transmitting the plans to a Rebel courier ship, her unit was surrounded by Imperial forces, and Tharen committed suicide rather than face capture and interrogation."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Human female, Bria Tharen was born around 28 BBY to a wealthy family from the southern continent of Corellia. Her name was made up by her father, Renn Tharen, from the first syllables of her grandmothers' names, Brusela and Iaphagena. She grew up on her family's estate, living with Renn, her mother Sera, and her older brother Pavik. As a young girl, Tharen enjoyed studying history, finding herself particularly fascinated by stories of the Jedi Knights, the birth of the Galactic Republic and the recent Clone Wars. She wanted to be a museum curator and spent a couple of summers working on an archaeological dig, learning to preserve ancient treasures. When she finished her undergraduate schooling at the age of seventeen, Tharen was due to study archaeology with an emphasis on ancient art at the University of Coruscant."}, {"tag": "p", "text": "While Renn Tharen encouraged Bria's desire to have a career, Sera was more concerned in finding her a wealthy suitor and pushed her towards a relationship with Dael Levare, a young man from one of the wealthiest families on Corellia who Bria had known since they were at school together. The two began dating and were close to becoming engaged when Tharen discovered that Levare had been unfaithful and broke off their relationship. Her mother was furious with Tharen for ruining her plans for the expected wedding and instructed her daughter to apologize to Levare and take him back. Tharen refused and, upset and angry, attended a revival being held by a t'landa Til missionary from Ylesia. The service ended with a few seconds of Exultation, a process which produced a powerful feeling of rapture in Tharen and which she believed to be a religious experience. Feeling that there was little left for her on Corellia, Tharen sold all her jewelry to buy passage to Ylesia."}, {"tag": "h3", "text": "Pilgrim 921"}, {"tag": "p", "text": "Unknown to Tharen, her newfound religion was an elaborate scam orchestrated by the Hutt Besadii clan to acquire workers to process glitterstim, a spice which gave its users a temporary telepathic ability. Arriving on Ylesia as a pilgrim, Tharen was forced to give up all her possessions, including her name, and became known only as Pilgrim 921. She was assigned to a communal dormitory in Colony One, the first of three colonies inhabited by Ylesia's pilgrims."}, {"tag": "p", "text": "Tharen spent almost a year working in the processing plants, measuring and trimming the fibrous strands of raw glitterstim to ensure consistent doses of the spice for export. Glitterstim was highly reactive to light; as a result, Tharen had to perform her work in complete darkness, only able to see through infrared goggles. Every night, Tharen would attend devotions, during which t'landa Til priests performed the Exultation, to which Tharen developed an addiction. Over time, her poor diet caused her to become excessively thin and extended time working in darkness left her skin with a pale complexion. The dangerous work also left her with numerous scars on her fingers, wrists and forearms from the sharp threads of glitterstim, and she developed a fungal infection due to the planet's warm, moist atmosphere."}, {"tag": "p", "text": "In 10 BBY, Tharen attracted the attention of Han Solo, a young Corellian pilot who had recently begun working for Besadii under the alias Vykk Draygo, smuggling the processed glitterstim. While touring the processing plant, Solo noticed Tharen cut herself and asked if she needed medical attention. Unwilling to risk missing the evening's Exultation, Tharen refused and Solo was led away by his Togorian bodyguard, Muuurgh, so as not to further distract the workers. The following day, Solo sought Tharen out in the refectory and asked about her injury. Tharen informed him that it was healing, but was unwilling to talk further to a non-believer. Solo, however, was unwilling to give up and insisted on accompanying her to evening devotions and walking her back to her dormitory. On the way, the two Corellians discussed their homeworld and Tharen's former aspirations to work in a museum."}, {"tag": "p", "text": "Solo's interest, and Tharen's own attraction toward him, left her feeling uneasy since relationships were forbidden to pilgrims. Despite this, she agreed to see him again and, on a subsequent meeting, revealed her birth name to him. Solo soon learned that pilgrims only remained on Ylesia for a year before they were shipped off-world to work as slaves in the glitterstim mines on Kessel. Knowing that Tharen's year was almost over, Solo resolved to find a way to keep her on Ylesia. When he heard that the t'landa Til High Priest Teroenza was looking for somebody to maintain and catalog his extensive collection of artifacts, Solo suggested Tharen for the job. Tharen was interviewed by Teroenza and given the job soon after."}, {"tag": "p", "text": "Tharen enjoyed being able to use her knowledge of antiques in her new work and considered it an honor to work for the High Priest. She turned down a room in the colony's administration center, insisting that she still live with the other pilgrims, but her new job gave her access to fresh air and sunlight, allowing her to shed her pale appearance. The prolonged darkness had left her so drained of energy that she initially continued to eat very little. After the colony's medical droids treated her for malnutrition, as well as her fungal infection, she regained her appetite and began to look less gaunt within a month. Although Tharen was still wary of Solo, and continued to resist her growing feelings for him, over the next three months the two became friends and Tharen began joining Solo and Muuurgh for a stim tea before devotions."}, {"tag": "p", "text": "Hoping to prove to Tharen that her religion was a hoax, Solo made a secret recording of High Priest Teroenza and Sacredot Veratil in which they admitted that the Exultation was merely a refinement of a biological ability used by t'landa Til males to attract a mate. When Solo presented the evidence to Tharen, she refused to believe it and accused him of faking the recording, so Solo gave her a vial of glitterstim so she could use its telepathic effects to read his mind and find out the truth. Instead, Tharen took the vial when she next attended devotions and used it to read Teroenza's mind, discovering his pride in manipulating the pilgrims and his singular desire to enrich himself at their expense. Sensing that his mind was being probed, Teroenza brought an abrupt end to the Exultation and began searching the crowd for the culprit. The confused pilgrims, however, began to return to their dormitories, allowing Tharen to get slip away among the crowd."}, {"tag": "h3", "text": "Escape from Ylesia"}, {"tag": "p", "text": "The revelation that everything she believed in was a lie, left Tharen feeling betrayed and angry. Later that night she talked to Solo who confided that he was already planning their escape from Ylesia. When she read Teroenza's mind, Tharen had already learned the security codes to the High Priest's private yacht, the Talisman, which Solo intended to use to escape. However, she was concerned that Muuurgh would try to stop them and did not want to see him hurt. The Togorian had originally come to Ylesia in search of his mate, Mrrov; when he was told that she was not there, he had been forced to take a job to fund his continuing search. Tharen recalled having seen another Togorian on Ylesia several months earlier and suggested that Mrrov may be in one of the other colonies. After confirming that the priests had lied to him and that Mrrov had been on Ylesia all along, Muuurgh agreed to help Solo and Tharen escape, if they took the two Togorians with them."}, {"tag": "p", "text": "Tharen continued to work for Teroenza while the group made preparations for their escape. While she worked, she began to pick out the most valuable items in Teroenza's collection, which Solo intended to steal to fund his application to join the Imperial Academy. No longer believing in the Ylesian religion, Tharen intended to stop attending devotions where possible, but still found herself drawn the Altar of Promises and the feeling of rapture brought on by the Exultation. One night while Solo was off-world, Tharen was returning to her dormitory following the Exultation when she was stopped by Teroenza's majordomo, Ganar Tos. The elderly Zisian had become attracted to Tharen and has asked Teroenza for permission to marry her, to which the High Priest had agreed. Tos led Tharen back to the Altar of Promises where Teroenza was waiting to conduct the ceremony but Tharen claimed that her customs required a day to purify herself first. Much to Tos's disappointment, Teroenza agreed to wait and announced that the pair would be married the following night in front of the full congregation."}, {"tag": "p", "text": "By the time Solo returned later that night, Muuurgh had learned that Mrrov was due to be sent to Kessel the following day. With her own reasons to escape that night, Tharen was already waiting for him when Solo went to her dormitory to fetch her, and the two Corellians headed to Teroenza's collection room to meet Muuurgh. The group began to gather the items Tharen had selected and were almost finished when Solo inadvertently triggered an alarm. Before they could escape, they were confronted by Teroenza, his Hutt overlord, Zavval and several guards. In the ensuing firefight, Solo shot the Hutt's hoversled, causing him to crash into the room's central support pillar and be crushed as the ceiling collapsed. Tharen, Solo and Muuurgh survived, as did Teroenza, who charged at the escapees, only to be shot and wounded by Solo. The group fled the collection room but were confronted by more guards outside. After Solo and Muuurgh dispatched the guards, Tharen saw Ganar Tos attempting to sneak up on Solo and stunned the Zisian with her blaster before the group headed to the Talisman."}, {"tag": "p", "text": "Finally reaching Teroenza's yacht, the group took off and headed for Colony Two, from where Mrrov would soon be departing for Kessel. They arrived shortly before dawn to find the pilgrims assembled and awaiting their transport. Solo hovered the yacht over the crowd while Tharen lowered Muuurgh down in a harness to fetch his mate. The arrival of Teroenza's ship had taken the guards by surprise, but they soon reacted and opened fire on the descending Togorian. Tharen and Muuurgh returned fire until Mrrov, recognizing her mate, made her way through the crowd to join him. When Mrrov reached the harness, Tharen brought both Togorians aboard and Solo took the ship out of the atmosphere and safely into hyperspace."}, {"tag": "h3", "text": "Life with Han Solo"}, {"tag": "p", "text": "After leaving Ylesia, the group traveled to Togoria to take Muuurgh and Mrrov home. When they arrived the Togorians announced their intention to marry and invited the Corellians to stay for the wedding ceremony. During the next few days, Tharen and Solo spent much time together, taking several long walks and a mosgoth ride to the beach, where Tharen taught Solo how to swim. However, even as her relationship with Solo was growing, Tharen was struggling to cope with her new life. Her addiction to the Exultation caused her to experience intense withdrawal symptoms, including panic attacks and fits of crying, which Mrrov, who had overcome her own addiction while still on Ylesia, assured her would diminish with time. Tharen also felt that she had lost her sense of purpose and was angry toward those who had lied to her and who were still enslaving many other pilgrims."}, {"tag": "p", "text": "After attending the wedding, Tharen and Solo left for Corellia to reunite Tharen with her parents. Arriving in the Corellian system three days later, Solo landed the Talisman at Truthful Toryl's Used Spaceship Lot on the planet Talus where he intended to sell the vessel. However, Toryl, the lot's Duros proprietor recognized the ship and informed them that the Hutts were searching for it. As a result, he could only offer scrap value of 5,000 credits. Though the offer was far less than Solo and Tharen had been hoping for, they accepted."}, {"tag": "p", "text": "Posing as a married couple, the pair booked passage on a shuttle to Corellia's southern continent where Tharen had an emotional reunion with her family. Tharen's father gave Solo a warm welcome for rescuing his daughter, but her mother and brother were suspicious of the young pilot and disapproved of his relationship with Tharen. Their suspicions were confirmed the following day when Sera arranged for Dael Levare to visit the Tharen estate in the hopes of reigniting his relationship with her daughter. As a child, Solo had worked for the criminal Garris Shrike on a number of confidence tricks and Levare recognized him from one such scam. Although Renn Tharen forbade his wife and son from reporting Solo to the Corellian Security Force, arguing that they owed him a second chance, Tharen did not trust them not to do it behind his back and decided that she and Solo should leave Corellia."}, {"tag": "p", "text": "Before leaving, Solo sold the artifacts stolen from Teroenza's collection and arranged for the money to be paid into a bank account under the name of Jenos Idanian, an alias which was not known to the Hutts. Tharen and Solo booked passage on a passenger liner bound for Coruscant, the capital world of the Galactic Empire, where Solo intended to withdraw the money and submit his application to the Imperial Academy. After arriving on Coruscant five days later, Tharen found herself overwhelmed by the ecumenopolis. As she stared over a ledge at the lower levels of the city, her feelings of vertigo mixed with a desire to jump, knowing that her death would free her from the pain she still felt over the loss of the Exultation. Tharen resisted the urge and she and Solo made their way to a cheap hostel where they spent the night."}, {"tag": "p", "text": "The following morning, Solo headed for the bank to withdraw the money. When Solo failed to return on time, Tharen realized something had gone wrong and headed to their agreed meeting point, a cantina called The Glow Spider. Solo eventually arrived and Tharen learned that Corellian Security had discovered the fake account and blocked it. On the run from the Imperial security forces, the pair found a room in a cheap but secure flophouse on one of the lower levels of the city."}, {"tag": "p", "text": "The money from the sale of the Talisman was running low and Solo suggested that they abandon Coruscant and try to make a life together elsewhere. Tharen, however, did not want to see Solo sacrifice his dream of becoming an Imperial officer for her sake. Fearing that she was becoming too reliant on him to help her overcome her addiction, and that this would only hold them both back, she decided that they must go their separate ways. Slipping out while Solo slept, Tharen found a nearby cantina and used its comm unit to contact her father on Corellia and ask for his help. Renn Tharen warned her not to return home as Corellian Security were looking for her, but arranged for a business associate on Coruscant to meet with her and deliver some money. She returned once more to the room she shared with Solo, leaving him an emotional letter explaining why she had to leave and enough money for him to enter the Academy before leaving to confront the addiction alone."}, {"tag": "h3", "text": "Joining the resistance"}, {"tag": "p", "text": "Tharen spent almost three years trying to overcome her addiction to the Exultation, wandering from world to world, trying everything from meditation to drugs. Twice she bought tickets to return to Ylesia, though she could never go through with it. Eventually, she returned to Corellia where she found a group that helped her to overcome her addiction. Finding a new purpose in life, Tharen joined Garm Bel Iblis's Corellian resistance movement and resolved to devote herself to fighting against slavery and the Empire that condoned it. In order to protect her family from Imperial retribution, she cut off all contact with them, though she found ways to let her father know she was alright a couple of times a year through roundabout channels. Over the next few years the resistance movement grew from a small group of dissidents gathering for clandestine meetings to having several thousand operatives and cells in most major Corellian cities. Tharen, like most of those involved with the resistance, was unaware of its full size and structure, ensuring that she could not compromise the organization if caught."}, {"tag": "p", "text": "Tharen's work with the resistance involved making contact with resistance groups on other worlds, but they also supported her in fighting back against Besadii and their slave operation on Ylesia. In 5 BBY, the resistance dispatched Tharen and Lanah Malo to Devaron to make contact with the local resistance. Learning that Sacredot Veratil was on the planet to recruit pilgrims for Ylesia, the pair planned to assassinate the priest while he conducted a revival in the town square. As she and Malo moved through the large crowd, Tharen was spotted by Han Solo, who had come to Devaron after being discharged from the Imperial Navy for disobeying orders. Solo's attempts to reach her brought him to Veratil's attention and the t'landa Til alerted his guards. The sight of Solo stirred up old feelings in Tharen, but she couldn't let him see her for fear of compromising her mission. Tharen and Malo were forced to abandon their assassination attempt and flee back to the cheap room they had rented for their stay. Despite their failure to kill Veratil, the pair did make contact with the Devaronian resistance before returning to Corellia."}, {"tag": "p", "text": "Several months later, Tharen led a dawn raid on Ylesia's Colony Three. The raid resulted in the deaths of a dozen guard, damage to several buildings and the liberation of ninety-seven slaves. It also earned Tharen the wrath of the Besadii clan, leading Aruk the Hutt to put a 50,000 credit bounty on her head. However, the rebels initially had difficulty persuading the freed slaves of the truth about Ylesia. Only two out of the two hundred slaves had been prepared to leave with them and Tharen had been forced to order her troops to stun the others. The pull of the Exultation proved too strong for many and, within a month, fifty-three had run away to return to Ylesia. This, combined with the turbulent atmosphere on Ylesia, which had destroyed one of the rebel ships, discouraged further attacks on Ylesia itself for the time being, but Tharen was involved in several raids on ships carrying slaves from Ylesia to Kessel."}, {"tag": "h3", "text": "Undercover agent"}, {"tag": "p", "text": "In 4 BBY, five months after the raid on Ylesia, Tharen became involved in undercover intelligence work, putting skills in establishing false identities that she'd learned from Solo to use. One mission saw her working on the civilian staff at the largest Imperial military base on Corellia, charged with learning as much as she could about Imperial operations and reporting her findings to her contact within the resistance. Her position only gave her access to bureaucratic lists, such as supply orders, but soon learned that the Imperials were building up their strength in the Corellian system. Hoping to learn more, Tharen used her looks to manipulate Admiral Trefaren into inviting her to a reception being held by the Corellian government for senior Imperial officers, including several Moffs."}, {"tag": "p", "text": "Later that year, Tharen went undercover posing as the mistress of Sarn Shild, the Imperial Moff whose territory included Hutt Space. In truth Shild's sexual preferences weren't for Human women and he kept her around as a show object. Tharen was responsible for overseeing his household staff and office and became the Moff's confidant. Although she hated the assignment, Tharen was able to funnel a large amount of information back to Corellia."}, {"tag": "p", "text": "Shild had always allowed the Hutts to operate with near impunity in exchange for certain \"political contributions.\" However, while Tharen was assigned to Shild, the Emperor demanded that Shild clamp down on the Hutts and put an end to the trafficking of illegal weapons from Hutt Space. In response, the Desilijic clan sent Han Solo—who was now working as a smuggler for Desilijic—to Coruscant to negotiate with Shild while he attended a conference there on law and order. Tharen accompanied Shild on his trip and stayed in his luxury penthouse, where she briefly encountered Solo after Shild rejected his attempts to negotiate. Tharen was unable to tell Solo the truth and he left thinking that her relationship with Shild was genuine."}, {"tag": "p", "text": "After leaving Coruscant, Tharen accompanied Shild to the gambling planetoid Velga Prime and later joined him on a space station orbiting his headquarters on the planet Teth to watch Shild's fleet, under the command of Admiral Winstel Greelanx, depart for the Hutt moon of Nar Shaddaa. She was shocked to hear Shild announce his intention to follow his offensive against the Hutts by declaring independence for his sector and launching a campaign against Emperor Palpatine. Shild's fleet was subsequently defeated by a smuggler coalition at the Battle of Nar Shaddaa and Tharen withdrew from her assignment shortly before Shild took his own life. The resistance later learned that Greelanx had been under Imperial orders to make the attack fail and Tharen came to suspect that Palpatine, seeing Shild as a threat, had manipulated him into his own downfall."}, {"tag": "h3", "text": "Birth of the Alliance"}, {"tag": "p", "text": "By 2 BBY Tharen had become a commander within the resistance and had returned to her previous work, contacting members of other anti-Imperial groups operating on planets throughout the Empire. Both Tharen and the leaders of her movement felt that the scattered groups needed to unite if they were to overthrow Emperor Palpatine. One assignment saw Tharen travel to the Wookiee homeworld Kashyyyk where she helped advise Wookiee resistance members on organization, codes and tactics."}, {"tag": "p", "text": "Later, when Tharen learned of a major sabacc tournament being held on Cloud City on the planet Bespin, she realized that the large number of visitors during the tournament would make it an ideal place to hold a meeting with several rebel groups. Traveling to Bespin with her aide, Jace Paol, Tharen met with representatives from three other resistance groups; Jenssar SoBilles from Duro, Sian Tevv from Sullust and Hric Dalhney, Winter and Ylenic It'kla from Alderaan. Although all groups were fighting for the same cause, Tharen struggled to gain any commitment from them to work with the Corellian resistance. However, she did succeed in convincing Winter, who promised to help convince Viceroy Bail Organa of Alderaan upon her return. While in Cloud City, Tharen once again caught sight of Han Solo, and watched him win the Cloud City Sabacc Tournament, though she again made sure that he was not aware of her presence."}, {"tag": "p", "text": "Tharen continued to work towards uniting the rebel groups, meeting with Commander Winfrid Dagore and Lieutenant Palob Godalhi of the Tethan resistance in their enclave beneath the planet's port city. The Tethans were initially skeptical, but Tharen convinced them to increase their raids on Imperial supply vessels and munitions dumps in the Outer Rim and to supply the stolen weapons to other rebel groups. Around the same time, Senator Mon Mothma of Chandrila entered into negotiations with Tharen's superiors and Bail Organa of Alderaan, which led to the signing of the Corellian Treaty and the formal creation of the Alliance to Restore the Republic. Forced to flee the Imperial Senate on charges of treason, Mon Mothma began meeting with resistance groups on worlds throughout the Empire and the Alliance soon began to grow."}, {"tag": "h3", "text": "Red Hand Squadron"}, {"tag": "p", "text": "The signing of the Corellian Treaty allowed Tharen to leave her liaison work and become more involved in combat. She was given command of the Marauder-class corvette Retribution and the Y-wing starfighters of Crimson Fury and assembled a team of Rebels to serve under her, many of whom were former slaves. Tharen's crew held her in great esteem and, like Tharen herself, were willing to give their lives to free others from slavery. They quickly acquired a reputation for giving no quarter to slavers, who consequently named them \"Red Hand Squadron\". Tharen happily adopted the name and had the symbol of a blood-dripping hand painted on the bow of her flagship."}, {"tag": "p", "text": "Tharen's fifth mission as commander of the Retribution was the capture of the CR90 corvette Helot's Shackle, which was carrying nearly two hundred slaves from Ylesia to Kessel. The Retribution's medical officer, Daino Hyx, had developed new techniques for curing Exultation addiction which Tharen planned to test on the slaves held aboard the Helot's Shackle. Twenty-six of the slaves Tharen had rescued during the previous two years had gone on to serve as active members in the resistance and Tharen hoped that Hyx's methods would help them gain more new recruits."}, {"tag": "p", "text": "The Retribution and Crimson Fury's Y-wings waited outside the Ylesia system until a Rebel operative on the space station orbiting Ylesia signaled that the Helot's Shackle had departed, at which point they jumped into the system to catch the corvette before it could jump to hyperspace. Upon arriving, the Y-wings commenced strafing runs to bring down the Helot's Shackle's deflector shields and disable the vessel. Tharen remained aboard the Retribution to coordinate the attack while the first wave of shuttles boarded the slaver corvette and neutralized the majority of the slaver resistance, but personally joined the second wave to help finish the last pockets of resistance."}, {"tag": "p", "text": "As her squad made their way to the bridge they encountered a group of slavers. Tharen's forces fought their way past, killing three of the slavers and leaving six wounded. Tharen ordered that the survivors be executed before proceeding to the captain's quarters, located beneath the bridge. Blowing a hole through the ceiling, she led her squad into the bridge and killed the remaining slavers, bringing the ship under Rebel control. With the ship captured, Tharen made her way to meet Hyx at the slave hold. However, she was surprised by an armed slaver who had evaded the Rebels and who demanded a shuttle and her share of the slaves. When the slaver's aim wavered momentarily, Tharen pulled her own blaster and shot the slaver in the chest. Leaving the slaver to die, Tharen released the slaves and left them to Hyx's care."}, {"tag": "p", "text": "When the Helot's Shackle's systems were brought back online, Tharen took both the captured vessel and the Retribution to rendezvous with the Rebel ship Deliverance to transfer the pilgrims. The rescued pilgrims were taken to Grenna Base where Hyx had great success in treating them, with over a ninety percent success rate, and many of the cured pilgrims volunteered to join the Alliance. The Helot's Shackle itself was refitted to serve as a Rebel combat ship and Tharen christened the ship Emancipator. As a result of the raid, Durga Besadii Tai, the new leader of Besadii, increased the bounty on Tharen to 100,000 credits."}, {"tag": "p", "text": "One month after the capture of the Helot's Shackle, Tharen was recalled to Corellia. On the way, the Retribution picked up a call from the Rebel ship Pride of the Rim requesting help against some Imperial picket ships. The Retribution responded, but took some damage to its sublight drive, delaying Tharen for a day while repairs were conducted."}, {"tag": "p", "text": "When she finally arrived at Corellia, Tharen met with her commanding officer, Pianat Torbul, who informed her that Red Hand Squadron was to be assigned to assist Rebel forces in the Outer Rim. During the meeting Tharen suggested that, with their success in curing Exultation addiction, the time had come for a major attack on Ylesia. With over eight thousand pilgrims on Ylesia, they presented a major source of potential recruits and, in addition, they would be able to steal tons of valuable spice to help finance the war on the Empire. Although Torbul agreed to consider Tharen's plan, funding such a large invasion would be difficult and safely negotiating Ylesia's atmosphere was a major concern. Tharen resolved to find a solution to both problems."}, {"tag": "h3", "text": "Journey to Nar Shaddaa"}, {"tag": "p", "text": "Tharen's solution to funding was to enlist the help of the Desilijic Hutts and she arranged to meet with Desilijic's leader, Jiliac Desilijic Tiron, on the Hutt homeworld Nal Hutta. Although Hutts had no particular interest in the Rebellion, Desilijic's business was being hurt by the Besadii clan's operations on Ylesia and Tharen hoped that they might be willing to fund the attack on their rivals. Tharen arranged passage to Hutt Space aboard the Haj Shipping Lines luxury liner Queen of Empire, traveling under the guise of Bria Lavval, a cabaret singer who was due to perform at the Chance Castle casino on Nar Shaddaa, and sharing a stateroom with three members of Red Hand Squadron posing as her agent, business manager and bodyguard."}, {"tag": "p", "text": "On the fourth night of the voyage, Tharen visited the Star Winds Lounge nightclub to witness a performance by the Rughja orchestra-band Umjing Baab and His Swinging Trio. At one point, Umjing Baab invited Tharen to join them on stage to perform the hit song \"Smoky Dreams.\" Tharen's performance was well received by the males in the audience, among them the gambler Lando Calrissian. As Tharen returned to her seat, Calrissian asked her to dance; staying in character, she accepted. While they danced, Calrissian mentioned that his friend owned a SoroSuub Starmite-class freighter called Bria. Realizing that he knew Solo, Tharen invited Calrissian to her quarters later that evening, hoping to learn more about what her former lover had been doing since she last saw him."}, {"tag": "p", "text": "However, when Tharen arrived at her quarters, she was attacked by the bounty hunter Boba Fett. Fett had been hunting Tharen intermittently for over a year but the bounty specified that she should be captured alive and her frequent deep-cover assignments, together with the high security at Rebel installations made her very difficult to get close to. Having tracked her to the Queen of Empire, Fett waited for her to be alone and shot her with a tranquilizer dart as she entered her quarters. Tharen awoke to find herself bound and her companions dead. Knowing that escape was unlikely, Tharen asked Fett if he would let her father know that she was dead so he wouldn't have to find out when her next message failed to arrive. To her surprise, Fett agreed to the request."}, {"tag": "p", "text": "Before Fett could take his prize back to his ship, Calrissian arrived. Tharen was unable to warn the gambler and Fett captured him too. Fett intended to leave Calrissian alive, provided that Tharen not cause him any trouble. However, when the Queen of Empire was pulled out of hyperspace by a pirate raid led by Calrissian's ex-girlfriend, Drea Renthal, Fett led both his prisoners towards the shuttle bay. On the way they were cornered by Renthal and a large group of pirates. Renthal agreed to let Fett leave without trouble, provided that he release Calrissian first. The bounty hunter accepted the offer but Calrissian refused to leave Tharen to Fett and pointed out that Renthal owed Solo a favor. Renthal offered to pay Fett the 100,000 credit bounty to let Tharen go. Outnumbered by the pirates, Fett reluctantly agreed."}, {"tag": "p", "text": "After the pirates concluded their raid, they took Tharen and Calrissian to Nar Shaddaa aboard Renthal's flagship, the Carrack-class light cruiser Renthal's Vigilance. From there, Tharen took a shuttle to Nal Hutta where she met with Jiliac. Her proposal was simple, Desilijic would finance the Rebel raid on Ylesia, and would arrange for the elimination of the t'landa Til priests beforehand. In exchange the Rebels would ensure that Besadii's operations on Ylesia were shut down for good by destroying the spice factories. Jiliac's nephew, Jabba Desilijic Tiure, was impressed and argued that they should consider the offer, but Jiliac refused to get involved with the Rebels and turned Tharen down. Before leaving, however, Tharen gave Jabba a datacard with her contact details in case Jiliac ever reconsidered."}, {"tag": "p", "text": "After Tharen returned to Nar Shaddaa, she went for a meal with Calrissian, who was happy to regale her with the story of the Battle of Nar Shaddaa, in which he had participated. Tharen was impressed with the way the smugglers had managed to defeat the Empire in battle. Rebel pilots were eager but lacked the proper training required to negotiate Ylesia's turbulent atmosphere. Tharen realized that, for any attack to succeed, the Rebels would need excellent pilots to act as guides, and that the smugglers' experience made them ideal for the job, if they would be willing to hire themselves out."}, {"tag": "h3", "text": "Return to Ylesia"}, {"tag": "p", "text": "Tharen returned to the Retribution, but a month after her meeting with Jiliac, she was contacted by Jabba the Hutt, who had become the leader of Desilijic after Jiliac's death at the hands of Durga the Hutt. Jabba informed Tharen that he had decided to accept her offer and was already placing operatives on Ylesia to assassinate the priests. Tharen returned to Nar Shaddaa to meet with Jabba and plan the operation. While on the Smuggler's Moon, Tharen tracked down Solo, finding him and his Wookiee co-pilot Chewbacca in the Blue Light tavern. After an emotional reunion, Tharen asked Solo to help her pitch her idea to his smuggler contacts. In exchange for their assistance, the smugglers would be given a share of Ylesia's spice and Tharen promised to give Solo a share of Teroenza's collection."}, {"tag": "p", "text": "Solo, who was still angry with Tharen for leaving him ten years earlier, initially refused to help. However, Solo's business sense eventually overcame his personal feelings and later that night, the smuggler visited Tharen's room at The Smuggler's Rest and agreed to convince his friends, in exchange for fifty percent of Teroenza's treasure. Over the following days, Tharen and Solo recruited many smugglers and privateers for the mission. By the time the pair traveled to the Alliance's deep space rendezvous point aboard Solo's YT-1300 light freighter Millennium Falcon, the Rebels had assembled most of their attack force, including personnel and ships from Corellia, Bothawui, Sullust, Alderaan and Chandrila, for what would be the Alliance's largest operation to date."}, {"tag": "p", "text": "Tharen and Solo attended several planning sessions over the next two days, before Tharen was instructed to meet with some potential allies on Ord Mantell. Accepting Solo's offer of a ride, Tharen traveled to the Mid Rim world and convinced Rebel leaders there to commit three ships and a hundred troops to the Ylesia raid. As they were preparing to return to the rendezvous point, Tharen received orders to pick up a group of Togorians who had volunteered for the mission on the way back. Upon arriving at Togoria, Tharen and Solo learned that their old friends, Muuurgh and Mrrov, were among the volunteers. The Togorians were still waiting for one member of their group to arrive so arranged accommodation for their visitors for the night. Being back on Togoria stirred up old feelings and Tharen and Solo resumed their relationship."}, {"tag": "p", "text": "After returning to the fleet, Tharen began final preparations for the imminent assault. There would be nine Rebel attack groups—one for each colony on Ylesia—with each accompanied by at least three smuggler guides. Tharen chose to lead Red Hand Squadron against Colony One and assigned Solo as one of the guides for her group. The night before the mission, Tharen received a message from Pianat Torbul. Intelligence reports indicated that the Empire was planning a major assault and the Alliance would need all the resources they could get if they were going to survive. Torbul ordered Tharen to take all of the weapons and spice she could capture."}, {"tag": "p", "text": "The Battle of Ylesia saw the Rebels encounter heavier resistance than expected. As they entered the planet's atmosphere, the Rebel ships came under turbolaser fire and Tharen was forced to divert her group to their alternate landing site on a beach over two kilometers from the center of Colony One. Accompanied by Solo and Chewbacca, Tharen's team started up the beach but soon encountered resistance from a group of Nova Force mercenaries. Splitting her group into two, Tharen caught the mercenaries in a crossfire, clearing the way into the colony."}, {"tag": "p", "text": "Tharen dispatched the Togorians to secure the administration building and sent Jace Paol and a squad of troops to eliminate the turbolaser to allow reinforcements to land safely, while she led the rest of her troops into the colony to secure the factories, welcome center and dormitories. Despite heavy mercenary resistance, Tharen's forces captured the colony and secured the turbolaser defenses. Tharen made her way to the pilgrims' dormitory and addressed them as they were herded outside. Despite her attempts to calm them, however, the Exultation-deprived pilgrims charged their rescuers and Tharen was forced to have her troops fire stun beams into the crowd."}, {"tag": "p", "text": "Following her orders from the previous night, Tharen had the smugglers placed under guard, except for Solo and Chewbacca who she led to Teroenza's treasure room. When they entered, they were confronted by an armed Teroenza. Before Teroenza could fire, however, Boba Fett emerged from the shadows and shot him dead in order to claim a bounty on the t'landa Til. Soon after the bounty hunter left with his prize, a Rebel shuttle arrived to pick up Teroenza's treasure. Pulling her blaster on Solo and Chewbacca, Tharen explained that the Rebels needed every last credit and could not afford to share any of it. Tharen tried to persuade Solo to go with her and to fight the Empire at her side, but Solo was devastated by her betrayal and made it clear he did not want anything more to do with her. She and Solo parted on the worst of terms."}, {"tag": "h3", "text": "The Yavin Vassilika"}, {"tag": "p", "text": "The former lovers were, however, destined for one more reunion. While working under General Jan Dodonna, Tharen used some of the money made from the Battle of Ylesia to place a four million credit reward for the Yavin Vassilika. A crystalline artifact etched with Massassi hieroglyphics, the Vassilika was believed by many to be only a myth, but actually contained a key to the Massassi Temple on Yavin 4, a site of great strategic value to the Alliance."}, {"tag": "p", "text": "The reward attracted Jozzel Moffet, a handmaiden in the employ of Malta the Hutt, who tricked her master into a competition against the Hutts Jabba and Embra to see who could find the Vassilika first. Each Hutt put together a team to search for the artifact and Solo was drawn into the hunt as part of Jabba's team, which also comprised Chewbacca and Lando Calrissian. Solo helped Moffet locate the artifact on an uncharted planet in Wild Space, only for her to betray him and deliver it the rendezvous point on Yavin 4. Tharen accompanied Dodonna to the exchange and used her knowledge of antiquities to confirm that the artifact was genuine. However, the exchange was broken up by Solo and the other treasure hunters hired to find the Vassilika."}, {"tag": "p", "text": "As the treasure hunters turned on each other, the Rebels fled into the Yavin 4 jungle with the Vassilika. Solo's team pursued and demanded their share of the Ylesia spoils. Dodonna informed them that it had already been spent on the war effort but agreed to help compensate them for their efforts. Taking cover in the jungle, Tharen and her team waited for the bounty hunters Dengar and Bossk, who were on Yavin 4 as part of Malta's team, to approach. Capturing the bounty hunters, the Rebels turned them over to Solo and Calrissian so that they could claim the 200,000 credit bounty on the pair which had been posted by the rival bounty hunter Zuckuss. Despite Tharen's help, Solo was still visibly furious; once again he had helped her get something for the Rebellion and was left with nothing."}, {"tag": "h3", "text": "Final mission"}, {"tag": "p", "text": "The credits raised at Ylesia helped the Rebels learn that the Empire was constructing a new secret weapon, a battlestation called the Death Star which was capable of destroying a planet. Knowing that their only chance to defeat the Death Star was to obtain a copy of its plans and attempt to find a vulnerability, the Alliance planned a coordinated offensive to recover the plans as they passed through the Outer Rim world Toprawa. Torbul informed Tharen that an Intelligence team was being sent to Toprawa to capture the plans; despite knowing that it was likely to be a one-way mission, Tharen volunteered Red Hand Squadron to accompany them."}, {"tag": "p", "text": "The Rebels were able to capture the plans and an Imperial communications center but the Empire was quick to respond. Red Hand Squadron fought to hold off the Imperial forces while comm techs transmitted the plans to the Rebel courier ship Tantive IV as it passed through the system. By the time the Tantive IV left the system, Red Hand Squadron had taken heavy losses and Tharen, herself injured, had lost contact with the Retribution and their only chance of escape. Shortly after, Red Hand Squadron was finally overwhelmed by Imperial forces and Tharen swallowed a poison pill to avoid capture and interrogation. She died never knowing the importance of the plans she'd helped to recover."}, {"tag": "p", "text": "Tharen's body was found and identified in the aftermath of the battle. When news of her death reached Boba Fett, the bounty hunter resolved to keep his promise to let her father know when she died. Tharen had never told him how to contact her father so, knowing Solo could reach him, Fett located Solo on Tatooine and asked him to pass on the message to Renn Tharen, a request to which Solo sadly complied."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a young girl, Tharen was intelligent and independent minded. A tall woman with blue-green eyes, long, dark eyelashes, poreless white skin and reddish-gold, curly hair, she was not classically beautiful, but was considered attractive. She was particularly keen on history during her time at school, and was looking forward to continuing her studies at university in the hopes of pursuing a career as a museum curator. Although Tharen studied hard, she also made time to enjoy herself, attending numerous parties during her youth. However, she grew frustrated that working hard and behaving herself was seemingly not enough to please her mother. Sera Tharen kept a tight rein over her daughter and the young Bria grew up feeling that she could do nothing right by her. While her father supported Tharen in her desire to have a career, her mother wished only for her to marry into a family of good breeding. The falling out between the two after Tharen split from Dael Levare was the culmination of years of tension."}, {"tag": "p", "text": "Feeling that her life on Corellia was empty and meaningless, Tharen felt a new sense of purpose upon first experiencing the Exultation. Believing it to be a deeply spiritual experience, she gave up her old life to join the pilgrims on Ylesia, believing that her newfound faith would help her to make the galaxy a better place. For almost a year on Ylesia, Tharen was devoted to her religion. She held the t'landa Til priests in high regard and hoped to one day reach their level of spirituality. Despite her piety, Tharen sometimes thought of her old life and lamented the fact that both her memory and intelligence seemed to be fading over time."}, {"tag": "p", "text": "Upon meeting Han Solo, Tharen found herself attracted to his charm and energy. Despite Solo's own attraction to her, Tharen resisted her feelings, not wanting anything to distract her from her work and her prayers and she found herself falling in love with him. When she learned that her religion was a fraud Tharen felt betrayed and that her purpose in life had been taken away. After leaving Ylesia, Tharen entered into a relationship with Solo but found that she still had doubts. Solo was content to live a simple life but Tharen still hoped to find some purpose in life. In addition, she was suffering the effects of Exultation withdrawal and did not feel she could fully commit to Solo while she felt that a part of her was missing. The withdrawal cravings came in intense waves and Tharen could barely go an hour without missing it. She was afraid that she would not be strong enough to resist the temptation to return to Ylesia and even contemplated suicide as a way to end her suffering. Solo's support was instrumental in her fight to control her addiction, but Tharen came to feel that she was relying on him too heavily. Ultimately, she decided that she needed to overcome her addiction alone rather than risk holding Solo back from his own goals. However, she never stopped caring for Solo."}, {"tag": "p", "text": "Tharen eventually overcame both the mental and physical effects of her experience at Ylesia and came to realize that she did not have to punish herself for failing to live up to her mother's expectations. She found a new purpose in life working with the Corellian resistance movement and later the Rebel Alliance against the Galactic Empire. Ending slavery and helping others who were suffering as she once had was a major motivation for Tharen. As leader of Red Hand Squadron she inspired loyalty from those who served with her. However, she was also ruthless and unforgiving in battle, particularly with slavers, leading to Red Hand Squadron's reputation for taking no prisoners. Tharen was willing to sacrifice everything for the Rebellion. She put the Alliance ahead of her feelings for Solo, betraying him on both Ylesia and Yavin 4. Despite knowing that it would likely lead to her death, she did not hesitate to volunteer for Red Hand Squadron's final mission to Toprawa."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Tharen's time working on an archaeological dig gave her experience in handling delicate artifacts. During her time as a pilgrim on Ylesia, Tharen proved herself to be a highly skilled and dexterous craftsperson in her work separating threads of spice. Her knowledge or rare antiquities enabled her to determine which objects in Teroenza's collection were the most valuable, and later to verify the authenticity of the Yavin Vassilika."}, {"tag": "p", "text": "During her time with the Rebellion, Tharen displayed proved to be an articulate negotiator in her work as a liaison to other resistance cells. She was also skilled at undercover work and capable of manipulating situations to find out what she needed. A capable actor, Tharen could conceal her true feelings automatically, and was adept at disguising her appearance. Since so little of what she learned during her undercover work could be written down, Tharen took lessons and underwent conditioning to improve her memory."}, {"tag": "p", "text": "Tharen was considered by her superiors to be an able leader. Her organizational skills were demonstrated by her ability to catalog Teroenza's collection and oversee Sarn Shild's household staff and office. Combined with her understanding of strategy and tactics, and her own combat skills both with a blaster and unarmed, this made her an effective leader for Red Hand Squadron."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a pilgrim on Ylesia, Tharen wore a bulky tan robe and cap with infrared goggles that enabled her to work in low light conditions. On duty with the Rebellion, Tharen dressed in battle fatigues and typically wore a BlasTech Industries DL-18 Blaster Pistol in a tie-down holster low on her right thigh, with a belt to carry extra power packs and her vibroblade. She kept a hold-out blaster in her right boot. When going in to combat, Tharen utilized a blaster rifle and a comlink to communicate with her troops."}, {"tag": "p", "text": "On undercover assignments, Tharen was unable to carry a blaster, but carried a vibroblade strapped to her upper thigh for protection. To fend off the advances of Imperial officers while working at an Imperial base on Corellia, Tharen also kept a sedative on her person which she could slip into their drinks to put them to sleep. Tharen also wore a golden bracelet studded with Corusca gems that would flash in the vicinity of surveillance equipment."}, {"tag": "p", "text": "Tharen's command ship was the Republic Sienar Systems Marauder-class corvette Retribution. The ship was purchased second-hand by the Corellian underground from the Corporate Sector Authority, having previously served in the Authority's picket fleet. The ship was capable of both space and atmospheric combat, and served as a base of operations for Red Hand Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bria Tharen was created by A. C. Crispin to serve as Han Solo's romantic interest in the Han Solo Trilogy and first appeared in The Paradise Snare, the first book in the trilogy, released in 1997. Her only other appearance to date was in Mike Kennedy's comic Underworld: The Yavin Vassilika, set during the events of Rebel Dawn, the novel in which the character is killed. In the article Boba Fett: A Bounty Hunter's Journey in Star Wars Insider 117, Leland Chee mistakenly refers to Bria Tharen as \"Shira Brie.\""}, {"tag": "p", "text": "While developing the Han Solo Trilogy, Crispin worked backwards to try and provide an explanation for how Han Solo became the character that first appeared in Star Wars: Episode IV A New Hope. Solo appeared to her to be suspicious of women, especially those involved with the Rebellion. He also refused to help the Rebels unless he was paid and did not pursue a relationship with Leia Organa until Star Wars: Episode V The Empire Strikes Back, set three years after their first meeting. Crispin concluded that Solo had been involved in a previous relationship with a Rebel woman which had ended with her betraying him. Lucasfilm agreed to the idea and Crispin developed the Bria Tharen character."}, {"tag": "p", "text": "Crispin intended for Tharen to come across as devoted to her cause and willing to do anything to help it, even betraying the man she loved. Given Solo's later relationship with Organa, Crispin chose to kill off the Tharen character before Solo met Organa, and saw the Battle of Toprawa—an event first described in the Star Wars radio drama—as a way to tie her death into the events of A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}