{"url": "Brian_Vernel", "categories": ["Category:Real-world articles", "Category:Star Wars: Episode VII The Force Awakens actors"], "nodes": [{"tag": "h1", "text": "Brian Vernel"}, {"tag": "p", "text": "Brian Vernel is a Scottish actor who portrayed Bala-Tik in the 2015 film Star Wars: Episode VII The Force Awakens."}, {"tag": "p", "text": "Vernel made his first on-screen appearance in BBC One crime drama television series The Field of Blood (2011). In 2012, Vernel starred in the Davey Anderson play The Static, which played at the Traverse Theatre in Edinburgh. He played the lead role of Sparky, an intelligent but volatile teenager with psychic abilities. Rohanne Udall of Exeunt Magazine wrote: \"Vernel is confident and accomplished, bursting with energy and vigour from his first moments and transfixing the audience with the challenging gaze of a demanding youth.\" The performance earned Vernel a nomination for Best Actor at The Stage Awards of 2012. In 2013, Vernel appeared in the Donna Franceschild play Takin' Over the Asylum, a stage adaptation of the writer's television miniseries of the same name, which played at the Citizens Theatre in Glasgow. The Daily Telegraph's Mark Brown called his performance \"an impressive, high octane outing\". He won the Citizens Theatre Award for Best Actor for the performance."}, {"tag": "p", "text": "Vernel starred in the BBC miniseries The Casual Vacancy (2015), based on the novel of the same name by J. K. Rowling. He also co-stars in the BBC historical drama series The Last Kingdom, an eight-part adaptation of Bernard Cornwell's historical novels series The Saxon Stories. In 2015, Vernel portrayed Paul in the Barrie Keeffe play Barbarians at the Young Vic in the London Borough of Lambeth. Andrew Dickson, a reviewer with The Guardian, wrote: \"The show comes close to being stolen by Brian Vernel as Paul, for whom the only real constants are anger and betrayal; with his shaved skull and bruise-dark eyes, he resembles a caged snake, waiting to rear and strike.\""}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}