{"url": "Bricka_Thomor", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Merchants"], "nodes": [{"tag": "h1", "text": "Bricka Thomor"}, {"tag": "p", "text": "Bricka Thomor was a female Human merchant who worked on the planet Wielu selling weapons. She agreed to sell a weapon to the smuggler Rook Pryce during the Clone Wars and also provided him with fake information on the location of the criminal T'mott Zoat, for whom he was searching along with the Jedi Master Obi-Wan Kenobi. The information lead Kenobi and Pryce into a trap set up by Shon Ti'Ja, a crime boss whom wanted revenge on Pryce."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bricka Thomor was an arms dealer who worked in the Market Ward area on the planet Wielu during the Clone Wars, a conflict between the Galactic Republic and the Confederacy of Independent Systems. In around 21 BBY whilst at her stall, she observed the smuggler Rook Pryce being turned away by a rival weapons merchant, Gutodj, since the crime bosses that controlled much of Wielu had forbidden anyone from doing business with the untrustworthy smuggler. Bricka offered to ignore the ban and sell Pryce a blaster as well as information regarding the location of T'mott Zoat, a Shistavanen criminal that Pryce and his new co-pilot, Sal'ma Ben Bobo were searching for."}, {"tag": "p", "text": "For a price of 50 she handed over the weapon and informed the pair that the Nautolan Crime Boss Shon Ti'Ja had hired Zoat and the pair could be found on Alekie Island in the Menagerie built there. Bobo was in fact the Jedi Master Obi-Wan Kenobi in disguise, and as the pair began to leave for the island she warned him that he ought to know who he was dealing with in terms of Pryce, who had a reputation of not honoring contracts. Thomor however had lied to the pair, and after they left contacted Ti'Ja who had not hired Zoat but was looking for revenge on Pryce, who had sold weapons belonging to the Nautolan to a rival boss named Caylagos. Ti'Ja then prepared an ambush for the smuggler and the Jedi within the Menagerie but was ultimately bested by them in combat and revealed Thomor's deception."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bricka Thomor was a female Human with fair skin, brown hair and green eyes. She was willing to lie to Rook Pryce and send him into a trap along with his new co-pilot, although she did warn Kenobi that he should be careful dealing with the smuggler. She possessed a fish shaped tattoo on one arm and whilst working at the market wore a pink and purple dress along with a large amount of golden jewellery."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bricka Thomor first appeared in The Clone Wars: The Smuggler's Code, a digest sized comic book released in 2013. It was written by Justin Aclin and illustrated by Eduardo Ferrara."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}