{"url": "Brigade/Legends", "categories": ["Category:Legends articles", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Brigade"}, {"tag": "p", "text": "A brigade was a type of relatively large military formation, typically comprising two or more Battalions or Regiments. Probably the most famous use of this designation is in the name of the elite Special Operations Brigade of the Grand Army of the Republic during the Clone Wars. However, references to specific brigade organization are rare in the military forces of major Galactic powers."}, {"tag": "p", "text": "Among the line troops of the Grand Army and the subsequent Galactic Empire, the requirement for separate Brigade formations may have been vitiated by the ability of four-battalion Regiments to operate as single field formations. These were organized in turn into four-regiment formations, known in the Grand Army and the later Stormtrooper Corps as Legions, and as Battlegroups in the Imperial Army: at sixteen battalions, a full-strength Legion/Battlegroup was larger than any normal brigade, and in terms of formal organization, all of these units would seem in fact to have been equivalent to Divisions, with no permanent brigade-level hierarchy in the order of battle under either the Republic or the Empire."}, {"tag": "p", "text": "However, it is clear that at least some Legions could be thought of as containing a number of \"brigades\", as the term is on record to describe component formations from the 501st Legion on at least two occasions in 19 ABY. During the Great Jedi Purge, Gate Master Jurokk of the Jedi Temple estimated the force from the 501st that stormed the Temple as numbering several brigades in strength, and soon after the Declaration of a New Order, the term \"brigade\" was used by Sate Pestage to describe an element from the same Legion dispatched against New Plympto."}, {"tag": "p", "text": "It is clear from these references that the brigades being described here are something less than the full Legion, and it is possible that the 501st had been expanded to a strength of more than four regiments, with \"brigade\" being adopted to describe an intermediary level of hierarchy between the regiment and the enlarged legion; or alternatively, the term might indicate smaller formations of battalions and regiments within a standard-sized legion, perhaps temporary groupings for combat operations."}, {"tag": "p", "text": "There are other units for which the name \"brigade\" would be appropriate, though it seems never to be explicitly recorded in available sources: for example, the two Sarlacc Battalions from the 41st Elite Legion deployed to Dinlo during the Clone Wars functioned as a brigade in practice, if not in name, while three regiments of CompForce assault troops assigned to the Auxiliary Battlegroup of a field Corps in the Imperial Army had an autonomous identity between battlegroup and regimental level. The three battalions of armor and one of stormtroopers assigned to a typical Imperial planetary garrison could also conceivably have been given a brigade organization of one kind or another. There may also have been brigades within the SpecForces divisions of the Rebel Alliance and the military of the New Republic, but again, there is little or nothing in the way of direct references."}, {"tag": "p", "text": "The name \"brigade\" was also widely adopted by groups of irregular troops, such as the mercenaries of the Vibroblade Brigade and the paramilitary organization known as the Peace Brigade during the Yuuzhan Vong War. Needless to say, these units were usually brigades only in name: they did not share the battalion organization and troop-numbers that were the hallmarks of regular military brigades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The use of the term Brigade appears to be much rarer in Star Wars than it is in real-world militaries. In part, this reflects the fact that in both the Grand Army of the Republic and the Imperial Army, the multi-battalion Regiment serves as an integral component of a Battlegroup or Legion. This leaves little role for an intermediate brigade, which in the real world, is often organized directly from individual battalions of different parent regiments. In both the British Army and the U.S. Army, infantry regiments in particular have historically served as vehicles for deployment of these individual battalions rather than as battlegroups in their own right, and as a result, the multi-battalion regiment is not an integral component of higher field formations, as seems to be standard in Star Wars."}, {"tag": "p", "text": "The term \"brigade\" might still be used in Star Wars, however, to denote multi-battalion formations which do not constitute full regiments or battlegroups/divisions, such as the battalions of armor and infantry said to be deployed with every Imperial Corps HQ. This usage might explain the use of the term to describe the clone trooper forces from the 501st Legion deployed in the assault on the Jedi Temple in the novelization of Star Wars: Episode III Revenge of the Sith and sent to New Plympto in issue 1 of Star Wars: Dark Times."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}