{"url": "Bright_Tree_tribe", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic-aligned governments", "Category:Bright Tree tribe", "Category:Ewok tribes", "Category:Planetary governments"], "nodes": [{"tag": "h1", "text": "Bright Tree tribe"}, {"tag": "p", "text": "The Bright Tree tribe was an Ewok tribe from Bright Tree Village—a settlement located on the forest moon of Endor. At the time of the Battle of Endor, the tribe had been led by Chief Chirpa for forty-two seasons. After the Rebel Alliance's victory over the Galactic Empire at Endor, Chirpa was succeeded by his daughter Kneesaa."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before Chief Chirpa led the Bright Tree Tribe, his father Chief Buzza led before him. In 4 ABY, the Bright Tree tribe had been led by Chief Chirpa for forty-two seasons. At that time, aside from the Council of Elders, other figures of autority in the village included the shaman Logray and Chirpa's two best hunters, Asha Fahn and Teebo. Meanwhile, in the wider galaxy and far from the preoccupations of Ewoks, the Alliance to Restore the Republic waged war against the Galactic Empire."}, {"tag": "p", "text": "One day, the Bright Tree scout Wicket W. Warrick discovered a female human lying unconscious in the forest. Said woman was, in fact, Princess Leia Organa, a leading member of the Alliance. Organa had landed on Endor with a Rebel strike team whose role was to deactivate a deflector shield generator protecting the second Death Star, a planet-killing battle station developed by the Empire. Warrick quickly bonded with the stranger, and helped her to the safety of his village."}, {"tag": "p", "text": "Elsewhere, some of the tribe's hunters captured two humans, one Wookiee and two droids who were ensnared in the net of a trap. Unbeknownst to the Ewoks, their captives were respectively Luke Skywalker, Han Solo, Chewbacca, C-3PO and R2-D2, the other members of Princess Leia's strike force. Upon seeing C-3PO, a protocol droid with a shiny golden plating, the hunters mistook him for a god and started venerating him."}, {"tag": "p", "text": "The Rebel captives were brought to the Bright Tree Village and, at first, the shaman Logray decided that Solo, Skywalker, Chewbacca and R2-D2 would be sacrificed to serve as the main course at a banquet in C-3PO's honor. Despite Leia Organa's intervention and C-3PO's attempt at freeing his friends, the Ewoks refused to obey, and they only changed their minds when the so-called golden god used his magic. Actually, it was Skywalker, a Jedi Knight, who used the Force to elevate C-3PO in mid air, which compelled the Ewoks to cut the Rebels loose."}, {"tag": "p", "text": "At night the Bright Tree villagers gathered in Teebo's hut, where they learned of the Empire's threat to the galaxy by listening to C-3PO, who told them the whole story of the Rebel heroes. Inspired by the droid's tale, Chief Chirpa wanted to help the Rebels. But Logray, as a shaman, thought that his Ewoks should not meddle with matters that were beyond them. With the support of Teebo and Asha Fahn, Chirpa was able to overrule Logray, and he welcomed the Rebels as honorary members of the tribe."}, {"tag": "p", "text": "Having realized that their new friends were in fact heroes determined to destroy the cold metal moon hanging in the sky over their forest, the Bright Tree villagers agreed to help them. The Ewoks led the Rebels to the site of the bunker containing the shield generator, which had to be destroyed before the attack on the Death Star could begin. They also informed the Rebels that the bunker had a secret entrance. Paploo then stole an Imperial speeder bike, prompting scout troopers to chase him, thus creating a diversion."}, {"tag": "p", "text": "Although the Rebels managed to enter the bunker, they were immediately captured by Imperials who had been expecting their attack. Although the Alliance's plan seemed to have failed, the Bright Tree warriors made a timely entrance, along with members of other tribes that had answered their call to war. Their primitive weapons felled the stormtroopers and the scout walkers of the Empire. The tribe suffered losses, but its contribution allowed the Rebels to finally deactivate the deflector shield, which ultimately led to the Death Star's destruction in space above."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}