{"url": "Bright_Tree_Village", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic locations", "Category:Endor locations", "Category:Ewok culture"], "nodes": [{"tag": "h1", "text": "Bright Tree Village"}, {"tag": "p", "text": "Bright Tree Village was home to an eponymous tribe of Ewoks on Endor during the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The village was built within the evergreen trees of the Happy Grove Forest on Endor and fifteen meters above the ground, where nest-like bunches of thatched huts housing nearly 200 Ewoks clung to evergreen trees. The village center included communal meeting areas, along with homes for tribal elders and Chief Chirpa's family, including the Council of Elders. Large huts for extended families huddled along the outer edges of the village. The village was connected through a series of rope ladders, bridges, vines, and catwalks. Despite the vast majority of villagers inhabiting the upper forest canopy, bachelors maintained small huts below the village proper, where they kept watch for even greater dangers."}, {"tag": "p", "text": "The village's upper canopy was utilized by watchers to alert the village of marauding gorax and condor dragons, and was illuminated by fires and torchlights during the night. The bark of the conifer trees surrounding Bright Tree village was not only fire resistant, but made for a good insect repellent. Their boughs were used to make excellent spears, bows, slingshots, glider frames, and catapult arms. Gliders could also be launched from the canopy to patrol the lands and valleys beyond the immediate confines of the settlement. Following traditional Ewok houses, huts in Bright Tree Village were warm and cozy inside. A cooking fire was located at the center, where meat would be roasted on a spit and soups boiled in clay pots. Storerooms of food and kindling were layered under the floor, while sleeping mats and furs were stacked in the lofts above. Wooden stools and baskets often littered the area, and Ewok hoods, capes, and tools hung on the walls."}, {"tag": "p", "text": "Despite spending much of their time in the trees, inhabitants of Bright Tree Village had to descend to the forest floor to forage for berries, gather herbs, and hunt. Some Ewoks such as the Warrick family maintained huts and lodges on the ground."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime before the Battle of Endor, the Ewok Romba became a refugee following the destruction of his own village to make way for a shield generator complex utilized by the Galactic Empire for the construction of the second Death Star. He was eventually accepted into Bright Tree village by Chief Chirpa, who would rule Bright Tree Village for 42 seasons by the time of the battle."}, {"tag": "p", "text": "In the lead-up to the Battle of Endor, the Ewoks captured Han Solo, Luke Skywalker, Chewbacca, C-3PO, and R2-D2 near the village after Chewbacca tried to eat a dead verkle used as hunting bait. Lone Ewok Wicket W. Warrick also befriended Princess Leia Organa, who had gotten separated from the main group, and was brought back to the village on friendly terms. The other group of Rebels were taken captive within the village and were nearly roasted alive for a feast, but C-3PO—whom the Ewoks believed to be a deity—convinced the Ewoks to free them after Luke utilized the Force to lift Threepio off the ground, scaring many Ewoks into submission."}, {"tag": "p", "text": "Telling the story of the Alliance's battles against the Galactic Empire, Threepio eventually secured the group's admission as members of the tribe after a debate between Chirpa, the shaman Logray, and his two best hunters, Teebo and Asha Fahn. In the middle of the night and unbeknownst to the Rebels, the Ewoks held a council of war in the village, where Chirpa recalled the tribe members killed and villages burned by the Empire, convincing the village to take up arms against the Empire, as did one of his best hunters, Asha, whereas Romba argued the upcoming struggle included all Ewok tribes. Chirpa soon sent messengers to the other tribes to ask for their help."}, {"tag": "p", "text": "The Ewoks later joined the fight against the Galactic Empire. Shortly after the battle was won, a pair of surviving Imperial TIE Fighters attempted to attack the village, but were intercepted and shot down by the Ghost. That night, the village hosted the festivities celebrating the death of Emperor Sheev Palpatine and the defeat of the Empire."}, {"tag": "p", "text": "Chief Chirpa's daughter, Princess Kneesaa, eventually succeeded the late chief."}, {"tag": "p", "text": "In 35 ABY, following the Battle of Exegol, Wicket and his son Pommet Warrick watched as a Resurgent-class Star Destroyer was destroyed in orbit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}