{"url": "Broadside-class_cruiser_kdb-1", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Broadside-class cruisers", "Category:Cruiser classes", "Category:Galactic Empire starship classes", "Category:Zann Consortium starship classes"], "nodes": [{"tag": "h1", "text": "Broadside-class cruiser kdb-1"}, {"tag": "p", "text": "The Broadside-class cruiser kdb-1, also known as the Broadside-class corvette, was an Imperial capital warship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Broadside-class shared a common keel design with the Gladiator-class Star Destroyer. Designed for long-range engagements, ships of this class had light armor and unimpressive acceleration and maneuverability. They were armed with missile launchers and two turbolasers."}, {"tag": "p", "text": "Early models were armed with expensive diamond boron missiles that could be used to deadly effect against formations of tightly-packed ships. The range of the missiles made them very useful in long-range attacks. These weapons were replaced by more economical concussion missiles in later models, though some of the cruisers still kept their lethal armament. The payload was 1,200 missiles."}, {"tag": "p", "text": "The cruiser, despite its poor maneuverability, was useful at firing long range missiles under enemy radar. This would leave the enemy confused with the sudden concentration of missiles bombarding their ships. Many Broadside-class cruisers, placed strategically where enemy radar would not detect them, could easily bring down a sizable fleet with a heavy flurry of concussion missiles, or at least bring down their shields leaving them vulnerable to attack.[source?]"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Broadside-class was first produced by Kuat Drive Yards in the early days of the Galactic Civil War. It was conceived as a long-range missile ship, and was based on the Gladiator-class. The design was stripped of passenger compartments, the hangar bays were turned into torpedo bays and the vessel lost some of its armor. Due to the lack of self-sufficiency, the Broadside-class was redesignated as a \"cruiser\" instead of a \"Star Destroyer\"."}, {"tag": "p", "text": "Kuat engineers also decided that great maneuverability was not necessary for the class, thus leaving the Broadside slower than the Gladiator.\nThis was the cause of its vulnerability to other capital warships, and as a result ships of this class were in practice almost never deployed without an escort. However, its missiles proved lethal against fighter squadrons and small space stations."}, {"tag": "p", "text": "In addition to its design-problems, a number of Broadsides were stolen or otherwise acquired by the Zann Consortium during the Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This type of ship has many similarities to the Demolisher, a Star Destroyer that appeared in the Star Wars Droids episode \"The Pirates of Tarnoonga\". In The Force Unleashed Campaign Guide, the two designs were given an in-universe connection."}, {"tag": "p", "text": "There is some debate in the online community as to the actual size of the Broadside-class. Concept art made available by the game designers suggested that they envisaged a size of around 50–60 meters in length, comparable to small picket cruisers like the Guardian-class light cruiser, but the StarWars.com Databank established the canonical size of the vessel to be 500 meters long, placing them within the standard cruiser category."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}