{"url": "Broken_Wing", "categories": ["Category:Canon articles", "Category:Bounty hunter starships", "Category:Cruisers", "Category:Freighters"], "nodes": [{"tag": "h1", "text": "Broken Wing"}, {"tag": "p", "text": "The Broken Wing was a starship piloted by the bounty hunter Beilert Valance during the reign of the Galactic Empire. Valance utilized the Broken Wing when he was hired by the Hidden Hand criminal syndicate to lead a team on a hunt for the Imperial enforcer Darth Vader. The vessel was shot down during a skirmish with Vader, but was retrieved and repaired by the Empire, who ordered Valance to work for them. After leading Imperial forces to the base of the Hidden Hand, Valance escaped in the Broken Wing, returning to work as a bounty hunter."}, {"tag": "p", "text": "At the request of his old associate and Rebel Alliance member Han Solo, Valance used the Broken Wing to transport the engineer Vharn, whose intent to betray the Rebellion led Valance into an Imperial blockade. Valance killed Vharn, delivering the schematics the engineer had devised to the rebel rendezvous point. At some point, Valance was joined aboard the Broken Wing by the droid Nine-Four-El, who assisted him in his missions. Valance used the Broken Wing to travel to various destinations while searching for his former mentor Nakano Lash, who became a target of numerous hunters after she emerged from hiding."}, {"tag": "p", "text": "After Valance found Lash, she tasked him with the protection of the young Cadeliah, the daughter of two heirs of rival criminal syndicates. Aboard the Broken Wing, Valance and Cadeliah were pursued by other hunters sent after them by the Unbroken Clan. Valance left his ward in the care of his former lover, travelling alone on the Broken Wing to draw away their pursuers. In a skirmish with pirates of the Ohnaka Gang while attempting to rescue the rebel transport Spirit of Jedha at the Terminus hyperlane intersection, the Broken Wing came under heavy fire, and Valance was forced to eject its central module in order to escape."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A cruiser and freighter that was equipped with a hyperdrive, the Broken Wing had a design centered around a circular body with two rectangular arms extending to the front. The cockpit was situated on the front edge of the circular body, between the two arms. The rear of the starship housed its two engines, while two wings protruded from either side. One laser cannon was mounted on each of its wings, and a pair of laser cannons were located on the front of the ship. The Broken Wing also had separate cannons on each side, which could be controlled manually by a singular gunner. The Broken Wing's central body had a port on either side that could be used to board other vessels."}, {"tag": "p", "text": "Able to be flown by a single pilot, the Broken Wing's cockpit initially only held one seat, though a second was later added. When the Broken Wing landed, four landing gear legs and a boarding ramp could be extended from its base. The vessel was equipped with a device that the slicer Chio Fain assumed was a customized communications jammer made by Grenyt, though it could also be used to amplify communications. The cockpit of the Broken Wing contained a comm unit that provided communication via hologram."}, {"tag": "p", "text": "The starship underwent several modifications over time; a third engine unit was added between the two existing engines, and an orange stripe was painted at the rear of the ship, though was later no longer present. The raised central module of the Broken Wing, including the cockpit and middle engine, could be ejected from the ship like an escape pod, leaving the remainder of the cruiser split in two."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Starship of a hunter"}, {"tag": "p", "text": "Beilert Valance acquired the Broken Wing sometime after being discharged from the Galactic Empire and becoming a bounty hunter. From the Broken Wing, Valance tracked and hunted his quarries."}, {"tag": "p", "text": "Sometime during the Empire's reign, Valance and fellow bounty hunter Cavic escaped Imperial pursuit in the Broken Wing, with Cavic piloting the starship. The two hunters managed to lose their pursuers in the Outer Rim Territories, and Valance believed that they were safe, but Cavic insisted that the Empire would continue to search for them. Wishing to hide somewhere that the Empire could not reach them, Cavic piloted the Broken Wing through a nearby asteroid field, ignoring Valance's concerns regarding the danger of doing so. Cavic landed the ship inside an asteroid outpost which he had set up as a refuge from the Empire some time earlier."}, {"tag": "h3", "text": "Hunt for Darth Vader"}, {"tag": "h4", "text": "Skirmishes with the Empire"}, {"tag": "p", "text": "Sometime prior to the Battle of Hoth in 3 ABY, Valance landed on Coruscant, where he left the Broken Wing in Docking Bay 21 while visiting BG-RT's Tavern and Spirits on Level 1313. After killing a number of bounty hunters that he had allowed to track him to the cantina, Valance returned to the Broken Wing, but was followed by Gwi, the leader of the Hidden Hand crime syndicate, who claimed he was a messenger. Gwi recruited Valance into a team that was dispatched to hunt down Darth Vader, the Sith apprentice of Emperor Palpatine. The crew, which included the bounty hunter Dengar, the slicer Chio Fain, the Gamorrean tracker Honnah, and a sniper by the name of Urrr'k, who was truly the Rebel Alliance agent Gita in disguise as a Tusken Raider, boarded the Broken Wing and began their hunt."}, {"tag": "p", "text": "In space, Valance attacked and destroyed two Imperial TIE fighters, amplifying their communications signal so that Vader would be able to track them to Arvina, where the crew visited an outpost of the Hidden Hand. Vader, arriving aboard a Star Destroyer, pursued the escaping Broken Wing in his TIE Advanced x1, but Valance managed to jump into hyperspace before Vader could catch him."}, {"tag": "h4", "text": "Shot down over Heva"}, {"tag": "p", "text": "Having sliced into the data banks of the outpost, Valance's team traveled to a Hidden Hand outpost on Heva. Informed of the crew's destination by Dengar, who was secretly an Imperial informant on the team, Vader followed the crew aboard the Star Destroyer Formidable. Valance attacked the Star Destroyer in the Broken Wing, accompanied by bot-drones piloted by Fain. The Formidable sent TIEs to attack the Broken Wing, but Valance managed to avoid their fire, destroying several fighters with the help of \"Urrr'k,\" who was acting as the gunner of the ship's manual cannon."}, {"tag": "p", "text": "Vader attacked the Broken Wing, damaging its cannon. On Valance's signal, Fain used the bot-drones to destroy the Formidable's command tower and cause it to crash. Vader continued to shoot the Broken Wing, damaging its engines. The Broken Wing crashed onto Heva, and Vader boarded the cruiser, but was unable to catch Valance, who had escaped the wreckage."}, {"tag": "h4", "text": "Recovered by the Empire"}, {"tag": "p", "text": "Valance was ultimately unsuccessful in killing Vader on Heva—Dengar revealed himself as an Imperial informant, and Valance was captured and imprisoned aboard the Star Destroyer Vengeance. The Empire retrieved the Broken Wing, taking the cruiser aboard the Vengeance and repairing it. After escaping his prison cell disguised as a stormtrooper, Valance encountered the Broken Wing, and was confronted by Vader. Under orders from Vader, Valance flew the Broken Wing to his homeworld of Chorin, where the Hidden Hand had originally began. Vader threatened the safety of Chorin's inhabitants, forcing Valance back into the Empire. After leaving Chorin, Valance visited a rebel outpost on the jungle planet Lowik, landing the Broken Wing in a nearby forest."}, {"tag": "p", "text": "After negotiating a deal with rebel operative Aeliar, Valance flew the Broken Wing to the same asteroid outpost that Cavic had constructed years prior, which had been converted into the main base of the Hidden Hand. Valance landed the starship on the surface of the asteroid, but was caught by members of the crime syndicate and taken to Gwi. However, Valance had led Vader to the outpost, and the Empire attacked the forces of the Hidden Hand. With Vader distracted, Valance returned to the Broken Wing and escaped the asteroid. Valance landed at the rebel outpost on Lowik, where the rebels had saved the inhabitants of Chorin, including his former lover Yuralla Vega, from the Empire, leaving shortly afterward."}, {"tag": "h3", "text": "Transporting a rebel"}, {"tag": "p", "text": "Following the failed hunt for Vader, Valance returned to taking jobs as a bounty hunter. Sometime after the hunt, Valance was contacted by Han Solo, member of the Rebel Alliance who formerly served as an Imperial cadet alongside Valance. Valance landed the Broken Wing in Docking Bay 13 on the moon Nar Shaddaa, meeting with Solo, who requested that Valance discreetly transport the engineer Vharn, designer of schematics for a shield generator, to a rebel rendezvous. While taking Vharn back to his ship, Valance was attacked by Imperial forces, but managed to defeat them, boarding the Broken Wing with the rebel engineer."}, {"tag": "p", "text": "Vharn gave Valance the coordinates of the rebel rendezvous point, but the Broken Wing emerged from hyperspace in front of an Imperial blockade—Vharn intended to betray the Rebellion in an attempt to ransom his family's freedom. A number of TIE fighters attacked the Broken Wing, and Valance, who had been given the true coordinates by Solo, destroyed a number of the fighters, avoiding destruction long enough to make the hyperspace jump to the correct rendezvous point. Valance killed Vharn to prevent the traitor from revealing any information to the Empire, and landed the Broken Wing on the rebel flagship Home One, where he delivered the schematics to the Rebel Alliance."}, {"tag": "h3", "text": "Search for Nakano Lash"}, {"tag": "h4", "text": "A new target"}, {"tag": "p", "text": "Valance eventually acquired a droid companion, Nine-Four-El, who assisted him in taking bounties. Shortly after the Battle of Hoth, Valance visited Black Spire Outpost on the planet Batuu in order to take out a bounty on a Devaronian clan. While on Batuu, Valance learned about the reappearance of his former mentor Nakano Lash, who disappeared after she caused the failure of a mission with Valance and several other hunters when she killed their client, Khamus, the heir to the Mourner's Wail Syndicate. Attempting to track Lash down, Valance took the Broken Wing to the outskirts of Phelar Port on the planet Eriadu. After finding a clue to Lash's location, Valance and Nine-Four-El departed in the Broken Wing, heading for the graveyard planet Galmerah, where the grave of Lash's parents was located."}, {"tag": "p", "text": "On Galmerah, Valance was attacked by the bounty hunter Bossk, sending Nine-Four-El to bring the Broken Wing to assist in their skirmish. However, bounty hunter Ooris Bynar intercepted the droid before he reached the vessel. During Valance and Bossk's fight, the Broken Wing was boarded by T'onga, a bounty hunter who formerly worked with Valance and Lash. After incapacitating Bossk, Valance returned to find Nine-Four-El missing his head and T'onga waiting for him in the Broken Wing's cockpit."}, {"tag": "h4", "text": "Locating Lash"}, {"tag": "p", "text": "Holding Valance at gunpoint, T'onga forced the bounty hunter to work with her in hunting Lash down. The two took the Broken Wing to Lash's last known location, the planet Ruusan, discovering that Lash was aboard a starship within a wreckage field in the system. T'onga piloted the Broken Wing into the wreckage, docking to Lash's 720 light freighter and entering through the airlock. Once aboard, Valance prevented T'onga from killing Lash, who explained her actions in the disastrous mission years before; intervening in Khamus' attempt to kill Krynthia, the heir of the rival Unbroken Clan syndicate, with whom he had a child."}, {"tag": "p", "text": "However, Boba Fett, one of the hunters Lash had betrayed, was still intent on her execution, and Valance attempted to protect his mentor. Lash had Cadeliah, the young daughter of the two syndicate heirs, escape to the Broken Wing as she and Valance fended off Fett. With the Broken Wing still docked to Lash's ship, General Vukorah of the Unbroken Clan, who Lash had attempted to request assistance from, fired upon the light freighter. As the freighter broke apart, Fett escaped in his own vessel, satisfied in the chance of Lash's death. After speaking with Lash, who was injured and trapped on her ship, Valance returned to the Broken Wing, finding Cadeliah in the pilot's seat. After learning that Lash was unable to escape, Cadeliah piloted the Broken Wing away from Lash's ship, which exploded behind them."}, {"tag": "h3", "text": "On the run"}, {"tag": "h4", "text": "Returning to Lowik"}, {"tag": "p", "text": "Having been tasked by Lash with the protection of Cadeliah, Valance stopped at the Spur Orbiting Market space station in order to receive repairs to his cybernetics and provide Cadeliah with food. After defeating an Arcona bounty hunter who sought the bounty that Vukorah had placed on him, Valance had his cybernetics fixed at Slade's Repairs, where he was attacked by the bounty hunters Zuckuss and 4-LOM. Valance incapacitated his two assailants and escaped with Cadeliah to the Broken Wing, departing the space station."}, {"tag": "p", "text": "With Valance severely injured, he and Cadeliah traveled to the secret outpost on Lowik, where Vega resided after she and the other inhabitants of Chorin were rescued by the rebels. Valance requested help from Vega, while Zuckuss and 4-LOM, who had placed a tracker on Valance, followed him to Lowik. After Valance received medical assistance, he attempted to hold back the other bounty hunters as Vega and Cadeliah fled. While Cadeliah was captured, Valance made a deal with Zuckuss and 4-LOM, who allowed him and Cadeliah to remain free for three standard rotations, after which they would resume their hunt. Intending to lure his pursuers away, Valance left Cadeliah in the care of Vega and her husband, Lieutenant Kondra, who was forced to evacuate the rebel forces on Lowik as a result of Valance's actions. Valance departed Lowik aboard the Broken Wing, agonizing over parting with Vega."}, {"tag": "h4", "text": "Termination at Terminus"}, {"tag": "p", "text": "While seeking to remove the bounty on his head, Valance surfaced in various spaceports in order to draw attention from Vega and Cadeliah. Having been informed of a lucrative job by the bail bondsman Syphacc, Valance traveled to Nar Kaaga, leaving the Broken Wing in Docking Bay 27-A while he met Syphacc at the H'unn Cabaret Pit. Syphacc's promised job turned out to be a trap for Valance, who was attacked by the assassin Tasu Leech. Valance incapacitated Leech, stole credits from Syphacc as payback, and returned to the Broken Wing."}, {"tag": "p", "text": "Aboard the Broken Wing, Valance was contacted by Kondra, who requested a favor from the bounty hunter in return for the events on Lowik. Kondra asked that Valance rescue the transport Spirit of Jedha, which had suffered a malfunction after evacuating Lowik and dropped out of hyperspace at Terminus, the intersection between the Corellian Trade Spine and Hydian Way hyperspace routes. After receiving the coordinates of the transport's location, Valance left Nar Kaaga and entered hyperspace. The Broken Wing arrived at Terminus with wreckage from a rebel X-wing starfighter directly ahead, and Valance maneuvered to avoid it, clipping one of the wrecked starfighter's wings."}, {"tag": "p", "text": "Valance approached the drifting Spirit of Jedha and tried to make contact, but a rebel aboard the transport instead warned him to escape—the Spirit of Jedha had been attacked by the Weequay pirates of the Ohnaka Gang, led by Captain Skragg. Weequay attack shuttles pursued the Broken Wing, seeking to shoot down the cruiser. Valance attempted to avoid the lasers, though one of the Broken Wing's engines was hit. The Weequay ships continued to fire upon the Broken Wing, hitting the cruiser with a barrage of shots. With the Broken Wing taking heavy fire, the Spirit of Jedha attempted to contact Valance, receiving no response."}, {"tag": "p", "text": "Having sustained damage to the Broken Wing, Valance contacted the Spirit of Jedha, demanding that the hangar door be opened for him. The rebels were hesitant to do so, unsure if Valance himself was a pirate and noticing that the Broken Wing was too large to enter the hangar door. Valance released the central portion of the Broken Wing from the wings of the cruiser, piloting the small pod into the Spirit of Jedha's hangar and abandoning the damaged body of the vessel. Upon landing, Valance remarked that he wished for Kondra to pay for the Broken Wing to be salvaged and repaired."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Broken Wing was owned and piloted by the bounty hunter Beilert Valance. Early in Valance's bounty hunting career, the Broken Wing was piloted by his associate Cavic, a fellow bounty hunter. During Valance's skirmish against Darth Vader on Heva, the ship's top cannon was manned by Gita, a Rebel Alliance operative who was undercover on the team as a Tusken Raider bounty hunter named \"Urrr'k.\""}, {"tag": "p", "text": "Following the Battle of Hoth, Valance was accompanied by the droid Nine-Four-El, who reported to Valance from the Broken Wing during bounty hunting jobs. The bounty hunter T'onga piloted the Broken Wing while she and Valance worked together to hunt down Nakano Lash. After Valance found Lash, she tasked him with the protection of the young Cadeliah. Possessing the ability to fly starships, Cadeliah piloted the Broken Wing from the Ruusan system and accompanied Valance until he left her with Vega for her own safety."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Broken Wing first appeared in Target Vader 1, a comic written by Robbie Thompson, illustrated by Marc Laming and Cris Bolson, and published by Marvel Comics on July 3, 2019. In the Star Wars Legends continuity, Valance owned a ship known as the Kill Switch, which first appeared in the 1978 comic Star Wars 16, written by Archie Goodwin and penciled by Walt Simonson."}, {"tag": "p", "text": "The Broken Wing shares a strong resemblance to concept art made for the vessel that eventually became the U-wing for the 2016 Anthology film, Rogue One: A Star Wars Story. The concept art, entitled \"Jyn's Ship Version 6\" and created by David Hobbins, featured rear wings that could rotate forward when in combat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}