{"url": "Brolsam", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Agriworlds", "Category:Galactic Empire planets", "Category:Kathol sector planets"], "nodes": [{"tag": "h1", "text": "Brolsam"}, {"tag": "p", "text": "Brolsam was a planet within the system of the same name in the Kathol sector of the Outer Rim Territories. An agriworld, it was located on a branch off the Trition Trade Route, between the sector capital Kal'Shebbol and Torize. Although its distance from the sector's major trade route hampered its economic growth, Brolsam developed an industry based primarily around agriculture due to the presence of a significant community of Fefze swarms. The planet also gained a reputation as an artist's retreat. In 8 ABY, the planet was on the brink of civil war following the disintegration of Imperial authority in the sector after the liberation of Kal'Shebbol by New Republic forces."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Brolsam was located in the Brolsam system, which was part of the Outer Rim Territories' Kathol sector. The world was reached by traveling along a spur off the Trition Trade Route situated between the Kal'Shebbol and Torize systems. Brolsam was connected to the Kal'Shebbol and Aaris systems by hyperlane; the sector capital of Kal'Shebbol was one day and six hours' travel from Brolsam by Class One hyperdrive, while Aaris III was three days and nine hours distant. The planet lacked important resources, and its distance from the Trition Trade Route hampered its development and population growth. The planet developed as an agricultural world, with extensive fields, although there was areas on the surface that contained back alleys. The planet was home to fifteen million inhabitants, divided equally between Humans, Rodians, and Fefze."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Galactic Empire took control of the Kathol sector, Brolsam was brought under Imperial control. Imperial officials were installed to rule over the population, and the new administration was secretly supported by the Nat'xikta—a small but wealthy Fefze tribe that engaged in spy operations for the Empire. When the ruler of the sector, Moff Kentor Sarne, broke from the Empire following the Battle of Endor in 4 ABY, Brolsam became part of his warlord holdings."}, {"tag": "p", "text": "In 8 ABY, following the liberation of Kal'Shebbol by the New Republic, and their subsequent increase in influence in the sector, many Fefze swarms allied themselves with disaffected Humans and Rodians and began rounding up and imprisoning Imperial officials and sympathizers. Their efforts were disorganized, however, and Imperial forces resorted to guerrilla tactics to keep them off-balance. The situation threatened to plunge the entire planet into civil war. The Nat'xikta tribe—fearful of losing their status and power on the planet—began plotting to liberate the imprisoned Imperials. They hired Rodian mercenaries, and were prepared to sacrifice hundreds of their own swarm to ensure success."}, {"tag": "p", "text": "The New Republic CR90 corvette FarStar visited the planet sometime during its mission to locate Moff Sarne, who had fled Kal'Shebbol when it was assaulted by the New Republic. A mission group was deployed to the planet, and was subsequently attacked by Rodian mercenaries. During a brief battle, one of the members of the mission group was captured. First Officer Gorak Khzam and procurement specialist Loh'khar the Finder used their knowledge of the planet, along with their own skills and contacts, to locate and rescue their missing crewmate. They also discovered the Nat'xikta swarm's plans concerning the imprisoned Imperials."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Although Brolsam's population included sizable Human and Rodian communities, it was the Fefze swarms that shaped much of the planet's culture. The swarms were vital to the development of the planet's agricultural industry, and their presence fostered a genteel artiste community centered around their love of art festivals, sculptures and song."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Brolsam was featured in The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games. Although not featured directly in any adventure, the planet was included so that Gamemasters could use the location in an original adventure. A specific \"adventure hook\" was detailed in the scenario Omens. This article assumes that the FarStar did indeed travel to the planet as detailed in the published adventure hook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}