{"url": "Bron_Dooku", "categories": ["Category:Legends articles", "Category:House of Dooku", "Category:Humans", "Category:Males", "Category:Serennian"], "nodes": [{"tag": "h1", "text": "Bron Dooku"}, {"tag": "p", "text": "Bron Dooku (formally styled as His Grace, Bron Dooku, Count of Serenno) was a Human male member of House Dooku and the son of Adan and Maite Dooku, and the grand-nephew of the infamous Count Dooku."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3 BBY, Bron was present on Alderaan for the twenty-fifth anniversary of the Alderaan Ascendancy Contention. During the reception he met Leia Organa and complimented her on her beauty."}, {"tag": "p", "text": "Later that evening, he was in his bedroom in the suite he shared with his father when he was awoken by the argument between his father and Bail Prestor Organa. When he came out of his room to see what the commotion was, he witnessed his father being shot and killed by an Imperial assassin, Jahan Cross. Organa quickly grabbed Bron and got him undercover for safety as security forces gave chase, intent on finding Bron's father's killer."}, {"tag": "p", "text": "Following the death of his father, Bron went with the other House Lords aboard the Windrunner to decide his fate. He then met Jahan Cross who he knew as Ambassador Cross's son. Bron was then kidnapped by Aveca Dunn during the Bloodskull's attack, and was then rescued by Cross. Bron was taken to Otoh Dooku, where Borgin's security chief Hovus Jorrick and his guard watched over him until Cross and Candra Tymon took him. He was pursued by Jorrick's guard and Boba Fett, until Fett fired a missile at his shuttle, appearing to kill Bron."}, {"tag": "p", "text": "In reality though, Bron had been taken to Alderaan to be raised by Bail Organa until he took his title and position as Serenno's regent if he wanted to."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While Bron Dooku's eye color was shown to be blue throughout Star Wars: Agent of the Empire—Hard Targets, the cover of the series' fifth issue had them brown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}