{"url": "Brookish_Boon", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Sy Myrthians"], "nodes": [{"tag": "h1", "text": "Brookish Boon"}, {"tag": "p", "text": "Brookish Boon was a Sy Myrthian female from Sy Myrth who spent time outside the Galaxies Opera House on the planet Coruscant in 19 BBY. Many years later, her stolen identity profile was used by the pirate Hondo Ohnaka as part of a test for potential new employees of Ohnaka Transport Solutions."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Brookish Boon was a Sy Myrthian female who was born on Sy Myrth around 57 BBY. In the year 19 BBY, Boon was on the planet Coruscant and stood with a hooded individual at the foot of the steps leading into the Galaxies Opera House while it was showing a performance of the ballet Squid Lake. As the pair stood together, the Jedi Knight Anakin Skywalker rushed past while en route to meet with Supreme Chancellor Palpatine inside the building."}, {"tag": "p", "text": "In 34 ABY, when Boon was 91 years old, her stolen identity profile came into the possession of the pirate Hondo Ohnaka, owner of Ohnaka Transport Solutions. Ohnaka used the profile to test several individuals who were looking to join a flight crew that the pirate was putting together for an upcoming heist. He sent Boon's profile, along with several others, to the prospective crew members' datapads, then quizzed them on details from the files."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Brookish Boon had brown hair, red eyes, and pink skin. She stood 6 feet, 9 inches tall and weighed 316 pounds."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Boon wore a soft, purple Sy Myrthian fur coat over a brown dress and white-and-brown sleeves while at the opera house."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Brookish Boon first appeared in the 2005 prequel trilogy film, Star Wars: Episode III Revenge of the Sith, and was first named in the new Star Wars canon in the 2018 reference book Star Wars: The Complete Visual Dictionary, New Edition, which was written by Pablo Hidalgo. The opera house scenes were filmed on R Stage at Shepperton Studios as part of additional photography on Monday, August 23, 2004. Boon was also filmed as part of the opera house corridor shot, where the character was stood talking to a Swokes Swokes; however, the pair were removed during the editing of the entirely blue-screen shot, as they were replaced with one of the corridor's walls."}, {"tag": "p", "text": "The character of Brookish Boon originates in the Star Wars Legends continuity from the in-universe news article \"Ando, Sy Myrth Secede\" in HoloNet News Vol. 531 #45, which was also written by Hidalgo and released on the HoloNet News website in 2002. Boon was described by the article as being male but in 2005 was identified as the Sy Myrthian seen in Revenge of the Sith and described as female by the reference book Star Wars: Revenge of the Sith: The Visual Dictionary, which was written by James Luceno. The book also misspelled the character's name as \"Brookish Boone.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}