{"url": "Brosi", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Brosi locations", "Category:Corporate Sector Authority planets", "Category:Corporate Sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Brosi"}, {"tag": "p", "text": "Brosi was the homeworld of the Brosin species, in the Thandon Cluster, a remote place in the Corporate Sector. It was the fourth planet in the Dostra system, and one of the few homeworlds within the Corporate Sector."}, {"tag": "p", "text": "A lush, temperate forest planet with a large amount of natural flora and fauna, Brosi featured a string of waterfalls more than two kilometers high as a natural wonder. It also had big natural reserves of Zinsian, a dry preservative, and Hfredium."}, {"tag": "p", "text": "While having a native Near-Human sentient species, the Brosins, Brosi was nevertheless settled by Old Republic colonists centuries before the Galactic Empire. Those colonists brought with them Staplarints to be used as mounts. However, the introduction of repulsorlift technology aided in the obsolescence of animal mounts, and Staplarints were eventually abandoned. They since became wild and untamed, roaming throughout the countryside."}, {"tag": "p", "text": "The discovery of the Zinsian reserves led the Corporate Sector Authority to build three Zinsian processing plants (Delta 1, Delta 2, and Mailor). To do so, they displaced thousands of native Brosins, and many young male Brosins were \"hired\" by supervisors to work in dangerous extractions. This gave rise to the Brosins dislike of the Corporate Authority government."}, {"tag": "p", "text": "Soon after the first plant began working, the Brosin Underground was created: A terrorist organization which fought the Corporate Authority power on Brosi. The Underground was led by charismatic young female Brosin, Randle Clanse, who was known to share the profits and equipment stolen from the CSA."}, {"tag": "p", "text": "The Security Police that CSA commonly used proved ineffective against the Brosin Underground because of their ignorance of the natural landscape. Commanding CSA officer, Supervisor Wasith, tried hiring bounty hunters to remove the Brosin Underground from the Blan Forests, but they were again unsuccessful: At least one bounty hunter resigned claiming \"inadequate support from CSA officers\"."}, {"tag": "p", "text": "Although the Underground interests were apparently similar to those of the Rebel Alliance, their methods were so different that each group considered the other a threat."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}