{"url": "Brosin_Underground", "categories": ["Category:Legends articles", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Brosin Underground"}, {"tag": "p", "text": "The Brosin Underground was a Brosin resistance group created to disrupt Corporate Sector Authority industrial activities on Brosi, with the aim of making CSA leave their native planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The native Brosi and the Human settlers who arrived during the Old Republic lived amicably for centuries, sharing the planet and its resources. Eventually, the discovery of Zinsian veins during the Galactic Empire's reign attracted the Corporate Sector Authority, which built three Zinsian processing plants—Delta 1, Delta 2 and Mailor—and thereby displaced thousands of native Brosians. They also employed young Brosian males for dangerous mining work."}, {"tag": "p", "text": "In response, the Brosin Underground was established to harass the facilities and their Espo troops. Popular support was built through sharing the resultant plunder with the Brosin people. The leader and founder of this resistance was the female Brosin Randle Clanse, who gained consequently gained a heroic reputation. Her organization was divided into four units. The smallest and most infamous consisted of thirty warriors led by Clanse herself, and traveled through the Shoengen Coast. The other three units were vagrant, with the largest, led by Vuraj Marn, operating through Reyno Valley and Nihun Valley. For transport, the organization tamed wild Staplarints for mounts."}, {"tag": "p", "text": "Although the Brosin Underground's conflict with the Corporate Sector seemed to make collusion with the Rebel Alliance inevitable, the relationship between the two was actually strained. The Underground was eager to harry the Corporate Sector regardless of larger strategic consequences. An increased Corporate Sector presence would endangering Rebel agents such as Abil Vilorin ten-member cell. Filorin himself sought to contact Marn to discuss the situation, but Marn proved reticent. Filorin's reports suggested that the Underground was unwilling to change its tactics for fear that a strong Rebel presence would also attract the Empire to Brosi."}, {"tag": "p", "text": "General Carlist Rieekan, having examined the conflict of interests, commended the Underground's goals, but reiterated the need for formal contact."}, {"tag": "h2", "text": "Sources"}]}