{"url": "Brother/Sister", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Inquisitors", "Category:Titles"], "nodes": [{"tag": "h1", "text": "Brother/Sister"}, {"tag": "p", "text": "Brother and Sister were titles given to members of the Inquisitorius, the group of dark side warriors used by the Galactic Empire to hunt down Jedi who survived the fall of the Jedi Order. The title did not refer to blood relation, but instead fostered a sense of unity amongst the Inquisitors. Nonetheless, there was competition amongst the ranks of the Brothers and Sisters, particularly after the death of their leader, the Grand Inquisitor, as the Brothers and Sisters sought to gain favor with the Sith Lord Darth Vader and succeed their fallen leader. During the early rebellion against the Empire, at least two Inquisitors, the Fifth Brother and the Seventh Sister, were active in hunting rebels, seeking out Jedi survivors, and capturing Force-sensitive children in order to either destroy the younglings or convert them to the dark side, while the Eighth Brother was tasked with hunting Darth Maul."}, {"tag": "h2", "text": "Role and powers"}, {"tag": "p", "text": "The individuals who carried the titles of Brother and Sister were part of the Inquisitorius, a group of Force-wielding warriors, trained in the ways of the dark side, who were used by the Galactic Empire to hunt down and eliminate any Jedi who survived the fall of the Jedi Order. There were several individuals who carried this title, though the organization itself was relatively small. Although they were not related by blood, the use of the titles of Brother and Sister gave the group a sense of cohesion. The death of the Grand Inquisitor at the hands of the rebel Jedi Kanan Jarrus created a power vacuum within the ranks of the Inquisitors, so the Brothers and Sisters of the Inquisitorius competed against one another in the hopes of currying favor with the Sith Lord Darth Vader so they could become the next Grand Inquisitor. The Brothers and Sisters were also responsible for carrying on the order's goal to find and either destroy or convert Force-sensitive children, so they could not become a threat to the Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The titles of Brother and Sister were used within the Inquisitorius, the dark side group utilized by the Galactic Empire in order to hunt down Jedi survivors during the dark times of Imperial rule over the galaxy. During the early rebellion against the Empire, Darth Vader and the Empire sent the Grand Inquisitor to eliminate the threat posed by the Jedi-led rebellion in the Lothal system. After the Grand Inquisitor's death, Vader was ordered by the Emperor, Darth Sidious, to dispatch another Inquisitor to hunt the rebels down. Vader dispatched the Fifth Brother to deal with the rebels. He also sent the Seventh Sister to aide in the destruction of the growing rebellion, and she had a second mission to find Vader's former Jedi apprentice, Ahsoka Tano."}, {"tag": "p", "text": "Their mission from Vader brought the Seventh Sister and the Fifth Brother into conflict not only with the rebels, but also with themselves as they competed to gain favor with the Sith Lord. One such conflict was during a confrontation with the rebel Padawan Ezra Bridger and his rebel companions, Sabine Wren and Garazeb Orrelios. The Fifth Brother intended to kill Bridger, but this was contrary to the Seventh Sister's plan to use Bridger to lure the other rebels, including Tano, to their destruction. Not long after, a joint mission also led the Seventh Sister and the Fifth Brother to hunt two Force-sensitive infants, Pypey and Alora. This mission further brought out the competition between the two Inquisitors. The Fifth Brother attempted to take charge of the pursuit, but his instincts and orders were questioned by the Seventh Sister. Ultimately, the two younglings were rescued by the rebels Kanan Jarrus, Ezra Bridger, and Garazeb Orrelios."}, {"tag": "p", "text": "During the course of their interactions, the Fifth Brother and the Seventh Sister were looked upon with some trepidation by the Imperial rank-and-file such as Admiral Kassius Konstantine, who doubted their ability to produce the results that the Empire expected of them. Nonetheless, they continued to work together in the pursuit of the rebellion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "After the introduction of the Grand Inquisitor in the first season of the animated television series Star Wars Rebels, the show's second season further expanded upon the Inquisitorius. The Fifth Brother was first introduced in the episode \"Relics of the Old Republic,\" while the Seventh Sister followed in the episode \"Always Two There Are.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}