{"url": "Brotherhood_of_the_Sith", "categories": ["Category:Legends articles", "Category:Sith organizations"], "nodes": [{"tag": "h1", "text": "Brotherhood of the Sith"}, {"tag": "p", "text": "The Brotherhood of the Sith or Sith Brotherhood was a group of Jedi Knights led by Exar Kun who broke away from the Jedi Order to study Sith techniques. During the Great Sith War, they received the allegiance of the Krath and the Mandalorian Crusaders led by Mandalore the Indomitable."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "In an impassioned speech on Ossus, Exar Kun sowed the first seeds of doubt in his fellow Jedi Knights. After the terrible and pointless death of Arca Jeth on Deneba, many Knights had become disillusioned with the Order, losing their idealistic ideas of the immortality of the Jedi. Fearing for the safety of the future, several Jedi Knights were swayed by Exar Kun's promise of further \"lost\" Jedi powers."}, {"tag": "p", "text": "Unfortunately for the young Knights, Exar Kun was not concerned for the future of the Order and had come to Ossus in hopes of creating a powerful rank of commanders for his impending war with the Republic. Kun's trip to Ossus had two objectives. Besides recruitment, Kun was eager to lay his hands on the famed Sith holocron of Odan-Urr. Breaking his way into Odan-Urr's chamber, Kun slew the aged Jedi Master and claimed the ancient holocron for himself."}, {"tag": "p", "text": "Caught in the act of removing the artifact, Kun lied to his new followers, claiming that Odan-Urr had declared him a Jedi Master and bequeathed the artifact to him as a symbol of the induction as he died of old age. With the increasing awe of his fellow Knights, Kun loaded his ship, the Starstorm One with his twenty knights and left for Yavin 4, a place of dark side power."}, {"tag": "h3", "text": "Yavin 4"}, {"tag": "p", "text": "Before Kun's speech on Ossus, Exar had already visited Yavin 4 and enslaved the Massassi that lived there. Investigating the ruins on the planet and excavating the area revealed the last resting place of the Sith Lord Naga Sadow. Using the labor of the Massassi, Kun created a myriad of temples on the planet to amplify his own force power. It was to this environment that Kun and his followers arrived."}, {"tag": "p", "text": "Arriving on Yavin 4, the twenty knights fanned out, becoming increasingly disturbed by the dark presence that they felt on the planet. Leading the company to the main Sith Temple, Exar proclaimed a new time for the Jedi Knights, one in which the old Masters would pass away to make way for the new."}, {"tag": "p", "text": "One Jedi Knight in particular was thoroughly disgusted with Kun's blindness to the apparent dark feeling that he gleaned off the planet's surface. Oss Wilum distanced himself from the other admiring followers and made to leave the planet, but was abruptly stopped by Massassi. The other Knights rushed to his aid and it seemed that the Brotherhood would be disbanded before it even began to take form. With some quick thinking, Kun salvaged the situation. Deceiving his followers once again, Kun stopped the attack declaring that he knew of the dark power emanating from the planet and needed the other Knights help in cleansing the world of the dark side."}, {"tag": "p", "text": "Knowing that Oss Wilum's outburst was not likely to be an isolated event, Exar quickly accelerated the indoctrination. Using the Sith holocron that he had taken from Odan-Urr, Exar Kun smashed the artifact declaring that he was doing so to rid it of dark influence. In reality, the action released the dormant teachings of the Sith Lords within. The crystals from the smashed device embedded themselves in Kun's followers. Acting as a type of Sith poison, the Knights' emotions became completely muddled and their reservations about Kun and the dark planet melted away. The Brotherhood was born."}, {"tag": "h3", "text": "The Jedi pogrom"}, {"tag": "p", "text": "After continued training on Yavin IV, Exar's Sith converts had completely embraced their Sith training. Exar had no doubt as to their abilities and was ready to make his move. To the approval of his Sith brethren, Exar declared the Jedi Masters heretics that refused to see the truth of the new way. Before the Sith Golden Age could come, the old had to be removed. Exar sent his Sith disciples on their first mission, to exterminate their own Jedi Masters."}, {"tag": "p", "text": "The pogrom was a huge victory for the Brotherhood. Almost every one of Kun's disciples was successful in their mission, catching their master's by surprise with the new Sith techniques taught to them by Exar. However, several masters were adept enough to recognize the corruption within their students and were ready. Master Thon fended off both Oss Wilum and Crado when they used the Force to call vicious Hssiss dragons upon the Tchuukthai Master. Crado was able to escape, but Oss was captured. Zona Luka was able to kill Master Dominus but was also killed in the attempt. Nayama was unable to kill her master Jolee Bindo in a confrontation, and fled in disgrace."}, {"tag": "h3", "text": "The End of the War"}, {"tag": "p", "text": "With the leadership of the Jedi in disarray, Exar made his next move against the Republic. Determined to utterly shatter the Jedi Order, Exar planned to destroy the Jedi Library on Ossus. Uniting with his apprentice Ulic Qel-Droma, Exar learned of the treachery of Ulic's illicit lover Aleema Keto. Exar devised a plan to rid themselves of the nuisance and to ensure the end of the Jedi. Using the treacherous Aleema and the cowardly Crado to set off a supernova in the Cron Drift, Exar ensured the doom of Ossus. Both Aleema and Crado were killed by the supernova for their failings."}, {"tag": "p", "text": "As the Jedi tried to evacuate Ossus, Exar, Ulic, and the rest of the Brotherhood landed on Ossus to steal as many of the Jedi artifacts as they could. The raid was highly successful, but met a huge setback when Ulic was shot down by his brother Cay and captured. With Ulic's capture, Exar retreated to Yavin IV with the Jedi hot on his heels. With a wall of light directed at the planet, the entire planet was enveloped in fire. Exar was presumed killed by the fires and the war was considered over."}, {"tag": "p", "text": "However, several members of the Brotherhood had survived the war and had holed themselves up in the last Sith stronghold, the planet Empress Teta. In a short but violent campaign, the Republic poured all their resources into ending the Sith occupation of the planet. The Sith were able to hold out longer than anyone expected due to the Sith abilities of the remaining members of the Brotherhood."}, {"tag": "p", "text": "Eventually, the Republic broke through the Sith lines, slaughtering the opposition. Several Sith were able to escape, but at least one Sith, Nayama, was killed in the battle."}, {"tag": "h3", "text": "A Lasting Legacy"}, {"tag": "p", "text": "Although the remaining members of the Brotherhood were forced into hiding, at least one Sith lived to carry on the mantle of Dark Lord of the Sith. Another Sith fled to Korriban and set up the Sith Academy there. The academy would be an integral part of the Jedi Civil War when the new Dark Lords of the Sith, Darths Revan and Malak needed a ready supply of Sith disciples."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are several other Jedi pictured in training at Yavin IV, but they are unnamed at this time. The video game Knights of the Old Republic introduced the Rodian, Suvam Tan who claims to have been a Sith slave on Yavin IV. However, throughout the comic, no slaves other than Massassi are seen on the planet. It is also known that Suvam constructed a lightsaber and was the owner of a Sith holocron and Exar Kun's armor at the time of his death. Because of these possessions, it can be inferred that Suvam was probably a part of the Brotherhood. However, once again, there is no hard evidence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}