{"url": "Brothers_of_the_Sith", "categories": ["Category:Legends articles", "Category:Titles"], "nodes": [{"tag": "h1", "text": "Brothers of the Sith"}, {"tag": "p", "text": "Brothers of the Sith was the title used by the so-called \"twins\" Picaroon C. Boodle and Gorc, while serving as two of Jerec's Seven Dark Jedi. They were sometimes also called the Twins."}, {"tag": "p", "text": "Pic and Gorc were not twins, and neither were they Sith. They were, in fact, the result of an experiment in Sith alchemy carried out by Cronal under orders from Emperor Palpatine. Cronal mutated a Kowakian monkey-lizard and a Gamorrean into Sithspawn. As a result of the mutation, the two shared a Force life-bond that resulted in the ability of each to feel the others' location, emotional state, and senses, including even pain."}, {"tag": "p", "text": "The pair went on to serve Inquisitor Jerec as two of his Seven Dark Jedi. When Jerec and his Dark Jedi faced Kyle Katarn, Gorc was killed and the bond that Pic shared with his \"brother\" caused the living twin to feel as if half of him had died. Pic accordingly fell into a mad frenzy until he joined his other half in death."}, {"tag": "h2", "text": "Powers and Abilities"}, {"tag": "p", "text": "Individually, Pic's speed and cunning alongside Gorc's raw power went hand-in-hand during battles. Pic often rendered himself invisible while Gorc often choked his opponents telekinetically, immobilizing them. As Rahn described, \"Pic is the energy and Gorc the counter\". The two always worked and battled as a team, covering all angles and weaknesses making their combination a deadly one."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Jedi Knight: Dark Forces II, the level in which the player must face Gorc and Pic (Level number 11) is titled \"Brothers of the Sith,\" and Qu Rahn describes the two as twins. Details of their relationship are expanded on by Wizards of the Coast."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}