{"url": "Brullian_Dyll", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Musicians"], "nodes": [{"tag": "h1", "text": "Brullian Dyll"}, {"tag": "p", "text": "Brullian Dyll was a male musician who was deemed to be a threat to the stability of the Galactic Empire, which ruled much of the galaxy during his life. Despite the renown of his work, Dyll was executed by Imperial authorities, and his music was suppressed. Only many years later, following the rise of the New Republic, would a chance come for Dyll's works to be heard once again."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A musician, Brullian Dyll was a male who lived during the time of the Galactic Empire, an authoritarian government that rose to power in 19 BBY. Dyll's work, which was performed in concerts, came to be highly regarded, and he was perceived as a legendary musician. The Empire, however, was a censorial regime and began systematically hunting down, imprisoning, and executing many musicians and confiscating their music. Dyll became a victim of one of these purges by 0 BBY, as his artistic endeavors were deemed \"questionable\" by the Imperial authorities. Following the musician's death, records of his music were also purged."}, {"tag": "p", "text": "Despite the Empire's success in suppressing Dyll's music, recordings of the musician's work eventually came into the possession of Kardue'sai'Malloc, a fugitive Devaronian war criminal with a predilection for music. Once Malloc was finally caught by the bounty hunter Boba Fett in 19 ABY, during the reign of the New Republic, the Devaronian made his captor promise to sell the music to a contact so that it could be distributed throughout the galaxy once again."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dyll was a skilled and celebrated musician whose work was deemed to be a threat to the authoritarian regime of the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Brullian Dyll was first mentioned in Empire Blues: The Devaronian's Tale, a short story written by Daniel Keys Moran for the 1995 anthology book Tales from the Mos Eisley Cantina. Moran later made use of Dyll again, mentioning him in The Last One Standing: The Tale of Boba Fett, published in the 1996 anthology book Tales of the Bounty Hunters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}