{"url": "A%27Koba", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Males", "Category:Tusken Raiders"], "nodes": [{"tag": "h1", "text": "A'Koba"}, {"tag": "p", "text": "A'Koba, also known as URoRRuR'R'R, was a skilled but young Tusken Raider who lived on Tatooine during the Galactic Civil War. Shortly before the Battle of Yavin, A'Koba attacked Luke Skywalker before getting scared off by Obi-Wan Kenobi."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A'Koba lived on the Outer Rim world of Tatooine during the Galactic Civil War as part of Chieftain A'Yark's tribe. Shortly before the Battle of Yavin, A'Koba, joined by his cousins, A'Vor and A'Vor's twin, killed a juvenile krayt dragon as a rite of passage into adulthood. He then claimed to A'Yark that he would be able to kill the adult krayts as well."}, {"tag": "p", "text": "After being told of a mysterious shaman by A'Yark, A'Koba, having wanted to lead a hunt, attacked Luke Skywalker, a local moisture farmer who, along with protocol droid C-3PO, was searching for his missing astromech droid R2-D2. A'Koba knocked Skywalker unconscious, and the Tusken and his cousins began searching Skywalker's landspeeder. They were scared off by Jedi Master Obi-Wan Kenobi, who mimicked the call of a krayt dragon to spook A'Koba and his fellow Tusken Raiders into fleeing. Upon seeing Kenobi, A'Koba realized he was the shaman A'Yark had warned them about."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A'Koba was played by stunt coordinator Peter Diamond, who was the only stunt person on location in Tunisia, in the 1977 film Star Wars: Episode IV A New Hope. Diamond actually only held aloft his gaderffii stick once. Editors Paul Hirsch and Richard Chew repeated and rewound such shot several times to make it seem Diamond had rocked it back and forth in triumph. A'Koba's famous bellow was added by sound designer Ben Burtt, fashioned from donkey brays. In Star Wars Legends, the character was identified as URoRRuR'R'R."}, {"tag": "p", "text": "A'Koba's role in A New Hope closely resembles the one a member of the Knights of Sith had in the rough draft of Episode IV. The Knight ambushed Kane Starkiller along with his sons Annikin and Deak at the Fourth Moon of Utapau, killing the latter before getting killed by the former."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}