{"url": "Buboicullaar/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Assassins", "Category:B'omarr Monks", "Category:Cyborgs", "Category:Desilijic servants", "Category:Frog-dogs", "Category:Males", "Category:Spies", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Buboicullaar"}, {"tag": "p", "text": "Buboicullaar, commonly known by Bubo, was a frog-dog in Jabba Desilijic Tiure's court who served as Jabba's bodyguard. Before becoming a member of Jabba's court, Bubo had been a spy and assassin for many years. Around 5 BBY, Bubo had arrived on the Outer Rim planet of Tatooine and joined the Hutt's court. Thought to be a simple-minded creature, Bubo was used by a Gran assassin named Ree-Yees, who had been assigned to murder Jabba. Imperial engineers had a small panel placed under Bubo's skin, which allowed Ree-Yees to track the shipments of the components for the bomb he planned to use to kill Jabba."}, {"tag": "p", "text": "During his stay on the desert world, Bubo became friendly with the B'omarr monks, the ancient religious order who lived deep within Jabba's Citadel, becoming a close companion of the unorthodox monk Evilo Nailati."}, {"tag": "p", "text": "Bubo ultimately foiled Ree-Yees' plot to kill Jabba; he hated the Gran with a passion because of his cruel treatment. However, Jabba was eventually killed by the heroes of the Rebel Alliance, and his Palace was once again left in the hands of the B'omarr, who had built it originally. Bubo willingly allowed the monks to extract his brain from his body and place it in a spider droid, where he could ponder the infinite for all eternity."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Buboicullar was brought to Jabba's Palace by unknown circumstances several years preceding the Hutt's death.\nMost of Jabba's court believed Bubo was a stupid and unintelligent beast, but in reality Bubo's species, which was known by much of the galaxy as \"frog-dogs\", were misunderstood beings capable of considerable intellect and cunning. Bubo used people's misconceptions of his intelligence to his advantage, doing nothing to change their perception, so he could skulk around the palace without drawing attention to himself. Although he kept watch for unwary intruders, he was not as tough as he looked and sounded. When C-3PO and R2-D2 entered Jabba's throne room, to present Luke Skywalker's hologram plea for the release of Han Solo, Bubo acted as sentry and barked viciously at C-3PO, startling him."}, {"tag": "p", "text": "When Bubo arrived on Tatooine, a planet which he hated, he was thrilled to learn of the presence of the B'omarr Monks, an ancient order of priests who had built Jabba's Palace. He quickly sought them out, and became friendly with one of the enlightened monks, Evilo Nailati, who became his teacher."}, {"tag": "p", "text": "Bubo was tended by his alcoholic partner, Ree-Yees, who was known to be a frequent visitor of Jabba's court—because of this, Bubo had been hired to kill Jabba along with the Grannish operative. Ree-Yees had gotten Imperial surgeons to place a small computer panel under Bubo's flesh, which could be activated by pulling off one of the frog-dogs sores. Ree-Yees used the panel to order components for a bomb, which were to be placed on Jabba's sail barge. When the final order arrived hidden in a crate of Goatgrass, Bubo got to it before Ree-Yees, and took the detonator out. When Ree-Yees arrived, searching for his detonator, Bubo hid in a press, just out of Ree-Yees's reach. With Ree-Yees desperately trying to reach Bubo, which was made much more difficult by the mass amount of alcohol he had consumed, Bubo teased him, placing the detonator on the tip of his tongue, before letting it slide into his mouth. Thus, Bubo had foiled Ree-Yees' assassination attempt on Jabba, by eating a crucial component to his thermal detonator."}, {"tag": "p", "text": "After Jabba's death at the Great Pit of Carkoon, Bubo willingly allowed the B'omarr Monks to place his brain in a jar so he too could ponder the infinite. He became friends with fellow newcomers to the B'omarr, Tessek and Bib Fortuna."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bubo had been an assassin and spy for a long time, and knew how to mask his presence from others. He was an unemotional killer, who only killed people for the money."}, {"tag": "p", "text": "Buboicullaar was extremely intelligent, although most of Jabba's denizens did not know this. Although Bubo did nothing to correct people's thinking, he hated those who used him for their own gain, such as Ree-Yees, whose death was celebrated by the tiny frog-dog."}, {"tag": "p", "text": "The frog-dog loved to eat, and fantasized about eating whole Jawas or feasting upon Salacious B. Crumb. Bubo had also tasted Ree-Yees."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Buboicullaar is referred to as \"the bubo\" in Goatgrass: The Tale of Ree-Yees. This implies that Bubo may be a nickname in general for all frog-dogs. Alternatively, it could be a mistake or a humorous contextualization . Buboiculaar was included in a Power of the Jedi figure pack labeled 'Jabba's Palace Court Denizens', along with A B'omarr Monk and the Wol Cabasshite Ghoel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}