{"url": "Bucket%27s_Quest", "categories": ["Category:Real-world articles", "Category:Star Wars Resistance shorts"], "nodes": [{"tag": "h1", "text": "Bucket's Quest"}, {"tag": "p", "text": "\"Bucket's Quest\" is an animated short that is part of the first season of Star Wars Resistance. It was released on the Disney Channel's YouTube channel on December 23, 2018, and is the seventh of twelve shorts."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "When Bucket loses his helmet, he'll do anything to get it back!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Bucket comes out of his storage closet one morning to discover he's missing his helmet. In a panic, he asks Kazuda Xiono, working on some parts, where it is, and Kaz responds that he doesn't know. After Bucket says that he feels naked without his helmet, Kaz suggests Bucket retrace his steps through the Colossus to look for it. In the market, Bucket is laughed at by a group of other droids because his helmet is missing. At the Office of Acquisitions, Flix and Orka tell Bucket there's something different about him, and when they realize his helmet is missing, offer to sell him a new and better one. When Bucket returns to the repair shop sporting a new hat with a mechanical propeller on top, he finds Tam Ryvora and BB-8, the latter sporting Bucket's missing helmet. Bucket is angry, and Tam explains that BB-8 just wanted to try it on, and she tells BB-8 that he looks good in the helmet. This causes Bucket to roll after BB-8, crashing into him offscreen. Kaz, working on the Fireball and not noticing the commotion, catches Bucket's helmet when it's flung through the air towards him, and tells Bucket he's found his helmet. Bucket rolls over and takes it back before hitting Kaz in the leg and leaving, much to his confusion."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}