{"url": "Buick", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Airspeeders", "Category:Alliance to Restore the Republic starships", "Category:Alliance to Restore the Republic vehicles", "Category:Easter Egg articles", "Category:Landspeeders", "Category:Naboo vehicles", "Category:New Republic starships", "Category:New Republic vehicles", "Category:Starfighters"], "nodes": [{"tag": "h1", "text": "Buick"}, {"tag": "p", "text": "The Buick was a unique vehicle called a car or, more specifically, a convertible, that was capable of ground, atmospheric, and space combat. It was a unique design in the galaxy, coming from outside known space. It included a very durable hull and an unseen engine system powerful enough to propel it through space at a high rate of speed. The Buick also contained hidden weaponry consisting of laser cannons and cluster missile launchers that were effective against a number of different enemies, including starfighters, tanks, infantry, space- and land-based structures, and even capital ships."}, {"tag": "p", "text": "The Buick's interior included a detailed damage indicator and map, as well as a steering wheel and several other dials and readouts. The convertible could perform in planetside combat as a landspeeder. Later, around 0 ABY, the vessel functioned at higher altitudes as an airspeeder. Around the same time period it took on space combat as well. The inclusion of a hyperdrive further added to the Buick's strengths and allowed the ship to operate on its own against enemy targets."}, {"tag": "p", "text": "At some point, the car was owned by an individual named Rudy; during this time it was simply known as Rudy's Car. By 32 BBY, the Buick was in the possession of the Royal Naboo Security Forces, who utilized it in the events following the Invasion of Naboo and the eventual recapture of Naboo. The ship was old enough to be considered a relic by 0 ABY, when the Alliance to Restore the Republic started using the craft in their war against the Galactic Empire, and continued to use it when the New Republic was formed, into as late as 10 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Buick was a jet black convertible, with chrome accent markings and trim. Described in 0 ABY as a classic vessel by Alliance General Carlist Rieekan, the car's hull was also noted as being heavily armored, protecting the pilot and any passengers. Above the pilot's head, an awning-like rooftop rested and could retract into the rear of the vessel when the Buick reached a cruising speed, and would cover the pilot again when the craft was accelerating. Two plate-like objects rested on both the front and rear of the Buick. On these white plates, letters from the High Galactic alphabet spelled out \"California\" and \"KOELSH.\" These were later removed. Lighting devices sat on the front and rear of the vehicle."}, {"tag": "p", "text": "Inside the vehicle, multiple seats allowed seating for many passengers, including a spot next to the pilot. There was also a location somewhere in the vehicle for an astromech droid to reside. This droid would handle any repairs the Buick would need during any enemy entanglements. When used as a landspeeder, as the Royal Naboo Security Forces did in 32 BBY, the cockpit was very plain and consisted of a roofless area with a row of lights, dials, and switches located in front of the pilot. The car was controlled by a dashboard-mounted steering wheel and a set of pedals beneath the pilot's feet. By 0 BBY, the car was being used in the higher atmospheres of planets as an airspeeder by the Rebel Alliance, during which time the pilot was surrounded by multiple displays of different uses. Around the same time the Buick was also capable of taking on spaceflight. By this time, instrument panel contained few displays, including a display for a map of the surrounding region and enemies and allies within, a way to summon wingmates and transmit orders, a high-quality damage indicator, and weapon readouts. Also present was a mirror hanging from the windscreen, and two mirrors on each door; these allowed the pilot to view events behind him, though none offered a very clear picture."}, {"tag": "p", "text": "The Buick's interior included two decorative ornaments: one of the bunny Max, dangling from the roof-mounted mirror, and another of an unidentified creature, whose most notable attribute was its bobbing head. Also included in the car was a targeting computer, allowing the pilot to easily distinguish enemies from friendly craft, as well as detailed views on mission objectives."}, {"tag": "p", "text": "The car's engines, while powerful enough to move the craft through space at a high rate of speed, were not outwardly visible. Rather, two exhaust ports revealed the propulsion systems of the Buick; their glow was reminiscent of other starfighters of its time. The repulsorlift engines responsible for making the car hover would often fail, especially when exiting a hangar into space; when the Buick reached the end of the landing deck it would drop as it exited the starship. The sublight engines would soon initiate and allow the pilot to regain control and movement. Also present on the convertible were four wheels, two located at the fore and two located at the aft. The pair toward the rear of the craft were mostly covered by the hull. The wheels were not used, as their use as a method of transportation was made unnecessary due to its hovering nature. Later, the car's hyperdrive allowed it to travel to distant places without the need for additional support craft or units; in this way, it was entirely possible for the craft to act autonomously."}, {"tag": "p", "text": "As was the case with the engines, the weapons present on the Buick were not outwardly visible. There was a large amount of firepower, however, in the form of dual laser cannons and two cluster missile launchers. The laser cannons were able to provide a steady, long-lasting stream of fire. While the lasers fired from the front of the car, the cluster missile launchers were located toward the rear and underneath the convertible; each launcher contained a payload of three."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Buick was once under the ownership of Rudy, and was known at that time simply as \"Rudy's Car.\" In 32 BBY, the car turned up in the hands of the Naboo Security Forces, where it participated in ground-based missions surrounding the events of the Invasion of Naboo. Although allied with the Naboo, the craft was piloted by a B1-Series battle droid."}, {"tag": "p", "text": "Later, some time as early as 0 ABY, the car came into the Rebel Alliance's possession; at this time it was old enough to be considered a relic. The Rebellion stored it in the hangars of its Mon Calamari Star Cruisers; Rebel pilots, including Wedge Antilles, could use it during missions against the Galactic Empire. The convertible remained in their possession, and later that of the successor New Republic, throughout the Galactic Civil War, as late as the Battle of Calamari in 10 ABY."}, {"tag": "p", "text": "Rebel Alliance General Carlist Rieekan mentioned that the car was \"a relic from a galaxy far, far away,\" when covering the origins and specs of the vehicle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Buick is a recurring easter egg present throughout every game in the Rogue Squadron series of games, as well as Star Wars: Episode I: Battle for Naboo, as a special unlockable. In Rogue Squadron II: Rogue Leader and Rogue Squadron III: Rebel Strike, it replaced the A-wing once unlocked. The only way to unlock the convertible was through the use of cheat codes. However, the Buick is absent from the PC version, as the cheat code to unlock it does not work properly. The source files do remain in the PC version, and it is possible to unlock the craft using unofficial game modifications. In Star Wars: Battle for Naboo, the ship is accessible in both versions of the game without any modification."}, {"tag": "p", "text": "In Star Wars: Rogue Squadron III: Rebel Strike, the Buick contains two references to other LucasArts games: first, a swinging Max head, from the classic adventure series Sam and Max, and second, a bobblehead monkey, reminiscent of the adventure series Monkey Island."}, {"tag": "p", "text": "The vehicle is based on American automobiles from the 1960s, possibly as a tribute to George Lucas's proclaimed appreciation of classic automotive vehicles. The in-game car is modeled after Factor 5 employee Rudolf Stember's personal 1969 Buick Electra convertible. Due to this, the designation \"Rudy's Car\" was often used in several sources to find the cheat code to unlock the Buick in each respective game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}