{"url": "Buirk%27alor-class_airspeeder", "categories": ["Category:Legends articles", "Category:Law enforcement vehicles", "Category:MandalMotors products", "Category:Mandalorian vehicles"], "nodes": [{"tag": "h1", "text": "Buirk'alor-class airspeeder"}, {"tag": "p", "text": "The Buirk'alor-class airspeeder was an airspeeder designed and constructed by MandalMotors, a Mandalorian starship company headquartered on the Outer Rim world of Mandalore. Measuring just over ten meters in length and possessing powerful engines, the Buirk'alor-class speeder was favored by New Mandalorian units of the Mandalorian, who utilized the unarmed vessel to patrol the New Mandalorians' desert capital city, Sundari. The New Mandalorians' Duchess Satine Kryze and her diplomatic guest, Galactic Senator Padmé Amidala, also made use of a Buirk'alor-class speeder for transport during the galaxy-spanning Clone Wars, while investigating the poisoning of several New Mandalorian children."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Measuring 10.19 meters in length, the Buirk'alor-class airspeeder was equipped with a set of powerful engines that it relied upon for propulsion. Manufactured by the MandalMotors company, the unarmed Buirk'alor speeder was constructed primarily as a police craft, and police models featured the flashing lights common to law-enforcement vessels mounted on its roof. Additionally, the word \"police\" was prominently displayed on the frame of the airspeeder's nose in the Mandalorian language of Mando'a. The Buirk'alor-class airspeeder's small cockpit provided seating for up to four individuals, including the vehicle's pilot."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "A swift airspeeder design, the Buirk'alor-class model was used primarily by New Mandalorian members of the Mandalorian Guard. These officers patrolled the skylanes of the New Mandalorians' domed capital, Sundari. They relied on the airspeeder's powerful engines to allow them to respond rapidly to emergency situations, and speedily carry them to the scene of a crime."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Designed and constructed by MandalMotors, a prominent Mandalorian starship company headquartered in the planet Mandalore's capital city of Keldabe, the Buirk'alor-class airspeeder was produced at some point in time prior to the year 21 BBY for use by the New Mandalorian police. The officers of the Mandalorian Guard force took to using the Buirk'alor for patrolling the skylanes of the New Mandalorians' cities."}, {"tag": "p", "text": "During the Clone Wars, a galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems, a number of Buirk'alor-class airspeeders were mobilized during the course of an investigation into the sudden illness that had stricken and hospitalized several New Mandalorian children within Sundari. One even provided transport for New Mandalorian leader Duchess Satine Kryze and her diplomatic guest, Galactic Senator Padmé Amidala, as they moved about the city in search of the source of the children's illness."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Buirk'alor-class airspeeder made its first unnamed appearance in the Star Wars: The Clone Wars television series' third season episode, Corruption, originally aired on October 8, 2010. The name of the Mandalorian police vehicle was only revealed with the publication of the Star Wars: The Clone Wars: Incredible Vehicles guide book."}, {"tag": "p", "text": "The name Buirk'alor appears to come from the Mandalorian language developed by author Karen Traviss, specifically the Mando'a words buirkan, meaning \"responsibility\", and alor, meaning \"leader\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}