{"url": "A%27den_Skirata", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Clan Skirata", "Category:Clone trooper sergeants", "Category:Galactic Republic intelligence personnel", "Category:Null-class Advanced Recon Commandos"], "nodes": [{"tag": "h1", "text": "A'den Skirata"}, {"tag": "p", "text": "A'den Skirata (pronounced AH-den), originally known as Null-12, also known as N-12, was one of the six surviving Null-class Advanced Recon Commandos. Like the other Null ARCs, he was named and trained by Kal Skirata. A'den was also the only one of the Null ARC's who became a sergeant and not an officer. He chose this out of reverence to his training sergeant, Kal Skirata, who formally adopted him in Mandalorian tradition."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Null-12, more commonly known as A'den, was a clone of the Human male bounty hunter Jango Fett. Part of the first group of clones developed by the Kaminoan scientists, Null-12 was \"born\" in 32 BBY in the facilities of Tipoca City on the planet Kamino. Of the twelve clones in the batch, only six survived the gestation period: N-5, N-6, N-7, N-10, N-11, and N-12."}, {"tag": "p", "text": "When he reached two standard years of age, A'den and his five surviving brothers were given basic flash training by the Kaminoans. This training taught the future ARC troopers—Advanced Recon Commandos—to speak fluent Basic and about fundamental war training. Specifically, this war training instructed the boys in how to handle various blaster weapons and also introduced them to simulated warzones, complete with live explosives. The battle simulations gave A'den and the Nulls a fear of thunderstorms when they were little, as the thunder and lightning sounded just like the bombs going off."}, {"tag": "p", "text": "While A'den and his brothers proved to be physically capable, the Kaminoans' psychological tests revealed that the boys were not up to standard. Their scores were off the charts on the intelligence tests, but they could not match the preferred personality profile the Kaminoans sought. During exercises, they proved to be devious and uncommandable. Because of these defects - which were ultimately the product of the cloners' tampering with their genetic makeup in an attempt to improve on Jango's template - the six boys were designated as Null-class and were scheduled to be reconditioned."}, {"tag": "p", "text": "In 30 B.B.Y., Kal Skirata, a member of Jango Fett's Cuy'val Dar, met with Jango on Kamino and the two were asked by Orun Wa to inspect the Null-ARCs and to give their professional opinions. Kal was expecting to see grown men displaying shoddy marksmanship, etc., but was quite shaken to discover that the six 'defective' clones were really only four years old, having undergone two year's growth."}, {"tag": "p", "text": "After Orun Wa explained that the boys were uncommandable and would be terminated for not meeting the strict quality control measures, Skirata immediately jumped in, adamantly refusing to let the Kaminoans kill the helpless boys. Fett allowed Skirata to take A'den and the other Nulls to his quarters. It was there that A'den had his first taste of sticky uj cake and was given a real name instead of his serial number."}, {"tag": "p", "text": "Skirata quickly became a father to A'den and the Nulls, and they called him Kal'buir, or \"Papa Kal.\" When he was busy teaching his other commando squads, he encouraged the Nulls to run wild throughout Tipoca City. One of A'den's favorite activities during such times was swinging from the ceiling by a rappel line and shooting at the Kaminoan technicians below, an act his brothers always found quite amusing."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "War begins"}, {"tag": "p", "text": "The Clone Wars began in 22 BBY, when Master Yoda of the Jedi High Council came to Kamino and was responsible for the deployment of every available trooper to Geonosis, where the Jedi were engaged in rescuing Senator Padmé Amidala and the two Jedi Obi-Wan Kenobi and Anakin Skywalker."}, {"tag": "p", "text": "A'den and his brothers were deployed to the front so quickly that they did not have a chance to wake Skirata and bid him farewell."}, {"tag": "p", "text": "Five days after Geonosis, all six Nulls were scheduled to be chilled down into stasis to await their next deployment. Terrified of facing chill down, the Nulls quickly and efficiently shut down and barricaded themselves in the Special Operations barracks on Coruscant. It was only the timely arrival of Skirata that convinced the Nulls to stand down, and as a result he was re-enlisted as a Sergeant in the Grand Army. For the rest of the war, they worked in black ops for the Grand Army of the Republic though, ultimately, they only answered to Skirata."}, {"tag": "h4", "text": "Gaftikar Resistance"}, {"tag": "p", "text": "In 21 BBY, A'den was sent to Gaftikar to help a lizard species known as Marits capture the planet's major cities from the local Human population, who were being supported by the Separatists. A'den was sent there to pick up where Sull, an Alpha-Advanced Recon Commando who had suddenly gone MIA, had left off and train the Marits for the coming invasion."}, {"tag": "p", "text": "To aid the Null, a squad of clone commandos - Omega Squad - was sent to bring in additional supplies and help train the Marits, and even participate during the battle. A'den treated the squad as his brothers, and even tried warning Atin Skirata, the squad's slicer, not to ask about the Marits' stew. The commando asked anyway and was horrified to discover that the lizard species cooked and ate their own dead, as a form of respect."}, {"tag": "p", "text": "A few days before the Marits were going to attack, A'den sent Darman Skirata and Atin to do a recon of Gaftikar's capital city. While there, the two commandos discovered that Sull, the Alpha-ARC who had disappeared, had actually deserted and was now working as a cab driver in the city. Darman and Atin called in their finding and arrested the traitorous clone, bringing him to the resistance's camp for interrogation."}, {"tag": "p", "text": "A'den originally allowed Omega Squad to be present during the questioning, but then asked them to leave so he could have a one-on-one talk with the fellow ARC. A'den allowed Sull to go free, even hooking him up with a transport off-world and the opportunity to disappear on Mandalore. Niner, Omega Squad's sergeant, was adamantly against letting Sull go free. The two Sergeants engaged in a heated verbal battle, and A'den became so enraged that he forced his comlink into Niner's hand and challenged him to rat on the Alpha-ARC to command. Ultimately, Niner could not do it and stalked away. With Niner out of earshot, A'den continued his angry speech about the clones' unfair lot in life to his commando brothers."}, {"tag": "p", "text": "Soon after Nyreen Vollen, a pilot A'den had met on earlier undocumented adventures, took Sull to Mandalore, A'den, the Marits, and Omega Squad prepared for battle. While Omega called in air strikes on the capital and A'den single-handedly placed charges and jammers around several key locations in the city, the Marits and a complement of clone infantry began the ground assault. Their efforts were rewarded with the capture of the major cities and thus the planet. The Marits' achieved their original goal of proportional representation with their subsequent merging into the local Humans' politics."}, {"tag": "p", "text": "A few days later, A'den went to Coruscant to visit Fi, Omega's medic, who had sustained massive brain damage during the battle on Gaftikar."}, {"tag": "h4", "text": "Order 66"}, {"tag": "p", "text": "A'den eventually returned to Coruscant, where he was finally reunited with all five of his brothers and his father. Over a nice lunch, Skirata formally adopted A'den and the other Nulls as his sons, an act that made A'den extremely happy."}, {"tag": "p", "text": "A few days before Chancellor Palpatine enacted Order 66, A'den introduced Vollen to Skirata and became convinced that the two should marry. He went off with Vollen on her freighter to help her find out what had happened to her first husband, and so was off-world when Order 66 came through."}, {"tag": "p", "text": "A'den eventually met up with his Null brothers, Skirata, half of Omega Squad, Walon Vau, Bardan Jusik, Atin's wife Laseema, Ordo's wife Besany Wennen, Besany's friend Jilka Zan Zentis, and Jango Fett's estranged sister Arla Fett at their homestead on Mandalore. He was also present for the cremation of Darman's Jedi wife, Etain Tur-Mukan, who had died while trying to escape Order 66."}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "p", "text": "During Order 66 on Coruscant, Darman and Niner of Omega Squad had been left behind. Skirata, with help from his Null sons, came up with a plan to rescue the two men. A'den originally wanted to go to Coruscant to help with the extraction but was convinced otherwise by his brother, Ordo, because he had a dark tan that would make him stand out if they had to go undercover as regular clone troopers. A'den then remained behind on Mandalore, helping with the daily goings-on at the homestead."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A'den was both different and similar to his Null brothers. Like them, he was mentally disturbed from his flash training on Kamino and could snap at any moment. As a Null, he was also called \"death on legs\" by his father and was sometimes regarded as eccentric by the other clones. A'den was very cynical of Palpatine and the Republic, and was annoyed at the latter's reluctance to attack the Confederacy of Independent Systems at its heart. Like the rest of his Null brothers, he harbored a deep hatred of Kaminoans, especially Ko Sai."}, {"tag": "p", "text": "Unlike his brothers, A'den was very jovial in nature. He joked often and smiled so much that he had white lines by his mouth, showing where the skin creased constantly. His lighthearted nature made him an oddity among his fellow Nulls, who were often more morbid and sullen. Despite his inherent happiness, A'den could also become very angry very quickly. This was revealed during his argument with Niner over whether or not Alpha-ARC Sull should be allowed to go free after going AWOL. A'den was also the most talkative of all of his brothers and had no qualms about gossiping."}, {"tag": "p", "text": "Shortly before the formation of the Galactic Empire, A'den met and befriended Nyreen Vollen, who believed clones should have the same rights and life-spans as ordinary beings. Nyreen, or \"Ny\", would later aid the Skirata clan by bringing deserter clones to Mandalore to begin their new lives."}, {"tag": "p", "text": "Kal Skirata was A'den's father, and the man who saved the Null's life on more than one occasion. A'den and his brothers referred to Skirata as buir, \"papa,\" and did everything they could to please him. Skirata desired to give his boys and every GAR clone a full life-span, making it his life's mission. His fierce love for his sons made them totally devoted and loyal to him and his plans."}, {"tag": "p", "text": "A'den was very close to his fellow Null-ARC brothers - Ordo, Mereel, Kom'rk, Prudii, and Jaing. While on Kamino, A'den used to explore the Tipoca City complex with his brothers. They even started playing tricks on the Kaminoan cloners, and A'den's stunt of shooting at the aliens caused much merriment among the Nulls. During the Clone Wars A'den was often separated from his brothers, but he was always happiest when he was finally reunited with his family."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As an Advanced Reconnaissance Commando, A'den was trained like the Alpha-batch ARCs and used much of their same equipment. He wore white plastoid composite armor with green markings that heralded him as a sergeant in the GAR. He also wore a black kama and had a rangefinder on his helmet. During the resistance on Gaftikar, A'den wore plain civilian clothes; however, he switched back to his usual armor as the time for battle approached."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A'den Skirata was created by Karen Traviss for the Republic Commando series . A'den first appeared in Republic Commando: Triple Zero, the second book, and was a minor character in the other novels. A'den means \"wrath\" or \"rage\" in Mando'a. In The Complete Star Wars Encyclopedia, the entry for CT-80/88-3009, or A'den, erroneously indicates that Null-12 and CT-80/88-3009 are the same individuals."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}