{"url": "Bun-Dingo", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Assassin droids", "Category:Athletes", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "Bun-Dingo"}, {"tag": "p", "text": "Bun-Dingo was an assassin droid that was hired by Governor Bisad Koong to sabotage the Umboo Racing Team and win the Drainsweeper race."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Bun-Dingo was aboard Governor Koong's ship after the destruction of the destruction of the New Umboo Lightstation. He was ordered to take over piloting the ship by Gaff, who had departed to report Mungo Baobab's supposed demise after Koong's stolen Cloudcraft was shot down. Soon, Gaff discoveres that Mungo had survived the crash, and Bun-Dingo suggest that he report this to Koong. Gaff rejects this, deciding to take care of Baobab himself, sparing the Governor losing favor with Admiral Screed. The droid then points out that he but had been rescued by Auren Yomm, Koong's main competitor in The Roon Colonial Games. The Kobok then claims he will eliminate her as well."}, {"tag": "p", "text": "Gaff's assassination attempt having failed, the Kobok sent Bun-Dingo to sabotage the Umboo Racing Team. He snatches R2-D2's pet Mudman after a brief, one sided scuffle, telling the smaller droid to leave him. Undeterred, R2 witnesses the droid disable BIX and taint Gee Long's drink with droid coolant. He now had one last task, to race against Auren Yomm in the Drainsweeer event. Prior to the beginning of the race, as Bun-Dingo is filling his tank with Turbo Coolant, R2 sneaks into his tent and takes back his Mudman, accidentally spilling a strange liquid into the assassin droid's coolant supply. During the third leg of the race the droid activates his coolant, only for him to malfunction. He took one last swing at Auren, when he lost his balance and fell off of his Rockhopper. He was destroyed when smashed into the ground at the bottom of the drain, Gaff having adjusted the artificial gravity earlier to ensure a fatal landing."}, {"tag": "h2", "text": "Appearances"}]}