{"url": "Bump", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Bump"}, {"tag": "p", "text": "\"Bump\" is a short story in the anthology From a Certain Point of View. The story was written by Ben Acker and Ben Blacker."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the events of the secret mission to Tatooine, the stormtrooper TD-110 is reassigned to the Death Star. His comrades TD-422, TD-909, and TD-328 had experienced heat stroke after their stormtrooper armor had cracked under the scorching heat of Tatooine and had been rushed to the Death Star for recuperation. Before TD-110 can step into the hygiene chamber, the Death Star's alarm rings. A Moff informs him that intruders are aboard the Death Star and no stormtrooper will be granted reprieve until the situation is rectified."}, {"tag": "p", "text": "Despite his headache, TD-110 suits himself up. While dressing up, TD-110 reflects on his harsh upbringing on the wilds of the planet Parsh. Before joining the Galactic Empire, TD-110 was part of a clan that eked out a living on the harsh world. When the Empire had found them, they had put his people to work building mines. TD-110 was ignored since he was regarded as too frail. However, his Alphon found a purpose for him and used him to pass messages to the other yoked Alphoni. While the Alphon intended to inspire a revolution, TD-110 decided to advance himself by reporting the Alphon to the Empire. TD-110 personally executed the Alphon with a blaster before joining the Empire as a stormtrooper."}, {"tag": "p", "text": "TD-110 and the other stormtroopers are dispatched by the Moff to investigate a breach in Control Room 327 and get the comms back online. TD-110 hopes to take the insurgents' comms offline. TD-110 makes TD-787 the pointman for the assault and controls the urge to sneeze. On the way, his unit meets other troopers heading towards Detention Block AA-23. These include MG-26, a loyal conscript whose unit backed TD-110's unit on Lothal. Others include the lazy SS-922, the devoted and wise TA-519, and PD-528, who owes TD-110 credits. They also pass the \"zealot\" Darth Vader, whom TD-110 regards as a poor manager who is obsessed about the Force."}, {"tag": "p", "text": "On their way, TD-110 suddenly remembers that their mission on Tatooine had been to locate two droids. As he enters the control room, TD-110 bumps his head on the threshold. The room is scattered with several dead men including the stormtrooper TK-421. While TD-110 contemplates his punishment, TD-787 flushes out a pair of droids from the supply closet, who turn out to be C-3PO and R2-D2. The droids manage to convince the other stormtroopers that they were locked in the closet by the rebels and leave for maintenance. While waving the droids away, TD-110 recalls that those two droids were the ones his unit had been looking for. He also remembers the droids were traveling with an old man who had somehow \"spiked\" his intake unit."}, {"tag": "p", "text": "Hoping to redeem himself, TD-110 aims his blaster at the droids but is chastised by the Moff, who orders him to report for command. TD-110 reluctantly obeys his superior officer's command while PB-106 relieves him of his weapon. PB-106 and his unit escort TD-110 to command. While contemplating disciplinary procedures, TD-110 vows to fight his way back to the Death Star."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}