{"url": "Bungo_n%27_Rusti_Get_Carry-Out", "categories": ["Category:Real-world articles", "Category:Bungo n' Rusti", "Category:Legends one-shot comics"], "nodes": [{"tag": "h1", "text": "Bungo n' Rusti Get Carry-Out"}, {"tag": "p", "text": "Bungo n' Rusti Get Carry-Out is a short comic story written by Jim Anderson published in Star Wars Adventure Journal 11 by West End Games in November 1996."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Bungo Bung and his droid co-pilot Rusti arrive on Sullust. Bung is hungry, so he visits the local Biscuit Baron for a meal of Bantha Breakfast Biscuits with blue sauce. While eating, Bung mentions that thousands of people in the galaxy have never tasted a Bantha Breakfast Biscuit. Rusti replies that he should fill up the hold with them and find a market to sell them in. After a small debate regarding SoroSuub company policy, he relents and fills the Chubby Gundark's hold."}, {"tag": "p", "text": "After liftoff, the Chubby Gundark is intercepted by a Star Destroyer commanded by Captain Wankle. All but one crate of the cargo is confiscated. Regardless of this setback, Bung travels to the Outer Rim world of Gastrula and establishes the Great Bantha Breakfast Biscuit Run. Two weeks later, Bung discovers that the biscuits are mutating into Giant Amorphous Bantha Breakfast Biscuits. Bung and Rusti narrowly avoid the destruction of their ship by defeating the creature with blue sauce. With one case left, they allow it to be confiscated by Captain Wankle as revenge for his original confiscation of their cargo—but regret that they have no blue sauce to go with it."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Subsequent Bungo n' Rusti stories were originally slated to appear in later issues of the Adventure Journal, but, as Dark Horse Comics held the sole Star Wars comics license, the plans were scrapped. Several more unofficial stories were published online at TheForce.net, but only the first comic is considered official."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}