{"url": "Buoyant", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Inner Rim planets", "Category:Low-gravity planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Buoyant"}, {"tag": "p", "text": "Buoyant was an Inner Rim planet that was terraformed by a sentient species millennia before 54 BBY. The alterations made to Buoyant by the terraformers included an increased rotation rate as well as lush vegetation and imported animals, among them a long-necked herd quadruped."}, {"tag": "p", "text": "In 54 BBY, Buoyant was visited by the Dark Lord of the Sith Darth Plagueis and his apprentice, Darth Sidious. The two engaged in a series of hunts in various biomes of the planet, killing numerous creatures in order to strengthen their connection to the dark side of the Force and also discussing the nature of the dark side."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Buoyant was a low-gravity planet located within the Inner Rim star system of the same name. At some point, a sentient species had terraformed the planet, increasing its rotation rate so that days and nights alternated rapidly. Members of the species also altered the planet's atmosphere, and, by 54 BBY, it was being regularly scrubbed by violent, fast-moving storms."}, {"tag": "p", "text": "On Buoyant's surface, the terraformers encouraged the expansion of wide-ranging grasslands and dense forests as part of an experiment. Millennia after the modifications to Buoyant's ecosystem, the planet also featured savannas, arid wastes, and inland seas. By 54 BBY, the planet's flora was represented by brushes growing in the savannas as well as a species of tree that had thick branches, an enormous canopy, and a trunk wide enough to contain a landspeeder inside. Flowering parasitic plants grew on at least one of the trees' branches."}, {"tag": "p", "text": "When experimenting with Buoyant, the terraformers also imported several animal species, which were numerous and well adapted by 54 BBY, resulting in a bewildering mix of plants and animals on the planet. All of Buoyant's fauna was quick-moving and included flying insects as well as long-necked herd quadrupeds with brown-and-black-striped fur."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Millennia before 54 BBY, a sentient species terraformed an Inner Rim planet, altering its ecosystem and introducing several animal species from offworld. The sentients had been long-forgotten by the year 54 BBY, during which time the planet had become known as Buoyant and was visited by the Dark Lord of the Sith Darth Plagueis and his apprentice, Darth Sidious. The pair engaged in a series of hunts there, killing many creatures in Buoyant's forests, wastes, and under several of the planet's seas, all in order to strengthen their own connection to the dark side of the Force."}, {"tag": "p", "text": "The two Sith, armed with vibroblades and traveling on foot, also hunted members of a local quadruped species for several kilometers across the grasslands of Buoyant. After the extensive and tiresome hunt, Plagueis and Sidious rested beneath one of the planet's large trees, engaging in a discussion on the differences between the light and dark sides of the Force. To illustrate a point he was making during the conversation, Sidious's Master ignited the nearby grass in the savanna with a display of Force lightning, causing a brief brush fire. Later, when Plagueis had Sidious undergo combat training on the planet Hypori, the latter expressed his impatience with visiting Buoyant and Hypori instead of worlds like Korriban, Dromund Kaas, and Zigoola, which had a strong connection to the dark side as well as historical significance to the Sith."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "By 54 BBY, Buoyant's landscape was dotted by machines used by the sentient species that had terraformed the planet. Despite the species being long-forgotten, the equipment left behind on Buoyant was still functioning by that time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Buoyant first appeared in Darth Plagueis, a 2012 novel written by James Luceno. The 2012 reference book The Essential Reader's Companion placed Buoyant in grid square J-14."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}