{"url": "Burial/Legends", "categories": ["Category:Legends articles", "Category:Funerals"], "nodes": [{"tag": "h1", "text": "Burial"}, {"tag": "p", "text": "Burial was one of the procedures used throughout most of the galaxy to dispose of the remains of sentient creatures. Sentients were buried underground and the location marked with a tombstone, or entombed inside of crypts. A variation of this was space burial—in which the deceased was sealed inside a casket and this casket was then launched into space. An alternative to burial was cremation, or the disposal of remains by burning them, which was another popular method of disposing of the remains of deceased sentients."}, {"tag": "p", "text": "The Sacorrian moon of Sarcophagus was entirely devoted to being a burial ground for the planet. On Coruscant the Senatorial Tombs was the final resting place of many Senators, many of whom were frozen in carbonite and interred in the tombs. Senator Viento was buried in this manner after his assassination in 20 BBY."}, {"tag": "p", "text": "Space burial was a popular method of disposal, especially for military personnel. Lujayne Forge was one person who was buried in space. Following her death 6.5 years after the Battle of Yavin during an attack on the Rogue Squadron base on Talasea by Imperial stormtroopers, she and the other six sentries who had been killed in the attack were buried in space after a memorial service on board the New Republic ship Reprieve."}, {"tag": "p", "text": "According to Lobot, there were were twenty-two thousand, four hundred eight known cultures which entombed riches with the dead by the time of the Black Fleet Crisis."}, {"tag": "h2", "text": "Cultures"}, {"tag": "p", "text": "A number of different cultures practiced burial in varying forms."}, {"tag": "h3", "text": "Sith"}, {"tag": "p", "text": "Many of the early Sith Lords were given elaborate burials in the Valley of the Dark Lords on Korriban. Even though the tombs were equipped with traps and other defenses, the tombs were eventually penetrated and most of the artifacts were removed from the tombs. The Sith Lord Ludo Kressh was not buried in the Valley of the Dark Lords, he was buried in a secret tomb inside a large Shyrack cave on Korriban. That tomb was filled with dark side energy, which caused visitors to experience massive hallucinations, which were so vivid that visitors were unable to tell whether they were real or not."}, {"tag": "p", "text": "While most of the ancient Sith Lords were buried on Korriban, this was not always the case. The Sith Lord Freedon Nadd was buried on Dxun, which orbited Onderon."}, {"tag": "h3", "text": "Jedi"}, {"tag": "p", "text": "In most cases, Jedi were generally not buried. Rather, deceased Jedi were often cremated on a pyre. In rare cases the body of a Jedi faded away after death—as happened with both Masters Yoda and Obi-Wan Kenobi."}, {"tag": "p", "text": "After Luke Skywalker reestablished the Jedi Order, a number of Jedi were buried in a grove in the Yavin jungle, with a gray plinth marking the graves. Gantoris was the first to be buried there, followed by Dorsk 81, and in time they would be joined by many others."}, {"tag": "p", "text": "The third Barsen'thor of the Jedi Order was buried following his death in a massive tomb on Chandrila. Fourteen years after the Battle of Yavin, Jaden Korr was sent on a mission to prevent the Disciples of Ragnos from siphoning the power from the tomb. The Disciples were able to unseal the Jedi Master's coffin, but were stopped from stealing the power by Korr. He proceeded to reseal the coffin, but the tomb collapsed shortly afterward."}, {"tag": "h3", "text": "Mandalorian"}, {"tag": "p", "text": "On Mandalore, most Mandalorians were buried as simply as possible within mass graves that had no markers. Some highly placed individuals, such as Mandalore, were offered the option of having a marked grave. However, Boba Fett wished to just set the Slave I on autopilot and just drift in space."}, {"tag": "p", "text": "After removing his father's remains from Geonosis, Boba Fett buried them on Mandalore, along with those of his daughter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}