{"url": "Burra", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Baran Do Sages", "Category:Force-sensitives", "Category:Hidden Ones", "Category:Kel Dor", "Category:Males"], "nodes": [{"tag": "h1", "text": "Burra"}, {"tag": "p", "text": "Burra was a Force-sensitive Kel Dor male from the planet Dorin and a member of the Baran Do Sages, a Force-based organization on Dorin. He later became a member of the Hidden Ones, a secret sect of the Baran Do dedicated to preserving their knowledge, should the order ever be destroyed. Burra, who took that name upon joining the Hidden Ones, was one of the eldest members of the sect present in 43.5 ABY when exiled Jedi Grand Master Luke Skywalker and his son, Jedi Knight Ben Skywalker, arrived on Dorin in search of Master of the Baran Do Order Koro Ziil, hoping to find out more about why the Jedi Knight Jacen Solo had turned to the dark side."}, {"tag": "p", "text": "The Skywalkers soon discovered the Hidden Ones, and traveled with senior combat instructor Charsae Saal to the system of caverns that were home to the sect. Ziil, who had recently become the Hidden Ones' leader, told the Skywalkers that in order to protect the sect's secrecy, they would not be allowed to leave the caverns. After Luke defeated Ziil in a duel of Force powers, Burra revealed to the Skywalkers the location of a secret turbolift chamber out of the caverns."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A male Force-sensitive Kel Dor from the planet Dorin was a member of the Baran Do Sages, a Force-based organization on Dorin. Sometime after 19 BBY, he joined the Hidden Ones, a secret sect of the Baran Do formed by Sage Tokra Hazz, dedicated to preserving their knowledge so that if the Baran Do on the surface were destroyed, the organization could be restored. He changed his name to Burra in doing so, reflecting that his former self was considered dead."}, {"tag": "p", "text": "In 43.5 ABY, Jedi Grand Master Luke Skywalker was exiled from the New Jedi Order and the galactic capital of Coruscant for failing to prevent Jedi Knight Jacen Solo's fall to the dark side of the Force. Luke and his son, Knight Ben Skywalker, traveled to the Baran Do temple on Dorin to speak with Master of the Order Koro Ziil, hoping to find the cause of Solo's fall to the dark side. Upon their arrival, however, they were told that Ziil had died, and the two decided to stay and train with the Sages."}, {"tag": "p", "text": "During their stay, the Skywalkers attended the dying ceremony—a ceremony in which a Sage pretended to die and then traveled to a system of caverns that were home to the Hidden Ones—of senior combat instructor Charsae Saal. However, Luke wasn't fooled by Saal's \"death,\" and after searching the site, the Skywalkers found Saal alive and well. Realizing that Ziil was likely still alive as well, they traveled with Saal to the caverns. Once there, they found that Ziil was in fact alive and had become the leader of the Hidden Ones and taken the title of the Hidden One. Ziil told the Skywalkers that in order to protect the sect's secrecy, no one who came to the caverns could ever leave. The Skywalkers were further informed that they would have to change their names, as all Hidden Ones did, and accept that they were dead to the outside world."}, {"tag": "h3", "text": "Leaving the Hidden Ones"}, {"tag": "p", "text": "During their stay, Luke developed a theory that the Hidden Ones—by rejecting life and vitality and accepting death—had all but turned their backs on the Force, while Ben discovered the triggers for a system of explosives that could be activated from any room to block off the only known exit from the caverns. The Skywalkers later announced that they were having a naming ceremony—a ceremony in which new members of the Hidden Ones chose their new names. Burra, who by that time was one of the eldest members of the Hidden Ones, attended the ceremony in Ziil's throne chamber along with all of the other Kel Dors in the caverns. However, once the Hidden Ones had gathered, Luke revealed that he intended to change the Hidden Ones' own names, restoring them to life, and proposed his theory. Burra spoke up, telling him that the Hidden Ones had discussed Luke's theory. Burra also revealed that the Hidden Ones didn't vote; their leader decided everything. Luke continued to propound his theory over the Hidden Ones' protests, and Ben dueled Saal—now known as Chara—with hardwood staffs in an attempt to prove Luke's point. Chara was by far Ben's superior, having taught him combat techniques during Ben's time with the Baran Do, but Ben defeated him because he possessed the will to win. Ziil, however, still did not listen to reason, claiming that Luke had brainwashed Chara into believing that his powers were weakening, causing him to lose."}, {"tag": "p", "text": "To resolve that problem, Ziil revealed that he had told those on the surface that the Skywalkers had died when a cave collapsed, and they would no longer need their oxygen-nitrogen canisters. Without the canisters, the Skywalkers would die from Dorin's helium-rich atmosphere within a couple of days. Burra finally openly protested against Ziil, but the latter refused to listen, even after other Hidden Ones—including the female Kel Dor Ithia—spoke out against him. Ziil then confronted Luke in a duel of Force powers, which Luke won. After his defeat, Ziil decided that he would allow the Skywalkers to live, but he still refused to let anyone leave the caverns. Frustrated with Ziil's continued defiance, Ben set off the explosive system with the Force, collapsing the exit. Ben then began to reveal to the Hidden Ones the many lies that Ziil told them, such as the claims that there was only one tunnel in and out of the caverns and that Ziil could use telepathy to teach new sages on the surface should they be wiped out, but Ziil still insisted that there was no way out of the caverns. At last, Burra revealed that he knew of a secret turbolift chamber which led to the surface of Dorin, and Luke, Ben, and the Hidden Ones returned to the surface."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Burra was a Force-sensitive, but after he joined the Hidden Ones, he was forced to accept that he was dead to the outside galaxy. He was one of the eldest members of the Hidden Ones, and appeared to be deeply trusted by Koro Ziil, being one of the few Hidden Ones other than Ziil himself—perhaps the only other—to know of the secret exit from the caverns. Burra was somewhat set in tradition; he had questioned the wisdom of the Hidden Ones before Luke Skywalker debated with him on the subject, but he seemed to have turned a blind eye to the matter rather than look for answers. Yet Burra was no fool, and came to see that Luke was right that in rejecting life, his ability to touch the Force had diminished. He objected when Ziil announced that he was going to kill the Skywalkers, pointing out that such an act was not the Baran Do way. Still, Burra felt obligated to remain loyal to his leader, and even after Ben revealed the many secrets that Ziil had kept from the other Hidden Ones, Burra was hesitant to reveal the secret turbolift exit to the Skywalkers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Burra was created by the established Star Wars author Aaron Allston for his first novel in the nine-part Fate of the Jedi series, Fate of the Jedi: Outcast, released on March 24, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}