{"url": "Burryaga_Agaburry", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Jedi trainees of the Jedi Order", "Category:Kashyyyk residents", "Category:Males", "Category:Pilots", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Burryaga Agaburry"}, {"tag": "p", "text": "Burryaga Agaburry was a male Wookiee Padawan of the Jedi Order who was active during the High Republic Era. The apprentice of Jedi Master Nib Assek, his master learned Shyriiwook so she could communicate with him."}, {"tag": "p", "text": "Burryaga and his master participated in the rescue effort to save the Hetzal system during the Great Hyperspace Disaster. He was the one who discovered that several of the hyperspace anomalies bearing down on the worlds of the system were starship fragments with people still alive onboard. While Jedi pilots attempted to destroy the starship fragments, Burryaga felt the survivors' terror so deeply that it radiated through the Jedi Force meld. Facing a language barrier, the other Jedi believed that they were feeling Burryaga's own emotions and initially attempted to remove him from the Force meld. Burryaga's efforts ultimately made the other Jedi realize that the starship fragments had survivors aboard."}, {"tag": "p", "text": "Burryaga wielded a blue lightsaber with a physical crossguard on the hilt."}, {"tag": "p", "text": "Burryaga disliked social gatherings due to the fact that most people could not understand him. However, when he was onboard the Galactic Republic medical frigate Panacea with the many patients from the Legacy Run, he was able to help comfort the human boy Serj Ukkarian."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Burryaga Agaburry was created for the Star Wars: The High Republic publishing project. He appeared in the 2021 novel The High Republic: Light of the Jedi by Charles Soule. He is described as a \"very sensitive Jedi\" and wields a blue crossguard lightsaber, with the crossguard design being inspired by Arthurian myths, such as the sword Excalibur."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}