{"url": "Bursa/Legends", "categories": ["Category:Legends articles", "Category:Carnivorous creatures", "Category:Creatures of Naboo", "Category:Creatures of unspecified biology", "Category:Domesticated creatures", "Category:Predatory creatures", "Category:Species of undefined sentience", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Bursa"}, {"tag": "p", "text": "Bursas were carnivorous quadrupeds native to the planet of Naboo."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Bursas were a species of non-sentient, four-legged carnivorous creatures native to Naboo. They had tusked snouts and feathery tufts of brown hair on their thick-skinned bodies, and were known to build and live in mud huts in the planet's swamps."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Bursas were thought to have predated even the Gungan race on Naboo. Early Gungans were attacked by the native wild bursas while exploring their world. Such behavior was not uncommon in the bursas, who were known to mercilessly destroy Gungan settlements. Bursas led by the warlord Boss Rogoe destroyed Boss Gallo's village, Otoh Sancture, in 3000 BBY. However, Gallo's forces healed an injured bursa chief, and a clan of bursas allied with Gallo in the siege of Rogoe's Keep."}, {"tag": "p", "text": "Since then, bursas appeared across the galaxy, mostly as pets to the Hutts or in circuses. On Naboo, however, it was believed wild bursas were driven to extinction by the Gungan Grand Army, though a tamer variety survived into the era of the Clone Wars. The Amaran species took to capturing, breeding, and selling these creatures, which could be trained to dance on their hind legs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Robin Pronovost originally designed the bursas for The Essential Guide to Episode I, a product that was ultimately never published, at the request of its intended author Daniel Wallace. They were to be based on a reference Wallace found in George Lucas's notes that the Gungans had once fought against \"bear-like creatures.\" When the Essential Guide was cut, the bursas later appeared in the 2001 video game Star Wars: Galactic Battlegrounds, along with the game's 2002 expansion pack, Clone Campaigns."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}