{"url": "Burska", "categories": ["Category:Legends articles", "Category:Freestanding subsectors planets", "Category:Galactic Republic planets", "Category:Mid Rim planets", "Category:New Republic planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Burska"}, {"tag": "p", "text": "Burska was a little-known tundra planet located in the Mid Rim's freestanding subsectors. It had frequent, large-diameter hail and was home to a thick-hided, passive offshoot of the gundark species."}, {"tag": "p", "text": "The Burskan gundark was discovered by an atmospheric and geological scientist team that visited the planet during the final years of the Galactic Republic. Although the first contact ended disastrously for the researchers, one of the local gundarks was subsequently transported off-world for study, with Burska being declared a Republic-protected zone. Eventually, the planet became a part of the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Burska was a small planet that was located in the Burska system. It lay within the freestanding subsectors portion of the Mid Rim, near the Unknown Regions. The planet was a tundra world with sparse vegetation, and its terrain also included shallow caves. Neither soft nor fluffy textures existed on Burska, and decomposing plant matter was rarely encountered on the planet's tundra. Hail, often measuring fifteen centimeters in diameter, occurred frequently on Burska. The planet had long and cold winters, which gave way to spring during which the local fauna underwent mating season."}, {"tag": "p", "text": "The dominant species on Burska was the Burskan gundark, an offshoot of the semi-sentient, omnivorous primate known as gundark, which originated on the Outer Rim Territories world Vanqor. The Burskan variant of the gundark was an unusual, passive creature that had evolved a very thick hide in order to protect itself against the planet's fierce hail. Burskan gundarks were most active in the spring, when they wandered the tundra to forage on plant matter and hunt smaller creatures that became careless during mating season."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "First contact"}, {"tag": "p", "text": "For a long time, Burska remained a little-known world. That changed during the final years of the existence of the Galactic Republic, when an exploratory starship arrived on the planet. The vessel was carrying scientists who had come to study Burska's atmosphere and geology. To the research team's surprise, it discovered the Burskan gundarks, but one of the geologists was killed and expensive equipment was lost when the scientists' attempt to prod one of the gundarks into the ship's cargo hold resulted in the creature becoming aggressive."}, {"tag": "p", "text": "Better-trained zoologist teams later visited Burska and captured one of the local gundarks, taking the creature back to the Core Worlds to study it and declaring the planet to be a Republic-protected zone. Only a few of the Burskan gundarks were taken off-world for study purposes, and although various criminal enterprises attempted to use the gundarks for illicit purposes, the creatures' passivity made them unprofitable, and therefore most members of the species peacefully remained on their homeworld, retaining a level of anonymity from the wider galaxy."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "At some point, the Dreskin Foundation, a zoological society based on the Core Worlds planet Coruscant, hired a group of individuals to travel to Burska and bring back one of the local gundarks for study. The operation was hampered by the radical environmental protection group known as the Natural Planetary Protectorate, which was dedicated to the protection of the Burskan gundark population. The NPP damaged the starship and other equipment of the Dreskin Foundation's agents, and the latter group experienced further difficulties with both their adversaries and the gundark it attempted to transport."}, {"tag": "p", "text": "Scientists eventually established feeding stations across Burska, which they believed to contribute to the rise of the Burskan gundark population, estimated to be approximately 14,000 creatures. Burska fell within the borders of the New Republic between 12 ABY and 13 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Burska was introduced in \"Burskan Gundark,\" an article written by Jeff Quick and published on Wizards.com on August 7, 2003. The article includes a roleplaying adventure seed, to be used with Wizards of the Coast Star Wars Roleplaying Game, that is set on Burska. This article assumes the scenario plays out as described. The 2009 reference book The Essential Atlas placed the Burska system, and therefore the planet itself, in grid square I-7."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}