{"url": "Bursk", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Blizzard Force personnel", "Category:Enlisted stormtroopers of the Galactic Empire", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Bursk"}, {"tag": "p", "text": "Bursk was a  Human male who served as a stormtrooper in the Galactic Empire's Stormtrooper Corps during the Galactic Civil War, a conflict between the Empire and the Alliance to Restore the Republic. He attained the rank of sergeant major by 3 ABY. That year, the Empire discovered Echo Base, the Alliance's headquarters on the planet Hoth. The discovery led to the Battle of Hoth, which included a ground assault on the base itself."}, {"tag": "p", "text": "Bursk, a cunning planner, took part in the assault as part of the Imperial Blizzard Force, and was the leader of one of the most brutal snowtrooper platoons, coordinating attacks and managing troop movements. Ultimately, the Battle of Hoth resulted in an Imperial victory, with the Alliance forced to evacuate the planet. At some point around that time, Bursk stood behind another snowtrooper, Sergeant Narthax. Bursk wore full snowtrooper armor, and was armed with an E-11 blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Bursk first appeared in a Battle of Hoth deleted scene for the 1980 film Star Wars: Episode V The Empire Strikes Back, during which he was part of a group of snowtroopers who were tricked into approaching a wampa pen after the 3PO-series protocol droid C-3PO tore off the door's warning label, provoking the wampas within. During production, the scenes where Dark Lord of the Sith Darth Vader and the snowtroopers initially entered Echo Base were filmed in England's Elstree Studios between March and April 1979."}, {"tag": "p", "text": "That deleted scene was later used as the basis for the short story \"One Step Ahead,\" published in the 1996 second edition of Galaxy Guide 3: The Empire Strikes Back. In fall of 1998, that deleted scene was included, along with photos, in the CD-ROM Star Wars: Behind the Magic. Although Behind the Magic describes the wampas attacking all the snowtroopers in the scene, the filmed scene only shows one of the snowtroopers entering the pen and being attacked by the wampas."}, {"tag": "p", "text": "In November of 1998, Bursk was first identified by name in a card for the Special Edition Limited expansion set of the Star Wars Customizable Card Game. In 2011, the deleted scene with the snowtroopers was officially released as part of the Star Wars: The Complete Saga Blu-ray set. Although \"One Step Ahead\" canonizes the event of wampas attacking snowtroopers in a story based off the deleted scene, no source makes an in-universe link between production photos of Bursk and the short story. Therefore, this article avoids linking Bursk to any of the snowtroopers in \"One Step Ahead.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}