{"url": "Buula%27s_Rocky_Home", "categories": ["Category:Legends articles", "Category:Asteroid bases", "Category:Asteroids", "Category:Outer Rim Territories asteroids", "Category:Pirate bases", "Category:Svivreni sector"], "nodes": [{"tag": "h1", "text": "Buula's Rocky Home"}, {"tag": "p", "text": "Buula's Rocky Home was one of the Vessar asteroids in the Telanka system of the Outer Rim. It was home to the Chevin crime lord Buula Nen and his raiders."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The asteroid base served as Buula's hideout, smuggling hub, base of operations, and primary slave pens. The asteroid base was full of pirates and fringers, all of whom hoped to cash in on Chevin's profitable enterprises. Though upon being recruited, they found themselves deep in a game of lies and deceit, one in which all the cards were held by Buula. Who maintained control over his henchmen and associates via the use of threats, violence, and subterfuge."}, {"tag": "p", "text": "Buula's operations mainly consisted of dirtside raids, employing a small fleet of ships to raid freighters and outposts throughout the Outer Rime. He sold off anything he could, from slaves to cargo and the ships themselves. Captives were ransomed and kept isolated in the base's holding rooms, and if they turned out to have no value, they were tossed into the holding pit to be sold to slavers."}, {"tag": "p", "text": "His hideout was equipped with a main docking bay that had room for three light freighters and a handful of starfighters. It had various rooms and facilities, including a machine ship, a storage room for loot, a shield generator, a medical bay, a communications room, a dozen rooms for the crew, the main power generator, a common room, a guard post, holding rooms, and a holding pit. The asteroid was defended by multiple batteries of remote-controlled surface mounted laser cannons, turbolasers, and a proton torpedo launcher."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}