{"url": "Buyer%27s_Market_(Insider_126)", "categories": ["Category:Real-world articles", "Category:Legends short stories from Star Wars Insider"], "nodes": [{"tag": "h1", "text": "Buyer's Market  (Insider 126)"}, {"tag": "p", "text": "Buyer's Market is a short story written by Timothy Zahn that appeared in Star Wars Insider 126."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Lando Calrissian, while on Vorrnti City, visited the junkyard Blackie's owned by a man named Blackie. Lando revealed to the owner that he was looking for some hard-to-find merchandise and that he had been told that Blackie's was the place to look. The smaller man that accompanied Blackie, Cravel, wanted to know exactly what Lando was after, but the smuggler divulged nothing. But Lando spotted what he had come to find, standing among rusty harvesters. He asked Blackie if it was an AT-AT, but Blackie told the smuggler it was not for sale - thus he continued his search. Lando came across a pair Huttese Marsh Crawlers and decided he wished to purchase them. When Lando asked to use some tractor-haulers to lift them out, Blackie noted that they should probably hold of for a few days as a major real estate transaction big shot was coming in. Lando, instead, asked if he could have them and rent a warehouse down the street to stash them in. Blackie agreed and the three moved into the office to do the paperwork."}, {"tag": "p", "text": "After a hour, Lando and Blackie used the haulers to move the first crawler. Lando opened fire at the underside of the hauler, and came to the conclusion that he spotted some scrap rats underneath the hauler. Unfortunately, Lando damaged the hauler and Blackie realized he would have to fix it. Blackie told Lando to go back to his ship as the repairs would take a few days. Lando arrived back in his ship, Lady Luck, fifteen minutes later and went to his comm board. He contacted the Coruscant Military Command and asked for Lieutenant Judder Page of the Katarn Commandos."}, {"tag": "p", "text": "The big shot that Blackie mentioned arrived with bodyguards, but not for real estate. Lando realized that he was there for Glitterstim as he could smell the drug. Page informed Lando that his men were ready and Lando informed Page that his were too. The AT-AT moved towards the marsh crawler still in the entryway, but Lando had been cunning. He used the marsh crawler to block the entryway so the AT-AT couldn't get out. Unfortunately, that didn't stop it. It opened fire on people, killing them instantly. Men went out of the AT-AT and lugged two containers back. The two men were hit by stun shots, and then the AT-AT stopped firing. Lando revealed to Page that he used Carvels crew to get the AT-AT up and running for him. He wanted to take the AT-AT to Nkllon City and needed thirty-nine more AT-AT's to finish his project. He decided to see how good a deal Blackie would be willing to cut him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}