{"url": "Byph", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Ithorians", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Byph"}, {"tag": "p", "text": "Byph was a male Ithorian youngling who trained to become a Jedi during the Clone Wars. During the war, Byph and five other initiates were selected to travel to the planet Ilum and take part in the ritual known as the Gathering, where they would locate kyber crystals to use in the construction of their first lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around two years into the Clone Wars, Byph and the other Jedi younglings Petro, Katooni, Gungi, Ganodi, and Zatt, being at the top of their class were sent to the planet Ilum to collect the kyber crystals for their lightsabers. During the trial, Byph was forced to overcome his own fear in order to retrieve his crystal, which he succeeded in doing. He and the other younglings were then taken by Ahsoka Tano to the Crucible, a starship where the architect droid Huyang would teach them to build their blades. While Byph and the others were trying to construct their lightsabers, the ship was boarded by Weequay pirates led by Hondo Ohnaka. The Jedi managed to fight off the pirates, but the Weequay captured Tano before returning to the nearby planet Florrum."}, {"tag": "h3", "text": "Rescuing Ahsoka"}, {"tag": "p", "text": "After contacting Jedi Master Obi-Wan Kenobi and learning he was unable to aid them, Byph and the other younglings were forced to land on Florrum where Tano was being held. Disguising themselves as part of a circus troupe, the younglings were able to infiltrate Ohnaka's lair and free Tano before attempting to escape from the pirates."}, {"tag": "p", "text": "The attempt was unsuccessful, but shortly after the younglings were captured, Separatist forces attacked Florrum, forcing the Jedi and the pirates to work together. By cooperating, the two groups were able to escape Florrum and meet up again with Galactic Republic forces, who let the pirates go free."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}