{"url": "Byrch_Dyshkava", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Fallen Jedi", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Lamaredd residents", "Category:Males", "Category:Pirates", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Byrch Dyshkava"}, {"tag": "p", "text": "Byrch Dyshkava, known as The Padawan, was a Jedi apprentice learning under a Jedi Master, until his eventual fall to the dark side of the Force during a mission. Dyshkava attacked freighters for several years and then he settled in the remote planet Lamaredd, where he became the leader of an outlaw gang. Feared because of his powers and his lightsaber, \"The Padawan\", as he would be known, wrought havoc in the settlement Bartyn's Landing until he met his match in Chief Mix Liddell, a foe Dyshkava came to respect. Liddell sent Dyshkava to the local jail."}, {"tag": "p", "text": "Dyshkava escaped, becoming a wanted fugitive, but he was then captured by the secretive Menahuun species, who kept him detained for several decades. During that time, he discovered that the powerful, aggressive Menahuun were preparing to wage a war against the alien settlers of The Landing. Dyshkava eventually escaped at a very old age and went to The Landing. At that point, he only wanted to die in a blaze of glory, preferably in a duel with Liddell."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "Byrch Dyshkava, a Human male born circa 133 BBY, joined the Jedi Order and became an apprentice, or Padawan, under a Jedi Master. Padawan Dyshkava overestimated his own skills and had shown a great deal of ambition. After several missions with his Jedi Master, the Master sent Dyshkava alone to a conference that included negotiations. The Master hoped that his Padawan would learn from the experience without running any real risk. The conference was unexpectedly attacked by hostage-taking terrorists. Dyshkava was injured in the line of duty and only escaped using his powers of the Force. Instead of calling his Master for help, Dyshkava resorted to the dark side. This allowed Dyshkava to choke the criminals and free the hostages. Once he had dealt with the threat, he did not return or report to the Order. Instead, he went missing for years. The Jedi Council vainly tried to find Dyshkava, and not even Master Yoda could see Dyshkava's future. Eventually, the Council abandoned the search for Dyshkava."}, {"tag": "p", "text": "Dyshkava, driven by the dark side, spent years raiding starships in hyperspace lanes. He happened to attack the supply lines of Bartyn Gourmet Delicacies, a seafood company from the planet Lamaredd. He followed this track and ended on Lamaredd. Once there, Dyshkava became a lightsaber-wielding outlaw under the nickname of \"The Padawan,\" and later, the leader of a gang. His group attacked and sometimes razed farms near the coastal town Bartyn's Landing, boarded merchant and fishing trawlers and eventually raided the Landing itself. Dyshkava's identity was unknown on Lamaredd, but the mysterious chieftain of the outlaw group was rumored to be a fallen Jedi and, sometimes, a Jedi sorcerer."}, {"tag": "p", "text": "Security Chief Ertine and his Seconds, under public pressure, tracked the gang to their hideout, but Dyshkava had seen them coming and had the time to prepare a trap. The bandits ambushed the constables and killed all of them but one, rookie Second Mix Liddell, who barely survived his grave wounds. Liddell returned to the Landing, healed and was appointed the new Chief. Chief Liddell recruited new Seconds among fishermen, including his friend Grubber Vapps, and cunningly used the farm of a voluntary as a bait for Dyshkava. Using courage and craftiness, Liddell attracted Dyshkava to a new trap, where all of the Padawan's men were either killed or captured. Liddell apprehended and chained Dyshkava, taking him to the local jail."}, {"tag": "h3", "text": "Escape"}, {"tag": "p", "text": "Dyshkava escaped from his cell during Liddell's watch—the only prisoner to ever achieve that feat—but admitted that Liddell had defeated him justly and deserved his respect. Once Liddell discovered the getaway, he swore to track and capture Dyshkava again. A bounty was posted for the Padawan: 5,000 credits for his capture, or 3,000 for his corpse."}, {"tag": "p", "text": "Having escaped, Dyshkava traveled through the coastline, looking for a boat that could take him to a remote port on Lamaredd such as Cape Regret or Farsands. Once he had traveled little more than one hundred kilometers, he was attacked by an overwhelming crowd of Menahuun scouts—a native species of Lamaredd that Humans believed extinct for five centuries. Although Dyshkava put up resistance, the Menahuun captured him and jailed him in a bag that they threw into a hole in a secret location. As years went by, Liddell reached the conclusion that he would never see Dyshkava again, so his promise to capture The Padawan felt empty."}, {"tag": "p", "text": "After his own claim, Dyshkava stayed in that prison for twenty years, although he admitted he had no good way to count time and in fact he might have been emprisoned for four decades. He eventually escaped by digging but, at that point, he was over one century of age and suffered from at least one illness. Thinking he was well past his prime, he set off for Bartyn's Landing, because he wanted to die in a spectacular fight against Liddell. Dyshkava also recorded his discoveries about the Menahuun in a datacard, a gift for Liddell that Dyshkava intended the Chief to take from the Padawan's corpse."}, {"tag": "p", "text": "Once in Bartyn's Landing, Dyshkava did not find Liddell. Instead, he challenged some strangers in the crowd to a duel—and lost. Dyshkava nonetheless survived the duel, yelled for Liddell and then collapsed. Chief Liddell, who disliked public duels, approached to scold the gunslingers, and then was caught unawares at seeing Dyshkava. He took the injured outlaw to a cell and called for the local doctors, MD-0C6 and F-RTZ-2, to treat him; the other gunfighters also went as Liddell wanted to take their statement—and to offer them the bounty."}, {"tag": "p", "text": "Although the prognosis was disheartening, Dyshkava recovered enough for Liddell to question him—for a short time; MD-0C6 insisted in his patient having some rest. Liddell then recruited the gunfighters as his new Seconds to investigate Dyshkava's claims of Menahuun activity in the area in which Dyshkava had been captured. These outsiders found proofs of Menahuun hostile presence and even signed a diplomatic agreement with the Menahuun community."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After this, Liddell ran for the elected position of Administrator. During a pre-election rally, he was shot by a young outlaw who wanted to become \"the new Padawan;\" despite the attack, Liddell survived."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Byrch Dyshkava was familiar with the lore of the Jedi Order and, in time, he became knowledgeable about the life in Lamaredd. He also learned to speak Chagri, Menahu, Mon Calamarian and Quarrenese although he could only read Basic. Dyshkava was skilled at lightsaber combat, but his was damaged at some point after 69 BBY. From that point onward, he resorted to a vibrodagger for close combat, and a slugthrower for ranged attacks. He also preferred wearing black robes."}, {"tag": "p", "text": "Dyshkava felt a great deal of respect toward Mix Liddell from the moment Liddell managed to defeat him. Also from that point on, Dyshkava did his best to not underestimate the Chief again. In 29 BBY, Dyshkava was either hunchbacked or pretended to be."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Byrch Dyshkava had several powers of the Force, including many which were aggressive in nature such as the telekinesis, Battlemind and Drain Energy. He also knew other powers, including using the Force to heal another being."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Byrch Dyshkava was created by writer Cory J. Herndon and featured in the article Bartyn's Landing and in the role-playing adventure Reckonings, both of them published in the magazine Star Wars Gamer #7 (2001). A depiction of Dyshkava as drawn by Ramón Pérez illustrated the adventure."}, {"tag": "p", "text": "In Reckonings, Dyshkava claims to have been imprisoned for twenty years, but he was supposed to escape Liddell forty years before that event. There are several other references to Liddell becoming Chief twenty years before the present moment in Bartyn's Landing, apparently a typo because it would contradict other events. Dyshkava's \"twenty years\" might also be a typo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}