{"url": "C%27borp", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "C'borp"}, {"tag": "p", "text": "C'borp was Finhead Stonebone's chief gunner aboard the pirate vessel Marauder Starjacker, which operated some 4,000 years before the Battle of Yavin. In 4000 BBY, C'borp took the ship's laser turret to fire on an Ithullian ore hauler, which was transporting valuable ore that Stonebone wanted to siphon. C'borp destroyed the ore hauler's defenses, including a security detail loaned to the hauler by the powerful crime lord Bogga the Hutt. However, as the siphoning crew boarded the ore hauler, the Marauder Starjacker was captured, and its crew imprisoned, after the surprise appearance of Bogga's flagship, Enforcer One. C'borp and the other pirates were brought to the Hutt's estate on the moon of Vo Dasha, where Stonebone and his crew were offered exoneration for their pirating if they went to the desolate planet of Ambria to retrieve some Adegan crystals for the Hutt. Stonebone agreed, and C'borp and the group journeyed to Ambria with a team of Bogga's enforcers. The group successfully managed to obtain the crystals, but as the two groups began fighting amongst themselves about who would get the reward, Jedi trainee Nomi Sunrider attacked the criminals and killed C'borp."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 4000 BBY, C'borp was the chief gunner on the Marauder Starjacker, a pirate vessel owned and operated by a man named Finhead Stonebone. Once while serving on the Marauder Starjacker, C'borp took his position at the laser turrets to fire on an Ithullian ore hauler commanded by Captain Gruna, which contained ore that Stonebone wanted to siphon. The ore hauler was defended by Dreebo, an enforcer under the employ of Stonebone's rival, the crime lord Bogga the Hutt. Although Dreebo quickly moved to attack the Marauder Starjacker, every shot he fired missed; taking the opportunity, C'borp fired back at Dreebo, destroying the enforcer's starfighter. He then turned his attention to the ore hauler, destroying the rest of its defenses and allowing the rest of Stonebone's men to start siphoning the ore. After his attack on the ore hauler, C'borp reported his success to Stonebone, who received him with praise. However, Stonebone's crew was surprised by the appearance of the Enforcer One, Bogga's flagship. Bogga's enforcers captured the Marauder Starjacker and took its crew, including C'borp, prisoner."}, {"tag": "p", "text": "C'borp and his pirate associates were brought to Bogga's estate on the Stenness system moon of Vo Dasha in chains. Although Stonebone's crew were at first threatened, they were offered a chance at exoneration by Bogga if they performed a task for him. The Hutt wanted the group to journey to the desolate planet of Ambria to retrieve a shipment of valuable Adegan crystals that had eluded his grasp some time prior. Stonebone agreed on behalf of the team, and his associates, including C'borp, went to Ambria alongside several of Bogga's top enforcers. Due to knowledge gained from a previous excursion to Ambria, Bogga and his crew knew that the Adegan crystals were being kept at the compound of Jedi Master Thon, Bogga's sworn enemy. Descending out of their skiffs, C'borp and the crew were met by Thon, who did not attack as he was expected to, surprising the pirates. Instead, Thon allowed himself to be taken prisoner by the group. However, infighting soon surfaced between Bogga's enforcers and Stonebone's pirates, as the enforcers refused to share the profit from the crystals. The verbal sparring escalated into a brawl between the two sides, with C'borp taking on Fnnbu, the enforcer who had discovered the crystals in the compound. Little did they know, their violent emotions were being influenced through the Force by Nomi Sunrider, a young Jedi trainee under the tutelage of Thon. While the two sides were distracted by the physical confrontation, Sunrider sprang into action, igniting her lightsaber and attacking them. C'borp was helpless to stop Sunrider, and was slain. Sunrider was ultimately able to drive them off, and the surviving team members were forced to flee Ambria without the crystals."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "C'borp was willing to perform illegal activities, as he found work as the gunner on Stonebone's pirate vessel and assisted in illegal ore siphoning, taking pride in a job well done. He was also very competent at his job, and found his work met with praise by Stonebone. On Ambria, C'borp was easily influenced by mental Force powers, being manipulated by Sunrider to behave violently."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "C'borp first appeared in Tales of the Jedi: The Saga of Nomi Sunrider, a story arc of the Tales of the Jedi comic book series, written by Tom Veitch and released over late 1993 and early 1994. C'borp appeared in the second and third of the arc's three issues. In these appearances, C'borp was illustrated by David Roach."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}