{"url": "C-136", "categories": ["Category:Legends articles", "Category:Ground-based ion cannons", "Category:Speizoc Arms products"], "nodes": [{"tag": "h1", "text": "C-136"}, {"tag": "p", "text": "The C-136 was a land-based ion cannon produced by Speizoc Arms."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The C-136 was designed for line-of-sight attacks, and was employed against large targets such as cities, although it was also deployed against other created structures such as bridges and dams, and even low-orbit stationary targets. The C-136 had a maximum range of twenty-five thousand meters with a one hundred meter blast radius. The extreme long-range of the weapon allowed it to be deployed and fired from behind friendly lines."}, {"tag": "p", "text": "The weapon took between six and twelve hours to assemble and set-up. A crew of seven operated the weapon, including a forward observer for accurate long range fire. Connected to a power generator, the C-136 had enough ammunition for forty shots but the power drain was enormous. The magnitude of the energy blast from the cannon produced atmospheric effects along the path of the weapon discharge which caused ionization hazards."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the C-136 was designed, deflector shield technology was less refined than during the Galactic Civil War, meaning that siege warfare and bombardment strategies were effective against shielded ground targets such as cities. To facilitate these strategies, Speizoc Arms produced the C-136, commonly referred to as the \"Grandfather Gun.\" Possibly the largest land-based ion cannon ever built, a refinement of the ion cannon technology built to penetrate the primitive urban shields in use at the time of its design."}, {"tag": "p", "text": "As shield technology improved, the C-136 was obsoleted as its effectiveness was reduced. However, the weapon was still employed on frontier planets which employed less advanced technology and where ground-based artillery options were still a practical and valid form of warfare. Its effectiveness also had a psychological impact on the target, as the weapon offered the threat of pin-point long-range destruction. It was also effective on planets where atmospheric or gravitic conditions prevented the use of airborne or orbital weapons."}, {"tag": "p", "text": "By the time of the Galactic Civil War, the C-136 was no longer in production and could only be bought used for around 100,000 credits a piece. As a result, replacement parts were hard to find. Trioculus once fired a C-136 at a dam in the Grand Kessel River Valley, flooding a rebellious settlement below."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}