{"url": "A-3DO", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Masculine programming", "Category:Mechanics", "Category:Musicians", "Category:Protocol droids", "Category:Service droids"], "nodes": [{"tag": "h1", "text": "A-3DO"}, {"tag": "p", "text": "A-3DO, known colloquially as ThreeDee, was a Duwani Mechanical Products 3DO protocol/service droid, specializing in the maintenance of starships as well as performing myriad domestic functions. After being purchased by Jedi trainee Andur Sunrider, ThreeDee traveled with Sunrider, his wife Nomi, and their their daughter Vima, serving them and maintaining Andur's starship, the Lightside Explorer. The droid saw many mishaps on his adventures with the Sunriders, from being held hostage—in an event that saw the death of his owner, Andur—to having his arm blown off by mercenaries in the employ of Bogga the Hutt. After Andur's death, ThreeDee accompanied Nomi to the planet Ambria, where she trained in the ways of the Force under the Jedi Master Thon and repelled several more attacks by the Hutt's minions."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "With the Sunriders"}, {"tag": "p", "text": "A-3DO, a 3DO protocol/service droid, was manufactured by Duwani Mechanical Products, and was later purchased for 1,500 credits by the Jedi trainee Andur Sunrider of Darada. The droid traveled with Sunrider and his wife Nomi in Andur's starship, the Lightside Explorer, where his primary function was to keep the ship in working order. A-3DO performed several other functions, including the playing of music on a stringed instrument, but most often spent his time doting on the Sunriders and worrying about their safety when not maintaining the ship. The droid considered the Sunriders to be his family, and insisted upon being referred to in the more colloquial form, ThreeDee."}, {"tag": "p", "text": "When Andur received an invitation from the Jedi Master Chamma—a friend of Andur's grandfather, Jev Sunrider—to study the Force under him on the planet H'ratth, ThreeDee accompanied his masters. While on the planet, Nomi bore a daughter, Vima. Soon thereafter, Master Chamma decided that he could no longer instruct Andur in the the ways of the Jedi, and instructed his apprentice to travel to Ambria, in the Stenness system, where he would complete his training under the Tchuukthai Jedi Master, Thon. Chamma gave Andur several Adegan crystals—quite useful in the construction of lightsabers—to bring to his new master as gifts. Before they could leave, however, A-3DO had to replace an ion exciter in order to render the Lightside Explorer's hyperdrive functional. Once again, A-3DO found himself traveling to another planet with the Sunriders."}, {"tag": "p", "text": "The Lightside Explorer arrived in the Stenness system, where it stopped at a hyperspace terminal for service and customs inspection. ThreeDee and the Sunriders left the ship to have a look around the station, but soon came under attack by thugs in Bogga the Hutt's gang, who had overheard Andur mentioning the Adegan crystals to Nomi; the brutes took the droid hostage as a diversion. When Andur confronted the gang members, one of them threw a gorm-worm at Andur; the small creature bit Sunrider, killing him almost instantly. Nomi, quite unexpectedly, took up her fallen husband's lightsaber, defending Vima and ThreeDee, and drove off the bandits, much to ThreeDee's gratitude. The trio quickly made their escape in the Lightside Explorer and set course for Ambria."}, {"tag": "h3", "text": "Ambria"}, {"tag": "p", "text": "Arriving on Ambria, Nomi decided to set forth on her own with Vima in search of Master Thon, leaving ThreeDee behind to look after the ship. A while later, A-3DO was surprised by Bogga the Hutt's mercenaries, who blasted their way into the Lightside Explorer. The Hutt gangster, who coveted the Adegan crystals, had decided to take his sail barge and gang to Ambria in pursuit of Nomi. ThreeDee's arm was blown off, and the ship ransacked."}, {"tag": "p", "text": "After yet another confrontation with Bogga's thugs at the home of Thon, whom she had finally located, Nomi returned to the vessel with the Jedi Oss Wilum, another of Thon's students, and retrieved A-3DO. Wilum took it upon himself to repair the damage done to ThreeDee, but was delayed for several months due to a shortage of parts. Eventually Wilum completed his work on the droid—as well as his training under Thon—and left Ambria to join a group of Jedi Knights who were sent to help quell the Freedon Nadd Uprising on the planet Onderon."}, {"tag": "p", "text": "A-3DO remained with his mistress and Vima on Ambria as Nomi Sunrider continued her training under Master Thon, assisting her and helping to look after Vima. Eventually, more of Bogga's minions, this time led by a pirate named Finhead Stonebone, came in search of the Adegan crystals, but Nomi and Thon ultimately managed to drive them off, due primarily to Nomi's natural talent with battle meditation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The droids of ThreeDee's time period required constant maintenance and recharging to remain functional. As a 3DO Protocol/Service Droid, A-3DO was possessed of a variety of skills, from programming to bureaucracy and cultures. He served in more domestic functions, as well, such as serving the Sunriders with refreshments, looking after Vima, and playing a mandolin-like musical instrument. Although he possessed some ability with languages, the droid could only produce sound in the range of Human speech, and had similar limitations with his auditory and visual sensors."}, {"tag": "p", "text": "The most important of ThreeDee's functions, however, was the maintenance of the Lightside Explorer. He sat in the copilot's seat, communicating with the vessel's systems—such as the sensors, the navigation computer, and the hyperdrive—frequently, relating any pertinent information to the pilot. In addition to his communication abilities, ThreeDee was built with advanced fine-motor circuitry and servos to facilitate ease of repair work. However, he possessed no knowledge of droid maintenance, and was unable to repair himself, as was evidenced when Oss Wilum had to put ThreeDee back together following the attack by Bogga's henchmen."}, {"tag": "p", "text": "ThreeDee was a very doting and conscientious droid, frequently worrying about his safety, as well as that of his charges. On Ambria, he quickly sensed the danger of blowing sand, hinting to Nomi that perhaps he should not accompany her on her journey through the desert. After being attacked, ThreeDee was particularly sensitive, asking Oss Wilum about his repairs, worried that he might be rendered inoperable. However, the droid looked after Nomi and Vima, as well, alerting them to a path of escape during an attack by pirates."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A-3DO was created by writer Tom Veitch for the comic series Tales of the Jedi, and appeared in all three issues of the sub-series The Saga of Nomi Sunrider. His role as the family droid was featured in the first issue ThreeDee appeared in, but in the two subsequent issues his role was more cursory and supportive in nature. The Tales of the Jedi Companion, a West End Games roleplaying game supplement written by George R. Strayton, gave ThreeDee's history and function considerably more depth. The character of A-3DO was voiced by Chris Phillips in the HighBridge Audio adaptation of the comics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}