{"url": "C-9979_landing_craft", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:C-9979 landing craft", "Category:Confederacy of Independent Systems starship classes", "Category:Trade Federation starship classes", "Category:Troop transport classes"], "nodes": [{"tag": "h1", "text": "C-9979 landing craft"}, {"tag": "p", "text": "The C-9979 landing craft, also known as the Trade Federation landing ship, was a heavy transport starship used by the Trade Federation, and later the Confederacy of Independent Systems. The Trade Federation armaments committee chose the ship. The C-9979 was an elegantly designed transport manufactured by Haor Chall Engineering Corporation and was controlled by a central computer. One C-9979 could subjugate an entire susceptible world."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "During the Invasion of Naboo, the Trade Federation used many of these landing craft to deploy their Droid Army, including Multi-Troop Transports."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "As part of the Separatist effort to recruit the planet Toydaria to their side, Sith apprentice Asajj Ventress and a full battalion of droids arrived on the planet in a C-9979 landing craft."}, {"tag": "p", "text": "When the Republic invaded the planet Ryloth, the ship was used at some point during the battle, with a few of them being destroyed."}, {"tag": "p", "text": "During the Battle of Mon Cala, a C-9979 landing craft was used to transport four Hydroid Medusas under its wings from the planet Karkaris."}, {"tag": "p", "text": "After Mother Talzin used Nightsister magick on the Sith Lord Count Dooku, he sent the General Grievous and the Separatist Droid Army to Dathomir to eradicate the Nightsisters. C-9979 landing craft deployed a large compliment of droids as well as defoliator tanks, which slaughtered all of the Nightsisters save for Talzin and Ventress, who had been outcast by her former master Dooku, who escaped the battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars Encyclopedia of Starfighters and Other Vehicles establishes that the C-9979 landing craft is 210 meters in length. The databank and the StarWars.com Encyclopedia had previously established that the wingspan was 149 meters. Visibly, the wingspan appears to be greater than the bow-to-stern length of the vessel. It is unclear whether the Encyclopedia of Starfighters and Other Vehicles refers to wingspan or bow-to-stern length."}, {"tag": "p", "text": "The Encyclopedia of Starfighters and Other Vehicles also establishes that the C-9979 landing craft can carry up to 361 battle droids, while the 2019 source book Rise of the Separatists establishes that the C-9979 can carry up to 2,500 battle droids and droidekas, depending on its configuration. As Rise of the Separatists is the more recent source, the article makes the assumption that the newer source is correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}