{"url": "C-ROC_Gozanti-class_light_cruiser", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:C-ROC Gozanti-class cruisers", "Category:Confederacy of Independent Systems starship classes", "Category:InterGalactic Banking Clan starship classes"], "nodes": [{"tag": "h1", "text": "C-ROC Gozanti-class light cruiser"}, {"tag": "p", "text": "The C-ROC Gozanti-class light cruiser, also known as the C-ROC Carrier Ship, with the shipyard custom configuration known as the Configuration-Restored Operational Capacity, was an official modified version of the Gozanti-class cruiser that was manufactured by the Corellian Engineering Corporation prominently during the Clone Wars and the Imperial Era."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Manufacturing"}, {"tag": "p", "text": "The C-ROC Gozanti-class light cruiser, also referred to as the C-ROC carrier ship, was a class of light cruiser that was equipped with the Configuration-Restored Operational Capacity upgrade, a shipyard custom configuration of the standard civilian Gozanti-class cruiser, which was manufactured by Corellian Engineering Corporation and meant to be a midlife upgrade program to reinvigorate the Gozanti-class and create more profitability."}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "The C-ROC was designed to be bulkier than the original Gozanti-class, and had many cosmetic and mechanical modifications, which diverged it from the standard cruiser. The C-ROC's hull design was considered softer and more rounded, in contrast to the bold and square-shouldered lines of the standard cruiser. The front two-thirds of the C-ROC's hull had a sloping, bell-shaped cross-section that was narrow on the dorsal side, while it flared out below the midship line. Although the C-ROC was not as large as a true cruiser, its tight corridors and compartments could make for intense close-quarters combat, and had consumables capacity for two months."}, {"tag": "p", "text": "The design of the new hull provided more protection as the slope of the hull deflected blasts more efficiently than the original Gozanti-class. Outrigger cargo trays that were designed to carry modular cargo containers similar to the GR-75 medium transport replaced the two cranked delta wings. The outriggers, in concert with the complete redesign of the ship's interior, provided the C-ROC with exceptional hauling capability with the cost of the ship's combat and fleet support utility. The outrigger racks, along with the extended prow, and the bridge module softened the original cruiser's sharp design edges."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "Although surpassing or meeting the original Gozanti-class cruiser in most metrics, the C-ROC was deprived of military-grade sensors and ordnance launchers, though it was equipped with a medium-range sensor. With the original cruiser was originally kept slow to appease to Galactic Republic inspectors who were concerned the ship could be used for piracy, the C-ROC was equipped with three additional sublight engine turbines that brought its top speed back in line with other starships of the same category. The two original Girodyne Ter58 ion engines were replaced with five Novaldex JV-80 ion drives that were newer and faster. Two each were placed on port and starboard, while another was mounted on the dorsal spar."}, {"tag": "p", "text": "The C-ROC's improved speed suited pirates and mercenary groups, and having the significant space for customization, thick armor and rough-terrain landing capabilities, the ship was considered all-purpose. Additionally, the cargo space could be modified to hold hundreds of mercenaries, a higher capacity than the standard twenty passengers. The C-ROC could be crewed by a single pilot, but had a typical crew of twelve. The crew included one pilot and one co-pilot, one engineer, one communications and sensor operator, two loadmasters, and six gunners."}, {"tag": "p", "text": "Despite the C-ROC's armor and deflector shields remaining untouched from the original design, the weapons loadout was drastically reduced to two recractable quad laser cannon turrets—one ventral and one dorsal—which provided good defense against smaller ships, such as patrol boats and starfighters. Additionally, each of the C-ROC's broad flanks were equipped with a two retractable twin heavy laser cannons that kept pirates at bay. Although it did not carry the original firepower of the original design, the C-ROC was capable of defending itself from most foreseeable threats. Many owners routinely relied on the C-ROC's speed rather than its firepower to escape danger. The C-ROC could be modified to carry four M3-A Scyk interceptors in its ventral hull."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The C-ROC Gozanti-class light cruiser was designed more towards transport and cargo responsibilities than for military combat. With its heavy armor, large crew complement, and passenger accommodations, the C-ROC could serve as a mobile base."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Based off of the standard Gozanti-class cruiser that had seen service by the time of the Invasion of Naboo in 32 BBY, the C-ROC Gozanti-class light cruiser entered service by the time of the Clone Wars, (22 BBY—19 BBY) seeing usage by privateers in service to the Confederacy of Independent Systems that fought against the Galactic Republic, with one being active on the planet Zygerria being equipped with blue Confederacy livery. In addition to the C-ROC Gozanti-class being used by the Confederacy, the Confederacy also used another modified Gozanti-class cruiser."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "With the rise of the Galactic Empire following the Clone Wars, Corellian Engineering Corporation initially offered the upgraded class of C-ROC Gozanti-class light cruisers to the Imperial Navy as an armed long-range transport, with the benefits of common spare parts and crew training to that of the Gozanti-class Assault Carrier. Despite the pitch by the CEC lobbyists, they failed to convince the top leaders of the Imperial Navy and the self-defending logistics platform. It was rejected as it was inappropriate to the Imperial Navy's Order of Battle since it did not adhere with the Galactic Empire's new logistics doctrine of large, escorted transport ships such as the Eta-class supply barge. As such, the CEC turned to civilian buyers, with the aim being high-risk transportation companies."}, {"tag": "p", "text": "The C-ROC then became popular in the Outer Rim Territories, as the C-ROC's capabilities were greatly satisfactory to pirates and smugglers. This resulted in C-ROC Gozanti-class light cruisers fighting against Imperial Gozanti-class cruisers during the Imperial Era as criminal groups challenged Imperial patrols. While the C-ROC was not considered a wildly successful product, sales of the ship were steady and as such, CEC continued to produce updates and replacements to various systems. With the increased lawlessness in the Outer Rim, many C-ROC cruisers were inducted into service by rebel cells as artificial or substitute capital ships. Though not suited for serving as frontline warships, C-ROCs with a cunning crew were capable enough for dealing with older vessels used by the Imperial Navy to maintain law and order on the fringes of society."}, {"tag": "p", "text": "In 13 BBY, one such ship delivered supplies to the Corellian shipyards on Corellia. By 4 BBY, the C-ROC Gozanti-class cruiser Broken Horn was used by Cikatro Vizago, the criminal leader of the Broken Horn Syndicate. An associate of Vizago, the crime lord Azmorigan, similarly used a C-ROC Gozanti-class freighter, named Merchant One."}, {"tag": "p", "text": "At one point, a C-ROC cruiser was attacked by TIE fighters of the Galactic Empire and used its quick-release cargo locks to dump its cargo. In another instance, a C-ROC light cruiser was near the Ring of Kafrene when a YT-1300 light freighter was chased by Imperial TIE fighters through asteroids. At one time, the InterGalactic Banking Clan used a C-ROC Gozanti-class to ferry a vault of priceless art from one planet to another, and was under heavy escort. Additionally, the C-ROC Gozanti-class light cruiser Kimoliga's Maw served as a pirate ship, and was modified in a way that was similar of the Imperial Gozanti-class cruiser, carrying four M3-A Scyk interceptors. It was considered to be a plague on civilian shipping in the sector it operated in."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The C-ROC Gozanti-class light cruiser first appeared in the Star Wars Rebels episode Star Wars Rebels: Spark of Rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}