{"url": "C._Andrew_Nelson", "categories": ["Category:Real-world articles", "Category:Star Wars: Masters of Teräs Käsi voice actors", "Category:Star Wars: Rebel Assault II: The Hidden Empire voice actors", "Category:Star Wars: X-Wing voice actors", "Category:Animators"], "nodes": [{"tag": "h1", "text": "C. Andrew Nelson"}, {"tag": "p", "text": "Charles Andrew Nelson (born June 22, 1962) is an actor, visual effects artist, animator, and lecturer."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He spent six years at LucasArts Entertainment Company where he was a VFX supervisor and senior artist. Nelson's credits at LucasArts include Star Wars: Dark Forces, Star Wars: Rebel Assault II: The Hidden Empire, Star Wars: Shadows of the Empire, Star Wars: Jedi Knight: Dark Forces II, Curse of Monkey Island, Star Wars: Masters of Teräs Käsi, Star Wars: Rogue Squadron, and Indiana Jones and the Infernal Machine."}, {"tag": "p", "text": "Nelson left LucasArts in 1998 to join the effects team at ILM where he was a compositor, rotoscoper, matte painter, and texture artist. His work at ILM includes Star Wars: Episode I The Phantom Menace, Galaxy Quest, The Adventures of Rocky & Bullwinkle, The Perfect Storm, Jurassic Park III, The Time Machine, and Star Wars: Episode II Attack of the Clones. After the completion of Episode II, Nelson joined the full-time faculty of the Academy of Art University and served as the school's Visual Effects Director from 2002 to 2004. He currently consults for various leading effects and animation studios. He is a member of the Visual Effects Society."}, {"tag": "p", "text": "Nelson is most notable for having played the role of Darth Vader for Lucasfilm since 1994. His appearances as Vader include LucasArts' Star Wars: Dark Forces and Star Wars: Rebel Assault II: The Hidden Empire games, the Special Edition of Star Wars: Episode V The Empire Strikes Back, commercials, print ads, TV shows, and magazine covers. When artists at LucasArts had difficulty animating Vader's movements for the cutscenes in Dark Forces, Nelson was filmed as Vader. The artists then performed touch-up painting and processing to the footage to make it match the earlier hand-animated shots in the game."}, {"tag": "p", "text": "It is a common misunderstanding on part of the media that during Star Wars: Rebel Assault II: The Hidden Empire production Vader was played by David Prowse reprising his legendary role. As Nelson says, he feels it's a great honor that some mistook him for Prowse. In many appearances that C. Andrew Nelson made as Darth Vader, his voice was dubbed over by voice-actor Scott Lawrence who plays Vader as a voice-actor in a dozen Star Wars video games. Nelson also voiced Luke Skywalker for a cutscene of the Star Wars: X-Wing expansion pack, being the first actor to have ever officially played both Darth Vader and Luke Skywalker."}, {"tag": "p", "text": "He continues to act in feature films, television, commercials, and voice-over."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}