{"url": "C1-series_astromech_droid", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Droid stubs", "Category:Astromech droid models", "Category:C1-series astromech droids"], "nodes": [{"tag": "h1", "text": "C1-series astromech droid"}, {"tag": "p", "text": "The C1-series astromech droid was a model of C-series astromech droid manufactured by Industrial Automaton. They were used during the Clone Wars and the reign of the Galactic Empire, though by then they were considered antiques and had passed their manufacturer's expiry date a few decades prior. They had three mechanical arms to manipulate objects with, and featured an electrical arc welder.CH-33P, named \"Cheep\" served on board a Venator class Star Destroyer during Order 66 and assisted Ahsoka Tano in capturing Commander Rex aswell as helping both escape the ship before being executed by clones. C1-10P, a droid nicknamed \"Chopper\" who served on the Ghost, was a C1 model, although he was mismatched after years of repairs and patch jobs.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Italian translation of the original Star Wars trilogy all astromech droids are called \"C1 units\", translating the original English \"overusage\" of \"R2 unit\" for \"astromech droid\". R2-D2, who may be the most famous astromech droid of all, is called \"C1-P8\" in the Italian translation.[source?] Rumors are that, as the Italian pronounciation of \"C1-P8\" rhymes with the name of the comedian duo Gianni and Pinotto, which George Lucas seemed to like, it was Lucas himself who chose this translation, although it is probable that the resemblance with the names, especially \"Pinotto\", was made to parallel the resemblance of \"Artoo\" to \"Arthur\". Despite this, it is unknown how much influence this had in the naming of the \"canonical\" C1 series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}