{"url": "C2-N2_(Hero_of_Tython)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Droids of the Jedi Order", "Category:Hero of Tython's crew", "Category:Hollis-series steward droids"], "nodes": [{"tag": "h1", "text": "C2-N2  (Hero of Tython)"}, {"tag": "p", "text": "C2-N2, also known as Seetoo Enntoo, was a Hollis-series steward droid produced by Automata Galactica and owned by the Jedi Knight known as the Hero of Tython. Assigned to the Hero's Defender-class light corvette as its steward in 3643 BBY, C2-N2 was responsible for maintaining the starship and ensuring that the Jedi's crew remained comfortable. He served aboard the Defender-class corvette for the next several years, caring for the Jedi and the ship's crew as they participated in the Galactic War between the Galactic Republic and the Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "C2-N2, also known Seetoo Enntoo, was a Hollis-series steward droid, a third-degree service droid produced by Automata Galactica. In 3643 BBY, C2-N2 was assigned to a Defender-class light corvette that was requisitioned by General Var Suthra of the Republic Military. C2-N2 and the ship were delivered to Docking Bay 74 of the Coruscant Spaceport on the Galactic Republic's capital planet of Coruscant, where he greeted the starship's new owner—a young Jedi Knight who had been tasked with foiling the Sith Lord Darth Angral's attempts to destroy the Republic with stolen superweapons. The droid explained his role as steward of the Jedi's new ship and gave the Knight a tour of the vessel. Over the next two years, Seetoo continued to serve as the ship's steward as the Knight, who became known as the Hero of Tython, served the Jedi Order and the Galactic Republic during the renewed war between the Galactic Republic and the Sith Empire."}, {"tag": "p", "text": "He frequently made adjustments to the ship's systems and accommodations, such as adding extra padding to the vessel's seat cushions, reprogramming the corvette's food synthesizer, programming the air circulators to simulate the smell of Alderaanian nectar or other pleasing aromas, and dusting the crew's quarters. He was frequently the subject of jokes between the astromech droid T7-O1 and the Knight's Padawan, Kira Carsen. The droid also ensured that the other members of the Hero's crew—Archiban Kimble, Lord Scourge, and Sergeant Fideltin Rusk—were comfortable aboard the starship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A golden-plated droid with yellow photoreceptors and masculine programming, C2-N2 was programmed with knowledge in a wide range of subjects, including engineering, nutrition, and technical maintenance. Seetoo was also capable of modifying other technology, performing long-range surveillance, diplomacy, custodial duties, and a number of other tasks. He prided himself on his attention to detail, and his primary programming was to provide for his master's creature comforts and to maintain the vessel he was assigned to."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hero of Tython's C2-N2 is the steward character on the Defender-class light corvette belonging to the Jedi Knight class in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011. Beyond the initial conversation with the player after they receive their ship, the Knight has no interaction with the droid other than ambient conversation, though they can send C2-N2 on crew skill missions to gather resources or to construct items."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}