{"url": "C4-ST", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Diplomats", "Category:Members of the Smuggler's crew", "Category:Vendor droids"], "nodes": [{"tag": "h1", "text": "C4-ST"}, {"tag": "p", "text": "C4-ST was a protocol droid who operated as a merchant in the Anoat sector during its blockade by the Galactic Empire in the aftermath of the Battle of Endor. The droid joined the crew of the Smuggler, a young thief active in the sector during the Iron Blockade, who dispatched C4-ST on a variety of missions throughout the Anoat sector."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The protocol droid C4-ST was in service during the Galactic Civil War. It operated as a merchant in the Outer Rim Territories' Anoat sector while it was locked down under the Iron Blockade, the Galactic Empire's attempt to prevent the sector's populace from learning of the crushing Imperial defeat at the hands of the Alliance to Restore the Republic in the Battle of Endor."}, {"tag": "p", "text": "Several months into the blockade, C4-ST joined the crew of the Smuggler, a young thief who smuggled goods in the Anoat, and was dispatched on a variety of missions throughout the sector."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "C4-ST was a protocol droid with red plating and yellow photoreceptors. With a background in diplomacy and a preference for stealth, it was watchful and observant, and could read sentients as well as it could understand their languages. These abilities allowed the droid to skillfully negotiate any type of contract, agreement, or arrangement."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "C4-ST was created for the canon mobile game Star Wars: Uprising, which was developed by Kabam for iOS and Android platforms, and released on September 10, 2015. The droid serves as a unique five-star crew member available through the Premium Crane, an in-game shop where the player, as the Smuggler, can spend chromium, an in-game currency, in exchange for randomized loot ranging from three stars or better in quality."}, {"tag": "p", "text": "As such, the player does not need to acquire C4-ST as a crew member. However, this article assumes 100 percent game completion of Star Wars: Uprising, which means the Smuggler acquired C4-ST as a member of the crew and dispatched the droid on Crew Runs. While on Crew Runs, C4-ST provides a bonus to all Diplomatic and Stealth Crew on the same Run and is strong on Credit Finder Runs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}