{"url": "CC-01/425", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "CC-01/425"}, {"tag": "p", "text": "CC-01/425 was a clone advisor who served in the Grand Army of the Republic during the Clone Wars. He often found himself tasked with overseeing the operations of Delta Squad, a unit of elite clone commandos that included RC-1138, RC-1140, RC-1207, and RC-1262, with whom he would communicate via hologram and the squad's in-helmet comlinks. The advisor helped them through the Battle of Geonosis in the year 22 BBY, during which Delta Squad killed the Geonosian lieutenant Sun Fac, disabled an underground droid factory, and raided a Lucrehulk-class Core Ship. In the second year of the war, CC-01/425 guided Delta Squad throughout its investigation of the Acclamator-class assault ship Prosecutor in the Chaykin Cluster. In 19 BBY, he also oversaw Delta Squad's opening reconnaissance of the Battle of Kashyyyk, during which it freed the Wookiee Chieftain Tarfful from Separatist-backed Trandoshan slavers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The beginning of the war"}, {"tag": "p", "text": "A clone of the Mandalorian bounty hunter Jango Fett, CC-01/425 was born on the planet Kamino for service in the Grand Army of the Republic. CC-01/425 worked as a clone advisor, a soldier who assisted other clone troopers during their missions. When the Clone Wars broke out between the Galactic Republic and the Confederacy of Independent Systems on the Outer Rim world of Geonosis in the year 22 BBY, CC-01/425 was charged with overseeing the clone commandos of the elite unit Delta Squad—comprised of RC-1138, RC-1140, RC-1207, and RC-1262, nicknamed \"Boss,\" \"Fixer,\" \"Sev,\" and \"Scorch,\" respectively—from a location away from the battlefield during the ensuing conflict. Keeping in communication with the commandos via a hologram projector that the squad members carried in the built-in comlinks of their helmets, CC-01/425 guided Boss to meet up with the other members of the squad at separate rendezvous points across Geonosis. Along the way, CC-01/425 helped Boss become accustomed to his equipment and the combat zone around him, as it was Boss's first time out on a real battlefield."}, {"tag": "p", "text": "After Boss met up with his comrades, CC-01/425 tasked Delta Squad with the assassination of Geonosian Archduke Poggle the Lesser's chief lieutenant, Sun Fac. As Delta Squad searched for Fac, CC-01/425 kept them up to date on the surrounding environment, in the form of traps or enemies in the area. Facing off against battle droids along the way, Delta Squad caught up with Fac, and Sev shot his fleeing Nantex-class starfighter. Fac was killed in the ensuing crash. Upon its completion of the task, the squad was informed by CC-01/425 of the next part of its mission: disabling an underground droid factory on the world. After Delta Squad infiltrated the foundry, CC-01/425 searched the building's schematics for a weak point, which he eventually found to be two power conduits that, if destroyed, would disable the facility. Delta Squad succeeded in eliminating the conduits and disabling the factory, and CC-01/425 then sent the commandos to raid a Lucrehulk-class Core Ship and gain launch codes that would prevent an entire fleet of Separatist Core Ships in orbit of Geonosis from escaping the battle. Through the continued help and guidance of CC-01/425, Delta Squad retrieved the launch codes and destroyed the Core Ship. Shortly after, the Republic won the battle raging on Geonosis."}, {"tag": "h3", "text": "Mission to the Prosecutor"}, {"tag": "p", "text": "Three hundred and sixty-seven days into the Clone Wars, in 21 BBY, CC-01/425 handled Delta Squad's investigation of the Republic Acclamator-class assault ship Prosecutor, which had reappeared in the Chaykin Cluster following a two-week-long disappearance after being tasked with defending trade routes in the Corellian sector. CC-01/425 informed Delta Squad of its mission to secure the starship and recover the flight records from the Prosecutor's data cores. However, once the commandos were aboard the Prosecutor, communication between CC-01/425 and the commandos was cut off due to heavy static. Contact was reestablished after the squad reached the warship's bridge and destroyed a Separatist jamming device."}, {"tag": "p", "text": "CC-01/425 scanned the derelict capital ship and found a Trandoshan dropship in one of the Prosecutor's hangars. Delta Squad informed him that they had indeed encountered numerous Trandoshan mercenaries already, so CC-01/425 ordered the clones to repel the enemy. Delta Squad discovered, however, that the Trandoshans were being backed by elements of the Confederacy, which arrived to reinforce their allies with an armed Lucrehulk-class battleship. While Delta Squad fought the large amount of battle droids deployed by the battleship, CC-01/425 performed scans of the ship and found that it contained great amounts of information that would be vital to the Republic. CC-01/425 then called for Republic assistance, and he eventually got through to Republic Navy Captain Talbot, in command of the Acclamator-class assault ship Arrestor, who came to their aid. In conjunction with Delta Squad's efforts to reactivate the Prosecutor's turbolaser battery, Arrestor destroyed the Lucrehulk-class Droid Control Ship that was controlling the droids and ensured Delta Squad's mission was a success."}, {"tag": "h3", "text": "Operation on Kashyyyk"}, {"tag": "p", "text": "In the final year of the war, CC-01/425 informed Delta Squad that they would be inserted onto the planet Kashyyyk to locate the Wookiee Chieftain Tarfful, who had been captured by Separatist-backed Trandoshan slavers. Once on the surface of Kashyyyk, CC-01/425 guided the squad through the forests to a Trandoshan slave camp, where Delta Squad freed several other imprisoned Wookiees. When the Separatist General Grievous's personal starfighter, Soulless One, was sighted nearby, CC-01/425 ordered Delta Squad to visually confirm the cyborg General's presence. Grievous was on Kashyyyk to take Tarfful into custody, but when Delta Squad struck, he fled the planet aboard the Soulless One, leaving his IG-100 MagnaGuards to battle Delta Squad. The commandos defeated the MagnaGuards, and as they moved onward, CC-01/425 oversaw their strike on another Trandoshan compound in the Wroshyr tree forests of Kashyyyk."}, {"tag": "p", "text": "However, his authority and operational tasking duties were later superseded by Jedi General Etain Tur-Mukan's arrival on Kashyyyk. Meanwhile, Delta Squad was forced to leave behind its main sniper, Sev—who had come under attack and been cut off from the rest of the squad—as Tur-Mukan was drawn away by the Wookiee Enacca to be taken to the galactic capital planet Coruscant. The job of settling the angered and upset Delta Squad members, who were distraught about leaving Sev behind, fell to CC-01/425. He tried to help Delta Squad by relaying a message from Jedi Grand Master Yoda through the squad's hologram projector, before reassigning Delta Squad with a new objective as the Battle of Kashyyyk truly began. Although the Battle of Kashyyyk ended with a Republic victory, Order 66, a contingency order for all of the Republic's clone troopers to immediately execute their Jedi Generals, was issued during the battle and resulted in many deaths."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "CC-01/425 was a clone advisor who stood 1.83 meters tall. He was a levelheaded soldier and expert tactician, proving a valuable asset to Delta Squad on every mission with which he was tasked to assist it. Remaining calm and collected, CC-01/425 was often able to find efficient, if often improvised, solutions to problems facing Delta Squad in the field. He frequently helped Delta Squad find new ways around obstacles and enemies that would come up unexpectedly. CC-01/425 possessed a dry and cynical sense of humor. Though he never hassled Delta Squad members Sev or Scorch for their incessant chatter and back-and-forth quips, he demanded that the squad be professional when such conduct was needed. He was also strongly pragmatic, believing that the loss of a single clone commando was acceptable in the scope of successfully completing a major operation. After Delta Squad was forced to leave Sev behind, CC-01/425 tried to help the angered commandos by telling them to get a hold on their emotions."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "CC-01/425 wore Phase I clone trooper armor throughout the war, rather than changing to Phase II clone trooper armor. Even during the Battle of Kashyyyk, when most clone troopers had made the switch to Phase II armor, he still retained his Phase I armor. Like most clone troopers, he had an in-helmet comlink that he used to communicate with Delta Squad. He also had equipment that was capable of calling in Republic support, which is what he did during Delta Squad's mission in the Chaykin Cluster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CC-01/425 first appeared in the LucasArts video game Star Wars: Republic Commando, which was released on March 1, 2005. Despite appearing in a rather prominent role in the game, he was left out of the Republic Commando series of novels by author Karen Traviss. The actions of Delta Squad are only one aspect of the series, but when the novel Order 66 comes to Delta Squad's mission on Kashyyyk, CC-01/425 is still absent from the narrative. His lines during Sev's abandoning are attributed to a different clone character altogether, General Quinlan Vos's Forward Air Controller. This article documents CC-01/425's involvement throughout the Kashyyyk mission as portrayed in the game but favors Order 66's attribution of those few lines, as it is presented in the more recent source."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}