{"url": "CC-10/994", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Articles with conflicting sources", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Clone trooper captains", "Category:Clone trooper commanders"], "nodes": [{"tag": "h1", "text": "CC-10/994"}, {"tag": "p", "text": "CC-10/994, who also went by the nickname \"Grey,\" was a Clone Captain who served in the Grand Army of the Republic during the Clone Wars. Assigned to Jedi General Depa Billaba, he was a Clone Commander in the general's battalion. Surviving the decimation of Depa Billaba's battalion, Grey was reassigned to new battalion, also commanded by Billaba, along with Clone Captain \"Styles.\""}, {"tag": "p", "text": "Captain Grey was stationed on the planet Kaller by the time of Order 66, which he, as a clone trooper, was programmed to obey. As a result, Grey attempted to execute Billaba as a traitor to the Galactic Republic. The general fought back for a time, but was ultimately surrounded and killed by Grey's clone troopers."}, {"tag": "p", "text": "In the aftermath of the Galactic Empire's rise to power, Grey and Styles hunted Billaba's Padawan, Caleb Dume, whom they eventually captured on Lahn. Grey began to see the truth, realizing that his programming had suppressed his free will during Order 66. He ultimately sacrificed himself to save Dume from the clones who were trying to kill the young Jedi."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "CC-10/994, nicknamed \"Grey,\" was a Clone Captain in the Grand Army of the Republic, an army of genetically identical clone troopers who were engineered from the template of Jango Fett. Captain Grey was a capable soldier, serving under Jedi General Depa Billaba throughout the Clone Wars. He was a commander in Depa Billaba's battalion, which took severe casualties during a battle on Haruun Kal. The survivors, including Grey and Clone Captain \"Styles,\" formed a second battalion under Billaba's command."}, {"tag": "h4", "text": "Recon on Kardoa"}, {"tag": "p", "text": "Billaba's new battalion had their first mission on the planet Kardoa, along with Billaba's new Padawan, Jedi Commander Caleb Dume. The battalion's mission was to check for a Separatist presence on the planet. While they searched the canyon of Kardoa, an explosion went off, killing many clones. A force of B1-series battle droids began to attack, and Billaba's battalion fought back. Grey survived the following battle, and with the help of the rest of the clones and Billaba, the Separatists retreated from Kardoa."}, {"tag": "h4", "text": "Third Battle of Mygeeto"}, {"tag": "p", "text": "After the successful end to their mission on Kardoa, the battalion was assigned to Mygeeto, where they were to reinforce Republic forces at the Third Battle of Mygeeto. Commander Grey deployed most of his battalion before Billaba and Dume arrived, and then went off to fight himself. When Billaba, Dume, Styles, and CT-1157 \"Stance\" were trapped on a platform by battle droids, Grey turned back to rescue them, but arrived to find that they had already been assisted by Fenn Rau and Skull Squadron. They returned to their base camp, while most of their battalion remained out in the field. The camp was attacked by General Grievous, Colonel Coburn Sear, and a number of battle droids, who killed Stance. Grey called for reinforcements as he and Styles attempted to fight back against the droids. They encountered Dume, who had defeated Colonel Sear, and then provided assistance to Billaba, who was dueling Grievous. They forced Grievous to escape, and later held a funeral for Stance. Not long after the end of their mission, they were given another assignment on the planet Kaller."}, {"tag": "h4", "text": "Battle on Kaller"}, {"tag": "p", "text": "Kaller was one of the last battlefronts of the Clone Wars. Captain Grey was stationed on this world shortly before the end of the conflict. Billaba led Grey and his brothers into battle, aiming to take the compound General Kleeve was using as his base of operations. They would eventually chase Kleeve and his forces away, although the Kallerans did not see much difference between Republic rule as opposed to the Separatists. Grey stood up for Billaba when Janus Kasmir made a snide comment about the Jedi, but Billaba graciously decided to set up camp outside of the compound, leaving the Kallerans alone. Grey and his men would make a fire and relax as Billaba took Dume out to train."}, {"tag": "p", "text": "Later, the clone troopers led by Grey and General Billaba engaged the Separatist forces on Kaller after the Separatists began to launch their own offensive after their failure at the Battle of Coruscant. Though reinforced by All Terrain Tactical Enforcers, the clones fought defensively against a battalion of B1-series battle droids as well as DSD1 dwarf spider droid and Armored Assault Tanks. Caleb Dume had yet to return with reinforcements, leading Grey to wonder if the Jedi Commander would return in time, to which Billaba assured the captain that her Padawan would. When Dume arrived, Grey was dismayed to learn that the commander brought only five clones. The squad, which Grey recognized as the experimental unit Clone Force 99 destroyed the Separatist units without the assistance of Grey's troops. Grey used a pair of electrobinoculars to observe the clone commandos as they wiped out the droid battalion, and admitted to being impressed by them."}, {"tag": "p", "text": "The squad's leader, \"Hunter,\" advised Billaba to order a counterattack as another Separatist battalion was moving in their direction. Grey told the commando that only his Jedi General had the authority to give orders, however, Billaba agreed with Hunter's recommendation and instructed Grey to launch the counterattack. As Dume and the members of Clone Force 99 headed in the direction of the Separatists, Grey received a holographic communication from the Sith Lord Darth Sidious, whom he recognized as Supreme Chancellor Sheev Palpatine, commanding him to execute Order 66."}, {"tag": "p", "text": "His secret programming activated, Captain Grey turned against his Jedi General, attempting to execute her as an enemy of the Republic. Billaba raised her lightsaber in time to deflect the captain's blaster fire. She then disarmed him by cutting his blaster in half before kicking him away. However, the clone troopers under Grey's command had also turned against Billaba, complying with Order 66. Though Dume tried to return to help his Jedi Master, Billaba urged him to run before the clones killed her. The members of Clone Force 99 were confused by the situation; Hunter instructed CT-1409 \"Echo\" to speak with Captain Grey while he and CT-9904 \"Crosshair\" searched for the Padawan."}, {"tag": "p", "text": "Witnessing Billaba's death by Grey's troopers led Clone Force 99 to speculate how they could have complied with the order to terminate their general, despite serving her loyally for years. \"Tech\" was well aware that the Kaminoans conditioned the clone troopers to be obedient, and therefore deduced that their compliance with Order 66 was indicative of their programming."}, {"tag": "h3", "text": "After Order 66"}, {"tag": "p", "text": "The Clone Wars, which Grey helped to end, concluded shortly after the captain received Order 66 while stationed on Kaller. In the following days, Grey and Styles continued to search for Dume in Plateau City, but lost his trail when he radically changed his appearance and started working alongside Janus Kasmir. After a job gone wrong which resulted in the pair getting caught, Kasmir immediately sold out the fact that Dume was secretly the escaped Jedi Padawan, and seemingly traded him to Gamut Key's security in exchange for his escape. Grey and Styles were able to confirm for Key that the boy was, in fact, the Padawan they had been hunting for, and they ordered the Kallerans to hold him in a cell until they could leave the Imperial Garrison at Plateau City to take him in and execute him for treason. Shortly after their message, however, Kasmir, who had a change of heart, broke Dume out of his cell using an IG-RM droid, escaping Kaller."}, {"tag": "p", "text": "Grey and Styles maintained a close pursuit, always remaining just one step behind Dume and his new friend. They finally caught up to the pair when they landed on Lahn, where they intended to trade stolen spice for a second ship. As Dume was negotiating with their buyer, the former Separatist general Kleeve, Grey ambushed Kasmir and held him at gunpoint, demanding to know where the Padawan had gone. While Kasmir claimed that he had ditched him as soon as they left Kaller, Grey remained skeptical. Dume overheard the exchange, and fled to allow Kasmir's statement to seem truthful. Grey arrested Kasmir anyway, and began a search across Lahn for Dume's whereabouts. Captain Styles managed to ambush Dume, who had gone with Kleeve to the Farbrooke's Hope, the ship Kasmir planned to acquire, and knocked Dume unconscious."}, {"tag": "p", "text": "Styles reported back to Grey, informing him of Dume's capture. While transporting Caleb back to Kaller aboard their Gozanti-class cruiser, Grey and Styles were finally faced with the task of putting an end to their former friend. Dume pleaded for his life, reminding the clones how much they used to look up to Master Billaba and suggesting to them that it was Palpatine, not the Jedi, who had betrayed the Republic when he created the Empire. While he was unable to convince the clones not to kill him, he did manage to buy enough time for Kasmir and Kleeve to catch up to the Imperial freighter in an attempt to rescue him. Dume Force pushed the clones and remotely activated the airlock, escaping into the vacuum outside. After managing to return to the bridge of the freighter, Grey began to have doubts about following Order 66. Despite having sufficient firepower to destroy both the Kasmiri and Farbrooke's Hope, Grey could not help but wonder why the clones had so blindly obeyed Order 66. He brought his concerns up with Styles, who disagreed, seeing the Jedi only as traitors to the Empire. When his protestations went unanswered, Grey decided to shoot the ship's controls with his blaster rifle, crippling the freighter and allowing Kasmir and Kleeve to destroy it with both Grey and Styles on board."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grey was a veteran, battle-scarred clone. He was very loyal to his men as well as Billaba until the onset of Order 66. However, as Grey and his men continued the pursuit of Padawan Dume, he was able to overpower his programming and came to understand his actions during Order 66 and sacrificed himself and his men to help Dume escape."}, {"tag": "p", "text": "While Grey was impressed by the skills of Clone Force 99, he rejected Hunter's advice about launching a counterattack against the Separatists, insisting that only his Jedi General had the authority to give orders to him. Grey was also pessimistic during the battle on Kaller. He felt that defeat was certain when he learned that Dume had returned with only five clones to reinforce them. His sense of loyalty to Billaba ended when he received the command to execute Order 66, which he silently obeyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CC-10/994 first appeared in the 2015 comic Kanan 1, written by Greg Weisman and illustrated by Pepe Larraz. In the premiere episode of Star Wars: The Bad Batch, \"Aftermath,\" CC-10/994 is voiced by Dee Bradley Baker."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "In Star Wars: Kanan, Grey is portrayed as a Clone Commander who wears red markings on his armor instead of green markings as seen in \"Aftermath,\" where he is a Clone Captain. Both media also portray the execution of Order 66 differently; in Kanan, Commander Grey receives the order at a camping ground at night, shortly after a skirmish with the Separatists. Additionally, Grey replies \"Yes, my Lord.\" In \"Aftermath,\" he is silent while carrying out Order 66."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}