{"url": "CC-1010/Legends", "categories": ["Category:Legends articles", "Category:Clone trooper commanders", "Category:Coruscant Guard troopers"], "nodes": [{"tag": "h1", "text": "CC-1010"}, {"tag": "p", "text": "CC-1010, nicknamed \"Fox,\" was a clone trooper commander of the Grand Army of the Republic and commanded the Coruscant Guard during the Clone Wars. Around 22 BBY, Fox assisted Senator Padmé Amidala in the capture of Ziro Desilijic Tiure, the mastermind who kidnapped Rotta and uncle to Jabba Desilijic Tiure, during the Raid on Ziro the Hutt's Coruscant club. Later, Fox led a squad of the Shock troopers in confronting the bounty hunter Cad Bane, who was escaping from the Republic Executive Building after taking a group of senators hostage and using them to secure Ziro the Hutt's liberation from the Republic Judiciary Central Detention Center, however, Fox was forced to let the bounty hunters escape along with Ziro. Fox later was assigned to guard Republic Judiciary Central Detention Center and Republic military base. Fox participated in the chase for fugitive Padawan Ahsoka Tano who was blamed by Dark Jedi Barriss Offee in the murder of Letta Turmond."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Commander"}, {"tag": "p", "text": "Clone Commander 1010 earned the nickname \"Fox\" during his training. Like all Clone troopers, Fox was born on Kamino as a clone trooper to serve the Grand Army of the Republic. As the Clone Wars began, Fox was assigned to lead the Coruscant Guard, an elite clone trooper unit tasked with serving as peace-keepers on the Galactic Republic capital of Coruscant. Fox carried two DC-17 hand blasters in holsters on the sides of his kama. and a DC-15A blaster rifle and also a DC-15S He wore the distinctive crimson color of the Coruscant Guard on his armor and a variation of the Galactic Senate Emblem. Fox wore a visor and antennas similar to fellow Clone Commander,CC-2224, nicknamed \"Cody\"."}, {"tag": "h3", "text": "Arrest of Ziro the Hutt"}, {"tag": "p", "text": "Around 22 BBY, as Ziro Desilijic Tiure captured Senator Padmé Amidala in his palace, her Protocol droid C-3PO called Fox for help, prompting Fox to accompany C-3PO to Ziro's palace with his squad of Coruscant Guard troopers. As Ziro prepared to execute Amidala, Fox's rescue team blasted their way into the palace, destroying the B1-Series battle droids guarding the entrance in the process. In the ensuing commotion, Amidala freed herself and destroyed the IG-86 droid guarding her with an appropriated E-5 blaster rifle. After the near-miss of a blaster bolt, Ziro slithered off his dais, making for the exit. Taking cover from return fire, Fox and his troops made quick work of the remaining security droids. After eliminating battle droids, Fox and Amidala arrested Ziro the Hutt and taken him to the Republic Judiciary Central Detention Center."}, {"tag": "p", "text": "At some point during the Clone Wars, Count Dooku put a hefty live bounty on all of the senators of the Galactic Senate. Because almost all of the senators resided on Coruscant, it fell under the jurisdiction of Fox and his men to protect them. One such incident occurred when Fox learned from his spies that a Trandoshan was planning to kidnap senator Shayla Paige-Tarkin. Fox found the hunter but had been ordered to keep him alive. The Trandoshan took off upon seeing Fox, but the Commander knew the streets of Coruscant better than most. He contacted his fellow guards and quickly cornered the bounty hunter. With no where else to go, the Trandoshan blasted his way to the roof of a nearby building with a jetpack. Still intent on capturing the Trandoshan, Fox used his grappling hook to climb up the side of that same building. On the roof, Fox's advances were met with more hostile fire, but was able to shoot the blaster out of the would-be kidnapper's hand and talked him into surrendering."}, {"tag": "h3", "text": "Commanding the Coruscant Guard"}, {"tag": "p", "text": "Around 22 BBY, a group of Bounty hunters led by Cad Bane infiltrated the Republic Executive Building and taken Senators hostage to force Supreme Chancellor Palpatine to free Ziro the Hutt from the Republic Judiciary Central Detention Center. As the bounty hunters escaping, Fox led a squad of Shock troopers confronting Bane and his team. Through Fox, Palpatine contacted Bane and ordered him to surrender, but the bounty hunter revealed the still-trapped senators, and in order to keep them safe, Palpatine reluctantly relinquished his attempts to apprehend Bane. Fox ordered his clone forces to stand down, allowing Bane and his team to leave."}, {"tag": "p", "text": "In 21 BBY, Fox went to Juma 9 with Obi-Wan Kenobi and Threepwood to free the station from the Separatists battle droids, in which he played a crucial role in. Fox was later on duty in the lower levels of Coruscant, checking I.D. when he ran into a group of cleaning droids who, unknown to him, were really demolition droids sent to attack the planet by General Grievous. The falsified work order was authentic enough to fool the commander, who let the droids pass and even pointed the droid impostors in the direction of the power generators when they were going the wrong way."}, {"tag": "p", "text": "Later in 21 BBY, Fox oversaw security at the Republic Judiciary Central Detention Center when Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, brought in the Bounty hunter Rako Hardeen, who had been arrested after allegedly killing Jedi Master Obi-Wan Kenobi. Fox and his fellow clone trooper brought Hardeen into the prison, unaware that it was actually Kenobi, who was deep undercover to infiltrate a plot to kidnap Supreme Chancellor Palpatine."}, {"tag": "h3", "text": "Hunt for Ahsoka Tano"}, {"tag": "p", "text": "Fox was later put in charge of the security of a large military complex where, many prisoners including Confederate leaders were being held. Letta Turmond, who had arranged an explosion in the Jedi Temple, requested to see Ahsoka Tano. Soon after the two were left alone in the cell, a shock trooper alerted Fox to the alarming footage on the security cameras; it appeared as though Tano was choking the prisoner, however, it was Barriss Offee, who force-chocked Turmond. Quickly Fox and two other troopers rushed into the cell, only to find Tano, apparently distraught, bending over Turmond's dead body. Fox commented that he didn't blame Ahsoka for wanting revenge on a traitor, but all the same he had to put her under arrest."}, {"tag": "p", "text": "Soon after, Anakin Skywalker, Tano's master, requested to see her. Fox had orders from Admiral Tarkin that nobody was allowed to see her, however, and had two shock troopers activate electrostaffs, threatening to enforce the Admiral's orders with force, before Skywalker would leave. The following day, Tano escaped from prison and had apparently slain at least three clones in order to do so. Fox told his men to shoot to kill, a command that was immediately belayed by General Skywalker, who insisted they capture her alive. After a lengthy chase around the complex, Tano escaped into the large pipe system leading to the Coruscant underworld. Fox and his men quickly gave pursuit, but arrived too late to keep the Padawan from jumping onto a passing ship and escaping."}, {"tag": "h3", "text": "Hunting the Fugitive Clone"}, {"tag": "p", "text": "Fox was later tasked with hunting down rogue clone CT-5555 \"Fives\" after the latter had discovered a massive conspiracy in the Republic government and had been subsequently framed and vilified."}, {"tag": "p", "text": "When one of his probes spotted Fives heading into a warehouse, Fox took a squad of shock troopers and headed there. He managed to sneak in undetected, whereupon he found Fives agitatedly trying to convince a trapped General Skywalker and Captain Rex of the enormity of the conspiracy. Fox and his squad rushed the rogue clone, who prepared to fire on them in his desperation. Without hesitating, Fox fired one accurate, lethal shot into Fives' chest. Fox's squad took off their helmets as they mourned the dead trooper. It is speculated that Fox was taken so aback by the event that he left the warehouse to mourn the loss of his brother."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Commander of the Coruscant Guard, Fox led the Shock troopers guarding the Republic capital. Like every other clone trooper in the Guard, Fox was bound by honor and duty to protect and serve the Supreme Chancellor and the members of the Galactic Senate. His loyalty to the Jedi was less, and he would not hesitate to carry out an assigned task regardless of what they thought. As such, he was also quick to accept whatever his superiors told him without a second thought, as demonstrated when he was prepared to kill Jedi fugitive Ahsoka Tano and did kill rogue ARC trooper Fives, both of whom were actually innocent of the crimes they were being hunted for."}, {"tag": "p", "text": "Utterly fearless, Fox was always the first to lead the charge into battle, even in the most perilous combat situations. His exemplary performance has made him one of the most highly decorated soldiers in the Republic army."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Fox's Phase I armor featured crimson markings and his chest featured a variation of the Galactic Senate emblem. Fox's helmet was similar to Commander CC-2224, though it sported a dark red color. Known to wear a kama with two blaster holsters, Fox also carried and used a DC-15A blaster rifle, DC-15S, DC-17 hand blasters and a grappling hook. He later made the jump to Phase II armor alongside his unit. His Phase II armor was very different from the other Shock Troopers. It was mostly red with scarce areas of white. He wore a visor much like Commander Cody's and sported a flashlight and antennae on his helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fox should not be confused with a Clone Sergeant of the same name stationed on Coruscant during the raid of the Jedi Temple."}, {"tag": "p", "text": "Fox was first mentioned in toy lines for the The Clone Wars film."}, {"tag": "p", "text": "In the Swedish translation of Star Wars: The Clone Wars: The Visual Guide, Fox's rank is stated to be Överste. Överste is the Swedish word for Colonel."}, {"tag": "p", "text": "Fox, like all other clones, was voiced by Dee Bradley Baker in the Clone Wars TV series. In the junior novelization of The Clone Wars film, a picture of another shock trooper is incorrectly attributed as Fox. Fox's appearance in \"Hostage Crisis\" was not verified until its later Decoded re-airing. In addition, his appearance in Phase II armor in the episode \"Deception\" was not verified until the release of a Hasbro figure confirming his remodeled look."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}