{"url": "CC-1138/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Clone Marshal Commanders"], "nodes": [{"tag": "h1", "text": "CC-1138"}, {"tag": "p", "text": "CC-1138, nicknamed \"Bacara,\" was a clone marshal commander who served in the Grand Army of the Republic. Cloned on the planet Kamino, Bacara received initial training from the former Concord Dawn Journeyman Protector Cort Davin, who taught the young clone the ideals and traditions of the Journeyman Protectors. At some point, the Clone Commander learned space and land-based fighting. Bacara was given command of the Galactic Marines, which was attached to the 4th Sector Army. Following the battle that triggered the Clone Wars in 22 BBY, Bacara fought alongside several Jedi, including Jedi Master and Council member Ki-Adi-Mundi. During the war, Bacara and the Galactic Marines earned a reputation as one of the most feared Republic units. Taking a break from the battlefield, Bacara joined ARC trooper Alpha-17's ARC program and graduated early."}, {"tag": "p", "text": "In 21 BBY, the Clone Commander joined Jedi General Mundi on the snow-covered world Mygeeto to fight against Confederate troops. As a result of the Mygeeto campaign, the relationship between the Republic and InterGalactic Banking Clan grew worse, and Bacara and Mundi found themselves locked in a three year conflict. Bacara did, however, leave Mygeeto for sometime and fought in a brutal Outer Rim Sieges battle on New Bornalex. With Mundi and the Marines, Bacara returned to Mygeeto in the final year of the war. On Mygeeto, the 501st Legion, with the help of Bacara's Marines, executed Hammertong, a top secret project given to the 501st by Supreme Chancellor Palpatine. As the fighting intensified, Palpatine ordered Bacara to execute Order 66—a contingency order which labeled Jedi as traitors and enemies of the Republic—via comlink. Complying with the order, which also called for the extermination of Jedi, Bacara and the Marines fired on Mundi and killed the Jedi Master."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Independent clone"}, {"tag": "p", "text": "Clone Commander 1138, nicknamed Bacara, was a clone of the Mandalorian bounty hunter Jango Fett. His initial training came from a former Concord Dawn Journeyman Protector by the name of Cort Davin. Among the many topics that Davin imparted upon Bacara were the traditions, history, and language of the Journeyman Protectors. Bacara grew to associate with the traditions which Davin taught him, and began to think of himself as a man of law and order. However, as a result of this training in the traditions and culture of the Journeyman Protectors, Bacara found it increasingly difficult to communicate in Mando'a. The Clone Commander, who had learned the Concord Dawn dialect of the Journeyman Protectors, would use \"tat\" during his conversations instead of the Mandalorian \"vod\" for brother; these minor differences caused Bacara to develop into a solitary commander. Although different in comparison to his brethren, Bacara had a close friendship with CC-8826, nicknamed \"Neyo.\" Following the introduction of the newly invented BARC speeders, Bacara and Neyo worked together to create military tactics for the speeder bike."}, {"tag": "p", "text": "Sometime after the completion of his clone training, the Clone Commander was given the command of the 21st Nova Corps, also known as the Galactic Marines, a unit of the Grand Army of the Republic's 4th Sector Army. In 22 BBY, the Battle of Geonosis triggered the galaxy-wide conflict known as the Clone Wars. To help defeat the Confederacy of Independent Systems and its military forces, Bacara fought alongside several Jedi, including Jedi Master and Council member Ki-Adi-Mundi. Bacara would develop a friendship with Mundi, and the Cerean Jedi Master even regarded the Clone Commander's behavior and aggressive tactics \"as a thing of prodigy.\" However, at some point during the war, Bacara allowed himself to leave the battlefield and enter a training regimen run by the ARC trooper Alpha-17, nicknamed \"Alpha.\" The program was designed to bring out the independence and tactical genius which was dormant within all clones. The Clone Commander graduated early from Alpha's program."}, {"tag": "p", "text": "By 21 BBY, the Republic had issues dealing with the InterGalactic Banking Clan. To counter their threat, Bacara, Mundi and the Galactic Marines were sent to the IBC world Mygeeto. On the snow-covered world, the group met with Jedi Knight Rivi-Anu and fought against an entrenched Separatist enemy who had managed to cripple a Republic Venator-class Star Destroyer. The Star Destroyer threatened to crash on the battlefield and destroy the entire area—Rivi Anu, however, used the Force to keep the damaged ship aloft just enough to allow Ki-Adi-Mundi, Bacara, and the other Republic forces to retreat to relative safety. Once her allies had made it to safety, Anu allowed the Star Destroyer to fall, which killed her in the ensuing explosion."}, {"tag": "p", "text": "As a result of the fighting on Mygeeto, the Republic's relationship with the InterGalactic Banking Clan worsened. The fight for Mygeeto eventually degenerated into an extended campaign of urban fighting amid the massive ruins of the Mygeeto cityscape. During the push against the Separatist forces, Bacara led his Galactic Marines in the taking of the city Jygat. This battle saw Bacara order the use of glacier-busters, a type of weapon whose seismic shocks could be felt from a far distance. Along with Ki-Adi-Mundi, Bacara led the Galactic Marines through fierce firefights from house to house, slowly beginning to push the Separatist defenders back."}, {"tag": "p", "text": "Months following Mygeeto, Bacara and the Galactic Marines fought in the brutal Battle of New Bornalex during the Outer Rim Sieges. The battle witnessed Bacara lead the Marines in fighting against the combined Separatist–Mandalorian defensive force; the Marines were also using a prototype strength-enhancing armor during the fighting. Mid-way through the battle, the weapons of the experimental armor failed, leaving Bacara and his Marines with only their hands to fight. Refusing to retreat, Bacara ordered his forces to continue the fight—using their enhanced strength, the Marines literally tore apart the B2 super battle droids which they were fighting, eventually decimating the enemy forces. Due to the fierce fighting that they demonstrated on New Bornalex, the Galactic Marines earned a ferocious reputation—one which Bacara was extremely proud of."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "When Bacara and Mundi returned to Mygeeto as of 19 BBY, the fighting for Mygeeto's capital city worsened. In an effort to slow the Republic advance, the Separatists used their enormous tri-droids to lay waste to the cities. The Republic, likewise, used their artillery pieces to hammer the enemy, but managed to only aid in pounding the landscape into rubble. As a result of the incessant artillery bombardments from both sides, the skies of Mygeeto were a constantly dark gray ash which was carried by the icy winds across the planet. To aid the Marines, several detachments of the 501st Legion were sent to the icy world in the execution of Project Hammertong, a top-secret mission aimed at acquiring a power crystal for a secret super-weapon on behalf of Supreme Chancellor Palpatine."}, {"tag": "p", "text": "After Mundi ordered his troops to push against the Separatists, Bacara received Order 66 via an encrypted channel directly from Palpatine—Order 66 effectively labeled Ki-Adi-Mundi, along with the rest of the Jedi, as traitors and enemies of the Republic. Even though he had a grudging respect for Ki-Adi-Mundi and the other Jedi, Bacara's ultimate loyalty lay with Palpatine and the Republic, and he only hesitated a brief moment before complying with the order from his supreme commander. As the General led the Marines in a charge against the Separatists, Bacara and the surrounding troopers stopped, raised their rifles, and gunned down the bewildered Jedi in a hail of blaster fire. Bacara was later glad that he had killed the Jedi Master, as he considered the Jedi to have been traitors for trying to overthrow the government."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Due to his training by the ex-Journeyman Protector Cort Davin, Bacara received a different upbringing than the vast majority of his clone brothers. Learning the traditions, history, and language of the Protectors, Bacara came to see himself not only as a soldier, but also as a lawman as prescribed by the traditions which Davin had taught him. As a result, his learning of the language of Concord Dawn alienated him from many of his fellow clones, who often chose to speak in Mando'a. This caused him to become an independent individual who was often viewed as a loner by other clones."}, {"tag": "p", "text": "Bacara was an extremely efficient clone commander, and exceeded at his natural job as a soldier bred for war. The talents that he exhibited early on in the Clone Wars allowed for him to be selected as one of only a hundred clone troopers for specialized ARC training. Under the direction of Alpha-17, Bacara excelled at the ARC training regimen that allowed the clones to express their individuality. His ARC training enhanced his naturally aggressive tendencies, and honed Bacara into an even more finely tuned machine of war. His training and aggressiveness came to a point when he was given Order 66—even though he held a grudging respect for Ki-Adi-Mundi, his discipline and training took over, and he executed the Jedi General mercilessly after hesitating for a brief moment."}, {"tag": "p", "text": "Bacara's new-found individuality spread quickly throughout the upper echelon of the Galactic Marines. Being one of the most independent and outspoken of the ARC commanders, Bacara expected nothing but the best from the soldiers under his command. Wanting only the best to serve in the Galactic Marines, Bacara would not hesitate to transfer to another unit whose troopers failed to meet his high expectations. Excellent training fostered camaraderie, and camaraderie fostered attention to detail—when soldiers developed a fraternal bond with those they served with, they often chose to take extra measures to ensure their fellow soldiers survived. Bacara used Alpha-17's training program as a guide, and drilled the Galactic Marines into an elite unit, which was often called upon to act as a quick reaction force anywhere within the galaxy. Bacara's dedication to his troops, combined with his aggressive tactics, earned the clone the admiration of his leader, the Jedi Ki-Adi-Mundi."}, {"tag": "p", "text": "Following his completion of Alpha-17's ARC program, Bacara instituted his own tough training program for the soldiers under his command. Under his leadership and direction, the Galactic Marines were eventually trained into a highly efficient, and elite, quick reaction force. His leadership was again demonstrated on the world of New Bornalex which saw a fierce battle erupt against the Separatist forces and the Galactic Marines under Bacara's command. During the battle the Marines found that their prototype weapons had malfunctioned, and were left with only their suit-enhanced strength to fight with. Refusing to surrender or retreat, Bacara issued the order to advance, knowing full well that that order may have resulted in the destruction of the soldiers under his command. Bacara and the Marines, however, demonstrated their bravery and dedication by fighting and destroying the enemy droids with only their hands."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Part of the Galactic Marines, Bacara participated in fierce fighting campaigns, such as the Battle of New Bornalex. During the battle, Bacara and his unit wore experimental strength-enhancing armor. Despite the prototype armor's malfunction during the battle, the defective armor allowed Bacara to engage B2 super battle droids in hand-to-hand combat. After New Bornalex, Bacara began to sport Phase II clone trooper armor, which he utilized on Mygeeto. Because of Mygeeto's weather conditions, the Clone Commander's helmet featured blizzard protection side plates, and his armor's leggings had kneecap armor. During the early days of the Battle of Mygeeto, Bacara sported a white macrobinocular on his helmet, a utility belt, and wore an ammunition pouch bandolier. Later, Bacara added an anti-blast kama, and a pauldron, to his Phase II armor set. His kama and pauldron sported maroon-colored decorations. Bacara carried a DC-15A blaster rifle and a DC-15S blaster carbine in battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though Bacara's numerical designation of 1138 is not mentioned in the film, it can be seen within the script for Star Wars: Episode III Revenge of the Sith where he is identified as Commander 1138. The number itself is an obvious reference to George Lucas' first feature film, THX 1138. When CC-1138 first appeared in the film Revenge of the Sith, some fans noticed that his helmet and armor closely resembled that of the snowtroopers from Star Wars: Episode V The Empire Strikes Back. The armor that CC-1138 and the other Galactic Marines used in Episode III was, in fact, inspired by the snowtrooper designs of Episode V; building off of this inspiration, CC-1138's helmet's open-facemask design was first developed for clone tank drivers who were meant to have been operating in rough environments. Some concept art had identified as a \"Clone Tank Driver\". It's possible that the clone was originally intended to command a HAVw A6 Juggernaut during the Order 66 montage. In fact, during the shooting scripts, a HAVw A6 Juggernaut was to open fire under Yoda's command post on Kashyyyk."}, {"tag": "p", "text": "A continuity error was established in Republic Commando: True Colors. In the novel, Bacara led his Galactic Marines on Mygeeto in 21 BBY. This was later clarified as the Star Wars Character Encyclopedia confirmed that the Battle of Mygeeto began in 21 BBY. Due to the fact that CC-1138 and Ki-Adi-Mundi appear in several other battles following Mygeeto in 21 BBY, this article assumes that CC-1138 and Mundi return to Mygeeto sometime around the events of Star Wars Episode III: Revenge of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}