{"url": "CC-4477", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Clone trooper lieutenants", "Category:Coruscant Guard troopers"], "nodes": [{"tag": "h1", "text": "CC-4477"}, {"tag": "p", "text": "CC-4477, nicknamed \"Thire,\" was an Imperial clone shock trooper who served as a commander in the Coruscant Guard during the early days of the Galactic Empire. He was originally a soldier of the Galactic Republic, bred from the template of the human bounty hunter Jango Fett to serve alongside genetically identical clone troopers in the Grand Army of the Republic. During the early phase of the Clone Wars, Thire was a Clone Lieutenant in the diplomatic service branch of the Coruscant Guard. In 22 BBY, he accompanied Jedi General Yoda during a mission to Rugosa, where the general sought to form an alliance between King Katuunko and the Republic. The lieutenant was injured by Separatist battle droids, but managed to survive with Yoda's help."}, {"tag": "p", "text": "Thire had achieved the military rank of commander by the time of Order 66 when the clone troopers turned against the Jedi Order. Yoda attempted to overthrow the Sith Lord Darth Sidious, who declared himself Galactic Emperor, and was subsequently hunted by Thire's shock troopers. The Jedi Grand Master managed to elude his pursuers by escaping from the Galactic Senate Building on Coruscant. Afterward, Thire's squad escorted the Emperor to Mustafar where they rescued the Sith apprentice Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Clone Lieutenant CC-4477, also known as \"Thire,\" was a clone shock trooper who served in the Coruscant Guard—an elite group of Grand Army clone troopers tasked with keeping the peace on the Galactic Republic capital world of Coruscant during the Clone Wars. Like all clone troopers, Thire was created on the planet Kamino through the genetic source of the bounty hunter Jango Fett. He went through extensive training to prepare him for his role in the Republic Military."}, {"tag": "h4", "text": "Ambush on Rugosa"}, {"tag": "p", "text": "Following the First Battle of Geonosis in 22 BBY, Jedi General Yoda—the Grand Master of the Jedi Order—journeyed to the moon Rugosa to negotiate an alliance between the Galactic Republic and King Katuunko of Toydaria against the Confederacy of Independent Systems. Lieutenant Thire, along with two other clone guards nicknamed \"Jek\" and \"Rys,\" accompanied Yoda to meet with the leader of the Toydarians."}, {"tag": "p", "text": "In the course of their journey to Rugosa, Separatist warships attacked the Jedi Master and his troopers in an effort to impede the meeting between Yoda and Katuunko. Forced to abandon their Republic frigate, Yoda, Thire, Jek and Rys boarded an escape pod to reach the moon's surface. As a result, the Separatist Droid Army was sent to hunt and eliminate the Republic envoy in order to convince Katuunko to support the Confederacy's cause, setting the stage for Thire's first pitched battle. Using the terrain to their advantage, Thire and his troopers managed to set an ambush for the battle droids, eliminating multiple enemy units in the process. Due to the droids' numerical advantage, however, Yoda ordered the clones to fall back while using his skills to cover their retreat."}, {"tag": "p", "text": "After locating a cave, Yoda gave the clones time to recuperate before continuing the mission. Thire was given a modified DC-15A blaster rifle to use as a makeshift crutch by Yoda, having injured his leg during the skirmish. While taking inventory, the clones saw their dwindling supplies as inefficient against a battalion of droid soldiers. Noticing their low morale, Yoda inspired them to find strength in their individualism and personal traits; to Thire, he advised the clone lieutenant to utilize patience instead of rushing headlong into battle, for the war would be long and survival was key to success. After meditating on the Grand Master's advise, Thire and his men departed the cave to investigate a nearby group of battle droids."}, {"tag": "p", "text": "Yoda decided to confront the droids on his own, ordering the shock troopers to stand by and wait for the right opportunity to support him. While the general single-handedly destroyed numerous units, the clones noticed a group of droideka reinforcements approaching Yoda's position. Using the squad's last rocket, Thire created a rock-slide on the side of the canyon to destroy the droidekas. Having made their general proud, the clones and Yoda continued to the rendezvous point and ultimately prevented the Separatist commander Asajj Ventress from assassinating Katuunko. Impressed by their efforts, the king pledged his loyalty to the Republic. Afterward, Republic reinforcements arrived on Rugosa, allowing Thire to board a Low Altitude Assault Transport/infantry gunship with Yoda, Katuunko, Jek and Rys. Thire then received attention from a medical droid, who used bacta to treat his injured leg."}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "Yoda's words of encouragement on Rugosa, that Thire and his men were all unique despite being clones, stayed with him throughout his service in the Clone Wars. In 19 BBY, as the war drew to an end, Supreme Chancellor Sheev Palpatine—alter ego of the Sith Lord Darth Sidious—declared that all Jedi were traitors and enemies of the state. He therefore commanded the clone army to execute Order 66, a hidden protocol authorizing the extermination of the Jedi. The clone troopers obeyed the chancellor without hesitation, having been secretly programmed to comply with Order 66. As a result, Thire also turned against the Jedi and, like his brothers, soon found himself in service to the Galactic Empire that replaced the Republic."}, {"tag": "p", "text": "Following Yoda's attempt to cut short the reign of the newly-anointed Emperor Palpatine—Darth Sidious—the Coruscant Guard searched the Galactic Senate Building but could find no evidence of Yoda's demise. Thire, now a commander and in command of the Coruscant Guard detachment guarding the Senate Building, was ordered to find Yoda and reported their lack of progress directly to the Emperor and Mas Amedda, who concluded that the Grand Master was still alive. Sidious ordered Thire to resume the search before sensing that his Sith apprentice, Darth Vader, was in danger on Mustafar. Thire's squad escorted the Emperor to recover the critically wounded Vader after Yoda escaped the Imperial shock troopers with Senator Bail Organa's help."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like his clone brothers, Thire was trained to become a capable and loyal soldier of the Galactic Republic. He was also dedicated to completing his assignments; at one time, Thire volunteered to remain behind with his men and confront a battalion of battle droids so that Yoda could move forward with their mission on Rugosa. The Jedi Master declined Thire's offer and instructed his troopers to remove their helmets, an order which Thire followed but did not understand. In his mind, there was nothing physically unique about the clones as they were all genetically identical to each other, having been grown from the same template. Yoda contended that although Thire and his brethren were clones, each of them felt uniquely different to him through the Force. He therefore encouraged them to draw strength from their individual traits, such as patience in Thire's case. Upon defeating the droid battalion, Thire felt that he and his men benefited from the teachings of Yoda."}, {"tag": "p", "text": "After the Clone Wars, Thire complied with an order to hunt Yoda, by now his former ally-turned-fugitive. As with every clone trooper who possessed a control chip in their brain, Thire's programming enabled him to follow Order 66 without question or hesitation, despite the long-standing alliance between the clones and their Jedi leaders. In contrast to his turning against the Jedi, Thire remained obedient to the will of Emperor Palpatine."}, {"tag": "p", "text": "With the exception of certain alterations that affected growth acceleration and enhanced docility, Thire was a physically identical clone of Jango Fett, a human male who stood at 1.83 meters. Like his progenitor, Thire possessed black hair and brown eyes as well."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Thire originally wore the Phase I clone trooper armor, the standard armor worn by all regular clone units at the beginning of the Clone Wars. In addition to featuring the distinctive red patterns that identified him as a member of the Coruscant Guard, Thire customized his armor with a few additional pieces such as a command pauldron and macrobinoculars."}, {"tag": "p", "text": "In addition to two DC-17 hand blasters, Thire wielded the standard DC-15A blaster rifle. During the mission on Rugosa, he also utilized a RPS-6 rocket launcher to protect his Jedi general from a group of droidekas. By the end of the Clone Wars, Thire had switched over to the phase II clone trooper armor and customized it with the Guard's new markings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thire first appeared in Star Wars: Episode III Revenge of the Sith, where he was voiced by Temuera Morrison. Like every clone trooper in the film, he was portrayed through computer-generated imagery. The clone trooper voiceover artist Dee Bradley Baker provided Thire's voice in \"Ambush,\" the first episode in Season One of Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}