{"url": "CC-5052", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Advanced Recon Commandos", "Category:Clone Marshal Commanders", "Category:Clone trooper commanders", "Category:Members of the 327th Star Corps", "Category:Personnel of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "CC-5052"}, {"tag": "p", "text": "CC-5052, nicknamed \"Bly,\" was an Advanced Recon Commando and clone trooper officer who held the military rank of Clone Marshal Commander in the 327th Star Corps of the Grand Army of the Republic during the Clone Wars. A capable leader, Bly enjoyed a close working relationship with his Jedi commanding officer, Jedi General Aayla Secura, who held the dependable commander in high esteem. Together, they fought against the droid armies of the Confederacy of Independent Systems on numerous worlds across the galaxy, including Quell, Maridun, and Felucia."}, {"tag": "p", "text": "Like all clone troopers, Bly was cloned by Kaminoan scientists using the human blood samples provided by the bounty hunter Jango Fett, which ultimately resulted in the creation of an army of genetically-identical soldiers. Within a decade of their inception, Bly and his fellow clones were adopted into the service of the Galactic Republic, leading to the pan-galactic civil war known as the Clone Wars. During the first year of the conflict, Bly and Secura's 327th Star Corps fought alongside the 501st Legion, led by Jedi General Anakin Skywalker and CT-7567 Clone Captain \"Rex,\" in the Battle of Quell. Despite their efforts, the Separatist forces proved victorious, forcing Bly and his comrades to retreat to the Maridun system. While awaiting rescue, they discovered Separatist activity on Maridun and General Lok Durd's plan to test a dangerous weapon on a local village. Though far outnumbered and outgunned by Lok Durd's battle droids, the Jedi, the clones and Bly successfully defended the Lurmens until the arrival of the Republic Navy."}, {"tag": "p", "text": "Bly, Secura and their troops participated in the Outer Rim Sieges during the final months of the Clone Wars. At the Battle of Felucia, Bly was ordered by Supreme Chancellor Sheev Palpatine to execute Order 66—the clone protocol calling for the destruction of the Jedi Order. Though loyal to Secura, his programming compelled him to obey the chancellor without question. Secura, who was always reassured to have Bly by her side, died as a result of being repeatedly shot in the back by the clone troopers that had served under her command for years. Afterward, Palpatine proclaimed himself Emperor of the First Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "CC-5052, later known as \"Bly,\" was a clone of the bounty hunter Jango Fett created on Kamino. At some point prior to his service during the Clone Wars, he was trained by ARC troopers to be one of the first Clone Commanders and became an ARC trooper himself. He commanded the 327th Star Corps and served under Jedi General Aayla Secura."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Battle of Quell"}, {"tag": "p", "text": "During the Clone Wars, Bly and Secura came under attack over the planet Quell by a Separatist fleet. Anakin Skywalker, his Padawan apprentice Ahsoka Tano, and Clone Captain CT-7567 \"Rex\" organized a rescue of Secura and her troops. Storming Secura's Star Destroyer Liberty, Skywalker, Tano, and Rex were able to locate and successfully rescue Secura, Bly, and clone troopers Lucky, Flash, and Cameron. However, Skywalker was seriously injured during the mission and Bly assisted in piloting a frigate to the Resolute in order to get the Jedi appropriate medical attention. While attempting to dock, the frigate's hyperdrive was activated, forcing them to detach from the Resolute. The cruiser then quickly entered hyperspace just moments after detaching. Later as the frigate traveled through hyperspace, Bly was able to notice that the coordinates were set to take them directly into a star. After a successful attempt at avoiding the star, the frigate crash landed on the world of Maridun, and the group were forced to search for help to aid an injured Skywalker."}, {"tag": "p", "text": "Along the way, Bly discovered a signpost indicating that there were sentient lifeforms nearby. Leaving Skywalker and Rex behind, the remainder of the group journeyed across the grasslands to look for someone who might be able to assist the wounded Jedi. However, during their travels, they were viciously attacked by mastiff phalones, and the three other clones accompanying them were killed by the creatures. Shortly afterwards they were able to find a Lurmen village, populated by many Lurmen villagers. At first the village elder, Tee Watt Kaa, refused to help but when he learned of their friend's plight, he allowed his son Wag Too to accompany them back to Skywalker. Bly, Tano and Wag Too headed back to the injured Jedi. Once there, the trio, along with Rex, managed to subdue another Mastiff Phalone that was attempting to kill the Jedi and the Clone Captain. Bly and Rex then carried Skywalker back to the Lurmen village where he rested and was nursed by the Lurmen people."}, {"tag": "h4", "text": "Defense of Maridun"}, {"tag": "p", "text": "Later, Bly was resting in the Lurmen village when he witnessed a couple of Lurmen struggling to pile baskets of food. He helped them with their troubles and they thanked him by giving him a jogan fruit, which he gladly ate. Bly was then informed that a Separatist C-9979 landing craft was setting down near to the village. Along with the rest of the group, he helped Skywalker escape as the battle droids searched the village for contraband. As they watched and hid in the tall grass, a probe droid discovered them, but before it could transfer any information, Bly jammed it's signal. He, Tano and Rex pursued whilst Secura calmly assessed the situation. Deciding it best not the chase the droid, she separated from the others and was able to cut the droid off from the front."}, {"tag": "p", "text": "Not long after, Bly and the others discovered a Separatist outpost on the planet. The group watched as the Separatist General Lok Durd announced his new weapon: the Defoliator Deployment Tank. Accompanying Rex on a scouting mission, the two clones went in for a closer look at the weapon. Unbeknownst to them, however, was that Durd was about to perform a weapons test. The Defoliator fired a shell and, as it descended, the clones were forced to retreat. Rex was able to fire his ascension cable and return to a nearby tree but Bly tripped as he attempted the same. As the shell's blast came towards him, Secura, using a vine, swung down from the tree and lifted Bly to safety just before fire encircled the clone. Bly thus was eternally great full for Secura saving him. The group waited for nightfall, before returning to the outpost. Whilst Secura and Tano opened the front gate, Bly and Rex assisted Skywalker in destroying the battle droids guarding the outpost. The two clones then stole two valuable shield generators and loaded them onto a Separatist shuttle before leaving for the village."}, {"tag": "p", "text": "Upon reaching the Lurmen settlement, Bly and the others warned the villagers about the Defoliator tank and how Durd planned to use their village as the site of his next test. Tee Watt Kaa refused to engage the Separatists in battle, stating that he'd rather die than let his people resort to violence. Despite his objections the group established a defensive wall around the village and the clones raised the shields, protecting the Lurmen from the Defoliator shell's impact. As Durd's battle droids closed in on the Lurmen, Bly and the others stood their ground. The group were able to destroy the battle droids with help from the Lurmen villagers and Skywalker was able to capture Durd. Bly and Rex then took Durd aboard the shuttle as Admiral Wullf Yularen's fleet arrived to extract the group from Maridun."}, {"tag": "h4", "text": "Order 66"}, {"tag": "p", "text": "Eventually Bly became a Clone Marshal Commander. In the final days of the Clone Wars, the 327th Star Corps was sent to the planet of Felucia to track down Separatist Council member Shu Mai. However, when the Supreme Chancellor of the Galactic Republic, Sheev Palpatine, declared the Jedi traitors to the Republic, he issued Order 66 to all clone troopers which forced them to turn on their Jedi superiors. Bly and his men then executed Secura where she stood. Bly then served in the Galactic Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of the bounty hunter Jango Fett, Bly stood at 1.83 meters and had brown eyes with tanned skin. A yellow stripe could be found on each of his cheeks. He was a dependable soldier who always had Aayla Secura's back during the Clone Wars, until he killed her during Order 66."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Clone Wars, Bly wore Phase I clone trooper armor that had been customized with various yellow markings. He also sported a black and yellow singular pauldron. Later on in the war, he adopted the new Phase II clone trooper armor which he also decorated with yellow markings and a slightly different double-sided pauldron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CC-5052 made his first canonical appearance in the 2005 film Star Wars: Episode III Revenge of the Sith, where he was voiced by Temuera Morrison, who voiced all of the other clone troopers in the movie. Much like Aayla Secura, Bly was created by writer John Ostrander for the Star Wars Legends comic book series Star Wars: Republic, where Bly briefly spoke with Aayla Secura."}, {"tag": "p", "text": "In Revenge of the Sith, Bly was intended to feature red markings, but these were changed to yellow to better fit Felucia's imagery. The clone trooper with red markings was established to be Commander Deviss. While Bly's appearance in the final cut is silent, there was a single line attributed to him in the illustrated screenplay of Episode III. The line was \"No,\" said to Secura in response to her question if he thought that there were droids around before blasting her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}