{"url": "CC-8826", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Clone trooper commanders", "Category:Members of the 91st Mobile Reconnaissance Corps", "Category:Personnel of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "CC-8826"}, {"tag": "p", "text": "CC-8826, nicknamed \"Neyo,\" was a clone trooper commander in the Grand Army of the Republic during the Clone Wars. Bred from the genetic template of the human bounty hunter Jango Fett, Neyo served the Galactic Republic as the Clone Commander of the 91st Mobile Reconnaissance Corps."}, {"tag": "p", "text": "As the war with the Confederacy of Independent Systems progressed, the Republic Military formed a special team of droids known as D-Squad. Neyo's DUM-series pit droid, designated WAC-47, was transferred from the 91st to the new squad under Colonel Meebur Gascon's leadership. Later, the commander attended a Republic strategy conference at the Valor space station located in the Carida system. During the conference, a Separatist attack on the station was thwarted by the members of D-Squad, including Neyo's former droid."}, {"tag": "p", "text": "Neyo and his troops were stationed on the Outer Rim world of Saleucami, under the command of Jedi General Stass Allie, in the waning days of the Clone Wars. While patrolling the planet's surface, he received a message from Supreme Chancellor Sheev Palpatine instructing him to execute Order 66. As a clone conditioned to obey the secret protocol, Neyo fired his BARC speeder's laser cannons on the general, adding Allie to the list of Jedi who perished in the initial Great Jedi Purge that preceded the rise of the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "CC-8826 was the designation of a clone trooper who went by the nickname of \"Neyo\" during the Clone Wars. Prior to the pan-galactic conflict, Neyo was created on the extragalactic world of Kamino as part of a clone army grown in secret to serve the Galactic Republic. He was among the first one hundred graduates of an experimental clone commander program."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars, clone troopers became the backbone of the newly-formed Grand Army of the Republic. As one of the clones who were trained to occupy a position of leadership, Commander Neyo served as the commanding officer of the 91st Mobile Reconnaissance Corps. During the war, Neyo possessed a DUM-series pit droid, designated WAC-47, that reported to him while serving with the corps. By 20 BBY, WAC-47 was transferred from Neyo's command to Colonel Meebur Gascon's D-Squad, a team of droids deployed by the Jedi High Council to acquire an encryption module."}, {"tag": "p", "text": "Neyo later attended a strategy conference—along with members of the Jedi Order, Republic officers, and other clone commanders—on the Valor space station in the Carida system. With the Republic Military's high-ranking officials gathered in a single location, the Separatists conspired to wipe them out using a commandeered Venator-class Star Destroyer outfitted with rhydonium. However, the station—along with Neyo and its other occupants—was ultimately saved from destruction due to the intervention of D-Squad."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "By 19 BBY, Neyo and the 91st were stationed on the planet Saleucami during the Outer Rim Sieges. After Saleucami fell to the Republic, Neyo and several others were still on-planet to remove the remaining pockets of resistance. It was by then the Great Jedi Purge commenced with the execution of Order 66—a secret protocol designed to compel the clones to kill Jedi—which was communicated to the clone commanders by Supreme Chancellor Sheev Palpatine. As a result, Jedi General Stass Allie was killed by Neyo and a wingman during a speeder bike patrol when they fired on her speeder, destroying it. The Republic was subsequently reorganized into the Galactic Empire by the self-anointed Emperor Palpatine."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Commander Neyo was a human male clone of Jango Fett, a bounty hunter and the genetic template of the Kaminoan clone army. As such, he inherited the physical traits of his progenitor, including a height of 1.83 meters, black hair, brown eyes and tan skin. During the Clone Wars, he had a facial tattoo printed in Aurebesh writing. As with the rest of the clone army, Neyo was programmed to execute Order 66 upon its authorization by Chancellor Palpatine. Being bred solely for combat, Neyo developed a disturbingly cold personality."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In the later years of the Clone Wars, Neyo was equipped with Phase II clone trooper armor, customized with the markings of the 91st Mobile Reconnaissance Corps. He was in possession of a BARC speeder at the time of Order 66, and therefore used its laser cannons to fire on General Stass Allie."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CC-8826 \"Neyo\" first appeared in the film Star Wars: Episode III Revenge of the Sith. Like all clone troopers in the prequel trilogy, Neyo was portrayed through computer-generated imagery. According to Pablo Hidalgo, the basis of Neyo's CT-number came from his parents' landline phone number."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}