{"url": "CC-8826/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Clone Marshal Commanders", "Category:Members of the 91st Mobile Reconnaissance Corps"], "nodes": [{"tag": "h1", "text": "CC-8826"}, {"tag": "p", "text": "CC-8826, nicknamed \"Neyo,\" was an ARC clone trooper who served in the Grand Army of the Republic during the Clone Wars. Cloned from the template of the Human male bounty hunter Jango Fett on the water world of Kamino, Neyo was a graduate of ARC trooper Alpha-17's elite clone commander training program. Given the rank of clone marshal commander, Neyo became the commanding officer of the 91st Reconnaissance Corps, and in 19 BBY served in the five-month-long siege of the Separatist planet Saleucami. After the forces of the Galactic Republic captured Saleucami, Neyo and his Reconnaissance Corps—under the command of Jedi General Stass Allie—remained behind after the main Republic forces left, being tasked with destroying the last pockets of Separatist resistance."}, {"tag": "p", "text": "During a speeder patrol on Saleucami with General Allie and a fellow trooper designated CT-3423, Neyo received Order 66—a Republic directive that labeled the members of the Jedi Order as enemies of the Republic to be executed—via his comlink from Supreme Chancellor Palpatine. Neyo and 3423 followed through, killing their commanding officer with their speeder bikes' laser cannons. After the execution of Order 66 and the Republic's transformation into the first Galactic Empire, Neyo retained his rank of commander in the new Imperial Army."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and training"}, {"tag": "p", "text": "Unit CC-8826 was a Human male born on the water planet Kamino, cloned from the template of the Mandalorian bounty hunter Jango Fett. After the initiation of the Clone Wars in 22 BBY, in which the Galactic Republic battled the Confederacy of Independent Systems for galactic supremacy, 8826 served as an Advanced Recon Commando clone trooper in the Grand Army of the Republic. 8826's purpose in life, along with those of his clone brothers, was to fight for the Republic, being denied a chance to form his own feelings and ideas."}, {"tag": "p", "text": "8826 was enrolled in ARC trooper Alpha-17's experimental clone trooper commander training program on Kamino, designed to give the Republic a new elite fighting force to combat the Separatist Droid Army. In this training camp, 8826 and the other clone commander cadets began to develop their own personalities, encouraged by Alpha's unorthodox training methods, which allowed for more free thought and expression. CC-8826 himself took the nickname \"Neyo\" and became one of the coldest, most morbid members of his class. Neyo eventually graduated among the first hundred alumni of Alpha's program, being given the rank of clone marshal commander and command over the GAR's 91st Reconnaissance Corps. Neyo also maintained a close relationship with his fellow clone commander, the equally laconic CC-1138—nicknamed \"Bacara\"—who worked with Neyo to develop and test tactics in utilizing the Republic's newly-invented BARC speeders on the battlefield."}, {"tag": "h3", "text": "Missions during the Clone Wars"}, {"tag": "p", "text": "Around 20 BBY, 8826 escorted the pit droid WAC-47—who served under him as part of the 91st Reconnaissance Corps—to a mission briefing in the Jedi Temple's communication center. Due to the droid's faulty hearing, they were late for the debriefing, interrupting the meeting as Jedi Master Mace Windu was going over the mission details with the astromechs M5-BZ, QT-KT, R2-D2, and U9-C4, all of whom comprised the D-Squad, led by the Zilkin Colonel Meebur Gascon. The commander left the meeting after Windu turned it over to Gascon, who disclosed more information regarding their mission to recover a Separatist encryption module."}, {"tag": "p", "text": "CC-8826 later attended the Republic strategy conference aboard the Valor space station in the Carida system in order to discuss the ongoing war effort against the Separatists. The meeting was also attended by Jedi Generals Mace Windu, Obi-Wan Kenobi, and Anakin Skywalker, Admiral Wilhuff Tarkin, and 8826's fellow clone commanders CC-2224 and CC-3636. A Separatist plot to sabotage the conference by ramming a Venator-class Star Destroyer which was ridden with rhydonium into the space station was foiled by Gascon and the D-Squad. One of the members, R2-D2, triggered the bomb before it crashed into the station, saving the lives of the Republic forces on the Valor."}, {"tag": "h3", "text": "Outer Rim Sieges and Order 66"}, {"tag": "p", "text": "In 19 BBY, Neyo and the 91st were assigned to Senior Jedi General Oppo Rancisis's command for the battle over the Separatist-controlled planet Saleucami during the Outer Rim Sieges. Throughout the five-month-long operation, Neyo worked alongside fellow clone commanders Faie and CC-5052, leading the Republic's forces in destroying the Confederacy's Nikto Morgukai warrior cloning facilities on Saleucami. After the defeat of the Separatists, Neyo and his reconnaissance units remained on-world while the majority of the Republic's forces departed the planet. Neyo and his men were placed under the leadership of Jedi General Stass Allie and were tasked with patrolling for any remaining Separatist resistance or Morgukai warriors."}, {"tag": "p", "text": "While patrolling Saleucami's plains by twilight alongside General Allie and trooper CT-3423 on speeders, Neyo received a call through his comlink from Supreme Chancellor Palpatine to execute Order 66, a Republic contingency directive that declared the Jedi Knights to be the Republic's enemies and mandated the destruction of the Jedi Order. After receiving his orders, Neyo motioned for CT-3423 and himself to fall behind Allie's 74-Z speeder bike. With their commanding officer directly in front of them, Neyo and CT-3423 opened fire on Allie with their BARC speeders' laser cannons; with Neyo's final shot, the reactor ignited and sent the Jedi crashing into the ground, killing Allie in the resulting explosion. Following the declaration of Order 66, the Republic was reorganized into the first Galactic Empire by Palpatine, who crowned himself Galactic Emperor. Neyo retained his rank of commander in the new Imperial Army, and later filed a report to Imperial Moff Marcellin Wessel and Emperor Palpatine on the circumstances of Allie's death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A clone bred for nothing beyond fighting and dying for the Republic, CC-8826 was not initially given a chance to develop his own feelings and beliefs. However, in Alpha-17's unconventional clone commander training program, he was provided with the opportunity to form his own personality, taking the nickname \"Neyo\" and forming an attachment with his clone commander colleague Bacara. In the program, Neyo became one of the coldest and most unfeeling clones in his training class, adopting a laconic, almost morbid personality. He became an iconic member of the 91st Reconnaissance Corps, making a considerable reputation for himself. He was a loyal clone trooper, and when Chancellor Palpatine declared Order 66, he adhered to his master's wishes, killing General Stass Allie without a second's hesitation. He was skilled in driving the Republic's BARC speeders, and worked with his friend Commander Bacara to develop revolutionary techniques in utilizing the BARC speeder in combat. Neyo stood at a height of 1.83 meters, and had black hair, brown eyes and tan skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Neyo wore a style of Phase II clone trooper armor similar to that which was used by the deadly clone assassins of the GAR, and wore a command sash on his armor that was designated to ARCs. The armor had four symbols which labeled him a member of the 91st Reconnaissance Corps. The first of these symbols was on his helmet, while the second was located on his chestplate. The third and fourth symbols were located on the armor covering his right bicep and right thigh, respectively."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CC-8826 was first mentioned in Star Wars: Revenge of the Sith: The Visual Dictionary, and first appeared in the film Star Wars: Episode III Revenge of the Sith, released in theaters on May 19, 2005. According to a 2021 tweet from Pablo Hidalgo, the basis for the number \"8826\" came from his parents' landline number. Neyo's background was expanded upon in the articles Guide to the Grand Army of the Republic and Order 66: Destroy All Jedi, which appeared in the eighty-fourth and eighty-seventh issues of Star Wars Insider, respectively. Neyo also appeared in the comic Republic 79, which briefly recollected his execution of Stass Allie. In the comic, he was drawn by Douglas Wheatley. Neyo has also appeared and been referenced in other Star Wars publications, including being given his own entries in The Complete Star Wars Encyclopedia and the Databank on StarWars.com."}, {"tag": "p", "text": "In the video games Star Wars Battlefront: Renegade Squadron and the PSP version of Star Wars Battlefront: Elite Squadron, there is an avatar wearing Neyo's Phase II armor in the games' customization features. Gentle Giant Studios released a collectible miniature bust of the character in 2007. Hasbro released two action figures of CC-8826. The first figure was released in 2007 as part of a Battle Pack, with a figure of another clone trooper and two BARC speeders. The second was released in 2008 as part of the \"Saga Legends\" wave of the 30th Anniversary basic figure collection."}, {"tag": "p", "text": "The digital model used in Revenge of the Sith for Commander Neyo was originally designed to appear during the Battle of Kashyyyk alongside Jedi Grand Master Yoda. Initially, Neyo's digital model was to be a commander of an HAVw A6 Juggernaut, and during the Order 66 scene, he was to order his tank to open fire on the tree-top command center above the battlefield that housed Yoda. This scene was cut, and the digital model was reassigned to a biker clone commander who carried out the execution of Stass Allie on Saleucami. Originally, the Saleucami clone was to be named \"Faie\"—after Art Department Supervisor Fay David—but the use of the Neyo model changed that commander's name. The Faie model was never used in the film, but did later appear in the comic story arc, Star Wars: Republic: Hidden Enemy. Dave Filoni, the Series Supervising Director for the Star Wars: The Clone Wars television series, based Clone Commander CC-3636's new helmet visor on Neyo's helmet from Episode III, for the episode \"Mercy Mission,\" the fifth episode of the series' fourth season. Although not used in the episode \"Secret Weapons,\" Neyo's face was given a design, which featured him sporting a tattoo of his clone designation in Aurebesh, on his left cheek. That facial design was incorporated into Neyo's action figure as part of a December 2013 wave of Hasbro's Star Wars: The Black Series collection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}