{"url": "CE-3K", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:New Republic droids", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "CE-3K"}, {"tag": "p", "text": "CE-3K was a protocol droid serving the New Republic during the Galactic Civil War. In 10 ABY, CE-3K was assigned to Jedi Master Luke Skywalker's quarters on the planet New Alderaan, shortly before the world was attacked by the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stationed on New Alderaan"}, {"tag": "p", "text": "CE-3K was a protocol droid in service of the New Republic by the year 10 ABY. That year, the droid was stationed in the city of New Aldera on the New Republic world of New Alderaan, which served as a hideout for the Solo family—Leia Organa Solo, Han Solo and their children Jacen and Jaina."}, {"tag": "p", "text": "CE-3K accompanied the Solos when they came to greet Jedi Master Luke Skywalker upon his arrival on New Alderaan after a trip to the planet Ossus. The droid, alongside the Solos, was the first to hear from Skywalker that the New Republic Pinnacle Base on the moon Da Soocha V had been destroyed by a particle disintegrator warhead fired from Emperor Palpatine's Galaxy Gun superweapon."}, {"tag": "h3", "text": "Dark Jedi incursion"}, {"tag": "p", "text": "Later that night, CE-3K attended to Skywalker while the Jedi Master was preparing to go to sleep in his quarters. Tired from his journey, Skywalker also intended to have his new prosthetic right hand—given to him by Palpatine during Skywalker's brief stint as the Emperor's apprentice—checked in the morning, as Skywalker was unsatisfied with how it operated. CE-3K responded that it would provide Skywalker with the necessary repair tools in the morning. Taking away Skywalker's robes, the protocol droid left the Jedi's quarters."}, {"tag": "p", "text": "At night, Skywalker became the target of an abduction attempt by a pair of Palpatine's Dark Jedi, Tedryn-Sha and Krdys Mordi, but he was saved by Organa Solo and Jedi trainee Jem Ysanna. The entire New Republic settlement then came under attack by Imperial forces, necessitating complete evacuation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "CE-3K was a protocol droid that was constructed to be humanoid in design. The droid had a dome-shaped cranium and white sensors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CE-3K first appeared in the 1995 comic book Dark Empire II 6, written by Tom Veitch and illustrated by Cam Kennedy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}