{"url": "CH-33P", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:C1-series astromech droids", "Category:Galactic Republic droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "CH-33P"}, {"tag": "p", "text": "CH-33P, nicknamed \"Cheep,\" was a C1-series astromech droid with masculine programming that served the Galactic Republic during the Clone Wars. Following the Siege of Mandalore he, along with fellow astromech droids R7-A7 and RG-G1, assisted the former Jedi Padawan Ahsoka Tano after Order 66 was executed and the Republic's clone troopers turned against the Jedi. Alongside G-G, Cheep was subsequently destroyed by mind-controlled clones while assisting Tano and Clone Commander Rex's escape from the Tribunal."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Assisting Ahsoka"}, {"tag": "p", "text": "Cheep was stationed aboard the Venator-class Star Destroyer Tribunal sent to Mandalore in the final days of the Clone Wars. Upon the Siege of Mandalore's conclusion following the capture of the renegade Sith Lord Maul and the defeat of his Death Watch forces, the 332nd Company returned to the Venator with Maul in custody and accompanied by former Jedi Padawan Ahsoka Tano. Soon after, the starship made the jump into hyperspace to return to Coruscant."}, {"tag": "p", "text": "Following the execution of Order 66, Cheep, along with fellow astromech droids R7-A7 and RG-G1, agreed to assist Tano after she came looking for help upon evading execution by Clone Commander Rex and his men. The droid aided in her apprehension of Rex to remove his inhibitor chip by helping G-G cut him off from his men via trapping him in an intersection with blast doors, before R7 shocked Rex unconscious after Tano revealed herself. Cheep, G-G and R7 then helped carry Rex to the medical bay, where he was operated on."}, {"tag": "h3", "text": "Hangar and destruction"}, {"tag": "p", "text": "Ahsoka, Rex, and the droids fought their way out of the medical bay in order to reach the hangar of the Star Destroyer. Upon reaching the command center of the hangar, Ahsoka ordered Cheep to prepare a shuttle for escape. Meanwhile, R7-A7 opened the doors to Bay 12 and revealed a large amount of clones, led by CT-5597 \"Jesse,\" waiting behind them near the shuttle. As Ahsoka and Rex distracted the clones by faking Ahsoka's capture, the droids snuck through the hangar behind them."}, {"tag": "p", "text": "The droids lowered the platforms in the hangars to assist Ahsoka and Rex in fighting off the clones before Maul entered the hangar, attempting to steal the shuttle and escape. As Ahsoka was distracted after being pushed into the opening created by the lowered platforms, Maul managed to enter the shuttle and fly out of the bay doors. Ahsoka held the shuttle back with the Force for several moments, but ultimately let him go to help defend Rex. As she was holding the shuttle back, R7-A7 was destroyed by a blaster shot."}, {"tag": "p", "text": "Following Maul's escape and R7-A7's destruction, Cheep and G-G continued to raise and lower the lifts in the hangar to allow Ahsoka and Rex to reach a ship in the lower deck. However, after raising the platforms, the clones located the two droids. G-G and Cheep attempted to surrender, but the clones executed them."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Cheep was a C-series astromech droid with grey and yellow plating. Like all C-series droids, Cheep had three sensors and an antenna on his dome, two gripper arms, and a computer interface arm. Cheep was loyal, and volunteered to help Ahsoka Tano when she became a fugitive from the clone troopers after Order 66."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cheep first appeared in the episode \"Shattered\" of Star Wars: The Clone Wars. The droid was voiced by series producer Dave Filoni, who also voiced another C-series droid, Chopper, in Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}