{"url": "A-DSD_advanced_dwarf_spider_droid", "categories": ["Category:Legends articles", "Category:Commerce Guild", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "A-DSD advanced dwarf spider droid"}, {"tag": "p", "text": "The A-DSD advanced dwarf spider droid was a more heavily armed and armored version of the DSD1 dwarf spider droid and the heavy dwarf spider droid, capable of operating in complete darkness."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was built for tough combat on uneven terrain, and was therefore equipped with multiple weapons systems. These included dual target-seeking missiles which could fire once the targeting systems had a lock-on. The A-DSD had plated front legs, the plates being large enough to protect it from any forward attack, unless they were blown off, which was relatively easy to do."}, {"tag": "p", "text": "On top of the droid's frame was a powerful cannon that shot high-energy bolts with explosive power and tremendous range of destruction. The unit did possess one weakness, which was its lone, red, sensor eye which could scan its surroundings for enemy targets. Use of anti-armor weaponry could destroy these units."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Created by Commerce Guild Manufacturers, this droid was originally built to root out miners who refused to pay the trade conglomerate's tariffs. Available commercially for many years before the Battle of Geonosis, it was used in holographic training simulators for clone troopers on Kamino, but was not manufactured in large numbers until some time after the mobilization of the droid armies due to cost overruns."}, {"tag": "p", "text": "Delta Squad faced several of these war droids during their covert missions throughout the Clone Wars, on theaters such as Geonosis and Kashyyyk. Following the execution of the Separatist Council by Darth Sidious's new apprentice, Darth Vader, these units were de-activated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}