{"url": "CK-6_swoop_bike/Legends", "categories": ["Category:Legends articles", "Category:Bespin Motors products", "Category:Galactic Republic repulsorcraft", "Category:Swoops"], "nodes": [{"tag": "h1", "text": "CK-6 swoop bike"}, {"tag": "p", "text": "The CK-6 swoop bike, also known as a Freeco bike, was a type of swoop used by clone cold assault troopers in cold temperature environments. It bore similarities to the JR-4 swoop, another product by Bespin Motors and had greater range and durability than the standard BARC speeders. The \"Freeco\" nickname was a contraction of \"freezing cold\", the condition in which the vehicle was designed to operate."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The large CK-6 swoop bike included two sets of landing gear for more secure operation on icy terrain. These repulsorlift vehicles possessed an integrated windscreen to deflect the snow and air off their operational environment. Freeco bikes could operate when even the most intense blizzards kept Republic gunships grounded. However, without constant maintenance and care, even a night on Orto Plutonia could freeze a bike's systems solid."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The swoop was tested by a squad of clone cold assault troopers stationed on Orto Plutonia shortly before the squad was wiped out by an unidentified snow creature. As of the time of their disappearance, the speeder did not test well, as it was prone to freezing up. It was later used by clone troopers during the Battle of Orto Plutonia. These speeders were barely a match for Talz warriors mounted on narglatches.\nThe swoop was also used by Kit Fisto, Plo Koon, and a squad of Devil Dogs during the Battle of Khorm. The swoop saw no combat however and were abandoned once their transportation capabilities proved irrelevant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The \"CK-6 swoop\" designation was based on the previously established JR-4 swoop."}, {"tag": "p", "text": "The design of the vehicle is based on a Darth Maul Sith speeder concept art for Star Wars: Episode I The Phantom Menace by Doug Chiang from 1996."}, {"tag": "p", "text": "The LEGO Company released a set featuring a Freeco bike on December 28, 2009. It contains Jedi Knight Anakin Skywalker and the Talz Thi-Sen. Hasbro also released a deluxe pack containing a Freeco bike and an Obi-Wan Kenobi action figure in 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}