{"url": "CLL-M2_binary_loadlifter", "categories": ["Category:Canon articles", "Category:Labor droid models"], "nodes": [{"tag": "h1", "text": "CLL-M2 binary loadlifter"}, {"tag": "p", "text": "The CLL-M2 binary loadlifter, also known as simply as the CLL-M2, ordnance lifter droid, or loader droid, was a model of heavy labor droid manufactured by Cybot Galactica. Some of them were repurposed to assist Doctor Sionver Boll in studying the Zillo Beast."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Limbs and counterweight"}, {"tag": "p", "text": "The CLL-M2 binary loadlifter was a model of extremely basic binary loadlifter labor droid that was designed solely to lift heavy cargo from one location to another. The droid stood about four meters tall, reaching six meters at full stretch, and towered over most organic species. It had a thin rectangular chassis with four limbs each of which was armored at key points, particularly the shoulders of the arms, and consisted of a simple slabs of durasteel moved by heavy-duty hydraulics."}, {"tag": "p", "text": "The two legs ended in large flat magna-pod feet with magnetic soles that spread the heavy weight of the droid and its cargo as evenly as possible. The CLL-M2's arms generally ended in simple claws that could be slipped under standard cargo sleds, lock onto them magnetically, and then lift them up, although some units were equipped with pincer-like grabbing hands. The model's biggest draw was the repulsorlift counterweight attached to its back."}, {"tag": "p", "text": "This saved a large amount of time compared to other earlier loadlifters, which would usually need to rely on an actual counterweight to balance cargo, normally on an extendable rig to provided a better positioned, adjustable center of gravity. The CLL-M2's repulsorlift counterweight could instead generate precisely the weight needed and make real-time adjustments as the droid walked, removing the need to manually add or remove physical counterweights."}, {"tag": "h3", "text": "Sensors and intelligence"}, {"tag": "p", "text": "The CLL-M2 possess a large black photoreceptor that did grant the droid limited vision, but was required only for the simplest tasks, primarily scanning the code panels attached to whatever cargo the droid was carrying to ensure that it was the correct load. The photoreceptor sat at the top of the droid's chassis on the front of the unit. A black hemispherical remote sensor sat on either side of the photoreceptor tube and monitored the droid's surroundings."}, {"tag": "p", "text": "Despite these sensors, CLL-M2s were slow to react to anything that wandered into their path and so it was far safer to steer clear rather than relying on them to take evasive action. The model lacked any real intelligent and was so simple a machine that it was arguably a piece of semi-autonomous equipment rather than a true droid; however, like all binary loadlifters, it could understand simple voice commands, although sending precise programmed tasks by remote data link was generally safer."}, {"tag": "p", "text": "The slot directly above the droid's photoreceptor contained its fairly basic microphone and even more basic vocabulator, which only allowed it to speak in droidspeak and so required most owners to use a protocol droid or similar unit to translate. A binary broadcast antenna array sat atop the droids counterweight and allowed users to monitor the status and position of the droid at all times. The array also allowed the CLL-M2 to send a message to its operator when it finished a task or encountered any difficulty."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The CLL-M2 binary loadlifter was produced by Cybot Galactica and first introduced shortly before the Separatist Crisis, although it differed little from other similar labor droids that had existed since the droid equivalent of prehistoric times. During the Clone Wars in 21 BBY, Galactic Republic scientist Doctor Sionver Boll requisitioned a clutch of CLL-M2s to use in her study of the captive Zillo Beast on the planet Coruscant."}, {"tag": "p", "text": "She modified the droids, turning their hands into heavy-duty graspers by adding additional joints so that the units could act as her \"tweezers\" while studying the beast. She also replaced their stock photoreceptors with a far more advanced model that sat on a rotatable extending mount and was capable of multi-frequency scanning down to nearly the microscopic level. The clutch's remote sensors were upgraded to a blue colored model and the droids had an additional limb added to their left should that ended in an additional probe and readout screen."}, {"tag": "p", "text": "The droids marched in front of the unconscious beast with Boll as the creature was unloaded down the boarding ramp of a Venator-class Star Destroyer. They then accompanied it into a hangar where it was kept subdued within a frame while Boll studied it from within a pod-like vehicle. The modified CLL-M2s climbed over the beast and the scaffolding, with one lifting the rear part of its upper jaw so that a smaller droid could take samples from underneath, causing the creature to roar. Once the sample was taken, Boll order the droids to stop and reported her findings to Supreme Chancellor Palpatine."}, {"tag": "p", "text": "After Palpatine ordered the doctor to find a way to kill the beast, the droids stood by in the hangar as she began a procedure to kill it using gaseous Malastare fuel toxin. However, instead of perishing the beast became enraged and broke free, crushing a CLL-M2 on the scaffolding with its hand and escaping the hangar to rampage through Coruscant. Ultimately the creature was killed and its corpse returned to Boll, who received orders to clone it. The droid's repulsorlift counterweight and the increased efficiency it provided made the model very popular and resulted in it remaining in service long after the end of the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}