{"url": "CLE-004_window_cleaning_droid/Legends", "categories": ["Category:Legends articles", "Category:Cleaning droid models", "Category:Publictechnic products"], "nodes": [{"tag": "h1", "text": "CLE-004 window cleaning droid"}, {"tag": "p", "text": "The CLE-004 window cleaning droid, also known simply as a cleaner droid, was a fifth-degree window cleaning droid produced by Publictechnic during the time of the Galactic Republic. It commonly worked alongside INS-444 window installation droids."}, {"tag": "p", "text": "The CLE-004 was a repulsorlift-equipped droid with a single electrostatic polisher protruding on an articulated arm from its squat body. The droid used this to clear windows of grime, dirt and digit marks left by installation droids. The CLE-004 unit could polish even a large window in a matter of seconds. Although they commonly accompanied INS-444 droids to ensure newly-installed windows were spotless, CLE-004 droids were often seen working alone on worlds such as Coruscant. Their repulsors allowed them to reach even the tallest buildings in Galactic City. These droids did not have an internal processor, instead relying on a master control system to broadcast commands to their top-mounted power receivers."}, {"tag": "p", "text": "CLE-004 droids were a common sight outside an office or apartment window, and this familiar presence was sometimes used to turn the droids into hovering spies. Their presence unnoticed, CLE-004 units modified to hold eavesdropping devices or holorecorders could easily transmit activities within any given building back to various crime bosses, news organizations or jilted lovers looking to catch their partners in the act."}, {"tag": "p", "text": "One particular CLE-004 unit, nicknamed \"Buffy\", along with the INS-444 unit \"Mick\", was employed by the staff of Senator Padmé Amidala in 22 BBY. The droids installed and cleaned a window in her apartment to replace one smashed by Obi-Wan Kenobi during his pursuit of an ASN-121 assassin droid."}, {"tag": "p", "text": "Cleaner droids remained in use throughout the Galactic Civil War and beyond."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}