{"url": "COO_cook_droid", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Cooking droid models", "Category:Imperial droids", "Category:Industrial Automaton products", "Category:Publictechnic products"], "nodes": [{"tag": "h1", "text": "COO cook droid"}, {"tag": "p", "text": "The COO cook droid was a class-five chef droid created as a joint venture between Industrial Automaton and Publictechnic before the Clone Wars. The droid model came equipped with over a dozen arms, which were equipped with common cooking tools such as spatulas, knives, and spoons. Designed for catering on a large scale, such as in military mess halls, the droids came with only a few hundred of the most common recipes, and although this software could be replaced with another package containing different recipes, the process to do so was very complex. Because of this, few owners did swap their droids' software packages. This lengthy process was a flaw commonly noted by customers. Ultimately, many owners ended up using the droid for nothing more than heating up meals or serving prepackaged foods. One such droid, COO-2180, served upon the starship Jendirian Valley in 22 BBY."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The two meter tall COO cook droid, manufactured by Industrial Automaton, was a class-five droid. It was designed to be used as a chef for large-scale catering, such as military mess halls, although the COO droid was considered a sloppy construction. For its body, Industrial Automaton re-used the chassis from one of its other droid models, making it appear ugly and clunky for a droid of its nature. The company's frugality was a main factor in causing many to believe that the COO droid was a cheap and mediocre design. It had a flat head fitted with a vocoder, one photoreceptor, and an olfactory sensor, which enabled the droid to determine the freshness of various ingredients. A COO droid's legs could lock to the floor through magnetism, a handy ability for cooking on starships with irregular artificial gravity."}, {"tag": "p", "text": "A cook droid's unique arm configuration allowed it to do many things at once. With the right socket configuration, a COO droid could have over a dozen arms. Possible arm apparatuses included spatulas, whisks, strainers, serving spoons, carving knives, small flame projectors for lighting oven burners, and three-fingered hands, along with many other gadgets. This way, a droid could make food much faster than one organic chef, as it could do many things at once, such as apply spices, cut up food, and administer any final touches. After a meal was finished, the droid could serve the food and then replace its arms with cleaning tools, allowing it to quickly clean dishes."}, {"tag": "p", "text": "A COO cook droid came from the factory with knowledge of hundreds of common recipes taken from the Humbarine Housekeepers HoloBook in its software. Thus, the droids knew nothing beyond simple, conventional recipes when they were purchased. Though it was possible to remove a droid's software pack and replace it with another one that contained different recipes, this process was complex and involved partially disassembling the droid. It was impossible to tell what software a COO droid had—factory standard or a more advanced package—by simply looking at the droid. Because of the difficulty of switching software, many owners did not change the droids' recipe package, leading to potential trouble if the default software package did not include any recipes favored by the droids' owners. This also convinced beings that the COO was a sloppy model, constructed lazily. The droids were also known for being liars; they would tell customers or owners anything if it would help the droids, such as by prolonging their lifespans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The COO cook droid was designed by Industrial Automaton, one of the leaders in droid manufacturing, sometime before 22 BBY. Though many cooks criticized the creation of a chef droid, arguing that a machine that couldn't even taste had no business making food, the public had no problem with such a droid. However, customers found the droid very difficult to use, due to the complex process of changing the recipe package."}, {"tag": "p", "text": "The COO quickly became popular in military mess halls, where it could easily cook a large number of simple meals in a short time. This was in fact Industrial Automaton's idea when designing the droid. As the COO droid was incapable of cooking more sophisticated meals without a new software package, it was generally used for mass catering of orthodox meals, and eventually customers began using the droid only to heat up meals or serve prepackaged food."}, {"tag": "p", "text": "Around 22 BBY, the freighter Jendirian Valley overhauled its cargo holds to create room for sentients, and the ship began transporting refugees affected by the growing crisis of planets seceding from the Galactic Republic to join the Confederacy of Independent Systems. To feed the refugees, the ship's operator purchased a used cook droid, COO-2180. The droid made simple meals purchased from a military surplus store, and was instructed to feed only organic beings. In 22 BBY, the freighter transported the Senator Padmé Amidala and her guard, the Jedi Anakin Skywalker, as they traveled undercover as refugees to Amidala's home planet of Naboo. The duo's droid, R2-D2, stole a meal for his masters, earning him the ire of COO-2180."}, {"tag": "p", "text": "At some point, the pirate Reginald Barkbone spent a month in space with a vegetarian COO droid while trying to escape the Loronar navy. Barkbone had a very low opinion of the droid, calling the month in its company the most miserable time he had spent in space. BY 1 BBY, COO droids were in use aboard the Imperial prison barge Purge. During the Galactic Civil War, a COO cook droid was employed by the Hutt crime lord Teemo to operate the bar in his palace, in the settlement Mos Shuuta on the planet Tatooine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The COO cook droid was created for the 2002 film Star Wars: Episode II Attack of the Clones. Much of the information about the droid was given in the 2006 reference book The New Essential Guide to Droids."}, {"tag": "p", "text": "The Official Star Wars Fact File 78 claims that the COO droid was manufactured by Publictechnic, while The New Essential Guide to Droids credits Industrial Automaton with the invention of the series. As The New Essential Guide to Droids is the newer source, this article treats that information as canon."}, {"tag": "p", "text": "COO cook droids were later mentioned in the 2009 novel Death Troopers, where they were referred to as \"COO-2180s\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}