{"url": "CS-515", "categories": ["Category:Canon articles", "Category:CS-Squad members", "Category:Males"], "nodes": [{"tag": "h1", "text": "CS-515"}, {"tag": "p", "text": "CS-515 was a human male stormtrooper sent to the Colossus platform when the First Order began to occupy it. He was knocked unconscious by the child refugees Eila and Kel. Eila and Kel's friend Kazuda Xiono, who was a Resistance spy, then stole his stormtrooper armor in order obtain a First Order data rod. Due to Xiono \"erratic\" actions, CS-515 was sent for Reconditioning by Sergeant CS-812 and Commander Pyre."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Knocked unconscious"}, {"tag": "p", "text": "CS-515 was a First Order stormtrooper who served with CS-Squad, which was part of the First Order garrison assigned to the Colossus platform on the planet Castilon. His squad was assigned with verifying the identities of all residents living aboard the Colossus."}, {"tag": "p", "text": "While searching the platform, he overheard child fugitives Eila and Kel laughing while fishing on the underside of the platform. CS-515 confronted them and demanded that they produce their identification. When the children were unable to produce their identification, he demanded that they come with him and grabbed Eila. Kel sprang to the defense of his sister and threw a snarlfish at him, causing CS-515 to hit his head on a railing and fall unconscious."}, {"tag": "h3", "text": "Resistance entanglements"}, {"tag": "p", "text": "After locking CS-515 inside a room, Kel and Eila asked the Resistance spy Kazuda Xiono for help. The children led Xiono and his friends Neeku Vozo, BB-8, and Tamara Ryvora inside the room. After narrowly avoiding a stormtrooper patrol, Xiono and his friends hid the unconscious trooper in a room in the engineering deck, which was the domain of the Chelidae engineers and mechanics who operated the Colossus' machinery."}, {"tag": "p", "text": "Since CS-515's comrades were searching for him, Xiono came up with a plan to steal the stormtrooper's armor and impersonate him while attempting to discover if the unconscious trooper had reported the children's presence on the platform. While posing as CS-515, Xiono reported to the squad's commanding officer, Sergeant CS-812. When CS-Squad was accosted by angry locals, Xiono took the opportunity to infiltrate an Upsilon-class command shuttle and steal a First Order data rod."}, {"tag": "p", "text": "Meanwhile, a disoriented CS-515 awoke in unfamiliar surroundings. Neeku took the opportunity to \"befriend\" the stormtrooper before knocking him unconscious with an electro-shock prod. Meanwhile, Xiono's \"erratic behavior\" led Sergeant CS-812 and Commander Pyre to assume there was something wrong with CS-515's mental conditioning. Before they could send him for Reconditioning, Xiono fled into the Colossus' corridors and led the stormtroopers on a chase."}, {"tag": "h3", "text": "Framed"}, {"tag": "p", "text": "Xiono managed to find his friends and change back into his clothes. After Xiono fled, the stormtroopers tracked down the real CS-515, who had been dressed up in his armor again, and found him in a state of disorientation from repeatedly being knocked and shocked unconscious. This led them to take the dazed trooper off for reconditioning, unaware of what had really transpired."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "CS-515 was a human male with black hair, brown eyes, and tan skin. As a member of the Colossus garrison, CS-515 sought to comply with superior orders to register all inhabitants living aboard the Colossus. He was trained to wield a blaster and to detain people. CS-515 was not skilled at physical combat and was knocked unconscious by Kel, who was protecting his sister. CS-515 appeared to be trusting, regarding Neeku as his \"green friend.\""}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a First Order stormtrooper, CS-515 wore the standard white stormtrooper armor over a black body glove. His helmet was equipped with a built-in comlink. He also carried an F-11D blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CS-515 first appeared in the Star Wars Resistance Season One episode \"The New Trooper,\" which premiered on February 10, 2019. He was voiced by Steve Blum, who voiced Zeb in Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}