{"url": "CT-0292", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Clone trooper captains", "Category:Officers of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "CT-0292"}, {"tag": "p", "text": "CT-0292, nicknamed \"Vaughn,\" was a clone trooper officer who served as a Clone Captain within the 332nd Company as part of a division of the 501st Legion that was assigned to Clone Commander CT-7567 \"Rex\" and former Jedi Padawan Ahsoka Tano. As a soldier in service to the Republic Military of the Galactic Republic, Captain Vaughn participated in the Siege of Mandalore towards the end of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. During the siege, Vaughn led troopers of the division in the capital city of Sundari, and chased Mandalorian super commandos into the Undercity."}, {"tag": "p", "text": "After being lured into an ambush, Vaughn's clone troopers were killed and soon Vaughn succumbed to the same fate. Ahsoka Tano, who was accompanying the troopers, arrived to the scene and held Vaughn's hand as she heard his final words."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "CT-0292 \"Vaughn\" was a Clone Captain of the Grand Army of the Republic who served within a division of the 501st Legion during the Clone Wars. In 19 BBY, he participated in the initial assault of the Siege of Mandalore when the Galactic Republic and Mandalore resistance attacked the city of Sundari, where they hoped to capture former Sith apprentice Maul. Vaughn survived the initial landing, where the division took control of the docks, effectively trapping Maul and his supporters inside the city. He and his clone troopers would then advance into the city, taking losses but forcing Maul's Mandalorian super commandos to retreat."}, {"tag": "p", "text": "As the battle progressed to the Undercity, Vaughn spotted Maul and his forces moving into a tunnel. He contacted Captain CT-7567 \"Rex\" and Ahsoka Tano, who was officially acting as an advisor to the Republic forces on Mandalore. Showing Tano where he saw Maul retreat, Tano decided to advance after him. They led a unit of clones to track down the escaping super commandos. They began their advance cautiously, but when they were attacked by Maul's supporters, Vaughn and the squad progressed further into the Undercity and, in their haste, left Tano behind. Before Tano could catch up, the squad was drawn out and methodically targeted, with all troopers being eventually killed. Vaughn was among the last survivors, but was critically wounded with a blaster shot to the chest. When Tano arrived at the scene, she held Vaughn's hand as he said his final words, apologizing to her for his failure."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "CT-0292 was a clone of bounty hunter Jango Fett, and stood 1.83 meters tall. In spite of Ahsoka Tano no longer being part of the Republic Military, he still respectfully referred to her as \"Commander\" and would customize his armor when she returned to their ranks. He proved to be eager to rush into combat, which led to his demise in the Undercity of Sundari. Feeling that he had failed, Vaughn was apologetic in his last moments, telling Tano that he was sorry for allowing himself and his troops to be ambushed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "CT-0292 wore Phase II clone trooper armor with the blue markings of the 501st Legion, and a customized helmet emblazoned with a stylized version of Ahsoka Tano's facial tattoos, which also covered his visor. While on Mandalore, he was equipped with a DC-15A blaster rifle and a jetpack, and his helmet and shoulder armor included integrated antennas. His helmet also included a modified chin extension, and dark red lines that were distinguished from the color used for the stylized face of Tano."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CT-0292 first appeared in \"Old Friends Not Forgotten\", the ninth episode of the canon animated series Star Wars: The Clone Wars' seventh season, which first aired on April 17, 2020. The character was first pictured in a promotional poster for the season, posted by the official Star Wars Twitter account on January 22, 2020."}, {"tag": "p", "text": "Dee Bradley Baker provided Vaughn's voice for the episode, along with all other clone troopers in the series. His character model was repurposed from that of Commander Cody, who also appeared in the ninth episode. Additionally, Vaughn's name is written as \"Vaughan\" in the episode guide's concept gallery on StarWars.com. However, the guide's episode gallery refers to him by the former name and the pronunciation of his name in the episode matches that of \"Vaughn.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}