{"url": "CT-00-2010", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Clone cadets", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "CT-00-2010"}, {"tag": "p", "text": "CT-00-2010, nicknamed \"Droidbait,\" was a clone trooper who served in Domino Squad, a clone cadet squad in the Grand Army of the Galactic Republic. During the Clone Wars, Droidbait was stationed at a Republic Military outpost on the Rishi moon where he was killed by BX-series droid commandos."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Like all clone troopers in the Grand Army of the Republic, CT-00-2010 \"Droidbait\" was grown on the planet Kamino as an exact clone of the bounty hunter Jango Fett, and was part of the cadet unit Domino Squad. In the group's final test, Droidbait, injured in the test, was left behind by his comrades on the ground, breaking the first rule of combat, which caused Clone ARC Commander Colt to effectively end the test and give the Domino Squad an automatic failure. However, El-Les, a bounty hunter who was hired by the Galactic Republic to be an instructor for clone cadets, made arrangements with Jedi Master Shaak Ti that the unit be given a final chance to pass the test, and through leadership and cooperation with one another, Droidbait and his unit successfully passed the test. After passing the test, Droidbait and his brothers—Fives, Echo, Hevy, and Cutup—graduated and were sent to fight the armies of the Confederacy of Independent Systems and restore peace to the Republic."}, {"tag": "h3", "text": "Battle on the Rishi Moon"}, {"tag": "p", "text": "In 22 BBY, Droidbait and his comrades were stationed at the Rishi Station, which was vital in the protection of Kamino from possible Separatist invasions. After the station's deck officer CT-327 turned up missing, Sergeant O'Niner sent Droidbait and Nub to investigate. Opening the blast door, commando droids attacked and killed them both and O'Niner, forcing the rest of the clones to escape through the ventilation systems, allowing the Supreme Commander of the Droid Army, General Grievous, to make pass through the system directly to Kamino unopposed. The general's victory was short-lived, however, as Clone Commander CC-2224 \"Cody\" and Clone Captain CT-7567 \"Rex\" arrived on the moon and helped the remaining troopers regain control of the outpost and warn the Republic fleet of the incoming attack."}, {"tag": "p", "text": "Later on, after losing contact with the commando droids, Grievous, hoping to keep the base's all-clear signal active, dispatched a C-9979 landing craft carrying a large force of battle droids to reinforce the commando droids and keep the base under their control. However, the droids, unaware that a trap had been set for them, entered the control room and were suddenly destroyed by Hevy who ultimately blew up the base, therefore allowing the Republic to discover and stop Grievous's invasion fleet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}