{"url": "CT-1226", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "CT-1226"}, {"tag": "p", "text": "CT-1226 was the designation of a clone trooper serving in the Galactic Republic's Grand Army during the Clone Wars, a conflict between the Republic and the Confederacy of Independent Systems. CT-1226 participated in the opening battle of the war on the planet Geonosis, when the clone troopers of the Grand Army assaulted Separatist forces there."}, {"tag": "p", "text": "During the battle, CT-1226 shot a Confederate B2-HA series super battle droid with his blaster as it prepared to launch a missile at Republic All Terrain Tactical Enforcer walkers. This caused the missile to instead hit a Confederate IG-227 Hailfire-class droid tank, destroying it and allowing the Republic walkers to march through the hole created in the Separatist defensive screen. CT-1226 later received a commendation for that act."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "CT-1226 was a clone of the bounty hunter Jango Fett, born on the planet Kamino to serve as a trooper in the Galactic Republic's Grand Army. During his grooming to become a clone trooper, CT-1226 participated in live-fire exercises and other training. In 22 BBY, the Clone Wars exploded across the galaxy as a conflict between the Republic and the Confederacy of Independent Systems. The war's opening battle was on the planet Geonosis, where CT-1226 and other clone troopers fought against the forces of the Separatist Droid Army. CT-1226 and his regiment were deployed near where the initial Republic strike had destroyed Confederate Hardcell-class interstellar transports. Followed by Republic All Terrain Tactical Enforcer walkers and four Self-Propelled Heavy Artillery units, CT-1226 and the other troopers pushed across a plateau in a skirmish line in the direction of the Separatist headquarters. During deployment, the comlink of the helmet's HUD used by CT-1226 went staticky every time something loud occurred, preventing him from hearing what his lieutenant or the rest of his squad were saying. Despite this inconvenience, he was able to stay with the group, as he could still see them."}, {"tag": "p", "text": "CT-1226 and the skirmish line soon came in contact with a wall of Confederate battle droids, including IG-227 Hailfire-class droid tanks, OG-9 homing spider droids, B2 super battle droids, and B1-Series battle droids. After the Republic forces came into range of the missile-equipped Hailfire droids, CT-1226 was nearly hit by a blast from an AT-TE with a malfunctioning guidance system. The blast left him in a crater on his back, with his feet oriented toward the top of the hole and his HUD out. Once CT-1226 reoriented himself, he began to climb out of the crater, only to duck back in as a Hailfire droid rolled over the top of the crater, with a wheel on each side of the hole. CT-1226 aimed his blaster at the droid as it stopped to recalibrate its targeting a short distance off, but lowered it as he reasoned the blaster would not do any damage to it. Turning, he came face to face with two B1 battle droids at the top of the crater, aiming their E-5 blaster rifles at him. Behind them came a B2-HA series super battle droid, armed with a missile launcher arm. However, unlike the B1 droids, the B2-HA did not see CT-1226 in the crater, and instead smashed the two droids aside as they stood between it and the AT-TEs."}, {"tag": "p", "text": "As the B2-HA battle droid continued around the side of the crater, CT-1226 shot the droid as it launched a missile at the Republic lines, knocking the B2-HA down and leaving its missile launcher stuck in the dirt. The missile ended up hitting the same Hailfire that had passed over the crater, instead of going over its head, causing the droid to explode into bits. The resulting explosion forced CT-1226 to duck as pieces of the droid rained down. He threw an EMP grenade at the B2-HA, and then ran over to it and shot it in the back a couple of times to destroy the droid. The destruction of the Hailfire droid punched a hole in the droid army's defensive screen, allowing the AT-TEs to march through. A couple of minutes later, CT-1226 got into one of the walkers' crew cabins and was given a new HUD. CT-1226 received a commendation by the battle's generals for his quick thinking and resourcefulness, even though he tried to refuse. A debriefing from CT-1226 on the battle was included in Geonosian Debriefings, Vol. III."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During the First Battle of Geonosis, CT-1226 was able to cope with the static on his HUD due to the training he received on Kamino. When he saw battalions of droids coming at the clone forces shortly after deployment, CT-1226 reasoned that they were on the right path to the Separatist headquarters because of the number of troops guarding it, but also realized the clone force would get decimated without air support. When CT-1226 had a shot at the Hailfire, he neglected to take it, as he reasoned it would do no damage to the large droid even at close range. Due to his recent time in the crater, he was able to understand the confusion that the B2-HA series super battle droid experienced after finding its missile arm in the ground, though he knew he would be dead if he let the droid get up, so he eliminated it. He also tried to refuse the commendation for his quick thinking and resourcefulness after he blew a hole in the Separatist lines, as he thought the only smart thing he did was fall in the crater."}, {"tag": "p", "text": "As a clone of Jango Fett, CT-1226 stood 1.83 meters tall. In combat, he used a blaster from the DC-15 series, and wore standard Phase I clone trooper armor, with a HUD equipped in his helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CT-1226 first appeared in The Essential Guide to Warfare, written by Jason Fry and Paul R. Urquhart and released in 2012 as a guide dedicated to the conflicts in the Star Wars galaxy. Fry later commented in his endnotes to Warfare that writing the section that contained CT-1226 was fun to do, and that it was sometimes better to be lucky than good at something."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}