{"url": "CT-21-0408", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Advanced Recon Commandos", "Category:Clone cadets", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "CT-21-0408"}, {"tag": "p", "text": "CT-21-0408, nicknamed \"Echo,\" as he was known for \"echoing\" the standard rules and procedures established for clones, was a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Early in his career, Echo lived within Tipoca City, the capital city of the planet Kamino, and trained in its military complex. As a clone cadet, Echo was part of the squad Domino Squad, overseen by the Siniteen bounty hunter Bric. Echo stayed with Domino Squad until the unit passed their final test; the completion of the test allowed the members of Domino Squad to become battle-ready clone troopers. For his first off-world assignment, Echo stood guard at Rishi Station, a listening post located on the moon of Rishi, where he and other rookie clone troopers were stationed. When the Confederate General Grievous implemented an attack on the Rishi Station to capture it before proceeding to Kamino. His plan, however, was thwarted by Echo, fellow troopers Fives, Hevy, and clone officers Cody and Rex. Echo, along with Fives, were rewarded with medals for their service on the Rishi moon and were inducted into the 501st Legion."}, {"tag": "p", "text": "Several months later, both Echo and Fives returned to Kamino, and the two were present when Grievous, along with Dark Acolyte Asajj Ventress, initiated their attack on Tipoca City. Following the retreat of Grievous and Ventress, which ended the battle, Echo and Fives were once again given accolades for their bravery and efforts, and became ARC troopers. Echo later participated in the rescuing of Jedi Master Even Piell, who was captured by Confederate forces and taken to the Citadel. Echo and his group—lead by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker—found Piell in the prison, and, as they tried to escape with the Jedi Master, were stopped by the facility's warden, Osi Sobeck, and his battle droid force. As Echo and his team looked for an escape route that would lead them back to their shuttle outside of the Confederate prison, more of Sobeck's security droid forces attacked them. They found their shuttle, although it was being watched by stationed commando droids on various towers around the shuttle's landing platform. When a commando droid began to fire at the shuttle with a laser cannon, Echo tried to stop the droid. Yet, instead, the droid killed Echo, as well as destroying the shuttle in the process."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Training with Domino squad"}, {"tag": "p", "text": "CT-21-0408 was a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Around 21 BBY, CT-21-0408 was assigned to Domino Squad, a unit of clone cadets. Because CT-21-0408 often \"echoed\" the rules and procedures clone troopers had to follow, the other Domino Squad clone cadets—Cutup, Hevy, Fives, Droidbait—nicknamed him \"Echo.\" Echo and Domino Squad lived on the planet Kamino's capital Tipoca City, and trained in its military complex. Overseen by Siniteen Sergeant Bric—a bounty hunter himself—Echo and Domino Squad engaged in combat simulations, which placed them head-to-head with battle droids. For their simulation battles, each clone cadet, including Echo, used non-lethal weapons so no clone could be injured during one of their simulations. Furthermore, all clone cadet squad members had to work as a team to successfully pass the simulation. For Domino Squad, however, the team rarely got along with each other."}, {"tag": "p", "text": "During a practice exam, fellow Domino Squad member Hevy broke away from the struggling group, while Echo, Fives, Droidbait, and Cutup remained behind barricades. As the simulation test progressed, the group of individuals that were watching Domino Squad's simulation—Bric, Arcona El-Les, and Jedi Master Shaak Ti—took concern of Domino Squad's recklessness. Bric expressed the group's inability to work as a team, and wanted to send them to Tipoca City's maintenance crew, where rejected clones went. Ti noticed Echo's inability to adapt himself into any situation, since he was trying to enforce proper procedures to his teammates. Because the members of Domino Squad could not work together, they failed the test. Afterward, Echo and Domino Squad left the combat room and headed back to the complex's sleeping quarters. There, Echo told his squad that they should follow orders and not mess around. While the other Domino Squad members mocked Echo's words, Hevy did not enjoy their conversation. When he said that he thought \"like an ARC trooper,\" Echo questioned him, which angered Hevy. Their heated debate turned into a fight, but the brawl was broken up by the immediate arrival of Bric. While Echo quickly apologized to Bric, Hevy dismissed the sergeant. Bric wanted his team to cooperate with each other, and, if they remain the same, they were a waste of his time. Sometime later Bric and El-Les rallied Domino Squad, as well as other clone cadet squads, for a meeting outside the military complex."}, {"tag": "p", "text": "Clone Commander Colt, an ARC trooper himself, was to watch the clone cadet's final combat simulator test. If a squad past the test, the troopers within the squad would become a combat-ready clone trooper. Colt took interest within Bravo Squad, a unit of clone cadets that past certain tests in \"ARC trooper time.\" Echo tried to inform his team that they could learn something from Bravo Squad; however, they negatively ignored him. Echo and Domino Squad followed Bravo Squad to the combat simulator room, and soon watched as Bravo Squad effectively worked as a team during their combat simulation test. Not long after, a cadet from Bravo Squad lifted a pole on top of a citadel in the simulator room which completed the simulation test. With the completion of Bravo Squad's test, Echo and Domino Squad entered the combat room. Echo and the rest of Domino Squad past the cadets from Bravo Squad, who teased them by saying \"time to watch the Dominoes fall.\" However, once the simulator began, Echo and Domino Squad quickly completed certain parts of the simulation faster than their usual rate. As Echo, Fives, Droidbait and Cutup took cover, Hevy, who was destroying droids with his Z-6 rotary blaster cannon, was clearing a path for them. When Droidbait broke away from the group, however, a droid shot him in the back. Echo noticed this and and yelled for Hevy, although Hevy told him to leave Droidbait alone, as he wanted the squad to head for the room's citadel, where the pole to complete the test was located. Because Echo and the other Domino Squad members left Droidbait behind, they automatically failed the test. Colt and El-Les confronted the group and told them they should not leave a man behind."}, {"tag": "p", "text": "After failing the test, the clone cadets departed back to their sleeping quarters. For Echo and Fives, however, the two clone cadets felt they did not belong within the struggling Domino Squad. Wanting to transfer to a different clone cadet squad, Echo and Fives went to Jedi Master Shaak Ti. Yet, when Echo and Fives requested they should be moved to Bravo Squad, Ti denied their request and revealed that she had faith within Domino Squad. Because of her confidence within Domino Squad, Ti allowed Domino Squad to retake the test. The following day, Ti joined Bric, El-les, and Colt, while Echo and the rest of Domino Squad entered the simulation room. Making similar progress as the day before, albeit not leaving a man behind, Domino Squad reached the bottom of the citadel. However, they noticed that their ascension cables in their belts were missing which were needed to climb the citadel's tower. Despite the setback, the clones improvised and decided to climb blaster turrets that acceded up toward the citadel's roof. Once Hevy successfully climbed the turrets and lifted the pole on top of the citadel, Domino Squad finally completing the test. Shaak Ti and El-Les spoke positively about their efforts, and due to them working as a team and completing their final test, Echo and the rest of Domino Squad were allowed to become clone troopers. They each received their own medals, as a symbol for their graduation from clone cadet."}, {"tag": "h3", "text": "Rishi moon battle"}, {"tag": "p", "text": "After becoming a battle-ready clone trooper, Echo, and former Domino Squad members, were assigned their first off-world mission. Echo was stationed at a listening post located on a moon of the planet Rishi, under the command of Sergeant O'Niner. Along with fellow troopers Fives, Hevy, Droidbait, Nub, and CT-327, Echo maintained the listening post to warn the Galactic Republic of any impending Confederate attacks on the nearby Kamino. At one point, when Echo joined the other stationed rookie troopers in the control room of the listening post, Sergeant O'Niner entered the room and alerted the clone troopers of a routine inspection that would soon commence. Unbeknownst to the group of clone troopers, however, the Confederate General Grievous planned to attack Kamino in order to end the Republic's production of clone troopers."}, {"tag": "p", "text": "Grievous knew that if he attacked Kamino, the Rishi moon listening post would detect the attack, and the stationed clone troopers in the listening post would turn off the base's \"all-clear\" signal, which would alert the nearby Republic fleet. Grievous therefore deployed BX-series droid commandos in Droch-class boarding ships to take over the listening post. Meanwhile, a clone trooper raised the listening post's shield to protect the base against what appeared to be an approaching meteor shower, which was actually a group of Droch-class boarding ships. The droids soon left their transports and began their attack on the Republic base. After three commando droids shot and killed O'Niner and three other clones, the remaining clone troopers—Echo, Hevy, Fives, and Cutup—evacuated the command center by exiting through a ventilation shaft, which led them outside the listening post. Leaving the ventilation shaft, the four troopers were disheartened when a Rishi eel attacked and devoured Cutup, leaving only Echo, Hevy, and Fives to defend themselves. Eventually, the remaining rookie clone troopers sighted the Obex, a Nu-class attack shuttle flown by Commander Cody and Captain Rex."}, {"tag": "p", "text": "The clone officers had arrived for the inspection of the listening post and were unaware of the droid attack. After the two clone officers were attacked by the invading droids, they escaped and met with Echo and the other rookie troops. Having encountered a droid commando disguised in clone armor during their skirmish with the droids, Rex demanded that the rookies remove their helmets to verify that they were indeed clones. After the three rookie troopers obeyed and removed their protective headgear, another Rishi moon eel attacked them. This time, Rex used his DC-17 hand blaster to kill it with one shot to the eye, a feat that impressed the rookies. When talking with the rookie troopers, Rex dubbed them \"shinies,\" a derogatory term referring to the troopers' spotless armor that had not yet seen action in battle. Rex and Cody gave Echo and the other rookie troops their DC-15S carbines, and Rex suggested a plan to retake the listening post."}, {"tag": "p", "text": "The group of clone troopers hid near the entrance of the base while Rex impersonated commando droid unit 26 by using the droid's decapitated head. The clone captain successfully tricked Units 07, 08, and 09 to open the listening post's main door, allowing Echo and the clone troopers to ambush the remainder of the commando droids inside the base. Upon entering the command center, the clones defeated the droid units, including their vibroblade-wielding leader. However, their victory was cut short when the clone troopers noticed that General Grievous's fleet had arrived above the moon. Due to the lack of response from the commando droids, Grievous sent more battle droids to the listening post. The clones, inside the command center of the listening post, were unable to turn off the \"all clear\" signal because the droids had hot-wired it. Soon, a droid landing craft descended through the moon's atmosphere and landed at the listening post. With the battle droid reinforcements outnumbering the clone troopers, Rex—to the surprise of the rookie troops—ordered the complete destruction of the base."}, {"tag": "p", "text": "When a confused Echo told the clone captain that the clones' duty was to protect the base, Rex dismissed him, stating that if the base was destroyed, it would turn off the all-clear signal and alert the nearby Republic fleet of the impending Separatist invasion. To destroy the base, Echo offered the use of highly explosive liquid tibanna, which was used as a fuel source at the station when the Rishi moon entered its freezing cycle. While Rex and Echo went to retrieve the plunk droids that stored the liquid tibanna, Cody, Hevy, and Fives grabbed weaponry from the listening post's supply room. With their new supply of weaponry, the clones attacked the invading battle droid forces, buying time for Rex and Echo to wire the three plunk droids together. Unexpectedly to the clones, however, the remote activator to detonate the tibanna inside the plunk droids did not function properly."}, {"tag": "p", "text": "Hevy offered to stay behind and correct the problem before joining the other clones as they fled the listening post through a nearby ventilation shaft. Once outside, Rex found—to his surprise—that Hevy hadn't yet evacuated the listening post. The clone captain contacted Hevy via comlink, but Hevy refused to evacuate the listening post until he was able to repair the detonator. Unwilling to accept Hevy's decision, the clones ran to rescue the rookie trooper. Before they could reenter the facility, however, Hevy manually detonated the explosives. The listening post exploded, killing Hevy and all of the droid forces inside. Shortly thereafter, Rex, Cody, Echo, and Fives were picked up by an LAAT/i gunship that carried them off the moon. On board the Venator-class Star Destroyer Resolute, Jedi Generals Obi-Wan Kenobi and Anakin Skywalker awarded Echo and Fives medals for their service. Following the presentation of the medals, Rex inducted the two clones into the 501st Legion for their part in helping the Republic to thwart the Separatist attack."}, {"tag": "h3", "text": "Defense of Kamino"}, {"tag": "p", "text": "Several months after the destruction of the Rishi Station, Republic intelligence concluded that the Confederacy was about to invade Kamino. With Kenobi, Skywalker, Rex, and Cody, Echo and Fives departed to Kamino to prepare the defense of the planet. While Kenobi and Skywalker met with Shaak Ti and Kamino Prime Minister Lama Su, Echo and Fives roamed through Tipoca City's military complex. After reminiscing about their time as clone cadets in the city, the two soon spotted their old clone trooper friend, 99, who was carrying a bundle of DC-15 blaster rifles. 99 was glad to see Echo and Fives, but questioned where was Hevy. When Echo and Fives told him he had given his life to save them on the Rishi moon, 99 sadly showed the two Hevy's medal, and told them that Hevy had given it to him. Changing subjects, Echo told 99 about the suspected Confederate invasion of Kamino, and 99 asked the clone if he could help them in any way. With Echo and Fives' approval, 99 departed to the facility's weaponry room to gather weapons for the clone troopers, while Echo and Fives met with ARC trooper Havoc in a docking bay."}, {"tag": "p", "text": "The ARC trooper gave both 501st Legion clones a dangerous assignment—he wanted Echo and Fives to go outside on a platform bridge and \"stay in a sniping position.\" Echo and Fives complied and left for the bridge. Once there, the two clones situated themselves, prepared their DC-15 carbine blasters, and waited for battle to begin. When the invasion began, Trident ships, led by the Confederate General Grievous and Dark Jedi Asajj Ventress, climbed the outside structures of Tipoca City. As the ships caused structural damage to the buildings, due to their drills, battalions of B1-Series battle droids and Aqua droids exchanged fire with stationed clone troopers. On the bridge, Echo and Fives utilized their carbine blasters to shoot down the nearby droids. After 99 visited the two clones and resupplied them with ammo and thermal detonators, battle droids stormed the area, although they were destroyed when Echo tossed a detonator at them. Not long after, a squad of clone cadets approached Echo, Fives, and 99. When the squad told the clone troopers that they separated from their clone cadet group, 99 offered to bring them back to the city's sleeping barracks."}, {"tag": "p", "text": "Both Echo and Fives departed the platform bridge with 99 and the clone cadets and headed for the indoor barracks. Once there, Clone Commander Cody and Captain Rex joined the group, and told them everyone in the room needed to fight off the droids. The clone cadets, however, disagreed, due to their training being inadequate. Echo tried to boost the clone cadets' confidence by saying since Kamino was their home, they should defend it. 99 entered the conversation by telling the clones that he knew where the complex's armory room was, and if the clones could gather enough supplies, they would be able to hold off the droids. With the decision made, 99 gathered the supplies, and each of the clones equipped themselves with a firearm. Echo and the clones stood behind a door, which led to a sleeping barrack room, and waited for any droid to walk by. Nearby, Grievous led a group of droids down the same hallway the clones where in. After the cyborg General ordered the droids to open the doors, a droid opened the clones' door, which revealed them. Echo and the clones began to fire at the droids, and lured them inside the barrack room. The clones took defensive positions behind crates as the droids continued their pursuit. As the firefight intensified, 99 tossed thermal detonators to Echo, Cody, and Rex for more firepower."}, {"tag": "p", "text": "Soon, however, the clones around the crates were being overwhelmed by the droids. Rex used his comlink to alert the clone cadets, whom were hidden inside sleeping bunkers, to reveal themselves to the droids. As they began to fire at the droids, Echo and the others continued as well. However, 99 noticed that the clones ran out of thermal detonators. Despite being told not to retrieve more by Rex, since it was too dangerous, 99 ignored the order and ran toward a nearby door. Yet, battle droids noticed the fleeing 99, and fired at him, killing him instantly. Despite witnessing 99's death, Echo and the remaining clones destroyed the remainder of Grievous' droids. Echo and the clones gathered around Fives, who was cradling 99's body on the floor, and mourned 99's loss. After Grievous and Ventress escaped Kamino, which ended the invasion, resulting in a Republic victory, Echo and Fives joined Cody and Rex inside a docking bay. Because of their accomplishments during the invasion, both Cody and Rex were proud of Echo and Fives. The two 501st Legion clone troopers were then allowed to become ARC troopers."}, {"tag": "h3", "text": "Rescuing Even Piell"}, {"tag": "p", "text": "While serving under Skywalker and Kenobi, Echo and Fives took part in the rescuing of Jedi Master Even Piell, who had been captured by the Confederacy, which wished to extract information about the secret Nexus Route hyperlane that the Jedi Master possessed. In the Jedi Temple on Coruscant, Echo and Fives joined Skywalker, Kenobi, Jedi Master Plo Koon, Cody, and Rex during a meeting around a holographic table. As they orchestrated their plan, the team knew that any attack on the facility which contained the captive Piell—a well-guarded Confederate prison known as the Citadel—would be rendered useless due to its security. Skywalker devised a plan of encasing Echo and the team in carbonite in order to avoid detection, as the facility's security utilized life-form scanners; then his astromech droid, R2-D2, along with a group of reprogrammed B1 battle droids would fly the carbonite blocks to the Citadel. After the meeting, Echo and the team departed to the Temple's hangar bay, where a carbon-freezing chamber, maintained by Ugnaughts, was located. Having doubts of Skywalker's plan, Fives, with Echo next to him, told Cody and Rex his worries of entrusting their lives to the droids. Yet, Cody agreed with Skywalker's plan, as droids would not be detected."}, {"tag": "p", "text": "Once Echo and the team were encased in separate carbonite blocks, and stored in a Class type B, a variant of the Sheathipede-class transport shuttle, R2 and the battle droids flew the shuttle to the Citadel, located on the planet Lola Sayu. After passing the prison's life-form scan check, R2-D2 and the battle droids landed the shuttle near a cliff by the Citadel. R2-D2 released Skywalker and Kenobi's team from their carbonite blocks and the team regrouped. Leaving R2, the battle droids, and the shuttle behind, Skywalker led Echo and the team closer to the cliff's edge. Noticing they cannot utilize ascension cables to ascend to the top of the cliff, due to Electro-mines—which, if touched, would electrocute the object and sound an alarm within the prison—planted throughout the cliff's side, Skywalker and Kenobi told Echo and the rest of the team that they would have to free-climb the cliff. Near the top of the cliff, the team noticed a doorway that led into the Citadel itself was ray shielded, Skywalker's Padawan Ahsoka Tano entered the Citadel through a nearby ventilation shaft, and she deactivated the ray shield to allow Echo and the team to enter."}, {"tag": "p", "text": "Next to the doorway, Fives was helping Rex and another clone, Charger, reach the top of the cliff. However, when Charger grabbed Fives' hand, he slipped and free-fell down toward an Electro-mine, which killed him, and sounded an alarm within the Citadel. Despite alerting the Citadel of their presence, Echo and the team proceeded into the prison anyway. After entering one of the Citadel's detention area hallways, the team found out that the walls surrounding the team contained hidden blaster turrets. Once the turrets revealed themselves to the group, the Jedi utilized their lightsabers to deflect the blaster fire, while Echo and the clones fired at the turrets. The turrets were not the only trap the hallway contained, however; Longshot witnessed an electricity field that was approaching from the distance. While Echo and the others evaded the field, Longshot was not so lucky, as he was instantly killed after being hit by the electric field. The team continued on and found Piell inside a holding cell, and released him from captivity. Though they rescued Piell, the Jedi Master wanted to find his officers, who had also been taken captive by the Confederacy, as one of Piell's officers, Captain Wilhuff Tarkin, held in his memory half of coordinates of the Nexus Route; Piell was in possession of the other half. Piell and Tarkin had memorized the coordinates so that they would not fall to the Confederacy. Still within one of the Citadel's detention hallways, Echo and the team were confronted by a group of commando droids, released by the prison's warden, Osi Sobeck."}, {"tag": "p", "text": "A firefight erupted, and the Republic team destroyed the first wave of droids. Sobeck, who was watching the fight via the prison's security camera system, released more droids and activated the hallway's magnetized ceiling, which took Echo's blaster, as well as the other team member's weapons—and Skywalker, due to him having a prosthetic hand—albeit leaving the commando droids' weaponry intact. The clones tried to attack the droids with bare hands, while Kenobi, Tano and Piell used the Force, but neither tactic worked, due to the droids being magnetized to the floor. Skywalker, however, disabled the magnetized ceiling, which allowed his team to reequip themselves and finish off the droids. They soon located and freed Piell's men—Tarkin and several clone officers—from a holding cell. Believing that they might run into more trouble with Osbeck's prison guards, Kenobi decided the team should split up; Piell, half of his men, and Cody would go with Kenobi to create a diversion, while Echo, Fives, Rex, Skywalker, Tano, while Piell's other officers, including Tarkin, stay together and find an escape route that would lead them out of the prison. That way, if one squad was to be captured, the enemy would only have half the information. As Kenobi's team detonated a series of explosives in one of the corridors, Skywalker cut his way through the wall to an old tunnel—of which the strike team knew thanks to some old archive data on the Citadel—Echo and Fives resealed the entrance and continued onward through the tunnels."}, {"tag": "p", "text": "Skywalker, having contacted R2 to land the shuttle near their location, led his group through the tunnels. When they reached a dead-end, they were ambushed by several commando droids, which were armed with energy shields. Without warning, Tano tossed a few thermal detonators under the droids' feet, which destroyed them. After Tano used more explosives to blow their way through the rock, Echo and the others proceeded toward a nearby pipeline. Using the pipeline as a way to find an escape route that would lead them toward their landed shuttle, Echo and the team soon reached an exit point of the pipeline. However, outside of the exit hatch, a battalion of battle and crab droids ambushed them. The group escaped, and Skywalker tossed a grenade into the fuel line, and the resulting explosion destroyed the droids. Skywalker's team went to Kenobi's position, finding the Jedi Master and his men pinned down by droids that were guarding the shuttle. Echo and Fives joined the battle, as more and more droids arrived."}, {"tag": "p", "text": "When a commando droid, who was stationed on top of a watch tower, began to fire at their shuttle with a laser cannon, Echo reported this to Skywalker. Skywalker and Piell swooped in to attack on a commandeered STAP, but were knocked out. Determined to protect the shuttle, Echo picked up a fallen commando droid's shield to defend himself, and attempted to reach the shuttle. However, the droid destroyed the Republic team's shuttle, killing Echo in the process. Despite this, the Republic strike team was successfully evacuated by Masters Koon, Adi Gallia, and Saesee Tiin, who were leading a Republic fleet. However, Piell died before the rescue forces arrived, but he passed his knowledge of the Nexus Route to Tano."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Echo had always had an eye for detail. While stationed at Rishi Station, the trooper was not troubled by the lack of excitement. During his time in Domino Squad on Kamino, Jedi Master Shaak Ti noticed that Echo had trouble adapting to any situation. Instead of helping his fellow troopers in battle, he was constantly telling his Domino Squad members that they were disobeying orders. As a result of him \"echoing\" the rules and orders the clones had to follow, the troops within his squad gave him the nickname, \"Echo,\" which would stay with him even after becoming a clone trooper. While stationed on Rishi Station, Echo told the other stationed rookie clones that he enjoyed quiet situations, which gave him time to catch up on the regulatory manuals."}, {"tag": "p", "text": "Instead of fighting, Echo preferred to be away from the front lines. Despite this, Echo often read manuals to improve his skills he would need as a soldier fighting for the Republic. After evacuating the listening post when it was taken over by Confederate battle droids, Echo was able to inform the other clone troopers on what the manual dictated for situations without a commanding officer. Echo's service to the Republic earned him a spot within the Republic's 501st Legion. When the Confederacy invaded Kamino, Echo, who now served in the 501st Legion for several months, did not disobey Clone Commander Colt's dangerous assignment of guarding a bridge. Along with Fives, Echo tried to boost several clone cadets' confidence, when they stressed about their training being inadequate for a fight. Because of his accomplishments on Kamino that day, as well as his service within the Grand Army, Clone Commander Cody and Captain Rex allowed Echo to become an ARC trooper. Believing that the shuttle was their only means to escape from Lola Sayu, Echo was determined to protect it at all costs, sacrificing his life, but still failing in his mission."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When Echo was a clone cadet, his armor was sleek white, but his arm and leg armor featured green markings. On his chest and left shoulder armor, a \"3\" marking was painted on. Echo's rookie armor was sleek white as well, and had no dust or damage from fighting because of his lack of combat prior to the Rishi moon battle. After Rex killed the attacking Rishi eel, the clone captain used his hand to stamp some of the eel's blood onto Echo's chest armor. When Echo became a 501st Legion member, Echo's armor featured the Legion's distinctive blue markings. Echo had a patch on the left side of his legging armor that read \"For Hevy,\" which was written in Aurebesh. Echo's helmet featured red macrobinoculars. After becoming an ARC trooper, Echo switched to ARC trooper armor, which was equipped with a rangefinder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Echo was first featured in \"Rookies,\" the fifth episode in the first season of the Star Wars: The Clone Wars television series, which aired on October 24, 2008. Like all clone troopers throughout the series, he was voiced by Dee Bradley Baker. In the premiere of \"Rookies,\" Echo exclaimed the word \"hell\" once; however, this word was removed in later broadcasts of the episode. The Complete Star Wars Encyclopedia later gave Echo a short entry, and Star Wars: The Clone Wars: Visual Guide Ultimate Battles gave Echo the clone designation \"CT-26-1409.\" However, Echo was later identified as \"CT-21-0408\" in the Star Wars: The Clone Wars Character Encyclopedia. Echo later appeared in the episodes \"Clone Cadets\" and \"ARC Troopers\" of the third season of the The Clone Wars, which aired on September 17, 2010. The character was also featured in the season three episodes \"The Citadel,\" which aired on February 18, 2011; and \"Counterattack,\" which aired on March 4, 2011. Echo appears in the non-canon video game, LEGO Star Wars III: The Clone Wars, which was released in the United States on March 22, 2011 and adapted the events of \"Rookies\" in a humorous way."}, {"tag": "p", "text": "In March 2014, following the release of the sixth and final season of The Clone Wars, Supervising Director Dave Filoni mentioned that Echo survived the events of \"Counterattack.\" According to Series Writer Brent Friedman, the character was to be featured in an arc that he wrote focusing on a team of experimental clone commandos called \"The Bad Batch,\" with the story's \"emotional hook\" being Echo's relationship with Captain Rex. The arc was created as part of the series' seventh season, and was later featured on StarWars.com after the Expanded Universe was declared non-canon, before eventually releasing as part of the seventh season on Disney+."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}