{"url": "CT-19-7409", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Clone trooper sergeants"], "nodes": [{"tag": "h1", "text": "CT-19-7409"}, {"tag": "p", "text": "CT-19-7409, nicknamed \"O'Niner,\" was a clone trooper sergeant who served in the Grand Army of the Republic during the Clone Wars. In 22 BBY, he participated in the war's opening battle as well as the Battle of the Celestial Wake, and was later stationed at a listening post in the Rishi system that served as a lookout for impending Confederate attacks on nearby systems. When the station came under attack by Confederate battle droids, O'Niner ordered for a message to be sent to warn the Republic fleet. The droids, however, were jamming the station's signal, and O'Niner was killed defending the post."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The clone trooper sergeant CT-19-7409, nicknamed \"O'Niner,\" was born and raised on the remote planet of Kamino. He served in the Grand Army of the Republic during the Clone Wars and, in 22 BBY, participated in the opening battle of the war on Geonosis, as well as the Battle of the Celestial Wake, and he was later assigned to Rishi Station, a listening post on the moon of the planet Rishi. The outpost acted as an outer defense against the Confederacy of Independent Systems, as well as a lookout post to warn nearby systems of attacking Confederate forces. O'Niner commanded the other clone troopers stationed there, most of whom were \"shinies\"—new and inexperienced troopers whose armor was unscathed and shiny."}, {"tag": "p", "text": "During the war's first year, a group of Confederate BX-series droid commandos attacked the station, taking the clones by surprise. O'Niner ordered for a message to be dispatched to the Republic fleet to warn them of the advancing Confederate forces, but the droids jammed their signal, preventing any messages from being transmitted. O'Niner was quickly killed by enemy fire, and the droids took the station, leaving only four troopers—Fives, Echo, Cutup, and Hevy—alive to warn the fleet of the impending Confederate attack. With the help of Commander CC-2224 and Captain CT-7567—nicknamed Cody and Rex, respectively—who were coming to inspect the listening post, the clones managed to warn the fleet, and the Confederate attack was prevented."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sergeant O'Niner was completely loyal to the Republic, and his first concern was for its safety and that of the other clones, especially those back on Kamino. He also understood the importance of the Rishi outpost, even though many of the other troopers believed that it lacked action and excitement. His body was scarred from battles that he had served in during the war, and his brow even became furrowed from the stress of war. Niner stood 1.83 meters tall and had tan skin, brown eyes as well as black hair, which was greying at the time of his death. The sergeant was trained in combat, recon, military tactics and leadership."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "On the Rishi moon, O'Niner wore white Phase I clone trooper armor which was dirty and damaged from many battles. In battle, the clone used a DC-15S and a DC-15 blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "O'Niner made his only appearance in \"Rookies,\" the fifth episode in Season One of The Clone Wars television series. He was voiced in the episode by Dee Bradley Baker, who voices all of the clone troopers in the television series. O'Niner's clone designation was revealed in the 2009 Star Wars: The Clone Wars: Visual Guide Ultimate Battles sourcebook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}