{"url": "CT-327/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "CT-327"}, {"tag": "p", "text": "CT-327 was a clone trooper who served as a deck officer during the Clone Wars. In 22 BBY, CT-327 and a group of clone troopers were stationed in a listening post on the Rishi moon, due to the Republic's need to observe Confederate activity in the Outer Rim. CT-327 was given the task of guarding the base exterior, while the rest of the clone troopers stayed within the listening post. During one of his patrols, CT-327 noticed a meteor shower. Unbeknownst to him, Confederate droid commandos, on board a Droch-class boarding ship, were hiding in the meteor shower. CT-327 was instantly killed when one of the droids struck him with a stun baton."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "CT-327 was a clone trooper deck officer born on the Wild Space planet of Kamino. Like all clone troopers, he was a clone of the Mandalorian bounty hunter Jango Fett. In 22 BBY, during the Clone Wars, CT-327 and a group of clone troopers were stationed in a remote Republic listening post located on the moon of Rishi, due to the Republic's need to watch for Confederate activity in the Outer Rim. While a number of the clone troopers were stationed inside the listening post, CT-327 was given the task of patrolling outside the base."}, {"tag": "p", "text": "After spotting an approaching meteor shower, the clone utilized his binocular visor to get a glimpse of the ongoing event. However, unbeknownst to CT-327, Confederate droid commandos, inside a Droch-class boarding ship, were hiding in the meteor shower. A commando droid soon appeared in front of CT-327, catching him off-guard. The clone was attacked from behind by one of the invading droids, who used a stun baton to strike CT-327, resulting in his death. CT-327's failure to report in concerned Clone Sergeant O'Niner inside the base. Troopers Nub and Droidbait were sent by the sergeant to investigate 327's disappearance. However, the droids invaded the station and successfully gained control of it, although they were later defeated after Commander CC-2224 and Captain CT-7567 arrived and led the surviving clone troopers in retaking the base."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of Fett, CT-327 stood 1.83 meters tall. The clone trooper wore white Phase I clone armor and his helmet featured a red-colored binocular visor. During his patrols on the Rishi moon, CT-327 reported the status of his location to the clone troopers inside the base, and expressed that nothing occurred at the listening post. When a meteor shower began, CT-327 left his post to watch the shower. Not realizing there were commando droids inside a boarding ship hidden in the meteor shower, the clone had little time to react when a commando droid suddenly attacked and killed him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CT-327 first appeared in \"Rookies,\" the fifth episode of the first season of the Star Wars: The Clone Wars television series, aired on October 24, 2008. He was voiced by Dee Bradley Baker, who voices all clone troopers throughout the series. CT-327's designation number is another appearance of the digits \"327,\" a recurring number in Lucas' productions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}