{"url": "CT-4/619", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Clone troopers", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "CT-4/619"}, {"tag": "p", "text": "CT-4/619 was the designation of a clone trooper who served in the Galactic Republic's Grand Army during the Clone Wars, the galaxy-wide conflict between the Republic and the Confederacy of Independent Systems. Shortly after the Battle of Geonosis in 22 BBY, CT-4/619 participated in a campaign aimed at striking against Separatist activity on the planet Raxus Prime. Under the command of Bothan Jedi Master Glynn-Beti, CT-4/619 was part of a clone strike force that landed on the world near the Sith Lord Count Dooku's headquarters. During the battle, CT-4/619 and a squad of clones encountered the young bounty hunter Boba Fett, who posed as the orphan Teff. Taking Fett with him, CT-4/619 and Fett boarded a LAAT/i gunship and flew to the Acclamator-class assault ship Candaserri. Later, when the Candaserri transported additional orphans from other star systems to the gas giant Bespin, CT-4/619 worked on demilitarizing the markings on the hull of the lander that would take the orphans down to Bespin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The clone trooper designated CT-4/619 was one of the many clones of the Mandalorian bounty hunter Jango Fett born on the planet Kamino. CT-4/619 served as a trooper in the Galactic Republic's Grand Army, and fought with the Grand Army to defend the Republic against the Confederacy of Independent Systems during the Clone Wars. He participated in the Conquest of Raxus Prime in 22 BBY, after the Clone Wars opened on the barren surface of the planet Geonosis. Led by the Bothan Jedi Master Glynn-Beti, CT-4/619, along with the rest of the clone task force under her command, engaged the Sith Lord Count Dooku's battle droids as the clones attempted to halt Dooku's mission to reconfigure the Dark Reaper superweapon. On the surface of Raxus Prime, CT-4/619 and a squad of troopers encountered the young bounty hunter Boba Fett amidst the ruins of Dooku's headquarters."}, {"tag": "p", "text": "Under the alias of Teff, Fett joined the group as an orphan to receive food and shelter once CT-4/619 and the group had completed their mission. B2 super battle droids opened laser fire on CT-4/619 and the squad, forcing them to take shelter behind an excavation rig. Including CT-4/619, the squad's remaining troopers had been reduced down to three, with Fett tagging along with the group. CT-4/619 and the rest opened fire from the cover of the excavation rig, despite being heavily outnumbered. Another trooper fell, though Master Beti soon arrived, drawing the droids' attention from the group to her, allowing Boba, CT-4/619 and the remaining clone to open fire freely without retaliation. With the combined force of the Jedi and clones, the droids were destroyed. CT-4/619 led the orphan to a LAAT/i gunship and confiscated Fett's blaster, which he had used to defend himself in the lightfight moments before. CT-4/619 brought Fett into the cockpit of the LAAT/i, and the clone took one of the pilot seats while Fett sat on the floor. The two waited for fellow trooper CT-5/501, as he was to be the co-pilot, before taking the gunship to the Acclamator-class assault ship Candaserri, which was in orbit of Raxus Prime."}, {"tag": "p", "text": "Before taking off, CT-4/619 informed Master Beti via a viewscreen that he had picked up an orphan while on the mission. With CT-5/501 serving as co-pilot, CT-4/619 piloted the gunship away from the surface. As the gunship rose, a Vulture droid attacked the gunship, but the rear cannon on the LAAT/i destroyed the fighter with a barrage of fire. CT-4/619 answered Fett's questions about the Candasserri as they neared the assault ship, and proceeded to dock the gunship in one of its hangars, before taking the orphan to Beti and her Padawan, Ulu Ulix, and then seeing to his duties in the hangar. The Candaserri traveled to the gas giant Bespin, where the ship's crew planned to offload orphans whom they had acquired from numerous star systems. Upon arrival, CT-4/619 demilitarized the lander that would take the orphans down by painting out all military related markings on the craft, as Bespin was neutral in the war and its officials wanted no signs of the conflict on Bespin. While demilitarizing the lander, CT-4/619 once again met Fett before the orphan was transported to the floating outpost of Cloud City."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of Jango Fett, CT-4/619 stood 1.83 meters high. He followed protocol and instructions thoroughly, and was able to hold his ground in a firefight alongside his squadmates despite being vastly outnumbered. Knowing the Candaserri well, CT-4/619 was able to answer questions from Fett on things such as the starship's crew. Upon meeting Fett before the orphan departed for Cloud City, CT-4/619 did not remember the orphan whose life he had saved."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CT-4/619 first appeared in the novel Boba Fett: Crossfire, written by Terry Bisson and released on November 1, 2002. CT-4/619 later received an entry in The Complete Star Wars Encyclopedia, an encyclopedia published by Del Rey in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}