{"url": "CT-411", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Clone trooper commanders", "Category:Members of the 91st Mobile Reconnaissance Corps"], "nodes": [{"tag": "h1", "text": "CT-411"}, {"tag": "p", "text": "CT-411, nicknamed \"Ponds,\" was a clone trooper officer who held the military rank of Clone Commander. Ponds was bred from the genetic template of the human bounty hunter Jango Fett. During the Clone Wars, he served under the command of Jedi General Mace Windu in the Grand Army of the Republic. On Geonosis, Commander Ponds arranged for five special commando units to follow Windu's orders during the first battle of the war. Specializing in military reconnaissance, Ponds was the commander of Lightning Squadron, a division of Advanced Recon Force Scout Troopers in the 91st Mobile Reconnaissance Corps."}, {"tag": "p", "text": "As the conflict between the Galactic Republic and Confederacy of Independent Systems spread across the galaxy, Ponds accompanied Windu on a Republic Military campaign to the Outer Rim planet of Ryloth in order to liberate the Twi'lek homeworld. There he fought alongside Windu with the support of Lightning Squadron, including troopers CT-6910 \"Razor\" and \"Stak.\" After joining forces with the Twi'lek Resistance, Ponds and Windu led a direct assault on the capital city of Lessu, captured Emir Wat Tambor and ultimately lifted the Separatist occupation of Ryloth."}, {"tag": "p", "text": "In addition to the campaign on Ryloth, Ponds participated in the Battle of Malastare where he assisted Windu in the capture of a Zillo Beast. He was later stationed on the Venator-class Star Destroyer Endurance at a time when the bounty hunter Boba Fett plotted to assassinate Windu. After the Republic warship crashed on the surface of Vanqor—having been sabotaged by Fett—Ponds was taken prisoner by Fett's mercenary allies along with Admiral Kilian and a clone navigation officer. He was executed shortly afterward by Aurra Sing in an attempt to lure Windu into a trap. Despite the commander's death, Fett ultimately failed in his attempts to kill Windu and was sent to prison after the Jedi captured him on Florrum."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origin and training"}, {"tag": "p", "text": "CT-411, also known as \"Ponds,\" was a Clone Commander who belonged to an army of Kamino-based clone troopers—grown from the genetic material of the bounty hunter Jango Fett—created to serve the Galactic Republic. By modifying Fett's genetic structure, the Kaminoans accelerated the clones' aging process so that they would reach maturity within a decade of their inception. Around the same time, the Republic was on the verge of civil war due to a growing secessionist movement that ultimately led to the creation of the Confederacy of Independent Systems. As a result, Ponds and his brethren were pressed into service as the backbone of the newly-formed Grand Army of the Republic in 22 BBY."}, {"tag": "p", "text": "Unlike many of the other Clone Commanders, Ponds did not receive ARC training, though as a part of the first batch of clone trooper officers, Ponds was trained by Jango Fett himself, as well as other senior instructors. By the end of his training, Ponds was specialized in military reconnaissance, but notably was not briefed on how to interact with Jedi high command and was also not selected to be part of the program that trained clone officers on how to work as liaisons between Jedi Generals and clone troopers. On the onset, Ponds was trained with the DC-15A blaster rifle."}, {"tag": "h3", "text": "First Battle of Geonosis"}, {"tag": "p", "text": "Ponds was one of many clone troopers of the two battle armies who accompanied Yoda, the Grand Master of the Jedi Order, to the planet Geonosis where they fought the Confederacy's droid army, igniting the First Battle of Geonosis and the galaxy-wide conflict known as the Clone Wars. During the battle, he provided Jedi Master Mace Windu with five special commando units when Windu requested it from him. From that point, Ponds served with General Windu as his preferred liaison and second-in-command. Although his training lacked instructions on how to interact with the Jedi like the adjutants Prime Minister Lama Su introduced to Yoda, Ponds was able to gain the trust of Windu. Ponds found himself in a role interacting with high command despite not being briefed on it, and Windu kept the trooper by his side throughout the battle."}, {"tag": "p", "text": "At one point in the battle on Geonosis, Commander Ponds was on the command bridge of a SPHA-T walker, directing efforts with a Clone Captain on the walker's bridge after Yoda ordered the artillery walkers to focus their attack on the nearest Separatist core ship, successfully bringing it crashing towards the surface. Following the ship's crash and ensuing sand storm, Ponds and the other clone troopers were glad that their helmets had a respiration filter."}, {"tag": "p", "text": "Following the Republic victory on Geonosis, Ponds remained at Windu's side as the Clone Wars spread across the galaxy, and when Windu took permanent command of the 91st Mobile Reconnaissance Corps, Commander Ponds would go with him. A specialist in military reconnaissance, he would also serve as the commanding officer of Lightning Squadron, a ground squadron of Advanced Recon Force Scout Troopers within the corps."}, {"tag": "h3", "text": "Battle of Ryloth"}, {"tag": "p", "text": "Early in the war, Ryloth—the home planet of the Twi'lek species, located in the Outer Rim Territories—fell to a Separatist invasion led by Emir Wat Tambor, foreman of the Techno Union and a member of the Separatist Council. Though the Confederacy navy formed a blockade around the planet in preparation for a Republic attack, Jedi General Anakin Skywalker and his Padawan, Jedi Commander Ahsoka Tano successfully created a breach in the enemy's defense perimeter, allowing for Ponds and General Windu to bring their ground forces to Ryloth."}, {"tag": "p", "text": "The ground invasion was stalled by several J-1 proton cannons; located in the city of Nabat, the cannons opened fire on the Acclamator-class assault ships, destroying one of them just as Ponds informed Windu that the proton bombs had penetrated the transports' deflector shields. After the cannons were destroyed by General Obi-Wan Kenobi and the 212th Attack Battalion, Windu and Ponds brought the ground forces to the surface and proceeded to march on the capital city of Lessu."}, {"tag": "p", "text": "En route to the capital, the Republic army was ambushed by a group of Armored Assault Tanks. At Windu's direction, Ponds ordered Lightning Squadron to engage the Separatists and although they succeeded in destroying the tanks, the casualties they sustained necessitated the need for reinforcements. To that end, Windu sought out Cham Syndulla to form an alliance with the Twi'lek Resistance while Ponds remained with the main force. After discovering a local village populated by women and children, Ponds intended to provide them with some of the army's rations, only to witness the village's destruction by a group of Separatist Hyena-class Droid Bombers. Upon learning of the attack from the commander's report, Syndulla committed his resistance fighters to the Republic's imminent assault on Lessu."}, {"tag": "p", "text": "The battle for Lessu commenced with Windu leading the initial attack on the city, leaving Ponds and Syndulla to direct their combined forces into Lessu while the Jedi Master proceeded to capture Wat Tambor. Having succeeded in driving the remaining Separatists away from Ryloth, Ponds—along with Windu, Syndulla, and Senator Orn Free Taa—attended a victory parade in Lessu where the Twi'leks celebrated their renewed liberty."}, {"tag": "h3", "text": "Battle of Malastare"}, {"tag": "p", "text": "In 21 BBY[source?] Ponds accompanied Windu to Malastare, a Mid Rim planet rich in natural fuel reserves. Working in conjunction with the native Dug population, as well as Anakin Skywalker and Clone Captain CT-7567 \"Rex\" of the 501st Legion, Ponds' clone troopers defended Malastare against an army of Separatist battle droids. During the battle, the Republic field-tested an experimental superweapon called the electro-proton bomb, which could release an electromagnetic pulse disabling the Separatists' droids while causing no harm to the clones."}, {"tag": "p", "text": "However, the bomb also had an adverse effect on the environment of Malastare, causing parts of the surface to break and form a large sinkhole in the center of the battlefield. Following the battle, Ponds formed a search party with Windu and clone troopers Trapper and Hawkeye and traveled into the pit to rescue survivors. In the course of their search, they encountered the Zillo Beast, a large creature that had been awoken from its slumber by the detonation of the bomb. Ponds, Trapper, and Hawkeye opened fire, but the creature's skin proved impervious to blasters and even lightsabers. After Ponds, Windu, and Trapper escaped from the sinkhole, the Republic succeeded in capturing the Zillo Beast by using several RX-200 Falchion-class assault tanks to incapacitate it."}, {"tag": "h3", "text": "Service aboard the Endurance"}, {"tag": "p", "text": "Later in the Clone Wars, Ponds joined Windu and Skywalker aboard the Venator-class Star Destroyer Endurance, commanded by Admiral Kilian of the Republic Navy. Unknown to Ponds and the crew, however, Boba Fett—an unaltered clone of Jango Fett—infiltrated the Republic flagship by posing as a member of the Clone Youth Brigade. After failing to assassinate Windu, who killed Jango in single combat on Geonosis, Boba sabotaged the Endurance in order to escape the vessel. Unable to prevent the Star Destroyer from crashing on Vanqor, the crew was evacuated in the escape pods, although Ponds elected to stay behind as Kilian refused to leave the bridge."}, {"tag": "h3", "text": "Capture and death"}, {"tag": "p", "text": "Ponds survived the crash of the Endurance on Vanqor, but was soon captured along with Kilian and a clone navigation officer by the bounty hunters Boba Fett, Aurra Sing, Bossk, and Castas. By the time Windu and Skywalker arrived at the crash site to search for survivors, the mercenaries had taken their prisoners to Slave I. While Windu and Skywalker conducted search and rescue, Windu commented that Ponds had been on the bridge, and when a Pelta-class frigate was ready to depart with the survivors, Windu commented that they must assume Ponds and the rest of the officers were lost. While traveling through space, Sing executed Ponds, whose death Windu and Skywalker witnessed through a holographic transmission that was sent to the Jedi Temple on Coruscant. Skywalker sadly commented on the footage, while Windu only watched in grim silence."}, {"tag": "p", "text": "After Ponds' death, his body was jettisoned into space as the bounty hunters continued on their way to Florrum, where they were confronted by Plo Koon and Ahsoka Tano. Ultimately, the two Jedi successfully rescued the remaining hostages and captured Fett, who was sent to prison as punishment for his actions aboard the Endurance as well as the taking of hostages. The body of Ponds was considered lost after it was jettisoned, and despite the success of capturing the culprits, there was nothing that could be done about Commander Ponds, who was considered a hero of the Republic."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like clone troopers in general, Commander Ponds was an obedient soldier who followed orders. His Jedi General, Mace Windu of the Jedi High Council, trusted Ponds since the beginning of the Clone Wars. During the campaign of Ryloth, Ponds tried to provide a local settlement—populated mostly by women and children—with spare rations from his own regiment so that the people would not starve, only to witness the village's bombardment by Separatist bombers. When the Endurance was sabotaged and set to crash on Vanqor's surface, Commander Ponds felt that it was his duty to remain with Admiral Kilian and the bridge officers. By the time of his death, Ponds was considered a hero of the Republic."}, {"tag": "p", "text": "As a clone of Jango Fett, Ponds was a human male who stood at 1.83 meters. He had brown eyes and his head was shaved."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Although not being a part of several advanced training programs such as the ARC program or the program to train clone troopers to serve as liaisons with the Jedi, Ponds was highly skilled in leadership, becoming the second-in-command after General Mace Windu. Ponds was also highly skilled in reconnaissance, and as an officer within the 91st Mobile Reconnaissance Corps, Ponds was able to lead armored vehicles in combat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "At the start of his service in the Grand Army of the Republic, Ponds wore the standard Phase I clone trooper armor with the yellow markings of a clone commander. Following the Battle of Geonosis, the Jedi encouraged the clones to develop their sense of individuality. Ponds therefore customized his armor to designate his unit affiliation, which included the phrase \"some guys have all the luck\" stenciled in Aurebesh on the back of his helmet. He also wore a Republic officer uniform during the early stages of the Battle of Ryloth. Ponds' helmet, like all the others, was equipped with a comlink system which kept Ponds in communication with Jedi commanders and clone troopers."}, {"tag": "p", "text": "In addition to the standard DC-15A blaster rifle, which Ponds used on Ryloth, he wielded two DC-17 blaster pistols which he adopted when many other commanders did as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ponds first appeared in the 2002 film Star Wars: Episode II Attack of the Clones of the Prequel trilogy. Like every clone trooper in the film, he was voiced by actor Temuera Morrison and portrayed entirely through computer-generated imagery. He later appeared in the 2008 television series Star Wars: The Clone Wars and was voiced by Dee Bradley Baker, who provided the voices of all clone troopers throughout the series' run."}, {"tag": "p", "text": "In \"Lethal Trackdown,\" Ponds states that his clone designation number is CT-411. In Ponds' encyclopedia entry on Star Wars.com, however, it establishes that his designation is CC-6454, and this number was also used in Star Wars: On the Front Lines."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}