{"url": "CT-4040", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Clone cadets", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "CT-4040"}, {"tag": "p", "text": "CT-4040, nicknamed \"Cutup\" was a clone trooper who served in the Grand Army of the Republic during the Clone Wars. A member of Domino Squad, Cutup was trained on the planet Kamino before being stationed on a listening post on the Rishi Moon. In 22 BBY, Rishi Station was attacked by Separatist commando droids and the troopers were forced to evacuate. During the escape, Cutup was attacked and eaten by a giant Rishi eel."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Training on Kamino"}, {"tag": "p", "text": "A clone of the bounty hunter Jango Fett, CT-4040 was born on the planet Kamino."}, {"tag": "p", "text": "A member of Domino Squad, CT-4040 and his fellow clone troopers, CT-00-2010, CT-5555, CT-782, and CT-1409, were on the verge of being assigned sanitation duty as a result of poor performance in training. Although each member of the squad had their shortcomings, one of their drill instructors, the Siniteen Bric, blamed CT-4040 for the squad's failure. One evening, before their final attempt at the Citadel Challenge training course, CT-4040 met with Bric in the hangar, where Bric berated him, saying that everything was a joke to him and that he couldn't even take his own training seriously. However, CT-4040 only laughed and decided to embrace the nickname \"Cutup\" after Bric used it to refer to him. Despite seemingly not being effected by the conversation, Cutup and his brothers, who each had their own perspectives refreshed in various ways, banded together and were determined to complete the challenge. They progressed very well in the early stages, but eventually, Cutup and his squad learned that they had been sabotaged and did not have their ascension cables, which they needed to scale to the top of the citadel. Although Bric had been the one to sabotage them, the squad used their ingenuity and found a way to complete the challenge nonetheless. Cutup and his squad were ultimately commissioned to fight in the ongoing Clone Wars."}, {"tag": "h3", "text": "Rishi Station"}, {"tag": "p", "text": "The escalating war demanded more troops and many inexperienced clones—including Cutup—were pushed into service before their intensive training could be completed. Cutup and his Domino Squad mates were stationed at a listening post called Rishi Station, located on the Rishi Moon. In 22 BBY, as part of their plan to attack the clone troopers' homeworld Kamino, the Confederacy of Independent Systems launched a surprise assault on Rishi Station. As BX-series droid commandos stormed the listening post, Cutup and CT-5555, nicknamed \"Fives,\" CT-1409, known as \"Echo,\" and CT-782 \"Hevy\" were forced to flee through a ventilation shaft. After they escaped the outpost, they emerged onto the surface underneath the station. However, a Rishi eel appeared and attacked Cutup, killing him. The remaining clone troopers eventually managed to alert the Galactic Republic about the Separatist attack, thwarting a possible invasion of Kamino."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Cutup\" first appeared in \"Rookies,\" the fifth episode of the first season of the The Clone Wars TV series, aired at October 24 2008. He also appeared in the first episode of the third season, titled \"Clone Cadets,\" which chronologically took place before \"Rookies.\" In the episodes, he was voiced by Dee Bradley Baker, who voices all clone troopers through the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}