{"url": "CT-5385/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "CT-5385"}, {"tag": "p", "text": "CT-5385, nicknamed \"Tup,\" was a rookie clone trooper who served in the Grand Army of the Republic during the Clone Wars. He was one of the many clones created for the Grand Army of the Republic by the Kaminoans using Jango Fett's genetic template. He served with the 501st Legion during a battle on Umbara near the end of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Battle of Umbara"}, {"tag": "h4", "text": "Opening actions"}, {"tag": "p", "text": "Around 21 BBY, Tup was part of the 501st Legion of the Grand Army of the Republic. During this time, Umbara was seceding from the Galactic Republic to join the Separatists following the assassination of their senator, Mee Deechi. The Republic launched a massive invasion to prevent the technologically advanced weapons of the Umbarans from falling into enemy hands. Tup served under Jedi General Anakin Skywalker and Captain Rex as the 501st participated in the opening of the massive battle. The 501st's goal was to help capture the capital of Umbara."}, {"tag": "p", "text": "As the gunships carrying the 501st landed, they were met with heavy resistance from the native Umbaran militia. After the 501st had beaten back the initial wave and established a foothold on enemy turf, the soldiers were allowed a short time to rest before pushing on to the capital. This rest was not to last, however, as an Umbaran ambush on the Republic's rear defenses forced them to retreat off the ridge they had been resting on. The ridge was cleared of enemies by Oddball and another pilot as they bombed the ridge with Y-wings."}, {"tag": "p", "text": "Before the 501st could move out and try to take the capital, General Skywalker was called back to Coruscant at the request of Supreme Chancellor Palpatine and replaced by Jedi General Pong Krell. After marching for 12 hours straight, Krell modified the original plan and sent Captain Rex and a few platoons down the main road leading to the capital of Umbara. Many clones questioned this plan, including Tup. Their fears were confirmed when mines that had been buried under the main route to the Capital were detonated. This was followed by an Umbaran ambush, causing Rex to order a retreat which drew the enemy out of cover so that the 501st could see and shoot them. Reluctantly, Krell sent in some reserve clones and AT-RT drivers to aid the retreating platoons. The clones managed to hold their ground and beat off the attacking Umbarans but the plan to capture the capital via the main road had been compromised and, from General Krell's view, Rex was to blame."}, {"tag": "p", "text": "The Umbarans soon made a counter attack against the clones. During the battle, Krell received a transmission from Jedi General Obi-Wan Kenobi, telling him that the Umbaran capital was too heavily fortified. General Kenobi informed Krell that an airbase was resupplying the capital and that they should capture it on the way to his position. The clones retreated from the battle zone and headed towards the location of the airbase."}, {"tag": "p", "text": "They soon encountered a huge gorge, at the end of which was the Umbaran airbase. Krell recklessly sent half his clone forces straight down the middle of the gorge, on the argument that they did not have enough time to find a safer route, while keeping the rest of his forces in reserve for the final assault on the airbase. Almost all the clone troopers, including Tup, were angered by the poorly thought out plan which seemed suicidal and questioned Krell's sanity. During their advance down the gorge, the clones were attacked by Umbaran Crawler Tanks that caused the deaths of many clone troopers. They defeated the tanks by destroying the first two with rocket launchers and the rest by spreading explosives along the opening of a hollow that the clones had been forced into."}, {"tag": "p", "text": "After this victory, the clones were attacked yet again by the Umbarans, though this time the Umbaran Militia brought with them three MHCs. These juggernauts decimated the clone troops because of their heavy artillery and impenetrable ray shields. For Tup, it seemed as if it was the end of him, but Captain Rex had an idea; although it went against Krell's orders, it would see the clone troopers achieve victory over the juggernauts."}, {"tag": "p", "text": "Rex sent two men, Fives and Hardcase, to infiltrate the airbase and steal two Umbaran starfighters that would possibly be able to penetrate the MHCs ray shields. Tup, and the rest of the clone forces that were deployed into the gorge, held off the MHCs until the two clones returned with the starfighters which successfully destroyed the three MHCs. The remainder of Krell's clone forces were deployed to capture the Umbaran airbase and were led by Sergeant Appo. They successfully captured the airbase but then discovered that there was also a supply ship, guarded by a strong fleet contingent, that was resupplying the capital as well."}, {"tag": "h4", "text": "Mutiny against Krell"}, {"tag": "p", "text": "After cracking the Umbaran military codes in the native militia equipment, Rex informed Krell that they could use the Umbaran starfighters to destroy the supply ship, but Krell rejected the idea. Fives recruited Jesse and Hardcase, against Krell's orders, to pilot three Umbaran starfighters into the supply ship and blow it up from the inside."}, {"tag": "p", "text": "While Tup was attempting to sleep, he was woken up by Dogma who noticed that Fives and his two comrades were missing. Tup denied knowing about it, even though he was in the same room when Fives was searching for recruits, but Dogma convinced him to tell Krell about Fives' rogue plan after he informed him that they could be court-martialled if they knew about the plan. Tup relented and followed Dogma to Krell's command tower. However, they were stopped by Rex who inquired about the duo's purpose. Tup silently watched as Dogma attempted to trick his way into the tower, though Dogma gave up when he realized that Rex wasn't going to give. Dogma left, leaving Tup with Rex."}, {"tag": "p", "text": "Meanwhile, Fives' strategy went well at first but after entering the Separatist supply ship, ray shields were raised over the ship's reactor, causing Hardcase to sacrifice his life to destroy the support ship. The explosion of the frigate was seen by Rex and Tup on the ground. Jesse and Fives escaped the doomed cargo vessel but were court-martialled by Krell after they landed."}, {"tag": "p", "text": "Krell then decided that Jesse and Fives should be executed so that no other clones would follow their example. Tup was one of the six clones that made up Jesse and Five's firing squad, though they all purposefully missed after hearing Fives' speech, knowing that the execution was wrong. Dogma, however, was still intent on following Krell's orders in the idea of being a good soldier, but Rex remarked that no one would follow his order to proceed with the execution. After Rex and Dogma were called to come before Krell for stopping the execution, a transmission warned them that the Umbarans had taken an armory, enabling them to disguise themselves in clone armor."}, {"tag": "p", "text": "Krell then ordered the 501st Legion to attack the enemy and warned them of the enemy's 'clone disguise' advantage. As the clone troopers reach the coordinates given to them by Krell, Dogma almost tripped on a \"vine\" but Tup warned him that this was a Vixus tentacle and threw a rock at it's dormant mouth. The vixus awoke and thrashed its tentacles around for prey. Suddenly, enemy fire rang out from ahead and Tup and Dogma prepared to exchange fire but the low visibility made it hard for them to get a clear visual. Rex then ordered mortar launchers to be fired and then asked if Kix can spot the enemy. By utilizing a rangefinder, Kix spotted what was believed to be hostile Umbarans wearing 212th Attack Battalion armor. As Rex moved forward up the battlefield, he spotted a deceased 'disguised Umbaran'. As he takes off the helmet, Rex realizes its not an Umbaran but a clone trooper. Shocked, Rex took off his helmet and also a 212th Attack Battalion trooper's helmet to warn both sides that they were killing each other."}, {"tag": "p", "text": "Tup and the rest of the clones mourned the passing of their fellow brethren while Rex discovered, from the dying clone named Waxer, that Krell had ordered them to stop enemy Umbarans at these coordinates. Waxer then dies of the wounds he had sustained during the battle. Rex leads the 501st and 212th Attack Battalion back to the airbase to arrest Krell for treason against the Republic. Along the way, the clones release Fives and Jesse from their imprisonment in the brig and giving them their weapons back."}, {"tag": "p", "text": "Captain Rex ordered that Tup, the 501st Legion, and 212th Attack Battalion capture and question Krell. As they enter the tower, the clones surrounded Krell. Rex asked him to surrender and questioned him of his actions. Krell replied with taunting remarks and forced Tup and the other clones across the room by using the Force before killing several of the clones in the room and escaping out the window. He killed several more clones that were on the ground before escaping into the forest."}, {"tag": "p", "text": "When Tup, Rex, Fives, Jesse and the surviving clones chased after Krell, Dogma prepared to stop them for being, what he called, traitors. He pointed his blaster at Tup, who managed to persuade him to lower his weapon. Dogma relented and was immediately apprehended by two clones who then took him to the brig. The clones entered the forest and were once again attacked by Krell who began to kill clones with his bare hands."}, {"tag": "p", "text": "Tup, who survived Krell's attempt to kill him, was thrown near a vixus. He came up with an idea and had Rex order the remaining clones to lure Krell towards him—and the vixus. As Krell chased the clones, Tup fired at him and taunted him. As Krell ran towards Tup, he was grabbed by the vixus' tentacles and struggled to escape. He cut off the creature's hand-like tongue and one of its vines, which caused it to release him in the process, Tup killed the vixus and stunned Krell with a stun blast. Krell was then taken back to the brig."}, {"tag": "p", "text": "As the traitorous General was captured, Tup, Rex, Fives and Jesse questioned Krell for his hateful nature against the clones. He responded with the fact that he had foreseen a new order, a successor to the Republic, and he wanted to become Sith Lord Count Dooku's apprentice by sabotaging the clones' plan, which would secure Umbara for the enemy. Krell boasted that he would rule as part of it."}, {"tag": "p", "text": "Outside, the group discussed Krell's fate as he said that when the Umbaran Militia arrived, they would free him and he would reveal all of the Republic's secrets to them. Tup decided that he was too dangerous to be left alive and that they should 'dispose' of him. The others concurred and went back to the brig. Fives freed Dogma as Captain Rex prepared to kill Krell. Krell taunted Rex, believing that he couldn't kill him, until he was shot through the heart by Dogma, who had taken Fives' pistol."}, {"tag": "p", "text": "The 501st Legion received news that Kenobi's forces had taken the capital and stopped the remaining Umbarans, securing Umbara for the Republic."}, {"tag": "h3", "text": "The biochip conspiracy"}, {"tag": "h4", "text": "Battle of Ringo Vinda"}, {"tag": "p", "text": "During the Battle of Ringo Vinda, in which Republic forces attacked a space station encircling the planet, Tup fought alongside the 501st Legion. Shortly after saving Fives from a damaged B1 battle droid, Tup began to feel uneasy. As the battle progressed, his feelings of unease worsened and eventually culminated in Tup executing Jedi General Tiplar. The execution of Tiplar caused the Republic attack to lose its momentum, forcing Skywalker to order a retreat. As the retreat progressed, Fives took Tup into custody and was ordered to return him to base for questioning. Once back at a Republic command post, Tup initially seemed unaware of what had happened. However, as he was being questioned by Rex, Tup launched himself at General Tiplee, the sister of Tiplar, though this attack failed, as Tiplee used the Force to throw him against a wall. Tup was further examined by Kix and it was determined he had suffered some sort of breakdown, though clones had been designed to withstand any kind of stress. It was speculated that it may have been some sort of virus, and Kix suggested taking Tup to Kamino, where additional scans could be completed."}, {"tag": "h4", "text": "Kamino Examination"}, {"tag": "p", "text": "Sent back to Kamino for examination, he was captured en route by the Separatists. He was rescued by Fives, Rex and Anakin, and was sent to Kamino. Fives, determined to rescue his friend, performed a scan of his brain and, with the help of a medical droid, AZ-3, removed the \"tumor\" in his brain—a malfunctioning inhibitor chip. After the surgery, he seemed happy, saying he was free from \"the mission that never ends...the mission in our nightmares...\", before passing away."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tup, as he was a relatively new clone trooper, followed along behind Jesse, Rex, Dogma, Fives and Hardcase. He adopted some of their personalities while keeping his cautious nature his own, though when he was in battle he became tense and nervous. Throughout the battle on Umbara, he was torn between the undying loyalty that Dogma showed Krell and the leadership of Captain Rex."}, {"tag": "p", "text": "Despite the fact that he was a rookie, Tup managed to lure Krell into a trap and subdue him with a stun blast, leading to the incarceration and eventual execution of the traitorous Jedi."}, {"tag": "p", "text": "Like all clones of Jango Fett, Tup stood 1.83 meters tall. Tup grew out his hair and put it up in a bun. He sported a tear drop tattoo under his right eye and his helmet had a tear drop design that reflected his tattoo."}, {"tag": "p", "text": "By 20 BBY, however, he ended up having schizophrenic episodes where he entered a trance about \"good soldiers always following orders,\" which eventually led to him shooting a Jedi commander in the head during combat. This was the result of a defective biochip that had been implanted into his brain during his development, which carried a secret order against Jedi commanders when the time came."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Battle of Umbara, Tup was equipped with the Phase II battle armor, a lightweight and adaptable version of the clone troopers' original armor that became the standard uniform for clones in the Grand Army of the Republic. Tup used a DC-15S and a mortar launcher during the battle of Umbara. As a soldier of the 501st Legion, Tup's armor sported the blue markings of the 501st. Tup personalized his armor by painting a blue tear (identical to, and in the same positioning as, his tattoo) under his right eye on his helmet and one on each shoulder plate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tup first appeared in the episode \"Darkness on Umbara\" of Star Wars: The Clone Wars. He was voiced by actor Dee Bradley Baker, who voiced all of the clone troopers in the TV series. Tup was featured in a promotional video on StarWars.com, in which it was announced that The Clone Wars was ending, and he was shown to appear in an as-of-yet unreleased story arc that is expected to be released as bonus content."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}