{"url": "CT-5597/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "CT-5597"}, {"tag": "p", "text": "CT-5597, nicknamed \"Jesse,\" was a clone trooper who served in the Grand Army of the Republic's 501st Legion during the Clone Wars. Jesse participated in a hunt for the Confederate General Grievous on the planet Saleucami around 21 BBY. During the hunt, Jesse, along with troopers Hardcase and Kix, went with Clone Captain Rex to search for escape pods that had been jettisoned from Grievous' crashed ship. After two commando droids attacked and injured Rex, Jesse, Hardcase, and Kix took the injured Captain to a nearby homestead to recover, and then afterward Jesse led the remaining two clones to High Jedi General Obi-Wan Kenobi, who was leading another group of clones troopers on the planet. Continuing his service in the 501st Legion, Jesse went with the legion to the Confederate-aligned world Umbara, where he participated in a battle alongside Rex and Jedi General Anakin Skywalker."}, {"tag": "p", "text": "After engaging the Umbaran Soldiers in combat on the world, another Jedi, General Pong Krell, arrived on Umbara and relieved Skywalker of his duties. As the interim leader of the 501st, Krell wanted Jesse and the clones to take over Umbara's capital city. A nearby airbase was resupplying the city's defenses, although after Hardcase and ARC Trooper Fives infiltrated the base, Krell's troops forced the Umbaran militia there to surrender, allowing the Republic force to fortify themselves in the airbase. After Jesse and the battle group learned of a Confederate supply ship in orbit of the planet, Jesse and Hardcase joined Fives' mission of destroying the ship. The three clones used Umbaran starfighters to board the supply ship, and once there, Hardcase sacrificed himself by staying behind to destroy the ship. Jesse and Fives returned to Umbara, only to be imprisoned for disobeying orders from Krell. The two clones were to be executed for their crime, although Krell soon revealed himself to be a traitor of the Republic. After Krell was captured by the clones, which would later result in Krell's death, Jesse and Fives were set free, and the battle resulted in a Republic victory."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Finding Grievous"}, {"tag": "p", "text": "CT-5597, who went by the nickname \"Jesse,\" was a clone trooper who served in the Grand Army of the Republic. Around 21 BBY, during the Clone Wars, Jesse served the Galactic Republic under the command of High Jedi General Obi-Wan Kenobi. After a battle above the planet Saleucami, Confederate General Grievous used an escape pod to jettison from his starship and landed on Saleucami's surface. Chasing after Grievous, Kenobi gathered a team of clone troopers, including Jesse, to find the cyborg general on the planet's surface. The team found the wreckage of a crashed ship, and Commander CC-2224, nicknamed \"Cody,\" told Kenobi that the ship had crashed recently. Kenobi decided to split the group into two teams and ordered Captain CT-7567, nicknamed \"Rex,\" to find the other missing escape pods with troopers Jesse, Kix and Hardcase, while he, Cody, and Crys stayed behind to go through the remains of the crashed ship."}, {"tag": "p", "text": "After mounting separate BARC speeders, the team drove through the wetlands of the planet's surface. Ahead of them, two commando droids were on top of a hill overlooking the clones. Utilizing a blaster sniper rifle, one of the droids shot Rex, knocking the clone captain off his speeder. Jesse ordered Kix and Hardcase to turn their BARCs around and protect the captain, while he drove toward the hill from where the shot had been fired. Jesse used his BARC speeder's blaster cannons to fire at the droids, destroying them. Returning to Rex, the team's medic, Kix, informed Jesse that Rex's injury was severe. Jesse told the team that the two droid commandos might have called for backup, and they needed to find shelter for Rex. After noticing domesticated eopies, Jesse concluded that they were on farmland, which meant there was a nearby homestead. Kix attached a flatbed on a side of his BARC speeder and laid Rex on top of it before Jesse and the team drove off to find the farmer's homestead."}, {"tag": "p", "text": "Upon arriving at the nearby homestead, a female Twi'lek, Suu, greeted the clones warily, pointing a rifle at the intruders. Jesse and Kix informed her that they were friends and they needed a place to settle the injured Rex for the night, and Suu gave the clones permission to use the barn. After Kix placed a bacta patch on Rex's wound, he regained consciousness and Jesse and the other troopers informed him of what had occurred. Before the team left to continue their search for the escape pods, Rex gave Jesse the responsibility of leading the search party. After the clones boarded their BARC speeders, Kenobi contacted the group via comlink and called for Rex. Jesse responded and informed the Jedi Master that Rex had been injured, and that the had given him the duty of leading the search for the escape pods. Kenobi told Jesse that Grievous was heading for an abandoned escape pod, and ordered the troopers to drive westward."}, {"tag": "p", "text": "Soon, Jesse contacted Kenobi, and the clone trooper told him that he had a visual of the escape pod. Grievous was the first to arrive at the escape pod, and Kenobi had already engaged Grievous' forces by the time Jesse's team arrived on their BARC speeders. As Jesse fired his speeder's blaster cannons at Grievous' battle droids, he spotted an approaching Confederate shuttle in the sky and warned Kenobi via comlink. After a clone trooper on board an AT-TE walker told Kenobi that the walker's guns were overheated, Kenobi ordered Cody and Jesse to cover him as he raced toward Grievous. Kenobi and Grievous engaged in a lightsaber duel as the Confederate shuttle approached them, eventually coming to a hovering stop above the escape pod; Grievous fired his tow cable on the hull of the shuttle and fled in the vehicle. Jesse and Cody, on board their speeders, returned to Kenobi after dispatching the remaining battle droids. The Jedi Master told both clone troopers to contact the fleet and order them to send a transport to pick them up."}, {"tag": "h3", "text": "Shadow world"}, {"tag": "p", "text": "Under the command of Jedi General Anakin Skywalker, Jesse was dispatched to the Confederate-aligned planet Umbara. The Republic task force sent there initiated an attack to the retake the world that was once part of the Republic, and capture its capital city. Aboard a Acclamator-class assault ship, which broke through the Confederate blockade in orbit of Umbara, Jesse boarded Clone Lieutenant Hawk's gunship with Skywalker, Rex, Tup, and several other 501st Legion troopers. As Hawk's and other Republic gunships descended through the shadowy world's atmosphere to the surface, the Umbaran militia stationed on ground level fired on the advancing Republic gunships. Although some gunships crashed as a result of the heavy fire, Hawk was able to maneuver the shuttle to avoid being shot down. As the gunship positioned itself over its designated landing site, Jesse and the troops deployed and readied themselves to engage the attacking Umbaran Soldiers of the Umbaran militia."}, {"tag": "p", "text": "Flanked by AT-RT-mounted troopers, Jesse and the troops pushed toward the Umbaran front. Soon, trooper Hardcase, who had landed on the world on a separate gunship, met up with Jesse, Skywalker, Tup, ARC trooper Fives, and Rex. Rex informed Jesse and the men that they had to eliminate enemy Umbaran soldiers on a nearby ridge. Once it was taken over, Jesse made camp on the trench-filled ridge with the rest of Skywalker's team. Behind Skywalker's camp, several Umbaran soldiers spotted the clones and one released a millicreep probe droid to infiltrate the area. The probe droid, whose purpose was to distract the clones and help the Umbarans prepare for their subsequent attack on the Republic force, caught the attention of Hardcase and various clones. Soon the hidden Umbarans revealed themselves and began their ambush on Skywalker's forces. Despite the surprise attack from the Umbarans, Rex called in an air strike team, led by Clone Commander pilot \"Odd Ball,\" to suppress enemy fire. Before Odd Ball's bombers arrived at their position, Skywalker led Jesse and the rest of the clones off the ridge."}, {"tag": "p", "text": "Not long after, a space gunship, surrounded by two clone Z-95 starfighters, landed near Skywalker's team. The craft carried the stern Besalisk Jedi Master, General Pong Krell, who had been leading another clone battalion on Umbara. Krell told Skywalker that the Council ordered him back to the planet Coruscant immediately. Krell himself would then temporarily lead the 501st Legion on Umbara as an interim. After Skywalker acknowledged Krell, the Jedi Knight left aboard Krell's gunship, leaving the command of his troops to Krell. The stern Jedi Master informed Jesse and the 501st troopers of his strict beliefs on standard protocol. Following his introduction, Krell ordered Rex to ready all clone platoons, and the teams began to follow the Besalisk Jedi through Umbara's jungle terrain, heading toward the planet's capital city. When a trio of flying creatures, known as banshees, approached Krell's team, Jesse and the troops defensively fired their weapons at the flying animals. As the creatures attacked the clone troopers, one of the creatures lifted a clone off the ground. Noticing the ambush, Krell intervened and forced the creature to release the trooper, before killing two animals with his twin double-bladed lightsabers."}, {"tag": "p", "text": "Walking for nearly twelve hours, Jesse and the troops were tired, which was noted by Rex. To allow his troops to rest, Rex wanted his men to make camp, a decision that was not well received by Krell, who dictated that the platoons of the 501st were crucial to the Republic's success on Umbara. Without resting, Jesse and the team made their way to the outskirts of Umbara's capital city. While Skywalker had originally planned to deplete the city's defenses first before initiating multiple attacks, Krell wanted an all-out forward assault to the city. In order to carry out Krell's order, Jesse and the clones would use a highway that led into the city itself. When the clone troopers began to walk on the highway, several of the clones exploded as a result of hidden enemy mines on the ground. As Fives began to scan the surface of the highway to locate the mines, Umbaran troops, who were hiding behind nearby vegetation, ambushed Jesse and the troopers. The Umbarans utilized their hover tanks, equipped with EMP cannons, against the clones and advanced toward their position. Although Jesse and other clone troopers killed a number of Umbaran troopers, the natives overran the clones, forcing the Republic battle group to fall back."}, {"tag": "p", "text": "Jesse and the 501st troops positioned themselves away from the Umbaran militia. Once in position, the clone troopers resumed their firefight with the attacking Umbarans, though the Umbara natives began to retreat. Believing his plan to take over the city was compromised, Krell blamed the setback on Rex and his leadership. After a heated debate between Krell and Rex, the Jedi Master took note of Rex's words, yet the Jedi Master dismissed him and wanted Hardcase and the 501st to continue carrying out his plan of taking over the city. As the clones proceeded into Umbara's dense jungles, Jesse and the troops found themselves being attacked by Umbaran starfighters, whose ray shielded cockpits proved useful against the clones' blaster fire. However, as Jesse and the clones continued their assault on the starfighters, two of the Umbaran fighters retreated. In case the starfighters returned, Rex wanted his men to move out of their current positions and engage the nearby Umbaran troop lines. As Krell conferred with Kenobi via hologram, Jesse helped Rex and his men fight attacking Umbaran fighters."}, {"tag": "h4", "text": "Severing supply lines"}, {"tag": "p", "text": "Kenobi informed Krell that he was unable to take control of the Umbara capital city because its defenses were being resupplied by an airbase, which was located west of the city. The Jedi Master wanted Krell and the 501st to capture the airbase so that the city's supply lines could be severed. After their conversation ended, Krell ordered Rex to map out the coordinates of the airbase and gather Jesse and the rest of the 501st troops. On top of a cliff, Rex noticed the gorge that led to the heavily-fortified airbase was narrow, which would force the troops to walk in single squads. Rex informed Krell that they could make use of reconnaissance to find an alternate secure path to the airbase, although Krell dismissed the Captain's opinion, as they did not have enough time to find another route. After Jesse and the clone troopers regrouped at the bottom of the cliff, Rex wanted the men of the 501st to separate into two divisions—he would lead a group of troops, while Fives would lead Hardcase and the other division. While organizing, the clones began to openly speak about their current situation, and opposed Krell's reckless tactics. Jesse, who was unsure of Krell prior to the order of taking the airbase, told the clones he thought Krell was crazy."}, {"tag": "p", "text": "Proceeding into the narrow gorge with Hardcase and Fives' group, Jesse and the squad encountered a deadly Umbaran Impeding Assault Tank, which had been buried beneath the ground. The Umbaran tank, soon to be joined by four other tanks, began to attack the clones, whose blaster weapons became unreliable due to the tanks' ray shields. In order to destroy the tanks, Fives contacted Rex and requested RPS-6 rocket launchers. Rex, who was nearby Fives' position, ordered a few of his troops to bring the launchers to Fives' team. After one of the Umbaran tanks injured a clone trooper who carried a rocket launcher, Hardcase picked up the fallen weapon, while Kix tended to the injured clone trooper. Positioning himself in front of a tank, Hardcase fired the rocket launcher directly into the tank's ray shielded cockpit, which blew the vehicle apart. Though they eliminated one of the tanks, the clone troopers were still under attack by four other Umbaran tanks. Rex ordered Hardcase and the rest of the clones to regroup behind vegetation that blocked them from the tanks. Using thermal detonators, the clone troopers planted the explosives along a corridor of the gorge near the advancing tanks. As soon as the tanks fell into the thermal detonator trap, Rex detonated the explosives, which obliterated the remaining tanks."}, {"tag": "p", "text": "Following the battle with the Umbaran crawler tanks, the clone troopers continued on toward the airbase. Hardcase and the battle group walked by the ruins of the tanks, one of which was still active. On Rex's order, Hardcase used his rocket launcher to destroy the cockpit of the active tank. An Umbaran, who piloted the tank, fell through the damaged window of the cockpit, though Rex made short work of him with his blaster. The clones also killed a group of Banshees, who were scavenging the remains of a fallen clone trooper. As Rex began to survey the area in front of them by the airbase, six-legged Umbaran mobile heavy cannons, fitted with electromagnetic plasma cannons, emerged from the distance and began to fire their plasma cannons at Jesse and the clone troopers. The six-legged machines forced the clones to separate into two groups. Noticing the separation of Rex' battle group, Krell ordered Rex that his team had to continue their attack against the Umbaran mobile cannons. The Captain obliged and he led Jesse and his men back toward the six-legged mobile cannons. As Jesse and the clones engaged the cannons into battle, they noticed their rocket launchers were ineffective against the six-legged machines. Instead of taking the cannons head-on as a large group and then attack the airbase, Rex formulated a new plan—Hardcase and Fives would go around the cannons and infiltrate the airbase, while Rex and the rest of the troopers stayed behind and continue their battle against the Umbaran cannons."}, {"tag": "p", "text": "With the plan in motion, Hardcase departed with Fives and the two headed toward the airbase. Jesse remained by Rex's side, as the Captain's group engaged the mobile cannons. Though the clones suffered a lot of causalities, Jesse and the team held on and waited for Hardcase and Fives. After some time, Hardcase and Fives emerged out of the clouds aboard separate Umbaran starfighters. Using their starfighter's weaponry, the two clones destroyed the remaining mobile cannons before landing to regroup with Rex's team. After the destruction of the cannons, Krell ordered Clone Sergeant CC-1119, nicknamed \"Appo,\" to mobilize his troops and attack the airbase. The Republic force arrived at the airbase, and the remaining Umbara troops stationed their surrendered, allowing Jesse and the Republic troops to fortify themselves within the former Umbaran airbase. For their efforts, Rex congratulated Hardcase and Fives and claimed both of them saved their footing on Umbara. Krell, with Appo's men, approached Rex and wanted a report. After the Captain told the Jedi General of their accomplishments, Krell believed that it was luck that saved them, a comment that was dismissed by Rex, who claimed that many of his troops died to take the airbase. However, Krell informed Rex that he had yet to learn of the price of victory. Jesse and the rest of Rex's team near him did not approve of Krell's belief."}, {"tag": "h4", "text": "Betraying orders"}, {"tag": "p", "text": "Even though the Republic battle group captured the airbase, they did not control it entirely. In an attempt to retake their base, the Umbaran militia stepped up their attack against the Republic force. Through Kenobi, Krell learned that a Confederate supply ship was giving the Umbaran capital city supplies. After their conversation, Krell and Rex of the ship, Krell wanted to attack the capital city with the remaining troops he had instead of attacking the supply ship. Following the meeting, Rex informed Jesse and the other troops of Krell's plan. The clone troopers did not approve of the plan, and saw it as another suicide mission. Not trusting Krell's plan, Fives wanted to use the Umbaran starfighters to sneak past the Umbaran blockade in orbit of the planet, board the supply ship, then destroy it."}, {"tag": "p", "text": "Taking note of Fives' plan, Rex relayed the information to Krell, who disapproved of the plan, as he wanted all the troops to attack the capital. Rex returned to the troopers' barracks, and explained to the others that they had to carry out Krell's plan of attacking the city, although Fives continued to persuade Rex, Jesse, and the other clones present in the barracks that they could use the Umbarans' fighters to infiltrate the supply ship. Rex informed Jesse and the troopers that if they disobeyed direct orders, they could sent to the Grand Army's court-martial. Nevertheless, Fives defended his own plan and decided to carry it out. Within hangar 9-4 of the airbase, Jesse and Hardcase joined Fives, and Hardcase mounted in one of the deactivated starfighters to test it. As Hardcase struggled to maintain control of the starfighter, his reckless flying and inability to control the fighter's weapon systems triggered the alarm systems in the hangar, which alerted Krell. After Krell entered the hangar to see what was occurring, Jesse remained by the starfighters' control systems panel, while Hardcase tried to persuade the stern Jedi Master that the accidents in the hangar were the result of him and Fives' efforts of trying to decrypt the Umbaran starfighter codes."}, {"tag": "p", "text": "As a result from Hardcase's words, Krell dictated that the Umbaran starfighters were too dangerous to operate. Krell ordered Hardcase and Fives to lock down the fighters, and disregard any use with them. Despite Krell's orders, Jesse and Hardcase showed his support toward Fives' plan of using the starfighters. With Jesse and Hardcase agreeing to help him, Fives told the two troopers that once they were in the supply ship, they would destroy the ship's main reactor. Proceeding to carry out the plan, Jesse, Hardcase, and Fives joined Rex outside the airbase. Wanting the troopers to rethink, Rex tried to convince the troopers that they should not carry out the plan, as they would be disobeying orders. After Fives informed the Clone Captain that they had no other option, Rex reluctantly obliged, and informed Jesse, Hardcase, and Fives that he could not help them if they get caught. Jesse, Fives, and Hardcase departed back to the airbase and boarded three separate deactivated starfighters. Soon after taking off from the airbase, the three troopers flew the vessels through Umbara's atmosphere. Once in space, Jesse and the two other troopers found themselves in a midst of a battle."}, {"tag": "p", "text": "The Republic forces engaged in the battle took heavy casualties from the Confederate tri-fighter droids and Umbaran starfighters. The Umbarans piloting their Umbaran starfighters believed Jesse, Fives, and Hardcase's fighters were part of their battle group, which allowed the three clone troopers to fly through the battle to the Confederate supply ship unharmed. Once they boarded the ship, Jesse and troopers navigated their way toward the ship's hangar hallways aboard their starfighters. Noticing the intruders, the battle droids stationed on the ship began to close a blast door near the clone troopers. When Hardcase noticed this, the clone trooper used his starfighter's pulse missiles to destroy the door. The resulting blast of the missile eradicated the door, although the blast also crippled the right wing of his starfighter. Once the clones pinpointed the location of the reactor room, they used their starfighters' pulse missiles to destroy it, although the room was soon protected by a ray shield, activated by the ship's battle droids. After a group of battle droids arrived near the clones' starfighters and began to fire at the intruding fighters, Hardcase dismounted from his vessel."}, {"tag": "p", "text": "Despite resistance from Fives, Hardcase ordered the trooper and Jesse to leave the supply ship, as he would stay behind and take care of the reactor. Taking a pulse missile tube that was detached from his starfighter, Hardcase maneuvered around the ray shield to enter the reactor room. Complying with Hardcase's wish, Jesse and Fives turned their starfighters around and headed toward the supply ship's exit. Meanwhile, Hardcase rammed the missile tube on the side of the reactor, which caused the missile tube to explode, causing a chain reaction throughout the reactor room. The blast killed Hardcase, as well as destroyed the supply ship. However, Jesse and Fives avoided death and piloted their starfighters out of the supply ship and landed back in the airbase on Umbara. Though they had taken out the Confederate supply ship, which crippled their enemies supplies in the Umbaran capital city, Krell told Jesse and Fives they had committed a crime, and were to be sent to the Grand Army's court-marital for their actions."}, {"tag": "h4", "text": "Treason Against the Republic"}, {"tag": "p", "text": "As Jesse and Fives were being escorted by Captain Rex and Sergeant Appo, six clone troopers, two of them being Kix and Tup, lined up with rifles with the orders to execute the clone traitors. However, Fives managed to convince the clones that no clone should have to go out this way. Jesse and Fives were sent back to the holding cell until further notice. Eventually Krell sent a squad of 501st troopers to take out Umbarans dressed as clones. They later realized that the Umbarans dressed as clones were really clones from the 212th Attack Battalion. Rex rounded up the remaining 212th troopers and his own clones in order to capture Krell for treason against the Republic. Jesse and Fives were set free and were told to help arrest Krell. Clones rushed into the command center and surrounded Krell, but Krell was able to escape. Jesse and all the other 501 clones were sent to capture Krell and bring him back to the air base. After much brutal attacks, Krell was stunned by Tup and was brought back to the air base. Jesse, Rex, Fives, and Tup questioned Krell for his actions. Krell claimed that the Republic would be ripped apart from the inside and that a new order would rise. Krell also revealed that he was a separatist spy. After much consideration, Jesse and his fellow brothers decided to execute the Jedi traitor. Rex decided to put Krell down, but wasn't able to do it. Instead it was clone trooper Dogma who killed Krell. With the rest of the Republic forces taking control of the Umbaran capital, Umbara was now under Republic control."}, {"tag": "h4", "text": "79's Cantina"}, {"tag": "p", "text": "In 20 BBY, ARC Trooper Fives discovered a conspiracy plot against the Jedi. When Fives came to Coruscant to convince Chancellor Palpatine that the Kaminoan scientists are hiding something, he found himself on the run. Fives came to 79's, a clone bar, to look for anyone he could trust and there he found Jesse and Kix having drinks. He confronted Kix and told him that he needed to speak to Captain Rex or General Skywalker."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Human clone trooper, Jesse stood 1.83 meters tall. He had brown eyes, and he kept his head clean shaven. Because he was a loyal Republic trooper, Jesse had a large Galactic Republic emblem tattoo that covered most of his face. He also proudly wore a similar emblem on his helmet. As a loyal trooper, Jesse cooperated with Kenobi, and obeyed the orders that were given to him on Saleucami. Jesse also reacted quickly after his team's leader, Rex, was shot down by a commando droid. The clone trooper was deeply concerned for Rex's health after the Clone Captain had been shot. Jesse was well-mannered; he respected Suu and asked if Rex could stay at her homestead for the night."}, {"tag": "p", "text": "Throughout his service in the Grand Army of the Republic, Jesse's Phase I clone armor and Phase II clone armor sported light blue markings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jesse first appeared in \"The Deserter,\" the tenth episode in the second season of the Star Wars: The Clone Wars television series, which aired on January 1, 2010. Like all clones in the show, Jesse was voiced by Dee Bradley Baker. Jesse later appeared in the episode \"Darkness on Umbara,\" which aired on October 28, 2011."}, {"tag": "p", "text": "After the airing of \"Darkness on Umbara,\" Jesse received an Encyclopedia entry on StarWars.com. Notably, in his entry, Jesse's homeworld was said to be 1.83 meters, while his height was stated to be Kamino. His entry was later revised to rectify the error."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}