{"url": "CT-6734", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Clone trooper lieutenants", "Category:Members of the 327th Star Corps"], "nodes": [{"tag": "h1", "text": "CT-6734"}, {"tag": "p", "text": "CT-6734, also known as Galle, was a clone trooper lieutenant in Commander Bly's 327th Star Corps who fought in the Battle of Felucia. Alongside Jedi Padawans Drake Lo'gaan, Ekria, and Zonder, he participated in a raid on a water treatment plant near the city of Jiaozi to stop the spread of a deadly toxin throughout Felucia's water supply. After accomplishing this, Galle ordered the death of Jedi Knight Barriss Offee per the Republic directive Order 66, and he later filed the report on her execution."}, {"tag": "p", "text": "During the early years of the Galactic Empire, Galle was paired with Bly on the planet Yutusk. When Darth Vader called them into service, Galle and Bly aided Vader and Inquisitor Antinnis Tremayne in their search for Lo'gaan and Ekria, now Jedi fugitives, on Coruscant. Piloting a Low Altitude Assault Transport, Galle aided in Tremayne's pursuit of the Padawans in a chase through the airways of Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "Cloned from Jango Fett on Kamino, clone trooper CT-6734 earned the name \"Galle.\" A lieutenant, Galle was assigned to Commander Bly's 327th Star Corps and served the Republic in the Clone Wars."}, {"tag": "p", "text": "Early in the war, the 327th attempted to reap information from the memory banks of a Confederate tactical droid by setting up a trap in a rocky canyon. They were able to fabricate an information bunker, which attracted the attention of the droid. In turn, the droid ordered his troops to attack the bunker, prompting Galle and the men of the 327th to attack them from the rear. They were able to effectively dispatch the droid's troops, while Jedi General Aayla Secura beheaded the tactical droid. Since the droid had not gone into cyberostasis, they would be able to plunder its memory banks for intel."}, {"tag": "h3", "text": "Service on Felucia"}, {"tag": "p", "text": "At the close of the war, Galle was dispatched to the planet Felucia, where the 327th and their Jedi leaders hunted Shu Mai, presidente of the Commerce Guild. When the 327th closed on Mai's compound outside the city of Kway Teow, believing her to be within it, they learned that she was not and it had been a trap. Their incursion triggered the release of a toxin into the planet's water supply. The 327th and Jedi split into three groups, each intending to capture a water distribution center and block the spread of the toxin. Because their goal was to save lives, all sought to minimize enemy casualties. Galle and his squad joined the Padawans Ekria, Drake Lo'gaan, and Zonder in traveling to the center at Jiaozi, while Barriss Offee took a squad to Har Gau and Aayla Secura and Bly went to Niango."}, {"tag": "p", "text": "When Galle's group arrived at their site, they saw that the defenders consisted mostly of sentients, rather than droids, and realized they could not simply blast their way into the center. Lo'gaan enlisted Galle's help for his plan; first, Zonder bellowed loudly, informing the defenders that there were attackers nearby, and the defenders charged. Galle and the Padawans attacked, striking down the droids. The Padawans then detached from Galle's squad, moving into position near the center. Lo'gaan commed Galle and ordered him to activate the next phase of the plan, and Galle called for a retreat. The defenders pursued, leaving the way wide open for the Padawans to infiltrate the plant and stop the toxins."}, {"tag": "p", "text": "As Galle fell back, Bly received an encrypted message from Coruscant, ordering him to execute Order 66, a contingency order that demanded the deaths of all Jedi. Galle and his squad rendezvoused with Offee, who was fighting off a number of battle droids. Galle came to a halt, and Offee ordered him to fire. The lieutenant complied; he ordered an AT-TE to open fire on Offee, killing her."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "Shortly after the execution of Order 66, the Republic was transformed into the Galactic Empire. Galle filed a report on Offee's death that later saw the attention of Emperor Palpatine. He and Bly, who had killed Secura, were publicly portrayed as having killed the Jedi to stop them from poisoning the Felucian water supply. Galle and Bly were assigned to the world of Yutusk, where anti-Imperial rallies were taking place."}, {"tag": "p", "text": "Ekria and Lo'gaan, however, eventually attracted the attention of the Empire. Over six months after the Empire was declared, Darth Vader and Inquisitor Antinnis Tremayne found themselves in pursuit of the two Jedi. Tremayne had failed Vader in earlier attempts to take them, and so Vader, seeking help for Tremayne, looked for clone officers who had had experience with the Jedi on Felucia; he found Galle and Bly. Vader contacted them on Yutusk and offered them the chance to finish the job of eliminating their Jedi commanders, and the clones accepted."}, {"tag": "p", "text": "Galle and Bly were transferred to Coruscant, where they met with Tremayne, fellow Inquisitor Lanu Pasiq, and Armand Isard, head of Imperial Intelligence. Bly briefed the group on his experience with Ekria, in particular her aptitude at slicing, which he had seen demonstrated during the Felucia mission. Isard proposed that they attach markers to data that she would be likely to access and use them to trace her location. They were successful, tracking her to the apartment where the Jedi were hiding, and Tremayne, Pasiq, and a number of clone troopers set off in a Low Altitude Assault Transport, with Galle and Bly piloting. As they approached, the apartment exploded, the result of a bomb set by the two Jedi to cover their tracks. They spotted the speeder that Ekria and Lo'gaan were fleeing in, however, and set off after it. Bly called in reinforcements in V-wing starfighters, who were able to damage the speeder. Ekria bailed from the vehicle, but Tremayne ordered Galle to stay on Lo'gaan."}, {"tag": "p", "text": "Lo'gaan at last reached his destination, a landing pad where Darth Vader waited. Lo'gaan attempted to kill the Dark Lord, but Vader and his Noghri guards were able to subdue him. When Tremayne, Bly, and Galle arrived, the situation had been dealt with, and Vader informed Tremayne that he was taking Lo'gaan into his custody."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Galle was loyal to the Republic and Empire. Willing to serve under and help Padawans, he was nonetheless capable of turning on and killing his Jedi superiors when ordered to. Though a soldier, he was not adverse to tactically retreating when necessary. Galle was both capable in fighting as an infantry soldier and piloting air vehicles like the LAAT."}, {"tag": "p", "text": "Galle wore Phase II clone trooper armor, decorated in the yellow piping common among members of the 327th Star Corps. His helmet was suited for hazardous environments and provided its own oxygen supply. He armed himself with a DC-15S."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galle was created in Paul Ens' and Tom Hodges' webstrip Reversal of Fortune; the author and artist later used him again in Evasive Action: End Game, a sequel strip to Reversal of Fortune, which gave him the number \"6734\"; The Complete Star Wars Encyclopedia later established his full designation as CT-6734. Star Wars: The Complete Visual Dictionary gave Galle his first realistic—as opposed to drawn—image, assigning the name to a reused picture of Bly from Star Wars: Revenge of the Sith: The Visual Dictionary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}