{"url": "CT-782/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Clone cadets", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "CT-782"}, {"tag": "p", "text": "CT-782 was a clone trooper who served in the Grand Army of the Republic during the Clone Wars. CT-782 earned the nickname of \"Hevy,\" due to being a heavy weapons expert. In 22 BBY, Hevy, along with his fellow Domino Squad clone cadet troopers, trained within Tipoca City's military complex under the Siniteen bounty hunter Bric. As Hevy and the squad took practice excises to prepare for their final test to become battle-ready clone troopers, the team struggled to work together as a team. Because of this, Hevy and the squad later failed their test, forcing Hevy to consider leaving the team. However, after Jedi Master Shaak Ti allowed Hevy and his team to retake the test, the squad was able to put aside their differences and passed the test successfully, allowing Hevy and the squad to become clone troopers."}, {"tag": "p", "text": "Following the success, Hevy was given his first off-world assignment—patrol the Rishi Station, a listening post located on the moon of Rishi. Under the command of Sergeant O'Niner, Hevy and the group of rookie troopers maintained the listening post to warn the Galactic Republic fleet of any Confederate attacks in the Outer Rim. Hevy was present during a surprise Confederate attack on the station. BX-series droid commandos took over the Rishi moon base and fortified themselves inside. After Commander Cody and Captain Rex soon arrived at the base for a routine inspection. Hevy and the rest of the remaining clones shot a droid attack flare, warning Cody and Rex. The clone officers met up with Hevy and the remaining clone troops and organized a plan to attack the droids. Once the clones retook the base, Rex ordered the destruction of the listening post. When the detonator for the explosive liquid tibanna failed to work, Hevy offered to stay behind and fix the problem. When droids entered the base and attacked Hevy, the clone opted to manually detonate the explosives, instantly killing himself and destroying the droids and the listening post."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Training on Kamino"}, {"tag": "p", "text": "CT-782 was a clone trooper who served in the Grand Army of the Republic's Domino Squad, a unit of clone cadets, during the Clone Wars. During his tenure in Domino Squad, the other squad clone cadets—Cutup, Echo, Fives, Droidbait—became acquainted with CT-782. They began to nickname him \"Hevy,\" due to him knowing heavy weaponry. In Tipoca City's—Kamino's capital city—military complex, in 22 BBY, Hevy and the other Domino Squad members trained under Siniteen bounty hunter Bric. Bric oversaw the clone cadets practice for their final test—the Citadel Challenge—which placed them head-to-head with battle droids. While the battle droids' weapons, as well as their own weapons, were not lethal, no clone could be injured during one of the tests. Despite this, all clone cadet squads had to work as a team to successfully pass their test. For Hevy and Domino Squad, however, the team rarely got along with each other. During their final practice test, Hevy and Domino Squad were engaging droids when Hevy broke away from the group."}, {"tag": "p", "text": "Watching the group, Bric, Arcona El-Les, and Jedi Master Shaak Ti, took concern of Domino Squad's recklessness. Bric expressed the group's inability to work as a team, and wanted to send them to Tipoca City's maintenance crew, where rejected clones went. As the combat simulation progressed, Hevy kept disobeying orders and assumed the squad's leadership on his own. However, the droid forces began to overwhelm the clones, causing the squad to fail. With their practice test a failure, Hevy and Domino Squad left the combat room and headed back to the complex's sleeping barracks. Once there, Hevy took off his training helmet and tossed it on the ground in anger. When Echo confronted Hevy after the clone said \"he thought like an ARC trooper,\" the two engaged in a hand-to-hand brawl; however, their fight was broken up by Bric. Bric told Hevy and the clone cadets of Domino Squad since they could not get work as a team, they were a waste of his time. The next day, Bric and El-Les rallied Domino Squad, as well as other clone cadet squads, for a meeting on a hangar platform."}, {"tag": "p", "text": "A few Advanced Recon Commando troopers, led by Clone Commander Colt, were to watch the clone cadet's final simulator test. If one passed the test, the troopers within the squad would become battle-ready clone troopers. Colt took interest within Bravo Squad, a unit of clone cadets that passed certain tests in \"ARC trooper time.\" Following Bravo Squad to the combat simulator room, Hevy and Domino Squad would enter the test once Bravo Squad was finished. Not long after, a cadet from Bravo Squad lifted a pole on top of a citadel, which completed the simulation test. Entering the combat room, Hevy and the rest of Domino Squad past the cadets from Bravo Squad, who teased them by saying \"time to watch the Dominoes fall.\" However, once the simulator began, Domino Squad passed certain parts of the simulation faster than their usual rate. As the other clones were taking cover, Hevy, who was destroying droids with his Z-6 rotary blaster cannon, was clearing a path for them. When Droidbait broke away from Echo, Fives, and Cutup, a droid shot him in the back. Cutup noticed this and yelled for Hevy, though Hevy wanted to leave his injured teammate behind and head for the citadel."}, {"tag": "p", "text": "Colt and El-les noticed them leaving Droidbait, which forced them to stop the simulation test, causing Hevy and Domino Squad to automatically fail the test. That night, 99, a malformed maintenance crew member clone, approached the frustrated Hevy. The clone told Hevy that, despite the clone cadet's differences, he should work together with his team. Since 99 was never given a chance to prove himself worthy as a clone trooper, Hevy had that chance to do so. This convinced Hevy that if he and his squad-mates did not succeed, they would not become clone troopers. Hevy took 99's advice and, the following day, showed it during Domino Squad's final test. Shaak Ti allowed Domino Squad to retake the test, since she and El-Les believed in them. Seeing Hevy and Domino Squad participate in the simulation test for the last time, Bric joined Shaak Ti, El-Les, and Colt, as they watched the clone cadets. This time, however, Hevy and the other clones got further into the test."}, {"tag": "p", "text": "When Hevy, Echo, Fives, Cutup, and Droidbait reached the bottom of the citadel, they noticed that their ascension cables in their belts were missing. Before the test, Bric took the cables from their belts to challenge the clones. Yet, the clones improvised and decided to climb blaster turrets that ascended up toward the citadel's roof. Hevy successfully climbed the turrets and lifted the pole on top of the citadel, completing the their test. Due to them working as a team and completing their final test, Hevy and the rest of Domino Squad were allowed to become clone troopers. They each received their own medals, as a symbol for their graduation from clone cadet. While Echo, Fives, Cutup, and Droidbait kept theirs, Hevy decided to give his own medal to 99. He appreciated 99's help he had given him, which bought Domino Squad together."}, {"tag": "h3", "text": "Attack on the moon of Rishi"}, {"tag": "p", "text": "After his training on Kamino, Hevy was given his first off-world assignment. Along with Echo and Cutup, he was stationed at a listening post located on a moon of the planet Rishi, under the command of Sergeant O'Niner. Hevy would soon be joined by Fives, Droidbait, and trooper Nub, who were new to the Rishi Station. As part of their assignments, they maintained the listening post to warn the Galactic Republic of any impending Separatist attacks on Kamino. While Hevy and the rookie troopers were on duty in the control room, Sergeant O'Niner entered the room and alerted the clone troopers of an inspection that would soon begin. Unbeknownst to the group of clone troopers, however, Confederate General Grievous had sent BX-series droid commandos in Droch-class boarding ships to attack the listening post."}, {"tag": "p", "text": "Grievous, along with the Dark Acolyte Asajj Ventress, intended to invade Kamino to end the production of the Republic's clone troopers. The Republic listening post on the moon of Rishi had an \"all clear signal,\" which, if turned off, would alert a nearby Republic fleet, so Grievous planned to order his droids to leave the signal untouched. Meanwhile, a clone trooper alerted O'Niner that a meteor shower was approaching. To protect the base, the clone raised the listening post's shield. Outside the listening post, the meteor shower—which was actually the Droch-class boarding ships used by the commando droids—crashed everywhere around the listening post. The droids soon left their transports and began their attack on the Republic base. In the command center, O'Niner tried to contact clone trooper CT-327—who, unbeknownst to O'Niner, had already been killed by the commando droids—but was not able to reach him. The clone sergeant ordered troopers Droidbait and Nub to search for him; however, the two soon encountered a group of droids near the base's entrance. The battle droids began to fire at the two clone troopers, alerting the nearby O'Niner. The sergeant ordered Hevy to sound the listening post's alarm, but he soon found that the droids had deactivated the beacon."}, {"tag": "p", "text": "After three commando droids shot and killed O'Niner, the remaining clone troopers—Hevy, Echo, Fives, and Cutup—evacuated the command center by going through a ventilation shaft, which led them outside the listening post. Exiting the ventilation shaft, the four troops, who already felt helpless without their commanding sergeant, were further disheartened when a Rishi eel attacked and devoured Cutup, leaving only Hevy, Echo, and Fives to defend themselves. Eventually, the remaining rookie clone troopers noticed the Obex, a Nu-class attack shuttle flown by Clone Commander CC-2224 and Clone Captain CT-7567, nicknamed \"Cody\" and \"Rex,\" respectively. The clone officers had arrived for the inspection of the listening post but were unaware of the droid attack. After meeting the clones for the first time, Rex demanded that the rookies remove their helmets to verify that they were clones. After the three rookie troopers obeyed and removed their protective headgear, a Rishi moon eel appeared and began to attack them."}, {"tag": "p", "text": "This time, Rex used his DC-17 hand blaster to kill it with one shot to the eye, a feat that impressed the rookies. Confronting the rookie troopers, Rex referred to them as \"shinies,\" a derogatory term referring to the troopers' spotless armor that had not yet seen action in battle. Rex, nonetheless, found the group to be unique and took interest in Hevy's confidence, as well as stating that \"there was hope for them yet.\" Both Rex and Cody gave the rookie troops their DC-15S carbines before Rex suggested a plan to retake the listening post. The group of clone troopers hid near the entrance of the base while Rex impersonated commando droid unit 26 by using the droid's decapitated head. The clone captain successfully tricked commando droid Units 07, 08, and 09 to open the listening post's main door, allowing the clone troopers to ambush the remainder of the commando droids inside the base. Upon entering the command center, the clones defeated the droid units, including their vibroblade-wielding leader."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Their minor victory was cut short, however, when the clone troopers noticed that General Grievous' fleet had arrived above the moon. Due to the lack of communication from the commando droids, Grievous sent more battle droids to the listening post. The clones, inside the command center of the listening post, were unable to turn off the \"all clear\" signal because the droids had hot-wired it. Soon, a droid landing craft descended through the atmosphere and landed near the listening post. With the battle droid reinforcements outnumbering the clone troopers, Rex ordered the complete destruction of the base, to the surprise of the rookie troops. After the rookie clone troopers told the clone captain that their instruction was to protect the base, Rex dismissed them and ordered them to find anything explosive. Echo offered the use of highly explosive liquid tibanna, stored in plunk droids. While Rex and Echo went to retrieve the specific droids, Cody, Hevy, and Fives grabbed weaponry from the listening post's supply room. With their new supply of weaponry, they opened fire on the invading battle droid forces, buying time for Rex to wire three plunk droids together. Unexpectedly, the remote activator to detonate the tibanna inside the plunk droids did not function properly."}, {"tag": "p", "text": "Hevy offered to stay behind and correct the problem, enabling the others to exit the listening post through the ventilation shaft. The clone rookie used his Z-6 rotary blaster cannon—which he had chosen earlier with Cody and Fives—and fired on the invading B1-Series battle droids. Outside, Cody, Rex, Echo, and Fives noticed that Hevy was still inside the listening post. Rex tried to contact Hevy via comlink, but Hevy told the clone captain that he had to detonate the explosives manually. Unwilling to accept Hevy's decision, Rex and the clones ran to rescue the rookie trooper. However, inside the station, more battle droids approached the command center, and Hevy's Z-6 rotary blaster eventually ran out of ammunition. Hevy tossed the disabled weapon at the battle droids before he was injured in the leg by the droids. Upon Hevy's regaining of consciousness, a battle droid questioned whether or not to take Hevy as a prisoner. Replying that he did not take prisoners, Hevy activated the tibanna explosives, sacrificing himself and destroying the listening post along with the droids inside. Outside, the remaining clone troopers witnessed the destruction of the listening post. While they were unsuccessful in rescuing Hevy, the clones soon departed the moon of Rishi, after being picked by a LAAT/i gunship that just arrived. Onboard the Venator-class Star Destroyer Resolute, Jedi Generals Obi-Wan Kenobi and Anakin Skywalker awarded Echo and Fives a medal for their service and honored Hevy's bravery and sacrifice. In remembrance of Hevy, Echo and Fives placed a patch that read \"For Hevy\" in Aurebesh on their Phase I clone armor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When Hevy was part of Domino Squad, the clone cadet preferred to be called by his designated number—CT-782—than his nickname Hevy. He was sarcastic, rebellious and constantly tried to show his strengths and abilities to the other clone troopers, usually by voicing his opinion. During one of Domino Squad's combat simulations, El-les and Shaak Ti noticed that Hevy often broke away from his squad and took leadership on his own. Throughout his time as a clone cadet and rookie clone trooper, Hevy was regarded as a unique fighter who had an eye for heavy weaponry. His favorite weapon of choice was the Z-6 rotary blaster cannon. When Hevy wanted to use his favored weapon during the Rishi Station battle, Clone Commander Cody took interest within Hevy. The Commander told Hevy \"a big gun doesn't make a big man.\" When the clone troopers attacked the fortified droids inside the Rishi Station, Hevy showed eagerness, and after the clones spotted the commando droids inside the control center of the listening post, he asked Rex if he could attack the droids first. Showing bravery, Hevy was determined to defend the listening post; however, his idea of defending it declined when droid forces overwhelmed him. Hevy ultimately made the choice to destroy the listening post, with him inside it, which caused the clone to deny Clone Captain Rex's order for him to evacuate the base."}, {"tag": "p", "text": "Hevy was seen as an aggressive trooper. Inside their sleeping quarters in Tipoca City, Hevy was angered by Domino Squad's lack of competence. After arguing with his squad mates, Hevy told his squad that he thought like an \"ARC trooper,\" while the others did not. When Echo intervened and corrected Hevy, Hevy did not hesitate to hit Echo and engage the clone in a hand-to-hand fight. Inside Rishi Station, Hevy challenged the others to arm wrestling matches under the impression it was only to pass the time and constantly claimed that he wanted \"to get into the action.\" Out of the number of rookie clone troopers that were stationed inside Rishi Station, they all believed that Hevy's impression with the listening post was negative, as he did not enjoy his time there. Nevertheless, he was willing to sacrifice his own life during the fight inside the post. Like the other Domino Squad clone cadets, Hevy wore green and white armor. On his chest and left shoulder armor, a \"1\" symbol was painted on. During his tenure on the Rishi moon, Hevy wore standard sleek white Phase I clone armor. Hevy sported tattoos on either side of his face, from the back of the neck to the cheeks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hevy was first revealed in a storyboard sketch shown on StarWars.com and was subsequently featured in \"Rookies,\" the fifth episode in the first season of the Star Wars: The Clone Wars television series, which aired on October 24, 2008. Like all clone troopers throughout the series, he was voiced by Dee Bradley Baker. In the premiere of \"Rookies,\" Hevy exclaimed the word \"hell\" once. The word \"hell\" was removed in later broadcasts of the episode, however."}, {"tag": "p", "text": "Star Wars: The Clone Wars: Visual Guide Ultimate Battles gave Hevy the clone designation of \"CT-26-6958.\" Despite Hevy's death in \"Rookies,\" Hevy later appeared in the \"Clone Cadets,\" the first episode in the third season of Star Wars: The Clone Wars, which aired on September 17, 2010. Hevy was also in the Clone Cadets tie-in short novel, The Clone Wars: Defenders of the Republic, released on October 7, 2010. The events of \"Rookies\" were also adapted in LEGO Star Wars III: The Clone Wars, a non-canonical video game released on March 22, 2011. Hevy appeared in the game, armed with his signature rotary blaster cannon."}, {"tag": "p", "text": "In Clone Cadets, various characters called Hevy \"CT-782.\" This contradicts Ultimate Battles, which had given Hevy the designation of \"CT-26-6958.\" In the episode's accompanying episode guide on StarWars.com, it says \"CT-782\" is Hevy's designation number."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}