{"url": "CT-914", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "CT-914"}, {"tag": "p", "text": "CT-914 was a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Having trained, fought, and spent his entire life with fellow trooper CT-915, Nine-one-four regarded him as his brother. In 20 BBY, the two troopers were assigned to the planet Drongar, serving in the same cohort, as the Galactic Republic and the Confederacy of Independent Systems fought for control over a rare Drongar medicinal plant, bota. While on Drongar, CT-914 was struck with an unusual affliction that caused him to faint every time he tried to stand up. He was hospitalized in the Republic Mobile Surgical Unit 7, but the local doctors were unable to find a cure for his malady."}, {"tag": "p", "text": "Eventually, the clone trooper was healed by the Jedi Padawan Barriss Offee, who, by using the Force, discovered that the trooper's condition was caused by a brain injury and massaged the damaged tissue. As the battle continued, CT-915 was gravely wounded, and Nine-one-four helped deliver his friend to the RMSU. However, the surgeons were unable to save CT-915, and he died. Nine-one-four was grief-stricken, but he tried to take the news of Nine-one-five's death stoically. CT-914's emotional reaction to Nine-one-five's death provided a catalyst for Doctor Jos Vondar to reevaluate his views on clone troopers, whom he had previously thought of as mindless drones made of flesh. Only a short time later, however, CT-914 was himself killed in a Confederate ambush, before Vondar could apologize to him for his previous way of thinking."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "CT-914 was one of the many clones of the bounty hunter Jango Fett created on the planet Kamino to serve in the Grand Army of the Republic as clone troopers. During his training, CT-914 developed a strong friendship with fellow trooper CT-915, who had been decanted from a cloning tank just after him. The two clones spent all their free time together, and their relationship grew into a brother-like bond. When the Clone Wars began, CT-914 and CT-915 fought together during the conflict. In 20 BBY, the two were dispatched to the planet Drongar, where the Galactic Republic and the Confederacy of Independent Systems were fighting for control over the fields of bota, a highly valuable plant with exceptional medicinal qualities. On Drongar, the two friends were assigned to the same cohort. CT-914's quarters were located in barracks CT-Tertium, the largest of the three garrisons of Ground Base Seven, located at the edge of the Rotfurze Wastes, a region of severe ecological blight."}, {"tag": "p", "text": "While on Drongar, CT-914 developed an unusual malady that caused his blood vessels to dilate seemingly without reason, resembling a deep shock condition. This resulted in CT-914's blood pressure being so low that if he tried to stand or sit up quickly, he fell unconscious, as blood could not feed his brain properly. CT-914 was taken to the Republic Mobile Surgical Unit 7, but the doctors there were unable to find the cause of the disease, which the local xenobiotic, Ree Ohr, dubbed \"orthostatic hypotensive syncope of idiopathic origin.\" As such, CT-914 was essentially confined to bed in the RMSU's special section for patients who required constant monitoring, and the doctors could only keep him on histaminic retardant that decreased his blood pressure."}, {"tag": "p", "text": "Soon, however, CT-914 was visited by Barriss Offee, a Jedi Padawan who had been assigned to the Mobile Surgical Unit. She spoke to the clone trooper, asking him to sit up. When CT-914 did so, he fainted for thirteen seconds. Offee then offered to try using the Force to probe the trooper's energy field and determine the cause of his condition. Offee spent an hour in deep connection with the Force and located a disturbance in CT-914's neural net, centered in his hypothalamus; the trooper's hindbrain had been damaged somehow. Offee then used the Force to soothe the injury. When the procedure was over and CT-914 tried to stand up, he was able to do so—there was no hint of dizziness. Thanking Offee for her help, CT-914 returned to his duties."}, {"tag": "p", "text": "Some time later, CT-915 was injured in battle. Nine-one-four helped transport his comrade to the RMSU, and the local surgeons fought for the trooper's life. The next day, CT-914 was restlessly waiting for the results of the operation outside the surgery when he met Offee. As the two conversed, Doctor Jos Vondar emerged from the surgery and informed CT-914 that his comrade had died during the operation. The trooper was grief-stricken, but he tried to hold back his emotions. When Vondar noticed Nine-one-four's reaction and asked him if he had known Nine-one-five, the trooper told the Doctor that he considered CT-915 his brother. This took Vondar completely by surprise, as he, until that moment, had thought of clone troopers as emotionless automatons who were essentially nothing more than the Republic's equivalent of Confederate battle droids. Thanking Vondar for his efforts, CT-914 then returned to his unit."}, {"tag": "p", "text": "Days later, CT-914 was assigned to trash duty at the RMSU. As he approached the refuse bin, he met Vondar, who asked him how he felt about CT-915's death personally. Nine-one-four did not want to talk about it, but since Vondar held a commission as a captain in the Republic Army, and CT-914's training dictated that he was obliged to answer his superior officers, the trooper told Vondar that he missed his comrade deeply and wholeheartedly, and expected that he would miss him until his own death. CT-914 then returned to his task of collecting trash, leaving Vondar to reevaluate his thoughts about the clone troopers' moral complexity. A short time later, CT-914's platoon was ambushed by Confederate forces in a guerrilla attack. Most of the platoon, including CT-914, was killed, and their remains were placed in recycling vats in order to salvage their biological material."}, {"tag": "p", "text": "Two days after the ambush, Vondar—who had changed his views regarding the value of clone troopers' lives—decided to pay CT-914 a sympathy call, hoping to apologize for his untactful behavior. When he found out that Nine-one-four had joined Nine-one-five in death, Vondar was shocked. The Doctor had come to consider CT-914 as the example of his newfound knowledge of the clone troopers' humanity, and the news of CT-914's death struck him almost as close as the news of the death of a close friend."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like his genetic template, Jango Fett, CT-914 stood 1.83 meters tall. Although all clone troopers were, in a sense, brothers, all being copies of Jango Fett, Nine-one-four considered Nine-one-five a brother more than the rest of his brethren. CT-914 was emotionally pained by the loss of his closest friend, but he tried his best not to show his feelings and to take the news of his death stoically. He was irritated by Jos Vondar's questioning of his feelings, but his training forced him to obey and tell everything to the Doctor. While he was bedridden with the disease, CT-914 showed no visible signs of concern regarding his condition and casually talked about it with Barriss Offee. CT-914 possessed some sense of humor, replying jokingly to Offee's and Vondar's questions during the few interactions he had with them. He was surprised that Offee recognized him during their second meeting, having become accustomed to the Republic personnel being unable to tell clone troopers apart, but Offee explained to him that each clone trooper was unique in the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CT-914 first appeared in MedStar I: Battle Surgeons, a 2004 novel and the first part of the MedStar Duology, written by Michael Reaves and Steve Perry. After being killed off in the same book, he was mentioned in the second installment of the duology, MedStar II: Jedi Healer. In 2008, CT-914 received an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}