{"url": "CT-9904", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Pages needing citation", "Category:Clone commandos", "Category:Clone trooper commanders", "Category:Elite Squad Troopers", "Category:Imperial Army officers of the Galactic Empire", "Category:Members of Clone Force 99", "Category:Sharpshooters and snipers"], "nodes": [{"tag": "h1", "text": "CT-9904"}, {"tag": "p", "text": "CT-9904, nicknamed \"Crosshair,\" was a clone commando who served in the Grand Army of the Republic during the Clone Wars as part of Clone Force 99. Crosshair possessed genetic mutations that gave him exceptional eyesight and because of it, he acted as a sniper, taking advantage of his marksmanship skills."}, {"tag": "p", "text": "Upon the activation of Order 66, Crosshair was the lone member of Clone Force 99 that attempted to carry out the order. Frustrated with his team's disregard for the rise of the Galactic Empire, Crosshair was eventually selected by Governor Wilhuff Tarkin to remain loyal to the Empire, and was deployed against his former teammates with the military rank of Clone Commander."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Republic Commando"}, {"tag": "p", "text": "CT-9904 \"Crosshair\" was a male defective clone of bounty hunter Jango Fett. However, Crosshair's defects proved to be effective for military purposes, resulting in him being considered an enhanced clone. As a result, he and several other clones with desirable mutations were formed into a clone commando squad known as Clone Force 99, but they informally called themselves \"the Bad Batch.\" Working together and normally not working with regular clone troopers, Crosshair and his squad-mates secured an hundred percent success rate. According to fellow Bad Batch member \"Wrecker,\" the squad would always be shot down if they worked with regular troopers. At some point, Crosshair and his squad met Cut Lawquane and his family on Saleucami."}, {"tag": "h3", "text": "Battle of Anaxes"}, {"tag": "h4", "text": "Covert operations"}, {"tag": "p", "text": "During the Battle of Anaxes, CT-9904 \"Crosshair\" was deployed alongside the rest of his squad, Clone Force 99, as special reinforcements under Jedi General Anakin Skywalker. Deployed to a Cyber Center, the squad set out to retrieve special intelligence that could turn the tide of the battle. As when they were heading there, Crosshair seemingly stared at Jesse who he responded of what was he looking at, Crosshair responded that he and the Bad Batch did not usually work with \"regs.\" However the situation was quickly defused and were briefed of the mission. On the way to the center, Clone Marshal Commander CC-2224 \"Cody\" was injured; when Clone Captain CT-7567 \"Rex\" attempted to take command, Crosshair met with protest alongside Wrecker, subsiding when Clone Sergeant \"Hunter\" officially ceded command to Rex. Upon reaching the cyber center, Crosshair was left outside to secure the perimeter. After the squad retrieved information revealing that CT-1409 \"Echo,\" who had presumably perished on Lola Sayu, was in fact alive on Skako Minor, Crosshair secured a shuttle and transported his squad back to the base."}, {"tag": "h4", "text": "Rescue of Echo"}, {"tag": "p", "text": "Crosshair, with the rest of Clone Force 99 as well as Rex and Skywalker, went to Skako Minor in hopes of retrieving Echo from the Techno Union city of Purkoll on the planet. Upon landing, the group were attacked by keeradaks; Crosshair shot a grapple into a keeradak that had began carrying Skywalker away, allowing Hunter to hold on and give pursuit. After the keeradak escaped with Skywalker, Crosshair and his squad rendezvoused with Hunter at the edge of a Poletec village. After a brief skirmish, the clones and the Poletecs came to an immediate ceasefire, and the chief, Qin Yazal, agreed to assist the clones and Skywalker in reaching the Techno Union facility."}, {"tag": "p", "text": "Upon arriving at the Purkoll Tower Base, Crosshair remarked that it could be a trap, and accused Rex of blindly walking the squad into a trap because of his guilt for leaving Echo for dead on Lola Sayu. Crosshair angered Rex further by saying that he would have willingly just left Echo for dead due because he was a \"reg.\" Rex, angered, assaulted Crosshair, and the fight was broken up by Skywalker. As the group made their way through the base, Crosshair assisted in clearing a large group of D1-series aerial battle droids, before continuing on. With the assistance of Skywalker, Crosshair dispatched another group of droids that had almost cornered the Jedi General."}, {"tag": "p", "text": "As Rex and Tech located Echo, Crosshair, Skywalker, and the other members of Clone Force 99 continued to fight the aerial battle droids that were closing in on them. After Echo was freed, the clones and Skywalker began their escape, unable to call for reinforcements due to the unsanctioned nature of their mission. Echo opened a vent, which Wrecker and Skywalker helped the group into before the facility was blown up by Wrecker. Skywalker and the clones continued moving through the vents before finding themselves outside on top of a pipe. Crosshair momentarily lost his footing, but was saved by Wrecker. The group then leaped onto a flock of keeradaks flying under the pipe, and made it back to the Poletec village."}, {"tag": "p", "text": "After returning to the village, Crosshair spotted a group of D-wing battle droids that had followed them. He managed to take all but one out; the escaping droid then reported the clones' location to Wat Tambor. After the droid's escape, the clones briefly argue with the Poletecs, before convincing them to help them defend the village. Crosshair and his team helped to defend the village from a legion of D-wing battle droids, as well as two octuptarra tri-droids. After ending the threat of the droids, Crosshair and his team boarded the Havoc Marauder to return to Anaxes."}, {"tag": "h3", "text": "Conquest of Kaller and Order 66"}, {"tag": "p", "text": "During the conquest of Kaller, Clone Force 99 was led to an ongoing skirmish by Padawan Caleb Dume. As the rest of his squad fought in the battlefield below, Crosshair remained on a higher point, taking out enemy droids from above. When the operation was complete, Crosshair slid down from the hill, rejoining his squad as they approached Dume, his master Jedi General Depa Billaba, and Clone Captain CC-10/994 \"Grey.\" Under Billaba's orders, Crosshair prepared to accompany his squad and Dume to another ongoing skirmish where they were needed. However, their new mission was cut unexpectedly short when Captain Grey and a squad of clones, under the influence of Order 66, opened fire on Billaba."}, {"tag": "p", "text": "As Dume ran to help Billaba, Crosshair and his squad gave chase. When Dume escaped the skirmish, a confused Hunter ordered Crosshair to accompany him in locating the Padawan. While in the nearby forest, tracking Dume, Crosshair spotted the Padawan looking at them from a tree above. Adhering to his programming, Crosshair opened fire on Dume, who thinly escaped. Hunter, who was seemingly unaffected by the activation of Order 66, yelled at Crosshair for opening fire, telling him that they needed more information. When Crosshair again spotted Dume, he fired once more, much to the protest of Hunter. When the two gave chase and Hunter allowed Dume to escape, Crosshair inquired as to the Padawan's fate. Hunter merely informed Crosshair that Dume was stunned over the ravine, and fell to his death, though Crosshair did not believe his sergeant."}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "h4", "text": "Return to Kamino"}, {"tag": "p", "text": "Upon returning to Kamino, Crosshair berated Hunter for refusing to execute Order 66, surprising his teammates who pointed out that Crosshair had shared their disregard for command in prior missions. After returning to their bunks, all clones on Kamino were directed to attend an announcement regarding the Republic's status. During the assembly, Crosshair watched as the newly anointed Emperor Palpatine declared the formation of the Galactic Empire. After the announcement, Crosshair and his squad met Omega, a female, genetically altered clone who was familiar with their identities. After Omega left, Crosshair and his team came to the mess hall to eat. After Omega sat to eat with them, to Crosshair's annoyance, a group of normal clone troopers walked by, insulting Clone Force 99. As Omega and Wrecker retaliated, prompting a fight to break out, Crosshair attempted to continue eating. However, he joined the fight when Echo was thrown onto the table, and as a result, Crosshair's food."}, {"tag": "p", "text": "Expecting punishment on their way to speak to the Prime Minister, Lama Su, Crosshair and his team were warned by Echo that Admiral Wilhuff Tarkin was present on Kamino. Before reaching the Prime Minister, the squad was redirected to the training facility, where Tarkin wished to assess their combat capabilities after witnessing their fight in the cafeteria. During the initial training exercise, Crosshair assisted by taking out each of the turrets, before sniping enemy combatants from one of the towers. When Tarkin ordered a second exercise to be performed using live rounds, Crosshair took cover at ground level, and attempted to aid his squad in the exercise. When only one training droid remained, Crosshair instructed Wrecker to throw his knife into the air; Crosshair shot the knife, causing it to stab the remaining droid in the head."}, {"tag": "h4", "text": "A test of loyalty"}, {"tag": "p", "text": "At some point, Crosshair had filed a report against his teammates, stating their failure to faithfully execute Order 66. Taking note of this report, Tarkin decided to assign Clone Force 99 with a new mission to test their loyalty. Crosshair, alongside his squad, travelled to Onderon, believing that they were assigned to eliminate a group of insurgents supporting the Separatists. Upon realizing that the group they were assigned to eliminate consisted primarily of civilians, Crosshair was still prepared to carry out his orders, unlike the rest of his squad. Hunter ordered Crosshair to stand down, to which Crosshair responded with resistance. However, the group as a whole was apprehended by Saw Gerrera, who was leading the group of civilians in hopes of finding them safety."}, {"tag": "p", "text": "While Gerrera spoke to Clone Force 99 about the truth of the Empire's new order, Crosshair remained defiant to his claims, insisting that the mission be completed in full. He also remained hostile to Gerrera as a result. After the clones were released and Gerrera left, Crosshair insisted that they finish the mission, but was prevented from doing so by the rest of his squad. The group then departed to return to Kamino, hoping to retrieve Omega before she could be harmed."}, {"tag": "h4", "text": "Defection from the Bad Batch"}, {"tag": "p", "text": "Upon returning to Kamino, Crosshair and his teammates were immediately apprehended and placed in the brig, alongside Omega. Crosshair became frustrated with Hunter, blaming him for the situation they were in due to his unwillingness to follow orders. When the argument subsided, Omega approached Crosshair, attempting to console him and convince him not to turn on his brothers, stating that his urges were not his fault. However, Crosshair was soon removed from the cell and taken to the medical bay, as Tarkin had noticed Crosshair's continued loyalty to the Empire in contrast to his teammates. Nala Se noted that while Crosshair's inhibitor chip was not as active as a standard clone, the order appeared to be working. Crosshair's inhibitor chip was then altered under Tarkin's orders, further amplifying Crosshair's loyalty to the Empire over his loyalty to his team."}, {"tag": "p", "text": "Crosshair, now outfitted in new armor, was then deployed to the hangar, where he confronted his former teammates who were attempting to escape with Omega. After Hunter briefly tried to reason with Crosshair, Crosshair opened fire, forcing the squad into cover. As Clone Force 99 attempted to make their escape, Crosshair shot Wrecker, briefly incapacitating him. Before Crosshair could further harm the other members of the squad, however, his rifle was shot out of his hands by Omega. Crosshair attempted to continue fire utilizing a pistol, but was unable to prevent the escape of his former squad mates."}, {"tag": "p", "text": "After Crosshair's defection and Clone Force 99's escape from Kamino, the squad once again visited Cut Lawquane on Saleucami. Lawquane inquired as to why Crosshair was not present with his squad."}, {"tag": "h4", "text": "A new squad"}, {"tag": "p", "text": "Soon after Clone Force 99 escaped, Crosshair and Tarkin met with Vice Admiral Rampart, who introduced the two to a group of four non-clone humans, who had been selected to participate in elite training under Crosshair's command. One member of the squad, ES-01, was belligerent towards Crosshair, and expressed confidence that he would be taking over command of the squad soon enough. Crosshair, alongside his new squad, were given the assignment of completing Clone Force 99's final mission, as a test of their effectiveness in combat."}, {"tag": "p", "text": "Returning to Onderon, Crosshair and his squad swiftly took out the remaining Onderonian rebels, and apprehended the survivors. Crosshair placed one survivor at blasterpoint, asking her where Gerrera was. When she responded that she didn't know, Crosshair remarked that he believed her, and promptly shot her. Crosshair then turned, ordering his squad to execute the remaining survivors. ES-01 objected, stating that the survivors should have only been captured, and attempted to give the other squad members alternative orders. Crosshair then shot and killed ES-01, stating that he was placed in charge because he finished the job. Shortly after, the remaining squad members executed the remaining survivors under Crosshair's command."}, {"tag": "p", "text": "Upon returning to Kamino, Crosshair informed Tarkin and Rampart that the insurgents were handled, although Gerrera himself had escaped. Without another word, he and his squad then returned to what was once Clone Force 99's bunk, where Crosshair sat in contemplation."}, {"tag": "p", "text": "Meanwhile, during a mission to Ord Mantell, Omega was given Crosshair's old comlink. As Clone Force 99 began performing more mercenary work, Wrecker complained about being ordered to take point, lamenting that it was Crosshair's old job."}, {"tag": "h4", "text": "Hunting the Bad Batch"}, {"tag": "p", "text": "Sometime after the mission on Onderon, Crosshair reported to Vice Admiral Rampart and Lama Su that the Bad Batch had been spotted on Bracca by the Scrapper Guild. While the Prime Minister advised that the rogue clones be brought in alive, Rampart ordered Crosshair to terminate his former squad."}, {"tag": "p", "text": "Soon after, Crosshair and his squad arrived on Bracca along with a large contingent of clone troopers, landing near the wreckage of a Venator-class Star Destroyer where the Bad Batch was spotted. When ES-03 reported that their sensors were being jammed, he recognized it as the work of the Bad Batch and that they were still on board the wrecked ship. After dispatching several troopers to secure the Havoc Marauder, Crosshair and the rest of the troops advanced into the wreckage."}, {"tag": "p", "text": "Once on board, Crosshair ordered his troops to funnel the Bad Batch towards the hangar; in reality, these orders were a ruse, as he had predicted that his old comrades would tap the Imperials' comms to track their movements. This intuition proved correct, and the Imperials were able to surround the Bad Batch in the Venator's artillery deck. Crosshair chastised his former squadmates for their predictable tactics. Hunter and Omega pleaded with him to resist the inhibitor chip's influence, but Crosshair was unfazed and ordered his squad to target Omega. However, Tech and Echo managed to activate the nearby turbolasers, causing the ceiling above them to collapse, raining debris onto Crosshair and his company. After an intense firefight with several clone troopers, the Bad Batch managed to escape."}, {"tag": "p", "text": "Recovering, Crosshair ordered ES-04 to the Venator's bridge and await further orders. Crosshair boarded one of the Imperials' Nu-class shuttles, taking position the Venator's ion engines along with several clone troopers. As he expected, the Bad Batch attempted to escape through one of the Venator's ion engines. He pinned them down with his sniper rifle, taunting his former squadmates that they were surrounded. With the Bad Batch trapped inside, he ordered ES-04 to fire the engines and incinerate them. However, the Bad Batch detonated charges around the inside of the engine, causing it to split in half, sending a torrent of fire directly at Crosshair. The blast launched him backwards, knocking off his helmet and severely burning his face. A squad of clones landed nearby to recover Crosshair, and he angrily informed them that the rogue clones were headed back to their ship. A clone medic bandaged Crosshair's wounds and fitted him with a breath mask, and when the troopers informed him that the the Bad Batch was on the run, he demanded to be taken aboard the shuttle to rejoin the hunt. His shuttle then pursued the Havoc Marauder through Bracca's atmosphere. However, the Bad Batch were able to escape."}, {"tag": "h4", "text": "Ryloth"}, {"tag": "p", "text": "Sometime after the failed mission on Bracca, Crosshair recovered from his injuries, although he had burn scars on the back of his head, and accompanied Vice Admiral Rampart to Ryloth to root out insurgents there. In Lessu, Ryloth's capital, Crosshair kept a lookout for rebel leader Gobi Glie, eventually spotting him while Orn Free Taa and Cham Syndulla gave speeches. Sometime later, he meant with Rampart and Taa in the latter's office. Taa proposed disposing of Syndulla due to his popularity with the people, but Crosshair stated that Glie was who Taa should focus on instead, before he and Rampart left the room. Later, Crosshair spied on Hera Syndulla as she accompanied Glie on a supply rendezvous with the Bad Batch on one of Ryloth's moons. Before they left the area, Crosshair fired a tracking beacon onto their ship and reported this to the Empire."}, {"tag": "p", "text": "When they returned, Crosshair hit one of the ship's engines as it entered a canyon, later capturing Glie and Hera with a group of clones. When Cham came to rescue her, Crosshair initially did not participate as planned by Rampart. When the Imperials were forced to surrender, Crosshair, overlooking the scene, was ordered by Rampart to incapacitate Taa with a shot to the head, thus framing Cham for an assassination attempt."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Crosshair received his nickname due to his incredible sharpshooting abilities.[source?] According to Sergeant Hunter, he was capable of shooting targets from ten kilometers away. Crosshair cherished his 773 Firepuncher rifle. As a result of his sniping skills, the specialist commando had a feeling of superiority, disliking the idea of needing to work alongside unaltered clone troopers."}, {"tag": "p", "text": "Crosshair was also known for his crude attitude and icy approach. He had a general disdain of \"regs,\" a term used by Clone Force 99 to refer to regular clone troopers, and was always the first to express criticism, usually in a very sarcastic way. Nevertheless, he proved that he could always remain calm, even remaining as such when failures occurred around him. He could be cruel to others, often offering unsolicited and harsh criticisms accusing others of ineptitude or otherwise breaching a sore subject.[source?]"}, {"tag": "p", "text": "Crosshair had a very dry sense of humor, which often put him at odds with his boisterous teammate Wrecker. Although the two could work together quite effectively, Crosshair and Wrecker often engaged in competitive quarrels about which one could destroy more battle droids in the course of a mission. This was especially seen when Crosshair destroyed a considerable amount of battle droids within a few seconds with a single blaster shot."}, {"tag": "p", "text": "After Order 66, Crosshair's free will was limited, prioritizing the Empire over his teammates, and challenging Hunter for his disobedience. Initially, the chip did not fully corrupt his mind, as he continued to stick with his group despite his frustrations with them for not obeying Order 66. However, once Admiral Tarkin had his inhibitor chip enhanced, the brainwashed Crosshair lost all loyalty to Clone Force 99, attempting to kill his brothers without remorse. Like any other clone under its effects, Crosshair attempted to follow his orders without question, even if it meant killing civilians or children."}, {"tag": "p", "text": "Crosshair has a tattoo of a circle and a line vertically across his right eye. After suffering severe burns during the mission on Bracca, Crosshair had burn marks covering the right side of his head. He also shaved his head."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Being a genetically enhanced clone, Crosshair had exceptional eyesight. Due to this, Crosshair had almost unrivaled accuracy with ranged weaponry, particularly with his sniper rifle; no matter the distance, Crosshair could almost always hit any target he was tasked with shooting."}, {"tag": "p", "text": "Crosshair could regularly hit objects, large or small, with exceptional precision from extremely long distance. As noted by Hunter, this precision could extend to miles away. On Ryloth, despite being positioned at what seemed to be more than a mile away, Crosshair shot Gobi Glie's starship out of the sky by destroying the engine. Not soon after, this was again displayed when he shot Orn Free Taa in the head so precisely, it did not kill him."}, {"tag": "p", "text": "Crosshair could also hit small objects while they were in motion. On Anaxes, in Clone Force 99's effort to destroy a wave of oncoming droids, Crosshair would shoot at explosive charges whilst they were in mid-air, causing them to activate early, maximizing damage. On Kamino, during Tarkin's battle simulation, he shot Wrecker's airborne knife into the head of a battle droid. On Skako Minor, Crosshair destroyed an entire hallway of battle droids using a single blaster bolt, by precisely firing it into a series of reflective apparatus that bounced off the walls and tore through multiple targets."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Serving as the Bad Batch's team sniper, Crosshair utilized a customized 773 Firepuncher sniper rifle in combat, though he was also armed with a DC-17 hand blaster. The clone commando wore modified Katarn-class Commando Armor with a semi-circular cutout on the right upper edge of his helmet visor, to adapt to the scope of his sniper rifle. He also used a special type of disk that could stick to surfaces and re-deflect his blaster bolts, allowing him to hit multiple enemies with one shot. Crosshair also owned a comlink that could be mounted on the wrist. After the rise of the Galactic Empire, Crosshair's comlink was given to Omega by the rest of the squad, reasoning that he no longer needed it if he was with the Empire."}, {"tag": "p", "text": "After the Order 66 directive in his inhibitor chip was enhanced, he also sported a new Elite Squad Trooper armor model during his Imperial service. His new armor was extremely similar to his older modified Katarn-class Commando Armor model, but it was colored in a sleek dark gray with slight modifications added to the armor itself, some examples are that his visor lacking the semi-circular cutout on the right side of his helmet and the addition of \"grills\" found on the Phase II clone trooper helmet. The helmet's visor was also changed from black to green in color."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "George Lucas had a very specific vision of the Bad Batch, in that he wanted a version of The Dirty Dozen with clones. Dave Filoni sketched their appearances which Brent Friedman and Matt Michnovetz used to imagine the Bad Batch's voices and personalities. Matt and Brent worked with Dave to flesh out the characters and their story where Crosshair was based on Clint Eastwood, like a Clone version of Cad Bane."}, {"tag": "p", "text": "Crosshair was to appear in a four episode arc written by Michnovetz which starred the Bad Batch which now included \"Echo\", alongside Yoda on Kashyyyk. At the \"Untold Clone Wars\" panel at Celebration Anaheim, Dave Filoni talked about the plot of the arc. He revealed that the characters would ride on \"giant ape lizards\", that were holy to the Wookiees in a religious way. In one scene Tarfful would ask the tree spirits for permission to go into battle against the enemy, which was a Trandoshan and the Separatist Alliance. To get the enemy out of some of their cities they would have to burn some of the trees. The Clones had no problem with it, but it was upsetting to the Wookiees. A part of the arc would be about the Clones and the Wookiees finding a common ground to fight the separatists. A story reel clip was shown at the panel, which showed the Bad Batch and other Wookiees riding on the \"ape lizards\" and battle against a new beast that was based on kinraths from the Star Wars: Knights of the Old Republic game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}