{"url": "A-wing_starfighter", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:A-wing models", "Category:Kuat Systems Engineering products"], "nodes": [{"tag": "h1", "text": "A-wing starfighter"}, {"tag": "p", "text": "The A-wing starfighter, also referred to as A-wing, was a type of starfighter. During the Early rebellion against the Galactic Empire and the Galactic Civil War, the Alliance to Restore the Republic and the New Republic used the RZ-1 A-wing interceptor. Approximately thirty years later, a different and upgraded variation of the A-wing, the RZ-2 A-wing interceptor, was used by the Resistance during the First Order/Resistance War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early rebellion"}, {"tag": "p", "text": "At least a few A-wings were engaged in combat operations as early as 18 BBY. Bail Organa's forces operated at least eight of these fighters, and deployed them to assist an uprising on the planet Raada. The entire population of Raada was evacuated as a result of the uprising, and Ahsoka Tano joined the rebellion as a Fulcrum agent in its aftermath."}, {"tag": "h3", "text": "Phoenix Squadron"}, {"tag": "h4", "text": "Lothal"}, {"tag": "p", "text": "In 4 BBY, Darth Vader launched an attack on Phoenix Squadron, decimating Phoenix Squadron's contingent of A-wings. Out of eight fighters deployed, six fell victim to the Sith Lord's guns. Vader also destroyed the Phoenix Cell's flagship, Phoenix Home, forcing the rebel fleet to retreat into hyperspace."}, {"tag": "h4", "text": "Ibaar"}, {"tag": "p", "text": "At least five A-wings saw action in a rebel attempt to break the Blockade of Ibaar. The rebels successfully broke the blockade and delivered relief supplies to the Ibaar rebel network. A single A-wing was destroyed in action."}, {"tag": "h4", "text": "Deep space"}, {"tag": "p", "text": "In 3 BBY, Imperial ships engaged in a battle with Phoenix Squadron in deep space. The rebels emerged victorious, but the A-wing piloted by Phoenix Three was destroyed by TIE fighters."}, {"tag": "h4", "text": "Garel"}, {"tag": "p", "text": "Five of Phoenix Squadron's A-wings saw action in the Battle of Garel, during which the Imperial Military forced the cell to abandon its hideouts on the planet. Only a single Taylander shuttle was destroyed, and no A-wings were lost."}, {"tag": "h4", "text": "Concord Dawn"}, {"tag": "p", "text": "Five of Phoenix Squadron's A-wings engaged Skull Squadron, a Mandalorian unit of Fang fighters, in a dogfight over Concord Dawn. Two A-wings were destroyed, and the Mandalorian Protectors' victory forced the A-wings to retreat back to the fleet."}, {"tag": "h4", "text": "Ryloth and return to deep space"}, {"tag": "p", "text": "Two of Phoenix Squadron's A-wings were deployed in a mission to Ryloth, in which they were tasked with firing on a TIE/sa bomber. The bomber was actually operated by the rebels, and they planned to use it to board and hijack an Imperial Quasar Fire-class cruiser carrier. The Imperial crew took the bait and allowed the shuttle into the carrier's hangar, and the A-wings jumped into hyperspace when the Imperials returned fire. The mission ended with the hijacking of the carrier and the destruction of an Arquitens-class light cruiser."}, {"tag": "p", "text": "Later, two A-wings were scrambled to defend against an attack on Phoenix Squadron. The attack was a tactical victory for the Imperials, but a strategic victory for the rebellion, as the Phoenix Cell successfully relocated to Chopper Base shortly afterwards. No A-wings were confirmed lost in the attack."}, {"tag": "h4", "text": "Yarma"}, {"tag": "p", "text": "In 2 BBY, four of Phoenix Squadron's A-wings battled Imperial forces after the Spectres successfully completed a mission to Reklam Station. The rebels captured five Y-wing starfighters and destroyed Reklam Station, and no A-wings were lost."}, {"tag": "h4", "text": "Teralov"}, {"tag": "p", "text": "The six A-wings of Green Squadron were all destroyed in a massacre near Teralov. This particularly brutal and one-sided battle finally convinced Imperial cadets Wedge Antilles and Derek Klivian to join the rebellion."}, {"tag": "h4", "text": "Mykapo"}, {"tag": "p", "text": "Two A-wings of Phoenix Squadron saw action in a skirmish over Mykapo. As a result of this action, Iron Squadron joined the rebellion after successfully evacuating the system."}, {"tag": "h4", "text": "Tatooine"}, {"tag": "p", "text": "Ezra Bridger and C1-10P \"Chopper\" used an RZ-1T trainer A-wing to undertake an unsanctioned mission to Tatooine, with the objective of recruiting former Jedi Master Obi-Wan Kenobi to the Alliance to Restore the Republic. The mission was unsuccessful, as Kenobi was obligated to stay on Tatooine to protect Luke Skywalker, but it resulted in the death of the former Sith Lord Maul. The A-wing was destroyed by a tribe of Tusken Raiders, and the wayward Rebels returned to Chopper Base in Maul's old Kom'rk-class fighter/transport Nightbrother"}, {"tag": "h4", "text": "Atollon"}, {"tag": "p", "text": "Many of Phoenix Squadron's A-wings saw action at the Battle of Atollon, a decisive Imperial tactical victory. Chopper Base was destroyed, the rebels' planned attack on Lothal had to be postponed, and the remains of Phoenix Cell were forced to relocate to Yavin 4. All but four of the rebels' A-wings were destroyed in the battle."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "After the small-scale rebellion proved inconclusive at toppling the Empire, the Alliance to Restore the Republic escalated the conflict into open warfare in the Battle of Scarif. This battle in 0 BBY marked the beginning of the 5-year Galactic Civil War. Most A-wings in Rebel service at this time were stripped of their shields and heavy weapons launchers in favor of increased speed and agility in combat."}, {"tag": "h4", "text": "Tatooine"}, {"tag": "p", "text": "Sometime between 0 ABY and 3 ABY, Rebel A-wings assisted Saponza's Gang in the Battle for Tatooine, which liberated the planet from Imperial control."}, {"tag": "h4", "text": "Endor"}, {"tag": "p", "text": "In 4 ABY, A-wings participated in the Battle of Endor with numerous units in Blade, Riot, Green and Red squadrons. The battle struck a major blow to the Empire, with the death of Galactic Emperor Darth Sidious, the destruction of the DS-2 Death Star II Mobile Battle Station."}, {"tag": "h4", "text": "Sterdic IV"}, {"tag": "p", "text": "17 days after the Battle of Endor, Green Squadron's A-wings participated in the Battle of Cawa City on the planet Sterdic IV. The battle ended in a Rebel victory and resulted in the liberation of the city."}, {"tag": "h4", "text": "Fondor"}, {"tag": "p", "text": "A-wings were deployed in the Battle of Fondor, a crushing Rebel defeat that saw the loss of many starfighters. The battle resulted in Imperial forces securing climate disruption arrays necessary for Operation: Cinder."}, {"tag": "h4", "text": "Akiva"}, {"tag": "p", "text": "A few months after the Battle of Endor, New Republic A-wings were deployed to assist a local rebellion on Akiva. The rebellion resulted in the capture of high-level Imperial personnel, the rescue of Captain Wedge Antilles, and the liberation of Akiva. Shortly thereafter, Akiva became the first world in the Outer Rim Territories to be admitted to the New Republic."}, {"tag": "h4", "text": "Return to Fondor"}, {"tag": "p", "text": "In 5 ABY, at least 1 A-wing participated in the Battle of Fondor Shipyards, serving in Shepherd Squadron. The battle ended with a New Republic victory."}, {"tag": "h4", "text": "Jakku"}, {"tag": "p", "text": "A-wings served with Phoenix and Shepherd Squadrons in the Battle of Jakku, the final battle of the Galactic Civil War."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "h4", "text": "Ovanis"}, {"tag": "p", "text": "In 34 ABY, Black Squadron embarked on a mission to Ovanis with the aim of locating Lor San Tekka and enlisting his assistance to find the missing Jedi Master Luke Skywalker. A single A-wing participated in the mission, which eventually devolved into a dogfight between Black Squadron and First Order forces. The engagement ended in a draw, with a few TIEs being destroyed but no Black Squadron casualties."}, {"tag": "h4", "text": "Death of L'ulo L'ampar"}, {"tag": "p", "text": "In a battle over a desert planet, A-wing pilot L'ulo L'ampar's fighter was destroyed in a 3-sided battle with the Ranc gang and the First Order."}, {"tag": "h4", "text": "Mamkoda and Sheh Soahi"}, {"tag": "p", "text": "Resistance RZ-2 A-wing interceptors saw action at the Battle of Mamkoda. The battle ended in a Resistance victory, with a pirate spaceport destroyed by a group of MG-100 StarFortress SF-17 bombers. Later, a similar battle took place at Sheh Soahi."}, {"tag": "h4", "text": "D'Qar"}, {"tag": "p", "text": "RZ-2 A-wings carried out escort duty at the evacuation of D'Qar, providing fighter cover for Resistance bombers tasked with destroying the Mandator IV-class Siege Dreadnought Fulminatrix. The Dreadnought was destroyed, at the expense of the entire bombing fleet and a single A-wing piloted by Zizi Tlo."}, {"tag": "h4", "text": "Oetchi system"}, {"tag": "p", "text": "All of the Resistance's starfighters were destroyed by the First Order in an attack on the Resistance fleet, just after the fleet exited hyperspace in the Oetchi system"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The A-wing series of starfighters first appeared in Star Wars: Episode VI Return of the Jedi, during the climatic Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}