{"url": "CV-4T", "categories": ["Category:Legends articles", "Category:3PO-series protocol droids"], "nodes": [{"tag": "h1", "text": "CV-4T"}, {"tag": "p", "text": "CV-4T was a 3PO-series protocol droid who served the GeneTech Syndicate on Talus during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Battle of Yavin, CV-4T was part of the crew of Captain Narl's transport ship that belonged to the GeneTech Syndicate."}, {"tag": "p", "text": "Around 1 ABY, CV-4T was aboard Captain Narl's ship that transported a cargo of bioengineered arachnes. Those arachnes were bioweapons secretly designed by the GeneTech Syndicate as part of the illegal and dangerous Parasophic Arachne program. During the trip, the ship's anti-grav and thruster control broke down and the vessel plowed into the side of a Talusian mountain, northeast of the city of Nashal. Despite the efforts of Captain Narl, the survivors were not able to eliminate the creatures that broke out of containment and escaped. The arachnes quickly molted into more powerful and intelligent creatures and completely overwhelmed the survivors. The ship's crew did their best to protect the scientists and the wounded but the arachne constantly attacked the survivors' camp and took one or two more of them every night. Captain Narl then issued tracking emitters for everyone to wear and gave the tracking device to CV-4T. The survivors established another camp on their road to Nashal while the Captain and some others went in search of the missing crew. Nevertheless, the camp was finally invaded by the creatures and all the survivors were killed. CV-4T was severely damaged in the fight and only his head remained functional."}, {"tag": "p", "text": "In the meantime, the Corellian Security Force spotted the crash of Captain Narl's ship. Agent Taarna dispatched a spacer to investigate the crash site in the mountains and rescue any survivors. The spacer visited one of the survivors' camps and found the decapitated CV-4T. The droid was still able to communicate and narrated the awful events that took place earlier. CV-4T also gave access codes to Captain Narl's tracking device. The CorSec spacer thought that the tracking emitters would help to find other survivors. However, the spacer discovered that all other survivors, including Captain Narl, had been killed by the arachnes."}, {"tag": "p", "text": "The events regarding Narl's ship eventually led to the discovery of the Parasophic Arachne program, which in turn led to a CorSec raid on the GeneTech Syndicate Lab."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CV-4T appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. CV-4T was added to the game as part of the \"Genetic Potential\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}