{"url": "CZ-1", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:CZ-series communications/business droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "CZ-1"}, {"tag": "p", "text": "CZ-1 was a CZ-series secretary/business communications droid with masculine programming that was paired with CZ-3, another droid of the same model. After a crash left him abandoned on the planet Tatooine, CZ-1 became separated from CZ-3 and ended up in a pile of scrap on board a Jawa sandcrawler, where he encountered the astromech droid R2-D2 in 0 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "CZ-1 was the designation of a CZ-series secretary/business communications droid manufactured by Serv-O-Droid, Inc. with masculine programming. He was twinned with fellow CZ unit CZ-3 in service to members of the Stacchati species."}, {"tag": "p", "text": "After a crash in the deserts of the planet Tatooine, CZ-1 was abandoned and became separated from CZ-3. He then broke down and was captured by Jawa scavengers. In 0 BBY, the secretary droid was on board the sandcrawler of the Jawa Chief Nebit's tribe when the astromech droid R2-D2 was brought on board after being captured in the Jundland Wastes."}, {"tag": "p", "text": "As the astromech rolled past CZ-1 while surveying his surroundings, the secretary droid swayed back and forth amidst a heap of scrap. R2-D2 was later sold when the sandcrawler stopped at the Lars moisture farm, after which Imperial stormtroopers massacred Nebit's tribe and left its sandcrawler abandoned in the desert."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "CZ-1 was modified from a standard CZ-series droid to more closely resemble the Stacchati he once served, with black photoreceptors made to look like Stacchati eyes. The droid's hands were human-style manipulators with five digits. By 0 BBY, CZ-1 was ancient with locomotors too broken and sand-encrusted for him to stand or move properly. Despite this, he remained optimistic and hoped to soon be repaired and sold. CZ-1 had white plating that was stained black or brown in many areas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CZ-1 first appeared in the 1977 original trilogy film Star Wars: Episode IV A New Hope. In the current canon, the droid first received identification in the 2017 reference book Star Wars: The Visual Encyclopedia, which was written by Tricia Barr, Adam Bray and Cole Horton. The droid's name originated in the Star Wars Legends continuity, where it was first used in the 1998 reference book Star Wars: The Visual Dictionary, which was written by David West Reynolds."}, {"tag": "p", "text": "Sculptor Brian Muir made the head for CZ-1, who was known as the \"Tatooine protocol droid,\" based on an illustration by concept artist Ralph McQuarrie, which Muir remembers being one of the original designs for the Sith Lord Darth Vader. Muir felt the paint job applied to the costume did not quite capture the essence he intended it to have, as the pupils on the white eyes gave it an unintentionally humorous effect. Muir's mentor, Arthur Healey, sculpted CZ-1's chest, which also resembled an early sketch of Vader by concept artist John Mollo."}, {"tag": "p", "text": "The droid's limbs were manufactured from aluminum to be lightweight and durable, and were essentially the same as the protocol droid C-3PO's limbs but with slightly different detailing. The major difference when compared to C-3PO was that the trunks of the costume did not tuck inside the legs, but instead sat outside of them. The Tatooine protocol droid costume was used three times in the Star Wars films: twice in A New Hope for both CZ-1 and CZ-3, and once in Star Wars: Episode VI Return of the Jedi for a droid in Jabba's Palace named CZ-4."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}