{"url": "CZ-3/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:CZ-series communications/business droids", "Category:Desilijic servants", "Category:Masculine programming", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "CZ-3"}, {"tag": "p", "text": "CZ-3 was a CZ-series communications/business droid constructed by Serv-O-Droid, Inc."}, {"tag": "p", "text": "Like other droids in the CZ-series, CZ-3 was equipped with a built-in comlink, sophisticated scrambling and surveillance equipment, and encryption protocols."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After arriving on Tatooine in a crash, CZ-3 lost his \"twin brother\" CZ-1, and eventually ended up in the employ of Jabba Desilijic Tiure, a Hutt gangster. Jabba used the droid in a sting operation, exposing the dishonesty of one of his rivals, Opun Mcgrrrr. Using CZ-3 as bait, Jabba lured Opun into stealing the droid because he thought it contained sensitive information. CZ-3 recorded the entire operation with its surveillance equipment, transmitting it to Jabba and proving Opun's guilt."}, {"tag": "p", "text": "Due to a malfunction, however, instead of returning to Jabba's Palace, CZ-3 wandered the streets of Mos Eisley. Jabba sent his bounty hunter Takeel after CZ-3, while Mcgrrrr sent his henchman Tols Vengra with a similar goal."}, {"tag": "p", "text": "CZ-3 was found and/or bought by the Jawa traders, who discovered that it was being searched and sold it to Het Nkik's clan. CZ-3 managed to escape from the sandcrawler of that clan before it was attacked by Imperial sandtroopers."}, {"tag": "p", "text": "CZ-3 was later found by the two thugs Takeel and Tols Vengra. While the two discussed the droid among themselves, Zutton, Takeel's brother, appeared and shot CZ-3, destroying the droid. The droid's parts were picked up by several local droid dealers, but in the end, it had provided Jabba with enough evidence to expose Mcgrrrr's plot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "CZ-3 is partially derived from early concept drawings of Darth Vader."}, {"tag": "p", "text": "The same droid prop used for CZ-3 was used for CZ-4 in Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}