{"url": "Caamas_Document", "categories": ["Category:Legends articles", "Category:Datacards"], "nodes": [{"tag": "h1", "text": "Caamas Document"}, {"tag": "p", "text": "The Caamas Document was an Imperial file that implicated a group of Bothans in the orbital bombardment of Caamas, probably on Palpatine's order. Its partial discovery in the debris from Mount Tantiss on Wayland precipitated the political and military crisis of the same name."}, {"tag": "h2", "text": "History and Controversy"}, {"tag": "p", "text": "In its original state, the document detailed the Bothan agents that lowered the planetary shield of Caamas that allowed the Imperial Starfleet to devastate the surface of the peaceful planet. Grodin Tierce, as a part of his plot to destroy the New Republic, altered the document to include the names of prominent Bothan clans originally uninvolved in the operation, and ensured copies were stored in secure Imperial vaults and military libraries."}, {"tag": "p", "text": "When a datacard copy was uncovered at Mount Tantiss in 19 ABY, the New Republic fell into a massive political crisis. Agents of the Imperial Remnant, particularly Drend Navett, helped to escalate the conflict, eventually leading to a battle at Bothawui."}, {"tag": "p", "text": "One altered copy was obtained by Han Solo and Lando Calrissian, given to them by con-artist Flim masquerading as Grand Admiral Thrawn, after the two, along with the help of Lobot and Moegid had tried to obtain a copy of the document by searching archives in a library on Bastion. They were immediately suspicious when it named Bothans from a number of leading clans as part of the atrocity. Other attempts to gain a copy of the document were made by General Garm Bel Iblis, with Rogue Squadron and Booster Terrik under his command, and by Talon Karrde. The only unaltered copy was acquired by R2-D2 on Nirauan. The surviving Bothans it named were convicted of war crimes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Essential Reader's Companion incorrectly states that Jorj Car'das possessed a copy of the document."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}