{"url": "A._L._Singer", "categories": ["Category:Real-world articles", "Category:Young Reader authors"], "nodes": [{"tag": "h1", "text": "A. L. Singer"}, {"tag": "p", "text": "A. L. Singer was the author of books 13-15 in the Episode I Adventures series and 11-12 in the Star Wars Adventures series. Books 11-12 were reprints of 13-14 of the Episode I Adventures."}, {"tag": "p", "text": "Singer is a pseudonym for the writer Peter Lerangis. \"A. L. Singer\" is an anagram of \"Lerangis\"."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Peter Lerangis was born in Brooklyn, New York in August 1955. He moved to Freeport, New York for school which made him a bit more creative when it came to writing fiction. The first writing he published was under a false name for his school's newspaper \"Flashings\". Later on he was accepted to Harvard and majored in biochemistry. After singing a cappella with the Harvard Krokodiloes, becoming their musical director, and participating in a few plays at the university, he decided to enter law school. Of course later on he left law school to pursue musical theater instead and consequently he played lead roles of West Side Story, Cabaret and Fiddler on the Roof in a regional theater. He later got a job as an editor and therefore had three jobs: actor, writer and editor."}, {"tag": "p", "text": "After marrying his girlfriend Tina deVaron, they had a son called Nick which made him turn full-time into writing. He ghostwrote for several series including \"The Hardy Boys\", \"Hardy Boys/ Nancy Drew Supermysteries\", and \"The Three Investigators\". He wrote lots of famous book series such as \"Watchers\", \"Antartica\", and \"Spy X\". He mostly focused on writing novels for children and adolescents such as \"Smiler's Bones\". He also published in conjunction with other authors the series called \"The 39 Clues\" which was a New York Times bestselling series. Later on he published \"The Sword Thief\" which came to be Amazon's 5th bestselling children's book for 2009. Lerangis is also recognized for his New York Times Bestseller series of \"The Seven Wonders\". He won the Schneider Award in 2013 for his novel \"Somebody, Please Tell Me Who I Am\"."}, {"tag": "h2", "text": "Star Wars bibliography"}, {"tag": "h2", "text": "External links"}]}