{"url": "Caamas_Document_Crisis", "categories": ["Category:Legends articles", "Category:Battles of the Caamas Document Crisis", "Category:Bothan culture", "Category:Galactic Civil War campaigns", "Category:New Republic"], "nodes": [{"tag": "h1", "text": "Caamas Document Crisis"}, {"tag": "p", "text": "The Caamas Document Crisis (19 ABY) was the term given to the short, but dangerous, conflict between various factions of the New Republic and others over how certain factions of the Bothan race should be held accountable for the destruction of Caamas a generation prior. The intense political infighting that occurred between these groups nearly led to the New Republic completely descending into civil war. By the end of the conflict, one of the most significant events in the galaxy occurred: the signing of the Pellaeon–Gavrisom Treaty between Admiral Gilad Pellaeon of the Imperial Remnant and acting New Republic Chief of State Ponc Gavrisom, bringing an end to the decades long Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The destruction of Caamas"}, {"tag": "p", "text": "Shortly after the end of the Clone Wars, a group of Bothans assisted elements of the fledgling Galactic Empire in sabotaging Caamas's planetary shields, allowing the Imperials to completely devastate the planet."}, {"tag": "h3", "text": "The crisis"}, {"tag": "p", "text": "Evidence that implicated the Bothans in the incident did not come into light until 19 ABY, when a datacard containing a list of those involved was found by Leia Organa Solo near Mount Tantiss on the planet Wayland. The discovery of the card ignited a political firestorm throughout the New Republic, as member worlds openly decried the Bothans for their involvement and demanded that justice be brought to those responsible, and that restitution to the remaining Caamasi be made."}, {"tag": "p", "text": "Though some may truly have had the Caamasi's best interests at heart, others were more likely to use the incident to justify attacks against the Bothan race in general, given the Bothans' well-known deviousness and zero-sum ruthlessness in both interstellar politics and trade. What was worse, the new furor over Caamas's destruction became a convenient excuse for re-visiting hundreds of similar atrocities and long-standing grudges simmering among the New Republic's member races - the Diamala and the Ishori, the Sif'kries and the Frezhlix, and the Nhoras and the Clatear, just to name a few that flared up during the Crisis. If justice for Caamas was suddenly imperative, the factions in the New Republic Senate reasoned, why not for all the other crimes perpetrated between the various species?"}, {"tag": "p", "text": "Lando Calrissian, a former general of the Rebel Alliance, remarked that the Crisis threw into sharp relief the fact that only a small fraction of the Empire's vast military machine under Palpatine had been actually engaged in fighting the Alliance; the majority had been dispersed throughout the galaxy, preventing these inter-species rivalries from erupting into open war, and now the New Republic had inherited the same problem, but with a much smaller military and an inability to use Palpatine's draconian methods of keeping order."}, {"tag": "p", "text": "An early attempt at a moderate solution to the Crisis was a petition, signed by numerous Senators, demanding that the Bothans find a new planet for the Caamasi Remnant and terraform it to their specifications. This attempt failed when Councilor Borsk Fey'lya was forced to admit, in secret to President Gavrisom and Organa Solo, that the Combined Clans of Bothawui were bankrupt, and that it would be at least ten years, possibly never, before their finances were stable enough to undertake such a project."}, {"tag": "p", "text": "As Anti-Bothan demonstrations continued, it became clear that the only way to defuse the situation would be to locate an intact copy of the Caamas Document, indicating those who were truly responsible. Urgent calls went out throughout the New Republic requesting that anyone who had a copy bring it forward."}, {"tag": "h3", "text": "Imperial provocation"}, {"tag": "p", "text": "Ironically, those with the greatest ability to take advantage of the situation—the Imperial Remnant—were in no condition to do so, as they were caught up in their own political problems. After nearly two decades of fighting, it became clear to Gilad Pellaeon, Supreme Commander of the Imperial Fleet, that the war was over and that the Empire had been defeated. Traveling to the Imperial capital world of Bastion, Pellaeon met with the Council of Moffs and made the point emphatically clear to them: in order to survive and retain what they had left, the Empire would need to surrender to the New Republic. Though they disliked the idea, most of the Moffs reluctantly agreed. Sending Colonel Meizh Vermel to Morishim to deliver the message of Imperial surrender to General Garm Bel Iblis, Pellaeon took the Chimaera to Pesitiin to await Bel Iblis' arrival."}, {"tag": "p", "text": "However, Bel Iblis would not arrive, as Vermel's ship was captured over Morishim by the Star Destroyer Relentless, acting under the orders of Moff Vilim Disra, who did not wish the conflict between the Imperials and the New Republic to come to an end. To that end, he formed a triumvirate consisting of himself, Major Grodin Tierce, and a con man known only as Flim, who was the most integral part of his plan. By having Flim masquerade as Grand Admiral Thrawn—thought by the majority of the galaxy to have been killed during the Battle of Bilbringi a decade prior—it was the hope of Disra to be able to convince enough worlds to become part of the Empire once again. Many, such as Kroctar and Ruuria, pledged themselves to the Empire once more, the all but apparent disintegration of the New Republic over the Caamas Document issue all but assuring that the Empire looked like the better option."}, {"tag": "p", "text": "After several weeks, Pellaeon, convinced that Bel Iblis would not arrive, prepared to leave Pesitiin to return to Bastion. However, an attack by the Cavrilhu Pirates—ironically done in order to force such an action—convinced Pellaeon that elements within the Empire wanted to make sure that his attempts failed, so he made the decision to remain a while longer, in the hopes that Bel Iblis had received his message. Some time later, he was visited by Leia Organa Solo, to whom he told his desire for peace between the Republic and the Empire."}, {"tag": "p", "text": "Meanwhile, all attempts at locating an intact copy of the Caamas Document, including an attempt by Lando Calrissian and Lobot to infiltrate Bastion's libraries, had failed. Left with no other option, Admiral Ackbar and General Bel Iblis crafted a plan to raid the only place that could still contain an intact copy of the Document: the Imperial shipyards at Yaga Minor. Utilizing the services of Booster Terrik and the Errant Venture, it was the hope that the ship, disguised as the Star Destroyer Tyrannic, could pass through the defenses unmolested and retrieve a copy of the document without anyone being the wiser."}, {"tag": "p", "text": "Unfortunately, and unknown to the New Republic, Tyrannic was one of three Star Destroyers sent by Disra—by way of Flim—to Bothawui under the combined cover of cloaking devices and the trail of a comet to mop up whatever would be left after the inevitable explosion between the various Pro and Anti-Bothan factions. When Imperial saboteurs destroyed the planet's shields, the armed conflict began in earnest. Fortunately, Han Solo inadvertently discovered the Star Destroyers on approach and, seeing a greater threat, the ships united as one and defeated them."}, {"tag": "p", "text": "At Yaga Minor, Errant Venture was cut off and trapped by the Imperials and faced destruction when help arrived from an unexpected source—Admiral Pellaeon, who publicly exposed the false Thrawn and Disra's role in the entire affair. He also exposed Tierce as a clone of the original, grown during the Thrawn campaign a decade prior, and who had also altered copies of the Caamas Document in order to spread the growing resentment between the Bothans and much of the galaxy at large. Tierce would be killed by the Mistryl Shadow Guard Shada D'ukal, Disra was arrested by the Imperials, and Flim, acting for the final time as Thrawn, all Imperial forces in the area to stand down, calling upon Bel Iblis to do likewise, effectively bringing an end to the crisis."}, {"tag": "p", "text": "Weeks later, with a copy of the Caamas Document retrieved by Luke Skywalker and Mara Jade at Thrawn's secret fortress, the Hand of Thrawn, on Nirauan, the Pellaeon–Gavrisom Treaty was signed onboard Chimaera by Pellaeon and Gavrisom, bringing an official end to the Galactic Civil War."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the aftermath of the Caamas Document Crisis and the signing of the Pellaeon–Gavrisom Treaty, the state of armed conflict between the New Republic and the Imperial Remnant came to an end, and the Remnant's current borders, eight sectors and over a thousand systems of territory in the upper regions of the Outer Rim, including worlds such as Bastion, Yaga Minor and Muunilinst, were officially recognized by the New Republic."}, {"tag": "p", "text": "Several of the interspecies conflicts that flared up during the crisis abated, particularly when their participants saw how they had been manipulated by Disra's provocation. At the time the Pellaeon-Gavrisom Treaty was signed, at least eight sets of combatants had petitioned Coruscant for mediation."}, {"tag": "p", "text": "Because of the long natural lifespan of Bothans, most of the original saboteurs identified by the Document were still alive, and were promptly arrested and put on trial."}, {"tag": "p", "text": "The galaxy would be at peace for the next six years, barring localized conflicts such as the Second Imperium Crisis and the Diversity Alliance crisis, until the Yuuzhan Vong War in 25 ABY, where the seeds sown during this conflict would bear fruit, as the New Republic and Imperial Remnant would work together during the disastrous Battle of Fondor and would eventually form the nucleus, along with the Hapes Consortium, of the Galactic Federation of Free Alliances."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": ""}]}