{"url": "Cabbel/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Death Squadron personnel", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Cabbel"}, {"tag": "p", "text": "Cabbel was a Human male lieutenant in the Imperial Navy during the Galactic Civil War. He attended the Officer's Candidate School on the planet Carida and was a recent graduate by 3 ABY. During that year, Cabbel was stationed aboard the Imperial II-class Star Destroyer Avenger, attached to the Imperial Death Squadron, where he aided Captain Lorth Needa in deploying Viper probe droids throughout the galaxy in search of the Alliance to Restore the Republic's hidden headquarters. The search led to the discovery of a hidden Rebel base on the planet Hoth, leading to the Battle of Hoth. By then, Cabbel served as the first officer of the Imperial-class Star Destroyer Tyrant, under the command of Captain Xamuel Lennox. Cabbel and Lennox both participated in the Hoth battle, during which the Tyrant was disabled by an Alliance ion cannon fired from the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Imperial career"}, {"tag": "p", "text": "Cabbel, a Human male, lived during the Galactic Civil War. A student of the Imperial Officer's Candidate School on the planet Carida, he was a recent graduate by 3 ABY, and had also attained the rank of lieutenant in the Imperial Navy. That year, Cabbel served aboard the Imperial II-class Star Destroyer Avenger, under the command of Captain Lorth Needa and attached to the Dark Lord of the Sith Darth Vader's Imperial Death Squadron. In the same year, the Imperial-class Star Destroyers of Death Squadron deployed Viper probe droids throughout the galaxy in an attempt to find the Alliance to Restore the Republic's hidden location."}, {"tag": "p", "text": "The Avenger was part of the search, and, following the Battle of Derra IV, Cabbel passed on to Needa Imperial headquarters' report of a Rebel Alliance convoy being completely destroyed near the planet. He then reported to Needa that the first set of probe droids detected no Rebel or even Human activity on the planets they reconnoitered, and that the second set of droids was ready to be deployed. However, Needa requested to delay the order to launch the droids, as Darth Vader had requested the probe droids to be reprogrammed to include information on both Rebel Commander Luke Skywalker and the YT-1300 light freighter Millennium Falcon, to which Cabbel complied, along with Vader's orders to revise the probe droids' targeting list for the planets Allyuen, Tokmia and Hoth."}, {"tag": "h3", "text": "Battle of Hoth"}, {"tag": "p", "text": "While Death Squadron was near the Qeimet system, one of the probe droids discovered evidence of the Rebels' base on Hoth. Death Squadron then made a series of hyperspace jumps to reach the Hoth system, culminating in the subsequent Battle of Hoth. While Vader's forces launched a ground assault on the planet, the Star Destroyers of Death Squadron attempted to intercept escaping Rebel GR-75 medium transports leaving Hoth. Cabbel had by then transferred to the Imperial-class Star Destroyer Tyrant, also attached to Death Squadron, serving as the first officer to Captain Xamuel Lennox. Aboard the Tyrant's command bridge, Cabbel informed Lennox when the first of the transports, the Quantum Storm, escorted by two T-65 X-wing starfighters, approached the Star Destroyer's position. However, as the Tyrant prepared to intercept the transport, the Rebel base fired its planetary ion cannon at the Imperial warship, causing its shields to overload, which made the Star Destroyer lose its helm."}, {"tag": "p", "text": "As power was lost throughout the Tyrant, Cabbel barked orders that none of the crew were listening to, eventually demanding for all stations to report, which Lennox requested to be belayed. Soon, the command bridge's backup generator failed, disabling the Tyrant's artificial gravity system, causing Cabbel to fall over in consternation and various objects to float in midair. The entire ship was silent with the exception of Cabbel sputtering and the crew giving useless status reports as Lennox realized the Tyrant would be dead in space until the Battle of Hoth's outcome was decided."}, {"tag": "p", "text": "While the Tyrant was undergoing repairs, Imperial forces captured Rebel General Crix Madine and transferred their prisoner aboard the Star Destroyer. However, the Tyrant was hit once more from a blast fired by the ion cannon, and Madine was rescued, with the ship unable to give pursuit due to the amount of ion damage it had received. Although the disabled Tyrant was left floating through the Hoth system, and more Rebel transports made it off the planet, the Battle of Hoth still ended as a resounding Imperial victory, with the Rebels forced to retreat from their headquarters."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cabbel was efficient, as well as ambitious and ruthless, and was described by his men in the same way. While aboard the Avenger, Cabbel questioned Captain Needa relaying Darth Vader's orders to include the ice planet Hoth in the probe droids' targeting list, considering the Alliance's last base was on a tropical planet. Nonetheless, he decided not to further question a directive from the Sith Lord, and complied with Needa's request to retarget the droids for Allyuen, Tokmia, and Hoth, albeit still showing hesitance with the ice planet. After the ion cannon's first strike on the Tyrant during the Battle of Hoth, Cabbel barked orders in the confusion, despite nobody else listening to him. When the ship's artificial gravity system was lost, Cabbel's sputtering, along with the crew's status reports, were the only sounds heard on the Tyrant. He had brown hair and fair skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Lieutenant Cabbel wore the standard-issue Imperial officer's uniform during his service aboard both the Avenger and the Tyrant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cabbel first appeared as an Imperial officer in the 1980 film Star Wars: Episode V The Empire Strikes Back. He was portrayed by Oliver Maguire and credited only as one of several \"Other Officers.\" Cabbel and Lennox are both absent from the film's novelization, which instead attributes their scene, with slightly altered dialogue, to Captain Needa and a controller aboard the Avenger. The film's script identifies Cabbel as a \"Controller.\""}, {"tag": "p", "text": "In 1998, Cabbel was first named and given a brief backstory on a card for the Hoth Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game. Prior to that, film footage of Cabbel and Lennox from The Empire Strikes Back was reused in a cutscene for the 1993 computer game Star Wars: X-Wing. 2014's Star Wars: Imperial Handbook: A Commander's Guide confirmed that Lennox indeed took part in the Battle of Turkana—the same battle from the X-Wing game's introductory cutscene. However, Cabbel's Decipher card revealed that he had been a recent graduate from the Officer's Candidate School shortly before the Battle of Hoth, and that cutscene takes place four years earlier."}, {"tag": "p", "text": "Cabbel also appeared in the 2002 video game Star Wars: Jedi Knight II: Jedi Outcast, exclusively as a multiplayer bot. He does not appear in the game's story mode. Cabbel and Lennox were both originally intended to be featured in a story for the 2012 reference book The Essential Guide to Warfare, which did not make the final cut. In 2014, the StarWars.com article Star Wars: The Essential Guide to Warfare Author's Cut released that story along with other material cut from the book."}, {"tag": "p", "text": "In 2013, Topps Collectibles released 2013 Topps Star Wars Galactic Files Series 2, a trading card set with elements from both the original and prequel trilogies of Star Wars films. Along with Cabbel receiving his own individual card, the Empire Strikes Back Rebel lieutenant Cal Alder's card also erroneously gave Cabbel's character bio instead of one for Alder. In 2015, Topps released 2015 Topps Star Wars Illustrated: The Empire Strikes Back, a trading card set based on the radio dramatization of the Empire Strikes Back. In that set, the \"Reporting to Needa\" card shows the scene in the dramatization, taking place prior to the Battle of Hoth, where a lieutenant and Captain Needa have a conversation aboard the Avenger regarding the probe droids the Star Destroyer is deploying in search of the Alliance. The lieutenant is illustrated with Cabbel's appearance, thus retconning Cabbel as the character in the radio drama."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}