{"url": "Cadeliah", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Females", "Category:Humans", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Cadeliah"}, {"tag": "p", "text": "Cadeliah was a human female born to two heirs of rival crime syndicates—Krynthia of the Unbroken Clan and Khamus of the Mourner's Wail Syndicate. Khamus attempted to kill Krynthia before she gave birth to hide the fact that he was the father, hiring bounty hunters led by Nakano Lash to escort him into the Unbroken Clan sanctuary. Lash killed Khamus upon learning his intentions, rescuing Krynthia, who died giving birth to Cadeliah weeks later. Lash went into hiding to take care of Cadeliah, who the former bounty hunter hoped would be able to unite the two rival syndicates. After Lash's death and at her request, Beilert Valance took responsibility for her. He got her to Lowik, and after an ambush by fellow bounty hunters Zuckuss and 4-LOM, Cadeliah was placed in the care of Yuralla Vega."}, {"tag": "h2", "text": "Biography"}, {"tag": "h4", "text": "Corellia"}, {"tag": "p", "text": "Daughter of Krynthia of the Unbroken Clan and Khamus of the Mourner's Wail Syndicate, Cadeliah was the heir to two rival criminal empires. In order to avoid the fact that he was the father, Khamus prepared to kill his unborn child by executing its mother just after the Skirmish on Corellia. Before he could do this, however, Nakano Lash, a bounty hunter enlisted to help Khamus, killed him, saving the mother and her child. T'ongor, part of Lash's crew, helped the two to escape, meeting up with the rest of the ensemble, Bossk, Boba Fett, and Beilert Valance. During the struggle, T'ongor was killed by a stray sniper blast coming from Fett's blaster. This bolt was intended for Krynthia and the unborn Cadeliah, but Valance shoved Fett, preventing this from happening. Weeks later, Krynthia passed away in childbirth, and Lash took it upon herself to raise Cadeliah until she was old enough to bring an end to the crime war."}, {"tag": "h4", "text": "Ruusan"}, {"tag": "p", "text": "Around 3 ABY, Lash and Cadeliah had been living in hiding on the planet Ruusan. During this time, Lash had been secretly contacting Valance, asking him to come help her with the child. Lash resurfaced into the public eye, and a chain of investigations lead several bounty hunters to Ruusan. One day while Lash was out, the Thisspiasian bounty hunter Ooris Bynar infiltrated their home, and had Cadeliah at gunpoint as Lash returned. After a quick conversation, Cadeliah and Lash struck back at the hunter, killing him and deciding to leave for good. Soon after, T'onga, sister of T'ongor, and Valance found Bynar's body. After questioning Lash's friend in a neaarby village, they made their way into Ruusan's orbit to find her."}, {"tag": "p", "text": "Onboard Lash's ship, Valance betrayed T'onga's goal of eliminating her, as the restraining bolt she planted on him was damaged. T'onga was then shot in the chest and killed by Boba Fett, who followed them to Ruusan thanks to the confession of Bossk. Valance began a brawl with Fett, before being electrocuted and temporarily disabled, allowing Fett to attack Lash and Cadeliah. They engaged in a short fight with Fett, where he stabbed Lash in the chest. As the ship began to disintegrate and Fett fled the scene, Valance had to leave Lash to die after desiring to, yet failing to save his former mentor. Cadeliah was now in the care of Valance, and they escaped on Valance's ship, the Broken Wing just as the Unbroken Clan arrived to destroy Lash once and for all."}, {"tag": "h4", "text": "On the run"}, {"tag": "p", "text": "Cadeliah accompanied Valance to The Spur to get repairs for his damaged cybernetics. While stopping for food, the pair barely escaped an ambush from an Arcona bounty hunter before making it to Slade's Repairs, where Valance could get his palm blasters repaired and improved. Earlier, however, the Unbroken Clan's general Vukorah has enlisted the help of bounty hunting duo Zuckuss and 4-LOM to hunt him down. The hunters quickly reach the repair shop, and shoot down the technician finishing work on Valance. After a brief yet painful brawl with the two, Cadeliah and her protector narrowly escaped once more. Zuckuss soon reveals to his compatriot, however, that he's placed a tracking device on the Broken Wing. A heavily damaged Valance and Cadeliah soon arrived on Lowik, to visit Valance's old flame, Yuralla Vega. Cadeliah helps the man limp to the rebel outpost, and he falls into Vega's arms while slowly bleeding out. In orbit, the Mist Hunter arrives for an even bigger score."}, {"tag": "h4", "text": "Bounty Hunter Ambush"}, {"tag": "p", "text": "Zuckuss and 4-LOM soon arrived on the forested world with a cache of B2-series super battle droids. Meanwhile, Vega, Cadeliah, and other rebels set up the mess hall's table as a makeshift operating table for Beilert. The bounty hunter was repaired, and a group of rebel soldiers went out to protect the compound from an unknown presence detected outside. Valance barricaded the door, allowing for Vega and Cadeliah to escape through a tunnel while he held off the droid bounty hunter."}, {"tag": "p", "text": "Outside, the super battle droids kept the rebel soldiers busy, as the bounty hunter Zuckuss ambushed Vega and Cadeliah, battering the former in the head while stunning Cadeliah. Valance rushed into the forest to find the two, finding Vega cradled by her husband, who confirmed that she was going to make it. With this reassurance, Beilert went off to retrieve Cadeliah from the bounty hunters. Meeting the duo at the Mist Hunter, Valance made a deal. He traded them the rare fire ruby given to him by Vega to buy time as the Rebellion evacuated their base, taking Cadeliah with them. Cadeliah was now in the care of Vega and the Rebel Alliance."}, {"tag": "p", "text": "Shortly after, Valance asked Kondra about Cadeliah, and Kondra told the bounty hunter that she was fine with the couple and their fleeing alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}