{"url": "Caet_Shrovl", "categories": ["Category:Legends articles", "Category:Females", "Category:Khuiumin Survivors", "Category:Pilots", "Category:Shistavanens"], "nodes": [{"tag": "h1", "text": "Caet Shrovl"}, {"tag": "p", "text": "Caet Shrovl was an albino Shistavanen Wolfwoman."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "She was raised on Uvena III, her mother's home, although she was not from that planet. As a result, she was largely alone in her upbringing. She joined the Khuiumin Survivors in search of her mate. Her rare condition made her extremely sensitive to sunlight to the point she wore a heavy cloak and darkened goggles during the day to protect herself. However, this made her particularly skilled in dogfights that took place in areas of realspace that were devoid of natural light, referred to as \"voidfights\"."}, {"tag": "p", "text": "Corran Horn met her while he masqueraded as Jenos Idanian, a pilot that flew for the Survivors. Their first meeting came while Corran was trying to portray himself as a bully and threw his neighbor out of the nicer apartment next to him. Her fang-filled snarl when she answered his pounding announcement at her door evoked a \"nice to meet you\" from Corran who quickly went on his way."}, {"tag": "p", "text": "Their next encounter was after he flew a pirate mission with her. They crossed, as Corran forced her to allow a crippled opponent to escape, and Corran received a scar and a little respect for his efforts. The two of them, along with Timmser — another Survivor pilot, ended up becoming good friends and spending much of their free time together. The pair shared their plights and reasons for being among the Invids, though out of necessity, Jenos' reason for being there was slightly different from that of Horn's. Under Horn's tutelage she became a much better pilot; he was even able to get her to open up about her reclusiveness and found out that she had been taken advantage of by Remart Sasyru, yet another Survivor pilot and nemesis of Idanian."}, {"tag": "p", "text": "Caet, along with Timmser, taunted Corran/Jenos about the fact that he was jealous about Leonia Tavira's favoring Sasyru instead of him, a point which Corran at first flatly denied. These taunts, however, coupled with the wise statements of the Caamasi Elegos A'Kla forced Corran into introspection, and ultimately allowed him to steer clear of the Dark Side's temptations that Tavira embodied."}, {"tag": "p", "text": "When Corran terrorized the Courkrus's hive of Invid pirate crews, she along with Timmser fled the planet in a hyperdrive-equipped Tri-fighter."}, {"tag": "h2", "text": "Appearances"}]}