{"url": "Caf_Treblanc", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Alliance Military officers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Caf Treblanc"}, {"tag": "p", "text": "Caf Treblanc was a Human male soldier in the Alliance to Restore the Republic during the Galactic Civil War, a conflict fought between the Alliance and the Galactic Empire. By 0 ABY, Treblanc had attained the position of chief in the Alliance. Immediately preceding 0 ABY, the Alliance managed to destroy the Imperial DS-1 Orbital Battle Station superweapon near the moon Yavin 4."}, {"tag": "p", "text": "Following the victory, the Royal Award Ceremony was held in the Grand Audience Chamber of the Great Temple, the Alliance's base on Yavin 4. Treblanc was present in the ceremony, standing on a raised dais behind Rebel fighters Luke Skywalker, Han Solo, and Chewbacca, who were honored for their actions during the battle. Fair-skinned with a brown moustache, Treblanc wore a white uniform with a helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Caf Treblanc first appeared as an uncredited Rebel extra seen during the award ceremony honoring the Heroes of Yavin at the end of 1977's Star Wars: Episode IV A New Hope film. In June 2012, the character was named by \"Rogues Gallery,\" a feature published in Star Wars Insider 133. At least one other character in the Star Wars universe shared Treblanc's surname. Romeo Treblanc was the name given via Hyperspace's \"What's The Story?\" feature to a character seen in the prequel trilogy films Star Wars: Episode I The Phantom Menace and Star Wars: Episode III Revenge of the Sith, respectively. However, it has not been canonically established if the two characters had any relation with each other."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}