{"url": "Caicos", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Corellian collaborators", "Category:Corellian Councilors", "Category:Humans", "Category:Males", "Category:Sith Empire individuals"], "nodes": [{"tag": "h1", "text": "Caicos"}, {"tag": "p", "text": "Caicos was a male Human member of the Corellian Council during the Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Caicos was born to a wealthy family, with every privilege growing up, and it was never enough. Squandering his family's credits on a series of failed businesses, he turned to loans from the Hutt Cartel and other underworld figures, including the Voidwolf. Taking advantage of Corellia's lax laws to walked the line between crime lord and legitimate businessman, Caicos doubled his fortunes and bought himself a place on the Corellian Council. When the Empire decided the takeover of Corellia the Voidwolf called Caicos for help and he willingly bribed, blackmailed and threatened his fellow councilors into selling out Corellia to the Empire."}, {"tag": "p", "text": "Later during the battle of Corellia, Caicos was holed up in his residence after the truth of the council's betrayal became public. The councilor was forced to resort to communicating with his allies via holo."}, {"tag": "p", "text": "When undercover Imperial agent, Darmas Pollaran was exposed by the Voidhound, he fled to Caicos' droid factory, now re-purposed into a field hospital, in order to get the surgery to change his identity. Caicos suggested that he could take charge of the Voidwolf's plans, but Pollaran reminded him that a public enemy coudln't make any allies in the galactic underworld. Their conversation was interrupted by the Voidhound and Caicos attempted to alert factory security but none responded due to the guards being pre-occupied with the Republic."}, {"tag": "p", "text": "After arresting Pollaran and Senator Bevera Dodonna, the Voidhound came after Caicos, managing to disable the security systems around his estate before convincing his guard captain to let him inside. Once confronted by the smuggler, Caicos attempted to bribe them into officially working for the Voidwolf but was refused. In response, Caicos summoned his guards while he made a run for it, intending to reach his shuttle bound for the Voidwolf's flagship, the Regnant. But he didn't make it far and the Voidhound found him cowering behind crates after dealing with his guards. Fearing for his life, Caicos gave his shuttle and security codes to the Regnant in exchange for his life. The Voidhound took what he offered and told him to answer to the Corellian people."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}