{"url": "Cal_Kestis", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Humans", "Category:Jedi Commanders", "Category:Jedi Knights of the Jedi Order", "Category:Jedi Purge survivors", "Category:Males", "Category:Mantis crew", "Category:Scrapper Guild employees"], "nodes": [{"tag": "h1", "text": "Cal Kestis"}, {"tag": "p", "text": "Cal Kestis was a Force-sensitive human male who became a Jedi Knight during the reign of the Galactic Empire. As one of the few Jedi who survived the purge that destroyed the Jedi Order, Kestis lived in seclusion for years until a confrontation with the Inquisitorius compelled him to openly resist the Empire's rule. Hunted across the galaxy by the Empire's Jedi hunters, Kestis embraced his connection to the Force once more, having decided to restore the Jedi Order."}, {"tag": "p", "text": "The Padawan of Jedi Master Jaro Tapal, Kestis served alongside his mentor in the Clone Wars until the Grand Army of the Republic betrayed its Jedi officers, after receiving the command to execute Order 66 from Supreme Chancellor Sheev Palpatine. As a result, the clone troopers of the 13th Battalion attempted to execute Kestis as a traitor to the Galactic Republic, forcing General Tapal to sacrifice himself in order to save his apprentice. After his master's death, Kestis lived in exile on the planet Bracca, working as a rigger for the Scrapper Guild until he was discovered by the Second and Ninth Sisters, Inquisitors of the Empire."}, {"tag": "p", "text": "Kestis joined the crew of the starship Stinger Mantis after they rescued him from the Inquisitors. Over the course of their journey, Kestis befriended the droid BD-1, the former Jedi Cere Junda, the Mantis' captain Greez Dritus, and the Nightsister Merrin. They attempted to locate Eno Cordova's Jedi holocron, which contained information that was vital to creating a new generation of Jedi. Though they retrieved the holocron while surviving an encounter with the Sith Lord Darth Vader, Kestis chose to destroy the holocron in order to protect the galaxy's Force-sensitive children from the Sith. By then, Kestis had been recognized as a fully-trained Jedi by his new mentor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Cal Kestis was a young member of the Jedi Order during the last years of the Galactic Republic. During his training to become a Jedi, Kestis traveled with Grand Master Yoda to the ice planet Ilum and participated in The Gathering, a rite of passage where all Jedi younglings retrieved a kyber crystal to build their lightsabers. He would eventually be taken as a Padawan by Jedi Master Jaro Tapal. In training sessions with his master, Kestis was taught that with persistence and the Force as his ally, he would overcome any obstacle. Later, he would learn to use the power of telekinesis."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars that spanned  the galaxy, Kestis, like many other Padawans, served in the Grand Army of the Republic as Jedi Commander while training as Padawan under the command of Jedi General Jaro Tapal. Following their successful mission on the planet Bracca, Kestis and his Jedi Master were preparing to leave for Mygeeto when Supreme Chancellor Sheev Palpatine initiated Order 66, declaring every Jedi an enemy of the state. Onboard their Venator-class Star Destroyer Albedo Brave, clone troopers of the 13th Battalion that served faithfully under the Jedi's command suddenly turned against their leaders, determined to kill them both."}, {"tag": "p", "text": "Seeking to escape, Kestis was able to avoid most of the clones by sneaking through the maintenance passages while Tapal sabotaged their ship's reactor, ensuring the  Venator-class Star Destroyer's imminent destruction. Despite losing his original lightsaber in the process, Kestis made it to the escape pods with his master, but both were attacked by clone troopers as they attempted to evacuate the Star Destroyer. Although they managed to enter one of the pods, Tapal sustained several wounds to the chest, fatally injuring him while Kestis received a minor cut to his jaw. Kestis was unable to save the life of his master, who died imploring his pupil to stay true to the Jedi way, await the Jedi High Council's signal, and trust only in the Force. Kestis, who kept Jaro Tapal's lightsaber, was traumatized by the ordeal."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "h4", "text": "Escape from Bracca"}, {"tag": "p", "text": "In the five years following the rise of the Galactic Empire, Kestis went into hiding to escape the purge that killed most of his fellow Jedi. He found work on Bracca by joining the Scrapper Guild as a rigger, while the Empire consolidated its reign over the galaxy. One day, Kestis and his friend Prauf were at work, and when an accident put Prauf's life at risk, Kestis was forced to use the Force to save him. However, Kestis's act did not go unnoticed and attracted the attention of the ImperiaI Inquisitors, a group of users on the dark side of the Force, whose main mission was to hunt down and eliminate the surviving Jedi. Two Inquisitors were sent to find Kestis, the Second Sister and the Ninth Sister, and after the former brutally murdered Prauf, who was voicing his frustration about the Empire, Kestis attacked her with a lightsaber, revealing himself as a Jedi. The Second Sister defended herself from the attack with her own lightsaber and used the Force to push him to the Ninth Sister who suspended him in midair. Kestis managed to escape and landed on a passing train, but, having been discovered, he had to flee for his life once again."}, {"tag": "p", "text": "Kestis was narrowly saved by two individuals, Cere Junda and Greez Dritus, after having faced the Second Sister in a lightsaber duel. With the Empire in pursuit, Kestis sought to reawaken his connection to the Force and complete his Jedi training. Junda revealed herself to be a former Jedi Knight intent on restoring the Jedi Order. She also revealed that to achieve this goal, they would need to travel to the planet Bogano to retrieve a Jedi Holocron containing a list of Force-sensitive children scattered throughout the galaxy. It turns out this Holocron was contained within a vault which only a Jedi could open by using the Force."}, {"tag": "h4", "text": "The Vault"}, {"tag": "p", "text": "After reaching Bogano to enter the vault, Kestis stumbled on a friendly droid, BD-1, who helped Kestis complete his quest. After being trapped in a cave, Kestis was able to improve his connection to the Force, and by necessity, relearned the ability to wall-run in the process. Now able to escape the cave, he made his way towards the vault. Upon reaching it, BD-1 projected a message from Jedi Master Eno Cordova, who went over the details with the holocron and revealed that to access it, Kestis had to find the tombs of three Zeffo Sages. With BD-1's aid, Kestis continued his journey to rebuild the Jedi Order. On the way back, Kestis found a mural that made BD-1 project another message from Cordova, which said that the Zeffo had an interest in the planet Dathomir. Upon returning, Kestis told about the holocron and discovered that Cordova had been Junda's master. As Greez did not know what a holocron was, Junda showed one that she owned and told Kestis to use the Force to open it. Kestis opened it and the message that Jedi Master Obi-Wan Kenobi sent years earlier to alert the surviving Jedi to stay away from the Jedi Temple and Coruscant appeared. Kestis quickly finished the message and asked Junda why she was no longer a Jedi. Junda said that she had an experience that changed her perspective, but she believed that the return of the Jedi Order was the best option to defeat the Empire and asked what Kestis believed. Kestis believed he could not hide from the Empire forever, so he thought he had no choice but to participate in the mission, but Junda said that as long as he is alive, he always has a choice. Greez said it would be Kestis who would choose where to go next, Dathomir or Zeffo. Having decided to rise up against the Empire, Kestis set the course for Zeffo."}, {"tag": "h4", "text": "The Tombs of Zeffo"}, {"tag": "p", "text": "On Zeffo, Kestis learned that the Empire occupied the planet to mine for ancient artifacts. The directive, code-named \"Project Auger,\" was terminated after Zeffo's magnetic winds and hostile fauna proved too difficult for the Empire to deal with. Kestis, guided by the Force, was able to pass through and enter the Tomb of Eilram to search for a message left by Cordova. Inside the tomb, Kestis found another holo-recording left by Cordova telling them to travel to Kashyyyk to find the Wookiee Chieftain Tarfful. Kestis destroyed an AT-ST when the Mantis was attacked just before they left the world."}, {"tag": "h4", "text": "First visit to Dathomir"}, {"tag": "p", "text": "After landing on Dathomir, Kestis and BD-1 faced off against a Nightsister who demanded they leave the planet immediately. When they refused, she commanded the Nightbrothers to attack them. Shortly after escaping that threat, Kestis came upon a Wanderer, who claimed to be studying Zeffo ruins."}, {"tag": "h4", "text": "Assisting the Kashyyyk Resistance"}, {"tag": "p", "text": "After landing on Kashyyyk, the crew of the Mantis found themselves embroiled in a conflict between the Empire and an early group of rebels. Kestis hijacked an Imperial AT-AT and destroyed a large number of Imperial forces. The rebel insurgent Saw Gerrera took note of Kestis' actions and asked for his assistance in liberating the planet. Saw and his Partisans were in the middle of a campaign to liberate a nearby wroshyr sap refinery. With the possibility that Tarfful could be one of the Wookiees detained there, Kestis and BD-1 agreed to help him."}, {"tag": "p", "text": "After freeing the imprisoned Wookiees and taking the refinery from the Empire, Kestis heard Saw's rebellion speech and received an invitation to join the Partisans, but refused because he could not abandon his mission, but Saw said the invitation continued. Kestis still had no information on Tarfful's whereabouts. Luckily Choyyssyk, one of the Wookiees Kestis helped liberate, had fought alongside Tarfful in the past. He and Mari Kosan, a member of Saw's guerrilla fighters, agreed to find Tarfful for Kestis. However, just as he received this news, Junda discovered an Imperial transmission revealing the Empire was close to unearthing another tomb on Zeffo."}, {"tag": "h4", "text": "Return to Zeffo"}, {"tag": "p", "text": "After Kestis rushed back to Zeffo to stop the Empire from progressing further into the Miktrull's tomb, he fell into a trap sprung by the Second Sister. She revealed herself to be Trilla Suduri, Junda's former Padawan. After a perilous battle, Suduri seemed to get the upper hand on Kestis, but before she could strike him down, BD-1 intervened, activating an unbreakable laser field between the two of them. As Kestis escaped into Miktrull's Tomb, he tried to call Junda but was interrupted by the Second Sister slicing his comm."}, {"tag": "p", "text": "After exploring the tomb further, Kestis climbed onto a hanging sarcophagus. However, the Second Sister's forces had caught up with him, and the Inquisitor ordered her forces to shoot the sarcophagus down. Finding himself falling into certain death, Kestis again was able to improve his connection to the Force, and pulled himself towards his saber in the nick of time, landing safely on a ledge below. On their way out of the tomb, Kestis and BD-1 found another encrypted log from Cordova, explaining how the key to the Bogano Vault was a device called the Astrium, which he would of course have to find. Before he was able to return to the Mantis, Kestis was captured by a Haxion Brood bounty hunter."}, {"tag": "p", "text": "Waking up, Kestis found himself imprisoned and BD-1 missing. After escaping and finding BD-1, Kestis discovered he had been captured by the infamous Sorc Tormo and forced to fight in a brutal coliseum. Kestis fought several different creatures, one more dangerous than the other and defeated all, in addition to the bounty hunter that had captured him and stolen BD-1 beforehand. At the climax of the show, the Mantis burst into the Haxion Brood's lair to rescue them. However, upon boarding, his crewmates were not met with immediate gratitude. Kestis learned the Brood found him because Dritus lied about paying off his debts. Kestis also struggled with the revelation that Junda had given up Suduri under torture. Their argument was cut short as they received word from Mari Kosan—Tarfful had been found in the Shadowlands and had agreed to meet him."}, {"tag": "h4", "text": "Journey to the Origin Tree"}, {"tag": "p", "text": "On the way to Kashyyyk, Dritus approached Kestis telling him to go easy on Junda. Landing on the forested planet, they found the remains of the resistance, which had been nearly wiped out by the Second Sister. Finding Mari, she told Kestis that Saw had since left the planet and split their forces. After fighting their way through the recaptured refinery, Kestis and BD-1 regrouped with Mari and Choyyssyk to meet Tarfful. Tarfful told Kestis to climb the Origin Tree and Mari gave Kestis a breather to help him get there, and the two groups parted ways."}, {"tag": "p", "text": "On the way up to the Origin Tree, Kestis and BD-1 encountered a wounded Shyyyo bird. After healing it, they were granted safe passage to the top of the Origin Tree, where they discovered that Cordova had found a Zeffo Astrium there years beforehand and that the tomb on Dathomir may hold another. Just as they were leaving, the Ninth Sister attacked. After a fierce battle, Kestis emerged victorious by cutting off the Ninth Sister's hand and pushing her off the tree. The Shyyyo bird then carried Kestis and BD-1 down the tree, and Kestis returned to the Mantis to make a run back to Dathomir."}, {"tag": "h4", "text": "Trials on Dathomir"}, {"tag": "p", "text": "Returning to Dathomir, Kestis and BD-1 nearly made it to the next tomb when they were ambushed by more Nightbrothers. While they did eventually overcome that, they were forced to wander through the dangerous Dathomirian swamps. They were once again found by the Nightsister Merrin who began raising undead Nightsisters to attack them as they proceeded on their way. Inside a dark cave, BD-1 found climbing claws on a Nightbrother corpse. Before Kestis could grab them they were attacked by the monstrous Gorgara. After warding the beast off one time, Gorgara soon returned to continue the fight. An intense aerial battle culminated in a devastating crash that killed Gorgara, and Kestis was able to get back on track."}, {"tag": "p", "text": "After fighting through Merrin's brethren, Kestis and BD-1 finally made it into the tomb, where Kestis experienced a flashback in which he remembered Jaro's sacrifice to protect Kestis from the clone troopers during the Purge. Kestis was then attacked by Jaro's spirit, resulting in his lightsaber being destroyed. Defeated and disheartened, Kestis attempted to flee back to the Mantis, but he ran into the wanderer from before, who revealed himself to be Taron Malicos, a former Jedi now studying the dark side of the Force. Malicos asked Kestis to join his quest for power but was cut off by Merrin. She raised the horde of undead to destroy him and Kestis, who narrowly escaped. After this experience, Junda advised Kestis to build his own lightsaber."}, {"tag": "h4", "text": "The Jedi Temple on Ilum"}, {"tag": "p", "text": "Junda gifted Kestis her lightsaber hilt, though her kyber crystal had been sold long ago to pay for Dritus' debts. On Ilum, Kestis remembered when he was on the planet with Yoda when he was younger to find the kyber crystal to build his first lightsaber. Kestis entered the caves and followed the call of his crystal through a crack in an ice wall. The ice beneath Kestis and BD-1 shattered, sending Kestis plummeting into the icy water. BD-1 saved Kestis just in time, and after finding his crystal, it split into two. Kestis, crushed by failure, indicated that he was ready to give up, which triggered BD-1 to play a log from Cordova, revealing BD-1 had sacrificed his memories to store logs vital to Kestis' quest. Kestis combined Junda's and Jaro's hilts, creating a new, double-bladed lightsaber."}, {"tag": "p", "text": "On their way out of the caves, Kestis discovered a massive Imperial mining operation on Ilum, created to extract the planet's kyber crystals. As Kestis and BD-1 fought their way back to the Mantis, Junda blocked the Empire's comms to prevent them from calling reinforcements. The Empire eventually reversed the slice, but it gave Kestis and BD-1 enough time to get back to the Mantis, and the crew escaped back to Dathomir."}, {"tag": "h4", "text": "Retrieving the Astrium and the holocron"}, {"tag": "p", "text": "On Dathomir, Kestis returned to face the shade of his master. He realized the only way to defeat Tapal was to embrace his past and move forward. He knelt before Tapal's specter, causing the apparition to vanish. As Kestis and BD-1 moved into the Tomb of Kujet, they came upon Merrin. This time, however, she was willing to talk. Attempting to reason with her again, Kestis insisted that Malicos had lied to her about the Jedi. Naturally, the Nightsister was skeptical, so Kestis disavowed Malicos as a fallen Jedi and passed her his lightsaber as a show of trust, stating that possessing such a weapon doesn't make one a Jedi, explaining the Order's role as peacekeepers before they were betrayed and hunted to extinction. In turn, Kestis learned that she might be the only survivor of the Nightsister massacre carried out by General Grievous during the Clone Wars. He then sympathized with her loss and stated that Malicos was wrong to use that against her."}, {"tag": "p", "text": "Returning his lightsaber, Merrin allowed Kestis to pass, warning that Malicos was ahead. Malicos tried one last time to turn Kestis, but attacked when he refused. After Malicos began to gain the upper hand, Merrin intervened, blasting Malicos with magick. They worked together to defeat Malicos, and Merrin buried him alive. Kestis then revealed that he came to Dathomir for an Astrium, and Merrin agreed to help him. Desiring more knowledge of the galaxy and a future for her people, Merrin joined Kestis' quest. After Kestis and Merrin found the all-important device, the crew stood ready to return to Bogano and retrieve the holocron."}, {"tag": "p", "text": "Kestis and BD-1 brought the Astrium to the Vault and opened the holocron. Kestis was swept into a vision of a potential future if he kept and used the holocron. It showed younglings training and calling him master, only to be ambushed by the Empire. Death and torture followed, and Kestis saw himself surrender before the Second Sister to spare his Padawans' lives, leading to his transformation into an Inquisitor. When he awoke, the Second Sister stood before him. After a drawn-out duel, Kestis pulled her lightsaber towards himself, thrusting him into a Force echo showing Junda and Suduri tortured, Suduri becoming an Inquisitor and Junda giving in to to the dark side. When he returned, the Second Sister and the holocron were gone. Kestis ran back to the ship and told Junda. She reached out to the Force, took up the Second Sister's lightsaber and knighted Kestis."}, {"tag": "h4", "text": "Encounter with Darth Vader"}, {"tag": "p", "text": "Chasing after the Second Sister, Kestis ventured into the Fortress Inquisitorius on Nur to retrieve back the holocron. Kestis defeated all the imperial forces on his way and saw Junda end up with three Purge Troopers when he found her, which impressed him. Junda accessed a console to locate the holocron. Kestis asked if there was any sign of Trilla, and Junda said no before saying that the holocron was in the interrogation chamber. Kestis went towards the camera while Junda pushed away the imperial reinforcements. Kestis arrived at the chamber, but suffered an attack from the Second Sister. While his blades were locked, Kestis told Trilla that he saw the suffering she went through and that it was not too late to forget, but Trilla said that she was stronger because of the pain and that she knew that Kestis would return the holocron before saying that he wouldn't leave there alive. Kestis defeated the Second Sister by hurting her right shoulder with the lightsaber, leaving her on her knees on the floor. Defeating her in combat and recovering the holocron, Junda arrived and managed to convince her to let go of her hate. Upon doing so, the Second Sister sensed and heard Darth Vader lurking behind her. Realizing he had witnessed her failure, the Second Sister could sense her final moments were near and quickly yelled \"Avenge us!\" to Kestis and Junda before Vader struck her down. Kestis and Junda activated their lightsabers in response to the danger Vader posed."}, {"tag": "p", "text": "Junda leaped for Vader head-on with the Second Sister's lightsaber. This proved ineffective, as the Sith Lord was able to swat her away with a simple telekinetic gesture, sending her down towards the Fortress chasm. With Kestis completely outmatched and alone, Vader told the young man that he would be wise to surrender to him. However, Kestis could sense the danger Vader posed and, though he agreed with the Sith Lord's remark, he did not back down. Vader was able to overcome Kestis effortlessly, pulling him towards him with the Force. Before Vader could kill him, Kestis attempted to escape the Sith Lord by pulling a piece of machinery down on top of him, however, Vader effortlessly managed to stop the attack before throwing Kestis out of the room and down the walkway. As Kestis stumbled to his feet, Vader forced open the closing door and hurled parts of the floor at him. Seeing that he probably wouldn't survive a confrontation with Vader, let alone be able to defeat him, Kestis realized it was time to go and just barely managed to make it to the turbolift on the other side of the room and reach the lower levels to escape from the Sith Lord."}, {"tag": "p", "text": "When Kestis opened the door to his escape, Vader was already there waiting for him. Vader was able to push him to the ground and stagger him, resulting in a blade lock. As Vader was slowly overpowering Kestis, BD-1 shocked the Dark Lord, allowing Kestis to stab him. Vader was able to stop the lightsaber from going completely in his stomach and used the Force to push Kestis away. Kestis tried to Force-pull his saber back to him, but Vader caught it in midair, activated it, and used it to stab Kestis in his rib. As Vader came in for the finishing blow, he sensed Junda coming in to attack, who had somehow managed to escape the chasm. This distracted Vader long enough to save Kestis, who then engaged in a fight with Junda against Vader. Vader quickly overpowered them, but Junda tapped into the dark side to slow him down. Vader, sensing the anger in her, tried to convince her to give in to the dark side while continuing towards the pair. Kestis, reminding Junda that she still had a choice, was able to prevent Junda from fully turning. As Vader struck with his lightsaber, Junda was able to put up a bubble to block his attack. Seeing how easily this could fail, Kestis used the Force to destroy the already damaged glass holding the water out, which forced Vader to avoid that instead of defeating Kestis and Junda, who barely escaped in the chaos. Kestis put on a mask for Junda to breathe and started swimming trying to reach the surface while holding Junda who had been knocked unconscious during the escape. Kestis started to lose consciousness due to shortness of breath and almost drowned, but both were saved by Merrin."}, {"tag": "p", "text": "Kestis woke up on board Mantis with Greez at his side and went to see the other members of his team. Kestis was greeted with a hug by Merrin, which caused him pain due to the injury inflicted by Vader. With the holocron safe Kestis used the Force to open it, but after the bleak vision he had in Bogano, Kestis decided to destroy the holocron to keep the children on the list safe from the Empire and entrusted his fate to the Force before asking to where they would go now."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cal Kestis was a human male, serving the Jedi Order as a Padawan before Order 66 was issued. During his time fighting together with the 13th Battalion in the Clone Wars, Kestis and the clones that were part of the battalion had a very friendly relationship and the betrayal of the clones due to Order 66 left him visibly shaken emotionally. After the fall of the Jedi, Kestis went to serve the Scrapper Guild as a rigger, a physically demanding and dangerous job. Kestis had a focused work ethic and a sense of humility. He generally kept to himself and was quiet and hard-working. He usually refused to speak of his past, as he was quite haunted by it. He felt that he could have saved his Master if only he followed his master's teachings. He usually reacted with anger or dismissed his past when it was brought up. Eventually, Kestis began to open up more about his past, and when confronted by the dark side on Dathomir for the second time in the form of his master, Kestis fully accepted his past and grew from the experience, acting much more level headed and wise, showing an almost mentor-like attitude towards others. Kestis had great respect and compassion for nature. When he visited Kashyyyk the second time, Kestis found an injured Shyyyo bird and treated his wound. When the Shyyyo bird helped Kestis to fly to his destination, Kestis was happy to see that there were many natural beauties in Kashyyyk that the Empire had not yet destroyed. At Dathomir, Kestis showed an impressive respect for life forms. He was attacked by a Chirodactyl who persistently tried to kill him, but after it died during his fight, Kestis mourned his death, saying that he wanted to be able to say that the creature was fine, despite trying to kill him. Kestis was extremely selfless, often putting the needs of others above his own. During his time hiding in Bracca, trying to avoid being found by the Empire, Kestis used the Force to save his friend Prauf when Prauf almost fell to death, even though he knew he risked the Empire discovering his Jedi identity. When Kestis recovered Eno Cordova's holocron from the Second Sister at Nur, he decided to destroy it to keep Force-sensitive children on the list safe from the Empire, showing concern for those he never met."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Lightsaber abilities"}, {"tag": "p", "text": "As a Padawan, Kestis originally had a single-bladed blue lightsaber until he lost it down a turbolift shaft while trying to deflect blaster shots from clones. In an escape pod, Tapal gave Kestis his damaged lightsaber, and he kept it with him until the crystal broke on Dathomir five years later. Using its remains, Junda's lightsaber and a newly split Ilum crystal on the planet, Kestis built a double-bladed lightsaber that could separate into two lightsabers. Like all Jedi, Kestis' training made him highly athletic beyond the limits of normal beings, which he used to traverse difficult terrain and overpower various enemies with ease."}, {"tag": "p", "text": "As he progressed through his journey, Kestis became significantly more competent in the use of his lightsaber and displayed impressive skill in the use of a single-, double-, and Jar'Kai dual-blade combat. His skill eventually reached a point where he was able to switch between these three forms while engaged in combat, utilizing strings of attacks in which he would constantly vary his weapon configuration in order to keep his opponents off-balance. His skills allowed him to hold his own against Imperial Inquisitors and defeat their Purge Troopers. His first two encounters with the Second Sister ended in defeat, though he was able to escape her on both occasions: The Second Sister even praised him for the rate of his improvement in their second fight, stating that Kestis's performance was not bad. After partially healing his damaged connection to the Force, he proved able to defeat the Ninth Sister on Kashyyyk. He also stood up to the former Jedi Master Taron Malicos, but his skills ultimately proved insufficient to defeat him alone, with Malicos remaining easily equal with Cal blade-to-blade in addition to overpowering him with the Force, requiring Merrin's assistance to win. When he faced the Second Sister on two more occasions, one in Bogano and one in Nur, Kestis not only stalemated the Second Sister in their first fight before tricking her by suddenly deactivating his lightsaber to overpower her, but in their final duel, he finally defeated her, incapacitating her by injuring her right shoulder, showing how his skill with a lightsaber progressed. However, he was no match for Darth Vader when they faced each other in lightsaber combat, though he managed to fend off his strikes, albeit barely, and hold a bladelock with Vader long enough for BD-1 to shock Vader, giving Kestis the opening he needed to stab Vader in the stomach, though even then he failed to strike Vader down and was swiftly disarmed."}, {"tag": "h3", "text": "Force powers"}, {"tag": "p", "text": "After Kestis' connection to the Force was damaged by the trauma he suffered during Order 66, he retained some basic use of the Force, such as the enhanced physicality of a typical Jedi. However, he was only capable of using the Force Stasis ability, having lost the ability to use even the most basic of telekinetic techniques. He also retained his ability to use the rare, naturally acquired gift of psychometry, a Force technique that allowed him to sense the history of objects and people through the Force if he touched them. When Kestis fully healed his connection to the Force, he was able to use telekinetic techniques such as Force push, Force pull, and Force Repulse to great effect, even against groups of enemies or large beasts."}, {"tag": "p", "text": "Kestis's ability to use his Force Stasis power grew significantly as well, as he was able to hold multiple opponents in stasis at once and even slow down multiple blaster bolts simultaneously. He was also capable of throwing his lightsaber with the Force and utilizing limited telekinetic lightsaber combat, in which he would fling his weapon in a circle around his body with the Force. During his duel with Malicos, he proved unable to free himself from the former Jedi Master's Force Grip. Despite being easily subdued by the Second Sister with the Force in their early duels, Cal progressed to where he was able to overpower her in both lightsaber skills and force abilities during their third and fourth altercations, force-pushing and disarming her of her lightsaber in their third altercation. However, he was easily outmatched by Darth Vader's force abilities, as he was neither able to affect Vader nor resist the Sith Lord's telekinetic attacks, though he was resillient enough to pull down a piece of machinery down on Vader while force-choked by him, only for his attack to be easily repelled and Kestis himself flung aside."}, {"tag": "h3", "text": "Other abilities"}, {"tag": "p", "text": "A speaker of Galactic Basic Standard, Kestis also understood the droid Binary language. Kestis was also a skilled mechanic and was able to repair and modify BD-1 as well as make repairs to his master's damaged lightsaber."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his apprenticeship under Jaro Tapal, Cal Kestis owned and wielded a single-bladed blue lightsaber with a metallic cylindrical hilt and leathery grip. The kyber crystal that powered the weapon was retrieved by Cal from the crystal caves on Ilum when he participated in The Gathering as a youngling. Kestis used the weapon as part of his Jedi training under Tapal and later during the commencement of Order 66. During his escape from Order 66, Kestis lost this weapon when it fell down an elevator shaft after a pair of Clone troopers shot the lightsaber out of Cal's hand."}, {"tag": "p", "text": "During the early Imperial Era, Kestis kept the saber of his fallen master while on the run from the Empire. Although the blue lightsaber was originally double-bladed, the weapon had been damaged during Order 66, and subsequently could only emit a blade from one side of the weapon. Kestis used the weapon on several missions during his journey to rebuild the Jedi Order. During a mission to Kashyyyk, Kestis repaired his master's lightsaber, restoring the weapon's second blade. Unfortunately, the weapon was destroyed shortly after by Kestis, who accidentally crushed it during a visit to Dathomir."}, {"tag": "p", "text": "After the destruction of his master's weapon, Kestis constructed a new lightsaber on Ilum. This lightsaber was constructed using parts from Tapal's damaged saber and the lightsaber of Cere Junda. The weapon was double-bladed like Jaro Tapal's, and could also be split into two separate sabers for duel-wielding. The two crystals housed within Kestis' new weapon both came from the crystal caves of Ilum. Kestis subsequently used his new weapon during his second mission to Bogano and the mission to Nur that followed it. Cal also possessed a comlink which he used to communicate with the crew of the Stinger Mantis."}, {"tag": "p", "text": "As a Jedi Padawan during the Clone Wars, Cal Kestis wore standard earth-colored Jedi robes. These robes included a cream undertunic, a light brown overtunic, a deep brown tabard, a pair of tall deep brown boots, loose-fitting light brown trousers, and a broad sash tied around the waist. Sometime after the near-extinction of the Jedi Order, Kestis stopped wearing his Jedi robes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cal Kestis is the protagonist of the Star Wars video game Star Wars Jedi: Fallen Order, which was released on November 15, 2019. He is portrayed by Cameron Monaghan. Before settling on Kestis, the game developers thought about having either an alien or female protagonist, but Kestis was ultimately used because they didn't want to \"alienate\" the player nor have a female protagonist competing with Rey, the sequel trilogy's protagonist. In May of 2020, Fallen Order received an update allowing the player to play using Kestis' Inquisitor outfit for the duration of the game, though Kestis donning the outfit is non-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}