{"url": "A280C_blaster_rifle", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Weapon stubs", "Category:Incomplete lists", "Category:BlasTech Industries products", "Category:Blaster rifles"], "nodes": [{"tag": "h1", "text": "A280C blaster rifle"}, {"tag": "p", "text": "The A280C blaster rifle was a modified variant of the popular A280 blaster rifle and was the preferred weapon of Rebel Alliance commandos. It featured a high rate of fire and was known for its excellent firepower and sturdy design."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The A280C heavy blaster rifle served as one of BlasTech's top-selling combat blaster rifles for nearly a century before it was used by the Alliance to Restore the Republic. Before the Clone Wars, the A280C was the standard-issue infantry rifle for many planetary defense forces and private militias. Despite its heavy weight, the A280C was accurate and durable and it continued to see service throughout the Outer Rim Territories. Almost every military academy, militia, and military trained with the A280C prior to the Clone Wars."}, {"tag": "p", "text": "When more modular platforms were adopted by the Galactic Republic, the A280C waned in use. With the reformation of the Republic into the Galactic Empire, the Empire absorbed or disbanded local defense forces, resulting in many decommissioned A280Cs. These guns flooded the secondhand market and black markets, and found their way to the Alliance to Restore the Republic, and became standard issue. Even the bounty hunters and commandos that worked for Haxion Brood were equipped with them.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Prior to its canonical name being revealed in Star Wars Battlefront, the A280C was previously named as the A295 blaster rifle in Star Wars Legends material."}, {"tag": "p", "text": "In Star Wars Battlefront II, the A280C uses the model previously associated with the A280 blaster rifle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}