{"url": "Calamari_sector/Legends", "categories": ["Category:Legends articles", "Category:Calamari sector", "Category:Confederacy of Independent Systems sectors", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors", "Category:Mon Calamari culture", "Category:New Republic sectors", "Category:Outer Rim Territories sectors"], "nodes": [{"tag": "h1", "text": "Calamari sector"}, {"tag": "p", "text": "The Calamari sector, also known as Mon Calamari Space or Calamari Space, was a sector located in the Outer Rim Territories."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Planets in the Calamari sector included Buchich, Dac (Mon Calamari), Damendine, Eridicon IV, Hinakuu, Krinemonen, Mantan, Minntooine, Pammant, Ruisto, Sanctuary, and Talas."}, {"tag": "p", "text": "The Calamari sector had two significant hyperlanes connecting it to the rest of the galaxy. The Overic Griplink connected the sector to the Perlemian Trade Route at Quermia, via Munto Codru and Pakuuni. The Giblim Route connected the sector to the Tion Hegemony at Dellalt. A third hyperlane, Prously's Rim Run, connected the sector to Dornea but terminated at Baros."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The cavitation hyperdrive invented by the Calamari mathematician Q-Viza enabled the Calamari people to reach the nearest star systems thousands of years before the Galactic Civil War. It began with the colonization of Ruisto, Mantan and Hinakuu, between 4400 BBY and 4200 BBY. The Calamari's interstellar federation came to grow out of the establishment of colonies meant to function as a \"reef\" of breakwater settlements that protected the main world. During their pre-Republic expansion era, the Calamari maintained relations with nearby alien civilizations, such as the lamproids of Florn and the Veubgri of Gbu. The Republic made first contact with Mon Calamari when Republic scouts reached Ruisto in 4166 BBY."}, {"tag": "p", "text": "In fear of being left behind by their Calamari counterparts, the Quarren established colonies on uninhabited worlds like Pammant, Minntooine and Buchich. When the Clone Wars divided societies in Calamari sector, some of these Quarren worlds manufactured warships for the Confederacy of Independent Systems."}, {"tag": "p", "text": "During the Galactic Civil War, the Calamari and Quarren peoples rebelled against the Galactic Empire's occupation forces, driving them out of the sector, and giving the emerging Rebel Alliance a safe haven to build up their forces. It was the location of several shipyards used by the Alliance during this period and was in close proximity to other notably anti-Imperial worlds, such as Dornea, Hast, New Alderaan and Solay. However, a direct consequence of their driving out the Imperials was that a massive Imperial invasion force was approaching the sector during the Battle of Endor, and had the Rebels lost during that battle, they would have only a few months to contemplate their mistake before the second Death Star arrived to destroy Mon Calamari and end their insurrection. Following the Battle of Endor, the Calamari sector was among the first sectors to throw off the Empire."}, {"tag": "p", "text": "It later became a bulwark against the forces of the Yuuzhan Vong, during their invasion of the galaxy."}, {"tag": "p", "text": "The sector was represented by Tikkes, Tundra Dowmeia and Meena Tills in the Galactic Senate, Timi Rotramel in the Imperial Senate, Gial Ackbar on the New Republic Provisional Council; then by Q-Varx, Cilghal, Pwoe and Gron Marrab in the New Republic/Galactic Alliance Senate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}