{"url": "A280_blaster_rifle", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:BlasTech Industries products", "Category:Blaster rifles"], "nodes": [{"tag": "h1", "text": "A280 blaster rifle"}, {"tag": "p", "text": "The A280 blaster rifle was a type of blaster rifle mostly used by troopers of the Rebel Alliance and the soldiers of the New Republic. There existed two variants of the A280 blaster, the A280C and the A280-CFE, both of which being favored by commandos of the Rebel Alliance."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The reliable A280 was highly effective in piercing through armor and provided more power than other blaster rifles at long range. It featured a power charge system and integrated muzzle compensator. The A280-CFE (covert field edition) was a modular version of the A280 that featured a core pistol that could be reconfigured into an assault rifle or sniper rifle."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic Era"}, {"tag": "p", "text": "During the Galactic Republic's final years, the A280 blaster rifles were commonly used by local planetary forces which made them readily available on the black market, thus the Rebel Alliance acquired them with ease, and began to utilize it throughout their fight against the Galactic Empire."}, {"tag": "h3", "text": "Firearms of the Rebel Alliance"}, {"tag": "p", "text": "During the Battle of Hoth, many of the rebel troopers were armed with A280 blaster rifles to hold off the incoming Imperial attackers until the evacuation transports flee away."}, {"tag": "p", "text": "Major Lokmarcha used an A280 during Operation Yellow Moon."}, {"tag": "p", "text": "The rifles were also heavily used by the Alliance on Endor when they planned to assault the newly constructed DS-2 Death Star II Mobile Battle Station. The group troops on Endor had been tasked with infiltrating and destroying the Death Star's shield generator. Rebel soldiers like Musmuris Reetgeet wielded A280s when they captured the Immobilizer 418 cruiser Glaciate during the Battle of Jakku."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The pirate Hondo Ohnaka later mentioned the A280 in his book Galactic Explorer's Guide and stated it had been a common sight among the rebels on Hoth and Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The A280 blaster rifle first appeared in Star Wars: Episode V The Empire Strikes Back, a 1980 film as a weapon prop used by the Rebel Alliance. Although the name was never given on-screen, the reference book Ultimate Star Wars published in April 28, 2015 confirmed \"A280 blaster rifle\" as a canon name for the weapon. In Moving Target: A Princess Leia Adventure, it is referred to as a A-280. Parts of the A280 resemble the real life AR-15, specifically the receiver."}, {"tag": "p", "text": "In Star Wars Battlefront II, the A280 uses the STG 44 model previously associated with the A280C blaster rifle and fires a three-shot burst, while the A280C uses the AR-15 model previously associated with the A280."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}