{"url": "A280_blaster_rifle/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:BlasTech Industries products", "Category:Longblasters"], "nodes": [{"tag": "h1", "text": "A280 blaster rifle"}, {"tag": "p", "text": "The A280 was a blaster rifle produced by BlasTech Industries, and was considered one of the best armor-piercing blasters produced during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Though much heavier than Imperial-issue rifles such as the E-11, the A280 was a sturdy weapon and was reputed to be able to cut a fully armored stormtrooper in half at medium range. This weapon, along with its predecessor, the DLT-20A, were marketed as Longblasters. The A280 was different from the DLT-20A in that its galven circuits were clustered near the focusing crystal, giving the weapon a slight bulge at the midsection. This also provided the A280 with more power over a longer range."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the final years of the Republic, the A280 was the standard-issue rifle for the Planetary Security Forces and for Ranulph Tarkin's Republic Outland Regions Security Force. After the Declaration of a New Order, the A280 became available for the black market. Several of these rifles were stolen by Janse for the Alliance to Restore the Republic when he left BlasTech shortly before the Battle of Endor. The Alliance had already been using these weapons prior to this battle; Rebel soldiers wielded them during the Battle of Hoth in 3 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The BlasTech A280 blaster rifle prop was based on the AR-15 series of rifles as an attempt to replicate the overall appearance of the A295 blaster rifle, which was built from the World War II–era German StG44 Sturmgewehr rifle. Many of the cosmetic features that assisted in this goal were made from stock parts of the Sussex Armoury \"Jackal\" air rifle.[source?]"}, {"tag": "p", "text": "The depiction of the A280 has varied over different sources. The image used in this article is that from Star Wars: The Complete Visual Dictionary. Another version was depicted in the Endor Limited expansion of the Star Wars Customizable Card Game, and yet another in its original appearance in the The Rebel Alliance Sourcebook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}