{"url": "Callia%27s", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic organizations", "Category:Antique stores", "Category:Front companies"], "nodes": [{"tag": "h1", "text": "Callia's"}, {"tag": "p", "text": "Callia's was an antiques shop that was located aboard the luxury liner Cal Ambre during the time of the New Order. It was owned and operated by Retter Lewis and specialized in rare and unusual religious artifacts, but also served as a front for a Rebel network."}, {"tag": "h2", "text": "Location"}, {"tag": "p", "text": "The shop was located on the main mall level of the Cal Ambre, between Larjh StarCorporation and an exclusive clothier."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "The shop had two levels: The lower level had a public gallery in the front, which was similar to a museum in appearance: Artifacts were placed on displays complete with holorepresentations. Prices weren't posted on any artifact, under the assumption that if a being had to ask the price, then they couldn't afford it anyway. In the back there was a smaller gallery for serious buyers. This gallery contained the most precious artifacts, many of them connected to the Force. While casual shoppers weren't allowed access, agents of Emperor Palpatine often acquired these Force-connected items. The upper level was dedicated to storage areas, vaults, and offices."}, {"tag": "h2", "text": "Personnel"}, {"tag": "p", "text": "The shop was owned and operated by Retter Lewis, a scholar and specialist for artifacts. He had two permanent employees: Graff Teiras served as store manager and liaison to shippers, sellers, and dealers, and Halacc Demior served as both accountant and bodyguard. A-3PO, a silver 3PO-series protocol droid, served as translator. During peak times, additional employees, mostly university students, were hired."}, {"tag": "h2", "text": "Security"}, {"tag": "p", "text": "The shop was protected by a very sophisticated security system. While Retter Lewis had Halacc Demior as a bodyguard, he relied on the Cal Ambre's security forces for external protection."}, {"tag": "h2", "text": "Operations"}, {"tag": "h3", "text": "Legit business"}, {"tag": "p", "text": "Retter had contacts all over the galaxy and bought unique items and artifacts from estates and explorers for his shop. There, he sold them again to wealthy collectors and universities. The shop received a constant flow of couriers, customers, and dealers. Many powerful Imperial figures like nobles, bureaucrats, and officers were frequently seen in Callia's, as well as servants of the Emperor, who looked for Force-connected artifacts."}, {"tag": "h3", "text": "Rebel cell"}, {"tag": "p", "text": "Retter's shop served as a perfect cover for a Rebel transportation network. Retter, Halacc, and Graff organized routes and destinations for defecting Imperial officers and officials or fleeing Rebel agents from the Core Worlds. Rebel agents informed Retter of incoming \"hot properties,\" and Retter organized their transfer to Rebel safe worlds. They either left the ship with faked IDs or were smuggled off board. Since Retter had the respect of several high-ranking Imperials, the Imperial Customs agent seldom checked Retter's cargo. While Retter Lewis was the mastermind of the whole operation, artifact dealing kept him busy most of the time. Graff, the chief lieutenant, managed the day-to-day schedules and operation of the network and maintained contact with the Rebel Alliance. Halacc, a trained combat expert, aided in operations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}