{"url": "Callef", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Dark Jedi", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Callef"}, {"tag": "p", "text": "Callef was a Human male Dark Jedi who lived during the Cold War between the Galactic Republic and the reconstituted Sith Empire. The apprentice of the Dark Jedi Bengel Morr, Callef and his master rallied the native Flesh Raiders of the planet Tython in an attempt to destroy the Jedi Order. During the early stages of the Flesh Raider uprising, he led his Flesh Raider soldiers in an attack on the Jedi base in the Tythonian Gnarls, and captured a Bith apprentice by the name of Unaw Aharo. However, Callef was killed in a duel with another Jedi apprentice who came to rescue Aharo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive male Human, Callef became the apprentice of the Dark Jedi Bengel Morr sometime before 3643 BBY. Morr, the Nautolan apprentice of the Jedi Master Orgus Din, had disappeared during the Sacking of Coruscant in 3653 BBY by the Sith Empire, and he had gone insane over the course of the next ten years. Morr taught Callef that the Jedi Order had become weak and useless, and that it should be destroyed and rebuilt into something stronger."}, {"tag": "p", "text": "Around 3643 BBY, Callef and Morr made their move on the Jedi homeworld of Tython. In their quest to overthrow the Jedi Order, he and his master instigated an uprising amongst the native Flesh Raiders, and used the bestial natives as soldiers while they directed from the shadows. Using a secret tunnel connecting the Tythos Ridge and the Tythonian Gnarls, Callef led an invasion force of Flesh Raiders into the Gnarls against the Jedi's base there. A Bith Jedi apprentice by the name of Unaw Aharo had noticed the increased Flesh Raider activity in the area and reported his findings to Jedi Master Derrin Weller. However, Aharo was captured by Callef's forces not long after sending his message, and they brought the wounded and disarmed Bith before the Dark Jedi in the cave."}, {"tag": "p", "text": "Callef began to question Aharo, who was shocked to see that the Human carried a lightsaber. However, a young Padawan interrupted Callef before he could kill the Bith, having defeated the Flesh Raider soldiers who had been guarding the cave. The Jedi apprentice's martial skill sparked the Dark Jedi's interest, but Callef was confident in his abilities and summoned two Flesh Raider guards, attacking the Padawan. Despite having only a vibrosword against the Dark Jedi's lightsaber, the apprentice fought and defeated Callef in a duel, which ended with Callef's death."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After his death, Master Orgus Din arrived and sealed the cave after he recovered Callef's lightsaber. Remarking on the strange familiarity of the weapon, Din escorted Aharo to a medcenter and ordered the other Padawan to report to the Jedi Temple. Later on, the Padawan would be contacted by Callef's master Bengel Morr, who expressed his disappointment that Callef was defeated so easily. However, Morr was not overly concerned, as he doubted the Padawan would be able to defeat him and stop the Flesh Raider invasion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Force-sensitive Human male, the fair-skinned Callef had black hair and brown eyes. He was fluent in Basic and able to understand the language of the Bith people, as well as the guttural language of the Flesh Raiders. Callef was arrogant and cruel, believing in survival of the fittest, and he despised what he saw as passivity and weakness on the part of the Jedi Order. Like his master Bengel Morr, Callef desired the destruction of the Jedi Order so that the pair could rebuild it in accordance with their own beliefs. The Padawan who killed Callef later remarked to Grand Master Satele Shan that Callef seemed calm—the apprentice could feel no anger or fear in the Dark Jedi, despite his use of the dark side."}, {"tag": "p", "text": "As Bengel Morr's apprentice, Callef wielded a blue-bladed lightsaber that he based off of his master's own weapon. When Orgus Din—Morr's former master—recovered Callef's saber from the Dark Jedi's body, he was startled by the weapon's familiarity, though he could not remember that of which it reminded him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Callef was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He is the first boss fought by the Jedi Knight character, as part of the player's first class quest \"Attack of the Flesh Raiders.\" Players can choose to attack Callef in the middle of their conversation for dark side points, or ask for Callef's surrender for light-side points. As the Jedi Knight is a Republic character, it is assumed that the Knight chooses only light-side options. As part of an April Fool's joke in 2011, several cinematics from the game were released on The Old Republic's website with vocalization in Shyriiwook, the language of the Wookiee species. One of the videos showed the events of the mission \"Weapon of the Jedi,\" in which players confront Bengel Morr, but the video showed Callef in Morr's place."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}