{"url": "Callista_Ming", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Altisian Jedi", "Category:Farmers", "Category:Females", "Category:Force ghosts", "Category:Former Jedi", "Category:Hosts of Abeloth", "Category:Humans", "Category:Jedi Purge victims", "Category:Jedi trainees of the New Jedi Order", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Callista Ming"}, {"tag": "p", "text": "Callista Ming, originally known as Callista Masana, was a Human Jedi Knight from the planet Chad during the waning years of the Galactic Republic. She was a member of a rogue sect of Jedi, led by Master Djinn Altis, who were accepted back by the Jedi Order during the Clone Wars to take command of clone troopers and fight for the Republic. During the war, she followed Altis into battle on the planet JanFathal alongside a contingent of clones and two orthodox Jedi, Anakin Skywalker and his Padawan Ahsoka Tano, in order to rescue a Republic Intelligence agent, Hallena Devis. After the war, Masana survived the initial stages of the Great Jedi Purge and made contact with other survivors on the planet Belsavis."}, {"tag": "p", "text": "When the automated Imperial dreadnaught Eye of Palpatine came to demolish the settlement, Masana and her lover Geith Eris launched a desperate mission to sabotage the ship. They were successful, but in the process, Masana shed her physical body, remaining embedded in the ship's computer as a spirit. Many years later, Luke Skywalker and several other Jedi were brought onto the ship as it resumed its mission. Masana, in spirit form, communicated and began to fall in love with Skywalker. She later took the body of one of the other Jedi, Cray Mingla, after Mingla gave it up to stop the superweapon once and for all. However, in the process, Masana, now using the surname \"Ming,\" lost her ability to touch the Force."}, {"tag": "p", "text": "Despite this loss, Ming helped thwart Admiral Natasi Daala and the Death Seed plague conspiracy, though she and Skywalker parted ways forever. On her journey to rediscover the Force, Ming encountered the dark side entity Abeloth, who absorbed her life essence and took over her body. Abeloth then used Ming's spirit to reach out to Skywalker as he traveled to her, and tried to convince him that she was in fact Ming when he confronted her. Skywalker was surprised to realize how much he still loved Ming after so many years, but he was not fooled by Abeloth's trickery. After facing her numerous times, Skywalker was finally able to detach Ming from Abeloth and the physical world, causing her to disappear into the light side of the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and Jedi training"}, {"tag": "p", "text": "Born on the water-world of Chad, the Force-sensitive female Human Callista Masana lived on an ark in a deep-water ranch with her father, stepmother, and an uncle named Claine; she also had an uncle named Dro. The ranch followed the planet's Algic current, ranging from the equator to the arctic circle. Masana's family was not wealthy, but they had a happy life, living mostly on the deep oceans as herders and farmers. From her youth, Masana helped out on the ranch, herding tsaelke cetaceans and wander-kelp. When the ranch was in the territory of the predatory wystoh and they needed to leave their floating home, the family sent out a foo-twitter, a floating device meant to distract the marine hunters. Masana also rode cy'een, fish native to the world. The first time Masana used the Force was to move some ice that had trapped her with several sea cows. Afterward, she knew she had to join the Jedi, but could never make her confused father understand why."}, {"tag": "p", "text": "Rather than going through the normal process of separation from her parents and training in the Jedi Temple on the capital planet Coruscant, she was recruited into the Jedi Order by the maverick Jedi Master Djinn Altis in 25 BBY, who led a group called the Altisian Jedi. She trained under Altis for five years on his praxeum ship, the second Chu'unthor. Masana constructed a lightsaber, which bore a ring of stylized tsaelke sea-creatures around the hilt in token of her heritage. During a layover on the planet Bespin, she sensed Geith Eris' potential in the Force and asked him to come along with her. He did, though mostly to be with her, and the two fell in love."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, Masana and Eris journeyed with Master Djinn Altis and several other Jedi of their community. They traveled across the galaxy in a freighter, Wookiee Gunner, rendering humanitarian aid to various planets affected by the war. While heading to the planet Yarille on another relief mission, Masana advocated more directly aiding the Galactic Republic, stating that the presence of Altis' Jedi could make a difference, but Altis was reluctant to agree with her and Eris was opposed to the idea altogether. Before they reached Yarille, though, Wookiee Gunner picked up a distress signal from an undercover Republic Intelligence agent on JanFathal, Hallena Devis. Altis contacted a local Republic commander, Captain Gilad Pellaeon, whose ship, Leveler, was the nearest Republic warship, and offered the services of his Jedi in extracting Devis. Pellaeon, who was romantically involved with Devis, agreed to the Jedi offer."}, {"tag": "p", "text": "In short order, Altis, Masana, Eris, and their other Jedi companions met with and boarded the Leveler. While on the Republic ship, Masana marveled at the complexity of the machinery and electrical systems it contained. She met a Togruta Jedi Padawan named Ahsoka Tano, and Masana made Eris—who fostered a keen dislike of the rules of the orthodox Jedi Order—promise not to antagonize the Padawan. Masana also met Captain Pellaeon, who freely admitted his own interest in rescuing Devis, but asked his officers and the Jedi to keep him accountable to his duty; she admired him for his admission and his hands-on approach to leadership."}, {"tag": "p", "text": "As Leveler approached JanFathal, Masana was uneasy with the idea of letting clone trooper Captain CT-7567, nicknamed \"Rex,\" accompany them down to the surface, feeling that he and his small force of fellow clone troopers would likely be killed. Rex was persistent, though, and it was ultimately agreed that he and his troops would go with Altis' Jedi and Tano to the planet, with Masana resolving to do her best to keep all of them alive. Just before they embarked, Masana asked Pellaeon for an item Devis had handled to help the Jedi track her. They were able to trace the Republic agent in the Force, and they departed the Leveler soon after confirming that she was still alive. For the trip in a shuttle down to the surface, Masana kept Tano close by her, wanting to keep the Padawan away from Eris."}, {"tag": "p", "text": "Landing on JanFathal in the city of Athar, the Jedi and clone troopers began their search. To pass the time, Masana briefly explained the differences between Altis' Jedi and the orthodox Order to Rex. Using her skill with computers, she was able to bypass Separatist communication encryption, but in doing so, she opened up all the audio channels at once. She then attempted to filter out communications of interest by ear in the midst of hundreds of simultaneous transmissions. Shortly thereafter, Tano questioned Masana's relationship with Eris—by this time, the two were engaged to be married. The Padawan also attempted to persuade Masana to abandon what she saw as Altis' heretical teachings. Masana, bemused, did not argue with the Padawan, but pointed out that even within the Jedi Order, a high-ranking Jedi Master, Ki-Adi-Mundi, had not fallen to the dark side despite having several wives. She also asked Tano to consider that it was possible to serve the light side of the Force without being part of the orthodox Jedi Order."}, {"tag": "p", "text": "The clones and Jedi soon located Devis, but the agent was being held in a district saturated with battle droids. Masana and Tano fended off the droids while Altis and the clone troopers took down Devis' captors and extracted the Republic agent. Once Devis was rescued, Altis joined Tano and Masana in battling the droids. The droids encroached upon the Republic party, though, killing one clone trooper and injuring another. The Jedi eventually covered their retreat by collapsing a building down on the droids and then racing back to their shuttle. They took off, intending to link up with Leveler, but the Republic vessel had been detected by Separatist warships and had jumped to hyperspace to avoid destruction. As such, the shuttle returned to JanFathal, accompanied by Tano's master, Anakin Skywalker, in a starfighter."}, {"tag": "p", "text": "As their spacecraft was not capable of hyperspace travel, Skywalker suggested seizing a Separatist CR-20 troop carrier, which could jump to lightspeed. With Altis and Tano providing a diversion for the droids, the clones, Devis, and other Jedi seized a grounded CR-20 and took off. As they fled, Masana and Eris applied first aid to an injured clone, Ince, trying to slow his bleeding, although he ultimately died. The CR-20 departed JanFathal, pursued by the Separatists, but was able to rendezvous with the newly returned Leveler. Once back aboard the Republic warship, Masana learned that its advanced concussion missile launchers were inoperable—the weapons worked, but the targeting computers were offline. Masana, after obtaining Pellaeon's permission, was taken to the main targeting array, where she melded with the computer in order to control the missile launchers. While in a mental state of being inside the machine, she was able to aim and fire enough missiles to destroy seven Separatist warships, allowing Leveler to escape the system."}, {"tag": "p", "text": "The Leveler returned to the orbital yards at the planet Kemla to meet up with the Wookiee Gunner again. Masana parted on good terms with Tano and Rex, and Altis' Jedi soon departed, heading for Yarille to carry out their original humanitarian mission. For her part, though, Masana had been intrigued by the experience of having her mind joined with a machine, but resolved to not explore it too much further, as she felt it might be dangerous for her to do so."}, {"tag": "p", "text": "Later in the Clone Wars, Masana, along with Eris and some other members of Altis' community, decided to aid the Republic in their war effort and rendezvous with the Republic Fleet Auxiliary Support Vessel Redeemer over the planet Thyferra. Eris and Masana openly kissed while in the hangar bay of the ship, something which surprised Null ARC trooper Captain Ordo, as this conflicted with the orthodox Order's views on relationships. She met with Ordo and General Etain Tur-Mukan, who gave Masana and her friends command of some clone troopers. About two months later, Tur-Mukan asked Masana to meet her again, this time on Nerrif, a large Republic supply station in the Mid Rim. Before they spoke, Masana used the Force to try and raise the spirits of some of the wounded clones. While there, Tur-Mukan confessed to Masana that she had secretly taken a lover and had a child, which went against standard Jedi doctrine, so she wondered whether she could join with Master Altis and his renegade Jedi at some point. Masana said that she could not see Master Altis turning them away and that she was sad that Tur-Mukan was being made so miserable, just because she was not a normal Jedi. At some point during the conflict, Masana also met Jedi General Obi-Wan Kenobi."}, {"tag": "h3", "text": "The Eye of Palpatine"}, {"tag": "p", "text": "At the end of the war, the Republic was replaced by a Galactic Empire and the Jedi were exterminated. Masana, Altis, and Eris survived the initial purge and remained in contact with other survivors such as Master Plett, who sheltered a group of Jedi children on the remote world of Belsavis. For a time, Masana, Altis, and some of the other Altisian Jedi lived in a hiding place on the planet Meserian. They were discovered there by the Mandalorians Bardan Jusik and Fi Skirata, who introduced themselves to the Jedi and explained that they wanted to arrange for three fugitive Jedi to come and live with the sect. Masana asked Jusik if one of the Jedi was Etain Tur-Mukan, so he informed her that Tur-Mukan had died. Although she was upset by this news, Masana quickly composed herself."}, {"tag": "p", "text": "The refuge on Belsavis was threatened in 18 BBY when the Jedi discovered that the newly-formed Galactic Empire had built the massive dreadnaught Eye of Palpatine—a sort of proto-Death Star armed with powerful experimental turbolasers—to attack the Belsavis refuge. Masana and Eris attempted to sabotage or destroy the massive ship, but had a disagreement over their course of action. Eris, a pilot, wanted to flee the ship to warn the others, claiming to have predicted the guns' firing pattern. Masana wanted to disable the ship's main computer—she hoped to use the Force to make the enclision grid protecting the center misfire and then disable the ship's computer. Ultimately, Eris went off without her and was killed when the guns blew up his ship. Masana, heartbroken, continued with her plan. She knew that the grid would eventually hit her as she proceeded toward the ship's core and that each successive hit would increase her chances of being hit again. Her surmise was correct and her physical body was slain, charred by the lightning of the grid. Masana, however, used her talents in the Force to transfer her spirit into the Eye of Palpatine's gunnery computer."}, {"tag": "h3", "text": "Reawakening and a new life"}, {"tag": "p", "text": "She remained there for thirty years, until Jedi Master Luke Skywalker and several other New Republic Jedi were captured by the Eye of Palpatine's automatic systems, brainwashed, and taken aboard. Other crew taken by the ship included Sand People, Jawas, and Gamorreans, which created a large number of problems for the Jedi. One of the Jawas gave Masana's lightsaber to Skywalker during his initial investigations into the ship. Masana first revealed herself to Skywalker while he was on the run from Sand People, helping him by opening doors and giving him a safe place to hide in a quartermaster's office, sealing the door behind him. While he was inside the office, she revealed herself to him by appearing on a monitor screen while he looked at himself in it. She had been observing him for some time and after he resolved to destroy the weapon, she aided him against the ship's controlling central computer. Since the entire ship was wired, Skywalker could communicate with her spirit via the Force and she with him using the ship's computers and screens, as well as the Force."}, {"tag": "p", "text": "However, Skywalker had concerns of his own. One of his students, Cray Mingla, had been brought onboard the Eye of Palpatine at the same time as Skywalker, but Mingla had since been captured by a group of Gamorreans. The ruling ship's computer had determined that Mingla was to be executed, and so Masana aided Skywalker in his efforts to free his student. She helped him rig up a foo-twitter to scare off the Gamorreans, and while he worked, they exchanged life stories, partially through words, and partially by sharing Force visions of their pasts with one another. After being attacked by several of the ship's droids, Skywalker even saw a vision of her final heroics in heading toward the gun room thirty years previously. When he awoke, Masana helped distract the Gamorreans by impersonating the ship's computer to compel the Gamorreans, who were indoctrinated to follow the computer's orders, to attack a rival Gamorrean tribe so Skywalker could free Mingla. She also helped him get the eclectic members of the ship's brainwashed crew—even the Gamorreans—to landers to get them off the dreadnaught."}, {"tag": "p", "text": "During Skywalker's time on the Eye of Palpatine, the two fell in love. Skywalker wanted to have Mingla—who was also a noted artificial intelligence programmer—create a human replica droid for Masana in an attempt to preserve her spirit, as had been done for Mingla's own lover, Nichos Marr, who was also present on the Eye of Palpatine. However, Masana insisted that they destroy the automated craft, even at the cost of her own life. As Mingla and Masana feared that Skywalker would not be able to put an end to the Eye of Palpatine, Mingla stunned Skywalker and transferred him to one of the landers. However, with guidance from Masana, Mingla—who wished to die and be reunited with her dead lover—used the Force to misfire the enclision grid while Marr journeyed to the control room and detonated the station. Just prior to the station's destruction, Masana transferred her spirit into Mingla's body."}, {"tag": "h3", "text": "Search for the Force"}, {"tag": "p", "text": "Unfortunately for Masana—now going by the surname Ming—the process of transferring bodies severed her connection to the Force. While she was able to explain some things about the Jedi Order, including the toys and other artifacts on Belsavis, as well as inform Skywalker of the history of the Order, which later proved useful in rediscovering the Shard Iron Knights, she herself was unable to use the Force. Skywalker remained loyal to Ming despite this and took it upon himself to aid her in reconnecting with the Force after they returned to the Jedi Praxeum on the moon Yavin 4."}, {"tag": "p", "text": "After journeying together to Coruscant to deliver a message warning of Hutt intrigue to Skywalker's sister, Leia Organa Solo, Skywalker and Ming took a trip in the hopes of reconnecting her to the Force. To this end, he took her to a number of places to try and spark her connection to the Force while they also tried to deepen their relationship. First, they went to the Mulako Corporation Primordial Water Quarry, which reminded her of her watery homeworld. Although Ming thought it was a romantic, personal place, it did not help her connect with the Force. Instead, she had Skywalker take her to the planet Dagobah, where Skywalker had trained to become a Jedi. They arrived on the planet without incident, but not long after landing, they were attacked by nightbats. In combat, Ming unleashed her anger on them, revealing that she could still touch the dark side of the Force. Skywalker was tempted to think of that as progress, but Ming firmly stated that if she could only touch the dark side, she would prefer never to use the Force again."}, {"tag": "p", "text": "Leaving Dagobah, they journeyed to Hoth, where the spirit of Obi-Wan Kenobi had once appeared to Skywalker, but while heading toward the ruins of Echo Base, they were attacked by two automated turrets. Skywalker and Ming handily defeated them and entered the base to find a group of hunters who had been trapped there by a sizable herd of ferocious wampas. They tried to get Skywalker and Ming to take them off-planet, but the ice creatures crippled their ship. Although they fell back to Echo Base, wampas attacked the party both en route and after their withdrawal, and the hunters were all eventually killed. Ming joined Skywalker in fighting their way back to the ship, managing to resist the temptation to use the dark side and unleash her anger. They took off despite the damage to their vessel, but with no hyperdrive and failing life support, Ming was placed in the one life support suit while Skywalker entered hibernation trance and used the Force to call for his sister. The two nearly froze to death until Organa Solo, responding to Skywalker's call, arrived in the freighter Millennium Falcon to save them."}, {"tag": "h3", "text": "Leaving Skywalker"}, {"tag": "p", "text": "The Millennium Falcon conveyed Ming and Skywalker back to the Jedi Praxeum to recover, only to find that it was under attack by the Knight Hammer, flagship of the United Warlord Fleets' Admiral Natasi Daala. Ming joined the defense with the other Jedi, but realized that she would not be as effective as the others, who were able to use the Force to battle Daala's ground troops. Ming wanted to stand as strongly as the other trainees, and not be left behind in their wake. Seizing a damaged Imperial TIE bomber after killing the pilot, who had been trying to repair the grounded ship, Ming infiltrated the Knight Hammer. She landed in a hangar bay after giving a false radiation alarm and found the deserted hangar to be full of loaded TIE bombers. She then set a large number of the bombers to explode on a timer inside the flagship's hangar, severely damaging the Knight Hammer's engines and dooming it to crash into the planet Yavin. Ming went on to confront Admiral Daala, preparing to sacrifice herself to stop the renegade admiral. Resigned to her fate, Ming used the Force to direct her lightsaber, regardless of the dangers of the dark side, deflecting blaster bolts fired by the admiral. Daala eventually fired on stun to incapacitate Ming and left her to die on the doomed ship. Ming was presumed dead, although she revealed her survival to Skywalker. Nevertheless, she decided to leave him, realizing that she needed to strike out on her own to rediscover her Force connection. She felt that remaining with Skywalker put too much pressure on her and was too painful. She did hope to return to him one day, but only if she was able to regain her Force powers without using the dark side."}, {"tag": "p", "text": "In 13 ABY, she worked on the Gamorrean trading-ship Zicreex. Bogged down on the planet Gamorr during slushtime, she became caught up in the murder of the Gamorrean warlord Vrokk, who had supposedly been slain by Guth, one of the crew on the Zicreex. Vrokk's wife, Kufbrug, had sealed off the room where Vrokk had been murdered, and Guth had been a one-time romantic interest of hers. Ming was able to convince Kufbrug to let her investigate the murder, although the Gamorrean held the other crew of the Zicreex as prisoners. Ming contacted Sebastin Onyx, a poet, and obtained an enzymer from a local Bith. Constructing a reflective panel in the room where Vrokk had been slain, she and Kufbrug waited until evening, when the murderer revealed itself to be a kheilwar insect from the planet Af'El. Ming and Kufbrug fought off the creature until, cornered, it changed its shape to resemble those it had seen. This particular kheilwar changed into images of Rog and Gundruk—Vrokk's brother and Kufbrug's daughter, who had been trying to murder Vrokk, Guth, and eventually Kufbrug in order to take over their sizeable holdings. Ming—refusing to succumb to the temptation to use the dark side—and Kufbrug fought off the kheilwar until morning, when it was destroyed by the sunlight. Having solved the murder, Ming and the others were finally cleared of all charges and released."}, {"tag": "h3", "text": "On the Planet of Twilight"}, {"tag": "p", "text": "By 13 ABY, Ming had traveled to Nam Chorios, the \"Planet of Twilight,\" where she had hopes of finding her connection to the Force since the planet itself was a Force nexus. Ming briefly fell in with two local Force-sensitives, Taselda and Beldorion, but later left them after seeing their pettiness—she felt that Taselda was an old crone plotting against Beldorion and Beldorion was content to do little but eat and sit in his palace, nearly enslaved to the exiled Seti Ashgad. Callista quickly learned that the planet was infested with droch insects that carried the Death Seed plague, which had once killed billions across the galaxy in years past. Journeying into the arid wasteland, she joined up with the Force-sensitive Theran cultists and meditated in search of the Force. Additionally, she helped operate the gun stations that kept ships from landing and possibly becoming infected with the Death Seed plague."}, {"tag": "p", "text": "After Ashgad requested a meeting with the Chief of State, Leia Organa Solo, Ming delivered a warning to her not to meet with him because of the danger of the Death Seed; however, Organa Solo chose to ignore her advice. Meanwhile, Skywalker tried to fly in to Nam Chorios to find Ming—little did he or Ming know that Organa Solo had been drugged and captured by Seti Ashgad and was being held in his estate. Eventually, Organa Solo managed to escape into the desert, where Ming, who had been keeping Ashgad's people from attacking the gun stations that kept large ships from escaping, met her. There, she aided Organa Solo in defeating the Hutt Dark Jedi Beldorion, providing instruction in lightsaber combat and the Force to Organa Solo. Skywalker, meanwhile, was drawn into the plot to unleash the Death Seed after his own encounters with Taselda and the Newcomers—one of Nam Chorios' social groups—even spotting Ming from a distance during an attack on a gun station. After being tricked into entering Ashgad's estate, he was able to defeat the plague's sentient manifestation, Dzym, and stop Ashgad by recruiting the native Force-strong crystalline tsils. The tsils, who were aware of the Death Seed plague, helped Skywalker stop Ashgad and cure the Death Seed spreading through the sector in exchange for the return of all the tsils that had been stolen by the Loronar Corporation as part of Ashgad's plan. After the conflict was resolved, Skywalker and Ming met. Although painful, their brief meeting—consisting of one look—brought resolution to their relationship and they realized that going their separate ways was for the best. Luke Skywalker eventually went on to marry the former Emperor's Hand, Mara Jade. There was a rumor among the students at the Jedi Praxeum that Jade had arranged for Ming's permanent disappearance."}, {"tag": "h3", "text": "Into the Maw"}, {"tag": "p", "text": "At some point on her journey, by 43.5 ABY, Ming ventured into the Maw and discovered a planet full of carnivorous flora. There, Ming encountered Abeloth, a dark side destroyer of civilizations and the last surviving member of the family of the Ones, powerful Force deities, who had been imprisoned on the world. Abeloth consumed Ming, stealing her life energy and taking her physical form, resulting in her death. Abeloth was able take on both Ming's original appearance and that of Mingla's."}, {"tag": "p", "text": "When Skywalker, his son Ben, and their tenuous Sith allies arrived on the planet to confront Abeloth in 44 ABY, Skywalker was shocked to discover Ming's Force presence in the entity. Abeloth had previously used Skywalker's feelings for Ming to reach out to both him and his son aboard their ship, the Jade Shadow, making the two think that the presence was the deceased Mara Jade Skywalker's. Although Abeloth tried to trick Luke Skywalker into believing that she was actually Callista Ming, the Jedi soon realized that it was a lie, and that Abeloth had killed Ming. Skywalker was able to resist Abeloth's influence, and despite a betrayal by his Sith allies, he was able to defeat her. Soon afterward, the Skywalkers and the Sith confronted Abeloth once again on the moon Pydyr, during which Abeloth once again used Ming's appearance after Luke Skywalker killed another of the entity's bodies—that of Akanah Norand Goss Pell, another former love of his. As Skywalker had already been injured in the engagement, he was unable to pursue the incarnation of Abeloth in Ming's body, which escaped."}, {"tag": "p", "text": "Abeloth next went to Nam Chorios, the very site where Ming and Skywalker had last seen one another. Abeloth quickly subverted the local Force-using Theran Listeners, just as she had done to the Fallanassi on Pydyr. She also summoned the Jedi Valin and Jysella Horn, using her mental influence over them. However, Abeloth was still pursued by the Skywalkers and the Sith apprentice Vestara Khai, as well as the Sith Tribe. Skywalker confronted Abeloth in a water processing facility, and Abeloth took Ming's form once more. Ming retained enough of her own individuality and influence over Abeloth to converse with Skywalker in that manner. She implored him to join with her and Abeloth, telling him that his influence could lead Abeloth toward the light side. She also revealed that it was her imprint upon Abeloth that led the entity to seek out Jedi, such as the two Horns. Skywalker agreed to temporarily link with her mentally and via the Force; after briefly reliving memories of the past, he sensed her love for him, as well as her pain and loneliness after being consumed by Abeloth. Skywalker then used a modified mnemotherapy technique he had learned from the Therans before they were subverted to pull all that remained of Ming's presence from Abeloth. The act freed the remnants of Ming's spirit from Abeloth, weakening the entity and setting the deceased Jedi free from Abeloth, allowing her to merge with the light side of the Force. Ming's spirit gave Skywalker one last look of gratitude before disappearing into the light side with a smile. Although Abeloth still escaped Nam Chorios, the Jedi ultimately succeeded in destroying the entity."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Ming was a witness of both the Jedi Order during the last years of the Galactic Republic and the survival of the Order's fragments after the Purge, and she was able to pass on valuable information regarding the old Jedi Order to the New Jedi Order in the form of knowledge, techniques, and abilities she had learned from Master Altis. Some of the children from Plett's refuge on Belsavis, which she had saved from destruction by her sacrifice on the Eye of Palpatine, became Imperial agents or trainees at Luke Skywalker's Praxeum. However, the final fates of Masters Plett and Djinn Altis remained unknown to New Republic historians as of the Yuuzhan Vong War."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Jedi under Djinn Altis, Masana believed, like her Master, that there was nothing wrong with attachment and relationships. Though she and her fiancé Geith Eris occasionally disagreed on matters, the love they shared was a source of joy for Masana, and she was adamant in stating that her relationship would not lead her to the dark side. Gilad Pellaeon found her sincere and sensible. Masana also felt that she needed to be more tolerant than the mainstream Jedi Order and refused to argue with Jedi Padawan Ahsoka Tano over philosophy, or even to tell Tano of the failings Masana saw in the orthodox tenets. One guiding principle of Masana's was not to interfere with others unless they were actively doing harm; this influenced her reasoning for not promoting a schism with the regular Jedi Order. Her Master, Djinn Altis, also later chided her for being too self-sacrificial."}, {"tag": "p", "text": "While in spirit form, Masana had a wry sense of humor and an easy-going nature. Even in seemingly hopeless circumstances, she could make jokes and do impressions of others, such as the band Pekkie Blu and the Starboys. She was pragmatic, determined, headstrong, and impulsive, deciding on a plan and carrying it out with little need or desire for consultation. She was also very dedicated to the Jedi way—albeit the unorthodox brand practiced by Djinn Altis—and was willing to sacrifice her life to save others of the Order, which she did on the Eye of Palpatine. She also had great commitment to causes she believed were right, keeping her spirit inside the battlemoon's computer for thirty years to prevent it from completing its mission. She could also be stubborn once her mind had been made up."}, {"tag": "p", "text": "Masana, owing to her upbringing on Chad, had an affinity for water and watery places. She was a follower of the orthodox Jedi beliefs in the light and dark sides of the Force, and once she realized that she could only touch the dark side of the Force, she decided that she would rather never use the Force again than use the dark side. Showing an independent streak, she left Skywalker forever in her own search to regain her connection to the Force, as she realized that she did not want to drag him down or have his power smother her efforts to regain her abilities. Undaunted by the trials she faced in her original body, in corporeal form, and in Cray's body, Ming remained true to the Jedi way, despite a lack of connection to the Force."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Masana knew a number of powers unfamiliar to most of the Jedi Order of the Old Republic. Jedi Master Djinn Altis was a maverick, allowing Jedi trainees to become romantically attached, and he taught techniques—such as the ability to preserve one's consciousness after death by transferring it to an inanimate object—which were lost to, or condemned by, the mainstream Jedi Order. Masana was skilled in the use of a lightsaber, and was able to wield the Jedi weapon in combat even without the aid of the Force. She also was capable of using mind influence to help ease the psychological pain of injured clone soldiers during the Clone Wars, which she did if given permission to do so. Masana was also able to use the Force to constrict blood flow in order to prevent bleeding; she used this technique on JanFathal to try and stem the bleeding from a ruptured femoral artery of an injured clone trooper. Working with other Jedi who had received similar training, Masana was able to use a form of psychometry to track a person's location after touching an object handled by the person. Out of all of Djinn Altis' Jedi, Masana was considered the best with computers and machines. She easily bypassed Separatist communications encryption and was able to successfully meld her mind with a computer temporarily in order to manipulate the weapons systems aboard a Republic warship. Masana later developed this skill to the point that she was able to transfer her consciousness to and from a machine at will."}, {"tag": "p", "text": "Masana was also a skilled gunner, as she operated emplacements on both the Eye of Palpatine and Nam Chorios to good effect. Even after losing her connection to the Force, she could still understand and explain training aids and techniques employed by earlier Jedi, although she longed to explore the Force for her own. In her previous life, she had been able to employ a number of Force powers, but once she assumed Cray Mingla's body, though she was still physically fit, she was unable to use the Force. When she did manage to tap into the Force on Dagobah and on the Knight Hammer, it was only in the form of the dark side; she was able to use that power to both employ a Force Whirlwind to hurl away predatory nightbats and guide her lightsaber to deflect blaster bolts."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Geith Eris"}, {"tag": "p", "text": "Despite the traditional Jedi ordinance against romantic relationships and marriage, Djinn Altis allowed his students to develop serious relationships. Masana had one such relationship with Geith Eris, a fellow trainee who was a skilled pilot. By the time of the Clone Wars, the two were engaged to be married. Both survived the Great Jedi Purge, but in 18 BBY the two entered the automated Eye of Palpatine dreadnaught and attempted to disable it. Masana wanted to access the gunnery room and disable it from within by causing the enclision grid to misfire, but Eris disagreed and left in a Skipray to seek help, despite Masana's protests. The dreadnaught's gunnery systems killed Eris, and Masana later shed her body to stop the war machine."}, {"tag": "h3", "text": "Luke Skywalker"}, {"tag": "p", "text": "In spirit form, Masana met Luke Skywalker when he was brought onto the dreadnaught thirty years after she transferred consciousness there. The two quickly grew attracted to each other, and another Jedi, Cray Mingla, gave up her body to stop the dreadnaught, allowing Masana to enter it. Skywalker and Ming's relationship deepened and grew more intimate, but was complicated when she discovered she could no longer touch the Force. They traveled together for some time in hopes of rekindling her connection. Despite Skywalker's best efforts—Masana, now going by the surname of Ming—realized that she would not be content unless she could touch the Force and that Skywalker's power was overshadowing and interfering with her progress. After learning she could only touch the dark side, Ming left Skywalker on her own journey to find the Force, although she readily admitted that she loved him. She stated at one point that she had hoped to return to him once she recovered her powers, but that opportunity never came to pass. In 13 ABY, a single look between them on Nam Chorios told both of them that their time together was over. After Abeloth killed Ming and took her appearance, she used her form to reach out to Luke Skywalker. While he discovered that Callista's appearance was an illusion created by Abeloth, Skywalker was shocked and pained that three decades after their last encounter, he still loved her. The relationship between the two ended with an aura of hope, as Skywalker was finally able to detach his past love from the being who had kept her captive for so long, causing Callista to show Skywalker her gratitude in her final glance before fading into the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Callista Ming was first created by Barbara Hambly for the 1995 novel Children of the Jedi as a love interest for Luke Skywalker. Hambly worked closely with Kevin J. Anderson in plotting what became known as the Callista trilogy—Children of the Jedi, Anderson's Darksaber, and Hambly's Planet of Twilight. In many ways, Ming's personality is similar to Skywalker's, except that for much of the series, she is frustrated by her inability to use the Force, making her a dramatic foil to Skywalker's command of the Force. Ming later appeared in various other reference materials discussing the events of the trilogy. According to Kevin J. Anderson, Ming was originally intended to be \"the great love of Luke Skywalker's life,\" as part of an assignment from Lucasfilm to author Barbara Hambly, who created Ming. However, by the time Anderson started writing Darksaber, fan reaction over the character Mara Jade from the Thrawn Trilogy had become such that Lucasfilm decided that Skywalker and Jade would ultimately end up together. As such, Anderson worked with Hambly to find a way to slowly write Ming out over the course of Darksaber, without killing off the character."}, {"tag": "p", "text": "Callista Ming's surname was not revealed until Murder in Slushtime, a short story by Hambly and set after Hambly and Anderson's trilogy. Her name is similar to that of the person whose body she occupied, Cray Mingla. The Complete Star Wars Encyclopedia refers to her as Callista \"Ming,\" with the surname in quotes. In 2008, she made a minor appearance in the novel Order 66: A Republic Commando Novel, wherein her original name was first identified as Callista Masana. The same author who wrote Order 66, Karen Traviss, later included Callista in another novel of hers, The Clone Wars: No Prisoners, which gave the character a larger role in a battle during the Clone Wars."}, {"tag": "p", "text": "Barbara Hambly derived the name \"Callista\" from Callisto, one of the four largest moons of Jupiter and also a character in Greek mythology. In creating the character, Hambly sought to create a \"spiritual partner for Luke.\" Hambly felt that Ming could relate with Luke Skywalker about the spiritual aspects of the Force and had a similar background. Ming's personality was designed to be \"basicly (sic) sweet-natured\" and seeking wisdom over power. Hambly also stated that she envisioned a young Uma Thurman or possibly Winona Ryder portraying Ming's character, stipulating that it would have to be somebody \"tough and sweet.\" In devising Ming, Hambly also sought to create a character that would present issues that \"the Force can't help you with.\" Hambly felt that including those elements that left Skywalker helpless to change would contribute to his growing process as a character. Hambly also stated that she hadn't kept up with future novels featuring Ming, and while she had offered to write another novel featuring Ming at one point, she was rejected by Lucasfilm."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}