{"url": "Calo_Nord%27s_datapad", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Datapads"], "nodes": [{"tag": "h1", "text": "Calo Nord's datapad"}, {"tag": "p", "text": "This was a datapad that belonged to the bounty hunter Calo Nord, who lived during the time of the Mandalorian Wars and the Jedi Civil War. The datapad contained a record of Nord's kills. In 3956 BBY, the final year of the Jedi Civil War, the reigning Dark Lord of the Sith Darth Malak ordered the planet of Taris destroyed in an attempt to kill the Jedi Knight Bastila Shan. Shan had crashed on Taris aboard an escape pod when the Sith fleet ambushed and boarded her warship, the Endar Spire."}, {"tag": "p", "text": "After the Republic captain Carth Onasi and the amnesiac former Sith Lord Revan found and rescued Bastila Shan, the Mandalorian Canderous Ordo approached them with an offer to steal the Ebon Hawk, the flagship of Ordo's employer, Exchange crime lord Davik Kang, but only if they broke in the Tarisian Sith base and acquired the Sith's launch codes. Shan, Onasi, and Revan obliged, and, with the assistance of Kang's droid T3-M4, managed to steal the codes. Ordo then took the group to Kang's estate."}, {"tag": "p", "text": "After they arrived, Revan, Ordo, Shan, and Onasi attempted to disable the hangar's security. There was a trophy room which displayed the mounted heads of animals such as rancors. When Revan searched one of the footlockers in the room, he found Calo Nord's datapad. After they were given codes for the Ebon Hawk by the ship's former pilot Hudrow, who was imprisoned and tortured after angering Kang, the group proceeded to unlock the hangar bay's security. Kang and Nord encountered them, and attempted to kill them. However, when the Sith began to bombard the planet, some debris managed to fall on Nord, enabling Shan, Revan, and their companions to kill Kang and escape Taris before the planet was completely devastated."}, {"tag": "p", "text": "Nord survived, and escaped Taris as well. He met with Darth Malak and informed them of Shan's escape through Carth Onasi's efforts. He also told Malak, along with the Sith Admiral Saul Karath, that Revan, who was Malak's former Sith Master, was still alive and operating as a Republic soldier. He took a contract from the Sith Empire, with Malak asking him to capture Shan alive, but to kill her other companions. Nord tracked down and confronted Revan, who had been retrained in the Jedi ways and tasked to find the Star Forge—the ancient Rakatan space station that was churning out the ships for the Sith's fleet. Revan and his companions killed the bounty hunter."}, {"tag": "h2", "text": "Known contents of Nord's datapad"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Calo Nord's datapad was an item featured in the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic. It is also the only datapad that can be sold for credits, as all other data pads were worth zero credits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}