{"url": "Caluan_Ematt", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Endor strike team personnel", "Category:Humans", "Category:Males", "Category:New Republic Defense Force personnel", "Category:Resistance admirals and generals", "Category:Resistance High Command members", "Category:Shrikes"], "nodes": [{"tag": "h1", "text": "Caluan Ematt"}, {"tag": "p", "text": "Caluan Ematt was a human male soldier who served as a lieutenant in the Alliance to Restore the Republic during the Galactic Civil War. He fought against the Galactic Empire, during which Ematt was given command of the Shrikes, a special recon unit that was tasked with identifying, securing and preparing new Rebel bases for the Alliance. He was a friend of Princess Leia Organa and would later go on to serve with her at a Resistance base as a major, and later general in the Resistance during the war against the First Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Leader of the Shrikes"}, {"tag": "p", "text": "Lieutenant Caluan Ematt was a soldier in the Alliance to Restore the Republic during its fight against the Galactic Empire in the Galactic Civil War serving as part of the Shrikes recon unit."}, {"tag": "h4", "text": "Scouting for the Alliance"}, {"tag": "p", "text": "Ematt was leading a six person team scouting for potential bases for the Rebel Alliance. They were on Taanab when they were ambushed by an Imperial Security Bureau force led by Alecia Beck. He managed to escape the ambush and sent a burst transmission to the Alliance High Command informing them of his plan to hide in the city of Motok on Cyrkon. He stowed away on a Kuat Yards hauler in a freight container. Once on Motok, he visited a cantina but left without talking to anyone. Ematt hid out in a hotel on the outskirts of Motok, but let Delia Leighton know he was looking for a way off-planet."}, {"tag": "p", "text": "Han Solo and his co-pilot Chewbacca were tasked by Leia Organa to meet Ematt and get him to safety before he could be captured and interrogated. She knew that Ematt held vast amounts of data on the Rebellion's plans, future bases, and supply caches and if the Empire could extract that from the soldier, it could mean the end of the war. The smugglers flew to Cyrkon and located Ematt. After receiving the pass-phrase, he let them into his room and prepared to depart. Before they could leave, the environmental alarms in the building went off, which was a signal that Solo had arranged with a local bum in case of trouble. Ematt suggested that they escape down the stairs, but they were locked due to the alarms."}, {"tag": "p", "text": "As Chewbacca tried to hotwire the door, a group of bounty hunters exited the elevators and opened fire on Ematt and the smugglers. The Wookiee forced the door open and the trio fled down the stairs to the V-40 landspeeder Solo had rented. The group made their way to the Millennium Falcon but before they could board they were ambushed by Beck and a group of Stormtroopers. Ematt boarded the Falcon after Solo and Chewbacca created a distraction with the aid of the Miss Fortune. The two ships then fled the planet but were intercepted by the Vehement who sent TIE fighters to attack the two ships."}, {"tag": "p", "text": "Ematt took control of the Falcon's quad laser cannons and proceeded to shoot down several fighters. He entered the coordinates for the rendezvous with the Rebel fleet into the Falcon's navicomputer but Solo refused to leave the damaged Miss Fortune alone against the Imperials. When the freighter was captured by a tractor beam from the Vehement, Ematt vowed that he would not be taken alive. Solo assured him that they would escape, and managed to elude the Star Destroyer by diving toward the planet's surface until the tractor beam lost contact."}, {"tag": "h4", "text": "Mission to the Graceful Promising"}, {"tag": "p", "text": "At some point after the Battle of Yavin, Ematt was requested by Han Solo to aid in a scavenging operation to the Graceful Promising, a derelict Vontorian treasure ship. The ship had been loaded with treasures by the famed pirate queen Maz Kanata and had since then been locked into close orbit around a dark star. Accompanied by several Alliance Pathfinders, Ematt worked in concert with Solo and Chewbacca which resulted in a successful mission. Among one of the many useful finds was a significant batch of Kiirium. Solo then decided to let the Alliance keep most of the money gained from the mission despite his debts to Jabba."}, {"tag": "h4", "text": "Zastiga"}, {"tag": "p", "text": "Shortly after the Battle of Hoth, Ematt accompanied Nien Nunb to the Remembrance so that they could pick Leia Organa up and take her to a secret meeting with the leadership of the Alliance to Restore the Republic on Zastiga."}, {"tag": "h4", "text": "Sullust"}, {"tag": "p", "text": "After the stalling of Operation Ringbreaker in 3 ABY, Ematt traveled to the planet Sullust to help the Sullustan Resistance during the Empire's siege on the Alliance's 61st Mobile Infantry, better known as Twilight Company, at the Inyusu Tor mineral processing facility."}, {"tag": "h4", "text": "Battle of Endor"}, {"tag": "p", "text": "Ematt was later part of the Endor strike team led by General Han Solo, and participated in the climatic Battle of Endor."}, {"tag": "h3", "text": "Joining the Resistance"}, {"tag": "p", "text": "Eventually the Alliance to Restore the Republic was able to defeat the Empire and formed the New Republic, with Ematt becoming a member. In 28 ABY, following the assassination of Senator Tai-Lin Garr, Ematt attended a secret meeting with several other New Republic soldiers, pilots, and officers where Leia announced the formation of the Resistance, a paramilitary organization dedicated to defending the New Republic from threats like the First Order."}, {"tag": "p", "text": "In the early days of the Resistance, Ematt served as an agent for Organa by continuing his service in the New Republic Defense Force whilst seeking potential converts for the Resistance. After the defection of too many New Republic pilots to go unnoticed, Ematt left his post in the Republic to fully join the Resistance."}, {"tag": "h4", "text": "Recruiting Poe Dameron"}, {"tag": "p", "text": "In 31 ABY, he escorted Organa to the Mirrin Prime Republic base to see the recruitment of Commander Poe Dameron, fresh from a skirmish with the First Order. Ematt intercepted the young pilot as he landed with two shore police, and brought him to Organa."}, {"tag": "h4", "text": "Battle of Crait"}, {"tag": "p", "text": "Following the Battle of Starkiller Base, Ematt was promoted from major to general. During the Battle of Crait, Ematt observed the All Terrain MegaCaliber Sixes en route to Crait outpost, and was situated near a trench while his men took positions."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Caluan Ematt was a human male with brown hair and eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Caluan Ematt first appeared in the simultaneous release of Smuggler's Run: A Han Solo & Chewbacca Adventure and Moving Target: A Princess Leia Adventure on Force Friday in 2015, identified only as \"Ematt.\" Later that September, Nestlé released Smuggler's Run, an animated adaptation of the novel, in which Ematt's first name is identified as \"Caluan.\" Jordan D. White, an editor for the Star Wars comics at Marvel who worked on the video, confirmed the spelling on Twitter. He was portrayed by Andrew Jack in Star Wars: Episode VII The Force Awakens and Star Wars: Episode VIII The Last Jedi."}, {"tag": "p", "text": "Ematt appears in concept art for the Resistance base in Star Wars: Episode IX The Rise of Skywalker, but is not in the movie itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}