{"url": "Calypso", "categories": ["Category:Legends articles", "Category:Music genres"], "nodes": [{"tag": "h1", "text": "Calypso"}, {"tag": "p", "text": "Calypso was a form of music commonly played by entertainers during the time of the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime prior to 0 BBY, Bothan pilot Captain Diskret Stahn traveled much of the galaxy, including the Abregado system. During this time, one particular tune got stuck in his head, much to his chagrin. Sometime later, his ship came under attack by pirates while he was transporting dancer Pei Yi to Naboo. His ship's engine was damaged in the attack, though he was able to land on Mustafar for repairs and supplies. Unfortunately for him and Pei Yi, they ended up stranded in the Mensix Mining Facility for a quite a long time."}, {"tag": "p", "text": "While stranded in the facility, Stahn encountered a spacer who was skilled in entertaining. He told the entertainer the story about the tune stuck in his head, as well as the drama that led him to land on Mustafar. After conversing with the entertainer, Stahn decided to teach the entertainer his tune, which was turned into a song called calypso. Following the event, calypso music was frequently played by musicians and other entertainers in cantinas and other locations across the galaxy. It could also be played by a wide variety of musical instruments."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Calypso music was first added to the 2003 MMORPG Star Wars Galaxies: An Empire Divided with its third and final expansion pack, Trials of Obi-Wan. In the game, players of the entertainer profession could learn the song from a non-player character named Diskret Stahn."}, {"tag": "p", "text": "The song bore a very strong resemblance to the theme song used in the 1990 LucasArts game, The Secret of Monkey Island. In the real-world, calypso is a style of Afro-Caribbean music."}, {"tag": "h2", "text": "Excerpt"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}