{"url": "Camelle_Barje", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Females", "Category:Humans", "Category:Moisture farmers", "Category:Nurses", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Camelle Barje"}, {"tag": "p", "text": "Camelle \"Camella\" Barje was a native of Corellia who moved with her husband Conil to Tatooine to begin a simple life as moisture farmers. The lives of her and her son were saved from Tusken warriors by their Jedi leader, Sharad Hett. By the time of the Galactic Civil War, Barje ran the motel in the town of Wayfar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Camelle was born on the planet Corellia. She married Conil and the pair lived in the Mid Rim. At some point, Camelle worked as a nurse. Camelle and Conil decided to settle on Tatooine to raise their newborn son, Tekil."}, {"tag": "p", "text": "Camelle and Conil sold everything to move to Tatooine, purchasing land from Zygian's Banking Concern. Arriving on Tatooine, Camelle and Conil established a moisture farm. Ever since arriving on the planet, Camelle and Conil heard rumors of Tusken Raider attacks, mainly from people at Tosche Station. Conil was determined to get some weapons to be on the safe side, so they traveled to the ancient trading site Mochot Steep. Conil told Camelle to stay with Tekil in the cart while he purchased some guns."}, {"tag": "p", "text": "During the visit to Mochot Steep, a Tusken Raider war-band led by Sharad Hett attacked the settlement. During the attack, Conil told Camelle to ride away and save Tekil. While trying to help another moisture farmer, Conil was killed by one of the Tuskens. Camelle tried to escape, but a Tusken killed the dewback pulling her cart."}, {"tag": "p", "text": "Sprawled on the ground, a Tusken took Tekil from her arms while another aimed a rifle at her head. Hett saw the commotion and saw the Tusken holding Tekil brandishing a knife. Igniting his lightsaber, Hett cut off the Tusken's hand. Camelle begged for her life, and Hett returned Tekil to her and blessed her leaving."}, {"tag": "p", "text": "By the time of the Galactic Civil War, Barje lived in Wayfar and ran the motel on the edge of town."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By the time of the Galactic Civil War, Barje was a fair shot with a blaster and still remembered some of her medical training."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Camelle Bargé was first mentioned in the 1995 West End Games supplement Galaxy Guide 1: A New Hope, Second Edition. In 1999, Star Wars 7 featured the character with the altered name of Camelle Barje. This spelling was continued in The Complete Star Wars Encyclopedia. This article assumes the spelling of \"Barje\" is correct over the original spelling of \"Bargé.\""}, {"tag": "p", "text": "In the one issue in which Barje appears, her name is also spelled \"Camella\"; this was established to be a nickname in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}