{"url": "Cameron_Monaghan", "categories": ["Category:Real-world articles", "Category:People stubs", "Category:Star Wars Jedi: Fallen Order voice actors"], "nodes": [{"tag": "h1", "text": "Cameron Monaghan"}, {"tag": "p", "text": "Cameron Riley Monaghan (born August 16, 1993) is an American actor, model and former child actor best known for his role as Ian Gallagher on the Showtime comedy drama series Shameless and his dual role as twins Jerome and Jeremiah Valeska on the Fox crime series Gotham."}, {"tag": "p", "text": "In Celebration Chicago 2019, Monaghan was announced to be playing Cal Kestis in the Star Wars video game Star Wars Jedi: Fallen Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Cameron Riley Monaghan was born on August 16, 1993 in Santa Monica, California."}, {"tag": "h3", "text": "Star Wars Jedi: Fallen Order"}, {"tag": "p", "text": "In 2018, Cameron Monaghan was cast in the lead role of Cal Kestis for Star Wars Jedi: Fallen Order, a Star Wars video game in development by Respawn Entertainment set for release on November 15, 2019. The role of Kestis attracted his attention because he liked the character's optimism in spite of all the difficulties has lived through and he hadn't worked a video game before. During the casting process of Fallen Order, Monaghan was at first unlikely to be cast on the role, as his audition clip was placed in a folder marked \"Other\" instead of the one marked \"Review First\". However, when Aaron Contreras saw his audition after all auditions from the \"Review First\" folder didn't convince him, he knew that Monaghan was right for the role."}, {"tag": "p", "text": "Upon getting the role, Cameron was restricted from telling anyone about the role. If his family or friends asked him, he would respond \"Yeah, you're not going to see me very often. I can't tell you why\". Playing Cal Kestis was an experience for Monaghan; it was his first time performing a role in motion capture and while he had seen videos from actors performing with such process, he believed at first to be voice work until fully coming to understand the concept. Cameron enjoyed working on the game as he felt that being able to explore to the limits of imagination in a digital placement was like being a kid playing on a big sandbox. Monaghan's casting was eventually confirmed during Celebration Chicago in 2019."}, {"tag": "h2", "text": "Personal life"}, {"tag": "p", "text": "As stated in StarWars.com, Monaghan has been a Star Wars fan since childhood. He grew up watching the Star Wars original trilogy on VHS, often replaying his favorite Darth Vader scenes. He recalled wielding a toy lightsaber for such a long period of time that it became bent and inoperable as well as going to see Star Wars: Episode I The Phantom Menace with his grandfather at age seven in 1999, an experience which was pleasant for both of them. Monaghan also recalled watching Star Wars: The Clone Wars during its initial airing and playing Star Wars video games."}, {"tag": "h2", "text": "Star Wars credits"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}