{"url": "Camo_scout_armor", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Creshaldyne Industries products", "Category:Medium armor"], "nodes": [{"tag": "h1", "text": "Camo scout armor"}, {"tag": "p", "text": "The camo scout armor, camo armor, camo suit, or camosuit was an armor designed by Creshaldyne Industries to protect the wearer from both injury and detection. Using miniature photoreactive fibers, the suit changed its color to blend into the background. Its hard plates provided protection against damage. Sparsely available throughout the galaxy since the time of the Clone Wars—sometimes through the illegal Gundark's Gear Datalog—the camo armor was used by scouts, bounty hunters and members of the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The camo armor, also known as camo scout armor, and as camo suit or camosuit, was a protective covering that prevented damage from being inflicted upon the user. To do so, several hard plates were woven into the fabric of a body glove armor through the use of a widespread armor technology."}, {"tag": "p", "text": "The camo armor was a light item, weighing no more than six kilograms. It was classified as a medium armor and intended to be used by scouts—thus the name \"scout armor.\""}, {"tag": "p", "text": "The camo armor based its marketing campaign on a technological advance of passive defense that increased the hiding or stealth abilities of the user. To do so, the camo armor had a network of miniature photoreactive fibers embedded within it. Those items allowed the armor to absorb surrounding light and change color, matching its present environment. While this tricked Human eyesight, the light- and color-sensitive fibers could not absorb and process every kind of light. The individual known as Vox noticed that it was less than useful against species with natural infrared vision or against lifeform scanners, including specifically-configured macrobinoculars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Developed by Creshaldyne Industries, the camo armor was commercially available, with a price of 6,000 credits, from the last days of the Galactic Republic onward, although frequently only in limited areas."}, {"tag": "p", "text": "During the Galactic Civil War, users of the camo armor included a number of bounty hunters, and sometimes members of Alliance Special Forces who wore camo armor for both protection and furtiveness. Homack, a member of the Alliance to Restore the Republic, kept one suit of camo armor in the survival kit of his X-wing starfighter and opined that snipers could profit from its use. Once, he was shot down and crash-landed on Atrivis. Thanks to his camo armor, Homack evaded enemy Storm commandos long enough to steal a starship."}, {"tag": "p", "text": "In the first days of the New Republic, the camo armor was available through Gundark's Gear Datalog, the illegal database of the arms smuggler Gundark. Homack posted a message there about the advantages of the camo armor and his own experiences with it; he was answered by Vox, who listed the perceived disadvantages of the item."}, {"tag": "p", "text": "Circa 10 ABY, members of the Karazak Slavers Cooperative used camo armor and mounts to patrol the perimeter of their camp on Gabredor III. An enemy mercenary unit, the Red Moons, detected these riders using macrobinoculars, and one of the camo-using slavers was defeated by mercenaries Lex Kempo and Sully Tigereye."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Camo scout armor was first mentioned in the sourcebook Galaxy Guide 10: Bounty Hunters (1994), written by Rick D. Stuart for West End Games' Star Wars: The Roleplaying Game. Its stats were repeated, along with new information and the first illustration depicting the item (by an uncredited artist), in Gundark's Fantastic Technology: Personal Gear (1997), written for the same game. Both sources list the camo as a light armor, more effective against physical damage than against energy, and available for 1,500."}, {"tag": "p", "text": "Arms & Equipment Guide (2002), written for Wizards of the Coast's Star Wars Roleplaying Game, and The Clone Wars Campaign Guide (2009), written for Wizards' Saga Edition Roleplaying Game, both classify the same item as a medium armor, more difficult to use, equally effective against all kinds of damage, and valued in 6,000. The Clone Wars Campaign Guide also considers this item to be particularly hard to obtain. When in conflict, this article gives precedence to the more recent source."}, {"tag": "p", "text": "Arms & Equipment Guide also included a new illustration of the camo armor by Chris Trevas; however, this depiction was quite different than the one in Fantastic Technology, being instead similar to a light scout armor seen in the book Rules of Engagement: The Rebel SpecForce Handbook (1997)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}