{"url": "Camp_Four/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Naboo locations", "Category:Prisons", "Category:Trade Federation military bases"], "nodes": [{"tag": "h1", "text": "Camp Four"}, {"tag": "p", "text": "Camp Four was a prisoner-of-war camp established on Naboo by the Trade Federation during the Invasion of Naboo in 32 BBY. Mainly used to hold political prisoners, it also held a number of Naboo pilots. The camp was later liberated by members of Bravo Flight."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Trade Federation's Camp Four was situated in a valley on Naboo, and a river ran in front. The camp was guarded by a laser fence, which was deactivated when a convoy of prisoners arrived from the nearby hangar. The prisoner barracks were divided into four separate locations, sequestered in the hills. The barracks were surrounded by further laser fences and laser cannons and powered by nearby generators. A Federation airbase was established nearby to act as a decoy for the camp."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Trade Federation invaded the planet in 32 BBY, their forces quickly secured the planetary leadership in Theed. Queen Amidala and her entourage were to be processed at Camp Four until the arrival of two Jedi Knights, Qui-Gon Jinn and Obi-Wan Kenobi. Their intervention gave the Queen the chance to escape. Baras Perosei was captured and imprisoned in the camp."}, {"tag": "p", "text": "The Royal Naboo Security Forces became guerrilla fighters against the Trade Federation Droid Army, and a group led by Lieutenant Gavyn Sykes attacked the camp looking for allies. Sykes led a quartet of pilots into the valley under cover of darkness. One of the pilots, Lutin Hollis had family in the camp and broke formation, alerting the Federation forces to his presence. Droid starfighters launched from the airbase to engage the pilots, but the Naboo fighters shot them down. Sykes landed in the hangar and stole a speeder, and infiltrated the camp using empty transports as a decoy."}, {"tag": "p", "text": "Sykes broke through the laser fence and systematically freed the prisoners, who took nearby speeders to escape. A group of Armored Assault Tanks ambushed Sykes, but were destroyed in a strafing run by his wingmates. Sykes then freed the remaining prisoners and led them out of the camp."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Camp Four received a passing mention in the first movie of the Prequel trilogy in 1999. Its location was expanded upon in the 2000 video game Star Wars: Episode I: Battle for Naboo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}