{"url": "Camp_Kaxol", "categories": ["Category:Legends articles", "Category:Imperial military bases", "Category:Krant locations"], "nodes": [{"tag": "h1", "text": "Camp Kaxol"}, {"tag": "p", "text": "Camp Kaxol was an Imperial military camp situated on the planet Krant and constructed after the Battle of Yavin in 0 ABY. During the Battle of Krant between the Imperials and the Rebels, its forces threatened the Krantian cities of Peche and Theenes."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Camp Kaxol was an Imperial military camp established on the planet Krant between 0.5 and 2 years after the Battle of Yavin. It was located northeast of the city of Theenes. Camp Kaxol was protected by a set of walls and two laser turrets, while four power cores kept the base operational. The base's buildings included a Command Center, three troop centers, a mech factory, and eight prefab shelters along with a War Center and a spaceport. A group of ASP-7 labor droids were at its disposal for gathering resources."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Rebel Alliance emissary Leia Organa crashed on the planet, a squad of Camp Sagol's stormtroopers attacked a small Krantian village, although they were cut down by Organa's escorts and the exiled Jedi Echuu Shen-Jon. Camp Kaxol, along with another Imperial camp, Sagol, then commenced their attacks on the Krantian cities of Peche and Theenes, targeting the bridges which connected the cities to each other. The two military camps sent a group of stormtroopers and dewback troopers. Organa took control of the small village and raised an army to defeat Kaxol and Sagol, destroying their ability to make war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Camp Kaxol first appeared in the 2001 video game Star Wars: Galactic Battlegrounds. One of the two camps must be destroyed by the player's army, forcing the other camp to withdraw. It has not been canonically established which was destroyed, as the player can complete the level by attacking and eliminating either one or the other. As the choice is a matter of game mechanics, this article is neutral to that choice. Only one of the camps has to be destroyed to finish the mission, although the game's strategy guide, released before the game itself, suggests the player target Kaxol, the closer camp to the cities."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}