{"url": "Camp_Three_(Serroco)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Galactic Republic military bases"], "nodes": [{"tag": "h1", "text": "Camp Three  (Serroco)"}, {"tag": "p", "text": "Camp Three was a Republic Navy military camp that was established on the planet Serroco when the Mandalorian warrior clans threatened the world in 3963 BBY, during the Mandalorian Wars between the Republic and the Mandalorian Neo-Crusaders. Placed near one of Serroco's Stereb cities by the order of Republic Admiral Saul Karath, Camp Three was host to the Little Bivoli mess ship, which quickly became extremely popular among the servicemen stationed at the settlement."}, {"tag": "p", "text": "When the Mandalorians arrived at Serroco, they unleashed a barrage of nuclear bombs that annihilated the Republic camps, including Camp Three, out of contempt for what chief Mandalore the Ultimate saw as an honorless defense. Not everyone stationed at Camp Three was killed, however—Little Bivoli proprietor Marn Hierogryph and his cook, Slyssk, stole a Republic troop transport and escaped in the nick of time, saving many Republic soldiers in the process."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Camp Three was one of the Republic Navy's military camps on the muddy and rainy planet Serroco during the Mandalorian Wars. As per Republic Navy strategy, the camp was located on the edge of one of Serroco's Stereb cities, large settlements of stone towers and pyramids constructed by the native Stereb species. The camp comprised a number of ships, both Republic and fringer, that served as barracks, restaurants, and other establishments for Republic soldiers. These ships included numerous Hammerhead-class cruisers, troop transports that housed naval personnel, and the Little Bivoli, a fringer mess ship that became extremely popular amongst the men of Camp Three."}, {"tag": "p", "text": "Featuring the talented Trandoshan cook Slyssk, the Little Bivoli was actually run by two of the Republic's most wanted fugitives—Zayne Carrick, a former Jedi Padawan wanted for his involvement in the Padawan Massacre of Taris, and the Snivvian Marn Hierogryph, his \"accomplice.\" Situated as the compound was on the \"mudhole\" Serroco, Republic personnel had trouble staying dry at Camp Three. Other than the soldiers, Serroco's native Stereb also wandered the camp, eating scraps. Air traffic to and from Camp Three was directed by a manned control tower, and surrounding loudspeakers alerted Republic servicemen to enemy forces in the system. In case of an attack, Camp Three, like the other camps on Serroco, was equipped with a missile defense system, but it was not kept online when no assault was expected."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3963 BBY, the Mandalorian warrior clans, in the midst of their campaign against the Galactic Republic, threatened the Expansion Region world of Serroco, a full member of the Republic. Anticipating a Mandalorian attack, Republic Navy Admiral Saul Karath organized a battle group and set off to defend Serroco. Karath's strategy involved placing his camps close to the Stereb cities, believing that the Mandalorians would avoid attacking them directly out of fear of wrecking valuable loot."}, {"tag": "p", "text": "According to this edict, Camp Three was built on the edge of one of the Stereb cities, with spacelift jockeys like hotshot pilot Carth Onasi landing many of the ships that comprised the settlement. Karath personally gave Camp Three a walking tour when the place was settled. The Little Bivoli eatery rapidly became one of Camp Three's go-to spots, earning proprietor Marn Hierogryph a great amount of money—his partner, wanted Republic fugitive Zayne Carrick, still chafed, wanting the chance to clear his name. With the Mandalorians approaching, Carrick, who already had been trying to convince Hierogryph to raise shop, had a Force vision of the Mandalorians destroying Serroco."}, {"tag": "p", "text": "Perturbed, Carrick decided that he needed to warn Karath, and he stowed away on Onasi's ship from Camp Three to Karath's flagship, the Courageous. Carrick made it to the ship's bridge but was recognized and detained—soon afterward, Mandalorian forces arrived in the system, setting off the proximity alarms at Camp Three. The Mandalorians started off the proceedings by firing a barrage of nuclear missiles, and Carrick could only watch as his vision came true. Initially appearing to be headed for Karath's ships, the missiles angled around the Republic fleet, aimed at the camps all along, Mandalore the Ultimate's way of punishing the Republic for what he saw as an honorless defense. The missile defense system at Camp Three was not operational at the time, and the camp was obliterated."}, {"tag": "p", "text": "Despite the destruction of the camp, some were able to escape. Hierogryph and Slyssk from the Little Bivoli were able to charge aboard and steal a troop transport and get off Serroco in the nick of time, inadvertently saving half a sleeping battalion in the process. For this act, they were honored as Republic heroes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Camp Three first appeared in Star Wars: Knights of the Old Republic: Days of Fear, a story arc from the Star Wars: Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2007. Camp Three would also appear in a flashback in a later issue from the series, Knights of the Old Republic 47. During its appearances, Camp Three was illustrated by Brian Ching and Dustin Weaver."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}