{"url": "Candace_Payne", "categories": ["Category:Real-world articles", "Category:Notable fans"], "nodes": [{"tag": "h1", "text": "Candace Payne"}, {"tag": "p", "text": "Candace Payne is a Star Wars fan who gained online viral fame as Chewbacca Mom. Her video, showing her wearing a talking Chewbacca mask and joyfully laughing as it spoke when she moved her mouth, was posted on May 19, 2016 to Payne's Facebook page and has since been viewed over 140 million times."}, {"tag": "h2", "text": "\"Chewbacca Mom\" video"}, {"tag": "p", "text": "On May 19, 2016, Candace Payne posted a video on her Facebook page after purchasing a Chewbacca mask at a Kohl's retail store. The video depicts Payne showing viewers the mask, which growls and speaks like Chewbacca when the wearer moves their mouth. As Payne does so, she begins to laugh hysterically over the sounds the mask makes. Payne, a stay-at-home mom, posted the video a few minutes before picking up her children from school because she wanted to show her Facebook friends that the mask was hers—knowing full well that her children would likely want to claim it as their own. After posting the video, Payne was surprised to see that the video had racked up 1,000 views. By the end of the day on May 19, the video had been viewed over one million times. As of May 24, only five days after the video was posted, the video has over 140 million views."}, {"tag": "p", "text": "On May 23, Payne was a guest on The Late Late Show with James Corden. They filmed a sketch in which Payne was driving host James Corden to work while wearing the Chewbacca mask. They were joined by J.J. Abrams, the director of Star Wars: The Force Awakens. Corden also read Payne a note from Peter Mayhew, who plays Chewbacca in the Star Wars films, calling her an inspiration and inviting her to a private meet-and-greet at Dallas Fan Expo."}, {"tag": "p", "text": "On May 25, Payne appeared on the third episode of The Star Wars Show in an interview with the show's co-host, Andi Gutierrez, to discuss her Star Wars fandom, her \"Chewbacca Mom\" video, and her tour of the Lucasfilm headquarters in San Francisco, California."}, {"tag": "p", "text": "Her phenomenon was parodied in the 2018 Disney animated film Ralph Breaks the Internet, the sequel to 2012's Wreck-It-Ralph. In the film, before Ralph and Vanellope meet her and while determining which videos must be on BuzzzTube, Yesss and her assistant Maybe see a video entitled \"Chewbacca Dad\"."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}