{"url": "AA-589", "categories": ["Category:Legends articles", "Category:New Jedi Order starships", "Category:New Republic starships", "Category:T-65B X-wing starfighters"], "nodes": [{"tag": "h1", "text": "AA-589"}, {"tag": "p", "text": "AA-589 was the designation for a T-65 X-wing starfighter piloted by Luke Skywalker."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Luke Skywalker had been an X-wing pilot since he joined the Rebel Alliance and served at the Battle of Yavin as Red Five. He had flown no less than five such fighters over the course of his career with the Rebellion and New Republic, culminating in his use of one designated AA-589."}, {"tag": "p", "text": "The New Republic allowed Luke Skywalker to retain the use of X-wing AA-589 after he resigned his commission as a commander in the New Republic Defense Fleet in 5 ABY. Either through his relationship with Leia Organa Solo or the New Republic's desire to maintain good relations with the last of the Jedi, Skywalker was able to avail himself of New Republic repair and maintenance resources."}, {"tag": "p", "text": "By 9 ABY, R2-D2 had developed a close working relationship with this ship's flight computer due to Skywalker's refusal to let technicians perform any type of memory wipe on his astromech droid or his starfighter, despite the standard operating procedure of the New Republic Defense Fleet calling for this to be done every few months. The starfighter's computer systems molded them to R2's unique personality, and this allowed them to function at computational speeds rivaling dedicated counterpart encryption computers—but it also prevented any attempts by technicians to run diagnostics on the fighter without R2's assistance."}, {"tag": "h3", "text": "Thrawn campaign"}, {"tag": "p", "text": "Skywalker used this X-wing extensively during the Thrawn campaign. He used the ship to travel to Dagobah, where he managed to land his ship far more gracefully than on his first visit, and then to Nkllon, where he participated in a battle against TIE/LN starfighters launched by the Judicator as part of a scheme by Grand Admiral Mitth'raw'nuruodo to obtain mole miners from Nomad City. From there, Skywalker used the X-wing to travel to Jomark to answer the call of Joruus C'baoth, which he had received through the Force during the battle."}, {"tag": "p", "text": "Nearly twenty light-years short of Jomark, the fighter was ambushed by the Imperial II-class Star Destroyer Chimaera and an Immobilizer 418 cruiser. Skywalker was able to use the fighter's proton torpedoes to disrupt and destroy one of the Star Destroyer's tractor beam projectors. Though the fighter escaped to hyperspace, it was severely damaged and its travel vector had been provided to local freelancers along with a bounty offer of 30,000 credits."}, {"tag": "p", "text": "AA-589's hyperdrive disengaged in the middle of empty space. Artoo's moaning predicted the outcome of the computer's diagnostics: the hyperdrive was severely damaged, and the resulting power surge had destroyed the fighter's subspace transmitter. Though Skywalker and R2-D2 were unharmed, it would take some delicate work in zero-gravity to repair AA-589's damaged systems enough to get the Jedi and his faithful droid to safety."}, {"tag": "p", "text": "Skywalker and R2-D2 brainstormed a solution to their dilemma. Had the starfighter been carrying any other pilot, it would have been doomed to drift in space forever. But Skywalker was both a Jedi and a skilled mechanic, and his droid counterpart had the benefit of forty years of working experience. Luke's first instinct was to try to cobble a single working hyperdrive motivator from the remains of the port and starboard units, but after putting in several hours of work to access the port motivator he was dismayed to find that its shield casing was riddled with cracks. Knowing a hyperdrive without an intact superconducting shield was useless, and having no way to seal the shield casings in deep space, he chose to examine the starboard motivator from a distance before digging through AA-589's systems even deeper. He found that the starboard unit was equally useless, and formulated a new plan."}, {"tag": "p", "text": "Further discussion with R2-D2 led Skywalker to try to restore some degree of subspace communication functionality. The droid determined that the eight kilometers of superconducting wire in AA-589's sensor jammer could be repurposed for use as a low-efficiency antenna. After several more hours of work, Luke had the jammer and the subspace components placed in an arrangement where R2-D2 could do the more tedious work while Skywalker rested in a hibernation trance to conserve the starfighter's limited life support."}, {"tag": "p", "text": "R2-D2 never got to finish the job, as the Wild Karrde located AA-589, apparently by chance. Unknown to Skywalker at the time, Mara Jade had located him with the Force, rendering his and Artoo's repair efforts largely pointless. From a cold start, it would have taken fifteen minutes to become combat-ready, but fortunately the freighter had no overtly hostile intentions."}, {"tag": "p", "text": "After taking Skywalker and R2-D2 aboard the Wild Karrde using a force cylinder, Talon Karrde took AA-589 in tow and transported it to Myrkr."}, {"tag": "p", "text": "The fighter would eventually be repaired at Sluis Van after the battle there. Skywalker would eventually use the X-wing to reach Jomark where he met Joruus C'baoth. After Mara Jade's arrival, the X-wing—with R2-D2 controlling it—would incapacitate the Jedi Master and allow Skywalker to escape his grasp."}, {"tag": "h3", "text": "Almania Crisis"}, {"tag": "p", "text": "During the Almania Crisis, AA-589 would wind up spending an extraordinary amount of time in a repair bay. Unknown to Skywalker, Wedge Antilles had ordered all X-wings upgraded to a new astromech-less standard whenever they entered a repair facility. Upon landing on Coruscant, AA-589 was stripped down to the chassis before either Skywalker or R2-D2 could stop the process. Skywalker eventually left Coruscant in one of the new-model X-wings while AA-589 was rebuilt as the older model with astromechs once again."}, {"tag": "h3", "text": "The Hand of Thrawn"}, {"tag": "p", "text": "Skywalker was still flying AA-589 at the start of the Caamas Document Crisis in 19 ABY. It would later become stranded on Nirauan where it was carried off by several Qom Qae."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}