{"url": "Candra_Tymon", "categories": ["Category:Legends articles", "Category:Females", "Category:Guards", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Candra Tymon"}, {"tag": "p", "text": "Candra Tymon was a female Human who served as Chief of Security for Adan Dooku during the Imperial era. Her father was Dooku's previous head of security and she took her duties very seriously."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Candra's father was Chief of Security of Adan Dooku before her. Dooku appointed her as her father's successor, despite the fact that many on Serenno, including her father, doubted a woman could lead a security team."}, {"tag": "p", "text": "During a private meeting between Dooku and Bail Organa in the Aldera Royal Palace, she stepped out on a balcony. She noticed the flash from a sniper's scope and attempted to throw herself in front of the shot. Unfortunately, Tymon was too slow and was unable to prevent the assassination of Dooku. She gave pursuit to the assassin and was able to get off a couple of shots at him. Due to the assassin's Mandalorian armor, she was unable to take him down and watched him escape as she dangled from a broken ladder that the assassin had shot out from underneath her."}, {"tag": "p", "text": "Tymon then oversaw the security at the Great Assembly House on Serenno as the Six lords of the major houses tried to choose a new regent to become the new Count Dooku. Later, she oversaw security and the protection Bron Dooku onboard the Windrunner. She defended the young Count and the other lords when they came under attack from Aveca Dunn, Captain Ramchak and his pirate crew of the Bloodskull. Though she was able to make them surrender, Bron was kidnapped by Dunn. She remained onboard and directed the repairs on the Windrunner."}, {"tag": "p", "text": "Tymon contacted Imperial Envoy Jahan Cross for help in rescuing the young count. Tymon told Cross that Dunn was taken to the Spike and that she was going interrogate her once she woke up. She went to the Spike to meet with warden Gundren about speaking with Dunn. While speaking with him, the power went down. Tymon grabbed a blaster and went down to check on Dunn. When she saw Dunn in a guard uniform, she was knocked out by Cross, also in a guards uniform. She was then left by Dunn and Cross to be taken to a med center."}, {"tag": "p", "text": "Tymon later met up with Cross at a cantina near the Serenno Spaceport. When Cross told Tymon about how he freed Vex, she attacked Cross, wanting to kill him. She continued to fight him even when Cross told her that it was Duke Rodas Borgin who hired Vex. It was only after that she realized that she had to protect Bron. She piloted the bongo that carried her and Cross to Otoh Dooku to pick up the boy. Tymon infiltrated the underwater base with Cross and went with him to the room where Bron was being held. After Cross disabled the MK 8001 Attendant Droid that was guarding Bron, Tymon fitted her and Bron with rebreathers and swam to the bongo as Cross drew off security by fleeing in a Manta droid subfighter. On the submersible, she was told by Bron that he didn't want anyone to die for him. The security officer explained to Bron that people dying were serving their duty to the Count and he should accept and honor their sacrafice. The bongo was detected and was attacked by Hovus Jorrick and two other security guards in Mantas. She was able to evade their attacks long enough for Cross to return and drive off the attackers."}, {"tag": "p", "text": "However when they go to the Serenno Spaceport, Tymon, Cross and Count Dooku were confronted by the bounty hunter Boba Fett. She protected the young Count from Fett, Hovus Jorrick and his security force. Before Tymon left Cross to get the Count to safety, she kissed Cross. She then stole Jorrick's speeder and made her to a ship. However, unbeknownst to her, Tymon's shuttle was wired to blow by Cross, making Jorrick, Lord Borgin, and Fett believe the young Count was dead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}