{"url": "Canonhaus", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Death Squadron personnel", "Category:Galactic Republic individuals", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Canonhaus"}, {"tag": "p", "text": "Canonhaus was a human male who served as a midshipman aboard a ship for the Galactic Republic. He eventually came to serve the navy of the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic with the military rank of captain."}, {"tag": "p", "text": "During the reign of the Empire, Canonhaus served as a lieutenant and participated in an insurrection on Haruun Kal. Sometime later he led an attack on an Alderaanian refugee convoy, where he purposely filed the wrong things for his report to test the Empire if they actually cared about their problems. By 3 ABY, the Imperial officer served in Death Squadron, the personal armada of Dark Lord of the Sith Darth Vader, and was involved in the hunt for the Millennium Falcon after the Battle of Hoth, serving aboard the Ultimatum."}, {"tag": "p", "text": "During the chase, Death Squadron was forced to move into the Hoth asteroid belt, causing significant damage to the fleet. Eventually, Canonhaus and several other officers of the fleet reported via holograms to Darth Vader, only to be killed during the meeting when an asteroid obliterated the bridge of the Star Destroyer he was in."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The officer debuted through hologram in the Star Wars saga film Star Wars: Episode V The Empire Strikes Back, albeit unidentified. In the film, this officer is portrayed by Stephen Buchanan. In the 2020 short story collection From a Certain Point of View: The Empire Strikes Back, the two installments \"The Final Order,\" written by Seth Dickinson, and \"Lord Vader Will See You Now,\" written by John Jackson Miller, identified the officer as Canonhaus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}