{"url": "Canto_Bight", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Canon articles", "Category:Articles in need of updating", "Category:Cantonica locations", "Category:Capital cities"], "nodes": [{"tag": "h1", "text": "Canto Bight"}, {"tag": "p", "text": "Canto Bight was a coastal city on the desert planet Cantonica. The city was a destination for wealthy individuals, and it was filled with casinos and racetracks. During the war between the Resistance and the First Order, Resistance members Finn and Rose Tico traveled to Canto Bight."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Canto Bight was the capital city on the planet Cantonica that lay on the shores of the Sea of Cantonica, the largest artificial ocean in the galaxy. Canto Bight was a destination for wealthy tourists, gamblers, and war profiteers, who visited its lavish casinos and racetracks. Child workers rode quadruped creatures called fathiers in the city's racetracks. The Canto Bight Police Department were the law enforcement of the city."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Canto Bight was a tourist and gambling destination on the Outer Rim world of Cantonica, which was part of a corporate fiefdom known as the Corporate Sector."}, {"tag": "p", "text": "At some point, the smuggler Lando Calrissian played a card game in Canto Bight with a gambler named Brushaun. Brushaun lost two thousand credits when Lando won the game."}, {"tag": "p", "text": "At the time of the Galactic Civil War, Canto Bight was already being referred to as the most luxurious casino around by certain individuals. Ronen Tagge had a penthouse in Canto Bight where he would hold parties.\nDuring the First Order/Resistance War, the Resistance operatives Finn, Rose Tico, and BB-8 traveled to Canto Bight as part of a mission to recruit the Master Codebreaker in order to disable the First Order's hyperspace tracker. Finn and Rose parked their ship on a public beach, leading the Abednedo businessman Slowen Lo to alert the Canto Bight Police Department."}, {"tag": "p", "text": "They tried to make contact with the Master Codebreaker but were instead arrested by Canto Bight police officers for a traffic violation. While being detained at the Canto Bight police headquarters, the two met the slicer DJ, who offered to help them disable the hyperspace tracker in return for their freedom. BB-8 also tied up the guards, allowing Finn, Rose, and DJ to escape the prison. While fleeing through the racetrack, Rose convinced the child worker Temiri Blagg to help them escape in return for giving him her Resistance ring. Blagg released a herd of fathiers, which stampeded through the streets of Canto Bight. The stampede cause the town's businesses significant damage."}, {"tag": "p", "text": "Finn and Rose escaped on a back of a fathier to Canto Bight's outskirts where they were picked up by DJ and BB-8, who had stolen the luxury yacht Libertine. The group then traveled to the First Order Mega-class Star Dreadnought Supremacy in an attempt to disable the hyperspace tracker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Canto Bight was created for Star Wars: Episode VIII The Last Jedi, and it was described by director Rian Johnson as \"a Star Wars Monte Carlo–type environment, a little James Bond–ish, a little To Catch a Thief.\""}, {"tag": "p", "text": "The city and its casino design and look were heavily inspired by the city of Dubrovnik in Croatia. Parts of Star Wars: The Last Jedi (Canto Bight scenes) were filmed in Dubrovnik in March 2016. Canto Bight chase scenes with Finn and Rose are filmed on the city main street Stradun."}, {"tag": "p", "text": "During the late design process of The Last Jedi, Lucasfilm Ltd. president Kathleen Kennedy said that Canto Bight's design didn't feel enough \"Star Wars\" to her, reason for which the creative team scrapped many of their original ideas for Canto Bight and ultimately drew inspiration from early drawings by Ralph McQuarrie for Jabba the Hutt's palace during the development of Star Wars: Episode VI Return of the Jedi in the 1980s."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}