{"url": "Cantonica", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cantonica locations", "Category:Corporate Sector planets", "Category:Desert planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Cantonica"}, {"tag": "p", "text": "Cantonica was a desert planet in the Cantonica system within the Corporate Sector of the galaxy's Outer Rim Territories. The planet was home to the casino city Canto Bight, which was a destination for wealthy tourists, gamblers, and war profiteers. During the First Order/Resistance War in 34 ABY, the Resistance operatives Finn, Rose Tico, and BB-8 traveled to Cantonica on a mission to recruit the Master Codebreaker to disable the First Order's hyperspace tracker."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Cantonica was a desert planet in the Cantonica system within the Corporate Sector of the galaxy's Outer Rim Territories that was home to the casino city Canto Bight. A pink, blue, and green nebula was visible from the surface of the planet. The city was located on the shores of the Sea of Cantonica, an artificial ocean considered the largest in the galaxy that manifested a strange phenomenon of a dark-purple glow on the horizon during sunset. Water evaporated at a rate of several tons per day in the desert climate, making the cost of maintaining the artificial sea astronomical. Further, its creation caused the lower levels of Canto Bight to become damp and dank, with occasional moisture seepage. Sump pumps were utilized full-time nearer the coast in order to keep the water at bay."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Cantonica was part of the Corporate Sector, a fiefdom where corporate entities were given free reign to govern their own territory. It was once a quiet, dusty world dotted with ancient cities and ruins from a civilization that few remembered. The deserts became a place for criminals to lie low or ply side hustles, and contained smugglers' hideouts and quiet crooks' bars. Eventually, the casino city of Canto Bight was built, transforming the planet into a playground for the wealthy, and the artificial Sea of Cantonica seemingly appeared out of nowhere."}, {"tag": "p", "text": "By the outbreak of the First Order/Resistance War in 34 ABY, Canto Bight had become a haven for wealthy tourists, gamblers, and war profiteers who sold weapons to both the First Order and the Resistance. The Resistance operatives Finn and Rose Tico visited Canto Bight in an attempt to recruit the Master Codebreaker in order to disable the First Order's hyperspace tracker."}, {"tag": "p", "text": "However, Finn and Rose were arrested by the Canto Bight Police Department for a traffic violation. While in prison, they managed to convince the slicer DJ to help them in return for his freedom. The prisoners escaped the cell with the help of BB-8, who tied up the guards. They then managed to flee Canto Bight with the help of the stable hand Temiri Blagg, who released a herd of fathiers. Finn, Rose, BB-8 and DJ then escaped aboard the stolen yacht Libertine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}