{"url": "Cantompa", "categories": ["Category:Canon articles", "Category:Humans", "Category:Imperial Navy personnel of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Cantompa"}, {"tag": "p", "text": "Cantompa was a human male fleet trooper within the Galactic Empire's navy during the Galactic Civil War, serving on board the Imperial II-class Star Destroyer Herald. While on board the Star Destroyer in 3 ABY, he earned the trust of Captain Tabor Seitaron, who was tasked with hunting down the Imperial traitor Everi Chalis. When Chalis allowed herself to be captured by the Herald above the planet Sullust, Seitaron chose Cantompa and his colleague Zhios to accompany him and Prelate Verge to meet with her and take her prisoner."}, {"tag": "p", "text": "During the confrontation with Chalis, the traitor triggered twenty ion bombs hidden onboard the shuttle she had arrived in, causing a power surge in the Herald. Seitaron ordered Cantompa and Zhios to rush to the bridge and order a retreat, but Verge interjected soon after, wishing for the Star Destroyer to fire Rebel Alliance forces on Sullust. Cantompa and Zhios froze, unsure of what to do, but after Seitaron then accidentally killed Verge, he repeated his original order for the troopers, which the pair rushed to do."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Voyage to Sullust"}, {"tag": "p", "text": "Cantompa was a human male who served as a fleet trooper in the Navy of the Galactic Empire during the Galactic Civil War against the Rebel Alliance. In 3 ABY, he served onboard the Imperial II-class Star Destroyer Herald, serving under Imperial Prelate Verge and Captain Tabor Seitaron, who had been tasked with tracking down the Imperial traitor Everi Chalis. During the hunt for Chalis, Tabor came to appreciate Cantompa and his colleague Zhios as they attended to the captain when he took sick from a change in his diet, stood for hours on end on guard duty outside the Star Destroyer's tactical center, and witnessed their comrades be tormented by Verge."}, {"tag": "p", "text": "When the Herald finally caught up with Chalis she and the Alliance's 61st Mobile Infantry were on the planet Sullust, having captured the Inyusu Tor mineral processing facility from the Empire's assets there. During the Empire's attempt to recapture the Inyusu Tor facility, Chalis stole a shuttle and allowed herself to be captured by the Herald. Seitaron chose Cantompa and Zhios to accompany him and Verge to the hangar where the traitor's shuttle was being landed, believing that the pair deserved any honor that could be received in the capture of Chalis."}, {"tag": "h3", "text": "Confrontation in the hangar"}, {"tag": "p", "text": "Cantompa and Zhios scoped out the hangar after her arrival, and after one gave the all clear, the prelate and the captain proceeded to enter while the troopers kept their blaster rifles aimed at the shuttle's open entry point. Chalis emerged un-armed with her hands raised in surrender, greeting Verge and Seitaron, the latter of whom she had met while serving the Empire. She mocked the prelate but then offered to divulge all she had learned about the Alliance while traveling with them in exchange for a pardon. All eyes in the room then turned to see how the angry prelate would react, and Verge stepped forward and threw Chalis to ground and rejected her offer. In response, Chalis detonated around twenty ion bombs she had stored aboard the shuttle she arrived in."}, {"tag": "p", "text": "The Herald suffered a power surge, and Seitaron attempted to use his comlink to order the ship to pull out of the atmosphere, but found the communicator had been disabled along with all other nearby electronics. He then ordered Cantompa and Zhios to carry the order to the bridge, but the pair found the doors to the hangar would not open and removed the control panel to begin searching for an override. They managed to open the door a crack as Chalis continued taunting Verge, but were thrown to the ground as the Star Destroyer lurched unsteadily. Verge then began beating the traitor, but the fleet troopers continued with the work and managed to open the door enough for one of them to try and squeeze through."}, {"tag": "p", "text": "Verge then stopped Cantompa and Zhios before they left for the bridge, ordering that they should tell the bridge to concentrate all fire power on the Sixty-First below instead of retreating, planning on sacrificing the Star Destroyer and all its crew in order to prevent a rebel victory. Chalis then hit Verge and the pair began to fight, while the fleet troopers stood by unsure of what to do in response to the prelate's suicidal orders. Seitaron then fired at the two combatants hoping to kill Chalis, but missed and instead killed Verge. With the prelate dead, the captain ordered the guards to tell the bridge crew to pull the Star Destroyer out of orbit, and the pair scrambled out of the hangar immediately. The Herald successfully escaped Sullust's orbit, but left the Sixty-First to claim victory on the surface. Seitaron released Chalis soon after so that she could disappear and take the blame for the prelate's death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male fleet trooper, Cantompa earned Seitaron's trust while serving with him on the Herald, as he stood by while Verge mistreated other crew members and did not object. He also aided the captain when he was ill and held guard duty tirelessly for many hours with Zhios. While accompanying the prelate and the captain to meet with Chalis, Cantompa was uncertain how Verge would react to Chalis's offer of intelligence, and stared at him rather than the traitor. After Verge gave orders that would lead to the deaths of his entire crew, Cantompa did not immediately obey, standing confused until after the prelate's death when Seitaron gave new orders instead."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Cantompa wore a black Imperial Navy fleet troopers uniform including a helmet and carried a blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cantompa first appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}