{"url": "Cantryl", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Crime lords", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Cantryl"}, {"tag": "p", "text": "Doctor Cantryl was a male Human who operated as a crimeboss on the planet Gandle Ott in the Kathol sector during the early years of the New Republic. He controlled a criminal organization and kept accurate navigational charts of the sector. During the years that Moff Kentor Sarne was in charge of the region, Cantryl maintained a low profile due to the Moff's intolerance of criminal gangs within his territory."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cantryl was a Human male born during the waning decades of the Galactic Republic and eventually became the crimeboss of the planet Gandle Ott in the remote Kathol sector of the Outer Rim Territories. He used the honorific title of \"Doctor\" and controlled an organization of criminals, smugglers, and thugs. During the years that Moff Kentor Sarne ruled the sector in the name of the Galactic Empire—and, later, as his own personal empire after the collapse of Imperial authority in the wake of the Battle of Endor—Cantryl kept a low profile since the Moff did not tolerate criminals working within his borders."}, {"tag": "p", "text": "Due to his organization's activities, Cantryl was in possession of accurate navigation charts of the Kathol sector that highlighted all the major star systems and trade routes, and he was willing to sell them for 5,000 credits. Although Cantryl claimed that the charts showed the location of shadowports and secret smuggler routes, they did not. In 8 ABY, the New Republic CR90 corvette FarStar visited Gandle Ott during a mission to track down Sarne. The New Republic had recently ousted the Moff from his capital on the planet Kal'Shebbol, causing him to flee into the Kathol sector. During his retreat, the Moff had purged the navigational data on the sector from the planet's memory banks, leaving the New Republic with incomplete data that had no information on locations beyond Gandle Ott. Cantryl was one of the possible options that the crew of the FarStar considered as a potential source for obtaining the information that they needed to continue their mission."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A slim man, Cantryl was in his forties as of 8 ABY and favored dressing in white suits. He smiled a lot, but the expression never reached his dark, glittering eyes. A businessman, he was prepared to do business with most individuals as long as they had the credits to pay. However, he was not beyond demanding large sums of money for information that he knew customers badly wanted, although prices were negotiable and he could be haggled down to a more reasonable sum. Cantryl was also not above lying about the contents of the information if he thought that it would ensure a sale."}, {"tag": "p", "text": "Cantryl had an understanding of the workings of a bureaucratic system, and was well-informed about activity on Gandle Ott. He had a knowledge of operating security systems, and was trained to use a blaster, carrying a hold-out in addition to a comlink."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cantryl was mentioned in Death Is Remotely Possible, a roleplaying game adventure featured in The DarkStryder Campaign, published by West End Games as a possible source of astrogation charts that the player-characters could acquire to continue their adventure."}, {"tag": "p", "text": "Cantryl's character does not have to be encountered in the adventure; the main aim of the players is to acquire navigational data and the adventure provides several ways for the players to obtain it. Cantryl is only one of several options, and his involvement in the scenario is dependent on the player's actions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}