{"url": "Cantwell-class_Arrestor_Cruiser", "categories": ["Category:Canon articles", "Category:Cruiser classes", "Category:Galactic Empire starship classes", "Category:Kuat Drive Yards products"], "nodes": [{"tag": "h1", "text": "Cantwell-class Arrestor Cruiser"}, {"tag": "p", "text": "The Cantwell-class Arrestor Cruiser was a type of cruiser used by the Galactic Empire. Manufactured by Kuat Drive Yards at the request of the Department of Imperial Justice and the Imperial Navy, it featured three powerful tractor beam projectors which it used to ensnare suspect vessels and steer traffic away from construction zones. One Arrestor was notably featured in an Imperial recruitment film played on Corellia."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like some other warships used by the Galactic Empire, the Cantwell-class Arrestor Cruiser was shaped like a narrow arrowhead. However, the tip of the arrow was located at the stern of the ship, unlike the Imperial-class Star Destroyers for example. The inverted triangle-frame ended midway along the hull, leaving the front half of the ship long and narrow. Arrestor cruisers were uniformly painted a light shade of gray, in keeping with the Empire's preference for muted colors."}, {"tag": "p", "text": "Vessels of the Cantwell-class were equipped with three turret-mounted twin heavy ion cannons (one port, one starboard, and one ventral), and twelve light laser cannons (three forward-, three port-, three starboard-, and three aft-mounted). They were also equipped with three powerful, dish-shaped RT-17 repulsor-tractor beam emitters: one at the bow, one at starboard, and one at port. They not only enabled the Arrestor to capture and draw in other starships, but also to push them away to an ideal distance for the Arrestor's ion cannons to disable the suspect ship's systems."}, {"tag": "p", "text": "The warship had two large docking bays situated amidships, each housing a squadron of starfighters (24 fighters in total) as well as shuttles allowing the ship's complement of stormtroopers to board a captured craft."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Cantwell-class Arrestor Cruiser was designed to ensnare and incapacitate any suspect starship, be it a freighter, a frigate or even another cruiser. During a capture operation, it pursued its target, only needing to maintain a distance of long range to bring its tractor beams to bear. Once the target was trapped, the Arrestor could either reel it in to disable it with ion cannons, or keep it at long range, allowing starfighter squadrons to carve it up. The Arrestor was also used to steer traffic away from construction zones."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the early years of the Galactic Empire's rule, the Department of Imperial Justice and the Imperial Navy campaigned for the creation of a warship designed to capture pirates, smugglers and other dissidents so they could be tried publicly. The program was approved, and the contract was awarded to Kuat Drive Yards. After three years of development and testing, the first Cantwell-class Arrestor Cruiser was commissioned into service."}, {"tag": "p", "text": "In 13 BBY, the Arrestor Cruiser was in use in the Imperial Navy. At this time, the White Worms members Han Solo and Qi'ra attempted to escape the Core Worlds planet of Corellia by boarding a ship at the Coronet City spaceport. Whilst being pursued by stormtroopers, Solo saw an Imperial recruitment film that notably featured an Arrestor Cruiser flanked by a pair of Imperial I-class Star Destroyers."}, {"tag": "p", "text": "Three years later, Solo was training at the Carida Academy as a pilot. He was part of Onyx Squadron of TIE brutes which was assigned to an Arrestor Cruiser. At one point, they engaged with pirate Z-95s, with Solo's starfighter becoming damaged. He guided it into the hangar, but knocked out two more starfighters. In the aftermath, he was sentenced at a tribunal and reassigned as an Imperial Army trooper in the Mimban campaign."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Notable appearances"}, {"tag": "p", "text": "The Cantwell-class Arrestor Cruiser first appeared in the Star Wars canon in the 2018 film Solo: A Star Wars Story, in an Imperial recruitment film. However, in the script for Solo, the Millennium Falcon was at one point to be captured by a tractor beam ship, which was developed into the Arrestor Cruiser. This full appearance in the film was eventually cut, but the cruiser was featured in the Onyx Squadron sequence in the film's deleted scenes."}, {"tag": "p", "text": "In 2018, Leland Chee stated on Twitter that the cruiser's name is the Cantwell-class, although this wasn't confirmed by any officially licensed material until Starships and Speeders, a 2020 sourcebook for Fantasy Flight Games' Star Wars roleplaying game system."}, {"tag": "h3", "text": "Design origins"}, {"tag": "p", "text": "Colin Cantwell originally pitched the design of what would become the Imperial Arrestor Cruiser directly to George Lucas, for use in the 1977 movie Star Wars: Episode IV A New Hope, although it was ultimately discarded in favor of a completely different design. The design had been derived from World War II aircraft carriers. Originally called the Sith Carrier, the ship was to launch Sith Fighters, and the dishes on its sides were intended to be used to destroy various ships. This idea was eventually adapted for the superlaser weapon of the Death Star."}, {"tag": "p", "text": "The production crew for Solo discovered Cantwell's design while reviewing Lucasfilm's archives. Industrial Light & Magic then created a high-fidelity CG model of the vessel for use in the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}