{"url": "Canyon_Corsairs", "categories": ["Category:Legends articles", "Category:Pirate organizations"], "nodes": [{"tag": "h1", "text": "Canyon Corsairs"}, {"tag": "p", "text": "The Canyon Corsairs, also known as the Corsair Raiders or simply as the Corsairs, were a group of pirates active on the planet Lok and in the Karthakk system at the time of the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Canyon Corsairs were active in the Karthakk system. They were named after the Canyon, an area of the Karthakk system that served as their home. The pirates were also present in other quadrants such as Nym's Hovel, Voria's Ember, the Censorious Tempest Nebula and the Corsairian Crescent. They were based on the planet Lok where they had built a small stronghold out in the wilderness."}, {"tag": "p", "text": "The Corsairs were a ruthless band of hooligans promising to wreck havoc on any passing civilian or vessel. The typical Canyon Corsair considered him- or herself above average vehicle pilots and was typically skilled in all sorts of vehicles such as swoops, landspeeders, and starships. Canyon Corsairs spent most of their time working on their vehicles, the parts for which they did not always acquire honestly. In space, Corsair pilots flew Ixiyen-class fast attack crafts, M12-L Kimogila heavy fighters and T-65 X-wing starfighters."}, {"tag": "p", "text": "The Canyon Corsairs were enemies of the Blood Razors and Nym's Lok Revenants."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Battle of Yavin, the retired Imperial Naval Captain Boyrake and the former Rebel spy Talia v'laenya discovered the location of the Canyon Corsair's Stronghold on Lok."}, {"tag": "p", "text": "Around 1 ABY, the Corsairs hijacked several Valarian shipments transported to Nym's organization. Shamdon Kree therefore dispatched elite pilots from Talon Karrde's Smuggler Alliance to deal with the pirates. Many Corsairs were killed, including the pirate leader known as the Canyon Corsair Behemoth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}