{"url": "AAC-1_speeder_tank", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Hovertanks", "Category:Landspeeders", "Category:Naboo vehicles", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "AAC-1 speeder tank"}, {"tag": "p", "text": "The AAC-1 speeder tank was a military landspeeder that was used by the Alliance to Restore the Republic during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The AAC-1 speeder tank was fast, with exceptional lateral maneuverability allowing it to slip sideways and dodge incoming fire. Equipped with reinforced hull plating, the AAC-1's only weak point was found to be the black coolers on the sides of the tank. Its primary weapons were forward-facing laser cannons and particle cannons, which were capable of destroying an enemy tank with a small number of shots. A pair of rapid-fire missile turrets were mounted on the top of the vehicle. The pilot used the laser cannons and beam cannons whilst the gunner fired the missile turrets. The speeder tank was employed as an anti-aircraft combat vehicle, and employed a repulsorlift engine for movement."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally designed by SoroSuub Corporation, the vehicle that would become the AAC-1 was a prototype concept that never went into production. A SoroSuub designer sold the design blueprints to agents of the Alliance to Restore the Republic and the Royal Naboo Security Forces to pay off debts incurred from a night of Sabacc. The Alliance to Restore the Republic found the vehicle to be effective when used in lightning strikes against military targets."}, {"tag": "p", "text": "The Royal Naboo Security Forces employed AAC-1s during the Galactic Empire's assault on Naboo in 18 BBY, during which Queen Apailana was killed. Around 0 BBY, the Alliance and the Empire had AAC-1s stationed at their base on Polis Massa when the Empire raided the facility searching for the Death Star plans."}, {"tag": "p", "text": "A variant, the AAC-2 hovertank, was used by Rebel in battles such as the Skirmishes of Yavin 4."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This vehicle replaces the Rebel combat speeder from Star Wars: Battlefront, and shares the exact same backstory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}