{"url": "AAL-1971/9.1_Troop_Transport", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:First Order starship classes", "Category:Sienar-Jaemus Army Systems products", "Category:Troop transport classes"], "nodes": [{"tag": "h1", "text": "AAL-1971/9.1 Troop Transport"}, {"tag": "p", "text": "The AAL-1971/9.1 Troop Transport, also known as an Atmospheric Assault Lander (AAL) or First Order Transporter, was an armored troop carrier operated by the First Order designed to ferry up to twenty stormtroopers from orbital vessels to planetary surfaces."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Sienar-Jaemus Army Systems's Atmospheric Assault Lander was a combat-zone rapid-deployment transport designed to ferry twenty stormtroopers into combat in less than thirty seconds. Measuring 17.83 meters in length, it carried an additional gunner and veteran TIE pilot. It featured a disembarkation ramp at the front of the vessel, where two squads of stormtroopers in a low-light troop compartment (to preserve trooper's night vision) would disembark as a bright spotlight above the ramp brightened the landing zone, dazzling the enemy in the process. Located directly behind the searchlight was a forward deflector augmenter and sensor array. On top of the front section of the craft, there was a troop compartment emergency hatch. The cockpit was located near the stern, and was so narrow that the pilot was required to stand when operating the lander."}, {"tag": "p", "text": "The transport was maneuvered by a single veteran TIE pilot in a small, rectangular space above the vessel to provide maximum visibility, but could be controlled via consoles in the crew compartment below—albeit with less precision. Assault lander pilots were not generally concerned by the exposed vantage point, but complained of the ship's lack of maneuverability compared to that of a starfighter. The lander had two pairs of robust landing gear underneath for hard landings, and had one ramp actuator on either side of the front to stabilize the craft when the ramp was lowered. The lower sides of the craft included atmospheric ducting, heat exchanger fins, atmospheric processing, and life support systems, as well as the forward repulsor array used during landing. On the outside were two pairs of terrain sensors near the stern. The troop cabin was also large enough to accommodate a pair of 125-Z treadspeeder bikes. It was also possible to destroy an AAL by setting it to self-destruct, something Jarek Yeager showed during the rescue of Tamara Ryvora."}, {"tag": "h3", "text": "Armament and defenses"}, {"tag": "p", "text": "A single stormtrooper gunner protected the lander during its final approach to the drop zone, scanning the terrain from an elevated dorsal turret mounting a F-Z0 antipersonnel blaster cannon. The turret provided a 240-degree field of fire and could also be maneuvered from the crew compartment, while an elevating footplate raised the gunner into position. The blaster turret power cells were located in front of and beneath the gunner. A deflector shield generator was located on top of the craft, with a main forward deflector projector located slightly in front of it. Inside the prow was a forward deflector augmenter and sensor array for extra protection further up the front of the vessel, located behind the spotlight. Each lander had a smooth, armored hull that used voids of inert gas to dampen blaster bolt impacts, with additional external armor used to protect the engines from incoming fire."}, {"tag": "p", "text": "Stormtroopers were deployed the moment the boarding ramp was lowered, with a first group of troopers rushing out to establish a perimeter. To do this, the soldiers often used FWMB-10 repeating blasters, which offered a good cover fire. Two squads, consisting of twenty soldiers, would disembark in standard two-abreast formation, and could begin combat operations in as little as thirty seconds, allowing the lander to evacuate the drop zone. The gunner would maintain his or her position until the drop zone was secured by the deployed troops, while the pilot acted as spotter to identify any threats."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "Each craft was powered by a reactor located in a sturdy reactor compartment in the rear, and featured four SJAS-210 sublight ion engines that were kept powered up during landings in the event rapid extraction was required. These engines required numerous reactant ducts and pumps and an acceleration compensator to function fully. Furthermore, to give the pilot greater control of the craft, electromagnetic thrust vectoring fins were stationed over the engines exhaust, and ion drive thrusters, an ion collision bar and ion acceleration chambers further improved the assault landers maneuverability. Additionally, several power cells were located underneath the engines, sheltered under the frame of the vessel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Atmospheric Assault Lander was used by the First Order 30 years after the Battle of Endor. They were used to deploy stormtroopers to restore order to the Pressy's Tumble refinery complex in the Pressylla system."}, {"tag": "p", "text": "Commander Poe Dameron of the Resistance had access to one, labeled 226, and he used it on the mission to discover Admiral Gial Ackbar's location after the admiral had been captured by the First Order. Dameron diverted to a planet to rescue the protocol droid C-3PO."}, {"tag": "p", "text": "Two of the transports were deployed on an assault platform during the search for the famed explorer Lor San Tekka."}, {"tag": "p", "text": "During the occupation of Castilon's Colossus platform, the First Order used the transports to deport residents who had been arrested for defying them. When Z'Vk'Thkrkza, Hype Fazon, Grevel, and Nod were to be sent away in a transport, Kazuda Xiono and Torra Doza helped them overpower their stormtrooper escort and steal the ship so they could escape the planet. Aunt Z decided that she and Fazon would go to Takodana, where she had a friend, and Fazon flew the transport offworld. A year later, the Colossus Resistance used their stolen AAL to rescue Tamara Ryvora from the ocean planet Castilon. However, they were captured and taken on board Commander Pyre's Star Destroyer where they escaped by crawling out from beneath the landing gear and they set the ship to self-destruct."}, {"tag": "p", "text": "Just after the mission to Pressy's Tumble, four Assault Landers and Kylo Ren's command shuttle departed from the Resurgent-class Star Destroyer Finalizer and arrived at Tuanul, a village on Jakku, to discover information about Jedi Master Luke Skywalker's exile. The landers deployed multiple squads of stormtroopers, who proceeded to engage in combat with the villagers. The landers were also used to deploy stormtroopers to Takodana Castle on Takodana in an attempt to secure BB-8, an astromech droid which had been given the information leading to Skywalker."}, {"tag": "p", "text": "During a mission on Pasaana, the First Order used two such crafts to deploy stormtroopers and to transport Chewbacca, who was captured during the mission. Rey later destroyed one of the transports with Force lightning, after she got into a tug of war with Supreme Leader Kylo Ren. The First Order had an occupation on the world Kijimi and used their Assault Landers to take prisoners and \"new recruits\" back to the orbiting Star Destroyer.[source?]"}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Sith Eternal military employed the AAL-2100/9.5 atmospheric assault lander, an updated model of the AAL-1971/9.1 Troop Transport, during the Battle of Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The First Order Transporters appear in the 2015 Star Wars saga film Star Wars: Episode VII The Force Awakens. The shuttles appear in the LEGO short series Poe to the Rescue. After picking up C-3PO, Poe Dameron uses it to travel to the Finalizer and rescue Admiral Ackbar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}