{"url": "Captain", "categories": ["Category:Canon articles", "Category:Articles needing additional sources", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Captains", "Category:Law enforcement ranks", "Category:Military ranks"], "nodes": [{"tag": "h1", "text": "Captain"}, {"tag": "p", "text": "In civilian life, a captain was an individual who was in charge of a starship. In military organizations such as the Imperial Navy or the Royal Naboo Security Forces, a captain was an officer of high rank with leadership responsibilities."}, {"tag": "h2", "text": "Military organizations"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "By the Fall of the Republic, the Galactic Republic used the position of captain in its Judicial Forces, and, in 22 BBY, the government created a proper army. This new Republic Military, made up of clone troopers from the planet of Kamino, used the rank of captain in both its army and navy. Clone trooper officers who held the rank were known as Clone Captains, although non-clone officers could also serve as captains."}, {"tag": "p", "text": "Many clone navigation officers, some of whom held the rank of captain, wore a single-rowed plaque, with two red and one blue square (from left to right). In the army, Clone Captains led companies of 144 troopers and directly reported to a Clone Commander. However, as many of the Jedi Generals had a creative approach to the chain of command, some captains worked directly with to their Jedi officer. Clone Captain CT-7567, also known as \"Rex,\" was a notable Clone Officer. Rex led the 501st Legion's Torrent Company and worked directly with Jedi General Anakin Skywalker, serving as the Jedi's first in command."}, {"tag": "p", "text": "Clone Captains in standard Phase I armor were initially distinguished by maroon markings on their white armor, but many captains began to customize their armor to showcase their individuality, show their company's image, and keep from being easily identified by snipers."}, {"tag": "h3", "text": "Confederacy of Independent Systems"}, {"tag": "p", "text": "The Confederacy of Independent Systems used the rank of captain. In the Separatist Droid Army both organic officers and droids could hold the rank. Rackham Sear, a male Kage Warrior, served as a captain in the Confederacy military. The Separatists also utilized commando droid captains; one such captain served at the Citadel."}, {"tag": "p", "text": "The rank was also used in the Confederacy navy. Captain Mar Tuuk served in the Confederacy navy, and commanded the Ryloth blockade from his Lucrehulk-class Battleship."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "In the First Galactic Empire, there were captains in the Imperial Navy and Imperial Army. A stormtrooper captain from the army served as a military advisor to Queen Trios of Shu-Torun."}, {"tag": "p", "text": "The Imperial insignia plaque of the rank had three red squares over three blue, or alternatively, a single row of of six yellow squares, or three blue squares followed by two red."}, {"tag": "p", "text": "The term could also refer to anyone who captained a vessel, regardless of their military rank. Thrawn captained the Chimaera while holding the rank of commodore."}, {"tag": "h3", "text": "Alliance to Restore the Republic"}, {"tag": "p", "text": "In the Alliance to Restore the Republic there were captains in both the army and the navy."}, {"tag": "p", "text": "The insignia of a Rebel captain had two pips over each other. The color of the pips (red or blue) indicated the branch of service."}, {"tag": "p", "text": "This held for the early rebellion as well."}, {"tag": "h3", "text": "First Order"}, {"tag": "p", "text": "The First Order had captains in the navy and Army. Two captains in the army's Stormtrooper Corps were Cardinal and Phasma."}, {"tag": "p", "text": "The First Order ranks were marked by a combination of uniform color and arm insignia, worn on the left sleeve of the uniform. The First Order captains wore a gray uniform with a black armband edged in silver, bearing the name of Dillon, a particular Imperial hero of the Galactic Civil War, depicted in silver Aurebesh letters."}, {"tag": "h3", "text": "Resistance"}, {"tag": "p", "text": "In the Resistance, there were captains in both the army and the navy."}, {"tag": "p", "text": "The rank badge of the Resistance captains bore a colored vertical line, red for personnel in the army and blue for the navy."}, {"tag": "p", "text": "In the Resistance Army, the rank of Captain was lower than that of Commander."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}