{"url": "Captain_Phasma_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Captain Phasma"], "nodes": [{"tag": "h1", "text": "Captain Phasma 4"}, {"tag": "p", "text": "Captain Phasma 4 is the fourth issue in the comic book miniseries Star Wars: Captain Phasma. The comic focused on Captain Phasma following the events of Star Wars: Episode VII The Force Awakens. Captain Phasma 4 was written by Kelly Thompson, illustrated by Marco Checchetto, and published by Marvel Comics on October 18, 2017 under the Journey to Star Wars: The Last Jedi publishing label."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Find out how Phasma, the biggest and baddest officer of the Galactic First Order, makes her way across the galaxy before she reunites with her team in THE LAST JEDI."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Leading the assault under the cover of rain, Captain Phasma jumps down the wall onto the battlements of the R'ora stronghold and battles the R'ora defenders. She is followed by TN-3465, who warns that they are overwhelmed and have to pull back. Phasma disagrees as the Lupr'or army leaps down from the battlements and joins the attack. While the battle rages, Captain Phasma and TN-3465 make their way to the main tower where Lieutenant Sol Rivas is being held."}, {"tag": "p", "text": "Captain Phasma orders TN-3465 to keep watch and make sure their exit is visible. When TN-3465 asks about the battle, Phasma reminds her that they are here for Rivas and nothing more. A battered Rivas, who is sporting a bruised black eye, expresses delight in seeing Phasma. However, Phasma spurns his flattery and tells him that he knows why they are here. Phasma demands that Rivas confess and clear his conscience. A grinning Rivas defiantly counters that he has nothing to confess and promises not to tell anyone. He mockingly tells her that she was the one who lowered Starkiller Base's shields, making her responsible for the superweapon's destruction."}, {"tag": "p", "text": "When Rivas refuses to confess, Phasma shoots him dead with her blaster. Against Phasma's orders, TN-3465 leans against the wall of the tower and witnesses Phasma executing Rivas in order to cover up her role in Starkiller Base's destruction. After Phasma leaves, TN-3465 fears that Phasma would discover her. In an attempt to keep herself alive, the TIE fighter pilot decides to make her think that she is totally preoccupied with the fate of the Lupr'or."}, {"tag": "p", "text": "When Phasma asks where she was, TN-3465 lies that she saw some of the R'ora advancing and had to fight them off to keep their escape rout clean. When TN-3465 asks about Rivas, Phasma tells her that the traitor has been eliminated and that it is time to leave this \"worthless rock.\" When TN-3465 feigns concern for the Lupr'or, Phasma counters that they are doomed. TN-3465 argues that they can help them win the day. However, Phasma dismisses the idea of helping the Lupr'or colonists take Luprora from the indigenous population. She reasons that the planet is rejecting the Lupr'or because they are unsuitable to its evolution. She argues that the colonists are in their final throes and that the R'ora, who are more capable in the water, will wipe them out."}, {"tag": "p", "text": "As TN-3465 prepares their TIE/sf space superiority fighter for takeoff, Phasma uses the gun-sight in her blaster rifle to look at the R'ora stronghold. As the tide overwhelms the stronghold's island, she says that the Lupr'or are notihing but a memory. While TN-3465 is preoccupied, Phasma shoots the BB unit BB-K8, disintegrating him. She then orders a startled TN-3465 to raise her hands and turn around. When TN-3465 asks why she shot BB-K8, Phasma counters that she knows why."}, {"tag": "p", "text": "TN-3465 tries to deny knowledge of Phasma's malfeasance at Starkiller Base. However, Phasma counters that TN-3465 has not learnt that she is survivor who is determined to fix all \"loose ends.\" TN-3465 denies she is a lose end and pleads ignorance. However, Phasma responds that it doesn't matter what she knows before shooting TN-3465 through with her blaster. As TN-3465 breaths her last, Phasma reassures the dying pilot that it was a quick death and closes her eyes, before laying her down on the rock. Before leaving, Phasma remarks that \"even one loose end is one too many.\""}, {"tag": "p", "text": "While preparing her TIE fighter for takeoff, Captain Phasma updates her audio report. In the four days following the Battle of Starkiller Base, Phasma claims that she tracked down Rivas and killed him for his role in lowering the weapon's Deflector shields. Phasma also claims that TN-3465 and BB-K8 were destroyed during the course of the mission."}, {"tag": "p", "text": "Returning to the First Order fleet, Phasma docks in the hangar of the Resurgent-class battlecruiser Finalizer. General Armitage Hux is relieved to see her, having feared her untimely demise. When Hux asks about her unauthorized leave, Phasma tells him about her hunt to eliminate Lieutenant Rivas for his alleged role in Starkiller Base's destruction. Satisfied, General Hux allows her to return to her divisional duties and says they will speak more on this after her debriefing."}, {"tag": "p", "text": "Believing her account, Hux remarks that he should have known that even an exploding planet could not kill her not impede her devotion to the First Order. Peer through a large glass window at the massed First Order fleet, Phasma replies \"indeed\"; fully confident that her true loyalty to herself and dark secrets are hidden from the First Order."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}