{"url": "Captor-class_heavy_munitions_cruiser", "categories": ["Category:Legends articles", "Category:Captor-class heavy munitions cruisers", "Category:Cruiser classes", "Category:Freighter classes", "Category:Kuat Drive Yards products", "Category:Trade Federation starship classes"], "nodes": [{"tag": "h1", "text": "Captor-class heavy munitions cruiser"}, {"tag": "p", "text": "The Captor-class heavy munitions cruiser, also known as the Trade Federation heavy munitions cruiser, was a type of commercial freighter-warship used by the Trade Federation to transport bacta to buyers throughout the galaxy around 44 BBY."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "They shared similar designs with the LH-3010 capital freighter and Lucrehulk-class LH-3210 freighters also used by the Federation, and were at least several hundred meters long.\nAlthough built as dedicated warships for the corporation's Trade Defense arm, they were much smaller and less powerful than the Lucrehulk-class, which the Trade Federation later converted into battleships for their attack on Naboo and used during the Clone Wars."}, {"tag": "p", "text": "The heavy munitions cruiser had large hangars located at the center of its superstructure, where fighter squadrons could launch into battle in wartime. It was propelled by three large thrusters.\nLike many of the Trade Federation's ships, a heavy munitions cruiser depended heavily on automated systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Captor-class was part of the Trade Defense Force around 214 BBY. During that time, a series of transport businesses in the Rseik sector decided to join the Trade Federation. They were burdened by pirates, and the Defense Force sent a flotilla including a cruiser and two Munifex-class cruisers to stop the pirates."}, {"tag": "p", "text": "During the bacta drought leading to the Stark Hyperspace War, bacta ships of this type were attacked by warships utilized by the Stark Commercial Combine. As a result of these attacks, the Trade Federation demanded the right to build up its military forces or stop trade altogether."}, {"tag": "p", "text": "During the Stark Hyperspace War, freighter/cruisers of this kind were used to transport Judicial and Jedi forces (including Red and Blue Squadrons) to the Fifth Battle of Qotile."}, {"tag": "p", "text": "Perhaps the best-known vessel of this class, Admiral Korvin, was used by Raith Sienar for his mission to Zonama Sekot in 29 BBY, equipped with 3,000 B1-Series battle droids, a force of at least 30 Vulture droid starfighters, 3 C-9979 landing craft, and a contingent of heavily-armored E-5 battle droids, a new battle droid model developed after the Battle of Naboo. Nevertheless, Admiral Korvin also carried a hundred Human troops, and a two-seater Spy ship which required a living pilot."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}