{"url": "Capture_of_Cygnus_Staff", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Operation Strike Fear", "Category:Battles of Ralltiir"], "nodes": [{"tag": "h1", "text": "Capture of Cygnus Staff"}, {"tag": "p", "text": "The capture of Cygnus Staff was an operation committed by the Rebel Alliance to capture staff from Cygnus Spaceworks."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After rescuing Sian Tevv the Alliance and the Sullustans began to formulate a plan to destroy the Imperial-class Star Destroyer Invincible and end Operation Strike Fear permanently."}, {"tag": "p", "text": "The first step was to capture some staff belonging to the Cygnus corporation so that they could acquire codes to masquerade as a supply ship on a Lambda-class T-4a shuttle. They found the opportunity at a test site where they were conducting tests on their latest fighter, the Alpha-class Xg-1 Star Wing."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Keyan Farlander in a R-22 Spearhead, along with a wingman, were launched first. They cleared the small fighter defences that were only in the way and Farlander scanned the transports Kappa and Lambda 1 and 2 to find the staff in Kappa with the defences cleared a Rebel transport Lightning arrived and boarded the transport Kappa while Farlander destroyed any remaining TIE Fighters and Interceptors and destroyed the two freighters Dock to stop any more fighters and the Lambda transports. The Lightning captured the staff and jumped to Hyperspace with the two fighters following suit."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The staff \"provided\" the Alliance the codes to board the Star Destroyer without suspicion. The second step was to plant an extremely powerful explosive into the Invincible, which required a massive Nuclear bomb from the Empire's own arsenal. The opportunity for one presented itself when a freighter named Gafra was stranded by a rebel attack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}