{"url": "Capture_of_Galen_Erso", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles in the Raioballo sector", "Category:Events during the Imperial Era"], "nodes": [{"tag": "h1", "text": "Capture of Galen Erso"}, {"tag": "p", "text": "In 13 BBY, renowned scientist Dr. Galen Erso was captured by Orson Krennic, Director of the Imperial Military Department of Advanced Weapons Research agency, and his personal squad of death troopers. Krennic had previously manipulated Erso into researching crystallography for Project Celestial Power, a scientific program ostensibly meant to promote sustainable energy. In reality, the ambitious Imperial officer sought Erso's synthetic kyber crystals for a secret enterprise — the construction of the Death Star, a planet-destroying superweapon. Erso, upon learning the true nature of his work, fled the project and hid his family on the agrarian world of Lah'mu with the help of the rebel Saw Gerrera."}, {"tag": "p", "text": "In Erso's absence, work on the weapon's crystal-powered superlaser began to stagnate, and Krennic knew he would need to recover the valuable scientist for any hope of success. He traced Erso to Lah'mu and ventured there in his personal Delta-class T-3c shuttle. The Ersos, composed of Galen, his wife Lyra, and their young daughter Jyn, were surprised by the sudden Imperial presence, but were well-prepared with a plan to save at least Jyn from capture. Krennic landed a short distance from the Erso homestead, prompting the family to contact Gerrera with news of his appearance. Lyra guided their child to a secret bunker while Krennic and his trooper escorts approached. Galen confronted the cloaked Director alone and attempted to convince him that Lyra had died, or alternatively that his mind had weakened. Krennic, acute in his own right, dismissed the lies and insisted that Erso return to work on the project. Lyra appeared, producing a blaster in an effort to prevent Galen's abduction, but she was executed in the encounter. When Krennic's troopers were unable to find Jyn in the surrounding area, the Imperials settled for Galen as their single prisoner."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}