{"url": "Capture_of_Moregi", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Sujimis sector", "Category:Events during the Clone Wars"], "nodes": [{"tag": "h1", "text": "Capture of Moregi"}, {"tag": "p", "text": "During the Clone Wars, bounty hunter Asajj Ventress captured Moregi, a Volpai with a bounty from the Rang Clan on his head, on Pantora with the aid of undercover Jedi Master Quinlan Vos. Vos had been sent on a mission by the Jedi Council to assassinate Count Dooku, the leader of the Confederacy of Independent Systems, in an effort to bring a swift end to the Clone Wars. Needing a partner for the mission, Vos picked Ventress, a Nightsister who had once been Dooku's apprentice."}, {"tag": "p", "text": "After learning from Boba Fett that Ventress was on Pantora, Vos traveled there and interrupted Ventress while she was attempting to apprehend Moregi. Due to Vos' interference, Moregi was able to escape the first round. After a tense start, Vos, posing as a bounty hunter, teamed up with Asajj to capture Moregi. With the aid of Vos' pscyhometric powers, the duo were able to track down the Volpai fugitive to his apartment. Following a struggle and pursuit, the two bounty hunters were able to capture Moregi. As a result of this joint hunt, Vos was able to gain the trust of Ventress and the two established a partnership."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Clone Wars, the Volpai Moregi earned the ire of the Rang Clan by embezzling funds. As a result, the Clan placed a 25,000 credit bounty on his head. Moregi hid on Orto Plutonia's temperate moon Pantora with his Rodian wife and her son. Asajj Ventress, the Sith Lord Dooku's former apprentice and a Nightsister–turned–bounty hunter, sought to collect the bounty on his head."}, {"tag": "p", "text": "Meanwhile, on Coruscant, the Jedi High Council dispatched Master Quinlan Vos on a mission to assassinate Count Dooku. The Separatist leader had ordered the massacre of civilians on Mahranee and the Jedi Council wanted to bring a swift end to the Clone Wars in order save the lives of many more civilians. Vos had been selected for this mission due to his skill with undercover work. At the suggestion of Master Yoda, the Council recommended Ventress as a potential partner for Vos. While initially reluctant, Vos decided to seek her help. Traveling to Coruscant's Level 1313, Vos met the bounty hunter Boba Fett at a bar. Fett informed Vos that Ventress was chasing down Moregi on Pantora."}, {"tag": "h2", "text": "The hunt"}, {"tag": "h3", "text": "An uneasy hunt"}, {"tag": "p", "text": "While prowling a public park on Pantora, Asajj Ventress sighted Moregi feeding multiple scurriers outside a building. As Ventress approached her quarry on foot, Moregi spotted her and fled. Using his unique four-arm physiology, Moregi leapt on several rooftops and swung from overhangs while knocking several pedestrians over in an attempt to delay his pursuer. Using her Force powers, Ventress pursued the Volpai and managed to slam him to the ground. Before she could tackle Moregi, her hunt was interrupted by the arrival of a dark-haired humanoid, who turned out to be Vos."}, {"tag": "p", "text": "Viewing Vos as an interloper who was trying to steal her bounty, Ventress punched him in the jaw. Taking advantage of the commotion, Moregi took the opportunity to escape the scene. While verbally confronting Vos for stealing her bounty, Ventress heard some faint movement and witnessed Moregi leaping onto another rooftop. The Volpai then led the two bounty hunters on a chase to a high-fashion merchant area by swinging across different shop signs. Ventress managed to grab Moregi's shirt while he was trying to swing from a swinging sign belonging to a shop called the \"The Paisley Pikobi\"."}, {"tag": "p", "text": "While struggling, Moregi and Ventress fell to the streets below. The Volpai managed to land on the hood of a passing speeder. Ventress managed to land unharmed but was upset that she had lost her bounty for the fourth time. While making her way into the town's square, Ventress sensed that she was being followed by the interloper Vos. Ventress berated Vos for interfering with her hunt and rebuffed his attempts to partner with her. After seeing Moregi escaping in another vehicle, she commandeered a Zardossa airspeeder from an irate Rodian driver and resumed the pursuit."}, {"tag": "p", "text": "Using the stolen speeder, Ventress leapt onto the hood of Moregi's second speeder and grappled with him. Despite her best efforts, Moregi managed to throw her off the vehicle. Ventress fell to the ground but was picked up by Vos, who had commandeered another speeder. While Ventress was still furious with the interloper for disrupting her hunt, she agreed to let him treat her for a meal since she was exhausted and bruised from her failed pursuit."}, {"tag": "h3", "text": "Two is Company"}, {"tag": "p", "text": "Despite a difficult start, Vos managed to win Ventress over after he used his psychometric abilities to examine a metal plating owned by Moregi. Using his Force powers, Vos deduced that Moregi had not left Pantora. He also discovered that Moregi had a Rodian wife and child and that they lived in an apartment room in the city. Without revealing his Jedi identity, Vos offered to share this information with Ventress if she agreed to partner with him. After tipping the bartender, the two hunters made their way to Moregi's apartment room, which lay on the fourth floor of an apartment complex."}, {"tag": "p", "text": "After smashing down the door, Ventress kicked Moregi in the midsection. Vos entered the room shortly after and spotted Moregi's wife and child. Despite Moregi's protestations of innocence, Ventress and Vos refused to let him go. Moregi attempted to bribe them but Ventress responded that they were being paid well enough to get the money he had embezzled back to the Rang Clan. Unable to reason with the hunters, Moregi attacked them with his four arms and managed to knock Ventress and Vos to the ground."}, {"tag": "p", "text": "After Moregi's Rodian wife pleaded for him to run, the Volpai leapt out of a window and commandeered a red speeder sled. Using their Force powers, Vos and Ventress followed him through the window. While Ventress pursued the fugitive on foot, Vos commandeered an unoccupied speeder bike and offered Ventress a lift. Catching up with Moregi, Ventress leapt off the bike and wrestled the Volpai to the ground. Armed with her lightsaber, Ventress tried to force Moregi to surrender. When he tried to flee, Vos knocked him to the ground. Cornered, Moregi had little choice but to surrender to the hunters. Despite Moregi's offer to bribe them with triple the bounty, the two hunters ignored him and took him into custody."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the successful hunt, Quinlan Vos and Asajj Ventress embarked on a bounty hunting partnership. They managed to snap up several bounties together before accepting a job from the Pyke Syndicate's crime boss Marg Krim to rescue his family who had been kidnapped by the Black Sun, a rival crime syndicate. Working together, Vos and Ventress managed to rescue Krim's wife and children from the Black Sun fortress on Mustafar. Despite their success in rescuing the hostages, the two bounty hunters were unable to render any help when the Black Sun launched a punitive attack on the Pike Syndicate's base on Oba Diah."}, {"tag": "p", "text": "Reeling from the guilt of not being able to protect Krim's children, Vos confessed that he was a Jedi and revealed that he had been sent on a mission to assassinate Count Dooku. Ventress was sympathetic to Vos' mission but insisted that he would not be able to overcome Dooku without harnessing the power of the dark side. Vos reluctantly embarked on a harsh training regime on Dathomir that was based on the Nightsisters' tradition. After completing his trials, Vos and Ventress attempted to assassinate Dooku on Raxus Secundus."}, {"tag": "p", "text": "However, their mission failed since they were unable to best Dooku's dark side powers. Vos was captured by Dooku and turned to the dark side. In an attempt to find Dooku's elusive master Darth Sidious and to destroy the Sith, Vos became Dooku's new Sith apprentice. This led him on a double agent game that eventually culminated in the Second battle of Christophsis. Despite Vos' efforts, he failed to assassinate Dooku or to learn the identity of Darth Sidious, setting in motion a chain of events that led to the Great Jedi Purge and the rise of the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}