{"url": "Capture_of_Mercurial_Swift", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Capture of Mercurial Swift"}, {"tag": "p", "text": "Jas Emari, Sinjir Rath Velus and Norra Wexley undertook a mission to the planet Taris to capture the bounty hunter Mercurial Swift in order to learn information about Imperial Grand Admiral Rae Sloane's whereabouts. Posting a fake bounty hunting job, Norra and her team lured Swift into a trap at the abandoned Palmyra foundry on Taris. After trapping Swift, Norra and her team interrogated the bounty hunter and learned that Sloane had traveled to the Inner Rim world of Jakku. Having extracted the necessary information, Norra knocked Swift unconscious and headed to Jakku."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Liberation Day attack on Chandrila which claimed the lives of several New Republic officials and left others wounded, the New Republic operative Norra Wexley, her son Temmin Wexley, the B1-series battle droid Mister Bones, the former Imperial loyalty officer Sinjir Rath Velus, and the bounty hunter Jas Emari embarked on a hunt for Grand Admiral Rae Sloane, who was widely believed to have instigated the Liberation Day attack. After several months of hunting, Norra and her team learned that the bounty hunter Mercurial Swift had dealings with Sloane."}, {"tag": "p", "text": "Seeking to uncover her trail, Norra and her team connived with the wilder girl Vazeen Mordraw to create a fake bounty hunting job in order to lure Swift into a trap. With Vazeen's consent, Norra's team created a faux bounty claiming that Vazeen had stolen ID cards from the Gindar Gang, who themselves had stolen the cards from New Republic dignitaries. Swift accepted the job and traveled to Taris to collect the bounty on Vazeen. After questioning a local slave boy, Swift learned that Vazeen was hiding in the abandoned Palmyra factory."}, {"tag": "h2", "text": "The trap"}, {"tag": "p", "text": "While navigating his way through the ruined factory, Mercurial Swift managed to find Vazeen's shack. However, he was then ambushed by Norra Wexley. Swift fought back with his stun batons and knocked the blaster out of her hand. Before Norra could strike him, Swift hit her under the arm with his stun baton. However, Sinjir then attacked him from behind and punched him in the kidney. Realizing he had stumbled into a trap, Swift escaped through a fallen vent stack tower. Norra tried to shoot him but he managed to flee the shack and head towards a break in the factory wall next door. Before Swift could reach the gap, he was ambushed by Jas Emari, who used her arm to swing him hard across the trachea. Before Swift could grab one of his stun batons, Jas stunned him with her blaster."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When Mercurial Swift awoke, he was interrogated by Norra and her companions. The former loyalty officer Sinjir did most of the questioning. Swift held out until Sinjir threatened to send Mister Bones to harm Swift's mother Tabba Teldar, who lived in Coronet City. With little choice, Swift revealed that he had spoken to Sloane several months ago. He explained that she had sent him to search the Emperor's luxury yacht Imperialis on Quantxi for information about a high-ranking Imperial officer named Gallius Rax. Swift also revealed that Sloane was traveling to the planet Jakku in the Western Reaches with another man, who turned out to be Norra's estranged husband Brentin Lore Wexley."}, {"tag": "p", "text": "After extracting the necessary information from Swift, Jas proposed killing him but Norra instead chose to spare his life. She knocked him unconscious with one of his stun batons. They then headed to the planet Jakku to hunt for Sloane and discovered that the Imperial remnants had fled there. The following day, Swift awoke and decided to seek retribution against Jas Emari. After learning that the Black Sun crime boss Gyuti had placed a bounty on her head, Swift decided to take the job and followed Jas to Jakku. Despite capturing her, Jas managed to turn the tables on Swift by convincing his crew members Dengar, Embo, and Jeeta to turn against him in return for a full pardon and money from the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The capture of Mercurial Swift appears at the exposition of Chuck Wendig's Aftermath: Empire's End, the third book in Star Wars: The Aftermath Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}