{"url": "Capture_of_Kalast", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Capture of Kalast"}, {"tag": "p", "text": "The final battle in a long search for the Imperial traitor Kalast saw the Empire capture the traitorous Moff. Kalast has stolen datacodes for the Galactic Empire's superweapon, the Death Star I, which had enough power to destroy entire worlds, for which the Empire sought his capture and punishment."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The search started on Thyferra, where Kalast was commanding a Rebel outpost. He escaped from the destruction of the base due to a miscalculation made by a commanding Field Commander."}, {"tag": "p", "text": "After putting down the Invasion of Fondor that occurred during the Imperial Army's absence from the planet, Darth Vader hired Boba Fett to take down the defenses around Ilum, where native pirates supplied Kalast with weapons."}, {"tag": "p", "text": "After gathering information from the Pirate leader, the Empire attacked a Rebel Jabiim support unit during a battle at Jabiim, where information was gathered that Kalast owned a Rebel estate over Atzerri. Upon the Arrest over Atzerri, the rogue Imperial fled. Darth Vader and Palpatine started a series of scouting missions across the galaxy with a fleet including Immobilizer 418 cruisers to capture Kalast once and for all."}, {"tag": "h2", "text": "The Hunt"}, {"tag": "p", "text": "The Imperial Navy engaged the Rebel Alliance Fleet in a string of battles around the galaxy, from Shola to Dantooine to Nal Hutta, destroying several Alliance Space Stations in a determined attempt to find him. They were able to pin Kalast down several times, but failed to effect his capture. After several battles, the final battle commenced which would bring the search for Kalast to an end."}, {"tag": "h2", "text": "The capture"}, {"tag": "p", "text": "Darth Vader found one of Kalast's last remaining strongholds. The Immobilizer 418 cruisers were activated, preventing his escape. As the fleet exchanged fire, combat ships ambushed Kalast's flagship, the Avenger, and destroyed its shields and other weak points. The vessel thus crippled, an Imperial-I-class Star Destroyer swooped in and caught Kalast in its tractor beam, taking the Avenger back intact as well."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The capture of Kalast would lead to the obtainment of key Rebel information, including the details on the Bothans aiding Kalast in his spying, which would lead to many Bothans dying because of this information. Regardless, the damage was done, and Kalast's efforts ultimately were contributory towards the Rebels destroying the Death Star."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was the tenth mission of the Imperial campaign in the 2006 video game Star Wars: Empire at War. The actual locations and number of intermittent skirmishes can vary widely based on how many systems the Imperial player holds at this point in the campaign. If, for example, the Imperial held every system save for Atzerri, only a single battle over the same system would be required. On the other hand, if several systems were left under Rebel control, catching Kalast would prove very difficult as he could jump between several systems, perhaps very far apart. If, however, the Empire has already conquered every available planet, a bug in the game happens: Kalast's fleet appears in orbit of Coruscant and the Imperial space station there changes to rebel control, making the fight against him difficult if it is of high level."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}