{"url": "ABP-980_bio-light_panel", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Ferisoliq Imports, Ltd. products", "Category:Illumination devices"], "nodes": [{"tag": "h1", "text": "ABP-980 bio-light panel"}, {"tag": "p", "text": "The ABP-980 bio-light panel, also known as the Aqualish bio-light panel, was a model of Aqualish lighting fixture produced by the company Ferisoliq Imports, Ltd. It used plankton to produce fluid lighting, the emittance of which could be altered through manipulation of a stud on the panel. As an additional safety feature, the panel would dim if something was wrong with the local atmosphere. The device was sold by Galladinium Galactic Exports for 250 credits."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Designed for use in the workplace, the ABP-980 bio-light panel was associated with the Aqualish species—leading it to also be known as the Aqualish bio-light panel—and consisted of a rectangular tank which measured one meter high by two meters long. Inside the tank, photo-chemical reactive plankton, a type of microscopic plant, lived in a controlled liquid environment. These plankton would produce light if exposed to a variety of common gases, which included carbon dioxide, nitrogen, and hydrogen. The gas filters in the tank could be controlled through the manipulation of a recessed stud built into the outer edge of the tank's frame, which allowed the amount of light emitted to be changed. The panel would produce constantly changing patterns of fluid lighting, and the model was considered functional, artistic, and a statement of good taste. Due to the plankton's reaction to chemicals and gases, if a panel dimmed of its own accord, it was a signal that something was wrong with the local air supply. This reaction acted as an additional safety feature in the product."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The light panel was produced by the company Ferisoliq Imports, Ltd. At some point between the Battle of Yavin and the Battle of Hoth during the Galactic Civil War fought by the Galactic Empire and the Alliance to Restore the Republic, the technological supply company Galladinium Galactic Exports sold the panels through its product datalog for 250 credits, describing them as the latest in bioluminescence. The panels were frequently available in large cities and spaceports."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ABP-980 bio-light panel was shown as buyable equipment in Galladinium's Fantastic Technology, a sourcebook released in April 1995 by West End Games for Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}