{"url": "Carbon-freezing/Legends", "categories": ["Category:Legends articles", "Category:Technology stubs", "Category:Carbon freezing technology", "Category:Stasis technology"], "nodes": [{"tag": "h1", "text": "Carbon-freezing"}, {"tag": "p", "text": "Carbon-freezing was the process of freezing stored tibanna gas in carbonite to preserve it while it was being transported over long distances."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "In the freezing process, the gas was pumped into a freezing chamber where it was mixed with molten carbonite into a solid block. The gas was released later at its destination or at the processing center."}, {"tag": "p", "text": "Darth Vader ordered the modification of a freezing chamber on Bespin's Cloud City so that he could freeze Luke Skywalker—eliminating any chance of escape—to transport him to the Emperor. As a test, the process was tried on Han Solo, who survived the freezing process through the use of a special device and was eventually freed from his trap. Other people unfortunate enough to be frozen in carbonite include Trioculus, Antares Draco, Chihdo, Czethros, Keto, Roni von Wasaki, Sintas Vel, Valin and Jysella Horn, Savage Opress, Grees, Lorn Pavan, Mathal, and The Outlander."}, {"tag": "p", "text": "During the Galactic Civil War, a large number of Sith Troopers and possibly a Sith Master, frozen in carbonite, were discovered by the Nightsister Silri with the help of a Sith holocron stolen from Jabba the Hutt by Tyber Zann."}, {"tag": "p", "text": "Additionally, bodies were sometimes preserved in carbonite, as in the case of the Senatorial Tombs on Coruscant."}, {"tag": "p", "text": "Carbon-freezing could induce hibernation sickness after being released, as was the case with Han Solo. The Alderaanian Medical Association established that inhaling carbon-freezing smoke was a health risk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}