{"url": "Carbon/Legends", "categories": ["Category:Legends articles", "Category:Elements"], "nodes": [{"tag": "h1", "text": "Carbon"}, {"tag": "p", "text": "Carbon (C) was a nonmetallic element. It was the primary element in most of the sentient life of the galaxy, including Humans and most humanoid races. Carbon was used in the manufacture of such substances as duraplast, durasteel, carbonite, and carbon dioxide. It could be found in naturally occurring crystal form as diamonds. It was also found in wood and tibanna."}, {"tag": "p", "text": "Carbon atoms bonded with many other elements, and were able to form long molecular chains and rings, the backbones of organic molecules. The only possible rival for the role of carbon in biology was silicon, which shared some of the same properties of carbon. However, silicon could only bond with two other atoms, whereas carbon could bond with up to four other atoms at once. Therefore, most lifeforms in the galaxy were carbon-based, while silicon-based lifeforms were extremely rare, one example being the crystalline Tsil of Nam Chorios. According to a droid, all sentient carbon-based lifeforms could drink water."}, {"tag": "p", "text": "In order to manufacture building-grade duraplast, carbon had to be extracted using droid or organic workers, mostly from trees, such as oak trees or barren trees, and other local resources, including carbon rocks. The mined carbon could then be dropped off for processing at command centers and carbon processing centers. This could be accomplished by logging and extracting carbon from timber, or by mining coal or carbon-heavy rocks."}, {"tag": "p", "text": "Carbon residue or scoring was left behind when an object was struck by a blaster bolt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Carbon was used as a bountiful resource for creating troops and vehicles in the 2001 video game Star Wars: Galactic Battlegrounds and its 2002 expansion pack Clone Campaigns."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}