{"url": "Carbonite/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Carbon freezing technology", "Category:Compounds", "Category:Metals"], "nodes": [{"tag": "h1", "text": "Carbonite"}, {"tag": "p", "text": "Carbonite was a metal alloy that was made from carbon. It was mixed with tibanna gas, compressed, and flash-frozen into blocks for transportation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Empress Teta system was a source of carbonite. The discovery that carbonite could be used to freeze spacers for their long journeys among the stars put an end to the generation ships. Koros Major became a boomworld and one of the strongholds of the Mining Guild."}, {"tag": "p", "text": "The planet of Polus also had vast quantities of the metal alloy in its frozen wastelands. The inhabitants of Polus played a major role in the freezing process and mining."}, {"tag": "p", "text": "There were numerous times when individuals encased themselves in carbonite. In 33 BBY, a year before the Trade Federation invaded Naboo, I-5YQ froze himself and Lorn Pavan in carbonite to survive an explosion set off by Darsha Assant during her duel with Darth Maul. Sometime during the Clone Wars, Jedi Knight Anakin Skywalker encased himself and his team in carbonite to be sent undetected to the planet Gwori, and later used this method on another mission."}, {"tag": "p", "text": "Filba used carbonite for smuggling bota harvested on Drongar during the Clone Wars to preserve its quality. Some of Coruscant's skyhooks were tethered to the surface with carbonite nanofiber."}, {"tag": "p", "text": "In some locales, carbonite was also used to preserve the bodies of the dead. On Coruscant, Senator Viento was buried in this manner in the Senatorial Tombs. Han Solo was frozen in carbonite on Darth Vader's orders to test whether a Human could survive Bespin's freezing process before his plan to freeze Luke Skywalker. The modifications to the freezing chamber were successful in that Solo lived through the freezing process and entered into suspended animation. This state also served as an art piece of Vader's creation. Boba Fett dubbed it, \"Man in Carbonite\", enticing Jabba to pay a significantly higher price for Solo. Savage Opress also became a subject of art in this manner prior to his death. Moruth Doole froze the body of the former warden of the Kessel prison system in carbonite in his office as a trophy. While imprisoned in carbonite, a Force user could not use the Force, or interact with it on any significant level, making it a useful Jedi containment tool. A common part of a hyperdrive was a carbonite insert."}, {"tag": "p", "text": "The usage of carbonite was obvious even for military purposes and carbonite guns were made, used to spray a target in carbonite to freeze and paralyse the enemy. Those existed since during the time of the Old Republic, while early in the Galactic Civil War, the Galactic Empire used Carbonite war droids. There was at least one case of Carbonite war droids spraying an entire village in carbonite. During the time of the Second Galactic Civil War, Boba Fett and Mirta Gev discovered that Fett's wife, Sintas Vel, had not died, but had been imprisoned in carbonite. The usage of such carbonite-based weapons continued through the Civil War."}, {"tag": "p", "text": "In 43.5 ABY, just a couple of years after the end of the Second Galactic Civil War, Chief of State Natasi Daala utilized carbonite to imprison violent Jedi that were succumbing to a mysterious Force psychosis. Carbonite was seen as the only means to contain the Jedi due to the relatively safe incapacitating effect of carbonite encasement. There were some Force-sensitive beings that could break free of carbonite restraints, however, including Galen Marek and his clone."}, {"tag": "p", "text": "Imperial Knight Antares Draco was frozen in carbonite in 138 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This substance should not be confused with the real-world coal-mining explosive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}