{"url": "Cardan_II-class_space_station", "categories": ["Category:Legends articles", "Category:Cardan-class space station models", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Cardan II-class space station"}, {"tag": "p", "text": "The Cardan II-class space station was the second model of Cardan-class space station built for the Galactic Empire. These stations were nearly identical to the Cardan I-class but added a vertical section attached to the bottom of the space station which provided more space for weapon emplacements and capital ship construction bays."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "These stations supplemented the Cardan I-class due to those predecessors' relatively poor defensive systems. Cardan II-class stations were placed in areas of moderate importance but nonetheless could still be overwhelmed by a small force of corvettes and frigates."}, {"tag": "h2", "text": "Armament"}, {"tag": "p", "text": "The Cardan II was more able to defend itself due to more room and power for additional weapons. It carried three light turbolaser batteries, three point-defense light ion cannon batteries, two proton torpedo launchers, and two tractor beam projectors. It also had more hangar space than its forebear, and could hold twenty-four starfighters. Each station could also hold four shuttles"}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "The Cardan II supplemented older models, and was sometimes seen accompanied by starships up to 650 meters long."}, {"tag": "h2", "text": "Construction options"}, {"tag": "p", "text": "The Cardan II could retain its predecessor's capabilities whilst opening up new possibilities to construct capital ships. The expanded bays of the improved station could construct two new TIE models: the TIE/sr starfighter and, potentially, the TIE Phantom, although no station actually built these. The larger construction bays allowed for more independence from more large-scale shipyards such as Kuat. Two classes of patrol vessels were taken into consideration when Kuat Drive Yards began plans for expanding the Cardan I-class space station. The Tartan-class patrol cruiser was the first option, with the second being the more-or-less outdated Acclamator II-class assault ship."}, {"tag": "h2", "text": "Appearances"}]}