{"url": "Cardo", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Character stubs", "Category:Incomplete lists", "Category:Humanoids", "Category:Knights of Ren", "Category:Males"], "nodes": [{"tag": "h1", "text": "Cardo"}, {"tag": "p", "text": "Cardo was a Force-sensitive humanoid male who served as a member of the Knights of Ren, under the command of an individual known as Ren. Cardo, alongside Albrekh, tended to the weapons and armor of the Knights."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A short time after the hunt for Rey, Cardo  and the other Knights of Ren were lurking in the Sith Citadel of Darth Sidious on Exegol. During the battle of Exegol, Kylo Ren, now the redeemed Ben Solo, entered the Citadel in an attempt to kill Sidious."}, {"tag": "p", "text": "Before Solo could reach the Throne of the Sith, Cardo and the Knights confronted their former leader. The Knights were able to swiftly overwhelm Solo in his unarmed state, forcing him to the ground and beating him. However, through the use of their Force-bond, Rey was able to give Solo his grandfather's lightsaber. With Anakin's lightsaber, Ben swiftly cut down Kuruk before slashing Cardo across the chest with his saber."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Cardo was Force-sensitive and an adept of the dark side of the Force but was untrained in the Force which resulted his powers being stunted. As a Knight of Ren, Cardo displayed great martial prowess few could match."}, {"tag": "p", "text": "Unlike his fellow Knights, who preferred precision based attacks, Cardo's approach left large swathes of destruction. His arm cannon packed more than enough firepower for a single soldier, effectively turning him into a walking turret. Cardo was obsessed with weapon modification, which made him the best armorer among the Knights, alongside their Symeong ally Albrekh."}, {"tag": "p", "text": "Despite his great skill, Cardo was the second to fall, easily killed from a slash across the chest by his redeemed former leader, Ben Solo, during the Battle of Exegol."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Cardo was obsessed with weapons and weapon modifications, as such he was the most heavily armed member of the Knights of Ren. His primary weapon was a custom arm cannon, which incorporated three weapons into one: a rapid-fire repeating Laser blaster, a Plasma bolt launcher that could fire explosive charges over 200 meters, and a Flamethrower that fired naphthex gel."}, {"tag": "p", "text": "He also carried a blaster pistol in a holster around his waist, which he primarily used as a sidearm. Finally, Cardo carried concussion grenades strapped to his chest."}, {"tag": "p", "text": "Like the rest of the Knights, Cardo wore black clothing, including a flame-resistant Riftiaworm-hide coat and tri-braced plasteel-armored greaves. Cardo's helmet had the most basic design out of any of the Knights' helms, consisting of a blast furnace plate molded into a helmet shape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cardo was played by stunt performer Martin Wilde in the 2019 movie Star Wars: Episode IX The Rise of Skywalker, in the 2019 film Star Wars: Episode IX The Rise of Skywalker,  although the character is only listed as \"Knight of Ren\" in the movie's credits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}