{"url": "Caretaker_of_the_Lost_Souls", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Cult of Exar Kun", "Category:Unidentified females", "Category:Unidentified Force-users", "Category:Unidentified humans"], "nodes": [{"tag": "h1", "text": "Caretaker of the Lost Souls"}, {"tag": "p", "text": "The Caretaker of the Lost Souls was a dark side Force user who was an unwilling follower of Exar Kun."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Before becoming an unwilling follower of Exar Kun, the Caretaker of Lost Souls was a student at Corellia University, and may have been a member of an archeological expedition on Yavin 4 in 1 ABY that unknowingly tunneled into the tombs below the Temple of Exar Kun and released the Sith Lord's spirit. The evil spirit proceeded to bind the students and researchers to his will, and induct them into the Cult of Exar Kun. Afterward, he sent them to Talus, to the Corellia University research outpost they had originally come from to enslave the rest of the people there. The majority of them were then sent back to Yavin 4. After losing contact with the outpost and fearing the worst, Professor Cornelius Wagglehorn hired a group of spacers to travel to Talus and investigate."}, {"tag": "p", "text": "After arriving at the research outpost and discovering what had happened, the spacers informed the professor. He sent them the location of the tomb and implored them to travel there and destroy the malevolent spirit. The Caretaker was the third major enemy the spacers faced within the tomb, having previously defeated the Open Hand of Hate and the Minder of Weak Wills. Once she noticed the group, the Caretaker sealed the chamber and sent her minions after them, three at a time. During the battle, a few of the Caretaker's prisoners, fellow students who had yet to succumb to Exar Kun's will, managed to assist in weakening the Caretaker, until she was forced to take matters into her own hands. She surrounded the room in a thick green fog and proceeded to deliver bolts of force lightning to the bodies of the spacers from the middle of the room, while shielding herself from any direct melee attacks. After a long and arduous battle, with the spacers trying desperately to both escape the fog and kill the woman electrocuting them, the spacers stood triumphant over the Caretaker's corpse, her spirit finally free of Kun's wretched grasp. The spacers then continued on through the tomb, until they met the Clenched Fist of Hate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Caretaker of the Lost Souls is a \"boss\" enemy NPC in the Temple of Exar Kun Heroic Encounter in Star Wars Galaxies: An Empire Divided. She is the third encounter in the instance, coming after the Open Hand of Hate and the Minder of Weak Wills. Due to the nature of the game, the Caretaker's physical appearance changes every time she is encountered by the player. She is consistently a human female and wearing the black robe, however. The Star Wars Galaxies Trading Card Game later provided a canonical depiction of the Caretaker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}