{"url": "Carib_Diss", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Bounty hunters", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Carib Diss"}, {"tag": "p", "text": "Carib Diss was a male bounty hunter. The sensory organs of Diss' species were situated behind an array of large teeth, meaning that in order to see, he had to grimace. His unsettling appearance intimidated most others, so Diss wore a sensor dome atop his head, helping him to gather data about his surroundings."}, {"tag": "p", "text": "He owed the Spice Runner Vicii a favor after receiving aid from him in the capturing of a bounty. In 35 ABY, he was present at the Spice Runners' Den in Kijimi City on the planet Kijimi shortly before the world was destroyed by the Final Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Carib Diss was a male bounty hunter who was an inhabitant of Kijimi City on the planet Kijimi during its occupation by the First Order. With aid from the Spice Runner Vicii, he collected a bounty during this period that Vicii considered pretty, leaving him owing a favor to the Spice Runner. The following week, in 35 ABY, Diss sat at a table by the bar of the Spice Runners' Den with another alien and a human who was patting his back when a group of Resistance agents were led through the room by Zorii Bliss, leader of the Spice Runners."}, {"tag": "p", "text": "The presence of the Resistance agents on the planet led to a lockdown of Kijimi City by the First Order, which began rounding up the city's inhabitants for questioning. When the Spice Runners began planning to flee Kijimi to escape the First Order, Vicii informed the group about the favor that Diss owed him, stating that the bounty hunter could carry three of them as passengers aboard his starship. Shortly afterward, the First Order evacuated its personnel from Kijimi before the entire planet was destroyed by its allies in the Final Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Carib Diss was a terrifying bounty hunter and unsettling in appearance due to his species' odd arrangement of sensory organs. The photosensitive orbs he used to see, the vibrating cilia that he used to hear, and his smell receptors all lined a uvula-like bulb that hung from the roof of his large mouth. In order to see, he had to grimace and reveal his sharp teeth, which intimidated most humanoids. Diss had gray skin and was aware that he needed to clean his teeth more often."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In order to reduce the amount of time he needed to spend with his mouth agape, Diss wore a custom-made sensor dome on top of his head as a cap that could gather data about his surroundings. He wore gray-and-orange armor over a brown jacket, gray pants, and brown gloves and boots. On his right arm, he wore a Mandalorian rocket gauntlet loaded with whistling birds. Diss also owned a ship capable of carrying three passengers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Carib Diss was created for the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified by name in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. Concept art of Diss for the film, titled \"Wizard 41,\" was created by creature concept designer and senior sculptor Ivan Manzella."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}