{"url": "Carilla", "categories": ["Category:Legends articles", "Category:Cularin residents", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Carilla"}, {"tag": "p", "text": "Carilla was a female Human who operated the shop Carilla's Catering and Wedding Planning in the city Hedrett on the planet Cularin. In about 31 BBY, the senator for Cularin, Lavina Wren, announced that she was getting married, and, in an attempt to profit from the event, Carilla hired some teenagers to paint graffiti on the walls of buildings in Hedrett and the city Forard on the planet Almas that denounced the wedding. Carilla then hoped to intervene and \"catch\" one of the vandals in the act, so that she could launch a series of commercials for her business in which she claimed that she had saved Wren's wedding. Unknown to Carilla, the bounty hunter Melo Centris also sought to disrupt the wedding, planning to assassinate the groom, former Jedi Jarid DeBell, and she attempted to set Carilla up to take the blame for her upcoming hit. To that end, Centris dispatched some Devaronian thugs to Carilla's shop to shoot the wedding planner, in an attempt to make it appear that Carilla was involved in organized crime and had made herself worthy of assassination. Carilla was subsequently hit by a blaster bolt that was fired by one of the Devaronians, leaving her grievously injured."}, {"tag": "p", "text": "The Heroes of Cularin, a band of freelance agents who were investigating the threat to Wren's wedding, intervened and administered medical assistance, saving Carilla's life. When she recovered, Carilla reacted in an over-dramatic manner to her attempted murder and she convinced herself that her attackers had sought to try and take over her business."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Carilla made her only appearance in Star Wars canon in An Official Engagement, a role-playing adventure written by Morrie Mullins that formed part of the Living Force campaign. During the adventure, when Carilla is shot by the Devaronians it is possible either for her to die or for the player characters—who role-play as the Heroes of Cularin—to intervene and save her life."}, {"tag": "h2", "text": "Appearances"}]}