{"url": "Cariso_Smadis/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alliance Fleet officers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Cariso Smadis"}, {"tag": "p", "text": "Ensign Cariso Smadis was a Human male trooper and marine in the Rebel Alliance Fleet. In 0 BBY, he was stationed aboard the Alliance CR90 corvette Tantive IV, the consular ship of Princess Leia Organa of Alderaan, as it carried recently stolen technical data to the Galactic Empire's Death Star battlestation. Smadis fought to defend the Tantive IV from a stormtrooper boarding party attached to the Dark Lord Darth Vader's pursuing Imperial Star Destroyer Devastator above the planet Tatooine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Cariso Smadis served the Alliance to Restore the Republic as an Alliance Fleet trooper and marine during the Galactic Civil War between the Alliance and the Galactic Empire. By 0 BBY, Smadis had attained the rank of ensign. That year, he was one of the Rebel troopers stationed aboard Alderaanian Princess Leia Organa's CR90 corvette, the Tantive IV, when Rebel spies transmitted data to her vessel containing the plans for the Empire's Death Star superweapon."}, {"tag": "p", "text": "The Tantive IV's possession of the plans led to its pursuit and overtaking by the Dark Lord of the Sith Darth Vader's Imperial I-class Star Destroyer Devastator in the Tatooine system. Smadis and his fellow soldiers took defensive positions in the corvette's corridors before engaging an invading stormtrooper boarding party. The skirmish ended in victory for the Empire and resulted in Organa's capture. However, the Rebel droids C-3PO and R2-D2 evacuated the Tantive IV amidst the fighting with the Death Star plans in tow."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rebel Marines like Smadis were trained for combat on starships, either to repel invaders or to board ships. Smadis was driven by bravery and a belief in the Alliance's ideal of freedom. He had brown hair, brown eyes, and fair skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Smadis wore the standard uniform for Alliance Fleet troopers during the Tantive IV battle. He was armed with a DH-17 blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cariso Smadis first appeared as one of the Rebel troopers aboard Tantive IV in the opening battle of the 1977 film Star Wars: Episode IV A New Hope. He was played by an uncredited extra, whose scenes were filmed in mid 1976 in the United Kingdom. Smadis was first named in the April 30, 2007 third chapter of StarWars.com's Visual Guides feature, which provided a behind-the-scenes look at A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}