{"url": "Carlist_Rieekan", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Alderaanians", "Category:Alliance Army generals", "Category:Alliance High Command personnel", "Category:Galactic Republic military personnel", "Category:Humans", "Category:Males", "Category:New Republic Army generals", "Category:Resistance admirals and generals"], "nodes": [{"tag": "h1", "text": "Carlist Rieekan"}, {"tag": "p", "text": "Carlist Rieekan was a human male military officer who served as a General in the Alliance to Restore the Republic and the military leader of the Rebellion's base on Hoth."}, {"tag": "p", "text": "Years later, after the battle of Crait, Rieekan came to aid the Resistance on Ryloth."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Joining the rebellion"}, {"tag": "p", "text": "A human male from the planet Alderaan, Carlist Rieekan served in the military of the Galactic Republic during the Clone Wars and later earned a post in the Royal House of Alderaan. Later in his career, Rieekan became a founding member of the Alliance to Restore the Republic. Rieekan was off-world when Alderaan was destroyed. He later attained the rank of General and assumed command of Echo Base on the ice planet of Hoth."}, {"tag": "h3", "text": "Battle of Hoth"}, {"tag": "p", "text": "In 3 ABY, General Rieekan summoned Princess Leia Organa, Han Solo, and Chewbacca to the base's command center to discuss some signals that his staff had intercepted. After the protocol droid C-3PO recognized the signal as an Imperial code, Han and Chewbacca ventured outside, where they discovered and destroyed a Viper probe droid. However, Han deduced that the probe droid had already alerted the Galactic Empire to their presence and warned General Rieekan to order an evacuation of Echo Base. During the Battle of Hoth, General Rieekan commanded the rebel evacuation of Echo Base."}, {"tag": "h3", "text": "Alliance Fleet"}, {"tag": "p", "text": "After the evacuation of Hoth, he was present with the other leaders of the Alliance on Zastiga to develop a plan to attack the second Death Star. Later, General Rieekan was stationed aboard the Mon Calamari cruiser Liberty. He commanded several Alliance forces, including the X-wing starfighter squadron Corona Squadron. Following the disappearance of both the Millennium Falcon and Luke Skywalker, General Rieekan summoned an emergency conference of senior officers including the starfighter pilot Wedge Antilles."}, {"tag": "p", "text": "The following morning, General Rieekan and Chancellor Mon Mothma officiated over a briefing for members of the Corona Squadron including Private Yendor, Lieutenant Thane Kyrell, and Kendy Idele. After Mothma informed Corona Squadron that they would not be accompanying the rest of the Alliance Fleet to the new rendezvous point, Rieekan briefed the pilots that their squadron would be based on the Liberty for the foreseeable future. He added that they would get permanent bunk assignments within the next few hours. Yendor then joked about living in a sauna, prompting the General to ask the pilot to clarify his statement. While the others laughed, Rieekan smiled."}, {"tag": "p", "text": "After Thane Kyrell returned from a secret meeting with his friend Ciena Ree, who was still a commissioned officer in the Imperial Navy, General Rieekan thanked Thane for his timely return two hours prior to takeoff. When Thane volunteered to report his movements during his absence, Rieekan reassured the pilot that he was free to come and go as he pleased as long as he followed security protocol. However, Rieekan was visibly displeased when Thane informed him that he had made contact with an Imperial officer. When Rieekan inquired whether Ciena was aware that Thane had already joined the Rebellion, Thane admitted that she already knew of his involvement with the Rebel Alliance."}, {"tag": "p", "text": "Angered by Thane's apparent failure to follow security protocol, Rieekan demanded to know whether the rebels had a double agent feeding the Empire intelligence. Thane reassured General Rieekan that Ciena had identified him based on Imperial battle footage from Hoth. While Rieekan accepted Thane's explanation, he still asked whether the officer had placed a tracking device on his X-wing starfighter. While Thane vouched for Ciena's friendship, Rieekan still insisted on scanning his ship. Before leaving the hangar, Rieekan warned Thane not to make any more contact with Imperial personnel and added that the galaxy was full of women who did not fight for the Empire."}, {"tag": "h3", "text": "New Republic service"}, {"tag": "p", "text": "General Rieekan continued serving the Rebel Alliance's successor government, the New Republic, and its military. To bolster the expanding New Republic Defense Fleet, Rieekan embarked on a plan to capture Imperial Star Destroyers during the Battle of Jakku. For this mission, General Rieekan recruited the former Imperial officers Thane and Kendy. Despite their misgivings, he reassured them that the Imperial crews were not as die-hard as they used to be and pointed out that they had seen capital ships as large as attack cruisers switch allegiance in earlier battles during the Galactic Civil War. When Thane pointed out that those ships had thousands of crew members as opposed to tens of thousands, Rieekan responded that they needed enough sympathizers to help them shut the systems down. He added that former Imperial officers like Thane and Kendy could identify the most vulnerable areas."}, {"tag": "p", "text": "Thane and Kendy later boarded the Imperial Star Destroyer Inflictor, which was being commanded by the now Captain Ciena Ree. Despite their efforts to disable the ship' self-destruct mechanism, Ree managed to deny the ship to the New Republic by crashing it on Jakku's surface. Meanwhile, the Battle of Jakku ended as a decisive victory for the New Republic which brought the end of the Galactic Civil War. The defeated remnants of the Empire were forced to sign the Galactic Concordance with the New Republic, which became the dominant government in the galaxy for the next twenty-nine years."}, {"tag": "h3", "text": "Ally of the Resistance"}, {"tag": "p", "text": "Decades after the Galactic Concordance, the Resistance awarded the Rieekan Ribbon for Bravery in Battle to Poe Dameron for rescuing Admiral Gial Ackbar. In the days following the Battle of Crait in the war between the First Order and the Resistance, Rieekan answered Leia's call for help, who was now a general in the Resistance. He was brought to the planet Ryloth by Zay Versio and Shriv Suurgav during the Longest Night holiday, accompanied by Rebel Alliance strategist Orrimaarko, alongside numerous ships. Reuniting with Leia after thirty years at a Ryloth Defense Authority base, Rieekan received a warm welcome from the general. While chatting with her, he introduced Orrimaarko, who was a strategist during the Battle of Endor. Later on, Rieekan was gathered alongside several other individuals by Leia for a meeting in a library that was converted into a war room, which was owned by Yendor, who once served the New Republic with Rieekan."}, {"tag": "p", "text": "During the meeting, the Resistance's next strategies were discussed. Rieekan assured Leia that others would arrive to support the Resistance after they had called their allies from Crait. He then asked if the rumors of the First Order rounding up Resistance sympathizers were true, and speculated that the First Order may not have the infrastructure required to house the prisoners. Norra Wexley, another member of the Resistance, replied that they did as they regime had increased in size greatly over time. As the Resistance members continued discussing, Maz Kanata contacted the group via a hologram, informing everyone about a list of prisoners detained in Coronet City on the planet Corellia that she had seen parts of, and that the full list itself was scheduled to be auctioned at a party in the city. Rieekan questioned the validity of the list. Pilot Poe Dameron interjected stating that the people on the list were being detained unjustly. Leia, however, supported Rieekan's point, saying that more information was required before a decision was to be made."}, {"tag": "p", "text": "As Kanata explained the auction, Rieekan suggested that they should view the names on the list before committing to a strategy, and requested that Kanata send over the partial list to the Resistance. When they received the list, Leia noticed a name with the initials \"R.C.\" and was relieved to learn that it was her old political partner, Ransolm Casterfo, detained for political crimes. However, Rieekan believed that the location of the prisoners matching with the location of the auction was potential bait to lead the Resistance into a trap on Corellia. He then asked Leia who Casterfo was, who replied that someone she thought had died sometime ago."}, {"tag": "p", "text": "Sometime later, the Ryloth government had revealed the Resistance's location to the First Order, and the base where Leia and the others were stationed was subsequently attacked. Rieekan and several others fled to their respective ships, their escape covered by Yendor and the Ryloth Defense Authority. After the Resistance successfully escaped the planet and arrived at their new base whose location was provided by the Collective underground organization, Rieekan and Leia operated the war room as the Resistance prepared for their next move."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Carlist Rieekan was a gruff and stern Rebel Alliance general who took his duty and work seriously. Despite his stern and businesslike demeanor, General Rieekan could still appreciate humor, as shown when the pilot Yendor likened the starship Liberty to a sauna. Rieekan was a flexible commander who allowed his men to come and go as they pleased as long as they followed the Alliance's security protocols. Rieekan regarded the Alliance military as a volunteer force."}, {"tag": "p", "text": "As a committed rebel, Rieekan had a strong antipathy towards the Empire and Imperials in general. Rieekan expressed disappointment and anger when one of his subordinates, Thane Kyrell, fraternized with his former classmate Ciena Ree, a commissioned officer in the Imperial Navy. Despite accepting Thane's report that Ciena did not pose a threat to the Rebellion, he disapproved of their relationship and told Thane that he could choose other women who did not fight for the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "General Rieekan was portrayed by Bruce Boa in Star Wars: Episode V The Empire Strikes Back. His backstory was expanded in several Star Wars Legends works. More recently, Rieekan has appeared as a supporting character in the canon novels Lost Stars and Moving Target: A Princess Leia Adventure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}