{"url": "Carlist_Rieekan/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Alderaanians", "Category:Alliance Army generals", "Category:Alliance High Command personnel", "Category:Bureaucrats", "Category:Galactic Alliance admirals and generals", "Category:Humans", "Category:Judicial Forces officers", "Category:Males", "Category:New Republic Army generals", "Category:New Republic bureaucrats", "Category:New Republic High Command personnel", "Category:Republic Army officers", "Category:Task Force on Alliance Security personnel"], "nodes": [{"tag": "h1", "text": "Carlist Rieekan"}, {"tag": "p", "text": "Carlist Rieekan was an Alderaanian general who, throughout his life, served the Galactic Republic, the Alliance to Restore the Republic, the Alliance of Free Planets, the New Republic, and the Galactic Federation of Free Alliances. He joined the Republic's Judicial Forces at the age of seventeen before serving in the Army of the Republic during the Clone Wars. With the advent of Supreme Chancellor Palpatine's ascension to Emperor and the installment of the Galactic Empire in 19 BBY, Rieekan immediately rejected the new regime. Instead, he chose to serve the Royal House of Alderaan as a civilian tactician, before becoming one of the founding members of the Alliance to Restore the Republic, a rebellion against the rule of the Emperor."}, {"tag": "p", "text": "When the Imperial Grand Moff Wilhuff Tarkin brought the Death Star superweapon to bear on Alderaan, Rieekan was at nearby Delaya. He received a massive influx of distress calls and requests for evacuation, but hesitated to aid Alderaan, as he felt that his involvement would have implicated Alderaan at large as having ties to the illegal rebellion movement. Within minutes, Tarkin's battlestation fired its superlaser, destroying Alderaan in flash. Rieekan was shattered, and blamed himself for the disaster, as he felt his hesitation had cost many Alderaanians their lives. The incident took its toll on Rieekan, as he became an overly morose and paranoid man."}, {"tag": "p", "text": "He was later tasked with command of the Alliance's Echo Base on Hoth, and also worked closely with the pilot Luke Skywalker's Rogue Squadron unit. Over the years, Rieekan collaborated with the Alderaanian princess, Leia Organa, and his insistence on thorough security and evacuation measures after the destruction of his homeworld proved instrumental to the Alliance when Lord Darth Vader's Death Squadron moved against Echo Base. Rieekan later oversaw Haven Base on Arbra, and would go on to serve as Minister of State and Director of Intelligence for the New Republic, the Alliance's successor state. The general eventually retired, only to be brought back into service during the Yuuzhan Vong War, during which he aided in the failed defense of Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "Carlist Rieekan grew up on the peaceful world of Alderaan and left at the age of seventeen to join the Galactic Republic's Judicial Forces, which was an unusual choice for an Alderaanian. Demonstrating strong leadership skills, Rieekan quickly rose through the ranks and joined the Officer Candidate School. There, he befriended other idealists such as Jan Dodonna, Adar Tallon, and Crix Madine. He later came to serve in the Army of the Republic, where his keen grasp of tactics and, once again, his leadership skills impressed his superiors."}, {"tag": "p", "text": "When Supreme Chancellor Palpatine declared himself Emperor in 19 BBY and transformed the Republic into the Galactic Empire, Rieekan chose to stick to his beliefs and refused to serve the new regime. He instead served the Royal House of Alderaan as a civilian tactician, and then helped found the Alliance to Restore the Republic, an organization dedicated to throwing off Palpatine's hold on the galaxy. In his new role, Rieekan found himself once again amongst like-minded individuals, many of them hailing from Alderaan."}, {"tag": "h3", "text": "The destruction of Alderaan"}, {"tag": "p", "text": "Rieekan found himself surprised that the Royal House of Organa, rulers of his home planet and vocal pacifists, were themselves allied with the Alliance. He was pleased to find out that Viceroy Bail Organa and his daughter, Princess Leia Organa, were actually members of the Rebellion. Rieekan felt the need to keep his connection to the Alliance secret, but was subsequently placed in charge of covert operations in the Alderaan system. In 0 BBY, he found himself personally inspecting a new satellite transmission station that was in orbit over Delaya, a sister planet of Alderaan. During his inspection tour, the Empire's new superweapon, the Death Star, entered the system, causing mass panic on Rieekan's homeworld. He was hard-pressed to keep up with the flood of incoming calls, requesting evacuation and aid, but there was no weapon capable of disabling or halting the superweapon."}, {"tag": "p", "text": "Furthermore, Rieekan felt that a mass evacuation would show the Empire that the people of Alderaan were aware of the Death Star's ability to destroy entire planets. With that in mind, Rieekan decided to sit tight and hope that the Death Star's presence was just a bluff. Within minutes, however, the Death Star's superlaser was activated and fired at Alderaan, completely obliterating the planet. Thrown into a state of despair and guilt, Rieekan resolved to never underestimate just how far the Galactic Empire would go again. Since there was little he physically could do, Rieekan blamed himself for the catastrophe. Some time after the incident, Rieekan was promoted to the rank of General."}, {"tag": "h3", "text": "General"}, {"tag": "p", "text": "Following the destruction of the Death Star at the Battle of Yavin, Rieekan began assisting various refugee movements across the Alderaan sector, bringing them to Delaya. The general specifically operated in the capital city of Leilani, and was assisted by a young man named Kiro Chen, who hoped to join the Alliance. The planet itself had began to suffer—as the Alderaanians had decided to move all of their industry off their home planet and onto Delaya itself, the planet's income stemmed primarily from exports to Alderaan itself. Compounding the problem was the fact that new factories had been built recently, which worried the General. Prime Minister Gresh Manaa and his deputy, Var Lyonn had sworn to aid Rieekan's refugee efforts, but there were groups amongst the planet's inhabitants that believed in keeping Delaya's resources for the Delayans."}, {"tag": "p", "text": "Rieekan later requested that Princess Leia Organa join him to help sway the refugees towards the cause of the Alliance. He himself had been called for an operation in the Orus sector. When the princess did arrive, she did so with an entourage that included her friends Han Solo and Luke Skywalker. The general personally picked Organa up from the spaceport, and later talked with her privately in his landspeeder, while her retinue traveled in another vehicle. Rieekan aired his suspicions to his fellow Alderaanian—Manaa's men had been continually following him, closely observing his interactions with the refugees. They then arrived at the Delayan Whisperpines Hotel—opulent accommodation imposed on Organa by the government, and Rieekan opened up to the Princess over his regret that he was unable to act when their homeworld was destroyed. Organa assured him that he was not to blame in any way, shape or form, and reminded him that had he indeed been able to act, he would have likely revealed ties between Alderaan and the Alliance."}, {"tag": "p", "text": "Outside the hotel, Rieekan and Organa were met by Chen, who enthusiastically welcomed and applauded the princess. As Rieekan informed them that he was to depart for the Oren sector, he spoke privately with Organa once again as she offered him more words of encouragement. He advised her to be wary of Manaa, but also to watch out for Lyonn, who was the real power-broker on Delaya. Rieekan then returned to the spaceport, and departed. His suspicions were later proved to be well founded, when Lyonn had Organa kidnapped. The princess was rescued by Skywalker, Solo, and Solo's first mate Chewbacca, as well as the ex-Jedi Padawan Ferus Olin, and Alliance operative Tobin Elad. It was later discovered that Elad was in fact X-7—an Imperial agent tasked with assassinating Skywalker."}, {"tag": "p", "text": "Later, a prisoner of the Alliance, Div, was kidnapped from his Yavin 4. Skywalker attempted to rescue him, but was apparently spirited away by the kidnappers as well. Organa approached Rieekan, insisting that they rescue Skywalker, but the general could not advocate a fool's errand. The princess took umbrage at this, but Rieekan claimed that he meant no insult. Skywalker and Div were later recovered by Olin. Rieekan later met with Olin and several other members of the Alliance, among them Yavin base commander Jan Dodonna, to discuss what the ex-Jedi knew. Olin had been observing the movements of Palpatine's enforcer, the Lord Darth Vader, and had determined that X-7, whose memories had been erased, was trying to determine his former identity."}, {"tag": "p", "text": "The ex-Jedi proposed that the Alliance slice into computers that would be accessed by X-7, and plant false clues for the agent, hoping to convince him that he was in fact one of Olin's and Div's late friends, Trever Flume. Rieekan was skeptical that the Alliance would be able to field such an operation, but Olin ventured to do it himself, as he deemed that he was more than capable of the task. The operation was a success, and X-7 participated in an Alliance mission to Belazura. Rieekan assured Div that X-7's participation in the mission would go ahead as planned, and the operation was a success, resulting in the destruction of an Imperial garrison. During the mission, however, X-7 betrayed the Alliance and had to be killed by Olin."}, {"tag": "h3", "text": "Trouble in Shelsha"}, {"tag": "p", "text": "By 0 ABY, Rieekan had a variety of secret bases set up throughout the Empire, one of which served as a key Alliance military base following the evacuation of the Yavin 4 base. The general commanded the base, which eventually played host to Mon Mothma, leader of the Rebellion, herself. At the time, the Alliance was having trouble gaining a foothold in the Shelsha sector due to infighting amongst its member groups and other cultural issues. As a result, they had been forced to evacuate a listening post on Teardrop. Meanwhile, Mothma and Rieekan had been contacted by Yeeru Chivkyrie, leader of the Shelsha-based Alliance member group Republic Redux. Chivkyrie had a proposal that he believed would serve as a great benefit to the Alliance, although he would not clarify what it, not through the HoloNet or encrypted transmissions."}, {"tag": "p", "text": "What Mothma and Rieekan did know was that Ydor Vokkoli, leader of Freedonna Kaisu and Thillis Slanni, leader of Shining Hope, both centralized in the Shelsha sector, were strongly opposed to Chivkyrie's idea. So strong was their dissatisfaction that they threatened to pull out of the Alliance, should Mothma agree to Chivkyrie's mystery plan. In addition, Republic Redux was the smallest of the three groups, preventing the Alliance from effectively complying with the Adarian Chivkyrie. He himself would not be allowed to convince the other leaders of his plan, as he was from the second-tier of Adarian society. The only way the other leaders could be convinced, Rieekan deduced, was if someone from a higher tier was sent to negotiate with them. The selected location was Chivkyrie's home, Makrin City, Shelkonwa, but the diplomats sent would meet with him in an uninhabited system."}, {"tag": "p", "text": "Leia Organa was chosen to meet with the Adarian leaders, and Rieekan requested that Han Solo and Luke Skywalker join her—since the mission was to be low-profile, the general ruled out the use of Alliance ships and what he deemed \"obvious Alliance personnel.\" While Skywalker was eager, Solo bristled at what he perceived to be Rieekan labeling him as someone not totally committed to the Alliance's cause. Nevertheless, he agreed to accompany the princess, after Mothma and Rieekan had sorted out the final details with the Adarian leaders. In spite of the fact that Solo was not completely respectful towards the general, Rieekan held him in high regard as a natural leader and a skilled fighter."}, {"tag": "p", "text": "At some stage afterwards, Rieekan was met with odd news: a shipment of Alliance weapons that was traveling, disguised, along a supply line through Drunost had been attacked by the BloodScar swoop gang, who were in turn fought off by a group of stormtroopers. In the aftermath, the stormtroopers had not searched the shipment, which had been disguised as farming equipment, nor had they questioned Porter, the Alliance agent supervising the shipment. Organa suspected that the Imperials might have tracked Porter afterwards to find out where his destination was, but Rieekan had received a report from Casement, another agent working on Drunost, stating that no one had tracked the supplies. Alliance agent Targeter also confirmed that no one had been tracking Porter. Nevertheless, Organa suggested shutting down the supply line, but due to the increased amounts of piratical activity in the Shelsha sector, Rieekan thought that opening a new line would be impossible."}, {"tag": "p", "text": "Since the BloodScar group alone could not be responsible for the widespread criminal activity in Shelsha, Rieekan sought to investigate just what was going on amongst the fringe groups in the sector. Pulling Captain Solo from the Shelkonwa mission, he chose the Corellian to do the reconnaissance, and Organa suggested that Skywalker accompany him. While the Tatooinian balked at the prospect of not going with the princess of the Shelkonwa mission, he agreed to the plan. With that, the general set about retrieving names and places for the pair to investigate, before sending them to meet with Porter on Drunost. As it turned out, the two missions were interconnected: the pirates had been working for Governor Barshnis Choard, who had been planning, for two years, to have the Shelsha sector secede from the Empire. The pirates were to take over key Imperial installations across the sector when the opportunity arose."}, {"tag": "p", "text": "Meanwhile, through his chief administrator, Vilim Disra, Choard had contacted Chivkyrie, claiming that Shelsha would join the Alliance if the Alliance would defend the sector against the inevitable Imperial reprisal after the secession. The plan did not come to fruition, though, as Disra reported Choard's treachery to Lord Darth Vader. As a result, Rieekan no longer had to deal with Chivkyrie's \"proposal,\" although the Alliance's position in Shelsha had not improved. Organa was briefly captured by the Empire, but was saved thanks to the efforts of Solo, Skywalker, and Chewbacca, as well as the Hand of Judgment—a group of rogue stormtroopers who had been the ones defending Porter's shipment from the BloodScars."}, {"tag": "h3", "text": "Working with the Rogues"}, {"tag": "p", "text": "General Rieekan began to collaborate with Rogue Squadron, commanded by Luke Skywalker, shortly after the unit's foundation. One such early mission involved dispatching the squadron to Barkhesh, where an Alliance shuttle was to pick up supplies from the local resistance movement. The resistance's convoy, however, had to pass through Imperial forces, and so Rieekan had Rogue Squadron clear the way for them. The mission was a success, and the general was pleased, as the new supplies would help the Alliance recuperate after the loss of their base on Yavin. For their next mission, Rieekan dispatched Rogue Squadron to Chorax, where the Alliance transport Nonnah had crashed, carrying soldiers and stolen Imperial equipment. The general tasked the squadron with locating the downed ship. When they did, the general dispatched a shuttle to pick up the stranded crew—however, the Rogues were met by Imperial resistance, and Rieekan soon received reports that the Nonnah itself was under attack. Nevertheless, the mission was a success, and those aboard the Nonnah were safely extracted."}, {"tag": "p", "text": "Following the rescue of the Nonnah crew, Rieekan was contacted by Crix Madine, who was now an officer within the Imperial Army. Madine wished to defect to the Alliance, and planned to meet with Rieekan in Coronet City, Corellia. Rieekan, along with Rogue Squadron, traveled to Coronet, where Rieekan met with city officials in the Coronet Capitol Tower. During the meeting, Coronet City fell under Imperial attack. The Rogues engaged the Imperial forces, and during the battle, they were contacted by Madine, who was hiding in the Tech Center. As Rogue Squadron defended the Tech Center, Han Solo and the Wookiee Chewbacca, friends of Skywalker, arrived in the freighter Millennium Falcon to aid in the defense of Coronet. Rieekan had a shuttle brought in to evacuate Madine, while another shuttle and the Falcon evacuated the Capital Tower. As soon as the two ships were away, Imperial bombers destroyed the capital building."}, {"tag": "p", "text": "As Madine offered his services to the Alliance, the general vouched for his old ally's credibility. It was Rieekan's input that convinced Mon Mothma that Madine was not a security risk. Shortly after his defection, Madine and Skywalker led Gold and Rogue Squadron respectively during the Liberation of Gerrard V. The Imperial governor was looting the planet, and its inhabitants yearned for independence. Rieekan tasked Rogue Squadron with escorting Madine's Y-wings as they attacked the yachts that were looting the cities. Although the mission succeeded as planned, the Alliance also gained defector Kasan Moor during the engagement, an elite TIE pilot who had served in the 128th TIE Interceptor Squadron."}, {"tag": "p", "text": "Moor was able to provide the Alliance with the location of several key Imperial installments, including a small Imperial construction yard on Balmorra, responsible for the construction of TIE starcraft and Imperial walkers. Rieekan dispatched Rogue Squadron, which now included Moor in its ranks, to strike against the facility, crippling it without actually destroying it. The general monitored his pilots' approach the facility, advising them to eliminate several of the scanners the Imperial forces had installed along the canyon leading to the factory. Once they were destroyed, Rieekan gave Rogue Squadron the go-ahead to attack the base. Skywalker and his men were able to adequately cripple the Imperial construction yards, and return home."}, {"tag": "p", "text": "The intelligence provided by Moor continued to serve Rieekan well, as it also allowed Rogue Squadron to strike against an Imperial Enclave on Kile II, which was serving as a base for all of the Imperial Navy's movements in that sector. Once Skywalker and his men had been able to successfully bomb the enclave, Rieekan contacted them directly, congratulating them for a job well done. Following that, Rieekan and Rogue Squadron began to wage a campaign against the forces of Moff Kohl Seerdon. It was the general's belief that Seerdon was consolidating his forces as preparation for a strike against the Alliance's bacta supply, and so Rieekan had his forces try and impede Seerdon's advance before his plans could come to fruition. One operation involved sending a group of commandos to Fest, where they were to steal several AT-PTs from the Imperial Weapons Research Facility there. The commandos met resistance while trying to escape however, and the general was forced to call in Rogue Squadron, who had recently been sabotaging Seerdon's operations on Taloraan. Skywalker and his pilots helped the commandos get to safety in their stolen AT-PTs, and destroyed the Weapons Research Facility while doing so."}, {"tag": "p", "text": "Seerdon responded with an assault and blockade of one of Chandrila's cities. The general sent both Rogue Squadron and a supply train of supplies to the planet, in the hopes of aiding the beleaguered city. The train was attacked while en route, but Skywalker and his men were able to fend off Seerdon's aggressors until it reached the city. Subsequently, the city was evacuated by the Alliance in shuttles, which were in turn escorted by Rogue Squadron. Soon after, Rieekan received reports that Thyferra, home to bacta production, had fallen under attack by Seerdon's forces. At the time, Rogue Squadron was busy destroying an Imperial installation on Sullust. The general hurriedly recalled the pilots, and immediately dispatched them to Thyferra. In the ensuing battle, Skywalker and his pilots were able to thwart Seerdon's efforts to halt the flow of bacta, and were also able to kill the moff himself during the operation."}, {"tag": "h3", "text": "Continued conflicts"}, {"tag": "p", "text": "When an Alliance refugee stopover point on Nentan was discovered by the Empire, Rieekan was called in to oversee the evacuation. By this time, the Nentan bunkers were at full capacity, and there were not enough transports to evacuate both the military personnel and the refugees. Several soldiers volunteered to stay behind as the Imperials closed on the base, but Rieekan found that solution to be unacceptable. Bren Derlin, a Human who had been serving with the general for some time, offered Rieekan an alternative solution. Derlin, along with a group of \"expendable\" soldiers, hid amongst some of Nentan's ruins as the Imperials landed and advanced towards the now-abandoned Alliance bunkers. As they did so, they left their landing craft relatively undefended, leaving them free to be hijacked by Derlin and his men. As a result, Nentan was successfully evacuated, and Rieekan, pleased, promoted Derlin to the rank of major. Afterwards, Rieekan saw action on a variety of disparate worlds."}, {"tag": "p", "text": "In the aftermath of Nentan, Rieekan became the theater commander of the Alliance High Command base. When the Alliance administrative base at Dankayo was discovered by the Empire, Rieekan's people there were fortunate enough to learn of the impending Imperial attack in time to mount an evacuation, which Rieekan oversaw. The evacuation was, for the most part, a success, and no casualties were sustained. However, several vital datapacks remained intact, and they were retrieved by the Imperial transport Elusive. Rieekan realized that if the datapacks were to reach Imperial Intelligence, Alliance activities in three sectors would be jeopardized. With that in mind, he had his men destroy the Elusive. In addition to the destruction of the Elusive, Rieekan oversaw many operations that crippled Imperial Intelligence."}, {"tag": "p", "text": "One such operation saw Rieekan dispatched to the city Tiems, where the general's forces destroyed a power station and liberated several thousand Alliance personnel who were being held captive there. However, as Rieekan and his men prepared to be evacuated, his transports were delayed by Imperial starfighter action, and so the general was forced to defend the landing zone from a heavy Imperial counter-attack. Rieekan's knowledge of Imperial tactical doctrine, however, inspired him to lay a trap for his enemies. Since the doctrine suggested that the weakest part of an enemy line should be attacked with full force, and that upon breaking through the Imperials should move quickly to secure the rear positions of their enemies to obstruct retreat, the general had two of his regiments hide behind the main line—one in a nearby forest, one over the other side of a river. As such, when the Imperial forces attacked the weakest part of Rieekan's line, which he knew to be the center, his troops fell back, and the Imperials gave chase. They were then ambushed by Rieekan's hidden regiments, causing the Imperial general to delay any further attacks until his air support arrived. By that time, however, Rieekan's forces had been able to evacuate."}, {"tag": "p", "text": "Rieekan later filed an After Action Report on the engagement, and his command of strategy was later used as an instructional tool in surface combat tactics by General Madine. At some stage, Rieekan also took on the role of a mentor, briefly instructing Lieutenant Risiev Credal in the art of tactics. This instruction was augmented by prior teachings from other Alliance officers such as Beryl Chiffonage, Pashna Starkiller, and Vanden Willard. Together with Chiffonage, Credal had developed Attack Pattern Delta, which the general believed would be effective against Imperial walkers. Following the Evacuation of Yavin, General Jan Dodonna was believed dead. As a result, Rieekan was appointed as his successor in the role of Alliance operations commander. The choice was deemed a natural one, as the Alderaanian had consistently shown skill in keeping his men alive."}, {"tag": "p", "text": "When an Alliance Intelligence cell on Brosi came under threat of detection due to the blatant actions of the Brosin Underground against the Corporate Sector Authority, Rieekan voiced his concerns. The Alliance agents, who were working in Brosi's zinsian processing facilities, had attempted to make contact with the Underground, to little or no avail. Since there was still the risk of CSA discovering the Alliance cell, Rieekan requested that agent Abil Vilorin make more attempts to contact the Brosan Underground. Further concerns came in the form of Risiev Credal, who had apparently turned traitor. Rieekan worried that Credal, if he had indeed defected to the Empire, would reveal the location of the High Command base, as well as any planned tactics to be used in the event of an attack."}, {"tag": "h3", "text": "Echo Base"}, {"tag": "p", "text": "When the Alliance relocated its main base to Hoth, Rieekan served as theater commander in charge of all land and naval forces in the Hoth system. At the time, a considerable bounty had been placed on the general's head; enough to buy a moon in the Core Worlds, or even an entire planet in the Outer Rim Territories. As soon as he was given command, the general devised an evacuation plan that could be put into effect as soon as possible. Meanwhile, the general put his men to work, ensuring that Echo Base was as safe as possible. Rieekan's concerns were numerous, ranging from the planet's freezing temperature, to the fact that the planet hosted no other sentient life—an Imperial scan of the world would quickly enough reveal that the Alliance was hiding there. The constant meteorites emanating from the Hoth asteroid field pelted the planet, preventing the general from knowing if a scout ship or a probe droid were approaching the planet or not. Kem Monnon, chief of the Alliance Corps of Engineers, had been instrumental in establishing Echo Base, and approached Rieekan, asking for permission to explore Hoth further—the general acquiesced, as it was possible the venture would grant the Alliance strategic advantages."}, {"tag": "p", "text": "While overseeing construction Rieekan assigned historian Voren Na'al menial tasks. Na'al was there chiefly to chronicle events as they happened, but he was more than willing to oblige Rieekan and aid in the building of the Alliance's new home. The general placed Major Derlin in charge of the base's security and operations; the major's assignment proved to be a wise choice for Rieekan, and the decision was a popular one. Rieekan began amassing a comprehensive collection of data on the area that the Rebels were using for refuge. Recovered by Alliance Survey Team Theta was a personal recording by smuggler Jonox Forb, who had initially scouted the location and had intended to call it \"Snowflake Base.\" Forb's recording was one of the many items that Rieekan kept in his personal collection. He also collected a report by Corporal Vyn Rolado on the taming of the tauntauns. When problems arose when as the tauntauns became agitated while around droids, Rieekan sought to work with the instincts of the animals, rather than against them. To eliminate any agitation and competition amongst the captive mounts, Rieekan made sure that only female tauntauns were kept for service. When properly tamed, the tauntauns served Rieekan's men well, allowing them to go out on patrols as the T-47 airspeeders were still being adapted for the cold."}, {"tag": "p", "text": "Eventually, Princess Organa arrived at the base, and acted as a morale-boosting figurehead to the personnel. Rieekan also found her useful, as she was a skilled tactician. Upon arrival, despite complimenting the general's work on the base, she expressed concern for her friends, Luke Skywalker, Han Solo, Chewbacca, and C-3PO, who were aboard the waylaid Millennium Falcon. Some time later, controller Toryn Farr reported that the Millennium Falcon was making its approach to Hoth, although it was being followed by an unidentified ship. Solo explained his tardiness, mentioning that they had been forced to stop on an uncharted world to make repairs. However, the unidentified ship remained in the system, and approached Hoth itself. Organa, furious at Solo's complacency, sent the Corellian back out to engage the unidentified craft. The ship later proved to be owned by the pirate captain Raskar, who was later driven away from the planet without discovering Echo Base. Shortly after welcoming a fleet of refugees from Habassa II, Rieekan announced to Organa that Echo Base was fully operational."}, {"tag": "h3", "text": "Discovered"}, {"tag": "p", "text": "Hoping to prevent another incident like Alderaan, the general made sure that Echo Base's defenses were as good as they possibly could be. He culled traffic to and from the system down to just long-range fighter patrols and necessary shipments, and in doing so made sure that the existence of the base remained a closely-guarded secret. To allay his earlier concerns, he had a planetary-class shield generator installed at the base, which could repel any orbital bombardment. To prevent anyone from giving away Echo Base's location, the general denied permission for any ship to leave the base until the shield was fully operational. As yet another precaution, Rieekan had tauntaun and snowspeeder patrols sent out frequently, to check the general vicinity of the base. Trenches were dug around Echo Base, and heavy laser turrets installed. The general also ordered the installation of heavy blast doors at the base's northern and southern entrances. As a final measure, a v-150 anti-orbital ion cannon was brought in—the cannon was powerful enough to disable a Star Destroyer in orbit. Despite the abundance of defensive measures in place, Rieekan knew full well that he would not be able to stop a full-scale Imperial assault. Instead, they were there to delay the Empire, and allow the Echo Base personnel to escape with minimum casualties. The general accepted the fact that the Empire were more than likely going to discover Echo Base, and so he was always prepared to order an evacuation."}, {"tag": "p", "text": "To take stock of the situation, Rieekan held a staff meeting, attended by Organa and Lieutenant Commander Skywalker, amongst others. Echo Base was nearing its ultimate completion, but the Alliance was still having trouble adapting to the climate. The general, however, was sure that their situation would improve once Commander Arhul Narra's vital supply convoy arrived. During the meeting, Rieekan was taken aside and informed that Narra's fleet had been destroyed near Derra IV. The commander had also perished in the conflict. Returning to Skywalker and Organa, who had been joined by Captain Solo and his co-pilot Chewbacca, Rieekan informed them of Narra's death and the loss of the convoy. The general then promptly promoted Skywalker to commander, and informed him that no resupply meant no snubfighter reinforcements—Rogue Squadron was to be Echo Base's only aerial defense."}, {"tag": "p", "text": "When a storm raged around Echo Base, Rieekan issued an order that no one was to leave its confines, lest they succumb to the bitter cold outside. The general's men then detected an energy source on the sensors, although it disappeared soon after due to the storm. Rieekan consulted Organa, and then decided to wait until Skywalker and Solo, who were out placing sensors, to return, before closing the base's shield doors. The general supposed that whatever was out there might show up on the sensors once again. Captain Solo then returned, and approached Rieekan, stating that he had to leave Hoth. This was due to the fact that he had a bounty on his head, and needed to pay off the crime lord Jabba Desilijic Tiure in order to remove it. Rieekan understood Solo's position, but regretted his need to depart nonetheless, and he had even considered giving the Corellian an honorary officer's commission."}, {"tag": "p", "text": "Skywalker failed to report back to base, however, and Solo disobeyed Rieekan's command that no one was to leave the base when he set out into the storm on his tauntaun. Solo did not return that night, and so the next morning, the modifications to the airspeeders had been completed, and Rieekan authorized Rogue Squadron to set out and find their lost comrades. The pair were rescued, Skywalker having been savaged by a wampa ice creature. By that time, Rieekan felt that it was unsafe for any ship to depart the system until the base's energy field was online, and so Solo's departure from Echo Base was delayed."}, {"tag": "p", "text": "Shortly after Skywalker's rescue, Rieekan received reports that Echo Base was under attack by one of the ice creatures. Although the attack was subdued by the Echo Base staff, the general deduced that the creatures had evolved to register at sub-life heat levels, and so his men adjusted their equipment accordingly. Rieekan then received a report that an unidentified object was detected near Echo Base. The discovery demanded the general's personal attention. One of Rieekan's staff, Wyron Serper, was monitoring the object, and was able to pick up its communications. The protocol droid C-3PO overheard the transmission, and stated that it was not an Alliance code. The droid even went so far as to suggest that the transmission was an Imperial one. Solo, who was present by this time, decided to go out and investigate with the help of the Wookiee Chewbacca. As they departed, Rieekan dispatched Rogues Ten and Eleven to Echo Station 3-8, where they were to attack the unidentified energy source. Solo assured the general that he could handle the situation, however."}, {"tag": "p", "text": "When Rieekan did not hear from Solo for some time, Organa urged him to dispatch snowspeeders, but at that moment the captain called in. Solo discovered that the unidentified object was an Imperial Viper probe droid. Rieekan immediately realized that they had been discovered, and he immediately ordered an evacuation of Echo Base. Knowing that the Imperials would act quickly and send an attack force as soon as possible, he put his evacuation plan into motion, and began implementing the strategies he had devised with Organa. Sure enough, Lieutenant Romas Navander reported that Lord Vader's Death Squadron had entered the system, and blockaded the planet. Rieekan, acting fast, had Navander reroute all power to the energy shield, before having his men mobilize to repel an Imperial ground assault. The general prepared to utilize a delaying defense tactic that would allow the majority of the Alliance personnel to escape the base, but knew that in doing so, he was effectively sending many of his men to their deaths. It was a difficult decision for the Alderaanian, but as he had resigned himself to the fact that the base would not be evacuated before the Imperials arrived, it was one that he was able to make nonetheless."}, {"tag": "h3", "text": "The Battle of Hoth"}, {"tag": "p", "text": "To begin with, Rieekan lowered Echo Base's shield momentarily, and had his ion cannon fire on the blockade, essentially creating a hole in the Imperial line. The hole was big enough to allow one transport to escape at a time, and Rieekan seized the opportunity. Meanwhile, the forces of General Maximilian Veers landed on the planet, and began their advance towards Echo Base. Rieekan received a direct report from Colonel Ledick Firest, at Outpost Beta, who announced that Veers' force consisted of walkers. The colonel initiated Evac Rearguard Action 101, giving Firest command of five companies of defense troops, and the snowspeeder-equipped Rogue Squadron. Firest noted that it would not be enough to stave off Veers for long, but it was all Rieekan had. Rieekan also ordered that Outpost Beta be evacuated, as the Imperials would be able to easily detect the Alliance presence there."}, {"tag": "p", "text": "The general personally directed Commander Skywalker and Rogue Squadron, who were flying snowspeeders, to Outpost Beta, to engage the Imperial element that had landed nearby. Despite the fact that he knew Skywalker and his pilots faced daunting odds, it was the only way the general could delay Veers' approach. When it became evident that the tactic of protecting two transports at a time was no longer tenable, Rieekan consulted Organa, who agreed. Rieekan and Organa agreed to initiate accelerated launch procedures, and the general gave the order to launch patrol. Commander Skywalker was shot down during the battle, but was able to rejoin the fight on foot. Command of Rogue Squadron fell to Wedge Antilles, who offered to pick the grounded Skywalker up, but Rieekan ordered him not to, as he determined that Antilles would likely lose his own life in the effort. Instead, Antilles recounted Skywalker's actions to the general, as the commander single-handedly brought down an AT-AT with nothing but his lightsaber and a grenade. When it became evident that the Imperials were attempting to breach Echo Base's south entrance, Rieekan contacted Skywalker, who was now mounted on a tauntaun, directly, and rerouted him to the base's defense."}, {"tag": "p", "text": "As Rieekan had predicted, Veers' first target was Echo Base's shield generators. As soon as they were destroyed by the enemy general, Rieekan gave the order for all Alliance forces to retreat. Contacting Rogue Squadron directly once again, the general ordered Skywalker and his men to return to base, switch to X-wing fighters, and cover the escape of the remaining transports. He then gave the pilots orders to move directly on to the rendezvous point. With the defensive shield down, Lord Vader and his men were able to land near the Alliance installment and storm it. Despite this, Rieekan's men were able to slow the attackers long enough to ensure that most of the Echo Base personnel escaped. The strategy was a costly one, however, and the Alliance suffered devastating losses. Rieekan also contacted Col Serra, the commander of Renegade Squadron, ordering his unit to destroy databanks with sensitive information in the control room to prevent it from falling into enemy hands. Renegade Squadron did that, and Serra placed explosive charges throughout Echo Base in order to destroy it along with the Imperials once the evacuation was complete."}, {"tag": "p", "text": "Rieekan himself was aboard the last of the transports, from which he directed Rogue Squadron in their escort duties as they faced waves of TIE fighters. Despite the onslaught of enemy craft, Rieekan's transport was able to escape Hoth safely thanks to the efforts of Rogue Squadron and Renegade Squadron, who were the last squadron to evacuate from Hoth before the explosion of Echo Base. While protecting the last transport, the Renegades managed to hold off Darth Vader in his TIE Advanced and steal a prototype TIE Defender for study."}, {"tag": "p", "text": "Although Rieekan was able to make it to the rendezvous with the Alliance fleet above the galactic plane, he feared for the safety of his staff, some of whom had not been so lucky. One such staff member, Controller Farr, had, along with several other Rebels, been rescued by the bounty hunters Zuckuss and 4-LOM, who delivered Farr and her compatriots to the frigate Redemption. Eighty-four Rebels had been taken to a Rebel stronghold on Darlyn Boda by the bounty hunters, and a further eighteen were presumed alive back on Hoth. Upon arrival, Farr attempted to introduce the general to 4-LOM, but the droid was more concerned with the well-being of his partner, who was in a critical condition due to a mishap on an earlier mission. Meanwhile, Alliance Command instructed Rieekan to promote Farr to the rank of commander, for her efforts in aiding her comrades in the wake of the Battle of Hoth. During the promotion ceremony, held aboard the Redemption, Rieekan also presented Farr with an award of merit. They later discussed plans to rescue the Rebels stranded on Hoth."}, {"tag": "p", "text": "Another transport that had failed to reach the rendezvous point was the Treasure Trove, which was off by 36 hours according to Major Derlin. The major also reported that the fleet barely had enough blaster gas to supply the ships present, much less those still to arrive. In response to the news, Rieekan dispatched agents aboard the light freighter Out Runner to determine the location of the Treasure Trove. Although when discovered, the ship was crippled, Rieekan's agents were able to retrieve the blaster gas the Treasure Trove had been ferrying."}, {"tag": "p", "text": "Following the rout at Hoth, Rieekan was given intelligence of a possible Imperial installation in The Maw. Rogue Squadron was dispatched to investigate; the general advised them to be wary of any shield generators set up around the perimeter, as well as any hostile Imperial forces in the area. Wedge Antilles, who led the mission, was able to lead his pilots into the installation, which was in fact a prison. During the attack, a group of Rebels who had been captured on Hoth, led by pilot Karie Neth, broke out of the prison, and were aided in their escape by Rogue Squadron. During the operation, the Imperial installation was also destroyed. The escapees and Rogue Squadron were then able to return to Rieekan and the fleet."}, {"tag": "h3", "text": "Haven Base"}, {"tag": "p", "text": "Following the rout at Hoth, Rieekan was placed in the Alliance military administration, from which he could plan overall campaign strategies against the Imperials. However, he found himself hard-pressed to find a new base for the Alliance. From the fleet, he sent out Leia Organa and C-3PO to investigate one potential world for a new base, and Luke Skywalker was send with R2-D2 to find another. Chewbacca and Lando Calrissian were tasked with locating Captain Solo, who had been captured by the bounty hunter Boba Fett in the wake of Hoth. While they were out searching, Rieekan received a dispatch from the late Captain Maraba Tev that contained the technical readouts for a new Imperial battlestation in the vein of the Death Star—the Tarkin. Recalling all scouts, he briefed his troops aboard the fleet's main frigate as to the Tarkin's potential power."}, {"tag": "p", "text": "Concerning Rieekan was the fact that the Tarkin lacked the design flaw that General Dodonna had so ruthlessly exploited three years prior at Yavin. As a result, he was forced to devise a new plan, in which a team of commandos would infiltrate the superweapon and destroy it from within. Specifically, Rieekan hoped that Skywalker, Organa, Chewbacca, R2-D2 and C-3PO would volunteer for the task, as they had been aboard the original Death Star and survived. Skywalker agreed, and they departed aboard the Millennium Falcon for Hockaleg, over which the Tarkin was being built. The mission was successful, and the Tarkin was swiftly destroyed before it could cause any significant damage to the Alliance."}, {"tag": "p", "text": "Eventually the Alliance set up a new base on Arbra, which also became Rieekan's new center of operations. There, the Alliance Fleet held station, but Organa felt that there was a need to hide the ships from potential Imperial sensor sweeps. As per standard Alliance procedure, she suggested hiding the fleet in the chromosphere of Arbra's sun, Arbran. To protect the fleet from the extreme heat, five Kerts-Bhrg generators were brought in. When properly aligned, the generators would create a durable shield in the shape of a pyramid, within which the fleet would be held. Once under Arbran's corona, the fleet would be in constant orbit. To keep the pyramid in orbit, the top-mounted control generator would be outfitted with a thruster."}, {"tag": "p", "text": "Rieekan accompanied Organa on the control generator as the plan was enacted. Entry into the chromosphere went as planned, but shortly afterwards sensors indicated that several small Imperial ships were approaching the system. Leaving command of the generators to Captain Kavel Mesa, Organa, Rieekan, and all non-critical personnel on the generator departed for Arbra on a special shuttle designed for traveling through the sun's corona. As the ship made it through the corona, they were contacted by C-3PO, who was supposed to have been on the shuttle itself. The protocol droid reported a malfunction in the generator's systems, and that the crew had all been rendered unconscious. He went on to state that the malfunction was of a severity that would potentially cause the generator to stop working, which would result in the subsequent loss of the Alliance fleet. In addition, the command generator's top-mounted thruster was beginning to lose power."}, {"tag": "p", "text": "To make matters worse for the Rebels, the Imperial scout craft—four TIE Fighters, entered the system at that moment. Rieekan gave the order for the shuttle to hide behind the nearest moon, allowing the general to observe proceedings unnoticed. With apparently nothing to find, the Imperial fighters began to leave the system, allowing Organa and the general to devote their attention to the situation in Arbran. Although C-3PO and his counterpart, R2-D2 were attempting to resolve the issue themselves, Organa gave the order for the shuttle to re-enter the chromosphere, in the hopes of being able to save the fleet in time. One of the crewmembers, however, reported that they were too late, and that according to estimates, the fleet would have already entered the chromosphere unprotected. To Rieekan's and Organa's surprise, though, C-3PO reported that they had been able to save the fleet by draining power from a EF76 Nebulon-B escort frigate directly into the control generator."}, {"tag": "p", "text": "Some time later, Commander Skywalker was charged with the murder of pilot Shira Brie, theft of Alliance property, and desertion from the ranks. He was placed before the Triad of Judgement—made up of Rieekan, Organa, and General Duron Veertag. The evidence was brought before them: during an operation against an Imperial armada, Skywalker had suddenly shot down Brie's craft, presumably killing her. Unable to explain his actions, and instead attributing them to the Force's guidance, Skywalker was stripped of his rank, and held at Haven Base. He later escaped, and fled to Shalyvane, Brie's homeworld. Information gleaned there that threw Brie's past into doubt led him to Krake's Planet, where he uncovered evidence that Brie had been an Imperial agent, which was then brought to Haven Base. The Triad found the evidence satisfactory, and cleared Skywalker of all charges."}, {"tag": "h3", "text": "The New Republic"}, {"tag": "p", "text": "Following the Battle of Endor, the Alliance became embroiled in the Bakura Incident, in which both the Alliance and the Empire did battle with the Ssi-ruuvi Imperium. Rieekan's staff compiled a great deal of tactical and strategic data during the engagement, which would prove invaluable to historian Voren Na'al as he compiled his report of the incident. Shortly afterwards, the Alliance to Restore the Republic was reformed into the Alliance of Free Planets. During the Nagai-Tof War, a contingent of the Alliance fleet stationed at Endor was returned to Haven Base under Rieekan's command."}, {"tag": "p", "text": "When the New Republic was formed, Rieekan sat on the New Republic High Command. Republic historians, hoping to dispel the Imperial propaganda surrounding the Battle of Hoth, turned to Rieekan's collection of information on the events that had taken place there. Several parts of the general's collection, dubbed the Rieekan Historical Collection, were reprinted by the historians. In 7 ABY, Rieekan was instrumental in planning the campaign that resulted in the capture of Coruscant."}, {"tag": "p", "text": "The following year, the New Republic was forced to wage war with Warlord Zsinj, who controlled roughly a third of the known galaxy. As the war persisted, Leia Organa was sent to the Hapes Consortium, to request the aid of the Hapans. The Hapans, who had kept their borders closed for three millennia, sent their tentative agreement three months later, in the form of sixty-three gifts from each of the worlds of the Consortium. Rieekan, along with Mon Mothma, Alderaanian Council president Threkin Horm, and several others watched the presentation of the gifts in the Grand Reception Hall from the Alderaanian diplomat's balcony. Joining them late was now-General Han Solo, who had been participating in the campaign against Zsinj. Later that year, Solo was able to defeat Zsinj at the Battle of Dathomir."}, {"tag": "h3", "text": "The Thrawn Campaign"}, {"tag": "p", "text": "In 9 ABY, during the Thrawn campaign, the Imperials moved against Coruscant. Since Admiral Ackbar was away, Admiral Hiram Drayson was left in command of the planet's defense, while Rieekan watched over proceedings in the Imperial Palace's war room. An alert was sent to the sector fleet, and shortly thereafter, the planetary shield was activated. Immobilizer 418 cruisers entered the system, blocking all traffic to and from the planet, and they were followed an escort of Dreadnaught-class heavy cruisers. One of the first targets hit by the Imperials was the out-orbit relay station, so whether or not the alert to the sector fleet had been sent was unknown. Shortly thereafter, Imperial I-class Star Destroyers entered the system, deployed fighters, and moved to engage Coruscant's defenses. In response, Drayson deployed his own fighters. Rieekan was joined at the war room's command console by Leia Organa Solo, to whom he quickly explained the situation. Organa Solo believed that the attack wasn't merely a feint by Grand Admiral Thrawn to lure the sector fleet, due to the destruction of the relay station; Rieekan agreed."}, {"tag": "p", "text": "Drayson had the planet's defensive ion cannons fire at the Star Destroyers—an effort looked upon with disdain by Rieekan, as the destroyers were well out of range, and the ion blasts had just as much chance of hitting Coruscant's own defensive platforms as they did any of the Imperial craft. Lamenting Drayson's inability to match Thrawn tactically, Organa Solo sought a quick replacement, and left Rieekan's side. While she was gone, Drayson continued to lose ships to Thrawn's onslaught, and the Republic's outlook was poor at best. Organa Solo eventually returned with General Garm Bel Iblis, who promptly took over proceedings. He was able to greatly improve the situation, until readings from the Imperial flagship, Chimaera, led him to believe that Thrawn was deploying cloaked ships."}, {"tag": "p", "text": "More worrying was the fact that the Chimaera and the other destroyers appeared to all be repeatedly launching what seemed to be cloaked craft. Bel Iblis ordered his men to fire along the projected trajectories of the cloaked craft, but as soon as he did, the frigate Evanrue was struck by an unseen item. Suspecting that the cloaked items were not necessarily ships, Bel Iblis had his ships fire along their trajectories with ion cannons, in order to disable the cloaking devices and divine just what they were hiding. Thrawn, anticipating Bel Iblis' actions, had his turbolasers fire at a few of the cloaked objects, destroying them before they could be revealed. The Star Destroyers stopped \"deploying\" the cloaked objects, and departed the system."}, {"tag": "p", "text": "The objects were soon discovered to be asteroids—two hundred and eighty-seven of them. Rieekan was dismayed at the number, due to the fact that they now hung in Coruscant's orbit and, if the planetary shield was deactivated, they would be allowed to plummet to the surface, killing millions. Bel Iblis, however, suspected that Thrawn would not be able to afford that many expensive cloaking devices, but Rieekan insisted that he had seen it on the sensor board, therefore it had to be true. Bel Iblis was not satisfied, however, and he asked Drayson whether or not a launch could be faked with a Star Destroyer's tractor beam. The Admiral said that it was, but explained that it would be impossible to determine which of the launches were legitimate and which ones were feigned. Effectively, even though the enemy had departed, Coruscant was under siege."}, {"tag": "p", "text": "Some time later, the Stardust plan was formulated: ships would disperse brilliant dust around Coruscant's orbit, and then fire negative ion beams into the field of dust, charging all the particles with the same polarity repelling them from one another. The turbulence caused by the cloaked asteroids would then show up clearly on the sensors, allowing the Republic to pinpoint their location. Rieekan and Drayson met in the war room to observe the plan in effect, and they were soon joined by Bel Iblis and Organa Solo. The first field of dust was dispersed, yielding no results, and suddenly Rieekan lamented the earlier loss of Bel Iblis' Crystal gravfield trap at Svivren, as the devices were highly useful in detecting cloaked ships."}, {"tag": "p", "text": "A second attempt at the Stardust plan failed, but on a third try, turbulence, and with it, a cloaked asteroid, was detected. As Drayson sent his ships after it, however, it self-destructed. Organa was pleased that at least one was found, but Rieekan exuded his usual grim pessimism. Over the following weeks, Drayson was able to destroy twenty more asteroids, and eventually, they received evidence from smuggler Talon Karrde that Thrawn had only ever deployed twenty-two asteroids, including the one that he had destroyed. With that news, Coruscant was able to lower its planetary shield, the siege ended. Thrawn's campaign came to a halt when he was assassinated during the Battle of Bilbringi, and his forces were forced to retreat, ending their harassment of the Republic."}, {"tag": "h3", "text": "Dead emperors, possessed Jedi, and crooked Calamari"}, {"tag": "p", "text": "In 10 ABY, Coruscant fell to a revitalized Galactic Empire— many of the Republic's military officers had perished, and both Rieekan and Madine found it difficult to find adequate replacements. The Republic was forced to make Pinnacle Base on Da Soocha V their center of operations. There, Rieekan worked with Generals Jan Dodonna and Wedge Antilles to coordinate High Command. Later that year, Luke Skywalker had surrendered himself to Imperial custody, and his sister, Organa Solo, began to fear for him. She was able to convince Han Solo, now her husband, to take her to the Deep Core, where Skywalker was being held. Rieekan joined Mon Mothma in seeing the Solos off, and as they departed in the Millennium Falcon, the Chief of State mentioned to the general that the future of the New Republic lay with the Jedi Knights, and as such, if Skywalker was lost, the Republic was lost. Skywalker was eventually recovered, and the galvanizing force behind the Empire's revival was none other than Emperor Palpatine, returned in a clone body. Palpatine was killed for the final time on Onderon, crippling the Empire once more."}, {"tag": "p", "text": "One of Rieekan's duties within the New Republic was, along with his colleagues, to sit in on the New Republic Senate. In 11 ABY, he was present when Luke Skywalker petitioned for the Senate to endorse his search for Jedi candidates across the galaxy, and to endorse his proposal for a new Jedi academy. Both petitions were successful with the Senate. Some time afterwards, Captain Han Solo returned from a mission to the Kessel, during which he had stolen a superweapon, the Sun Crusher from the Empire's Maw Installation. The Sun Crusher had the ability to destroy entire worlds, and so Rieekan and his colleagues decided that it was never to be used by the Republic. Once Skywalker had established his Academy, one of his students, Kyp Durron, turned renegade, and stole the captured Sun Crusher. Using it, he destroyed the Cauldron Nebula, where the Imperial Admiral Natasi Daala had been hiding her fleet. He had also destroyed the Imperial world of Carida, home to the Academy of Carida, much to the horror of some of Rieekan's colleagues."}, {"tag": "p", "text": "Durron eventually surrendered himself, and was brought before Rieekan, Mothma, and their colleagues. Rieekan admonished Durron, but Senator Hrekin Thorm called for the young man's death. Mothma, however, decided that Durron's fate should lie with Skywalker, and so the young man was sent to the location of the Jedi Academy, Yavin 4. Skywalker ultimately decided that Durron should not be punished, as he had been acting under the influence of long-dead Sith Lord Exar Kun. When Mothma stepped down from the role of Chief of State later that year, Leia Organa Solo stepped into the role, and in turn, Rieekan took Organa Solo's former role of Minister of State."}, {"tag": "p", "text": "Two years later, in 13 ABY, there was a leak in the Council. Information was being passed onto both Admiral Gilad Pellaeon of the Imperial Remnant, and Imperial moffs such as Shargael and Getelles. Rieekan suspected that the informer was someone in the ascendant Rationalist Party of Nam Chorios. He even entertained the possibility that it was Senator Q-Varx of Mon Calamari, although Organa Solo was skeptical. The Chief of State later traveled to Nam Chorios to meet with the leader of the Rationalist Party, Seti Ashgad, who had requested that the New Republic intervene in a local matter. Rieekan and Admiral Ackbar received a message from their Chief of State, confirming that her expedition had been a success."}, {"tag": "p", "text": "Soon after, Rieekan fell gravely ill, and slipped into a coma. Later, however, it was revealed that Organa Solo had been kidnapped by Ashgad on Nam Chorios, and had uncovered a plot in which Q-Varx had conspired with Ashgad, with the intent of poisoning Rieekan. The Minister had not been poisoned to death purely because it would have allowed the Council to immediately appoint a successor—in a coma, however, he was easily replaced by the Mon Calamarian. The conspiracy was foiled, Ashgad was killed in the Battle of Nam Chorios, and Q-Varx was subsequently tried for treason. The fact that the Minister had recovered was the only thing that prevented Q-Varx from being given the death sentence, but Rieekan did not return to his post, and was succeeded by Mokka Falanthas after two years of service."}, {"tag": "h3", "text": "Director of New Republic Intelligence"}, {"tag": "p", "text": "By 16 ABY, Rieekan had been appointed Director of New Republic Intelligence. That year, Viceroy Nil Spaar of the Yevethan Duskhan League came to Coruscant for talks with Chief of State Organa Solo. Rieekan could not be present for debriefing session with the Chief of State during a break in the initial talks, but his role was filled by Admiral Drayson. Spaar opted to stay on his ship the Aramardia, which was docked at Eastport, while the talks were in session. He failed to reach any sort of diplomatic solution or agreement with Organa Solo, despite over a month of discussions. At one point, Spaar canceled his sessions with the Chief of State for three days in a row, arousing suspicion. Rieekan's people at Intelligence had been able to ascertain that the Viceroy had only left the Armardia once—and stayed at a diplomatic hostel for just over two hours. Organa Solo held another staff meeting, to discuss Spaar's movements. On that day, the director received word that visitors had boarded the Aramardia that day—Senators Tig Peramis, Hodidiji, and Cian Marook, who were all disenchanted with Organa Solo's government. The three of them had stayed for over two hours, with Marook having left first. Rieekan made a discreet inquiry towards Marook's staff, and learned that the senators were, in fact, invited to the Aramardia."}, {"tag": "p", "text": "During the meeting itself, Admiral Ackbar inquired as to whether or not the director had been able to find out just who Spaar was meeting, but Rieekan had been unable to discover this. The admiral demanded to see a list of those staying at the hostel, but Rieekan was already ahead of him, having produced such a register and sent it to everyone cleared for the current meeting. Rieekan also divulged his newly-learned intel regarding the three senators. Organa Solo asked whether or not the senators had been in contact with the Yevethans all along, but Rieekan did not know, and instead suggested that Spaar's negotiations were indeed over—he had met with some of the Chief of State's most vocal critics, as well as some of the candidate legations at the hostel, which to Rieekan pointed to a breakdown in the talks."}, {"tag": "p", "text": "The meeting was interrupted when the Aramardia made an uncleared departure from Eastport, causing damage to other craft docked there, as well a number of casualties. With this new move on Spaar's part, Rieekan recommended to Organa Solo that she place the Home Fleet on alert. Ackbar interjected and insisted that they do more—he had ordered the destroyer Brilliant to fire on the Armadria should the need arise. When the Chief of State questioned this, Rieekan explained that Spaar's ship was still within Coruscant's planetary shield, and had the potential to cause a lot of damage. Organa Solo's aide, Alole, was unable to make contact with the ship, and so Ackbar conjectured that the move was meant to further embarrass the Chief of State. Although Organa Solo was reluctant to agree, she had the fleet and ground defenses put on alert. The Armardia remained airborne under the planetary shield for several hours, with the Brilliant following it continually. Spaar later made a broadcast from the ship, claiming that Organa Solo had conspired to attack him, and that the Chief of State had sent spies into the Koornacht Cluster, home to the Yevethans. The broadcast would in turn bring about the Black Fleet Crisis."}, {"tag": "p", "text": "In the midst of the ensuing crisis, a new issue was brought to Rieekan's attention: an expedition, devised by Admiral Drayson, to investigate the mysterious Teljkon Vagabond, a large an alien craft of Qella origin. Colonel Ejagga Pakkpekatt, leader of the expedition, had requested some of the Qella genetic material in preparation for his mission. In turn, the director had enlisted the services of the Obroan Institute for Archaeology. The expedition was eventually launched, and the first contact with the craft had been disastrous, resulting in the Vagabond entering hyperspace with a Republic boarding party, headed by Lando Calrissian, still onboard. Pakkpekatt required more resources to pursue the Vagabond, and so he sent a request to Intelligence. The issue was brought up in a Council on Security and Intelligence meeting, and Senator Krall Praget, the council's chairman, suggested that they close the books on the expedition, as it had failed. Rieekan was opposed to this, since Calrissian and his team were still on board. The director also suggested that it was likely Calrissian was still alive, despite the fact that a gauntlet from his contact suit had been found, undamaged. Rieekan was backed up by Senator Cair Tok Noimm, who insisted that Calrissian his team, which included Baron-Administrator Lobot of Cloud City, as well as the droids R2-D2 and C-3PO, were highly valued friends of the New Republic. In response, Calrissian's involvement was brought into question by Senator Amamanam; Rieekan claimed that he were representing the Fleet Office."}, {"tag": "p", "text": "Arguments flared once again in the meeting, over the value of Pakkpekatt's proposed recovery mission. The director proposed a solution: as Calrissian's contact suit would only serve him for a limited amount of time, added to the fact that Calrissian was likely to do whatever he could to impede the Vagabond's movements over the next several days, Rieekan suggested that he allow Pakkpekatt to continue his search for fifteen days. Noimm, in turn, suggested that the requested additional ships be sent as aid, but both Rieekan and Praget were opposed, and instead the director looked to downsize their commitment to the search, since in his view the New Republic already had assets aboard the Vagabond."}, {"tag": "p", "text": "Rieekan was later forced to terminate Pakkpekatt's search, as hostilities flared between the New Republic and the Duskhan League in the Farlax sector. The colonel contested the director's orders, however, and contacted him shortly after the termination was issued. Pakkpekatt argued vehemently, but Rieekan could not be swayed, emphasizing the need for the search craft in the Farlax engagements. The colonel protested, and requested that he be considered missing, as he felt he could not serve Rieekan properly if he were reassigned with the knowledge that Calrissian's team was still missing. Taken aback by Pakkpekatt's conviction, the director allowed the colonel to retain Calrissian's yacht, the Lady Luck, as well as three additional volunteers. Rieekan also required that Pakkpekatt report on any substantial developments."}, {"tag": "h3", "text": "The Black Fleet Crisis"}, {"tag": "p", "text": "In the wake of a Duskhan League strike against Doornik-319, Rieekan helped Chief of State Organa Solo set up a message to Viceroy Spaar, by having units of his own broadcast from the Koornacht Cluster's perimeter. Rieekan joined Organa Solo, Admiral Ackbar, Commodore Han Solo, Administrator Nanaod Engh, Chair of the Senate Behn-kihl-nahm, and Minister of State Mokka Falanthas for the broadcast, in which the Chief of State, addressing Viceroy Spaar, as well as the Yevethan governments and forces, decried the Duskhan League's violent attacks against the inhabitants of the Koornacht Cluster, and insisted that they relinquish their new holdings, cease their advances and release all prisoners taken. The New Republic initially received no response from the Yevethans, despite transmitting the Chief of State's message daily."}, {"tag": "p", "text": "Six days later, Admiral Drayson recovered footage from Doornik-319, indicating that the Dushkan League were continuing their occupation of the planet. Rieekan later viewed this footage at the Chief of State's residence, along with the other members of the government who had been involved in the earlier broadcast. The director agreed with Commodore Solo's observation that Spaar was calling Organa Solo's bluff. After some deliberation, the Chief of State decided to blockade Doornik-319, and had the agreement of all those present. As such, General Etahn A'baht and the Fifth Fleet were dispatched to Doornik-319. There, he engaged the Yevethan forces, but was defeated, forcing a New Republic retreat."}, {"tag": "p", "text": "As the crisis ground on, Commodore Solo was captured by the Duskhan League, and Rieekan was required to file a report on the incident. Later, Paqwe diplomat Belezaboth Ourn was outed as a Yevethan spy, and it was alleged that his actions had led to Solo's capture. He turned himself over to the New Republic authorities, and provided them with the device he used to communicate with Viceroy Spaar. Rieekan, however, discovered that Ourn did not have the connections to know about Solo's movements, and that during interrogation, the Paqwe made it evident that he was not even aware of the commodore's capture. The director then came to the conclusion that there was another Yevethan spy in the government. Rieekan's men also inspected the communications device, and determined that it was of Imperial make."}, {"tag": "p", "text": "When the director brought his discoveries concerning the second Yevethan spy to the attention of Organa Solo during a staff meeting, Admiral Graf suggested that it could be one of the three senators who visited Spaar during his time on Coruscant. Rieekan was already looking into to possibility, launching investigations into Senators Peramis, Marook, and Hodidiji. He then informed Organa Solo of the new intelligence on the communications device. Although the Chief of State wanted to know if the director would be able to use this new-found knowledge to find more of the devices, Rieekan had another idea—start a campaign of disinformation by keeping Ourn in contact with Viceroy Spaar. As an attempt to break Spaar's silence, Ourn was instructed to pass on that Organa Solo did not believe that the Duskhan League had captured her husband, the commodore. Spaar, in response, broadcast a message to Organa Solo from the bridge of his dreadnought the Pride of Yevetha on Channel 81 of the HoloNet, reserved for diplomatic use. In it, he claimed to have unified with the \"Grand Imperial Union,\" headed by Moff Tragg Brathis."}, {"tag": "p", "text": "Organa Solo questioned the validity of the \"Grand Imperial Union,\" and Rieekan informed her that the message had gone out to the entire system, essentially making the contents public. Administrator Engh pointed out that the message was not in fact intended for the government, but to strike at the hearts and minds of the populace. The Black Fleet Crisis was eventually resolved at the Battle of N'zoth, in which resulted in the defeat of the Duskhan League and the death of Viceroy Spaar. Additionally, Pakkpekatt's mission came to an end when Jedi Master Luke Skywalker rescued Calrissian and his team from the Teljkon Vagabond. In the wake of the Black Fleet Crisis, Rieekan retired."}, {"tag": "h3", "text": "The Yuuzhan Vong War"}, {"tag": "p", "text": "With the advent of the Yuuzhan Vong War, Rieekan returned to service, and headed the Coruscant Planetary Defense Force. Once again, the Alderaanian held the rank of general. In 27 ABY, a disturbance in Coruscant's passenger lanes attracted Rieekan's attention. A flight from Rogue Squadron, headed by Colonel Gavin Darklighter, was moving to inspect the freighter Sweet Surprise, and had ordered them to stand down, but the ship continued its approach. Rieekan contacted Han Solo, who was following the Sweet Surprise in the Millennium Falcon. Solo proceeded to expound upon his past dealings with one of the crewmembers, Plaan, a Weequay, and his generally suspicious dealings, including refugee-selling. Rieekan then contacted Darklighter, and ordered him to not allow the Sweet Surprise within the mine shell that had been deployed around Coruscant. The ship was later boarded, and revealed to have been carrying Jedi-hunting Yuuzhan Vong-engineered voxyn, intended for deployment on Coruscant."}, {"tag": "p", "text": "Some time afterward, Rieekan was contacted by Chief of State Borsk Fey'lya, and they discussed the involvement of the New Jedi Order in the ongoing war. Fey'lya had been decidedly hostile to the Jedi over the course of the war, but as the tide had turned against the New Republic, the Bothan had no choice but to reverse his stance. In addition to discussing the matter with Rieekan, Fey'lya also contacted Generals Wedge Antilles, Garm Bel Iblis, Admiral Traest Kre'fey, and others. They all attended via hologram as the Yuuzhan Vong Nom Anor addressed the New Republic Senate, and called for the blood of the Jedi. Fey'lya, in response, announced his change of heart. The Yuuzhan Vong responded with an all-out attack against the galactic capital."}, {"tag": "p", "text": "As the enemy approached Coruscant, the enemy Warmaster, Tsavong Lah, began utilizing ships filled with captive refugees from conquered worlds to shield his own craft. Admiral Sien Sovv, who was charged with leading the defense of Coruscant, was unwilling to destroy such craft, while General Bel Iblis was more willing to make such sacrifices. As such, Sovv was forced to attend a senate meeting via hologram, in which Fey'lya declared that he would be replaced by Bel Iblis as overall commander of the defense. Rieekan disagreed with the move, and had his hologram stand by Sovv's in the senate chamber, as did those of several other senior officers in the military, such as Admiral Kre'fey and Commodore Brand."}, {"tag": "p", "text": "The Yuuzhan Vong continued their approach, however, and began to approach Coruscant's surface. Rieekan commanded ground forces, and issued orders to surface artillery. Although they were able to inflict damage on the incoming forces, the battle, and Coruscant itself, was lost. The New Republic retreated, leaving the planet to be overrun by the invaders, and Chief of State Fey'lya committed suicide by blowing up half of the Imperial Palace, killing many of the Yuuzhan Vong by doing so. As the Republic retreated, Rieekan, working alongside General Bel Iblis and Lando Calrissian, was able to delay the invasion long enough to allow many evacuation transports to depart the capital in safety."}, {"tag": "p", "text": "With the New Republic smashed at Coruscant, it was forced to reform itself into the Galactic Federation of Free Alliances, which was centralized at Mon Calamari. From there, the war against the Yuuzhan Vong continued to be waged. In 29 BBY, Rieekan attended a meeting aboard the cruiser Ralroost, along with Supreme Commander Sovv, Admiral Kre'frey, Grand Admiral Pellaeon, Generals Antilles, Bel Iblis, Farlander, and Cracken, amongst others, including Han and Leia Solo, and their daughter Jaina. During the meeting, intelligence from spies on occupied Coruscant, or Yuuzhan'tar as it was now called, was discussed, as well as the newly-discovered Yuuzhan Vong plans to strike at Mon Calamari. The Alliance was able to rally to the defense of their new capital, however, and defeat the enemy at the Defense of Mon Calamari."}, {"tag": "p", "text": "The new victory spurned the Alliance on towards a dramatic strike against Coruscant itself. The Galactic Alliance and numerous other factions from across the galaxy were able to liberate the galactic capital, and in the ensuing conflict, brought about the death of Supreme Overlord Shimrra Jamaane. Rieekan was still aboard the Ralroost, and along with many of the military personnel present for the earlier meeting, in addition to Chief of State Cal Omas, was present for the Yuuzhan Vong surrender, presented by Warmaster Nas Choka. As a result, the Yuuzhan Vong War was brought to a close."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Rieekan was perceived by his men to be a grim and stern man, who was in a constant state of worry and concern. The general was in fact, quiet and unassuming. Initially, he had been an optimist, but after blaming himself for the destruction of Alderaan, he became morose and grim. Even in the ensuing months, memories of the event haunted him. He fought because he felt it was his duty to avert and potential disasters or tragedies that might occur in the future, even though he did not particularly want to. Rieekan tried to make sure that he never risked the lives of those under his command, and decided to act with aggressive caution following the Alderaan incident, when he once would have acted with confident subtlety. He never put his emotions on display, and instead constantly retained his determined demeanor. While commanding at Echo Base, Rieekan's grim and downbeat mood was misunderstood by most, but engineer Ken Monnon possessed a complete understanding of the general's past, and would not tolerate any complaints about Rieekan's demeanor from his men. After the evacuation of Hoth, Rieekan would continued to be haunted further, by the deaths of the Alliance soldiers who had made the ultimate sacrifice as Echo Base was evacuated. Following the liberation of Coruscant, Rieekan grew more optimistic, and a visual change in his demeanor was noted by his colleagues."}, {"tag": "p", "text": "He stuck by his ideals, and lived by them, which led him to gravitate towards fellow soldiers with similar mindsets. Rieekan possessed natural leadership skills, which allowed him to rapidly rise through the ranks of the Judicial Forces. He disagreed with Palpatine's policies to such an extent that he felt a need to do significant damage to the New Order. Rieekan also admired Viceroy Bail Organa, hailing him as a trustworthy man. The general felt grief for Organa's loss during the destruction of Alderaan. Later, when Rieekan was in the Coronet Capital Tower as it was being attacked by Imperial forces, he was genuinely more concerned about the lives of the innocent people within, rather than his own."}, {"tag": "p", "text": "Rieekan was a strong and able tactician, and had been so from an early age. His vast knowledge in that area made him a highly effective base commander. He was not amused by flippancy, but while he did not always agree with men like Captain Han Solo, he could still acknowledge that they were genuinely good people. In return, he was perceived as a good soldier. Rieekan cared for his men—so much so that he once privately admitted that he \"bleeds when they bleed, and dies when they die.\" Even though he was able to make sacrifices, he never found the task of sending men to their deaths easy. As such, Rieekan would personally wish his troops good luck as they ventured into combat. Later in his career, faced with an expensive recovery mission when the Teljkon Vagabond entered hyperspace with Lando Calrissian aboard, Rieekan was loathe to abandon an ally of the New Republic purely because the operation would be expensive. Later, Rieekan was taken aback by Colonel Pakkpekatt's adamant insistence that he find and assist Calrissian when he was stranded on the Vagabond. Although Rieekan usually was strict with his orders and mandates, he relaxed the rules slightly for Pakkpekatt, and warned the colonel not to try his patience."}, {"tag": "p", "text": "Rieekan was noted as a man who spoke infrequently, but whenever he chose to offer his opinion on a given matter, it was usually an opinion worth hearing. The general once commented on the modus operandi of the Katarn Commandos, who were answerable to the New Republic Chief of State, but were allowed to determine specifically how their missions were conducted internally. Rieekan's summation was that the process was like \"tossing a nest of fire wasps into a bursa's lair and seeing what happens next.\" He was also incisive—during the Black Fleet Crisis, he was able to divine Viceroy Spaar's intentions based on his actions quicker than Chief of State Organa Solo could. The general was respected amongst the command hierarchy, with people such as Admiral Ackbar holding the belief that they could rely on him for support in testing times. Rieekan would demonstrate his support for his fellow officers in such cases as Supreme Commander Sovv's disciplinary hearing at the hands of Chief of State Fey'lya during the Yuuzhan Vong invasion of Coruscant."}, {"tag": "p", "text": "In addition to his military skills, Rieekan could also understand Basic, Huttese, Ithorese, Mon Calamarian, Shyriiwook, and Sullustese."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "General Rieekan first appeared in Donald F. Glut's novelization of Leigh Brackett and Lawrence Kasdan's script for Star Wars: Episode V The Empire Strikes Back. In the film itself, Rieekan was portrayed by Bruce Boa. The role was later taken by Merwin Goldsmith for Brian Daley's radio drama adaptation of the film, and the character was then voiced by Neil Ross in the video game Star Wars: Rogue Squadron. For that game's sequels, Rogue Leader and Rebel Strike, the role was taken by Dan Barton. If the player shoots down far too many allies, escorts, or convoys during a mission, the mission will end with Rieekan calling Luke Skywalker back to the Rebel Base so he can discuss with Luke privately on the nature of Luke's tactics on the battlefield."}, {"tag": "p", "text": "Rieekan has made several appearances in the Expanded Universe, where the character was given his first name of \"Carlist,\" in the sourcebook Galaxy Guide 3: The Empire Strikes Back, first published in 1989. Rieekan also served as a player character in the games Assault on Hoth and The Battle of Hoth. The character makes a brief appearance in the non-canon comic issue Star Wars Infinities: The Empire Strikes Back 1, where an alternate set of events to those depicted in the film of The Empire Strikes Back are shown. Rieekan's role is greatly reduced, with the most significant changes affecting his character directly being the death of Luke Skywalker from the wampa attack, and the subsequent funeral, which distracts the Alliance from the Imperial approach. In the issue, Rieekan and Echo Base are caught off-guard by the Imperial assault."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "Several inconsistencies have cropped up in regards to Rieekan's appearances in various adaptations and Expanded Universe works. A plot summary of The Empire Strikes Back included in a promotional magazine for the film states that Rieekan is killed during the Battle of Hoth. In Star Wars 39, Rieekan's lines during his initial interaction with Han Solo are given instead to Major Derlin. Later in that same comic line, for issue 77, an aging man identified only as the \"General\" briefs Organa and Skywalker on a mission to Kabray Station. Although no other generals had briefed the characters in post The Empire Strikes Back issues before other than Rieekan, the character's lack of identification makes Rieekan's appearance in the issue only possible, not certain. For the Dark Empire audio drama, Rieekan's lines from the comic are instead given to Mon Mothma, and in the comic adaptation of The Last Command, Rieekan's lines are given to Admiral Drayson. For the Rebellion Era Campaign Guide, Rieekan's entry is erroneously illustrated with a picture of Crix Madine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon and cut appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}