{"url": "AD-4M", "categories": ["Category:Canon articles", "Category:Administrative droids", "Category:Resistance droids"], "nodes": [{"tag": "h1", "text": "AD-4M"}, {"tag": "p", "text": "AD-4M, nicknamed Aydee and the concierge, was an administrative droid that handled base logistics for the Resistance at their outpost on the moon Ajan Kloss during their war against the First Order. The droid was usually isolated in a control room, but due to the unfinished nature of the Ajan Kloss base it worked amongst the other personnel, resulting in some playing pranks on it."}, {"tag": "p", "text": "In 35 ABY, the droid was sat at a terminal in the base next to General Leia Organa and Jedi-trainee Rey as they discussed the latter's training. It later attended a meeting at the base in which intelligence on a new Sith fleet aiding the First Order was discussed and after that was present when the Resistance discovered that they were being sent a route to the planet Exegol."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Resistance concierge"}, {"tag": "p", "text": "AD-4M was the designation of an administrative droid that served the Resistance during its war against the First Order, although it was also known simply as \"Aydee\". It handled the logistics of various Resistance bases and was tasked with data processing and traffic management. The droid was generally stationed within a control room that kept it isolated from other personnel, but in the Resistance's base on the jungle moon Ajan Kloss it worked out in the open amongst the other Resistance members due to the base's unfinished nature."}, {"tag": "p", "text": "This resulted in other base personnel jokingly referring to AD-4M as \"the concierge\" and making requests for luxury goods that only the most well-appointed hotels would be able to provide. After being caught out more than once by these pranks, AD-4M altered one of its subroutines to try and filter out sarcasm, but had mixed results."}, {"tag": "h3", "text": "Many meetings"}, {"tag": "p", "text": "In 35 ABY, AD-4M was sat at a terminal next to the parked CR90 corvette Tantive IV in the Ajan Kloss base when the Jedi in training Rey returned from an training session in the nearby jungle. Rey and General Leia Organa stood next to AD-4M and discussed Rey's lack of success during the session. The droid later attended a meeting in the base at which Commander Poe Dameron revealed that they had received intelligence from within the First Order about the return of the Sith Lord Darth Sidious and the impending threat of a Sith fleet on the planet Exegol."}, {"tag": "p", "text": "After Dameron returned from a mission to the planet Pasaana, AD-4M was stood at a terminal within one of the Ajan Kloss base's caves when the memory wiped protocol droid C-3PO reunited with his companion R2-D2. The administrative droid then moved to sit at another terminal within one of the base's clearings and was present when C-3PO announced that R2-D2 was receiving a message from the X-wing starfighter of Jedi Master Luke Skywalker. General Finn then realized that the signal was Rey showing them the route to Exegol, prompting the Resistance to scramble its forces for an attack that would ultimately lead to the defeat of the Sith and the First Order."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "AD-4M was a bipedal administrative droid with white plating. Its central processing dome housed a AA-5 VerboBrain and had a vocabulator port at the base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "AD-4M first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}