{"url": "Carnivorous_seaweed", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Aquatic plants", "Category:Carnivorous plants", "Category:Inner Rim species", "Category:Plants of undefined sentience"], "nodes": [{"tag": "h1", "text": "Carnivorous seaweed"}, {"tag": "p", "text": "Carnivorous seaweed was an aquatic carnivorous species of plant that grew in the oceans of the planet Hapes and used its tentacles to suffocate its victims. In 23 ABY, Jedi trainees Tenel Ka, Lowbacca, Jacen Solo, and Jaina Solo were nearly killed by a patch of carnivorous seaweed in the Hapan ocean when Ambassador Yfra sabotaged their wavespeeder. Later, the young Jedi drove their wavespeeder into some carnivorous seaweed to kill a group of Bartokk assassins who were following them. Those assassins were sent by Yfra to kill the matriarch of Hapes, Ta'a Chume, so Yfra could assume the role of Hapan monarch."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Carnivorous seaweed was a species of aquatic plant that grew in at least one of the oceans of the planet Hapes. The seaweed had many tentacles, which were green, thick, and rubbery with long thorns. When cut, the tentacles oozed a syrupy green liquid. The carnivorous seaweed grabbed prey with its tentacles and then suffocated it by constriction. The plant also grew large scarlet flowers, with blue fruits in the center that resembled eyes. In 23 ABY, Jacen Solo, who was training at Jedi Master Luke Skywalker's Jedi Praxeum, tried and failed to use the Force to find the brain of a patch of carnivorous seaweed. He stated that the seaweed seemed to be all reflexes and hunger but that it was also at least partially sentient, as it could respond to its surroundings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 23 ABY, a patch of carnivorous seaweed in the Hapan ocean nearly took the lives of Jedi trainees Tenel Ka, Lowbacca, and Jacen and Jaina Solo after their wavespeeder was sabotaged by Yfra, the Hapan matriarch's personal ambassador, during her plot to overthrow the Hapan monarchy. After escaping from the seaweed by using their lightsabers and knives, and returning to Reef Fortress, where they were staying, the young Jedi helped the matriarch, Ta'a Chume, escape from Bartokk assassins by climbing out the window of her bedchamber, in which she was trapped. Yfra had sent the assassins to kill the matriarch so Yfra herself could be the monarch in place of those of the Hapan Royal Family."}, {"tag": "p", "text": "The Jedi trainees escaped the island in a small wavespeeder; however, they were chased by the Bartokks in their assault boat. The friends decided to steer their wavespeeder into some carnivorous seaweed in the hope that the assassins would follow them and be killed by the seaweed. The assassins did follow the wavespeeder, and, after Chume set their craft off-balance using a small blaster she was carrying, they were pulled into the ocean by the carnivorous seaweed. The young Jedi escaped the seaweed and delivered Chume to her palace in time to stop Yfra from overthrowing the monarchy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Carnivorous seaweed first appeared in the 1996 young reader's book Young Jedi Knights: Lightsabers, by Kevin J. Anderson and Rebecca Moesta. In 1998, it was mentioned in both Stephen J. Sansweet's Star Wars Encyclopedia, under the entry for \"Hapes Consortium,\" and Daniel Wallace's The Essential Guide to Planets and Moons, the latter of which provided the seaweed's first illustration. It was also mentioned in James Luceno's 2000 novel Jedi Eclipse of the Agents of Chaos Duology. Later, in 2008, it was mentioned in the entry for \"Reef Fortress\" in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}