{"url": "Carnivorous_plant", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Carnivorous plants", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Carnivorous plant"}, {"tag": "p", "text": "Carnivorous plants were plants that gained nutrients through the consumption of animal flesh. Numerous distinct species of carnivorous plants were found on various planets throughout the galaxy, each possessing unique attributes best suited to the capture and consumption of animals in their environments. Most carnivorous plants grew in nutrient-poor soil, making the consumption of animal flesh necessary as a nutritional supplement."}, {"tag": "p", "text": "While most carnivorous plants simply lay in wait for prey to come to them, upon which their unconscious feeding mechanism would commence automatically without exhibiting traits associated with sentient intelligence, some, such as the reeksa of Iego, demonstrated aggressive predatory animal-like behavior, while a highly advanced carnivorous plant native to Opop Hibbedit was unique among plants in its possession of the capability to speak and voice its thoughts. The sarlacc species was another anomaly, inconclusively determined to be either an animal or a bizarre variety of carnivorous plant."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "Several species of carnivorous plants lived in the galaxy, including those that actively consumed animals, often killing and eating the entire creature, such as the reeksa or the parasitic saava, and those like the immobile thirstgrass, which only consumed animal matter passively. Many active carnivorous plants were capable of sensing the presence of prey or potential danger, whether by physical contact or other means, prompting the plant to react accordingly. With the exception of diet, carnivorous plants were akin to non–flesh-eating plants in most respects, drawing sustenance from sunlight and being generally green in coloration, though the chatterplant notably lacked green pigment. An exception to this was the sarlacc, a species that was neither phototrophic nor green in color, and whose possible classification as a plant was disputed. Nutritional supplementation through the consumption of animal flesh was usually necessitated in carnivorous plants by the nutrient-poor soil in which they tended to grow."}, {"tag": "p", "text": "While many carnivorous plants were non-sentient, and consumed flesh entirely unconsciously and automatically, among active carnivorous plants, some species displayed potential intelligence in their predatory and defensive behavior. Notably, a species of carnivorous plant native to Opop Hibbedit exhibited complex thought and personality, and was capable of speaking Galactic Basic Standard."}, {"tag": "h3", "text": "Kashyyykian carnivorous plants"}, {"tag": "p", "text": "The luscious planet Kashyyyk was native to at least three species of carnivorous plants. The jaw plant, found in the dark, moist Kashyyykian Shadowlands, possessed broad fleshy traps that grew horizontal to the ground on thick veiny stalks. The traps emitted an airborne chemical that was used to lure creatures to them with the promise of food by triggering their olfactory receptors and causing a sense of hunger in their brains. The human Cal Kestis likened the scent to that of jogan fruit. Should an animal be led to step onto a trap, the jaws would quickly and firmly snap closed around it and begin digestion, devouring the plant's prey whole. However, a captive armed with a lightsaber could easily use it to cut themselves free and escape consumption."}, {"tag": "p", "text": "The saava, also found primarily in the Shadowlands, was a snake-like parasitic plant with flower-like heads on the ends of long ropy green vines, which gave off a faint red luminescence. Upon detecting a potential host on which to feed, the saava would slowly creep towards it by extending its vines until it was within reach of its target, but would quickly retract if danger was sensed. Upon contact with its prey, the plant would latch onto and attach itself to it and proceed to subsist on its catch for a period of months or years. Notably, the saava's vine-skin was extremely resistant to lacerations, even being capable of withstanding direct strikes from a lightsaber. Despite its apparent durability, the plant's repulsion to potential danger was considerable."}, {"tag": "p", "text": "The syren plant was another dangerous carnivorous plant known to grow in the forests of Kashyyyk."}, {"tag": "h3", "text": "Carnivorous plants throughout the galaxy"}, {"tag": "p", "text": "The creepervine was a carnivorous plant that could be found on multiple worlds, including the swampy Wild Space planet nicknamed \"Graf-World\" as well as the planet D'Qar. It captured prey by ensnaring it with its thick thorny vines, and ate with a toothy mouth residing in a scaly reptilian head. The plant's tight grip and multitude of maneuverable vines made it difficult to escape its grasp. However, a captive capable of wielding a fusioncutter could use it to cut themselves free of the creepervine. The plant was also vulnerable to blasterfire; being fired upon would cause it to release its grip on a captive."}, {"tag": "p", "text": "A sentient species of carnivorous plant native to Opop Hibbedit was distinct from all other known species of flesh-eating plants in that it possessed the ability to speak Galactic Basic, which it used to express complex thoughts and exhibit personality. The plants used their powerful, dexterous vines to capture prey and bring it to their toothy, animal-like mouth for consumption. The mouth was situated in a large brightly-colored head with a single eye and a collar of leaves at its base. An especially thick, long vine served as the plants' main body, and was capable of maneuvering like a serpent in order to mobilize the entire plant. Notably, the plants held an aversion to magnetic rock chimps."}, {"tag": "p", "text": "The reeksa was a species of enormous weed-like carnivorous plant native to the planet Iego, where it survived in deep low-light canyons by capturing and digesting live prey. Reeksa plants were equipped with numerous sensitive thorny vines spread across the floor and walls of the canyons in which they dwelled, which, upon being physically disturbed, alerted the plant to the presence of a potential meal. The reeksa would then actively engage in capturing its prey with its multitude of large thorn-toothed heads, displaying aggressive predatory behavior. The heads were also capable of producing a threatening hiss akin to that of a reptilian animal. The sentient natives of Iego considered the reeksa to be very dangerous and not to be bothered, though the roots of the plant were a vital ingredient in the cure for the fatal Blue Shadow Virus."}, {"tag": "p", "text": "A less dangerous carnivorous plant, thirstgrass, was a carnivorous grass species native to the grasslands of Irudiru that consumed animal matter passively by cutting the skin of passing animals with its sharp leaf blades and absorbing their blood."}, {"tag": "h3", "text": "Domesticated carnivorous plants"}, {"tag": "p", "text": "The morogian snap plant was a species whose small size allowed it to be grown in pots. The plant possessed two broad leaves, between which a thin stem grew. On the end of this stem was the plant's eating mechanism, a fleshy three-lobed mouth lined with small teeth. Similar to the reeksa, the plant displayed predatory aggression and the ability to produce sound, though a human could handle a potted morogian snap plant without being harmed by it. The plant also produced a purple substance, which could be extracted from a deceased plant and used as a hair dye."}, {"tag": "p", "text": "Chatterplants were low-growing multi-lobed carnivorous plants found on the forested planet Arbiflux that lacked green pigment, instead being entirely dull orange in color. A chatterplant consisted of a biting bulb with four to five lobes nestled against the ground, with a multitude of spindly vines extending outwards. When alarmed, a chatterplant extended its lobes, revealing a glowing red spherical mass in the center of its bulb, and produced a loud chattering sound. The plants could be domesticated, and were useful as alarms, as their chatter could warn of potential danger."}, {"tag": "h3", "text": "The sarlacc"}, {"tag": "p", "text": "The sarlacc was an omnivorous species whose classification was a subject of discourse among xenobiologists, as research was inconclusive as to whether it was a plant or an animal. However, the inherent danger associated with studying sarlaccs discouraged investigation into the matter. Though they began life as mere spores, sarlaccs eventually grew to actively hunt prey during their juvenile stage. After approximately 30,000 years, sarlaccs matured fully, growing to immense size and rooting themselves underground, with only their gaping mouths protruding. For the remainder of its life following rooting, a mature sarlacc simply would lay in wait for unfortunate creatures to wander close, grabbing and swallowing them with its beaked tongue. Upon swallowing an animal, a sarlacc would then proceed to digest its catch in a number of stomachs over the course of a millennium. Sarlaccs also possessed a number of tentacles, which they could use to aid in catching animals."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic Era"}, {"tag": "p", "text": "In 21 BBY, upon the revival of the previously-extinct fatal Blue Shadow Virus by the demented Separatist Doctor Nuvo Vindi, Jedi Knights Obi-Wan Kenobi and Anakin Skywalker sought out the root of the reeksa in order to concoct a cure for the virus before it proved deadly to their infected allies on Naboo, on the advice of Captain Typho. After arriving on the plant's native planet of Iego, the pair located a canyon-dwelling reeksa thanks to the young Jaybo Hood, also receiving a warning from the boy to avoid disturbing the dangerous plant's vines to prevent it from being alerted to their presence. After accidentally failing to heed the warning, Kenobi and Skywalker frantically dug up and collected a portion of the hungry plant's root and narrowly escaped the chasm. As they climbed up the canyon walls to safety, Skywalker and Kenobi each swiftly decapitated one of the reeksa's attacking vines using their lightsabers. The Jedi were later successful in using the root to create an antidote for the virus, saving most of their infected friends."}, {"tag": "p", "text": "During the second year of the Clone Wars, B1-series battle droid Q5-7070 was separated from his squad on the luscious astronomical object Opop Hibbedit. While attempting to make his way back to Separatist forces, the droid was attacked by two of the sentient carnivorous plants native to Opop Hibbedit, which attempted to destroy him in order to use his dismembered components as decoration for their home. The plants complimented the droid's metallic appearance, assuring him that his pieces would make a fine addition to their home, which, in their opinion, was in need of decoration. However, the plants abandoned Q5-7070 unharmed when his magnetism attracted magnetic rock chimps to the area."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Around 18 BBY, the Graf family was exploring an unknown planet, which would later be nicknamed \"Graf-World,\" when Lina Graf was ensnared by a creepervine. Her screams alerted her brother, Milo, who tried unsuccessfully to throw her fusioncutter to her at her frantic request. Upon Milo's failure, Morq, the Grafs' pet Kowakian monkey-lizard, climbed the vine itself to give Lina the tool, which she then used to cut herself free of the plant's grasp. Sometime later, in a skirmish against Imperial Captain Visler Korda's stormtroopers, Milo caused a creepervine to attack the troopers and ensnare their commander by exciting the plant, shooting it with his net gun. Though the plant released the commander unharmed upon being fired on by his stormtroopers, the Graf children managed to escape."}, {"tag": "p", "text": "During approximately 17 BBY, the human woman Lona Aphra and her daughter Chelli grew four-lobed chatterplants on their farm on Arbiflux, where they were used to act as alarms to guard their nunas against predators. Though Lona dealt with the plants patiently, Chelli harbored a disdain for them, believing that they had a mutual hatred for each other due to the plants biting her. Chelli also frequently spent time counting dust motes on the chatterplants. When the farm fell under attack by raiders, the Aphras' chatterplants noisily expressed their alarm. When Chelli escaped the attack, she passed through a patch of wild five-lobed chatterplants."}, {"tag": "p", "text": "During his mission to rebuild the Jedi Order around 14 BBY, Jedi Padawan Cal Kestis and the BD unit BD-1 encountered both jaw plants and saava during their expedition to the top of the Origin Tree on Kashyyyk. Kestis made use of of the jaw plants's large traps as platforms to traverse difficult areas of the Shadowlands, jumping between them with enough speed to avoid being eaten. On multiple occasions, groups of saava attempted to make Kestis their host, though he managed to avoid their reach or ward them off with his lightsaber. While the plants made him uneasy, Kestis found himself interested by the information gathered about them thanks to BD-1's datascans."}, {"tag": "p", "text": "During the Galactic Civil War, Minister Amilyn Holdo killed potted morogian snap plants to use their liquid as a purple hair dye. While part of the crew of the Rebel Alliance CR90 corvette Candor, Holdo killed a particularly aggressive plant in order to dye her blond hair, its dying utterences attracting disturbed notice by other members of the starship's crew. Shortly after she completed the dyeing process, the Candor came under fire by an Imperial-class Star Destroyer, knocking the plant's corpse from Holdo's table."}, {"tag": "h3", "text": "New Republic Era and beyond"}, {"tag": "p", "text": "In 5 ABY, near the end of the Galactic Civil War, New Republic operatives Norra Wexley, Temmin Wexley, and Jom Barell, former Imperial Sinjir Rath Velus, and bounty hunter Jas Emari were enlisted to locate the missing New Republic heroes Han Solo and Chewbacca. Believing that the prison architect Golas Aram would have information useful to their cause, the team traveled to his compound on Irudiru, where they encountered thirstgrass native to the area. Temmin and Rath Velus were displeased by the wounds the grass was passively inflicting on them, which they gained while crawling through it, and acted dismissively towards Emari's explanation of the plant."}, {"tag": "p", "text": "At some point after the fall of the Galactic Empire, Emil Graf was told the tale of Q5-7070's misadventures on Opop Hibbedit, including his brief capture by the two sentient carnivorous plants, by the monster droid CR-8R \"Crater,\" longtime companion of the Graf family, who incidentally had also been present for Lina and Milo Graf's creepervine encounter many years prior. Sometime later, Emil encountered a member of the Tarinna species on the planet Nelgenam, who attempted to feed on his memories and the stories that he'd heard, causing him to relive many of them in his imagination. Among the tales was that of Q5-7070, whose place Emil briefly imagined himself in, caught in the vines of a carnivorous plant on Opop Hibbedit. Though Emil survived his encounter on Nelgenam, the stories relived by him were lost to the Tarinna."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first confirmed appearance of carnivorous plants in canon was that of the reeksa in \"Mystery of a Thousand Moons,\" the eighteenth episode of Season One of the Star Wars: The Clone Wars television series, released on February 13, 2009. Carnivorous plants were first identified in the episode guide for Mystery of a Thousand Moons on StarWars.com. While the sarlacc appeared decades prior to the reeksa in 1983's Star Wars: Episode VI Return of the Jedi, the species' classification as a plant is not conclusive."}, {"tag": "p", "text": "In the Legends continuity, flesh-eating plants made their first appearance in \"The Three Lessons,\" the eleventh episode of the Ewoks animated series' first season, which aired on November 16, 1985. In the episode, the titular Ewoks set out to tame a rampant carnivorous stranglethorn."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "A species of brown and blue carnivorous plant appeared in the non-canon short BB-8 and the Jungle Adventure - Chapter 1, which aired on the StarWarsKids.com website and YouTube channel on August 9, 2019, in which one of the plants snapped up the astromech droid BB-8 on D'Qar before promptly spitting him out. Another species of large carnivorous plant also made a non-canon appearance in the 2016 video game, LEGO Star Wars: The Force Awakens. In it, one of the aggressive, reeksa-like plants ate a frog, while another ate a member of Han Solo's rathtar-hunting team on Twon Ketee. In the July 11, 2016[source?] Season One episode of LEGO Star Wars: The Freemaker Adventures entitled \"Crossing Paths,\" a bulbous blue carnivorous plant aggressively snapped up the B1 battle droid R0-GR \"Roger\" when he and his companions found themselves stranded on Felucia, though he was forcefully spat out, the plant finding him inedible, all much to the droid's disdain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canonical appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}