{"url": "AD-W4", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Confederacy of Independent Systems individuals", "Category:Masculine programming", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "AD-W4"}, {"tag": "p", "text": "AD-W4, also referred to as Ay-Dee, was a mercenary droid that General Grievous hired to oversee the Separatists operations on the planet Hissrich during the Clone Wars. AD-W4 was ultimately destroyed after a duel with Jedi Master Mace Windu on Hissrich."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shortly after the beginning of the Clone Wars, AD-W4 was approached by the cyborg General Grievous, the Supreme Martial Commander of the Separatist Droid Armies. Grievous hired Ay-Dee to oversee the Separatist operations on the planet Hissrich, a job the droid mercenary only accepted after seeing the pay he would get from the job."}, {"tag": "p", "text": "While in Hissrich, AD-W4 first heard of some Jedi's arrival when they ambushed one of the droid patrols. AD-W4 learned of this when a B1 battle droid reported it to him. Later on, Rissa Mano accidentally activated a B1-series battle droid scout, which gave AD-W4 the chance to set up an ambush for the four Jedi. During the ambush on the Hissrich operation, AD-W4 faced the Jedi Master Mace Windu in single combat. The robot mercenary eventually bested him for a few seconds and escaped. He attempted to increase his credit payment by lying to General Grievous about besting and killing Windu. To this Grievous asked for Mace Windu's lightsaber as proof, which forced AD-W4 to take further action against the Jedi. Although Ay-Dee bested Windu the first time, Windu managed to critically wound Ay-Dee with his lightsaber during the second duel. Realizing that he had lost, AD-W4 detached his head from his body in an attempt to escape, but Windu managed to blow up AD-W4's head using the Force."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Personality"}, {"tag": "p", "text": "AD-W4 was a tall, fearsome droid of an unknown model, with red photoreceptors and purple plating with red markings. He regarded credits as the one true ruler of the galaxy. He was also sadistic and bloodthirsty, and was, according to General Grievous, known for having a \"flare [sic] for the dramatic.\""}, {"tag": "p", "text": "He was disdainful of the Jedi Order, regarding its members as arrogant and their beliefs—particularly their commitment to peace— as asinine. He also disliked the Separatist battle droids he was assigned to command, viewing them as stupid and totally expendable, an attitude not unlike that of his final client, General Grievous. He was generally annoyed by their behavior and disliked how they addressed him by multiple different ranks."}, {"tag": "h3", "text": "Skills and abilities"}, {"tag": "p", "text": "AD-W4 carried a DL-44 heavy blaster pistol and also had some skill with an electrostaff, as he was able to hold his own against and on occasion overpower Jedi Master Mace Windu. He could also pilot his own Single Trooper Aerial Platform."}, {"tag": "p", "text": "The droid mercenary had jets built into his feet - allowing him to fly - and an energy blaster built into his wrist. His body was built so as to have a high degree of physical strength, able to pick up and hurl a ball of rubble much larger than himself."}, {"tag": "p", "text": "He was also able to remain active even after being stabbed through the chest with a lightsaber. As a last resort, he could detach his head from his body and fly away at high speed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}