{"url": "AD-series_weapons_maintenance_droid", "categories": ["Category:Legends articles", "Category:AD-series weapons maintenance droids", "Category:Arakyd Industries products", "Category:Maintenance droid models", "Category:Second-degree droid models"], "nodes": [{"tag": "h1", "text": "AD-series weapons maintenance droid"}, {"tag": "p", "text": "The AD-series weapons maintenance droid was Arakyd Industries's answer to small arms maintenance for large armies."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Arakyd originally marketed the droid to the Empire, saying that the droid could heavily outperform any organic in small arms maintenance. When the Empire called for a test, the AD performed abysmally. According to the final test, the AD only performed 0.0006% more efficient than a trained Imperial weapons technician. Arakyd was shamed."}, {"tag": "p", "text": "Having assumed that their close ties with the Empire would guarantee a sale, Arakyd had already started full-scale production before the tests even commenced. Stuck with thousands of units priced to sell to the Empire, Arakyd had to change their marketing plan to include mercenary units, local law enforcement agencies and bounty hunters. It cost 13,840 credits new."}, {"tag": "p", "text": "In this market, the droids prospered, but not as well as Arakyd had hoped. The AD often received many after-market modifications. These modifications allowed the droids to pick up several new skills, such as starship weapons maintenance and general repair."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One of the most famous AD droids was GSAD-43, an armorer in the service of House Salaktori. When GSAD-43's master was assassinated, he took up arms and hunted down the killers. Afterward, GSAD-43 would prowl the spacelanes as a well-armed and efficient bounty hunter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Some sources call this a first-degree droid while others label it as a second-degree droid."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}