{"url": "Carosi_XII", "categories": ["Category:Legends articles", "Category:Carosi XII locations", "Category:Low-gravity planets", "Category:Nembus sector planets", "Category:New Republic planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Carosi XII"}, {"tag": "p", "text": "Carosi XII was a planet in the Outer Rim Territories colonized by the Carosites in 200 BBY after the destruction of Carosi IV. It was best known as a center of healing and tourism, attracting numerous and diverse visitors due to its location along a prominent trade route. Because it was also one of the few worlds to openly support the Rebel Alliance, Carosi XII also served as a safe-haven for free-traders and Alliance and New Republic agents."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Carosi XII was girdled by the vast Eurae Mountains, with most of its remaining surface dominated by plains and large glaciers. The Avuae Sea was the planet's only large body of water, and served as a social and cultural nexus for the Carosites. The Avuae's high mineral content prevented the sea from freezing over, and the water was considered refreshing by Carosites and other beings who could tolerate its bracing cold."}, {"tag": "p", "text": "Continuing volcanic activity on Carosi XII led to the formation of the planet's most popular tourist destination, the hot springs near Newlife Point, which had natural healing properties. Visitors could get from Newlife Point to the crystalline cave that contained the hot springs via either an underground rail system or pleasure boat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Astronomers correctly predicted the expansion of the star Carosi into a red giant, so prior to this cataclysm, terraforming efforts were begun on Carosi XII. The effort proved fruitful, and after their original homeworld was swallowed up by Carosi, the Carosites relocated to the twelfth planet (which was now the seventh planet, but maintained its original nomenclature)."}, {"tag": "p", "text": "During the Galactic Civil War, Polo Se'lab commanded Rebel forces on the planet, and Sayer Mon Neela was the base's tactician. Later, Carosite leader Omo Taj permitted the New Republic to construct a New Republic outpost on the side of a mountain near the Avuae's north shore. This outpost was commanded by Balderik Rajana."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Carosi XII is said to have only one moon in Planets of the Galaxy, Volume Two and in its reprint, The Star Wars Planets Collection. However, in the novel Planet of Twilight, a reference is made to the existence of a factory on Carosi's larger moon, implying more than one moon. No canonical explanation for this discrepancy has yet been given."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}