{"url": "Carrie_Fisher", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Deceased actors", "Category:LEGO Star Wars: The Force Awakens voice actors", "Category:Movie screenwriters", "Category:Rogue One: A Star Wars Story voice actors", "Category:Star Wars original trilogy actors", "Category:Star Wars sequel trilogy actors", "Category:The Star Wars Holiday Special actors"], "nodes": [{"tag": "h1", "text": "Carrie Fisher"}, {"tag": "p", "text": "Carrie Frances Fisher (October 21, 1956–December 27, 2016) was an American actress, best known for her portrayal of Princess Leia Organa in the Star Wars franchise."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Fisher was born Carrie Frances Fisher in Beverly Hills, California on October 21, 1956, the daughter of the singer Eddie Fisher and the actress Mary Frances \"Debbie\" Reynolds; her paternal grandparents were Jewish immigrants from Russia. Her younger brother is Todd Fisher. Her half-sisters are actresses Joely Fisher and Tricia Leigh Fisher, whose mother is actress Connie Stevens."}, {"tag": "h3", "text": "Star Wars"}, {"tag": "p", "text": "In 1977, Fisher starred as Leia Organa in the original Star Wars film, directed and written by George Lucas, along with Mark Hamill, Harrison Ford, Peter Cushing, and Alec Guinness. Star Wars was a huge success and made her internationally famous. Fisher again appeared as Princess Leia in the 1978 made-for-TV movie The Star Wars Holiday Special. She appeared again as Princess Leia in The Empire Strikes Back (1980) and Return of the Jedi (1983)."}, {"tag": "p", "text": "It was rumored for years that she had an affair with Harrison Ford while filming the original Star Wars film; while Fisher admitted she had a crush on Ford and spent much time with him off camera, she denied having an affair with him. In 2016, however, Fisher admitted in her autobiographical title, The Princess Diarist, that she did, in fact, have an affair with Ford."}, {"tag": "p", "text": "Her character of Leia became a merchandising triumph; there were small plastic dolls of her in every toy store across the United States. Fisher often joked that it was actually Princess Leia who became famous, and she just happened to look like her. After her appearance in Return of the Jedi wearing the famous \"metal bikini\" or \"slave\" outfit, Fisher was, for a brief time, regarded as a sex symbol. Fisher made a comment once about her experiences off the set of Star Wars films: \"I used to go in though airports and have people say; 'Princess Leia!' Like I would then go; 'Yes?' You know, like that's my real name.\" In an interview on public radio in 2005, Fisher joked about being known overwhelmingly for her role as Princess Leia, and also joked that she was afraid if she ever became senile she might begin to slip back into character."}, {"tag": "p", "text": "For The Phantom Menace, she wrote dialogue, uncredited, for the moment when C-3PO and R2-D2 meet for the very first time."}, {"tag": "p", "text": "In early March of 2013, Fisher confirmed in an interview with the Palm Beach Illustrated magazine that she would return to reprise her role as Princess Leia in The Force Awakens. In an interview for ABC News in December 2015, she confirmed that it was George Lucas who came directly to ask her to be part of the third trilogy. In July 2016, she wrapped filming on the follow-up, The Last Jedi. Fisher's dog, Gary, had a cameo in The Last Jedi during the Canto Bight sequence."}, {"tag": "h3", "text": "References to Star Wars"}, {"tag": "p", "text": "Carrie Fisher hosted the November 18, 1978 episode of Saturday Night Live, in which she came onto the stage outfitted as Princess Leia, complete to her hair being arranged into the hairstyle she had employed throughout most of A New Hope, which some people had noted resembled an Imperial TIE fighter. She opens the show by telling a long \"joke\" based entirely on Star Wars references. She then appeared in a sketch, again as Leia, in which she sings and dances with a group of 1950s teenagers."}, {"tag": "p", "text": "In the film Scream 3 (2000), Fisher's character, Bianca Burnette, is mistaken for Carrie Fisher. Fisher pokes fun at herself with the line, \"Yeah, I was up for the part of Princess Leia. But who gets it? The girl who slept with George Lucas!\" In the 2009 film Fanboys, Fisher's character references the famous \"I love you/I know\" line from both The Empire Strikes Back and Return of the Jedi."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "On December 23, 2016, Fisher was reported to be in critical condition after having suffered a massive heart attack on a flight. Fisher had been the victim of an Internet death hoax just days before and was filming a new series in the United Kingdom for Channel 4. But much to public shock and horror, Fisher died as a result of cardiac arrest on December 27, 2016, at the age of 60. Fisher's mother Debbie Reynolds died one day after her passing. Fisher is survived by her brother Todd Fisher and daughter Billie Lourd."}, {"tag": "p", "text": "Fisher and her mother had a joint private funeral service followed by burial at Hollywood Hills' Forest Lawn Memorial Park. Fisher's ashes were placed inside a large prozac pill-shaped porcelain urn which was buried next to her mother's casket. Her brother Todd stated the pill had been one of Fisher's favorite possessions."}, {"tag": "h2", "text": "Filmography"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}