{"url": "Carrion_Spike", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Captured starships", "Category:Corvettes of the Galactic Empire", "Category:First Order starships", "Category:Galactic Republic starships", "Category:Stealth ships"], "nodes": [{"tag": "h1", "text": "Carrion Spike"}, {"tag": "p", "text": "The Carrion Spike was a corvette and the personal starship of Moff Wilhuff Tarkin while he was stationed at Sentinel Base in the Outer Rim Territories. This ship was based off of the design of the stealth ship used during the Clone Wars. It was captured by the disaffected former Republic Intelligence agent Berch Teller and his rebel cell. Berch used the Carrion Spike in a campaign against Imperial space stations, in which its abilities were unparalleled. Later the ship was abandoned by the rebels at Carida after they discovered their inside source within the Empire, Vice Admiral Dodd Rancit, was planning a betrayal."}, {"tag": "p", "text": "After Darth Vader exposed Rancit's treason, the Carrion Spike was recovered and presumably repaired. By 3 BBY, the ship had been restored and was back in Tarkin's possession. At some point after the Battle of Jakku, the Carrion Spike was discovered in the abandoned Rothana Imperial Shipyards by Terex, who became the leader of the Ranc gang and later an agent of the First Order's Security Bureau. The starship served as Terex's personal transport during his campaign against the Resistance starfighter pilot Poe Dameron and his Black Squadron. The Carrion Spike was destroyed by the First Order after Terex embarked on an unsanctioned campaign to destroy the Resistance."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Carrion Spike was designed specifically for and in collaboration with Moff Wilhuff Tarkin by Sienar Fleet Systems and several others. It was triangular-shaped, just under 150 meters in length and heavily armed with turbolasers, ion cannons and proton tubes. The Carrion Spike was based on a prototype Republic IPV-2C Stealth Corvette that had been deployed during the Battle of Christophsis. The Carrion Spike was highly maneuverable in combat and capable of outmaneuvering Imperial warships and starfighters. The ship's weak point was the spine where the main fuselage connected with the aft flare. Only concentrated laser fire while lowering the deflector shields would weaken the structure."}, {"tag": "h3", "text": "Complement and crew requirements"}, {"tag": "p", "text": "The Carrion Spike had at least eighteen crew members but could also be crewed by a captain and communications officer. The ship's facilities included a command cabin, an austere main cabin containing a round conference table and six chairs, a vehicle pool for landspeeders that was equipped with a repair bay, and several toilets and showers. The Spike's command cabin led into an afterdeck and the ship's conference cabin. A turbolift connected the conference cabin to the engine room. The engine room could also be accessed by an emergency stairwell in the main cabin. The engine room led to a narrow cofferdam which led to the Carrion Spike's cargo hold. The ship also had an airlock and an outer hatch that could be fully sealed."}, {"tag": "h3", "text": "Engines"}, {"tag": "p", "text": "Its Class One hyperdrive made the ship the fastest one in the Imperial Navy, while its state of the art navicomputer allowed the corvette to travel from the Outer Rim to Coruscant without reverting to realspace to retrieve routing data from relay stations or hyperspace beacons. By contrast, less advanced ships had to exit hyperspace to check navigation data while traveling from one system to another. In addition, the Carrion Spike was equipped with powerful ion turbine sublight arrays. The ship's engine room contained a fuel bay that stored the ship's paralight tracker, a HoloNet transceiver that parsed commands from the ship's navigation computer; effectively doubling as a homing beacon."}, {"tag": "h3", "text": "Stealth, armaments, and other systems"}, {"tag": "p", "text": "The Carrion Spike's ion turbine, sublight arrays and countermeasures suite were also state of the art. Based on a prototype stealth corvette introduced during the Clone Wars at the Battle of Christophsis, the Carrion Spike was equipped with a cloaking device powered by stygium crystals that was able to render the ship invisible to almost all scanners and the naked eye. The Sith Lord Darth Vader was able to track the ship at some point, but only because he could sense his meditation chamber which was on the ship."}, {"tag": "p", "text": "The Carrion Spike was equipped with an advanced deflector shield and several laser cannons. By 34 ABY, these cannons could be by battle computers. The Resistance technician Oddy Muva was able to lock the crew out of the ship's control systems on one occasion and use it to destroy Terex's \"Uglies.\" The ship was also equipped with several escape pods. The Carrion Spike's bridge could seat three crew."}, {"tag": "h3", "text": "Terex's modifications"}, {"tag": "p", "text": "The First Order agent Terex installed a luxurious suite aboard the Carrion Spike. He housed several alien slaves, who each served a purpose. The suite house a hologram unit which Terex used to communicate with Captain Phasma. Terex also had a special chamber storing a collection of Imperial helmets and blasters as well as his Ranc gang armor, which was a modified stormtrooper armor set. Terex also could use Authorization Code TK-603 to disable the ship's communications, engines, and weapons systems. The only way to regain control of these systems was to replace the central computer systems, a huge undertaking that could only be done in deep dock. The ship also had an internal communications system which allowed the bridge crew to contact Terex's personal chamber."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Wilhuff Tarkin"}, {"tag": "p", "text": "The Carrion Spike served as the personal transport of Grand Moff Wilhuff Tarkin during the Imperial Era. Following an investigation on Geonosis, Darth Vader met the-then Moff Tarkin on the Carrion Spike above the planet. There he reported his findings to Tarkin and questioned his new project, with Tarkin deducing that he wanted to be the sole technological marvel in the galaxy."}, {"tag": "p", "text": "In 14 BBY, Tarkin traveled aboard the Carrion Spike to Coruscant after being summoned for a meeting with Emperor Palpatine. While traveling through hyperspace, Tarkin convened an impromptu inspection of the Imperial officers and enlisted ratings aboard the ship. After discovering that Ensign Baz had been secretly consuming spice in the vehicle pool, Tarkin had him relieved of duty and confined to the crew berth for the remainder of the voyage. He also instructed Commander Cassel to perform a flash inspection of all barrackers and personal lockers."}, {"tag": "p", "text": "While Tarkin met with the Emperor and Darth Vader at the Imperial Palace, the Carrion Spike was berthed at an Imperial Palace landing field. After the Emperor assigned Moff Tarkin and Lord Vader to investigate a communications cache on Murkhana, Tarkin dispatched most of the crew with the exception of the ship's captain and communications officer back to Sentinel Base; Tarkin's posting. Darth Vader brought a contingent of stormtroopers and one of his meditation spheres aboard the ship."}, {"tag": "p", "text": "On Murkhana, the Carrion Spike landed at a former Corporate Alliance landing field. While Tarkin and Vader visiting the communications cache, the stormtroopers under Sergeant Crest and the crew guarded the ship. The former Republic Intelligence agent–turned–insurgent leader Berch Teller and his rebel cell used their communications equipment to lure the stormtroopers away from the ship. The insurgents then boarded the Carrion Spike and killed the crew before fleeing into hyperspace. The insurgents were aided by the Sugi crime lord Faazah, who supplied them with specialized fuel cells."}, {"tag": "h4", "text": "Berch Teller's campaign"}, {"tag": "p", "text": "In hyperspace, Teller and his fellow insurgents decided to turn the Carrion Spike into a symbol of resistance against the Empire. Teller's crew included the Gotal pilot Salikk, the Koorivar operations officer Cala, the Mon Calamari engineer Dr. Artoz, the journalist Anora Fair, and the Zygerrian film director Hask Taff. The shipjackers were either survivors and witnesses of the Antar Atrocity, a mass murder which had been instigated by Tarkin following the Clone Wars. They were secretly supported by Tarkin's rival Vice Admiral Dodd Rancit, who supplied them with weapons, communications equipment, and intelligence on Imperial targets. Rancit wanted to use the rebel insurgency to gain favor with the Emperor and elevate himself to Moff."}, {"tag": "p", "text": "Tarkin and Vader pursued the Carrion Spike in Faazah's stolen ship Parsec Predator. With the Empire on their tail, Teller brought the Spike to Galidraan III, where the Empire had a space station. Using the ship's stealth systems, the insurgents caught the Imperial defenders by surprise and inflicted heavy casualties on the station's V-wing and ARC-170 starfighters. The Spike also disabled the Parsec Predator but not before the latter inflicted damage on the ship's spine. Before fleeing into hyperspace, the insurgents also destroyed the station's hyperspace buoy and jettisoned Lord Vader's meditation chamber."}, {"tag": "p", "text": "The insurgents then attacked TaggeCo's mining facilities on Lucazec. Anora and Hask produced holovids of the attack that were streamed on HoloNet. With the Carrion Spike running low on fuel, Teller's dissidents traveled to Phindar in the Mandalore sector; one of the few places that could support the corvette's unique fuel requirements. Rancit had warned the insurgents that the Empire was waiting for them at Gromas in the Perkell sector. Despite Teller impersonating an Imperial officer, the Phindar administrator managed to alert Moff Tarkin and Lord Vader to the ship's presence. Following a brief dogfight, the insurgents destroyed the orbital tanker by detonating a concealed explosive device before fleeing into hyperspace."}, {"tag": "p", "text": "The Carrion Spike sustained significant damage to its hull and exterior lights as a result of the Phindar dogfight. Part of the ship's rectenna array had also been ripped way by a tractor beam. Most of the electronic appliances in the galley and medical bay were destroyed. Parts of the ship were inaccessible due to air lock damage and radiation leaks. While the ship's weapons and stealth systems, sensor suite, hyperdrive, and navicomputer still functioned, the shield generators were only functioning at 50 percent capacity. After examining the ship's engine room, Artoz discovered that the Imperials had been tracking the Carrion Spike using the ship's paralight tracker."}, {"tag": "p", "text": "To put the Empire off their scent, Teller transmitted hyperspace coordinates claiming that the Carrion Spike was traveling to the Obroa-skai system. Teller also got the Lantillies information broker and fellow insurgent Knotts to send the YT-1000 freighter Reticent as a decoy. Later, the insurgents used the Carrion Spike to attack the Imperial facility in the Nouane system. However, Vice-Admiral Rancit had dispatched reinforcements to bolster Imperial facilities across the galaxy. The Spike was repulsed by lasers and barely managed to escape into hyperspace. As a result, the ship sustained considerable damage to its systems."}, {"tag": "p", "text": "Realizing that Rancit had double-crossed them, Teller's insurgents abandoned the Carrion Spike and transferred to Teller's modified Providence-class Dreadnought. They then set the Carrion Spike on autopilot to Carida under the pretext of attacking the Imperial Academy there. To cover his collusion with the insurgents, Rancit attempted to destroy the Carrion Spike with the Secutor-class Star Destroyer Conquest's laser cannons. However, Lord Vader exposed Rancit's treason and stopped him from destroyed the Carrion Spike. After Vader had executed Rancit, Tarkin repossessed his damaged corvette. Tarkin then defeated Teller's insurgents as they were ambushing an Imperial convoy near the Gulf of Tatooine. Following the capture of the insurgents with the exception of Teller, Tarkin confronted them about the damage done to his corvette."}, {"tag": "h4", "text": "Pick up on Chandar's Folly"}, {"tag": "p", "text": "Following a successful hunt on Chandar's Folly, Tarkin called for the Carrion Spike to pick him and Vader up in the Stormlands. The Carrion Spike swiftly arrived and as it lowered towards the two, lightning continuously struck it. Tarkin told Vader he would take him to a repair bay on the corvette to have him fixed and as the Carrion Spike was landing, Vader choked Tarkin to show him that he had not entirely won."}, {"tag": "h4", "text": "Other journeys"}, {"tag": "p", "text": "By 3 BBY, the ship was back in regular use as a transport by Tarkin. He traveled in it on a surprise visit to Alderaan, claiming to the Organas that it had suffered unexpected engine trouble."}, {"tag": "p", "text": "At one point, Tarkin brought the Carrion Spike back to Eriadu, where he waited at the ship while sending three protégées he had mentored on a test to determine which one of them was the worthiest. The victor of the contest was Ellian Zahra, who successfully hunted an Eriadu veermok as well as her competition, having perceived that eliminating the other two competitors was the hidden part of Tarkin's test."}, {"tag": "h4", "text": "Zahra's mission"}, {"tag": "p", "text": "Tarkin later learned of a warlord, Burnium Ro, based on Ikkrukk, who used rhetoric and imagery styled after the historical Nihil marauders. Due to the Nihil's reputation as agents of chaos, Tarkin saw them as a threat to Imperial order. However, as he had duties aboard the Death Star, he dispatched Lieutenant Commander Zahra to destroy Ro's stronghold, lending her the Carrion Spike for the mission."}, {"tag": "h3", "text": "Agent Terex"}, {"tag": "h4", "text": "Serving the First Order"}, {"tag": "p", "text": "At some point following the death of Tarkin during the Battle of Yavin, the Carrion Spike ended up at the Rothana Imperial Shipyards. Sometime after the Battle of Jakku, the Carrion Spike was discovered by the former stormtrooper Terex, a survivor of the battle. Terex, along with the former stormtrooper Corlac, had joined a criminal organization called the Ranc gang. Terex was determined to restore the Old Empire and recognized the Carrion Spike as Tarkin's former flagship. He set about repairing the ship's engines, life support, cloaking device, surveillance, and weapons. Using the ship's surveillance systems, he was able to eavesdrop on a conversation between Corlac, Bett, and Wenda. After learning that Corlac and the others planned to kill him, Terex used the Carrion Spike's laser cannons to incinerate the command deck where they were meeting, killing them."}, {"tag": "p", "text": "Terex then took control of the gang and became a notorious crime lord in that region of space. After his underlings ambushed a cargo vessel, they submitted a set of stormtrooper armor from the First Order. By 34 ABY, Terex had become an agent of the First Order Security Bureau. Terex fitted the Carrion Spike with a luxurious personal suite, that was staffed by several alien slaves, who served his every whim. These slaves including the Abednedo Sowa Chuan, the wife of Muva had been kidnapped by Terex to use as leverage against people he considered useful."}, {"tag": "p", "text": "Terex was aboard his personal suite on the Carrion Spike when Phasma contacted him via hologram and assigned him with capturing Poe Dameron, who had stolen information that treacherous New Republic Senator Erudo Ro-Kiintor had been trying to pass to the First Order. Later, Terex offered to fly the crime lords Papa Toren, Kan Be, and Isin away from Megalox prison on the Carrion Spike if they helped him to kill Dameron and his Black Squadron while storming Grakkus the Hutt's fortress."}, {"tag": "p", "text": "After Dameron and Black Squadron escaped offworld with Grakkus, Terex contacted the crew of the Carrion Spike to arrange a pick-up. Abandoning his former crime associates to Megalox Beta's high gravity, Terex used the ship to ram through the Megalox space station, disabling the gravity shield around Megalox prison. As the prison guards departed in shuttles to evacuate the prisoners, Terex ordered the Carrion Spike to open fire on them. Black Squadron however turned around and inflicted heavy damage on the Carrion Spike. As a result, Terex reluctantly acceded to crew's request that they cloak and retreat into hyperspace. Later, Terex disobeyed Phasma's orders to return to First Order Space and instead decided to continue his campaign against Dameron and the Resistance."}, {"tag": "h4", "text": "Return to the Ranc gang"}, {"tag": "p", "text": "Following the events at Megalox, Terex's First Order crew completed repairs to the ship. However, Terex refused to inform his crew when they would be returning to First Order Space. After reflecting on his past experiences during the Battle of Jakku, Terex received news from his crew that Phasma was seeking a report into the events at Megalox Beta. Terex shot the interface comm unit and activated Authorization Code TK-603, which locked the First Order crew out of the communications, engines, and weapon systems. He then took the ship to the Outer Rim world of Kaddak, the headquarters of the Ranc gang."}, {"tag": "p", "text": "Terex landed his ship at The Sliver on Level 72, where his crew attempted to restart the communications, engines, and weapons systems. They were unable to do so since they needed to replace the central computer systems, an operation that could only be done in deepdock. After killing Wisper and retaking control of the Ranc gang, Terex returned with his gangsters who took over the ship. The First Order corporal objected that the Carrion Spike was First Order property. However, Terex responded that he would use the Ranc gang to destroy the Resistance. Terex then took his ship for a spin and ordered the inhabitants of Kaddak to capture Dameron."}, {"tag": "p", "text": "However, Dameron managed to escape with C-3PO and the BX-series droid commando N1-ZX aboard the T-70 X-wing starfighter Black One. Terex's crew managed to lock onto Poe's X-wing using the ship's advanced sensors. Muva stowed aboard the Carrion Spike in an attempt to rescue his wife. In space, Terex commanded a fleet of \"Uglies,\" starfighters cobbled up from various ships, from the bridge of the Carrion Spike. He informed his fellow Ranc colleagues including Zumgi and Brrang that they would attack Dameron's starfighter once he had dropped back into realspace. Terex's plan was to follow Dameron back to the Resistance base and destroy the Resistance. Terex had misled Dameron into believing that N1-ZX contained intelligence on the location of Supreme Leader Snoke."}, {"tag": "h4", "text": "Last stand against the Resistance"}, {"tag": "p", "text": "Later, Phasma contacted Terex by hologram and ordered him to abandon his mission on the grounds that Snoke had forbidden open hostility by the First Order military against forces aligned with the New Republic. Terex ignored her orders and switched off the transmission. He then had Chuan serve him a drink. Meanwhile, Muva ambushed Zumgi in the Carrion Spike's corridors and ordered the gangster to take him to his wife. Meanwhile, Dameron realized Terex's plan to lure him into a trap and exited hyperspace above an uncharted desert world. Terex realize that Dameron had outsmarted him and commanded his \"Uglies\" to kill the Resistance pilot. Taking damage, Poe's X-wing crashed-landed on the desert world."}, {"tag": "p", "text": "While Terex led a landing party to hunt down Dameron and the droids, he left his lieutenant Brrang in charge of the Carrion Spike and his fleet of \"Uglies.\" Muva managed to reunite with Chuan. After freeing the other slaves, Muva wanted to confront Terex only to learn from Zumgi that the crime lord had descended to the surface. Shortly later, Black Squadron arrived in their starfighters and sighted the Carrion Spike and its \"Uglies.\" Gambling they had the upper hand, Brrang ordered the other Ranc gang's \"Uglies\" to attack Black Squadron."}, {"tag": "p", "text": "During the subsequent dogfight, Muva and the slaves manages to escape in escape pods. Before leaving, Muva locked the crew out of the control systems and ordered the ship's battle computers to target any ship without a Resistance transponder. Black Squadron protected the escape pods but lost one of their pilots L'ulo L'ampar to enemy fire. Eventually, Terex's crew managed to regain control of the Carrion Spike which launched a frontal attack on Black Squadron. However, a First Order Maxima-A class heavy cruiser exited hyperspace with a complement of TIE/fo space superiority fighters and destroyed the Carrion Spike, killing all hands aboard. The First Order had dispatched forces to apprehend Terex for defying the First Order and embarking on an errant mission. Dameron handed Terex to Commander Malarus and taunted him about the destruction of his flagship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Carrion Spike first appeared in James Luceno's 2014 canon novel Tarkin. The ship was later pictured in the 2016 comic issue Poe Dameron 2, written by Charles Soule and illustrated by Phil Noto."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}