{"url": "Casino_Royale", "categories": ["Category:Legends articles", "Category:Casinos", "Category:Vorzyd V locations"], "nodes": [{"tag": "h1", "text": "Casino Royale"}, {"tag": "p", "text": "Built in the years before the Naboo Crisis, the Casino Royale was a kilometers-long collection of gambling establishments, eateries, stadia, and other entertainment facilities, the largest and most well-known of its kind on Vorzyd V—no small feat for the planet dubbed \"the Gambler's World\"."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Less than a month after the Casino Royale opened, a security crisis resulted in the casino putting a blanket ban on all mechanicals except for the droid pit bosses. The casino's sophisticated sensors could detect even the most well-hidden of cybernetic implants, and a small army of Kilmaulsi were on hand to politely deter any troublemakers. External troubles were generally handled by Vorzyd V's legion of R-series police droids."}, {"tag": "p", "text": "After the destruction of the first Death Star, Luke Skywalker visited the Casino Royale while trying to meet up with a potential Rebel contact. There, he managed to amaze the patrons by being the first to score on Cosmic Chance in more than three sidereals, then further amazed them by scoring a second time. But before the young Jedi could break the record and score for a third time, he was pulled away by Princess Leia, much to the dismay of the patrons betting on him."}, {"tag": "p", "text": "The Royale was serviced by a small fleet of droid-operated hover-taxis which in brought beings from the spaceport and the numerous surrounding hotels, which had accommodations for nearly any type of being. Once at the casino, patrons would find thousands of ways to spend or gamble their credits, assuming they passed security."}, {"tag": "p", "text": "When it came to entertainment, the sheer variety offered by the Casino Royale made it difficult to beat. From sabacc to dejarik to the Jubilee Wheel and Cosmic Chance. Alternatively, gamblers could bet on the players themselves, from shockball and podracing to the outcomes of gaming tournaments and the success of players at the casino's various attractions. And when the patrons had grown tired of gaming, there was always the Royale's night-life to liven things up."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The casino was almost certainly named for the titular casino in Ian Fleming's very first James Bond novel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}