{"url": "AG-37", "categories": ["Category:Legends articles", "Category:IG-series droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "AG-37"}, {"tag": "p", "text": "AG-37 was an IG-series assassin droid in operation in the aftermath of the Second Imperial Civil War. A regular visitor to Ania Solo's junkyard on Carreras Minor's moon, AG-37 was in operation long before and had seen empires rise and fall. He had developed a sense of individuality and goals, making a living transporting goods in his freighter. Unlike most other assassin droids, AG-37 was extremely personable and kind, helping others and dispensing advice and encouragement. At some point prior to 25 ABY, AG-37 encountered Han Solo and Chewbacca and made an unspecified promise to Solo. Near the end of the Second Imperial Civil War, AG-37 encountered Ania, a distant descendant of Han Solo, who had escaped from an Imperial prison camp on the planet Drash-So. Seeking to honor his promise to Han Solo, AG-37 rescued Ania and brought her to the Carreras system, where she set up a junkyard."}, {"tag": "p", "text": "Due to his friendship with Ania Solo, AG-37 was drawn into the events of the rogue Sith Darth Wredd's insurgency in 138 ABY. Following the end of the Second Imperial Civil War, the One Sith had been toppled and driven underground. The Sith began infiltrating governments and corporations across the galaxy as part of a plan to restore their former glory. However, Darth Wredd did not share the same vision as his fellow Sith and sought to restore the Rule of Two by killing all other Sith. During the Carreras Incident, Darth Wredd kidnapped and impersonated the Imperial Knight Yalta Val. Seeking to reclaim his \"lightsaber\", Wredd attacked Ania's junkyard. In the ensuing skirmish, Ania, along with her Mon Calamari friend Sauk, were forced to escape aboard AG-37's freighter."}, {"tag": "p", "text": "After recovering the real Yalta Val's Imperial communications droid, AG-37 and his companions discovered that the real Yalta Val had been replaced by the Sith impostor they had previously encountered. Later, they joined forces with Yalta Val's friend and fellow Imperial Knight Jao Assam to rescue Yalta Val and to stop the Sith impostor. Despite succeeding in rescuing Val on the floating world of Mala, AG-37 and his companions were unable to stop Wredd from transmitting his manifesto to the galaxy and crashing the Carreras communications array onto Mala. During the fighting, AG-37 was slashed in half across the torso by Wredd's lightsaber. However, as a droid and non-living being, he was easily repaired and restored to full working capacity by Ania and Sauk."}, {"tag": "p", "text": "Following the events on Carreras, AG-37's freighter was picked up by the Pellaeon-class Star Destroyer Animus. Out of gratitude for repairing his droid body, AG-37 offered Sauk a job as an engineer aboard his freighter. After receiving much-needed repairs to his ship, AG-37 and Sauk departed for hyperspace while Ania remained behind with her new-found friend Jao Assam and Master Val. While visiting an unidentified planet to take delivery of a wild beast, AG-37 and Sauk learnt about a resettlement operation on the poisoned planet of Calamari, the homeworld of the Mon Calamari and Quarren species which had been destroyed by a Sith bioweapon during the last stages of the Second Imperial Civil War. Later, AG-37 and Sauk received a distress signal from Ania and Jao from Dac."}, {"tag": "p", "text": "After Jao had received a Force vision warning that Darth Wredd was planning to kill the Galactic Empress Marasiah Fel, Jao and Ania had embarked on a quest to hunt down the rogue Sith. Their travels took them to Dac where they discovered a pirate ring run by another rogue Sith named Darth Luft. Darth Luft had tricked many Mon Calamari and Quarren into returning to Dac under the pretext of resettling a restored Dac. There, they were enslaved and put to work assembling pirate ships in the Mon Calamari Shipyards orbiting Dac. Jao and Ania had been captured by Darth Luft who had thrown them into an escape pod and jettisoned them into the poisoned oceans of Dac. With much difficulty, Sauk and AG-37 managed to dive their freighter into the watery depths of Dac and retrieve the escape pod containing their companions."}, {"tag": "p", "text": "While AG-37 and Ania wanted to wait for Galactic Federation Triumvirate reinforcements to arrive, Jao Assam wanted to take the fight to Darth Luft. Unable to resolve their differences, AG-37, along with Ania, Sauk, and a Mon Calamari refugee Luen departed on AG-37's freighter. Their freighter was pursued by several pirate starfighters. However, AG-37 and his companions were saved by the arrival of a combined Galactic Alliance and Fel Empire force which liberated the shipyards and apprehended the pirates. During the fighting, Jao succeeded in killing Darth Luft but was unable to find any trace of Darth Wredd, who had deliberately led them to Calamari with the intent of using them to fulfill his goal of destroying the One Sith. Following the events on Calamari, AG-37 and Sauk joined Ania and Jao's quest to hunt down Darth Wredd."}, {"tag": "p", "text": "In 139 ABY, Ania Solo was falsely accused of the murder of the Imperial Knight Teemen Alton. Before Ania could clear her name, she was kidnapped by her former lover Ramid, who wanted to collect the bounty on her head. While Jao Assam had his doubts, AG-37 and Sauk believed in Ania's innocence and vouched for her character. After revealing his connection with Ania to Jao and Sauk, the three embarked on a mission to rescue Ania. Their journey took them to a barren world which rained glass shards and acid. Due to his mechanical body, AG-37 was able to withstand the inhospitable weather conditions and went to search for Ania, while Jao and Sauk waited for the weather to clear. AG-37 eventually tracked Ania and Ramid to a remote settlement."}, {"tag": "p", "text": "After Ania Solo escaped an ambush by a mysterious bounty hunter, who wanted to frame her for the murder of Teemen Alton, AG-37 rescued her from the acidic rain and brought her to shelter. However, AG-37's internal systems sustained extensive damage from the acidic rain. Fearing a loss of his memories, AG-37 requested that Ania shut down his systems, a request which she reluctantly accepted. While AG-37 was incapacitated, Jao and Ania succeeded in killing the bounty hunter and foiling her plot to frame Ania. However, Imperial stormtroopers then apprehended Ania and brought her to the galactic capital Coruscant to face trial for her alleged crime. Jao and Sauk were unable to stop them but they succeeded in recovering and repairing the damaged AG-37. In the end, Jao Assam and his fellow Imperial Knight Yalta Val succeeded in clearing Ania's name. Following Ania's acquittal, a fully-repaired AG-37 was present at their reunion on Coruscant."}, {"tag": "p", "text": "AG-37 later took part in a mission to rescue Jao Assam, who had been kidnapped by Darth Wredd with the intention of recruiting a new Sith apprentice and luring Empress Fel to Mala. Their travels took them to the remote planet of Mala where they succeeded in rescuing Jao. However, they were then caught in a three-way battle involving the Fel Empire, Darth Wredd, and a large army of One Sith, who were also hunting for Darth Wredd. During the battle, AG-37 fought and killed many Sith. Following the defeat of Darth Wredd and the One Sith, AG-37 would join Ania, Jao, and Sauk on their travels across the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Little is known about AG-37's creation and early life prior to the events of insurgency in 138 ABY–139 ABY. However, he is known to have predated the One Sith and the Galactic Alliance. At some point prior to the fall of the New Republic, AG-37 encountered the legendary smuggler and Rebel Alliance war hero Han Solo and the Wookiee Chewbacca, making an unspecified promise to Solo. More than a century later, AG-37 honored this historical promise by sheltering Ania Solo, a distant descendant of Han Solo who had escaped from an Imperial prison camp on Drash-So. Seeking to escaping offworld but lacking the money to do so, she pulled a blaster on AG-37. Admiring her courage, AG-37 took pity on Ania Solo and gave her a free ride offworld on his freighter. Memories of this first encounter were preserved in his memory banks, which had not been wiped for more than a century."}, {"tag": "h3", "text": "The stolen lightsaber"}, {"tag": "p", "text": "By 138 ABY, Ania Solo had established a junkyard on Carreras Minor's moon. That year, she and her Mon Calamari friend Sauk discovered a damaged Imperial comm droid and a lightsaber, which belonged to the Imperial Knight Yalta Val. While traveling to the Carreras system to supervise work on the local station of the galactic G51 communications array system, Master Val had been ambushed and kidnapped by the rogue Sith Darth Wredd, who stole his armor and impersonated Val. Wredd then proceeded to take control of the Carreras communications array and Governor Biala's security forces under the pretext of a Sith presence in the system."}, {"tag": "p", "text": "While visiting Ania's junkyard to purchase some linear converters for his freighter, he advised Ania to get rid of her lightsaber since it entailed problems beyond her depths. AG-37 then proceeded to the north side of the junkyard, where the linear converters were stored with the engine casings. The Sith impostor Wredd arrived with a force of Carreras security guards and demanded that Ania \"return\" his lightsaber. When Ania refused, he used the Force to retrieve his lightsaber and ordered his men to gun down Ania and Sauk. However, AG-37 came to his friends' rescue by dispatching the guards with two blaster rifles, killing them. They then fled offworld on AG-37's freighter."}, {"tag": "p", "text": "While exiting the moon's atmosphere, AG-37 offered to take Ania as far as Bonadan, his last stop at a major port. His freighter was loaded with a shipment of ice. When Ania asked why he was risking his life to save them, AG-37 merely replied that he always paid his debts. AG-37 was disturbed by the behavior of the Imperial Knight Yalta Val, which he felt was out of character for an Imperial Knight. Ania replied that she had pushed the Knight too far but concurred with AG-37 that Imperial Knights did not usually behave like that. While Ania had high hopes for the new Galactic Triumvirate, she was now less certain. AG-37 then commented that the galaxy had been at its most harmonious time under the Jedi. He commented that the Triumvirate had the potential to recapture this high point. However, Ania retorted that it made little difference who was in charge since they were all corrupt."}, {"tag": "p", "text": "Meanwhile, Sauk managed to repair the damaged Imperial communications droid and discovered a holographic recording of a skirmish between an Imperial Knight and a Sith. Ania, Sauk, and AG-37 witnessed the recording and quickly recognized the Imperial Knight's lightsaber as the same blue-bladed one which Ania had encountered. They quickly deduced that the Imperial Knight whom they had encountered at Ania's junk yard was an impostor, when the proximity alarm on AG-37's rang. AG-37 and his companions returned to the cockpit only to encounter a Shifala blockade. AG-37 led the Carreras starfighters on a pursuit through the ice ring about Carreras Minor. The freighter was struggling to evade the nimble and agile snubfighters. Ania managed to lose the pursuing starfighters by pushing her shuttle out of the freighter's hangar bay, destroying the pursuers."}, {"tag": "h3", "text": "Rescuing Master Val"}, {"tag": "p", "text": "In the end, AG-37 managed to land his freighter on the desolate planet of Carreras Minor. While hiding there, Sauk managed to repair the damaged Imperial communications droid. AG-37's freighter was attacked by a gigantic tentacled monster which attempted to devour the freighter and its crew. However, Ania and her companions were rescued by the Imperial Knight Jao Assam, who had come to the Carreras system to investigate the disappearance of Master Val. With Jao's help, they managed to escape the monster by firing the freighter's engines into the monster's face, killing it. However, Ania Solo distrusted Jao and pointed a blaster pistol at him. When AG-37 intervened after landing the starship safely, Jao explained the purpose of his mission which prompted Ania to express her desire to shoot him."}, {"tag": "p", "text": "AG-37 managed to defuse the situation by pointing out that Jao Assam would have killed them if he had actually wanted them dead. In response, Jao remarked that this was the first time that he had ever hear an assassin droid counsel restraint. He explained that he had followed the locator signal on Master Val's comm droid to Carreras Minor. During the verbal confrontation, Sauk surfaced with a blaster rifle but Ania convinced Sauk that Jao was not a threat. Sauk was also followed by the newly repaired Imperial comm droid. After getting the comm droid to replay the holographic recording of Yalta Val fighting the Sith, Sauk and his companions quickly realized that Yalta Val had been replaced by a Sith impostor. In the end, Jao and Ania's companions agreed to search for the floating world in the hope of rescuing Master Val."}, {"tag": "p", "text": "While traveling into the Surd Nebula, they were pursued by several Shifala snub fighters. They arrived at the coordinates of the floating world only to find empty space. At that point, AG-37's freighter's port thruster was hit by laser cannon, and they were trapped in the tractor beam projector of a Shifala warship. AG-37's freighter was dragged into the hangar bay of the warship and was boarded by several droids which chewed a hole through the hull of the freighter. Ania and her companions fled down the gang plank only to fall into the hands of armed Shifala guards, who arrested them. AG-37 was immobilized by a restraining bolt while Ania and Sauk were thrown into holding cells. In the end, Sauk and his companions were released by Governor Biala who sent Jao and his companions to deal with the Sith impostor. After observing a conversation between the false \"Yalta Val\" and Jao, Biala quickly deduced that the former was an impostor."}, {"tag": "p", "text": "Newly freed, AG-37 and his companions headed to the hangar bay to confront the Sith impostor. Jao was not confident of his ability to handle Darth Wredd alone but Ania believed that the four of them would be able to defeat the impostor. AG-37 agreed with Jao that the impostor was a Sith Lord and expressed his concern that he and his companions would not be able to help him. While Jao advised caution and suggested tracking the Sith from their starship, Ania wanted to take out the rogue Sith immediately. She fired on Darth Wredd's shuttle but he survived the explosion and attacked the four opponents with ruthless ferocity. During the fighting on the Carreras communications array, Darth Wredd cleaved AG-37 across his waste and shoulder with a lightsaber, temporarily disabling the droid. However, since AG-37 was not a living being, he did not die. Despite Jao and Ania's best efforts, Darth Wredd managed to escape, but not before impaling Jao and sending him hurtling through the zero gravity of space."}, {"tag": "p", "text": "Following Darth Wredd's escape, Ania attended to the unconscious Sauk and the damaged AG-37. With his faculty still intact, AG-37 urged Ania to go and rescue Master Val and stop the Sith impostor. While Ania expressed her lack of confidence because she was merely a junk dealer, AG-37 reminded her that her famous ancestor Han Solo had done great things even though he was a lowly smuggler. He explained that Han Solo did what he had done because he knew that it was the right thing to do and because his friends needed him. Galvanized by AG-37's words, Ania flew Jao Assam's starfighter to Darth Wredd's secret hideout on Mala. Taking control of the Carreras communications array, Darth Wredd broadcast his manifesto to the wider galaxy, deriding the Galactic Triumvirate and presenting his captive Yalta Val. Before a live galactic audience, Wredd attempted to execute Val but was stopped by Ania, who managed to free Master Val."}, {"tag": "p", "text": "While the two were preoccupied, Ania flew back to the Carreras communications array in Jao's starfighter and rescued Sauk and AG-37, dragging them aboard AG-37's freighter. Despite AG-37's pleas that she save Sauk and leave him behind, Ania was determined not to leave without both her friends. By this stage, the Carreras communications array was on a collision course with Mala and had Governor Biala had ordered a general evacuation. While they were unable to prevent Darth Wredd from escaping, Ania managed to rescue Master Val mere moments before the communications array collided with Mala. While AG-37 piloted the ship, Ania tended to the wounded Sauk. When Ania asked AG-37 whether he needed help to take the ship through the Surd Nebula, the latter, who had been hastily reassembled, politely declined her offer and explained that they should no problems as long as Ania had sealed that hull breach. The wounded Jao was retrieved by the Imperial comm droid. Master Val was amazed to see a droid save someone and described it as unusual behavior. AG-37 explained that the comm droid rescued Jao because it believed that Jao ad come all this way to rescue it. AG-37 explained that a debt of gratitude could sometimes weigh heavily on a droid. Following Jao's rescue, they tended to his wounds and he recovered. ."}, {"tag": "h3", "text": "Separate paths"}, {"tag": "p", "text": "Despite escaping the destruction of the Carreras array, AG-37's freighter was stranded on the wrong side of the Surd Nebula. Due to Jao's deteriorating condition, Val's comm droid had begun broadcasting a distress signal. Fortunately, AG-37's freighter was picked up by the Pellaeon-class Star Destroyer Animus, which had received the freighter's distress signal. Empress Marasiah Fel had sent the Animus to pick up Ania after learning of her involvement in the Carreras Incident. Once aboard, AG-37 and his companions were treated as guests by the Imperials. A pair of Imperial Navy engineers also repaired the damaged AG-37 and managed to restore him to full working condition. The Imperials also praised Sauk's workmanship which led the grateful AG-37 to offer Sauk a job as an engineer aboard his freighter."}, {"tag": "p", "text": "While the money was not great, Sauk accepted AG-37's job offer because he regarded working on AG-37's freighter as preferable to his old job as an ice miner. Sauk shared the news with Ania, who assured him that things would always work out in the end. AG-37 invited Ania to join them but she declined the offer, citing that the Imperials had promised to provide her with a good job and nice apartment on Coruscant, the galactic capital. While happy at Ania's turn of fortunes, AG-37 counselled her to stay alert since he reasoned that nothing came free. After hugging Sauk, Ania told the Mon Calamari engineer to take care of the grumpy old droid. AG-37 and Sauk then departed into space and their travels took them to an unidentified spaceport. While loading some supplies, Sauk encountered another Mon Calamari refugee who told him of a new scheme to rebuild and resettle Dac's shipyards. He attempted to invite Sauk along but the latter declined due to his job aboard AG-37's freighter. AG-37 then reappeared and informed Sauk that they were about to depart offworld."}, {"tag": "p", "text": "AG-37 and Sauk were transporting a large beast with sharp jaws to Iego. Due to the dangerous nature of the cargo, the creature was housed in a repulsor cage. Under AG-37's orders, Sauk attached had connected the cage to the shipboard power supply. Realizing that Iego was near his homeworld of Dac, Sauk asked AG-37 whether they could visit his homeworld. However, AG-37 advised against it since Dac was a failed and lawless system. Sauk then related his earlier meeting with the Mon Cal who mentioned a resettlement program in the Calamari system. However, AG-37 was skeptical and described the Mon Calamari as an idealist. Sauk then related how he had left Dac to work as an apprentice engineer prior to the Sith-inspired Genocide and admitted that he missed his homeworld and his long-lost family. When Sauk mentioned that Mon Calamari Shipyards had been destroyed, AG-37 corrected him by informing him that the ring had only been broken but not totally destroyed."}, {"tag": "h3", "text": "Liberating Dac"}, {"tag": "p", "text": "Meanwhile, Jao Assam and Ania embarked on a quest to hunt down Darth Wredd, after receiving a Force vision that the rogue Sith had planned to kill Empress Marasiah Fel. Their hunt took them to the lawless Calamari system where they discovered that another Sith Darth Luft and his pirate associates had started a scam to lure Mon Calamari and Quarren refugees back to Dac. There, these unfortunate Mon Calamari and Quarren were enslaved and forced to build starships for the pirates. Jao and Ania, along with two local guides the Mon Calamari Luen and the Quarren Tikin, were dumped into an escape pod, which was jettisoned into Dac's poisoned oceans. Jao's Imperial comm droid transmitted a distress signal which was picked up by AG-37's freighter. Sauk and AG-37 traveled to Dac and dived the freighter into Dac's oceans with the intent of picking up Jao and Ania's escape pod. With much difficulty, Sauk succeeded in using the freighter's gun turret to fire a harpoon which caught the escape pod."}, {"tag": "p", "text": "AG-37 and Sauk then towed the escape pod into an abandoned section of the Mon Calamari Shipyards. During their reunification, the two also met Luen and Tikin. AG-37 commented that their circle of friends seemed to be multiplying as fast as their enemies. The four companions then discussed their next plans. While Jao Assam wanted to take out Darth Luft in the hope of finding Darth Wredd, Ania and AG-37 advised returning to AG-37's freighter and waiting for reinforcements to arrive since they were outnumbered by the pirates. Fearing that Jao's operation would endanger his young son Tilin, Tikin abandoned the group and returned to the shipyards. In the end, Sauk along with Ania, AG-37 and Luen departed on AG-37's freighter while Jao went to confront Darth Luft. AG-37's freighter was pursued by pirate starfighters but its pursuers were destroyed by a Galactic Federation Triumvirate task force which had arrived to deal with the pirates. Master Val and Admiral Gar Stazi had intercepted Jao's transmission and decided to end the plight of the Mon Calamari and Quarren slaves."}, {"tag": "p", "text": "During the Liberation of the Mon Calamari Shipyards, Stazi's forces flooded the Ring with water, overwhelming the pirates and allowing the Mon Calamari and Quarren slaves to regain the upper hand. Meanwhile, Jao Assam hunted down and killed Darth Luft. During the uprising, the pirates opened the holding cells holding the slaves' families to zero-gravity vacuum, intending to punish the slaves for rebelling. The torrent of water formed a wall of ice, which saved many Mon Calamari and Quarren from certain death. AG-37 and his companions witnessed this atrocity and attempted to shut the space doors but were unable to because the controls were covered in ice. Unable to shut the exits manually, Ania sent Jao's comm droid to hot-wire the controls and shut the doors, saving many lives. Following the defeat of Luft and the pirates, the newly liberated slaves were allowed to settle in the shipyards."}, {"tag": "p", "text": "After their departure, AG-37 confided in Ania Solo that pursuing Darth Wredd was the right thing to do and praised her for encouraging him. When AG-37 noted that they were short on credits, Ania suggested that they could take up some paying work. At that point, Jao received an incoming message from Darth Wredd, the Sith they had been hunting. The Sith Lord gloatingly informed Jao that he had been playing into the latter's hands by following his trail and killing Darth Luft. This brought the rogue Sith closer to completing his final plan. He even offered Jao a place in his new Sith Order, which would be based on the Rule of Two. Despite Jao's despondency, Ania assures him that he has done good by liberating slaves. If they could free slaves, she reasoned that they could also take down an \"arrogant\" Sith."}, {"tag": "h3", "text": "Ania's kidnapping"}, {"tag": "p", "text": "One year after the events of the Carreras Incident, AG-37, at the recommendation of Sauk, took a delivery run to Lasgo Port, a spaceport on a remote planet that was surrounded by an orbital minefield left over from the Second Imperial Civil War. After navigating through the minefield with much difficulty, AG-37's ship landed at Lasgo Port. AG-37 remained with the ship while Ania and her friends visited the settlement. In an attempt to earn some extra credits, Ania attempted to tame a yarthul, a large quadruped beast native to the planet. Ania failed and lost her comlink as collateral. While walking through Lasgo Port, Jao found that Ania was wanted for the murder of an Imperial Knight named Teemen Alton. When Jao confronted Ania, she denied murdering the Knight, insisting that Ania had been the first Knight she had ever met. Suspicious, Jao questioned why she was residing in the remote Carreras system around the time of the alleged murder."}, {"tag": "p", "text": "While departing Lasgo Port's planet, AG-37's freighter had to travel through the minefield again. While passing through the minefield, their freighter's fuel injection bay was hit by some small-scale blaster fire, which was mistaken for asteroid debris. The ship crew sent their Imperial communications droid to fix the damage. While repairing the fuel bay, the communications droid discovered a damaged starship nearby with its crew alive but in distress. AG-37's freighter docked with the damaged starship and Jao, Ania, and their companions made contact with the crew. During that meeting, Ania met her former love interest Ramid, who claimed that his ship's net isolator had been damaged by a mine causing the ship's shield systems to break down. With their shields inoperative, the starship was unable to travel through space. While Ania reunited with Ramid, her companions return to AG-37's freighter to get tools and spare parts. However, this was all a ruse."}, {"tag": "p", "text": "Once Ania was separated from her companions, Ramid and his crew took her captive. Ramid's starship then activated its engines and opened fire on AG-37 freighter, attempting to blow it up in the minefields. Jao narrowly saved their starship from destruction. However, Ramid and his crew took advantage of the explosion to make a jump into hyperspace, taking the captive Ania with them. Jao realized that Ania had escaped into hyperspace. Following Ania's kidnapping, AG-37 attempted to track Ramid's starships' communications but received a response signal from her comlink, which they traced back to Port Lasgo. Since Ania had lost her comlink as collateral during her failed attempt to tame a yarthul, Jao was skeptical that it was actually her and speculated that she did not want to be found."}, {"tag": "p", "text": "When Jao expressed his suspicions about the close timing of Ania losing her comlink and being kidnapped by her old friends, Sauk rose to her defense and asserted that Ania did not kill the Imperial Knight anyway. Jao suggested that Ania and her kidnappers could be anywhere in the galaxy by now. However, Sauk pointed out that Ramid's starship had made a cold jump into hyperspace and deduced that they could have gotten no further than two star systems before their fuel ran out. AG-37 then added that this situation would make their task much harder to guess their next destination. Sauk then commented that if Ania had secretly been a Sith, AG-37 would have known about it. To dispel Jao's suspicions about Ania, Sauk related how Ania had vouched for him when he had been homeless and hungry on the streets of Carreras Minor even though he was a total stranger."}, {"tag": "h3", "text": "An old promise"}, {"tag": "p", "text": "Jao Assam then turned to AG-37, who had known Ania for a long time. AG-37 recounted how he had first encountered Ania near the end of the Second Imperial Civil War in the Selvatas system. Ania had escaped from an Imperial prison camp on Drash-So and had pulled a gun on AG-37, who was doing business in the system at the time. However, AG-37 took pity on her and gave her a free ride to the Carreras system, where she established a junkyard. Sauk was surprised to learn that Ania had pulled a gun on AG-37, an assassin droid. AG-37 responded that Ania had never lacked courage of luck. When Jao asked AG-37 why he had taken pity on here, AG-37 explained that he had made an unspecified promise to Ania's ancestor, the smuggler Han Solo more than a century ago."}, {"tag": "p", "text": "The three companions then resumed their quest to discover Ania's whereabouts and to ascertain the truth about her past. After Sauk and AG-37 ruled out most of the galaxy, the two speculated that Ania's kidnappers were traveling to a remote planet with a few small settlements where they could refuel without and questions asked. Jao was not sure that Ania's kidnappers were bounty hunters and wondered whether they would have gone to the nearest Triumvirate official. Still questioning Ania's innocence, Jao suggested that she had deliberately wanted to disappear due to the seriousness of her alleged crime and the hefty bounty on her head. However, Sauk refused to believe that she was guilty until they heard her side of the story. He told Jao that nothing they had seen in AG's memory had convinced him to change his mind."}, {"tag": "p", "text": "When Jao suggested that AG-37's memories put things in a different light, Sauk questioned the Knight why he was so unwound by the murder of the Imperial Knight since he had left the Order behind. In response, Jao explained that while the Force was leading him in unexpected directions, he still had not forgotten his vows. He reiterated that Teemen Alton was a Knight he had looked up to and respected and would not take his murder lightly. AG-37 explained that what the three of them had seen in his memory records were circumstantial. He added that extreme positions would often lead people to carry out extreme decisions which led to extreme outcomes, especially when based on incomplete data. AG-37 then proceeded to narrow down Ania and her captor's possible locations. He reasoned that they did not have sufficient fuel, credits or time to check every possible system for any sign of Ania."}, {"tag": "p", "text": "When Sauk made the oft-hand comment that they needed someone who could see the future and magically locate friends, Jao commented that non-Force sensitive individuals did not full understand the limitations of the Force. AG-37 then entered the conversation by commenting that while he had no sensors that could tap into the Force, he understand something that both Jao and Sauk did not: that circumstances and sentients changed. He argued that while a vision could show someone a sliver of the future, it could never tell you what role the actors were playing. He argued that Ania's past may have informed her but did not define who she was. In the end, AG-37 reasoned that seeing into Ania's future would be unhelpful without fully understanding her past. Following a lengthy philosophical discussion between Jao and Sauk, the three companions agreed to put aside any differences they had about Ania's alleged guilt or innocence and to find out the truth behind the matter."}, {"tag": "h3", "text": "Rescuing Ania"}, {"tag": "p", "text": "Running low on fuel, AG-37 and his friends headed to the next planet on the nearest jump away: a barren planet that rained glass and acid. Upon landing, they found Ramid's wrecked starship but found no trace of Ania or her estranged lover Ramid. However, Sauk found a thin trail of blood leading down the gangplank. Jao reasons that Ania and Ramid could not have traveled far on foot especially if one of them had been injured. Sauk found a storage for a speeder bike aboard the starship but found that the bike had gone missing. AG-37 deduced that Ania and Ramid had traveled a considerable distance and suggested scanning the ground from the air. Before they could embark on their hunt, the skies began raining glass and the three companions were forced to return to AG-37's freighter for shelter. Since Jao and Sauk's hide could not withstand the glass, AG-37 continued the rescue mission alone. His metallic body sheltered him from the sharp glass. Before his departure, AG-37 told his friends to be ready to lift off as soon as the storm had subsided."}, {"tag": "p", "text": "After traveling some distance, AG-37 spotted Ania and Ramid departing on their speeder bike for a settlement. He observed that Ania was no longer a captive and was willingly accompanying Ramid. By this stage, Ania and Ramid had reconciled their differences after they were forced to work together to evade a mysterious bounty hunter, who was hunting for Ania. This bounty hunter was Teemen Alton's true murderer and wanted to frame Ania for a crime she had never committed. He contacted Jao and Sauk to bring them the good news. By then, Jao had been contacted by his mentor Master Yalta Val, who had found evidence exonerating Ania of the murder of Teemen Alton. While AG-37 continued to the settlement on foot, Jao and Sauk flew AG-37's freighter to rendezvous at the settlement. When Ania and Ramid arrived at the settlement, they were ambushed by the bounty hunter, who managed to kill Ramid. However, Jao arrived in the nick of time and fought the bounty hunter, allowing Ania to escape through a window. Unfortunately, Ania was caught in an acid storm."}, {"tag": "p", "text": "Ania managed to shield herself from the acidic rain by pulling her white jacket over head. Fortunately for Ania, AG-37 arrived on time and carried her to shelter, instructing her not to speak or to open her eyes due to the acid rain. AG-37 put himself at a great risk since the acid rain damaged his mechanical body's internal systems. After bring Ania to safety, AG-37 instructed her to shut him down in order to preserve his memories. AG-37 was unable to shut down his own systems because his relay was fried. Ania reluctantly complied with AG-37's wishes, and she was recaptured by the bounty hunter, who attempted to frame her for Alton's murder by severing her left hand and implant her prosthetic hand on Ania. Before she could complete her work, she was ambushed by Jao. Following a brief but fierce duel, Ania managed to kill her stalker by using a remote to summon the bounty hunter's Tie bomber. The bounty hunter was crushed under the weight of her own starship."}, {"tag": "p", "text": "Despite the defeat of the bounty hunter, Ania's problems were still not yet over. An Imperial shuttle landed a squad of stormtroopers who proceeded to arrest Ania for her alleged crime. Jao and Sauk were unable to stop them and could only watch as they apprehend Ania for trial on Coruscant, the galactic capital. After Jao recovered the damaged AG-37, he and Sauk traveled to Coruscant in order to clear Ania's name. During the journey, Sauk presumably repaired AG-37 and restored him to full working capacity. Upon arriving in Coruscant, Jao managed to help gain Ania's acquittal by presenting the deceased bounty hunter's hand, confirming that Ania was innocent of the murder of Teemen Alton. Following her acquittal, Ania was reunited with her companions Sauk, AG-37 and their Imperial communications droid. AG-37 was gratified that things had gone in Ania's favor. However, this good news was dented by Jao's arrest and imprisonment for deserting the Imperial Knights, a crime that carried the death penalty."}, {"tag": "h3", "text": "Rescuing Jao"}, {"tag": "p", "text": "The following day, Ania Solo unsuccessfully sought an audience with Empress Marasiah Fel to secure clemency for Jao Assam. Rebuffed, she returned to the hangar bay where AG-37's freighter was berthing. When conversing with AG-37 and Sauk, Ania was adamant that they would not leave Jao behind and was incensed by Empress Fel's refusal to see her. When Sauk tried to rationalize the Empress' actions by suggesting that she was preoccupied with other matters, Ania revealed to Sauk and AG-37 that she was a distant relative of Empress Fel. At that moment, AG-37 received word over the nets that Jao had escaped. Before the three companions had time to absorb this news, a squad of stormtroopers arrived and took Ania away for a private audience with Empress Fel. During the meeting, AG-37 and Sauk waited aboard AG-37's freighter."}, {"tag": "p", "text": "During the Solo-Fel meeting, the Empress confided in Ania that she was certain that Jao Assam had not fallen to the dark side of the Force but was rather following his vows as he saw fit. However, the Empress was unwilling to break the law by showing favoritism to Jao, who had deserted the Order to hunt down the rogue Sith. Despite this predicament, the Empress saw a solution to Jao's legal situation. If Ania were to find Jao and bring him back, she would be willing to consider finding a loophole around the desertion charges. Empress Fel assigned Ania and her companions with a platoon of Trandoshan stormtroopers and sent them to rescue Jao. Ania agreed to lead the mission provided the Empress allowed her to use AG-37's freighter instead of the Triumvirate's ships. After Ania briefed the stormtroopers, AG-37's freighter departed into hyperspace to find Jao. They had no clue to his destination so they decided to wait for Jao to transmit a signal to them."}, {"tag": "p", "text": "Meanwhile, Jao and Wredd landed on the floating world of Mala. On Mala, Wredd tricked Jao into transmitting Mala's coordinates to Ania and her companions, intending to lure both the One Sith and Empress Fel into a trap. As planned, Jao's Imperial comm droid, which was stationed aboard AG-37's freighter, received the transmission. Ania intended to change their course as soon as the comm droid had finished feeding the coordinates to the freighter's navigation computer. AG-37 was skeptical of finding anything at their location since it was far from any star system or any current hyperspace route. However, Ania was adamant that there was something on the other side of that hyperspace jump since that was where Jao's message had originated from. Sauk was afraid that it was a trap but Ania insisted on going there since they had no other leads on Jao. In the end, AG-37 and Sauk complied with Ania's suggestion and changed the freighter's course."}, {"tag": "p", "text": "While Ania went to the passenger compartment to brief the Trandoshan stormtroopers about their change of plans, AG-37 and Sauk manned the cockpit. By the time Ania had finished her briefing, AG-37's freighter was entering the orbit of the floating world of Mala. AG-37 reasoned that this rogue planet was not listed on the official star charts. The three companions were shocked and astounded to discover that their destination was no other that the rogue planet which they had encountered during the Carreras Incident."}, {"tag": "h3", "text": "The Mala trap"}, {"tag": "p", "text": "As AG-37's freighter descended into Mala's atmosphere, AG-37 reminded Ania to brief the stormtrooper squad. While Sauk was unsure where to begin their hunt for Jao and Wredd, Ania reasoned that their quarries were near the wrecked Carreras G51 communications array, which had come to rest on Mala's barren surface following the Carreras Incident. AG-37 took part in the search party which explored the cave near the wrecked communications array. Ania ordered her stormtroopers not to send any offworld communications but the commanding officer, Blue Two, hung back from the rest of the group and sent Ania's coordinates to Empress Fel. They quickly found that Jao had been left strung up in the cave and Ania freed him. However, Jao quickly revealed that Darth Wredd had tricked him into sending the coordinates to Ania's rescue mission in order to lure the Imperials to Mala. There was also no sign of the elusive Darth Wredd."}, {"tag": "p", "text": "A large fleet of civilian ships landed on Mala's surface. This turned out to be a large army of One Sith acolytes led by the Twi'lek diplomat Fanoste, who demanded that Ania hand over Darth Wredd. The One Sith sought to kill and hunt down Darth Wredd since his insurgency sabotaged their plans to infiltrate governments and corporations across the galaxy in order to restore their \"golden age.\" Fueled by blood lust and hatred, the One Sith horde advanced on Ania's party. During the ensuing fighting, AG-37 opened fire on the One Sith. Darth Wredd soon resurfaced and helped Ania's party to fight off the One Sith; even handing Jao a Sith lightsaber. AG-37 quickly recognized that they were outnumbered and urged them to retreat in order to find cover. While AG-37 and the rest of Ania's party retreated, Darth Wredd and Jao Assam combined their Force powers to bring down a large piece of the communication array's wreckage on the advancing Sith horde, delaying them."}, {"tag": "p", "text": "Wredd and Jao's actions allowed AG-37 and his companions to find cover within the wrecked communications array. AG-37 was present when Sauk accused Blue Two of bringing the One Sith down on them. The Trandoshan stormtrooper vehemently denied this charge and insisted that he would never betray his Emperor. Wredd and Jao arrived and an argument ensued between the rogue Sith and the Imperial Knight. Wredd tried to rationalize his actions by claiming that he was doing the Triumvirate a service by rooting out Sith infiltrators. Wredd also tried to recruit Jao into his new Sith Order, which would be based on the Rule of Two, but was rebuffed by the young Knight. While they were temporary allies since they were fighting against the One Sith, Jao insisted that he was loyal to the Empress and would never join the Dark Side. At that point, the One Sith caught up with them. Despite fighting back, they were soon outnumbered by the One Sith."}, {"tag": "h3", "text": "Imperial reinforcements"}, {"tag": "p", "text": "Fortunately, AG-37 and his companions were saved by the arrival of Empress Fel and an army of Imperial Knights. After the One Sith rejected an ultimatum that they surrender, the Imperial Knights launched a ground assault on Mala. This led to a bloody and violent battle known as the Battle of the Floating World. During the fighting, AG-37 and his companions helped to deliver insect bites against the One Sith. While AG-37 fired his twin blaster rifles at the Sith, Ania and Jao helped the Imperial Knights by blowing up a Chadra-Fan Lander. Darth Wredd also aided the Imperial Knights by killing numerous Sith. Despite his help, the Imperials distrusted him because they knew that a Sith was only motivated by hatred. Darth Wredd's actions were fueled by his desire for vengeance against the One Sith, who had killed his family and destroyed his homeworld of Mala. He intended to destroy the One Sith completely."}, {"tag": "p", "text": "By dusk, the Imperial Knights had gained the upper hand over the One Sith and slaughtered most of their opponents. The battlefield was littered with thousands of corpses. AG-37 commented that the number of dead Sith was astonishing and pondered whether these were the last One Sith acolytes left in hiding. While Empress Fel was busy tending to the wounded Imperial Knights, she was attacked and stabbed in the chest by Darth Wredd. Before he could finish off his work, he was attacked and pursued by Jao Assam, who succeeded in slicing off both his hands. Despite severely incapacitating his opponent, Jao refused to kill the rogue Sith, knowing that Wredd wanted to trick him into slaying him in anger in order to lead him down to the Dark Side. In the end, Ania resolved this dilemma by shooting Darth Wredd with a heavy repeating blaster, sending him to his death and destroying the last known Sith."}, {"tag": "p", "text": "Following the battle, Empress Fel received medical treatment and survived her wounds. AG-37, Ania, and Sauk were also present when Jao gave a post-mortem of the battle. When Sauk expressed his bemusement at why Wredd would turn on the Empress at the last minute, Jao explained that Darth Wredd had completely given himself over to the Dark Side. However, Wredd still hated the Sith for what they had done to him, his family, and his homeworld of Mala. He wanted to destroy them and thus he engineered the Battle of the Floating World. However, despite the success of his plan, there was still only one Sith left: himself. Having delved too deeply into the Dark Side to believe in redemption, he had deliberately committed suicide by goading Jao into attacking him. Wredd thus almost succeeded in creating a new Sith in the process."}, {"tag": "h3", "text": "A life of adventure"}, {"tag": "p", "text": "Following the events on Mala, Ania Solo and her companions returned to Coruscant. Ania secured an audience with the Empress Marasiah Fel, who was bedridden and recovering from her injuries. Ania was allowed to enter Empress Fel's medical bay by Antares Draco, who was grateful to the junk dealer for saving his life on Mala. Out of gratitude for Ania's help and bravery, Fel offered to make her the captain of her personal guard. However, Ania declined the offer but managed to convince the Empress to drop Jao Assam's desertion charges. Jao was also allowed to leave the Imperial Knights and to join Ania and her companions on their travels throughout the galaxy. Following the meeting, AG-37 commented that Ania would never be turned away from the Empress's door again."}, {"tag": "p", "text": "Prior to their departure, AG-37's freighter was joined by two new crew members—Jao Assam and his Imperial comm droid, which had formerly been Yalta Val's property but had become a close companion of Jao during his travels. Following a warm final meeting between Jao and his former mentor Master Val, AG-37's freighter departed into hyperspace. By the following year, AG-37 and his companions were traveling throughout the galaxy. While visiting a cantina, Sauk succeeded in purchasing a retrofitted stabilizing coil from Jariah Syn and his companions Cade Skywalker and Deliah Blue. Sauk's purchase of the starship part came at an opportune moment; Sauk, Ania, Jao and AG-37 were attacked."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "AG-37 was an IG-series assassin droid with a masculine programming. Unlike other assassin droids, AG-37 had a friendly and compassionate personality. On one occasion, he gave Ania Solo free passage on his freighter to the Carreras system to honor an old promise which he had made to Han Solo, Ania's ancestor. This showed that AG-37 was willing to honor promises no matter how old they were. He regarded the Jedi as a source of harmony and justice in the galaxy and initially had high hopes for the new Galactic Triumvirate, the new galactic government which emerged following the Second Imperial Civil War. AG-37 was also discerning enough to recognize when someone did or did not posed a threat. On one occasion, he recognized that Jao Assam, the Imperial Knight, was no a threat since he did not want them dead. This led Jao to remark that this was the first time he had heard an assassin droid counsel restraint."}, {"tag": "p", "text": "AG-37 was known to have been operational for more than a century and thus treasured his memories, since they influenced his personality and character. Due to his old age, he had a better understanding of long-dead strangers from times long forgotten, particularly Ania's ancestor Han Solo. AG-37 was also willing to sacrifice himself in order to save other beings. This was best shown when he attempted to tell Ania to leave him behind so that she and Sauk could have more time to escape the Carreras communications array, which was heading on a collision course with the floating planet of Mala. Ultimately, Ania decided that AG-37's life was worth saving and ignored his pleas. On a second occasion, he willingly risked damage to his own mechanical body and internal systems to rescue Ania from being drenched in acid rain. While this saved Ania's life, the acid rain damaged his internal systems extensively, forcing Ania to shut him down to save her memories."}, {"tag": "p", "text": "Despite his combat skills, AG-37 was a cautious fighter who preferred to strategize his plan of action. AG-37 was wise enough to recognize that he and his companions would be unable to take on Darth Wredd and Darth Luft's syndicate on two separate occasions. Within Ania's party, he was a voice of reason and caution. While AG-37 knew little of Ania's life prior to her kidnapping for the alleged murder of an Imperial Knight, he was not prepared to jump to conclusions about her guilt until he had concrete evidence. He was also an optimist as shown when he welcomed Ania's acquittal and when he commented that all of the Sith who had been in hiding had been killed during the Battle of the Floating World."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a droid, AG-37 was technically not a living being. Thus, he could not technically be killed unless his memory banks were wiped or destroyed. On one occasion, AG-37 survived being cleaved in half by the rogue Sith Darth Wredd. However, he was repaired by Sauk and the Imperial Navy engineers on the Animus. AG-37 had more than a century of memories were preserved in his memory banks. Thus, He could remember meeting Han Solo and Chewbacca. In addition, AG-37 was a skilled starship pilot who owned his own freighter, which he used to deliver shipments across the galaxy. AG-37 was an excellent marksman and was skilled with firing blaster rifles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "AG-37 first appeared as a protagonist in Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2 comic series, a spinoff of Dark Horse Comics' popular Star Wars: Legacy comic series. AG-37 was well received by fans of the second Legacy comic series. One such fan, Stephen Howard, compared AG-37 favorably to IG-88, an assassin droid who debuted in The Empire Strikes Back; praising his interesting personality and compassion towards the main protagonist Ania Solo. In response, the series' editor Randy Stradley commented that AG-37 and IG-88 had different strengths and abilities. Stradley also clarified that AG-37's freighter had not been modified to the same extent as Han Solo's famous Millennium Falcon since AG-37 worked within the law most of the time. Stradley also dismissed fan speculation that AG-37 was somehow the astromech droid R2-D2's \"spirit\" reincarnated into a new body. He confirmed that AG-37 and R2-D2 were separate entities and suggested that AG-37 may have encountered R2-D2 at some point in his life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}