{"url": "AG-37%27s_freighter", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Unidentified freighters"], "nodes": [{"tag": "h1", "text": "AG-37's freighter"}, {"tag": "p", "text": "A freighter was owned by AG-37, an IG-series droid who made a living by transporting goods, between 138 and 140 ABY. As a freighter, it did not boast a very fast top speed and could not outrun starfighters. AG-37 served as the main transport vessel for AG-37 and his friends the junk dealer Ania Solo, the Mon Calamari engineer Sauk, and the Imperial Knight Jao Assam during the rogue Sith Darth Wredd's insurgency against the Galactic Federation Triumvirate, the new galactic government, and the One Sith order. AG-37's freighter participated in several of the group's adventures including the Carreras Incident, the liberation of the Mon Calamari Shipyards, Jao and Ania's mission to hunt down Darth Wredd, and a mission to rescue Ania from several kidnappers. During these adventures, AG-37's freighter was damaged several times and escaped destruction on a few occasions."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "AG-37's freighter was a large, lengthy capital ship that was capable of interstellar travel. As a freighter, it did not boast a very fast top speed and could not outrun starfighters. However, the freighter was armed with a laser cannon turret to protect it against enemy starships. In addition, the turret was also equipped with a harpoon and tow cable that allowed it to retrieve objects. The freighter was capable of transporting various types of cargo including a dangerous large beast, which had to be stored in a special cage, and even a squad of Trandoshan stormtroopers. The freighter's hold was also large enough to transport a small starship like Ania Solo's starship and the Imperial Knight Jao Assam's starfighter. AG-37's freighter was also capable of diving underwater, as shown when AG-37 and Sauk rescued Ania and Jao's escape pod from the poisoned oceans of Dac. It also boasted a small medical bay."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "AG-37's service"}, {"tag": "p", "text": "Little is known about the history of AG-37's freighter. Near the end of the Second Imperial Civil War, AG-37 encountered Ania Solo, a distant descendant of the smuggler Han Solo, in the Selvatas system. Ania had escaped from an Imperial labor camp on Drash-So and was desperate to get offworld. Despite Ania pulling a gun on him, AG-37 took pity on her and gave her passage offworld on his freighter, thus honoring his ancient promise to Han Solo. He brought Ania to Carreras Minor's moon in the Carreras system, where she established a junkyard. As a result of this encounter, AG-37 and Ania became friends. AG-37 was also known to visit her junkyard to obtain spare parts for his freighter."}, {"tag": "h3", "text": "The Carreras Incident"}, {"tag": "p", "text": "In 138 ABY, AG-37 visited Ania Solo's junkyard on Carreras Minor's moon to obtain a pair of linear converters. While visiting the junkyard, Ania and her Mon Calamari friend Sauk were attacked by the rogue Sith Darth Wredd, who was posing as Imperial Knight Yalta Val. After escaping Wredd and the Carreras security forces, AG-37's freighter fled into space only to encounter a blockade of Carreras starfighters. AG-37 took his ship into the rings of Carreras Minor and Solo jettisoned her ship from the cargo hold, which collided with their pursuers and allowed them to land on-world. The Imperial Knight Jao Assam then saved the freighter from the clutches of a tentacled serpent and joined the group. After determining that the real Yalta Val had been replaced by an impostor, AG-37's freighter traveled to the floating world of Mala, hoping to rescue Master Val. While traveling through the Surd Nebula, they were attacked by several Carreras starfighters. Upon arriving at Mala's last known coordinates, they found that the floating world had vanished. During this pursuit, the freighter sustained damaged to one of its rear thrusters. Shortly later, AG-37's freighter was captured by the tractor beam projector of a Shifalan patrol ship."}, {"tag": "p", "text": "AG-37's freighter was then dragged into the hangar bay of the patrol ship where a swarm of tiny droids burnt a hole through its hull and boarded the vessel, driving its crew and passengers down the landing ramp where they were apprehended by Carreras security forces. The freighter and its captive crew were then transported to the Carreras G51 communications array. Later, Jao, Ania, and their companions were released by the Shifala Governor Biala in order to deal with the Sith impostor Darth Wredd. During the skirmish, AG-37, Sauk, and Jao were gravely injured and Wredd managed to escape back to his base on Mala. Prior to the destruction of the Carreras communications array which collided with Mala during the \"Carreras Incident\", Ania managed to rescue Sauk, AG-37, and Yalta Val, whom she had saved from being killed by Darth Wredd. Jao was rescued by Val's communications droid. However, Darth Wredd managed to escape again for parts unknown."}, {"tag": "h3", "text": "Stopping Darth Luft"}, {"tag": "p", "text": "The damaged ship was unable to make lightspeed, but it was picked up by the Animus, a Star Destroyer affiliated with the Galactic Federation Triumvirate. Following repairs, AG-37 and Sauk took leave of their friends and left the Destroyer to continue with AG-37's transport business. After transporting a large beast to Iego, they later took the freighter to the poisoned world of Dac to aid Solo and Assam, whose communications droid was broadcasting a distress signal. In the freighter, AG-37 and Sauk dispatched several pirate ships; they also took their vessel into the world's oceans and rescued their friends' sinking escape pod with a harpoon and tow cable. Their attempts to flee the system led to a run-in with a large pirate armada, but the space battle was interrupted by the arrival of a Triumvirate fleet led by Val and Admiral Gar Stazi."}, {"tag": "p", "text": "Solo took out enemy droids with the ship's laser cannons as one of Stazi's tankers, the Trand Cappa, released water into the Mon Calamari Shipyards. When two pirates opened one of the shipyards' bay doors, all of the freighter's crew save for AG-37 went aboard in order to prevent the Mon Calamari and Quarren refugees inside from being sucked into the vacuum of space. AG-37 continued to fly in the battle, which was swiftly won by the Triumvirate fleet. AG-37 then committed both himself and his freighter to a hunt for Darth Wredd that Solo, Assam, and the comm droid had been undertaking, and Sauk joined as well."}, {"tag": "h3", "text": "Rescuing Ania"}, {"tag": "p", "text": "A year following the liberation of the Mon Calamari Shipyards, AG-37 did a delivery run to the spaceport Lasgo Port, which was in a system that was surrounded by an orbital minefield left over from the Second Imperial Civil War. While visiting Lasgo Port, Ania discovered that she wanted by the Triumvirate authorities for the murder of the Imperial Knight Teemen Alton, a crime which she denied committing. Shortly later, Ania was kidnapped by her former friend Ramid and his spacers. Ramid tricked Ania into boarding his freighter under the pretext of carrying out repairs and then disappeared with her into hyperspace. Ramid also attempted to detonate several nearby mines but Jao managed to move AG-37's freighter out of harm's way. During the kidnapping, AG-37's freighter sustained some light damage to its outer hull by laser fire from Ramid's starship, which was initially mistaken for meteor damage."}, {"tag": "p", "text": "Following Ania's kidnapping, AG-37, Sauk, and Jao embarked on a quest to rescue Ania and to ascertain the truth about the charges against her. While Jao was suspicious about Ania, AG-37 and Sauk defended her and insisted that she did not murder the Imperial Knight. Their travels took them to a barren planet which rain glass and acid. Due to the inhospitable atmospheric conditions, Sauk and Jao remained aboard AG-37's freighter while AG-37 scouted the area for any sign of Ania and Ramid. During their wait, Sauk and Jao received a transmission from the Imperial Knight Yalta Val, who had found new evidence that Ania was innocent because the actual murderer, a mysterious bounty hunter, had a prosthetic hand. By contrast, Ania was fully biological. After receiving further word that AG-37 had tracked down Ania and Ramid at a nearby settlement, Sauk and Jao flew the freighter towards that settlement."}, {"tag": "p", "text": "While Sauk waited aboard AG-37's freighter, Jao traveled into the settlement to rescue Ania. By that stage, the mysterious bounty hunter had killed Ramid and had almost captured Ania. Following a long and protracted duel, Ania and Jao succeeded in killing the bounty hunter, who had intended to implant her prosthetic hand on Ania's left hand in order to frame her for Alton's murder. However, Ania's problems were not over yet since she was arrested by a squad of stormtroopers and extradited to the galactic capital Coruscant to face trial. After recovering AG-37, whose mechanical body had been damaged during a downpour of acid rain, Jao and Sauk traveled to Coruscant to clear Ania's name. Despite securing Ania's acquittal and release, Jao Assam was arrested for deserting the Imperial Knights, a crime which carried the death penalty."}, {"tag": "h3", "text": "The floating world and beyond"}, {"tag": "p", "text": "After the rogue Sith Darth Wredd \"kidnapped\" Jao Assam and spirited him offworld, the Empress Marasiah Fel sent Ania and her companions on a mission to rescue Jao. She also assigned Ania a platoon of Trandoshan stormtroopers as protective escorts. For this mission, Ania used AG-37's freighter. The freighter's accommodation was not too comfortable for the large stormtroopers. After receiving Jao Assam's coordinates, Ania and her companions traveled to the floating world of Mala. Unknown to them, Darth Wredd had planned to lure the Imperial Knights and the One Sith into a trap. He intended to avenge the destruction of his family and his homeworld by destroying the One Sith. Wredd also wanted to kill Empress Fel and bring Jao Assam to the dark side."}, {"tag": "p", "text": "AG-37's freighter managed to land Ania's party on Mala's surface but did not participate in the Battle of the Floating World, which saw the destruction of the One Sith and the death of Darth Wredd. Following the events on Mala, AG-37's freighter returned to Coruscant where it was refueled and had its supplies replenished. Jao Assam was also pardoned by Empress Fel and allowed to leave the Imperial Knights. He joined Ania and her companions on their travels across the galaxy on AG-37's freighter. A year later, Sauk visited a cantina to buy a stabilizing coil. This purchase came at an opportune moment since Ania and her companions were immediately attacked by an unidentified party."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "AG-37's freighter debuted in Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2 series, which ran from 2013 to 2014. The starship was designed by Jimmy Presler, drawn by Hardman and Brian Albert Thies, and colored by Rachelle Rosenberg and Michael Heisler. In response to a fan query, the series' editor Randy Stradley confirmed that AG-37's freighter had not been modified into a smuggling vessel like Han Solo and Chewbacca's starship, the Millennium Falcon. Stradley explained that while Solo and Chewbacca had operated outside the law, AG-37 operated within the law most of the time. To date, the ship has not been named."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}