{"url": "Cassander_sector", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Cassander sector", "Category:Sectors", "Category:Trans-Hydian Borderlands"], "nodes": [{"tag": "h1", "text": "Cassander sector"}, {"tag": "p", "text": "The Cassander sector was a sector located in the Trans-Hydian Borderlands that contained the Kalki Nebula and the astronomical objects of Mamkoda, Caraxl, and Sheh Soahi. Around 34 ABY, during the Cold War between the Resistance and the First Order, the former sent an attack group to repel pirates that were attempting to take over the sector with the help of the First Order. After a battle on Sheh Soahi, the Resistance defeated the pirates and managed to gather information about the First Order's involvement with the pirates' attacks."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Cassander sector was located in the Trans-Hydian Borderlands region. The sector contained the Kalki Nebula and the astronomical objects of Mamkoda, Caraxl, and Sheh Soahi."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history and the First Order"}, {"tag": "p", "text": "For centuries, pirates had operated in the Cassander sector, using hidden bases inside the Kalki Nebula to organize hit-and-run attacks against nearby star systems. Around 34 ABY, during the Cold War between the First Order—the successor of the Galactic Empire—and the Resistance, a small paramilitary force created by New Republic senator Leia Organa, the Cassander sector was located between New Republic and First Order Space. The First Order, seeking to take over the sector, enlisted a group of pirates to take control of it on its behalf. With equipment provided by the First Order, the pirates raided both Mamkoda and Caraxl and eventually took control of a local spaceport on the former, turning it into a base of operations."}, {"tag": "h3", "text": "The Resistance campaign"}, {"tag": "p", "text": "Once the Resistance learned about the threat of the First Order in the Cassander sector, they sent an attack group to repel the pirates. The group consisted of RZ-2 A-wing interceptors and MG-100 Starfortress bombers along with their mobile base of operations, the Free Virgillia-class Bunkerbuster Ninka under the command of Vice Admiral Amilyn Holdo. The Resistance's first objective in the sector was to destroy the local pirate base on Mamkoda. During the battle, A-wings led by Resistance pilot Tallissan Lintra and bombers from Crimson and Cobalt Squadrons managed to destroy the spaceport without taking any losses. Three days after the battle on Mamkoda, a group of Resistance bombers were dispatched to Caraxl on a relief mission to deliver supplies. During that attempt, Lintra reported that First Order TIE fighters were approaching their position. Since the Resistance attack group had orders to avoid any confrontation with the First Order that could cause problems in the New Republic Senate, the Resistance called off the relief mission and returned to the Ninka."}, {"tag": "p", "text": "The Resistance attack group then traveled to Sheh Soahi after droid spies informed them that the main pirate base was located there. On Sheh Soahi, the Resistance launched an assault on the pirate base. After a fight between both forces, the pirates damaged the MG-100 bomber Cobalt Scarab and destroyed two A-wing fighters. However, the Resistance ultimately emerged victorious after it destroyed the pirates' base, defeated their forces, and intercepted a transmission in which the pirates demanded help from the First Order, with the Resistance planning to present the communication to the New Republic Senate. With the defeat of the pirates and the acquisition of the evidence of the First Order's involvement, the Resistance ended their campaign in the Cassander sector."}, {"tag": "p", "text": "Some time after those missions, Resistance gunner Paige Tico wrote about the campaign in the Cassander sector in her journal, which ended up in possession of her sister Rose Tico after the former's death during the Battle of D'Qar. Rose would later also mention the campaign in her own journal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Cassander sector was first mentioned in the new Star Wars canon in the 2017 replica journal book The Last Jedi: Bomber Command, written by Jason Fry. The \"Cassander sector\" was originally introduced in the Star Wars Legends continuity in the 2004 Wizards of the Coast sourcebook Geonosis and the Outer Rim Worlds. In that book, the Cassander sector, along with the Tadrin and Tendrannan sectors, was established as part of the \"Cassandran sectors.\" The 2009 reference book The Essential Atlas, however, depicted star systems that Geonosis and the Outer Rim Worlds had previously placed in the three different \"sectors\" as part of a single \"Cassander sector.\" The StarWars.com Online Companion to The Essential Atlas later clarified that the Cassander, Tadrin, and Tendrannan sectors were, in fact, subsectors of the larger Cassander sector."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}