{"url": "Cassio_Tagge", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:House of Tagge", "Category:Humans", "Category:Imperial Army generals of the Galactic Empire", "Category:Imperial Supreme Commanders", "Category:Joint Chiefs of the Imperial military", "Category:Males"], "nodes": [{"tag": "h1", "text": "Cassio Tagge"}, {"tag": "p", "text": "Cassio Tagge was a high-ranking human male officer during the reign of the Galactic Empire. Born into the wealthy and powerful Tagge family of Tepasi (the owners of TaggeCo), Tagge held the position of Chief of the Imperial Army; serving on the Joint Chiefs, he had access to the upper-levels of the Imperial Palace. In the early stages of the Galactic Civil War, Tagge served as a Major General and opposed the efforts of Grand Moff Wilhuff Tarkin and Admiral Conan Antonio Motti to base Imperial policy around the DS-1 Death Star Mobile Battle Station superweapon."}, {"tag": "p", "text": "Following the Battle of Yavin and the destruction of the battlestation, Tagge was elevated to the rank of Grand General by Emperor Sheev Palpatine. As the new Supreme Commander of the Imperial Military, he relied on systems analysis and attempted to reorient Imperial strategy to rely on numerical superiority. Despite success in anti-piracy operations, his tenure was marked by his acrimonious relationship with Darth Vader, Dark Lord of the Sith—causing Tagge to increasingly rely on the cyberneticist Cylo as his enforcer. However, Cylo's betrayal caused the Emperor to lose faith in Tagge, leading to his demotion and, soon after, his execution by Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "A male human from Tepasi, Cassio Tagge was born to a noble and wealthy family who owned and operated TaggeCo, a company that notably had mining interests on Lucazec. Within a year of the formation of the Galactic Empire, the autocratic government that replaced the Galactic Republic at the end of the Clone Wars, Tagge had joined it and became an officer.  within the Imperial Army. By 14 BBY, Tagge held the rank of General and had risen to head the Army; in the capacity of Chief of the Imperial Army he served on the Joint Chiefs. He was considered a rival to the head of the Naval Intelligence Agency, Vice Admiral Dodd Rancit."}, {"tag": "p", "text": "That year, Tagge gathered with the rest of the Joint Chiefs on Coruscant to confer with members of the Imperial Ruling Council and the intelligence agencies of COMPNOR to discuss the attacks carried out by a group of insurgents who had hijacked Moff Wilhuff Tarkin's personal vessel, the Carrion Spike. During the meeting, word arrived that the insurgents were attacking Imperial assets on Lucazec, which alarmed Tagge due to TaggeCo having operations there. He watched in anger as footage came in of the insurgents destroying both space and surface operations on the ground. The insurgents were eventually caught and executed, and Tagge was among those rewarded for his aid in stopping the threat."}, {"tag": "h3", "text": "Aboard the Death Star"}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Tagge was stationed aboard the Death Star, where he was in charge of army operations as Chief of the Imperial Army and served as a Major General. During a meeting of high ranking imperials aboard the Death Star, Tagge argued with fellow Joint Chief Admiral Conan Antonio Motti, who did not share Tagge's view that the Rebel Alliance, which had stolen plans to the Death Star, represented a threat to the Empire and to the Death Star. Motti dismissed Tagge's concerns, noting that while the Rebels might pose a threat to Tagge's fleet, they were no threat to the Death Star. Tagge began to point out that the Rebels had been building and would continue to gain support within the Imperial Senate, but was interrupted by the arrival of Grand Moff Tarkin and Darth Vader, who informed the officers that the Senate had been disbanded by Emperor Sheev Palpatine. Tagge was stunned by this news, and openly questioned how control would be maintained without the bureaucracy, but Tarkin revealed that regional governors like himself would now wield total control over their territories, with the threat of the Death Star keeping systems in line through fear."}, {"tag": "p", "text": "Tagge protested again that the Rebel Alliance was a threat to that plan due to their possession of the technical readouts of the Death Star, but Darth Vader claimed that the plans would soon be recovered and Motti stated that even with the plans, any attack would be useless against the battlestation. After suggesting that they use the Death Star, Motti began to argue with and insult Vader due to his failure to locate the stolen plans and his devotion to the Force. Tagge watched uncomfortably with the other officers as Vader began choking Motti with the Force until Tarkin, who seemed to be bored, ordered Vader to stop. After witnessing Vader's display of power, Tagge glanced to the chair two down from his, which had previously belonged to Director Orson Krennic, and met eyes with Motti. While neither would say anything else for the rest of the meeting, Tarkin then addressed Tagge's concerns by claiming that Vader would soon learn the location of both the plans and the hidden Rebel base, after which the Rebellion would be swiftly crushed along with any threat it presented to the Empire. However, Tagge no longer viewed the Death Star to be the Empire's greatest weapon, and he instead began to believe that its greatest weapon was Darth Vader himself."}, {"tag": "h3", "text": "Supreme Commander of the Empire"}, {"tag": "p", "text": "Despite the confidence and arrogance of Tarkin and Motti in the might of the Death Star, Tagge's fears were soon realized when the Rebels destroyed the battle station at the Battle of Yavin. Tagge survived the destruction of the Death Star, having left the station to investigate Princess Leia Organa's false claims about an active Rebel base on Dantooine. During the process of Tagge's investigation, his forces brought back a female individual who had been skulking around the perimeter and had greeted the Stormtroopers openly. Tagge briefly questioned this individual about her motives, to which the individual claimed that she was simply salvaging any components left over in the abandoned base. Tagge became suspicious about her knowledge of the base's connection to the Rebels but ultimately came to the correct conclusion that the individual had no prior relationship with the Rebel Alliance. Despite this conclusion, Tagge decided that she was still too dangerous to let live. He then ordered her execution, which was then forced to be carried out by one of the Stormtroopers under his command. This decision to use only one Stormtrooper to execute the individual (whether made by Tagge or one of his sub-commanders) would prove to be faulty as the individual would quickly make her escape from the attempted execution and the planet."}, {"tag": "p", "text": "After the Battle of Yavin, Tagge was praised by the Emperor for having the foresight to recognize the Rebel threat and weaknesses of the Death Star. As a reward, Tagge was elevated to the rank of Grand General and promoted to Supreme Commander of the Imperial Armed Forces, which would now be governed by his philosophy as the second Death Star was constructed."}, {"tag": "p", "text": "Darth Vader was subsequently placed under Tagge's command due to his failure to protect the Death Star, and the two began working together to identify the source of increased pirate raids on the Empire's shipping. Vader stopped one of these attacks, disabling an automated CR90 corvette and returning it to Tagge's flagship, the Super Star Destroyer Annihilator. Tagge and Vader both agreed that the sophistication of the attacks suggested a well-supplied and smart group was behind them, and that a spy was likely feeding them information on Imperial shipping. Tagge was unconcerned with the level of attrition to the Empire's supplies by the attacks, noting that they were well within normal levels of unrest that could be expected after a disaster like the Death Star's destruction. However, he expressed disappointment at the amount of resources wasted in the construction of the Death Star, referring to it as \"Tarkin's Folly,\" and wondered how many more Super Star Destroyers could have been built instead."}, {"tag": "p", "text": "Vader countered Tagge by claiming that Tarkin had vision, while Tagge was more concerned with statistics and graphs. Tagge reminded Vader that he also had the command of the military, and that although his plans might not be as grand as Vader or Tarkin's, they were still effective. After lecturing Vader on the power of the fleet to crush any form of resistance through sheer size and firepower applied over time, he informed Vader that he planned to repair the pirate vessel so that it would return to its source. Vader noted that the pirates would surely destroy their station rather than risk further exposure, a point Tagge agreed with, and he then informed Vader that he would lead the team aboard the corvette aboard the station to recover the information they needed before that occurred. The Grand General then proceeded to lecture Vader on how their new arrangement was for the best, comparing himself to a skilled lightsaber wielder, with Vader as the lightsaber. He then informed the Dark Lord that he was also assigning Lieutenant Oon-ai to be Vader's adjutant, albeit one who would also be personally reporting back to Tagge."}, {"tag": "p", "text": "After Vader successfully raided the pirates' space station, he returned to Tagge and complimented the Grand General on his plan and informed him that the pirates were being backed by the Crymorah syndicate. Tagge was pleased that they knew who to target, but was stunned when he turned around and saw Vader carrying Oon-ai's body. Vader threw the lieutenant at Tagge's feet and claimed that he had identified him as the leak, noting that Oon-ai must have used his closeness to Tagge to steal the information, and that Tagge should choose his aides more carefully. In actuality, Vader had an astromech droid plant information in the pirates base that implicated Oon-ai in order to remove Tagge's spy from his presence and send a message to the Grand General."}, {"tag": "p", "text": "In addition to his efforts to root out pirates, Tagge was charged with overseeing the Imperial expansion of the Outer Rim. For that purpose, he decided that criminal elements which had been left unchecked in the previous years would no longer be allowed to act with impunity. The only ones spared from Tagge's crackdown were the Hutts as a result of their newfound alliance with the Empire. As part of this new campaign, Tagge sent Vader to destroy the Son-tuul Pride, a major competitor of the Hutts and the masters of the Son-tuul underworld. Vader successfully destroyed the Pride by using one of their smugglers as an agent to track down their headquarters. Their horded stash of credits became Imperial property and, per Tagge's decree, were to be immediately transmitted to Imperial vaults."}, {"tag": "p", "text": "After the Son-tuul Pride fell, Tagge then concentrated on crushing the Plasma Devils. He was also assigned to deliver missions to several new agents selected by the Emperor: cyborgs created by Cylo. His remaining task force was placed under the command of the Astarte twins. General Karbin was sent to capture Luke Skywalker and Tulon Voidgazer was assigned to overlook certain research problems. Vader was instructed to track down the people behind the theft of the Son-tuul Pride's fortune and punish them. Tagge, who wanted the credits recovered to fund the construction of a new Super Star Destroyer also assigned Inspector Thanoth to be Vader's adjutant."}, {"tag": "p", "text": "When the mining world of Shu-Torun descended into civil war due to the Ore-dukes' refusal to honor the Empire's taxing tithes, the Emperor ordered a full military intervention to defend the Imperial-backed government led by Queen Trios. Vader was given command of the military force sent to Shu-Torun but, by Tagge's request, Cylo and his surviving cyborgs were sent to accompany Vader as advisors and support during the campaign."}, {"tag": "p", "text": "Tagge's trust in Cylo and his cyborgs would prove to be his undoing. Thanks to him, Voidgazer was able to aid Cylo in taking control of the Executor and subdued the grand general and the rest of the bridge crew with a nerve gas. After Vader killed the cyborgs and all the remaining clones of Cylo, Tagge was left with the blame for the attempted coup. For his failures and lack of judgement, Tagge was demoted by the Emperor and placed under Vader's command. Disgraced but desperate to survive, he insisted that, despite the disasters that had happened under his command, everything had worked to the Empire's advantage. As Tagge attempted to convince Vader of his continued usefulness, the Sith Lord cut him off by using the Force to strangle him to death."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "According to Resistance Admiral Ushos O. Statura, some of the tactics employed by Tagge were taught at naval academies by 34 ABY. In the same year, Gial Ackbar acknowledged that Tagge was a \"canny adversary.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A fair-skinned man, Cassio Tagge had brown eyes and hair. Tall and thickly built, he had a broad face with a cleft chin. By the sixth year of the Empire, he sported long, flaring sideburns, and he still had them more than fourteen years later."}, {"tag": "p", "text": "Tagge was considered a dogged but unimaginative leader in his capacity as Chief of the Imperial Army, often butting heads with rivals in the Imperial Navy such as Dodd Rancit and Conan Antonio Motti on strategic questions.  Nevertheless, he was a methodical individual, fond of creating and analyzing models about the activity of the Imperial Fleet. Tagge was among the few high-ranking Imperials who took the fledgling rebellion as a serious threat to the Empire—regarded by colleagues like Motti as being \"distressingly myopic\" on the subject of the Rebel Alliance. His concerns would be vindicated after the destruction of the Death Star."}, {"tag": "p", "text": "Following the destruction of the Death Star and his subsequent promotion to Grand General, Tagge grew overconfident with the power and the authority obtained. Despite having witnessed Vader's power firsthand, he was condescending towards the Dark Lord and arrogantly believed he could wield Vader as his own personal weapon. Despite his successful analytics, his antagonism with Vader, coupled with his poor judgement in the Cylo affair, caused his demotion, and immediately after, his death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "General Tagge was played by Don Henderson in the 1977 film Star Wars: Episode IV A New Hope, the first film of the Star Wars original trilogy. The character was depicted in Star Wars Legends as having died when the Death Star exploded. As Kieron Gillen was writing the Star Wars: Darth Vader series and required a military opponent to Vader, the Lucasfilm Story Group inspected the film to check which generals are present on the Death Star at the end of the film. Pablo Hidalgo realized Tagge disappears from the film halfway through, unlike Tarkin and Motti, nor did he die onscreen. His role in the comic is also a reference to the Legends character Ulric Tagge, who was meant to be this Tagge before it was retconned due to inconsistent continuity between Star Wars products. Holocron continuity database keeper Leland Chee came up with giving Tagge the title of Grand General."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}