{"url": "Castas", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Bounty hunters", "Category:Klatooinians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Castas"}, {"tag": "p", "text": "Castas was a male Klatooinian bounty hunter who worked with Aurra Sing, Bossk, and Boba Fett during the Clone Wars, helping Boba track down Jedi Master Mace Windu. He was later killed by Sing at a bar on Florrum."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Castas operated as a bounty hunter during the Clone Wars, and signed on with fellow hunters Aurra Sing and Bossk to help Boba Fett seek his revenge for his father Jango's death by killing Jedi Master Mace Windu. Together, they went to Vanqor, where they entered the wreckage of the Endurance and captured Admiral Kilian, Commander CT-411 \"Ponds,\" and a clone navigation officer. The hunters left a bomb behind and returned to Slave I."}, {"tag": "p", "text": "Upon their arrival, Windu and Anakin Skywalker triggered the bomb, causing an explosion that trapped them in the wreckage. Although Castas wanted to leave and collect the bounty on the Republic officers, Fett convinced him, Sing, and Bossk that Count Dooku would pay them extra for killing Windu and Skywalker."}, {"tag": "p", "text": "After Sing took Kilian and the clones hostage, Castas decided the stakes were too high for him and left when the group arrived on Florrum. They entered a bar run by Sing's old friend, Hondo Ohnaka, and Castas immediately called for a pick up from the planet via hologram. After insulting Sing behind her back and attempting to betray her by giving away valuable information, Sing shot and killed Castas. Boba who was distressed by the killing, but Hondo then got his men to clear Castas' body away while everyone else went about their business as usual after a small chuckle at the incident."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}