{"url": "Castin_Donn", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Coruscanti", "Category:Humans", "Category:Males", "Category:Pilots", "Category:Slicers", "Category:Wraith Squadron personnel"], "nodes": [{"tag": "h1", "text": "Castin Donn"}, {"tag": "p", "text": "Castin Donn was a Human male from Coruscant who was a member of the New Republic commando group Wraith Squadron. In 7.5 ABY, Donn was brought in to replace the Wraiths' former slicer, Eurrsk Thri'ag, during the New Republic's campaign against Warlord Zsinj. When the Wraiths began an undercover operation and pretended to be pirates preying on the Halmad system, Donn participated in a number of raids, and his slicing skills proved instrumental to some of their successes. The Wraiths' pirate activities were later noticed by Zsinj, and they were invited aboard his flagship, the Executor-class Star Dreadnought Iron Fist, to parley. Donn proposed a plan to his commander, Wedge Antilles, that would allow them to track Zsinj's location. Antilles deemed the plan risky but doable and assured Donn it would be implemented in the future. Feeling that Antilles was being too cautious, Donn disobeyed a direct order to remain on base and infiltrated the ship on his own initiative. Donn perished during a shootout against stormtroopers after freeing a Talz specimen Zsinj's scientists were experimenting on."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Joining the Wraiths"}, {"tag": "p", "text": "During the Galactic Civil War, Castin Donn was part of a Coruscant-based rebel group that was independent of the Rebel Alliance. Even though Donn's revolutionary group was opposed to the Empire, its members shared a similar attitude with the Imperials in their xenophobia. Donn participated in the group's efforts to bring news footage of the destruction of the Second Death Star to Coruscant's public holoprojectors. That act would leave a painful reminder to Donn, as stormtroopers were sent to pacify the jubilant crowd of Rebel-sympathizers. A young mother besides Donn was shot in the head, and Donn had to grab her baby boy in order to prevent him from being trampled by the stampede caused by the fleeing crowd."}, {"tag": "p", "text": "Sometime during Donn's stay at Coruscant, he incurred a criminal record as an insurgent. Donn tried to wipe out all traces of his record but failed when copies propagated too fast for him. He later created a false identity and arranged passage off-world, ending up in New Republic-controlled space where he joined the New Republic Defense Fleet as a slicer. Two years later, Donn transferred to Starfighter Command and began pilot training after engaging in a fistfight with a Sullustan navigator. It was just one of the many blemishes on his service record, aside from regularly shirking his routine duties. When Donn volunteered for Wraith Squadron, a starfighter unit that also performed commando missions, Wraith Leader Wedge Antilles was not dissuaded by Donn's history, as other members of the Wraiths also had similar marks on their records. In 7.5 ABY, Donn officially became part of the squadron, shortly after the Wraiths took part in the Battle of Ession and destroyed the Imperial-class Star Destroyer Implacable."}, {"tag": "h3", "text": "Raids on Halmad"}, {"tag": "p", "text": "After successfully destroying the Implacable—which was aligned with the renegade Imperial, Warlord Zsinj—and shutting down parts of Zsinj's secret business empire, the Wraiths were given their new mission by the Commander-in-Chief of New Republic military operations, Admiral Ackbar. Combining the submitted ideas of Gamorrean Voort saBinring and Thakwaash Hohass Ekwesh's group during a Wraith Squadron brainstorming session, the Wraiths were to be deployed in the Halmad system to prey on the Imperial-controlled planet Halmad. The Wraiths' objectives were twofold: make a name for themselves as a pirate group in order to attract Zsinj's attention, and to force the government of Halmad to seek protection from Zsinj."}, {"tag": "p", "text": "Using the alias Hawk-bat Independent Space Force, the Wraiths infiltrated Victory Base—the Imperial base on Halmad—and stole five TIE Interceptors to augment their own forces. Donn's slicing skills proved instrumental in the operation when he forged an immediate maintenance order for the base's hangar, as well as disabling the holocams inside, thus enabling the Wraiths to enter the hangar without raising any suspicion. When the Wraiths' cover was blown due to Wraith actor Garik Loran providing a wrong password to the replacement sentry, Donn was responsible for providing an escape distraction. Donn activated the base's antiquated air-raid siren system, making the base's personnel think that they were under attack by an unknown force, and throwing the whole base into confusion. Amidst the chaos, the Wraiths flew their new Interceptors out of the hangar undetected while Donn and the rest escaped the base by boarding a commandeered skimmer."}, {"tag": "p", "text": "The Wraiths' next deed was ambushing the Corellian freighter Barderia and looting its cargo. Donn was among those who boarded the freighter in order to make sure that the ship's cargo manifest was accurate. Slicing into the freighter's system, Donn obtained enough information that enabled the Wraiths to ambush the Halmad-bound Barderia once more upon its return journey. To keep the illusion that Wraith Squadron was part of the Solo Fleet tasked to hunt down Zsinj, the majority of the Wraiths made a visit to the Mon Remonda—General Han Solo's flagship—and flew a mission with the elite unit Rogue Squadron. Only Donn, Ekwesh, Kell Tainer, and Ton Phanan were left on Hawk-bat Base, the squadron's temporary operation center. Acting on their own initiative, the four remaining Wraiths used their time productively and staged multiple raids on Halmad. Their first raid was on Fellon city's port warehouse district, stealing large quantities of Imperial propaganda and recreational holos. They then strafed the city's marina before making their escape."}, {"tag": "p", "text": "The second raid was a robbery on a money-exchange site in the city of Hullis. Donn was sent to the city a day before the raid in order to compromise the building's security system, enabling Tainer and Phanan to blow a hole in the building's side and fly their TIE Interceptors in to seize their loot. Then, before his extraction from the city, Donn managed to slice an account into Halmad's planetary defense satellite, providing the Wraiths with visual and sensor data on the planet. With the return of the other Wraiths, Wedge Antilles decided that their next operation was to eliminate the two newly constructed starfighter bases on Halmad. To emphasize their superiority over the local Imperials, Antilles announced that both missions were to be executed at the same time. The operation was later dubbed by Wraith Squadron's intrusion expert Tyria Sarkin as Operation Groundquake."}, {"tag": "p", "text": "Donn was part of Tainer's group which was tasked to capture the refueling tanker Bastion and detonate it in one of the bases. Unbeknownst to the Wraiths, Halmad had already placed itself under Zsinj's protection. Halfway through the Wraiths' operation, Zsinj's flagship, the Executor-class Star Dreadnought Iron Fist appeared in-system. It deployed fighters and caught the Bastion in a tractor lock. While the other Wraiths dealt with the fighters, Donn and his group managed to escape by flying their shuttle, Narra, out of Bastion's hold and detonating the tanker as it drew closer to Iron Fist. The explosion broke the tractor beam lock, allowing the shuttle to withdraw. Donn's group survived the encounter, but Loran's group lost Phanan when his TIE Fighter was shot down during the engagement, and Phanan later died of his injuries."}, {"tag": "h3", "text": "Castin's plan"}, {"tag": "p", "text": "Shortly after escaping from Zsinj's ambush, Donn received a message from Zsinj, which was left on one of the accounts Donn sliced into Halmad's planetary defense satellite network. The message showed a hologram of Zsinj inviting the Hawk-bats to meet with him aboard the Iron Fist, in order to discuss the terms of a possible partnership. The message was welcomed by the Wraiths, who deemed it as the sign that the undercover operation was a success. Antilles began screening out candidates for the envoy group, and Donn was excluded due to his criminal record on Coruscant, as Antilles believed that Zsinj might have a copy of Donn's file. Undeterred, Donn approached Antilles after the other pilots were dismissed, and proposed to sneak aboard the Iron Fist undetected, disguised as a stormtrooper, while the envoy group met with Zsinj. Once aboard, Donn would introduce a program into the Iron Fist's system that would prompt the ship to send out periodical signals of its location."}, {"tag": "p", "text": "Given a capital ship's protocol of memory flushing and scanning its programs, Donn calculated that the program would only last two weeks. Donn hoped that in that time, the Wraiths would be able to draw a pattern of the ship's regular destinations before launching an ambush. Donn's program would work similarly to Project Morrt, a ship tracking project initiated by Zsinj's late subordinate, Admiral Apwar Trigit, who had commanded the Implacable before its destruction. Antilles approved of the plan and ordered Donn to start working on the program, but to Donn's surprise, he was told that it would not be used in the initial meeting, as Antilles felt Zsinj would be on his guard with unknown pirates boarding his ship. Antilles assured Donn that his program would be used on the following meetings, preferably after they had gained Zsinj's trust and Iron Fist's security became more lax. Donn began arguing vehemently that he was better than Zsinj's security team and his plan should be implemented. Noting Donn's stubborn attitude, Antilles issued him a direct order to start working on the program and refused his plea to be included in the initial meeting with Zsinj before dismissing him."}, {"tag": "p", "text": "Donn proposed his plan once more during a combined briefing of all the separate but simultaneous missions the Wraiths were undertaking. Announcing that his program was ready, Donn still found himself being refused participation to the envoy for Zsinj. Unable to contain his frustration, Donn reacted to Antilles's rejection with a sudden outburst. The situation prompted Antilles to discipline Donn by castigating him in front of his fellow pilots, as well as canceling his impending leave to Coruscant. Donn left the briefing in a fury and was followed by Loran, who tried to gain some understanding on Donn's behavior. Donn reasoned that Antilles was being too cautious and his own plan should be implemented, while Loran tried to explain the validity and sense of Antilles's stance. Unsure of the code-slicer's frame of mind, Loran made Donn promise never to try anything on his own, which the code-slicer agreed to."}, {"tag": "h3", "text": "Aboard the Iron Fist"}, {"tag": "p", "text": "Unbeknownst to the envoy team, which consisted of Loran, Tainer, and Dia Passik, Donn went against Antilles's orders and hid himself in the Narra's smuggling compartment. Hiding behind a long strip of reflective mirror, Donn was able to fool Tainer into thinking that the compartment was empty when Tainer inspected it. After the Narra landed aboard the Iron Fist and was duly inspected by Zsinj's forces, Donn emerged from his hiding place wearing stormtrooper armor for his disguise. While looking for a computer terminal into which he could load his program, Donn stumbled across a biomedical research project that Zsinj's scientists were performing. Trying his best to ignore the sympathy he was feeling for the test subjects, Donn got to work on uploading his program. He was interrupted when a squad of stormtroopers arrived for inspection. Believing that the stormtroopers were searching for him, Donn shot and killed the lead stormtrooper, beginning a short shootout in the laboratory. In a sudden act of mercy, Donn freed the modified Talz that Zsinj's scientists were working on before making his escape. However, Donn was shot in the thigh by the squad's remaining stormtrooper. Realizing that his end was near, Donn shot his datapad, thereby destroying all information it contained. Donn's last act was to protect his teammates' secret identities from being exposed."}, {"tag": "p", "text": "Donn died in the brief shootout, and his corpse was brought to the dining hall, where Zsinj was having dinner with the envoy team. A device was hidden behind Donn's armor that made it look like he was still breathing. Testing whether or not Donn was part of the envoy team, Zsinj requested \"General Kargin\"—Loran's Hawk-bat identity—to execute Donn. Loran stalled for time as he tried to come up with a plan, but \"Seku\"—Passik's Hawk-bat identity—quickly shot Donn in the throat. Zsinj was then convinced that Donn was not part of the Hawk-bats and allowed them to leave. Safely aboard the Narra and traveling through hyperspace, Passik immediately explained that she believed Donn was already dead. Passik noted that the way the stormtroopers carried Donn's body suggested that they were hauling a dead body, not a person liable to wake up."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Due to the trauma of shooting Donn's corpse, Passik suffered a breakdown and nearly killed herself with her own blaster. Loran quickly intervened and pacified Passik by telling her that she had saved his life as well as Tainer's when she shot the slicer's body. Passik later recovered from her ordeal and soon began a relationship with Loran. Donn's death was the second in the squadron's ongoing mission on Halmad, only mere days after Phanan's. Worried that Donn's death would affect the squadron's morale, Antilles voiced his concern to the squadron's executive officer, Wes Janson, in a conversation overheard by Ekwesh. Taking it upon himself to \"heal\" the squadron's morale, Ekwesh organized a formal dance attended by everyone in Wraith squadron and its support personnel."}, {"tag": "p", "text": "Donn's tracking program was later modified by Lara Notsil, his successor as the squadron's qualified slicer. Wraith pilot Shalla Nelprin then joined Zsinj's intrusion team and uploaded the program onto the Razor's Kiss, a newly constructed Executor-class Star Dreadnought that Zsinj had captured from the Kuat Drive Yards. Donn's program allowed a New Republic task force commanded by Han Solo to track down the Razor's Kiss and destroy it."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Castin Donn was a proud man and very confident of his own abilities, to the point where he would intentionally disobey orders or be rude to his superior officers just to prove he was right. In one instance Donn claimed to be better than Zsinj's chief of security, despite not having heard of or met the individual. A naturally brave man, Donn would consistently participate in many dangerous situations, as shown by his joining of a rebel group opposed to the Empire and his volunteering to join Wedge Antilles's Wraith Squadron. When asked for his reasons in joining the Wraiths, Donn answered that he wanted to be where things happened, and that things always happened around Antilles. During his tenure in the New Republic Defense Fleet, he received many citations for courage and ingenuity under fire."}, {"tag": "p", "text": "A career code slicer, Donn exhibited traits typical to his profession. He incurred punishments from the Defense Fleet for failing to perform routine duties in a reliable fashion. His usual posture was nonmilitary; he always leaned on something or slouched when seated. Antilles once thought Donn resembled someone who left his spine somewhere else. When Donn felt uncomfortable, he showed a child-like mannerism of squirming, a trait which Antilles thought was highly unusual for a grown man."}, {"tag": "p", "text": "Despite believing that the Empire and Warlord Zsinj ought to be stopped, Donn shared a similar trait with the Imperials in their xenophobia. Having joined the diverse New Republic, Donn found himself having conflicts with Mon Calamari bridge crewmen, or engaging in a fistfight with a Sullustan navigator. When he joined the Wraiths, he was assigned to share quarters with the Thakwaash Hohass Ekwesh. Donn tried to have his quarters exchanged, but his request was denied by Antilles, who believed it was time Donn overcame his dislike of non-Humans. Donn was able to release his prejudice during his last moments aboard Zsinj's flagship Iron Fist, when he freed a modified Talz Zsinj's scientists were working on."}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "Even before joining the New Republic, Castin Donn was already a capable slicer. During his tenure with the Wraiths, he performed well in all the missions he participated in with regards to his technical expertise and code-breaking skills. The only time he was unable to break a security system was when he infiltrated the Iron Fist and attempted to plant his tracking program. Though Donn felt that he was better than the Imperial who created the security system, Donn attempted to bypass a security system in mere minutes, even though the system could have been prepared over months or years."}, {"tag": "p", "text": "Donn was a capable pilot, managing to earn a high enough score to qualify for Antilles's squadron, though he sorely lacked experience, as shown by Antilles's decision to assign him as Wraith Two. By Antilles's policy, the position usually went to a raw pilot, one in need of additional instruction or protection. When Donn joined Wraith Squadron, he had no experience of flying a TIE Fighter, but after a few days training with a TIE fighter simulator, he was already one of the pilots tasked to fly a TIE Fighter the Wraiths planned to steal from Victory Base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Castin Donn is a character created by author Aaron Allston for his novel X-Wing: Iron Fist, the second novel in the Wraith Squadron Trilogy. It was the only appearance Donn ever made in the Expanded Universe. He was illustrated by Star Wars artist Scott Roller in the article Who's Who in Rogue Squadron, which appeared in Star Wars Insider 59."}, {"tag": "p", "text": "The point at which Donn died aboard the Iron Fist is ambiguous. The novel does not specifically state whether Donn was alive or dead when Dia Passik shot him in the throat, but according to Passik's entry in The Complete Star Wars Encyclopedia, published in 2008, Donn was nearing death when she shot him. The entry could possibly be counted as inaccurate, as Donn's own entry in the encyclopedia states that he was executed by an Imperial officer named Captain Seku, which was Passik's pirate alias in the Hawk-bat Independent Space Force, not the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}