{"url": "Castle_Lands", "categories": ["Category:Legends articles", "Category:Alderaan locations", "Category:Killik culture", "Category:Natural formations"], "nodes": [{"tag": "h1", "text": "Castle Lands"}, {"tag": "p", "text": "The Castle Lands was a region located across the northern steppes of the planet Alderaan. While mostly plains, the Castle Lands also included the Kaamos Territory, north of the Juran Mountains and the Glarus Valley."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Killiks, a species of sentient insectoids, used to live on these plains in ancient times. Prior to 30,000 BBY, the Killiks built a series of towering, castle-like hive mounds in the plains. Those castles contained a complex network of egg-laying grottoes, the chambers of which were decorated with colorful mosaics made of stones and pebbles. The Killiks had christened the settlement Oroboro, which literally meant \"our home\" in their language."}, {"tag": "p", "text": "Around 30,000 BBY, a race of powerful aliens known as the Celestials removed the Killiks from Alderaan. They did so in a protective measure, as the Killiks had consumed all the natural resources of their green planet and were bent on exploiting other worlds in the same ravenous fashion."}, {"tag": "p", "text": "In 27,500 BBY, Human colonists from Coruscant arrived on Alderaan. By that time, the Killiks had long been emptied from Oroboro, and the sole evidence of their past existence was their empty, petrified hive mounds. Shrouded in mystery, the towering abandoned cities of the Killiks became known as the Castle Lands. During the millennia of Human occupation, the abandoned hives remained untouched, as a symbol to remind how civilizations could fall."}, {"tag": "p", "text": "In the last days of the planet, the Castle Lands of Alderaan was an area of inspiration and meditation for many Alderaanian artists and philosophers. Some of the organic-looking monoliths were even retrofitted with all modern comforts. While the Humans from Alderaan had not been the first inhabitants of the planet, they had perfectly integrated the Killik Castles into their own culture. In the last decades of the Galactic Republic, the Killik region also hosted animals the wool of which was used to make traditional Alderaanian long coats."}, {"tag": "p", "text": "Like the rest of Alderaan, it was destroyed by the Death Star's superlaser. However, the Killiks built many mounds similar to these off world after their exile into the Unknown Regions, such as on their capital world Yoggoy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}