{"url": "Casus_Sandral", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Archaeologists", "Category:Dantooinians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Casus Sandral"}, {"tag": "p", "text": "Casus Sandral was a Human male living on Dantooine during the time of the Jedi Civil War. He was a member of the Sandral family, being the son of Nurik and the brother of Rahasia. He befriended Shen Matale after his sister fell in love with the Matale despite paternal friction between the two families. Casus was an archaeologist interested in the ancient ruins of Dantooine, but he was killed by kath hounds while on an expedition to one site. His father believed that his nemesis, Ahlan Matale, was responsible for Casus's death until Revan, a Jedi, was able to settle the dispute between the families peacefully."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Human, Casus Sandral was the son of Nurik Sandral and brother to Rahasia Sandral. At some point the children's mother died, leaving Nurik to raise his children by himself. Nurik moved his family to the planet Dantooine in search of peace and safety, arriving shortly after Ahlan Matale had done the same with his family. The two men fell into a series of disputes with each other and developed a hostile relationship which they attempted to enforce on their children. However, their efforts were not entirely successful as Casus' sister Rahasia met with Ahlan's son Shen when they were alone and fell in love. Casus later met with Shen and the two began to form a friendship."}, {"tag": "p", "text": "Casus was an amateur archaeologist and worked on digs while on Dantooine around the time of the Jedi Civil War. He was investigating strange ruins across the planet and, in 3956 BBY, he made an expedition to ruins of an origin he noted in his personal datapad as \"The Rak\". Before Casus reached the ruins, however, he was attacked by a pack of kath hounds—vicious predatory animals—and mauled to death. Unaware of Casus' fate, his father believed that his disappearance was the fault of the Matale family, and kidnapped Shen Matale in retaliation."}, {"tag": "p", "text": "The Jedi Padawan Revan soon came across the archaeologist's body while investigating the disappearance of Shen Matale. Revan collected Casus' diary from his remains and returned it to his grieving father, declining Nurik's financial reward. The Padawan then peacefully resolved the dispute between the two families, allowing Casus' sister and her lover to live their lives together with their fathers' blessings."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Casus had a loving relationship with his father but did not share the elder's hostility towards the Matale family, even becoming friends with Shen Matale shortly before his death. He also kept a diary in which he logged his private thoughts. His hair and eyes were grey in color, and his skin fair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Casus used a datapad for keeping his diary. When he set out on his fateful expedition, he carried an energy shield and light armor of Echani make as well as a Verpine headband and a cardio package implant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Casus was a background character in the 2003 video game Star Wars: Knights of the Old Republic. In his dead appearance Casus's skin color was light instead of dark like his family, as the graphical model used for his corpse was a generic one used throughout the game."}, {"tag": "p", "text": "In Knights of the Old Republic, it is possible for the player to miss or otherwise ignore Casus's corpse and thus the diary is not returned. The Sandral-Matale feud quest can still progress to completion, and the player can take a dark side path at the conclusion by lying to Nurik and blaming Ahlan Matale for Casus's death, resulting in both families killing each other."}, {"tag": "p", "text": "A reference to Casus can be found in the \"Secrets of the Enclave\" Flashpoint during the Dark Descent expansion of Star Wars: The Old Republic in the form of his Obituary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}