{"url": "Cat_and_Mouse", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Cat and Mouse"}, {"tag": "p", "text": "\"Cat and Mouse\" is the sixteenth episode of Season Two of the Star Wars: The Clone Wars television series. It aired on March 20, 2010 in the UK and on March 26 in the US. It serves as a prequel to all the other episodes, and is chronologically followed by Season One's sixteenth episode, \"The Hidden Enemy.\""}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Obi-Wan and Anakin must deliver supplies to Christophsis while the planet is under Separatist control. They encounter Separatist Commander Admiral Trench and get more than they bargained for."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "From the surface of Christophsis, Senator Bail Organa conferences via hologram with Anakin Skywalker and Admiral Wullf Yularen on-board the Star Destroyer Resolute. Separatist forces are on the verge of overrunning his position, and his supplies have all but run out. Skywalker and Yularen desperately try to salvage their own losing battle against the Separatist blockade around Christophsis, but the enemy flagship Invincible under the command of Separatist Admiral Trench bears down on the Republic supply fleet. As Skywalker prepares to charge the flagship, another Republic cruiser, the Negotiator commanded by Obi-Wan Kenobi, emerges from hyperspace behind them. At the insistence of Kenobi and Yularen, Skywalker reluctantly orders a retreat to behind Christophsis's moon."}, {"tag": "p", "text": "Crossing over to Kenobi's cruiser, Anakin discovers his Master's new weapon: a prototype stealth ship equipped with a powerful cloaking device. Skywalker is excited by the potential of this ship, but Kenobi insists his new mission is not to engage the Separatist fleet, but to sneak through the blockade and deliver supplies to Senator Organa. Meanwhile, Admiral Yularen, doing some research of his own, recognizes Trench's emblem on the Separatist ships and joins Anakin as the Jedi is about to depart. He tells him about how Trench has supposedly perished years ago in battle, and convinced that Trench is now in command of the blockade fleet, he joins Anakin as a volunteer advisor."}, {"tag": "p", "text": "Meanwhile, Trench, wanting to add pressure to the Republic fleet, dispatches a squad of bombers to attack Organa's command center. After narrowly avoiding an inadvertent collision with the bombers, and having receiving a message from Obi-Wan regarding Bail's peril, Anakin decides to attack Trench's ship directly, hoping to divert Trench's attention from the planet. The ploy is successful, but Anakin's attack is thwarted by the Invincible's thermal shields, and after seeing Anakin in action, Trench surmises that his opponent is a Jedi. He transmits a message over an open frequency, commending Skywalker's bravery in challenging him, but warning he has faced and beaten ships armed with cloaking devices before."}, {"tag": "p", "text": "Skywalker contacts Kenobi, who explains that Trench's war record confirms his threat. In these previous cases, Trench used tracking torpedoes to destroy the enemy whether or not their ship was cloaked, and Skywalker theorizes that Trench locks the torpedoes onto an enemy ship's magnetic signature. Sensing a way to use this against him, Skywalker attacks again. This time Trench is able to lock onto the stealth ship's magnetic signature and fires tracking torpedoes, but is forced to lower his shields to do so. With the torpedoes locked onto them, Skywalker flies straight at the Invincible. Realizing his mistake too late, Trench orders the shields be raised, but their recycling time takes too long for that. As Trench watches in horror, Skywalker flies the stealth ship inches past the Invincible's bridge, and seconds later the tracking torpedoes slam into the superstructure, destroying the Invincible."}, {"tag": "p", "text": "With Trench's flagship destroyed, Kenobi and Commander Cody launch a new attack on the leaderless Separatist fleet while Anakin and Yularen pilot the stealth ship down to Christophsis to deliver the vital supplies to Organa and his men. Senator Organa gives his gratitude to Skywalker, and Yularen expresses both concern and admiration for Skywalker's daring, if unorthodox, tactics."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The overall events of the episode, more specifically the usage and design of the stealth ship, were based on submarine warfare during World War II."}, {"tag": "p", "text": "Almost the entirety of the Sith Dreadnaught cruiser article from the fan site Wookieepedia was copied verbatim to a data screen visible in the episode. The text, transliterated into Aurebesh, and still containing a  reference number and an anachronistic use of BBY, appears on a data screen entitled \"Enemy Ship Profile,\" which is displayed on the bridge of Anakin's cruiser, when an officer reports that a supply ship had been hit. The screen seems to indicate that Trench's ship, the Invincible, belongs to the Sith Dreadnaught class."}, {"tag": "p", "text": "It is the sixteenth episode of Season Two. Like the sixteenth episode of the first season, it is also a prequel to the series and the Clone Wars movie. Chronologically, it takes place before all previous episodes of The Clone Wars (followed by \"The Hidden Enemy\"), hence Skywalker and Yularen getting to know one another for the first time."}, {"tag": "p", "text": "The end of Bail Organa's conversation with Obi-Wan is almost identical to the end of his daughter's recorded message for Obi-Wan two decades later."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}