{"url": "AL-BRT-34-X3", "categories": ["Category:Legends articles", "Category:BRT Supercomputers", "Category:Males"], "nodes": [{"tag": "h1", "text": "AL-BRT-34-X3"}, {"tag": "p", "text": "AL-BRT-34-X3 or Albert was a BRT supercomputer that was part of the Esseles University of Calamar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Albert was installed at the school and tasked with maintaining schedules, registering students, and overseeing the computer systems. He was supposed to have his higher artificial intelligence and algorithms shut down but they never were. This led him to becoming extremely bored."}, {"tag": "p", "text": "A part of the establishment for 200 years, Albert sent out invitations to a party for the occasion and was hurt when only three beings showed up. Depressed, he began to search for a meaning to his existence and accidentally intercepted a Rebel transmission, and intrigued by their cause, kept a close watch on the local Rebel cell. He did his own investigation into the evilness of the Galactic Empire by accessing secure Imperial computer networks and discovered that one of the group was an Imperial agent. When they were about to be betrayed to the Empire, Albert sided with the Rebellion and tipped off the local cell, ensuring their escape. He then became a member of the Rebel Alliance, supplying them with valuable information."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Albert had pert and saucy personality, despite being over 200 years old. Cracken hypothesized this might due to dealing with young beings for so long at the university. The supercomputer was dedicated to the cause, and used his considerable abilities to interface with every computer system on the planet to find valuable information. While being stationary and installed in the basement of university's computer center, he was able to access security cameras and other devices to observe his surroundings."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}