{"url": "Cave_of_Evil", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Caves", "Category:Dagobah locations", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Cave of Evil"}, {"tag": "p", "text": "The Cave of Evil, also known as the dark-side cave, was a large, dark side vergence located under a gnarltree on the swamp planet of Dagobah. Entering the cave subjected entrants to the vergence's control, projecting their worst fears as apparitions and illusions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The dark side cave of Dagobah was an overgrown landform deep within the endless swamps of the forgotten world. Little sun ever reached the surface of the planet, due to the thick canopy, therefore shrouding the cave in an endless twilight. Beneath the thick overgrowth of vines and brambles, ancient stone steps and walls could be seen at one entrance, while a second natural entrance opened in the void of a gnarltree known as The Magic Tree. The vergence that manifested in the Force within the cave was intense and fueled by the dark side aspects of the universal energy field. Because of this, the area surrounding the cave was permeated with a sense of dread, while Force-sensitives often perceived the area as being cold, filled with malice and menace. Despite the negative energy felt by sentients, Dagobah's diverse flora and fauna were attracted to the area and flourished."}, {"tag": "p", "text": "The nature of the vergence's assertion on individuals was highly-personal and acted on their worst fears. Apparitions and illusions would materialize in the cave, interacting with the minds of entrants and exploiting their natural weaknesses and worries. The reactions to these apparitions would determine how the illusion played out. The nature of the cave was not simply dark, but a true and sinister evil. The manipulation of the mind was meant to produce the worst outcome for the victim, drawing out the worst reaction and luring them towards the dark side."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, and while on a quest to learn the path to eternal consciousness, Yoda entered the cave under the guidance of the deceased Jedi Master Qui-Gon Jinn. Inside, Yoda saw a dream-like vision of the destruction of the Jedi Order and the Sith Lord Darth Sidious, a vision that overwhelmed him."}, {"tag": "p", "text": "Over two decades later, during the Galactic Civil War and during his training with Master Yoda, the fledgling Jedi Luke Skywalker had to enter the cave as a test. In the hollow, Skywalker had a vision in which he faced Darth Vader, the Dark Lord of the Sith. As Skywalker seemed to strike down Vader with a high lightsaber blow, the illusory Sith Lord's helmeted head rolled on the floor, and the face shield cracked open to reveal the young Jedi's own countenance behind the mask."}, {"tag": "p", "text": "Many years after Skywalker was trained by Yoda on Dagobah, his nephew, now Kylo Ren, would travel here alongside his master Snoke and go to the Cave of Evil. There he faced visions of Luke and his parents, Leia Organa and Han Solo. Though able to kill the vision of Luke, Ren was not able to kill the visions of his parents and fooled Snoke by destroying the Cave of Evil."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Cave of Evil first appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back, the second installment of the Star Wars original trilogy. In the film, the cave has a corresponding musical theme called \"The Training of a Jedi Knight - The Magic Tree,\" which was composed by John Williams. The cave was first identified as the Cave of Evil in The Story of Starkiller, a documentary for the Legends video game Star Wars: The Force Unleashed II. The name was later canonized by the 2015 reference book Ultimate Star Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}