{"url": "AL1-L3", "categories": ["Category:Canon articles", "Category:Feminine programming", "Category:Manumitted droids", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "AL1-L3"}, {"tag": "p", "text": "AL1-L3, nicknamed \"Allie,\" was a protocol droid that served in the administrative center of the Pyke Syndicate's spice mines on the planet Kessel. After witnessing a droid revolution sparked by the droid L3-37 in 10 BBY, AL1 saw a glimpse of independence that survived in the back of her processors when she was later scrapped and recycled."}, {"tag": "p", "text": "AL1-L3 slowly rebuilt herself and began to work as a cargo hauler for droid clientele. In 35 ABY, she heeded the call of L3-37's old allies Lando Calrissian and Chewbacca to aid the Resistance in defeating Darth Sidious and the Sith Eternal on the planet Exegol. After the Resistance and its allies emerged victorious, AL1-L3 returned to the Resistance base on the moon Ajan Kloss to celebrate."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "AL1-L3 started out as a protocol droid with feminine programming who was forced to work in the administrative center of the criminal Pyke Syndicate's spice mines on the planet Kessel. In 10 BBY, she witnessed a slave and droid uprising within the mine led by the self-made droid, L3-37. Shortly afterwards, she was scrapped for disobedience and recycled, but slowly rebuilt herself over the decades and gained more independence. Going by AL1-L3 or \"Allie,\" she began operating as a cargo hauler for exclusively droid clientele."}, {"tag": "p", "text": "In 35 ABY, AL1-L3 was one of many unaffiliated pilots who heeded the Resistance agents Lando Calrissian and Chewbacca's call for aid in helping to defeat the forces of the Sith Eternal above the planet Exegol. Calrissian and Chewbacca, who both fought alongside L3-37 in her revolution, guided the huge fleet of volunteers through the hyperspace anomalies of the Unknown Regions to Exegol, where they immediately engaged the Sith Eternal's fleet of Xyston-class Star Destroyers."}, {"tag": "p", "text": "Shortly after AL1-L3 and her allies arrived, the Sith Lord Darth Sidious disabled the starships of the Resistance and their allies with a massive burst of Force lightning; however, once he diverted his attention to fighting the Jedi Rey the ships became operational again and the battle recommenced. Ultimately the Resistance and its allies triumphed and destroyed the fleet. AL1-L3 was then amongst those who returned to the Resistance base on the jungle moon Ajan Kloss in order to celebrate. During the celebration, she walked alone past the droids BB-8 and D-O reuniting before standing with the bounty hunter Seleno Chandro and pilot Kid Malmash and gesturing animatedly while the pirate Maz Kanata met with Chewbacca."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "AL1-L3 built herself into a bipedal droid with white plating, yellow photoreceptors, and a large amount of exposed internal black components. Seeing L3-37's rebellion offered her a powerful glimpse of an independent future, and it was this spark of independence that survived in the back of her processors as she was recycled."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "AL1-L3 carried two paired, white Glie-44 blaster pistols and wore a striped brown cape supplied to her by the Droid Gotra as a serape. She used tan and white ablative heat-shielding as a processor helmet with two small antenna."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "AL1-L3 first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo. Concept art of AL1-L3 titled \"Dragon 21\" was drawn for the film by creature concept designer Jake Lunt Davies and based on an old design for L3-37 from the 2018 film, Solo: A Star Wars Story, which itself had been based on a design for a droid meant to appear in Canto Casino in the 2017 film, Star Wars: Episode VIII The Last Jedi. Lunt Davies was pleased with the final design's femininity and use of a poncho and holsters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}