{"url": "Cecil_Noone", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Cecil Noone"}, {"tag": "p", "text": "Cecil Noone was a male Human thief and the son of two members of Freedom's Sons."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At the age of 13 he stole a decommissioned vessel and fled to Byblos, intending to sell the ship there. Instead, he was robbed by pirates. Stranded with nothing, Noone was led into a life of crime himself—as a confidence man and thief."}, {"tag": "p", "text": "Noone later led a band of criminals during the Galactic Civil War aboard his personal starship, the Borogove. His group included Kels Turkhorn, a Sluissi cyborg slicer named Hass Sonax, and a Tynnan demolition expert named Dawson. Together they double crossed their Hutt employer, by stealing a Hapan Gun of Command (actually a prototype rifle version of one) hoping they could sell it for a large number of credits. Vop the Userer had intended to buy the weapon, but was killed during the ensuing firefight aboard the Song of the Clouds. The Borogove was lost during the venture, which forced Noone and his group to make their get away in a luxury yacht named the Asaari Wind, which they stole from the Bimm crimelord Ritinki (who had also tried to acquire the Hapan gun). Noone killed him, prompting each of Ritinki's heirs to subsequently put out contracts on Noone's life. These were in addition to the contract later put out on Noone by his former Hutt employer."}, {"tag": "p", "text": "Much to the chagrin of Noone and his partners there were few offers for the gun—the best offer coming from an Alliance agent, but for only one-tenth their asking price of 1.5 million credits. After nearly being killed on Kothlis following a meeting with Imperial Governor Gilad Halsek, Noone offered the weapon to renowned hunter Tyro Viveca on Kabal. Viveca, however, had no intention of paying Noone's asking price. Instead he made a counter offer—in exchange for the weapon, Noone would be allowed to make his escape through Viveca's hunting grounds—with Viveca hunting him with the very weapon Noone had tried to sell to him. Noone injured himself and was ensnared in more than one of Viveca's traps during the chase. Unexpectedly, though, Noone was rescued from a gravity trap by his comrades once they realized the deal had most likely gone awry. They left a bomb in Noone's place, which vaporized Tyro Viveca when he happened upon it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}