{"url": "Celanon/Legends", "categories": ["Category:Legends articles", "Category:Agriworlds", "Category:Celanon locations", "Category:Confederacy of Independent Systems planets", "Category:D'Astan sector planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Outer Rim Territories planets on the Hydian Way", "Category:Type I atmosphere planets", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Celanon"}, {"tag": "p", "text": "Celanon was an important spaceport on the Celanon Spur, in the Outer Rim Territories, and was the Nalroni homeworld."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Celanon had six continents: Cekbar, Arradi, Holvi, Jelldar, Runnor and Desetur. The planet was an important trade world, comparable to Byblos and Yaga Minor. The capital city was named Celanon City. Celanon was also known for its agriculture."}, {"tag": "p", "text": "The world was known for its multicolored sky due to its advertising screens, which were compared with those of Nar Shaddaa, Ixtlar, and the average Corporate Sector world. The Celanon Merchant Guild Medical Facility was the main hospital of the starport located in the capital city. The local police force was known as the Celanon Organized Protectorate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Mandalorian Wars, Celanon was controlled by the Mandalorians. It was later part of Revan's Sith Empire. Celanon was in Sith space during the New Sith Wars. The planet was the site of the Celanon campaign during the Galactic War between the Sith Empire and the Galactic Republic."}, {"tag": "p", "text": "As the Republic's influence in the Outer Rim Territories declined in the millennium after the Ruusan Reformations, Celanon became an important regional power broker: at the crossroads of the Celanon Spur and the Hydian Way, it became a prosperous, populous port and attracted investment."}, {"tag": "p", "text": "The planet was an important Separatist stronghold during the Clone Wars. As a result, it became a target for the Galactic Republic during the Serenno theater of the Outer Rim Sieges. After the war, Celanon, along with Serenno, begun funding Separatist holdouts close by."}, {"tag": "p", "text": "During Operation Strike Fear, the Imperial BFF-1 bulk freighter Gafra transferred a new nuclear warhead from Celanon to a deep space transfer zone where it was intercepted by the Rebel Lambda-class T-4a shuttle Herald."}, {"tag": "p", "text": "After the Battle of Endor, Celanon was under control of Warlord Zsinj. The Empire managed to keep control of the world in the years following the death of Zsinj but Admiral Pellaeon eventually lost the planet and his flagship, the Reaper, at the Battle of Celanon."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the planet fell into the hands of the invaders. Yuuzhan Vong and Peace Brigade collaborators traveled through the system to attack the Jedi Praxeum at Yavin 4 in 27 ABY. Remaining part of the Yuuzhan Vong empire until the Yuuzhan Vong's surrender to the Galactic Alliance in 29 ABY, Celanon was located in Alliance space as of 40 ABY. The world was situated in the territory of Darth Krayt's Galactic Empire in 137 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}