{"url": "Celestial_Chalice", "categories": ["Category:Canon articles", "Category:Pijal locations", "Category:Temples"], "nodes": [{"tag": "h1", "text": "Celestial Chalice"}, {"tag": "p", "text": "The Celestial Chalice was a round temple located on the grounds of the royal palace on Inner Rim planet Pijal. It was an amphitheater dedicated to the ancient gods of Pijal, and was only entered for ceremonial rituals a few times during a monarch's reign. In 40 BBY, the coronation of the Pijali Princess Fanry took place within the Celestial Chalice, as did her violent seizure of absolute power upon being crowned."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Celestial Chalice was a domed, round temple situated in the Pijali palace on the Inner Rim planet Pijal. The sole entrance to the Chalice's amphitheater was through the palace's royal reception hall and through white stone doors. The Chalice's decorations included intricate gilding on the edges of the ceiling, and a blue tiled floor. During ceremonies, the Chalice's octagonal altar was used as the monarch's dais to address Pijal's citizens. During the Republic Era, Pijali honor guard troops were trained with evacuating a monarch from the amphitheater through its retractable glass ceiling."}, {"tag": "p", "text": "The Chalice served as the traditional ceremonial location for the coronation of Pijal's monarchs. It was dedicated to Pijal's ancient gods, and was only entered for sacramental rituals a few times during a monarch's reign."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 40 BBY, the Celestial Chalice was used as the location for Princess Fanry's coronation as queen. Due to security threats, the captain of her guard tightened security around the Chalice, including the establishment of the ruler's dais in the Chalice as a weapons-free area, excepting members of Pijal's royal guard."}, {"tag": "p", "text": "While on Pijal, Jedi Master Qui-Gon Jinn experienced a series of visions in which he saw Princess Fanry's coronation end in violence. However, the members of the court he mentioned this to, including Minister Orth, were skeptical of it's plausibility. On the day of the coronation, his visions became a reality when Fanry violently seized power as an absolute monarch of Pijal within the Celestial Chalice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Celestial Chalice first appeared in Master & Apprentice, a 2019 novel written by Claudia Gray. At separate points, the novel indicates the tiles decorating the Celestial Chalice are bright-blue, then dark-blue. This article reflects that they are blue, and leaves out the shade inconsistency."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}