{"url": "Century_tank", "categories": ["Category:Legends articles", "Category:Crawlers", "Category:Galactic Empire vehicles", "Category:Tanks", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "Century tank"}, {"tag": "p", "text": "The century tank, also known as the TIE crawler or TIE tank, was an Imperial light armored vehicle. It was an unlikely fusion of two vastly different vehicle types."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The century tank resembled a TIE starfighter cockpit suspended between two massive tank treads. It could hold only a single person, who acted as pilot and gunner."}, {"tag": "p", "text": "Driving the tank treads at speeds of up to 90 kilometers per hour were twin Santhe SSct power generators. The pilot used foot controls to adjust the angle of steering and speed, while the hand controls were tied into the fire control systems."}, {"tag": "p", "text": "The tank had a pair of medium blaster cannons in the familiar \"chin\" mounts found on most TIE cockpits. Suspended below the cockpit ball was a retractable light turbolaser which provided the tank with considerable firepower."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The plans for the century tank were made as early as 0 BBY, with the Imperial Army boasting that its capabilities were superior to that of the TIE/LN Starfighter. One unit notable for their use of century tanks was the 71st Elite Mechanized Assault Group."}, {"tag": "p", "text": "Although the century tank became famous after Battle of Endor, an early version of the vehicle—the TIE ap-1, or TIE Mauler—saw some action during the first years of the Galactic Civil War, where it fought against the Alliance to Restore the Republic."}, {"tag": "p", "text": "The century tank was the first new design to roll out of the newly liberated Santhe/Sienar Technologies in the uncertain times after the Battle of Endor. The independent-minded Santhe family, owners of Sienar Fleet Systems, had long bristled under the restrictive contracts of the Empire, and saw the opportunity of independence following the Empire's defeat."}, {"tag": "p", "text": "Santhe tried to remain neutral in the drawn out fighting between the shrinking Imperial Remnant and the growing New Republic. They still produced TIE fighters for Imperial warlords, but did so on their terms."}, {"tag": "p", "text": "In an attempt to break into new markets, the century tank was conceived as a relatively inexpensive to produce and purchase compact assault vehicle (CAV). Its use of recycled components and designs helped cut costs and training time."}, {"tag": "p", "text": "The tank was cheap and mass-produced and saw some action in the Imperial Civil War on Coruscant, as squabbling warlords sought to take control of the former Imperial capital prior to the reborn Emperor Palpatine's reappearance."}, {"tag": "p", "text": "At least one century tank was in service with the Corellian Security Force during the Second Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dark Empire Sourcebook capitalizes the first letter, spelling it \"Century tank,\" whereas the Databank uses all lower-case letters to spell the name."}, {"tag": "p", "text": "In 2007, LEGO released a set based on the tank. Called a \"TIE Crawler,\" the set comes with two shadow stormtrooper figures. LEGO's TIE crawler also was equipped with two dual laser cannons that extended from the outside of the port and starboard tread hulls, giving this variant increased firepower over the standard tank. The century tank was the second only fully-Expanded Universe LEGO set to be released, the first being the TIE/D automated starfighter, although the TIE/D was included in a set with two other in-universe TIE fighters and Darth Vader's TIE/Advanced starfighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}