{"url": "Cerean/Legends", "categories": ["Category:Legends articles", "Category:Cereans", "Category:Mammalian sentient species", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Cerean"}, {"tag": "p", "text": "Cereans were a sophisticated and cultured humanoid mammalian species hailing from the planet Cerea in the Mid Rim. They were famed for their extraordinary thinking abilities, made possible by large binary brains housed in tall tapering heads, enabling them to focus on many things at the same time. Aside from this unique feature, Cereans were physically similar to Humans, although they each possessed two hearts, which supplied extra blood circulation to support their brains."}, {"tag": "p", "text": "Cereans were often found among the ranks of the Jedi Knights, but due to the species' low birth rates, Cerean Jedi were exempt from the Order's vow of non-attachment. One such Jedi, Ki-Adi-Mundi, served on the Jedi High Council during and prior to the outbreak of the Clone Wars."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Cereans' enlarged skulls, extending up to twenty centimeters above their foreheads, housed complex binary brains, provided with sufficient blood by an extra heart in their heads. The binary structure of Cerean thinking helped them to ponder two sides of an issue at once. It also enabled them to process information and solve problems rapidly and provided a highly advanced capacity for concentration and meditation. Because of their thoughtful nature, they tended to be calm, rational and analytical, preferring peaceful philosophies and a lifestyle which worked in harmony with nature. Though the quick-thinking Cereans had equally quick reflexes, they were commonly not as well coordinated as Humans. Because of the weight of their enlarged skulls, Cereans often had back problems and were less physically coordinated than the average Human."}, {"tag": "p", "text": "Cereans were a sexually dimorphic species, with male Cereans aging more rapidly than their female counterparts. Additionally, males were outnumbered by females due to a skewed birth rate ratio of twenty females to every one male. Force-sensitivity among Cereans was similar to that of baseline Humans, with Cereans training as both Jedi and Sith. Their binary brains, it was suggested, allowed some Cerean Forcefuls to explore both the light and dark aspects of the Force."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Cereans developed a low–tech society on their homeworld and preferred to live in isolation from the wider galaxy. Preserving the natural beauty of Cerea, the planet was home to many Outsider Citadels where it was permissible to use offworld technology, though it could not be removed from the Citadel. Beyond the Citadels, offworld technology was strictly prohibited, especially that which could harm the planet's ecosystem. Meditation was a core part of a Cerean's daily rituals, with many employing specially-forged kasha crystals as a focusing tool. By focusing one's thoughts while in contact with such crystals, distractions were eliminated, creating an exceptional meditation environment. Cerean Jedi sometimes incorporated these crystals into their lightsabers, providing great focus, even during intense physical combat."}, {"tag": "p", "text": "Because of the dimorphism in the species, the government of Cerea was matriarchal. The governing Council of Elders was led by a president who made decisions based on the advise of the Council. Decisions made by the Council were considered to be infallible and appeals were unheard of. During the years leading up to the Invasion of Naboo, a generational dispute erupted on Cerea when the younger generation took up a rebellious stance against their low–tech society. Many Cerean youths wished to own such technology as was commonplace in the Galactic Republic, like starships and speeder bikes. This unrest was ultimately quelled by Jedi Knight Ki-Adi-Mundi, who traced the instigator of the movement, Ephant Mon, to Tatooine."}, {"tag": "p", "text": "The traditional nature of the Cerean community was reflected in their names, which were broken into three hyphenated parts. The names were derivatives of an individual's parents and grandparents. The clothing worn by most Cereans was based on a traditional style that carried on over the centuries. Martial arts was a focused and stylized part of many Cereans' lives, with the use of the ancient shyarn as a means of moving through aggression. Polygamous marriage was a necessity in order for the species to survive, due to the dimophism in the sexes. Each male usually had one primary \"bond-wife,\" and between four and ten \"honor-wives.\" Culturally, Cereans embraced the Force and their knack for analysis allowed them insight that resembled precognition."}, {"tag": "h2", "text": "Cereans in the galaxy"}, {"tag": "p", "text": "Ki-Adi-Mundi served as Jedi Watchman for his home system, though he relinquished this post during the Clone Wars to fellow Cerean Tarr Seirr. When Seirr was also called away, the Cereans were left undefended and their planet was attacked by the Confederacy of Independent Systems. The death toll of the Battle of Cerea reached over one million, and included the family of Ki-Adi-Mundi. This led to the Cereans becoming even more removed from galactic affairs with the rise of the Galactic Empire."}, {"tag": "p", "text": "By the time of the Yuuzhan Vong War, the Cereans had developed a unique Force tradition, known as the Ner Yan. This group used the Force to link their minds, although in a haphazard manner. Ka-Tu-Un was an adept of this tradition and was mistaken for a Jedi by the Yuuzhan Vong."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}