{"url": "Ceret", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Jedi Knights of the Jedi Order", "Category:Kotabi", "Category:Non-binary individuals", "Category:Trans individuals"], "nodes": [{"tag": "h1", "text": "Ceret"}, {"tag": "p", "text": "Ceret was a trans non-binary Kotabi Jedi Knight, and the bond-twin of Terec. Both twins were stationed at the Starlight Beacon space station during the High Republic Era. Their bond meant Terec and Ceret shared the same gestalt mind, and frequently finished each others' sentences even when not in the same room."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ceret was a Kotabi trans non-binary being and the bond-twin of Terec. The twins were part of the Jedi Order during the High Republic Era."}, {"tag": "h3", "text": "Attack in the Kazlin system"}, {"tag": "p", "text": "Ceret and Terec joined Jedi Master Sskeer and Jedi Knight Keeve Trennis, who had been knighted just before the mission, in traveling to the Kazlin system after Starlight received a scrambled distress signal from the system. They docked their T-1 shuttle with the wreckage of a ship and entered, donning rebreathers upon encountering gas, which implied a Nihil attack. Ceret and Trennis soon split off from the group as Sskeer and Terec went another direction. Ceret began to sense anger and pain in Sskeer, telling Trennis that something was wrong. Soon after, the two discovered the corpse of a dead Hutt. Ceret observed blaster burns, stab wounds, and evidence of nagnol poisoning. After suggesting that the Hutt ship may have been carrying crops to sell the harvest to the highest bidder following The Great Disaster, Ceret found a damaged navidroid whose databanks stated that it was travelling from the Sedri system at the time of the attack."}, {"tag": "h3", "text": "Mission to Sedri Minor"}, {"tag": "p", "text": "Upon confirming that an outpost was stationed on Sedri Minor, Marshal Kriss dispatched Master Sskeer and Jedi Ceret to the planet in the hopes that they could trace the shipment of Vratixia renanicus back to its origin. After landing, a mysterious Rodian caught Ceret's attention and drew them deeper into the crop fields, after which they were attacked by a drengir vine and abducted into its underground lair. When Master Sskeer attempted to find the missing Jedi, he only discovered Ceret's lightsaber lying lone in the ground."}, {"tag": "p", "text": "After arriving on the planet alongside Marshal Kriss, Master Sskeer and a wounded but strangely plagued Jedi Terec, Jedi Keeve Trennis found Ceret in the Drengir's lair after searching through a sinkhole with the stray Bartol. Ceret was incapacitated and strung up by thick vines, stretching into their ears, nose and mouth. After Trennis freed Ceret they warned her of the Drengir that lay in the caves. The Drengir took control of Ceret's mind, subsequently causing their Bond-twin Terec to become affected by the power of the Drengir. Ceret held back the stray Bartol as the Drengir attempted to infest Trennis' mind, however she was saved by Marshal Kriss."}, {"tag": "p", "text": "Avar then managed to compel Ceret to release Bartol, also freeing the Jedi from the control of the Drengir. Though Ceret had been freed from the grasp of the Drengir, Sskeer arrived, fully possessed by the vinery of the plant monsters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ceret first appeared along with Terec in The High Republic 2. A post on the Star Wars Instagram for International Transgender Day of Visibility in 2021 expanded upon Ceret's in-universe pronouns to confirm that Ceret and Terec are both trans non-binary. The post included Javier Garrón's The High Republic 6 variant cover, part of the line of Pride Month variant covers for Marvel comic books released in June 2021, which feature gay and transgender artists paired with LGBTQ+ characters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}