{"url": "Ch%27hodos", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Desert planets", "Category:Sith Empire planets", "Category:Sith Worlds"], "nodes": [{"tag": "h1", "text": "Ch'hodos"}, {"tag": "p", "text": "Ch'hodos was a rocky desert planet that orbited a red sun within the Outer Rim Territories' Sith Worlds region. Ch'hodos was considered a lesser world of the Sith Empire and served as the central base of the Sith Lord Shar Dakhan by the year 5000 BBY."}, {"tag": "p", "text": "During the Dark Lord of the Sith Naga Sadow's preparations to attack the Galactic Republic, Ch'hodos became a rally ground for his Sith soldiers, with Sadow himself and his apprentice, Gav Daragon, overlooking the embarking of the troops. More than a millennium later, the radiation from Ch'hodos's sun had increased, leading to mutations in the local desert wildlife."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ch'hodos was a red, rocky planet with deserts on its surface. It orbited a red sun in the Ch'hodos system, within the Trans-Hydian section of the Outer Rim Territories. The area of space containing the planet, known as the Sith Worlds, was surrounded by the Stygian Caldera nebulosity."}, {"tag": "p", "text": "Ch'hodos lay along the Nache Bhelfia—a looping hyperlane that connected the five sacred Sith worlds of Ziost, Khar Delba, Rhelg, Krayiss Two, and Korriban—while the Zorfe Trete hyperspace route linked Ch'hodos to the world of Ashas Ree. Ch'hodos's deserts harbored native lifeforms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "An ambitious planet, Ch'hodos held the status of one of the lesser worlds of the Sith Empire and was under the control of Ziost, the Empire's capital world. By 5000 BBY, Ch'hodos served as the Sith Lord Shar Dakhan's central base. During the Dark Lord of the Sith Naga Sadow's preparations to attack the Galactic Republic that year, Ch'hodos was used as a place to rally his Sith soldiers of the Massassi caste."}, {"tag": "p", "text": "Overseen by Dakhan, Sadow's amassed armies embarked aboard Sith personnel carriers that were waiting in front of a large stone building, while several starfighters and a shuttle flew overhead. Sadow himself and Gav Daragon, his Human apprentice, also observed the gathering troops while discussing the upcoming attack."}, {"tag": "p", "text": "Circa 3638 BBY, the radiation from Ch'hodos's sun had increased, causing mutations in the local desert wildlife."}, {"tag": "p", "text": "An individual visited Ch'hodos at that time to observe the changes in the planet's lifeforms. Inside a cave, the visitor discovered skeletons of mutated creatures, which suggested that the planet's sun had cyclically gone through similar changes in radiation output in the past. The individual visiting Ch'hodos then obtained many comparative samples and brought them back to a partner."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "A large building had been made out of yellow stone in a rocky region of Ch'hodos. There was also a cave on the planet with skeletal remains of creatures inside it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ch'hodos made its first appearance in the second issue of The Fall of the Sith Empire story arc of the Star Wars: Tales of the Jedi series of comic books. The issue was published on July 23, 1997, and was written by Kevin J. Anderson and penciled by Dario Carrasco, Jr. The Essential Atlas, a 2009 reference work co-authored by Daniel Wallace and Jason Fry, placed the planet in grid square R-4."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}