{"url": "Cha_Niathal", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Galactic Alliance Chiefs of State", "Category:Galactic Alliance Defense Fleet admirals", "Category:Galactic Alliance Supreme Commanders", "Category:Mon Calamari", "Category:New Republic Defense Force officers"], "nodes": [{"tag": "h1", "text": "Cha Niathal"}, {"tag": "p", "text": "Cha Niathal was a female Mon Calamari and senior Admiral of the Galactic Alliance Defense Force, serving as an advisor to Supreme Commander Gilad Pellaeon. After Pellaeon's resignation, Niathal assumed the post of Supreme Commander, and soon formed a political alliance with Colonel Jacen Solo. Throughout the Second Galactic Civil War, Niathal's influence grew, as did the unrest within the Galactic Alliance, to the point that she was instrumental in a coup against Chief of State Cal Omas."}, {"tag": "p", "text": "After ousting Omas, Niathal declared herself joint-Chief of State, alongside Solo, however, relations soon cooled between the two, as Solo's fall to the dark side of the Force, coincided with his use of unethical tactics. Niathal formed a secret alliance with Luke Skywalker and the Jedi High Council, who had defected from the Alliance due to Solo's actions, so as to undermine her colleague. Following the Second Battle of Fondor, Niathal openly opposed Solo, resulting in a division within the Alliance; Niathal became head of the Alliance-in-exile, while Jacen maintained power over the Galactic Alliance proper."}, {"tag": "p", "text": "Admiral Niathal and her faction of the Alliance joined the Jedi Coalition and participated in the Second Battle of Roche alongside the fleet of Admiral Natasi Daala—however, they were defeated by the forces of Nek Bwua'tu. Following Solo's death and the end of the war, Niathal chose not to continue as Chief of State and instead opted for retirement. However, Niathal's replacement, Natasi Daala, was later reluctantly forced to bring the Mon Calamari to trial for her actions during the war. Niathal, rather than be acquitted for admitting blame for the damage caused by Jacen Solo or destroyed for sticking to her guts, chose to commit suicide instead. She was granted a funeral with full military rights by Chief Daala, who was affected heavily by Niathal's death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born sometime before 4 ABY on the Mol Cal homeworld of Mon Calamari, Niathal was an old enough child during the later years of the Galactic Empire that she would later be able to recall memories of seeing images of Emperor Palpatine around Mon Calamari and seeing Darth Vader in parades on the HoloNet. However, Niathal had few other memories of life under the Empire."}, {"tag": "p", "text": "At a later point in her life, Niathal enlisted in the New Republic Defense Force and actively fought against the Yuuzhan Vong during their invasion of the galaxy. Niathal continued to serve in the Galactic Alliance Defense Force, after the New Republic was reorganized into the Galactic Alliance, successfully ascending through the ranks; becoming a Fleet Admiral serving as the top advisor to Supreme Commander Gilad Pellaeon."}, {"tag": "h3", "text": "Second Galactic Civil War (40 ABY–41 ABY)"}, {"tag": "h4", "text": "Military happenings"}, {"tag": "p", "text": "In 40 ABY, as tensions began to increase between the Galactic Alliance and Corellia, due to the latter's demand to gain a certain amount of autonomy from the Alliance, Niathal was present at all of the meetings concerning Operation Roundabout, in the capacity of an advisor to Admiral Pellaeon. Admiral Niathal was one of the architects behind the peace talks, to be headed by Pellaeon, that sought to appease Five World Prime Minister Aidel Saxan and allow both the Alliance and Corellia to save face before a war broke out. However, Saxan was assassinated during the talks and with the outbreak of the battle of Tralus the two opposing sides found themselves officially at war. Niathal was also part of the group that decided to remove Matric Klauskin from his position as leader of the Second Fleet."}, {"tag": "p", "text": "When Pellaeon resigned as Supreme Commander, Admiral Niathal ascended to the position, and nursed further ambitions to replace Cal Omas as Galactic Alliance Chief of State. Upon becoming Supreme Commander, Niathal found herself in a fledgling alliance with the head of the newly formed Galactic Alliance Guard, and Jedi Knight, Jacen Solo. After the Battle of Hapes, she and Cal Omas requested that the Jedi High Council promote Solo to the rank of Jedi Master for his actions during the battle. However, Grand Master Luke Skywalker sensed that though Omas supported such an action, it was Niathal who was the true push behind the request. Despite this, the Council refused to promote the Admiral's ally."}, {"tag": "p", "text": "As the conflict progressed, other star systems sympathized with Corellia and began to secede from the Galactic Alliance, much as occurred decades earlier during the Separatist Crisis and Clone Wars of the Old Republic. As Corellia's list of allies grew, the Five Worlds and their sympathizers came to be known as the Confederation."}, {"tag": "h4", "text": "Gilatter VIII"}, {"tag": "p", "text": "Following the rout of the Galactic Alliance's blockade of Corellia by Bothan and Commenorian forces, and the subsequent decisions made by Adumar, Bespin, and Fondor to join the movement, The Confederation spread false intelligence suggesting that the Supreme Commander of the Confederation military would be chosen at a secret meeting in the Gilatter system."}, {"tag": "p", "text": "Taking the bait, Jacen Solo laid out a four step plan to ambush the supposed meeting. First, Jedi in StealthXs would move undetected into the system and relay information to the Alliance fleet. The fleet, led by Niathal herself, cobbled together from different task forces arrayed throughout the Mid Rim, would assemble. Instead of moving a whole fleet group from its current assignment, which would alert Confederation intelligence, this allowed the Alliance the element of surprise. It is presumably for this reason that Admiral Niathal led the battle from the helm of the Galactic Voyager, Admiral Gial Ackbar's famed command ship. Elements of the Ninth Fleet were also included in the taskforce. During the third step, the fleet would move into the upper reaches of the atmosphere of Gilatter VIII and remain hidden from enemy sensors until the StealthXs gave the signal. Solo himself decided to infiltrate the resort satellite in disguise, to maximize the damage to the Confederation command hierarchy"}, {"tag": "p", "text": "Disguised as Najack and Silfinia Ell, Jacen and secretly Lumiya, the Colonel's secret Sith Master, infiltrated the election ceremony, posing as members of the Ession Freedom Front. Meanwhile the Confederation force, assumed to be preparing for a military strike against the Alliance, continued to gather in the system. When Solo reached the election room, he was surprised to see no one of note present. It was only a few minutes before Turr Phennir appeared on a hologram screen and revealed that the information Jacen had acted on was false; Phennir himself had been elected as Supreme Commander the previous day when the real election had been held. Phennir proceeded to gloat over the fact that Niathal's command had been led into a minefield. Unfortunately for Phennir, Jacen was able to visualize the mines and warn Luke Skywalker, who was part of the StealthX force. Skywalker in turn warned Admiral Niathal."}, {"tag": "p", "text": "However, instead of issuing the order to pull about and retreat, Niathal ordered the fleet to continue forward into the grid, aware that abrupt changes in course would only attract more mines. The Anakin Solo and the other outlying ships microjumped into the battle. She ordered the second-tier capital ships and the starfighters to form up behind the leading capital ships and enter the minefield. The result was that the carefully planned Confederation assault was thrown off and the conflict degenerated into a slugging match. However, Jacen Solo, now en route to the Anakin as his family engaged Lumiya and Alema Rar on the resort satellite behind him, noticed angrily that the Alliance fleet was not coordinated, missing out on several opportunities. Forces were milling about aimlessly instead of pursuing targets, at least one frigate retreated unnecessarily, and a Bothan Assault Cruiser, although severely damaged, was not destroyed by its attackers as they missed their chance."}, {"tag": "p", "text": "The Confederation proclaimed the battle a stunning victory against the Alliance, while the Alliance itself asserted that even with subterfuge and odds on their side, they had failed to comprehensively defeat Niathal and Solo."}, {"tag": "h4", "text": "Leadership coup"}, {"tag": "p", "text": "As the war continued, Omas could do little to retaliate, but when his opposite number in the Corellian government, Dur Gejjen, contacted him for peace talks, Omas saw an opportunity. Meeting with Gejjen on Vulpter, he requested that Jacen Solo, head of the Galactic Alliance Guard, and Cha Niathal, Supreme Commander of the Galactic Alliance Defense Force, be neutralized, and in return, Corellia would be accepted back into the Alliance and hostilities would cease. Gejjen agreed, but as he walked away from the meeting he was felled by a head shot from the GAG sniper—Ben Skywalker. Although Omas was able to return to Coruscant safely, he now found himself utterly friendless."}, {"tag": "p", "text": "Upon learning of Omas' secret talks with the late Gejjen, Solo decided that the longtime Chief of State was no longer fit to serve. He began studying galactic law, and began lobbying for more power, which the Senate gave him. Eventually, he had the required power to oust political leaders, theoretically including the Galactic Alliance Chief of State."}, {"tag": "p", "text": "Jacen Solo used a legal loophole to stride into the Chief of State's office with a GAG escort of Sergeant Wirut and Trooper Limm. Solo arrested Omas, who responded with icy indifference in front of the soldiers. When they had left, however, he verbally accosted Solo, labeling him a \"power-crazed…little jerk\". The stated reasons were that he had entered into secret negotiations with Dur Gejjen; however, the Justice Department did not charge him until an extended period following his arrest."}, {"tag": "p", "text": "Cha Niathal, now the acting Chief of State, declared both herself and Solo to be joint Chiefs of State. They both declared that their junta was legal and temporary, and promised that there would be rapid elections following the end of the conflict. They also sealed off the Chief of State's office, proclaiming that only duly-elected representatives could sit in it. Although the move originally shocked many senators and citizens, Niathal's speech to the Senate and Jacen Solo's meeting with protesters largely quelled any major disputes, and the populace as a whole seemed to accept the change with little fuss."}, {"tag": "p", "text": "While Niathal genuinely believed that the coup was legal and temporary, Solo had others plans. The young Jedi had recently been seduced to the dark side of the Force by the Sith Lady Lumiya and intended to take permanent control of the Galactic Alliance to ensure that his personal vision of galactic order was implemented. Soon after the coup, he murdered Mara Jade Skywalker, his aunt and the wife of Luke Skywalker, and became the Sith Lord Darth Caedus."}, {"tag": "h4", "text": "Galactic Alliance Chief of State"}, {"tag": "p", "text": "Niathal would be one of the many dignitaries who attended the funeral of Mara Jade Skywalker. Over the following weeks, Caedus lost the Jedi's support and branded them traitors. Niathal would order Admirals Darklighter and Bwua'tu back to the Core in case the Confederation should continue its push toward Coruscant, just as Caedus was engaging the Wookiees, who had allied with the Jedi, over Kashyyyk.  Caedus realized that Niathal was too good a tactician to overlook the opportunity to remove her rival, and take a fair amount of the enemy force out, in one fell swoop, but he and his forces narrowly managed to escape."}, {"tag": "p", "text": "Following the Battle of Kashyyyk, Admiral Niathal sent her intelligence analyst General Tycho Celchu on a secret mission to locate the Jedi and relay a request for them to return to the service of the Galactic Alliance. Locating Luke Skywalker and the Jedi Order on Endor, Celchu relayed Admiral Niathal's request to Skywalker, but Skywalker refused the request on the grounds that it could leave the order at the mercy of Caedus. However, Skywalker reiterated his support for the Galactic Alliance, stating the Jedi would return once Caedus had been removed from power, and that the order still trusted Admiral Niathal."}, {"tag": "p", "text": "Later, Caedus approached Niathal with his plan to take Centerpoint Station. His effort to take control of the superweapon, however, ended in failure. The Jedi and their allies not only destroyed Centerpoint Station, but also rescued Allana, the princess of Hapes and Caedus' daughter, whom he had kidnapped in an effort to coerce the Hapes Consortium into supporting the Galactic Alliance again after Hapan Queen Mother Tenel Ka Djo turned on him at Kashyyyk. Lieutenant Patra Tebut, an officer on the Anakin Solo, had unknowingly allowed a Jedi strike team led by Skywalker aboard, believing their shuttle was Celchu's. When Caedus discovered this, he killed Tebut in a fit of rage, injuring Captain Kral Nevil, a friend of Niathal's, in the process. Niathal was appalled, and after confronting Caedus about Tebut's murder, realized she could no longer support him. With that, she began collaborating with the Jedi behind Caedus' back."}, {"tag": "p", "text": "Aware that Tebut's death had hurt his military reputation, Caedus decided to retake Fondor to shore up his prestige. Niathal saw this as her chance to overthrow Caedus, and secretly began communications with Luke Skywalker on the Alliance blockade of the world. During the battle, Niathal offered the Fondorians a chance to surrender, which they took. However, Caedus continued the attack, determined to make an example of Fondor even though they had surrendered. Niathal, using her position of Supreme Commander, relieved him of command for disobeying the laws of war, and ordered the Alliance fleet to disobey him. Unfortunately for Niathal, she was not as popular as Caedus in the military despite outranking him, and two-thirds of the fleet remained loyal to him. With the majority of the fleet under his command, and having gained the support of the Imperial Remnant after having Tahiri Veila assassinate Grand Admiral Pellaeon, Caedus branded Niathal a traitor. Her hopes of overthrowing Caedus dashed, Niathal found consolation upon hearing that Nevil had defected to her side."}, {"tag": "p", "text": "The remaining Alliance forces loyal to Caedus were eventually repelled from the Fonder system by Imperial Admiral Natasi Daala, her Maw Irregular Fleet, and a force of Mandalorians. Luke Skywalker negotiated with Niathal for her to use Fondor as her base of operations for her faction of the Galactic Alliance, forming a united front against Caedus."}, {"tag": "p", "text": "Niathal and her depleted fleet fought Nek Bwua'tu at the Second Battle of Roche alongside Daala but he was able to defeat them both. Caedus left Bwua'tu in charge while he did battle with the Jedi and their allies at Shedu Maad, but his forces were defeated and he died at the hands of his sister, Jedi Knight Jaina Solo. With Caedus dead, the Jedi Coalition rejoined the Galactic Alliance. With the Imperial Remnant joining them, the Confederation also surrendered, ending the war."}, {"tag": "h3", "text": "Retirement and death"}, {"tag": "p", "text": "After the war's end, Niathal was able to retire peacefully. However, in 43.5 ABY, Daala—who had since become Chief of State of the Galactic Alliance—decided to bring Niathal back to Coruscant to be put on trial for dereliction of duty and allowing Caedus' rise to power. Daala actually sympathized with Niathal; the decision was a political maneuver suggested by General Merratt Jaxton, with the hopes of proving to the public that she treated civilians and military beings the same. Daala also believed that Niathal would easily be able to escape or at least reduce her charges."}, {"tag": "p", "text": "However, Niathal disapproved of Daala's decision, believing that, as there had been no way to foresee Caedus' actions, she had made no mistake. Still, she told Daala she would come to Coruscant. Niathal, however, had no intention of doing so. Without telling anyone—even her personal assistant—she ran a gas line of carbon monoxide into her aquarium, killing herself painlessly. When Daala's emissary, Elyas Caran, arrived the following day, she found Niathal dead, along with a suicide note. Niathal's death was reported back to Coruscant, causing Daala great sadness."}, {"tag": "p", "text": "Chief Daala granted Niathal a funeral with full military rites. The service was held on Coruscant, and included a massive funeral procession that was broadcast over the HoloNet. Daala had not actually authorized the funeral procession; in fact, the Galactic Alliance Security officer who signed off on the order was fictitious. Despite appearing on Most Hated lists as recently as the day before her death, the public sympathized with Niathal following her suicide, while Daala's approval ratings also suffered following the death of the former Chief of State. Wynn Dorvan remarked that Daala wanted Tahiri Veila to suffer during her trial due to the anger caused by Niathal's death. While with Nek Bwua'tu, Daala also reflected that Niathal, along with Pellaeon, was one of many old friends who was now gone."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Admiral Niathal was a military career-woman, and totally dedicated to the preservation of the Galactic Alliance. She was also a master tactician, having shown her skill in battle during numerous Galactic conflicts. Niathal was also known for her cutting reprimands and icy disposition, but she was also rather sympathetic to those who fought alongside her, as displayed aboard Bounty. She would later show a sympathetic streak after speaking with Kral Nevil and thinking it would be terrible if his wife were to lose both her husband and son, and the loss of the crews of minelayers she betrayed to Skywalker, resulting in their deaths."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}