{"url": "Chad_Hilse", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alderaanians", "Category:Alliance Fleet personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Chad Hilse"}, {"tag": "p", "text": "Chad Hilse was an Alderaanian ensign in the Alliance to Restore the Republic during the Galactic Civil War. Strongly dedicated to defeating the Galactic Empire, he was serving aboard the CR90 corvette Tantive IV when it was attacked and disabled by the Imperial I-class Star Destroyer Devastator. While defending Princess Leia Organa and the captured Death Star plans she possessed, Hilse was killed in a gunfight with the 501st Legion stormtrooper unit."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Chad Hilse was a Human male born on Alderaan. During the Galactic Civil War, he became a loyal trooper for the Alliance to Restore the Republic, strongly dedicated to defeating the Galactic Empire. He was assigned the rank of ensign and received training in both starship and ground combat. In 0 BBY, he was stationed aboard the CR90 corvette Tantive IV when Princess Leia Organa received a transmission from Rebel spies containing plans for the Death Star, a massive Imperial battlestation and superweapon."}, {"tag": "p", "text": "Hilse was aboard the Tantive IV when it was attacked and disabled over Tatooine by the Imperial I-class Star Destroyer Devastator, the flagship of the Sith Lord Darth Vader. Hilse was among the detachment led by Lieutenant Pello Scrambas that attempted to repel Imperial boarders expected to storm the ship. After taking defensive positions along the corvette's corridors, Hilse and his fellow soldiers engaged the 501st Legion stormtrooper unit. He was among the first to be killed in the ensuing gunfight."}, {"tag": "p", "text": "Due to false reports issued under Vader's orders, it was initially believed that the Tantive IV was destroyed and its personnel killed during an asteroid storm. It was only later, when Organa successfully brought the Death Star plans to the Rebel base on Yavin 4, that the true circumstances of Hilse's death became known to the galaxy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Chad Hilse was, in many ways, typical of the volunteers serving in the Alliance to Restore the Republic during the Galactic Civil War. He was very loyal to the Rebellion and believed strongly in its mission, and was equally fervent in his opposition to the Galactic Empire and dedication to defeating it. This was illustrated by his willingness to stand against the Imperial boarders on the Tantive IV, despite being heavily outmanned and outgunned by the Devastator's forces. Hilse was a well-rounded fighter who received training in both starship and ground combat. He had light skin, brown hair and blue eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his service on the Tantive IV, Chad Hilse wore the standard uniform for Alliance Fleet troopers. He was armed with a DH-17 blaster pistol. Hilse wore a cap as part of his uniform, and his equipment also included a bandolier and a scanner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chad Hilse was a bit role in the first Star Wars film, A New Hope (1977). He was played by an uncredited extra, whose scenes were filmed in mid 1976 in the United Kingdom. The character had no lines and was not identified by the name Chad Hilse until 1995 with the release of Decipher's Star Wars Customizable Card Game. His name and most of his backstory were featured on the \"Rebel trooper\" card in the Premiere Limited card set."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}