{"url": "Chagrian", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Amphibian sentient species", "Category:Chagrians", "Category:Inner Rim species"], "nodes": [{"tag": "h1", "text": "Chagrian"}, {"tag": "p", "text": "Chagrians were an amphibious sentient species of tall, horned humanoids with blue skin that were native to the planet Champala. Chagrians were most notably recognized by their thick tentacles that curved around their shoulders, as well as two more horn-like extremities above their heads."}, {"tag": "p", "text": "The Chagrian Mas Amedda served as the Vice Chair of the Galactic Senate under both Supreme Chancellor Finis Valorum and his successor Sheev Palpatine, only to become his Grand Vizier following the inception of the Galactic Empire."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "h3", "text": "Aquatic amphibians"}, {"tag": "p", "text": "Chagrians were an amphibian sentient species that began life with an immature tadpole stage. Born in clutches of two or three, each tadpole measured thirty centimeters long and was initially entirely aquatic. Chagrians could only begin to breathe air after developing lungs as they matured, and also developed two arms and two legs. Once these limbs were fully developed the Chagrians emerged from the water entirely and the other aspects of their intermediate physiology faded away entirely."}, {"tag": "p", "text": "As adults, Chagrians were bipedal humanoids who remained as comfortable submerged in water as they were out of it. As they could breathe fully underwater, members of the species could spend months or years entirely submerged with no ill effects. Their bodies were muscular and powerful, meaning that they were well suited to not only excellent swimming but also heavy labor. As they were constantly exposed to the salt water seas of their homeworld Champala, Chagrians could rarely taste anything but salt, and so had an extremely weak sense of taste. Because of this, Chagrian's tongues were used to enhance their sense of smell rather than taste. In a similar fashion to some reptiles, Chagrians would briefly flicker their tongues in and out of their mouth in order to assess the viability of new food and drink. Chagrians could easily adapt to the seas of other worlds as long as the chemical makeup of the water was similar to that on Champala. Chagrians also secreted green sweat when subjected to heat."}, {"tag": "h3", "text": "Visual distinctions"}, {"tag": "p", "text": "Standing two meters tall on average, Chagrians visually looked similar to most other bipedal humanoids, with the most distinctive characteristics being their vibrant skin color and cranial horns. Chagrian skin ranged from light blue to cerulean to indigo due to the species' exposure to radiation from their unstable sun as they evolved. Their skin developed to provide an innate resistance to harmful radiation, which became a dominant trait of their species."}, {"tag": "p", "text": "All Chagrians possessed a pair of elegant horns that grew down on either side of their head, protruding down over their torso from a pair of fleshy head tentacles. Male Chagrians also possessed a second set of horns, known as lethorns, which protruded straight up from the top of their head. The horns were either a darker purple or brown at the base, with the upper and mid portions being white or yellow. A Chagrian's head also featured two eyes well developed to see in dim sub-aquatic light and a nose above the mouth, and their hands had five fingers."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "Denizens of a resort world"}, {"tag": "p", "text": "Chagrian settlements were built inside the tidal zones of Champala's oceans as the species was most comfortable underwater and prefered to be immersed in liquid. This meant that the ebbing and flowing tides of the planet's oceans regularly submerged the communities entirely. These events were entirely anticipated and were as predictable as the rising and setting of the sun or the changing of the seasons. Due to their amphibious nature, the flooding of their homes did not impede Chagrians at all, and the only structures they built specifically to say above the sea at all times were spaceports, including the one in Tidros, the capital city of Champala."}, {"tag": "p", "text": "Champala's dramatic tides and beautiful coastlines made it a popular resort destination for affluent travelers from the Core Worlds, which resulted in Chagrian economy becoming heavily focused on tourism. With a warm climate, pristine beaches and friendly denizens, the world began attracting millions of visitors per year, which made Champala and its occupants fairly wealthy. The focus on tourism led Chagrians to be a generally obedient and accommodating people, even to a fault. This included Chagrian resorts hiring offworld chefs at great expense to satisfy offworlder's culinary needs due to Chagrian's own lack of taste."}, {"tag": "h3", "text": "A rich and just society"}, {"tag": "p", "text": "Due to this wealth, the average Chagrian on Champala wanted for very little, enjoying such amenities and benefits as medical care, social equality and higher education. This position of privilege meant that Chagrians were rarely motivated but such basic needs as greed or avarice and that they were easily disturbed by encounters with those less fortunate. Seeing poverty, prejudice, homelessness, disease or starvation, would often move a Chagrian so greatly that they would attempt to remedy the issue as best they could. This might be done through direct action, or through less direct methods like charity or initiating lasting change through local law. Despite their tendency to be accommodating, Chagrians were not ignorant to social injustice like cruelty or bias, and as an affluent society were able to deal with them far more quickly than other more downtrodden species. Chagrians also tended to be serene, balanced, and stoic."}, {"tag": "p", "text": "Chagrian culture valued justice, both legal and social, above all other things, making Chagrians sticklers for rules and unwilling to deviate from any legal or bureaucratic system that they were accustomed to. This made their society law abiding and peaceful, with some of the fairest and well balanced courts in the galaxy. Law enforcement was taken very seriously on Champala, with every criminal or civil investigation carried out in a meticulous and thorough fashion that saw even the most innocuous forms of evidence studied carefully. Most trials were brief affairs with little or no fanfare, as Chagrians on trial generally admitted their guilt. Those few who denied accurate charges were considered extremely craven."}, {"tag": "h3", "text": "Daily life of a Chagrian"}, {"tag": "p", "text": "The majority of Chagrians on Champala spoke their native tongue, Chagri, with few learning Galactic Basic Standard. Most Chagrians saw meals as, at best, an inconvenience due to their lack of taste. As such, most members of the species carried nutritional supplements or food capsules in order to reduce the time required to eat as much as possible. Celebratory banquets or feasts are entirely unheard of within Chargian society, with the exception of resorts and facilities catering to offworlders."}, {"tag": "p", "text": "Chagrian males originally used their lethorns in mating rituals and as weapons during formal duels, although by the time of the Galactic Civil War such duels had been outlawed. Despite this, males in particular still saw their horns as a symbol of status and devoted a large portion of their daily routine to caring for them. Chagrians would display uncharacteristic vanity in filing and decorating the horns. While in their juvenile tadpole stage, Chagrians are cared for by their parents, who keep them within a sealed tub inside their home."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the birth of the Galactic Empire and the rise of Galactic Emperor Palpatine, the Chagrian people quickly and correctly deduced that the Imperial regime was cruel and pitiless. Champala was placed under Imperial occupation, and the Empire expanded mining and manufacturing on the world tenfold. This led to industrial pollution poisoning Champala's once pristine seas."}, {"tag": "p", "text": "The Chagrians shouldered the burden of the occupation with their usual stoicism, but were torn between their desire for freedom and their unwillingness to see their society suffer under brutal Imperial rule. Many Chagrians chose to oppose the Empire and joined the Alliance to Restore the Republic, where they proved themselves invaluable in helping to liberate various water worlds, including the planet Mon Cala. The combination of Chagrian support for the Alliance and Imperial occupation resulted in tourism on Champala dwindling exponentially during the Imperial Era."}, {"tag": "h2", "text": "Chagrians in the galaxy"}, {"tag": "p", "text": "Although a generally peaceful species, Chagrian history was punctuated with the occasional bout of conflict or unrest. Due to their predilection to rules and law, the rare ancient Chargian conflicts were highly officiated affairs that strictly adhered to various rules and codes. One such code was the color of war, a rule which marked a specific shade of red as a color that could only be worn by combatants during times of conflict. Any individuals wearing this color would be considered combatants and therefore valid military targets. Many of the Chagrians who joined the Alliance during the Galactic Civil War chose to work this color into their uniform, often in the form of epaulets, piping, combat webbing or a combination of the three. The color promoted solidarity between the rebel Chagrians, and also helped to identify individual Chagrian's commitments to the rebel cause."}, {"tag": "p", "text": "Chagrians made excellent military commanders due to their species penchant for adhering to the rule of law, including military codes. This also resulted in the species producing many successful diplomats, soldiers and spies. Chagrians in positions of authority took great care to ensure the well-being of those under their command, even being unwilling to lose the lives of their troops when such sacrifice is called for. Any unit commanded by a Chagrian was likely to find itself well fed, properly equipped, and highly motivated, assuming that supply lines were kept open and logistics were competently managed. Due to the Chagrian's lack of technological development, few Chagrians became engineers. Those Chagrians that did leave Champala could learn Basic with relative ease, and Chagri was heard rarely outside of the Chagrian homeworld."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A Chagrian first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}