{"url": "Chaingun", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Personal blaster cannons"], "nodes": [{"tag": "h1", "text": "Chaingun"}, {"tag": "p", "text": "Chainguns were extremely powerful ranged weapons that fired small blaster bolts at a very high volume, and at extremely high speeds. The sound of a chaingun would horrify targets, as hundreds of blaster bolts struck their bodies. Chainguns made short work of large groups of enemies, and operated off an automatically recharging power source, however it was a large, heavy, and unwieldy weapon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The clone troopers of the Grand Army of the Republic used the Z-6 rotary blaster cannon during the Clone Wars. One of these rotating blaster cannon chainguns was used in battle against General Grievous on Hypori. The weapon had two configurations: Shoulder mounted, like a Rocket launcher, or a two-handed configuration. The shoulder-mounted version was used by the Rail-class Advanced Recon Commando variant of Anti-trooper. Another example of a chaingun was the LS-150 Heavy Accelerated Charged Particle Repeater Gun, used by Trandoshan mercenaries on Kashyyyk. Most variants of Phase II Dark Troopers were known to use chainguns into battle. It is unknown what type of chaingun they used. The Rebel SpecForces team Renegade Squadron also used chainguns. The maker of their weapons is unknown as well."}, {"tag": "h2", "text": "Use"}, {"tag": "p", "text": "The chaingun was often used for capturing fortified bases or for charging a closely-knit force of hostiles, as its devastating rate of fire would both intimidate and eliminate enemies. The chaingun was also highly effective at defending an area. However, they were not usually wielded for general use, as the chaingun was large and heavy, and some models needed a few seconds to warm up before firing."}, {"tag": "p", "text": "Yoda was also seen carrying a chaingun in a box on his back and used it to defend an unidentified planet."}, {"tag": "h2", "text": "Known models"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}