{"url": "ARC-77", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Alpha-class Advanced Recon Commandos", "Category:Clone trooper captains", "Category:Members of the Muunilinst 10"], "nodes": [{"tag": "h1", "text": "ARC-77"}, {"tag": "p", "text": "ARC-77, known as \"Fordo,\" was an  Alpha-class Advanced Recon Commando captain in the Grand Army of the Republic. In 22 BBY, he was assigned to a task force led by the Jedi Knight General Obi-Wan Kenobi, to take the Confederate-held world of Muunilinst. Together with a group of clone troopers that would later come to be known as The Muunilinst 10, Fordo proved instrumental in the Battle of Muunilinst, leading his troops to destroy an enemy artillery emplacement, and then helping Kenobi capture the enemy leader, San Hill."}, {"tag": "p", "text": "Immediately after the battle was over, Fordo was dispatched to the planet Hypori, where a group of Jedi Knights had been trapped by the Confederate General Grievous. Making their way to the Jedi's location, Fordo and his men battled Grievous, but were unable to kill him. They were, however, able to recover three survivors: Ki-Adi-Mundi, Aayla Secura, and Shaak Ti. In 19 BBY, Fordo was on Coruscant when the planet was attacked by the Confederacy. Despite facing overwhelming numbers, Fordo and his men were able to beat back a portion of the attacking force in Sector Four with the help of the Jedi Masters Mace Windu and Yoda."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Muunilinst"}, {"tag": "p", "text": "An Advanced Recon Commando, ARC-77 was a clone of the Mandalorian bounty hunter Jango Fett, born on the planet Kamino for service in the Grand Army of the Republic. Becoming a captain, he was given the name \"Fordo.\" In 22 BBY, in the opening stages of the Clone Wars, Jedi General Obi-Wan Kenobi led an army to the planet Muunilinst, where the InterGalactic Banking Clan was manufacturing substantial droid armies for the Confederacy of Independent Systems. Fordo was among the troops sent, and he was to lead a team of two ARC lieutenants and seven infantry clone troopers, making up the group that would come to be known as The Muunilinst 10. Their objective was to make their way to the headquarters of Banking Clan leader San Hill, independently from the rest of Kenobi's forces; they would rendezvous with Kenobi there. Before entering the system, Kenobi personally assured Fordo and his men, reminding them that their mission was of the utmost importance in the greater context of the upcoming Battle of Muunilinst. For the engagement, Fordo was given the title of Task Force Commander."}, {"tag": "p", "text": "Fordo and his men made their way to the planet surface in a Low Altitude Assault Transport/infantry, as did most of Kenobi's forces, while Commander Anakin Skywalker and his pilots engaged the Banking Clan's starfighters. Before reaching the city of Harnaidan, Kenobi ordered the ARC troopers to break off, and begin their operation. As they made their way into the city separately, their ship was shot down, and crashed in an abandoned street. Fordo and his men were unharmed, however, and he ordered them to debark, with caution. They soon came under sniper fire, however, and CT-43/002 was lost in the attack. Taking cover behind what remained of the gunship, the Captain had a spotter locate where the snipers were. Once their locations were determined, Fordo had one of his lieutenants use a PLX-1 portable missile launcher to wipe them out utterly, causing considerable damage to the surrounding architecture."}, {"tag": "p", "text": "Once the area was clear, Fordo led his men through the city streets, towards Hill's headquarters. Along the way, they encountered an Armored Assault Tank, but one of the lieutenants was able to dispatch it single-handedly. Using a commando recon droid, Fordo determined the target's location, and spotted a large cannon at the base of Hill's tower. Reporting to Kenobi, the Captain was given permission to proceed. Fordo led his troops to the base of the tower, and then, along with them, rappelled up to the position of the cannon. The clone troopers quickly dispatched the droid guard stationed there, and one of the lieutenants destroyed the visible command booth at the top of the tower with his PLX-1. The Captain's men then placed a large amount of explosives, rappelling to the top of the tower as the cannon exploded below. At the top of the tower, they waited for the arrival of General Kenobi."}, {"tag": "p", "text": "As planned, Kenobi rendezvoused with them at the top of Hill's tower. Blowing their way through the roof, Fordo and his men barged into Hill's war room, summarily destroying his droids with the help of the General. When the fighting was over, Fordo grabbed Hill, and brought him before Kenobi. As the General requested an unconditional surrender from Hill, the Gen'Dai Separatist commander Durge entered the room on a jetpack. Fordo and his men quickly concentrated their fire on the newcomer, and were able to down him, before bombarding him with even more blaster fire. When one of the lieutenants used his PLX-1 on Durge, Fordo was convinced that the Gen'Dai had been neutralized. Kenobi was not so sure, however, and his caution was proved wise: Durge recovered from the attack, and began dispatching Fordo's troops."}, {"tag": "p", "text": "The hulking Gen'Dai then \"swallowed\" Kenobi, trapping the General. Fordo, in response, fired his wrist grappling hook at Durge's helmet and electrified it, angering the Separatist commander. Durge was able to break the connection, knocking Fordo back and leaving him vulnerable to attack. Before the Gen'Dai could kill the Captain, however, Kenobi, from within Durge's form, pushed outwards with the Force, seemingly destroying the attacker and freeing himself. The skirmish over, Fordo and his men rounded up Hill and his aides. When the battle was finally over, the Captain joined Kenobi in overseeing the aftermath, whereupon an unidentified ship approached their position. The ship had, during the space battle over Muunilinst, fled to hyperspace and had subsequently been chased by Commander Skywalker. As it came down to land, Kenobi, sensing Skywalker aboard, ordered his men to hold their fire. While Kenobi berated Skywalker for following the ship, he received a transmission from General Daakman Barrek, who, along with other Jedi, required evacuation from Hypori, where they had been outflanked by the Separatist General Grievous."}, {"tag": "h3", "text": "Hypori"}, {"tag": "p", "text": "Fordo was sent to Hypori to rescue the survivors of Barrek's task force. He and ten lieutenants were tasked with recovering them, and, favoring a more aggressive approach, Fordo brought along an Advanced Recon Commando heavy gunner, and a Reciprocating quad blaster. Reaching Hypori in a gunship, Fordo and his men approached the downed Acclamator-class assault ship in which the surviving Jedi were hiding, and the Captain, after preparing his gear, ordered his pilot to begin jamming the enemy. Making its way past the army of droids that surrounded the assault ship, the gunship dropped remote bombs amongst the enemy, before blasting its way into the Acclamator. As soon as he debarked, Fordo detected three life signs and had one of his troops check in some nearby rubble, while another checked in the rafters. Making his way towards the life signs with all due haste, Fordo progressively ordered his troops to fan out."}, {"tag": "p", "text": "They were met with the sight of a wounded Jedi Master, General Ki-Adi-Mundi, dueling General Grievous. Fordo and his men wasted no time in opening fire on the cyborg General, but Grievous was able to evade their shots and began cutting down the ARC troopers. The Captain reacted by having his gunship pilot blast his way into the area, and open fire on Grievous with the ship's weapons. While the cyborg fled the site, Fordo's men recovered the other surviving Jedi: Aayla Secura and Shaak Ti. When the Captain ordered his men back on board the gunship, Ki-Adi-Mundi protested, insisting that they pursue Grievous, but Fordo pointed out that the survivors would surely perish if they lingered on Hypori. The General relented, and boarded the craft. As they flew away from the crashed Acclamator, Fordo activated the remote bombs, wiping out a large number of enemy troops and clearing a path for the gunship to escape through."}, {"tag": "p", "text": "The wounded Jedi, though in a critical condition, survived, and were able to return to the galactic capital of Coruscant. Due to his efforts, Fordo was awarded the Chancellor's Service Medal, but he refused, and had the honor bestowed upon the late CT-43/002, one of his men who had perished during the Battle of Muunilinst."}, {"tag": "h3", "text": "Coruscant"}, {"tag": "p", "text": "In 19 BBY, Fordo was on Coruscant when it was attacked by the Confederacy. Defending the Sector Four district, Fordo was hard pressed to beat back the attackers, and he realized that his position was being overrun. Calling for reinforcements, he took his DC-15A blaster rifle and used it to smack down an approaching B2 super battle droid. Drawing his pistol and picking up a fallen comrade's DC-15A, Fordo continued to hold his ground, but eventually gave the order to retreat. At that moment, Jedi Master Yoda arrived astride a kybuck, and countermanded the Captain's earlier order. Shortly afterward, General Mace Windu arrived astride a commandeered vulture droid. The battle continued on, and Fordo's men gained the advantage, allowing the Captain to have his right flank advance into the enemy lines. He did not have to worry about his left flank, however, as that was being watched over by Windu and Yoda. The Republic ended up winning the Battle of Coruscant."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Far from being a subtle man, Fordo preferred straightforward tactics, employing overwhelming firepower as opposed to complicated strategies. He eventually became famous for his bombastic approach to any given situation, which continually awarded him success. He was also modest, refusing to take credit for his actions, and instead valuing the contributions of those who fell on the field of battle more. Fordo was undeterred in the face of great danger, and fought on with unfailing courage no matter how dire the situation, although he would give the order to retreat in the face of overwhelming odds. He would also disobey his superiors if they were to jeopardize his objectives, as he did with General Ki-Adi-Mundi on Hypori. However, during the Battle of Coruscant, Fordo had faith within Jedi Generals Mace Windu and Yoda, who both oversaw the Republic troops' left flank."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Early in the Clone Wars, Fordo wore a lighter version of the Phase I clone armor called ARC trooper armor, which also gave Fordo more protection than its Phase I counterpart. Fordo's armor itself sported red markings. The set also featured an array of equipment, such as a grappling hook and comlink system built into his left gauntlet, a blast-dampening gray pauldron, a skirt-like kama, and a belt that featured a dual pouch holster that held his twin DC-17 hand blasters. His pauldron had an ammunition pouch attachment, which held ammo for his twin blaster pistols. While clones under his command utilized other weapons at their disposal, Fordo preferred to use his twin hand blasters, which he used during the Battles of Muunilinst and Hypori. During the Battle of Coruscant, Fordo used only one hand blaster and a DC-15A blaster rifle. Fordo's helmet featured a rangefinder. He also had a portable holographic projector, which he utilized during the Battle of Muunilinst, and a pair of white macrobinoculars."}, {"tag": "p", "text": "During the later days of the Clone Wars, Fordo, like many clone troopers, switched to the Phase II version of the clone armor. Fordo's Phase II armor sported red markings and was similar to his Phase I ARC trooper armor, although the set did not feature his kama, his pauldron ammunition pouch attachment, nor his dual pouch blaster holsters. Instead, Fordo sported a bandolier and a belt that had one pouch holster for a blaster pistol. Fordo's Phase II helmet did not feature a rangefinder, but instead featured Jaig eyes, which he earned as a result of his honorary actions on Hypori. Like his Phase I armor, however, Fordo's left arm gauntlet had a built-in comlink system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "The character of Fordo made his first appearance in the second episode of the series Star Wars: Clone Wars. He later appeared in the second season of the show, and was voiced by André Sogliuzzo. He was eventually named in the article \"Guide to the Grand Army of the Republic,\" which was published in Star Wars Insider 84."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "There have been a few inconsistencies with his rank. At times Fordo was referred to as \"commander.\" In particular, Obi-Wan Kenobi called Fordo a commander in the ninth chapter of the Star Wars: Clone Wars series. In the twenty first chapter of the series, a clone trooper called Fordo a commander as well. In the Star Wars: Clone Wars PhotoComic, a text box above Fordo reads as \"The ARC trooper commander gives the all-clear signal.\" A few pages after the discrepancy, Kenobi referred to Fordo as a \"sergeant.\" The issue with Fordo being called a commander was later clarified in the Guide to the Grand Army of the Republic, a short story featured in Star Wars Insider 84, which was penned by authors Karen Traviss and Ryan Kaufman. The guide mentioned that Fordo received the designation \"Task Force Commander\" during the Battle of Muunilinst. The designation itself was a title, not military rank."}, {"tag": "p", "text": "The guide also introduced Fordo's captain rank. His captain rank, as well as his Task Force Commander title, was mentioned in his entry in the 2008 The Complete Star Wars Encyclopedia. The rank appeared in two Hasbro toy figure packs featuring Fordo, released in 2010 and 2011, respectively. Because later sources claim that Fordo was indeed a captain, this article assumes Fordo's rank was captain."}, {"tag": "p", "text": "For the ongoing Vintage Collection toy line by Hasbro, Fordo was released with both his Phase I and II equipment as \"ARC Trooper Commander\" in 2011. His figure features a unique facesculpt with a small chin beard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}