{"url": "Chalco", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Spacers"], "nodes": [{"tag": "h1", "text": "Chalco"}, {"tag": "p", "text": "Chalco was a vagrant and a drifter who often hung around Docking Bay 9372 on Coruscant finding information on people. He aided Jedi Master Luke Skywalker in his search for rogue Jedi Daeshara'cor in 25 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the opening months of the Yuuzhan Vong War, Chalco spotted the rogue Twi'lek Jedi Daeshara'cor depart Coruscant on the Lucky Star II, bound for Ord Mantell. Luke Skywalker later found Chalco and convinced him to aid him in tracking her down, as Daeshara'cor's search for superweapons to use against the Yuuzhan Vong could have disastrous results for the Force and the galaxy. Chalco revealed what he had seen; the Jedi leaving on the Lucky Star II, and Skywalker discerned her destination as Vortex, the current residence of Qwi Xux, designer of the Sun Crusher."}, {"tag": "p", "text": "Chalco accompanied Luke and became close friends with the young Jedi Knight Anakin Solo. The vagrant went with Skywalker and his companions to the library world on Garos IV. When Anakin was captured by Daeshara'cor Chalco tried to rescue the boy, wearing an ysalamir skin in an effort to counter Daeshara'cor's Force powers. Chalco hadn't known that the ysalamir actually had to be alive for its Force-negating effect to work, and he was easily overpowered by the rogue Jedi, who deflected his own blaster bolt, set to stun, into his knee. Chalco's weapon still proved useful, however, as Anakin was able to use it as a telekinetic projectile to knock Daeshara'cor out. Anakin and Chalco then took Daeshara to Master Skywalker."}, {"tag": "p", "text": "Following the Battle of Garqi, Chalco agreed to team up with smuggler Mirax Terrik to transport bafforr trees to safer planets, after Jedi Knights Corran Horn, Ganner Rhysode and Jacen Solo discovered its lethal effect on the vonduun crab armor worn by the Yuuzhan Vong warriors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}