{"url": "Chalcedony_waves", "categories": ["Category:Canon articles", "Category:Artifacts", "Category:Culture of Alderaan", "Category:Necklaces"], "nodes": [{"tag": "h1", "text": "Chalcedony waves"}, {"tag": "p", "text": "The chalcedony waves was the name of a necklace that belonged to the women of the House of Organa, the royal family of Alderaan. Queen Breha Organa owned that necklace at some point, before passing it down to her adopted daughter, Princess Leia Organa. Although Alderaan was destroyed by the Galactic Empire, the chalcedony waves survived the planet's disappearance, as the princess had been offworld herself. After the Alliance to Restore the Republic defeated the Empire over Yavin 4, Leia wore the chalcedony waves during a ceremony honoring the Alliance heroes of Yavin. Shortly thereafter, she offered the necklace to the Sullustan Nien Nunb, as a reward for his help evacuating Alderaanian survivors from Sullust."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The chalcedony waves necklace was made of ten identical square pieces with a carved indentation running diagonally. All of them had a silvery finish. When worn, the chalcedony waves rested at the top of the collar bone, between its wearer's throat and her cleavage. The necklace came with a chunky cuff bracelet that matched the waves' style and color."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The chalcedony waves belonged to the women of the House of Organa, the royal family of the planet of Alderaan. It notably belonged to Queen Breha, who already ruled her homeworld around the time of the Clone Wars. The necklace was later passed down to the Queen's adopted daughter, Princess Leia Organa, who used to wear it for formal ceremonies."}, {"tag": "p", "text": "In 0 BBY, the tyrannical government known as the Galactic Empire used its brand new battle station, the Death Star, to blow up Alderaan. However, having been kept prisoner by the Empire, Leia survived the destruction of her home planet, and so did the chalcedony waves."}, {"tag": "p", "text": "The Alliance to Restore the Republic, whose members actively opposed the Empire, launched an assault against the Death Star, destroying that planet-killing battle station in the orbit of Yavin. A ceremony honoring the Alliance heroes of Yavin took place, during which Leia wore the chalcedony waves and awarded Medals of Bravery."}, {"tag": "p", "text": "Shortly after the award ceremony, Leia set off on a mission to reunite the surviving Alderaanians who were scattered across the galaxy, and she took the chalcedony waves with her, among other personal effects. One of those pouches of Alderaanian survivors was located in an enclave on Sullust. However, a spy in the princess's company revealed their presence on Sullust to the Empire, putting the Alderaanians' life in grave danger. Ultimately, the princess and her people managed to evacuate the enclave with the help of Nien Nunb, a Sullustan smuggler. Unable to reward Nunb with a precious medal, the princess decided to award him the chalcedony waves instead."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The chalcedony waves first appeared in the 1977 movie Star Wars: Episode IV A New Hope, the first installement in the original trilogy of Star Wars. It was worn by Princess Leia, played by actress Carrie Fisher, during the closing scene of the film. The name of the necklace was never spoken on-screen, but was referred to as \"chalcedony waves\" on page 219 of the Star Wars Episode IV: A New Hope novel. That name was later confirmed to be canon in the fourth issue of the Marvel comic book series Star Wars: Princess Leia."}, {"tag": "p", "text": "The piece of jewelry that was used in A New Hope was designed by Björn Weckström of Lapponia Jewelry, one of the most famous jewelry designers in Finland. In spring 1976, the secretary of Star Wars creator George Lucas contacted Weckström, requesting a piece of silver jewelry to feature in a movie the name of which could not be revealed at that point. That piece of jewelry was to appear in a scene that was due to be filmed within six weeks. The project seemed interesting to Weckström, who accepted the assignment."}, {"tag": "p", "text": "As Weckström had started to design a new piece, he was told there had been a change in the filming sequence of the scenes, and the jewelry would be needed in a week's time. Since Weckström was unable to finish his design work on such short notice, it was decided that Princess Leia's jewels would be bought from Lapponia's products that were available in London, where Lucas' movie was being filmed. Consequently, Lucas' agents acquired a necklace and a bracelet from a Lapponia retailer on Bond Street, London. The chosen pieces were the \"Planetoid Valleys\" necklace and \"Darina's Bracelet,\" which were part of the \"Space Silver\" collection Weckström had designed in 1969. Those silver pieces were inspired by the Finnish winter landscape with its frozen lake surfaces. The designer was later notified that Lucas thought his jewelry was fantastic, but still did not know in which movie it would be displayed."}, {"tag": "p", "text": "Eventually, A New Hope was released in May 1977, although it only premiered in Finland on December 16. Having seen one of the first screenings of the movie in Finland, a friend of Weckström's recognized his jewelry in the final scene of the movie. Shortly thereafter, Weckström himself went to see the movie, and was impressed to see his own work on the big screen. Thanks to its appearance at the end of A New Hope, \"Planetoid Valleys\" became the all-time most well-known piece in the Lapponia Jewelry collection. As of 2015, both \"Planetoid Valleys\" and \"Darina's Bracelet\" are still part of Lapponia's catalogue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}