{"url": "ARC_Troopers", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "ARC Troopers"}, {"tag": "p", "text": "\"ARC Troopers\" is the second episode of the Star Wars: The Clone Wars television series' third season. It aired on September 17, 2010 as one half of the season's hour-long premiere. It serves as a sequel to the first season episode \"Rookies,\" though it does not immediately follow the episode."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Republic learns of an impending Separatist attack on Kamino, and Anakin and Obi-Wan hurry to the planet. After the Republic repulses the Separatists' diversionary assault, the real attack begins. Asajj Ventress, General Grievous and an army of droids rise out of the oceans, bent on destroying Kamino's clone production facilities. Rex, Cody, Fives, and Echo lead the clones in a desperate defense of their home planet."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Forewarned by the destruction of Rishi Station earlier in the Clone Wars, and a new intercepted transmission between Asajj Ventress and General Grievous, Anakin Skywalker and Obi-Wan Kenobi travel to Kamino to warn Shaak Ti and Lama Su of an upcoming Separatist attack, with clone troopers Captain Rex, Commander Cody, Broadside, Echo, and Fives of the 501st Legion in their company. While Echo and Fives are walking down a hallway full of young clone cadets, remembering their own time as cadets, they run into 99. 99 welcomes them back, but is saddened to hear that Hevy, who gave him his medal, has not made it."}, {"tag": "p", "text": "Shortly, a Separatist fleet arrives and a space battle ensues. Anakin leads the Republic space forces against the attackers, scoring several serious hits against the enemy - or so it seems. Suspicious, Obi-Wan travels underwater, where he discovers that the pieces of debris falling into the Kaminoan ocean are actually components for attack craft being assembled by AQ-series battle droids. The droids discover and attack him, and Obi-Wan barely manages to get away astride an aiwha."}, {"tag": "p", "text": "The finished attack craft begin to assault Tipoca City, breaking through the walls and depositing their droid load inside, along with Grievous and Ventress. After a bit of bickering about which one of them is superior to the other, the two leaders proceed to attack two key targets: Grievous is to attack the barracks to kill all the clones he can find there. After a short battle Colt is the only clone guarding the DNA chamber. Before he can fight Ventress force chokes him and impaled him with her lightsaber. Ventress heads for the main DNA storage to secure the prime DNA sample of the clones' template, Jango Fett. However, Obi-Wan has managed to get back and recall Anakin to the city; while Obi-Wan faces off against Grievous, Anakin engages Ventress in combat. Grievous escapes when a Trident unit crushes the platform they are on; Obi-Wan seemingly falls to his death, but is saved again by the aiwha. With the aid of a clone trooper platoon, Anakin secures the DNA sample from Ventress, but she manages to hop onto Grievous' escape pod and get away."}, {"tag": "p", "text": "Meanwhile, Fives and Echo destroy attacking Aqua Droids from a sniping position, where they are soon joined by 99 bringing them ammunition and a group of lost youngsters. They retreat into the barracks, where Cody and Rex also appear. Although their chances do not look good, Fives and Echo succeed in raising the morale of the young cadets, and 99 shows them the way to a nearby armory, where they re-equip themselves. A platoon of battle droids soon attack the barracks, and by having the cadets strike from ambush, the troopers succeed in destroying all of their attackers, but 99 is killed as he tries to get more ammunition for his brothers. After the battle, Cody, Rex, Echo, and Fives mourn 99's death, and honor him as a true soldier. Soon afterward, both Echo and Fives are promoted to ARC troopers for their initiative and bravery."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The scene where Asajj Ventress kills Commander Colt originally had Ventress kissing the ARC trooper just after she impaled him on her lightsaber. The scene was cut when Cartoon Network insisted on taking it out at Celebration V. However, the scene was still part of a dataclip summary of \"ARC Troopers\" on Cartoon Network's own site. In later reruns of this episode, Colt is not shown being impaled at all; rather, it is merely implied. The DVD, Blu-ray, Netflix, and also the Disney+ release of the episode shows both Colt's death and the kiss."}, {"tag": "p", "text": "An inconsistency in the episode was that the bridge of Grievous' command ship, which was a Separatist dreadnaught, was depicted in scenes where it was shown as resembling the bridge of a Munificent-class star frigate."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}