{"url": "ARC_trooper_armor", "categories": ["Category:Canon articles", "Category:Technology stubs", "Category:Incomplete lists", "Category:Clone trooper armor variants"], "nodes": [{"tag": "h1", "text": "ARC trooper armor"}, {"tag": "p", "text": "ARC trooper armor was the kit issued to the Grand Army of the Republic's elite ARC troopers and consisted of at least two sets, one being the Phase I ARC Trooper Armor used during the initial days of the Clone Wars and was a template of the phase II clone trooper armor with additional equipment and characteristics. After the implementation of phase II, Phase II ARC Trooper Armor was introduced."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "ARC trooper armor was a type of clone trooper armor used by Advanced Recon Commandos, also known as ARC troopers, during the Clone Wars. For some time, ARC trooper armor consisted of the Phase I ARC Trooper Armor, which at its core was similar to the phase I clone trooper armor, although with additional gray armor plating, a double pauldron, additional equipment, a kama, a rangefinder, ammunition pouches, and two holsters."}, {"tag": "p", "text": "Later, the kit was upgraded to have consist of a survival backpack and a prototype helmet that retained the phase I's fin, while keeping the other characteristics of the previous armor set. When the phase II clone trooper armor became standard issue to all clone troopers in the later days of the Clone Wars, the kit's baseline Phase I armor and unique helmet were replaced by its successors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Several Advanced Recon Commandos from Rancor Battalion used ARC trooper armor, including Clone Commander Colt, Clone Commander Havoc, Clone Commander Blitz, and another ARC trooper. ARC troopers CT-5555 \"Fives\" and Clone Corporal CT-1409 \"Echo\" and ARC trooper CT-5597 \"Jesse\" used the armor, the latter during the Battle of Anaxes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}