{"url": "Chamber_of_Antiquities", "categories": ["Category:Legends articles", "Category:Great Jedi Library locations"], "nodes": [{"tag": "h1", "text": "Chamber of Antiquities"}, {"tag": "p", "text": "The Chamber of Antiquities was a series of rooms and vaults deep below the main building of the Great Jedi Library on Ossus. It was here that Jedi Master Odan-Urr studied ancient artifacts under his care."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Part of the sublevels of the Great Library complex on Ossus, the Chamber of Antiquities referred to the labyrinth of vaults and rooms that made up the second sublevel. Accessed by two lifts from the first sublevel, the level was offlimits to most visitors, as it contained the most dangerous items within the collection. Overseen by the Keeper of Antiquities, this being alone could grant a curious Jedi access to the collection. Among the treasures held within the vaults were dark side lore, including Sith holocron, the earliest known documents relating to the Jedi Order, and other sacred tomes. Several heritage tapestries detailing a pictorial history of the First and Second Great Schisms were kept on the walls, along with hard copies of ancient star-charts. During the Massacre at Ossus, Dark Lord of the Sith Exar Kun violated the Chamber of Antiquities and assaulted and murdered Odan-Urr before stealing the Dark Holocron from him and leaving his corpse to rot. When the Cron Supernova rendered Ossus inhospitable soon after, the Chamber and the rest of the Great Library's sublevels became tomblike, preserving the ancient tomes for millennia. By the time of the Galactic Civil War, Odan-Urr's skeleton still remained sprawled at the feet of his great chair in his office, while two stone guardians stood as silent sentinels to protect the chamber from intruders."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The Chamber of the Antiquities was a sprawling level of the Great Library, with a main corridor winding its way from the dedicate turbolift at one end of the level to the other. Off of this tall, wide corridor were several collection rooms, analysis chambers, alcoves, and offices. Near the main entrance to the level was the working office of the Keeper of Antiquities. A circular chamber with a domed roof, the center of the room was filled by a giant stone chair; the back of which reached the ceiling like a pillar. On either side of the room were two stone guardians, droids disguised as statues, standing ready to defend the room should it fall under attack. Midway through the main corridor was a guarded entrance in the form of a rotunda that apparently had no way forward. Hanging on the walls were four tapestries depicting four of the traditional five precepts of the Jedi Code. To find the door, one would have to rearrange the tapestries in the correct order of the traditional mantra. Following the correct order, one would need to recognize that the tapestry depicting a group of children listening to a lecture, the tapestry of the second precept: There is no ignorance, there is knowledge, conceals a clue as to its importance. Following the line of sight from the children in the tapestry, one could find the brick in the wall which concealed the access to the rest of the corridor. Farther down into the most secure portion of the Chamber of Antiquities were two vaults. The first was known as the Vault of Justice, which contained an ancient artifact known as Neer's Gauntlet; the second vault held the Greelwood Saber, a lightsaber crafted by Master Oorrl Morm."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}