{"url": "Chamma", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Devaronians", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Redeemed Jedi"], "nodes": [{"tag": "h1", "text": "Chamma"}, {"tag": "p", "text": "Chamma was a Devaronian male who served as a Jedi Master during the days of the Galactic Republic. Following his elevation to the rank of Jedi Knight, Chamma was selected to be part of a team of Jedi sent to investigate the distress call of a trading ship on the planet of Athiss. Once there, Chamma and each of his comrades were individually attacked by Sith devotees who had managed to master the Sith ways and the dark side. Allowing his fear to overwhelm him, Chamma found himself cut off from the Force, and decided to resort to using his anger and the dark side to defeat his enemy. Following this confrontation, Chamma felt immense guilt and confusion by the course of events which had transpired on Athiss. As a result, he decided to go into a self-imposed exile in the deserts of H'ratth, where he could meditate on the course of events."}, {"tag": "p", "text": "Over the next century, Chamma lived in relative seclusion from the other inhabitants of H'ratth, constantly meditating on his fateful mission. Eventually, a Jedi Master from the world of Ossus arrived on H'ratth and was able to speak with Chamma and return him to the light. Following his redemption, Chamma returned to Ossus and continued his Jedi training for several more decades until he was granted the title of Jedi Master. As a Master, Chamma left Ossus to return to H'ratth where he intended to establish a Jedi academy to train future generations of Jedi Knights."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "Four centuries before the events of the Freedon Nadd Uprising, Chamma was a young and eager Jedi who had just passed the Trials of Knighthood. During this time a trade ship, which had been aligned with the Republic, had apparently encountered trouble in orbit around Athiss, the second planet of the Loro Babis system. The Jedi received an emergency message from the ship's distress beacon and decided to dispatch a team of Jedi Knights, which included Chamma, to investigate. Along with two other Jedi, Chamma traveled to Athiss aboard the Bastion, arriving at the system to find no sign of a ship in distress. However, Chamma observed a scattering of ionized debris, which was orbiting the planet in a swirling cloud. Nonetheless, Chamma was able to use the scanners aboard the Bastion to determine signs of life over a general area on the planet. Deciding to investigate the life readings, the three Jedi landed the Bastion in an open field of wild grass. Using the Force to locate the life-forms they had registered in space, Chamma and his companions followed the Force to the edge of a dark forest and concurred that the life signs were emanating from within."}, {"tag": "p", "text": "As the team moved further into the forest in pursuit of their quarry, Chamma and the others suddenly felt the life signs divide into three separate entities. After discussing it amongst themselves, the three Jedi decided that it would be best if they split up and each followed one of the life-forms."}, {"tag": "p", "text": "After following his quarry for a time, Chamma realized that Athiss's sun was setting, and found himself deep within the forest and surrounded by thick vegetation which effectively blocked natural light from above; he also noted the quality of the air around him, as it was permeated with a stagnant feeling which weighed down around him. Feeling the foreboding sense of the forest pressing on his Force awareness, and also realizing that he was no closer to the life-form then when he had started, Chamma began to wonder if he should head back to the Bastion. However, he slipped on his damp surroundings and fell headlong into a nearby pond. Chiding himself for his lack of focus, he began to pull himself out of the water when he suddenly felt a wave of warning wash over him. Spinning around without hesitation, Chamma ignited his lightsaber and immediately moved into a defensive position against his unknown assailant, who had its own lightsaber locked with Chamma's. Not yielding to the unknown force, Chamma attempted to see past the burning light of the clashing lightsabers to see his attacker's face. Despite his efforts, all Chamma was able to make out was an ink-black silhouette that showed an impressive stature and which radiated dark side energy. By this time, the initial shock of the enemy attack had worn off and Chamma was able to regain his focus and turn to the Force. However, as he tried to focus his strength in it, he felt an immense wave of darkness wash over him, which threw him back away from his attacker. As Chamma attempted to regain his composure, and while fighting to catch the air which had been knocked from his lungs, he realized that he could no longer feel the light side of the Force or draw strength from it. Chamma watched as a shadowy form appeared at his feet, holding an ignited lightsaber and trailing wisps of whatever the creature was made of—not fully comprehending what he was fighting against, Chamma believed that his adversary could have been nothing other than a spawn of the dark side."}, {"tag": "p", "text": "As the creature raised its lightsaber to attack, Chamma began to question everything that he had been taught about a relationship with the Force. He had an avalanche of thoughts pour through his mind regarding what had happened, and he realized that his anger was providing him the strength with which he could win the fight—he decided that if the light side had abandoned him, then he had no choice but to defeat his enemy without its aid."}, {"tag": "h4", "text": "Fall to the dark side"}, {"tag": "p", "text": "Using his anger to give him strength from the dark side, Chamma summoned his energy and avoided the downward strike of his attacker. Concentrating on his newfound power, Chamma leaped to his feet and began attacking the shadowy being. His adversary, however, easily countered his attacks, and Chamma realized that it was anticipating his movements through the Force—the being, Chamma believed, was vastly more powerful in the Force than he could ever be. As his attacks were parried and defended against, he began to think to himself that the only reason he was losing ground to the dark sider was because the light side had abandoned him in his struggle—he reasoned that if the power of the light had still been with him, then he would have at least had a chance against his superiorly gifted foe. Believing that all of his training up to this point, and all of the trials he had passed, had been misguided, he slowly began to give ground to his enemy. However, his enemy halted its attack and held its blade at its side as if taunting Chamma to attack; at that moment Chamma's emotions exploded, and he felt his anger augment his abilities with a strength he did not know that he possessed. Rushing forward at the dark sider, Chamma swung his lightsaber horizontally at his opponent's chest, and the creature moved to deflect the blow. Chamma, however, switched his lightsaber off right at the point that the two blades would have met, causing the dark sider to over-step his defense. He reignited his lightsaber, holding the hilt only inches away from the exposed front of the creature. Chamma watched as the violet glow of his blade exploded out the back of the dark side creature, and listened as it wailed a beastly and harsh cry which echoed off of the surrounding trees."}, {"tag": "p", "text": "At that moment, Chamma realized that the dark side creature was gone, and he was left wondering if he had imagined the entire fight. However, he soon found the creature's lightsaber laying several meters away and he realized that he had, indeed, defeated it. Chamma, though, felt immense guilt and confusion over the course of events which had transpired and which had caused him to call upon the dark side for help. Realizing what he had done, and not fully understanding why the light side had abandoned him during his time of need, Chamma decided that he would not return to the Order with his two companions. Instead, he decided it would be best if he went into a self-imposed exile in the barren deserts of H'ratth. There he completely turned his thoughts inward and meditated on the events which had taken place in the forests of Athiss, continuously struggling with what he had been taught."}, {"tag": "p", "text": "Slowly, over the next one hundred years, Chamma slipped into obscurity while living in the hills of H'ratth, and was content in the fact that the Jedi Order had apparently forgotten about him and his actions on Athiss."}, {"tag": "h4", "text": "Redemption"}, {"tag": "p", "text": "One day, Chamma entered the living area of his residence to find a stranger patiently waiting for him. The near-human's eyes were milky white and pupil-less, and seemed to stare straight through Chamma and into his heart. The stranger—who Chamma recognized as a Miralukan—advised the exiled Jedi that it was time he returned to the light. Chamma, expecting a fight, warned the Miralukan to not tell him what he should do and advised the stranger to leave; which he did. However, he returned the following day, and the day after that, until Chamma agreed to listen to what he had come to say. The Jedi identified himself as Master Noab Hulis, and proceeded to tell Chamma about a time long ago, when a young and enthusiastic Jedi had encountered a Sith devotee that had managed to master the ways of the Sith as well as the dark side."}, {"tag": "p", "text": "The Sith also had two companions, and the three of them had escaped to a relatively remote world during the collapse of the Sith Empire; over time they grew even stronger in their Sith knowledge of old, and devised a plan to lure several young Jedi to them in hopes of creating a new order of Sith followers. In response to their trap, which revolved around a ship's distress signal, a team of three young Jedi arrived to investigate but soon found themselves lacking the experience required to confront such powerful beings."}, {"tag": "p", "text": "Chamma continued to listen to Master Hulis's story, but the facts of the story began to push on his antiquated memories—Chamma realized that the story was actually describing him and his fellow Jedi during their mission to Athiss a hundred years earlier. Realizing that while he had masked his exile behind meditation, he had actually been spending the last century trying to forget the events of that night, Chamma continued to listen as Hulis described how the three Sith had separated the trio of Jedi and assaulted each with strong waves of dark side energy. These attacks had momentarily cut the Jedi off from the Force and allowed fear, hatred, and anger to overcome their minds. However, at the moment that the three Sith were preparing to break the Jedi and transform them into something dark, the youngest of the three Jedi managed to defeat his attacker. The loss of their comrade caused the remaining two Sith to retreat, fearing that they had misinterpreted the power of the Jedi."}, {"tag": "p", "text": "Chamma was dumbfounded by the revelation that it had not been the Force that had betrayed him, but simply the use of the Sith arts against him. Finally understanding that his own fear and anger had kept him from reconnecting to the light side that night, Chamma broke down into tears of vindication and realization. Following this revelation, Chamma agreed to accompany Master Hulis back to Ossus, where he committed himself to continuing his training in the Jedi ways for several more decades."}, {"tag": "p", "text": "Eventually, Chamma was granted the rank of Jedi Master and left Ossus to once again take up residence on the world of H'ratth, where he wanted to be constantly reminded of his past failings. However, this time Chamma chose to found an academy where he could train young Jedi in the ways of the Force, and prepare them for the trials they would one day face. One of his brightest apprentices would be a young Jedi by the name of Andur who was the grandson of Jev Sunrider, a long time friend of Chamma's."}, {"tag": "h3", "text": "Jedi Master"}, {"tag": "p", "text": "In the year 4001 BBY, Chamma extended an invitation to the young Jedi Andur Sunrider to train under him as his apprentice at his academy on H'ratth. When Andur was a young boy, his grandfather, the Jedi Master Jev Sunrider, had traveled to the planet of Krayiss Two to confront a growing darkness there—however, he did not survive the mission. After this Andur harbored a deep-seated desire to one day fight the dark powers which had killed his grandfather. As a result, Andur delved deeper, and with much more dedication, into expanding his understanding of the Jedi Way. It was this dedication which initially attracted the attention of Chamma, and Andur eagerly accepted the invitation to train. Along with his wife Nomi and their protocol droid A-3DO, Andur traveled to Chamma's academy to further his Jedi training."}, {"tag": "p", "text": "Feeling that Andur had so far neglected certain aspects of his Jedi training, Chamma chose to instruct him in the nature of the Force, teaching him meditation techniques and advanced Force concentration methods. Likewise, Chamma realized that Andur lacked the very foundation and basic understanding of the power which he wished to possess. As a result, Chamma focused on strengthening the foundation in history which Andur already possessed by using examples from the Jedi Order's colored past to illustrate points to his young apprentice. Andur understood the reasoning behind Chamma's lessons, and he worked hard to excel at everything which his master taught him. Chamma's knowledge of the Force, combined with Andur's deep dedication to his master's teachings, allowed Andur to quickly succeed in his studies. Chamma, who realized that Andur was eventually going to require a master who possessed a much deeper knowledge of the Force, gave Andur several Adegan crystals to give to Master Thon, who had agreed to take the young man on as his apprentice. At first, Andur was not happy with Chamma's decision for him to continue his training under Thon. Andur argued that he had learned everything he needed to in order to become a Jedi, and that he was now ready to join the ranks of the Jedi Knights. Chamma, however, recognized that Andur still held a deeply rooted desire to hunt down and destroy the dark powers which had murdered his grandfather; his apprentice's selfish argument only confirmed his belief that Andur required more training. Andur, though, believed his master to have been mistaken."}, {"tag": "p", "text": "The evening before Andur was to leave for Ambria, Chamma requested that the two meet for mediation at The Crag, which was a ridged pinnacle of rock which overlooked the extensive landscape of H'ratth. Chamma stood at the top of the pinnacle and could sense as Andur approached from behind. As Chamma and Andur stood looking over the forests below, Andur suddenly had a powerful vision in which he foresaw his eventual death and the eventual elevation of both his wife and daughter to greatness. Waking from the vision, Andur saw that Chamma was no longer beside him and that the sun had long set below the horizon. Finally comprehending the wisdom which Chamma had been trying to impart on him, Andur understood that he was still a long way from understanding the Force and accepted his master's decision for him to train with Thon."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Chamma's consciousness was one of three added to the Noetikon of Secrets, a Jedi artifact that contained dangerous knowledge that could bring one to the dark side. Chamma and two other Jedi who had touched the dark side, Jesper Altax and Bastila Shan, served as the gatekeepers of the Noetikon. During the Cold War, the Noetikon was found and used by a Jedi Consular who sought to heal Jedi Master Yuon Par of a strange illness, and the gatekeepers recognized her illness as the one created by the Sith Terrak Morrhage many years before. Chamma and the others sent the Consular to the Jedi Temple where, along with the gatekeepers of the other two Noetikons, they taught the Consular the shielding technique used to block Morrhage's plague."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In Chamma's younger years, he had been an extremely eager being who had allowed his enthusiasm and excitement to overflow into his first mission as a Jedi Knight. While investigating a ship's distress call on the planet Athiss, Chamma and his fellow Jedi were confronted by a trio of immensely powerful Sith followers. Upon being attacked by one of the Sith, Chamma let his enthusiasm be replaced by fear as his connection with the light side of the Force was stripped from him by the Sith. Being eager in his pursuit of the Sith caused him to miss the subtle signs of the situation which he found himself in—instead of realizing and understanding that his own emotions were withholding him from reconnecting with the light side, he refused to gain perspective on the situation and allowed himself to be fooled into thinking that the Force had forsaken him. It was not until over a century later, during a self-imposed exile, that he was made aware of the Sith magic which had been used against him, and this allowed him to gain closure over the events of the dark encounter."}, {"tag": "p", "text": "Due to the events which had transpired on Athiss, Chamma felt immense guilt over his loss of control and what he perceived as abandonment by the light side when he had required it. Even though he firmly believed that the light side of the Force had betrayed him, his personality and values did not allow him to fully embrace his anger, which had caused him to give into the dark side—somewhere deep within himself, two sides warred with each other as to what had exactly happened to him during his mission and, as a result, he went into a self-imposed exile on H'ratth to meditate on the situation. Eventually becoming complacent in his exile over the course of a century, Chamma allowed himself to neglect his mediation and his pursuit of answers, and instead chose to attempt to forget his fall and the accompanying feelings it had fostered. However, with the help and wisdom of a fellow Jedi who had sought him out in his exile, Chamma was able to eventually understand and comprehend what had transpired over a century earlier."}, {"tag": "p", "text": "Returning to the Jedi Order, and with his new understanding of the Force, Chamma resumed his Jedi training and pursued an even greater depth of knowledge over the following decades. With his enhanced wisdom and maturity in the Force, Chamma allowed the Force to guide him into establishing a Jedi academy through which he could potentially help future generations of Jedi."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a young Jedi, Chamma demonstrated a natural skill with the lightsaber. His battle with a Sith devotee in the forests of Athiss allowed him the opportunity to put his skills in action; even though the Sith creature was far more knowledgeable in the application of Force techniques, Chamma was able to eventually defeat his adversary by employing Tràkata, a deceptive lightsaber technique."}, {"tag": "p", "text": "Although Chamma was initially lacking in his understanding of the finer points of the Force, he was able to remedy that by returning to Ossus from his self-imposed exile and continuing his Jedi training for several decades. Those decades of intense study allowed Chamma to grow into a deeper understanding of the Force, and his studies continuously showed him the errors of his past ways. As his wisdom and experiences grew, Chamma decided that his knowledge and newfound abilities would best be used in teaching others."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Tom Veitch first introduced the character of Chamma in the sub-series The Saga of Nomi Sunrider of the comic series Tales of the Jedi. Although Chamma was only mentioned briefly within the first two comics of The Saga of Nomi Sunrider, author George R. Strayton expanded upon the character for the West End Games source book Tales of the Jedi Companion, in which he explained the backstory of Chamma as well as his tutelage of Andur Sunrider."}, {"tag": "p", "text": "In the Tales of the Jedi Companion, it is incorrectly stated near the end of Chamma's entry that his life-changing battle with the Sith took place on H'ratth, when in fact it actually took place on the planet of Athiss in the Loro Babis system. At the beginning of his entry it says, \"…had emitted an emergency message asking for assistance on Athiss, the second planet of the Loro Babis system, and the Jedi had accepted the charge of providing help to the endangered vessel.\"—meaning that Chamma and his companions encountered the Sith on Athiss, not on H'ratth."}, {"tag": "p", "text": "In Knights of the Old Republic 33 flashbacks show the Jedi Master Arca Jeth along with a Miralukan Jedi who is later identified as Noab Hulis. Following the release of Vindication, Part 2 Knights of the Old Republic author John Jackson Miller would mention Chamma on his personal website in his production notes for Vindication, Part 2 explaining that Chamma's master, Noab Hulis, was depicted thus creating another link between the characters of Tales of the Jedi and those of Knights of the Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}