{"url": "Champion_(Bothan_Assault_Cruiser)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bothan Assault Cruisers", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Champion (Bothan Assault Cruiser)"}, {"tag": "p", "text": "Champion, also referred to as Champ, was a New Republic Bothan Assault Cruiser that operated during the Yuuzhan Vong War. Champion was under the command of Brevet Admiral Glie'oleg Kru in 26 ABY, when the 850-meter-long cruiser protected a convoy of refugee starships fleeing the doomed planet Kalarba as it came under attack from the Yuuzhan Vong species. During the space battle in the Kalarba system, the Yuuzhan Vong used a gravity-manipulating dovin basal to send Hosk Station, a space station orbiting Kalarba, on a collision course with the planet. After the embattled Champion lost its deflector shields, the Bothan Assault Cruiser exploded due to the damage that it had sustained, and the resulting detonation caught some New Republic starfighters and their pilots within the blast."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Champion was a 850-meter-long Bothan Assault Cruiser produced by the Bothawui Shipyards. The glossy-hulled cruiser possessed a deflector shield generator, multiple starfighter hangar bays on the starboard side, and a propulsion section containing drive nacelles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Operational during the Yuuzhan Vong War, when the extra-galactic Yuuzhan Vong species invaded the galaxy, Champion was utilized by the New Republic in its defense efforts during the war. Sometimes referred to as Champ by starfighter pilots, Champion was commanded by Brevet Admiral Glie'oleg Kru in 26 ABY, when the Bothan Assault Cruiser covered the retreat of refugee starships that fled from the planet Kalarba. The Yuuzhan Vong had placed a gravity-manipulating dovin basal on the surface of Kalarba, pulling the space station Hosk Station out of orbit around Kalarba and sending it crashing into the world. While the pilots of Rogue Squadron and other squadrons engaged the enemy coral skippers that were swarming Champion and targeting sections like the cruiser's drive nacelles, the Bothan Assault Cruiser was attacked by a newly-arrived Yuuzhan Vong capital ship that was slightly smaller than a Star Destroyer."}, {"tag": "p", "text": "To make matters worse, the Yuuzhan Vong forces stripped Champion of its deflector shields, and the plasma fired at the cruiser from the enemy capital ship soon caused Champion's engines to explode. The interior explosion caused cracks on the exterior of the ship through which light shone, and the Bothan Assault Cruiser then exploded entirely. The resulting blast engulfed some members of Rogue Squadron, with Jedi pilot Jaina Solo sustaining serious magnetic field exposure after she was ejected from her crippled X-wing starfighter, leaving her temporarily blind."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Bothan Assault Cruiser was commanded by the Twi'lek Brevet Admiral Glie'oleg Kru, who was new to the post in 26 ABY. He was killed when Champion exploded."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Champion first appeared in The New Jedi Order novel Balance Point, which was written by Kathy Tyers and released in 2000. The Bothan Assault Cruiser later received an entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}