{"url": "Chancellor", "categories": ["Category:Canon articles", "Category:Chancellors", "Category:Political titles"], "nodes": [{"tag": "h1", "text": "Chancellor"}, {"tag": "p", "text": "Chancellor was a political position in different governments in which the individual was tasked with representing or leading the government. There were different chancellery positions that were similar however, such as the Supreme Chancellor of the Galactic Republic, Chancellor of the Alliance to Restore the Republic, and the Chancellor of the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The position of chancellor was given to an individual to lead or represent a government or parts of a government. Similar chancellery positions existed, such as the Supreme Chancellor who was the supreme executive of the Galactic Republic. Later, there also existed the Chancellor of the Alliance to Restore the Republic which served as Chief of State and later the Chancellor of the New Republic who had little power and was not considered an executive."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Contispex I was an individual that served as a Chancellor and died by the year 10 BBY as their ashes were held in an ark on the First Light, the personal star yacht of Crimson Dawn crime lord Dryden Vos."}, {"tag": "p", "text": "Chamberlain Jooli of the Kingdom of Shu-Torun held the position of chancellor for approximately four decades until the death of the King of Shu-Torun in the year 0 ABY. Retaining the chancellery under Queen Trios, the late king's sole-surviving heir, Jooli became an advisor to the new monarch during the civil war between the royalty and the rebellious ore-dukes led by Duke Rubix. Prior to the final battle of the war, Jooli attempted to countermand Trios' decision to attack Rubix's delving citadel without the Galactic Empire's military support, asserting his authority to do so by using the traditional advisory veto of his position. Trios reacted by accusing him of treason and consequently ordered her loyalist soldiers to execute the chancellor."}, {"tag": "p", "text": "After the Battle of Endor during the Galactic Civil War, Asera served as the chancellor of Rekkana, but was subjugated by the Galactic Empire. Rekkana was eventually liberated by the New Republic. During the war between the First Order and the Resistance, the planetary government of Ryloth was led by Chancellor Drelomon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}