{"url": "Chancellor%27s_Service_Medal", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Galactic Republic awards"], "nodes": [{"tag": "h1", "text": "Chancellor's Service Medal"}, {"tag": "p", "text": "The Chancellor's Service Medal was a prestigious medal awarded by the Galactic Republic for impressive feats in war. General Elin Garza received the Chancellor's Service Medal for her actions during the Great Galactic War against the resurgent Sith Empire. Millennia later, during the Clone Wars, Clone Captain ARC-77—nicknamed Fordo—received the medal for his role in the Battle of Hypori in 22 BBY. However, Fordo refused the honor, instead having the Chancellor's Service Medal posthumously awarded to clone trooper CT-43/002, who had died in the Battle of Muunilinst of that same year."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Chancellor's Service Medal was a prestigious medal given out by the Galactic Republic for extraordinary exploits and service in war. The Chancellor's Service Medal could be refused, transferred, or posthumously awarded."}, {"tag": "h2", "text": "Recipients"}, {"tag": "h3", "text": "ARC-77"}, {"tag": "p", "text": "One of the many clones of the bounty hunter Jango Fett, ARC-77, nicknamed Fordo, was an Advanced Recon Commando and clone captain in the Grand Army of the Republic during the Clone Wars against the Confederacy of Independent Systems. In 22 BBY, during the Battle of Muunilinst, Fordo led an elite squad of clone troopers called The Muunilinst 10 behind enemy lines to destroy a Confederate artillery emplacement. Although The Muunilinst 10 was successful, and the Republic victorious, one of Fordo's squadmates, CT-43/002, was killed in battle."}, {"tag": "p", "text": "Right after the battle, Fordo and The Muunilinst 10 were sent to the Confederate planet Hypori to rescue a group of Jedi that had been stranded there during the Battle of Hypori. During the rescue operation, Fordo and his squad had to fight off Confederate General Grievous, a deadly cyborg trained in lightsaber combat. Although The Muunilinst 10 took several casualties, Fordo and his men managed to rescue three Jedi and escape Hypori. For his actions and leadership at Hypori, Fordo was awarded the Chancellor's Service Medal. However, Fordo refused the prestigious honor, instead transferring the award posthumously to CT-43/002. Following Hypori, Fordo continued to serve in the Grand Army, and he participated in the defense of the Republic capital of Coruscant when it was invaded by the Confederacy in 19 BBY."}, {"tag": "h3", "text": "CT-43/002"}, {"tag": "p", "text": "Another clone Jango Fett, CT-43/002 was a clone trooper in the Grand Army of the Republic during the Clone Wars and a member of the elite squad known as The Muunilinst 10, under the command of Captain Fordo. In 22 BBY, CT-43/002 and The Muunilinst 10 were dispatched to the Confederate world of Muunilinst to take out an enemy artillery emplacement during the Battle of Muunilinst. However, the LAAT/i gunship carrying The Muunilinst 10 was hit by a Confederate missile as it approached the artillery emplacement, forcing the vessel to crash-land behind enemy lines. Soon after The Muunilinst 10 landed, the squad was ambushed by Confederate battle droid assassins, and CT-43/002 was cut down by enemy blaster fire. Later that year, Fordo received the Chancellor's Service Medal for his exploits at the Battle of Hypori. However, Fordo rejected the medal, instead transferring his Chancellor's Service Medal posthumously to CT-43/002 for his sacrifice at Muunilinst."}, {"tag": "h3", "text": "Elin Garza"}, {"tag": "p", "text": "A Human female from Coruscant, Elin Garza served as a general in the Republic Military during the Great Galactic War against the resurgent Sith Empire. Garza was a tactical genius and performed with distinction in the war, helping with the foundation of the Republic's Special Forces division. However, despite Garza's efforts, the Republic lost the war following the Sacking of Coruscant and the Treaty of Coruscant in 3653 BBY, with an uneasy peace forming between the Republic and Sith Empire afterward. For her deeds during her career, Garza was given the Chancellor's Service Medal, as well as several other awards and citations. In the resulting Cold War after the Treaty of Coruscant, General Garza became a controversial political figure, developing into a rival of Republic Supreme Chancellor Dorian Janarus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Chancellor's Service Medal was first mentioned in the reference article Guide to the Grand Army of the Republic, written by Karen Traviss and Ryan Kaufman, and released in Star Wars Insider 84 in 2005. According to the conversation files of Star Wars: The Old Republic, a massively multiplayer online role-playing video game, Chancellor Leontyne Saresh originally was to award the Chancellor's Service Medal to players at the end of the Trooper storyline, but it was changed to the Cross of Glory instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}