{"url": "Chancellor%27s_Suite", "categories": ["Category:Legends articles", "Category:Coruscant rooms", "Category:Imperial Palace locations", "Category:Offices", "Category:Republic Executive Building locations"], "nodes": [{"tag": "h1", "text": "Chancellor's Suite"}, {"tag": "p", "text": "The Chancellor's Suite was the suite of offices, meeting rooms and private chambers used by the Supreme Chancellor of the Galactic Republic. The Chancellor's Suite was located in the Republic Executive Building, over 500 meters above the surface of Coruscant. The Chancellor's office, also called the Executive Office, was the formal office of the Supreme Chancellor that served as the heart of these rooms. The room was created during the last days of the Republic, under the command of the final Supreme Chancellor, Palpatine, thus breaking from tradition of the Chancellor's office being at the Presidential Palace."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Chancellor's suite was constructed along with the Executive Building following the Battle of Naboo, during Palpatine's tenure as the Republic's Supreme Executive. Comprising a number of circular rooms arrayed around the Chancellor's main formal office, the style of the office was reminiscent of Palpatine's Senatorial apartments; with Sith-inspired red walls and the bronzium statues of ancient philosophers (in particular the Four Sages of Dwartii) and deities arranged around the room. It also included the Sith Chalice as well as a bas-relief recovered from the excavation of a Massassi territory on Yavin 4, depicting a battle between Jedi and Sith during the Great Hyperspace War. The Jedi believed Palpatine had hung the relief in his office as a sign for reverence to their Order. Instead, Palpatine kept it to focus on his true goal: the destruction of the Jedi Order, and the rise of the Sith."}, {"tag": "p", "text": "His office also was home to other various Sith objects and sculptures, but their significance was seemingly unknown to the Jedi. One statue, in fact, embedded Palpatine's Sith lightsaber which he planned on igniting and releasing from the stone when he thought the time was right. When he revealed his Sith title to Jedi Anakin Skywalker, the Jedi told Jedi Master Windu as the latter was preparing to depart to inform Palpatine of Grievous' death. Master Windu, on his turn, rallied Masters Agen Kolar, Saesee Tiin and Kit Fisto. Palpatine sensed their approach, and used the Force to ignite his lightsaber, melting the statue. A vicious duel ensued, with all the Masters dying at the hand of Darth Sidious. Master Windu was killed by Darth Sidious only after the latter was saved by Anakin, who stopped Windu because he believed Sidious had the power to save his wife."}, {"tag": "p", "text": "The office was accessed via a reception area staffed by Dar Wac, and guarded by two Red Guards. Palpatine's desk and Chair of Office faced the entrance from the opposite wall, most of which was taken up by a panoramic transparisteel window. This window offered an impressive view across Galactic City, reminding the occupants of the office that the matters discussed there would have far-reaching consequences."}, {"tag": "h2", "text": "Sections of Palpatine's Office"}, {"tag": "h3", "text": "Entry Hallway (Public Use)"}, {"tag": "p", "text": "As visitors reached the level upon which the Chancellor arrived, they entered a formal reception area where there were benches for long waits. The receptionist desk was equipped with a comm-system directly connected to the Chancellor's desk.\nAn express turbo-lift ran adjacent to the room and those who where influential enough to use it were deposited into a security airlock for inspection, before passing into the reception area."}, {"tag": "h3", "text": "Ceremonial Office for Official Meetings (Public Use)"}, {"tag": "p", "text": "The ceremonial office was accessed from a pair of blast-proof doors situated behind the receptionist's desk. Visitors then passed through a short passage which opened into a large circular room. At the top of a set of stairs, the Chancellor's official desk, equipped with data feeds from his private office and his holding office beneath the Grand Convocation Chamber where displayed in front of a panoramic view of Galactic City."}, {"tag": "p", "text": "The Chancellor's Chair of Office, made of ultra-dense lanthanide alloy and armed with a defensive shield and direct communications to Palpatine's aides and Red Guards, faced four padded single chairs for visitor's; arranged in a semi-circle, and a large holoprojector rose from between two sets of steps leading up to the desk. Decorating the red-hued room is two of four Bronzium statues of the Four Sages of Dwartii; the other two situated in the adjacent hall. A secret escape lift is concealed to the left of the official entrance; while to the right lays the hidden door to the Chancellor's private quarters."}, {"tag": "h3", "text": "Anteroom (Public Use)"}, {"tag": "p", "text": "Leading off the main office was a small anteroom leading to the Chancellor's private office. Used for smaller meetings a bas-relief depicting the Great Hyperspace War excavated from a Massassi site on Yavin 4 and a Sith Chalice decorated the room. The statue of Sistros, concealing Palpatine's lightsaber flanked the door to the private room."}, {"tag": "h3", "text": "Private Office (Private Use)"}, {"tag": "p", "text": "Palpatine's private office was smaller than his main one and it had a metallic and black color scheme with three large black rotating chairs, a supercomputer and two black vases. The walls seemed to be made from some kind of metal and were engraved with continuous patterns."}, {"tag": "p", "text": "Double-glazed transparisteel panoramic window backed the sunken area used by the Chancellor for his private work. Via a large red projection screen, he could track the progress of the Clone Wars through his Clone Intelligence units, as well as obtain data from his databanks in the ChanPal SuRecon Center and his agents spread across the galaxy. The data contained within utilized a special script."}, {"tag": "h3", "text": "Chancellor's Archives (Private Use)"}, {"tag": "p", "text": "Behind the bas-relief of the Great Hyperspace War were the Chancellor's private archives. Stored in the racks above the reflective floor were files on former Chancellors and records of amendments and various notes on legal documents; all stored on holodiscs."}, {"tag": "h3", "text": "Chancellor's Bedroom (Private Use)"}, {"tag": "p", "text": "Beyond the Chancellor' main office lay his personal quarters. Equipped with an Alderaanian relaxa-bed, designed to massage and provide sleep-inducing harmonics, the bed allowed the Chancellor to sleep a few hours yet feel the equivalent of a full nights rest. The room also included a private refresher along with a shower. An expansive wardrobe also existed to keep his great collection of gowns and formal wear."}, {"tag": "h3", "text": "Working Office for Red Guards (Private Use)"}, {"tag": "p", "text": "Linked to both the main office and the bedroom; a room specialized for security was staffed by the Red Guard. Three chairs and various monitors and consoles were used to monitor security systems at all hours of the day and night."}, {"tag": "h3", "text": "Storage closet (Private Use)"}, {"tag": "p", "text": "The suite also featured a private storage closet, where diplomatic gifts offered to the Chancellor were contained on shelves. A Malastarian trinket of value that had been recovered on Ord Mantell at the cost of an entire clone commando squad, was stored there. Palpatine's aide Mas Amedda was tasked with tending to the closet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}