{"url": "Chancellor_Fillorean", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Yachts"], "nodes": [{"tag": "h1", "text": "Chancellor Fillorean"}, {"tag": "p", "text": "The Chancellor Fillorean was a luxury yacht that was commissioned out of Coruscant, and flown as a cruise ship through the Core Worlds. Featuring multiple decks, a silver, swept hull design, it catered to the galaxy's significantly wealthy. The Fillorean embarked on its final voyage in the year 3963 BBY, when it mysteriously went missing for several weeks in the Core's stellar nurseries. Jedi Zayne Carrick and the crew of the Hot Prospect happened upon the Fillorean adrift, and boarded to find only a droid and its Bimm owner, Toki Tollivar. They discovered that Tollivar had murdered all the Fillorean's passengers, and before he could kill Hot Prospect's crew the same way, Rohlan Dyre shot him. He was the final passenger to die on the Fillorean."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The ship was named after Supreme Chancellor Fillorean,[source?] who brokered the peace deal between the Duinuogwuin and the Galactic Republic in 15,500 BBY. With a sweeping hull design that tapered in the rear, the Fillorean was shiny metallic starship. It bore a yellow half sun on its bow, and was powered by twin aft engines."}, {"tag": "p", "text": "The Fillorean sported a luxurious interior, with full pamperings for thirty passengers, plus the ship's crew."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After serving faithfully for some time as a cruise ship offering tours and transport throughout the Core Worlds, the Chancellor Fillorean mysteriously vanished while carrying thirty wealthy passengers. Since it was unusual for a ship to get lost in the well known space-lanes of the Core Worlds, many assumed that the disappearance was caused by pirates or some disaster."}, {"tag": "p", "text": "After going missing for several weeks, Zayne Carrick and the crew of the Hot Prospect were able to find the ship in a stellar nursery. Any signals from the ship were blocked by the nebula's interference. Slyssk picked the airlock and the crew entered the ship to discover that, although the ship still had air, the entire crew and passengers had seemingly died of asphyxiation. Upon searching the ship, they found a lone survivor, Toki Tollivar and his droid, K-OB7. Tollivar claimed that he had hid in his room after the first deaths had started but had no knowledge of what happened."}, {"tag": "p", "text": "While the rest of the Hot Prospect crew were busy clearing bodies, Slyssk went to the kitchen to prepare food. Zayne, alerted by the Force, discovered Slyssk suffocating just as the others had. Zayne, Jarael and Rohlan Dyre performed an emergency tracheotomy to save his life.\nAt first, Zayne accused K-OB7 as the culprit, but then realized that he judged Tollivar incapable of the atrocities based on his small stature. When Zayne confronted Tollivar, he confirmed that he was a Sith Acolyte. On the main deck of the Chancellor Fillorean, they dueled. After Toki Tollivar was defeated, the Hot Prospect crew informed Republic authorities of the ship's whereabouts and condition."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}