{"url": "Chancellor_(New_Republic)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:New Republic chancellors", "Category:Political titles"], "nodes": [{"tag": "h1", "text": "Chancellor  (New Republic)"}, {"tag": "p", "text": "Chancellor, originally referred to as Supreme Chancellor, was the title given to the leader of the Galactic Senate of the New Republic. Mon Mothma of Chandrila was the first individual to hold the title following the formation of the New Republic. Though the office had little power, Mothma's term allowed her to forge a broad political consensus about the future of the Republic that allowed a stable government to come to power. After her term ended, however, differing views emerged in the form of political factions, the Centrists and the Populists, who disagreed on the extent to which the Republic should have had strong centralized power. A new and more powerful executive office, First Senator, was proposed to replace the office of the chancellor, but the debate in the Senate ended with no consensus."}, {"tag": "p", "text": "Thirty years after the formation of the Republic, during the conflict between the First Order and the Resistance, Lanever Villecham served as the New Republic's chancellor until his death during the destruction of the Hosnian system, with the First Order invasion of the galaxy soon realized."}, {"tag": "h2", "text": "Powers"}, {"tag": "p", "text": "The powers of the Chancellor of the New Republic were derived from the charter of the Chancellor, and they were granted after the formation of the New Republic and the establishment of a new Galactic Senate on Chandrila. The first New Republic chancellor, Mon Mothma, was given the emergency powers that were once granted to Supreme Chancellor Sheev Palpatine of the Galactic Republic during the Clone Wars. Mothma, who spent the duration of the Clone Wars arguing against the increased powers of the chancellor, intended to eliminate the emergency powers from her position. Though the powers granted her the authority to send New Republic forces to fight and die wherever she chose, she did not want such a responsibility and felt that it was a poison to democracy. Instead, she submitted to the will of the Senate, even in military matters such as the disarmament of the New Republic Defense Fleet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "The origins of the New Republic chancellery came from the Galactic Republic, where the Supreme Chancellor served as the leader of the Galactic Senate and the Republic itself. During the Clone Wars, Supreme Chancellor Palpatine amassed more and more executive powers until, at the end of the war, he had enough power to transform the Republic into the Galactic Empire and declare himself sovereign ruler of the galaxy. The position of Chancellor continued into Alliance to Restore the Republic, where Mon Mothma was given the title of chancellor while serving as the Alliance's political leader."}, {"tag": "h3", "text": "Mon Mothma"}, {"tag": "p", "text": "After the death of Emperor Palpatine during the Battle of Endor, the Alliance formed the New Republic. A new Galactic Senate was established on Mothma's homeworld of Chandrila, and Mothma was elected as the first Chancellor of the New Republic. The original title of the New Republic head of state was Supreme Chancellor. In time, however, the word \"Supreme\" was removed from the title. She focused her tenure on eliminating the emergency powers granted to her by the chancellery's charter, as well as proposing a large-scale military disarmament to occur once the Galactic Civil War between the Republic and the Empire came to an end. The end of the war and the signing of the Galactic Concordance, the peace treaty with the Empire, saw the achievement of that proposal through the Military Disarmament Act. Further reforms carried out by Chancellor Mothma included the rotation of the Senate's capital amongst member worlds. That decision, as well as the decision to not headquarter the Senate on the former galactic capital world of Coruscant, did much to convince star systems that the New Republic would be different from its predecessor governments."}, {"tag": "p", "text": "Though the office of the chancellor had little central authority, Chancellor Mothma was credited with forging a political consensus during her term in office that allowed the New Republic to establish itself as a lasting power. After her term in office ended, however, her successors failed to create that same political consensus, a consensus that Senator Leia Organa credited to her charisma as a leader. Twenty-four years after the Battle of Endor, two political factions—the Centrists and the Populists—had emerged with divergent views on the role of the central government and the power of the executive. Lady Carise Sindian, a Centrist, eventually proposed the abolition of the office of the chancellor and a redrafting of the Republic's constitution to create a new position: First Senator, which she proposed would have strong authority over economics and the military. A fierce debate emerged amongst those who favored a strong central authority and those who worried that a position like First Senator would lead to the rise of another emperor."}, {"tag": "p", "text": "Senator Organa became a leading candidate for the role of First Senator, despite her reservations about the creation of the office. Her candidacy was derailed, however, after it was revealed by her political enemies, including Senator Ransolm Casterfo and Lady Carise, that she was the daughter of the late Sith Lord Darth Vader. Senator Tai-Lin Garr replaced her as the populist candidate, but Garr was soon assassinated. The vote to abolish the role of chancellor and replace it with First Senator was tabled soon thereafter."}, {"tag": "h3", "text": "Lanever Villecham"}, {"tag": "p", "text": "Twenty-nine years after the Battle of Endor, the office of chancellor was still active and Senator Lanever Villecham of the Tarsunt system was elected to the post. He pursued improved trade relations with the neutral worlds of the Trans-Hydian Borderlands, and he disagreed with Organa—who had become the leader of the Resistance—that the First Order represented a threat or a violation of the Galactic Concordance. Organa, who formed the Resistance to combat the First Order when the Republic refused to intervene, was ultimately proven right when the First Order used its superweapon, Starkiller Base, to target the Republic. It destroyed the Republic's capital world of Hosnian Prime, killing Chancellor Villecham and the rest of the planet's population."}, {"tag": "h2", "text": "List of chancellors"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The position of chancellor of the New Republic first appeared in the 2015 novel Aftermath, written by Chuck Wendig. In the Expanded Universe of books, comics, and games, which has since become the non-canon Star Wars Legends brand, the leader of the New Republic was known as the Chief of State. Like in canon, Legends stories also depicted Mon Mothma as the first leader of the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}