{"url": "ASN-121", "categories": ["Category:Canon articles", "Category:ASN courier droids", "Category:Assassin droids"], "nodes": [{"tag": "h1", "text": "ASN-121"}, {"tag": "p", "text": "ASN-121 was a modified ASN courier droid used as an assassin droid by the Clawdite bounty hunter Zam Wesell. Shortly before the start of the Clone Wars, the droid was used in an assassination attempt on the life of Naboo Senator Padmé Amidala, though it failed at its task and was ultimately destroyed by Zam when Jedi Knight Obi-Wan Kenobi attempted to use it to reach her."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At the height of the Separatist Crisis in 22 BBY, Mandalorian bounty hunter Jango Fett and his partner, Zam Wesell, were employed by Confederate Head of State Count Dooku to assassinate Senator Padmé Amidala in order to sway her rival, Trade Federation Viceroy Nute Gunray to his cause. After failing to kill her by detonating her starship on Coruscant, Fett met up with Wesell at night to supply her a tube containing two venomous kouhuns as a more discreet manner of eliminating their target."}, {"tag": "p", "text": "Zam inserted the kouhun-containing tube into ASN-121's delivery apparatus, after which it immediately flew off to complete its task. Upon reaching the bedroom of the sleeping Amidala's apartment, the droid burned a small circular hole in the window through which to dispense the kouhuns. Avoiding detection by Amidala's astromech, R2-D2, the creatures nearly succeeded in killing the senator until they were sensed and quickly killed by Jedi Padawan Anakin Skywalker. Upon the kouhuns' deaths, ASN-121 attempted to retreat, but was tackled by Jedi Knight Obi-Wan Kenobi launching himself at it through through the window."}, {"tag": "p", "text": "The droid, with Kenobi clinging to it, hastily returned to Wesell, trying and failing to dislodge the Jedi on the way by smashing him into a building wall. Upon nearing the bounty hunter's location, ASN-121 was targeted by Zam using the advanced scope of her KiSteer 1284 projectile rifle for several seconds before finally being locked onto and destroyed in a single shot, sending Kenobi plummeting through the Coruscanti traffic."}, {"tag": "p", "text": "Shortly after its destruction, ASN-121's owner and destroyer, Zam, was killed by Jango to prevent her from divulging his identity to Kenobi and Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}