{"url": "Chandrila_Skies", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Alliance starships", "Category:Shuttles", "Category:Uulshos Manufacturing products"], "nodes": [{"tag": "h1", "text": "Chandrila Skies"}, {"tag": "p", "text": "Chandrila Skies was a space-capable light assault vehicle produced by Uulshos Manufacturing that was part of the Galactic Alliance Second Fleet by 40 ABY. Attached to the battle carrier Dodonna, the shuttle took part in the Galactic Alliance's Operation Roundabout against the planet Corellia that year and was guarded by the Jedi-composed Hardpoint Squadron as it attempted to extract the Jedi of Team Tauntaun and Team Purella from Corellia. However, Chandrila Skies took a direct hit by Corellian flak while attempting to reach the surface and was destroyed, making it one of the first casualties of the Second Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Produced by Uulshos Manufacturing, Chandrila Skies was a modified light assault vehicle that was capable of space flight. Measuring slightly longer than an XJ6 X-wing starfighter in length, Chandrila Skies possessed a horizontal wedge-shaped prow, and its broad armored fuselage allowed it the room to transport approximately a dozen passengers in addition to its crew of two. It was slower in flight than a starfighter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Named after the agriworld of Chandrila, Chandrila Skies served as a shuttle in the Galactic Alliance Second Fleet by 40 ABY, at a time when the Corellian system was challenging the Galactic Alliance for greater independence. In order to keep the planet Corellia in line, the Galactic Alliance conducted Operation Roundabout as a show of force, deploying parts of the Second Fleet in Corellian orbital space while four Jedi commando teams pursued various objectives on Corellia and the nearby superweapon Centerpoint Station. Chandrila Skies was part of Team Womp Rat, which included the ten Jedi-piloted XJ6 X-wing starfighters of Hardpoint Squadron led by Grand Master Luke Skywalker. Their group was tasked with extracting the Jedi of Teams Tauntaun and Purella from Corellia, with Hardpoint Squadron on hand as a guard."}, {"tag": "p", "text": "After the Galactic-class battle carrier Dodonna decanted from hyperspace over Corellia, Chandrila Skies and Hardpoint Squadron were first in the launch queue for Dodonna's starfighter hangar and soon made a high orbital crossing of the planet's day side, before plunging into Corellia's atmosphere. However, Corellian forces had been aware of the imminent Galactic Alliance operation and assaulted the elements of the Second Fleet when they arrived. Starfighters launched to intercept Team Womp Rat, and a ground-based antispacecraft volley targeted Chandrila Skies and Hardpoint Squadron. The shuttle took a direct hit and was destroyed, along with the crew; the Rodian Jedi Toile Senn from Hardpoint Squadron was also killed in the barrage. The Jedi that Chandrila Skies was supposed to pick up were forced to improvise their extraction, and Chandrila Skies and its crew of two became some of the first casualties of the Second Galactic Civil War, which came about due to Operation Roundabout's failure to cow the Corellians."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chandrila Skies first appeared in Aaron Allston's 2006 novel, Betrayal, which was the first installment of the Star Wars: Legacy of the Force series. The shuttle also received an entry in 2008's The Complete Star Wars Encyclopedia. The entry's description of Chandrila Skies' destruction differs from that of Betrayal's, with the former attributing the cause to Corellian warships, while the novel has it hit by ground-based flak. This article treats Betrayal as the correct version of events."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}