{"url": "Change_of_Heart", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Change of Heart"}, {"tag": "p", "text": "\"Change of Heart\" is a short story in the anthology From a Certain Point of View. The story was written by Elizabeth Wein, and is told in second-person narration."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "This story is written from the point of view of the Unidentified Imperial Navy Trooper who guarded Princess Leia Organa while she was a prisoner aboard the first Death Star. As an Imperial Navy Trooper, the protagonist has been to trained to control his feelings, hide discomfort, and to mask his physical response to pain, fear, surprise, or anything. He envies the stormtroopers, whose faces are concealed behind their helmets. The trooper accompanies Darth Vader down the corridors of Detention Block AA-23 to Cell 2187. The trooper is shocked that the prisoner is a young girl, who turns out to be Princess Leia Organa of Alderaan."}, {"tag": "p", "text": "The trooper sees that the young woman is terrified and struggling to hide her fear. He reminds himself not to make eye contact with her. The trooper and his comrade part to allow an IT-O Interrogator droid to enter the room. Vader and the droid interrogate Leia about the location of the rebel base while the trooper and his comrade watch. The trooper struggles to control his emotions as Leia is tortured by the droid and screams in pain. He comes to believe that Leia is focused on hiding her thoughts, just as he is."}, {"tag": "p", "text": "Despite being tortured, Leia refuses to yield any information. Grand Moff Wilhuff Tarkin sends for her. Leia is manacled but maintains a steely composure. The trooper is shocked when he realizes that Leia is maintaining his stride. The trooper stares ahead and maintains his expressionless demeanor. He tells himself to focus and to ignore Leia. The trooper and his comrade watch as Leia confronts Tarkin and Darth Vader. The trooper is so interested in Leia's exchange with Tarkin that he realizes that he has forgotten that he should not be listening."}, {"tag": "p", "text": "The trooper hears Leia defiantly warning Tarkin that the more he threatens his grip, the more star systems will slip through his fingers. Tarkin then announces that he has decided to test the Death Star's destructive power on her home planet of Alderaan. Leia insists that Alderaan is peaceful but Tarkin demands that she name a military target. When Tarkin demands the location of the rebel base, she tells him that it is on Dantooine. Studying her body language, the trooper realizes that Leia is lying."}, {"tag": "p", "text": "Tarkin appears to accept her answer but then orders that Alderaan be destroyed as a demonstration of Imperial power. Despite his expressionless demeanor, the troop internally is gripped with disbelief. Tarkin mocks Leia for being too trusting as the Death Star destroys Alderaan. Observing Leia's body language, the trooper realizes that Leia had not given anything away despite facing torture and death. The trooper considers exposing Leia a liar but decides not to betray her since he admires her fortitude and devotion to her course. The trooper thinks that his silence makes him an ally and rebel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}