{"url": "Chapter_16:_The_Rescue", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:The Mandalorian episodes"], "nodes": [{"tag": "h1", "text": "Chapter 16: The Rescue"}, {"tag": "p", "text": "\"Chapter 16: The Rescue\" is the eighth and final episode of the second season of the television series The Mandalorian. The episode premiered on Disney+ on December 18, 2020. It was directed by Peyton Reed."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Mandalorian and his allies attempt a daring rescue."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Capturing the doctor"}, {"tag": "p", "text": "A Lambda-class shuttle weaves through space, evading heavy laser fire from Slave I. On board the shuttle, Dr. Pershing asks the pilots about what was happening and who they were being pursued by, but the shuttle co-pilot tells him to shut his mouth as this isn't his laboratory. On board Slave I, Boba Fett targets the shuttle's engines and fires an ion cannon, disabling its avionics and comms. Fett orders the shuttle to deactivate its shields and transponders, and prepare for boarding. Dr. Pershing suggests they fight the pirates, but the co-pilot refuses, saying he doesn't have a death wish."}, {"tag": "p", "text": "Slave I docks with the shuttle, and the Mandalorian Din Djarin enters the cockpit. The co-pilot stands, and tells Djarin that before he makes a mistake, he should know that the passenger is Dr. Pershing. Djarin says they've met, then addressing Pershing asks if Grogu is still alive. Pershing confirms he is, and is on board Gideon's light cruiser. The co-pilot grabs Pershing, holding a blaster to his head. Cara Dune enters the cockpit, blaster also raised. The pilot tries to bargain for his freedom, saying he's not with the co-pilot and they can work something out."}, {"tag": "p", "text": "The co-pilot shoots him dead, then explains to Dune and Djarin that Pershing is a top-tier New Republic target, a clone engineer, and if he dies because of them, Dune will wish she never left Alderaan. He says he recognized her tear tattoo, then goads her, saying he saw the destruction of her planet aboard the Death Star. Dune mockingly asks which one, and he angrily tells her that millions died on those bases, and that the destruction of Alderaan was \"a small price to pay to rid the galaxy of terrorism\". Having had enough, Dune shoots the co-pilot in the face, narrowly missing Pershing who screams and clutches his ear. Djarin watches as Dune turns and walks out."}, {"tag": "h3", "text": "Mandalorian help"}, {"tag": "p", "text": "Slave I arrives at a planet dotted with large refineries, and lands among a number of parked starships, including a Gauntlet fighter. In a nearby cantina, a hush falls as Djarin and Boba Fett enter and cross the room to approach Bo-Katan Kryze and Koska Reeves. Djarin tells Kryze he needs their help, and she replies that not all Mandalorians are bounty hunters, and that some of them serve a higher purpose. Djarin tells her that Moff Gideon has taken the Child, and she says they'll never find him. Fett tells Djarin they don't need these two, and that they should leave. Kryze says to Fett that he is not a Mandalorian, to which he responds he never said he was. Fett and Reeves begin to argue, but Kryze tells them to \"save it for the Imps.\""}, {"tag": "p", "text": "Djarin tells them they have Gideon's coordinates, and that he has a light cruiser which could help her regain Mandalore. Fett scoffs, saying the Empire had reduced Mandalore to glass, and Bo-Katan retorts that he is a disgrace to the armor. Fett says the armor belonged to his father, but Kryze mocks him, saying \"Don't you mean your donor?\" She says he's a clone and she's heard his voice thousands of times before. Fett says it may be the last voice she hears, and Reeves leaps up, swinging at him, and the pair fight before Bo-Katan orders them to stop. She agrees to help them take Gideon's ship and the Darksaber, which she will then use to retake Mandalore, and asks Djarin to reconsider joining their efforts."}, {"tag": "p", "text": "On Slave I, Bo-Katan briefs the others on Gideon's cruiser, saying that at the height of the Empire, such a ship would have carried hundreds of troopers, but now only holds a small fraction of that. Pershing speaks up, saying that is misleading, as Gideon also has a platoon of dark troopers aboard his vessel. Djarin asks how many troopers are housed in the suits, but Pershing tells him this is an all-droid third-generation model. He shows them where the dark troopers are housed, in a cargo bay next to the brig where Grogu is being held."}, {"tag": "p", "text": "Bo-Katan outlines her plan: they will send a distress call from the shuttle and emergency land into the cruiser's launch tube, blocking any potential interceptors. Kryze, Reeves and Fennec Shand will then attack the bridge, misdirecting Gideon's forces from Djarin who will head for the brig to rescue Grogu. As both ships jump to hyperspace, Bo-Katan says that Gideon is hers, but Dune says she needs him alive as his ISB knowledge will be invaluable to the New Republic. Kryze says she doesn't care as long as Gideon surrenders to her."}, {"tag": "h3", "text": "Boarding the cruiser"}, {"tag": "p", "text": "Both starships drop out of hyperspace near Gideon's cruiser, and Slave I begins firing on the shuttle. Bo-Katan issues a distress call, requesting emergency docking. The comms officer ackowledges the request, and tells them to stay clear of the cruiser's launch tube while she launches a TIE fighter squadron. Two TIEs launch from the cruiser, but the shuttle continues towards the bay, saying they are under attack and must dock immediately. The hangar control officer aborts the launch procedure as the incoming shuttle enters the launch tube and crashes in the bay. Fett destroys the two TIEs pursuing him and jumps into hyperspace."}, {"tag": "p", "text": "On the bridge, Gideon listens to the screams of the troopers and officers on the docking bay as they are shot down by the attackers, and orders the dark troopers to be powered up. With the bay clear, Djarin exits the shuttle and makes his way towards the brig, avoiding stormtroopers along the way. Dune, Shand, Kryze and Reeves fight their way through a cargo bay, but Dune's gun jams, forcing her to use it as a club. They enter a turbolift to the bridge."}, {"tag": "h3", "text": "Dark forces"}, {"tag": "p", "text": "As Djarin reaches the dark troopers' cargo bay, the door opens as the droids complete their power-up sequence. He dashes forward, using Pershing's code cylinder to close the door, but one of the droids holds the door open and manages to get through. Djarin tries fighting the droid despite its superior strength and size, but his flamethrower has no effect, and his whistling birds do nothing more than stagger the droid. Eventually though, he manages to destroy it with the beskar staff, and then depressurizes the bay, sucking the remaining droids into space."}, {"tag": "p", "text": "In the turbolift, Dune fixes her gun and she and the others enter the bridge, mowing down all the stormtroopers here. Bo-Katan realizes Gideon is not there."}, {"tag": "p", "text": "Djarin reaches the cell, dispatching the two troopers guarding it with the beskar staff. He enters to find Grogu in shackles and Gideon holding the Darksaber over him. Gideon orders him to drop his blaster, and tells him the Darksaber gives whoever holds it the right to the Mandalorian throne. Djarin says he can keep the sword, he just wants the kid. Gideon agrees, saying he has gotten all he wanted from the Child, to study his blood which has the potential to bring order back to the galaxy. As Djarin reaches for Grogu, Gideon activates the Darksaber and attacks him, and the two duel in the corridor, before Djarin disarms Gideon since Djarin needs Gideon alive for questioning from the Republic."}, {"tag": "p", "text": "Djarin enters the bridge, holding the Darksaber and Grogu, and pushing Gideon who is now in shackles. Bo-Katan turns and looks at him, asking what happened. Dune says that he has brought Gideon in alive, and that the New Republic will have to double the payment. Gideon laughs and says that's not what she meant: Bo-Katan wants the Darksaber, but it can only be taken by defeating the wielder in battle. As Djarin defeated Gideon, the Darksaber now belongs to him, and he can neither give her the Darksaber or yield to her, as the power of the Darksaber lies not in the weapon itself, but the story around it."}, {"tag": "p", "text": "An alarm sounds, and Shand reports that the ship's ray shields have been breached by the dark troopers. Gideon then questions Djarin's ability to fight the platoon, since he had trouble with one droid. As the droids march towards the bridge, Gideon covers a dropped blaster with his cape. Djarin and his allies prepare to fight, as the dark troopers begin to pound through the blast doors."}, {"tag": "h3", "text": "The Jedi"}, {"tag": "p", "text": "Another alarm sounds, and a lone X-wing fighter flies past the cruiser. As the ship lands in the docking bay, Bo-Katan asks them to identify themselves, but Grogu looks up, sensing something. The dark troopers stop their attack on the door, and turn around. Bo-Katan watches on the monitor as a hooded figure disembarks and walks through the ship, destroying dark troopers with a lightsaber. With his captors distracted, Gideon grabs the blaster and shoots at Bo-Katan, knocking her to the ground. As he stands and fires, Djarin leaps in front of Grogu protecting him from the shots. Gideon stops shooting, then raises the pistol to his chin to kill himself, but Dune knocks it out of his hand, then knocks him unconscious."}, {"tag": "p", "text": "Grogu reaches for the monitor, watching as the Jedi destroys the last of the dark troopers. Djarin tells them to open the blast doors, but Shand thinks he's crazy so he does it himself. The Jedi enters, and pulls back his hood to reveal he is Luke Skywalker. Djarin asks if he is a Jedi, which Skywalker confirms. He then holds out his hand to Grogu, who hesitates and turns to Djarin. Djarin says Grogu doesn't want to go with him, but Skywalker says he just wants Djarin's permission. Skywalker pledges to give his life to protect Grogu, but says that talent without training is nothing. Skywalker adds that he will not be safe until he masters his abilities."}, {"tag": "p", "text": "Djarin picks up Grogu, and tells him to go with Luke and that they will meet again. Grogu reaches for his helmet, which Djarin removes, showing his face to his young charge for the first time. He tells Grogu not to be afraid and places him on the ground. R2-D2 enters, and Grogu walks towards the droid. Skywalker nods and picks him up, then turns and walks away, as Djarin watches them go with tears in his eyes."}, {"tag": "h3", "text": "Epilogue"}, {"tag": "p", "text": "At Jabba's Palace on Tatooine, Jabba's former majordomo Bib Fortuna speaks to his henchmen in Huttese, when shouting and blaster fire is heard in the halls above. Fennec Shand enters, killing two Gamorrean guards, firing at the other fleeing gangsters, and freeing a Twi'lek slave girl. Boba Fett walks in behind Fennec, and Fortuna laughs, saying he thought Boba was dead and he is pleased to see him. Fett shoots Fortuna dead, and throws his body to the floor, taking the throne as Shand swigs from a bottle of spotchka and takes her place at his side."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}