{"url": "Chapter_10:_The_Passenger", "categories": ["Category:Real-world articles", "Category:The Mandalorian episodes"], "nodes": [{"tag": "h1", "text": "Chapter 10: The Passenger"}, {"tag": "p", "text": "\"Chapter 10: The Passenger\" is the second episode of the second season of the television series The Mandalorian. The episode was directed by Peyton Reed, and aired on Disney+ on November 6, 2020."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Mandalorian must ferry a passenger with precious cargo on a risky journey."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Ambush on Tatooine"}, {"tag": "p", "text": "The Mandalorian Din Djarin and The Child race across the sands of Tatooine on a Zephyr-J speeder bike, returning to Mos Eisley following the successful hunt for the krayt dragon. In a gully ahead, a trio of raiders led by a Kajain'sa'Nikto set a trap by concealing a rope across the gully. As the bike passes, the raiders raise the rope, knocking Djarin off the bike, sending its cargo and The Child flying. Djarin uses his jetpack to steady his fall, and begins to fight off the raiders. An alien points a rifle at him, but Djarin uses his fibercord whip to pull the rifle away, knocking his two assailants out. The alien grabs the Child, holding a knife to his throat. Djarin threatens him at first, saying if he hurts the Child, there is nowhere he can hide, but then suggests a bargain, offering to trade the valuable cargo in the wreckage, including Boba Fett's armor and a hunk of krayt dragon meat. The alien considers the offer, then demands Djarin's jetpack. He agrees, removing the jetpack and placing on the sand. The alien places the Child on the ground, then grabs the jetpack and runs away. Djarin picks up the Child, then activates the jetpack with his wrist gauntlet controls, sending the diminutive alien high into the air and dropping him to his death."}, {"tag": "h3", "text": "Another lead"}, {"tag": "p", "text": "With his speeder bike destroyed, Djarin heads to Mos Eisley on foot, arriving at nightfall and heading to Chalmun's Cantina. At the Cantina, he finds Peli Motto playing a game of sabacc with Doctor Mandible. Motto sees Fett's helmet among Djarin's cargo, and asks why he found a Mandalorian and killed him. Djarin replies that he wasn't Mandalorian and that he bought the armor from him by killing the krayt dragon. Djarin laments that Cobb Vanth was his last lead on finding other Mandalorians, but Mandible says he may be able to help if Djarin covers his wager for the sabacc round to the tune of five hundred credits. Djarin reluctantly agrees after Motto tells him the insectoid is \"on a hot streak,\" but when he places the bet, Motto reveals she is holding an Idiot's Array, and wins the round. Mandible agrees to send his contact to the hangar, who can reveal the location of other Mandalorians."}, {"tag": "h3", "text": "The passenger"}, {"tag": "p", "text": "At Motto's hangar, her Treadwell droid is roasting the krayt dragon meat using the heat of an engine blast. Motto enters the bay after speaking to Mandible's contact, telling the droid not to overcook the meat, which she prefers medium rare. She tells Djarin that there is a Mandalorian covert in the next system. She tells him the information is free—apart from her finder's fee—but that the contact wants passage to the system. Djarin agrees to the arrangement, but she also stipulates they must travel there without using the hyperdrive. Djarin says the deal is off, as sub-light travel is too dangerous. Motto insists there are mitigating circumstances, and introduces the contact: a female of a frog species carrying a canister containing several eggs floating in liquid. Motto explains that the cargo is the Frog Lady's spawn, which must be fertilized before the equinox to continue her family line—hyperspace travel will kill the eggs. Frog Lady's husband has settled on the estuary moon of Trask in the Kol Iben system, where Frog Lady confirms her husband has seen Mandalorians. Djarin agrees to take the job, and they board the Razor Crest."}, {"tag": "h3", "text": "A slow journey"}, {"tag": "p", "text": "Djarin warns Frog Lady to stay strapped in, as sub-light travel can be \"dicey,\" but he doesn't understand her language and she doesn't know Basic or Huttese. In the cargo hold, the Child gazes at the eggs, then approaches the canister, using the Force to pull the eggs toward him. Djarin enters the hold, and finding the bunk empty, turns to see the Child reaching into the egg canister and eating one. Djarin grabs him, saying that isn't food and not to do that again. He places the Child in his hammock, and settles into the bunk to get some sleep."}, {"tag": "p", "text": "Djarin is woken by an alert sound, and returns to the cabin. Two New Republic X-wings flank the Razor Crest, and Captain Carson Teva asks why the ship's transponder is not emitting. Djarin responds that his ship is pre-Empire surplus and isn't required to run a beacon, but Carson replies that the sector is now under New Republic jurisdiction, and beacons are required for all ships. Djarin promises to get right on it, and the pilot wishes him a safe journey. Just before they leave, they ask him to send them a ping. Djarin bluffs that the system isn't working, but the pilot is insistent, saying they can wait, but if they can't confirm he's not Imperial, they will have to escort him to the Adelphi outpost. Djarin sends the ping, and the pilots switch channels to speak to each other privately. Both starfighters set their S-foils to attack position, and ask if his ship has been in the vicinity of New Republic Correctional Transport Bothan-Five. Djarin says nothing, but suddenly banks his ship toward the nearby planet of Maldo Kreis. Trapper Wolf remarks they've got a runner, and the X-wings pursue the Razor Crest into the planet's atmosphere."}, {"tag": "h3", "text": "Crash landing"}, {"tag": "p", "text": "The Razor Crest sustains heavy damage pulling rapid manoeuvers in the planet's clouds and canyons to evade the X-wings. The ship eventually crash lands, sliding to a halt under a rock shelf, hiding it from the New Republic pilots, who split up to continue searching. As Djarin prepares to take off again, the ice beneath the ship gives way, dropping them into a subterranean cave. Djarin recovers, and wakes Frog Lady, who is worried about her eggs. Djarin descends into the cargo hold, picking through the wreckage until he finds the Child under some debris, eating another egg from the canister."}, {"tag": "p", "text": "Concerned about the dropping temperature, Djarin fetches blankets and ration packs for Frog Lady and the Child. The Frog Lady croaks insistently, gesturing towards the eggs, but Djarin cannot understand her, and recommends she get some sleep. He and the Child settle in a corner and rest. Frog Lady whimpers and groans, then covers her eggs with the blanket and looks around the hold, spotting some droid wreckage on a shelf."}, {"tag": "p", "text": "Djarin wakes suddenly to the voice of mercenary protocol droid Zero intoning \"Wake up, Mandalorian!\" He draws his blaster, but realizes that Frog Lady has bypassed the droid's security protocols to access its vocabulator in an attempt to communicate. Through the droid, she tells Djarin that the egg batch she carries is the last brood of her life cycle, and if they fail to get it to her husband on Trask, it will mean the extinction of her family line. Djarin says that the deal is off, and they'll be lucky to survive the night. Frog Lady replies that she thought honoring one's promise was part of the Mandalorian code, but perhaps that was just a story for children. Djarin sighs, and grumbling that this was not part of the deal, heads outside to begin repairs."}, {"tag": "h3", "text": "The nest"}, {"tag": "p", "text": "The Child calls Djarin away from his repairs, and he realizes that Frog Lady has left the ship and walked away. They follow her footprints, eventually finding her sitting with her eggs in the pool of some hot springs in a cave. They begin to gather her eggs up to leave, while the Child notices clusters of a different kind of eggs scattered around the cave. He wanders over, cracking one of the eggs open and eating the baby  spider inside. There is a rumbling sound, as all over the cave, the other eggs begin to stir and hatch. Infant knobby white ice spiders emerge, and begin to swarm around as Djarin scoops up the Child and the canister, and Frog Lady retrieves her clothes. A huge spider emerges, and they flee back to the ship, pursued by the swarm. Djarin throws explosives at the cave walls and roof, collapsing it and trapping the large spider. They reach the ship, but the hull damage allows the spiders to swarm in. In the cabin, Djarin uses his flamethrower to burn the spiders swarming through the door, and Frog Lady uses a blaster to kill some that got through."}, {"tag": "p", "text": "Djarin starts the engines, but as the ship begins to ascend, the giant spider drops onto the ship, forcing it down. As the spider's legs smash through the glass of the canopy, it is hit by blaster fire from outside. The firing continues, killing many of the smaller spiders on the hull. Djarin heads outside, to find the two X-wing pilots shooting the spiders with their blaster rifles."}, {"tag": "p", "text": "When the spiders are gone, Carson tells him they ran the tabs on the Razor Crest, and that there is an arrest warrant on Djarin for the abduction of prisoner X-Six-Nine-Eleven. However, he then notes that security records show that Djarin had apprehended three wanted culprits, and risked his own life in an attempt to protect New Republic lieutenant Davan. Carson tells him he should be arrested, but is willing to let him go in these \"trying times.\" Djarin offers to forego the bounty on Burg, Migs Mayfeld, and Xi'an in exchange for help with repairs, but the pilots tell him to fix his transponder so they don't have to vaporize his ship next time, and depart."}, {"tag": "p", "text": "Djarin patches the canopy, and the three of them get into the cabin as it is now the only pressurized part of the ship. As the damaged ship heads off into space, The Child eats another of Frog Lady's eggs."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}