{"url": "Chapter_13:_The_Jedi", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:The Mandalorian episodes"], "nodes": [{"tag": "h1", "text": "Chapter 13: The Jedi"}, {"tag": "p", "text": "\"Chapter 13: The Jedi\" is the fifth episode of the second season of the television series The Mandalorian. The episode was released on November 27, 2020. It was written and directed by Dave Filoni."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Mandalorian journeys to a world ruled by a cruel magistrate who has made a powerful enemy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Prologue"}, {"tag": "p", "text": "The episode opens with mercenaries sounding the alarm at the gate of Calodan on the planet Corvus. The former Jedi Ahsoka Tano battles Scout Guards wielding her dual white lightsabers outside the city, uses the Force to snap a twig, distracting them as she emerges and fades into the mist, taking multiple hostiles down while they retreat. She confronts Morgan Elsbeth, also known as The Magistrate, and demands that she give up the information she possesses about Grand Admiral Thrawn."}, {"tag": "p", "text": "The Magistrate refused and offers to spare the lives of the city's inhabitants in exchange for peace. Tano counters that the people already suffer under her rule and issues her own ultimatum: that the Magistrate surrender or face the consequences. She gives the Magistrate one day to decide before leaving. The gunslinger Lang tells the Magistrate that he and his troops will be ready when Tano returns. The Magistrate orders her guards to cage a male prisoner whom they had brought to the battlements during the parley with Tano."}, {"tag": "h3", "text": "Landing on Corvus"}, {"tag": "p", "text": "Din Djarin prepares for landing as the Razor Crest exits hyperspace and arrives at Corvus. Half of the planet appears to be green and forested while the other half appears to covered in darkness with red scars. He asks the Child to settle back into his seat as he is starting the landing sequence. After Djarin reiterates his instruction, the Child reluctantly listens and reaches into the Force to unscrew the joystick ball, summoning it into his hands. The Razor Crest cruises over the city and lands in the nearby woods. Djarin retrieves the joystick ball and slips it under his armor."}, {"tag": "p", "text": "After the Razor Crest lands, the Child follows Djarin down the gangplank. Djarin tells the Child to remain aboard the ship, warning that he has never dealt with a Jedi before. Due to the Child's persistence, Djarin changes his mind and decides to bring him along, reasoning that he can help them find a lead."}, {"tag": "h3", "text": "Meeting the Magistrate"}, {"tag": "p", "text": "Djarin arrives at the city gate with the Child hidden under his cloak. The gunslinger Lang recognizes him as a Mandalorian hunter and allows him to enter the city after Djarin confirms that he is associated with the Bounty Hunter's Guild. While walking through the streets of Corvus, Djarin notices that the citizens are impoverished and dejected. An 8D-series smelter droid walks past him."}, {"tag": "p", "text": "Djarin speaks to a vendor named Wing, seeking information about the Jedi. Wing sends his two children away and pleads with the Mandalorian not to speak to any of them. Two armored mercenaries approach Djarin and summon him to meet with the Magistrate. The mercenaries escort Djarin along the main street where multiple inhabitants are being tortured in electrocution cages."}, {"tag": "p", "text": "A guard admits Djarin and the Child through a second set of gates which leads them into a villa with a bridge and moat. The Magistrate tells Djarin to come forward, asking if he is a Mandalorian. After confirming he is one, the Magistrate tells him that she wants him to kill a Jedi who is plaguing them. When Djarin responds that this is a difficult task, the Magistrate attempts to exploit the historical animosity between the Mandalorians and the Jedi. Djarin replies that his price is high."}, {"tag": "p", "text": "A droid servant passes the Magistrate a long a beskar staff, which she shows Djarin. After Djarin confirms that the staff is pure beskar by ringing it against his armor, the Magistrate offers him the weapon in return for finding the Jedi. Djarin asks where he will find the Jedi."}, {"tag": "p", "text": "Later Lang leads Djarin and the Child out of the city gate. Noticing the Child huddled in the Mandalorian's pouch, he asks about the creature. Djarin  responds that he keeps it for luck. Lang quips that the Mandalorian is going to need plenty of luck where he is headed."}, {"tag": "h3", "text": "Encounter with a Jedi"}, {"tag": "p", "text": "Djarin journeys deep into the woods in search for Tano, using the coordinates provided by the Magistrate. While examining the trails through his helmet visor, he tells the Child to keep his eyes open. He places the Child on a rock and looks around with his rifle scope upon hearing a snapping sound, then deciding that it was a false alarm after seeing the indigenous beasts afar."}, {"tag": "p", "text": "Just then, Djarin is ambushed from behind by a lightsaber–wielding Tano.  Djarin blocks the lightsaber strikes with his Mandalorian vambraces and forces Ahsoka to fall back by unleashing his wrist-mounted flamethrowers, burning her cloak. Djarin manages to trap her with his fibercord whips. However, Tano escapes by utilising a force jump, flinging Djarin midair using a branch as a pulley and forces him to detach the wire, freeing herself. Djarin lands onto the ground and draws his blaster. Before the fight can begin in earnest however, he informs Tano that he was sent by Bo-Katan Kryze, effectively ending the brief duel."}, {"tag": "p", "text": "Seeing the Child, Tano says she hopes that it is about the Child. She appears to be both surprised and delighted."}, {"tag": "h3", "text": "The revelation"}, {"tag": "p", "text": "Later that evening, Tano and the Child sit in a clearing by a lantern. She communicates with the Child telepathically through the Force and made important discoveries on his past. After carrying the Child to another clearing, she reveals to Djarin that the name of the Child is Grogu, who was raised in the Jedi Temple on Coruscant before the Clone Wars, and trained by many Jedi Masters on the ways of the Force. He was taken from the Temple and hidden from the Galactic Empire for many years, and his memories during these times are dark and filled with fear. Tano also laments that she had only met one such being of this species, Jedi Grand Master Yoda."}, {"tag": "p", "text": "When Tano asks if Grogu can still wield the Force, Djarin asks if she means his powers. Tano explains that the Child draws his power from the Force, which she describes as an energy field created by all living things. To wield it takes a good deal of training and discipline. Djarin says he has seen Grogu do things that he can't explain, adding that his task was to bring him to a Jedi. Tano explains that the Jedi Order fell a long time ago. Din says that the Empire also fell but that it still hunts Grogu.\nDjarin tells Tano that Grogu needs her help. Tano communes with the Child and says that she will test him in the morning."}, {"tag": "h3", "text": "Testing Grogu"}, {"tag": "p", "text": "In the morning, Tano leads Din and Grogu to a green forest clearing and gets Djarin to put the Child down. Tano picks up a stone and lifts it into air with the Force, passing it to Grogu. However, Grogu refuses to pass it back as Tano asked. Djarin is concerned that Grogu doesn't understand her discussions but Tano reassures him that he does before reiterating her command. Grogu makes eye contact with Tano but willfully drops the stone."}, {"tag": "p", "text": "Holding Grogu's hand, Tano senses much fear in the Child. She tells Djarin that Grogu has hidden his abilities in order to survive over the years. Knowing that Grogu responds to Djarin, she convinces him to ask the Child to bring the stone to him. At Tano's prompting, Djarin asks the Child to pass the stone but Grogu is stubborn. Tano tells Djarin to connect with the Child. Breathing deeply, Djarin fetches the joystick ball which the Child had been playing with earlier. Djarin convinces the Child to take the joystick with the Force, telling him that he wants it. Grogu reaches into the Force to retrieve the joystick ball from Djarin after he calls him by his name."}, {"tag": "p", "text": "Tano observes that Grogu has formed a strong attachment with Djarin, making it hard for her to train him. Feeling out of his depths, Djarin insists that Tano train him. Tano disagrees, saying that she has seen what fear and anger can do to a fully-trained Jedi Knight, indirectly referring to her former master Anakin Skywalker, who as Darth Vader, fell under the seduction of Emperor Palpatine through the manipulation of his attachments. Unwilling to let the Child down this path, she decides it is better to let Grogu's abilities fade away."}, {"tag": "h3", "text": "Striking an alliance"}, {"tag": "p", "text": "Tano says that she has delayed for too long and must return to the walled village of Calodan. Djarin reveals that the Magistrate sent him to kill her, but he did not agree to it. He promises to help her eliminate the Magistrate if she ensures that Grogu is properly trained. Djarin also briefs Tano about the magistrate, explaining that she has a small army of guards armed with A350 blaster rifles, two HK-87 assassin droids, and a hired gunfighter. Djarin thinks the gunfighter is ex-military and believes that Tano is outmatched even with her Force powers. Tano agrees and warns Djarin not to underestimate the Magistrate."}, {"tag": "p", "text": "Djarin asks Tano about the Magistrate's identity and explains that she offered him a staff of pure beskar to kill Tano. Tano tells him that the Magistrate is named Morgan Elsbeth, and her people were massacred during the Clone Wars. Elsbeth survived and let her anger fuel an industry that built the Imperial Navy. Tano explains that Elsbeth had plundered worlds, destroying them in the process. Djarin says that Elsbeth is still in business. When Tano asks if he saw any prisoners, Djarin recalls seeing three prisoners strung up outside the inner gate. Tano says that they must find a way to free them. Djarin agrees that their opponents will never expect a Mandalorian and a Jedi fighting together."}, {"tag": "h3", "text": "Liberating Calodan"}, {"tag": "p", "text": "Later that evening, Elsbeth's mercenaries man the gate and fortifications of Corvus. Tano emerges outside the city gates from the mist, igniting her lightsabers. The mercenaries sounded the alarm and attempted to take her down with their blaster rifles. Armed with her Force powers, she charges up the battlements, dodging blaster fire and cutting down several mercenaries. She also cuts the bell in half and lands on the other end of the gate. The citizens and mercenaries gather to watch the fight."}, {"tag": "p", "text": "Striding towards the Magistrate and her private army, Tano tosses Djarin's pauldron with his signet onto the ground, claiming that she defeated the bounty hunter. Once again, Tano demanded to know the location of the Magistrate's master. Elsbeth refuses, ordering her men to kill Tano. She leaps onto the roof while the mercenaries opened fire, deflecting the blaster bolts with ease before disappearing into the alleys. The Magistrate commands Lang to hunt her down with her two HK-87 assassin droids, and tells her men to execute the prisoners before retreating into her mansion."}, {"tag": "p", "text": "Before the mercenaries can perform the execution, Djarin lands with his jetpack and swiftly defeats the executioners, signalling Wing to free them and take them to safety. Tano quickly eliminates the mercenaries in the alleys, and destroys one of the assassin droids. Lang orders the remaining HK-87 droid to climb up onto the roofs before he came to face Djarin and Tano in a standoff. After destroying Lang's blaster, Tano leaves Lang to Djarin as she climbs over the wall into the walled compound to engage in  fierce duel with the Magistrate."}, {"tag": "p", "text": "The Magistrate proves to be a worthy opponent against the former Jedi, wielding her Beskar staff against Tano's dual lightsabers. The two exchanges blows while the standoff between Djarin and Lang continues, with Lang attempting to convince Djarin to change sides. The Magistrate gained a brief upper hand by knocking Tano's single-bladed lightsaber into the water. However, Tano gained the upper hand when she switched to her signature reverse-grip, allowing her to disarm Elsbeth."}, {"tag": "p", "text": "Outside, Lang realised his master's defeat and feigned surrender, attempting to kill Djarin with his blaster pistol. However, Djarin anticipated his move and gunned him down with a blaster pistol. Then, the surviving assassin droid appeared on the roof, but was destroyed by Djarin before it can attack, thanks to Wing's warning. Inside the compound, Tano holds the Magistrate against the blade of her shoto lightsaber. Once again, Tano demanded that she give up the information on the whereabouts of her master: Grand Admiral Thrawn."}, {"tag": "h3", "text": "Parting company"}, {"tag": "p", "text": "Following the defeat of the Magistrate's army, the citizens of Calodan held a celebration to mark the liberation of their city. Tano and Djarin engages in a brief conversation outside the gate, where Tano offered him the Beskar spear as a reward. Djarin initially refuses, but accepts it on behalf of the Mandalorians who rightfully possess this weapon. When Tano asks where is his little friend, Djarin replies that Grogu is back at the ship. Tano then walks with Wing, the newly cloaked governor of Calodan."}, {"tag": "p", "text": "He returns back to the Razor Crest to fetch and bid farewell to Grogu, intending to bring him under the wing of Tano. He embraces the sleeping infant in his arms just as Tano arrives at the bay door. Tano tells Djarin that he is like a father to Grogu. While Tano refuses to train Grogu, she tells Djarin to take him to the seeing stone on the planet Tython, a place with a strong connection with the Force where Grogu can decide his own fate. She also suggests that other Jedi may come searching for Grogu if they sense him though the Force."}, {"tag": "p", "text": "Tano warns Djarin that there are not many Jedi left. Djarin thanks Tano and she wishes that the Force be with him. She smiles as Djarin walks aboard the Razor Crest's gangplank. The ship takes off and departs Corvus."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}