{"url": "Chapter_11:_The_Heiress", "categories": ["Category:Real-world articles", "Category:The Mandalorian episodes"], "nodes": [{"tag": "h1", "text": "Chapter 11: The Heiress"}, {"tag": "p", "text": "\"Chapter 11: The Heiress\" is the third episode of the second season of the television series The Mandalorian. The episode was directed by Bryce Dallas Howard, and aired on Disney+ on November 13, 2020."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Mandalorian braves high seas and meets unexpected allies."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Landing on Trask"}, {"tag": "p", "text": "The episode opens with the damaged Razor Crest flying over the gas giant Kol Iben towards the moon Trask. The Child and the Frog Lady are snuggled in the cockpit while the Mandalorian Din Djarin mans the controls. With the landing array not responding and the guidance system not working, Din is forced to a manual re-entry. He warns his passengers that it will be a choppy landing and hopes that once they enter the atmosphere, there will be enough fuel for them to land."}, {"tag": "p", "text": "As the Razor Crest descends into Trask's atmosphere, the ship begins to burn on re-entry. Djarin gets the Frog Lady's help in holding up the lever to slow the landing. On the surface, a Mon Calamari dock worker watches the ship landing. Trask flight control tells the Razor Crest to slow down its speed. Djarin engages the ship's rear thrusters in an attempt to slow down the descent. Din attempts to land the ship on a waiting landing bay. However, the landing struts break down and the Razor Crest tilts over into the sea below."}, {"tag": "p", "text": "The Mon Calmari watches with his hands on his torso as the Razor Crest is lifted out of the water by a mobile loading gantry. After disembarking, Din speaks with the Mon Calamari dock worker, who offers to make it fly and to fuel it up. Amidst a crowd of Quarren and other aliens, the Frog Lady spots and calls out to her husband. The two embrace and celebrate the safe passage of the Frog Lady's spawn. Noticing the Child eye the eggs, Djarin promises to get him something to eat."}, {"tag": "p", "text": "After shaking hands, Din asks the Frog Man about finding other Mandalorians. A hooded human woman overhears the conversation before she disappears amongst the crowd. The Frogs lead Djarin and the Child to an inn which is frequented by Mon Calamari and Quarren. A Mon Calamari server directs Djarin and the Child to a table. Djarin orders a bowl of chowder for the Child. When the Mon Calamari server insist that he order something, Djarin offers to trade for information about other Mandalorians. The Mon Calamari server serves the child and says that others with beskar have been through here."}, {"tag": "p", "text": "The Mon Calamari speaks with a Quarren boatman while the Child tries his soup. A cephalopod creature surfaces from the soup and latches onto the Child's face. The Mandalorian pries the creature off the Child's face. The Quarren boatman speaks with Din, saying that he can bring him to others of his kind. He says that the Mandalorians are only a few hours sailing away but warns that it will cost him."}, {"tag": "h3", "text": "A perilous cruise"}, {"tag": "p", "text": "The Mandalorian and the Child travel aboard a seafaring fishing vessel with several Quarren boatsmen. A Quarren asks Djarin if he has seen a mamacore eat, saying that it is quite a sight and that the Child might be interested. The Quarren lowers a net full of fish down an opening below the ship's deck. The mamacore quickly devours the fish. While conversing, the Quarren then uses his spear to whack the Child's repulsorlift cradle below the opening. A horrified Djarin shouts as the mamacore surfaces and swallows the cradle with the Child."}, {"tag": "p", "text": "The Mandalorian jumps after the Child and the Quarrens seal a metal grill trapdoor over the opening, trapping the Mandalorian. They intend to steal Djarin's armor and use pikes to force him underwater, hoping to drown him. Before the Quarren can finish him, several Mandalorians with jetpacks descend on the deck and fight the Quarren, killing them with at least one falling into the sea. A female Mandalorian opens the trapdoor and pulls Djarin to safety. He tells her that the mamacore has taken the Child. She jumps into the water while her two comrades help Djarin."}, {"tag": "p", "text": "The female leader reassures Djarin they had gotten this under control. She and her companion watch the underwater explosions beneath the trapdoor. Shortly later, the Mandalorian who helped Djarin resurfaces with her jetpack and the Child's cradle. The cradle is damaged but the Child is alive. The three Mandalorians stand while Din thanks them. As Din explains his quest to reunite the Child with his kind, the three Mandalorians remove their helmets, revealing themselves as Bo-Katan Kryze, Axe Woves, and Koska Reeves."}, {"tag": "h3", "text": "Fellow Mandalorians"}, {"tag": "p", "text": "When Djarin asks the Mandalorians where they got their armor, Kryze replies that the armor has been in her family for three generations. Djarin is suprised that they don't cover their faces and says they are not Mandalorian. Woves remarks that Din is one of them while Kryze remarks dank farrik. When Djarin asks what Woves means, Kryze introduces herself as Bo-Katan of Clan Kryze and says that she was born on Mandalore and fought in the Great Purge. She says that she is the last of her line and that Djarin is a Child of the Watch."}, {"tag": "p", "text": "When Djarin inquires about the Watch, Kryze explains that the Children of the Watch are a cult of religious zealots that broke away from Mandalorian society. Their goal is to re-establish the ancient way. The Child coos while Djarin responds that there is only one way, which he describes as the Way of the Mandalore. Djarin turns his back and rockets away from the ship as Kryze and her followers watch. At dusk, the three Mandalorians depart on their jetpacks but not before destroying the fishing vessel in an explosion. The Mandalorian and the Child watch from the shore."}, {"tag": "p", "text": "Later that night, Djarin is walking through the streets of the Trask port when he is accosted by the Quarren boatsman's brother. He and several Quarren converge on Djarin, who demands that they let him pass. The Quarren brother responds that he is going to kill the Child, whom he mistakes for a pet. Before the Quarrens can attack, Kryze and her comrades arrive. Kryze responds that she killed his brother before the Mandalorians eliminate the hostiles. Kryze offers to buy Djarin a drink, which he obliges."}, {"tag": "p", "text": "At the bar, Kryze explains that Trask is a black market port and that they are staging weapons that have been bought and sold with the plunders of Mandalore. She explains that they are seizing those weapons and using them to retake their homeworld. She plans to seat a new Mand'alor on the throne. Djarin replies that Mandalore is cursed and that everyone who goes there dies. Once the Empire knew they could not control it, they made sure no else could either. Bo-Katan tells him not to believe everything he hears because their enemies want to separate them. She says that Mandalorians are stronger together."}, {"tag": "p", "text": "Djarin says this is not part of his plan because he has been quested with returning the Child to the Jedi. When Kryze asks what he knows about the Jedi, Djarin admits he knows nothing about them and says he was hoping that they would help him by Creed. Reeves slurps on a tentacle while the Child coos. As the other Mandalorians watch, Kryze offers to lead Djarin to a Jedi but asks him to help on a mission."}, {"tag": "h3", "text": "Plans and babysitting"}, {"tag": "p", "text": "Later that night, Kryze shows Djarin an Imperial Gozanti-class cruiser, which is being loaded with weapons. According to the port's manifest, it is scheduled to depart at first light. Djarin asks if their plan is to stow away. Reeves says that their faction has been hitting them pretty hard and that the Imperials scan for lifeforms as a precaution before pushing back. Djarin remarks that if there are four of them, they have to have the element of surprise."}, {"tag": "p", "text": "Kryze says exactly and explains that the freighter will travel at trawler speed inside the shipping lanes and then ascend into orbit. She says that they will jet up when the freighter is cruising at low speed in Trask's atmosphere. Kryze explains that the tower won't allow them to climb until they have left the port's airspace. When Djarin asks if there will be stormtroopers aboard, Kryze believes that there will be at least one squad. Woves quips that the Imperials could not hit the side of a bantha."}, {"tag": "p", "text": "Before embarking on the mission, Din visits the Frog Lady and Frog Man. He convinces them to babysit the Child. Before leaving, he warns the Child to behave himself and show his hosts respect. The Frog Lady allows the Child to watch the casket of eggs as the first spawn emerge."}, {"tag": "h3", "text": "The heist"}, {"tag": "p", "text": "At dawn, the Gozanti-class cruiser departs Trask, flying at low speed. The Mandalorians fly behind the freighter and take out the stormtroopers guarding it, throwing them overboard. One of the stormtroopers manages to warn the rest of the crew about the presence of \"pirates.\" At the bridge, the Imperial captain informs the bridge crew that they are dealing with pirates as one of the stormtroopers is thrown against the cockpit window. The captain orders his stormtroopers to guard the hall and the bridge crew to seal the hatch."}, {"tag": "p", "text": "The Nite Owls and Din Djarin force their way inside the ship and fight more stormtroopers. More stormtroopers arrive and the Mandalorians fight their way through the hallway of the ship towards the cockpit. In the cockpit, the Captain asks what is going on and how many are there. The stormtrooper says it is hard to say and believes that there are at least ten intruders. The deck officer says that the live readings only pick four foreign lifeforms. The stormtrooper warns that they are Mandalorians before being taken out in combat."}, {"tag": "p", "text": "The deck officer reports that the Mandalorians are heading to the cargo bay. When the Captain asks how long until they clear the atmosphere and make the jump into hyperspace, the freighter pilot reports that they can't climb until they have left the harbor. The captain orders the pilot to climb immediately. As the freighter ascends, the Mandalorians encounter another squad, whom they disorientate with smoke grenades before shooting them down. In the cargo bay, more stormtroopers arm themselves with blasters while one of the bridge crew informs the security officer down there that the intruders are heading his way."}, {"tag": "p", "text": "The Captain orders him to hold them off until they can make the jump into hyperspace and rendezvous with the Imperial fleet. The security officer orders his men to hold them off until they can make the jump into hyperspace. The stormtroopers wait outside the turbolift. The Mandalorians soon arrive and fight their way through the Imperials. The security officer orders his men to close all of the blast doors, seemingly trapping the intruders. The security officer informs the Captain he has trapped the Mandalorians inside the cargo control area to the dismay of the Captain. The security officer and his remaining stormtroopers are sucked out of the cargo bay as proximity alarms ring."}, {"tag": "p", "text": "The deck officer asks the security officer if he copies. Kryze replies and thanks the Imperials for packing up the weapons nicely, saying that the weapons will be useful for a division of Mandalorians. The Captain threatens to hunt them down in retaliation if they jettison everything. Kryze responds that she and her Mandalorians plan to take the entire ship, telling him to put some tea on while waiting. Djarin is surprised and tells Kryze that this is more than he signed up for. Kryze replies that there is something that she needs in order to rule Mandalore and says that the Imperials know where it is and that she will find out soon."}, {"tag": "p", "text": "She plans to use the freighter for the battles ahead. Djarin responds that he got her the weapons and says that he has to return to his ship with the foundling. Kryze tells him that if he wants to find the Jedi, he will help her take the Imperial freighter. Din protests that she is changing the terms of the deal. Kryze responds that this is the way before walking away. Din decides he has no choice."}, {"tag": "p", "text": "The Captain contacts Moff Gideon via hologram and informs him about the pirate hijacking. The Captain requests reinforcements. When Moff asks if these are the same \"pirates\" that attacked their other vessels, the Captain confirms this is the case. The Captain tells Gideon that the pirates have breached the cargo hold and take everything but the bridge and requests for backup. Gideon responds that sending reinforcements is no longer feasible and tells him that he knows what to do before saying \"Long live the Empire\"."}, {"tag": "p", "text": "The Captain replies \"Long live the Empire\" before shooting the deck officer and pilot dead. Taking control of the freighter, he attempts to crash the freighter. Realizing the Captain's intentions, Kryze and her Mandalorians fight their way to the bridge, clashing with a squad of stormtroopers who are armed with heavy repeating blasters. With the Imperial freighter rapidly descending, Djarin convinces the other Mandalorians to provide covering fire as he charges into the path of the remaining stormtroopers. He manages to throw two grenades, which incinerate the opposition."}, {"tag": "p", "text": "The Mandalorians force their way into the cockpit and disarm the captain. Bo-Katan threatens the Captain with a knife and demands to know the location of the Darksaber. The Captain responds that she already knows while Djarin and Reeves stop the ship's descent, narrowing missing a buoy at sea. They bring the ship back into normal flying altitude. Bo-Katan offers to spare the Captain's life but the Captain responds that his master won't be so merciful and bites an electric suicide capsule, which kills him."}, {"tag": "p", "text": "Reeves says they have to go because the Imperial has already sent a distress signal. Bo-Katan tells Reeves and Woves to prepare to jump into hyperspace. Kryze asks Djarin if he won't be joining them. Djarin responds that he still has his task to do. Bo-Katan replies that the offer stands if he changes his mind. Djarin asks where he can find the Jedi. Removing her helmet, Kryze tells the Mandalorian to take the foundling to the city of Calodan on the forest planet of Corvus, where he will find Ahsoka Tano. She tells him to tell Tano that he was sent by Bo-Katan and thanks him, saying that his bravery won't be forgotten. She says that this is the Way. Djarin answers in unison before departing through one of the airlocks."}, {"tag": "p", "text": "Back at the Frog couple's home, the Child is playing with a tadpole under the parents' supervision. Djarin returns and thanks the couple for looking after his foundling. He congratulates the couple for their children and declines their offer for more pets. At the port, the Mandalorian is not impressed with the Mon Calamari dock worker's job, having paid 1,000 credits to repair the ship."}, {"tag": "p", "text": "Din enters the cockpit of the Razor Crest and places the Child in the co-pilot's seat. Djarin grumbles about Mon Calamari before preparing the partially repaired ship for departure. As the ship rumbles during takeoff, a tentacled creature surfaces and climbs several cables. It descends on the Child, but the Mandalorian catches it right before making contact. Djarin tells the Child that he finally knows where he is taking him but warns that it will be a bumpy ride, as the Child slurps up the last tentacle of the creature. The Razor Crest departs Trask before jumping into hyperspace, and a small piece of the ship falls off in the process."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}