{"url": "Chapter_2:_The_Child", "categories": ["Category:Real-world articles", "Category:The Mandalorian episodes"], "nodes": [{"tag": "h1", "text": "Chapter 2: The Child"}, {"tag": "p", "text": "\"Chapter 2: The Child\" is the second episode in the first season of the television series The Mandalorian. It aired on Disney+ on November 15, 2019."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Target in-hand, The Mandalorian must now contend with scavengers."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The journey back"}, {"tag": "p", "text": "The episode opens with a shot of a lizard scurrying in the sand. The Mandalorian walks by with the Child in a floating cradle. Several lizards scurry past the rocks and on the ground. The Mandalorian looks around and draws the blaster in his hilt."}, {"tag": "p", "text": "Just then, he is ambushed by several armed Trandoshans, who wield vibro-axes. The Mandalorian fights back with his trident and subdues them. One of the assailants tries to kill the Child and the Mandalorian shoots him down. The Mandalorian sees a tracking fob on the ground."}, {"tag": "p", "text": "Later at dusk, the Child watches as the Mandalorian tries to sear a wound on his left arm. Taking pity on his protector, the Child tries to touch it with his paw but the Mandalorian rebuffs his offer. The Mandalorian tries to repair a machine. Taking pity on the Child, he wraps him with a blanket."}, {"tag": "h3", "text": "Trouble with the Jawas"}, {"tag": "p", "text": "The following day, the Mandalorian and the Child reach the Razor Crest only to discover that a clan of Jawas are salvaging and looting the starship. After studying them with a telescope, the Mandalorian shoots one of the Jawas with his blaster, causing them to scatter. The Mandalorian fires a few more rounds. One of the Jawas fires back and the Mandalorian takes him down. The Jawas retreat aboard their sandcrawler and the Mandalorian shoots at the rear."}, {"tag": "p", "text": "Continuing his pursuit, the Mandalorian climbs up a service ladder onto the chassis of the sandcrawler. One of the Jawas spots him and informs the drivers, who maneuver the sandcrawler along a rockface in an attempt to crush him. The Mandalorian manages to avoid death and clings onto the hull of the sandcrawler. Jawas fling debris and objects at him. The Child follows the Mandalorian and the Jawas in his floating cradle."}, {"tag": "p", "text": "Dodging debris, the Mandalorian uses a grappling cable to reach the top of the sandcrawler. Jawas hurl debris at him and he dodges them. As he reaches the top, the Jawas dislodge the platform that he had tied the grappling cable around. However, the Mandalorian manages to cling onto the sandcrawler and throws a Jawa off the vehicle. When he reaches the top, he is confronted by several armed Jawas who shoot him with an ion blaster, causing him to fall to the ground."}, {"tag": "p", "text": "Later, the Mandalorian wakes up to find the Child in his cradle nearby. The Mandalorian and Child return to the Razor Crest, which has been stripped of cables and parts. He tries to power the ship but the Jawas have stripped it bare, stranding the two of them on Arvala-7."}, {"tag": "h3", "text": "A dependable ally"}, {"tag": "p", "text": "The Mandalorian and Child travel over the desert, walking over a plateau. They reach Kuiil's moisture farm where the Ugnaught moisture farmer is repairing a moisture vaporator. Kuiil thought that the Mandalorian had perished and is surprised to see him alive. The Ugnaught studies the Child and is surprised that this was causing all the fuss. The Mandalorian confirms that the asset was a Child and Kuiil now understands why the Client wanted it to be delivered alive."}, {"tag": "p", "text": "The Mandalorian tells Kuiil that his ship has been destroyed and that he is stranded here. Kuiil points out that the Jawas steal and do not destroy. The Mandalorian says this makes no difference to him and that the Jawas are protected by the \"crawling fortress\" and he has no way to recover the parts. Meanwhile, the Child takes an interest in a frog. Kuiil proposes that he trade with the Jawas. The Mandalorian thinks that he is out of his mind but Kuiil responds that he has spoken. The two watch as the Child swallows the frog whole."}, {"tag": "h3", "text": "Camp of the Jawas"}, {"tag": "p", "text": "The two travel through the night with Kuiil riding a blurrg that draws a hoversled carrying the Mandalorian and the Child. The three approach the Jawa clan the following morning. The Jawas welcome Kuiil, who speaks their language, but takes affront to the Mandalorian's presence. When Kuiil notices the Jawas' hostility towards the Mandalorian, the latter admits to disintegrating several of them."}, {"tag": "p", "text": "Translating for the Mandalorian, Kuiil tells him that he needs to drop his weapons. The Mandalorian refuses since he claims that weapons are part of his religion. Kuiil responds that if he doesn't he won't be getting his parts back. The Mandalorian reluctantly complies. Kuiil also convinces the Mandalorian to leave his blaster behind. The Child watches from the sled."}, {"tag": "p", "text": "The Jawas offer to trade the Mandalorian's starship parts for his beskar armor. The Mandalorian refuses and trade barbs with the Jawas in their language. One of the Jawas tells that he sounds like a Wookiee. The Mandalorian loses his temper and tries to intimidate the Jawas with a flamethrower. However, Kuiil restrains him and takes over the negotiations. Since the Mandalorian is unwilling to trade his beskar armor, he asks what else can the Mandalorian trade."}, {"tag": "p", "text": "The leading Jawa proposes the Child but the Mandalorian tells them to get away from it. The Jawas deliberate and an interpreter tells Kuiil and the Mandalorian that they will return the Mandalorian's parts if he obtains the \"Egg\" for them. The Jawas chant for the \"Egg\" in their language."}, {"tag": "h3", "text": "Quest for the Egg"}, {"tag": "p", "text": "The Jawas allow the Mandalorian, Kuiil and the Child to ride with them inside the sandcrawler. The sandcrawler stops near a series of rocky formations. The Mandalorian and Child dismount and walk through the rocky formations towards a cave. He stands outside the cave and draws his weapon. The Child waits in his floating cradle while the Mandalorian ventures inside the cave. He brings a torchlight and sees several bones. The Mandalorian encounters a large horned creature known as the mudhorn, which drives him out of its den."}, {"tag": "p", "text": "Outside, the Mandalorian stands his ground and rushes to reload his blaster. The mudhorn charges forward and throws the Mandalorian against the mud. The mudhorn spots the Child's floating cradle and lunges forward but the Child dodges her. The mudhorn turns its attention back to the Mandalorian, who unleashes his flamethrower on the creature. This wounds the mudhorn but not enough to knock it out of combat."}, {"tag": "p", "text": "The mudhorn retreats back to its den but the Mandalorian latches onto it with a grappling line. The creature tosses him aside and attacks him with its horn and hooves, throwing him to the ground. The mudhorn charges at the Mandalorian, who unsheathes a blade. The Child helps the Mandalorian by using the Force to suspend the creature in mid-air. This gives the Mandalorian enough time to drive the blade through its head, killing it. The Mandalorian drives the knife deeper into the creature's skull."}, {"tag": "p", "text": "The Mandalorian approaches the Child, who is overwhelmed by his Force exertion and falls asleep in his cradle. The Mandalorian returns to the mudhorn's cave and retrieves an egg from the mud and straw. He realizes that the egg belongs to the mudhorn which he slew."}, {"tag": "h3", "text": "Delivering the Egg"}, {"tag": "p", "text": "Back at the sandcrawler, Kuiil tells the impatient Jawas to wait a little longer. The Jawas ignore him and retract their sandcrawler, preparing to departing. Just then, the Mandalorian and the Child return with the mudhorn's egg, Kuiil is pleased that his friends survived. The Jawas are excited and rush to receive the Egg from the Mandalorian. The Jawa chieftain slices the top off the egg with his knife. The Jawas feast on the egg yolk while the Mandalorian looks away."}, {"tag": "p", "text": "The Mandalorian speaks to Kuiil, telling him that he is surprised he waited. Kuiil responds that he is surprised that it took him so long. Kuill, the Mandalorian, and the Child return to the Razor Crest with their blurgg dragging the sled which is now laden with the recovered parts of the Mandalorian's ship. Then Kuiil asks the Mandalorian if the Child is still sleeping or is injured. The Mandalorian doesn't think the Child was wounded physically. Kuiil says he still doesn't understand what happened during the Mandalorian's fight with the mudhorn. The Mandalorian admits neither does he. They approach the wrecked Razor Crest."}, {"tag": "h3", "text": "Repairs and departure"}, {"tag": "p", "text": "The Mandalorian thinks that it would take him days to fix the Razor Crest without a proper maintenance facility. Kuiil helps the Mandalorian to repair the ship, saying there is much work to do. Working together, they manage to repair and restore the ship's systems and parts."}, {"tag": "p", "text": "Later, the Mandalorian tells Kuiil that he cannot thank him enough and offers to share part of the reward. Kuiil says that he cannot accept it because the Mandalorian is his guest and that he is therefore in the Mandalorian's service. The Mandalorian tells Kuiil that he could use a crew member of his ability and offers to pay him handsomely. Kuiil says that he would be honored but that he has spent a lifetime working to be free of servitude."}, {"tag": "p", "text": "The Mandalorian understands and thanks the Ugnaught. Kuiil in return thanks the Mandalorian for bringing peace to his valley before mounting his blurrg. Before leaving, he wishes a blessing on the Child, hoping that it would bring a handsome reward for the Mandalorian. It says he has spoken as the Mandalorian watches."}, {"tag": "p", "text": "The Mandalorian heads to the cockpit with the Child. He fires up the Razor Crest's engines. Watching from outside, Kuiil waves goodbye as the Mandalorian's ship flies off into the sky above and then space. The Mandalorian watches over the sleeping Child in silence during the flight. The Child begins to stir in its cradle and cries."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "The episode's musical score by Ludwig Göransson was released digitally the same day as the episode itself."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}