{"url": "Charger", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Articles to be expanded", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Charger"}, {"tag": "p", "text": "\"Charger\" was the nickname of a clone trooper who served in the Grand Army of the Republic as part of the 501st Legion during the Clone Wars. He was part of a team sent on a mission to Lola Sayu to free Republic prisoners from The Citadel. As the team scaled a cliff to reach the facility, Charger's foothold crumbled underneath him as he neared their entry point, causing him to fall and die on an electromine."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Charger was one of the many clones of Jango Fett grown on Kamino."}, {"tag": "h3", "text": "Infiltrating the Citadel"}, {"tag": "p", "text": "Over one year into the Clone Wars, Jedi Master Even Piell was captured by the Separatists and imprisoned in the Citadel on Lola Sayu. Charger was one of the clones assigned to a rescue team under the command of generals Obi-Wan Kenobi and Anakin Skywalker that would infiltrate the prison and save Master Piell."}, {"tag": "p", "text": "The team was frozen in carbonite and had reprogrammed battle droids fly a shuttle to fool the enemy life form scanners and get the frozen team on Lola Sayu. Once there, the team was unfrozen and the mission started."}, {"tag": "p", "text": "In order to get into the facility, the group had to free climb a wall covered with electromines to reach a small entrance platform. A droid patrol came to the platform and locked the door with a ray shield. Fortunately, Skywalker's Padawan Ahsoka Tano was able to crawl through a ventilation shaft and deactivate the shield. The team then climbed to the entrance platform. Charger was one of the last team members to reach it. Unfortunately, when fellow clone Fives tried to help him up, Charger stepped on a loose piece of stone that immediately broke off, causing Charger to lose his balance and fall straight into an electromine, killing him instantly. This alerted the entire facility and made it more difficult for the team to reach the prisoners."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of Jango Fett, Charger stood at 1.83 meters."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Charger wore Phase I clone trooper armor with the blue markings of the 501st Legion. He used a standard DC-15A blaster carbine and wore a backpack."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the episode, Charger was voiced by Dee Bradley Baker, who voices all clone troopers through the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}