{"url": "Charhound", "categories": ["Category:Canon articles", "Category:Canines", "Category:Creatures of Elphrona", "Category:Creatures of unspecified diet", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Charhound"}, {"tag": "p", "text": "Charhounds were a type of hound that could be found on the ore planet of Elphrona in the Outer Rim Territories. One charhound, Ember, was considered a member of the Jedi of Elphrona Outpost during the time of the High Republic."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Charhounds were small, four-legged creatures native to Elphrona. They were fast and could run long distances as quickly as a steelee. They had high internal body temperatures, and the amount of heat they emanated varied across the creature's coloration. When provoked, they could shoot yellow flame from their mouth."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Charhounds were social animals that could form bonds with other creatures and would fight to protect them. They could communicate with purring noises, barks, and coughs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "An undernourished charhound appeared at the Jedi Outpost on Elphrona with an infected wound. The Jedi in residence—Porter Engle, Indeera Stokes, Loden Greatstorm, and his Padawan Bell Zettifar—cared for her and allowed her to stay. Zettifar named her Ember."}, {"tag": "p", "text": "She accompanied the Jedi in a Vanguard on a mission to rescue members of the Blythe family. The Nihil attacked the colonists at their homestead and kidnapped them. The Jedi chased after the marauders on steelees after mole mines destroyed the Vanguard. Porter Engle broke away from the others to deal with ambushing Nihil snipers. Ember killed one of the marauders at an opportune moment by spitting a gout of yellow flame from her mouth and saved Engle's life."}, {"tag": "p", "text": "Zettifar brought Ember to the ceremony that marked the opening of the Starlight Beacon in 232 BBY. It was unusual for a Jedi to have an animal companion, but it was overlooked given Zettifar's connection with the charhound and the recent loss of his master to the Nihil."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The charhound was created for the Star Wars: The High Republic multimedia project, and was first revealed in an article on StarWars.com, which showed concept art of Ember the charhound with Bell Zettifar. They first appeared in the 2021 novel The High Republic: Light of the Jedi by Charles Soule."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}