{"url": "AT-ACT_driver", "categories": ["Category:Canon articles", "Category:Imperial military specializations"], "nodes": [{"tag": "h1", "text": "AT-ACT driver"}, {"tag": "p", "text": "AT-ACT drivers were Galactic Empire army units who piloted All Terrain Armored Cargo Transports. They wore white Imperial tank pilot armor, with some drivers' breastplates featuring markings matching those found on Imperial combat assault tank commander armor, along with a white coastal defender stormtrooper helmet that was adorned with grey and red markings, including a red Imperial crest located on the pilot's helmet. The drivers were issued either E-11 or E-22 double barrel blaster rifles to carry as personal weapons. Despite their existence, specialized AT-ACT driver divisions were not used due to the fact that the AT-ACT was not considered a battlefield assault vehicle."}, {"tag": "p", "text": "During the Galactic Civil War between the Empire and the Rebel Alliance, AT-ACT drivers were stationed at the Imperial security complex on the planet Scarif. In 0 BBY, the Rebel squad \"Rogue One\" infiltrated the Imperial facility to steal the Death Star plans and kick-started the Battle of Scarif. During the battle, AT-ACT drivers used their walkers to engage the Rebel ground forces, initially proving effective and driving them back. However, the AT-ACTs were quickly destroyed when the Rebels received support from the Alliance Fleet, with Blue Squadron's T-65 X-wing starfighters and UT-60D U-wing starfighter/support craft making short work of the walkers. The security complex itself was later destroyed by the Death Star under orders from Grand Moff Wilhuff Tarkin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "AT-ACT drivers were created and developed for the 2016 film Rogue One: A Star Wars Story. However, the unit first appeared as a 3-3/4\" figure within Hasbro's Rogue One toy line, being included with the Rapid Fire Imperial AT-ACT toy (alongside figures of Jyn Erso and C2-B5) released in November 2016. The artwork on the Rapid Fire Imperial AT-ACT's packaging contains a discrepancy, depicting the AT-ACT driver's helmet with the red symbol found on the shoretrooper helmet, instead of the red Imperial crest found on the actual included figure's helmet and in the film."}, {"tag": "p", "text": "Despite the existence of AT-ACT driver toys, a blurb in the reference book Star Wars: Rogue One: The Ultimate Visual Guide, written by Pablo Hidalgo and released on the same day as the film, claims that no specialized corp of pilots existed for the AT-ACT, despite the fact that that exact blurb was next to an image of an AT-ACT driver helmet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}