{"url": "Charric/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Carbines", "Category:Chiss weapons", "Category:Maser weaponry", "Category:Rifles"], "nodes": [{"tag": "h1", "text": "Charric"}, {"tag": "p", "text": "The Charric was a Chiss ranged weapon. The term was often used specifically to denote personal weapons, including pistols and larger handguns similar in appearance to a two-handed blaster rifle, but it could also be applied to more powerful weapons mounted on vehicle hard points, and the much larger Megamaser artillery."}, {"tag": "p", "text": "Charrics fired a blue beam sometimes described as a maser-guided particle discharge. By delivering both kinetic and thermal energy, the charric, like the blaster rendered most ceramic and polymer-based armors ineffective, but unlike the blaster caused an electric shock upon contact with metallic armors. Charrics were unable to be reflected by lightsabers, and also carried far more kinetic energy, with the \"enormous impact\" of the bolts being substantial enough to physically wear down a Jedi Knight to the point of having their lightsaber knocked from their grasp."}, {"tag": "p", "text": "Some were equipped with stun settings which shut off the particle beam and replaced the maser with a green EM-charge tuned to neurological patterns, though more damaging burn settings to incapacitate targets seem to have also been available. Charrics, while accurate, had shorter ranges than blasters, especially the handgun models. The charric handgun had a power pack that had to be replaced after forty shots and had an effective range of eight meters."}, {"tag": "p", "text": "Although the Republic at large did not know of the Chiss until the Imperial Era, the charric could still be found on Republic worlds as early as 3951 BBY, such as Onderon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}