{"url": "Chase_on_Pantora", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles in the Sujimis sector", "Category:Events during the Imperial Era", "Category:Missions of Clone Force 99"], "nodes": [{"tag": "h1", "text": "Chase on Pantora"}, {"tag": "p", "text": "Early in the Imperial Era, a chase occurred in the city of Ro Station on Pantora after the mercenary Fennec Shand attempted to kidnap the child clone Omega. The girl had escaped Kamino with the fugitive Clone Force 99, and Shand had been hired to track her down. When she was alerted to the fugitives' presence on Pantora for a supply run, Shand tracked Omega down after she was separated from Hunter in the central marketplace, posing as a friendly face before her true colours were revealed when Hunter caught up to them. The ensuing pursuit drew the attention of the Pantoran Security, who attempted to arrest all of the suspects involved. Eventually, however, Hunter was able to rescue Omega, and the fugitives swiftly departed the moon, although Shand intended to continue her pursuit."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Omega was an enhanced clone created by the Kaminoans during the last years of the Galactic Republic, one of only two clones created with the unaltered DNA of clone template Jango Fett. She worked as Doctor Nala Se's medical assistant in Tipoca City, the scientist having become personally attached to her. During the Clone Wars, Omega became fascinated by the experimental Clone Force 99, a unit composed largely of genetically defective clones who served as clone commandos in the Republic Military. In 19 BBY, the Clone Wars ended with the reorganization of the Republic into the Galactic Empire by the self-declared Emperor Palpatine, supposedly to provide security to the galaxy. The so-called \"Bad Batch\" had returned to Kamino shortly before the declaration, and Omega introduced herself to them afterwards."}, {"tag": "p", "text": "Shortly thereafter, Admiral Wilhuff Tarkin arrived on Kamino to inspect the clone troopers, informing Kaminoan Prime Minister Lama Su that the Empire did not intend to continue its contracts with the Kaminoans for the production of clones. Tarkin noticed the Bad Batch and was impressed by their combat skills, but uncertain about their loyalty to the Empire, being particularly concerned about whether they had executed Order 66, a command engineered into the clones by implanted inhibitor chips which made them unthinkingly loyal and had forced them to turn on and kill their Jedi commanding officers. Most of the Bad Batch was immune to the command due to their various modifications. Tarkin decided to send the squad on a mission to test their loyalty. Omega overheard Tarkin's plans and attempted to warn Clone Sergeant Hunter not to go on the mission, asking him not to return to Kamino and to take her along. He initially turned her down, but after realizing that Tarkin had wanted his unit to murder civilians he realized she had been right. When Tech revealed he had deduced Omega was an enhanced clone, Hunter decided to return to Kamino to rescue her before defecting from the Empire."}, {"tag": "p", "text": "The Batch was arrested on their arrival and locked up in the same cell as Omega, who had been detained by the Coruscant Guard when they found her snooping in the Batch's barracks. She agreed to leave with them, and the squad eventually escaped their cell. After reaching the hangar where their starship, the Havoc Marauder, had been stowed, the Batch and Omega were confronted by Imperial shock troopers led by Crosshair, a former member of the squad who had been brainwashed to serve the Empire. The Batch was covertly assisted in their subsequent escape by Nala Se, who remotely overrode the hangar door controls after Crosshair had ordered it shut. Afterwards, Nala Se reported the escape to Lama Su, who told her to say nothing to the Imperials until their motive was clear."}, {"tag": "p", "text": "The Imperials continued their plans to replace the clones with recruited soldiers through the arrival of the first Elite Squad to Kamino for training under Crosshair, which alarmed the Kaminoans. Lama Su and Nala Se discussed plans to regain the Empire's favour through a new type of experimental clone. However, they required genetic material from clones who would not return willingly, although Lama Su was confident they would only need one donor. In order to track down Omega, the Kaminoans hired the up-and-comer bounty hunter Fennec Shand on a special commission."}, {"tag": "p", "text": "While on the run, Hunter had an idea for the fugitives to lie low on Idaflor, which was uninhabited. However, a lack of fuel and supplies and the news that their ship's magnetic signature had been placed on a wanted list led the Batch to make a supply run to Pantora, where Tech would also be able to alter the Havoc Marauder's signature key."}, {"tag": "h2", "text": "The chase"}, {"tag": "h3", "text": "Ratted out"}, {"tag": "p", "text": "The Marauder arrived on Pantora at a landing bay located in the city Ro Station. The bay's security manager, the Sullustan Raspar Six, greeted Tech and Wrecker when they disembarked, stating that he had to run their ship's signature. Tech eventually bribed him not to after Six insinuated that he was open to monetary persuasion, and he and Wrecker set about working on accessing the ship's signature key. Six, however, privately contacted Shand, who had alerted her contacts to be on the lookout for the modified Omicron-class attack shuttle. Shand informed the Sullustan that she would arrive shortly, telling him to prevent the shuttle from leaving. When she reached the moon, she landed her own starship in another bay managed by Six."}, {"tag": "p", "text": "Echo, wearing a disguise which incorporated his extensive cybernetics, headed into the city with Hunter and Omega to obtain supplies. Hunter brought along a pyro denton explosive which he hoped to sell for some more credits. Eventually, the trio reached a shop run by a Gran trader. As Omega looked around, spotting some dolls for sale, the merchant refused to buy Hunter's explosive, telling him he would get more for it on the black market. The trader then mistook Echo for a droid and offered 2,000 credits for him. Hunter decided to negotiate for the sale and persuaded Echo to go along with it as the Batch was badly in need of credits, saying he would contact him to return when it was time to leave."}, {"tag": "h3", "text": "Lost in the market"}, {"tag": "p", "text": "While Hunter and Echo had been dealing with the merchant, Omega, having taken a doll, was distracted by some voorpaks being transported through the central marketplace and wandered over to look at them. One of the creatures took the toy in its mouth, and she chased after the repulsorcart to try and retrieve it. Omega very quickly became lost and frightened in the marketplace, and panicked after retrieving the doll, bumping into a passerby and falling to the ground before nearly being hit by a speeder bike and spooked by a caged animal. Shand had located Omega and her guardians earlier, and with her helmet off, approached the girl as a friendly face, asking her if she was lost before offering to help her find her friends."}, {"tag": "p", "text": "Hunter only noticed Omega was gone after the \"sale\" went through and the merchant took his new \"droid\" into the back room, and began to track her down, eventually locating the lost doll. Shand asked if Omega was hungry, and stole some fruit from a passing vendor for them to eat. The theft made Omega uneasy, but Shand explained that it was okay to occasionally break rules. Having spotted Shand's blaster pistol under her kama when she had knelt down, Omega asked her why she was carrying a weapon, and Shand said it was for protection. Believing that Shand was lonely, Omega suggested that she should come with the girl and her friends. At that point, Hunter caught up to them and shouted to Omega. Realizing that the woman was suspicious, he told Omega to get away from her. Shand put her helmet on and drew her pistol, firing at Hunter. Omega grabbed her arm and attempted to stop her, while Hunter threw his vibro-knife at the bounty hunter."}, {"tag": "p", "text": "Shand caught the knife in an object which she used as a shield, engaging in a fight with Hunter as Omega watched. Hunter was backed up into a stall by Shand as he dodged her knife attacks, and he told Omega to run. He managed to grab the mercenary's wrists and force her to drop his knife and her pistol, but she headbutted him, which momentarily stunned him. Alerted to a disturbance, three Pantoran Security guards approached and ordered her to stand down, so Shand retrieved her pistol and ran off in pursuit of Omega."}, {"tag": "h3", "text": "Pursuit"}, {"tag": "p", "text": "Hunter shortly came around and contacted the other Batch members on his comlink: Tech and Wrecker had been dismantling the Havoc Marauder and had just retrieved its signature key, while Echo was in the merchant's back room, where he had been told to supervise the trader's droids and had intimidated the protocol droid CG-67 into not reporting his deception. The sergeant asked Tech to get the shuttle operational and to patch into the city's CCTV system to locate Omega, explaining the situation. Tech reported that he would need a whole team of repair droids to fix the ship that quickly, and Echo told him he had it covered, recruiting the merchant's astromech droids to assist. When CG-67 protested as all the droids were equipped with restraining bolts, Echo said he could remove them. Wrecker, meanwhile, set out in search of Omega."}, {"tag": "p", "text": "Omega ran through the marketplace in a blind panic before eventually locating a hatch into the city's maintenance tunnels and entering it. Tech located the girl during her blind flight, noting the security force's response and where she had gone, and also Shand's subsequent discovery of the hatch. Omega fled into the sewer, running headlong until she encountered Wrecker. However, Shand shortly caught up to them, and Wrecker told Omega to run while he engaged the mercenary. As Omega ascended a nearby exit ladder, however, Shand used Wrecker's momentum against him to knock him unconscious by sending him into the wall before continuing her pursuit. The ladder Omega climbed led to the top of a maintenance tower in the lower division, and she was alarmed after emerging and sealing the hatch to find herself so high up. When Shand shot out the lock from inside, Omega was startled and fell off the ledge, grabbing on by her hands."}, {"tag": "p", "text": "Echo departed the merchant's shop with the droids, with the revelation that he was not a droid surprising the merchant too much for him to make any attempt to stop them. They reached the landing pad where the Marauder was located, beginning work on putting the ship back together. Tech learned of Omega's predicament via the security channels and informed Hunter she was hanging from a tower over the skyway, leading him to steal a speeder bike and head for the rescue. Wrecker regained consciousness in the sewer and contacted Tech, who told him that Hunter was on Omega's trail and to return to the ship. Omega lost her grip but was caught by Shand from above. Spotting Hunter approaching in the distance, the bounty hunter located a hovertruck carrying relatively soft cargo passing below and told the girl to tuck and roll when she landed, dropping Omega into the vehicle's bed before jumping in herself."}, {"tag": "h3", "text": "Escape"}, {"tag": "p", "text": "Hunter witnessed the fall as he approached, and Shand drew her pistol and waited for him to get closer before opening fire. Omega spotted the hovertruck's dump lever and pulled it, causing the vehicle's bed to rise while the driver remained oblivious. Shand fell out and lost her grip on her pistol, with both woman and weapon landing on a ComfortRide Passenger Airspeeder. As the cargo began littering the space below, Omega grabbed one of the straps which had been securing it and held on for dear life. Two Pantoran Security guards on speeder bikes saw the commotion and began pursuing the vehicles. Hunter got in close to Omega, holding his hand out to her. However, Shand climbed onto the airspeeder she had fallen onto, throwing out the man driving it and hijacking the vehicle. Omega barely had time to warn Hunter before Shand rammed his bike with her speeder, sending him flying out of the skyway, although he managed to stay on the bike."}, {"tag": "p", "text": "Noting the pursuers, Shand retrieved her blaster and shot one of the guards, causing his bike to collide with that of the other guard and then into a building. Shand approached the hovertruck, which Omega was still hanging from, fearful of the mercenary. Hunter regained control of his speeder bike and approached the scene from above, drawing his own blaster pistol and shooting out the engines of Shand's airspeeder. He then raced to get to Omega as the girl finally lost her grip, managing to catch her just above a taxi and pulling her onto his bike. Taking out the explosive he had intended to sell, Hunter reversed his speeder bike and passed over Shand's airspeeder, tossing the bomb onto her vehicle before speeding off. Shand escaped just before the airspeeder exploded, bouncing off of a taxi before landing in the street below as the vehicle's wreckage crashed. Injured in the fall, she could only watch as Hunter and Omega fled."}, {"tag": "p", "text": "A further police presence was mobilized in response to the incident, which Wrecker witnessed on his way back to the hangar, leading him to wonder what he had missed. Echo and the droids finished repairing the Havoc Marauder, and CG-67 led her charges away just as Hunter and Omega arrived at the hangar, the sergeant explaining that they needed to go. Wrecker arrived immediately afterwards, and they boarded their shuttle. Raspar Six attempted to stop the clones from leaving, but was unsuccessful as the Marauder took off."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Bad Batch discussed the incident, and Hunter decided to postpone his plans to go to ground as he realized Shand had to have been a bounty hunter. Deducing that Omega had been her target, although the girl was not even aware of what a bounty hunter was, Hunter decided that they had to find out who Shand was and who had hired her."}, {"tag": "p", "text": "On Pantora, Shand returned to the platform where she had landed her starship. Raspar Six was terrified that she intended to kill him, protesting that he had attempted to stop the clones from leaving, but Shand paid him a credit chip and told him he knew how to contact her if they returned. Contacting her employer, Shand reported that the target had escaped, but that she would find her."}, {"tag": "p", "text": "The Batch travelled to Ord Mantell to visit the information broker Cid, a former Jedi contact whom Echo had heard of. After carrying out a job for her as payment, the Trandoshan was able to identify Shand for them, explaining that she was new to the bounty hunting scene but had already made an impression. However, Cid was unable to identify her employer, although her sources in the Bounty Hunters' Guild had stated Shand was working on commission. Cid was curious about how much the Batch was worth for Shand to be coming after them."}, {"tag": "p", "text": "The Batch began working for Cid, carrying out more jobs at her behest. One mission led to the squad being reunited with a friend of theirs, Captain Rex, who had them meet him on Bracca to surgically remove their inhibitor chips in a wrecked Jedi Cruiser after learning they had not yet done so. In the aftermath, Hunter was spotted on the wrecked starship by members of the Scrapper Guild, who reported the intruders to the Empire. Crosshair was dispatched to terminate the Batch, despite Lama Su's request for them to be captured as they were valuable assets. Concerned that Omega might be killed, ruining their contingency plan before the Kaminoans could get her back, Lama Su hired another bounty hunter, Cad Bane, to abduct her, despite Nala Se's concern that they already had someone handling it. Bane successfully seized Omega after a confrontation with Hunter, whom he severely injured and left for dead."}, {"tag": "p", "text": "Bane was due to hand Omega over to the Kaminoans at an abandoned facility on Bora Vio. However, Nala Se did not agree with Lama Su's plans to have Omega terminated after the necessary genetic material had been extracted, and sent Shand to the planet to rescue her. The girl escaped while the two bounty hunters fought, being rescued by the Batch after she managed to alert them to her location. When Shand reported Omega's escape to Nala Se, the scientist deemed it acceptable as Omega was still out of Lama Su's hands, paying Shand in full. Shand told Nala Se that she knew how to contact her if she needed her services again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}