{"url": "Chass_na_Chadic", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Alphabet Squadron personnel", "Category:Children of the Empty Sun", "Category:Females", "Category:Hound Squadron personnel", "Category:LGBTQ+ individuals", "Category:Partisan members", "Category:Riot Squadron personnel", "Category:Theelins"], "nodes": [{"tag": "h1", "text": "Chass na Chadic"}, {"tag": "p", "text": "Chass na Chadic was a Theelin female who served as a pilot for multiple groups, starting with the Cavern Angels, and eventually joined the Rebel Alliance's Hound Squadron, where she flew a A/SF-01 B-wing starfighter, during the Imperial Era. Chadic continued to serve with Hound Squadron after the Battle of Endor until it was destroyed. Chadic then joined the New Republic's Alphabet Squadron and continued to fly a B-wing."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Chass na Chadic was a Theelin female who was a pilot for the New Republic. Growing up in the Empire, who were adamantly xenophobic, Chadic struggled to carve out an identity as a Theelin without any guidance. Throughout her life, Chadic had seen her heroes die while fighting for freedom, while she had been left behind. At one point, Chadic working on the planet Uchinao in the Five Points system when she was attacked by a street gang. However, before they could rob her, Chadic was saved by a woman that called herself Liana Hallik. A year later, when Chadic was on Koiogra, she realized the true identity of her savior when she robbed a black-market shop that sold holovids stealing music, which she began a collection of music to listen and sing along with during battle, and a rebel propaganda video. Upon viewing it, she realized who that she had met Rebel Alliance hero Jyn Erso, and began to idolize her. Before joining the Rebel Alliance, Chadic traveled to Jedha and flew with the Cavern Angels and at one point, was associated with the Unignited Stars."}, {"tag": "p", "text": "At one point, Chadic joined Hound Squadron and began to fly a A/SF-01 B-wing starfighter. Chadic once stole fellow Hound Squadron member Yeprexi's ship and crashed it into a bog, but fortunately, Yeprexi never told any of their superiors about it."}, {"tag": "p", "text": "Chadic later flew with Hound Squadron on a recon mission aboard the Hellion's Dare, which was stationed on the planet Jiruus. The Hellion's Dare received a transmission from a scout that caused the 204th Imperial Fighter Wing to pursue them. Chadic and Hound Squadron flew alongside the RZ-2 A-wing interceptors of Riot Squadron to defend the frigate. When Riot Squadron pilot Nasi Moreno was seen surrounded and never turned up after the jump to hyperspace, Chadic became furious when Riot Squadron's leader, Rununja, declared Moreno killed in action. As the Hellion's Dare flew into the Oridol Cluster, the squadrons were pursued and their pilots were methodically picked off one by one. Chadic scored the first kill and was ironically dubbed the \"Queen of Starfighters\" by Riot Squadron pilot Sata Neek. In the next battle, Chadic's close friend Fadime was killed, and despite previously thinking the funerals were silly, Chadic was reduced to tears at Fadime's."}, {"tag": "p", "text": "After numerous attacks, the squadrons reformed into one group under the leadership of Rununja. Chadic's callsign changed to Riot Ten. When Kreskian, the captain of the Hellion's Dare ordered the new squadron to attack the 204th's Quasar Fire-class cruiser-carrier, Chadic flew alongside two other former Hound Squadron pilots Merish and Glothe. When Glothe was killed, Chadic and Merish successfully damaged the enemy cruiser-carrier, but returned to the Hellion's Dare and saw their ship's engines in flames and hyperdrive disabled. The new squadron was eventually decimated in multiple ensuing confrontations, leaving only Chadic and Wyl Lark to flee. They were rescued by a working group led by Agent Caern Adan, and they later melded into Alphabet Squadron under the command of Lieutenant Yrica Quell with Nath Tensent and Kairos."}, {"tag": "h3", "text": "Serving Alphabet Squadron"}, {"tag": "p", "text": "Chadic, still angry with Lark and not entirely trusting of any of her new squadron members, remained hard to reach as the squadron did exercises in the Gobreton minefield and in the flight simulators onboard the Lodestar. At one point, Chadic skipped out on a squadron briefing and volunteered herself to join a group of New Republic Special Forces on a mission. When Quell learned of her behavior, she lost her composure and shoved Chadic into a wall."}, {"tag": "p", "text": "When Alphabet Squadron was sent on a reconnaissance mission to the planet Abednedo, Chadic landed on the planet with Quell and Kairos while Lark and Tensent stayed in orbit. Chadic and Quell advanced into Neshorino and met with a Verpine smuggler, who showed them a group of Imperial prisoners. When Chadic escorted one of the prisoners, a stormtrooper sergeant, back to Kairos, she was attacked by a group of stormtroopers. Using the prisoner as a shield, she made her way to Kairos, who was dispatching the troopers with her Bowcaster. Quell then ordered Chadic and Kairos to take the prisoner into orbit. Chadic watched as the freighter escorting the other prisoners was destroyed, and returned with the squadron to the Lodestar with the sergeant."}, {"tag": "p", "text": "Eventually, Alphabet Squadron received its next mission and was sent to a moon of the planet Harkrova for a salvage mission. On the hike down from the mountain where they landed to the supply cache, Chadic took the time to thank Kairos for her help in saving her during the mission to Abednedo, which Kairos silently acknowledged. Chadic continued to ignore Lark, who she still held responsible for interfering with her efforts in the Oridol Cluster. However, when Lark called upon her to tell a story as Tensent, Kairos, and himself had already done, Chadic told the story of when she met Jyn Erso."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Chadic grew up struggling with her identity as a Theelin and felt the xenophobic influence of the Empire. After realizing she met Jyn Erso, she was inspired to do something great and went on her own sort of pilgrimage by joining the Cavern Angels and eventually the Rebel Alliance. She held a grudge after Wyl Lark's actions in the Oridol Cluster and took her time in forgiving him. During the assault on Pandem Nai, she almost rammed a cruiser as she regretted that she lived while many of her heroes had died. She had a contentious relationship with fellow pilot Lark, who Chadic felt had taken away her agency when he forced them to retreat from the Cluster. Chadic often played music when flying."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chass na Chadic first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed. Freed assigned Chadic to the B-wing of Alphabet Squadron, feeling that her traits matched the starfighter's nature. His original plans for the Star Wars: Alphabet Squadron trilogy included Chadic's interactions with the Children of the Empty Sun cult in the second installment, Shadow Fall, and her character's change as a result."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}