{"url": "Chatook", "categories": ["Category:Legends articles", "Category:Kashyyyk residents", "Category:Males", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Chatook"}, {"tag": "p", "text": "Chatook was a male Wookiee living in Kachirho on Kashyyyk during the Galactic Civil War in 1 ABY. He was the father of Takook, who was friends with a fellow Wookiee named Lobarorr."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 1 ABY, Chatook had become worried about the disappearance of his son, Takook, and hired a spacer who was visiting Kashyyyk to find out what happened to him. Chatook informed the spacer that his son had last been seen with his friend, Lobarorr, on their way to the Rryatt Trail."}, {"tag": "p", "text": "The spacer started their search near the trail's entrance gate, but to no avail. Traveling back to Kachirho, the spacer found Takook's corpse rather close to the city. Near the body the spacer discovered a datapad, onto which Takook had recorded his last words. He revealed that his supposed friend, Lobarorr, had become jealous of his weapon, a long spear once used by Chatook. In a jealous rage, Lobarorr attacked Takook and stole the weapon. He shortly came to his senses and after seeing what he had done and believing his friend to be dead had fled to the Shadowlands in the Ryatt Trail, both in grief and hoping to escape judgment. Takook pleaded with whomever might find his recording to retrieve his father's weapon and return it to him."}, {"tag": "p", "text": "The spacer made their way down the Ryatt Trail, into the depths of the Shadowlands and finally discovered Lobarorr. Unwilling to negotiate, Lobarorr attacked the spacer, but was easily outmatched. Lobarorr was killed and the spacer retrieved the weapon from his corpse. He returned to Chatook with the weapon and the unhappy news of his son's demise. Chatook was thankful for the honor the spacer had shown in avenging the death of his son and rewarded the spacer with 2,500 credits and replica of the weapon in question, known as the Kashyyyk Bladestick. Chatook then requested to be left alone to grieve, a wish that the spacer granted."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chatook was a non-playable character in Star Wars Galaxies prior to its closure on December 15, 2011. He, along with the planet Kashyyyk, were added to the game in 2005 with the Rage of the Wookiees expansion pack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}