{"url": "Chazwa/Legends", "categories": ["Category:Legends articles", "Category:Chazwa locations", "Category:Fortress worlds", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Orus sector planets", "Category:Perlemian Trade Route", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Chazwa"}, {"tag": "p", "text": "Chazwa was a cold planet in the Chazwa system of the Orus sector, located in the Inner Rim. Its location along a popular freighter traffic route made it an ideal shipping center for all sorts of goods. As such, heavy freighter traffic within the system was not an uncommon sight. However, the abundance of valuable merchandise moving through the system lent itself to strong influence by smugglers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Chazwa orbited a small white dwarf star in the Chazwa system in the Orus sector of the Inner Rim region of the galaxy and was situated between Joiol and the Relatta system on the Perlemian Trade Route. It was a medium-sized terrestrial planet whose terrain included plains. The world possessed a moderate amount of natural resources and featured a breathable atmosphere, standard gravity, a temperate climate, a moderate hydrosphere, and mild weather. Chazwa boasted a thriving shipping industry due to its favorable location, and the world's local economy received income from a combination of manufacturing and agriculture. The planet exported information, agricultural products, and technology while importing foodstuffs and medicine."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Chazwa was part of the Galactic Republic by around 22,000 BBY and was within space controlled by the Republic during the Clone Wars. During the later years of the Galactic Empire, the Interdictor cruiser Rampart was assigned to the system to reduce smuggling in the area."}, {"tag": "p", "text": "Chazwa was a fortress world of the Galactic Empire by 4 ABY, but the Empire abandoned it in 5 ABY. It was a New Republic stronghold during the Zsinj campaign of 7–8 ABY and during subsequent campaigns in 8 ABY, but it was lost in 9 ABY during the Thrawn campaign."}, {"tag": "p", "text": "During his campaign, Grand Admiral Thrawn tricked the New Republic into believing Chazwa was one of his clone sources. By 137 ABY, Chazwa was within the territory of the Galactic Empire of Darth Krayt."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Chazwa was habitable to Humans and a number of alien species. Most of Chazwa's 3.5 billion sentient inhabitants were Humans."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places the Orus Sector and, consequently, Chazwa, in the Outer Rim Territories."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}