{"url": "Chelli_Lona_Aphra", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Accresker Penal Legion members", "Category:Archaeologists", "Category:Chelli Lona Aphra's crew", "Category:Con artists", "Category:Females", "Category:Humans", "Category:LGBTQ+ individuals", "Category:Slicers", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Chelli Lona Aphra"}, {"tag": "p", "text": "Chelli Lona Aphra was a human female archaeologist recruited by Darth Vader after the Battle of Yavin. Aphra, along with her assassin droid companions, 0-0-0 (Triple-Zero) and BT-1 (Beetee), fulfilled several missions for the Sith Lord before falling out of his favor, and after faking her own death, continued to roam the galaxy with the two droids. Aphra went by the alias Joystick Chevron, first when introducing herself to recurring adversary and occasional romantic partner Magna Tolvan, and later during her time serving in the Accresker Penal Legion."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "h4", "text": "Family issues"}, {"tag": "p", "text": "Chelli Lona Aphra was a human female born in the year 24 BBY to Korin and Lona Aphra—her father and mother, respectively. The Aphras retained a house in the University Quarter on the Second Moon of Thrinittik, a peaceful world free from the strife that had broken out across the galaxy during the Separatist Crisis and the Clone Wars."}, {"tag": "p", "text": "Young Chelli—known affectionately as \"Little Boop\" to her mother and father—often observed the latter's work as a dedicated scholar. She absorbed information as he spoke about subjects, such as the extinct Massassi species and their Massassi piece crystals. Korin specialized in researching the ancient Ordu Aspectu, a nearly-forgotten splinter group of the Jedi Order that disappeared with little trace millennia before Chelli's birth during the Republic Era. After the Great Jedi Purge, Korin began neglecting his family to focus on his work, believing it would make the galaxy safer for his daughter by restoring the light that had died with the Jedi. The Jedi were a group of spiritual followers of the the Force who had served as the primary peacekeepers of the Republic for thousands of generations. While the Jedi were dedicated to the light, they had counterparts in the dark side of the Force called the Sith. The existence of the Sith was doubted by the time Chelli was born, but the Sith Lord Darth Sidious was secretly responsible for the galactic strife. The Sith's long-last artifacts were said to be deadly and destructive, but Chelli found her father's stories of them much more interesting than those of the Jedi. It seemed to Chelli that Korin only paid attention to her when she pretended to be interested in his Jedi research."}, {"tag": "p", "text": "Lona struggled in her marriage due to her husband's obsession with locating the Ancient Aspects of the Jedi and what she saw as his need to achieve greatness. Although she never outright hated him, they disagreed on what was best for Chelli. Lona would not compromise on that, and thought her family should both live without fear of consequences and make a new home in the middle of nowhere. The couple would argue about Korin's research when they thought their daughter was asleep. Even when she was only six years old, Chelli understood that she could get them to stop fighting if they paid attention to her instead."}, {"tag": "p", "text": "One night, Chelli interrupted her parents while they argued about Korin's plan to secure records from the university library on the Fifth Moon of Thrinittik before they could be destroyed by the Republic's successor state, the totalitarian Galactic Empire that was ruled by Sidious in his public guise as Emperor Palpatine. Chelli's father asked her if she would like to stay home and play with her pet tooka or join him on an adventure. Wanting her father's attention and the thrill of possible danger, she agreed. It turned out he invited her in part because she was small enough to slip into narrow spaces to locate hidden materials, cute enough to distract the librarians while her father gathered up the materials, and able to help carry them after he bribed a librarian. She was later certain that was the event that made her mother decide to leave her husband and take their child with her."}, {"tag": "p", "text": "Examining his findings from the library, Korin realized his collection of stolen memory crystals that the Imperials had marked for the garbage compactor were indeed genuine; he had recovered Jedi heresiologes, including an account of Oo'ob called \"The Crimes of Jedi Renegade Oo'ob the Apostate.\" Korin was excited about the findings and their potential to help him restore the Ordu Aspectu or find the Lost Citadel of Garn. Preoccupied with his discovery, he did not notice Chelli cut her finger on one of the crystals. Lona did not share his excitement, as his research could get the family marked by censors for a firing squad, and Chelli did not understand why her father did not seem to care about her injury. Lona told Chelli to pack some of her things for a trip, and they left Korin behind."}, {"tag": "h4", "text": "Arbiflux"}, {"tag": "p", "text": "Lona Aphra moved Chelli to a homestead on Arbiflux, a forest world in the largely primitive Outer Rim Territories. Their new homestead, however, was experiencing a drought, leaving it surrounded by dry grass and dying trees."}, {"tag": "p", "text": "At their new homestead, they farmed nunas, which Chelli hated and called dumb, evil fartbirds. Her mother admonished her not to call things evil, even the Sith. Lona said it was called the dark side because they kept in the dark to be secretive and more easily impose order in their belief that it was the right thing. Idealists like Korin and the Jedi had a simplistic perspective of good and evil that involved purists shouting at each other while labeling the other side heretics; such idealism was useless in the shifting galaxy and just made people fight. Idealists just brought trouble down on themselves and others.  She told Chelli, \"Evil's just a measure of how much your choices take away other's peoples,\" and that all anyone could hope for was to do right by the people they loved. Young Chelli pointed out that her mother may be evil for taking her away without asking her or Korin, and Lona acknowledged that while saying it was for Chelli's safety."}, {"tag": "p", "text": "Over the years, Chelli's mother would also tell her everyone needed to make mistakes and learn from them, but she would not let the girl take risks with her life. Despite emphasizing the need to stay sharp and learn, Lona also thought ambition and intellect would quickly get people killed. Chelli would later see her mother's actions as finding any excuse to keep her safe, and that taking her to a place where nothing ever changed was a way to do that in a galaxy where nothing could be controlled."}, {"tag": "p", "text": "For two years, Chelli and her mother were alone with no other sentient beings around. One day, they were attempting to prime a group of chatterplants as an alarm system for predators, something that Chelli was never successful at doing. Just as she was complaining about how boring and safe it was on Arbiflux, a group of raiders arrived, under orders from Imperial Coalition for Progress Minister Pitina Mar-Mas Voor to stage attacks and create chaos that would make planetary beg for Imperial intervention. Chelli saw her mother's arm shot off with a blaster, causing rapid blood loss. Lona gave her own blaster to Chelli, and urged her to run ahead and not look back. While Chelli fired the blaster at the raiders as she ran, and Lona sent a transmission to the Empire, calling for them to help her daughter before she died."}, {"tag": "p", "text": "Traumatized by her mother's death, Chelli would later have conflicting memories regarding the event. She remembered looking back and witnessing her mother collapse and die; she thought that after Imperial scout troopers found her in a ditch, she wanted to stay with her mother and turned to see that her mother had died without her noticing; she also recalled that she returned after the attack to find her mother's body lying in the ditch."}, {"tag": "p", "text": "The troopers brought Chelli to an encampment, where an Imperial officer told her that the planet's natives had formally invited the Empire and she would be returned to civilization, away from \"nuisances\" like the raiders that had killed her mother. At some point, she was evaluated by a psychologist. Later, the Empire returned Chelli to her former home on the Second Moon of Thrinittik where her father still lived. She set fire to the house, attempting to burn up all his research with it. He returned to find his home burning and raced inside. As he expressed his surprise at seeing her and distractedly patted out the flames to save his life's work, she screamed at him that his wife had been killed, and informed him that a psychologist had said she may have some issues."}, {"tag": "h4", "text": "Early university years"}, {"tag": "p", "text": "As a young adult, Aphra studied galactic history and ancient civilizations while working toward a doctorate degree in archaeology at the University of Bar'leth, located on the planet Bar'leth in the Core Worlds. At the time, she thought attending university was a necessary step to becoming a proper, professional archaelogist, and she had not yet perfected her own personal archaeological methods. She immediately developed a mutual hatred with one of her instructors, Sava Toob-Nix, who held strong opinions on what qualified as an archaeologist that Aphra did not share."}, {"tag": "p", "text": "Early in the program, Aphra frequently ran late to Toob-Nix's lectures, which she found frightfully dull, and would contradict him mid-lecture. He threatened to begin the expulsion process and would lock the door to keep the latecomer out of his lecture hall. At one point, Aphra had two lovers, a second-year student and a third-year student. She had neglected to tell either of them about the other and they confronted her together, which caused her to be late for Toob-Nix's class again. After successfully sneaking into Toob-Nix's classroom through a window, she gave herself away by interrupting him as he told her fellow cadets that all of the artifacts once stored at the universary library on the Fifth Moon of Thrinittik had been destroyed, along with the entire structure, in a cataclysmic blast; the Empire had destroyed the library sometime after Aphra's childhood visit there with her father. She protested that while the library had been attacked and much of it had decayed, enough of the structure remained that some of the artifacts may remain buried and preserved, awaiting an expedition to uncover them. The Sava dismissed her ideas as a fairy tale that would never be authorized. As they argued about her belief that unsanctioned expeditions and taking dangerous risks were worth it and what archaeology was about, another student named Sana Starros spoke up and agreed with her. Starros further pointed out that there was research in their university library that supported Aphra's assertions. Aphra had not previously noticed the quiet and non-disruptive Starros, but she was immediately enamored with her voice and the way Starros had taken her side."}, {"tag": "p", "text": "Despite the two students humiliating him in his own class, Toob-Nix did not begin the expulsion process as Aphra expected, and she was unsure for years after why he had not. Unbeknownst to Aphra, Starros approached him after class and blackmailed him. She warned him that if he expelled Aphra, she would end his career by reporting how he furthered his own academic agenda through teaching his class incorrect information."}, {"tag": "h4", "text": "Doctoral candidacy"}, {"tag": "p", "text": "Towards the end of her schooling, Toob-Nix selected Aphra as his candidate for doctoral supervision. Despite requiring his approval for her degree, she continued to mock him on a self-described weekly basis."}, {"tag": "p", "text": "Aphra would sometimes fall asleep during a class she shared with Eustacia Okka, and one day she noticed Okka reading Lost Legends of the High Republic on her datapad. When she asked Okka about it after class, Okka was initially embarrassed before Aphra reassured her with a kiss and told her she worried too much about what other people thought."}, {"tag": "p", "text": "On one occasion, Aphra sat in with a class of the Sava's undergraduates. When Toob-Nix inquired as to why Aphra, a senior doctoral candidate, was sitting in with the less-experienced students, Aphra sliced into the classroom's holoprojector and made the two holographic historical beings kiss, rather than stand still. Toob-Nix angrily expelled Aphra from his classroom. Aphra later told the day's events to her friend Susina, who urged Aphra not to antagonize the Sava. Aphra, however, wasn't worried about receiving Toob-Nix's approval because her graduation project, she believed, would be too important for the Sava to dismiss."}, {"tag": "p", "text": "Aphra's project was to travel to a backwater world of farmers, Boothi XII. There, Aphra hoped to find evidence of a precursor race in a subterranean vault. Unfortunately for the aspiring archaeologist, when Aphra later explored every centimeter of the vault in her archaeological gear—a leather hat, greatcoat, flashlight, and blaster pistol—she found nothing but an empty cave system."}, {"tag": "p", "text": "After returning to Bar'leth, Aphra wrote a report on her underwhelming findings on Boothi XII. Toob-Nix confronted Aphra after reading the report and sarcastically chided her for \"finding an old shed on a planet known as being full of old sheds.\" Aphra retorted that she believed Toob-Nix a far inferior Sava compared to the former, the Ugnaught Korin Pers. Instead of replying with another insult, Toob-Nix lead her to a secret room in the university where he stored several abersyn symbiotes which he had collected over decades, and made quiescent by exposure to plasma venting. Horrified that the Sava was concealing the highly illegal mind-controlling parasites, Aphra listened as Toob-Nix revealed to Aphra the true reason he had chosen her for his personal supervision: not because he saw Aphra as a poor student who cared more about excitement than archaeology, but simply because he hated her. Aphra threatened to blackmail him, but he assured her that her inexperienced word wouldn't be able to touch his professional reputation."}, {"tag": "p", "text": "Aphra knew Toob-Nix was correct, so she instead called Starros via comlink and enlisted the aid of one Starros's alien friends who owned a lot of \"hardware.\" Within the next two days, Aphra, with the help of Starros and her alien friend, sliced into Toob-Nix's secret room, preventing alarms from sounding due to the hack, and removed all of the dormant abersyn symbiotes in their respective capsules, returned to the empty vault on Boothi XII, and placed the symbiotes in the vault; this made it appear that the symbiotes had been left untouched for thousands of years. Aphra soon published her findings, and her \"find\" was hailed as the greatest archeoxenobiology find in centuries."}, {"tag": "p", "text": "After the \"discovery,\" per Imperial protocol, the symbiotes were disintegrated posthaste in order to prevent them from reactivating and becoming a threat. Susina was the first to inform Toob-Nix of the \"find,\" and when the Sava found his secret room empty, Aphra reveled in her new position to blackmail the Sava into giving her the doctorate she did not deserve. Toob-Nix was furious, but he could do nothing to expose Aphra without being exposed himself, so he allowed Aphra's \"find\" to overshadow his own work. Shortly, Susina expressed her excitement at Aphra's find, and proclaimed to spend her life's work in the Boothi XII vault in order to discover what made the symbiotes sleep without waking for what she believed to have been millennia. Aphra wished her \"good luck,\" knowing there was nothing to discover."}, {"tag": "h3", "text": "Adventures on Dantooine"}, {"tag": "p", "text": "Aphra was staying in Dantoo Town while trying to reactivate and upgrade some war-surplus droidekas. In need of a 3.23 colicoidic pulse modulator, she attempted to loot the abandoned rebel base on Dantooine, believing it to be salvage-rich. While working her way through a stripped central comm, Aphra was alerted by the Ark Angel to the presence of TIE-fighters. While retreating to the Ark Angel, Aphra encountered three stormtroopers doing a perimeter sweep in an area that she had covered in a layer of micromines. Knowing that escaping the nearby Star Destroyer would be difficult, coupled with not wanting to let people die and a reluctance to abandon the droidekas she'd been working on, Aphra decided peacefully surrender herself to the stormtroopers."}, {"tag": "p", "text": "The stormtroopers questioned and searched Aphra before bringing her into the new Imperial base on Dantooine. The stormtroopers presented Aphra to General Cassio Tagge, and informed him they were looking for Aphra's hidden speeder, which she had lied to them about to keep them from discovering the Ark Angel. Tagge questioned Aphra about why she had been at the Rebel base, not believing that Aphra was simply scavenging for supplies. Aphra attempted to persuade Tagge of her innocence. Aphra stated that she was unaware of a Rebel base on Dantooine, because, due to the planet's primitiveness, no one there would think to resist the Galactic Empire. Amused, Tagge then revealed to Aphra that the Death Star had recently destroyed Alderaan. Curious as to how the Death Star's weapon worked, Aphra enthusiastically questioned Tagge about it, though he did not reveal any details. Tagge then declared that he did not think Aphra was a Rebel, but that she was \"trouble,\" and sentenced her to execution."}, {"tag": "p", "text": "Tagge assigned a stormtrooper to take Aphra out into the woods and execute her, while they continued to search for her alleged hidden speeder. To buy herself time to plan an escape, Aphra conversed with the stormtrooper. After asking him if it was his first execution, Aphra spoke with him about how firing squads on some worlds and the Death Star were the same; as they involved a variety of people, no one person would have to shoulder the responsibility for taking people's lives—there was no one person to pull \"the trigger.\" Aphra then attempted to guilt-trip the stormtrooper, by illustrating the true horror and historical impact of the destruction of Alderaan, saying the stormtrooper would always remember it as the day he executed Aphra."}, {"tag": "p", "text": "While distracting the stormtrooper with her talk, Aphra was able to secretly jam the frequency on his Imperial-model blaster for a few seconds; because of this, Aphra was able to disarm him and steal his blaster. She informed the stormtrooper that while he had never shot anyone in cold blood, she had. Threatening to kill him, Aphra ordered the stormtrooper to remove his helmet. Aphra stated that it was easy to kill a stormtrooper, but harder to kill another human. Aphra then philosophized that the Death Star did indeed have \"a trigger,\" as it was easy to kill a planet because it was more abstract than personal. Although Aphra had always defended the Empire—believing it brought peace and order to the galaxy—she realized that what had happened to Alderaan changed her opinion."}, {"tag": "p", "text": "Aphra decided to release the young stormtrooper, asking him to tell his superiors that he followed through on his orders. Abandoning the blaster, Aphra was able to successfully board the Ark Angel and get into orbit. She then managed to avoid the Star Destroyer before jumping into hyperspace."}, {"tag": "h3", "text": "Servant to a Sith Lord"}, {"tag": "h4", "text": "Enlisted by Darth Vader"}, {"tag": "p", "text": "Sometime after parting ways with Starros, Aphra reactivated and customized a pair of Clone Wars-era Separatist droideka security droids with missile launchers. Aphra then sold them to a small group of Crymorah Syndicate-funded pirates who operated from a space station in the Outer Rim. However, in the year 0 ABY, the pirates gained the attention of the Galactic Empire and were hunted down and eradicated personally by Darth Vader. Vader was a member of the ancient Sith Order, and second in the Imperial hierarchy only to the Galactic Emperor himself, Sheev Palpatine. Having accessed the pirates' main computer while aboard, Vader learned of Doctor Aphra's involvement in upgrading the droidekas, which greatly impressed him. As such, the Dark Lord of the Sith set out to recruit her to his secret list of allies."}, {"tag": "p", "text": "Aphra, meanwhile, was hired by the Droid Gotra, which was a militarized organization of Separatist battle droids who were not disabled by the droid shutdown order at the conclusion of the Clone Wars. Aphra, as an archaeologist who specialized in droid and weapons technologies, was hired for work on several missions; which included stealing the ancient Triple-Zero protocol personality matrix, to locate and activate the unique BT-1 assassin droid \"Blastomech\" prototype, and to recover a forgotten portable droid factory on the desert world of Geonosis."}, {"tag": "p", "text": "Aboard her prized ship, the Ark Angel, Aphra located the \"Blastomech\" prototype, designated BT-1. BT-1 was floating in space near the remains of an Imperial-built Tarkin Initiative base, where BT-1 was kept before he destroyed it. However, BT-1 had gone dormant and would not wake up—the only languages the droid spoke were seemingly lost to history when the Tarkin Initiative base was destroyed. Aphra's next stop was a large asteroid-turned-space station: Quarantine World III in Kallidahin Space—which was where the Triple-Zero matrix was held in quarantine."}, {"tag": "p", "text": "Aphra stealthily made her way into the quarantine facilities and located the safe where the droid matrix was kept. Fearing security measures, Aphra released a cloud of stealth microdroid dust, which revealed a web of lasers that would trigger and alert the facility to Aphra's trespass if eclipsed. The doctor crawled prone to the safe and disconnected the personality matrix and stowed it on her body without incident. However, on her return journey crawling under the lasers, she fluked and triggered them. Aphra was forced to sprint to the hangar of the quarantine world as the facility self-destructed around her. After outrunning a shielded droideka and diving under a closing doorway, Aphra was confronted by Quarantine World III's curator and her old adversary, Utani Xane. Aphra was unsurprised to see the Kallidahin working at the facility, and handed over her blaster pistol and the personality matrix to Xane's handful of B2-series super battle droids without argument— though, as Aphra was placed in stuncuffs, she did insist that the Triple-Zero matrix should be in an armory, not left stagnant in quarantine or a museum for centuries. Before Aphra could be escorted away back to prison, an uninvited TIE line starfighter approached and released none other than Darth Vader. Mouth agape at the arrival of Vader himself, Aphra watched as the dark lord systematically eradicated the B2 battle droids using the Force and his red-bladed lightsaber. Aphra took advantage of the chaos and tackled Xane, who was attempting to flee with the personality matrix. In the tumble, Aphra barely managed to catch the matrix and herself as she and it went over a large ledge and nearly into a deep chasm. Vader helped the doctor back up after killing Xane and let the doctor know why he was present: he wanted Aphra's help."}, {"tag": "p", "text": "Shortly thereafter, Aphra returned to the Ark Angel, where Vader's TIE Advanced docked with the ship. As the two conversed, Aphra admitted to being a huge fan of Vader's. Vader then explained that he had encountered the droidekas Aphra had supplied to the Crymorah-aligned pirates and that they had impressed him. Aphra thanked \"Mr. Vader\" and inquired as to how Vader had found her, before coming to the realization that she probably didn't want to know all the bloody details. The archaeologist then explained to Vader the dangers of the Triple-Zero matrix, and that she intended to activate it in the body of a spare 3PO-series protocol droid. However, the matrix was locked and unable to be used, and Aphra perceived that she would need hours to slice into it."}, {"tag": "p", "text": "Vader, however, ignored Aphra and used her computer and unlocked the matrix in seconds. Aphra was impressed, and installed the personality matrix into the head of the gunmetal plated protocol droid and awoke him. The Triple-Zero matrix-powered protocol droid came alive and introduced himself as 0-0-0—or Triple-Zero, appropriately. After Aphra imprinted herself and Vader as Triple-Zero's new masters, she told the droid to speak the R&D language that the Tarkin Initiative created and wake up the BT-1 prototype. After BT-1 was awakened, he took immediate hostilities to Vader and Aphra, but was calmed down by Triple-Zero, who informed the nefarious \"Blastomech\" that Aphra and Vader were his new masters."}, {"tag": "p", "text": "Relieved, Aphra sank to the floor and admitted to Vader that she felt out of her league working with the infamous Sith Lord and asked what it was Vader really wanted from her. Vader revealed that he had been unceremoniously demoted by the Emperor, and therefore planned to build private, secret resources without his master's knowledge. Aphra picked herself up and came to the conclusion that Vader was more worthy than the Droid Gotra, so she turned ownership of BT-1 and Triple-Zero over to him and explained that he could find troops of unquestioning loyalty on Geonosis in the form of the portable droid factory that she was hired to obtain for the Droid Gotra as well. The new allies set course for the Geonosis system immediately, where Vader chaffed Aphra that it would be unwise to disappoint him."}, {"tag": "h4", "text": "Building forces for Darth Vader"}, {"tag": "p", "text": "A short time later, after Vader enlisted the aide of one of his own personal starships, a J-type 327 Nubian starship from Naboo, the Ark Angel set down in the midst of an old Clone War battlefront on the red-desert world near the cave system where the droid factory was believed to be hidden under the watchful eye of a native Geonosian queen, Karina. Karina had survived the Imperial sterilization of her homeworld years earlier. Doctor Aphra then sent the two assassin droids into the queen's subterranean lair while she and Vader followed behind, taking note along the way of the wreckage of modified B1-series battle droids, whom were disabled by Aphra's assassin models. Aphra informed her employer that the B1 droids confirmed that the factory was present and still operational. Aphra and Vader caught up with BT-1 (\"Beetee\") and Triple-Zero and the entrance to the queen's chamber, where Aphra added that with the unusual changes, such as mechanical wings, to the battle droids, that Karina viewed the droids not as simply mechanical soldiers, but as her own children."}, {"tag": "p", "text": "Intimidated by the sight of the Geonosian queen using the droid factory as a cybernetic womb, Aphra inquired as to whether Vader still thought barging into the insectoid queen's domain was not foolhardy. Vader replied simply \"yes\" and put the heist into motion; he cut Queen Karina from the portable factory and fought off the attacking B1 droids with the assistance of Beetee, while Aphra attempted to attach a homing beacon to the roof of the chamber. After jumping down to Vader's position and getting him to use the Force to get the beacon to the ceiling without a second thought, Aphra called in the Ark Angel via voice command. The starship fired on the location of the beacon, dropping mounds of rock to the chamber floor. Vader protected himself and Aphra from the cascade using the dark side of the Force. The archaeologist connected a crane lowered by the Vader's J-type 327 Nubian to the factory and held on while the heavily modified yacht lifted Sith Lord, archaeologist, and factory to the safety of the sky. Triple-Zero and Beetee followed utilizing the latter's rocket boosters."}, {"tag": "p", "text": "Aphra and the team soon got the factory loaded onto her ship, and after some testing and slight modifications contributed by Triple-Zero, the portable factory began producing an army of artificially intelligent and nimble BX-series droid commandos to add to the dark lord's growing forces. Seizing the moment of down time, Aphra somberly inquired as to when Vader was going to kill her—not a doubt in her mind that he would end her life after her usefulness to him had ended. Vader, pleased that she had thus far been entirely loyal and resourceful, stated that he would not end her life until he saw fit. Satisfied with his logic, Aphra risked requesting that when Vader came to kill her, to do so with his lightsaber, and if she could not choose how to die, then at least veto being ejected into space to freeze and suffocate to death, something she had always had nightmares about."}, {"tag": "p", "text": "Immediately thereafter, Triple-Zero interrupted Aphra and Vader's delicate conversation with news that a bounty hunter whom Vader had hired from Jabba the Hutt had arrived with his bounty in tow. The bounty hunter, the disowned, outcast Wookiee Black Krrsantan of Kashyyyk, quickly brought aboard the Ark Angel the yet-to-be-identified scientist Doctor Cylo, whom Vader then tasked Triple-Zero with torturing and identifying."}, {"tag": "p", "text": "Later, Aphra's team traveled aboard Vader's chromium-plated Nubian to a secret research base maintained by Doctor Cylo's Cylo Directive located in the Crushank Nebulae of the Outer Rim. Upon arriving in the nebula and seeing that the base was actually a whale fleet, Aphra admitted she was impressed—Vader, though, determined that it was only impressive if one was \"fond of abominations.\" At Vader's word, Aphra began the illegal boarding mission: she launched an ion charge, which disabled Cylo's Flagship's systems, before wishing Vader an old Jedi saying: \"may the Force be with you.\" Before Aphra landed the Nubian on the cyborg whale-ship so Triple-Zero and Beetee could gain access to the base with a dozen commando droids, Vader ejected himself into space and cut his own way to the base through the flesh of the whale-ship. Aphra proceeded to analyze the base plans after Beetee provided them from slicing into the base's computer system. From the schematics, she provided the locations of possible resistance on the base, so Vader and the commando droids systematically cleared the living vessel of Cylo's marines before half of the commando droids were lost in \"the dojo.\" Vader, therefore, made his own way to the dojo with his half of the battle droids, where Aphra lost contact with her employer, too."}, {"tag": "p", "text": "Triple-Zero and Beetee returned to Aphra at the ship with no information on why Vader was out of contact. As time went on, Aphra became increasingly worried at Vader's safety, eventually deciding to arm herself and go in after the seemingly lost Sith Lord. While waiting, the other bounty hunter Vader had hired, the no-nonsense Boba Fett, called, having caught up with his bounty. Just before Aphra planned on leaving the ship, Vader returned in a state of fierce anger. Aphra informed Vader that Fett had information, so Vader piloted the Nubian to a Star Destroyer of the Imperial Navy where he had a meeting with the bounty hunter."}, {"tag": "p", "text": "Vader returned after the meeting with orders for Aphra to travel to the the desert planet Tatooine in the Arkanis sector with him aboard the Ark Angel. Upon arrival in Tatooine's Dune Sea region, the group located the homestead moisture farm previously occupied by the Lars family before they were killed weeks before during a Rebel Alliance mission to Tatooine. There, Vader revealed to Aphra only that the Rebel Alliance pilot who destroyed the Death Star had lived at the moisture farm before the family was killed by the Empire. Aphra found it ironic that since the long-standing Imperial Senate had only recently been dissolved by the Emperor when the Lars family had been killed, prompting the future pilot who destroyed the Death Star, to leave and join the Rebellion; believing that revenge was what had motivated the pilot to damn so many Imperial souls. Vader agreed."}, {"tag": "p", "text": "Next, Aphra and the others traveled several kilometers away to the Jundland Wastes to a small home where Fett had engaged in a duel with the pilot just days before. At Vader's order, Aphra waited outside while Vader examined the interior of the structure, guided by the dark side of the Force. Vader reemerged and Aphra detonated a molecular purge bomb within the structure, which erased all forensic evidence that anyone had ever occupied the building. Vader then told Aphra that he had to return to his legitimate duties within the Empire as punishment for not preventing the Death Star from being destroyed, so Aphra was dismissed from his service— though Vader had a new mission for the doctor already in mind."}, {"tag": "h4", "text": "Thieving against the Empire"}, {"tag": "p", "text": "Just as Vader had promised, he soon contacted Aphra with a new mission: steal a fortune's amount of credits from an Imperial Arquitens-class light cruiser while it was in transit to the Anthan system. The credits, recently acquired by the Empire after raiding and killing the Rodian leader of the Son-tuul Pride criminal syndicate on the jungle planet Son-tuul. In order to enact the robbery, Aphra herself traveled to Son-tuul, where in a local cantina, she gathered a group of bounty hunters to help her. The five bounty hunters—Black Krrsantan, IG-series assassin droid IG-90, armor-clad Beebox, and the very experienced Trandoshan Bossk—agreed to her terms, and together aboard Aphra's ship, they headed to the Outer Rim Anthan System. However, per a secret plan of Vader's, Aphra did not inform any of the hunters besides Krrsantan, whom was in on the plan due to his already having already impressed Vader with the capture of Cylo, that Vader was behind the raid, and that the plan was not for themselves to get rich, but for Vader to have funds to expand his forces."}, {"tag": "p", "text": "As soon as the Imperial light cruiser emerged from hyperspace in orbit over Anthan Prime, Aphra began what would come to be known as the Son-tuul Pride robbery. She blew up a large asteroid with previously installed explosives and asteroid thrusters, which, when detonated, created a small asteroid belt that quickly engulfed the Imperial cruiser in the unexpected collision. Seizing the time bought by the asteroids, Aphra fired an ion charge into the cruiser; giving Aphra and her crew—except for Krrsantan, who was waiting, hidden, for his part in his Auzituck anti-slaver gunship nearby—five minutes to board the vessel and steal the mounds of credit chips. Donning space suits, Aphra, Bossk, IG-90, and Beebox, left the Ark Angel through its airlock and spacewalked onto the underside of the Imperial light cruiser where they boarded the vessel and circumvented any Imperials to the ship's vault, defeated a trio of Viper probe droids guarding it, planted a homing beacon on the vault, and then hastily retreated back to the Ark Angel, which allowed Krrsantan to do his part: slingshot an asteroid into the cruiser in his gunship, which cracked open the vessel at the vault, spilling the millions in credit ingots into space. Beetee was there on the hull of the vessel and managed to lasso a portion of the ingots using magnets—though, as per the secret plan Vader concocted, Beetee let a majority of the credits float away, seemingly lost. Krrsantan, gathered, up the rest of the credit ingots in his gunship and dropped them off on Anthan 13, one of Anthan's primes many moons."}, {"tag": "p", "text": "Aphra later gathered the credits Beetee had gathered into boxes and split them up five shares, one for Aphra and each hunter. Krrsantan, acting his part to fool the other bounty hunters, sided with IG-90 and Beebox, who were disdained that the amount of credits promised was still huge, but not nearly as huge as promised. Aphra managed to brush off their grievances and agreed to pay up front if she ever asked to work with them again in the future. Later, Aphra gave Krrsantan five times his promised share on Anthan 13 and promised to help him find the individuals responsible for \"cutting him up\" in his previous forced career as a gladiator. Aphra added that she and him were in deep together, in crossing three bounty hunters. After Krrsantan departed, Vader emerged from the shadows of the crystalline caves of the moon and gave her a datachip with her next mission detailed inside. Darth Vader warned that if she did not contact him with new information within a month, he would contact her, something the doctor would not enjoy."}, {"tag": "h4", "text": "The mortician of Naboo"}, {"tag": "p", "text": "Within the span of a few days, Aphra returned to Anthan Prime, this time, however, she had business at the Anthan Spire, a floating city in the cloudy storms of the gas-filled world. Aphra was directed to the Spire's lower class Tradesman's Entrance due to the outward appearance of her \"heavy-lifter\" starship, and paid a quick visit to an old friend and associate, \"the Ante,\" a Givin information broker at his Spire base. The Ante quickly decrypted the information, supplying that the subject of the data was Commodex Tahn, a long-retired former mortician from the idyllic Mid Rim planet Naboo. Aphra paid the brilliant Givin a sum of credits that the Ante deemed excessive, but accepted them nonetheless—the Ante's methods were far more discreet than using the public HoloNet, Aphra deduced. Aphra then returned to the Ark Angel with her two assassin droids, and the trio made way to the Naboo system."}, {"tag": "p", "text": "Aphra stealthily piloted her starship into Naboo's capital city of Theed, and along with Triple-Zero, Beetee, and a squadron of seven commando droids, assaulted the luxurious villa of the retired mortician. With orders to take Tahn alive in order to interrogate him, the droids attempted to stun Tahn into unconsciousness when he took up arms against them. Beetee, however, shot Tahn's clone trooper-issued DC-15A blaster rifle out of his hands, drawing blood and upsetting Aphra. Aphra ordered the droids to take valuables from the villa in order to make the home invasion look like robbery. Aphra then turned her attention to Tahn. She reaffirmed in him what she already knew; that Tahn had prepared former Naboo Queen Padmé Amidala's body for burial upon her death at the very end of the Clone Wars. A patriot, Tahn stood firm, insisting that he would never betray Amidala—not even her memory. Tahn argued that Amidala had been a good queen, which was why he would not betray her. Annoyed with Tahn's unwillingness to comply, retorted that a strong queen would have beaten out Amidala's good queen act in the end. Looking at the upper class quality of life in Theed, of which Tahn was a part, Aphra read a romanticized version of her memories of how her mother had been killed during the Clone War after her parents had split up, how Aphra had killed a group of raiders with an \"awesome cannon\" she found, and how her father had returned thereafter; a happily ever ending that did not occur. Feeling pity for Aphra, Tahn digressed his pity for her loss."}, {"tag": "p", "text": "Aphra brushed it off, adding that a galactic war had been happening—everyone had lost someone. Getting back to business, Aphra brought down on Tahn that if Amidala had been both good and strong, she would have avoided her fate, believing that the Empire was both good and strong; which was why she served in the regime. At Aphra's word Triple-Zero began his interrogation of Commodex Tahn. Aphra, meanwhile, walked the man's house, where she came across a holovid of the Tahn family. She, in her own way, apologized for having to end Tahn's life, finding comfort that Tahn had lived a good life. Triple-Zero appeared, having violently coerced Tahn into answering Aphra's inquiry. Aphra easily got the battered Tahn to confirm that then-Senator Amidala had given birth to a son who had been taken by a pair of Jedi Knights—Jedi Masters Yoda and Obi-Wan Kenobi—just before she died. Satisfied, Aphra told Triple-Zero to \"finish up\" so they could depart; the protocol droid electrocuted Tahn to death and the team fled Naboo, happy that Vader could now know the full story. Back on Anthan Prime, Aphra reported all she had learned to Vader. Appeased, Vader gave Aphra her next mission: locate the boy who had destroyed the Death Star before another could first, namely Imperial agent Commander Karbin."}, {"tag": "h4", "text": "Close call on Anthan"}, {"tag": "p", "text": "A short time later, Aphra paid another visit to the Ante at his Anthan Spire base. After releasing Triple-Zero and Beetee to partake in games of holochess at the Ante's holochess parlor, the Doctor met with the Givin crime lord in his suite for a private business meeting. During the meeting, Aphra explained to the Ante that she needed to know the whereabouts of the Rebel pilot Luke Skywalker family, famous for making the Battle of Yavin a victory for the Rebel Alliance. The Ante, unexpectedly, had already invested time into investigating Skywalker, and was in the process of selling the information to various other organizations, at a price much higher than Aphra anticipated. For her part, Aphra, using the stolen credits from the hijacked Son-Tuul Pride, paid the Ante up front with more than enough credit chips. The Givin infochant deduced that Aphra was responsible for the recent robbery of the Son-Tuul Pride's treasure, but nonetheless revealed to Aphra that Skywalker was on the planet Vrogas Vas."}, {"tag": "p", "text": "Immediately after, an alarm sounded, warning that an Imperial strike force was inbound to the city. Acting quickly, Aphra commed her two droids and ordered them to return, as she was, to the Ark Angel. Aphra dodged blaster fire from stormtroopers while patrons of the Spire fought back against the forces of Imperial Inspector Thanoth and Darth Vader. Vader made sure the Ante was killed in the firefight so he could incriminate neither Vader or Aphra in their involvement with the Son-Tuul Pride robbery. Aphra reached her docked ship, only to be met by Vader himself. Aphra was caught well off-guard when the Sith Lord activated his lightsaber and grabbed her by the neck in a Force choke, ready to kill her. The Doctor eked out that she had, in fact, learned the location of Skywalker, and Vader released her. But Aphra, essentially blackmailing Vader, said that should would only tell her \"boss\" later—ensuring her survival for at least a little longer. With Inspector Thanoth and his troopers not far behind, Vader let her board the Ark Angel and escape out into Anthan Prime's gas storms with her two assassin droids. However, a blockade of Imperial ships put in place by Thanoth prevented Aphra from escaping the system, forcing her to brave Anthans beautiful-but-dangerous storms of lightning and wind in order to hide."}, {"tag": "p", "text": "Co-leading the mission with Thanoth, Vader persuaded Thanoth to let the Ark Angel escape \"Imperial justice\" in order for the Imperials to assault the subterranean base of the Plasma Devils, a Rebel Alliance cell who operated from the Thanteen Substrata on the moon Anthan 1—a time sensitive issue, because the Plasma Devils would certainly evacuate their base upon hearing that the Spire had been compromised by the Empire. Thanoth agreed with Vader's reasoning (thus saving the Empire face in the propaganda game), and left his pursuit of Aphra, a \"common thief,\" in order to annihilate the rebels; which allowed the Doctor to escape to one of Anthan's moons and wait there to report to her employer."}, {"tag": "p", "text": "With Triple-Zero and Beetee at her side, Aphra waited nervously for Vader's presence, well aware that he might kill her for her close call with Thanoth and the Ante. When Vader soon arrived, Aphra first told Vader Skywalker's location on Vrogas Vas, and second, that she had decided not to run and hide from the Dark Lord in order to prove to him that she was trustworthy. The last several days of espionage around Anthan and Naboo had given Vader an appreciation of Aphra's abilities, so he decided that he would spare her life for the time being and made preparations to intercept Skywalker at Vrogas Vas."}, {"tag": "p", "text": "Around this time, Aphra heard word that \"the last of the Jedi\" was scheduled to fight gladiatorially on Hutt Clan-controlled Nar Shaddaa, the \"smuggler's moon,\" in the Palace of Grakkus the Hutt. The \"last Jedi\" turned out to be none other than Skywalker himself, who had been kidnapped by Grakkus's forces and forced to fight against Kongo the Disembowler, a massive roggwart from the dolovite mines of the volcanic world of Mustafar. Doctor Aphra expected the outmatched Skywalker to perish in his duel with the massive rogwartt, so she bet credits that Kongo would prevail over Skywalker in the ensuing duel, but Skywalker was rescued by his team of Rebel compatriots before he could lose, and as a result, Aphra lost the credits she gambled in favor of Kongo. Concurrently, Vader, after a short mission on the Mid Rim mining world Shu-Torun, made a stop on Nar Shaddaa in order to learn what he could about Skywalker, then turned his attention to Vrogas Vas."}, {"tag": "h4", "text": "Captured on Vrogas Vas"}, {"tag": "p", "text": "Over a comlink call, aboard her Ark Angel, Chelli Aphra revealed to Lord Vader intelligence relevant to Vrogas Vas: the desolate, gaseous world housed an ancient Jedi Temple, as well as that Commander Karbin had been dispatched by Emperor Palpatine and Doctor Cylo to hunt down Skywalker—though she believed the Mon Calamari commander had not been able yet to identify Skywalker and would not interfere with Vader's own hunt. Vader soon emerged from hyperspace in Vrogas Vas's star system in his TIE starfighter where he was met with three unsuspecting Rebel Alliance starfighter squadrons—Blue Squadron, Red Squadron, and Yellow Squadron. Caught off guard, Vader suspected Aphra had set him up to be killed, but Aphra insisted otherwise. Aphra urged Vader to flee the several dozen Rebel X-wing starfighters, but Vader refused—he sensed through the Force that the Ante had been correct; Skywalker was near. Due to the ensuing skirmish, Aphra lost contact with Vader's TIE Advanced starfighter. Determined to prove her worth to the Sith Lord, Aphra made up her mind to attempt a rescue mission after learning from intercepted Rebel Intelligence transmissions, that Vader had crash landed on Vrogas Vas."}, {"tag": "p", "text": "The archaeologist contacted Black Krrsantan and requested that he join her on her mission, and he accepted—as long as he would be compensated. Triple-Zero and Beetee, having researched Skywalker on the journey, explained to Aphra who they might encounter on the world below: Rebel leader-Princess Leia Organa of Alderaan, the smuggler Han Solo—who was wanted by the Hutt Clan—R2-series astromech droid R2-D2, Skywalker's personal mechanic, and a protocol droid of the same chassis model as Triple-Zero, C-3PO. With new knowledge of her adversaries, Aphra set the Ark Angel down near the ruins of the Vrogas Vas Jedi Temple. Aided by macrobinoculars, Aphra spied Skywalker and R2-D2—\"Artoo\"—in the temple grounds, and knowing that killing Skywalker was not an option, and that Skywalker owned a Jedi lightsaber that he had fought off Boba Fett with, decided instead for a more delicate approach in her attempt to kidnap the Jedi in training: she painted Triple-Zero's armor plates gold with an airbrush, thus disguising her droid as Skywalker's gold-plated C-3PO—\"Threepio.\""}, {"tag": "p", "text": "Golden Triple-Zero attracted the attention of Skywalker and, when close enough, routed an electric shock into him, knocking him unconscious. Aphra and Triple-Zero watched as Beetee fought R2 until he retreated. Later, Aphra had Triple-Zero carry Skywalker, however, they were confronted by Captain Solo. While Solo's copilot Chewbacca attacked triple-zero, Aphra got into a firefight with Solo. Despite getting pinned down by Solo, Aphra was able to shoot a hive full of Wasp-worms. However, the wasp-worms knocked both her and Solo out. Aphra was revived by Beetee and triple-zero, and she had them follow Skywalker and to keep him alive. Meanwhile Aphra returned to her ship and used it to assist Lord Vader in defeating Karbin, but she was forced to eject from it. Aphra ordered Beetee and Triple-Zero to laid a mine field around the Millennium Falcon. She then tried to force Skywalker, Solo, and Chewbacca to drop their weapons, but she was punched by Princess Leia and taken aboard the Falcon. With Aphra captured, Lord Vader had a bounty placed on her alive or dead. Beebox tried to collect the bounty on her by claiming he disintegrated her, but Lord Vader saw through his lie and Force choked him."}, {"tag": "h4", "text": "Escape from Sunspot Prison"}, {"tag": "p", "text": "Aphra was then taken aboard the Volt Cobra, where she was able to free herself from the binders. However, Leia and her escort kept her at gunpoint. When she tried to get past Leia and her guards, Aphra was knocked out by Starros. She was then taken to Sunspot Prison where she was interrogated by Alliance Intelligence for weeks. Aphra tried to bribe Starros to get her out, to no avail. Later, Aphra came under attack by an IG-RM droid but was saved by Leia and Starros. Aphra was then given a blaster by Leia despite Starros' concerns."}, {"tag": "p", "text": "Together, Aphra, Leia, and Starros fought another IG-RM droid and made their way through the prison and into IG-RM droids. After taking out the last droid, they came upon R2-D2 and C-3PO in the prison's command center. They then went to the hangar where a bounty hunter had captured Solo and Skywalker. The bounty hunter demanded that Leia shoot Aphra, who was then held at gunpoint by Starros, but Leia told Starros not to shoot her. The bounty hunter, former rebel spy Eneb Ray then started a count down to kill them. However, Aphra and the others were saved when R2 turned off the prison's gravity. Aphra was then strangled by Starros until she apologized for leaving her, and was then tossed by Starros away from her."}, {"tag": "p", "text": "After bumping into Ray, Aphra made her way to the prison's escape pod. However, she was confronted by Leia, who warned her that Vader was dangerous. She was then pushed into the escape pod by Starros and was warned not to come back to the prison."}, {"tag": "h4", "text": "Aphra's capture"}, {"tag": "p", "text": "Aphra made her way to the Cosmatanic Steppes and sat at a bar where she was found by Beetee, Triple-Zero, and their commando droids. Aphra told the droids that she had not revealed anything to the Rebels, and convinced them to stop eliminating witnesses. Aphra tried to bribe Krrsantan, but to no avail, as she was taken to the bounty hunter's ship. She was then taken to Lord Vader's new flagship at Kuat."}, {"tag": "p", "text": "After landing in the Executor's hangar bay, she was handed to a pair of stormtroopers. As she was being escorted, Aphra was able to give Beetee and Triple-Zero a new priority order to get her out. The two droids rescued her from her imprisonment and the group made their way to Black Krrsantan's gunship. However, she knew Vader would not let her get away. With Krrsantan, her droids, she then fought Dr. Cylo's forces and was ultimately brought before Emperor Palpatine."}, {"tag": "p", "text": "Following Lord Vader's victory over Dr. Cylo, Vader met Palpatine and Aphra. She told the Emperor of their missions together, which the Emperor found impressive. After the Emperor left, Aphra told Lord Vader that she had revealed their partnership to the Emperor to prove herself. Vader pushed her into a airlock, despite his promise to use his lightsaber on Aphra, and she was jettisoned into space, with Vader believing her death."}, {"tag": "p", "text": "However, Aphra was rescued by Black Krrsantan, Beetee, and Triple-zero, and was brought onboard Krrsantan's gunship. She had anticipated that Vader would kill her and was able to use the equipment from the Son-tuul Pride robbery. She was then taken to a Bacta tank to heal."}, {"tag": "h3", "text": "Recovering the Sword of Khashyun"}, {"tag": "h4", "text": "Hired by Dok Ondar"}, {"tag": "p", "text": "At some point, Aphra, sought to recover the ancient Sith artifact Sword of Khashyun from the ancient Sith homeworld of Moraband, located its resting place from a map she stole from the University of Bar'leth. She wished to auction the sword and brought Triple-Zero and BT-1 to Black Spire Outpost on the planet Batuu, where she met with the pirate Hondo Ohnaka to pitch her idea and request for a starship. However, Aphra was instead hired by the Ithorian collector Dok-Ondar, who sought to acquire the ancient artifact for his collection. The pair traveled for Moraband on Ondar's ship, bringing Triple-Zero, Beetee, and some Shistavanen mercenaries of Ondar's."}, {"tag": "p", "text": "En route to the Sith homeworld, Aphra argued that keeping Ondar alive on Moraband would be a tricky task that could warrant her extra pay, although the Ithorian was confident that he was paying her enough and had brought enough muscle in the form of the Shistavanens. Aphra then analysed the Sword of Khashyun, recalling its legend. After a brief interruption by Ondar, she added about the stolen maps she had with her. The rogue archaeologist reminded Ondar that she was missing out on money by not being able to auction the sword, but the collector replied that he was financing the mission. Aphra defused the conversation by telling him to prepare for landing, as Ondar's vessel had arrived at a Sith temple on Moraband."}, {"tag": "h4", "text": "Searching for the sword"}, {"tag": "p", "text": "Disembarking from Ondar's ship with BT-1 and two Shistavanens, Aphra led her cohorts into the temple, warning of traps which had been detailed by ancient scrolls she had read. She stopped the group at a point where she believed a trap had been set. After spotting a pressure plate, the rogue archaeologist then allowed of the Shistavanens to step on it while pretending to adjust her boot. The trap summoned a phantom Sith Warrior, which swiftly killed the mercenary and turned to Aphra. Aphra, though, dodged the warrior's attacked and placed a thermal detonator onto it, destroying the phantom Sith."}, {"tag": "p", "text": "The remaining Shistavanen was enraged at the death of the other mercenary, taking Aphra by her throat. The rogue archaeologist convinced the mercenary to release her, assuring the Shistavanen that she had not firmly anticipated a sentry. Aphra led her two remaining comrades down a level. Meanwhile, she had Beetee jam the signals to Ondar while Triple-Zero attempted to slaughter the collector and his muscle aboard his ship. Aphra had BT-1 send a drone to scout for traps. After the drone was destroyed by laser traps, she chose to take another route."}, {"tag": "p", "text": "After some more travelling, Aphra and her companions reached the mummified body of a Dowutin Sith, with the Sword of Khashyun before it. The Shistavanen removed the sword, when the rogue archaeologist noticed a wind noise, which BT-1 identified as an ultrasonic noise. Aphra guessed that it was an animal call, and that was when a Tuk'ata, a Sith hound was released. She and her cohorts ran from the hound, and the rogue archaeologist made BT-1 trip the final Shistavanen, leaving the mercenary to the Tuk'ata. The pair then lured the beast into the laser trap from before, coaxing the hound to its death."}, {"tag": "h4", "text": "Ondar's revenge"}, {"tag": "p", "text": "Aphra lugged the Sword of Khashyun out of the temple, only to find that Ondar and his Shistavanen guard had defeated Triple-Zero. Confronting Aphra, the collector taunted how he had disabled Triple-Zero for a matter of hours. Aphra sarcastically claimed her feelings were hurt by Ondar's distrust in her and tried to assure the Ithorian that they could make amends to their relationship. Ondar refused to take the chance, citing how he did not want anyone else to have the sword, and so the rogue archaeologist threatened his life and had BT-1 attack."}, {"tag": "p", "text": "As Ondar's Shistavanen returned fire, disabling BT-1, Aphra impaled the guard. Ondar drew his blaster on Aphra, who remarked that he would not risk damaging the Sword of Khashyun. The collector fired at her regardless, breaking the sword into its blade and hilt and incapacitating the rogue archaeologist. When Aphra awoke, Triple-Zero and BT-1 had reactivated. She asked what had happened, only to see Ondar's ship flying away, leaving her stranded with the droids, although they were eventually able to escape."}, {"tag": "h3", "text": "The Rur quest"}, {"tag": "h4", "text": "Historical art rush"}, {"tag": "p", "text": "Aphra returned to the Cosmatanic Steppes. There, she acquired an artifact from Ulbik Tan after killing him, and then took a speeder to Fulan Ro, where her new ship the Ark Angel II was nearing completion. After meeting up with Black Krrsantan and her droids, Aphra was approached by Soo-Tath and his two Gigoran bodyguards. They demanded a payment or the artifact from Aphra. She refused knowing they planned to sell it for a higher price, and instead tried to fight back, but was knocked out by one of the Gigorans."}, {"tag": "p", "text": "Aphra was saved by Krrsantan and she offered Soo-Tath a deal; if his bodyguards defeated Krrsantan, she would double her payment. Soo-Tath accepted the deal but loss when Krrsantan defeated the Gigorans. After the combat Aphra assured Soo-Tath that he would get his payment from her after she sold the artifact. Then, she and her crew went to Archaeo-Prime where Aphra tried to sell her artifact, but was unable to due to her doctorate being suspended. As she left, Aphra was approached by none other than her own father, who knew she had lied about discovering the abersyn symbiotes on Boothi XII. Her father told her that she could get her doctorate back by finding her \"spiritual salvation.\""}, {"tag": "p", "text": "Aphra listened to her father's offer to study the Ordu Aspectu. She then took him to the Ark Angel II. There, Aphra pulled out her blaster and demanded that her father clear her name. Her father saw she was bluffing until Aphra asked Triple-Zero and Beetee to do it for her. However, she could not go through with it. Instead Aphra agreed to listen to her father's stories of the Ordu Aspectu, which they both debated their versions of."}, {"tag": "h4", "text": "Raid at Yavin IV"}, {"tag": "p", "text": "Aphra, her father and her crew traveled to the Yavin system, where her father told her to go to the fourth moon. Upon arriving, they found the Great Temple occupied by Imperial Stormtroopers, AT-ATs, and AT-STs. Aphra was surprised her father did not know that the Rebels had used the Massassi temple as their base, nor what really destroyed Jedha City and the Temple of the Kyber. Aphra, her father and her crew then came up with a plan to distract the Imperial forces."}, {"tag": "p", "text": "As Black Krrsantan distracted the storm and scout troopers, Aphra and her father had the droids infiltrate the temple. The two of them then used Beetee's cables to climb into the temple. There, they inserted the Massassi pieces into the key holes. At first, the pieces did not appear to work and Aphra blamed her father for things such as her mother running away. However, the temple was then activated."}, {"tag": "p", "text": "As her father took readings, Aphra told Krrsantan to prepare the Ark Angel II to leave. Meanwhile, Aphra knocked out an Imperial officer and had Beetee and Triple-Zero to slow down the stormtroopers. The group made their way through the temple's throne room firing her guns at several stormtroopers. Aphra, her father and the droids were then confronted by an AT-AT, Captain Magna Tolvan, and her remaining stormtroopers who forced her to drop her guns. As Tolvan ordered her forces to open fire on her, the AT-AT was destroyed by the Ark Angel II. Aphra, her father and the droids jumped onto the Ark Angel II and left Yavin IV. Aphra then agreed to go with her father to the Citadel of Rur. Together, they found it."}, {"tag": "h4", "text": "The Ordu Aspectu's twilight"}, {"tag": "p", "text": "Once in the Citadel of Rur, as her father examined the remains of the Jedi, Aphra was able to gather several lightsabers from the remains. Aphra and her father then found a door and used their last Massassi piece to open the door and access the Citadel's logs on the immortal Rur. As they entered, Aphra, her father and Krrsantan came under attack by several snowtroopers who were under the command of Captain Tolvan. As Krrsantan held off the snowtroopers, Aphra and her father attempted to find a safe place for the Ark Angel II to pick them up. Together, they found and crossed a Force bridge. They searched for the Citadel's computer core, but Aphra and her father were abandoned by Krrsantan and the droids."}, {"tag": "p", "text": "After taking out several snowtroopers, Aphra and her father found an elevator that took them to the core. There, they found the remains of Rur. However, the core was not functional and they realized it was missing a crystal. Aphra searched over Rur's remains while she and her father talked about how he was the worst parent and husband, and eventually she found a crystal. With the crystal Aphra reactivated the computer core. When the core was reactivated, a voice came, claiming it was Rur. At first, they pair refused to believe until the voice reactivated one of the Citadel's droids."}, {"tag": "p", "text": "It demanded to know what year it was and threatened to torture Aphra and her father. Aphra was able to make deal with Rur in exchange of knowing what happened. After hearing of Rur's efforts to copy himself into the computer core, Aphra told Rur that it had been over a thousand years since the Ordu Aspectu's Doom. Rur then decided to punish the living, starting with Aphra and her father. Aphra shot one of Rur's droids, and was ordered by her father to destroy the console and take the crystals. She was able to do so with one of her salvaged lightsabers despite Rur's warning about destroying the Citadel. Aphra then took one of the Citadel's crystals."}, {"tag": "p", "text": "Aphra tried to get Tolvan and her snowtroopers to follow them back to their ship. Aphra, her Father and Tolvan were then able to make it to the shuttle. As they made their escape from the Citadel, however, they were attacked by the shuttle's RA-7 protocol droid that had been taken over by Rur. Eventually, Rur lost control of the droid, and Aphra, her father and Tolvan were able to escape the Citadel's destruction. Tolvan demanded to know who Aphra was until her father wounded her and knocked her out with one of the salvaged lightsabers. Aphra and her father left Tolvan and her protocol droid on a planet in the Outer Rim. Despite Aphra's belief that the crystal was Rur and could be used, she agreed with her father to take it to Quarantine World III for safekeeping. After leaving the crystal, Aphra and her father agreed that it was in a safe place. She told her father they had to get rid of the stolen Imperial shuttle so she could get her doctorate back and return to Cosmatanic Steppes."}, {"tag": "p", "text": "After getting her doctorate back, Aphra was able to sell the lightsabers for profits and returned to the Cosmatanic Steppes bar. There, Aphra payed her debt to Soo-Tath's brother and was reunited with Black Krrsantan and her droids. She revealed that she had kept the crystal and had a fake planted at Quarantine World III instead."}, {"tag": "h4", "text": "Meeting on Ktath'atn"}, {"tag": "p", "text": "Aphra traveled to Horox III, where she met up and got into a brawl with Luke Skywalker, which was finished by Black Krrsantan's intervention. Aphra got Skywalker to come with her and Krrsantan aboard the Ark Angel II as she told Skywalker about the crystal that came from Rur's citadel and how she believed he could reactivate it. Luke wasn't able to reactivate the crystal, and Aphra decided to take it to one of the meetings of the Queen of Ktath'atn as alternative."}, {"tag": "p", "text": "Aphra, Skywalker and her crew then landed at the Ktath'atn's Citadel. There, Aphra and Skywalker were met by Ktath'atn's people who asked for food and Aphra responded asking Krrsatan to bring them some food. They group then was stopped by the Queen's guards, who told Aphra Wookiees were not allowed at the Queen's meeting. As they were taken to quarters, Aphra told Skywalker how she had found him after leaving a message for Starros at the Horox III rebel outpost."}, {"tag": "p", "text": "Aphra and Skywalker changed their clothes to attend the meeting. Then, they went to the Citadel's throne room, where they met the Queen. After the other attendants to the meeting presented their items to the Queen, Aphra showed Skywalker as her present. At first, the Queen rejected him until Skywalker force-pushed someone and Aphra and Skywalker were then told to meet the queen in the morning so she could hear their request. The next morning, Aphra and Skywalker joined the Queen for breakfast, where Aphra spoke of how she had captured him. Meanwhile Aphra watched as the Queen ordered Vespinax to threaten Skywalker into using the force. Aphra then told the Queen about the Ordu artifact."}, {"tag": "p", "text": "Aphra watched as Skywalker moved a tray to hit Vespinax and made their escape from the Queen and several abersyn symbiotes. She then called Triple-Zero to get them out, but the duo came under attack by several of the Queen's zombies. When finally Aphra and Luke made it to the Ark Angel II, they were met by Solo, Leia, and Starros. Starros tried to shoot Aphra, but Skywalker prevented her from doing it. After Skywalker chose to follow Aphra, she started examining more of the symbiotes until her and Skywalker were confronted by the Queen and her guards."}, {"tag": "p", "text": "As Leia, Starros, and her droids escaped, Solo was captured and taken by the Queen, with Aphra left behind to deal with her. Aphra was confronted by the Queen who asked her to leave and gave her the Rur crystal which had been activated by the Queen. Aphra asked what would be the future of Skywalker but decided to leave despite his pleas. She was then given a ship to leave. Aphra listened to Rur's voice who counseled her on abandoning Skywalker. Aphra heeded Rur's words and rescued Skywalker from the Queen. She intentionally infected Skywalker with a parasite in order to turn him into the hivemind's king, capable of challenging the Queen."}, {"tag": "p", "text": "Aphra watched as a possessed Skywalker confronted the Queen, and then watched as Skywalker freed himself and killed the Queen with the help of the crystal. After Han disbanded the zombie hive, Aphra told her droids to burn the Citadel and suggested they contact the Empire to contain the symbiotes. Before leaving, Aphra spoke with Starros about what had gone wrong with each other. She then offered to give Skywalker access to the Rur crystal, though he knew Rur was not a Jedi. Aphra, Black Krrsantan, and her droids then left aboard the Ark Angel II."}, {"tag": "h4", "text": "Auction of Rur"}, {"tag": "p", "text": "Some time later, Aphra infiltrated the Isolate-4 Lab to activate the Rur crystal. Using the alias \"Sulan Do\" and posing as Black Krrsantan's \"agent,\" Aphra arranged for two journalists, Dixnet Dat and Domthro Rus, to meet with Black Krrsantan so that they could learn the story of Black Krrsantan's origins. Unbeknownst to the journalists, their meeting with Black Krrsantan was a distraction—Aphra broke into their ship and with the help of Triple-Zero and Beetee, used it to transmit hundreds of messages on the undervine. The messages advertised the auction of a rare alien artifact."}, {"tag": "p", "text": "Several weeks later, Aphra held an auction to sell off the Rur crystal. As Aphra showed the Auction's guest the crystal and its abilities, Rur tried to kill her again by possessing a droid. However, Aphra was saved when Krrsantan shot the droid down. Aphra spoke with Yonak and showed him her security systems to relieve his concerns. Then, she told her guests that she would speak with them individually and made sure that her two droids would not murder anyone without her orders."}, {"tag": "p", "text": "The auction was reinstated and Aphra listened as her guests such as Thomas Toov tried to out bid others. Aphra showed her guests how she would repair several of them. Aphra was then approached by the Ezaraa Dominion, who offered her 0.00001% of her Imperial revenue for her and ten of her descendants. She then met with the Shadow University, who offered to let her continue to have access to the crystal in addition to a fortune. However, when she was blackmailed by them, Aphra turned down their offer. As she spoke with Papa Toren, Krrsantan had a confrontation with the Kthoo-Ra, which was stopped by Beetee on Aphra's orders. She then turned Kthoo-Ra's employers, the Xonti Brothers' offer down."}, {"tag": "p", "text": "In the medical bay, Aphra was strangled by Krrsantan out of anger. However, she was able to convince him to let her go. Aphra was then told that the Shadow university had increased its bid. She then went before her fellow guests and told them that the Shadow University had bought the crystal. However, Rur had taken over another droid, and attacked Aphra's guests. Aphra protected the Shadow University's guests from Rur, and then figured out that someone else was controlling the guns. Unfortunately, Aphra and her droids were unable to deactivate the guns. In the mean time Krrsantan still wanted to kill the Xonti brothers. Aphra fought Rur's possessed droid and was almost killed by it until Beetee and Triple-Zero used the guns on it. Aphra then joined her droids, who revealed that Lord Vader had arrived."}, {"tag": "p", "text": "As Vader arrived, Beetee and Triple-Zero revealed to Aphra that they had contacted him in order to force her to remove her leashes from them. Aphra agreed and removed their leashes from them. After Beetee and Triple-Zero left, Aphra was joined by Krrsantan. She joined what remained of her guests, who wanted to use her as bait for the Imperial troops. Aphra attempted to escape by tricking the Xonti Brothers into thinking she was double-crossing Krrsantan. In reality, Aphra rigged a nearby droid to explode, killing the Xonti Brothers and allowing Krrsantan to board a ship. Despite having the opportunity to escape, Aphra decided to go back for the Shadow University's ship instead. Aphra ran when she came face-to-face with a droid possessed by the spirit of Rur; in doing so, she led Rur to Darth Vader and his troops. Aphra hid while Rur and Vader battled in a lightsaber duel."}, {"tag": "p", "text": "Due to Vader and Rur being distracted by their duel, Aphra was able to escape. Upon discovering some of her remaining guests, Aphra used Sutha as a human shield, which eventually resulted in Sutha's death. After Vader disabled and defeated Rur, Aphra was able to escape on the Shadow University's ship. Although Vader sensed her presence, he did not investigate further, considering it to be of little matter. Following her escape, Aphra returned some of the priceless artifacts to the Shadow University and the others to the Museum of Bar'leth in order to double her profit. Afterwards, Aphra retreated to Zeltros to vacation and celebrate her liberation from Triple-Zero, Beetee, Krrsantan, and Darth Vader. While relaxing on the beach, however, Aphra was confronted by a man named Tukan, who wanted to bring her to trial for her murder of Dukan. Aphra casually fired at Tukan, killing him, only to discover Tukan was not alone, and she was outnumbered."}, {"tag": "p", "text": "On X3-299-11, Aphra was eaten alive by a Shadowfang Beast when she tried to retrieve a idol. She contacted and hired hunters Nokk, Winloss and several other hunters to help her escape the beast. Aphra guided the hunters to her and the beast's location past several traps. Winloss and Nokk were able to kill the creature. Aphra was then able to escape from the creature. She then used a jetpack to make her escape without paying the hunters."}, {"tag": "h3", "text": "A new master"}, {"tag": "h4", "text": "Raid on Someilk"}, {"tag": "p", "text": "After managing to escape from Dukan's old clan members, Aphra was coerced into working for Triple-Zero, who had become a crime lord after taking over the Son-tuul Pride base. Triple-Zero threatened to alternatively kill Aphra or alert Darth Vader to her whereabouts if she refused to work for him. Under Triple-Zero's orders, Aphra helped lead an attack on an Imperial base at Someilk. Upon arrival, Aphra was surprised to discover that Magna Tolvan was at the base. When Tolvan attempted to commandeer Aphra's crew's ship, Aphra took her hostage at gunpoint. While Aphra waited for her team to complete the mission, she made small talk with Tolvan and the two tentatively bonded. Not wanting to disclose her true identity, Aphra gave the name of \"Joystick Chevron\" when prompted. Aphra reiterated her attraction to Tolvan; when Tolvan pointed out her deformations, Aphra explained that it reminded her of her own electro-tattoos, stating that it made them both \"interesting.\" After learning that Tolvan was demoted due to Aphra's past actions, Aphra apologized. Due to her loneliness and crush on Tolvan, Aphra decided to merely stun Tolvan rather than kill her, stating that she was fine with being captured by Imperials as long as Tolvan was the one who caught her. Aphra left an unconscious Tolvan on the base's landing area. Aphra was shocked when, following her crew's departure, Rexa Go destroyed the entire Imperial base. The act filled Aphra with regret, though she was forced to keep working for Triple-Zero."}, {"tag": "h4", "text": "Mission to Skako Minor"}, {"tag": "p", "text": "Under Triple-Zero's direction, Aphra retrofitted some \"weird\" droids for unknown use. She also experimented with a relic splicer rig, which resulted in a cloned and modified tooka, which Aphra named Flufto. Triple-Zero then ordered Aphra to take a crew of mercenaries with her on a mission to Skako Minor. Before the trip, Aphra clashed with Triple-Zero and Beetee, stating that the droids would not risk sending Imperial troops her way and arguing that she could just run away."}, {"tag": "p", "text": "Aphra evaluated her crew of mercenaries, which included among them Tam Posla. When Aphra attempted to depart for Skako Minor, she was informed that she would have to decide which crew member to leave behind. Aphra conferred with Rexa that they would be better off figuring out what Triple-Zero's plan was or finding a bigger ship. After stating this, Aphra discovered that Triple-Zero was listening in on her. As punishment for doubting his threats, Triple-Zero directed Imperial troops to the \"stolen\" ship, forcing Aphra to chose someone to abandon in order to escape. Aphra reluctantly chose to leave Viscount Rabael Dir Glorio behind."}, {"tag": "p", "text": "While traveling to Skako Minor, Aphra correctly deduced that Triple Zero was intending to raid the personal workshop of Wat Tambor of the Techno Union. Thinking the Empire was unaware of the location of the workshop, Triple-Zero hired Hallio Bas, a Skakoan, to lead Aphra and the others to it. However, it was revealed Hallio had previously made a deal with the Empire, promising to turn over any looters to the Empire in exchange for the end of the Empire's occupation of Skako Minor. As the Imperial troops prepared to execute Aphra and the other mercenaries, Aphra handed over Flufto to Hallio, stating that it wouldn't be fair for Flufto to die. Unbeknownst to everyone, one of Aphra's modifications to Flufto was the ability to explode once Aphra used the codephrase \"snugglebum oogiewoogie.\" Flufto exploded, killing all Imperial forces."}, {"tag": "p", "text": "Following the explosion, Aphra revealed that she had an entire crate full of shrink-frozen Tooka clones that were all enabled with the same verbal code for self-destruction. Aphra led the way into Wat Tambor's workshop, with the goal of locating all files relevant to the Triple-Zero matrix. Aphra explained to Rexa that it would not be an easy task, due to the workshop containing multiple defensive droids and being built around a Hellhulk station from the Hundred-Year Darkness. Aphra advised her crew not to touch the \"pointy sparkly thing\" (an ancient techno-totem that controlled a Chthonic worm god, which guarded the workshop), stating that the workshop was likely full of traps."}, {"tag": "p", "text": "Unbeknownst to Aphra, her location had been tracked down by Magna Tolvan, whose ship crash-landed inside the workshop, damaging the techno-totem. Tolvan ordered her stormtroopers to fire on Aphra's crew; however, the damage to the techno-totem caused the worm god to awaken. As the worm god wrecked havoc on Aphra and Tolvan's crews, Tolvan and Aphra briefly held each other at gunpoint before the worm god disarmed them. Tolvan and Aphra were able to take shelter in a mechanical shaft after they used one of Aphra's Tooka clones to create an explosive diversion, however, the worm god continued to pursue them."}, {"tag": "p", "text": "Tolvan and Aphra argued while they were trapped inside the mechanical shaft. Aphra blamed Tolvan for accidentally awakening the worm god, while Tolvan stated that it was Aphra's fault Tolvan had lost her rank and had nearly been executed. Tolvan stated that Aphra was \"the worst thing alive\" and that she would see Aphra incarcerated. The two shared a laugh when they suddenly realized the ancient techno-totem had ended up in the shaft with them. Aphra then remarked that they were going to die. With the worm god nearly upon them, and believing it to be their last moments, Aphra and Tolvan shared a passionate kiss."}, {"tag": "p", "text": "Aphra's droideka, Dek-Nil, accidentally caused a stormtrooper to misfire; the misfire struck the workshop's ceiling and the worm god was crushed under the falling debris, thus saving Aphra and Tolvan. Tolvan asked Aphra to tell her her name. Tolvan explained to Aphra that Aphra's file was marked in the Imperial records and Tolvan was afraid someone higher up would eventually step in. Aphra stated that Tolvan was just afraid of being murdered herself, as that was how the Imperials operated, though Aphra also admitted that her own field of work worked the same way. Aphra replied that Tolvan should stay away from her, for her own safety. She advised Tolvan to leave, but the two were spotted by Rexa. Aphra then shot Rexa and allowed Tolvan to escape unnoticed."}, {"tag": "p", "text": "Aphra restored the techno-totem to its rightful place and commanded her crew to loot the workshop. Back on her ship, Aphra informed Triple-Zero that Wat Tambor had acquired the Triple-Zero matrix nearly a century ago, with the intention of studying it. However, Wat Tambor had found the Triple-Zero matrix to be too dangerous and sent the matrix off to quarantine, where Aphra later stole it. Aphra explained that while Wat Tambor had kept all of Triple-Zero's memories, the separatists's R&D had been siphoned up by the Empire following the Clone Wars. Aphra continued to explain that all data was now housed in Hivebase-1, part of the Tarkin Initiative, and one of the biggest archives ever built. Aphra stated it was impossible to even approach without a clearance pattern, and that Hivebase-1 was the gravity anchor for a billion strong swarm of acid larve. Despite this, however, Aphra realized that Triple-Zero indeed intended for Aphra to attempt a raid on the base. She resigned herself to thinking up a plan for the raid."}, {"tag": "p", "text": "When questioned by Triple-Zero as to if the Skako Minor mission had incurred any casualties among Aphra's mercenary crew, Aphra lied that there had been none. After ending her communications with Triple-Zero, Aphra went back to check on her crew. Unbeknownst to Aphra, Tolvan had been able to sneak aboard Aphra's ship by disguising herself by wearing the skin of murdered Glahst Ombra, one of the other mercenaries."}, {"tag": "h4", "text": "Capturing General Syndulla"}, {"tag": "p", "text": "Aphra and her crew found out where the Lucrehulk Prime was located. The Lucrehulk Prime had become the Rebel Alliance's flight school. There, she and her crew poised as new recruits. Aphra also had Flufto with her. They were accepted and waited for the recruitment assessment to begin. Aphra had \"Ombra\" melt into the shadows aboard the ship. During the tour, Aphra released the Tooka which had bio explosives in it's genes."}, {"tag": "p", "text": "Aphra ran into General Hera Syndulla, who shot Flufto. Aphra and her crew revealed themselves to be mercenaries rather than new recruits for the Rebel Alliance. Syndulla and her crew surrounded Aphra and her crew. They were taken to the brig. There Aphra, was approached by \"Ombra,\" who revealed herself to be Tolvan. Aphra tried to convince Tolvan to join her, but still refused. The two kissed each other, but Tolvan demanded that she reveal her name or be shot. Aphra was saved when Dek-Nil stunned Tolvan and Tolvan inadvertently deactivated the brig's shields. Aphra had Tolvan placed back into the vent. Aphra and her crew stayed in their cells."}, {"tag": "p", "text": "Aphra and her crew were taken to the hangar, where Syndulla gave them their ship so they could leave. Aphra offered Syndulla counter proposal; that she and her crew could get them into Hivebase-1. As Syndulla thought about this, Aphra signaled Bog to give Sister Six her blasters. Aphra had Syndulla taken aboard her ship. When Posla saw that they were kidnapping Syndulla, he decided to quit. Aphra, despite this, allowed Posla to continue with them. Aphra contacted Hivebase-1's officer and offered to give the Empire Syndulla."}, {"tag": "h4", "text": "Infiltrating Hivebase-1"}, {"tag": "p", "text": "Aphra ran a diagnostic on Bog and attempted to contact 0-0-0 and BT-1 to no avail. She learned about Bog's surgeon, Dr. Cornelius Evazan, his experiments, and how Posla lost his badge in his attempt to capture Evazan on Jedha prior to Jedha City's destruction. As their ship approached Hivebase-1, Aphra revealed to Syndulla that she knew about the tracker in her rank patch. Aphra offered to un-jam Syndulla's signal. When the Lucrehulk Prime caught up with her ship, it came under attack by a Scaraphyte swarm."}, {"tag": "p", "text": "After landing ship on the base, Aphra and her crew went deeper into the base to snoop around. Aphra had Posla stay with Syndulla, saying she had done her bit. Aphra, her crew and Syndulla saw the many rejects of the Tarkin Initiative. Aphra was enamored with many of the obscenities, much to the disgust of Syndulla. Aphra compared it to being no different then the Rebels recruiting farmboys. During this time, Tolvan subdued the Lucrehulk Prime's crew and took control of the ship from the rebels. Aphra contacted her and was able to convince her just to capture the ship and its crew, despite Commander Yewl's orders. However, Tolvan betrayed her and alerted Yewl to her crew's presence."}, {"tag": "p", "text": "The rejects around Aphra and the others defrosted and Aphra told Posla she could do with his cybernetic weapons. Posla refused with the excuse that the rejects were victims that had done nothing wrong. The rejects fired on them and disabled Dek-Nil, prompting the others to run to cover. Aphra continued to plead for Posla to help them but his mind could not be changed. Aphra therefore resulted into enacting her plan B and told the group to return to the ship. As they did that, she activated a bug she had installed in Bog when running his diagnostics. This caused Bog to run at the rejects and get himself killed. Posla witnessed this and mobilized his cybernetic weapons. Aphra and the remaining of her team left Posla to face the army of rejects alone."}, {"tag": "p", "text": "The rest of them made it to the data core of Hivebase-1 and began searching for 0-0-0's memories. Posla caught up with them in shock from his soulmate's death. Syndulla had noticed her activating Bog's bug and confronted her about it. However, they were soon stopped by Yewl and his soldiers. A firefight ensued and Aphra had the others defend her as she continued on the console. There, Aphra took over the Lucrehulk Prime using the bug she put into it's control core when she met Syndulla. The Lucrehulk Prime latched onto Hivebase-1 and used it's tractor beam to pull out the data core from it. Dek-Nil awoke from playing dead and began shooting at the Scaraphyte swarm to make it behave erratically. The rest of the shrink frozen Tooka's also escaped from their box and roamed Hivebase-1 until one of the officers over the comm was tricked by an altered firing registry into saying the code word that set them off, destroying Hivebase-1."}, {"tag": "p", "text": "Syndulla congratulated Aphra and her team on obtaining the data core and she kept her top officer, Bini, from having them killed. Aphra had Posla look for Tolvan in the vent of the Lucrehulk Prime and he was tied up and had his armor taken by her. Tolvan gave Syndulla Posla's location in his armor and Sister Six joined the rebellion. Aphra and Tolvan left the Lucrehulk Prime and they kissed on board the shuttle."}, {"tag": "h4", "text": "Attack on the Son-tuul Pride"}, {"tag": "p", "text": "Aphra returned to 0-0-0 and presented him the datadisk with his memories on. 0-0-0 thanked her but he wasn't finished with her. Aphra assumed he wanted to kill her but he thought he already did. After summarizing the horrible things Aphra had done to get his memories, he told her she enjoyed it. Aphra tried to make an excuse for it could not. 0-0-0 finally told her that love was murder and told his men to kill her. At that moment, the Son-tuul Pride was ambushed and a large firefight ensued. 0-0-0 and BT-1 escaped but the rest were either killed or captured, including Aphra. A stormtrooper brought Aphra to their superior, Tolvan, who had bugged Aphra. She then had Aphra put on Shuttle Six with Dek-Nil and they were taken away."}, {"tag": "h3", "text": "Accresker Jail"}, {"tag": "h4", "text": "Imprisonment"}, {"tag": "p", "text": "Tolvan had Aphra imprisoned at Accresker Jail, a wreckage-prison held together by an attractor node and pulled by a prison tug, an Arquitens-class command cruiser. During her time there, she and the other prisoners were required to serve in the prisons convict army, the Accresker Penal Legion. She was required to stay close to her hubdroid, otherwise a micro-implant put inside of her by the Jail's superiors would explode. The hubdroid also supplied her food and loaned her a gun for every battle. As well as Aphra, Dek-Nil had been taken to Accresker Jail but instead of serving in their legion, he was made a hubdroid. But although the Imperials put a restraining bolt on him, his control circuit was a fake, with his actual one being hidden behind beskar plating."}, {"tag": "h4", "text": "Escape attempt"}, {"tag": "p", "text": "Around a week after her imprisonment, she and the Penal legion were sent to clear out a crippled EF76 Nebulon-B escort frigate. During the fight, she tricked her hubdroid by telling it there was rebel commandos ahead and it malfunctioned. While Aphra talked to an alien named \"Lopset Yas,\" who was truly a disguised Cornelius Evazan, the hubdroid exploded, killing everyone in her squad except for her and Yas. Their micro-implants began beeping and Yas panicked. However, Dek-Nil arrived in time and transferred them to his now empty squad. After doing that, Aphra led the two back to the wreckage prison and she explained to Yas her affiliation with Dek-Nil and how his restraining bolt was not controlling him."}, {"tag": "p", "text": "After turning a few corners they found an escape pod with a protocol droid and astromech next to it. Aphra and Yas gunned down the droids and Aphra asked him if he was worth taking with her. However, Yas noticed Dek-Nil's restraining bolt glowing and moving across his metal plating. Once moved, the Imperial programming in it took control of him and he identified and destroyed the escape pod. Aphra and Yas were knocked to the floor by the explosion and as they looked up, they noticed a Force spirit near them. Dek-Nil then forced the two to return to the prison before they could look into what they had just seen."}, {"tag": "h4", "text": "Interrogation"}, {"tag": "p", "text": "After the battle, Aphra was interrogated by the prison's Interrogation Officer and his Lieutenant on the prison tug. They had Aphra explain her experience at Accresker Jail and the events on the Nebulon-B frigate. The Lieutanant noticed she was lying a lot and concluded that she was hiding something big. However she couldn't say what and the Interrogation officer decided that more effective means may work on Aphra. After getting back to the prison Yas gave Aphra a transmitter he had managed to fix during his time at Accresker Jail. Aphra used it to contact Tolvan in order to get her out. Tolvan said that wasn't possible but Aphra told her that if the Interrogation officer managed to break her, then they may find out the secrets she knows about Vader's plot to replace the Emperor. Aphra told Tolvan that her knowledge put them both at risk as Tolvan knew of it as well. Aphra pleaded for her to go and get her."}, {"tag": "p", "text": "After talking to Tolvan, Aphra spotted the Force spirit she had seen during her escape attempt. She called for Yas, who may have seen it as well, but realized he was trapped under something. Part of his head was molding and she helped him out. After being freed, Yas explained how he was convinced Accresker Jail was haunted, recounting unexplainable events he had encountered. Aphra laughed at it and told him it didn't matter. She then confronted him about his shape-shifting ability. Yas admitted to it and changed to the forms of his former users to show Aphra what he had done. However, he explained to her that how people only sought to exploit him for his ability. Aphra agreed with him and remembered something her mother used to say."}, {"tag": "h4", "text": "Second escape attempt"}, {"tag": "p", "text": "Aphra was taken back to the prison-tug and put in a holding cell with Dek-Nil and the Interrogator's Lieutenant guarding her with two stormtroopers. Tolvan suddenly entered the room and told everyone to leave. The Lieutenant told her it was protocol for her to stay so she ordered her to hum audibly to herself in the corner. Tolvan then approached Aphra and they began plotting her escape."}, {"tag": "p", "text": "Twelve hours later, the Accresker Jail arrived at it's next target, a crippled pirate station. Aphra and the Penal legion were sent in and they layed siege on the pirates. As they did that, Aphra used the Imperial authority code 6690B1 on Dek-Nil to take control of his restraining bolt. She then had him take her and Yas to a rendezvous point to meet Tolvan."}, {"tag": "p", "text": "They arrived at the rendezvous point where Tolvan was waiting in a TIE fighter. They were going to board it when the Force spirit reappeared and took out the sensor disruptors keeping the TIE from being scanned. Tolvan urged Aphra to get on there now but she was distracted by the Force spirit. As she chased it, she discovered it going towards a Penumbra-1 shattersprite, an ancient Jedi starship. Eager to look for treasure, Aphra approached the ship with Dek-Nil and Yas and Tolvan kept pleading for her to come back. Without warning, Tolvan was attacked from behind. The attacker was the rebel mercenary Sana Starros, who had been assigned to capture Aphra by General Syndulla. Starros's ship, the Volt Cobra, crippled Tolvan's TIE and as it exploded, Tolvan jumped out with a rocket launcher and shot at it. The rocket shredded through the Cobra's side and downed it."}, {"tag": "p", "text": "Meanwhile, Aphra and the others had encountered the Force spirit again and it dismantled Dek-Nil. The spirit had taken the form of Aphra's mother but Aphra did not fall for it and shot at it. The spirit disappeared back to it's source, which Yas identified as gundravian hookspores. The spores grew towards them and they fired at it, making no effect. The spores however retreated despite that to protect the corpse of a Jedi it had once possessed. Aphra wanted to take the Jedi's lightsaber but they were forced to return towards the prisoner berths. Yas took Dek-Nil's central processor and they retreated from the retracting airdome to find Starros and Tolvan. The pair had discovered they had the common objective of rescuing Aphra, which had failed to Aphra's realization. The group was then approached by a hubdroid, who took in all of their weapons. It then took Aphra away for her next interrogation."}, {"tag": "h4", "text": "Decommissioning of Accresker Jail"}, {"tag": "p", "text": "Aphra was taken before a Bor of the Mairan, named Bor Ifriem. The Bor penetrated her mind instantly and many of her past events appeared before her. Aphra confessed that she was thinking about her mother and the Interrogation officer told her that the Bor could delete her memories of her. Aphra then gave in and told them about the hookspores. The Lieutenant was surprised to find that it was true, and Accresker command immediately decided to decommission Accresker Jail. They announced it to the prisoners, telling them the prison was to be propelled into a rebel planet. An individual in protective clothing then threw Aphra in front of them as the announcement finished."}, {"tag": "p", "text": "Now desperate more than ever to escape, Aphra and the others forged a new plan. Aphra contacted Tam Posla, who she was not on good terms with after their last intertwining. Aphra demanded Posla rescue her and showed him Yas, who had taken the form of Cornelius Evazan. Posla fell for Yas's impersonation and agreed to Aphra's needs. To Posla and Aphra's ignorance, however, 0-0-0 had bugged Posla's ship and was listening in. Both Posla and 0-0-0 were now on their way to her. Meanwhile, Starros and Tolvan noticed escape pods abandoning the prison-tug. Aphra and Tolvan quickly concluded that it was being abandoned right at them and they began to run. The cruiser then crashed into Accresker Jail."}, {"tag": "p", "text": "Aphra and the others found the convicts were rioting. One of them saw Aphra and, knowing she had been under interrogation, they blamed her for the prisons scheduled destruction. The group began to run from the rioters and as they turned round, they immediately encountered a large alien with a heavy gun. The alien was suddenly attacked by the Force spirit which had begun rampaging on the convicts. Tolvan asked Aphra if she could get them onto the prison-tug and find a possible way to escape. Aphra began looking into it and Starros thought the large alien's gun may breach the cruiser's hull. The four of them picked up the gun and fired it on the side of the ship, blowing a hole in the side."}, {"tag": "h4", "text": "A new escape plan"}, {"tag": "p", "text": "The group entered the prison-tug and made it to the control centre. Aphra looked through the ship's systems and discovered the Imperials had left behind an escape pod. However, it was behind sealed bulkheads which they could not lug the gun to, and the escape pod still couldn't escape a gravity field like the one on Accresker Jail. Aphra however realized that if she could slice the ships systems, she could dial down the gravity field generator as well as slicing the bulkheads so they could get past them. After slicing a few minutes on the nearby terminal, Aphra got into the systems and set the prisons gravity to half, causing Accresker Jail to shift much of it's wreckage and even excess some of it. After opening the bulkhead, they traveled towards the launch deck to find the escape pod. The gravity alteration, however, had moved Penumbra-1 shattersprite in their way and the Force spirit confronted them. The hookspores then possessed them but felt they were not of use to it and rejected them."}, {"tag": "p", "text": "Aphra deduced that it may be looking for another heroic to take control of after the Jedi it imprinted on had died. Starros then realized that Aphra had deliberately moved the Jedi ship in front of them to obtain the Jedi's lightsaber. Aphra ignored her and made a judgement that the hookspores may move for Posla when he arrived. Luckily for them, Posla was approaching Accresker Jail in his ship. Aphra and the others continued for the escape pod and when they found it, Starros and Tolvan climbed in. Aphra then attempted to jettison the escape pod with the two in, but Tolvan jumped out at the last minute, leaving Starros in there as it shot out. Aphra had intended to escape alone, which Yas questioned, but she was forced to accept Tolvan into her plan."}, {"tag": "p", "text": "Aphra led the other two to the hanger of the prison-tug, and she told Yas to remain on the grille below him. Yas then realized she was using him and confronted her for it. Aphra told him it was the only way to survive and he reluctantly complied, shape-shifting into Dr.Evazan. Aphra then revealed the grille to be a coolant grille and she froze Yas in Evazan's form. Posla then arrived in the hanger on his ship. He brought with him an escape shuttle to trade for Evazan and began inspecting the frozen individual, once again not realizing it was Yas. The hookspores had detected Posla and approached him from behind. Tolvan then froze the fungus as it tried to possess him and he took the ice chunk, housing Yas, away."}, {"tag": "h4", "text": "Enemies left and right"}, {"tag": "p", "text": "With the hookspores frozen, Aphra returned to the Penumbra-1 Shattersprite to retrieve the lightsaber belonging to the Jedi corpse. She then returned to the escape shuttle Posla had given her, with Tolvan, and attempted to flee Accresker Jail. 0-0-0, though, arrived on his touring ship and shot down the shuttle. Aphra and Tolvan fled from their pursuers and 0-0-0 was slowed down by a group of prisoners. As the two managed to make some distance from the murderous droid, Aphra realized that Accresker Jail was about to hit Tiferep Major. At the last moment, however, the prison stopped falling. Aphra realized it was a tractor beam that had saved the clump of wreckage and noticed a shuttle arriving. That shuttle delivered Darth Vader, whom Tolvan had contacted as a last resort."}, {"tag": "p", "text": "As Vader searched for them, Aphra led Tolvan back to find Bor Ifriem and told her to erase her memory with it. Tolvan refused and convinced Aphra to erase her memory of Vader's conspiracy instead. Aphra agreed and did so. Vader, though, was catching up with them and found Tolvan. Aphra watched him interrogate her through a cam droid. That was when Yas appeared. Aphra was confused about this but realized why when Posla stepped out and pointed his blaster at her. Aphra activated the ancient lightsaber to counter him, but it deactivated due to its degrading age. Posla then attempted to arrest her when 0-0-0 attacked him from behind. Aphra and Yas watched in horror as Posla was mauled to death by the droid. 0-0-0 then captured Aphra and Yas escaped."}, {"tag": "p", "text": "0-0-0 dragged Aphra towards his touring ship to find it destroyed. 0-0-0 called for BT-1 but Yas appeared and claimed to have seen the droid's parts scattered around. Yas then shot 0-0-0, deactivating him. Aphra thanked him for saving her but he stunned her, taking her and 0-0-0 back to Posla's empty ship. Aphra woke up hours later, chained to a wall in the ship. She asked Yas why he had done this and he revealed himself as Cornelius Evazan, wearing a pluripleq from Thannt to disguise himself. Evazan told her that he had placed a proximity bomb inside of 0-0-0, meaning the pair had to stay alive and with each other to avoid exploding. Evazan also patched into a live feed from 0-0-0's eyes so he could monitor them both. As it happened, the ship docked with another ship, manned by Evazan's partner in crime, Ponda Baba. Evazan set 0-0-0 to reboot and left Aphra with him."}, {"tag": "h3", "text": "Chase on Milvayne"}, {"tag": "p", "text": "Onboard Posla's ship, Aphra and 0-0-0 realized their predicament and plotted their next move. Accessing a computer onboard, Aphra discovered information on Posla's personal cyberneticist, Doctor Rajam Nuss, who resided on Milvayne. Aphra believed he could remove their proximity bombs and thus, the pair set off for Milvayne. Upon landing at Milvayne City, she tried to bribe a official, but when it failed, she allowed 0-0-0 to shock him. As they entered the city, they were immediately spotted by Milvayne Authority cops. Aphra tried to avoid blasterfire while commandeering a speeder, but realized 0-0-0 was not nearby. Her bomb was armed, but she dashed over to the maniacal droid before it exploded, who was taking control of a different speeder, before it exploded. Aphra shouted at 0-0-0 that they needed to cooperate to survive, but 0-0-0 disagreed. As the two of them were surrounded and Aphra allowed him  to take the ship's security fob but was horrified to see him self-destruct their ship to distract the cops. Inside, Aphra used the local holonet to find directions to the doctor, but when she began to instead search for information on Tolvan, 0-0-0 called her out. Failing to find a record, Aphra began looking for Nuss and soon located him. Arriving at his lab, they paid him to remove the bombs."}, {"tag": "p", "text": "As the prepared for the operation, Aphra apologized to 0-0-0 for encrypting his memories as part of her attempt to convince 0-0-0 to not kill her as soon as the procedure was done. Nonetheless, the droid promised to kill her \"exceedingly slowly\" after she got a five minute head start. After going under for an hour, Aphra awoke to see Doctor Nuss asking for his payment. She rose and instead ran for the door as 0-0-0 reminded her of the five minutes. However, Aphra realized with horror that the bombs were still inside them and had been armed once again. As she frantically found 0-0-0 again, she announced that they had only ten hours before they detonated regardless of their physical distance, but she found 0-0-0 standing over the bloodied corpse of Doctor Nuss."}, {"tag": "p", "text": "Meanwhile, Evazan, disguised as Princess Leia, hired Winloss and Nokk to eliminate Aphra, who were excited at their prospects of revenge after she left them at X3-299-11's temple, Meanwhile, Aphra planned to search for Dr. Nuss' mentor, Professor Prexo, in order to remove the bombs. She accessed the local holonet again and ran some slicetech, co-plotting suspected criminal activities with bus schedules, to find a driver that was likely to accept a bribe. All the while, she tried to convince her droid companion to accept her plan, but the droid was quite reluctant since the plan did not involve murdering anyone. When Aphra tried to blame 0-0-0 for their circumstances, saying that it was his fault for killing Nuss, 0-0-0 merely responded by saying that Aphra was the reason they had the detonators in the first place. Admitting defeat, Aphra begged 0-0-0 to try her plan, and she succeeded in bribing the driver. However, she refused to allow 0-0-0 to ride alongside Aphra. When Aphra bartered with her to have her droid ride near her, not telling her that her life depended on it and claiming it was for \"warranty reasons,\" the driver said that he could sit with the luggage. 0-0-0 took offense, and after threatening to kill her, the driver called Informahub, and 0-0-0 was tossed into the Underworld, where they had seen criminals been thrown into only moments earlier. Aphra decided to grab the driver's blaster and take her chances following 0-0-0, knowing her chances of surviving without him were zero, diving off the platform after him."}, {"tag": "p", "text": "Down in the heap of garbage, she met the young girl Vulaada Klam and her pet qaberworm Gurtyl, the latter of whom had grabbed 0-0-0. Aphra convinced Klam to tell her pet to drop the droid, and then promptly prevented 0-0-0 from killing the girl. Aphra was able to convince Klam to give her and 0-0-0 a ride on Gurtyl across the undercity in less than nine hours and thirteen minutes, which was how much time 0-0-0 calculated they had before their bombs detonated, with Aphra promising Klam that she could have the protocol droid afterwards. When 0-0-0 glanced at her, Aphra whispered that it was a white lie, to which 0-0-0 responded that she would predictably betray someone again, either backstabbing him or cheating her new companion Klam."}, {"tag": "p", "text": "As they rode, they attacked by Tam Posla, who had been reanimated by the gundravian hookspores. As Posla gloated that he had tracked them using 0-0-0's transponder signature, a reanimated BT-1 appeared and brandished his weapons on the pair. Aphra and 0-0-0 attempted to run away from the two to no avail. However, they were saved by Winloss and Nokk. They attempted to kill Aphra, but were stopped by BT-1. Aphra and 0-0-0 continued running away. Aphra searched and found for Klam and Gurtyl. They made their way to one of the Empire's bloatbarges. Unfortunately, Posla and his fellow lawmen found them. Aphra and 0-0-0 were then knocked out by Klam."}, {"tag": "p", "text": "Aphra and 0-0-0 were then tried by the Milvayne Authority cops and Posla and found guilty. As Poslan and his fellow officers prepared to execute Aphra, she was able to convince the cops to turn and arrest Posla for desertion. As the cops shot Posla, Aphra and 0-0-0, on her back were able to escape. They made a stop at a fuelstop where Aphra reattached 0-0-0's legs. 0-0-0 and Aphra then boarded a transport. They were then pursued by Winloss. Despite losing Winloss, Aphra and 0-0-0 were trapped by Nokk aboard their ship. Unfortunately, Winloss and Nokk's ship was damaged by the Empire. Aphra and 0-0-0 survived the crash."}, {"tag": "p", "text": "They were then confronted by Captain Okma of the Coalition for Progress and his stormtroopers. Okma offered to remove the bombs from her and 0-0-0 in exchange for getting Milvayne back under Imperial control. However, Aphra refused and killed Okma and his stormtroopers with 0-0-0's seismic pulse. She then discovered that Tolvan and Starros had joined the Rebellion and was declared a turncoat. Aphra then gave 0-0-0's his memories back. The two were then confronted by Winloss and Nokk, but they decided to give up their hunt for her. Aphra then comforted 0-0-0 when he remember his first moment of creation, to no avail. 0-0-0 decided to terminate himself by detonating his and Aphra's bombs."}, {"tag": "p", "text": "Aphra found BT-1, reactivated him and was able to convince 0-0-0 from terminating himself. They were then joined by Klam and Gurtyl who agreed to take them to Prexo. When they arrived at Prexo's officer, he was away on a work trip and confronted by stormtroopers and Milavayne cops. Luckily Aphra, 0-0-0, and BT-1 were able to take them out except for Posla. As Posla attempted to shoot Klam, Aphra saved her by taking the shot. Aphra and 0-0-0 discovered that their bombs had gone inert. 0-0-0 and BT-1 left her and Aphra was taken in by Klam."}, {"tag": "h3", "text": "Serving the Rebellion"}, {"tag": "p", "text": "For the next two months, Aphra took Klam as her ward, laid low and took her to the Slinani Migration Shrine known as the Red Mist. During this time, she sneaked off to several spacer bars without Klam. Aphra accepted a job to steal an item from the shrine. Aphra and Klam were to steal a cape from one of the Shrine's droids. However Aphra and Klam then found the real prize: the Farkiller of Oo'ob the Apostate. As Klam distracted the droids, Aphra made her way to the Ark Angel. There, she met up with Klam and went to a Abandoned Spice Mine on Unox. Aphra was then approached by Extraction Team Misericorde of Alliance Intelligence. Aphra met up with Sister Six and her commanding officer, Captain Tolvan."}, {"tag": "h4", "text": "Reunion with Tolvan"}, {"tag": "p", "text": "Aphra and Tolvan, realizing what Bor Ifriem did to her memory, stunned her and took her to Trading Post Sh'ung-tesk to meet with General Airen Cracken. There, Cracken told her how her theft forced the Slinani into negotiating an alliance with the Empire. Cracken and his droid Teezee-Too told Aphra about the history of the Farkiller. Aphra was allowed to watch as Tolvan did a field test on the Farkiller by eliminating a M.I. cell. Despite the success of the test, Aphra told Cracken that it could not work practically as a field piece. She objected to the idea of dismantling the Farkiller in order to reverse engineer it. Cracken told her about Rebel Intelligence's plan to assassinate the Emperor."}, {"tag": "p", "text": "Aphra discovered that the M.I. cell's targets was not Mon Mothma but Aphra herself. Cracken offered her and Klam a chance to join the Rebellion but they chose to leave. She and Klam went to Arbiflux to law low. She was contacted by Cracken, who warned her that several mercenaries under Black Krrsantan were coming after her and Klam. However, Krrsantan found her, demanded her go give him his money and gave her hug. Several stormtroopers were coming up after them. Krrsantan carried her while Klam rode Gurtyl away from the stormtroopers. They were able to make it to the Ark Angel II where Krrsantan revealed his employer as Pitina Mar-Mas Voor, Imperial Minister of Propaganda."}, {"tag": "p", "text": "Aphra, Krrsantan, and Klam were able to evade several TIE fighters. She, Klam and Gurtyl met up with General Cracken and Indigo Squadron. She was then taken to a lab by Teezee-Too. Once in the lab she was able to hijack Teezee-Too in order to access security systems. Aphra attempted to take the Farkiller, but was held at knife point by Tolvan. Despite this, Aphra told Tolvan to put on a breath mask. Krrsantan was able to break in and attacked Tolvan. When told Tolvan had Krrsantan at knife point, Aphra told her the Farkiller's purpose and it's role in a assassination attempt on the Emperor. Despite that, Tolvan chose to stay with the Alliance. However, she allowed Aphra to leave with it and asked her to make her injury look good. Aphra told Klam to leave Gurtyl behind and go to the Ark Angel II. She was then given a Imperial command identification by Tolvan and told Aphra that she still loved and hated her. After Krrsantan knocked Tolvan out, Aphra and the Wookiee made their way back to the Ark Angel II."}, {"tag": "h4", "text": "Working with Voor"}, {"tag": "p", "text": "Aphra then contacted the Empire at their Communication Relay at Usk Minor and informed them of the Alliance's assassination plot. She gave herself up and revealed the Farkiller to them. She, Krrsantan, and Klam went to the relay and surrendered to the stormtroopers. Vader saw her message and attempted to order the stormtrooper's officer to eliminate her. However, the message was jammed and a Imperial shuttle arrived with Minister Voor. Aphra, Krrsantan and Klam were hailed as heroes by her and taken to the Coalition for Progress headquarters on Centax 3. There, Aphra was given a tour of the headquarters by Voor. Aphra asked for a pardon, passage to the Outer Rim and money paid to Krrsantan. Aphra threatened to have Krrsantan destroy the Farkiller if their price was not met. She agreed to pay the Wookiee. After the Wookiee left, Voor told Aphra and Klam her plans to assassinate the Emperor."}, {"tag": "p", "text": "Voor revealed to them that she was using the rebels to find Aphra and retrieve the Farkiller to carry out the assination. Aphra realized that the Farkiller won't be bomb and that the Emperor would up end up as either comatose or a corpse. She also knew Voor would place the blame on the Rebels when they would reclaim Coruscant. Despite the plot, Aphra revealed that she was aware of this and warned the Emperor of the plot. She also knew that the Rebels, as well as the Empire and the entire galaxy would know of Voor's plot. Aphra revealed that Krrsantan had hijacked the cameras. Aphra and Vulaada stood by as Vader arrived and executed Voor for her treason."}, {"tag": "h4", "text": "Return to Vader's service"}, {"tag": "p", "text": "Aphra was then taken to the Executor, where she shared quarters with Vulaada on a bunk bed. Sleeping at the bottom of the bunk, Aphra dreamed of being jettisoned out of an airlock by Darth Vader and, having been deprived of gas supply, choking to death in the coldness of space. The airlock-fearing human rudely awoke, rising up and letting off a scream before regaining control of herself. Above, Vulaada greeted Aphra as she laid back down and recovered from her worst nightmare, and queried whether Aphra had the nightmare involving Vader's Force choke or the one involving the impalation of her eye by Vader's lightsaber."}, {"tag": "p", "text": "When Aphra replied the nature of her imagined death, Vulaada teased that that dream must have been worse than the one in which Vader bound Aphra to the front of a TIE fighter, although before the girl could finish her sentence, Aphra interrupted her in annoyance and confirmed the horridness of her own airlock dream. Vulaada thus expressed her thought that Aphra should sleep more, but acknowledging that both of them knew that she would not, the girl reminded Aphra that her shift would begin in twenty minutes."}, {"tag": "p", "text": "With a steaming cup of beverage in hand, Aphra gathered alonside other archaeologist consultants aboard the Executor in the Arkanis sector. There, General Maximilian Veers introduced himself as their new supervisor as part of Project Swarm—an effort to find the Rebellion's hidden base—and considering that his predecessor, Major Yaltza, was dispatched of by Lord Vader for the project's delays, he stressed that he wanted results. Dismissing Veers' use of \"gentlemen\" in addressing her group of archaeologists, Aphra questioned whether the general would receive better assignments if he changed his name to \"Maximillian Staysontarget.\""}, {"tag": "p", "text": "The archaeologist's witticism stunned those around her, although when one of Veers's subordinates reminded the general that she was the infamous Doctor Aphra, Veers responded that he liked wit—albeit only in the right context. The general then shocked Aphra with an electro-shock prod, knocking Aphra's beverage out of her hand. As Aphra recovered on her knees, Veers handed the floor over to Professor Rupo Ud."}, {"tag": "p", "text": "Aphra knew the Rebels would not use a ancient site again. Aphra then approached Vader but was pushed away by him. She then volunteered to for a mission to investigate Ash Moon 1 of the Kartovian Formation for signs of a Rebel base. There she and Vulaada explored the site. Aphra allowed Professor Ud to be killed by an ancient trap. She then found man who was knocked out by General Veers and his troops. She left Vulaada behind. Aphra and the team returned to the Executor where she was ordered to assist in the interrogation of the man who revealed himself as Aphra's father."}, {"tag": "p", "text": "Aphra was able to convince Vader he was nothing but a harmless scholar. She then met up with Vader's interrogation specialist, BT-1 and Triple-Zero to Aphra's surprise. Luckily, the droids had their memories wiped and restraining bolts installed. However, Vader allowed the droids to interrogate Korin. Aprha tried to convince her father to tell Empire what he knew about the Empire. Korin told her that he hated how they used pristine temples as bases and was eager to help the Empire. Aphra informed Vader and Veers that he was looking into the Asteroid Helix 13-v near Karga. Vader and the Aphra went to the asteroid. There she and her father examined the site for Rebel activity. Aphra and her father were then taken to a shuttle. Aboard shuttle, Aphra or her father would be executed. Korin chose to sacrifice himself. At the last moment, the shuttle was intercepted by Captain Tolvan and her team."}, {"tag": "p", "text": "The shuttle was taken aboard the Unnamed. Aphra tried to escape by hiding inside the shuttle's cannon system. She made her way through the ship to the ops room. Aphra attempted to search for the location of the Rebels' new base. However, she was surrounded Tolvan and her crew. Aphra was able to use Teezee-Too to slow down Tolvan's search for her and lock Tolvan's crew in the ops room. She then contacted BT-1 and told him to get her father out of the brig. Aphra was shot by Tolvan who attempted to convince her that Rebellion was not as devious as the Empire. Despite their difference of opinion, the two admitted they still loved each other, kissed each other and slept together. As Tolvan slept, Aphra discovered that the rebels were on Hoth. Aphra took a escape pod with BT-1, left her father and sent a message to Triple-Zero and Vader."}, {"tag": "p", "text": "Aphra also sent a message to Tolvan, her father and Vulaada. She then met up with Vader on the planet Tython's Meridional Ice Cap in the Martyrium of Frozen Tears. There, she was watched by Triple-Zero. Aphra was able to remove BT-1's and Triple-0's restraining bolts and made their escape. She was pursued by Vader and his stormtroopers. She and 0-0-0 were able to use tracers to cause Vader to see illusions of his past. Using Vader's vocoder, she was able to alter the Executor's probe droids' records. Aphra then took 0-0-0 and BT-1 to a Imperial ship where she would see everything in the galaxy."}, {"tag": "h3", "text": "Reunions on Burnin Konn"}, {"tag": "p", "text": "Shortly after the Empire found and invaded Hoth in 3 ABY, Aphra was reunited with Black Krrsantan to begin a new job. The doctor also learned of a rumor that the rogue bounty hunter Nakano Lash had resurfaced for the first time since killing her own client during a mission on the planet Corellia. Aphra and her Wookiee companion went and visited the Carbon Score Cantina on the planet Burnin Konn to have a drink. There, Bossk was sat at a table ranting that Boba Fett had beaten him to capturing Han Solo, who had had a bounty put on him by Jabba. Aphra jeered at the Trandoshan's loud speaking and suggested to her Wookiee companion that they find another bar."}, {"tag": "p", "text": "An enraged Bossk then attacked Black Krrsantan and the pair fought until the Trandoshan pinned his Wookiee opponent at knife point. Aphra silently stole Bossk's blaster and requested for him to get off of her companion, citing that she needed the Wookiee for a job, but the Trandoshan dismissed her, calling her out of her league. The doctor then pointed Bossk's own blaster at him and revealed she knew about Bossk's involvement in the botched Corellia mission with Nakano Lash, offering the Trandoshan information on Lash's reappearance. Aphra's intelligence led Bossk to the graveyard planet Galmerah."}, {"tag": "h3", "text": "Search for the Rings of Vaale"}, {"tag": "p", "text": "Aphra and Krrsantan teamed with the Kubaz mercenary Tubleek Ruz and the sharpshooter Just Lucky to carry out a job to steal goods from the rebel base on Hoth, which the Empire had successfully invaded. After taking out a stormtrooper detachment, Ruz attempted to take and collect the bounty on Aphra. Fortunately, Ruz was taken out by Just Lucky as Aphra and Krrsantan came under attack by a AT-AT. They were able to return to the Ark Angel III with the several containers of rebel contraband. Aphra, Krrsantan, and Lucky took a Fork-nosed ice worm fossil to the Shadow University. At a bar, Aphra and her current crew met a grad student, Detta Yao. Yao told Aphra and her crew about doctorate dissertation on the Rings of Vaale, their curse, and asked Aphra to accompany her on an expedition to find them."}, {"tag": "p", "text": "Ahra, her crew and Yao went to the Ruins of Kolkur to meet up with Aphra's old flame, Dr. Eustacia Okka and her droid TA-418. At first, Okka refused until Ronen Tagge's forces under Kiehart and Venters showed. Aphra, Okka, and her crew were able to fight them off and return to the Ark Angel. Okka agreed to join Aphra, Yao and her crew in searching for the rings. Despite the legends Okka heard about the rings' curse, Aphra decided to go to Dianth. En route, Aphra and the expedition received a message from Tagge via TA. She was warned that he would destroy them if they got in his way due to Aphra's stealing several items from Tagge's collection."}, {"tag": "p", "text": "Upon the Ark Angel's landing on Dianth, Aphra, and the expedition found the lost city of Vaale. As they entered the city, Aphra and Okka found a mural that led them to Workshop of The Architects of Vaale. There, they found a explorer  who told to leave while they could. Despite this warning, Aphra shot the explorer. She then examined the carved faces on the workshop's door and found a key slot. Yao found a pattern which caused everyone to hear screaming until Krrsantan and Lucky shot the pattern. Unfortunately, their blaster fire caused Krrsantan, Lucky, and Okka to fall through a hole. Aphra wanted to go after them but was held at gunpoint by Tagge's forces."}, {"tag": "p", "text": "With the loss of three members of her crew, Aphra and Yao decided to work for Tagge. However, Aphra was able to activate a trap that took out Kiehart and her forces. The trap was able to open the door to the workshop. Unfortunately, the rings were not there. Aphra realized that Yao wanted to take the rings. When Okka arrived with the Ring of Fortune, Yao attempted to take it, but lucky beat her to it. Aphra shot Yao when Lucky dropped the ring, but Lucky reclaimed the ring and joined with Kiehart's forces."}, {"tag": "h3", "text": "War for Han Solo"}, {"tag": "p", "text": "During the Imperial takeover of Cloud City on the planet Bespin, Han Solo was frozen in carbonite and given to Boba Fett for delivery to Jabba the Hutt. However, forces of the re-emerging crime syndicate Crimson Dawn stole the carbonite block containing the smuggler on the moon of Nar Shaddaa, as Lady Qi'ra intended to use Solo as bait to drawn in the various factions the smuggler had impacted. In possession of a Crimson Dawn tablet, Sana Starros received the message that the syndicate had captured the smuggler, with Aphra watching from over her shoulder. When Starros questioned if they could help him, Aphra, herself unconcerned with the smuggler's fate, noted it was okay if she tried to."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Having gone through a difficult childhood, Aphra was fairly detached from other people and was primarily concerned with her own needs and self-preservation. Aphra frequently made reckless decisions (usually motivated by greed), which often resulted in bad situations for her, such as when she attempted to auction off Rur to various criminal organizations. Aphra's first and foremost concerns and loyalties were to herself, and while she often double-crossed her allies, at times she felt compelled to assist others."}, {"tag": "h3", "text": "Relationships"}, {"tag": "p", "text": "When Aphra abandoned Luke Skywalker at the hands of the Queen of Ktath'atn, Rur saw inside Aphra's mind and saw she was wracked with guilt. Rur stated that this was an \"unusual occurrence\" for Aphra. Aphra struggled to make friends and meaningful connections, due to her un-trustworthiness and strong disloyalty to anyone but herself. At one point, Luke referred to her as his friend, and despite some conflicting feelings after Aphra's betrayal, he still considered her a good person—on the inside. Aphra confessed to Magna Tolvan that working for Triple-Zero made her lonely, and that she missed having someone to talk to. She did not describe herself as a sentimental person, which Sana Starros agreed with. In fact, when they learned Han Solo was captured by Crimson Dawn, Aphra remained unconcerned with the situation, only planning to help if Starros wanted to."}, {"tag": "p", "text": "At one point, Aphra had a relationship with Sana Starros, though it ended poorly due to Aphra's departure without even telling Starros goodbye. Sana was so angered by what had happened that she attempted to murder Aphra on more than one occasion. Aphra once remarked on the attractiveness of mercenary Sister Six. She continuously expressed an attraction to and romantic interest in Tolvan, an Imperial officer, with whom Aphra had run into on two different occasions; Aphra's feelings appeared to be requited; Aphra and Tolvan later kissed while on Skako Minor, when they believed they were going to die."}, {"tag": "h3", "text": "Career"}, {"tag": "p", "text": "As a criminal, Aphra appeared to be well-known throughout the galaxy. When she confronted Han Solo on Vrogas Vas, he recognized her as being a formidable opponent and noted her intellect. Even Darth Vader expressed appreciation for Aphra's talents. Aphra admitted to her father that she had considerable experience with breaking into places to steal artifacts. Aphra was a highly clever and capable individual; she demonstrated extremely adept survival skills when she was able to avoid her own death at the hands of Darth Vader after being thrown out of an airlock."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chelli Lona Aphra was created by writer Kieron Gillen for the Marvel Comics' Star Wars: Darth Vader comic book series, which spawned an spin-off comic book series entitled Star Wars: Doctor Aphra. According to Gillen, Aphra was conceived as the archaeological antithesis of Indiana Jones, the title character of Lucasfilm Ltd.'s Indiana Jones franchise. Indeed, Star Wars - The Official Magazine 91 stated as such, noting her only similarities to Jones' are an interest in archaeology and a habit to get into \"absurd situations\" while in search of artifacts."}, {"tag": "p", "text": "January LaVoy voiced Aphra in the audiobook adaptation of the short story \"The Trigger.\" In the 2020 audio drama Doctor Aphra: An Audiobook Original, Aphra was voiced by Emily Woo Zeller. At the New York Comic Con 2018, Hasbro revealed that an action figure of Doctor Aphra was slated for release in Spring 2019."}, {"tag": "p", "text": "When asked about Aphra's sexuality, Kieron Gillen has described Aphra as a lesbian. On March 18, 2021, StarWars.com announced that Star Wars comic books released by Marvel Comics in June will have Pride Month variant covers that feature gay and transgender artists paired with LGBTQ+ characters. As one of the prominent LGBTQ+ characters in the Star Wars canon, Aphra will be featured on the War of the Bounty Hunters 1 variant cover by Babs Tarr."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}