{"url": "Chelloa", "categories": ["Category:Legends articles", "Category:Chelloa locations", "Category:Destroyed planets", "Category:Grumani sector planets", "Category:Sith planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Chelloa"}, {"tag": "p", "text": "Chelloa was a terrestrial planet in the Grumani sector in Outer Rim Territories. It was first settled by the Galactic Republic as an agricultural world. During the Republic Dark Age, the planet was occupied by the Chagras Hegemony. Following the death of Sith Lord Chagras, the planet fell under the domain of his nephew Daiman, ruler of the Daimanate fiefdom. Daiman discovered large deposits of baradium beneath the planet's surface and implemented large scale mining and processing to supply his war effort. The mining operations depopulated much of the planet and attracted the attention of both the Jedi Order and Daiman's estranged brother Odion, fellow Sith Lord and ruler of the Odionate."}, {"tag": "p", "text": "Following the failed Operation Influx by Jedi agents, Daiman initiated a planetwide crackdown and prepared for war with Odion. He covertly imported ten kinetic corruptors disguised as mobile munitions complexes as bait to lure Odion. Chelloa's surface was subsequently destroyed and rendered uninhabitable following a climatic engagement which destroyed much of the Odionate invasion force. Meanwhile, Daiman managed to evacuate himself and most of his troops. However, most of the planet's remaining population were safely evacuated through the efforts of the Jedi Knights Kerra Holt and Gorlan Palladane."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Chelloa was a terrestrial agrarian planet capable of sustaining various species, including Humans, Rodians, Duros, and T'surr. Until the Republic Dark Age, it remained a rural backwater until the discovery of rich deposits of baradium beneath its surface. The planet had a significant population with several towns until its annexation by the Chagras Hegemony and its successor state the Daimanate, which encouraged large-scale baradium mining operations that destroyed much of the natural environment. By 1032 BBY, only seven mining towns including Jenith, Arboth and Picomith remained, with a total population of 60,000 sentients. Jenith was located near a large mountain range which was the site of Daiman's private alpine compound and included a spaceport."}, {"tag": "p", "text": "In 1032 BBY, Chelloa was located in the heart of the Grumani sector but was situated near a hyperspace lane connected to Republic space. Due to its proximity to Republic space and its baradium operations, the planet became a target of the Jedi Operation Influx."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early years of the Galactic Republic, Chelloa was settled by Republic colonists as an agricultural world. During the New Sith Wars, the planet was invaded and occupied by the Chagras Hegemony, one of the splinter states formed from the New Sith Empire. Following the death of the Sith Lord Chagras, the planet fell under the domain of his nephew Daiman, ruler of the Daimanate princedom. After he discovered the surface was filled with baradium, Daiman strip-mined the entire planet, decimating the local inhabitants' homes and meager resources. Many of the residents were also moved offworld to work and fight near the frontiers."}, {"tag": "p", "text": "Gorlan Palladane, a local miner and former Jedi Knight, established contact with the Jedi Order, becoming an informant and helping the Order prepare a military strike on Daiman's holdings on Chelloa. He was also the leader of the Chelloan resistance which sought to aid the Republic and Jedi against the Sith by providing intelligence. He used a transmitter built by the Rodian mechanic Skodo to communicate with the Order. However, the interstellar relays were intercepted by the rival Sith Lord Odion, ruler of the Odionate. A Jedi team under Jedi Master Vannar Treece launched a strike known as Operation Influx which destroyed several of Daiman's cargo liners and raided the spaceport."}, {"tag": "p", "text": "However, they were interrupted by the arrival of Odion, who unleashed a kinetic corruptor that destroyed a large area of Squatter's Hill and killed several slaves and soldiers alike. The entire Jedi strike team with the exception of Kerra Holt was killed. However, she was rescued by Palladane who managed to evacuate several lucky survivors onto a cargo liner. Arriving at the town of Jenith, they encountered Daiman who expressed little concern for his people but was preoccupied with counteracting Odion's moves."}, {"tag": "p", "text": "As part of his greater plan of defeating Odion, Daiman imported ten more kinetic corruptors disguised as mobile munitions complexes and a fleet of transports, to deceived his enemies into thinking he was going to expand baradium mining operations. He intended to lure Odion to land an invasion force on Chelloa where they would be trapped and obliterated by the kinetic corruptors, along with all life on the planet. Trying to determine the source of the intelligence leakage, he apprehended and tortured to death Skodo. His troops also replaced the transmitter with one of Daiman's, to keep track of any accomplices."}, {"tag": "p", "text": "When Kerra Holt attempted to assassinate Daiman, he tricked her into believing that Odion posed a greater threat with his mobile factory The Spike, which produced more kinetic corruptors. Holt then took on Odion during a space duel, leaking information on Daiman's expanded baradium operations. Meanwhile, Daiman's troops apprehended Palladane after he tried to communicate with Odion, trying to say Chelloa by telling him that there were no more baradium mines."}, {"tag": "p", "text": "Palladane was tortured by Daiman who retaliated to this intelligence leakage by ordering a planetwide crackdown including the destruction of Jenith. However, Palladane was rescued by Holt, who also saved his family and several Chelloa citizens including village leaders. They then fled to the town of Arboth where they had a safehouse. While scouting Arboth's spaceport, Holt discovered that the transports carrying the workers were empty. Determined to escaped Daimanate oppression, Holt and Palladane made preparations to evacuate Chelloa's population of 60,000. Chelloan resistance operatives led by the two Jedi Knights hijacked several empty transports in Arboth spaceport, creating the makeshift Freedom Fleet. While fighting Daimanite forces, Palladane was killed; however, Holt succeeded in evacuating most of Chelloa's rump population."}, {"tag": "p", "text": "Meanwhile, Odion's Lightning Guard landed at the site of the mobile munitions complex and overcame the token Daimanite resistance only to discover that they had stumbled into a trap. The ten Kinetic corruptors wiped out much of the Odionate invasion force, incinerating Chelloa's surface and rendering it uninhabitable. Meanwhile, Daiman's forces escaped offworld as well. Odion himself survived the battle, but was grievously wounded during the blast."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}