{"url": "Chem_(Human)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Kyp's Dozen personnel", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Chem  (Human)"}, {"tag": "p", "text": "Chem was a Human male who was in his youth during the Yuuzhan Vong War, a conflict spurred by the invasion of the extra-galactic Yuuzhan Vong in 25 ABY. His mother was a diplomat who collected pristine starfighters. On his fourteenth birthday, Chem left home to join Kyp's Dozen, an elite starfighter squadron headed by Jedi Master Kyp Durron. He stole his mother's most prized possession, a prototype of the T-65XJ X-wing starfighter, to fulfill his goal. Locating Kyp's Dozen, Chem spent several months following the squadron around before being accepted into the unit. He fought during the fall of the galactic capital, Coruscant, and was killed during the engagement when his fighter was hit by enemy plasma fire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born prior to 13 ABY, Chem was the son of a wealthy diplomat, a woman who was a collector of pristine-condition, never-flown starfighters. On Chem's fourteenth birthday, he stole his mother's most prized possession—an early prototype model T-65XJ X-wing starfighter—from the warehouse she kept her collection in. He set out to find Kyp's Dozen, a starfighter squadron led by Jedi Master Kyp Durron."}, {"tag": "p", "text": "After tracking them down, Chem did not ask for admission into the squadron. Instead, he followed the unit around from mission to mission as they fought in the Yuuzhan Vong War, a galaxy-spanning conflict fought between the allied governments of the galaxy and the extragalactic Yuuzhan Vong invaders. Eventually, after several months, Master Durron accepted him into the squadron after the loss and replacement of countless pilots, giving him the position of Dozen Five. Chem soon used his inheritance to purchase new XJ X-wing starfighters, fuel, and ordnance for the Dozen, as well as destroying seven coralskippers in combat."}, {"tag": "p", "text": "In 27 ABY, the Yuuzhan Vong assaulted the galactic capital of Coruscant. The battle lasted for several days, and toward the end of the engagement, the Dozen were assigned to provide escort cover for a small Jedi fleet that was escaping from the planet. The main ship of the fleet was carrying the scientist Danni Quee and her invention that could jam the Yuuzhan Vong's yammosk war coordinators—telepathic organisms that acted as command and control systems for the Yuuzhan Vong's ships and fighters, allowing them to operate in near-perfect unison."}, {"tag": "p", "text": "As the Dozen dropped out of hyperspace, Chem was distracted by the sight of Coruscant's lights going out. The ecumenopolis—noted for being a world that never truly slept—was gradually losing power as the Yuuzhan Vong invasion took hold. Master Durron, in a conversation with the youth on a private channel, told him that it was their job to hold back the night. Reassured, Chem followed Durron into battle against enemy coralskippers. However, he kept his ship behind the Jedi Master's, instead of breaking into the four-ship formations that Durron had ordered. As Durron engaged the enemy, he used his thrusters to perform a vertical rise to avoid incoming fire, which subsequently impacted Chem's fighter. The plasma bursts destroyed Chem's fighter, killing him. Durron felt a sense of guilt and grief over the young man's death, and sensed through the Force Chem's own fear and disbelief as he died."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A young man, Chem's voice had yet to reach a baritone level by the time of his death. He was a competent pilot, able to hold his own with the other pilots of the Dozen, and proved his combat skills by destroying seven enemy craft during his tenure with the unit. Although he presented a laid-back attitude, and was able to banter with the older and more experienced members of the squadron, he was easily unnerved. The sight of Coruscant experiencing its first true night in millennia was enough to distract the youth during the Yuuzhan Vong's invasion of the world."}, {"tag": "p", "text": "A determined individual, Chem followed his own ideals, which led him to absconding from home with one of his mother's prized possessions. He did not look forward to seeing her again, worried about what she would do to him over the stolen ship. His dogged determination eventually earned him a spot in the Dozen. A generous young man, he thought nothing of using his family wealth to buy the squadron needed supplies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chem's only appearance was in The New Jedi Order: Dark Journey by Elaine Cunningham. Published in 2002, it was part of The New Jedi Order series. In 2008, he received an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}