{"url": "Chenachochan", "categories": ["Category:Legends articles", "Category:Cities on Kashyyyk", "Category:Galactic Empire cities", "Category:New Republic cities"], "nodes": [{"tag": "h1", "text": "Chenachochan"}, {"tag": "p", "text": "Chenachochan was a riverside city on Kashyyyk."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Chenachochan was a city on the Wookiee homeworld of Kashyyyk. In the time after the Battle of Endor, the city was near three Imperial Remnant jammers, and Chenachochan itself had been taken over by the Imperial Remnant and Trandoshan slavers. The city itself featured a command center, prefab shelters, and military buildings such as a troop center."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19 BBY, shortly after the birth of the Galactic Empire, Chenachochan was attacked during the Imperial occupation of Kashyyyk."}, {"tag": "p", "text": "In 4 ABY, after escaping the city of Okikuti and the Wookiee Weebacca's trap, New Republic members Han Solo and Chewbacca, the latter of whom was a Wookiee himself, reached Chenachochan and met with Shoran. From there, they recruited a Wookiee army to destroy the three Imperial jammers in order to communicate with the New Republic about the situation on Kashyyyk. The city was subsequently infiltrated by the Wookiee army and freed, and became a staging area for the assault on Moff Darcc's palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chenachochan was first mentioned in the strategy guide for the 2001 video game Star Wars: Galactic Battlegrounds. It appeared and was first identified during two Chewbacca campaign missions. The missions and thus the city was also included in the game's 2002 expansion pack, Clone Campaigns. In the second mission, Trandoshan and Imperial buildings are spread throughout the map and hold captured Wookiee units. The player has the option of freeing each of those units. In both missions the size of the army is the player's choice."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}