{"url": "Chewbacca%27s_camp", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alaris Prime locations", "Category:Colonies", "Category:Military bases"], "nodes": [{"tag": "h1", "text": "Chewbacca's camp"}, {"tag": "p", "text": "Chewbacca's camp was built on the moon Alaris Prime between 39 and 36 BBY by Wookiee colonists. It was run from a central command center and initially contained buildings used for collecting resources, along with two power cores and a troop center. The camp was run by Chewbacca, the leader of the Wookiees on Alaris Prime, and was a short distance from a camp run by his ally Shoran. It was expanded to include a spaceport for trading resources with Shoran's camp and a Jedi temple to store a holocron that was discovered. After dealing with an attack from the Trade Federation on the camp, Chewbacca and his fellow Wookiees destroyed a nearby Trade Federation listening array."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Chewbacca's camp was built on Alaris Prime, a moon of the planet Alaris in the Kashyyyk system. The camp occupied a clearing within one of Alaris Prime's lush forests, and its initial layout comprised of ten buildings. In the center of the camp were the command center, a food processing center surrounded by three farms, and a power core. Another power core lay to the south, and three prefab shelters and an animal nursery were placed near the forest to the west. At the northern entrance of the camp was a troop center and a carbon processing center. Two key buildings were later added to the camp, a Jedi temple and a spaceport, both within the range of the camp's power cores so they could run efficiently. More prefab shelters were also added to the base to support its growing population of at least thirty-seven Wookiees."}, {"tag": "p", "text": "Various natural resources were available in the camp, including sources of food in the form of muja fruit bushes and fish from the accessible water sources. Deposits of nova crystals and ore were present on the northeast side, and carbon could be gathered from the many trees. Surrounding the camp were a lake to the south and a line of cliffs next to a river in the east. The area north of the camp led to a larger clearing, where another camp run by Chewbacca's fellow colonist Shoran was located."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The camp was established during the war for control of Alaris Prime fought between the Wookiee colonists and the Trade Federation between 39 BBY and 36 BBY. After a successful attack on a Trade Federation outpost, Chewbacca, the leader of the colonists, resided at the camp along with two bowcaster troopers, a dragon trooper, seven Wookiee workers, and two nerfs. Jedi Master Qui-Gon Jinn, an advisor to the Wookiees, told Chewbacca to set his workers to gathering the available resources from the camp while he lectured on the benefit of having allies, believing that to be a key advantage that the Wookiees had over the Trade Federation. Chewbacca had his workers build a spaceport, which allowed the Wookiees to access HoloNet technology so that they could find Shoran's camp. The Wookiees then built Corellian HoverFreighters at the spaceport to exchange goods with the spaceport in Shoran's camp, particularly nova crystals."}, {"tag": "p", "text": "Shoran found a Jedi holocron within his camp. In response, Jinn asked the Jedi Council, the ruling body of the Jedi Order, for permission to build a temple on Alaris Prime to store it, which was granted. Chewbacca's workers built the temple in the camp, after which Jinn's Padawan, Obi-Wan Kenobi, arrived on Alaris Prime. Kenobi walked to Shoran's camp to retrieve the holocron, but once he reached it Shoran spotted a group of Trade Federation battle droids, three beetle droids, and six Battle Droid Beta Versions heading for Chewbacca's camp. Shoran warned Jinn and Chewbacca, causing Jinn to suggest that Chewbacca sound the alarm to send his workers to the command center and prepare his fighting Wookiees at the edge of the camp. A group of between five and six Wookiees destroyed all the attacking droids, after which Kenobi returned with the holocron and placed it within the temple."}, {"tag": "p", "text": "One of Shoran's scouts discovered a listening array belonging to the Trade Federation, which Chewbacca suggested the Wookiees destroy. At the camp, he rallied a force of between eight and thirty fighting Wookiees and marched through Shoran's camp to reach the listening array, which was destroyed along with all the battle droids there."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chewbacca's camp was first mentioned in the Prima Games' strategy guide—released on November 7, 2001—for the LucasArts video game Star Wars: Galactic Battlegrounds, released on November 11, 2001. It appeared in the sixth level of the Wookiee tutorial campaign titled \"Allies and Jedi.\" The player can place the Jedi temple and spaceport in any location of their choosing, and can also build other structures aside from those already included in the level, such as shipyards, mech factories, and sentry posts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}