{"url": "Chewbacca/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Articles with elements from unlicensed sources", "Category:Articles with non-canon elements", "Category:Bright Tree tribe honorary members", "Category:Desilijic servants", "Category:Endor strike team personnel", "Category:Imperial slaves", "Category:Impersonators", "Category:Kashyyyk residents", "Category:Leia Organa Solo's bodyguards", "Category:Males", "Category:Mechanics", "Category:Members of the First Wookiee Expeditionary Force", "Category:Nar Shaddaa residents", "Category:New Republic individuals", "Category:Pilots", "Category:Renegade Squadron personnel", "Category:Resistance fighters", "Category:Smugglers", "Category:Star-Hoppers of Aduba-3", "Category:Tansarii Point Station residents", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Chewbacca"}, {"tag": "p", "text": "Chewbacca  (or \"Chewie,\" as he was known to his friends) was a legendary Wookiee from Kashyyyk, best known for being the co-pilot of Han Solo's ship, the Millennium Falcon. He was the son of Attichitcuk, the husband of Mallatobuck, and the father of Lumpawaroo. Chewbacca carried with him the name of an ancient Wookiee hero, the great Bacca, first of the great chieftains of Kashyyyk, and the creator of a sword that denoted leadership among the Wookiees. This name placed Chewbacca in a noble lineage, which was further supported by his role in the Battle of Kashyyyk during the Clone Wars and during the Galactic Civil War."}, {"tag": "p", "text": "Born in 200 BBY, Chewbacca became a navigator of the Claatuvac Guild and fought alongside Jedi Grand Master Yoda at the Battle of Kashyyyk during the Clone Wars, but was condemned to slavery by the Galactic Empire. Rescued by Han Solo, Chewbacca swore a life-debt to Solo and accompanied him throughout his smuggling career. In 0 BBY, Solo and Chewbacca fell in with the Rebel Alliance and flew at the Battle of Yavin. After the battle, Chewbacca was considered a hero of the Alliance, and he played a role in key victories against the Galactic Empire. After the declaration of the New Republic, Chewbacca became the protector of Han and Leia Organa Solo's children, Jaina, Jacen and Anakin. Chewbacca died in 25 ABY, the first year of the Yuuzhan Vong War, giving his life during the Destruction of Sernpidal to save Anakin Solo."}, {"tag": "p", "text": "Chewbacca was a wise, sophisticated being of great strength and loyalty. As technologically savvy as the brightest Academy graduate, he was also a skilled mechanic. Chewbacca, like many Wookiees, was able to understand Basic, but he could not speak it due to his species's vocal structure. He instead spoke Shyriiwook, the main Wookiee language, composed largely of growls and grunts, to his non-Wookiee companions who typically replied in Basic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (200 BBY to 19 BBY)"}, {"tag": "h4", "text": "Childhood"}, {"tag": "p", "text": "Chewbacca was born on Kashyyyk in 200 BBY, the son of Attichitcuk. During his early years Chewbacca lived on Kashyyyk, but unlike many other Wookiees who rarely left the planet's lush forests, Chewbacca was consumed by an overpowering sense of adventure and exploration. Chewbacca's first travels were to the remote and dangerous lower levels of Kashyyyk's immense forests, the Shadowlands. The Wookiee spent his first fifty years learning to participate in Wookiee society and gaining wisdom from his father. It was not long before his travels took him far from the confines of his green homeworld. In 150 BBY, at the age of fifty, Chewbacca left Kashyyyk to explore the galaxy in a rite of passage known as \"The Rising Path\". Chewbacca experienced a variety of adventures across different planets, eventually adopting a bandolier and a bowcaster as a deterrent to the many beings who often sought to test his strength. His heart, however, remained on Kashyyyk, and Chewbacca always tried to make it home for the holidays.[source?]"}, {"tag": "p", "text": "In his younger days, before he had reached 100 years of age, Chewbacca was well known for his skill at navigating the tall wroshyr trees and his skill with a hydrospanner. Chewbacca spent some time repairing vehicles with his friends, including the Wookiee Dryanta. When Chewbacca first met his future wife Mallatobuck, he was unaware of the young Wookiee's feelings toward him. Malla was shy and hid all hints of her true feelings, even going so far as to not show appreciation when Chewbacca once saved her from Trandoshan slavers. However, Chewbacca's cousin Jowdrrl was friends with Malla and helped to slowly create a relationship between the two. Their blossoming relationship hit a snag when the Wookiee Tojjevvuk began to fight for Malla's affection. Chewbacca was eventually forced into an honor duel with Tojjevvuk for Malla's hand, but Tojjevvuk brought dishonor on the duel by using his claws, forbidden for a Wookiee. However, Chewbacca's expertise in navigating the wroshyr trees proved to be Tojjevvuk's downfall, and a timed tackle by Chewbacca sent Tojjevvuk into a plummet into the Shadowlands, where he was killed by the dangerous creatures of Kashyyyk."}, {"tag": "p", "text": "At some point in his early adulthood, Chewbacca became a member of the Claatuvac Guild, a secretive organization of Wookiee navigators and scouts. Based out of Tree Vikkilynn in the Kashyyyk city of Kachirho, the Claatuvac Guild was responsible for charting new hyperspace routes. By 19 BBY, Chewbacca had become one of the Guild's most trusted navigators."}, {"tag": "p", "text": "Chewbacca lived with his family in Rwookrrorro, and with his father was responsible for the creation of many villages on Kashyyyk in the decades before the Battle of Naboo."}, {"tag": "h4", "text": "Alaris Prime"}, {"tag": "h5", "text": "Helping his father"}, {"tag": "p", "text": "Between 39 BBY and 36 BBY Attichitcuk led a group of Wookiees to colonize Alaris Prime, a rediscovered moon of the gas giant Alaris, another planet in the Kashyyyk system. Chewbacca joined his father and cousin Shoran along with many other Wookiees in a journey on the Thalmussen and three other transport ships through the Alaris Expanse to reach Alaris Prime. Attichitcuk disembarked on the moon first and explored part of it, establishing a camp and leaving markers on the path to it. Shoran left next, leaving behind his own markers.."}, {"tag": "p", "text": "Chewbacca left the tranports next and was guided in his exploration by Jedi Master Qui-Gon Jinn, who had been appointed by the Jedi High Council to aid the colonists. Chewbacca followed Shoran and Attichitcuk's markers until he met Shoran at the site of a damaged power core. The core had been built by the company known as the Trade Federation, who were making an illegal effort to colonize Alaris Prime and had arrived prior to the Wookiees. The core had been damaged by gundarks, a hostile predator species, and then abandoned. Jinn advised destroying the core, which Chewbacca and Shoran did by shooting at it with their bowcasters. The two Wookiees made their way to Attichitcuk's camp, which they quickly had to defend from four gundarks with Attichitcuk's help."}, {"tag": "p", "text": "After surviving the first hostility on Alaris Prime the colonization of of the moon began in earnest. Chewbacca arrived at a Wookiee command center where Jinn was instructing a group of five Wookiee workers on techniques for gathering resources. His arrival proved to be timely as four gundarks began to attack the command center, the Wookiee workers retreated into the building and used its turret to fire on the gundarks, while Chewbacca helped defend the center with his bowcaster. The gundark attacks prompted Jinn to propose a permanent solution, to find and destroy the gundark nest."}, {"tag": "p", "text": "At one of the Wookiee bases Chewbacca and Jinn trained Wookiees as bowcaster troopers while also gathering resources. Chewbacca helped find nerfs to store in an animal nursery for continual food production. Once at least ten troopers were sufficiently trained Chewbacca marched along with them to the site of the gundark nest, killing two gundarks on the way there. At the nest the Wookiees discovered Trade Federation B1-Series battle droids already exterminating the gundarks. With the creatures all dead the droids turned their blasters on the Wookiees, seeing them as enemies just like the gundarks, but Chewbacca and the Wookiees fought back and destroyed all the droids."}, {"tag": "h5", "text": "Leadership"}, {"tag": "p", "text": "Now aware of a far more dangerous enemy on Alaris Prime than the gundarks, the Wookiee colonists began preparing for war. Attichitcuk led a small scouting expedition to uncover the extent of the Federation's presence and was gunned down by a group of battle droids commanded by DRN-38 on his return trip to the base where Chewbacca waited. Jinn sensed the ambush through the force but assured Chewbacca that his father had survived. The Jedi instructed the Wookiees to build a medical droid and train at least ten bowcaster troopers to attempt a rescue of the chieftain."}, {"tag": "p", "text": "Moving out from the base the Wookiees destroyed three B1 battle droids near a river as well as another four on the other side. Further along the forest path they found Attichitcuk near death. Chewbacca stood over his father while the medical droid resuscitated him enough to make the trip to the base safely. On the march back the Wookiees defeated six battle droids that awaited them with the help of a small group of Wookiee reinforcements who had followed the party's trail. At the base Attichitcuk took safety in its command center while Chewbacca and the others dealt with a surprise attack by three droidekas. With his father needing time to fully heal Chewbacca became the leader of the colonists, in that capacity he and Jinn began their concrete efforts to remove the Trade Federation from Alaris Prime permanently."}, {"tag": "p", "text": "Chewbacca decided to target Trade Federation bases to make the corporation rethink their commitment to the moon, first choosing an outpost where B1 battle droids were produced. Chewbacca commanded a base near the rough location of the outpost and oversaw resource gathering and the training of more soldiers. The Wookiees used HummBike speeders to explore the area surrounding the base and found no trace of the outpost, leading Jinn to assume it was located on the other side of the nearby river. After the bike-riding scouts crossed the water and located the base Chewbacca and fifteen other Wookiees boarded transport repulsorcrafts and followed where the scouts had gone. They then made their way to the outpost and destroyed it along with its five battle droid guards."}, {"tag": "p", "text": "Chewbacca established one camp near another settlement run by Shoran, where they began trading resources using Corellian HoverFreighters while Jinn lectured on the benefits of having allies. Shoran found a Jedi Jedi holocron within his camp, and to prevent it from falling into enemy hands Jinn had Chewbacca's workers build a Jedi temple in his camp, allowing Jinn's Padawan Obi-Wan Kenobi to arrive. While Kenobi left to retrieve the holocron Shoran spotted a strike force of beetle droids and Battle Droid Beta Versions commanded by LUH-989 headed towards Chewbacca's camp. Jinn warned Chewbacca to garrison his workers for their safety and prepare his warriors, which included bowcaster and dragon troopers, to stand guard at the edge of the camp."}, {"tag": "h5", "text": "Final attacks"}, {"tag": "p", "text": "Chewbacca's Wookiees were able to repel the invaders, and at Shoran's request Chewbacca donated 100 nova crystals to him to aid in recovery from the attack. Kenobi later returned with the holocron and stored it in the Jedi temple, after which Shoran's scouts uncovered a Trade Federation listening array, also run by LUH-989. Chewbacca rallied a force of between 8 and 30 Wookiees and marched through Shoran's camp to reach the listening array, destroying all the droids and transmitters there. Following the attack Chewbacca began planning the final assault on the Trade Federation, aiming to destroy a fortress in their last base."}, {"tag": "p", "text": "Chewbacca and Shoran gathered at another base, where Shoran had partially completed the initial defensive walls. Chewbacca had his workers begin filling in the gaps and fortifying the base. Attichitcuk had made a full recovery from his injuries and was healthy enough to take up arms. Jinn also requested permission from the Jedi Council to personally aid the Wookiees, which was granted on the condition that they build their own fortress. The Wookiees had to gather enough resources to upgrade their technology level again, after which they could complete the fortress. Once Jinn arrived Chewbacca and the Wookiee forces, which included Shoran, Attichitcuk, ten Agr starfighters three Heavy Blade bombers, three energy pummels, five Kas tanks, and five heavy bowcaster troopers headed for the Trade Federation base."}, {"tag": "p", "text": "The bombers and fighters cleared out the base's buildings and turrets, allowing Chewbacca and the infantry and mechs to safely march in. The Trade Federation fortress was equipped with anti-air weaponry, so the Wookiees used the energy pummels to raze it. With the fortress destroyed the Trade Federation was removed from Alaris Prime. Jinn praised Chewbacca's leadership abilities, acknowledging that he was ready to take his place in the galaxy."}, {"tag": "h4", "text": "Clone Wars"}, {"tag": "p", "text": "For all of Chewbacca's success, rivalries between different Wookiee families continued to plague Kashyyyk. Tvrrdko, the father of Tojjevvuk continued to seek revenge for the death of his son, but waited for the ideal moment. Tvrrdko's wrath had caused Chewbacca to stay away from his homeworld, but the Confederate threat to Kashyyyk forced him to return. The clones and their Jedi Generals recruited many of the Wookiees, and Chewbacca became a leading member of the Wookiee resistance to the Confederacy of Independent Systems."}, {"tag": "p", "text": "During the first year of the Clone Wars, Chewbacca was considered to be one of the Wookiee King Grakchawwaa's greatest warriors. He led the Jedi to the traitor Quaagan, who was conspiring with Confederate commander Asajj Ventress."}, {"tag": "p", "text": "Chewbacca was captured by Trandoshan trophy hunters sometime during the second year of the Clone Wars, only days after Ahsoka Tano was captured by the same Trandoshans. The purpose of this capture was to serve as prey in a trophy hunt. Chewbacca was taken to the Trandoshan moon of Wasskah, where he was to be hunted by the Trandoshans. After Ahsoka and her fellow Jedi younglings destroyed the prisoner transport vessel, he escaped and joined them. Using his technical expertise and parts from the crashed transport, he constructed a transmitter to contact his fellow Wookiees, which eventually allowed all those trapped on the Trandoshan hunting island to escape after they defeated the hunters in their fortress."}, {"tag": "p", "text": "Chewbacca was a major player in the Battle of Kashyyyk, overseeing the confrontation between the Grand Army of the Republic's 41st Elite Corps and the invading droid forces at Kachirho alongside Tarfful and Jedi General Yoda. It was Chewbacca, along with Tarfful, who accompanied Jedi General Quinlan Vos in the charge against the enemy. Chewbacca had greater incentive than most Wookiees to assist in the defense of Kachirho: an objective of the Separatist invasion was to seize the information on secret hyperspace routes rumored to be held in the Claatuvac Guild's vaults."}, {"tag": "p", "text": "Following the implementation of Order 66, Chewbacca helped Yoda elude the clone troopers and escape from the planet. The execution of their Jedi officers by the clones made the nature of the newly declared Galactic Empire clear to the Wookiees, and Claatuvac Guildmaster Gumbaeki refused to surrender the Guild's records to it. Chewbacca was one of perhaps a dozen Wookiees, the Guild's most trusted scouts and navigators, who was entrusted with a HoloGrid that stored the Guild's information on hyperspace routes. Guildmaster Gumbaeki then destroyed the information in the Claatuvac vault and assisted in the defense of the city while Chewbacca and his compatriots stole away. Chewbacca hid his HoloGrid in a location known only to him, and it would not come to light again until many years afterwards."}, {"tag": "h4", "text": "Post Clone Wars"}, {"tag": "p", "text": "With the battle concluded, Chewbacca was attacked by Hronk, a relative of Tojjevvuk seeking vengeance. The arrival of stormtroopers broke the fight up, leaving the conflict to be resolved later."}, {"tag": "p", "text": "Two months after the Battle of Kashyyyk, Chewbacca was called upon by a former trader and Wookiee representative, Cudgel, to aid a small band of renegade Jedi led by Olee Starstone in their search for any other survivors after Order 66. The rescue operation proved unsuccessful, however, as the Empire tracked the fleeing Jedi to Kashyyyk and began their assault to capture them. The Wookiees, still haunted by the aftermath from their battle with the Confederacy of Independent Systems only a month before, resumed fighting to defend their homes from the Imperial onslaught. The tide turned to the Empire with the unexpected arrival of Anakin Skywalker, now known as Darth Vader, who wasted no time in slaughtering whatever stood between himself and the missing Jedi."}, {"tag": "p", "text": "Vader ordered one of the orbiting Star Destroyers to bombard Kashyyyk with repetitive turbolaser fire, laying waste to the surrounding cities while he searched for the remaining fugitives. In an attempt to help his comrades escape, Roan Shryne, one of the remaining Jedi who had earlier encountered Vader during the execution of Order 66, faced off with Vader alone while the others attempted to flee. Chewbacca assisted in the escape of Olee, a small group of smugglers, and several of those wounded in battle. After the fall and enslavement of Kashyyyk to the Galactic Empire, Chewbacca resolved to become a crew member aboard the Drunk Dancer along with Olee, and aided his new-found friends in sabotaging the Empire's efforts at any given opportunity, claiming he would be \"more helpful to Kashyyyk as a fugitive, not a captive.\""}, {"tag": "p", "text": "Now wanted, Chewbacca wandered the galaxy, managing to evade the slave traders. One day, Chewbacca came across a wounded Sephi named Mala Mala and carried her to the sick bay of a ship, where she received life-saving medical attention from a medical droid. After seeing that she was all right, the two parted ways, only to see each other years later. During his travels, Chewbacca gained many friends and even owned a ship of his own."}, {"tag": "h3", "text": "Life under the Empire (19 BBY to 4 ABY)"}, {"tag": "h4", "text": "Meeting Han Solo"}, {"tag": "p", "text": "However, even the mighty Chewbacca was not immune to failures, and he soon became another captive of Trandoshan slavers. Tvrrdko, still bitter over his son's death, betrayed Chewbacca and sold him to the Trandoshan slaver Ssoh. Ssoh had devised a method of transporting Wookiees safely without fear of them escaping. The Trandoshan made sure to mix different Wookiee clans in the holding cells so that their vendettas would keep each other from escaping. When Chewbacca was thrown in Ssoh's holding cell, several Wookiee families including the Puurrgerr, Grrobahrr, and Chevappa clans immediately began to question his allegiances. Chewbacca had become disgusted with the Wookiee rivalries and how they had kept the Wookiees trapped in slavery. In an impassioned speech, Chewbacca convinced the other Wookiees that it was better to die a free Wookiee than be concerned about honor as a slave. With help from the now allied Wookiees, Chewbacca fashioned a fusioncutter, cut open their prison, and took over the ship. Ssoh became the only Trandoshan to live after a hand-to-hand battle with Chewbacca after the enraged Wookiee ripped his arms and his legs out of their sockets."}, {"tag": "p", "text": "Following this turn of events, Chewbacca often attempted freeing Wookiees slaves who had been captured by either the Empire or Trandoshan slavers. On one such endeavor, he became involved in a botched slave transfer between a Trandoshan crew and an Imperial commander, Pter Nyklas. Chewbacca orchestrated the escape of close to all of the slaves which consisted mostly of Wookiee children, but in the process had his ship come under fire by Imperial TIE Fighters led by Lieutenant Han Solo. Nyklas was infuriated at the loss of the Wookiee slaves and ordered Solo to kill the Wookiee (who had been rendered unconscious by the firefight). Solo refused, inciting Nyklas's fury, but the commander eventually calmed enough to realize Chewbacca's value as a slave. The Wookiee children happened to be members of Tvrrdko's clan, and the Wookiee leader ended up canceling the feud between their two families. Nyklas worked Chewbacca unmercifully, taking great pleasure in whipping the demoralized Wookiee. However, Nyklas did not count on any more interventions by Solo, and the young lieutenant saved Chewbacca from being whipped to death. The two escaped from Imperial influence with a small bounty on their heads, and Solo was drummed out of Imperial service."}, {"tag": "p", "text": "Due to Chewbacca's heroic efforts to save the children, several of whom were of Tvrrdko's clan, Tvrrdko called off the vendetta, something unheard of in Wookiee history."}, {"tag": "h4", "text": "Smuggler"}, {"tag": "p", "text": "Though Solo initially resented Chewbacca for his dismissal from the Imperial Military, he eventually became the Corellian's close companion as a smuggler. \"Chewie,\" as Solo affectionately called him, stood by Solo until his death, partly out of friendship, and partly as a result of his life debt to him. Chewbacca even entrusted his Claatuvac HoloGrid to Solo, and the two of them used the information on routes contained within to make smuggling runs in record time."}, {"tag": "p", "text": "Around 3 BBY, Chewbacca accompanied Han Solo to the Mondder Spaceport on Etti IV in the Corporate Sector. He and Solo ran into Jahan Cross while fleeing a gang of angry gamblers. As the brawl broke out, Chewbacca grabbed a Quarren by the ankles, swung him around and tossed him over a wall. The Espos arrived and rounded everyone up but Chewbacca and Solo were spared from arrest by the intervention of Cross. After the situation was cleared up, Solo and Chewbacca returned to the cantina to retrieve their lost credits, despite the Wookiee's apprehension."}, {"tag": "p", "text": "Later that evening, Chewbacca and Solo were confronted on their ship by Sergeant Myrsk who was looking for Cross. When the sergeant punched Solo for making an insolent comment, Chewbacca took offense and had to be restrained from attacking the Espo. Solo suggested Myrsk apologize to the Wookiee or else there might be violence. After the Espos left, Cross emerged from a smuggling compartment and discussed his plans with Solo. Once the Imperial agent left, Chewbacca wondered if Cross would treat the pair fairly. Solo assured him that Cross was honorable and would pay his debts."}, {"tag": "p", "text": "Chewbacca was present when Cross and Elli Stark boarded the Millennium Falcon and helped pilot the ship to Reltooine. He remarked that Elli was attractive, and Solo responded that she was too high maintenance and preferred a smuggler girl. When Chewbacca brought up Salla Zend, Solo stated that he wasn't the marrying kind. Once they reached Reltooine, they were attacked by Vulture-class starfighters. Chewbacca help Solo pilot the freighter as they fought off their attackers. He was piloting the freighter when Elli Stark called to be picked up from the Eclipse. After retrieving Cross and Stark from the falling space station, Chewbacca returned to Etti IV on the Millennium Falcon. He expressed disbelief that Solo wanted to use the credits they earned from Cross to play sabacc."}, {"tag": "p", "text": "Bonded to Solo, Chewbacca accompanied him on several misadventures. On one such, the Wookiee was captured and taken to Stars' End, a hidden Corporate Sector prison, where he was quickly rescued. The years went on as Chewbacca accompanied Solo on treasure hunts and spice runs. After Solo won the Millennium Falcon, the first trip was back to Kashyyyk, where Chewbacca ultimately married Mallatobuck and fathered a son named Lumpawarrump. Another run was notable because, in the Millennium Falcon, the two made the Kessel Run in less than twelve parsecs. The next attempt was less successful, resulting in the dumping of a spice shipment due to pursuing Imperials. On this same mission Chewbacca became reunited with Hronk, who had become an Imperial slave on Formos. In spite of the fact that Tojjevvuk's father had called off the feud years ago, Hronk still held a grudge against Chewbacca. Chewbacca's attitude towards honor duels had changed, however, and he ended up saving the Wookiee from captivity, earning forgiveness from the last holdout of a once hostile clan. Unfortunately, this was the only thing that went right, as the undelivered shipment landed Han with a heavy bounty on his head placed by the notorious Jabba the Hutt, the crime lord who owned the shipment."}, {"tag": "p", "text": "After a string of unsuccessful smuggling ventures in the Corporate Sector Authority, Chewbacca and Han left the sector as they soon realized they weren't cut out for legitimate work. Nearly broke, the two accepted a job carrying valuable cargo for ten thousand credits. Unfortunately, the cargo turned out to be slaves, in which the Corporate Sector was suspected of being involved. Receiving help from Bollux and Blue Max, Chewbacca and Han managed to track down the recipients of the cargo. Shortly afterwards, Chewbacca and Han again found themselves on the brink of being broke. Chewbacca along with Bollux and Blue Max accompanied Han to the university world of Rudrig to locate the lost treasure of Xim the Despot. On Rudig, Chewbacca and Han struck a deal with master gunman Gallandro. Though they found the treasure, Solo realized that there would be boobytraps and warned Gallandro, who believed that Solo and Chewbacca wanted to cut him out of his share. Solo dueled the deluded Gallandro to prevent him from continuing, but was wounded and could only watch helplessly as Gallandro was killed by hidden security blasters. Little did they know Chewbacca and Han would encounter his daughter, Anja Gallandro, nearly two decades later."}, {"tag": "p", "text": "Following their near-death experience on Rudrig, Chewbacca returned home, where he led several Wookiees to a Wookiee safe house where they would be safe from traders. However, the bounty hunter Bossk showed up and attempted to enslave Chewbacca and the others. Just before Bossk could capture the entire group, Han Solo returned and destroyed Bossk's ship by landing on it in the Millennium Falcon, leaving the bounty hunter stranded. The act earned Bossk's enmity of the both of them."}, {"tag": "p", "text": "At some point during this time, Chewbacca was also involved with a run-in with several scout troopers on the planet. He was eventually shot off of his Raddaugh Gnasp fluttercraft by a trooper on a speeder bike, slamming onto a StarSpeeder 1000 that had been behind them (the vessel having earlier escaped from an Imperial raid that occurred at Spaceport THX1138). He attempted to climb up but ultimately fell off."}, {"tag": "p", "text": "That very same year, Chewbacca and Han were contacted by Jabba, who wanted the two to locate the priceless Yavin Vassilika. The two then entered in the race where they found themselves once again face to face with bounty hunters, Boba Fett and Bossk, and the smuggler, Lando Calrissian. Chewbacca and Solo started their search in the Mon Calamarian city of Mon Ubris. Pursued by Bossk and his team, their trail led them to the mysterious Bank of Knowledge. However, their search on Mon Calamari lead them to a dead end. The gem was later retrieved by the Rebel Alliance and Han's old flame, Bria Tharen."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Joining the Rebellion"}, {"tag": "p", "text": "It was Chewbacca that Obi-Wan Kenobi spoke to in Chalmun's Spaceport Cantina, where Chewbacca and Han happened to be, when in search of transportation to Alderaan. It is not known whether the Wookiee recognized Kenobi from their time on Alaris Prime or if Chewbacca's friendship with Yoda during the Clone Wars influenced the decision to help the Jedi. Regardless, Chewbacca introduced the aged Jedi Master and his young companion, Luke Skywalker, to Han Solo, and soon the pair bought passage on the Falcon. During the flight over to Alderaan, Chewbacca also played some Dejarik with the droids R2-D2 and C-3PO, although he ended up losing, to his frustration. After learning from Han that Wookiees like Chewbacca were known to rip people's arms out of their sockets, 3PO suggested to R2 to \"let the Wookiee win.\""}, {"tag": "p", "text": "Once they reached Alderaan, they discovered that the planet had been blown to bits by the Empire. While trying to stop a TIE fighter from revealing their presence in the system, Chewbacca and the others were hauled into the Death Star by its tractor beams. The group managed to evade the Imperial officers by hiding in a secret compartment in the Falcon. After the discovery of Princess Leia's presence on the station, Luke convinced Solo and Chewbacca to help him rescue the princess. Luke formulated a plan, which involved Han and Luke impersonating as stormtroopers while Chewbacca pretended to be their prisoner. However, Chewbacca, believing that Luke was actually trying to sell him out, snarled at him when Luke attempted to cuff him, forcing Luke to let Han cuff him, with the latter reassuring Chewbacca that he suspects he knows what Luke was actually planning. While Obi-Wan set off to disable the tractor beams, Chewbacca, Han, and Luke managed to rescue Leia, defeating several Imperial officers in the process. Princess Leia initially disliked Chewbacca as much as she disdained Han and called him a \"walking carpet,\" but the friendship between the two grew over time. Though their mission was successful, Obi-Wan wasn't so lucky, as he was killed by Darth Vader in a lightsaber duel. Chewbacca, Han, Luke and Leia managed to escape the space station."}, {"tag": "p", "text": "Chewbacca accompanied the others to the Rebel base of Yavin 4 where they were preparing for their strike at the Death Star. Eager to get their pay, Solo and the Wookiee chose not to get involved with their \"revolution\" and left. However, Chewbacca managed to convince Han to return and help the Rebels. Han finally gave in, helping Luke Skywalker destroy the Death Star. Shortly after the Battle of Yavin 4, Chewbacca, Han, and Luke received medals for their heroism during the battle."}, {"tag": "h4", "text": "Hero of the Rebel Alliance"}, {"tag": "p", "text": "Having retrieved the reward money for Han's bounty, Chewbacca and Han set off to pay Jabba. However, the money was stolen by the pirate, Crimson Jack. With the help of Luke Skywalker and Princess Leia, Chewbacca and Han managed to defeat the pirate. Following the debacle, Solo gave the recovered money back to the Alliance. Broke and fearing Jabba's retribution, Solo and Chewbacca discovered an ancient cache of treasure hidden in one of Yavin IV's temples. He and Han stole the treasure, against Chewbacca's wishes."}, {"tag": "p", "text": "Solo and Chewbacca were later tasked with finding a power gem as their means to destroy the Executor by Princess Leia. Their first stop was to Junkfort Station. Chewbacca discovered from a local barfly (an agent of Mystra) a potential lead of where a power gem might be found; in Raskar's possession on Antipose. However, because of his attempting to learn directions from the barfly, he was distracted from saving Solo from would-be assassins that were hired by Jabba the Hutt, eventually realizing and saving Solo at the last second by picking the two up and throwing them out of the catana. He then supplied the lead to an irate Solo. Eventually, they discovered that the lead was genuine, and Solo arranged for Chewbacca to fight in Solo's place, to Chewbacca's initial anger. However, Solo planned to have Chewbacca fight the primary candidate for the gem outside of the arena in an all-out brawl as a means to distract Mystra and Raskar while he got into the power gem area, analyze the extent of its power, and then steal or otherwise negotiate getting it. Eventually, he got tired out, although unfortunately for the reigning champion, that only made Chewbacca more ferocious. Eventually, they managed to gain the power gem in exchange for keeping quiet to the Antipose contestants about the weakened state of the power gem, although Solo later admitted to Chewbacca that he plans to return later to loot Raskar of his ill-gotten gains as Raskar's punishment for his scam operation."}, {"tag": "p", "text": "Several months after the Battle of Yavin, the two assisted Renegade Squadron, an elite Rebel fighting force created by Han prior to Yavin, during the Battle of the Graveyard. In the Millennium Falcon, Chewbacca and Han scanned for a holocron with a vital list of possible bases for the Alliance. (The holocron, created by Bail Organa, was encased in phrik and survived the destruction of Alderaan). The holocron was found; however, the Millennium Falcon was damaged by TIE Interceptors during the battle. Renegade Squadron was forced to retrieve the holocron. In order to repair the Millennium Falcon, Chewbacca, Han, and the squadron rendezvoused on Ord Mantell. However, they were discovered by IG-88, the droid bounty hunter, and a skirmish with Imperials ensued. Chewbacca searched for parts for the Millennium Falcon in the huge junkyards near the hangar while protected by Renegade Squadron, and, after finding them, assisted the squadron in protecting Han while the smuggler made the repairs to his ship. After completing them (all the while fighting off stormtroopers and even IG-88), Han, Chewbacca, and Renegade Squadron lifted off, barely escaping the clutches of a Star Destroyer squadron. Only several days later, he and Han helped prepare the evacuation craft that allowed Ackbar and Renegade Squadron to escape Boz Pity."}, {"tag": "p", "text": "A year after the Battle of Yavin, Chewbacca and Han returned to Tatooine where they caught up with Luke in the Mos Eisley cantina. After fleeing from Imperial stormtroopers, Chewbacca, Han, Luke and the droids were stranded in the Dune Sea of Tatooine. In order to escape, they arranged a deal with some Jawas to travel with them in their sandcrawler. Shortly afterwards they learned of the House of Tagge, which was working in concert with the Empire to create a long range freezing mechanism. The Rebels eluded their Imperial pursuers and headed back to Mos Eisley."}, {"tag": "p", "text": "Shortly before Life Day, Chewbacca returned to duty in the Rebel Alliance. While on Yavin 4, Solo and Chewbacca discovered an unauthorized transmission emanating from the jungle around the Massassi base. They eventually found an Imperial spy amongst the Rebels and successfully stopped him. A short while after, Chewbacca and Han left for the celebration of Life Day on Kashyyyk. It served as a short break between the periodical fighting. But peace didn't last long for the pair. Not long after they departed Tatooine for Kashyyyk, they found themselves once again being chased by the Empire. Fleeing to lightspeed, they went on their way. However, the Empire had apparently traced their route to Kashyyyk, which they rightfully suspected to be a harbor for Rebels. Upon learning of this, Darth Vader ordered a blockade and search of the planet. A group of Imperial officers entered Chewbacca's home, terrorizing his family and wrecking the house. They looked for any sign of Rebel activity. However, after a while, Chewbacca's son, who then went by the name Lumpawarrump, devised a plan. He used his mini-transmitter, which he had received as a Life Day present from Saun Dann, to send out a voice message through the Imperial airwaves—which changed the sound of Lumpy's voice. He gave the command of \"return to base,\" which the officers in the home picked up on their receivers. They complied, with the exception of the stormtrooper known as B4711, who was ordered by a superior to stay behind in order to temporarily watch the house for Rebel activity. However, the trooper soon learned of Lumpy's trick, and pursued him through the house, out onto the balcony, where Han and Chewbacca had just arrived. Chewbacca roared as Han managed to kill the trooper. That night, the group, along with the other Wookiees on Kashyyyk, celebrated an uninterrupted Life Day."}, {"tag": "p", "text": "Now out on their own, Chewbacca and Han went on several missions in the early years of the war. Chewbacca and Han were later hired by Ramiz, a moisture farmer on Aduba-3, to protect his village from a band of local thugs known as the Cloud-Riders led by Serji-X Arrogantus. To aid them in their task, Chewbacca and Han hired six misfit spacers which consisted of Don-Wan Kihotay, an old man who believed himself to be a Jedi Knight, Jaxxon a rabbit-like creature, Hedji, Amaiza Foxtrain, young boy named Jimm Doshun and his droid FE-9Q. Arriving to at Ramiz's village Onacra, Chewbacca and the gang encountered flying High-hounds. They managed to drive away the beasts, saving the life of a young girl named Merri to the great relief of her father Oncho, the village spokesman. But their relief was short-lived once Serji-X Arrogantus and his gang attacked. Chewbacca and the Star-Hoppers did their best to defend the village but it was to no avail as FE-9Q was killed and Merri's grandfather the Old One, dismissed the hired spacers' help. Instead of relying on Chewbacca and his team, the shaman summoned a large, mythical reptilian monster called the Behemoth from the World Below to handle the invading Cloud-Riders. Many members of the Star-Hoppers died trying to destroy the creature. Due to their teamwork, Chewbacca and the team were able to defeat the beast."}, {"tag": "p", "text": "Having liberated a spacer from the clutches of the Empire, Chewbacca and Han Solo briefly stayed at Tansarii Point Station while the Millennium Falcon was undergoing repairs.[source?]"}, {"tag": "p", "text": "Approximately six months after the destruction of the Death Star, the Rebel base received a distress call from Aguarl 3. Chewbacca, Han, Princess Leia, and Deena Shan were dispatched to the planet. After an untimely detour on the dangerous planet, Chewbacca and Han were confronted by several creatures native to the planet. In addition to that they were able to uncover secrets relating to the Clone Wars. Fortunately, Chewbacca and Solo were rescued by Deena and Leia."}, {"tag": "p", "text": "Once the Rebels were spread out across the galaxy, Admiral Ackbar sent Chewbacca and Han to Void Station where they encountered bounty hunter, Sheel Odala. Unfortunately, Chewbacca and Han became separated from each other when Jib Kopatha's thugs followed Sheel, capturing Solo. Chewbacca managed to stop Odala from reaching her ship and the two were forced together in order to free him. Together, Chewbacca and Sheel managed to free Solo."}, {"tag": "p", "text": "On another occasion, Chewbacca and Han came into the possession of some valuable glowing Tandgor gems that Solo claimed would pay off debts and mod the Millennium Falcon. They stopped on an unknown planet to get fuel. After landing on the planet, Solo and Chewbacca encountered several groaning skeletal figures—the undead. Chewbacca was able to fight them off and made a hasty retreat back to the Falcon, only to find the fuel line has been severed by someone. Arming themselves, the two-man crew of the Falcon headed back and came face to face with a local and her baby, who explained to the two that the crew of a \"Great Interplanetary Ark\" perished after their ship crashed in the planet's fog. They were compelled to wander the planet as corpses, terrorizing the locals every night."}, {"tag": "p", "text": "Using the Tandgor Gems to lay down lines, Han formed a makeshift runway that managed to dissolve the fog. A ghostly apparition of the ship that crashed long ago used it to land, easing the spirits of the perished crew. The living dead would no longer terrorize the planet's residents. Han and Chewbacca left the planet out of pocket, but were rewarded with enough fuel to last them the rest of their journey."}, {"tag": "p", "text": "Sometime before the Battle of Hoth on Thila, the Rebels fell under attack by the Empire. While fixing Wedge Antilles's snowspeeder, Chewbacca got himself attached to the speeder. Wedge flew off into battle with Chewbacca hanging on the bottom. Using his brute strength, the bold Wookiee managed to capture a TIE fighter then crash landed into an Imperial outpost, ending the battle. As Wedge recalled years later, he felt somewhat embarrassed but acknowledged his heroic efforts."}, {"tag": "h4", "text": "Crisis on Bespin"}, {"tag": "p", "text": "While with the Rebel Alliance on the ice planet of Hoth, Chewbacca was busy repairing the Falcon. Meanwhile, Solo set out to recover the young Rebel, Luke Skywalker, who had gone missing during a scouting mission. Hours passed and the two didn't return. Fearing that Solo was gone, Chewbacca let out a mournful growl, hoping that he'd return. Han eventually made it back safely with Luke in tow. Unfortunately, Chewbacca was unable to finish his work due to the Imperial invasion of Echo Base, so the Falcon was forced to take off with Han Solo, Princess Leia, and C-3PO while in disrepair. Thus, while on the run from the Imperial Fleet, the Falcon set down in an asteroid cavern for repairs."}, {"tag": "p", "text": "When the cavern was discovered to be a giant slug, the Falcon made its escape to Bespin. On Bespin, the group met with Lando Calrissian. When C-3PO went missing, Chewbacca set off to find the protocol droid. Chewbacca eventually found him blasted apart in a junk pile and, after a scuffle with some Ugnaught workers, brought him back to Princess Leia and Han Solo."}, {"tag": "p", "text": "However, Chewbacca did not have the time to repair C-3PO. They were all captured by Darth Vader. During their capture, Chewbacca was sealed in a room with high-pitch alarms going off, irritating the Wookiee's keen hearing. C-3PO's parts were brought in, and Chewbacca began rebuilding the droid. When all but his legs were reattached with his head on backwards, Chewbacca, Leia and Han were brought to the carbonite freezing chamber with C-3PO hanging from a pack on Chewbacca's back. Han Solo was to be frozen as test for Luke Skywalker. Before he was frozen, Chewbacca threw several stormtroopers off the platform but was quickly cuffed. Han entrusted Chewbacca with taking care of Leia. As Chewbacca gave a loud howl, Han Solo was frozen alive, but in hibernation."}, {"tag": "p", "text": "While being escorted to Darth Vader's shuttle by Imperial stormtroopers, Chewbacca, Leia and Lando were freed from their captors by Bespin Security Guards led by Lobot. Released from his bindings, Chewbacca grabbed hold of Lando's throat in a vengeful rage and began to strangle him. Leia was able to get the location of Han Solo's frozen body to the East Platform. Chewbacca let go of Lando and left him gasping for breath on the floor with C-3PO apologizing for the Wookiee's behavior as Chewbacca and Leia rushed off."}, {"tag": "p", "text": "However, Leia and Chewbacca arrived at the platform just as Boba Fett made off with Han Solo. With that, a pursuit ensued in the Cloud City corridors with stormtroopers. Joined by R2-D2, Leia, Lando, and Chewbacca eventually made their way back to the Millennium Falcon. When escaping the city, Leia received a telepathic call for help from Luke and commanded Chewbacca to turn the ship around. After rescuing Luke, the Falcon left the planet behind. While attempting to escape the Executor over Bespin, the supposed repaired hyperdrive failed and Chewbacca was once again forced to fix it. However, R2-D2 quickly activated it and the Falcon escaped to the Rebellion rendezvous point. Chewbacca and Lando would then start their search for Boba Fett and Han Solo."}, {"tag": "h4", "text": "Teaming up with Calrissian"}, {"tag": "p", "text": "After the disastrous mission to Cloud City and the loss of his most trusted friend, Chewbacca temporarily teamed up with Lando Calrissian, occasionally accepting missions from the Rebel Alliance. Lando's search for Solo was cut short as Leia Organa summoned them to a Rebel base on the volcanic planet of Golrath. Once there, they were informed that Luke Skywalker had been infected with a lethal disease, \"Crimson Forever,\" which caused victims to turn crimson, eventually killing them. After boarding an Imperial vessel and finding its crew crimson-colored and dead, Luke recovered a red-glowing stone, suspecting it to be the source of whatever killed the Imperials. Luke rushed back to the Rebel headquarters, but he was already infected. In a short time, Luke was lying comatose, his eyes turned scarlet red. Leia remembered a story Han Solo had told her about the Red Nebula that featured a pair of stones similar to the one that infected Luke. Chewbacca regaled the tale, and the group came to the conclusion that the \"Crimson Forever\" stone was indeed one of those Chewbacca and Han had encountered—when the two stones were separated, they were extremely lethal. Following up on the lead, Chewbacca, Lando and Leia piloted the Millennium Falcon to the Red Nebula, only to find a seemingly abandoned House of Tagge spaceship. Lando and Leia boarded the vessel while Chewbacca waited in the Falcon. After a near-death encounter with Domina Tagge the group escaped, destroying the Rebel Base on Golrath."}, {"tag": "h4", "text": "City of Dreams"}, {"tag": "p", "text": "Shortly after the beginning their initial partnership, Chewbacca and Calrissian stumbled upon the \"City of Dreams,\" a dimensional rift inhabited by Cody Sunn-Childe, a former Rebel Alliance operative and a hero of Lando's, who gained strange powers during his travels. Unbeknownst to them, the city had a strange effect on its inhabitants as they were hypnotically enthralled by the phantasmagoric surroundings. As the two explored the city Chewbacca became spellbound and seemed to forget the search for Han in favor of the city's distractions, and roughly punched Lando for speaking ill of the city. Later, the city was attacked by an Imperial fleet led by Captain Plikk, who had also fallen prey to the spell. The impact caused many, Chewbacca included, to snap out of their charmed state. Chewbacca and Lando piloted the Millennium Falcon in combat against the Imperials, but the battle was cut short when Sunn-Childe, who had at first allowed his demonic manifestations to attack the Star Destroyers, made no further attempt to stop the Imperial bombardment of the city, letting the fleet utterly destroy it and all its citizens, himself included. The Falcon then escaped through the rapidly closing dimensional gate, but the Imperials—who, because of their excessive bombardment, lacked the hyperdrive power to escape—were forever trapped in Sunn-Childe's dimension."}, {"tag": "h4", "text": "Destruction of the Tarkin"}, {"tag": "p", "text": "Informed by an operative that the Empire was constructing a new superweapon—the Tarkin— General Carlist Rieekan ordered Chewbacca and Lando to stop their search for a new planet on which the Alliance could establish a new headquarters, and return to the temporary base. Once there, they were briefed on their new mission—to destroy the Tarkin. A small commando team consisting of Chewbacca, Leia, Luke, C-3PO and R2-D2 infiltrated the superweapon dressed as workers, and proceeded to strike at its reactor with a proton grenade. Lando, whom both Leia and General Rieekan thought of as untrustworthy—to such a degree that he was \"left out\" of the mission—sneaked aboard the Millennium Falcon that the commando team piloted to Hockaleg, the planet which the Tarkin orbited. Lando hoped to make himself useful by staying with the Falcon, ready to rush to the superweapon to save his friends."}, {"tag": "p", "text": "Unbeknownst to the commando team, Vader was also present at the space station, having sensed that Skywalker had infiltrated it. Believing the Rebels' plan was to destroy the Tarkin's reactor, Vader personally saw to the protection of that area, delegating the rest of the security personnel to potential escape routes. However, just as he was on his way to catch Luke, a group of high-ranking Imperial officers attempted to kill the Sith by opening an airlock, sending Vader into space. The plan was foiled by Vader himself—using the Force, he was able to pull himself back into the Tarkin from the vacuum of space. This distraction helped Luke barely escape the Dark Lord. In the meantime, Leia had wired the superweapon's ion cannon to fire upon itself—something that would utterly destroy the station. The group escaped the Imperials, returning to the Rebel Base."}, {"tag": "h4", "text": "Other missions"}, {"tag": "p", "text": "Following the confrontation with Vader, Princess Leia went missing while on a mission to investigate Imperial activity in the Shiva system. Once again derailed from their search for Solo, Chewbacca, Lando and Luke embarked on their quest to locate the princess. The trio arrived just in time, helping Leia to fight Imperial forces led by General Sk'ar while Calrissian participated in the aerial assault. The battle resulted in a win for the Rebels and the death of Sk'ar by Chewbacca."}, {"tag": "p", "text": "Just after the Battle of Hoth, Chewbacca, Lando, and Luke Skywalker arrived on Bazarre to negotiate the sale of four disabled Imperial TIE Fighters from a weapons dealer named Orion Ferret. Ferret gave the Rebels the location of the TIE fighters, but double-crossed them when he attempted to sabotage their shuttlecraft. Lando, having never trusted Orion, left Chewbacca behind on Bazarre to keep a watch over Ferret. No sooner had the Rebels left for Patch-4 than Orion began plotting their deaths. He believed that if he were to remotely activate the shuttle's ejection seats, then Luke and Lando would die in space, and he could keep the money, his fighters and the Millennium Falcon. However, he had to find a way to get Chewbacca out of the way. With the aid of his assistant P'Lor, he used a gelatinous spritzer solution to imprison the Wookiee. Unfortunately for Ferret, the solution was not strong enough to contain Chewbacca, and he soon broke free. Chewbacca chased Orion Ferret all throughout the Bazarre marketplace. Ferret attempted to flee in his personal shuttlecraft, but a few well-aimed shots from Chewbacca's bowcaster rendered the ship unusable. Lando Calrissian returned to Bazarre in time to keep Chewbacca from ripping Orion's head off."}, {"tag": "p", "text": "Some time after the Battle of Hoth, Chewbacca presented his HoloGrid to an astonished Princess Leia. Chewbacca's information was the only legitimate source of Claatuvac Guild data discovered since the Clone Wars, and the information in secret hyperspace routes was passed up to Alliance High Command. The Rebel Alliance issued the information on a strictly need-to-know basis, and Chewbacca's data proved one of the Alliance's most valuable tools in its fight against the Empire."}, {"tag": "p", "text": "On one occasion Chewbacca accompanied Luke on his search to find information on Shira Brie, Luke's former flame. During a heated space battle with Imperial forces Luke's targeting computer malfunctioned causing the boy to rely on the force to pick his targets, shooting Brie down. In order to clear his name the two began their search on Shalyvane, where Shira had once told Luke that Em'liy marauders once slaughtered her people on this world. Luke and Chewbacca met the aging G'hinji inside of a cave near the capital city of Chinshassa. G'hinji told him that there had never been Human settlements on Shalyvane and that everything Shira Brie told him was a lie. The Em'liy were the only native species to the planet, and were once a thriving community until the Emperor sent a squad of Imperial TIE bombers to Chinshassa and laid waste to the capital city. G'hinji escorted Luke to a sacred site known as the Circle of Kavaan. There, Luke discovered a holographic recording of Darth Vader, revealing the true history of Shira Brie."}, {"tag": "p", "text": "Traveling to Krake's Planet to find further information on Shira Brie, the two infiltrated the Krake Data Vault, a facility built from the mass of a giant Mind Spider. Once they recorded the information, Chewbacca used the Falcon's deflector screens to destroy the military outpost."}, {"tag": "h4", "text": "Rescue of Han Solo"}, {"tag": "p", "text": "Chewbacca took Han's order to take care of Leia very seriously. When not helping Lando with the search for Han, he served as Leia's bodyguard. When she attempted to negotiate with the criminal super-organization Black Sun for their aid in determining who had placed a bounty on Luke Skywalker, he accompanied her to Coruscant. In order to get past Imperial security, he was disguised as the Wookiee bounty hunter Snoova, and Leia took on the identity of Boushh. From there the two became guests of Black Sun's leader, the Falleen Prince Xizor. Chewbacca, already suspicious of the crime lord, was outraged when Xizor attempted to seduce Leia. Fortunately, Chewbacca was able to remove Leia from the influence of Xizor's mind-affecting pheromones. Leia distracted Xizor long enough to allow Chewbacca to escape with the information that Xizor was in fact the one behind the bounty on Skywalker."}, {"tag": "p", "text": "Chewbacca was able to meet up with Luke, and together they formed a rescue party, along with Lando and Dash Rendar. They were able to break into Xizor's palace through the sewers and freed Leia, escaping on the Millennium Falcon and destroying Xizor's palace in the process, crippling Black Sun."}, {"tag": "p", "text": "After the death of Xizor, Chewbacca once again teamed up with Lando as he, Leia, Luke and the two droids needed help in tracking down the undercover Rebel agent Tay Vanis."}, {"tag": "p", "text": "Having learned that Boba Fett had finally delivered Han to Jabba the Hutt, Luke hatched a plan that involved infiltrating various members of the party into Jabba's palace. Chewbacca was inserted when Leia, again posing as Boushh, took the Wookiee to Jabba as a prisoner. After thermal-detonator-assisted price negotiations, Chewbacca was surrendered to Jabba and placed in a dungeon cell. When Leia failed to escape after freeing Han from the carbonite, Han was placed in the same cell. The two prisoners were soon taken out of their cells—for execution. Luke's killing of the rancor had so enraged Jabba that he ordered that Luke, Han, and Chewbacca be fed to the sarlacc in the Great Pit of Carkoon. However, Luke's planning allowed him to recover his lightsaber, and together with Lando, who was disguised as one of Jabba's thugs, they turned the execution into a battle. Chewbacca protected Han, who was still blind as an effect of the hibernation sickness he had acquired while in the carbonite. In addition, when Boba Fett attempted to gun down Luke Skywalker, Chewbacca attempted to warn Han, resulting in Han accidentally knocking Boba Fett into the Sarlacc. When Lando was knocked into the Great Pit, Chewbacca anchored Han as the smuggler leaned over the side of their skiff and rescued his old friend."}, {"tag": "h4", "text": "Endor"}, {"tag": "p", "text": "After the battle was over and Jabba killed, all the heroes, with the exception of Luke, reported to the Rebel fleet over Sullust. There the Rebels formed a battle plan to destroy the Second Death Star over Endor. Only during the briefing did Chewbacca become aware that Han, now a general, had volunteered to lead the ground assault on the shield generator protecting the Death Star. Chewbacca swiftly volunteered to join his group of commandos."}, {"tag": "p", "text": "On the approach to the shield bunker, the Wookiee's lack of caution got the team into trouble. Seizing a hunk of meat tied to a stick, he unwittingly sprung a trap that got Han, Luke, the droids, and himself captured by Ewoks and taken back to their village. There, the team reunited with Leia, who had been taken to the village after becoming separated from the others. As a result of the Ewoks' belief that C-3PO was a god, they were able to negotiate not only their freedom but the Ewoks' aid in the upcoming battle with the Empire. Leia, Luke, Han, the droids, and Chewbacca were all made members of the Ewok tribe."}, {"tag": "p", "text": "During the terrestrial portion of the Battle of Endor, Chewbacca swung the tide of the battle when he and two native Ewoks hijacked an AT-ST and turned it against the Empire, helping the Alliance secure their victory on the forest moon."}, {"tag": "h3", "text": "Hero of the New Republic (4 ABY to 25 ABY)"}, {"tag": "h4", "text": "Founding of the New Republic"}, {"tag": "p", "text": "Shortly after the Battle of Endor, Chewbacca and Lando were taken prisoner by Imperial Moff. To get them out of this situation, Calrissian convinced the Moff to enter a bet involving Chewbacca and the Falcon. Shortly afterwards, Chewbacca found himself fighting in an Imperial arena with a huge battle droid made from spare droid parts. Using his brute strength, the Wookiee managed to defeat the droid, winning the bet and allowing them to escape."}, {"tag": "p", "text": "Not long after the destruction of the Second Death Star, Chewbacca and Han Solo returned to Kashyyyk to liberate the Wookiee homeworld. Chewbacca was responsible for the reconstruction of Wookiee Government tree. Later, the noble Wookiee dealt with the treacherous Weebacca and freed the slaves, including his father, imprisoned on the Avatar Orbital Platform. Chewbacca also played a vital role in the Battle of Bakura, where he helped Solo and the others neutralize an Imperial threat on the planet of Bakura. The incident brought about the establishment of the Alliance of Free Planets."}, {"tag": "h4", "text": "Nagai-Tof War"}, {"tag": "p", "text": "Shortly after the Battle of Bakura, Chewbacca, Han and Lando Calrissian were sent on several missions to bring secure attendees for the First Conference of Free Peoples. After these recruitment missions, the group decided to take a break to visit Chewbacca's family on Kashyyyk. En route to his house, Chewbacca, Han and Lando encountered a mysterious alien named Knife and Chewbacca's brother-in-law, Vargi. As it turned out, Knife took Chewbacca's family as hostages and planned to sell him and the other Wookiees in a slave trade. Imprisoning Han and Lando in his home, Knife and the rogue Wookiees under his command took Chewbacca as prisoner and proceeded to the slave ship. Fortunately the Wookiee was saved by Han Solo."}, {"tag": "p", "text": "While Lando and the loyal Wookiees fought off the Nagai forces and their counterparts, Chewbacca lashed out at Vargi. Realizing that Chewbacca's outburst was disrupting the loading of Wookiees onto the slave ships, Knife prepared to kill Chewbacca with a tehk'la blade, but the weapon was shot out of his hand by Lando. The Wookiees overthrew their rogue counterparts just as Chewbacca overpowered Vargi, throwing him to the ground. Knife's plans of creating a slave trade on Kashyyyk were thwarted, and the rogue Wookiees, along with the Nagai forces except Knife, were captured by the Alliance. Vargi, however, was disowned by Malla."}, {"tag": "p", "text": "Chewbacca and the Alliance later joined forces with the Nagai in order to defeat their enemy and rivals, the Tofs and their leader Prince Sereno. During the Battle of Saijo, Chewbacca became part of the aerial assault, leading a fighter squadron along with Lando Calrissian, Wedge Antilles, and Nien Nunb. The battle resulted in a win for the Alliance and the surrender of Sereno, ending the Nagai–Tof War."}, {"tag": "h4", "text": "Later missions"}, {"tag": "p", "text": "After Han's marriage to Leia Organa in 8 ABY, Chewbacca and his son Lumpawarrump encountered trouble on Coruscant. While on Coruscant, Chewbacca pursued his son through the undercity of Coruscant after he caught burglars stealing a datapad from Han and Leia. Lumpawarrump became captured and in the process of saving him, Malla was also captured. Shortly afterwards, Chewbacca and Lumpawarrump discovered that the burglars were planning to assassinate the New Republic's leaders. Determined to stop them, Chewbacca and his son infiltrated the enemies' base to find an advanced IT-3 interrogation droid attempting to brainwash Malla into believing that the Solos are a danger to her child. Enraged, Chewbacca attacked the burglars and freed Mallatobuck."}, {"tag": "p", "text": "Later that year, Chewbacca accompanied Han, Leia, and C-3PO to Tatooine on a mission to locate an Alderaanian moss painting—lost after the planet's destruction—that had resurfaced on the black market. It concealed a code used to communicate with New Republic agents undercover within the Empire. As they pursued the painting they learned much about the man who became Darth Vader from Kitster Banai and Wald, childhood friends of Anakin Skywalker. Fortunately, the painting was discovered and the code was destroyed."}, {"tag": "p", "text": "Chewbacca remained with Han well after his marriage to Leia. In fact, when Leia was being hunted by the mysterious Noghri, Chewbacca brought the former Princess to his home planet of Kashyyyk. The plan didn't hold up long, as the Noghri launched an unsuccessful attempt to abduct the princess there, but Leia was able to make peace with one of her assailants."}, {"tag": "h4", "text": "Life with the Solos"}, {"tag": "p", "text": "Chewbacca's original life debt to Han now included Leia, her brother, and her children. In 9 ABY Chewbacca participated in the offensives against Admiral Thrawn and the deranged Dark Jedi clone, Joruus C'baoth. Along with Han, Chewbacca formed a coalition of smugglers for a last-ditch attack against the Empire, while Leia held the Alliance together and prepared for the birth of her Jedi twins. Thrawn and his forces were defeated, and C'baoth was killed by Mara Jade, a former ally of the Empire."}, {"tag": "p", "text": "A year later, Chewbacca and the others discovered that the Emperor was alive and that his good friend, Luke, turned to the dark side. Fleeing to Nar Shaddaa, Chewbacca, Han, and Leia, again pregnant, discovered the existence of another lethal enemy; Boba Fett. They had fled to the underworld of the Smuggler's Moon after their initial haven, the hidden repair center ran by Shug Ninx, was taken over by stormtroopers. Confronted by an array of bounty hunters, and the news that the Hutt clans had doubled the bounty on them, they had little choice but to leave the moon—where Boba Fett had patiently waited for the Millennium Falcon to take off. Their second attempt at penetrating the depths had greater luck; they had just found Vima-Da-Boda when Fett attacked. His assault was defeated when Chewbacca ignited his jet-pack, sending the bounty hunter flying into a wall. However, their immediate departure was sabotaged by Mako Spince, who from his perch in the Traffic Control spire forwarded their location to the waiting dark-siders aboard. Due to Han's risky maneuver, the group was able to destroy Spince and escape."}, {"tag": "p", "text": "In 11 ABY, Solo and Chewbacca were taken prisoner on the planet Kessel and forced to work in the fathomless depths of a spice mine. On Kessel they befriend a boy named Kyp Durron. Chewbacca and Han broke away and flee desperately to a secret Imperial research laboratory surrounded by a cluster of black holes. In the laboratory they discover the dreadful Sun Crusher. After being captured by Admiral Daala's forces, Chewbacca along with Han, Kyp, and Qwi Xux stole the Sun Crusher and escaped the Maw Installation. Unfortunately, Kyp stole the Sun Crusher, destroying thousands of lives on the planet of Carida. Chewbacca and Han eventually caught up with and took the latter to the Coruscant where he was redeemed by Luke Skywalker."}, {"tag": "p", "text": "As Luke began restoring Jedi Order and reversing the damages done by Darth Vader and the Emperor, Chewbacca and the Solos set out on their own mission to recover force-sensitive children. They began their search on the frozen world of Belsavis, as they heard rumors of Jedi living there. Having heard tales of a Jedi exodus from the dark crypts below the planet's surface, and also hearing that since the time of the exodus no one entering the crypts has returned alive, Chewbacca, Han, and Leia, journeyed there to start their search."}, {"tag": "p", "text": "He was seen as an uncle-like figure by the Solo children and took care of them along with C-3PO and R2-D2 when Han and Leia were away. Chewbacca was known to protect the Solo children rather fiercely as though they were his own children. In 14 ABY he accompanied Leia on her mission to rescue her children from Lord Hethrir and the Empire Reborn movement. Posing as pirates, Chewbacca and Leia managed to find and rescue Jaina and Jacen along with the other children Hethrir held on his Worldcraft."}, {"tag": "p", "text": "Also in that year, Chewbacca was seen in Mos Eisley in a mission for Leia Organa. Chewbacca was being chased by mercenaries, when he met Jedi apprentice Jaden Korr, while hiding himself from the shooters. The Wookiee was of great help to Jaden's mission, having neutralized many mercenaries and smugglers. By the end of it, Kyle Katarn met up with the two, and suspected that the Imperial Remnant was backing up the Disciples of Ragnos. Chewbacca complimented Jaden's skills, grabbed him and held his head, as a form of gratitude for the help."}, {"tag": "p", "text": "Just before the Black Fleet Crisis, Chewbacca went home to Kashyyyk to participate in his son Lumpawarrump's coming of age ceremony. When Chewbacca learned that Han had been captured by the Yevetha, he disobeyed Leia's instructions and flew straight into the heart of enemy territory. Chewbacca staged a rescue from the Super Star Destroyer Pride of Yevetha with the help of his son and his cousins Jowdrrl, Shoran, and Dryanta. This served as a coming of age for Lumpawarrump, who was renamed Lumpawaroo as he became an adult."}, {"tag": "p", "text": "In 18 ABY, Chewbacca accompanied the Solo family to Han's homeworld of Corellia, where he and C-3PO looked after the twins and Anakin. When the first hostilities of the First Corellian Insurrection broke out, Chewbacca got the children and others to the Falcon for a hasty retreat. They reached Drall after the Falcon's hyperdrive was damaged by a patrol ship. They went to Drall's planetary repulsor and were captured by their cousin Thrackan Sal-Solo. The children escaped and made some repairs to the Falcon with Chewbacca's help. They flew off in the Falcon and evaded Thrackan's ship. Later the family was reunited."}, {"tag": "p", "text": "After the discovery of a partial copy of the Caamas Document in 19 ABY, and because of the crisis that would likely follow, the Solo children were sent to Kashyyyk with Chewbacca and a group of Noghri for protection. After the crisis passed, Chewbacca and the children attended the signing of the Pellaeon–Gavrisom Treaty aboard the Star Destroyer Chimaera."}, {"tag": "p", "text": "Shortly afterwards, Chewbacca's nephew Lowbacca was discovered to be Force-sensitive, a trait rare among the Wookiee species. Chewbacca took Lowbacca to Luke's Jedi Praxeum on Yavin 4 where he built Lowbacca the droid M-TD to translate for him. Lowbacca later befriended the Solo twins, Jaina and Jacen, who affectionately called him Lowie."}, {"tag": "h4", "text": "Mission to Sernpidal and aftermath"}, {"tag": "p", "text": "In 25 ABY, Chewbacca, Han Solo and his youngest son Anakin were sent by Lando Calrissian to pick up a shipment on Sernpidal. When they arrived, the Solos and Chewbacca met an old man, the former mayor of Sernpidal City, who informed them that Dobido was headed on a collision course with Sernpidal and that it was orbiting its host quickly, dropping closer to Sernpidal at regular intervals. While Chewbacca and Han began loading as many people as they could onto the Falcon, Anakin rushed off into Sernpidal City with the mayor in tow. Chewbacca and Solo evacuated as many people as they could hold, rescuing thousands of Sernpidalians, using the Millennium Falcon and various other starships."}, {"tag": "p", "text": "Anakin calculated Dobido would collide with Sernpidal in seven hours. This event, unbeknownst to them, was a result of the Yuuzhan Vong tactic, Yo'gand's Core. As the winds picked up, Anakin was knocked into the distance, causing Chewbacca to run after him. Chewbacca was able to bring Anakin to safety on the Falcon, but another blast of wind knocked him out of reach. Anakin piloted the Falcon, while his father stood on the entrance ramp hoping to lift Chewbacca up, but was forced to flee from Sernpidal when he realized it was too late to save Chewbacca. The Wookiee stood in the moon's trajectory, howling defiantly, and was crushed to death with those Sernpidalians who could not escape. His death drove Han to a resentment of his son Anakin. Han eventually recovered and forgave his son, but the death of his battle-brother and dearest companion would stick with him forever."}, {"tag": "h3", "text": "Honoring the legacy and death (25 ABY—)"}, {"tag": "p", "text": "After his death, Chewbacca became a legend on Kashyyyk, and the droid C-3PO recited his tale on occasions. His death solidified not only Anakin's cause to fight in the war but the rest of his family as well. With the end of the Yuuzhan Vong War, Lumpawaroo and Lowbacca, Chewbacca's son and nephew, vowed to take up his life-debt to Han Solo. Chewbacca's family gave Han the first bowcaster that Chewbacca ever made as a gift to his long time friend and co-pilot. Han even swore that Chewbacca spoke to him through the Force after he died, saving his life from Elan, a Yuuzhan Vong assassin. To commemorate his heroic efforts, the villagers of Kashyyyk built a memorial in his honor, which was personally carved by Tvrrdko into a large wroshyr tree. The memorial was visited by many well after his death. Han again visited the tree memorial of Chewbacca and stabbed Anakin Solo's lightsaber deep into the tree, so that anyone who would need it in the future could use it. To honor Chewbacca's life, C-3PO and R2-D2 decided to create a holo featuring the interviews of the people that knew him the most. A funeral also took place. To many, Chewbacca embodied a sense of courage and loyalty that made him a hero to others."}, {"tag": "p", "text": "The Trandoshan Bossk had other thoughts. He couldn't help but rub Chewbacca's death in Han Solo's face. Both ended up in a fistfight, and Bossk ended up with a broken snout, courtesy of Solo. Wookiees would take pride in the fact that Chewbacca died honoring his life debt as well as the fact that it literally took an entire moon to kill him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In his youth, Chewbacca was often found by many to be somewhat reckless, often venturing off into the Shadowlands on Kashyyyk. At the time of the Clone Wars, his leadership of his fellow brethren helped stop the Confederate forces from taking their home. Known for his great strength, bravery and loyalty, Chewbacca often served as Solo's conscience in their smuggling endeavors. However, he was also known for his stubbornness and dislike of losing."}, {"tag": "p", "text": "One of the greatest heroes the galaxy had ever known, Chewbacca possessed a great amount of strength which was admired by many. In addition, Chewbacca possessed exceptional skills in piloting and repair and was a master of dejarik, an ancient and challenging hologame requiring skill and strategy. Many of the sublight and hyperdrive systems of the Falcon were of Chewbacca's own design. Even when the ship was in peak condition, he enjoyed attempting to upgrade and re-route the engines for greater efficiency and performance. Chewbacca has taken the Falcon's engines apart on several occasions and had a great understanding of the temperamental nature of its systems. He understood small craft such as the Sorosuub X-34 landspeeder and the Imperial AT-ST, and had intuitive ability to understand the workings of other vehicles, as situations arose. Chewbacca's technical skill and precision allowed him to understand the inner workings of a great number of devices, from droids to star cruisers. Chewbacca learned his skills at Rwookrrorro's landing pad, and helped design and build the Wookiee escape pods."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chewbacca was portrayed by Peter Mayhew in Episodes III to VI. He was based on Indiana, an Alaskan malamute dog owned by George Lucas in the 1970s, the name of whom later provided Dr. Henry Jones Junior's adopted first name."}, {"tag": "p", "text": "There were many early versions of Chewbacca's appearance (including one piece of concept art that eventually became the basis of the Lasat). His final appearance in the movie is based on a 1976 piece of concept art by Ralph McQuarrie, which in turn was based on an illustration by John Schoenherr for George R.R. Martin's novelette \"And Seven Times Never Kill a Man,\" published in the July 1975 issue of Analog. The Schoenherr illustration also includes a weapon that became an inspiration for Chewbacca's bowcaster."}, {"tag": "p", "text": "For his appearances in the original trilogy, the Chewbacca suit, designed by Stuart Freeborn, was made out of knitted mohair (made from goat and rabbit hair) and yak hair. It was later used and retouched during the making of Star Wars: Episode I The Phantom Menace for Senator Yarua. For his appearance in Star Wars: Episode III Revenge of the Sith, Chewbacca was completely remade, with newer, more efficient and cost-effective materials. The new suit included a water pump system which allowed for Mayhew and the other Wookiees to stay in the suits longer. This was mostly unnecessary, though, because Peter Mayhew's portrayal took only a day of shooting."}, {"tag": "p", "text": "The memorable voice of Chewbacca was designed by Ben Burtt, sound designer for all six films. He mixed together various animal growls for different emotions, including those of walruses, bears, tigers, camels and badgers. The most prominent of these voices was a black bear named Tarik, who died of congestive heart failure in 1994."}, {"tag": "p", "text": "In 1997, Chewbacca appeared on the MTV Movie Awards and, as recompense for not receiving a medal during the closing sequence of Star Wars: Episode IV A New Hope, was given a medal by Carrie Fisher, who played Leia Organa throughout the original trilogy."}, {"tag": "p", "text": "In 1999, Chewbacca became the first major character in the Star Wars films to be killed off in the Expanded Universe, when R. A. Salvatore's The New Jedi Order: Vector Prime, the first entry in the New Jedi Order series, depicted him being crushed by Dobido, one of two moons of Sernpidal. This caused resentment and drama against Salvatore among some fans despite the fact that the idea originated with Randy Stradley, well before Salvatore was even signed on to the series. It was only after he signed on to his contractual obligations that Salvatore was informed that Chewbacca was to die. The author decided that since his contract was forcing him to kill off a character he liked, he would ensure that Chewbacca would go out in an heroic and unforgettable blaze of glory. Chewbacca's death in the novel received widespread coverage in the form of articles, memorials, and tributes by newspapers across the United States."}, {"tag": "p", "text": "In the Super Nintendo Super Star Wars games, Chewbacca is listed as being eight feet tall, 200 years old and originating from the planet \"Kazhyyyk,\" an early way the Expanded Universe spelled the planet."}, {"tag": "p", "text": "Michael P. Kube-McDowell wanted to rewrite Chewbacca's family (such as making it polygamous) for the Black Fleet Crisis Trilogy, but was forced by Lucasfilm Ltd. to follow the background given in The Star Wars Holiday Special."}, {"tag": "p", "text": "During production of A New Hope, the executives at the studio were concerned that \"the Wookiee had no pants.\""}, {"tag": "p", "text": "Chewbacca made an appearance in Star Tours: The Adventures Continue on the Kashyyyk segment, although he was not specifically identified in the ride itself. Rather, he was identified by various Disney promotional materials, specifying him as the Wookiee who slammed into the Star Tours vessel at one point."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "Chewbacca and Han Solo appeared in the ambiguously canon scenario for Star Wars Miniatures, The Theft of Vader's Helmet, in which they led a mission to the Executor to steal Darth Vader's helmet sometime during Admiral Piett's captaincy of the Executor."}, {"tag": "p", "text": "Chewbaaca also appears during the special LEGO Star Wars: The Padawan Menace, where he is in the Senate building during a session and in the audience of the medal ceremony at the end."}, {"tag": "h4", "text": "The Battle of Endor"}, {"tag": "p", "text": "Through the non-canon dark side ending of The Force Unleashed II, the events at the Battle of Endor were drastically altered as a consequence of the Rebel defeat at Kamino and Starkiller's choosing of vengeance. Although much of the battle was similar to its canonical counterpart, the main difference was in the form of Darth Vader's Dark Apprentice, the Dark Lord's personal Sith assassin and the only perfect clone of the original Starkiller. With orders from Vader to prevent the Rebel forces from destroying the shield generator bunker, the apprentice did not hold back from rampaging his way through the forest, slaughtering Rebel troops and Ewoks alike."}, {"tag": "p", "text": "Upon reaching the entrance of the bunker, the Dark Apprentice's path was blocked by the Rebel Han Solo and the Wookiee Chewbacca. While standing above the bunker with a rocket launcher, Solo warned his friend that the clone was approaching and that they had to do everything that they could to buy the Jedi Princess Leia Organa more time to complete the mission. To aid in their effort, Chewbacca utilized a commandeered Imperial AT-ST walker. Although a combination of the walker's heavy firepower and quick shots from Han Solo was able to stall the apprentice, neither Solo nor Chewbacca was able to kill the clone."}, {"tag": "p", "text": "After suffering damage to the walker, Chewbacca called upon the aid of the Ewoks. Once more, their tactics proved ineffective against Vader's disciple, who managed to kill the native creatures while simultaneously warding off shots from Solo and Chewbacca. After inflicting even more damage to the walker, the clone wasted little time in maneuvering his way over to the top of the walker. Once the hatch was open, the clone began pulling its Rebel occupant out of the cockpit. Chewbacca attempted to resist by relying on his brute strength, but was effectively incapacitated by the apprentice with one swift punch to the face. Unable to resist any further, Chewbacca was rendered helpless as the clone raised and held the Wookiee by the throat with one hand."}, {"tag": "p", "text": "Solo attempted to save his friend by firing two shots at the clone. But the Dark Apprentice anticipated this action and quickly used the Wookiee as a body shield to absorb the attack, thus causing Solo to inadvertently kill Chewbacca. With Chewbacca dead, Han Solo quickly followed as the clone impaled the former smuggler through the chest with a lightsaber. Their failure to kill or prevent the Dark Apprentice from entering the bunker led to Leia's death and the Empire's decisive victory over the fallen Alliance."}, {"tag": "h3", "text": "Translations"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}