{"url": "Chewbacca_(2015)_4", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Chewbacca (Marvel)"], "nodes": [{"tag": "h1", "text": "Chewbacca (2015) 4"}, {"tag": "p", "text": "Chewbacca 4 is the fourth of five issues of the Marvel comic book miniseries Star Wars: Chewbacca. It was published on November 25, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Zarro, Chewbacca, Sevox, and the protocol droid I-7 travel on a landspeeder to the Andelm IV spaceport. Sevox soon learns from an individual named Lageose that an Imperial Star Destroyer has entered the Andelm system. Due to the Imperial presence, Sevox thinks that Chewie's plan to use an R5 repair droid crammed with explosives is a bad plan; prompting the Wookiee to roar back in protest. While driving the speeder, Zarro insists that Chewie's plan will work. Before dropping Zarro and Chewie off, Sevox tells the two that he will move out of his bunker so that they can use it as a hideout. However, he tells them not to mention his name if they are captured. He also jokes that they should tell the Empire that he has been enslaved by his own protocol droid."}, {"tag": "p", "text": "Chewie whisks away a group of Human child beggars. Before leaving, Sevox tells Zarro that he would give her some credits if she can bring the head of an Imperial RA-7 protocol droid, whose optics are supposed to be magnificent. He also advises her not to let the Imperials think that she is part of the Rebellion. Chewie and Zarro enter the spaceport disguised as a battle droid and a diminutive alien respectively. Despite Zarro's hope that they can take out Jaum before a single Imperial lands, they discover that the spaceport has been locked down by several stormtroopers and Scout troopers. Together with their fake repair droid, Zarro and Chewie managed to gain entry by pretending that Chewie is Jaum's latest war droid."}, {"tag": "p", "text": "Upon entering the hangar, they find Jaum supervising stormtroopers who are loading crates of Andelm beetles into an Imperial landing craft, which is being guarded by an AT-ST walker. When Jaum demands to know who they are, Zarro claims that they were told to guard the shipment and tells him that he should not be here. Zarro then claims that her droids will finish the loading. Suspicious, Jaum orders her to take off her helmet. Chewie then opens fire on the stormtroopers and Jaum with his blasters. She then sends the rigged repair droid \"Boomer\" aboard the shuttle. After running out of blaster bolts, Chewbacca takes out the stormtroopers in hand to hand combat. In the midst of the fighting, \"Boomer\" is knocked out by a stray blaster bolt."}, {"tag": "p", "text": "While Jaum boards the shuttle with the supplies, his Shistavanen bodyguard Tyvak decides to finish off Chewbacca in a one-on-one duel with a metal rod. Trapped between the AT-ST walker and Tyvak, Chewie activates a nearby engine which burns the Shistavanen alive and damages the AT-ST's right laser cannon, causing it to topple to the floor. While an enraged Jaum exchanges fire with Chewie, Zarro sneaks the repair droid aboard the Imperial landing craft. Thinking that he has won, Jaum departs on the shuttle for the Star Destroyer in orbit. Zarro and Chewbacca celebrate planting the repair droid aboard the shuttle. However, their elation is short-lived when the two are arrested by scout troopers reinforcements. Zarro tries to fool the Imperials by claiming that Jaum is a spice addict but the lead scout trooper arrests the two fugitives. Commander Kai has ordered their arrest and transportation for interrogation."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}