{"url": "Chi_Cho/Legends", "categories": ["Category:Legends articles", "Category:Males", "Category:Pantorans", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Chi Cho"}, {"tag": "p", "text": "Chi Cho was a Pantoran male who served as the Chairman of the Pantoran Assembly during the Clone Wars. Though a brave warrior, ready and willing to fight and die for his homeworld, he was quite stubborn and unwilling to seek peaceful solutions to diplomatic issues, preferring brute force. Cho, along with Senator Riyo Chuchi embarked on a mission in 22 BBY."}, {"tag": "p", "text": "The mission, led by High Jedi General Obi-Wan Kenobi and Jedi General Anakin Skywalker, was to intercept Separatist forces that were staging an invasion on Pantora. Orchestrating the attack on Orto Plutonia, located in the Pantora system, Cho and the Jedi found an abandoned Separatist base on the planet but were convinced that there were droids around and that they could attack the party at any moment. Cho soon found out that Talz, a species which inhabited Orto Plutonia, were responsible for the attack and could be a threat to the Pantorans. Senator Chuchi wasn't responding well to Cho's actions, when he decided to go to war with the Talz and free the planet for only Pantorans. Kenobi and Skywalker, who thought Cho was walking into a trap, gave the Pantoran chairman Clone Captain CT-7567, nicknamed Rex, and his squad to help Cho and the Pantoran warriors. However, Cho was heavily outnumbered and one of the Talz threw a spear in Cho's back and mortally wounded him which eventually led to his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Ruler of Pantora"}, {"tag": "p", "text": "Chi Cho was the exalted ruler of the Pantoran people and the Supreme Chairman of Pantora, the principal moon of the Pantora system, elected through democratic means. After the beginning of the Clone Wars, he petitioned the Galactic Republic for protection from the CIS, to which the Republic replied with establishing the Glid Station on the frozen world of Orto Plutonia, a Pantoran protectorate that was believed to be uninhabited."}, {"tag": "h3", "text": "Battle of Orto Plutonia"}, {"tag": "p", "text": "When Glid Station suddenly dropped out of contact in 22 BBY, the paranoid Cho assumed Separatists were staging an attack on Pantora and tagged along with the Jedi mission to investigate the case, led by Anakin Skywalker and Obi-Wan Kenobi. He also brought Pantoran Senatorial Representative Riyo Chuchi with them so that he could exert influence over the Jedi."}, {"tag": "p", "text": "When a Separatist base was discovered not too far away from Glid Station, it appeared Cho's beliefs were true. But when Anakin and Obi-Wan investigated, they found that base destroyed too. Eventually, the Jedi found a tribe of primitive Talz living in an ice canyon. The Talz were responsible for the slaughter of both bases, but the Separatists had attacked them and Glid Station got caught in the middle of the fighting. The Talz told the Jedi that they wanted peace, and the Jedi reported this back to Cho and Chuchi."}, {"tag": "p", "text": "Cho was shocked to find that Orto Plutonia was in fact already settled by lifeforms, which meant that the Pantorans couldn't claim ownership of the planet anymore. Cho didn't want to lose ownership, and refused to believe the Talz were the rightful inhabitants of the planet. He claimed them to be savages and refused to acknowledge their intelligence. Cho later went with Chuchi and the Jedi to a meeting with the Talz high council. The Talz's chieftain, Thi-Sen, said his people wanted live peacefully with the Pantorans, and politely requested that they pull their presence off Orto Plutonia. But Cho refused to even consider diplomacy, deliberately provoking the Talz. Thi-Sen once again asked him to do as he requested, saying that war would be the result if he didn't. Cho simply agreed to war, and later framed it as a local Pantoran issue so the Jedi couldn't interfere."}, {"tag": "p", "text": "Senator Chuchi was appalled by Cho actions, but she couldn't stand up to him. Instead, she contacted the Pantoran Assembly and informed them of Cho's actions. When the Assembly learned of his actions, they declared the Chairman out of order and gave Chuchi the authorization she needed to negotiate peace with the Talz."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Cho, meanwhile, led the Pantoran soldiers and clone troopers in his delegation on an attack against the Talz tribe. But the Talz viciously fought back, slaughtering Cho's forces almost to the last man while Cho was fatally wounded by a Talz spear. But the Jedi and Chuchi arrived with more clone troopers before the Talz could finish off the battered Republic forces. Cho's dying command was for Chuchi to destroy all the Talz. She refused, telling him of the Assembly's decision. Cho died seconds later, dumbfounded that his people were willing to give up Orto Plutonia peacefully and claiming he had died for them. Chuchi offered peace to the Talz, recognized their sovereignty, and pulled all Pantoran presence off of Orto Plutonia, ending hostilities. Following his death, he was succeeded by Baron Notluwiski Papanoida, who became Pantora's new Chairman."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cho had an extremely strong sense of patriotism and did not hesitate to go into battle for his planet or the Republic. This would be considered admirable; however, he was also very arrogant. A prime example would be how he looked down on any civilization he deemed lower than him, namely the Talz, calling them savages. He believed that he was fighting for his people and wished to destroy the Talz at all costs to keep Orto Plutonia under his control, refusing to even consider diplomacy with them."}, {"tag": "p", "text": "He was also quick to jump to conclusions, believing that the Separatists were responsible for the attack on the Republic base even though, as Senator Riyo Chuchi pointed out, that nothing of the attack matched up with the reports from the front lines. In addition to his views on the Talz, Cho also refused to listen to others he felt were beneath him, repeatedly ignoring advice from the Jedi & Senator Chuchi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chi Cho was voiced by Brian George, who also portrayed King Katuunko in the Star Wars: The Clone Wars episode \"Ambush.\""}, {"tag": "p", "text": "An early version of the third season episode \"Sphere of Influence\" had Cho still in power as the chairman of Pantora. He conspires with the Trade Federation to build a base in the Pantora system, though he is under duress from Trade Federation officer Sib Canay, who threatens to blockade Pantora should Cho refuse to cooperate. No explanation was given as to how Cho survived the events in \"Trespass.\" His appearance in the episode was eventually modified for the role of the Trade Federation envoy in the final version of the episode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}