{"url": "Chi_Eekway_Papanoida", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Females", "Category:Galactic Republic senators", "Category:Pantorans"], "nodes": [{"tag": "h1", "text": "Chi Eekway Papanoida"}, {"tag": "p", "text": "Chi Eekway Papanoida was a female Pantoran and a daughter of Baron Notluwiski Papanoida, who served as Supreme Chairman of Pantora. She served as senator of Pantora in the Galactic Senate at the end of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars, Pantora was placed under a blockade. This led to her being abducted by Greedo and a Gotal on orders from the Trade Federation along with her sister Che Amanwe Papanoida. Eekway was imprisoned on the Federation's flagship. There she lingered for days alone and afraid until Senator Riyo Chuchi and Jedi Padawan Ahsoka Tano came to her rescue. Papanoida then returned to the Galactic Republic's capital. She later attended the senate meetings where the blockade was lifted from her planet."}, {"tag": "p", "text": "By the year 19 BBY, Papanoida had succeeded Chuchi as senator of Pantora. Following his abduction, Supreme Chancellor Palpatine came back to a royal welcome as he was greeted by several senators; Chi Eekway was among these distinguished ambassadors. She stood by Terr Taneel and wore red robes covering her back and head."}, {"tag": "p", "text": "Eekway attended the Galaxies Opera House with her father and watched the performance. For the event, Chi dressed in a brown velvet cloak and a black floor-length dress, and she also wore moon crystals. Near the close of the Clone Wars, Eekway joined the Delegation of 2,000, a group of senators who demanded that after the war ended, Chancellor Palpatine return his emergency powers to the senate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chi Eekway Papanoida was portrayed by one of George Lucas's daughters, Katie Lucas. She was voiced in the Clone Wars by Nika Futterman."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}