{"url": "AV-7_Antivehicle_Cannon", "categories": ["Category:Legends articles", "Category:Galactic Republic vehicles", "Category:Mobile artillery", "Category:Projectile cannons", "Category:Repulsorcraft", "Category:Taim & Bak products"], "nodes": [{"tag": "h1", "text": "AV-7 Antivehicle Cannon"}, {"tag": "p", "text": "The AV-7 Antivehicle Cannon, also known as the AV-7 Mobile Cannon, the Republic Artillery Gun, the heavy cannon, or the Clone Artillery Cannon, was a self-propelled artillery unit used by the Galactic Republic during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The vehicle could be operated by one clone tank gunner in a seat on the side of the gun, and had a chamber for refilling plasma shells to the side of the lower chassis."}, {"tag": "p", "text": "The vehicle would be moved with its built in repulsorlifts until it reached a suitable firing position and then entrench itself on the ground, using four metallic feet for support."}, {"tag": "p", "text": "Its artillery shells created a fairly large blast radius, able to take out both vehicles and surrounding droids in a single shot."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Republic Artillery Guns were used during the Battle of Christophsis where they countered the Confederacy's AATs and titanic Tri-droids. The Separatists then erected a deflector shield which rendered the cannons ineffective. Anakin Skywalker and Ahsoka Tano eventually destroyed the deflector shield generator, disabling the shield and allowing four AV-7s to halt the enemy advance and help score the Republic victory."}, {"tag": "p", "text": "These cannons were also used during the Second Battle of Geonosis when Anakin Skywalker and Ahsoka Tano were attempting to infiltrate a Separatist droid factory. Many of these cannons were destroyed by the Separatist experimental super tanks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "After its appearance in the Star Wars: The Clone Wars animated film, the AV-7 antivehicle cannon appeared in October 2011 as a miniature in the Clone Wars Tactics expansion of the Star Wars PocketModel TCG collection, which was later released on November 12, 2008."}, {"tag": "p", "text": "In 2011, Hasbro produced a Clone Wars edition of the vehicle, the Republic AV-7 Mobile Cannon. The action vehicle was built to accommodate the company's 3-3/4\" action figure line of Star Wars figures. The vehicle featured a caterpillar-like tread assembly on the underside, in contrast to the in-universe units demonstrating motion via repulsorlifts."}, {"tag": "p", "text": "In LEGO Star Wars III: The Clone Wars, the AV-7 is the cannon option when playing on the Republic side in large battles, a counter to the CIS' proton cannon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}