{"url": "Chief_gunnery_officer/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Chief gunnery officers", "Category:Galactic Empire ranks"], "nodes": [{"tag": "h1", "text": "Chief gunnery officer"}, {"tag": "p", "text": "Chief gunnery officer, also known as a gunnery chief, was an assignment given on Star Destroyers and Sentinel-class landing shuttles of the Imperial Navy. The position was also on pirate and privateer ships, where the position was also known as weapons officer. In the Imperial Navy, under the gunnery captain's command, the chief gunnery officer managed the main weaponry of the Star Destroyer. On the Sentinel-class landing shuttles, they handled the laser cannons mounted on the ships' main troop compartments. For pirate ships, they were in charge of drills, supervising weapon and shield maintenance, and commanding tactical situations, and were also responsible for ship-wide security and boarding teams for privateer and other, larger vessels. During the Galactic Civil War, Lieutenant Hija, Niclara Varnillian, and Reagal Eron all served as Imperial chief gunnery officers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Chief gunnery officer, also referred to as gunnery chief, was an assignment on Star Destroyers of the Galactic Empire's Navy, which could be given to a naval lieutenant. Only one chief gunnery officer could serve on a given starship. Those assigned to the role managed the main weaponry of the vessel under the command of the gunnery captain and wore a black Imperial Navy crewman's uniform."}, {"tag": "p", "text": "The chief gunnery officer, also known as gunnery chief, was a position on Sentinel-class landing shuttles as well. They were the head gunner and part of a crew consisting of the pilot, co-pilot, and two other gunners. The gunnery chiefs handled the four laser cannons mounted on each side of the Sentinel-class landing shuttle's main troop compartment, while the other gunners handled the vessel's ion cannons, repeating blasters, and concussion missiles."}, {"tag": "p", "text": "Chief gunnery officer, or weapons officer, was also a position on pirate vessels. Such officers were responsible for drills, supervising weapon and shield maintenance, and commanding tactical situations during actions. When the pirates proceeded to boarding target ships, the chief gunnery officers would use threatening laser cannon fire to make sure their targets would quickly heel, alongside ion cannons and tractor beams to bring in prizes. On privateer and other larger ships, chief gunnery officers were also responsible for ship-wide security and boarding teams."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Lieutenant Hija"}, {"tag": "p", "text": "The Human male Lieutenant Hija served the Imperial Navy as the chief gunnery officer aboard the Imperial I-class Star Destroyer Devastator, where he managed the Star Destroyer's main weaponry. Around 7 BBY, Dark Lord of the Sith Darth Vader ordered the bombardment of the planet Falleen in order to stop a bacterial plague that was spreading from a laboratory on the planet."}, {"tag": "p", "text": "Around seven years later, during the battle of Tatooine in the Galactic Civil War, Hija, still serving aboard the Devastator, spotted an escape pod jettisoned from the captured Tantive IV, one of the Rebel Alliance's CR90 corvettes. However, his superior, Gunnery Captain Bolvan, ordered him not to fire because the Star Destroyer's gunnery sensors indicated that no lifeforms were aboard. The escape pod, in truth, contained the Rebel droids C-3PO and R2-D2, in possession of the stolen plans for the Empire's DS-1 Orbital Battle Station superweapon."}, {"tag": "h3", "text": "Other chief gunnery officers"}, {"tag": "p", "text": "The Human female Niclara Varnillian became chief gunnery officer on the Imperial I-class Star Destroyer Pulsar that same year, between the Empire's destruction of her homeworld Alderaan and the Battle of Yavin. In 3 ABY, Varnillian was on leave on the planet Ord Mantell when she recognized Alliance operatives Lieutenant Commander Anson Blazer and Lieutenant Alton Lochner. Along with Imperial soldiers, Varnillian botched her attempt to capture the pair, resulting in a firefight that led to several Imperial soldier and civilian fatalities. When Varnillian returned to the Pulsar after all but two of the Alliance operatives escaped, she was subsequently demoted for the failed mission."}, {"tag": "p", "text": "In 2 ABY, a chief gunnery officer was assigned to serve aboard one of 100 Victory-class Star Destroyers which had been refurbished with havod alloy plating, which resulted in a reddish coloration of the ships. As a result of the reddish color, the chief gunnery officer was one of many who subsequently requested transferring out of their assignments aboard the refurbished Destroyers."}, {"tag": "p", "text": "At some point between 0 ABY and 4 ABY, Reagal Eron served as the chief gunnery officer of the Star Destroyer Eradicator. Eron was happy with that assignment, and at one point recounted serving as the adjutant of Imperial Governor Isis, and witnessing bounty hunter Boba Fett collect his reward for the capture of pirate Feldrall Okor. Eron considered the chief gunnery officer assignment to be far better than serving as Governor Isis's adjutant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The position of chief gunnery officer first appeared in the 1976 novelization of the original trilogy film Star Wars: Episode IV A New Hope. Hija's scene also appeared in film itself, which saw release in 1977. In the novel, which was ghostwritten by Alan Dean Foster, Hija is referred to as one of Bolvan's chief gunnery officers, but later sources established there was only one such officer on the Devastator."}, {"tag": "p", "text": "Of note, the chief gunnery officer position also made an appearance in the \"Galaxywide NewsNets\" feature of West End Games' Star Wars Adventure Journal 10 of 1996, with the position being referred to as \"gunnery chief.\" The 1997 sourcebook Pirates & Privateers noted that the chief gunnery officer position was also known as \"weapons officer\" aboard pirate and privateer vessels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}