{"url": "Chief_of_State_(Galactic_Alliance)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Galactic Alliance Chiefs of State", "Category:Political titles"], "nodes": [{"tag": "h1", "text": "Chief of State  (Galactic Alliance)"}, {"tag": "p", "text": "Chief of State was the head of state and head of government of the Galactic Alliance. The chief of state directed both the executive and legislative—the Office of the Chief of State and the Galactic Senate, respectively—branches of government. As leader of the Galactic Senate, the chief of state owned a series of suites in the Senate Building located on the Alliance's capital world of Coruscant."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Under the Galactic Federation of Free Alliances, the Chief of State's relationship with the Galactic Alliance Senate was distanced in an attempt to create a better system of checks and balances within the government than had existed under the New Republic. The Senate's previous authority to run the government bureaucracy was removed and the Chief was given sole authority to run the day to day affairs through the Office of the Chief of State. This included the Galactic Alliance Defense Force, New Jedi Order, and other civilian agencies. At the start of the Galactic Alliance, the Chief of Staff was assisted in governing by the High Council which was composed of both non-Jedi and Jedi members. However, after the Swarm War, the Jedi removed themselves and the High Council was disbanded. In its stead, the Chief of State was advised by the Advisory Council though it served as an advisory council not a governing council."}, {"tag": "p", "text": "Under the Galactic Alliance, the term \"President\" was no longer used and instead the title \"Chief\" of \"Chief of State\" was the only title applied. The Chief of State remained the civilian Commander-in-Chief, however, the day to day affairs were left mostly to the Supreme Commander. The Chief of State was also provided with security and bodyguard services by the Coruscant Security Force."}, {"tag": "p", "text": "Though Cal Omas was elected according to New Republic law by the New Republic Senate and the Chief of State remained an elected position, the Galactic Alliance failed to have a proper election for some time after that. The Alliance, like the New Republic, did not have term limits. The first Chief, Cal Omas, served for twelve years without any elections during that time. He was removed from office in the Solo-Niathal coup which split the position of the Chief of State into two positions though this was claimed as temporary until elections could be organized. During the time of the joint Chiefs of State, both positions shared equal authority although they took direct control of the military due to the ongoing Second Galactic Civil War. After the end of the war, Natasi Daala was elected unanimously as Chief of State though it was the result of a deal between the Galactic Alliance military, the Jedi Order, and the Council of Moffs."}, {"tag": "p", "text": "Although Daala's time as Chief of State lasted only three years, her actions had severe consequences that saw the office all but dismantled. The combination of her draconian leadership and controversial actions against the Jedi Order resulted in two separate coup d'états—one led by the Jedi Council and the other by members of the Alliance Senate—that led to Daala's arrest and removal from power. In the wake of Daala's fall from grace, her authoritarian use of power had severely damaged the confidence invested in the office of Chief of State. Unwilling to pass leadership of the Galactic Alliance to any single individual, a compromise was formed between the Jedi and the Senate."}, {"tag": "p", "text": "The position of Chief of State would be indefinitely suspended and its constitutional authority would be redirected to the newly-formed Triumvirate, composed of Jedi Grand Master Saba Sebatyne, Senator Haydnat Treen and General Merratt Jaxton. To ensure that no single individual could possess direct control over the Armed Forces or the Intelligence Service, a two-thirds majority vote was required within the Triumvirate in order to make executive decisions. General Jaxton was later replaced as Triumvir by Wynn Dorvan, Natasi Daala's former Chief of Staff.\nLater, the Triumvirate ended when all Jedi, including Master Sebatyne, withdrew from the GA; so the Senate elected a temporary Chief of State, first Padnel Ovin, and after his death, Rokari Kem, possessed by Abeloth. After Abeloth was exposed and defeated, Wynn Dorvan was elected Chief of State."}, {"tag": "p", "text": "By 130 ABY, the Triumvirate was reinstated without a Jedi as a Triumvir."}, {"tag": "h2", "text": "List of Chiefs of State"}, {"tag": "h2", "text": "Elections"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}