{"url": "Childress", "categories": ["Category:Legends articles", "Category:Galactic Republic military officers", "Category:Humans", "Category:Males", "Category:Republic Army officers"], "nodes": [{"tag": "h1", "text": "Childress"}, {"tag": "p", "text": "Childress was a male Human who served in the Republic Military during the Cold War with the Sith Empire. Stationed on Taris, Captain Childress was head of security at Waypoint Station Aurek."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Chidlress rose to the rank of Captain in the Republic Military by the time of the Cold War with the Sith Empire. During the Cold War, he was stationed on the planet Taris as part of the Taris Resettlement Initiative's military protection. He worked at Waypoint Station Aurek, the Republic's primary forward base in the rakghoul-infested territory outside of the resettlement zone, where he was head of security."}, {"tag": "p", "text": "When a Republic-allied individual resolved a land claim dispute in Olaris, Childress' subordinate Private Sakal sent word to the captain that the individual would be wiling to help on another matter. Childress asked them to find a commando team he sent to the crashed Endar Spire, the Republic ship destroyed by Darth Malak before the bombardment in an effort to kill Bastila Shan. The team was escorting researchers who were attempting to recover the Spire's logs, which could prove invaluable in defending against an orbital bombardment similar to the destruction of Taris or the Sacking of Coruscant."}, {"tag": "p", "text": "The individual traveled to the wreckage of the Spire, where they aided Lieutenant Karlsu—the only survivor of Chidlress' fifth commando team—in ferrying the researchers past the pirate forces and to the ship's computers. After the individual defeated the pirates, Karlsu told them that he would report their success to the captain."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Childress was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. After Republic players have completed the Taris mission \"Reclaiming What's Ours\", Private Sakal asks them to talk to Childress at Waypoint Station Aurek. The captain gives the player the mission \"Wake of the Spire\", asking them to help the commando team inside of the Endar Spire's remains."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}