{"url": "Chiron", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Chiron"}, {"tag": "p", "text": "Chiron was a lieutenant of the Galactic Empire, stationed at the Academy for Young Imperials on Lothal. He was an enthusiastic officer who would often lead Imperial cadets in song during morning runs. Chiron took a special liking to one such cadet the Academy, Zare Leonis, believing him to be a fine example of a model officer and often tried to protect Leonis from the more officious bureaucrats within the Academy."}, {"tag": "p", "text": "He, along with Sergeant Currahee, recommended Leonis's transfer to the advanced Arkanis Academy, over the objections of Captain Piers Roddance. As the Empire tightened its grip on Lothal, he seemed to grow increasingly uneasy with the Empire's tactics, though was careful to not express open dissatisfaction, and also seemed to be aware that the Empire was spying on its own officers. Leonis appreciated Chiron's support, but sometimes felt guilty, as he was engaged in treasonous activity, working against the Empire as he tried to discover the fate of his sister, Dhara Leonis, who was a cadet herself who had been identified by the Empire as a Force-sensitive and taken as part of Project Harvester."}, {"tag": "p", "text": "Following the execution of Commandant Cumberlayne Aresko and Taskmaster Myles Grint, there was a shakeup in the ruling structure of the Academy for Young Imperials. Roddance was placed in temporary command of the Academy and Chiron was transferred to the Arkanis Academy by Grand Moff Wilhuff Tarkin to investigate a confidential matter. He wished for Chiron to investigate the Commandant's Cadets, a secret society created by the Arkanis Academy's head, Commandant Brendol Hux. There, he was reunited with Leonis who was subsequently exposed for treason."}, {"tag": "p", "text": "Chiron's end came when he was unable to break his loyalty to the Empire even when confronted with direct evidence that everything he had suspected about the Empire's corruption was true. During Zare Leonis's rescue of his sister, he came face-to-face with Dhara Leonis. Zare Leonis pleaded with him, telling him that what had happened to his sister was proof of everything he had said. Chiron, however, insisted that he surrender, adamant that he would receive a fair hearing. When Zare still refused, Chiron said that he would do his duty, but Dhara would not allow things to continue. She drew upon the power of the Force to summon chunks of rocks and metal, which buried Chiron and his accompanying stormtroopers. Before escaping, Zare closed Chiron's lifeless eyes."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Moving to Lothal"}, {"tag": "p", "text": "Chiron served as a lieutenant in the Imperial Military during the Age of the Empire. Several years before the Battle of Yavin, Chiron and another Imperial officer Sergeant Currahee transferred from the planet Marleyvane to the Outer Rim planet of Lothal where they took up position at the Academy for Young Imperials, a one-year junior academy that prepared adolescents for further training at the Empire's specialized military academies offworld. His arrival coincided with a growing rebel insurgency on Lothal."}, {"tag": "p", "text": "During his time at the Academy for Young Imperials, Chiron was regarded as an enthusiastic officer who would often lead the cadets in song during morning runs. His cheerful and approachable demeanor contrasted with the harsh and abrasive persona of Sergeant Currahee, who was feared among the cadets for her fiery temper."}, {"tag": "h3", "text": "Enter Zare Leonis"}, {"tag": "p", "text": "During the orientation period, Chiron befriended a cadet named Zare Leonis, a secret rebel sympathizer who had infiltrated the Academy to find his missing sister Dhara. Chiron's first encounter with Leonis took place when he intervened to stop a scrap between Leonis and Nazhros Oleg, a bully who had been picking on a weaker cadet named Pandak Symes. Chiron issued Oleg with two demerits before summoning Leonis for a private meeting in his office."}, {"tag": "p", "text": "While Chiron understood that Leonis had intended to protect Symes from Oleg, he explained that the Academy's orientation program was designed to instill the importance of avoiding failure among the cadets. When Leonis explained that Symes wanted to live up to parental expectations and suggested that the Empire find a place for such a \"dedicated\" cadet, Chiron regretted that this was not the Empire that they served.\nChiron then turned his attention to a different topic: Leonis' motives for joining the Academy. Having read Leonis' file, Chiron was aware that Leonis was the younger sister of Dhara, a star cadet who had allegedly run away from the Academy the previous year."}, {"tag": "p", "text": "Taking a genuine interest in Leonis' difficult family circumstances, Chiron privately expressed his doubts that a promising cadet like Dhara would have simply abandoned the Academy. Leonis admitted that he and his parents shared Chiron's doubts but placed his hopes in the Imperial authorities' efforts to rescue his sister. Chiron then made a promise to make a few inquiries into Dhara's disappearance at Imperial headquarters. While Leonis did not doubt the lieutenant's sincerity, he feared that Chiron might discover his and his girlfriend Merei Spanjaf's own secret efforts to find Dhara."}, {"tag": "p", "text": "Near the end of the orientation period, Chiron and Currahee continued guiding the cadets through their training. When Oleg complained through his helmet about having to learn ballistics, he lectured the cadet for forgetting that the speakers in his helmet had no volume setting before issuing a demerit. Chiron and Currahee were later present when the cadets embarked on a grueling field exercise which involved them being deployed from a Sentinel-class landing craft into a lake and then advancing forward on land to a prearranged rendezvous point. This exercise marked the finale of the orientation period and was designed to \"winnow the unworthy\" out of the cadet population."}, {"tag": "p", "text": "After Symes suffered a nervous breakdown during the field exercise, he decided to exit his Academy training. Following the exercise, Leonis discussed his experiences during the exercise with Chiron, who had become his mentor. While Leonis had been \"killed\" during the exercise, Chiron commended the cadet for showing initiative, encouraging teamwork, and improvising when things went wrong. He regarded these as essential hallmarks of good leadership. When Leonis queried about Symes, Chiron gently explained that a soldier could not quit under fire. Knowing that Leonis had been a grav-ball player, Chiron likened that situation to a fullback not performing his role properly during a grav-ball match."}, {"tag": "h3", "text": "Training and mentoring"}, {"tag": "p", "text": "After the orientation period, Lieutenant Chiron and Sergeant Currahee continued supervising the cadets as they embarked on a series of training assessments in the Well, a purpose-built chamber that was designed to simulate a wide variety of obstacle courses and challenges. In the meantime, Chiron used his position at the Imperial Academy to make inquiries into Dhara's disappearance at Imperial headquarters in Lothal's Capital City. However, these efforts drew the attention of Captain Piers Roddance, who visited both Leonis and Chiron to warn them to stay out of the Empire's official investigation efforts. While Chiron took it as a sign that the Empire was finally taking Dhara's case seriously, Leonis rightfully suspected that the Empire was covering up the true reason for her disappearance."}, {"tag": "p", "text": "Following a particularly bruising exercise in the Well, Leonis confided his doubts to Chiron. Leonis was concerned that the Academy training program was sending conflicting messages to the cadets. While cadets were taught the value of teamwork, the training assessments seemed to be encouraging cadets to adopt a selfish streak. Leonis cited the case of his fellow Unit Aurek member Oleg, who had not only abandoned his unit but also shoved another cadet named Uzall to win a place in the top three winners. In response, Chiron explained that the assessment phase was designed to simulate the conflicting priorities that an Imperial officer would have to face in the field. He also added that goals often changed during missions and welcomed Leonis' questions as a sign that he had the potential to become an Imperial Military officer."}, {"tag": "p", "text": "Later during the term, a young rebel named Ezra Bridger infiltrated the Imperial Academy disguised as a transfer cadet from Pretor Flats Academy named \"Dev Morgan.\" Unknown to Chiron and his colleagues, Morgan and Leonis established a secret alliance to steal a decoder from the Imperial Security Bureau Agent Kallus' office at Imperial headquarters. Morgan's rebel associates needed it to access the coordinates of an Imperial kyber crystal shipment while Leonis' girlfriend Merei needed it to hack into the Imperial data network on Lothal to assist Leonis' quest to find his sister. After learning that the Grand Inquisitor had taken an interest in Morgan and another cadet named Jai Kell, the two rebellious cadets staged a breakout. Believing that the Inquisitor was the same person who had kindapped Dhara, Leonis and Morgan were unwilling to let Kell endure the same fate. While Morgan and Kell fled into hiding, Leonis stayed behind to find his sister."}, {"tag": "p", "text": "Zare Leonis managed to hide his involvement with Morgan by pretending to open fire on the fleeing rebels' landspeeder. Following the rebel attack, the Academy for Young Imperials was placed on lockdown for several hours. During that period, Chiron was ordered to \"babysit\" Leonis, who was regarded as a hero by the Imperial authorities for taking on the rebels despite being outnumbered. The lieutenant praised Leonis for his bravery and assured him that he should not blame himself for what had happened. Chiron also accepted Leonis' story that Morgan and Kell had been traitors and that he had tried to stop them. Shortly later, Leonis was summoned for a meeting with the Academy's head Commandant Cumberlayne Aresko, Agent Kallus, and the Grand Inquisitor himself."}, {"tag": "h3", "text": "The Imperial crackdown"}, {"tag": "p", "text": "Following the rebel attack on the Imperial Academy, Leonis learned from his girlfriend Merei that Dhara had not run away. Instead, she had been kidnapped and forcibly inducted into a secret Imperial program known as Project Harvester, which was based at a secret facility connected to the Imperial Academy on the planet Arkanis. Since they had accessed the information through illicit means, Leonis did not disclose this information to Lieutenant Chiron. While he regarded Chiron as a good and trustworthy person, Leonis knew that the lieutenant was still loyal to the Empire and bound to uphold the law."}, {"tag": "p", "text": "During a routine morning run, Lieutenant Chiron and Sergeant Currahee took the cadets past a building site that had been designated as BlasTech's new weapons lab on Lothal. Chiron informed the cadets that the Emperor had chosen Lotal for another key defense facility that would open in the following spring. Later, Chiron and Currahee directed the cadets to a training exercise that was being supervised by Captain Roddance. This was a live-fire exercise that involved using decommissioned droids as \"high-priority targets.\""}, {"tag": "p", "text": "In response to the rebel attack on the Academy, the Imperial authorities began interviewing cadets to investigate any signs of disloyalty or illegal activities. Lieutenant Chiron was originally assigned to interrogate Zare Leonis and regarded the interrogation program as political nonsense that wasted valuable training time. Nonetheless, he complied with his orders and politely questioned Leonis about his involvement or knowledge of any act of treason against the Empire. Before he could finish the interview, Chiron was interrupted by Captain Roddance, who took over the interrogation. Unlike Chiron, Roddance rightfully believed that Leonis was involved in illegal activities based on circumstance evidence linking him to known rebels like Dev Morgan, Jai Kell, and Beck Ollet. However, Roddance's efforts to dig dirt on Leonis proved unsuccessful and he was forced to release him."}, {"tag": "p", "text": "Following a rebel attack on the Empire Day festivities in Capital City, Governor Arihnda Pryce launched a planetwide crackdown on crime and seditious activities. Under the orders of Captain Roddance, all field exercises were suspended and Imperial cadets were to be used to assist law enforcement operations in Capital City. Lieutenant Chiron and Sergeant Currahee assisted the crackdown by assigning different pairs of cadets to scan each grid of city blocks for illegal activities. In an effort to provoke Leonis into committing a crime, Captain Roddance arranged for him to be paired up with Oleg; knowing that the two cadets did not get on well."}, {"tag": "p", "text": "On the first day of the crackdown, Oleg used coercive tactics to bully local residents into revealing a long list of petty violations and unsubstantiated treasonous rumors within their allocated grid. While Oleg's bullying tactics won him the praise of Captain Roddance, Lieutenant Chiron expressed concerns about the cadet's heavy-handedness. He pointed out that many Lothalian citizens were still unfamiliar with the new policy of custom duties and suggested educating the public rather than issuing fines or making arrests. In response, the Captain accused Chiron of condoning evasion."}, {"tag": "p", "text": "When Chiron responded that he was merely asking Roddance to clarify to the cadets which violations were serious enough to warrant their attention, the Captain responded that every violation was important since they were an attack on the social order. When Leonis questioned the scope of the Empire's crackdown, Captain Roddance reiterated that disloyalty was a threat to the Empire; emphasizing that disloyal thoughts led to disloyal statements and disloyal actions. Captain Roddance then warned the cadets that he would be investigating their backgrounds before dismissing the assembly."}, {"tag": "h3", "text": "Protecting Leonis"}, {"tag": "p", "text": "In response to Captain Roddance's efforts to break Leonis, Chiron embarked on a plan to protect the cadet. With the support of Currahee and Commandant Aresko, the Lieutenant recommended that Leonis be transferred to the Arkanis Academy for officer training the next Fall. However, he ran into opposition from Captain Roddance. On the second day of the crackdown, Leonis was forced to participate in an operation to place the children of fugitives into \"protective custody.\" Despite his ethical unease, Leonis did his best to carry out his duty in a humane manner. Later that evening, he confided his misgivings to Chiron."}, {"tag": "p", "text": "Knowing that the Empire was spying on its own officers, Chiron continued his conversation with Leonis outside the room under the pretext of conducting a lesson on troop transport maintenance. While Chiron was personally outraged that the Empire was seizing children, he conceded that they had to comply with Agent Kallus' \"specific orders.\" He also assured Leonis that the children were being well-cared for. During their conversation, Chiron warned Leonis that Roddance was looking for every opportunity to get him expelled from the Academy. He then disclosed his ongoing efforts to get Leonis transferred to the Arkanis Academy the following autumn and hoped that the cadet would become an exemplary Imperial officer. In the meantime, he advised Leonis to \"hold on a little longer.\""}, {"tag": "p", "text": "As the crackdown escalated, Oleg and Leonis were picked to lead a stormtrooper raid on a group of smugglers operating from a warehouse in the outskirts of Capital City. When Oleg discovered that two of the smugglers were his uncles, he tried to shield them from prosecution by ordering his men to release them and to seal their contraband. In response, Leonis took charge of the situation and ordered his men to arrest the smugglers while relieving Oleg of his duties. Following the incident, the Grand Inquisitor, who was investigating Leonis' links to Morgan's rebel cell, fast-tracked Leonis' Arkanis transfer to a matter of days under the pretext of rewarding the young cadet for his loyalty to the Empire."}, {"tag": "p", "text": "Prior to Leonis' departure, Lieutenant Chiron encountered Leonis, who was corresponding with an astromech droid. Unknown to Chiron, this particular astromech droid was Chopper, a member of the crew of the Ghost and one of Morgan's rebel comrades. Chopper had passed a secret query from Ezra regarding a planned Imperial operation at the Lothal City Capitol Building. When Chiron asked what the droid wanted, Leonis lied that the droid had spotted him dropping his code cylinder. Chiron spotted black paint on Leonis' trousers and thought that the droid must have received a recent touch-up at a repair shop."}, {"tag": "p", "text": "Chiron congratulated Leonis for his successful transfer and shook hands with the cadet. He also complimented Leonis for persevering despite the strains placed by his sister Dhara's disappearance, the rebel attack on the Academy, and the recent security crackdown. Unaware of the Grand Inquisitor's investigation, he took Leonis' fast-tracked transfer to Arkanis as a sign that his colleagues had finally realized Leonis' potential. As a sign of good will to his former student, Chiron cleared Leonis' duties for the following day so that he could return home to farewell his parents. Despite departing on good terms, Leonis felt bad about having to deceive Chiron in order to fulfill his mission."}, {"tag": "h3", "text": "Assignment to Arkanis"}, {"tag": "p", "text": "Following the execution of Commandant Aresko and Taskmaster Grint under the orders of Grand Moff Wilhuff Tarkin, there was a shake-up at the Academy for Young Imperials. Captain Roddance was temporarily placed in charge of the Academy. Major Siward Cass, Governor Tarkin's aide, also assigned Lieutenant Chiron to investigate a confidential matter at the Arkanis Academy. Tarkin had heard rumors that the local Commandant Brendol Hux had created a secret society within the Arkanis Academy known as the Commandant's Cadets, which consisted of handpicked cadets. Since Hux's actions constituted a threat to the official Imperial chain of command, Cass had dispatched Chiron to investigate the matter. For this mission, Chiron was equipped with a code cylinder that gave him access to Area Null, a secretive tower in the Academy that housed several Imperial programs including Project Unity and Project Harvester."}, {"tag": "p", "text": "After landing on Arkanis, Chiron sent a message to Zare Leonis, telling the cadet to report to his new office during the first free period in the morning. After exchanging pleasantries, Chiron revealed the purpose behind his recent transfer to Arkanis. While Leonis was aware about the existence of the Commandant's Cadets, he feigned ignorance of the matter since he feared that Chiron's suspicions might jeopardize his own plans to infiltrate Area Null where he hoped to find his missing sister Dhara. Instead, Leonis asked why Grand Moff Tarkin would take an interest in events at the Arkanis Academy. Chiron replied that Commandant Hux was a man that inspired \"strong loyalties\" independent of the official Imperial chain of command. He assured Leonis that he was only there to investigate."}, {"tag": "p", "text": "Out of respect for his mentor, Leonis reluctantly agreed to assist Chiron and told him to wait a day or two. Chiron accepted Leonis' offer and praised the cadet for his reliability. When Leonis questioned Chiron about the Grand Inquisitor, the lieutenant revealed that the Inquisitor had perished during a skirmish with the Spectres. Unaware of Leonis' rebel sympathies, Chiron then reassured the Cadet that it was an isolated incident which did not pose a danger to his parents or anyone on Lothal. Shortly later, Leonis received an invitation to join the Commandant's Cadets. To pass the test, he had to kill a fellow cadet named Penn Zarang while making it look like an accident. The Cadets even supplied him with an E-11 blaster rifle that had been set to fire full-intensity bolts."}, {"tag": "p", "text": "Unwilling to murder a fellow cadet, Zare promptly informed Lieutenant Chiron who devised a plan to fake Zarang's death. Chiron vowed to stop the Commandant's Cadets and planned to cross-reference the names of the Cadets with training accidents and other suspicious incidents. As part of the plan, Zare brought Cadet Zarang two hours after lights out to the diplopod pen near the edge of the woods. To distract the Commandant's droid DeeDee, he gave the droid a special assignment that would avoid her encountering Leonis and Zarang. After rousing Penn from his sleep, Leonis led him to the diplopod pen where they were joined by Lieutenant Chiron, who was wearing a dark cloak. Under Chiron's instructions, the three Imperials dug a pit and buried a large bag containing a side of nerf. Chiron's plan was to use the rotting nerf meat to pass for Zarang's body."}, {"tag": "p", "text": "Chiron reassured Penn that he was here to protect him so that he could fulfill his ambition of becoming an Imperial officer. In the meantime, Chiron instructed Zarang to lie low until his investigation had finished. The lieutenant also promised that he would arrange for Zarang to be transferred to another Academy. Zare then reassured Penn that they could trust Chiron. After burying the rotting nerf meat, Leonis told the Commandant's Cadets that he had personally killed Zarang during the night. When the Cadets inspected the grave, they found a cadet's jacket. Before they could dig further, they were overcome by the stench of the dead nerf, which they assumed was Zarang's corpse. Having passed the test, Leonis was formally invited to join the Commandant's Cadets. Before Leonis could be formally inducted into the secret society, he was exposed as a traitor by Beck Ollet, his former classmate from Lothal. Ollet had been inducted into an Imperial rehabilitation program known as Project Unity, which involved extensive drugging and brainwashing."}, {"tag": "h3", "text": "Confronting the truth"}, {"tag": "p", "text": "Lieutenant Chiron was devastated by the news that his friend and former student, Zare Leonis, had been exposed as a traitor and rebel. He attended Leonis' trial at the ceremonial chamber within Area Null. Commandant Hux and his favored Cadets also attended the proceedings, which were presided by Colonel Julyan. During the trial, Leonis pleaded guilty to several charges including fraudulent enlistment, disobeying lawful orders, conduct unbecoming a cadet, dereliction of duty, aiding the Empire's enemies, espionage, sedition, and treason. Chiron was visibly upset when Leonis pleaded guilty to all the charges and delivered a speech condemning the wrongs committed by the Empire. However, Leonis omitted to mention the true purpose for Chiron's presence on Arkanis out of respect for his former mentor. At the end of the proceedings, Colonel Julyan formally expelled Leonis from Imperial service and sentenced him to death."}, {"tag": "p", "text": "Later that night, Chiron visited Zare Leonis' cell and asked the former cadet why he had not told him about his involvement in the rebellion. Chiron reiterated that he had done everything he could to help Leonis including finding his sister. When pressed by Leonis, Chiron acknowledged that the Empire had committed errors but insisted that they were abuses committed by a \"misguided few.\" Zare disagreed and responded that Chiron was misguided for believing that the Empire was a force for good. When Chiron offered to get Zare's sentence commuted to enrollment in Project Unity, Leonis rejected the offer since he did not want to end up in the same drugged and brainwashed state as his former friend Ollet. Chiron then managed to convince Leonis to talk with Beck in the hope of changing his mind."}, {"tag": "p", "text": "Beck visited Leonis but failed to sway the former cadet, who refused to accept the Empire's rationale for justifying atrocities like the massacre of farmers in Lothal's Westhills. Following the meeting, Chiron conceded that it was impossible to \"reason\" with Zare and asked him what he wanted for his last meal in the morning. When Zare joked that he wanted a properly prepared nerf steak brought by a pirate captain with a fast ship, Chiron politely declined the offer and asked if he could have the privilege of bring Leonis' last meal before his execution. Leonis then requested that his former friend Beck bring his last meal, which consisted of two blossoming jogan fruits."}, {"tag": "p", "text": "Unknown to Chiron, this request was merely a ploy by Zare to break out of his cell. Using the jogan fruit blossoms, he succeeded in breaking Beck's brainwashing and enlisted his support to rescue his sister Dhara. After overpowering their stormtrooper captors, Zare and Beck were joined by several other rebels including Zare's girlfriend Merei Spanjaf, her mother Jessa, and three rebels from the Lothalian rebel cell known as the Spectres. Following a gunfight in Area Null, Leonis and his rebel allies succeeded in freeing Dhara from her cell. Before they could escape the tower, Lieutenant Chiron arrived in the cell bay with four stormtroopers and cornered his former student Zare along with Dhara and Merei. Armed with a blaster, Chiron ordered Zare and his companions to surrender and pleaded with him not to force him to kill them."}, {"tag": "p", "text": "In response, Zare introduced his newly-freed sister Dhara to Chiron as evidence of one of the Empire's long list of wrongdoings. Chiron tried to reason with Leonis, telling him to drop his gun for the sake of his sister. Zare responded that the Empire that Chiron believed in was a lie that only existed in his head. Chiron was visibly distressed when he realized that Leonis was telling the truth about the Empire. However, he was unwilling to turn against the Empire that he cherished. Instead, the lieutenant promised that he would investigate every wrongdoing and see that justice was served. However, he reiterated that he would still do his duty. Before anybody could react, Dhara used her Force powers to summon down blocks of rock and metal over Chiron and his men, crushing them to death. Prior to departing, Zare knelt beside Chiron and closed his eyes out of respect for the man who had been his former friend and mentor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Chiron was a physically fit Imperial officer who enjoyed singing during the morning runs. Several cadets including Zare Leonis and Jai Kell noted that he did not tire easily. He was also known for his pleasant and approachable demeanor. He struck a friendship with Leonis and became an informal mentor to the young cadet, whom he viewed as a worthy prospective Imperial officer. Chiron did his best to address Leonis' questions about the training program at the Academy for Young Imperials. He also took a genuine interest in the plight of Leonis' missing sister Dhara and made inquiries into Imperial efforts to rescue her."}, {"tag": "p", "text": "While Chiron was loyal to the Galactic Empire, he was not completely blind to the Empire's increasingly heavy-handed policies towards the inhabitants of Lothal. On one occasion, he suggested that the Imperial authorities focus on educating Lothalians about the new taxation policies rather than fining or jailing them. On another occasion, Chiron was outraged that his colleagues had embarked on a policy of detaining the children of fugitives in order to force their parents to surrender. Despite his unease and disquiet about certain Imperial policies, Chiron still regarded the Empire as a force for good in the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lieutenant Chiron first appeared in Servants of the Empire: Rebel in the Ranks. He was named after the wise centaur Chiron, a character from the Greek mythology who trained such heroes as Heracles, Achilles, and Jason. Chiron was created early in the series as \"the good Imperial,\" a character that author Jason Fry knew early would become part of the endgame for the series. Fry also had the manner of Chiron's death in mind from the beginning of the series, but struggled with the logistics of the scene."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}