{"url": "Chirpa/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Alliance to Restore the Republic members", "Category:Bright Tree tribe chiefs", "Category:Ewoks", "Category:Males", "Category:Royalty"], "nodes": [{"tag": "h1", "text": "Chirpa"}, {"tag": "p", "text": "Chirpa was a male Ewok who served as the head of his tribe's Council of Elders in the Bright Tree Village on the forest moon of Endor. The gray-furred Chirpa carried a reptilian staff denoting his rank which carried the teeth and horns of animals he had hunted. He and his wife Ra-Lee had two daughters: Asha and Kneesaa a Jari Kintaka. Chirpa was also the brother of Bozzie and the uncle of Paploo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As a young warrior, Chirpa earned the trust of his fellow villagers during the Ewok–Dulok wars, and he later ascended to the position of Chief. During his management, Chief Chirpa was known by his sapience and severity. Beyond this, he was one of the strongest Ewok warriors, and he knew at least one magic device: Chirpa used prism pebbles to tell legends and stories for the young Ewoks."}, {"tag": "p", "text": "His chores included the training of his younger daughter, apprentice, and heiress Kneesaa a Jari Kintaka, who was appointed as the Heir Princess against the initial opposition of the most of the Council of Elders. For some time the Elders did not consent to have a female leader, but after Kneesaa led the Ewoks to victory against the Zorbian space pirates, and after other tests, Chirpa agreed to continue Kneesaa's training and saw her becoming an honorary member of the Council."}, {"tag": "p", "text": "When his daughter Kneesaa was still very young, Ra-Lee was killed by a hanadak in the forest. It was believed that Asha was killed as well until they discovered several years later that she had been raised in the woods by a family of korrinas. Chirpa was later tearfully reunited with his lost daughter."}, {"tag": "p", "text": "In 1 ABY during the Festival of Love, he traveled to Theed on Naboo on the invitation of Queen Kylantha. As he had no knowledge of the Galactic Civil War, he was welcoming to both Rebels and Imperials alike."}, {"tag": "p", "text": "A few years later, the Imperials started arriving on Endor's moon. Chirpa led a group of warriors to investigate the \"strange creatures\" (Imperial shuttles) which Chirpa said \"smelled like fire, only worse.\" The Elders debated over what to do about the invaders. Chirpa reminded them about the invaders' power and decided that the Ewoks would not fight them. But when Wicket Wystri Warrick saw an AT-ST stumble on some rocks and crash in the woods, he told Chirpa and convinced him that the Imperials could be defeated if the Ewoks built traps for them."}, {"tag": "p", "text": "By that time, Chirpa had been chief of the village for forty-two seasons. When the Rebels arrived on Endor, he went along with Logray's idea to offer the newcomers as a sacrifice to the \"golden god.\" But when he saw the powerful magic they were capable of, he realized that he had erred. He decided that the Ewoks should listen to the newcomers' story. After hearing C-3PO tell their tale, Chirpa convinced the village elders to make them honorary members of the tribe. Because the Empire's construction on the moon had disrupted the hunting cycle and had killed many trees, Chirpa decided that the Ewoks would join with their new tribe members and fight the Empire. When the time came, his warriors were courageous and skillful in the face of a superior enemy and managed to defeat them, which had fulfilled a prophecy of a successful holy war they would eventually launch to protect their way of life.[source?]"}, {"tag": "p", "text": "After the battle, Chirpa convinced Princess Leia Organa to lead a ceremony to promote Wicket to \"lead warrior.\" As a token of friendship between the Alliance and the Ewoks, Chirpa gave Leia a bracelet made of gold, a handsome gift as any metal was a precious commodity to the Ewoks. Later on, following Chirpa's death, his daughter, Princess Kneesaa, became the new chief of Bright Tree Village in a ceremony that doubled as her wedding to Wicket Warrick."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Episode VI Return of the Jedi, Chief Chirpa was played by Jane Busby. In the animated television series Ewoks, he was voiced by George Buza in the first season and Rick Cimino in the second."}, {"tag": "p", "text": "An action figure of Chief Chirpa was made in 1983 as part of Kenner's Return of the Jedi Collection and included a staff and hood."}, {"tag": "p", "text": "In the 2001 video game Star Wars: Galactic Battlegrounds Chirpa shared his game model and profile image with Simon, a character who appeared via cheat code."}, {"tag": "p", "text": "An action figure of Chief Chirpa was made in 2006 as part of Hasbro's Saga Collection in the Battle of Endor wave and included a knife, sheath, staff, and hood. One of six bonus holographic figures were also included, as was a personalized display base."}, {"tag": "p", "text": "LEGO sold a Chirpa in 2009, along with Wicket Wystri Warrick and Paploo. The figure was a simple re-print of the other Ewoks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "See also"}]}