{"url": "Chiss_Civil_War", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles in the Chiss Ascendancy", "Category:Civil wars", "Category:Conflicts involving the Chiss Ascendancy", "Category:Conflicts of the Unknown Regions"], "nodes": [{"tag": "h1", "text": "Chiss Civil War"}, {"tag": "p", "text": "The Chiss Civil War was a conflict among the Chiss, taking place at some point between 22 ABY and 29 ABY, as a result of which the number of Ruling Families in the Chiss Ascendancy went from nine to four."}, {"tag": "h2", "text": "Known history"}, {"tag": "p", "text": "According to the account given by Aristocra Chaf'orm'bintrano in 35 ABY, the aftermath of the Third Vagaari War saw the Ruling Families of the Chiss Ascencancy recruit a labor-force from the hive-minded Killik nests. In spite of extensive precautions, two of the Families became Joiners in the Colony, and three others became heavily dependent on Killik labor; a \"disagreement\" arose with the other surviving Families, who had been less compromised by the Killiks, and who allied with the Household Phalanx to remove the three Killik-dependent lineages from power."}, {"tag": "p", "text": "However, the account given by Chaf'orm'bintrano is not without its problems, and may be at least partially misinformation: Formbi himself was a member of the Chaf family, a lineage that was not among the list of four Ruling Families cited in a study produced by the University of Sanbra in the last years of the New Republic. All that can be said for sure is that the number of Ruling Families was apparently reduced substantially between 22 ABY and 29 ABY, and at the same time, the rogue Chiss warriors of the Household Phalanx previously affiliated with the Empire of the Hand appear to have integrated themselves into the Chiss Expansionary Defense Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The term \"Chiss Civil War\" is used in this article for convenience, and does not appear in Legends. The Chiss insisted that what occurred was not a civil war, and although the involvement of the Household Phalanx suggests that some level of military operations did take place, it is not clear whether the hostilities between the Ruling Families reached the level of a full-scale conflict."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}