{"url": "Chiss_Expansionary_Defense_Force", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Chiss Ascendancy military", "Category:Chiss military units"], "nodes": [{"tag": "h1", "text": "Chiss Expansionary Defense Force"}, {"tag": "p", "text": "The Chiss Expansionary Defense Force was the military branch of the Chiss Ascendancy founded by the ancient syndic Jer'Jo Cam'Co after the initial discovery of several resource-rich worlds during the Chiss' early explorations."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The alternative name Chiss Expansionary Defense Fleet appears to be simply an alternative translation from Cheunh, while the acronym CEDF seems to only be recorded in informal secondary use among non-Chiss. References to the Chiss Expansionary Fleet and Chiss Defense Fleet; however, indicate two distinct subdivisions of the CEDF: the Expansionary Fleet was in charge of frontier patrols and exploratory missions in areas around the Ascendancy, and recorded its discoveries in the Expeditionary Library on the capital world of Csilla; the Defense Fleet was charged with repelling aggressive incursions and considering long-term strategic concerns. The Defense Fleet was also noted as possessing a reconnaissance corps."}, {"tag": "p", "text": "It would seem that the high command of the Defense Fleet, known as the Defense Hierarchy, was in overall control of both divisions of the CEDF; but as well as answering to the Hierarchy, the CEDF fell under the oversight of one or more of the Ruling Families—in 37 BBY, these were the Second and Eighth Ruling Families, apparently the Nuruodo and Mitth clans. Senior officers of the CEDF were stripped of their family names and made part of the Hierarchy. Bound by a strict non-aggression policy, both the Hierarchy and the Families refused to countenance or even consider preemptive strikes against potential enemies until they attacked the Ascendancy, although Commander Mitth'raw'nuruodo of the Expansionary Fleet's Picket Force Two stretched their rules of engagement to breaking point."}, {"tag": "p", "text": "It is not entirely clear on present evidence what relationship the Colonial Phalanxes assigned to guard the colony worlds of the Ascendancy bore to the CEDF; but the evidence suggests that these constituted provincial guards under the authority of planetary House leaders, and it might be expected of them to have been distinct from the Defense Fleet's central strategic command. The CEDF also provided a role during the Chiss political decision making process as they gave the deciding vote whenever there was a deadlock between the Ruling Families over the best course of action to take during specific events."}, {"tag": "p", "text": "Standard CEDF officers wore black uniforms with patches colored to relate to their houses; members of the Hierarchy wore all-white uniforms."}, {"tag": "p", "text": "The fleet used starfighter carriers, armored personnel carriers, heavy gunboats, and assault cruisers. Chiss Star Destroyers, and AirStraekers were used by the force, later on, Nssis-class Clawcraft would be used later on, since they would inherit them from Empire of the Hand. Transports included drop ships and assault shuttles."}, {"tag": "p", "text": "Chiss commandos wore camouflaged color-shifting, fractal-pattern armor that allowed them to sneak across battlefields with ease, and carried demolition satchels and charric guns. They were deployed on specialist tasks such as the placement of vape charges on selected locations. Other variants include sharpshooters, pilots, and soldiers."}, {"tag": "p", "text": "The force also made use of superweapons, such as the biological doomsday weapon; the parasite bomb. They also used radiation bombs as well. Chiss Defoliator was developed as well."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Cold War, Ath'en'terro was a member of the CEDF."}, {"tag": "p", "text": "Little more was recorded of the CEDF until around the time of the Yuuzhan Vong War, and even then, the Chiss forces most prominently involved were not CEDF line units. The consular ship Chaf Envoy, involved in the recovery of Outbound Flight in 22 ABY, was technically under the authority of the Chaf family, while the Clawcraft deployed alongside New Republic forces from 26 ABY onwards were part of Mitth'raw'nuruodo's rogue Household Phalanx, which had evolved under the aegis of the Empire of the Hand."}, {"tag": "p", "text": "In around 29 ABY, radical—and still partially obscure—changes occurred in the CEDF and Chiss society in general. Imperial General Soontir Fel, a Human, apparently led Household Phalanx forces to intervene in a disagreement among the Ruling Families, as a result of which he became the CEDF's Assistant Syndic, while another Human, Peita Aabe, was appointed Chief Navigator."}, {"tag": "p", "text": "By 35 ABY, frontier tensions between the Chiss and the neighboring Killik Colony were reaching fever pitch, leading to the first skirmishes of the Swarm War. It was in this conflict that CEDF forces were first seen operating on a large scale by outsiders: the largest concentration of force observed during the war was the deployment of nearly fifty Chiss Star Destroyers, plus hundreds of smaller capital ships, during the assault on Tenupe in 36 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}