{"url": "AZI-345211896246498721347/Legends", "categories": ["Category:Legends articles", "Category:Medical droids"], "nodes": [{"tag": "h1", "text": "AZI-345211896246498721347"}, {"tag": "p", "text": "AZI-345211896246498721347, also known as AZI-3 by clone trooper Fives, was a medical droid in the service of the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "AZI-3 was stationed in Tipoca City, on the planet Kamino, helping the medical staff there. When ARC Trooper CT-5555, nicknamed \"Fives,\" was brought in following Tup's attack on a Jedi General, he helped in overseeing his treatment and evaluation. AZI-3 told the Kaminoan doctors that the best way to get to the source of Tup's problem would be to do a complete Level 5 atomic brain scan on him, but they claimed they did not think it would be helpful, though in truth they knew that the Level 5 brain scan would reveal the inhibitor chip in Tup's brain. The inhibitor chip, in truth, was implanted into the Clone Army at the behest of Darth Tyranus, who they thought was a Jedi."}, {"tag": "p", "text": "Later, Fives convinced AZI-3 to do the biopsy and disobey orders given by the doctors. When they found the inhibitor chip (which they thought was a tumor), they removed it, and Tup ended up dying. But this led Fives to recognize that all clone troopers had this same tumor, so, despite the risk, he ordered AZI-3 to remove his own tumor. AZI-3 successfully did so, and both realized that the cause of Tup's madness was his chip degrading. They then began an investigation (faking their departure from the city) when they were finally cornered. Fives then told Jedi Master Shaak Ti all he knew about the inhibitor chip, with the Kaminoan retorting that it was a safeguard to keep the clones sane. Shaak Ti decided to take Fives back to Coruscant to get a better grasp on what the chip was and its purpose. AZI-3 remained on Kamino."}, {"tag": "h2", "text": "Appearances"}]}