{"url": "Chom_Frey_Kaa", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Criminals", "Category:Galactic Republic senators", "Category:Males", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Chom Frey Kaa"}, {"tag": "p", "text": "Chom Frey Kaa was a corpulent white-skinned male Twi'lek senator who represented the Twi'leks of the Gaulus sector in the Galactic Republic Senate. Along with Orn Free Taa and Connus Trell, Kaa was a loud voice in the Senate, but was ultimately brought up on corruption charges. Like Senator Taa, Kaa had four headtails instead of the more common two. In addition, he had three fingers and a thumb instead of the common four fingers and thumb of most other Twi'leks."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Chom Frey Kaa was a large Twi'lek who was appointed co-Senator of the Gaulus sector, serving alongside Orn Free Taa and Connus Trell in the Galactic Republic Senate on Coruscant.[source?] During his tenure, Kaa became involved as the financial backer of a major glitteryll project on Ryloth, a practice that was illegal under Republic law. Approaching Pol Secura of Ryloth's Clan Council, Kaa knew of Secura's past as a smuggler and hoped to enter into a partnership: Kaa would produce the drugs and Secura would traffic them."}, {"tag": "p", "text": "During his administration, Kaa's involvement in the glitteryll project allowed the program to capture Jedi Knight Quinlan Vos and Padawan Aayla Secura, drug them, and scattered them across the stars. Amnesic Vos was taken by the Devaronian smuggler Vilmarh Grahrk to Nar Shaddaa, while Kaa placed a bounty on the Jedi's head, interested in seeing who could kill or capture the Jedi first. In a series of double-crosses, Grahrk led Vos to Ryloth where the angry Jedi confronted Pol Secura about his involvement in the scandal. Torturing the Twi'lek into confessing Kaa's plot, Vos and Grahrk headed to Coruscant to bring the corpulent Twi'lek Senator to justice."}, {"tag": "p", "text": "En route to the capital, Vos was contacted by Master of the Jedi Order Mace Windu who ordered his immediate return to the Jedi Temple for retraining. Vos refused Windu's command and instead continued his search for the Senator. No sooner had they landed on Coruscant, Grahrk shot Vos in the back with a stun bolt and delivered him to Senator Kaa. As Kaa gloated over his prisoner, confirming his role in the illegal glitteryll production, Grahrk betrayed his employer and returned Vos' lightsaber to him. Free and angered by Kaa's treatment, Vos prepared to execute the frightened Senator but was stopped by Master Windu. Windu had arranged for a recording device to be installed in Grahrk's droid, securing the taped confession and spelling the end of Kaa's administration. Placing the Senator under arrest, Windu escorted Kaa out of the facility to be tried by the Supreme Court."}, {"tag": "p", "text": "Unbeknownst to those involved, Kaa was considered a pawn in a grand plan by the mysterious and hidden Dark Lord of the Sith Darth Sidious. Sidious, who had interest in turning Jedi Vos to the dark side of the Force, considered Kaa to be well worth the sacrifice of bringing the Kiffar Jedi one step closer to falling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}