{"url": "Choose_Your_Destiny:_A_Podracer_Mission", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Book stubs", "Category:Incomplete lists", "Category:Star Wars: Choose Your Destiny audiobooks"], "nodes": [{"tag": "h1", "text": "Choose Your Destiny: A Podracer Mission"}, {"tag": "p", "text": "Choose Your Destiny: A Podracer Mission is a canon audiobook written by Cavan Scott and part of the Star Wars: Choose Your Destiny series. The audiobook was released exclusively on Amazon FreeTime Unlimited in 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Some time after 32 BBY, the Boonta Eve Classic's popularity has fallen in favor of swoop dueling and air rallies. Trying to increase their popularity again, Jabba the Hutt adds twisting dune pipes and reduces the race from three to two laps, also he puts Sebulba in charge of organizing the entire race. A young pilot whose family crashed on Tatooine and can't afford to make repairs to their ship to leave, joins the race at the suggestion of Saleen, an Er'Kit mechaninc, while preparing the podracer the pilot convinces Saleen to use a dangerous force field generator to ensure a victory in the race. The day of the race, Sebulba unsuccessfully tries to dissuade the pilot from competing in the race. Among the competitors are Haza, a Jawa, and AC-184, one of the first droids to compete. During the race, the pilot ends up rescuing Haza from krayt dragons and realizes that Sebulba had sabotaged the entire race by placing mines, disabling podracers and placing a restraining bolt on AC-184. Leaving Haza on command of the podracer, the pilot jumps out and confronts Sebulba to stop him from sabotaging furthermore the race, during the confrontation Sebulba reveals to the pilot that Jabba had ordered him to sabotage the race to increase the interest of the race, knowing that Sebulba can't be stopped the pilot leaves and returns to Haza, who had won the race. Haza and the pilot split the reward and informs him about the sabotage. At the end the pilot and the family leave Tatooine and Haza, knowing the secret, prepares to warn other racers about the sabotage so it won't continue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}