{"url": "Chopper_(clone_trooper)", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Character stubs", "Category:Clone troopers", "Category:Members of Slick's unit"], "nodes": [{"tag": "h1", "text": "Chopper  (clone trooper)"}, {"tag": "p", "text": "\"Chopper\" was the nickname of a clone trooper that served in the Grand Army of the Republic during the Clone Wars. A soldier in Clone Sergeant \"Slick's\" squad, Chopper and his fellow troopers were part of the Jedi-led army sent by the Galactic Republic to defend the planet Christophsis from the Confederacy of Independent Systems. By then, Chopper had secretly begun collecting the fingers of B1-series battle droids as war trophies, which he fashioned into a necklace. To the surprise and disgust of his comrades, Chopper's breach of protocol was discovered by Clone Commander CC-2224 \"Cody\" and Clone Captain CT-7567 \"Rex\" during their hunt for a clone spy in the ranks, although Chopper was adamant that he was not a traitor."}, {"tag": "p", "text": "Slick, who was in fact the spy they were searching for, tried to pin his treachery on Chopper. When Chopper pushed back, the sergeant inadvertently revealed his knowledge of restricted information and attempted to escape from the Republic base. Ultimately, the clone turncoat was captured and placed under arrest by his own squad, but not before he succeeded in sabotaging much of the Republic's military supplies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Like all clone troopers, the trooper nicknamed \"Chopper\" was cloned on the planet Kamino from the genetic material of the bounty hunter Jango Fett, who served as the clone template for the entire Grand Army of the Republic. During the Clone Wars, the Galactic Republic deployed a Jedi-led army to the planet Christophsis in 22 BBY, with orders to defend the world from the droid army of the Confederacy of Independent Systems. Attached to the squad led by Clone Sergeant \"Slick,\" Chopper was among the troops that the Republic sent to the Christophsian homeworld. At that point, Chopper's contempt for battle droids led him to collect the fingers of B1s as war trophies from the battlefield, which he then fashioned into a necklace. Chopper kept his actions secret, however, as his conduct was a breach of protocol in the Republic Military."}, {"tag": "p", "text": "Chopper's squad was with Jedi General Obi-Wan Kenobi and Clone Commander CC-2224 \"Cody\" when they attempted to ambush the Separatist Droid Army. To their surprise, the droids ambushed them instead, forcing the clones to retreat to their base on Christophsis. As they withdrew from the battle, one of Chopper's squadmates, trooper \"Gus\" managed to tear off the head of a T-series tactical droid. An analysis of the droid's memory files revealed that the Separatists were warned about the Republic's strategy, leading the clone officers to suspect that a clone was, in fact, spying for the enemy. While the generals Kenobi and Anakin Skywalker investigated behind enemy lines, Commander Cody searched for the spy at the base with the aid of Clone Captain CT-7567 \"Rex.\""}, {"tag": "p", "text": "Their investigation led them to the barracks that housed Sergeant Slick's squad. Rex and Cody interrogated the clones individually, each one providing an alibi to confirm their allegiance to the Republic. When they came to Chopper, the clone hid his droid finger necklace and claimed he immediately went to the mess hall after returning to the base. His alibi was flawed, however, as \"Sketch\" revealed that Chopper had not joined them in the mess hall until much later. As a result, he was forced to reveal his war trophy to the clone officers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}