{"url": "Chopper_and_Friends", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "Chopper and Friends"}, {"tag": "p", "text": "\"Chopper and Friends\" is the ninth episode of the animated micro-series Star Wars: Forces of Destiny' second season. It was released on May 4, 2018."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Hera is surprised to discover that Chopper has crewed the Ghost with two Ewoks who prove their mettle and help take down some stray TIEs over Endor."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the Battle of Endor, Chopper is playing spears with two Ewoks including Kneesaa outside the Ghost when General Hera Syndulla tells him to stop it because com-scan has picked up some leftover Imperial TIE fighters that are headed for the Ewok village. She tells them they have to get to the Ghost. Chopper protests but Hera tells him that it is just you and me. The Ewoks speak to Chopper before he and Hera depart aboard the Ghost."}, {"tag": "p", "text": "The Ghost flies in to the skies above Endor and runs into several TIE fighters. Hera says they are running into Point 0.75. A dogfight ensues and Hera tells Chopper to get to the guns. The droid responds that they have a new crew and introduces Hera to Kneesaa and her companion. Hera is upset because she thinks that the Ewoks are only good at fighting on the ground. Hera reluctantly tells Chopper and the Ewoks to get to it."}, {"tag": "p", "text": "As the two TIEs exchange fire with the Ghost, Kneesaa climbs to the top gun turret while Chopper and the other Ewok man the rear gun turrets. Despite being too short, Kneesaa manages to fire several shots. She shoots at one of the TIE fighters, causing it to collide with the second one. Following the dogfight, Hera compliments Chopper's crew for doing a good job and says \"let's take them home.\""}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}