{"url": "Chorin", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire planets", "Category:Mining planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Chorin"}, {"tag": "p", "text": "Chorin was a rocky mining planet inhabited by humans. Its population, including the Valance family, was enslaved as miners for generations before being liberated by the Galactic Empire. After the mines were depleted, the Empire abandoned the planet, leaving its population defenseless against the raiders that would eventually form the criminal syndicate known as the Hidden Hand."}, {"tag": "p", "text": "At some point prior to the Battle of Hoth in 3 ABY, during a visit to Chorin, Sith Lord Darth Vader offered the cyborg bounty hunter Beilert Valance, a native of the planet whom he had captured, a position in the Empire. Shortly after the visit, the residents of Valance's village on Chorin left their home and migrated to a rebel base on the world Lowik following a deal between Valance and the rebels Gita and Aeliar. Vader later sent a detachment of stormtroopers to the settlement to slaughter its people, but the troopers discovered that the village had been abandoned upon arriving."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A mining planet, Chorin had a breathable atmosphere. Its surface was rocky, with hills and mountains forming the landscape. When viewed from space, Chorin had a blue surface."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Slavery and liberation"}, {"tag": "p", "text": "For generations, the enslaved humans of Chorin, which included the Valance family, mined the hills of the planet until they were liberated by the Galactic Empire during its reign. The Empire maintained its presence on the planet with multiple starships, including Imperial II-class Star Destroyers, class four container transports, and Alpha-3 Nimbus-class V-wing starfighters. As a free population, the people began mining the planet for profit."}, {"tag": "p", "text": "Beilert Valance, who had been a miner since childhood, departed his village via an Imperial transport ship after reaching adulthood in order to become a pilot in the Imperial Starfighter Corps by 13 BBY. The Empire later abandoned the planet after the mines were depleted, leaving Chorin's population vulnerable to raiders, who attacked the village on at least one occasion. Without the Empire's protection, many of Chorin's inhabitants were killed despite attempts to defend themselves."}, {"tag": "h3", "text": "Abandoned by the Empire"}, {"tag": "p", "text": "After being discharged from the Empire and receiving extensive cybernetics, Valance returned to Chorin only to discover that his village was left in ruins. He found the people of his village by a bonfire and learned about the cause of his home's destruction from Yuralla Vega, one of the village's natives whom Valance had been close to during his life as a miner. Determined to hunt down the raiders, Valance left the village in pursuit of them and managed to locate the mountain where the raiders resided. However, he found that they had already left the area—the raiders had gone on to form the Hidden Hand criminal syndicate after departing the planet. Following his failure to locate the raiders, Valance left Chorin and started a career in bounty hunting. At some point prior to embarking on a job, Valance contacted a droid stationed at Receiver Station 356-39 on Chorin and attempted to speak with Vega while she and a group of miners were hauling supplies from the mines. However, he closed the transmission line just before communication was established between the two."}, {"tag": "p", "text": "At some point prior to the Battle of Hoth in 3 ABY, Valance and Dark Lord of the Sith Darth Vader traveled to Chorin after the bounty hunter's capture following a skirmish on the world Heva. Upon arriving on Chorin's surface, Vader invited Valance back to the Empire after showing him that his people at the village were temporarily safe from harm. Sometime afterward, the population of the village on Chorin migrated to a rebel base located on the world Lowik as part of a deal between Valance and Rebel Alliance members Aeliar and Gita, with the bounty hunter promising a supply of weapons in return. When Valance abandoned Vader and his forces at the Hidden Hand's main outpost after dealing with the syndicate's leader, the Sith Lord sent a detachment of stormtroopers to massacre the population at Valance's home. Upon arriving, however, the troopers discovered that the village had been completely abandoned."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Chorin was inhabited by humans, including the Valance family, who were enslaved as miners for many generations, until their liberation by the Galactic Empire. Following a deal between Valance and a group of rebels, the population of Valance's village departed their home."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The planet's hills housed mines which were excavated for resources, which required wearing a breath mask and a pair of goggles beforehand. A village was located near the hills, but it was ravaged during an attack by raiders and later abandoned when the population migrated to Lowik. A makeshift graveyard for the victims of the attack was also created near the village, with each miner's helmet laid over the graves. Receiver Station 356-39, a communication station located near the mines, could be used to communicate with individuals off-world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Chorin first appeared in a flashback scene in the second issue of the 2019 comic-book miniseries Star Wars: Target Vader, written by Robbie Thompson, illustrated by Stefano Landini, and published by Marvel Comics on August 14, 2019. The world was first identified in the fifth issue, which was also written by Thompson and published on November 13, 2019."}, {"tag": "p", "text": "In the Star Wars Legends continuity, the homeworld of Beilert Valance was the mining world Shinbone, which was first featured in \"The Hunt Within: Valance's Tale: Part 1,\" a 2004 scenario for the Star Wars Miniatures roleplaying game by Jason Fry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}