{"url": "Choster", "categories": ["Category:Legends articles", "Category:Males", "Category:Rutian Twi'leks"], "nodes": [{"tag": "h1", "text": "Choster"}, {"tag": "p", "text": "Choster was a Twi'lek and retired engineer who often frequented the cantina in Nym's Stronghold."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In his youth Choster tried to make a fortune by forging famous holopaintings. He wasn't very successful, but learned basic facts about the color spectrum. Years later he got stranded on Tatooine in the Outer Rim Territories, where he was befriended by a drunk Rodian. From him, Choster learned a lot of Tatooine-themed jokes that he later transferred into the AI of a security system he created."}, {"tag": "p", "text": "Choster was originally hired by the Sulfur Lake Pirates on Lok. The pirates realized they had foolishly named themselves after the lake they called their \"hidden lair.\" In light of this, Choster was tasked with boosting their defenses around the base, after numerous enemies had deduced their location. After Choster established the security systems, the pirates decided it would be easier or safer to merely kill him, rather than pay him."}, {"tag": "p", "text": "Choster barely escaped, and was forced to change his name and find an Image Designer to change his appearance. After his escape, he fled to Nym's Stronghold, where he found solace in passing his time at the local cantina. Eventually, a spacer working for Nym sought out Choster, asking him for information concerning the lair's defenses. Choster gladly helped out the spacer, by providing him with essential information regarding how to bypass the security system."}, {"tag": "p", "text": "Eventually, the spacer attempted to broker a peace between the Sulfur Lake Pirates and Nym. The pirates agreed, only under the condition that they hand over Choster. The pirates threatened that if the spacer and Nym did not hand over Choster, they would kill his sister Sheeli instead, who they had in captivity. After a fierce battle between the spacer and the Sulfur Lake Pirates, it was eventually agreed that Choster's sister could be released, and Choster himself would not need to be handed over. However, a peace between the two faction's would not occur any time soon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Choster is a Non-Player Character (NPC) in the MMORPG Star Wars Galaxies. In the game, players are required to speak to Choster to help complete the \"Nym's Theme Park\" questline. Choster's species used to be randomly generated, but with the Nym's Themepark revamp, he was appearance was permanently set to be that of a male Rutian Twi'lek."}, {"tag": "h2", "text": "Appearances"}]}