{"url": "Chosen_One", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Deities", "Category:Jedi culture", "Category:Prophecies"], "nodes": [{"tag": "h1", "text": "Chosen One"}, {"tag": "p", "text": "The Chosen One was the central figure in the Jedi prophecy that foretold the coming of the one destined to bring balance to the Force by destroying the Sith. The Chosen One was born during the era of the Galactic Republic; Anakin Skywalker, the son of Shmi Skywalker, was exceptionally strong with the Force, possessing an unprecedented level of twenty-thousand midi-chlorians in his blood. As a result, Skywalker had the potential to become the most powerful Jedi in galactic history. The Dark Lord of the Sith Darth Sidious believed that Skywalker would eventually surpass both himself and Grand Master Yoda. The Father, one of the three Mortis gods, would seek to recruit Skywalker as his successor, believing that only the Chosen One had the strength to maintain the balance between his children, the Son and the Daughter in the realm of Mortis."}, {"tag": "p", "text": "Discovered by Jedi Master Qui-Gon Jinn in 32 BBY, Skywalker joined the Jedi Order and ascended to the rank of Jedi Knight following his apprenticeship under Obi-Wan Kenobi. During the Clone Wars, however, Skywalker turned to the dark side of the Force and became the Sith Lord Darth Vader in 19 BBY. He then participated in the systematic purge that rendered the Jedi virtually extinct. With the Galactic Empire rising to dominate the galaxy, Kenobi endeavored to train Vader's offspring, Luke Skywalker, believing the prophecy would be fulfilled by the son instead of the father. However, Luke believed that his father could be turned back to the light side of the Force. During the Battle of Endor in 4 ABY, Vader sacrificed himself by destroying his Sith Master in order to save his son. The deaths of the last two Sith Lords fulfilled the Jedi prophecy, restoring balance to the Force. With his destiny complete, the Chosen One passed into the Force as Anakin Skywalker."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "An ancient Jedi prophecy, made by an ancient Jedi mystic and recorded on a holocron, foretold that the Chosen One would restore balance to the Force by destroying the Sith. Although the Jedi Order had long spoken of balance in the Force, there was no consensus on what that meant for the galaxy. Some people thought that the light side of the Force and the dark side of the Force had to be equal to each other in order to create balance, while others believed that the light could be the Force in its natural state, making the dark side the cause of imbalance."}, {"tag": "p", "text": "The Sith were all but destroyed by themselves, leading the Jedi Order to believe that their ancient rivals no longer posed a threat to the galaxy. Unbeknownst to the Jedi, the Sith Lord Darth Bane survived the ancient Sith's destruction and ultimately chose to pass his knowledge to a single apprentice, Darth Zannah, thereby forming the Rule of Two that would limit the Sith ranks to a Sith Master and an Sith apprentice for the next thousand years."}, {"tag": "p", "text": "Apart from the Jedi prophecy, the legend of the Chosen One was connected to three ancient Force wielders—\"the Ones\" known as the Father, the Son, and the Daughter—who resided in the ethereal realm of Mortis. The Father maintained balance between the Daughter and the Son, who embodied the light side and the dark side of the Force, respectively. The Father sought to recruit the Chosen One as his successor, believing that only he would have the power to preserve the balance on Mortis in the event of the Father's death."}, {"tag": "h3", "text": "The rise and fall of Anakin Skywalker"}, {"tag": "h4", "text": "Qui-Gon Jinn's discovery"}, {"tag": "p", "text": "Forty-one years before the Battle of Yavin, Shmi Skywalker gave birth to a son named Anakin Skywalker. Though she could not explain it, there was no father involved in her child's conception. In the first decade of young Skywalker's life, both he and his mother lived in slavery on the Outer Rim world of Tatooine. Originally the property of Gardulla Besadii the Elder, the Skywalkers traded owners after the Hutt lost them in a Podracing bet with the Toydarian junk dealer Watto. During his service to Watto, Skywalker befriended Jedi Master Qui-Gon Jinn, who was known for his fascination with prophecies."}, {"tag": "p", "text": "Jinn, having gauged Skywalker's inherent strength in the Force with his own observations, had an analysis made of the boy's exact potential through a blood test. The results confirmed that Skywalker had an unprecedented quantity of midi-chlorians in his cells; his exact count remained unknown as the readings were off the chart. However, the test did confirm that Skywalker had over twenty thousand midi-chlorians, at least, exceeding the count of every Jedi including Grand Master Yoda. In addition, the secret of Skywalker's miraculous birth was revealed to Jinn by Shmi."}, {"tag": "p", "text": "Faced with such revelations, Jinn came to the conclusion that Skywalker was in fact a vergence in the Force—the Chosen One destined to bring ultimate balance. As a result, Jinn brought the now former slave with him to the Jedi Temple on Coruscant where he presented his findings to the Jedi High Council. Following a series of initial tests and questioning, the Council declined to authorize Skywalker's training due to his age and the fear within him. Despite the Council's judgment, Jinn remained adamant in his belief that Skywalker was the one foretold in the prophecy. After sustaining a fatal wound during the Battle of Naboo, Jinn implored his Padawan, Obi-Wan Kenobi, to become Skywalker's mentor. With Jinn's death, the Council reversed its position and confirmed Skywalker's new status as a member of the Jedi Order in 32 BBY. While attending Jinn's funeral, Anakin hoped that, with Kenobi's help, he would prove that he was truly the Chosen One, just like Jinn earnestly believed."}, {"tag": "h4", "text": "Path of the Jedi"}, {"tag": "p", "text": "As Skywalker ascended the Jedi ranks, the Jedi Council observed his progress with a degree of concern. While the Padawan possessed exceptional skills, as acknowledged by Mace Windu, Skywalker's own Master noted that his apprentice had grown arrogant because of his advanced abilities. Although Windu himself remained skeptical about Skywalker's status as the Chosen One, he affirmed his belief in the prophecy, stating that—if it was true—only Kenobi's apprentice could bring the Force back into balance."}, {"tag": "p", "text": "Skywalker became a Jedi General in the Grand Army of the Republic after the Clone Wars began in 22 BBY,, having achieved the rank of Jedi Knight by the time of the Battle of Christophsis. During the war, Skywalker, Kenobi and Padawan Ahsoka Tano were lured to Mortis by the Ones. The Father sought to gauge Skywalker's strength in the Force, ultimately to determine if he really was the Chosen One, and the Son was likewise invested in discovering the Jedi Knight's true potential. Skywalker dismissed the Chosen One as a myth; nevertheless, his ability to force the Father's children into submission convinced the patriarch that Skywalker was indeed the one destined to bring balance to the Force, as only the Chosen One could tame the Son and the Daughter."}, {"tag": "p", "text": "With his stewardship nearing its end, the Father entreated Skywalker to succeed him in maintaining the balance on Mortis. Skywalker declined the offer, however, and the Father warned him that his selfishness would have repercussions affecting the entire galaxy. The Son set his own plan in motion by abducting Tano, forcing Skywaker to delay his departure in order to rescue his apprentice. Like the Father, the Son was certain that Skywalker was the Chosen One. Trapped in the realm of Mortis by his Father, the Son endeavored to turn the Chosen One to the dark side of the Force, thereby allowing him to escape into the greater galaxy. Skywalker refused under the false impression that the Son wanted him to become a Sith, to which the Son proclaimed that they would destroy the Sith as well as the Jedi."}, {"tag": "p", "text": "The Son succeeded in turning Skywalker by revealing the Jedi Knight's fate as a Dark Lord of the Sith through a series of Force visions, which compelled Skywalker to join the Son in the hope of altering the future. Their plan was undone, however, when the Father erased Skywalker's knowledge of the future. Following the destruction of the Ones, Skywalker returned to the galaxy alongside Kenobi and Tano, where they discovered that no time had passed in their absence."}, {"tag": "h4", "text": "Fall of the Chosen One"}, {"tag": "p", "text": "During the final days of the Clone Wars, Skywalker was caught in the middle of an increasingly strained relationship between the Jedi High Council and Supreme Chancellor Sheev Palpatine, leader of the Senate of the Galactic Republic. His friendship with the chancellor, as well as his appointment to the High Council's ranks by Palpatine's request, caused the Jedi elders to become more wary of Skywalker. Kenobi's faith did not waver as he was certain that Skywalker was the Chosen One whose destiny was to bring balance to the Force by destroying the Sith. Neither Windu nor Yoda shared his conviction, however, and the Grand Master began to doubt the Jedi's interpretation of the prophecy."}, {"tag": "p", "text": "By the end of the Clone Wars, Skywalker turned against the Jedi Order and embraced the dark side of the Force as the Sith Lord Darth Vader. Though wracked by grief over the fall of his former apprentice, Kenobi confronted Vader on Mustafar and emerged as the victor of their lightsaber duel. Kenobi exclaimed that Anakin Skywalker was the Chosen One but instead of bringing balance as foretold, he condemned the Force to darkness by joining the Sith. Having said his piece, which Vader replied with utter hatred for his former master, Kenobi left his fallen apprentice to burn on the edge of a lava bend. Vader managed to survive his grievous injuries and was retrieved by his Sith Master Darth Sidious."}, {"tag": "p", "text": "Vader's condition necessitated an extensive cybernetic reconstruction rendering him more machine than man. His damaged body was encased in a life-sustaining suit of armor. Sidious knew that Vader would be weaker than before as a result of his injuries. He therefore tested his apprentice's connection to the dark side by telling Vader that he had caused the death of his wife, Senator Padmé Amidala. The intensity of Vader's anguish and self-hatred revealed that he still possessed great power. Vader would henceforth serve as his master's right hand, enforcing the Emperor's reign across the Galactic Empire."}, {"tag": "h4", "text": "Dark times"}, {"tag": "p", "text": "With the Emperor's blessing, Darth Vader claimed Mustafar as his own and oversaw the construction of his personal residence, Fortress Vader, with the help of Darth Momin. Although Momin was long dead by the time of the Imperial Era, the ancient Sith communicated with his modern counterpart through a mask imbued with his dark essence. Having manipulated Vader into constructing the fortress as a conduit for the power of the dark side, Momin was able to open a portal in the Force which ultimately facilitated his rebirth. The two Sith Lords battled each other in a cave beneath the fortress, and Momin revealed that he knew about Vader's former persona Anakin Skywalker."}, {"tag": "p", "text": "The reborn Sith Lord was aware that the Jedi believed Skywalker to be their prophesied Chosen One, and that Vader still considered himself as such despite his fall to the dark side. Scoffing at how Vader could have been gifted with the greatest power in the galaxy, Momin derided his opponent as a broken shadow of his former self. Furthermore, Momin taunted Vader by reminding him of his late wife and how he failed to save her in spite of his potential as the Chosen One. Vader ultimately defeated Momin, resulting in the ancient Sith Lord's second death."}, {"tag": "p", "text": "Anakin Skywalker's fall from grace affected his former master's view of the prophecy. Whereas Kenobi once believed his apprentice to be the Chosen One, he became convinced that Vader was incapable of turning from the dark side. He therefore placed his hopes in Vader's son, Luke Skywalker, whom he watched over during his years in exile and isolation on Tatooine. In time, Kenobi came to wonder if maybe the prophecy had been misread and Luke was truly the Chosen One, acknowledging that Luke could determine his own destiny. When confronted by an old nemesis, the former Sith Lord Maul, Kenobi brought an end to decades of rivalry by striking down the Dathomirian. With his last breath, Maul asked Kenobi if he was protecting the Chosen One, to which the Jedi Master said he was, having come to believe that the prophecy would be fulfilled by Luke instead of Anakin. With that, Maul died believing that the victims of the Sith would be avenged."}, {"tag": "p", "text": "Luke Skywalker's instruction in the Jedi arts began during the Galactic Civil War. By then the Jedi were all but extinct as a result of the Great Jedi Purge that began with Order 66. Kenobi served as Luke's first master but was killed by Vader soon after, cutting short the younger Skywalker's apprenticeship. But in learning the secret to immortality, Kenobi was able to retain his identity in the Force after death. During the Battle of Yavin, he communed with Luke and told him to trust in the Force. Guided by Kenobi's spirit, Luke saved the Alliance to Restore the Republic by destroying the first Death Star."}, {"tag": "p", "text": "Luke's next mentor was Grand Master Yoda who, despite deeming the son as reckless and full of anger like his father, agreed to complete the Jedi hopeful's training in the ways of the Force. Despite the progress that Luke made, he chose to leave Dagobah before his training was complete. Through the Force, Luke beheld visions of the future that led him to discover that his friends were in danger. Determined to help them, he disregarded Yoda's warning that only a fully-trained Jedi could defeat the Sith. Luke's decision led to his confrontation with Vader at Cloud City, where he ultimately learned the truth of his parentage in 3 ABY."}, {"tag": "p", "text": "Vader's failure to save the Death Star caused Sidious to mock him with his title as the Chosen One. The Emperor castigated his apprentice for being the only one who survived the battle station's destruction. Sidious demeaned Vader's past as the Jedi Order's prophesied Chosen One, calling him \"the one chosen to be held responsible\" for the Empire's disastrous loss in the Yavin system. To this Vader vowed to correct his mistakes, ignoring the taunts of his master. However, Vader was punished for his actions after the Battle of Hoth, having failed to prevent his son's escape on Bespin. In addition, he failed to kill Sabé, who physically resembled the late Amidala, and ignored his master's orders to report to him on Coruscant. Sidious overpowered Vader with the Force, using his apprentice's own method of punishment to torture him. As Vader struggled in vain to resist, Sidious asked how the Chosen One could be so weak, helpless and fraught with fear when he was destined to bring the Force into balance. The Emperor wondered who chose the Chosen One, and if they could choose another. Sidious' point was that Vader was no different than a tool to be discarded when it no longer functioned."}, {"tag": "h3", "text": "Prophecy fulfilled"}, {"tag": "p", "text": "Having narrowly escaped from his dark father, Luke eventually returned to Dagobah where a dying Yoda confessed that Vader was indeed Luke's father. The revelation that Vader and Anakin were one and the same sowed conflict within Luke, as he was unwilling to kill his own father. Armed with this knowledge, he believed that a remnant of his father's former self still existed within the shell of Vader. Neither Kenobi nor Yoda shared Luke's sentiment, however. Vader was more machine than alive, according to Kenobi, who saw his one-time pupil as a being who was \"twisted and evil.\" Yoda likewise warned Luke that those who started down the path of the dark side would always be dominated by its power. Luke ultimately confronted Vader once more, as his masters told him he must, yet he remained steadfast in his belief that Vader could be redeemed. As the late Jedi Masters predicted, the Emperor used Luke's feelings to his advantage, having lured Luke to the DS-2 Death Star II Mobile Battle Station where he sought to turn the young Jedi to the dark side during the Battle of Endor in 4 ABY."}, {"tag": "p", "text": "Luke came close to striking down his father in anger, but restrained himself at the last moment. Having defeated Vader and resisted the temptation of the dark side, Luke claimed the mantle of Jedi Knight, his actions confounding the Emperor who lashed out with a barrage of Force lightning. Unable to defend himself, Luke begged his father for help while the Emperor slowly tortured him to death. The persona of Darth Vader ultimately gave way to that of his former self, Anakin Skywalker, who sacrificed his own life to save his son. Darth Sidious was destroyed, though not indefinitely, but Anakin's role as the Chosen One was fulfilled. As a result, Anakin had brought balance to the Force. In redeeming his father, under the guidance of Kenobi and Yoda, Luke was also involved in the Force's return to a state of balance."}, {"tag": "p", "text": "Accepting his fate, Anakin joined his Jedi mentors in death by becoming one with the Force. Shortly after his funeral, the Chosen One appeared before his son, standing beside the spirits of Kenobi and Yoda as the Rebels celebrated their victory on Endor."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Darth Vader's heir"}, {"tag": "p", "text": "The Jedi prophecy foretold the destruction of the Sith, but it never predicted the end of darkness. Although Anakin Skywalker brought the Force back into balance, the Jedi Order was decimated by his actions as Darth Vader, leaving Luke Skywalker as the last of the Jedi. Despite the fall of the Sith and the restoration of balance in the Force, the dark side endured as remnants of the former Galactic Empire reorganized into the First Order under Supreme Leader Snoke, a Force-sensitive being who was strong with the dark side."}, {"tag": "p", "text": "A new generation of Jedi was trained by Luke, who saw his efforts destroyed by his nephew Ben Solo's fall to the dark side of the Force. Throughout his youth, Solo struggled with the expectations of being Luke's nephew and the grandson of a prophesied Chosen One. As Luke felt, there was a balance in the Force for many years until he saw his nephew. Falling under Snoke's influence, Solo renounced his future as a Jedi and adopted the identity of Kylo Ren, becoming the Supreme Leader's apprentice and a warlord of the First Order. He also became master of the Knights of Ren,—an elite group of Force warriors that followed Snoke and the ways of the dark side. Ren saw himself as the rightful heir to the tradition embodied by his fallen grandfather; as such, he endeavored to be as strong as Vader."}, {"tag": "p", "text": "Luke disappeared soon after his nephew fell to the dark side, leaving only fragments of a map that revealed the location of his self-imposed exile. During the Cold War, Ren's mother, Princess Leia Organa, endeavored to find her brother and recruit him to fight against the First Order. Lor San Tekka, a member of the Church of the Force, provided Organa's movement, the Resistance, with the last piece of the map to Skywalker. San Tekka was a follower of the Jedi religion, despite his lack of Force-sensitivity, and believed that the Jedi were needed to maintain balance in the Force."}, {"tag": "h4", "text": "Balance preserved"}, {"tag": "p", "text": "Long after his death, Darth Sidious was revealed to have been resurrected and announced his return to a galaxy engulfed in another galactic war, this time between the First Order and the Resistance. Ren, having claimed the position of Supreme Leader by assassinating Snoke, tracked the phantom Sith Lord to the distant world of Exegol. Though he was determined to eliminate Sidious as a threat to his reign, the former Emperor unveiled a powerful military that would allow the Sith to be reborn and Ren to project First Order might across the galaxy, ruling all of it as Sidious' successor. In return, he urged Ren to kill Rey, a Jedi apprentice who was sired from Sidious' own bloodline."}, {"tag": "p", "text": "Ren, however, had grown close to Rey by virtue of their unique Force-bond. Having learned that they were each one half of a prophesied Force dyad, Ren beseeched the former scavenger to take her place by his side, believing they could kill Rey's grandfather and claim the Throne of the Sith together. But after Ren renounced the dark side, restoring the persona of Ben Solo, Sidious pressed forward by attempting to seduce Rey to the dark side. Using his new fleet to threaten Rey's friends, Sidious almost forced Rey into becoming Empress but for the intervention of Solo, who returned to Exegol to fight at Rey's side."}, {"tag": "p", "text": "However, Rey and Solo's coming together revealed their nature as a dyad to Sidious, who drained their combined life force to revitalize his broken body, making the Emperor whole once more. Remembering his own death at the hands of Solo's grandfather, Sidious seized his former apprentice's descendant through the Force before casting the last Skywalker into a dark abyss. Though Rey was weakened by the energy drain, the voices of Jedi from generations past spoke to her, urging the last Jedi to rise up against the Sith Emperor. Anakin Skywalker, the Chosen One who brought balance to the Force, also spoke to Rey, urging her to follow in his footsteps by restoring the balance."}, {"tag": "p", "text": "Empowered by the spirits of all the Jedi, Rey vanquished her dark ancestor, preventing the rebirth of the Sith to preserve Anakin's balance and sacrificing her life in the process. Climbing his way out of the abyss, Solo found Rey's lifeless body and revived her with his own Force energy. The two embraced and shared a kiss before Solo died peacefully in Rey's arms, joining his family in death as the last of the Skywalkers. Though a Palpatine by blood, Rey took the Skywalker name to honor her masters, Luke Skywalker and Leia Organa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though there was some debate that Anakin Skywalker's son, Luke Skywalker, was actually the Chosen One since he caused his father to destroy Darth Sidious, the debate was settled when George Lucas himself confirmed in an interview that Anakin, even after becoming Darth Vader, was still officially the Chosen One and not Luke. Darth Vader: Sith Lord, a canon reference title, also states explicitly that \"Anakin had fulfilled the destiny of the Chosen One.\" The reference book Star Wars: The Last Jedi: The Visual Dictionary furthermore clarifies that the Chosen One prophecy just foretold the destruction of the Sith, but not of the dark side of the Force itself, explaining the continued existence of dark side users such as Kylo Ren and Snoke."}, {"tag": "h3", "text": "Fan debate"}, {"tag": "p", "text": "With the release of the 2019 film Star Wars: Episode IX The Rise of Skywalker and the revelation that Darth Sidious returned from the dead, some fans question whether or not Anakin Skywalker did fulfill the Chosen One prophecy and brought balance to the Force or if the prophecy referred to Rey. While the prophecy predicted the end of the Sith but not of the dark side of the Force, Sidious' return demonstrates that the Sith Order wasn't technically destroyed until Rey kills Sidious with the help of all past Jedi, finally settling the ancient conflict of the Jedi and the Sith. However, in the film, Sidious did confirm his death and the Sith's destruction at Anakin's hands as he wanted the Sith to be reborn. Later, Anakin's spirit himself told Rey that he had already brought balance to the Force before and ultimately, Rey prevented the Sith's rebirth to keep the Force balanced. In The Art of Star Wars: The Rise of Skywalker, art director Rick Carter expressed his opinion that Rey was the one who fulfilled the prophecy rather than Anakin, stating that while that one would be a Skywalker, it didn't necessarily need to be one by blood."}, {"tag": "p", "text": "From an in-universe perspective, however, it can be said that Anakin Skywalker did bring balance to the Force for a while and then Rey restored it. In the 2017 film Star Wars: Episode VIII The Last Jedi, Luke Skywalker notes that there was a balance in the Force for many years until Ben Solo fell to the dark side. On the other hand, it's indeed stated in The Rise of Skywalker that Anakin brought balance to the Force at least for a time, as he does ask Rey to bring back the balance like he once did. According to Chris Terrio, in George Lucas' words, the balance of the Force means that the dark and the light sides of the Force exist together, although Lucas himself said to writers of the Star Wars: The Clone Wars TV series that to go to the dark side, an inherent element of individuals that must be overcome through discipline, was to imbalance the Force. Nevertheless, Terrio stated that Rey has achieved a balance for the current moment, and J.J. Abrams affirmed this to be the case in the feature-length documentary The Skywalker Legacy, clarifying that the balance in the Force is never permanent and has to be restored from time to time."}, {"tag": "p", "text": "The nature of the creation of the Chosen One prophecy was also briefly called into question during the prequel trilogy. The 1999 film Star Wars: Episode I The Phantom Menace claimed that the Force conceived Anakin Skywalker completely without outside influence. However, Darth Sidious heavily implied in the 2005 film Star Wars: Episode III Revenge of the Sith that Anakin may have been the result of Darth Plagueis' experiments to create life by manipulating midi-chlorians. The 2012 Star Wars Legends novel Darth Plagueis previously combined both interpretations by stating that Plagueis was indirectly responsible for Anakin's creation yet the Force conceived Anakin as a way to stop the Sith. However, this explanation is no longer regarded canonical."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}