{"url": "Chosen_One/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Deities", "Category:Jedi culture", "Category:Prophecies"], "nodes": [{"tag": "h1", "text": "Chosen One"}, {"tag": "p", "text": "The prophecy of the Chosen One was an ancient Jedi legend that foretold the coming of a powerfully Force-sensitive being who would restore balance to the Force. The prophecy was one of hundreds of obscure legends maintained by the Jedi Order, though its origins remain unknown. It was thought to have been created by the earliest Jedi philosophers, after the creation of the Galactic Republic but before the Jedi assumed an active role in it."}, {"tag": "h2", "text": "The prophecy"}, {"tag": "h3", "text": "The Jedi prophecy"}, {"tag": "p", "text": "Tionne Solusar wrote the following summary of the prophecy and its history in 40 ABY:"}, {"tag": "p", "text": "\"The Great Holocron contains many references to the prophecy of the Chosen One:"}, {"tag": "p", "text": "Records are unclear about this prophecy's exact origin, or whether the above words were the actual prophecy or a concise interpretation. Several accounts indicate that the prophecy was the subject of debate as far back as twelve hundred years ago, but it may in fact be much older.\""}, {"tag": "p", "text": "Possibly contradicting the above, or possibly reflecting the notion that the text in the Great Holocron was simply a \"concise interpretation\" rather than the actual prophecy, in 19 BBY Obi-Wan Kenobi said \"I have scanned this prophecy; it says only that a chosen one will be born and bring balance to the Force; nowhere does it say he has to be a Jedi.\""}, {"tag": "p", "text": "As the Sith were believed destroyed at the Seventh Battle of Ruusan, many Jedi began to question whether the prophecy had any meaning in the modern era. But it would later come to pass that Anakin Skywalker would fulfill the prophecy of the Chosen One, after 23 years of conspiring with Palpatine to effectively eradicate the Jedi Order in 19 BBY, as part of the Great Jedi Purge."}, {"tag": "h3", "text": "Sith interpretations"}, {"tag": "p", "text": "Of course, the Sith, too, held their own prophetic belief in a chosen one—the Sith'ari—\"a perfect being\" who would one day arise, one who was \"free of all restrictions\"—the ultimate Sith. The Sith'ari, it was said, would rise to a pinnacle of supreme power to lead the Sith, but then destroy them, only to make them stronger than ever. Many throughout Sith history saw themselves, or were viewed, as this chosen one of legend: King Adas, Darth Andeddu, Darth Revan, Darth Malak, Darth Malgus, Darth Ruin, Darth Bane, Darth Tenebrous, Darth Plagueis, and Darth Sidious."}, {"tag": "p", "text": "But it was Darth Vader who many believed finally fulfilled the prophecy of the Chosen One, bringing balance to the Force by destroying the Sith and their millennia-old legacy of death and destruction through unbridled power."}, {"tag": "h3", "text": "Interpretations by other Force-users"}, {"tag": "p", "text": "Similar prophecies existed among other galactic cultures. The Celestial group known as The Ones, for example, had such a prophecy. But theirs focused instead on a literal balance in the Force and required that the Chosen One succeed the Father once the latter had become too old to continue restraining the Son and the Daughter, the embodiments of the Dark side of the Force and the Light side of the Force, respectively, as too much of either would spell disastrous consequences for the galaxy at large."}, {"tag": "p", "text": "Even the Nightsisters of Dathomir held to an ancient prophecy concerning \"a perfect being\" who would one day arise; the prophecy was made by Allya, an exiled Dark Jedi and \"the mother of all witches,\" whose daughters became \"the first crafters of spirit-willed magicks.\" This chosen one would be \"brought into existence by the spirits\" and would \"embody the balance between the Winged Goddess and the Fanged God.\""}, {"tag": "p", "text": "The Heinsnake Cult, a separate Dark Side faction from the Order of the Sith Lords predicated on unrestrained chaos and anarchy, featured a similar interpretation of the prophecy to that of the Jedi Order. However, in their case, the prophecy entailed a black armored figure proceeding to lead the Heinsnake Cult's army to bring chaos to the galaxy, and that the figure would decapitate three Snakes, with two of them dying while the third, symbolizing chaos, would be immortal. The Heinsnake Cult believed the Imperial emissionary Darth Vader to be the armored figure, and considered both the Jedi and the Empire to be the two snakes that would die. However, this prophecy, in the end, proved false when Vader wiped out the Heinsnake Cult."}, {"tag": "h2", "text": "History of the Chosen One"}, {"tag": "p", "text": "In the waning days of the Galactic Republic, Jedi Master Qui-Gon Jinn discovered a young slave boy named Anakin Skywalker on the desert planet of Tatooine. Jinn believed the boy could be the Chosen One himself, due to his extraordinary ability with the Force—brought on by his unusually high midi-chlorian count of over twenty thousand in each cell of his body—and his apparent virgin birth by Shmi Skywalker. Jinn testified before members of the Jedi High Council in the Temple's High Council Chamber on Coruscant that the events surrounding the startling discovery of this remarkable boy constituted a \"vergence in the Force\". Darth Plagueis of the Sith also discovered the boy's existence, and was disturbed that in his Grand Experiment, he inadvertently and indirectly created the very thing that would destroy the Sith."}, {"tag": "h3", "text": "Padawan of promise"}, {"tag": "p", "text": "Despite Qui-Gon's belief of the boy's true purpose in the galaxy, the Jedi High Council was not entirely convinced, and forbade Qui-Gon from training Anakin. However, after Jinn's death on Naboo, his former Padawan, Obi-Wan Kenobi, determined to uphold Jinn's legacy and dying wish, took Anakin as his apprentice with the Council's final blessing. The fact that a Sith Lord slew Qui-Gon may have indicated to the Council that, with the Sith returned, the prophecy could still be fulfilled. The boy, arriving at the Jedi Temple on Coruscant already having been chosen by a Jedi Knight, considered himself lucky—and rightly so, for to have instantly attained that Padawan distinction, one that was, for any Jedi Initiate under normal circumstances, very hard-won indeed, was unheard of. And as Anakin progressed in his training at the Temple, and the Council witnessed the startling aptitudes and powers that seemed resident in the boy, even the wisest among them could not discount that 'the prophecy' might somehow find fruition in this remarkable Jedi stripling—for one thing was blindingly, universally apparent: all knew, including Anakin, that he was special and highly gifted. Indeed, \"not in living memory—not even among the oldest Jedi Masters—could they remember a Padawan who was as gifted as Anakin Skywalker.\" The boy, in his Temple training, could easily have advanced in half the time it had taken him (but the Masters could not specially alter his curriculum or overtly show favoritism), for he'd been, from the beginning, \"far beyond his classmates in lightsaber skills and mastery of the Force.\" Yet, in the quiet observation and assessement of Yoda—perhaps the wisest among the living Jedi sages—despite the boy's incontestable gifts, \"in matters of the heart and mind\" Anakin \"still had much to learn.\" His future was complex, difficult to discern, ever \"clouded\" in Yoda's mind."}, {"tag": "p", "text": "Skywalker's own Master knew that he must watch his Padawan's progress cautiously, with a loving and most careful eye, only too aware that Anakin's \"independent spirit\" would (as it had for both Obi-Wan and Qui-Gon Jinn) \"serve him well as a Jedi Knight in the years to come.\" But that spirit needed to be rigorously tempered with \"loyalty and self-sacrifice\" to the greater good. The many and ever-present cautions notwithstanding, Obi-Wan was convinced in his heart, in the spirit of his own Master Qui-Gon, that \"No one understood his brilliant, openhearted, complex Padawan like he did\" and he was determined to uphold Qui-Gon's legacy and dying wish for this young prodigy in the Force."}, {"tag": "p", "text": "There were forceful indications, very early on in his training, that Anakin harbored a unique destiny. For example, when senior Jedi High Council member Mace Windu confronted the 12-year-old Padawan and his Master regarding Anakin's distracted, somewhat rebellious behavior, the boy disclosed that he simply sought \"peace\" from his fears of contemplation, meditation and dreams, wherein he was required to \"look inward\", for he didn't like what he saw: there, he saw \"too much, too much […] I burn like a sun inside!\" Windu found that comment \"remarkable,\" for it testified of a powerful conduit through which the Force might work. High Council member Ki-Adi-Mundi likewise looked at the boy and saw a beacon of power. This extraordinary brightness, this overwhelming power within him that quite literally battled with the youth's ominous fears, but which also bespoke a very special destiny, was again alluded to by Anakin as he and his Master departed for one of their first missions together to the living, sentient world of Zonama Sekot: Anakin again confessed before Obi-Wan Kenobi that he didn't meditate very often because \"I get to a certain point and I just overload. It's like I'm plugging into a supernova. Something goes blooey in me. I don't like it.\" And when it came to dreams, these occurred of course in Anakin's sleep. As such, the boy \"dreaded sleep. It seemed, in his dreams, that something inside was testing him, something very strong, and it did not care whether it was loved or feared.\""}, {"tag": "h3", "text": "Dark voices"}, {"tag": "p", "text": "Although Anakin Skywalker's powers grew as the years passed (often astonishing even Obi-Wan, who knew him better than anyone) and, by age 14, he had already proven himself on several important missions, he began a slow slide towards the dark side of the Force, in part due to the increasing influence of Supreme Chancellor Palpatine, someone Anakin thought of as a sympathetic confidant and mentor. But omnipresent in the boy's mind also were dark \"voices\" that he was desperate to \"stop\"—\"the voices that doubted he'd ever be a great Jedi Knight. The voices that told him he'd abandoned his mother....\" And so, to crowd them out of his mind, even if only temporarily, Anakin turned to other activities to occupy his thinking, to stimulate his interest, and to avoid boredom, such as tinkering with droids and tech devices. And while young Skywalker was liked by other Temple students, \"he was not loved ... he had no close friends,\" something his Master lamented, and he \"grieved for Anakin's loneliness.\" (Perhaps the closest Anakin came to intimate friendship was in the relationships he had with Tru Veld and Darra Thel-Tanis, but Anakin was responsible for his loss of both—Tru by betrayal, and Darra to death—when he allowed his own pride and jealousy to destroy those friendships.)"}, {"tag": "p", "text": "Beyond these inner demons, of course, Anakin was also feeling the \"great weight\" on him \"due to the prophecy.\" Even so, with respect to the Jedi High Council—despite these complicating factors that clouded a clear vision of Anakin's future, or perhaps because of them—many of its members were still dubious that Anakin was truly the Chosen One, and Yoda himself even mused that the prophecy could have been misread, and that Anakin may not have been the one destined to bring balance to the Force. Although there was a brief time of intense aspiration when Anakin considered himself, in his young pride, to be \"First in the Force,\" and felt, in his growing arrogance, that his Master and the Jedi Council were holding him back from reaching his full potential, Skywalker himself ultimately grew to disbelieve that he was the Chosen One, and dismissed the prophecy as a myth, due perhaps to his own formidable fears. This assumption became a conviction when Skywalker indeed fell to the dark side and, as Darth Vader, was partly responsible for the fall of the Jedi Order."}, {"tag": "p", "text": "Dark premonitions of losing Anakin to the dark side began to come to Kenobi with more frequency and force after the start of the Clone Wars, when the galaxy fractured and the Republic threatened to split apart. With the tragedy that was the Battle of Geonosis, the encroaching presence of the dark side had draped like a dark curtain over the Jedi Temple: the vision of the Masters was clouded more than ever, and Kenobi felt that a great distance had developed between him and his Padawan—from even before Geonosis, since the time Anakin had gone to Tatooine and reported the death of his mother. Something had profoundly changed in Anakin during the time they were apart, before being reunited in the Petranaki arena, that made Obi-Wan feel uneasy, made him question if his love for his master Qui-Gon had blinded him to Anakin's faults for too long. Since Tatooine, not only had Anakin grown harder and more secretive, but he had also lost his boyishness: he was a man now. But he was also restless, impatient, and he no longer felt the same sense of peace from the Temple. Beginning especially after the Dark Reaper crisis,[source?] Anakin sometimes shot Kenobi looks and words laced with contempt and scorn. Arrogance and flashes of jealousy betrayed his changed character. The sense of \"dull dread\" that Kenobi now felt about his apprentice had the power to wake him from a deep sleep, but it also instilled in him a conviction that it was too late to do anything about it. Had Kenobi, in his teaching, overlooked what he should not have overlooked? Had he failed both Anakin and his master Qui-Gon? While an exemplar teacher and though he deeply cared for Anakin, Kenobi, in retrospective meditation, knew, and regretted, that he had missed many opportunities to love, encourage, and communicate effectively with his prodigious, complex Padawan, this Chosen One. But indeed, this very attachment, as Yoda pointed out to Obi-Wan in the Temple's Halls of Healing after Geonosis—attachment to Anakin, attachment to Qui-Gon—was a fault that Kenobi shared with Skywalker, and it was at the root of Anakin's complicated relationship with the mysterious prophecy. It had been a large part of the problem from the beginning: As revealed to a recovering Obi-Wan for the first time in 22 BBY, Yoda's concern over perceived attachments was the very reason why the Grand Master was so reluctant for Skywalker to become Kenobi's apprentice after Qui-Gon's death."}, {"tag": "h3", "text": "Balance and redemption"}, {"tag": "p", "text": "The destruction of the Jedi at the end of the Clone Wars plunged the galaxy into darkness, with the Dark Lords of the Sith in control. Obi-Wan Kenobi, during his confrontation with Vader on Mustafar, stated that he believed Anakin was indeed the Chosen One, but that his destiny had been altered, and the prophecy left unfulfilled."}, {"tag": "p", "text": "Yoda and Obi-Wan then looked towards the offspring of Anakin to one day overthrow the Sith, possibly hoping they would fulfill the prophecy instead.\nIt transpired, however, that the prophecy was still to be fulfilled, in an unforeseen fashion. Decades later, above the moon of Endor, Vader stood witness to a confrontation between the Dark Lord of the Sith, Palpatine, and Vader's own son, Luke Skywalker. When Palpatine began to torture the helpless Jedi with Force lightning,"}, {"tag": "p", "text": "Anakin Skywalker turned against his Sith Master in a violent attempt to save Luke's life. It was this conscious choice to rid the galaxy of the last of the Lords of the Sith that fulfilled the Prophecy of the Chosen One and brought balance to the Force. Anakin killed Sidious, but at the cost of his own life: he destroyed the Sith leadership, his Master's original body and himself."}, {"tag": "p", "text": "Having redeemed himself by embracing the Light side of the Force once again, Anakin Skywalker passed on to become a Force spirit, leaving his son Luke to promulgate the teachings of the Jedi Order, to maintain and preserve the balance that he had restored. In the end, his mentor Obi-Wan Kenobi accepted Anakin as the Chosen One of prophecy and agreed to teach him how to become one with the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Statements by George Lucas"}, {"tag": "p", "text": "George Lucas himself has stated that Anakin is the Chosen One and that the prophecy is true, although it had been misinterpreted by the entire Jedi Order."}, {"tag": "p", "text": "It is believed by some that the prophecy of the Chosen One is connected to the prophecy of the \"Son of the Suns\", as mentioned in the second draft script of what became Star Wars: Episode IV A New Hope:"}, {"tag": "p", "text": "This, however, was written in 1975, when the prophecy of the Chosen One had not been developed, and is actually referencing the actions of Luke Skywalker, not his father. This specific prophecy was eliminated in future drafts, but the name and general concept found its way back into canon, but with no reference to the Skywalker family—instead it is a more generic prophecy from Thyrsus, and a Talz title belonging to Thi-Sen."}, {"tag": "p", "text": "There has been some debate among fans about what it really means to \"bring balance to the Force\", and why \"balance\" would be associated with the complete destruction of the Sith. In an interview with Bill Moyers, Lucas compared the Sith to a cancer, saying: \"One of the themes throughout the films is that the Sith lords, when they started out thousands of years ago, embraced the dark side. They were greedy and self-centered and they all wanted to take over, so they killed each other ... there could never be any more than two of them, because if there were, they would try to get rid of the leader, which is exactly what Vader was trying to do, and that's exactly what the Emperor was trying to do. The Emperor was trying to get rid of Vader, and Vader was trying to get rid of the Emperor. And that is the antithesis of a symbiotic relationship, in which if you do that, you become cancer, and you eventually kill the host, and everything dies.\" However, elsewhere in the same interview he suggested that it was necessary to have a balance between the dark side and the light side, saying: \"the film is ultimately about the dark side and the light side, and those sides are designed around compassion and greed. And we all have those two sides of us, and that we have to make sure those two sides of us are in balance.\""}, {"tag": "p", "text": "In a 2002 interview for the Los Angeles Times, Lucas again indicated that both sides were necessary, saying: \"I wanted to have this mythological footing because I was basing the films on the idea that the Force has two sides, the good side, the evil side, and they both need to be there. Most religions are built on that, whether it's called yin and yang, God and the devil--everything is built on the push-pull tension created by two sides of the equation. Right from the very beginning, that was the key issue in 'Star Wars.'\" In a filmed meeting with writers of The Clone Wars, Lucas suggested that while people must keep the selfish and selfless in balance, falling to the dark side meant becoming out-of-balance and letting selfishness take over: \"You got the dark side, the light side, one is selfless, one is selfish, and you wanna keep them in balance. What happens when you go to the dark side is it goes out of balance and you get really selfish and you forget about everybody ... because when you get selfish you get stuff, or you want stuff, and when you want stuff and you get stuff then you are afraid somebody is going to take it away from you ... once you become afraid that somebody's going to take it away from you or you're gonna lose it, then you start to become angry, especially if you're losing it, and that anger leads to hate, and hate leads to suffering.\""}, {"tag": "h3", "text": "In-universe interpretations"}, {"tag": "p", "text": "The need for balance between the two sides was also suggested by the Mortis arc from Star Wars: The Clone Wars, where the Father specifically states that the Chosen One is supposed to tame both the Light Side and the Dark Side and is supposed to replace the Father upon his death, with the implication that too much of the Light Side would have disastrous implications for the Galaxy at large. George Lucas, in the commentary for Star Wars: The Clone Wars: The Complete Season Three, also indicated that the concept of bringing balance to the Force involved keeping the selfless (which he referred to as the light side) and the selfish (referred to by him as the dark side) in check."}, {"tag": "p", "text": "Lucas has also discussed the fulfillment of the prophecy in terms of the destruction of the Sith, saying that \"Anakin's offspring redeem him and allow him to fulfill the prophecy where he brings balance to the Force by doing away with the Sith and getting rid of evil in the universe\", and also saying of Anakin \"There is good in him. And that will bring balance to the Force. He needs to get rid of the Sith and bring balance to the Force.\""}, {"tag": "p", "text": "Several stories suggested that the Sith were unbalancing the Force by strengthening the dark side and weakening the light side for Force-users everywhere. In Attack of the Clones, Mace Windu said to Yoda that \"I think it is time we informed the Senate that our ability to use the Force has diminished.\" Also in that film, Dooku told Obi-Wan the Republic was under the control of a Sith, and Obi-Wan replied \"No, that's not possible. The Jedi would be aware of it\", to which Dooku replied \"the dark side of the Force has clouded their vision, my friend.\" In the Star Wars: The Clone Wars episode \"The Wrong Jedi\", Ahsoka Tano had been accused of a crime and said she couldn't tell who had really done it because her senses were \"clouded\", and Yoda responded \"Clouded by the dark side these things are, Padawan Tano. Dangerously clouded. But not just surrounding you. Surrounding many things, in these times.\" The Revenge of the Sith novelization referred to \"the darkening cloud upon the Force that had risen with the rebirth of the Sith\" which made it harder for Mace to see the significance of structures of people and situations he perceived in the Force, and similarly the novel Shatterpoint referred to \"the shadow that had darkened Jedi perception of the Force\". The novel Labyrinth of Evil said that \"for two hundred years before the coming of Darth Sidious the power of the dark side had been gaining strength\", and that \"many Jedis were aware of the changes, the drift toward darkness\", but that \"instead of attempting to get to the root of the coming darkness, they merely did their best to contain it. They waited for the Chosen One to be born, mistakenly believing that only he or she would be capable of restoring balance.\" Elsewhere in the novel, Yoda mentioned that Dooku had spoken much of the prophecy before leaving the order, and when Obi-Wan asked \"The prophecy of the Chosen One?\", Yoda replied \"The larger prophecy: that unfold the dark times would. Born into their midst the Chosen One is, to return balance to the Force.\""}, {"tag": "p", "text": "The novel Darth Plagueis showed that the Sith had made a number of strides in pushing the Force to the dark side. Darth Plagueis' Master had been Darth Tenebrous, and \"one hundred years earlier, Tenebrous's Twi'lek Master had opened a small rend in the fabric of the Force, allowing the dark side to be felt by the Jedi Order for the first time in more than eight hundred years.\" Plagueis planned to \"enlarge that rend into a gaping hole\", because \"the greater goal of the Sith involved toppling the Force itself ... the goal of making the Force subservient to the will of an enlightened elite.\" Plagueis theorized that the Jedi Order had been \"bathing the galaxy in the energy of the light side of the Force\", equivalent to \"fashioning a Force bubble that had prevented infiltration by the dark side, until Tenebrous's Master had succeeeded in bursting the bubble, or at least shrinking it. How the Order's actions could be thought of as balancing the Force had baffled generations of Sith, who harbored no delusions regarding the Force's ability to self-regulate.\" During the course of the novel, Plagueis and Sidious \"succeeded in willing the Force to shift and tip irrevocably to the dark side\", \"a tangible alteration that could be felt by anyone strong in the Force, and whether or not trained in the Sith or Jedi arts.\" The book further explained that the shift \"had been the outcome of months of intense meditation, during which Plagueis and Sidious had sought to challenge the Force for sovereignty and suffuse the galaxy with the power of the dark side. ... Risen out of themselves, discorporate and as a single entity, they had brought the power of their will to bear, asserting their sovereignty over the Force. No counterforce had risen against them. In what amounted to a state of rapture they knew that the Force had yielded, as if some deity had been tipped from its throne. On the fulcrum they had fashioned, the light side had dipped and the dark side had ascended.\" The novel also indicated the Jedi Order were subsequently aware of the rise of the dark side, and Dooku said that \"they have been fixated on prophecy. They await the coming of a prophesized redeemer who will bring balance to the Force and restore order.\" He also said that \"The Order interprets the prophecy to mean that the dark tide needs to be stemmed.\""}, {"tag": "p", "text": "Darth Plagueis also suggested that Plagueis had been responsible for Anakin being conceived without a father, but inadvertently. After Plagueis had gained sufficient power over midichlorians to resurrect a dead test subject and to rejuvenate himself, the book says that \"he had attempted an even more unthinkable act: to bring into being a creation of his own. Not merely the impregnation of some hapless, mindless creature, but the birth of a Forceful being.\" However, it seemed that his efforts were \"ultimately to no end\" because \"The Force grew silent, as if in flight from him\". Years later, when Palpatine learned from Dooku that Qui-Gon had discovered a boy named Anakin who had no father, and who had an \"unprecedented\" concentration of midichlorians, he thought to to himself \"Nine years old ... Conceived by the Force ... is it possible ...\"; and when Plagueis learned of this, \"he had to see this Anakin Skywalker for himself; had to sense him for himself. He had to know if the Force had struck back again, nine years earlier, by conceiving a human being to restore balance to the galaxy.\" But although Plagueis briefly glimpsed Anakin through a pair of macrobinoculars, and saw some brief confusing visions of Anakin's future through the Force, Palpatine killed him shortly afterwards so he never got the chance to examine Anakin in person."}, {"tag": "p", "text": "Book of Sith: Secrets from the Dark Side contains a section written by Plagueis discussing his theories and experiments, and in this section he discussed the idea that \"Midi-chlorians in the cells of a mother could, in theory, be persuaded to craft a zygote.\" (a zygote is the first stage of a developing embryo) He reports that he obtained a number of humanoid test subjects and that he \"succeeded in prodding the midi-chlorians to replicate themselves through asexual fission. Though in most cases, this process increased the numbers uncontrollably and killed the host. But I believe that by using this method I can trick midi-chlorians into creating a zygote\". He also speculated that \"he could have a midi-chlorian count as high as 20,000 per cell. That is more than any Jedi or Sith in recorded history. Although entirely theoretical, such an achievement is intriguing.\" The reference to the experiment being \"entirely theoretical\" suggests that Plagueis wrote this prior to the experiment described above in Darth Plagueis. In these notes he also related his planned creation to the Chosen One prophesied by the Jedi, and said \"If I induce midi-chlorians to create such a being, my handiwork would fit all the descriptions of their Chosen One. But he would be an agent of my will. How fitting that the misguided reliance on superstition could lead to a Sith creation that is hailed by the Jedi as a savior.\""}, {"tag": "p", "text": "The book The Jedi Path contains a heading for \"The Prophecy of the Chosen One\" in the table of contents, but when the reader turns to that page, the text is unreadable. In the original \"Vault Edition\" of the book the pages appear to be physically torn out with only the tattered edges with fragments of text visible; in the later standalone edition, each line of text appears to have been blacked out with something like a marker or thick pen. A note from Luke Skywalker speculates that the text was likely suppressed by the Emperor. However, if one goes to the book's Amazon page and clicks the cover to see some preview pages, in Amazon's preview the blacking-out marks appear to be dark gray while the text underneath is black, so it is actually possible to read. This may have been an accident, since the book's author Daniel Wallace mentioned in a blog post that the text had been hidden to avoid a conflict with LucasFilm's upcoming plans to do something related to the Prophecy of the Chosen One (perhaps referring to the Mortis arc in The Clone Wars, since The Jedi Path was published in September 2010 while the first episode of the Mortis arc, Overlords, appeared in January 2011). He said he wrote out the Prophecy so the fragments of text that were visible would not be \"lorem ipsum dolor sit amet\" (a term for meaningless filler text), but he did so \"knowing that it would never make it into the final version.\""}, {"tag": "p", "text": "The text visible on Amazon is also garbled; it appears that parts of sentences from different parts of Wallace's original text have been stitched together in many lines. This can be taken as further evidence that the text was not really intended to be seen, in which case it probably shouldn't be taken to have any level of canonical value. That said, it is possible in many cases to figure out where the two parts have been stitched and reconstruct sentences or paragraphs from Wallace's original text, and it may be interesting to see his original conception of this part of the book. There are several sentences in italics that would appear to be Wallace's version of the Prophecy itself:"}, {"tag": "p", "text": "The remainder of the text would appear to be commentary, attributed at the beginning to \"Grand Master Fae Coven\". One sentence reads \"The prophecy of the Chosen One is one of the oldest prophecies Mortis held in the ancient Holocrons.\" Another says that \"Master Sooloot believed the prophecy dated from the First Great Schism, and that the line about the Sith was added later to refine the original text.\" Another says \"The Chosen One would surely be a vessel of pure Force energy, someone whose father into existence by the midi-chlorians themselves.\" And there is a series of sentences that appear to discuss Fae Coven's ideas about what it means to \"balance\" the Force: \"All Jedi students should understand that fulcrum 'balance' does not mean that good accepts the existence of evil, in the way that sunlight gives rise to shadow. The dark has nothing to do with balance. Balance is a bed of green algae that feeds a school of darters whose numbers are kept in check by bog gulpers. Balance is the circle of life present in monolith systems. But beware, the greed of the dark side acts like a cancer on the living Force and the Sith are its chief agents.\" Wallace may have taken inspiration from the Bill Moyers interview mentioned earlier in comparing the dark side to a cancer, although as noted Lucas was specifically talking about the Sith in that comment, and spoke elsewhere about the need to have a balance between the dark side and the light side."}, {"tag": "h3", "text": "Fan debate"}, {"tag": "p", "text": "Some fans question whether or not the Prophecy was fulfilled, or if it had any real significance. In the EU, several dozen Sith and Dark Side practitioners were alive and well when Palpatine was temporarily killed on Endor. Palpatine himself even returned in a young cloned body a short time later, manifesting even greater power than before his downfall. The Empire managed to retain some of its power, while the Galaxy remained in conflict after conflict. Over a century later, galactic peace would be seriously threatened by a dark side collective known as the One Sith."}, {"tag": "p", "text": "The real-world explanation for the seeming conflict between the Prophecy and the continued existence of the Sith in the EU is probably that George Lucas was disregarding the EU when he wrote the Prophecy into the prequels. In a 2008 interview with Total Film magazine, Lucas commented that \"there have been novels about the events after Episode VI, which isn't at all what I would have done with it. The Star Wars story is really the tragedy of Darth Vader. That is the story. Once Vader dies, he doesn't come back to life, the Emperor doesn't get cloned and Luke doesn't get married...\""}, {"tag": "p", "text": "However, from an EU perspective one could consider the balancing of the Force in an alternate light, ending at just after Episode VI, and it could be argued that the Prophecy was fulfilled by settling the conflict between the Jedi and the Sith dating back 5,000 years. The Great Hyperspace War marked the first major conflict between the Jedi and Sith, with its aftermath resulting in continued conflict between the two sides to determine the ruler of the galaxy. Darth Revan, a key figure of the post-great hyperspace war era, was a Sith Lord who passed on his knowledge and teachings of the dark side through holocrons, that would be discovered more than a millennia later by Darth Bane. Darth Bane would go on to create the Rule of Two which over the next millennia would achieve its ultimate goals of destroying the Jedi Order as it stood, as well as complete galactic domination. With the destruction of the Sith, its Empire and the Old Order, a New Republic subsequently took its place with a New Jedi Order to replace the old. With a new galactic rule, which has yet to be fully unified under one power, and the destruction of a multi-millennia old Sith legacy, the galaxy (and by extension the force) can be interpreted as in balance with the prophecy fulfilled."}, {"tag": "p", "text": "In addition to the above, the nature of the creation of the Chosen One was also briefly called into question in Star Wars Episode III: Revenge of the Sith. Although The Phantom Menace claimed that the Force conceived Anakin completely without outside influence, Palpatine implied in Revenge of the Sith that Anakin may have been the result of Darth Plagueis' experiments to create life by manipulating Midi-chlorians. The novel Star Wars: Darth Plagueis combined both views: Although Plagueis was indirectly responsible for Anakin's creation, the Force conceived of Anakin as a way to stop Plagueis and the Sith."}, {"tag": "p", "text": "Although not the Jedi Prophecy itself, a very similar prophecy was foretold by the Heinsnake Cult in Star Wars: Darth Vader and the Ninth Assassin, where it foretold an armored individual who would end up wiping out both the Jedi Order and the Galactic Empire and in its place establish full anarchy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}