{"url": "Christian_Gossett", "categories": ["Category:Real-world articles", "Category:Comic book pencillers"], "nodes": [{"tag": "h1", "text": "Christian Gossett"}, {"tag": "p", "text": "Christian Gossett, credited as Chris Gossett within his work on Star Wars, is an artist that has worked for a number of companies, including Lucasfilm Ltd., Dark Horse Comics, and Activision. Within the Star Wars community he is well known for his work on several story arcs of the Tales of the Jedi saga, and for his artwork which appeared in several Star Wars Adventure Journals."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Christian Gossett's artwork was first published when he was nineteen years old, and in 1993 he was contracted by Lucasfilm Ltd., along with other artists, to provide the artwork for the first line of Tales of the Jedi comics. Following this, Gossett was again contracted to work on the fourth TotJ story arc, entitled Star Wars: Tales of the Jedi - Dark Lords of the Sith, in which he would create the artwork used in the first five comics of that arc. Likewise, Gossett worked in conjunction with author Kevin J. Anderson on Star Wars: Tales of the Jedi - Redemption, in which the character of Ulic Qel-Droma was redeemed for his actions in the Great Sith War."}, {"tag": "p", "text": "In conjunction with his work on Tales of the Jedi, Gossett also illustrated a number of articles in the Star Wars Adventure Journal, and was interviewed, along with Tom Veitch and Dan Thorsland, in the Adventure Journal article Making Star Wars Comics Come Alive which was featured in Star Wars Adventure Journal 2. Later, select pieces of his work were showcased in The Best of the Star Wars Adventure Journal, Issues 1-4, where Gossett was selected as to be a featured artist."}, {"tag": "p", "text": "During the early years of his career, Gossett kept in touch with other Star Wars fans through discussions on the FidoNet Star Wars Echo."}, {"tag": "p", "text": "Following his work on Star Wars, Gossett provided the artwork for several video games, including Apocalypse which was published by wikipedia:Activision and starred actor Bruce Willis. Gossett would also write the script for Apocalypse, thus adding the necessary touches to Willis's lines. Preforming the same duties as he did for Apocalypse, Gossett was again contracted by Activision to work on their video game Pitfall 3D: Beyond the Jungle."}, {"tag": "p", "text": "Gossett would eventually start work on a major comic project entitled The Red Star, which is a story of epic mythology based on the Cold War. The Red Star would later be made into a video game, which was released for the Playstation 2. The Red Star is an on-going comic series, currently being produced by Archangel Studios."}, {"tag": "h2", "text": "Star Wars bibliography"}, {"tag": "h3", "text": "Comics"}, {"tag": "h4", "text": "Tales of the Jedi: Knights of the Old Republic"}, {"tag": "h4", "text": "Star Wars: Tales of the Jedi - Dark Lords of the Sith"}, {"tag": "h4", "text": "Star Wars: Tales of the Jedi - Redemption"}, {"tag": "h3", "text": "Source books"}, {"tag": "h3", "text": "Magazines"}, {"tag": "h4", "text": "Star Wars Adventure Journal"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}