{"url": "Christian_Piccolo", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Artist stubs", "Category:Roleplaying game artists"], "nodes": [{"tag": "h1", "text": "Christian Piccolo"}, {"tag": "p", "text": "Christian Piccolo has contributed to the Star Wars Franchise in several ways throughout his art and entertainment career. His very first published work as a professional artist was Star Wars related. In 1994, in the West End Games Roleplaying Supplement, Star Wars Adventure Journal number 10, he wrote and illustrated the article \"Toria Tells Droid Journal\". Many of the designs and lore in the article were later included in the Star Wars Encyclopedia (now Legends material) and appeared in several other books in the pre-canon era. His 850.AA Public Service Headquarters Droid design, was included in the 1999 Essential Guide to Droids.\nIn the early 2000's Piccolo worked as an illustrator for Wizards of the Coast. He provided illustrations for the Ultimate Adversaries and The Force Unleashed Campaign Guide sourcebooks. Later, prior to the release of the film Revenge of the Sith, Piccolo created the Jedi Temple illustration for the Complete Locations cross-sections book published by DK. This illustration was later reprinted in a re-release of Star Wars Complete Locations for The Force Awakens."}, {"tag": "p", "text": "In December 2011 Piccolo joined game developer Bioware to create concept artwork for the game Star Wars Knights of the Old Republic. For one year he contributed to the games first expansions, including the \"Rise of the Hutt Cartel\", \"Galactic Starfighter\" and \"Shadow of Revan\".\nIn 2015 Piccolo joined Disney's mobile game development studio as a Principal Concept Artist. There he contributed concept artwork, game designs, along with art support and direction for the Star Wars mobile titles.\nPiccolo is also active in the Star Wars fan community and has created several works of fan art, not related to professional projects. His fan works have been inspired by other Star Wars projects, such as Star Wars Battlefront (2015) and the upcoming Han Solo Anthology film. In 2016 he participated in the ILM Art Challenge, where six pieces of his work were selected as ILM \"Favorites\". Later, one of these pieces was posted as a Star Wars instagram artwork post.\nPiccolo is also a avid Star Wars collector, and has been building and expanding his Star Wars collection since his youth"}, {"tag": "h2", "text": "Bibliography"}]}