{"url": "Christmas_in_the_Stars", "categories": ["Category:Real-world articles", "Category:Real-world albums"], "nodes": [{"tag": "h1", "text": "Christmas in the Stars"}, {"tag": "p", "text": "Christmas in the Stars: Star Wars Christmas Album is an album produced in 1980 by RSO records. It features Star Wars–themed Christmas songs. The album was produced by Meco Monardo, the man who recorded the infamous disco version of A New Hope's main theme. Anthony Daniels voiced C-3PO, and Ben Burtt provided the sounds for R2-D2 and Chewbacca. Christmas in the Stars was recorded in 1980, two years after the much maligned Star Wars Holiday Special aired. Though they share similar themes, they have no connections to one another other than the fact that they were both marketed in conjunction with major holidays (the Holiday Special being tied to the American Thanksgiving holiday)."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "Album creator Meco wrote a nine-page letter to George Lucas asking if he could produce this type of album for the Star Wars saga. The album was one of the industry's first non-classical-or-jazz projects to be recorded and mixed digitally. The majority of this album's original songs were written by Maury Yeston, a Yale University music professor who later wrote several successful Broadway musicals."}, {"tag": "p", "text": "Jon Bon Jovi (credited as John Bongiovi) made his recording debut on this album, singing lead vocals on \"R2-D2 We Wish You A Merry Christmas.\" Bon Jovi did it as a favor to his cousin Tony Bongiovi, one of the producers of the album."}, {"tag": "p", "text": "The album cover utilized a Ralph McQuarrie painting which was also used for Lucasfilm's 1980 Christmas card."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "Christmas in the Stars was released by RSO records on LP and cassette in November of 1980."}, {"tag": "p", "text": "Also in 1980, RSO released a 45 of \"What Can You Get a Wookiee for Christmas (When He Already Owns a Comb)\" (credited to The Star Wars Intergalactic Droid Choir and Chorale) b/w \"R2-D2 We Wish You a Merry Christmas\" with a picture sleeve. It reached #69 on the Billboard Hot 100 pop chart in 1980. It was the third digitally recorded single in chart history."}, {"tag": "p", "text": "After the album's first printing, Meco was asked to credit George Lucas on the front cover. Due to the success of the album, the studios were ready to do a second printing, giving Lucas credit. Just before a second record printing was to happen, RSO records shut down due to an unrelated lawsuit."}, {"tag": "p", "text": "In late 1983, a second 45 from the album was released by Polygram on the RSO label, \"R2-D2's Sleigh Ride\" b/w \"Christmas in the Stars,\" also with a picture sleeve. In November 1990, Polydor Records Japan released a 3-inch CD single featuring two tracks from the album."}, {"tag": "p", "text": "The album made its CD debut in 1994 as an unheralded budget-label release by JFC/Polygram Special Markets (catalog # 314 520 216-2), with all artwork and references to Star Wars (except those in the song titles) removed from the packaging. The only credit on the package was \"Meco,\" and it featured a generic cover photo of space-themed Christmas boxes and decorations. On October 15, 1996, Rhino Records released a CD with the original cover art restored. This release included liner notes by Stephen J. Sansweet."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "The song \"What Can You Get a Wookiee for Christmas\" was referenced in the video game Star Wars: Knights of the Old Republic, when Zaalbar responds to Mission's suggestion that he get groomed by saying, «Wookiees do not brush their teeth, Mission! It... It just isn't done! What humiliation will you use on me next? A comb?»"}, {"tag": "h2", "text": "Track listing"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}