{"url": "Chroma_Zed", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Maerdocian sector planets", "Category:New Republic planets", "Category:The Slice planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Chroma Zed"}, {"tag": "p", "text": "Chroma Zed was a terrestrial planet located in the Maerdocian sector of the galaxy's Mid Rim. Home to the wormlike humanoid Chromans, who lived in moist mountain burrows near water, the planet featured some of the most magnificent amphitheater facilities, including one with twin waterfalls."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A lush world of mountains and steep cliffs, Chroma Zed was famed for its naturally beautiful vistas and landscapes. Impressive waterfalls and petroleum hot springs dotted the mountain passes, while the native Chroman dwelt below ground in caves or in cliff-side houses. The Chromans constructed many amphitheathers across their homeworld which allowed spectators to appreciate the grand vistas and natural beauty of the planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Discovered by the Galactic Republic during the Great Manifest Period, the planet Chroma Zed saw little involvement in galactic society and eventually fell under the control of the Hutt Empire. When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, the area of space which contained Chroma Zed was contested by the Republic who wised to end Hutt control in the region. When the war ended, the Galactic Empire replaced the Old Republic and old borders were reaffirmed and the Hutt's control of the region ended."}, {"tag": "p", "text": "When Chroma Zed officially became part of the Empire, the native Chromans were enslaved as part of the Imperial Human-centric policies. To reinforce Imperial dominance over the populace, the Imperials made a practice of killing a random Chroman as an example. The hapless Chroman would be dragged out of the group's moist tunnels and then fastened onto a sun-baked rock, where the Chroman would writhe under the heat, oozing protective slime until all that was left was a dessicated corpse. As a result of this mistreatment by Humans, many Chromans joined Nolaa Tarkona's Diversity Alliance during the Galactic Civil War as a way of rebelling against the corrupt Empire."}, {"tag": "p", "text": "Following the end of the Empire and the rise of the New Republic the world remained in space controlled by the dominant galactic power, eventually coming to be a part of Darth Krayt's Galactic Empire as of 127 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}