{"url": "Chroon-Tan_B-Machine/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Medical droid models"], "nodes": [{"tag": "h1", "text": "Chroon-Tan B-Machine"}, {"tag": "p", "text": "The Chroon-Tan B-Machine, also known as the EW-3 midwife droid, was a specialized medical droid capable of delivering and caring for newborn babies used in the Polis Massan medical facility. A midwife droid delivered the Skywalker twins on Polis Massa."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The design of the so-called midwife droid was of a non-threatening aspect, with a friendly, blue-hued face and an array of colored photoreceptors. A warming cushion sat on the droid's bulbous, silver body, while two nutrient reservoirs were maintained to ensure the baby was well-fed. The padded droid was powered by an anti-gravity repulsorlift, located in a spherical compartment below the main body. The midwife droid was fitted with two large, soft cradling paddles for use upon delivery of the newborn. The droid's diagnostic sensors can measure its patient's heart rate, breathing rate, and blood pressure."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The native Kallidahins, despite being known for their medical expertise, had little contact with nor knowledge of Humans, usually only required to operate on their own kind. Thus, when Padmé Amidala was brought to Polis Massa expecting twins, the Kallidahin physicians consulted their medical databanks to find a droid able to deliver Human children. The medtechs selected as Padmé's midwife a padded droid, equipped with a thermal cushion and paddle appendages with which to cradle the newborns."}, {"tag": "p", "text": "The Polis Massan midwife droid successfully delivered both Luke and Leia Skywalker, but the medtechs could not save Padmé's life. Obi-Wan Kenobi was on hand to take care of the infants, and was with Padmé in her final moments. Its work accomplished, the midwife droid left Padmé's grieving companions alone."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Chroon-Tan B-Machine first appeared in Star Wars: Episode III Revenge of the Sith. The droid was voiced by Jane Bay."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}