{"url": "Chrysalide", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Creatures of unspecified biology", "Category:Creatures of unspecified diet", "Category:Mutants", "Category:Sithspawn", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Chrysalide"}, {"tag": "p", "text": "The chrysalide, also known as the \"chrysalis beast,\" was a type of creature altered by Sith alchemy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was widely believed that during ancient times, the knowledge of creating the chrysalis beast was originally formed by the ancient Sith race. In those early years, the creatures were used by the Sith Empire where they served as pets or protectors to high ranking officers or powerful nobles. The knowledge for creating such monsters was later encoded within holocrons and other such tomes, which were buried on Sith worlds such as Korriban. To many, it was widely believed that the knowledge of creating such fearsome beasts was lost."}, {"tag": "p", "text": "However, research made by Emperor Palpatine led to the rediscovery of the process of creating chrysalis beasts. Using immense alchemical cocoons, he later employed this process to transform rancors into chrysalides and used them as pets at the Imperial Citadel on Byss in 10 ABY. X-1 Viper droids controlled by New Republic commandos attacked Imperial forces at the Emperor's Citadel and had them all but defeated until the chrysalides were released on the droids. The chrysalides' teeth could chew through Vipers' armor, and the droids proved no match for the chrysalides. They turned the battle in the Empire's favor and caused the surviving New Republic personnel to retreat. Chrysalides would attack anything in sight apart from other Chrysalides, and would almost always prioritize the largest available target. Other creatures mutated into chrysalis beasts were gundarks, katarns, and vornskrs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though the resemblance was obvious, the chrysalis beasts were not specifically identified as altered rancors when they were introduced in Star Wars: Dark Empire II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}