{"url": "Chu%27unthor", "categories": ["Category:Legends articles", "Category:Capital ships", "Category:Jedi starships", "Category:Praxeum ships", "Category:Republic Fleet Systems products"], "nodes": [{"tag": "h1", "text": "Chu'unthor"}, {"tag": "p", "text": "The Chu'unthor (the Cerean word for \"academy\") was a praxeum ship designed by Cerean Jedi Fin-So-Rowan and Human Jedi Ivixa Delbaeth. The ship was built in orbit around the planet Abhean by Republic Fleet Systems in 400 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Its primary function was as a spacefaring academy for groups of Jedi apprentices, and it operated under the command of a number of Jedi Masters before crashing on the planet Dathomir in 230 BBY. The Academy aboard the Chu'unthor produced several powerful Jedi, including Easal Mar and Ainvar ul-Esca—the latter later pursued a mission of diplomacy and exploration, negotiating a truce on Qualtrough, and making first contact with the Elathan."}, {"tag": "p", "text": "The ship was quite large: it measured two kilometers long, one kilometer wide, and at least forty meters tall. A command pinnacle in the center of the ship housed the majority of the non-Jedi crew, with the sublight and hyperdrive engine array mounted directly aft. The Chu'unthor could accommodate 10,000 Jedi students, and contained hundreds of exercise and lightsaber-sparring rooms to hone each student's concentration, form, and body. Workshops were provided for the construction and maintenance of lightsabers, while meditation chambers gave students and masters alike a place to contemplate the nature of the Force and further their mental discipline. A medical wing contained hundreds of rooms used to teach Jedi healing arts to young students, both for use in the aftermath of battle or accident and to aid the physically or mentally impaired. The ship contained its own extensive library with texts covering the myriad of Jedi teachings, advanced and theoretical science tomes, historical annals, literature from across the galaxy, and encyclopedias covering the galaxy's languages, art, and culture."}, {"tag": "p", "text": "The ship had a relatively small crew, due to much of the ship being automated and run by droids. Most of the crew were Republic Navy veterans. A number of non-Jedi research organizations, including the University of Sanbra, had branches located on the vessel."}, {"tag": "p", "text": "To alleviate the sense of confinement and banality that can be experienced while traveling for long durations in a spaceship, the Chu'unthor had wide corridors with high ceilings, while many rooms had transparisteel domes or expansive viewports. The effect created was an environment very much like the Great Temple on Coruscant, rather than that of a simple starship. Classes were often held within these rooms, open to the stars, reminding the Padawans that a Jedi was obligated to serve the galaxy at large, rather than to use his or her gifts towards the pursuit of selfish ends."}, {"tag": "p", "text": "In the year 230 BBY, the service of the Chu'unthor was cut tragically short when it crashed into the exile world of Dathomir, home to Force \"witches\" descended from the fallen Jedi, Allya. The damaged Chu'unthor was surrounded by the witches on their rancor mounts. A group of Jedi (including Yoda, Gra'aton, and Vulatan) were sent to attempt a rescue of the vessel's crew and passengers, but were stopped by the Witches of Dathomir. After Yoda saved the life of Rell, a young witch, the two were able to negotiate a settlement. The Chu'unthor and its library would be abandoned on Dathomir, but the Jedi were free to leave. Yoda asked Rell to hide the ship's reader disks until a Jedi Knight came, who would free her world from the Nightsisters, the witches who had enveloped themselves in the dark side of the Force."}, {"tag": "p", "text": "During the Clone Wars, a second ship by the name Chu'unthor served as a mobile academy headed by Master Djinn Altis."}, {"tag": "p", "text": "Several centuries after the first Chu'unthor crashed on Dathomir, in 8 ABY, Luke Skywalker came to the planet, fulfilling Yoda's prophecy. He had discovered records mentioning the rescue mission undertaken centuries earlier while visiting the planet Toola, and arrived in the company of Prince Isolder of the Hapes Consortium, who was searching for Han Solo and the kidnapped Princess Leia Organa Solo. After locating Leia through the Force, Luke and Isolder discovered the Chu'unthor, and began to understand the purpose of the rescue mission. After defeating the Nightsisters and Warlord Zsinj, Luke was given records from the Chu'unthor, which he added to his collection for the Jedi Praxeum he later established on Yavin 4."}, {"tag": "p", "text": "Several years later, the Chu'unthor was ransacked by Imperial forces under the command of General Vit, as part of Project Nightsaber."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "During the Clone Wars, a second ship by the name Chu'unthor served as a mobile academy headed by Master Djinn Altis."}, {"tag": "p", "text": "The record on data tapes found in the wreck of the ship contained information about the training of Jedi. Later the data tapes were taken to the new Jedi library on Ossus. In 40 ABY, nearly all of the Jedi datatapes in the possession of the New Jedi Order came from the Chu'unthor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}