{"url": "A_Death_on_Utapau", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes", "Category:The Clone Wars Legacy"], "nodes": [{"tag": "h1", "text": "A Death on Utapau"}, {"tag": "p", "text": "\"A Death on Utapau\" is an unfinished episode of the animated television series Star Wars: The Clone Wars. The episode was released on StarWars.com as a story reel on September 25, 2014, as part of The Clone Wars Legacy. Despite being incomplete, as the series was cancelled before the episode could be finished, it is considered official Star Wars canon."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Obi-Wan and Anakin investigate a mysterious death of a Jedi Master on Utapau, and uncover a secret Separatist weapons deal the likes of which they have never seen before."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the assassination of the Jedi Master Tu-Anh, Obi-Wan Kenobi and his former apprentice Anakin Skywalker travel to Utapau to investigate her death. Their starship descends into a Utapaun sinkhole city called Pau City and lands on a platform. They are greeted by a Pau'an delegation led by Inspector Jen June, who takes them to see Tu-Anh's body. June regards the Jedi presence as harbinger of things to come. While inspecting Tu-Anh's body, they find no obvious wounds but Anakin senses that her mind was unsettled prior to her death due to neurological damage and the two Jedi find scrapes on her knees and elbows. Kenobi describes her as a maverick Jedi who did not always keep in touch with the Jedi High Council. He also promises to share any information with Inspector June."}, {"tag": "p", "text": "The two Jedi visit the scene of the crime which turns out to be a narrow pathway. Kenobi thinks that she did not die from a fall because her body shows no sign of broken bones, bruising and concussion. After seeing a small hole in the window of a far off room, he deduces that she was killed by a precision laser dart aimed at her optic nerve, which caused a massive seizure from its electromagnetic pulse. The two Jedi also work out that crawled to the spot where she was found dead, hence the scrapes. While inspecting the room that Tu-Anh was seemingly spying on, the two Jedi encounter a Toydarian who denies knowing anything at first about Master Tu-Anh. When \"strong-armed\" by Anakin, he told the Jedi that he had been paid twenty druggats by a droid to leave the building open two days ago. After the Toydarian mentioned that the droid had \"red eyes,\" Kenobi suspects that it was an IG-100 MagnaGuard."}, {"tag": "p", "text": "Meanwhile, Inspector June examined the residue from Tu-Anh's crime scene and determined that it was slime from an Amani, an alien species that had begun to settle on Utapau. While most of the Amani in Utapau lived in the cities, some of them lived on the planet's plains. While Kenobi and Anakin don't think that the Amani were sophisticated enough to operate a precision weapon, they suspect that the Amani are working with the Separatists. June then informs the two Jedi that the Governor Torul Blom wants to see them in his office and hinted that he wanted the Jedi to leave Utapau."}, {"tag": "p", "text": "At the Governor's office, Governor Blom claimed that the Jedi presence was unsettling his people and complained about Anakin's \"strong-arm\" tactics. Kenobi reiterates that he has to remain on Utapau to continue Tu-Anh's investigation. The Governor denies that there is a Separatist presence on Utapau and insists that he can manage Utapau's affairs alone. Kenobi and Anakin travel on two winged dactillions to the underlevels of Pau City, where there is an Amani settlement. Unknown to the Jedi, Blom contacts some mysterious associates. While traveling, Kenobi voices his suspicion that Master Tu-Anh was killed while she was investigating the Amanis' dealings with the Separatists. Upon landing at the Amani settlement, Kenobi warns Anakin not to cause any trouble with the Amani."}, {"tag": "p", "text": "Kenobi tells that Amani chief that they were also investigating contact between some Amani and Separatist droids. The chief told Kenobi that one Amani outcast from the plains was seen consorting with some droids. The two Jedi then explore a nearby cave but are followed by a reptilian nos monster. Deep inside the cave, they spot two MagnaGuards. Before they can move against the droids, they are attacked by the nos monster which Anakin kills by impaling his lightsaber through its head. This commotion gives enough time for the MagnaGuards to escape on their STAPs. The Jedi give chase on their dactillion mounts."}, {"tag": "p", "text": "The pursuit takes the two Jedi through several caves and underground waterfalls before they managed to reach the surface. As the MagnaGuards approach some large windmill facilities, Kenobi orders Anakin to leap onto one of the droids. Anakin and the droid end up on the platform and a skirmish ensues between the Jedi and the Separatist droids. While Kenobi is fighting the second MagnaGuard, he tells his apprentice not to destroy the droids since they have to interrogate them. Anakin ignores his orders and throws one his MagnaGuard against a propeller, destroying it. However, Anakin manages to leap on the second droid and overpower it."}, {"tag": "p", "text": "The two Jedi attempt to interrogate the MagnaGuard but it initiates an information overload. Before its self-destruction, Anakin managed to use a device to download some information from its head. Through this information, Anakin discovered that the MagnaGuards had been dealing with a plains Amani and a Sugi arms dealer. Later, the two Jedi meet up with Inspector June and tell her that General Grievous appeared to be using some of the Amani as bodyguards for an arms deal. When asked about the Sugi presence, June tells the Jedi that Utapau is a \"melting pot\" that attracts all sorts of different elements. Using this information, the two Jedi decide to visit the plains Amani."}, {"tag": "p", "text": "Later, Kenobi and Skywalker attend Master Anh's cremation ceremony. When Anakin asks whether they will be returning to Coruscant, Kenobi replied that he had received orders from Master Yoda to continue with their investigation on Utapau."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}