{"url": "Churruma", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire planets", "Category:Imperial Remnant planets", "Category:Mining planets", "Category:Pentastar Alignment planets", "Category:Velcar sector planets"], "nodes": [{"tag": "h1", "text": "Churruma"}, {"tag": "p", "text": "Churruma was a planet with deposits of valuable metals that was located within the Velcar sector of the Outer Rim Territories. During the Galactic Civil War, the Galactic Empire mined Churruma's metals and captured the shaman Chrech Estha, a respected leader of the planet's natives who possessed a carved stick that served as a powerful political and religious symbol on his homeworld. The return of Estha and the stick to Churruma sparked a rebellion that ended the Empire's presence on the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Churruma was a planet that was located within the Churruma system of the Outer Rim Territories' Velcar sector. The planet had underground deposits of precious metals."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the Galactic Empire used Churruma to mine its metals, with Imperial stormtroopers stationed on the planet. Churruma served the Empire as a major source of raw materials. When the shaman Chrech Estha, a respected leader of the planet's natives, urged his people to fight against the Empire's presence on the planet, he was captured and transported to the prison planet Kessel. Although the Empire confiscated the imprisoned leader's carved stick, the Imperials did not suspect the artifact's significance to Churruma's natives as a powerful political and religious symbol."}, {"tag": "p", "text": "At some point during the Galactic Civil War, a group of individuals brought Estha back to Churruma along with the shaman's stick. His return convinced the planet's remaining leaders to listen to the group's advice and organize a successful planetwide rebellion, ending the Imperial presence on Churruma."}, {"tag": "p", "text": "Churruma fell within the borders of the Pentastar Alignment between the years 4 ABY and 12 ABY, and was a part of the Imperial Remnant between 18 ABY and 35 ABY."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The relatively unknown Churruma was home to a primitive culture that had several leaders, including the shaman Chrech Estha, who possessed a stick with religious markings carved on it. The stick was a political and religious symbol with the power to either unite or divide Churruma's society."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Churruma was first mentioned in the 2004 Wizards of the Coast sourcebook Geonosis and the Outer Rim Worlds. The book includes an adventure seed for use with the Star Wars Roleplaying Game, and this article assumes the scenario plays out as described. The 2009 reference book The Essential Atlas placed Churruma in grid square J-5."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}