{"url": "Cid", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles to be expanded", "Category:Bartenders", "Category:Business owners and executives", "Category:Females", "Category:Information brokers", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Cid"}, {"tag": "p", "text": "Cid was a Trandoshan female residing on Ord Mantell, where she ran a cantina called Cid's Parlor. Before Order 66, she served as an informant for the Jedi, and it was in that capacity that the ARC trooper Echo learned her name and where to find her. After Clone Force 99 defected from the Galactic Empire, they visited Cid to learn the identity of Fennec Shand, a bounty hunter who had accosted them on Pantora and attempted to kidnap the child clone Omega. In order to pay for the information, Cid had the Bad Batch rescue Muchi, a young rancor stolen by Zygerrian slavers. After the successful job, Cid paid Hunter thirty percent of the profits and revealed that Shand was an up-and-coming bounty hunter, whom Cid's sources in the Bounty Hunters' Guild stated had been hired for the job on direct commission."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "During the Clone Wars"}, {"tag": "p", "text": "Cid, a Trandoshan female, worked as an information broker in the last years of the Republic Era. She operated out of Cid's Parlor, a cantina and gambling den in Ord Mantell City which she owned. Cid developed a working relationship with the Jedi during this time, occasionally passing them information. During the Clone Wars, the ARC trooper Echo learned of Cid and where to find her from his Jedi commanding officers, although he was unaware of her species or gender."}, {"tag": "h3", "text": "After the war"}, {"tag": "p", "text": "In 19 BBY, the Clone Wars ended with the near-eradication of the Jedi Order, as a result losing Cid an important portion of her business. In order to protect herself amidst the rise of the new Galactic Empire, Cid concealed her past connections to the Jedi."}, {"tag": "p", "text": "Shortly after the formation of the Empire, a group of clone commandos known as the Bad Batch, who had recently defected from the new government, had a run-in with a bounty hunter who was targeting Omega, a member of their group. Echo, who had joined the squad's ranks, suggested that they track down Cid, who he assumed to be male, as she was the only one of the Jedi informants he knew of that he also knew how to find. Believing Cid could identify the bounty hunter and possibly her employer, the Batch duly travelled to Ord Mantell, heading through the streets of Ord Mantell City to Cid's cantina. Cid had recently been approached by Bib Fortuna, the majordomo of Jabba Desilijic Tiure, about locating and retrieving Muchi, a young female rancor stolen from Jabba by Zygerrian slavers. The thieves, led by Raney, had holed up in the ruins of Old Ord Mantell City."}, {"tag": "p", "text": "When the Batch arrived at Cid's Parlor, Echo admitted that he did not actually know who Cid was as he had never met her. Cid was working on one of the slot machines in her establishment, and Hunter approached her and asked her if she knew who Cid was. She denied it, before moving to the bar and sitting down. The Batch discussed amongst themselves what to do next, while Cid watched, as the only other people present were a Weequay and Ithorian arguing over a dejarik game. Tech, remarking on the state of the bar, suggested that \"he\" might have been arrested for violating health code regulations. Omega watched Cid while poking at a holotable, before approaching her and suggesting that she was Cid. The Trandoshan wryly remarked on Omega being more observant than her friends. Omega used her comlink to get the others' attention, telling them who Cid was."}, {"tag": "p", "text": "The Batch continued working for Cid, pulling a job on Corellia, which ended in the failure to retrieve a tactical droid head. After successfully bringing Cid a creature named Ruby, the group would undertake a mission of their own before returning to Cid, aware of their debt to her. Cid offered the group a job to rescue Senator Avi Singh from Imperial prison on Raxus Secundus. Hunter initially refused the mission, and when Cid reminded him of their debt to her, Hunter told her he would not bring Omega to an Imperial-occupied planet, to which Cid responded that he should leave the child in her care. Hunter said that he did not exactly trust Cid, to which Cid laughed and agreed. In the end, the group left Omega behind with Cid while they went on the mission, and Cid set Omega to work cleaning."}, {"tag": "p", "text": "As Omega sulked throughout the parlor, disappointed she had been left behind, Cid eventually approached to ask what was troubling her. When Omega complained, Cid scoffed and told her that life was not fair. Later, Cid played a dejarik game against two of her frequent patrons, Ketch and Bolo. Omega offered her advice on a move, but Cid rolled her eyes and ignored her. However, when her move got her into trouble, she asked Omega what she would do, and when she played that move, she quickly won the game. Surprised that the youngster was skilled at dejarik, she asked if she was good enough to make her any money. Offering her thirty percent, Cid was surprised to see Omega negotiate her way to sixty percent. The pair won enough games to make up the Bad Batch's debt, and although Hunter was not pleased upon returning from their mission that Omega had drawn so much attention to herself, Cid was delighted and told the clone to lighten up."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cid was a female Trandoshan with green skin and golden eyes. Short and portly in stature, Cid was shrewd at her job. She had a wide array of contacts, ranging from Jedi to powerful crime lords, and did not act intimidated by any of them. She was willing to be deceptive to get what she wanted, such as telling the Bad Batch that the juvenile rancor Muchi was a child in danger."}, {"tag": "p", "text": "Cid had a no-nonsense attitude. She quickly formed nicknames for the members of the Bad Batch, referring to Tech as \"Goggles,\" Hunter as \"Bandana,\" Omega as \"Tiny\" and Wrecker as \"Muscles.\" Cid had a soft spot for Omega. She was always opportunistic, and upon realizing she was very skilled at dejarik, partnered with her to make some money and gained a newfound respect for her."}, {"tag": "p", "text": "Cid was a strong and skilled individual, displaying mastery of a Zygerrian energy bow when she fired three very accurate shots to demonstrate to Omega how to operate the weapon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cid first appeared in episode 5, \"Rampage,\" of Star Wars: The Bad Batch, a show released in 2021 and created by Dave Filoni and Jennifer Corbett. She was voiced by Rhea Perlman. She was first revealed in a trailer for the season, titled \"For Hire.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}