{"url": "A_Friend_in_Need", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "A Friend in Need"}, {"tag": "p", "text": "\"A Friend in Need\" is the fourteenth episode of the Star Wars: The Clone Wars television series' fourth season. It aired on January 13, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"A peace conference between Separatists and Republic delegates is interrupted by Lux Bonteri, the son of a late Separatist Senator, who involves Ahsoka in his dangerous search to find justice for his mother's death.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The first meeting between the delegates from both sides is held in the throne room of Duchess Satine Kryze, where Padmé Amidala, accompanied by Ahsoka, Senators Bail Organa, and Mon Mothma, and R2-D2 is hard-pressed in negotiating mutually acceptable terms as the Separatists, chiefly Voe Atell, argue for the legitimation of the Separatists' government before peace can be found. To the surprise of most of the attendants, however, an unexpected new arrival, Lux Bonteri - now a junior senator - enters the throne room and, with the Duchess's permission, delivers an embittered accusation against Count Dooku for his involvement in the murder of his mother before the Separatist delegates have him thrown out. Fearing that he will be executed for voicing the truth, Padmé sends Ahsoka after Lux."}, {"tag": "p", "text": "Lux is taken to the vessel which brought the Separatist delegation to Mandalore and before the holographic projection of Count Dooku, who denies any involvement in Mina's death and indeed commands Lux to be executed for treason. At the last minute, Lux is saved by Ahsoka, who, even when deprived of her lightsabers for the duration of the negotiations, fights their way past the ship's droid crew and use the Republic delegate transport to escape the planet altogether. But when Ahsoka prepares to bring Lux to Coruscant to grant him amnesty, Lux draws a blaster on her, saying that while he has renounced the Separatist cause, he will not join the Republic either, but pursue a different way instead. He has made contact with a \"group\" based on Carlac and joined their cause in order to enlist their help in getting revenge on Dooku. Ahsoka proves still determined to take him to Republic territory. Reluctantly, Lux then zaps her unconscious and takes control of the ship."}, {"tag": "p", "text": "Ahsoka awakes inside the ship on the wintery surface of Carlac, bereft of her lightsabers. Seeing Lux lingering outside, she joins him, only to come into contact with the organization he has joined forces with; Death Watch. When the leader of the welcoming committee, Bo-Katan Kryze, asks about Ahsoka's identity, she quickly announces herself as Lux's betrothed, but despite hopes to the contrary, she and R2, who has in the meantime found Ahsoka's lightsabers where Lux had hidden them, are taken along and brought to a Death Watch outpost to meet their leader. Once they are left alone, Lux has the opportunity to explain his plan to Ahsoka; He had purposely accused Dooku in order to trace back Dooku's current location once the Count would contact him via hologram, and now intends to lead the Death Watch, who have apparently had a falling out with Dooku themselves, to the Count in order to kill him. When Ahsoka vehemently begins to point out the true \"virtues\" of Death Watch to Lux, the Death Watch leader, Pre Vizsla, suddenly arrives, and in order to shut Ahsoka up before she gives herself away, Lux draws her into his arms and kisses her. Ahsoka is subsequently asked to leave the tent, and Lux hands over the information the holotracer has gathered."}, {"tag": "p", "text": "Meanwhile, R2 has been recruited by the Death Watch to repair their batch of battle droids, whom they use for both target practice and cruel sport, while Ahsoka is put to work with a number of young female natives who are kept by the Death Watch as slaves. That night, as the Death Watch is holding a celebration, the chieftain of the nearby village, Pieter, whose granddaughter Tryla is one of the slaves, arrives and demands that the Death Watch shall return their captives and leave Carlac next morning. The Death Watch does come to the village with the women, but after surrendering Tryla to her grandfather, Vizsla draws his Darksaber and kills Tryla. He then commands that the village and its people are put to the torch. Ahsoka takes up the fight against the Mandalorians, but is quickly restrained and taken captive."}, {"tag": "p", "text": "However, R2, who has just finished fixing the Death Watch droids, witnesses Ahsoka in bonds and persuades his new friends to help free her. Vizsla prepares to execute Ahsoka, but timely R2 draws up a diversion, frees Ahsoka and returns her lightsabers, allowing her to take up a proper fight against Vizsla. She and Lux are soon joined by the droids, who keep the renegade Mandalorians busy while Ahsoka and Lux escape on a speeder. Even though put under tenacious pursuit and attack by Bo-Katan and two of her men, Ahsoka and Lux manage to get back to the ship, take off and escape the planet. But as the ship makes for Coruscant, Ahsoka quickly learns that Lux is about to leave the ship aboard an escape pod. She is unable to dissuade Lux from leaving, and with the promise to meet again, Lux launches the pod, leaving Ahsoka behind."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "According to Series Writer Brent Friedman, \"A Friend in Need\" was originally part of a larger story arc including the episodes \"An Old Friend,\" \"The Rise of Clovis,\" and \"Crisis at the Heart.\" However, the arc was eventually split, with the latter three episodes being completed later in the series' production schedule."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}