{"url": "Circus/Legends", "categories": ["Category:Legends articles", "Category:Circuses"], "nodes": [{"tag": "h1", "text": "Circus"}, {"tag": "p", "text": "A circus or carnival was a traveling entertainment show that displayed exotic animal species from around the galaxy, sometimes pitting them against each other in gladiatorial matches. Other creatures and beings performed tricks and acrobatic feats, all for the entertainment of the audience."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Circus Horrificus was a well-known show in operation before, during and after the Clone Wars. They were famous for pitting fierce creatures against each other in matches to the death. Prior to the Clone Wars, around 31 BBY, the circus was involved in the illegal smuggling of akk dogs. Later, when an arqet escaped and killed a dozen members of the audience, the scandal caused the operation to fade into relative obscurity and all but shut down completely. It was during this time that the circus owner sold his wrangler to Jabba the Hutt."}, {"tag": "p", "text": "The Corusca Circus was a stationary circus located in the Old District of Coruscant. All streets in that district lead to the Corusca Circus which was distinguished from other parts of the ecumenopolis by its old-style yellowish lighting."}, {"tag": "p", "text": "Starhunter's Intergalactic Menagerie was another traveling circus and rarity show, that specialized in capturing rare specimens of creatures, including intelligent lifeforms, such as the humanoid Greej, and transporting them aboard a Starhunter menagerie ark. Owned by Captain Stroon and his assistant Mr. Slarm, the Menagerie was put out of business by Jann Tosh after they had captured Ingey, the pet of Coby."}, {"tag": "p", "text": "The Thranta Riders, who were sentient beings of an unknown species from an unknown world, tamed the thrantas of Bespin and rode them, performing aerial shows across the galaxy. In lieu of costumes, the Riders preferred to paint themselves with complex patterns."}, {"tag": "p", "text": "A popular event at a circus was for a rancor to hold a large log with a Twi'lek dancer on top. This was outlawed by the republic but still in common practice through out the outer rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}