{"url": "Circumtore/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Hutt Space astronomical objects", "Category:Planetoids"], "nodes": [{"tag": "h1", "text": "Circumtore"}, {"tag": "p", "text": "Circumtore was a ring-shaped artificial planetoid located in the star system of the same name in Hutt Space. Discovered by the main galactic community by the Rianitus Period, Circumtore fell within the space controlled by the Hutt species into the reign of the Galactic Empire. Colonized by the Shell Hutts at some period, the planetoid was visited by a group of bounty hunters under the lead of Boba Fett in 1 BBY after they tracked the Lyunesi Oph Nar Dinnid and his bounty there. However, the Shell Hutt Gheeta took out his grudge against Fett by killing Dinnid and sending mercenaries to engage the bounty hunters, though the latter group prevailed. Between 26 ABY and 27 ABY, during the Yuuzhan Vong War, Circumtore was attacked by the Yuuzhan Vong invaders and seized."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Circumtore was an artificial, ring-shaped planetoid situated in the Circumtore system of the galaxy's Hutt Space region. The planetoid was at the crossroads of the Gamor Run, Hollastin Run, and Kaaga Run hyperlanes, while being near the planets Rorak 4, Affavan, Carnovia, and Ganath. Circumtore was rather close to Nal Hutta, the capital world of Hutt Space. Shell Hutts and some humanoid species could breathe freely in its atmosphere."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some period in time, Circumtore's neighboring orbitals in its star system were rendered charred and lifeless by a disaster. The galaxy discovered Circumtore and its system between 15,000 BBY, in the Kymoodon Era, and 8000 BBY, in the Rianitus Period. By 5000 BBY, during the Great Hyperspace War, Circumtore fell in the space controlled by the Hutt species. It remained under Hutt control through the Jedi Civil War and the Mandalorian Wars, and though it did fall in the Sith Empire's territory during the New Sith Wars between 1004 BBY and 1000 BBY, Circumtore was still under Hutt influence. By 1 BBY, when the Galactic Empire was ruling the galaxy, a group of Hutts known as the Shell Hutts had colonized Circumtore."}, {"tag": "p", "text": "Prior to 1 BBY, the Shell Hutt Gheeta, who was in charge of building a terminal and diplomatic reception area on Circumtore, hired the freelance architect Emd Grahvess to construct it for him. Although Gheeta planned to kill the architect when he was done in order to keep the man from producing any other great works, Grahvess escaped by putting a bounty on his own head, which the infamous bounty hunter Boba Fett collected. That enraged Gheeta, and as a result the Shell Hutts raised security measures around the planetoid to prevent it from happening again. In 1 BBY, Fett returned to Circumtore with a group of hunters from the Bounty Hunters' Guild: Bossk, Zuckuss, one of the IG-88 assassin droids, and D'harhan. Tracking Oph Nar Dinnid, a Lyunesi with a bounty on his head who had taken refuge on Circumtore, the bounty hunters were forced to go the planetoid's surface unarmed because of the security measures. Despite that, the group succeeded in fighting off a gang of mercenaries with whom Ghetta tried to kill Fett in revenge before eliminating the Shell Hutt. However, D'harhan fell in the fighting, and it turned out that Gheeta had actually killed Dinnid earlier."}, {"tag": "p", "text": "In 25 ABY, the area of space surrounding Circumtore boasted a population of 100 million to 500 million. Between 26 ABY and 27 ABY, during the Yuuzhan Vong War, the Yuuzhan Vong invaders took much of Hutt Space, and Circumtore itself was captured after Nal Hutta fell. Circumtore and its system were under Yuuzhan Vong rule by 27 ABY."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "One of the main groups of beings living on Circumtore were the Shell Hutts, a relative of the Hutts. Considered just as greedy as their brethren, the Shell Hutts were also involved in the criminal underworld. They wore suits of metal with interior repulsorlifts, allowing them to float around off the ground. Circumtore was also home to the mercenaries whom the Shell Hutts hired in the Boba Fett incident prior to 1 BBY."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "A terminal and diplomatic reception area was present on Circumtore by 1 BBY, after Grahvess built it at the expense of Gheeta. The structure possessed great domes and spires, and had at least one landing dock."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Circumtore first appeared in the 1998 novel The Mandalorian Armor, written by K. W. Jeter as the first entry in The Bounty Hunter Wars trilogy. The Essential Atlas, written by Daniel Wallace and Jason Fry, and published in 2009, later provided Circumtore with astrographical data."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}