{"url": "A_Gift_for_Shodu", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "A Gift for Shodu"}, {"tag": "p", "text": "\"A Gift for Shodu\" is the seventh episode of the second season of Ewoks. Written by Paul Dini and directed by Dale Schott, the episode originally aired on ABC on October 4, 1986."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Finding a birthday present"}, {"tag": "p", "text": "At Bright Tree Village, Teebo tries a magic potion at Master Logray's hut but it ends up causing a mess, much to the annoyance of Wicket, Kneesaa and Latara. Teebo explains that he was helping Wicket to come up with a birthday gift for his mother Shodu. Teebo lands with a mask on his head."}, {"tag": "p", "text": "Wicket is frustrated that he can't find a birthday present for his mom, whose birthday party is tonight. However, he finds a map pointing the way to an old temple that was built by an ancient race of creatures. Latara thinks this is boring until Wicket reads that the old temple was used to store jewels. Latara asks when they will go. Wicket proposes going now but Kneesaa warns that the map has a warning for Ewoks to \"keep out or be doomed.\" Wicket says that the four of them can take of themselves, adding that they are brave Ewoks and not a bunch of old, scared Duloks."}, {"tag": "p", "text": "Meanwhile at the Duloks' swamp, an enraged Queen Urgah throws a tantrum, hurling objects at her husband King Gorneesh. She tells Gorneesh not to return until he has found a decent anniversary present. Gorneesh orders his subjects including Umwak to obtain a decent anniversary present for his wife."}, {"tag": "h3", "text": "The Lost Temple"}, {"tag": "p", "text": "The Ewoks reach the Lost Temple. While Wicket and the others are keen, Latara is determine not to set foot inside the dirty temple. Wicket tempts her with the treasure room and she leads the way. Kneesaa warns her about booby traps but she touches a red gem at the base of an idol, which triggers a trap door. The Ewoks enter a spiral slide, narrowly avoiding being impaled by sharp spikes. Kneesa helps them escape a lava pit by using her lasso to pull them to safety."}, {"tag": "p", "text": "The Ewoks quickly find themselves inside the treasure vault, which is full of gems. Latara celebrates while Teebo says that the chart was right. Wicket fishes a grew jewel. Kneesaa thinks they should leave because this place makes her nervous. While Kneesaa helps herself to several diamonds, the Ewoks are confronted by a large dragon-like creature, which objects to their presence. Wicket leads the Ewoks into a tunnel but the dragon pursues them through the temple."}, {"tag": "p", "text": "The Ewoks also dodge several heavy logs but the dragon continues the pursuit. The Ewoks narrowly escaped being crushed to death from logs by fleeing through a closing gate. Wicket also retrieves a green gem. The Ewoks are relieved they escape while Wicket is delighted that he obtained a green gem. He hopes to bring his mother a gift. However, the Ewoks are being watched in the bushes by the Duloks, who decide that the gem will be a perfect gift for Queen Urgah. One of the Duloks brings a net but accidentally traps his companions including Umwak. Unwak grumbles that they will now have to go to the Ewok village."}, {"tag": "h3", "text": "Troublesome gifts"}, {"tag": "p", "text": "Later that evening, the Ewoks hold a celebration at Bright Tree Village. Malani presents Shodu with her first homemade birthday cake. Wicket presents his mother with the green gem. When Shodu asks how he got the gem, Wicket claims he found it lying around. While Wicket dances with his mother, Kneesaa marvels that Shodu loves her present. Latara reveals that she obtained a present for herself. However, the jewel starts to hatch, releasing a baby serpent that resembles the dragon they encountered at the Lost Temple. The Ewoks quickly realize that the jewels are serpent eggs."}, {"tag": "p", "text": "Kneesaa decides they have to warn Wicket and sends Teebo to dance with Shodu. Kneesaa tells Wicket that they have to get Shodu's gem back and alerts him to the serpentine hatchling, which is running circles around Latara. Wicket wonders how he will tell his mother. Wicket later speaks with his mother in private."}, {"tag": "h3", "text": "Dulok entanglements"}, {"tag": "p", "text": "However, the two are captured in a net by Umwak and his gang. The Duloks bring the two Ewok captives and the green gem back to the Dulok village in the swamps. Umwak presents Queen Urgah with the gem as well as Wicket and Shodu as a complement. Wicket convinces his reluctant mother to give the gem to Urgah, telling her that he doesn't mind. Gorneesh forces Shodu to bow. Wicket tries to defend his mother but is thrown to the ground by the Duloks."}, {"tag": "p", "text": "Shodu says nobody touches her boy and knocks out two of the Dulok guards. She confronts the Dulok king and queen but his guards cross their spears. Gorneesh asks Urgah what punishment they should give the Ewoks. Before she can decide on the punishment, the gem hatches and releases a blue serpent which troubles Urgah. She shoves her husband into his minions in rage. Shodu and her son flee while Urgah confronts Gorneesh about his unsatisfactory present. Gorneesh shifts the blame to Umwak."}, {"tag": "p", "text": "While walking home, Shodu asks Wicket where he got her birthday present from. Wicket claims it is a long, boring story. She dars him to bore him. Wicket recounts the story of his adventures at the Lost Temple. Shodu tells her son that him being at the birthday party is the only present she wants. Mother and son hug. When Wicket asks if she can show the big flip which she used on King Gorneesh, she warns him not to break the rules again. Wicket chuckles."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}