{"url": "Citadel_Rescue", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Citadel Rescue"}, {"tag": "p", "text": "\"Citadel Rescue\" is the twentieth episode of the Star Wars: The Clone Wars television series' third season. It aired on March 11, 2011."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"After their ship and only way off the planet is destroyed, Anakin and Obi-Wan must lead the escaped prisoners across Lola Sayu's perilous landscape as Plo Koon commands a task force of four cruisers and their fighters through the Separatist defenses in a daring rescue. Even Piell is ravaged by anooba tracking beasts, but before he dies, he passes on his Nexus Routes coordinates to Ahsoka. When the survivors return to Coruscant, Ahsoka knows half the intel, and refuses to disclose it to anyone but the Jedi Council, while Tarkin refuses to hand over his half to anyone other than the Chancellor.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After finding a temporary refuge in the caves, Even Piell and R2-D2 contact the Jedi High Council. They learn that Master Plo Koon—aided by Kit Fisto, Saesee Tiin, and Adi Gallia—is already on his way to retrieve them, but that there is only a small window of opportunity in which the rescue party can get to them; the rendezvous point is a small island situated in a lava lake surrounded by a mountain ring. Right after the call was made, a squad of commando droids attacks them, forcing them to move on. In the meantime, Osi Sobeck is contacted by Count Dooku and reprimanded for his failure to recapture the prisoners so far, though Dooku decides to give him another chance until success or failure are a certainty. Afraid to displease the Count even more, Sobeck unleashes a pack of Anooba to hunt the Jedi down and has the space blockade around the planet bolstered to prevent another intrusion."}, {"tag": "p", "text": "The Jedi team reaches the lake, but are attacked by a large battle droid force. While R2's droid team holds off the enemy for as long as they are able (and are swiftly destroyed in the attempt), the Jedi, clones and Tarkin descend the cliff down to the lake's shore and flee into a set of gulleys. As they move on, Skywalker, Tano, and Kenobi discuss Tarkin's haughty attitude and the Jedi's inability to stem the tide of war due to their strict codex before they notice the Anooba trailing them, along with a squad of STAPs. Skywalker, Kenobi and R2 lure the creatures into an ambush, but the rest of the team itself is ambushed by crab droids and another group of STAPs. Separated from the others, Piell and Tano are attacked by the last remaining Anooba which fatally mauls the Jedi Master. Dying, Piell entrusts Tano with his half of the Nexus Route coordinates, despite her confession that she was never assigned to the mission, with the explicit instruction to repeat it to none other but the Jedi Council, and the Jedi take a brief moment to consign his body to the lava before moving on."}, {"tag": "p", "text": "Finally, Sobeck arrives on the scene, determined to see his efforts succeed personally, and catches the refugees just as they prepare to cross over to the island. His STAP is shot down by Fives, lands on the island, grapples with Tarkin and prepares to cast him into the lava, but Tano kills him before he could do that. Just before an army of crab droids can overrun the island, Master Koon arrives with a gunship to carry the fugitives out, and once safely aboard a Venator-class Star Destroyer, the rescue force retreats immediately."}, {"tag": "p", "text": "Though the mission was successful, the situation takes an abrupt turn back on Coruscant: Tarkin states that he can deliver his part of the information only to Chancellor Palpatine himself, while Tano holds true to her promise to Master Piell to reveal her half only to the Jedi Council, so Master Yoda is forced to confer with Palpatine about this matter. Upon Skywalker's inquiry, Master Koon covers Tano's claim that he had permitted her to join the mission, and Tarkin clasps Skywalker's hand, commending him on his standing-points—as a lauding Obi-Wan observes quite critically."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Even Piell's death in the episode greatly contradicts his later chronological death in Coruscant Nights I: Jedi Twilight in 19 BBY. On March 11, 2011, Leland Chee stated on his StarWars.com blog that he was killed in the novel because of potential continuity issues regarding his council membership. However, after the Star Wars: Coruscant Nights trilogy was completed, it turned out that \"Citadel Rescue\" would rewrite his death, and they attempted to minimize the number of sources that contradicted this."}, {"tag": "p", "text": "In the scene about a few seconds after Plo's gunship launches, there are two naval clone officers alive. This is incorrect because three naval officers have clearly died, which brings the officer total to five. In \"The Citadel\" when Anakin rescued the officers, there were only four of them in the prison cell."}, {"tag": "p", "text": "During one of the combat scenes, Commander Cody jumps on top of a crab droid and shoots it in the head before turning around to shoot at other approaching droids. This directly mirrors what other clones do on Utapau in Revenge of the Sith."}, {"tag": "p", "text": "R2-D2's squad of three battle droids is misleading because in the previous episode when the clone and a droid peered over the edge, one of the droids was shot and destroyed. Yet in this episode all three droids were present."}, {"tag": "p", "text": "For a brief moment when the team is getting into the gunship, Ahsoka's lightsaber is blue."}, {"tag": "p", "text": "This was also the third least watched episode of the series with only 1.54 million views."}, {"tag": "p", "text": "As Tarkin and Anakin shake hands in the final scene, the Imperial March can be heard playing in the background."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}