{"url": "City_of_Kastays", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Cities"], "nodes": [{"tag": "h1", "text": "City of Kastays"}, {"tag": "p", "text": "The City of Kastays was a major city on the planet Aaris III in the Kathol sector of the Outer Rim Territories several thousand years before the Galactic Civil War. Inhabited by the native Aaris, the city was home to the Place of Kastays and was large enough to require a standing city guard. Several millennia prior to the Galactic Civil War, the city was the location to which the Plaque of Victory—a sentient, inanimate lifeform that had the goal of destroying all life around it by manipulating the feelings of others to do its bidding—was brought to following its discovery. The City of Kastays descended into violence and disorder under the influence of the Plaque, and fell into ruin and disrepair following the downfall of the Aaris civilization."}, {"tag": "p", "text": "The ruins of the city were eventually reclaimed by nature and later housed the primitive descendants of the Aaris. In 8 ABY, the ruins were the site of an archaeological excavation by the Imperial science team MS-133."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Several thousand years before the Galactic Civil War, the City of Kastays was a major urban settlement on the planet Aaris III in the Kathol sector of the Outer Rim Territories. Built by the native species, the Aaris, the city's buildings were constructed of metal. A governmental complex stood at the center of the city, which contained a vast storehouse of knowledge, and served as both a seat of government and as a place of learning. The scholar Kastays had a tower of the building for his own use. The city also housed a place of reverence in the Aaris culture known as a gushaz. Several companies of guards were stationed within the city."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The City of Kastays was built on the planet Aaris III thousands of years before the Galactic Civil War. One night, a comet was witnessed streaking through the sky; several days later, a legion from an outlying outpost entered the city with an artifact they called the Plaque of Victory. It was placed in the city's gushaz. Six days later, however, the city was plagued with violent acts. Starting off as a simple rise in violent crime that ended with the death of the victim, the incidents escalated until street gangs were involved in bloody battles throughout the city and even companies of the city guard were clashing with each other. The only common denominator was the fact that all claimed to be the Plaque of Victory's guardian and that it had spoken to them."}, {"tag": "p", "text": "Unknown to the residents of the city was the fact that the Plaque was an inanimate sentient lifeform that fed off the emotions and life energy of those it came into contact with. Its sole purpose was to destroy life around it by influencing their feelings, causing them to act in paranoid and homicidal ways. As the violence intensified, one faction with access to the Plaque took it from the gushaz and gave it to Kastays to keep in his tower. They hoped that by placing it high above the city, its effects would be negated. Their plan failed, and the city fell into anarchy. Kastays guarded the Plaque by booby-trapping his tower and set to work recording the last days of the Aaris civilization."}, {"tag": "p", "text": "The city fell into ruin and was reclaimed by the jungle. The primitive descendants of the Aaris lived in the lower levels of the city's ruins, burrowing tunnels through the fallen metal structures to create elaborate warrens to live in. Many thousands of years later, in 8 ABY, the top of Kastays' tower was discovered by the members of the Imperial science team MS-133, who were conducting an archaeological dig on the planet. During the expedition, members of the team discovered Kastays' name while translating bas-relief pictographs in his tower. As the Imperial scientists did not know the name of the city, they named it after Kastays, the only individual Aaris they had identified. Their excavations uncovered the Plaque of Victory, and the artifact once again attempted to use its influence to destroy the life around it, resulting in the near total decimation of MS-133."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The city was inhabited by the Aaris, the species indigenous to the planet. Kastays, a scholar who worked out of the governmental building in the city, was a resident. In the last days of the Aaris, Kastays hid the Plaque of Victory in a floor safe in his chamber in an effort to negate its influence over the people."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The City of Kastays was introduced in the RPG adventure Artifact of Aaris as part of The DarkStryder Campaign, published by West End Games in 1995."}, {"tag": "p", "text": "The \"City of Kastays\" is a name given to the city by members of the Imperial research team MS-133 in 8 ABY, named after the Aaris scholar Kastays, whose name they identified when translating ancient pictographs. The actual name of the city as the Aaris knew it is never identified."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}