{"url": "Clak%27dor_VII", "categories": ["Category:Legends articles", "Category:Clak'dor VII locations", "Category:Confederacy of Independent Systems planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Mayagil sector planets", "Category:New Republic planets", "Category:Rimma Trade Route", "Category:Swamp planets", "Category:Type III atmosphere planets"], "nodes": [{"tag": "h1", "text": "Clak'dor VII"}, {"tag": "p", "text": "Clak'dor VII, also known simply as Bith, was a small planet orbiting the large white star Colu in the Colu system of the Outer Rim Territories on the Rimma Trade Route. It was a long-time member of the Galactic Republic and was also the homeworld of the Bith species."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ecological disaster"}, {"tag": "p", "text": "The Bith evolved over the millennia, and making use of their powerful senses of sight and hearing became a race of artists, scientists and musicians. They built great cities in the mountains and the jungles of Clak'dor VII. However, around 300 BBY, a conflict erupted on the planet between the capital city of Weogar and its domed counterpart Nozho over a stardrive patent. When subterfuge was detected by Weogar, war soon broke out and a chemical attack was launched by Nozho on the capital. The retaliatory biological strike on Nozho wiped the city out and destroyed Clak'dor VII's ecosystem, destroying the planet's ability to produce either the basic needs for its citizens or goods for export. The populace was decimated, though from the ruins of Nozho came the offshoot Y'bith subspecies who would go on to colonize Clak'dor IV. The surviving Bith on the planet were forced to relocate into domed cities, now proclaiming themselves pacifists and seldom venturing into the irradiated swamps, where the wildlife mutated into such lifeforms as the Ghhhk."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "Clak'dor VII was represented in the Galactic Senate directly by Dodra F'ass until the planet seceded in 22 BBY, shortly before the Clone Wars. Though many Bith, like F'ass, retreated to their homeworld and seldom participated in battles, being pacifists, the Bith supported the Confederacy of Independent Systems with technological and artistic contributions: to the Bith, the Confederacy was opposing a morally corrupt Republic."}, {"tag": "h3", "text": "Joining the New Republic"}, {"tag": "p", "text": "The Bith were horrified by the Galactic Empire, which persecuted them, necessitating an Alliance relief mission shortly before the Battle of Yavin, led by Nozzo Naytaan. Clak'dor VII was one of the first planets liberated by the New Republic (in 5 ABY, immediately after the New Republic campaign to Lwhekk)."}, {"tag": "p", "text": "After the planet's liberation, Clak'dor VII remained isolated for some time. It was not until a Bith ambassador witnessed the Hapans offer aid to the New Republic (and present Isolder as a gift to Leia Organa) that the planet joined the government."}, {"tag": "p", "text": "Clak'dor VII was a New Republic stronghold during the Thrawn campaign."}, {"tag": "p", "text": "The planet was represented in the New Republic Senate first by Nara Deega and later by E'noro. It was spared invasion during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}