{"url": "Clan_Awaud/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Clan Awaud", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Awaud"}, {"tag": "p", "text": "Clan Awaud was a Mandalorian clan in existence prior to the tumultuous period of the New Sith Wars. In the century leading up to 1000 BBY, the deadly Candorian plague spread throughout a large swath of the galaxy, eventually coming to the Outer Rim world of Mandalore. There, the plague was responsible for the death of much of Clan Awaud, including the family of the Mandalorian mercenary, Aga Awaud. Though Aga had been offworld at the time of his clan's demise, when he returned to Mandalore in 1058 BBY, the Mandalorian soldier made the grim discovery. The death of so many of his clan, combined with the need for Mandalorian vessels to unite into defensive caravans just to fend off raiders from the sectors surrounding Mandalorian space, spurred Aga to action. Aga Awaud initiated a call for Mandalorians throughout the galaxy to defend Mandalorian space, a movement that came to be known as the Return. Then, in 1051 BBY, Aga—one of Clan Awaud's only surviving members—claimed the title of Mand'alor. As \"Mandalore the Uniter,\" he led his people into a new era of thriving resurgence."}, {"tag": "p", "text": "Hundreds of years later, during the ideological schism that developed between the New Mandalorian, True Mandalorian, and Death Watch factions that spawned the Mandalorian Civil War, support from Clan Awaud was divided. Members of the clan were known to favor each of the three feuding groups, though the reigning chieftain of Clan Awaud, Nam Beroya, cared little for the divisive politics that were overtaking Mandalore. Beroya chose to leave the Mandalorian homeworld, taking along those within his clan who felt the same. During the Clone Wars, Clan Awaud found employ with the Confederacy of Independent Systems and the Hutts as mercenaries, but after years on the move, Nam Beroya finally led his people to the planet Vlemoth Port. There, in the northern foothills, Clan Awaud established the settlement of Arumorut, constructing a large vheh'yaim they deemed Clan Home at its heart. Clan Awaud soon allied with the Talz of the nearby Gnaaz tribe, and began to contract mercenary work throughout the Slice and the galaxy's Western Reaches. By the start of the Galactic Civil War, the clan hosted over eight hundred members at Arumorut."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clan Awaud was first introduced to Star Wars canon in the reference book, The Essential Guide to Warfare, authored by Jason Fry and Paul R. Urquhart, and published April 3, 2012. A year later, with the release of The Bounty Hunter Code: From the Files of Boba Fett on October 15, 2013, Clan Awaud was mentioned again. Clan Awaud finally appeared in full in the roleplaying game adventure book Friends Like These, published on December 8, 2016 by Fantasy Flight Games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}