{"url": "Clan_Jeban", "categories": ["Category:Legends articles", "Category:Clan Jeban", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Jeban"}, {"tag": "p", "text": "Clan Jeban was a Mandalorian clan in existence around the time of the Yuuzhan Vong War. Members of Clan Jeban could be identified by a shared red color-scheme on their Mandalorian armor, and a clan sigil designed around a black saber etched on the wearer's chest plate."}, {"tag": "p", "text": "In the year 24 ABY, thirteen-year-old Dinua Jeban completed her verd'goten, the traditional rite of passage marking a youth's reaching of adulthood in Mandalorian society. However, with her father dead, Dinua was left to travel with her mother, Briika Jeban, in order to find mercenary work to support themselves. The two met fellow Mandalorian Goran Beviin in the Bar Jaraniz on Nar Shaddaa, and they became good friends over a series of jobs the Mandalorians were hired to perform for the mysterious individual known as Udelen—in actuality, the extragalactic Yuuzhan Vong agent, Nom Anor. When the Yuuzhan Vong fleet appeared before the Mandalorians at a staging area in the Outer Rim, a fearful Briika asked Beviin to take in Dinua if anything should happen to her, a request to which Beviin solemnly agreed."}, {"tag": "p", "text": "After Anor revealed the Yuuzhan Vong's intentions for the galaxy to Mand'alor Boba Fett, the Mandalorians entered into a false alliance with the Vong: they would officially work for the invaders, while covertly subverting their campaign and gathering intelligence for the New Republic. While passing information off to the Jedi New Republic Intelligence agent Kubariet on New Holgha, the Mandalorians were forced to stall a Yuuzhan Vong Subaltern, Bur'lorr. During the course of the skirmish with the Vong warrior, Briika was stabbed in the chest by one of the spikes on the warrior's Vonduun armor. Despite all efforts to save her, Briika perished due to blood loss. In accordance with her wishes, Dinua was adopted by Beviin, becoming part of his clan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clan Jeban first appeared in Star Wars canon in the 2006 e-novella Boba Fett: A Practical Man, by author Karen Traviss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}