{"url": "Clan_Kryze/Legends", "categories": ["Category:Legends articles", "Category:Clan Kryze", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Kryze"}, {"tag": "p", "text": "Clan Kryze was a Mandalorian clan in existence during the final decades of the Galactic Republic. During the Mandalorian Civil War—a conflict of ideology waged between the crusading Death Watch and the reformist True Mandalorians, while the pacifistic New Mandalorians remained apart and neutral—members from Clan Kryze could be found in support of each of the three factions, as opinions were divided among the clan."}, {"tag": "p", "text": "In the Great Clan Wars that followed the Mandalorian Civil War, when the Death Watch moved against the New Mandalorians after emerging victorious over the True Mandalorians, the Duke of Clan Kryze was killed. His daughter, Satine Kryze of the planet Kalevala, later become a Duchess and rose to become the leader of the New Mandalorian faction on the Mandalorian homeworld of Mandalore by the start of the galaxy-spanning Clone Wars. Ruling from the domed New Mandalorian capital city of Sundari, Satine was forced to combat the return of the Death Watch, among their ranks her estranged sister, Bo-Katan Kryze. Satine's nephew, Korkie Kryze, also lived in the city of Sundari, where the boy attended the Royal Academy of Government."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Satine Kryze first appeared in the 2010 Star Wars: The Clone Wars television episode \"The Mandalore Plot\", and her nephew, Korkie Kryze, first appeared in the series' later episode, \"The Academy\", that same year. However, it was only with the release of The Essential Guide to Warfare by Jason Fry and Paul R. Urquhart, that Clan Kryze officially entered Star Wars canon. A year later, with the release of The Bounty Hunter Code: From the Files of Boba Fett on October 15, 2013, Clan Kryze was mentioned again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}