{"url": "Clan_Ordo", "categories": ["Category:Legends articles", "Category:Clan Ordo", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Ordo"}, {"tag": "p", "text": "Clan Ordo was a famed clan of Mandalorians who presided over the planet Ordo in the Mandalore sector for their Lord Mandalore, the ultimate official over the Mandalorians. The most famed clan member was Canderous Ordo, who fought during the Great Sith War, Mandalorian Wars, Jedi Civil War, and the Dark Wars."}, {"tag": "p", "text": "Canderous Ordo accompanied Revan during the Jedi Civil War and later, in accordance with orders from Revan and the interest of his people, reunited the Mandalorians under his banner as Mandalore. At some point between the years 3954 and 3951 BBY, Canderous Ordo returned to the former Mandalorian headquarters on the Onderonian moon Dxun and began to reunite and rebuild Clan Ordo."}, {"tag": "p", "text": "After the signing of the Treaty of Coruscant, when Jicoln Cadera rebelled against the Sith-favoring reign of Mandalore the Vindicated, Clan Ordo was one of several clans that rallied to Cadera's side. Cadera and his clan's movement was eventually defeated; and Clan Ordo was then accepted back by Mandalore. Clan Ordo would later on help train the Ewok bounty hunter Treek on Nar Shaddaa."}, {"tag": "p", "text": "During the Mandalorian Civil War, the clan's members were split between the New Mandalorians, the True Mandalorians, and the Death Watch."}, {"tag": "p", "text": "During the Galactic Civil War, the spy known as Bloodletter owned a pair of Mandalorian pistols that supposedly had belonged to the patriarch of Clan Ordo."}, {"tag": "p", "text": "By the time of the Sith–Imperial War, Chernan Ordo had risen to hold the title of Mand'alor. During the conflict, Ordo was hired by the Galactic Alliance to defend the planet Botajef against an impending attack by the forces of the Fel Empire, until the Alliance's fleet arrived to repel the Imperials. However, the Alliance fleet never arrived, and Ordo perished as his forces were overrun and defeated. Fellow Mandalorian Yaga Auchs, who betrayed Ordo by sabotaging their communications, usurped the title of Mand'alor and withdrew the Mandalorians from the conflict."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic II: The Sith Lords, the flag found at Clan Ordo's headquarters on Dxun, is identical to that of the Infinite Empire (the symbol was most likely modeled after the Star Forge itself). The significance of its placement at that location is unknown. It is possible that Canderous adopted the emblem after the Battle of Rakata Prime as a memento of his part in the quest to destroy the Star Forge. It is also noted that several Clan Ordo members spoke with a New Zealand accent, following Temuera Morrison."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}