{"url": "Clan_Rook/Legends", "categories": ["Category:Legends articles", "Category:Clan Rook", "Category:Criminal organizations", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Rook"}, {"tag": "p", "text": "Clan Rook was a false Mandalorian clan led by the criminal Tayari Rook, who made unsubstantiated claims of being a Mandalorian himself. The so-called Clan Rook comprised a number of pirates and slavers that served under Tayari Rook, operating as a clan of Mandalorians by killing or dishonoring any who would expose the truth of their organization to the true Mandalorians, who would be honor-bound to kill the pretenders."}, {"tag": "p", "text": "Clan Rook and its leader were responsible for the downfall of Clan Spar, a genuine Mandalorian clan that Tayari Rook slandered in order to gain a favorable contract with the Sith Empire. Members of the Mandalorian Lone clan eventually joined with Clan Rook, after they were dishonored for not aiding Clan Spar when the Sith came to capture and execute them for supposed crimes against the Empire. Clan Spar's only known survivor, a young Zabrak female by the name of Akaavi Spar, eventually learned of Tayari Rook's involvement in the death of her people. She tracked the group to the planet Nal Hutta where they were camped, working jobs for the Hutt Cartel. Spar attacked shortly thereafter, killing Tayari and any member of Clan Rook that didn't escape her assault."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clan Rook was introduced to the Star Wars universe in the massively multiplayer online game Star Wars: The Old Republic, created by BioWare and released December 20, 2011. Tayari and the other members of his makeshift clan primarily served as antagonists to Akaavi Spar, an NPC companion to players of the Smuggler class. Discovering Clan Rook's responsibility for the death of her family and subsequently delivering retribution upon them for the injustice is an underlying goal in her character's personal narrative."}, {"tag": "p", "text": "Despite its origins in The Old Republic as a false Mandalorian clan founded as a pretense for non-Mandalorian criminal activity, following the 2014 purchase of Lucasfilm Ltd. by The Walt Disney Company and the establishment of a new iteration of Star Wars canon, Clan Rook reappeared in the premiere of Star Wars Rebels' fourth season, entitled Heroes of Mandalore. No longer a criminal sect with Mandalorian pretenses operating on Nal Hutta, the new incarnation of Clan Rook—as of the reign of the Galactic Empire—existed as a legitimate Mandalorian clan living on Mandalore, who've pledged their loyalty alongside several other clans to Bo-Katan Kryze in pursuit of liberating their homeworld from the Imperial occupation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}