{"url": "Clan_Sornell", "categories": ["Category:Legends articles", "Category:Clan Sornell", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Sornell"}, {"tag": "p", "text": "Clan Sornell was a clan of predominantly Devaronian Mandalorians in existence during the Mandalorian Wars. Clan Sornell was comprised of the Mandalorian couple Koblus \"Ko\" Sornell and her husband Haarm, along with their son Gheedor, a younger daughter, and an infant child."}, {"tag": "p", "text": "The members of Clan Sornell had all rallied to the call of Mandalore the Ultimate and joined the growing Neo-Crusader movement as the Mandalorians set out to conquer the Galactic Republic. By the height of the Mandalorian Wars, Ko Sornell had begun to train her son Gheedor in the Mandalorian ways, taking him into combat with her atop a Basilisk war droid during the battle on Essien."}, {"tag": "p", "text": "The members of Clan Sornell took part in the Mandalorians' victory at Halthor, and in its wake, Haarm Sornell and his daughter erected their family's portable home. There, the clan ate dinner in the company of captured Jedi-turned-Mandalorian conscript Zayne Carrick, and the Republic naval captain, Dallan Morvis, before shipping out for Dantooine to capture the Jedi Enclave and the numerous Jedi younglings there. During the course of the attack on Dantooine, Ko Sornell revealed that she was currently pregnant with another child."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Koblus Sornell was first featured in the Hyperspace-exclusive short story, Interference, by author John Jackson Miller. However, it was only with Miller's Star Wars: Knights of the Old Republic: War five-part miniseries that Clan Sornell was officially introduced to Star Wars canon, debuting the characters of Haarm, Gheedor, and two other unnamed Sornell children. The final issue also revealed that Koblus Sornell was pregnant, and expecting another child."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}