{"url": "Clan_Spar", "categories": ["Category:Legends articles", "Category:Clan Spar", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Spar"}, {"tag": "p", "text": "Clan Spar was a Mandalorian clan that operated by the time of the Great Galactic War. During that time, they served as allies of the Sith Empire and participated in the Sacking of Coruscant where they were amongst over a hundred battle hardened commandos that participated in the battle at Galactic City. In the battle, this venerable clan suffered numerous casualties at the hands of Jedi Master Kellian Jarro. This led to the clan swearing an oath to repay the debt for the deaths suffered at the hands of the Jedi. However, the clan members were framed for crimes against the Sith Empire before they could make good on their promise, by the false Mandalorian Tayari Rook. Rook claimed that Clan Spar had gone back on a contract to destroy Jedi transports, when no such contract had been made. The Empire debilitated the clan with poison gas, capturing and later executing the members of Clan Spar."}, {"tag": "p", "text": "The only known survivor was a female Zabrak Mandalorian by the name of Akaavi Spar, who had been away from the clan with a lover during the attack. When she learned of the Empire's betrayal, Akaavi called upon her lover's clan for aid, but Clan Lone would not rally to support Clan Spar. Akaavi Spar set out to find the architect of her clan's demise, joining forces with an up-and-coming smuggler, eventually uncovering Tayari Rook's actions and tracking his whereabouts to the planet Nal Hutta. There, she killed Rook and any member of his criminal clan of false Mandalorians that didn't flee during the course of her assault, taking revenge for Clan Spar's downfall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clan Spar was first introduced into Star Wars canon in the massively multiplayer online game, Star Wars: The Old Republic, created by BioWare and released December 20, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}