{"url": "Clan_Skirata", "categories": ["Category:Legends articles", "Category:Clan Skirata", "Category:Mandalorian clans"], "nodes": [{"tag": "h1", "text": "Clan Skirata"}, {"tag": "p", "text": "Clan Skirata was a Mandalorian clan. Its members included Munin Skirata and his adopted son Kal Skirata. Kal Skirata's wife and biological children left Kal Skirata, his sons later disowning him through a Mandalorian custom which meant great dishonor to Kal, but he still considered them his sons."}, {"tag": "p", "text": "In 19 BBY, just before the Clone Wars ended, Kal Skirata adopted Omega Squad, the Nulls, and former Jedi Bardan Jusik as sons according to Mandalorian tradition. During the final battles of the Clone Wars, Kal had members of Clan Skirata break Ruusaan Skirata, his long estranged biological daughter, out of a Republic detention facility and rejoined her into Clan Skirata. Days after the end of the Clone Wars, Kal also adopted the wives and families of his sons. This included Darman's Jedi wife Etain Tur-Mukan, although posthumously, which was accepted by Mandalorian culture. Kal started adopting and expanding Clan Skirata on Coruscant, but at the end of the war they were forced to flee the Republic army and go to Kal Skirata's remote and hidden farm Kyrimorut on Mandalore, near where Munin had raised him. Later on, a member of the clan, Jaing Skirata saved the Mandalore Boba Fett's life by curing Fett's ailing health brought on by his nature of being a clone."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Members"}, {"tag": "h2", "text": "Adoption"}, {"tag": "p", "text": "As was the tradition of Mandalorians to adopt, Kal Skirata also adopted many sons and daughters, most of whom were clones of Jango Fett mixed in with Mandalorian genes and their wives."}, {"tag": "p", "text": "Adopted children of Kal Skirata include:"}, {"tag": "p", "text": "Alpha-Ø2 Spar and Alpha-30 Sull did missions with Clan Skirata and even knew the secret base on Mandalore, but it is unclear if they were ever adopted or not."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}