{"url": "A_Matter_Of_Perception", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "A Matter Of Perception"}, {"tag": "p", "text": "\"A Matter of Perception\" is a comic story that was published as the lead story of Star Wars Adventures 22 on June 5, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet Nothoiin in the Anoat sector, Princess Leia Organa and C-3PO were surveying the forests of the planet. C-3PO was worried about Imperial activity on the planet but Organa reassured him that there was no presence. On the Millennium Falcon, R2-D2 was doing inspections when he noticed something was wrong. He started to beep frantically to get Organa's and C-3PO's attention. R2 had detected an intruder on the starship. All of the sudden a Aleena child jumped up from the floor and ran out of the ship."}, {"tag": "p", "text": "Princess Leia chased after the child, into the forest before losing sight of it. But when the child thought it got away, Organa snuck up behind it and grabbed it. But then she was stopped by a group of Imperial stormtroopers. The stormtroopers took her into custody."}, {"tag": "p", "text": "From the cliff, C-3PO and R2-D2 looked on worried about what would happen to Organa. R2-D2 knew he had to save her and took off down the cliff with C-3PO trying to catch up to him."}, {"tag": "p", "text": "The stormtroopers brought Organa to a Aleena village and ordered her inside a home. The stormtroopers told her that they already knew about a plan of hers and were about to shoot her when she fought them using her Alderaanian martial arts."}, {"tag": "p", "text": "C-3PO and R2-D2 continued their journey through the forest when they heard gunfire ahead. Princess Leia had taken one of the stormtrooper blasters and was taking out the stormtroopers. As 3PO and R2 walked through the village, a stormtrooper went flying through the window."}, {"tag": "p", "text": "Back inside the home, one of the stormtroopers asked her why she did that. But she wanted to know how Darth Vader was able to find them. But the stormtrooper thought that she was a bounty hunter sent by the Empire. Outside, the droids prepared to make a surprise entrance."}, {"tag": "p", "text": "Organa realized that these were stormtrooper deserters who had betrayed the Empire after they had to face horrors on a mission on Aleen. They had only heard rumors about tragedies that the Empire committed including to the village they were in. The Aleena child was an orphan because of it but now the stormtroopers raise the child. Princess Leia tried to get the stormtroopers to join the Alliance to Restore the Republic they agreed to be consultants."}, {"tag": "p", "text": "C-3PO and R2-D2 were arguing on who should knock down the door to save the princess but she opened it for them. C-3PO was confused to see them working with the enemy but Leia saw it as perspective."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}