{"url": "Class-6_escape_pod", "categories": ["Category:Legends articles", "Category:Corellian Engineering Corporation products", "Category:Escape pod classes"], "nodes": [{"tag": "h1", "text": "Class-6 escape pod"}, {"tag": "p", "text": "The Class-6 escape pod was a standard emergency craft created by Corellian Engineering Corporation and used on many of their designs, such as the CR90 corvette."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Class-6 escape pod was equipped with four escape thrusters, and several maneuvering thrusters positioned around the pod."}, {"tag": "p", "text": "Each pod could carry up to six individuals and was fitted with a viewscreen connected to externally mounted holocameras."}, {"tag": "p", "text": "The escape pod was designed to accommodate only living passengers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the first battle of Tatooine in the Galactic Civil War, the Corellian corvette Tantive IV was captured and boarded by the Imperials. Meanwhile, R2-D2 — the astromech droid onboard, who carried the stolen plans of the first Death Star — overrode a Class-6 escape pod's computer to allow mechanicals to enter. R2-D2 and C-3PO, his protocol droid companion escaped the beleagered Tantive IV in the pod and crash landed on Tatooine with it."}, {"tag": "p", "text": "Imperial escort carriers utilized by Storm Commandos also carried Class-6 escape pods, or another escape pod of a similar make."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The escape pod model constructed for A New Hope was built by Industrial Light & Magic in one week. It was a rush job that consisted of two one-gallon paper paint buckets stuck on top of each other. The top one was truncated, but the bottom one was left whole. Lorne Peterson was one of the modelmakers involved with this project."}, {"tag": "p", "text": "During the Wedge Campaign mission Relics of Geonosis, several escape pods were seen ejected from Sarkli Piett's Imperial escort carrier and littered around on Geonosis that were given a similar design to the Class-6 escape pods, although it was not made clear if they were intended to be Class-6."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Non-canonical appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}