{"url": "Class_VI_bulk_freighter", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starship classes", "Category:Corellian Engineering Corporation products", "Category:Freighter classes", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Class VI bulk freighter"}, {"tag": "p", "text": "The Class VI bulk freighter was a type of cargo hauler built by Corellian Engineering Corporation, considered antiquated by the time of the Galactic Civil War. It was developed from the earlier Praetorian-class frigate."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Class VI was 180 meters in length and had a cargo capacity of 2,000 metric tons and a Class 3 hyperdrive. In standard operation, it could carry a crew of four, with provision for two passengers and supplies for six months, but at a minimum, it could operate with just a pilot and navigator."}, {"tag": "p", "text": "Slow and very sluggish at sublight speeds, a standard Class VI lacked a backup hyperdrive, and was armed with a single turret-mounted laser cannon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Class VI was built on the same hullform as the Praetorian-class frigate, a warship in the Republic fleet which served at least as early as the Battle of Koros Major during the Great Sith War."}, {"tag": "p", "text": "Thousands of years later, a ship of the same class was launched in around 70 BBY, called the Hearst, and was used as the headquarters of the independent newsfeed Freedom Galactic News. The Rebel Alliance Fleet also had at least one such vessel in its forces."}, {"tag": "p", "text": "During the initial stages of the Thrawn campaign, Grand Admiral Thrawn used an old freighter of this class as part of a ploy to capture Luke Skywalker, simulating a routine stop-and-search maneuver with Chimaera and an Immobilizer 418 cruiser."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name and statistics of this class derive from the entry for the Hearst in the October/November 1995 issue of the French RPG journal Casus Belli, where that ship is identified as a cargo classe VI. The illustration of Hearst is by Fred Blanchard, artist on the Heir to the Empire comic adaption, and it clearly represents a variant of the same freighter type that would appear a few months later in December 1995's issue 3; alongside Hearst, this issue of Casus Belli also presents the Black Lotus, a PCL 27 freighter like the ship used by Thrawn in the Sluis Van ambush in issue 6."}, {"tag": "p", "text": "However, it should be mentioned that an earlier illustration of the ambush of Luke's X-wing in The Thrawn Trilogy Sourcebook shows a different freighter design—and it seems that the comic artists were aware of this image, inasmuch as they copied the distinctive twin-well interdictor from it."}, {"tag": "p", "text": "Adding to the confusion, the most recent appearance of the Class VI shows it serving as a combat warship several millennia earlier. The disparity between the two roles was resolved by the Knights of the Old Republic Campaign Guide which explained that the Class VI freighter was a reuse of the hullform of the earlier Praetorian-class frigate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}