{"url": "A_Necessary_Bond", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "A Necessary Bond"}, {"tag": "p", "text": "\"A Necessary Bond\" is the ninth episode of the Star Wars: The Clone Wars television series' fifth season. It aired on November 24, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"When General Grievous launches a full-scale attack on the pirate base on Florrum, Ahsoka and the younglings fight side-by-side with Hondo and his pirates to turn back the Separatist forces.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Ahsoka and her youngling rescuers haste to return to the Crucible, with a team of Hondo Ohanka's Weequay pirates inside a speeder tank in hot pursuit. After some frantic attempts, Petro finally manages to contact R2-D2 and Ganodi aboard their cruiser, who have just restored Huyang to an operative state (minus his arms) once more. The three of them set out to aid their friends at once, and attempt to pick them up in mid-run via the cruiser's boarding ramp. But in the midst of the evac attempt, their speeder races to a ravine, forcing Petro to turn about, leaving Byph and Gungi to hang precariously from the ramp. During a second attempt, however, the pirates manage to hit the cruiser's engines critically, forcing an immediate evacuation of the Crucible before it crashed down on the Florrum plains, taking the Jedi's ride with it. They are all then cuffed and taken prisoner on the pirate's tank."}, {"tag": "p", "text": "With the Jedi in shackles, the pirates return to their base, only to suddenly find it being paid an unpleasant surprise visit by a Separatist droid army under the command of General Grievous in person. Taking the baffled band by surprise, Grievous opens a holo-communication channel through which Count Dooku contacts Ohnaka. The Count, having neither forgotten nor forgiven Hondo's questionable hospitality during their first encounter, announces that he takes control of the planet and plans to dismantle Ohnaka's arsenal. When Ohnaka protests against this, he is swiftly incarcerated."}, {"tag": "p", "text": "In the face of this common crisis and need to escape the Separatists' clutches, Ahsoka begins to argue with her captors. Following her suggestion that the pirates must have some additional ships stashed away somewhere, the pirate leader reveals that Hondo does have a private fleet, but only he knows where it is hidden. Ahsoka argues that as with her knowledge of Grievous, she could be a valuable help for them all, whereupon the pirates release her and the younglings. Ahsoka then devises a plan to use R2 and the pirate's tank to divert the droids' attention for a bit while she and part of her entourage sneak into the pirate base and find their way to Hondo's cell. After some arguing, Hondo demands that the younglings show him their lightsabers to demonstrate their readiness for the fight ahead. All the younglings ignite their sabers, except for Katooni, who still hasn't managed to make hers work. With some encouragement from Huyang and Hondo, however, Katooni finally succeeds in correctly assembling her weapon and freeing Hondo from his electronic field shackles."}, {"tag": "p", "text": "The united Jedi and pirates proceed to liberate the rest of Hondo's men, but one droid manages to alert Grievous to their presence, and Grievous decides to cut the problem short by having the prison section levelled by his tanks. But their opposition manages to break out and flee the base with their remaining vehicles, whereupon Grievous and several STAPs give chase. Barely evading their pursuers, who continue to chase after Ahsoka and the other Jedi, Katooni, Hondo and his pirates reach a hidden hangar wherein Hondo's secret ships are kept. Hondo decides to fly away from the battle at first, but Katooni succeeds in appealing to his sense of honor."}, {"tag": "p", "text": "In the meantime, Grievous prepares to board the Jedi's speeder tank, which forces R2 to execute some risky maneuvers in an attempt to shake him off. However, this move leaves the tank crashed instead. The stunned Jedi recover just as Grievous moves in for the kill when Ohnaka's escape ship, the rebuilt Slave I, arrives on the scene to pick him up. Ahsoka sends her youngling charges to the craft and engages Grievous in combat to cover their escape. She then barely escapes onto the ship on her own, and before Hondo has a chance to properly repay Grievous for his cordiality, a squad of AATs forces them to withdraw for good."}, {"tag": "p", "text": "After meeting with a Republic rescue team which has already picked up Obi-Wan Kenobi and the remnants of his men following their near-fatal defeat by Grievous' hands, Ohnaka boldly attempts to weasel his way out of trouble by claiming that his previous attack on the Crucible was merely a \"rescue mission,\" and due to bemusement and Hondo's aid to the younglings, Obi-Wan decides to leave it at that. Hondo departs, but not before giving Katooni a nod of appreciation. Obi-Wan approaches Ahsoka, and expresses relief in seeing her and the younglings unharmed. Ahsoka's reply sparks Huyang to remark on their mission as being as eventful as when Master Yoda went to get his kyber crystal. After lauding the younglings for their success in the liberation mission, Obi-Wan invites them to form a wheel with their ignited lightsabers, formally welcoming the younglings into the Jedi Order."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"A Necessary Bond\" is the conclusion to a four-part story arc, which was titled \"Young Jedi\" and previewed as a full-length 80-minute feature at Celebration VI in August 2012 to family viewers. It replaced \"Secret Weapons,\" originally reported by Star Wars Insider 137, as the ninth episode in Season Five. Some of the ideas in this story came from a scrapped pilot script for a spin-off TV series."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}