{"url": "Clat%27Ha", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Character stubs", "Category:Businesspeople", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Clat'Ha"}, {"tag": "p", "text": "Clat'Ha was a Human female who worked as the chief operations manager for Arcona Mineral Harvest Corporation. She also had a deep rivalry with Jemba the Hutt and was a close friend to the Arcona miner Si Treemba. She was one of the first of the miners to befriend Obi-Wan Kenobi after his fight with Grelb the Hutt."}, {"tag": "p", "text": "She once saved Qui-Gon Jinn's life during a pirate attack on the transport they were traveling on, the Monument. A Togorian pirate captain was about to kill Qui-Gon, and failed to notice the presence of Clat'Ha, who shot him in the head. Along with Qui-Gon and Obi-Wan Kenobi, she later helped defend a cave in which crew and passengers of the Monument were hiding from draigons, after the Monument crash-landed on a blue marble planet near Bandomeer."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 44 BBY, Clat'Ha and the corporation miners left Coruscant to set out to Bandomeer and oversee the extraction of minerals that were on the planet. While boarding the Monument, she saw a young boy who was severely beaten by Grelb the Hutt. The boy was revealed to be Obi-Wan Kenobi. Clat'Ha immediately saved his life and took the unconscious Initiate on board the ship. When Obi-Wan woke up, Clat'Ha was impressed by his courage and offered him a job in the corporation. She explained to him about the war between both corporations and added that one of the managers of Offworld Mining, a Hutt named Jemba, hindered this task to increase the price of his employees. Obi-Wan suggested that both companies should reach an agreement, but Clat'Ha firmly refused since she couldn't risk everything for her employees."}, {"tag": "p", "text": "When the Monument was under attack by pirates, Clat'Ha saved the life of Jedi Master Qui-Gon Jinn when a Togorian pirate attempted to kill him, and failed to notice the presence of the young woman who shot him in the head. Qui-Gon was wounded, and Clat'Ha refused to leave him while the pirates were overwhelmed by Jemba's employees. After the pirates fled, the Monument had to make an emergency landing on an island of an unknown planet with five moons. Before landing, Clat'Ha, accompanied by Kenobi and Jinn, went to meet Jemba, who was enticing a number of employees from Clat'Ha's corporation to join his. A number of miners began to move towards the Hutt, but Clat'Ha was able to prevent that from happening."}, {"tag": "p", "text": "Sometime later, when the Monument landed on an island, Clat'Ha and the rest of the crew prepared to evacuate when the transport began to flood. She was surprised to learn that Qui-Gon reported that he had discovered the location of the dactyl which Jemba and his thugs stole from the transport. Together with the crew, Clat'Ha and Qui-Gon moved to one of the caves that were on the island until they were attacked by the draigons. She helped defend the caves and contacted Aggaba. She offered to let the Hutt join her corporation. Aggaba and his staff agreed, and the fight between the two companies came to an end. After the fight ended, the engineers were able to repair the Monument, and the companies withdrew from the planet. Clat'Ha remained on site and directed her activities of both companies until her death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}