{"url": "Cleansing_of_Kashyyyk", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of Kashyyyk", "Category:Great Hunt cleansings"], "nodes": [{"tag": "h1", "text": "Cleansing of Kashyyyk"}, {"tag": "p", "text": "In 3993 BBY, Jedi Knight Guun Han Saresh ventured to the Wookiee world of Kashyyyk to hunt a \"great beast\" that was rumored to reside in the planet's Shadowlands. During the Great Hunt, a collaborative Jedi effort to rid the galaxy of Sith-created monstrosities in the aftermath of the Great Sith War, Saresh had established himself as one of the very best hunters in the entire Jedi Order. As such, he was handpicked by the Jedi High Council for a secret mission to rid the Sith homeworld of Korriban of the vicious terentatek beast. However, Saresh left the group and instead went to hunt the rumored \"great beast\" of Kashyyyk, which he believed to be a terentatek. After setting a trap for the beast in the Shadowlands, Saresh attacked the terentatek with his Force-imbued blade—unfortunately for Saresh, the sword shattered on his prey's tough hide, and the defenseless Jedi was eaten alive."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3996 BBY, Sith Lords Exar Kun and Ulic Qel-Droma launched the Great Sith War against the Jedi Order and Galactic Republic. Although the Sith were eventually defeated, alchemically-created monstrosities that had been bred by the dark side users still survived on planets across the galaxy and threatened both the Jedi and the general populace. In response, the Jedi High Council organized the Great Hunt, a collaborative effort to eliminate these beasts wherever they tread. Over the next three years, one particular group of hunters that included Humans Duron Qel-Droma and Shaela Nuur, along with Twi'lek Guun Han Saresh, established itself as the best the Order had to offer. After the team cleansed the planet of Tatooine of the vicious and highly dangerous terentatek beast, an official end was called to the Great Hunt. However, the Jedi Council selected Qel-Droma, Nuur, and Saresh for a special, secret mission—to exterminate terentateks on the Sith homeworld of Korriban, a world deeply steeped in the dark side."}, {"tag": "p", "text": "The Korriban mission did not go according to plan. Saresh, disapproving of the budding romance between Qel-Droma and Nuur, eventually left the group, traveling to the Wookiee world of Kashyyyk in order to hunt a \"great beast\" that he had heard lived in the planet's Shadowlands, which he believed to be a terentatek. After arriving on Kashyyyk and investigating the \"great beast,\" Saresh became convinced that it existed, and descended into the Shadowlands in order to begin the hunt."}, {"tag": "h2", "text": "The cleansing"}, {"tag": "p", "text": "Once in the dark Shadowlands, Saresh decided to set a trap for the terentatek. This he accomplished by using his crossbow to slay an avian mykal beast, which he hung in the air with some vines. Saresh retreated to a high rock overlook and waited for the \"great beast\" to arrive—soon enough, the terentatek came to feast on the mykal. Not seeing Saresh emerge from his perch, the terentatek was on the receiving end of a surprise attack from Saresh's Force-imbued blade. However, to Saresh's horror, the Jedi's sword was shattered at the hilt by the terentatek's thick hide. Left defenseless, Saresh was devoured by the beast."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the Jedi Council was relatively certain that Saresh had died, it had no knowledge about his exact fate, since it was too dangerous to send someone out to find his body. The same day that Saresh perished on Kashyyyk, his former compatriots Qel-Droma and Nuur were also slain by terentateks in Korriban's Valley of the Dark Lords. In 3956 BBY, thirty-seven years after the death of Guun Han Saresh, the Jedi Revan killed the terentatek that had claimed the Twi'lek's life on Kashyyyk, finding Saresh's datapad and his Circlet of Saresh in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Saresh's battle on Kashyyyk was first mentioned in the 2003 video game Star Wars: Knights of the Old Republic, in which the terentatek involved can be fought by the player-character, Revan. The skirmish appeared for the first time in \"Shadows and Light\", written by Joshua Ortega and illustrated by Dustin Weaver, which was one of the stories in 2005's Star Wars Tales 23. The battle was also referred to in the reference book The New Essential Chronology and in a Codex entry for the 2011 video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}