{"url": "Cleansing_of_New_Plympto", "categories": ["Category:Legends articles", "Category:Battles of the early Imperial campaigns", "Category:Battles of the Great Jedi Purge", "Category:Battles of New Plympto"], "nodes": [{"tag": "h1", "text": "Cleansing of New Plympto"}, {"tag": "p", "text": "The Cleansing of New Plympto began immediately after the end of the Clone Wars."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The conflict on New Plympto began when Nosaurians joined Separatists during the Clone Wars. The Galactic Republic invaded the planet, engaging both Nosaurians and battle droids in combat. However, despite deactivation of their droid army at the end of the war, the Nosaurian Separatists managed to escape the battle and regroup."}, {"tag": "p", "text": "When Order 66 was executed, Dass Jennir, the Jedi General in charge of the clone army, was betrayed by his own troops and almost killed. Having discovered the destruction of the Jedi Order by the newly-established Galactic Empire during a brief trip to Coruscant, Dass Jennir returned to New Plympto to lead the Nosaurian Separatists against the Imperial forces who had threatened them with retaliation."}, {"tag": "h2", "text": "One month of fighting"}, {"tag": "p", "text": "The fighting lasted for a month, with ambushes on Imperial armored columns and heavy guerrilla warfare. Eventually, Palpatine sent the 501st Legion to reinforce the troops on New Plympto. There they worked closely with light tank units to put down the revolt."}, {"tag": "p", "text": "The Nosaurians' last stand was at the Battle of Half-Axe Pass, where the remnants of their army attempted to cover for their families who were being evacuated off-planet, by holding off the approaching stormtroopers at Half-Axe Pass. Fortifying themselves on the hillside, the Nosaurians held off the troops, using frequent hit and run attacks, until TX-130T fighter tanks arrived."}, {"tag": "p", "text": "While the tanks opened fire on the defenders and made their way towards the fortifications, Dass Jennir and Bomo Greenbark made their way to a tree near the first tank. Cutting it down with his lightsaber, Jennir managed to destroy the first tank in line, and ordered his troops to withdraw to the crest of the hill."}, {"tag": "p", "text": "Clone Commander Vill, the 501st's on-planet commanding officer, didn't fall for the same trick twice and opened fire on Jennir's position. Both he and Greenbark fell into a hole which the blast had uncovered, losing consciousness until hours after the battle had ended."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Top-side, the surviving Nosaurian fighters attempted to surrender to the Imperial forces. However, they were summarily executed by the stormtroopers of the 501st. Their families were captured before they could enter the main spaceport and were scheduled for transportation to Orvax IV to be slaves. The decision made Darth Vader uneasy; after all, Anakin Skywalker had been a slave."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}