{"url": "A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy", "categories": ["Category:Real-world articles", "Category:Canon young-reader novels", "Category:Junior film novelizations"], "nodes": [{"tag": "h1", "text": "A New Hope: The Princess, the Scoundrel, and the Farm Boy"}, {"tag": "p", "text": "A New Hope: The Princess, the Scoundrel, and the Farm Boy is a canon junior novel written by Alexandra Bracken, with cover art by Khoa Ho and interior art by Ralph McQuarrie and Joe Johnston. It is a retelling of the film Star Wars: Episode IV A New Hope, and it was first published on September 22, 2015 by Disney–Lucasfilm Press. In addition to print, the title was released as an audiobook read by Marc Thompson and Rebecca Soler."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"The galaxy is at war."}, {"tag": "p", "text": "Although the Rebel Alliance has won a few battles against the Empire, hope is fading. The Empire is about to finish building the greatest weapon the galaxy has ever seen—the Death Star. The rebels' only chance to defeat it now lies in the unlikely hands of a princess, a scoundrel, and a farm boy. . . ."}, {"tag": "p", "text": "Acclaimed, New York Times bestselling author Alexandra Bracken delivers a captivating retelling of Star Wars: A New Hope like you've never experienced before. Since the premier of the original film, Princess Leia, Han Solo, and Luke Skywalker have become iconic, larger-than-life characters. The Princess, the Scoundrel, and the Farm Boy takes a deeper look at these three heroes as they join forces to defeat the evil that threatens their entire galaxy.\""}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Author R.J. Palacio was slated to write the book, but due to scheduling conflicts, she was replaced by the book's current author, Alexandra Bracken."}, {"tag": "p", "text": "The title was marketed for several months with the subtitle \"Being the Story of Luke Skywalker, Darth Vader, and the Rise of the Rebellion,\" but this subtitle was dropped in listings not long after the announcement of the change in author to Alexandra Bracken. The title was later pushed from its original publication date of June 23, 2015 to September 22, 2015."}, {"tag": "p", "text": "On June 5, 2015, Disney revealed the cover artwork for the titles in the series."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The title includes material adapted from the radio dramatization of A New Hope."}, {"tag": "p", "text": "The section The Farm Boy is not internally consistent with itself regarding the duration of events. On some pages, Luke thinks that he only knew Obi-Wan for one day or lost his family the day prior to meeting Leia; on others, it has been a few days."}, {"tag": "p", "text": "This book reveals that Han Solo couldn't have been more than ten years older than Luke Skywalker. Since Luke was born in 19 BBY that would place Han's birth circa 29 BBY. However, information revealed in Solo: A Star Wars Story The Official Guide contradicts this by setting Solo's birth circa 32 BBY."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}