{"url": "Cliegg_Lars", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Humans", "Category:Males", "Category:Moisture farmers", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Cliegg Lars"}, {"tag": "p", "text": "Cliegg Lars was a human male moisture farmer from Tatooine. He had one son, Owen Lars, from his first marriage. In the years prior to the Clone Wars, he met Shmi Skywalker and freed her from slavery before marrying her. As such, he was the step-father of Anakin Skywalker, and the step-grandfather of Luke Skywalker and Leia Organa."}, {"tag": "p", "text": "Shortly before the outbreak of the Clone Wars, Shmi was captured by a band of Tusken Raiders. Lars and a number of other moisture farmers attempted to save her, but the sand people drove them back, and Lars lost his right leg as a result. Anakin Skywalker later arrived on Tatooine, having had visions through the Force of Shmi's suffering and met Lars. Skywalker found his mother, but she died in his arms and he returned her body to the Lars moisture farm for burial, where Lars said goodbye to his wife before dying sometime later."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cliegg Lars was born on Tatooine to Gredda and Lef Lars. He had a brother named Edern, but he died at the age of fourteen in a landspeeder accident. When Cliegg grew up, he became a moisture farmer. He lived on his family's homestead near the settlement of Anchorhead. He married a woman named Aika and together they had a son, whom they named Owen. However, Aika died and Cliegg and Owen continued to run the homestead. Later on, Owen's girlfriend Beru Whitesun, went to live with them on the farm."}, {"tag": "p", "text": "A few years before the Clone Wars, Lars took a trip to the spaceport settlement of Mos Espa, where he met Shmi Skywalker, a slave owned by Watto, a Toydarian junk dealer. Lars fell in love with Shmi and bought her from Watto, thus freeing her from slavery. The two married and lived together as husband and wife for many years. Approximately, one month before the First Battle of Geonosis, however, Shmi was kidnapped by a group of Tusken Raiders. An enraged Lars gathered dozens of other farmers and set out to rescue his wife. Although thirty farmers went out looking for her, only four returned alive. Lars himself returned maimed, having lost his right leg to the sand people."}, {"tag": "p", "text": "A month after Shmi's disappearance, her son, Jedi Padawan Anakin Skywalker arrived on the farm looking for her, having had Force visions of her suffering. Lars and his family met Skywalker for the first time and explained to him what had happened with the Tusken Raiders. Although Lars told his stepson to accept that Shmi was gone, Skywalker was determined to find his mother and set out into the desert to locate the sand people. He found them and his mother, but she died in his arms. Skywalker returned to the farm after slaughtering the Tusken Raiders for revenge, with his deceased mother. Skywalker quietly blamed them before he and, along with Lars and his family, buried Shmi on the farm next to Lars's brother and parents. Skywalker left shortly thereafter, leaving the Lars family behind and taking the droid C-3PO with him. Soon after these events, Cliegg died, passing on the moisture farm to his son and his daughter-in-law Beru. He was buried alongside his second wife, Shmi, sometime after his death at the Lars Moisture Farm on Tatooine."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "At some point, Owen and Beru were assumed to have removed the headstone from Cliegg Lars and Shmi Skywalker's graves as a way of protecting the true identity of their nephew Luke Skywalker."}, {"tag": "p", "text": "Years later, Skywalker, who had now become the Sith Lord Darth Vader, revisited the homestead where Lars had once lived before his death in order to find more information on his son, Luke Skywalker, who had recently escaped him during their duel on Cloud City. As they arrived, the droid Vader had brought along, ZED-6-7, listed off the former residents of the homestead, giving Vader flashbacks for each one, including Cliegg. Later, the two discovered Lars and Shmi's graves, angering Vader further and leading him to use the Force to create a giant wave of sand in frustration."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lars was a human male who stood at a height of 1.83 meters. He had blond hair, blue eyes, and light skin. While attempting to rescue his wife, Lars lost his right leg in pursuit of the Tusken Raiders. He felt a wave of anger towards the sand people for taking Shmi, and felt that they were savage and vicious monsters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cliegg Lars was introduced and made his first canonical appearance in the 2002 film Star Wars: Episode II Attack of the Clones. He was portrayed by actor Jack Thompson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}