{"url": "Cliffborer_worm", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Arthropods", "Category:Cliffborer worms", "Category:Desert creatures", "Category:Non-sentient species", "Category:Outer Rim Territories species", "Category:Predatory creatures"], "nodes": [{"tag": "h1", "text": "Cliffborer worm"}, {"tag": "p", "text": "Cliffborer worms, also known as Arthropod Worms,[source?] were parasitic, almost mindless, burrowing arthropods common throughout the galaxy. They flourished specially on the many planets that featured mainly arid and rocky climates, such as Tatooine."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Cliffborer worms were long, armored creatures who fed on razor moss and lichen, with a single pair of insectoid legs used primarily for locomotion. During mating season, however, these legs could be used as dangerous offensive weapons. Belligerence was restricted to their mating season or in defense of a nest. A pair of cliffborers would guard their nest of two to twelve eggs until they hatched, after which they would abandon the young to fend for themselves. Many hatchlings would end up as meals for krayt dragons or dewbacks since their hides did not harden until they reached a meter in length, approximately one month after birth. They were equally active day and night, so were usually alert despite their frequent lack of motion."}, {"tag": "p", "text": "Though never proven, some xenobiologists surmised that cliffborers never stopped growing, and did not die from old age, proposing that in deep, secluded desert environments, worms could reach lengths upwards of twenty to thirty meters in length. However, three- to four-meter specimens were more common."}, {"tag": "p", "text": "Economically, the tough hide of the cliffborer was a popular material for use in making sturdy boots. It also has found use as a component in sail barge construction and in similar vehicles. Some small efforts were made to adapt its hide for body armor, but results proved unsatisfactory due to being hot and cumbersome. Moreover, domestication proved problematic and failure-prone because their propensity for tunneling through most containment. As a result, more than one world has a small cliffborer worm population from failed domestication attempts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}