{"url": "Cliff_wampa", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Semi-sentient species", "Category:Wampa subspecies"], "nodes": [{"tag": "h1", "text": "Cliff wampa"}, {"tag": "p", "text": "The cliff wampa was a brown-furred, rock-climbing subspecies bioengineered from the wampa ice creature native to the frozen Outer Rim Territories planet Hoth. After learning of the ice wampa's powerful ferocity during the Battle of Hoth, the Galactic Empire captured several of the creatures, and Imperial biologists artificially adapted them to various environments. By 3.5 ABY, the Empire had placed the resulting cliff wampa on the rocky Outer Rim moon of Gall to guard local Imperial interests."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A product of Imperial bioengineering, the cliff wampa was a manufactured subspecies of the wampa ice creature indigenous to the ice planet Hoth. Whereas the ice wampa was covered with a coat of white fur for camouflage on Hoth's frozen plains, the cliff wampa was gray or light brown in color to blend in with the rocky habitat of the Imperial-controlled moon of Gall. The cliff wampa boasted sharp, iron-strong claws capable of climbing or digging through solid rock, much like the Hoth wampa would dig through ice."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Like its Hoth cousin, the cliff wampa was semi-sentient in nature. Cliff wampas were temperamental and hungry, and would maul anything or anyone they encountered."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The origin of the cliff wampa began during the Rebel Alliance's tenure at the Echo Base facility on the Outer Rim Territories ice planet Hoth. The Rebels of Echo Base endured repeated assaults on their encampment from Hoth's native wampas. During one such attack, the Rebels neutralized and incarcerated several of the creatures, holding them in secluded pens within the base."}, {"tag": "p", "text": "Later, during the Imperial assault on Echo Base in the Battle of Hoth, several of the Dark Lord Darth Vader's elite snowtroopers were slaughtered by the Rebels' caged wampas after charging blindly into one of the creatures' holding pens inside the base. Imperial biologists were so impressed with the powerful wampa after receiving reports of how the creatures terrorized Echo Base that the Empire managed to capture some of the beasts and, through bioengineering, adapted them to survive in various environments as guard animals. The cliff wampa was a result of the Empire's efforts."}, {"tag": "h2", "text": "Cliff wampas in the galaxy"}, {"tag": "p", "text": "By 3.5 ABY, just months after the Battle of Hoth, the Empire installed the cliff wampa to guard the Cadavine Sector Fleet Imperial Enclave on the rocky Outer Rim moon of Gall. The mercenary Dash Rendar, who had previously come face-to-face with the Rebels' captured ice wampas within the bowels of Echo Base during the Battle of Hoth, encountered a single cliff wampa while attempting to infiltrate the Imperial Enclave through the high cliffs of Smuggler's Canyon in a failed effort to rescue the captive Han Solo from the bounty hunter Boba Fett."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cliff wampa was created for the 1996 video game Star Wars: Shadows of the Empire. According to Shadows of the Empire game creator Jon Knoles, as recounted in the Star Wars Insider 33 article LucasArts takes on the Wampa, the LucasArts game developers inserted a rock-camouflaged wampa into the \"Gall Spaceport\" level as a way to have fun with the game—developer Ryan Kaufman is jokingly listed in the game credits as \"Cliff Wampa Zoologist.\" The article likens the cliff wampa's appearance in Shadows of the Empire to any number of hidden tricks, or \"Easter eggs,\" that game designers have always created to \"stretch the fun factor\" but noted that LucasArts developers tried to be conservative with what secrets they included in their games, knowing that anything they created could later appear in other Star Wars works and thus become official canon when it was never meant to be."}, {"tag": "p", "text": "The 1996 Star Wars: Shadows of the Empire Limited Collector's Edition strategy guide for the Shadows of the Empire video game, compiled by Crispin Boyer, was the first source to identify the \"Gall Spaceport\" creature as a \"cliff wampa.\" Jon Knoles described LucasArts' original backstory for its \"fabled\" creature as the result of Imperial bioengineering, information later fully canonized in the 2006 reference book The New Essential Guide to Alien Species. In both Shadows of the Empire: Game Secrets and Shadows of the Empire: The Official Strategy Guide, published by Prima Games, writer Bart Farkas colloquially refers to the cliff wampa as a \"mountain wampa.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}