{"url": "Clip_beetle/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Beetles", "Category:Creatures of unspecified diet", "Category:Food creatures", "Category:Jungle and forest creatures", "Category:Non-sentient species", "Category:Swamp creatures", "Category:Yuuzhan Vong creatures"], "nodes": [{"tag": "h1", "text": "Clip beetle"}, {"tag": "p", "text": "Clip beetles were small, non-sentient insects that were created by the Yuuzhan Vong species. In existence by 27 ABY, the beetles had an abdominal shell, a head with a pair of mandibles, and its flesh and shell were both nutritious. A clip beetle's head could be used as a natural type of stitching for wounds; the beetle could be encouraged to bite the flesh on either side of the wound, and the rest of the beetle's body would then be removed. The head would be left in place with the jaws still holding the wound shut."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Clip beetles were a species of non-sentient insects that had an abdominal shell, as well as a head with a pair of mandibles. The beetle was small enough that an average-sized Human could crack a clip beetle's shell open between a thumb and the first knuckle on one of his or her hands. The flesh of a clip beetle was pale purple in coloration and was prized because of the significant amount of proteins and fats present in it. To some Humans, clip beetle flesh tasted like Mon Cala ice-lobster. The shells of the beetles were also high in nutrition."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Clip beetles were able to survive in the Nursery, the central chamber within a Yuuzhan Vong seedship, which contained swamps, jungles, and hills. When flesh was presented to them, clip beetles attacked it ferociously, biting it with their mandibles to hold on. Clip beetles could be persuaded to let their jaw hold lapse if they were tickled near the head joint. Because of their tight grip with their jaws, clip beetles were renowned by the Yuuzhan Vong species for their use as natural stitches with which to close wounds. A clip beetle could be taken and placed close to an open wound, and the insect would latch onto the flesh on either side. By twisting the body attached to the head, the two parts would separate, leaving the head with its jaws closing the wound shut. Wounds could take up to twenty-three clip beetle heads to close."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Clip beetles were genetically created by the sentient Yuuzhan Vong species sometime prior to 27 ABY, by which time the Yuuzhan Vong were involved in the Yuuzhan Vong War, a conflict that erupted when they invaded the galaxy of the New Republic. The Yuuzhan Vong prized clip beetles for both their nutritional value and their ability to be used as a natural stitch. During the Yuuzhan Vong War, clip beetles were present in the Nursery, which was a playground for infant dhuryams who had telepathic abilities. There, the captured Jedi Jacen Solo made use of clip beetles to both feed himself and close the wounds of fellow slaves."}, {"tag": "p", "text": "By 27 ABY, the Yuuzhan Vong fed nutritional clip beetle shells to the immense ganadote creatures to help the creatures grow. Clip beetles were also present on the planet Coruscant in 28 ABY. The Yuuzhan Vong had captured Coruscant from the New Republic, and disgraced Yuuzhan Vong Executor Nom Anor used clip beetles to help close the wounds of the warrior Kunra."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clip beetles were first mentioned in The New Jedi Order: Enemy Lines II: Rebel Stand, a 2002 installment of The New Jedi Order series by Aaron Allston. The beetles later appeared in two other books in that same series: The New Jedi Order: Traitor, released in 2002 and written by Matthew Stover, and 2003's The New Jedi Order: Force Heretic I: Remnant, by Sean Williams and Shane Dix. Clip beetles later received their own entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}