{"url": "Clive_Flax", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Humans", "Category:Information brokers", "Category:Males", "Category:Resistance fighters", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Clive Flax"}, {"tag": "p", "text": "Clive Flax was a double agent and a friend of Ferus Olin. He would often pose as a musician in nightclubs to gather the information he needed unnoticed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Clive Flax was a native of the planet Belazura, but he felt no attachment to his homeworld, and wandered the galaxy. Flax met Olin shortly before the Clone Wars, when the former Jedi was still operating his company Olin and Lands on Bellassa. After the galaxy-wide war erupted, Ferus assigned Flax to an operation on the planet Jabor. Using his skills of infiltration, Flax was able to reveal and sabotage a ring of Separatist spies that ran throughout the Mid Rim."}, {"tag": "p", "text": "After the rise of the Galactic Empire, Flax found it more difficult to operate and was eventually arrested and thrown into a prison on the planet Dontamo. Eventually he was reunited with Ferus after he was also sentenced to Dontamo. Flax found and rescued him from an angry fellow prisoner and together they escaped the prison. Flax traveled with Ferus and his companions to Naboo where they received help from Boss Rugor Nass and the Gungan people to rid Naboo of Imperial activity."}, {"tag": "p", "text": "Clive later helped Ferus find a saboteur of the computer system on the planet Samaria. He escaped the Empire's clutches with other members of the Erased, but Ferus stayed behind, challenging Darth Vader."}, {"tag": "p", "text": "Clive returned to Olin's secret asteroid base, upset that he had to help out with fixing the place up."}, {"tag": "p", "text": "Later, Clive asked Astri Oddo to help him to find out who Flame really was. After going to Niro 11, the two ended at Eve Yarrow's home on Revery. It was there they discovered that Flame was in fact Eve Yarrow, and that she was in league with Darth Vader. Astri and Clive then contacted the base, warning them of this."}, {"tag": "p", "text": "After the base was destroyed by Vader's superweapon, himself and Astri agreed to adopt Trever after he was brainwashed so that he knew nothing about Darth Vader's real identity or anything that happened in the last year."}, {"tag": "p", "text": "Before the Battle of Yavin, Clive and Astri were killed by Imperials on an Imperial garrison."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Return of the Dark Side misspells Clive Flax as Clive Fax."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}