{"url": "Cloak_of_Darkness", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Cloak of Darkness"}, {"tag": "p", "text": "\"Cloak of Darkness\" is the ninth episode in Season One of the Star Wars: The Clone Wars television series. It is the ninth episode of the series overall and the second in a three-part storyline started with the previous episode, \"Bombad Jedi.\""}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Ahsoka and Jedi Master Luminara escort captured Viceroy Nute Gunray to trial, unaware that Count Dooku has dispatched his deadly apprentice assassin Asajj Ventress to free the prisoner and eliminate the Jedi."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Viceroy Gunray has been transferred to the Tranquility under Luminara Unduli, where he was to be carefully taken to Coruscant to face trial for war crimes. Ahsoka and a number of Senate Commandoes under Captain Faro Argyus had also been transferred. Ahsoka does not think that all the extra security is necessary, but Master Unduli assures her that the Neimoidian is more dangerous than he looks. Unduli suggests that his allies could be conspiring against them."}, {"tag": "p", "text": "Elsewhere, Darth Sidious informs Count Dooku that Gunray poses a significant danger to them and their plans if he is interrogated. Dooku tells him that he has already put a plan into motion. Dooku is sending his assassin and best agent Asajj Ventress, despite her previous failures, to either rescue or silence Gunray. Once Sidious is gone, Dooku impresses on Ventress the fact that failure is not an option."}, {"tag": "p", "text": "Back on the Tranquility, Unduli and Ahsoka interrogate the Viceroy. When they get nowhere and the Viceroy refuses to answer their questions, Ahsoka threatens him, only to be chastised by Unduli. Nonetheless, the threats coerce Gunray to start talking. Unfortunately for the two Jedi, a swarm of Vulture Droids escorting three Separatist boarding ships attack the Tranquility. Super battle droids assault the Cruiser and hold off the clones, allowing Ventress to slip inside undetected. Commander Gree, a squad of Green Company, and Unduli go off to deal with the droids, leaving Ahsoka to guard Gunray. Ventress infiltrates the engine room and plants a number of thermal charges on the cruiser's generators before going to the brig. The Super Battle Droids are destroyed, leaving Ventress the last enemy on board. She duels Ahsoka for a short while before ironically locking her in Gunray's cell. Luckily, Unduli's timely arrival prevents Ventress from rescuing Gunray. Unfortunately, the assassin detonates the charges, rocking the ship before fleeing down the elevator shaft. Unduli goes after Ventress, confident that she can defeat the assassin, leaving Ahsoka again, in spite of the Padawan's insistence that Ventress is too dangerous for any one Jedi to combat. Argyus advises Ahsoka to do what she thinks is right, Gree tells her she should just follow orders, while Gunray simply states “All I know is I never risk my own skin if I don't have to.” to which Ahsoka, Gree, and Argyus all glare at him. Ahsoka goes to help Unduli."}, {"tag": "p", "text": "In the generator room, Ventress and Unduli duel: Unduli is swiftly outmatched as Ventress, outraged because Unduli is taunting her fighting style as a sloppy, amateurish and unrefined imitation of Dooku's, overpowers Unduli and traps her under a number of collapsed pipes. Ahsoka makes a timely save only for Ventress to escape again. She then press a button that activates a signal. Back in the brig, Argyus receives the signal and betrays his fellow commandos and frees Gunray, revealing that he was bribed by Dooku to help rescue the viceroy. Commander Gree manages to overpower him after a brief fight. Gree asks Argyus why he's doing this. Argyus tells him \"A clone like you wouldn't understand but I wanted a life filled with more than empty servitude.\" A disgusted Gree snarls, \"And for that you'd betray the Republic.\" Argyus states \"It's like I told the Padawan: Sometimes being a good soldier means doing what you think is right\" and dives for his blaster. Gree intercepts him and knocks him out. Gree snarls, \"You and I disagree on what makes a good soldier\" and prepares to kill the turncoat only to be knocked out by Gunray. They make their escape on the docked Republic ship in the lower hangar, joined by Ventress, who uses an escape pod. Argyus gloats that he will take most of the glory in his report to Count Dooku, but Ventress impales him, killing the turncoat."}, {"tag": "p", "text": "Later, Unduli and Ahsoka report to Yoda and Anakin Skywalker about the loss. They are told that they may be able to track the stolen ship. Ahsoka leaves to join Skywalker with Kit Fisto's fleet, but not before receiving an apology from Unduli for not having listened to her monition about Ventress."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Dooku is wearing his cape during his conversation with Sidious, but when Ventress enters the room immediately afterwards, the cloak has disappeared."}, {"tag": "p", "text": "When Ahsoka arrives, she is seen carrying Luminara's lightsaber, cuts Luminara free with it and then hands it back to her. All the while, her own lightsaber is not clipped to her belt, nor seen anywhere. However, when Ventress attacks them both, suddenly Ahsoka has her lightsaber."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}