{"url": "Clodhopper", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Birds", "Category:Creatures of Naboo", "Category:Flightless creatures", "Category:Herd and pack creatures", "Category:Hunted creatures", "Category:Non-sentient species", "Category:Omnivorous creatures"], "nodes": [{"tag": "h1", "text": "Clodhopper"}, {"tag": "p", "text": "Clodhoppers were omnivorous and dim-witted flightless avians from Naboo. A clodhopper was rarely more than three feet tall, but they fed in swarms, becoming a real menace. They were protected by tough, durable skin. A noteworthy attribute of the clodhopper was its ability to spawn 200 young in only two days, all of which spent most of their time eating. Fast-breeding, dimwitted, voracious herbivores, clodhoppers use their powerful forelegs to forage and hop."}, {"tag": "p", "text": "One favorite food of clodhoppers was the Tooke-trap plant."}, {"tag": "p", "text": "On Naboo, clodhoppers had natural predators like narglatches of any age, and even Gungans sometimes hunted them because of their meat (which made tasty snacks) and their thick skin (which was used to make musical instruments). Some centuries before the Battle of Naboo, however, the flightless birds were exported to other planets, which caused the utter devastation of entire colonies. Its export has been strictly forbidden since, under the maximum punishment allowable by law."}, {"tag": "p", "text": "The colony at Corva, in the Galaanus system, was wiped out by clodhoppers that had been accidentally shipped with grain from Naboo. Consequently, restrictions and inspection requirements on agricultural imports from Naboo existed on a number of worlds, some which callously supported the Trade Federation blockade in 32 BBY, if only to save the expense of funding inspections."}, {"tag": "p", "text": "On 32 BBY, the Army of Life managed to conceal clodhopper eggs in sealed boxes and shipped them to Stend IV in the Majestic Gundark."}, {"tag": "p", "text": "A Tarnab diplomat had a pet clodhopper."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A Clodhopper can refer to either a clumsy, coarse person or a large heavy shoe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}