{"url": "Clone_Commander", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Clone trooper commanders", "Category:Grand Army of the Republic ranks"], "nodes": [{"tag": "h1", "text": "Clone Commander"}, {"tag": "p", "text": "Clone Commander, also known as clone trooper commander, was a rank in the Grand Army of the Republic held by clone trooper officers who led regiments of 2,304 troopers. The sixteen clone commanders in each corps were in turn commanded by their respective Jedi General."}, {"tag": "p", "text": "Advanced Recon Commandos who served as commanders were known as Clone ARC Commanders. Clone trooper pilots could also serve as commanders. During the Clone Wars, Clone Commanders served under Jedi Generals and, like the rest of their clone brethren, fought against the Confederacy of Independent Systems. Near the end of the war, all clones were ordered by Supreme Chancellor Sheev Palpatine to betray and kill their Jedi officers."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "A Clone Commander, also referred to as a clone trooper commander, was a military rank given to clone trooper officers during the Clone Wars and early Imperial Era. The rank was used by the Grand Army of the Republic, the Republic Navy, and the Republic Starfighter Corps. In the Galactic Republic, the rank of Clone Commander could be given to clone trooper officers who also served as special ops clone troopers, Biker Advanced Recon Commandos, Clone SCUBA troopers, Advanced Recon Force Scout Troopers, clone navigation officers, and more. It was later used by the Imperial Military during the early implementation of Project War-Mantle."}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "Clone Commanders of the Republic Military typically received ARC training, although some, like CT-411 were not provided such regimen. Despite this, Clone Commanders who did not receive ARC training could be trained by senior instructors and become specialized, such as specializing in military reconnaissance. Clone trooper officers were selected to be part of a program that trained clone officers on how to work as liaisons between Jedi Generals and their subordinate clone troopers, though it was possible for some Clone Commanders to not be included and to not be briefed on how to interact with Jedi high command."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "Initially, Clone Commanders within the Grand Army of the Republic were outfitted with standard Phase I clone trooper armor featuring four yellow circles on the left chestplate as well as a stripe of yellow down the length of each arm, vertically up the middle of the helmet and laterally around the visor."}, {"tag": "p", "text": "Later, Clone Commanders, as with other clone officers, customized their armor with additional equipment including kamas, pauldrons, rangefinders, secondary communication antennas, visors, jetpacks, pistol holsters, macrobinoculars, bandoliers, rank insignia plaques, built-in lights, primary communications antenna, unit affiliation markings, and more. Jaig Eyes could also be added to the commander's armor. Phase II clone trooper armor allowed for greater modifications. Clone Commanders within the Republic Navy were equipped with a blue cloth fabric uniform, black gloves, and a rank insignia plaque."}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "h4", "text": "Grand Army of the Republic"}, {"tag": "p", "text": "The rank of Clone Commander was the highest rank achieved by a clone trooper, and was ranked higher than a Clone Captain. There were several variations of the rank, including Clone Marshal Commander and Clone ARC Commander for the different positions and roles Clone Commanders undertook. A Clone Marshal Commander served as the commanding officer of a corps within the Grand Army of the Republic, such as CC-2224 of the 7th Sky Corps and CC-1138 of the 21st Nova Corps. Other commanders who led a corps included CC-1004 of the 41st Elite Corps, CC-8826 of the 91st Mobile Reconnaissance Corps, and CC-5052 of the 327th Star Corps."}, {"tag": "p", "text": "Clone ARC Commanders were Advanced Recon Commandos who served as Clone Commanders. Multiple ARC Commanders could serve within the same unit, such as ARC Commanders \"Blitz,\" \"Colt,\" and \"Havoc\" from Rancor Battalion. Clone officers could be promoted to the rank of Clone Commander and be placed in command of half of a legion or the entirety of a division. A standard Clone Commander typically led a full regiment that consisted of sixteen companies. One such commander was CC-2801, who served throughout the Clone Wars."}, {"tag": "p", "text": "Clone Commanders could also command smaller military units such as battalions, which consisted of four companies. Such commanders included CC-3636 of the 104th Battalion, CC-1993 of his own special operations battalion, and \"Crane\" of the One-Eighty-Fourth. Clone Commanders could also command small specialized companies, such as a company of Clone SCUBA troopers. Clone Commander \"Monnk\" led a company of such troopers during the war. Commanders such as CT-411, who were not trained to serve directly under Jedi Generals, could be placed as their second-in-command. CT-411 also served as the commanding officer of Lightning Squadron, a light ground cavalry squadron."}, {"tag": "h4", "text": "Republic Navy and Starfighter Corps"}, {"tag": "p", "text": "Clone Commanders additionally served within the Republic Navy and the Republic's Starfighter Corps. A clone trooper pilot, CC-2237, held the rank of Clone Commander. Clone Commanders could serve as the commanding officer of a Venator-class Star Destroyer, or form part of its crew. Additionally, Clone Commanders had the capability of leading an entire flight group that consisted of multiple squadrons and flights."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "h4", "text": "Imperial Military"}, {"tag": "p", "text": "After the Galactic Republic's transition into the Galactic Empire, Clone Commanders were picked to lead new non-clone conscripted recruits. The first such unit, the first Elite Squad, consisted of four Elite Squad Troopers under the leadership of Clone Commander CT-9904."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Clone Commanders were trained by Jango Fett, the clone template of the Republic's clone forces. They debuted in the First Battle of Geonosis, in which multiple Clone Commanders participated in. While the members of the Jedi Order did not hold a formal rank in the Republic Military at the time, the clone troopers and their commanders served under the Jedi who acted as de facto generals on Geonosis. During the battle, Commander CT-411 reported to Jedi Master Mace Windu who took command of five special commando units. While Windu and other Jedi took to the field, leading clone troopers into battle against an army of battle droids, Grand Master Yoda oversaw the battle from the forward command center where a Clone Commander informed him of the Republic Army's progress. Yoda commended the commander after he reported that the Separatist Droid Army had fallen into retreat."}, {"tag": "p", "text": "After the fall of Geonosis, the Grand Army of the Republic assembled on the Republic capital of Coruscant. Supreme Chancellor Sheev Palpatine, along with members of the Galactic Senate, observed the newly formed Republic Military as Clone Commanders and their troops boarded the Acclamator-class transgalactic military assault ships, preparing to deploy throughout the galaxy to fight the forces of the Confederacy of Independent Systems."}, {"tag": "p", "text": "Clone Commanders were assigned to Jedi Generals after the Jedi adopted the role of leadership in the Grand Army of the Republic. Relationships of trust and respect developed between the commanders and their generals as they served together throughout the many campaigns of the Clone Wars. General Obi-Wan Kenobi and Commander CC-2224 served alongside each other as commanding officers of the 212th Attack Battalion. CC-2224 was particularly loyal to Kenobi, who found the Clone Commander to be a capable officer."}, {"tag": "p", "text": "Clone Commander CC-3636 and Jedi General Plo Koon also served together for the duration of the Clone Wars. While the clones considered themselves expendable due to their artificial nature, Koon valued their lives and risked his own to protect them. As a result, he developed a close bond with Clone Commander CC-3636. Under their leadership, the Wolfpack became one of the most renowned clone trooper squads in the Grand Army of the Republic."}, {"tag": "h3", "text": "Treason and purge"}, {"tag": "p", "text": "Despite the reservations of Admiral Wilhuff Tarkin regarding leadership in the Republic Military, Clone Commanders and Jedi Generals continued to lead the armies of the Galactic Republic as the Clone Wars entered its final year. The Republic's strategy now focused on the elimination of the remaining Separatist forces in the Outer Rim Territories. Clone Commander CC-5052 and Jedi General Aayla Secura personally oversaw the campaign on Felucia, while Clone Commander CC-1138 and Jedi General Ki-Adi-Mundi led the Republic assault on Mygeeto. Other battlefronts included Saleucami, where Clone Commander CC-8826 served alongside Jedi General Stass Allie, and Bracca, a Mid Rim planet that the 13th Battalion invaded under the command of Jedi General Jaro Tapal and his Clone Commander."}, {"tag": "p", "text": "In the aftermath of the Battle of Yerbana, Jedi General Anakin Skywalker committed half of the 501st Legion to the Siege of Mandalore, creating the 332nd Division while the remainder of his forces returned to the Core Worlds to defend the capital in the Battle of Coruscant. The 332nd was created in response to Skywalker's former Padawan, Ahsoka Tano, who supported Lady Bo-Katan Kryze's efforts to retake Mandalore from the rogue Sith Lord Maul and his Mandalorian super commandos. However, as Tano declined to rejoin the Jedi Order, she had forfeited her rank as a Jedi Commander and therefore could not lead Republic soldiers in an official capacity. As a result, Skywalker promoted his second-in-command, CT-7567 to the rank of Clone Commander, giving the former Clone Captain the authority to lead the new division."}, {"tag": "p", "text": "Following the successful defense of Coruscant, Clone Commander CC-1004 and the 41st Scout Battalion accompanied Jedi Generals Yoda and Luminara Unduli to Kashyyyk, intending to protect the strategically located homeworld of the Wookiee species. Following Yoda's departure, CC-2224 and Kenobi deployed their battalion to Utapau where General Grievous retreated in the wake of Count Dooku's death. However, with the Jedi High Council's failed arrest of Chancellor Palpatine—revealed to be the Sith Lord Darth Sidious—subsequent to Grievous' destruction during the Battle of Utapau, the chancellor ordered the Clone Commanders and their clone troopers to execute Order 66, immediately turning the Jedi's own army against them."}, {"tag": "p", "text": "Apart from the genetically defective clones of Clone Force 99, the behavioral modification biochips within their brains compelled the standard clone troopers to comply with Order 66, including the Clone Commanders who worked the closest with the Jedi Generals. Across the galaxy, the Jedi were gunned down by the soldiers and commanders whom they trusted, including Mundi who was killed by CC-1138, and Secura who was fatally shot in the back by CC-5052."}, {"tag": "p", "text": "Clone Commanders also had strict orders from Sidious to execute any clone trooper who defied his plan to systematically purge the Jedi Order. The surgical removal of CT-7567's biochip, however, allowed the Clone Commander to defend Ahsoka Tano against his own soldiers, who were still beholden to their programming. He was consequently demoted from the rank of Clone Commander and accused of committing treason against the Grand Army of the Republic by his subordinate, Clone Lieutenant CT-5597."}, {"tag": "h3", "text": "Changing of the guard"}, {"tag": "p", "text": "The rank of Clone Commander continued to exist in the Imperial Military during the early days of Sidious' reign as Galactic Emperor. It was granted to CT-9904, the only member of Clone Force 99 who remained loyal to the Galactic Empire. Seeking to test the initial results of Project War-Mantle, Admiral Tarkin ordered Commander CT-9904 to take a squad of enlisted soldiers to Onderon and destroy Saw Gerrera's insurgents."}, {"tag": "p", "text": "ES-01, one of the natural-born human soldiers in CT-9904's squad, doubted that the clone was fit to hold the rank of commander, especially as the Empire had begun its efforts to decommission the clone trooper program. However, CT-9904 asserted his authority by executing ES-01 for refusing to complete the mission, which included killing the civilians who traveled with Gerrera's group. The squad's success reinforced Vice Admiral Rampart's belief that the Imperial Army could be molded into an excellent fighting force unseen in galactic history, provided that non-clone soldiers learned from the experience of veteran clones such as Commander CT-9904."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}