{"url": "Clone_Cadets", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Cadets"}, {"tag": "p", "text": "\"Clone Cadets\" is the premiere episode for Season Three of the Star Wars: The Clone Wars television series. It aired on September 17, 2010 with the episode \"ARC Troopers\" for the season's one-hour premiere. It serves as a prequel to the first season episode \"Rookies.\" Chronologically, it follows the events of the pilot film Star Wars: The Clone Wars and is followed by the events of the episode \"Supply Lines.\""}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Five headstrong clones struggle to complete their training on Kamino. These cadets – Hevy, Cutup, Droidbait, Fives, and Echo – seem to be a \"bad batch\" and are unable to work as a team. As Shaak Ti and drill instructors Bric and El-Les debate the cadets' fate, the clones learn to work together and accept their destiny as soldiers."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Domino Squad is in the midst of a pre-graduation exercise on Kamino in preparation for the frontlines. The purpose of the test is to reach the beacon atop a citadel guarded by various practice droids. However, the five-clone squad's teamwork is dysfunctional, as noted by its instructor, hired bounty hunter Bric, who is observing the exercise with fellow hunter El-Les and Jedi Master Shaak Ti. Thinking the squad to be a total failure, Bric suggests these \"rejects\" be sent to maintenance duty with 99, a malformed clone."}, {"tag": "p", "text": "Bric's presumptions are soon proved right, as the practice droids defeat Domino Squad while it argues about procedure. As the clones retire to the barracks, Echo tries reminding his brothers that they have to follow orders. This gets him into a scuffle with CT-782 before Bric breaks it up and laments his disappointment in them. Elsewhere on Tipoca City, Lama Su is considering rejecting Domino Squad but leaves the decision up to Shaak Ti because of her position as head of training."}, {"tag": "p", "text": "The next day, ARC trooper Commander Colt and two others have arrived to supervise the graduation tests. Bravo Squad, the first to take the test, passes with flying colors in record time. When it's Domino Squad's turn, it fails when Droidbait is hit and 782 decides to leave him behind, and Colt reprimands the squad for its mistakes. As they are passing through the barracks, El-Les tells Bric that Domino Squad should retake the test, though Bric expresses little faith in his squad. 99 overhears the conversation."}, {"tag": "p", "text": "That night, Fives and Echo go to Shaak Ti to request a transfer to Bravo Squad. But Shaak Ti denies them and explains that they need to learn to work together with the rest of their squad; thus she permits them to retake the test the next day. Meanwhile, CT-4040 is summoned by Bric for a reprimand. The bounty hunter tries provoking the clone into attacking him, looking for an excuse to get him and his squad kicked out, but the cadet refuses to give in. The only thing at which Bric succeeds is unintentionally giving 4040 a nickname: Cutup."}, {"tag": "p", "text": "In the night, 99 catches 782 attempting to go AWOL. He convinces 782, whom he keeps calling Hevy, about the importance of brotherhood and teamwork. The next day, Hevy has taken 99's advice and nickname to heart, and takes leadership of his squad. This time, the clones have found the team cohesion they had lacked earlier, but when they reach the citadel, they realize that their ascension cables needed to scale it are gone; Bric had stolen them to test their skills and—if possible—see them fail. El-Les argues this unfairness to Shaak Ti, but she calmly states that the Separatists would not play fair either."}, {"tag": "p", "text": "Domino Squad quickly adapts to the situation by taking out the wall-mounted turrets and, using them as stepladders, successfully completes the test. Shaak Ti compliments Bric for his efforts in making these clones the best there are, and Bric is forced to admit that El-Les was right. Afterward, the bounty hunters give Domino Squad medals for graduation; but as a sign of gratitude, Hevy gives his to 99, so he will have a reason to return to Kamino. Domino Squad then joins the rest of its brothers in shipping out to the front lines."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "When preparing the final test for the cadets, Commander Colt tells El-Les to set the challenge to \"version THX variable 1138.\" This is one of the many references in George Lucas' work to his first feature film THX 1138."}, {"tag": "p", "text": "There is a continuity error involving the BX-series droid commandos utilized for the Citadel test, as in their first appearance in the episode \"Rookies,\" it's stated that the droids are new and have only been introduced into the war relatively recently."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}