{"url": "Clone_Intelligence", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be merged", "Category:Galactic Republic intelligence organizations", "Category:Grand Army of the Republic units"], "nodes": [{"tag": "h1", "text": "Clone Intelligence"}, {"tag": "p", "text": "Clone Intelligence was the military intelligence branch of the Grand Army of the Republic. During the Clone Wars, clone espionage units were tasked with tracking General Grievous, a Separatist commander and high-value target of the Galactic Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Like the Grand Army of the Republic, Clone Intelligence was composed of soldiers cloned from the genetic template of Jango Fett. In contrast to the average infantry trooper of the Grand Army, Clone Intelligence units were trained to support the Republic Military through espionage operations which involved tracking high-value Separatist targets such as General Grievous. Additionally, they provided the Grand Army with surveillance reports on experimental weapons developed by the Separatist military."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Searching for the Malevolence"}, {"tag": "p", "text": "Clone Intelligence personnel served in the Grand Army of the Republic from its founding in 22 BBY. In the same year, the Separatist navy completed construction on the Subjugator-class heavy cruiser Malevolence. At the time, the Republic had limited information pertaining to the new warship, although Clone Intelligence was able to learn that the Malevolence made a priority of killing survivors who witnessed its capabilities."}, {"tag": "h3", "text": "Search for Grievous"}, {"tag": "p", "text": "With the destruction of the Malevolence, its former commanding officer, General Grievous, became the target of an organized search conducted by Clone Intelligence. Though they succeeded in tracking the cyborg general as far as the Balmorra system, Grievous ultimately managed to elude the clone operatives before the Republic could act on their information."}, {"tag": "h3", "text": "Locating Grievous"}, {"tag": "p", "text": "In 19 BBY, the Republic intercepted a partial transmission from the Utapau system in the Outer Rim Territories. Using this information, Clone Intelligence traced Grievous' location to the planet Utapau. Supreme Chancellor Sheev Palpatine revealed their findings to Jedi General Anakin Skywalker, who informed the High Council of the Jedi Order as well. Determined to bring an end to the galaxy-wide Clone Wars, the Jedi Masters reacted to Clone Intelligence's report with swift and decisive action, dispatching Jedi General Obi-Wan Kenobi to destroy Grievous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}