{"url": "Clone_Flight_Squad_Seven/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Clone Flight Squad Seven"}, {"tag": "p", "text": "Clone Flight Squad Seven, often simply referred to as Squad Seven, was one of the most experienced starfighter squadrons in the Open Circle Fleet. This unit was composed entirely of clone trooper pilots flying Aggressive ReConnaissance-170 starfighters and Alpha-3 Nimbus-class V-wing starfighters, and was led by Commander Davijaan, also known as \"Odd Ball.\" Squad Seven's fighters were painted a light gray with dark red markings to identify their squadron affiliation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Clone Flight Squad Seven characteristically flew gray and dark red-colored Aggressive ReConnaissance-170 starfighters and Alpha-3 Nimbus-class V-wing starfighters for the Open Circle Fleet in the Grand Army of the Galactic Republic. Squad Seven's ARC-170 starfighters were given particular attention to armament and shielding, as well as enhanced targeting computer systems, making the bombers formidable against capital ships. The squadron's V-wings were likewise highly maneuverable, allowing them to provide defensive support to the ARC-170s."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Battle of Coruscant, Clone Flight Squad Seven provided cover for Obi-Wan Kenobi and Anakin Skywalker as they made their way to the Invisible Hand from their home ship, Ro-ti-Mundi. Squad Seven V-wings fought off droid tri-fighters, Vulture droids, and deadly buzz droids, with some even getting as far as the Separatist flagship, however many were lost to enemy flak. Although Squad Seven suffered many casualties, especially to droid tri-fighters, their sacrifices allowed the two Jedi to board the Hand and rescue Supreme Chancellor Palpatine."}, {"tag": "p", "text": "After the execution of Order 66, Squad Seven V-wings were called upon to escort the personal shuttle of then Emperor Palpatine as it transported a critically wounded Darth Vader—formerly Anakin Skywalker—through the skies of Coruscant to the Surgical Reconstruction Center."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although V-wings were included as part of the Galactic Navy's assets in Star Wars: Episode III Revenge of the Sith, it wasn't until the Star Wars PocketModel TCG specifically labeled a miniature of a V-wing in the initial release of the game that the gray and dark red fighters were identified specifically as belonging to Squad Seven. The set also included a miniature of a Squad Seven ARC-170, as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}