{"url": "Clone_Intelligence/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic stubs", "Category:Articles needing additional sources", "Category:Galactic Republic intelligence organizations", "Category:Grand Army of the Republic units"], "nodes": [{"tag": "h1", "text": "Clone Intelligence"}, {"tag": "p", "text": "Clone Intelligence were the espionage units in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Clone Intelligence units were created by the Galactic Republic during the Clone Wars and consisted of different types of clones for information gathering missions on Separatist activities. Clone types included the early-though-rare Null-class Advanced Recon Commandos and the more numerous clone shadow troopers. Early in the war, the Clone Intelligence units were too few to be truly useful, forcing the Republic to rely on the Bothan Spynet and other intelligence agencies. During this time, Clone Intelligence was known to had reported directly to the Jedi Council."}, {"tag": "p", "text": "When the Confederate ship Malevolence began destroying Galactic Republic starships, Clone Intelligence reported that the enemy ship left no survivors in its wake. After the ship's destruction, they later reported the sighting of General Grievous at Balmorra."}, {"tag": "p", "text": "By the closing stages of the Clone Wars, Clone Intelligence informed Supreme Chancellor Palpatine about General Grievous' hideout on Utapau in 19 BBY. They had gathered this information by intercepting a partial message in a diplomatic packet from the Chairman of Utapau. Jedi Master Mace Windu expressed his unease that Clone Intelligence reported the matter directly to the Supreme Chancellor, though Jedi Knight Anakin Skywalker pointed out that the Security Act amendment to the constitution meant that the Chancellor now held the position of Supreme Commander of the Grand Army of the Republic. This therefore meant that Clone Intelligence were following correct procedure by report to him instead of the Jedi Council."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}