{"url": "Clone_SCUBA_trooper", "categories": ["Category:Canon articles", "Category:Clone trooper variants"], "nodes": [{"tag": "h1", "text": "Clone SCUBA trooper"}, {"tag": "p", "text": "Clone SCUBA troopers, also known as clone dive troopers, were clone troopers from the Grand Army of the Republic who were outfitted for combat in aquatic environments. During the Battle of Mon Cala, these clone troopers fought alongside Mon Calamari and Gungan Grand Army forces against Separatist and Quarren forces led by Riff Tamson and Nossor Ri. In the end, the Separatists were defeated when the Quarrens turned against Tamson and joined forces with their former opponents."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Clone SCUBA troopers wore a set of white armor, known as Clone Dive Armor, that was fitted with six underwater propulsion jets to aid their movement. To survive underwater, they carried a scuba backpack kit that was equipped with gill grills and a pair of breathing tubes which circulated oxygen into their helmets."}, {"tag": "p", "text": "Clone SCUBA troopers were also armed with a DC-12U beam rifle, a double-barreled gun equipped with a flashlight. They also wore white fins which could be attached to their boots. Clone SCUBA troopers' breathing equipment and armor allowed them to survive for extended periods in the ocean depths of Mon Cala. Some also rode OMS Devilfish subs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Clone SCUBA troopers were Republic clone troopers who were outfitted for aquatic combat during the Clone Wars. A company of Clone SCUBA troopers led by the Jedi General Kit Fisto and Clone Commander \"Monnk\" traveled to the planet Mon Cala after Senator Padmé Amidala and the Jedi General Anakin Skywalker failed to mediate tensions between the Mon Calamari and Quarren, and after the pro-Separatist Quarren Isolation League attacked the Mon Calamari capital. Clone SCUBA troopers aided the Mon Calamari Guard in the city's defense during the initial battle. Despite fighting off Quarren and aqua droid forces, the clones and their Mon Cala allies were forced to retreat after the Separatist Commander Riff Tamson unleashed Hydroid Medusas."}, {"tag": "p", "text": "Some surviving Clone SCUBA troopers assisted the Jedi in their efforts to evacuate Prince Lee-Char and Senator Meena Tills offworld. When the escape attempt failed, two troopers accompanied the Jedi and their Mon Calamari allies into hiding in several underwater caves. With the Republic unable to outfit a regiment of clone troopers for aquatic combat at a short notice, the Jedi Council instead appealed to the Gungans of Naboo for help. A detachment of the Gungan Grand Army led by Junior Representative Jar Jar Binks arrived in time to aid the fugitives but were overwhelmed by Tamson's Trident ships."}, {"tag": "p", "text": "Several Clone SCUBA troopers were imprisoned in a prison camp with several Mon Calamari captives and civilians. Later, several of these troopers along with many Mon Calamari, Quarren, and Gungans attended the execution of Prince Lee-Char. Before Tamson could execute the Mon Cal prince, the Quarren chieftain Nossor Ri experienced a change in heart and successfully convinced his people to turn against Commander Tamson and the Separatist occupiers. The clone troopers along with the Quarren, Mon Calamari, Gungans, and Jedi then joined forces to expel the Separatist from Mon Cala."}, {"tag": "p", "text": "During the reign of the Galactic Empire, Kier Domadi participated in Clone Wars era battle reenactments as a scuba trooper when aquatic battles came up."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}