{"url": "Clone_Wars_(PocketModels)", "categories": ["Category:Real-world articles", "Category:Star Wars PocketModel TCG"], "nodes": [{"tag": "h1", "text": "Clone Wars (PocketModels)"}, {"tag": "p", "text": "The Clone Wars—also referred to as CW—expansion of the Star Wars PocketModel TCG (Trading Card Game) was released on July 26, 2008. This is the first of two sets WizKids had released that focused on the Clone Wars era. Included with the usual booster pack distribution of this set, two 2-player starter sets - titled Anakin's Assault Force 2-player Starter (A2P) and Obi-Wan's Attack Battalion 2-player Starter (O2P) - were released, each with two fixed 15 card decks, dice, a playmat, one exclusive CW unit, nine additional CW units, complete rules, assembly instructions, and up to eight additional PocketModels from the SV expansion."}, {"tag": "p", "text": "New gameplay rules and concepts in the Clone Wars expansion include:"}, {"tag": "h2", "text": "Cards"}, {"tag": "h2", "text": "Units"}, {"tag": "h3", "text": "Anakin's Assault Force 2-player Starter Set"}, {"tag": "p", "text": "A 2-player starter set released with the fifth expansion of Star Wars PocketModels at the time of the debut of the Star Wars: The Clone Wars animated film. Anakin's Assault Force 2-player starter set (A2P) contained 10 Clone Wars units (including an exclusive Starter PocketModel), plus up to 8 additional PocketModels, two 15-card pre-constructed decks (each one containing an exclusive foil card), a double-sided playmat, 2 micro dice, unit construction guidesheet, and complete rules. Among the PocketModel units that were available in the film-themed release, an exclusive pre-built unit with alternate art representing the Twilight was made available in each A2P starter set."}, {"tag": "p", "text": "Units"}, {"tag": "h3", "text": "Obi-Wan's Attack Battalion 2-Player Starter Set"}, {"tag": "p", "text": "A 2-player starter set released with the fifth expansion of Star Wars PocketModels at the time of the debut of the Star Wars: The Clone Wars animated film. Obi-Wan's Attack Battalion 2-Player Starter Set (O2P) contained 10 Clone Wars units (including an exclusive Starter PocketModel), plus up to 8 additional PocketModels, two 15-card pre-constructed decks (each one containing an exclusive foil card), a double-sided playmat, 2 micro dice, unit construction guidesheet, and complete rules. Among the PocketModel units that were available in the film-themed release, an exclusive pre-built unit with alternate art representing a 212th Attack Battalion Republic Gunship with artwork from the film was made available in each O2P starter set."}, {"tag": "p", "text": "Units"}, {"tag": "h3", "text": "Clone Wars Mega PocketModels"}, {"tag": "p", "text": "Two oversized units based on selected existing units from the Clone Wars expansion were made available for sale at select stores and through online retailers. An oversized version of the Twilight was planned, but not released. These units were put on sale during the release of the Clone Wars animated film."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}