{"url": "Clone_Wars_Chapter_20", "categories": ["Category:Real-world articles", "Category:Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Wars Chapter 20"}, {"tag": "p", "text": "\"Chapter 20\" is the twentieth episode of the Star Wars: Clone Wars animated television series, the tenth and final episode in Season Two, and the twentieth and final episode in Volume One. Directed by Genndy Tartakovsky, the episode originally aired on Cartoon Network on April 8, 2004."}, {"tag": "p", "text": "The episode occurs midway through the total time length of the series. It shows the end of the Battle of Muunilinst, which started with the debut of the series, and introduces General Grievous, who will dominate the rest of the storyline."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On Muunilinst, Jedi Master Voolvif Monn leads his clone troopers into battle against the last remaining pockets of battle droids. Suddenly, the droids deactivate, and Obi-Wan Kenobi tells Monn that the InterGalactic Banking Clan have surrendered, and the Galactic Republic is victorious. As Kenobi supervises the loading of Muun and Neimoidian prisoners-of-war onto Republic transports, Captain Fordo reports that a ship matching the one that Anakin Skywalker had pursued is approaching. Kenobi orders him to hold fire, and Skywalker exits the starfighter, apologizing for his disobedience and confirming the chase had been a Sith trap. As Kenobi upbraids his Padawan, he receives an urgent distress call from Jedi Master Daakman Barrek on Hypori. Barrek's forces have been wiped out by \"a new droid general.\" The signal cuts out abruptly."}, {"tag": "p", "text": "On Hypori, Barrek's dead hand drops his holo-communicator, which is crushed by a robotic clawed foot. Thousands of B2 super battle droids encircle a crashed Republic Acclamator, firing their blasters at it until the clawed hand of the caped figure in front of them signals for them to stop. Inside the wreckage, Jedi Master Ki-Adi-Mundi wonders why the attack has ceased. Five other Jedi, wounded and weary, surround him: Shaak Ti, K'Kruhk, Aayla Secura, Tarr Seirr, and Sha'a Gi. As the Jedi wonder how they could have been defeated by mere battle droids, a voice calls out to them: General Grievous."}, {"tag": "p", "text": "The sound of Grievous's approaching footsteps panics some of the Jedi, but Ki-Adi-Mundi urges them to remain calm."}, {"tag": "p", "text": "It's too much for Sha'a Gi, who charges into the open air where he is crushed to death as the metallic frame of General Grievous lands on top of him. Just as quickly, the general leaps out of sight, before dropping onto the remaining Jedi wielding two lightsabers. Spinning his torso around, Grievous easily holds off the four attacking Jedi, finally downing K'Kruhk. His clawed metal limbs get hold of Tarr Seirr and snap his neck, before hurling him and Aayla Secura across the chamber, followed by Ki-Adi-Mundi. Shaak Ti manages to hold off Grievous for some time, before she is hit by one of his spinning lightsabers and thrown into the wreckage. His own lightsaber held by Grievous's foot, Mundi uses the Force to pull one from Grievous's belt, which he ignites and raises into a guard. The two stare at each other for a moment before the droid general leaps at him, lightsabers angled for the kill."}, {"tag": "p", "text": "On Coruscant, Master Yoda senses a disturbance in the Force: \"Mmmm. Darker, the coming storm grows. I fear the dark cloud of the Sith shrouds us all.\" (Listen (help·info))"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Originally, the last chapter was going to involve Anakin and Obi-Wan fighting Durge. This was changed when George Lucas requested that they introduce General Grievous."}, {"tag": "p", "text": "The introduction of Grievous in animated form in \"Chapter 20\" prior to the release of Revenge of the Sith (2005) is reminiscent of Boba Fett's introduction in animated form in The Star Wars Holiday Special prior to the release of The Empire Strikes Back (1980)."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "This episode marked the first appearance of General Grievous, who is voiced by John DiMaggio (best known for playing Bender the robot in Futurama). In Season Three, Richard McGonagle voiced the character."}, {"tag": "p", "text": "This episode is more than twice as long as the previous episodes in the series at 7 minutes 15 seconds."}, {"tag": "p", "text": "After Grievous fights the five Jedi initially, jumps to a wall, and jumps again near them, Shaak Ti's lightsaber blade appears green, though it is blue seconds before and later."}, {"tag": "p", "text": "In this episode, Grievous is depicted with five fingers and only uses two of his arms, although Grievous has six fingers and uses all four of his arms in Chapter 25."}, {"tag": "p", "text": "In this episode, Grievous holds his defeated Jedi lightsabers on his belt. In Revenge of the Sith, they are held in his cape."}, {"tag": "p", "text": "Over the course of the first and second season, Captain Fordo's rank changes. In \"Chapter 3\" he is a sergeant, in \"Chapter 9\" Obi-Wan calls him commander, and here he is a captain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}