{"url": "Clone_Wars_Chapter_24", "categories": ["Category:Real-world articles", "Category:Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Wars Chapter 24"}, {"tag": "p", "text": "\"Chapter 24\" is the twenty-fourth episode of the Star Wars: Clone Wars animated television series, and the fourth episode in Season Three and Volume Two. The episode originally aired on Cartoon Network on March 24, 2005."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Just as Grievous makes a grab for the Supreme Chancellor as the latter complains about this intrusion, Shaak Ti uses the Force to pull him away from Grievous's grasp. As the Jedi and the Chancellor make their escape, Grievous makes short work of the Senate Guard and clone troopers left behind to stop him. Waiting for the elevator, the Jedi turn around as the sound of battle from Palpatine's quarters stops, and Grievous crashes through the door. Grievous evades their Force attacks, but a Force-assisted shockwave from Roron Corobb's throats collapses the ceiling, stopping the General's advance. Shaak Ti explains to the Supreme Chancellor that Corobb has four throats, quite powerful. The Supreme Chancellor, picking his ear to get rid of the ringing, replies dryly, \"So I've heard.\""}, {"tag": "p", "text": "As the elevator descends, Grievous appears running down the side of the building alongside the capsule. A clone trooper fires a missile at him, and when the smoke clears, he has disappeared. At the ground level, a legion of super battle droids stands waiting, and as Grievous lands in front of them, the droids begin to advance. Corobb's throat blast blows most of them away, but Grievous uses the claws on his feet to hangs on, slowly advancing towards them. Foul Moudama carries Palpatine and him and the other two Jedi run along with the troopers. Shaak Ti orders the troopers to call for support, but their communications are jammed. Two IG-100 MagnaGuards suddenly appear in front of them. The Jedi and Palpatine manage to evade their electrostaffs, but the clone troopers are knocked to their deaths."}, {"tag": "p", "text": "On Nelvaan, Anakin Skywalker follows the wind and the frozen rivers to a cave far from the village. Inside, he manages to avoid several dangerous steam vents before happening across a wall covered in ancient Nelvaanian pictograms. As the gas fumes in the cave build up, Skywalker experiences a vision, seeing the pictograms move before him. He does not know that he is seeing his future. They show the Nelvaanians going about their daily lives, until a dark menace attacks them. A hero fights them off, but his arm is replaced by darkness as well. At first the hero uses his powerful new arm to protect the villagers from all attacks, but eventually his arm and powers grow out of control and destroy the villagers as well, consuming the hero and transforming him into a face which resembles the future helmet of Darth Vader. As Skywalker collapses, he hears Padmé Amidala calling his name. When he awakes, he sees a machine called a Siphon generator which is absorbing the planet's geothermal energy."}, {"tag": "p", "text": "The Jedi protecting Palpatine leap from platform to platform through Coruscant, with the two MagnaGuards closely in pursuit. They jump on to a floating barge, but are shortly joined by four MagnaGuards and Grievous himself, who disables the barge's repulsorlift generators. The Jedi flee into a subway station, leaping over trains and narrowly avoiding death as they fight the MagnaGuards on the tracks. Shaak Ti finally manages to destroy two of the droids, and Corobb destroys another. As Grievous appears and backs the Jedi into a tunnel, Shaak Ti uses the Force to wrap his cape around a pipe on a train carriage. She activates the train, and Grievous is yanked down one of the tunnels. The Jedi break a nearby window and make their escape."}, {"tag": "p", "text": "Avoiding the patrolling battle droids, Skywalker makes his way into the complex, where he overhears two Techno Union scientists discussing specimens for their \"project.\" Skywalker discovers tanks full of horribly mutated Nelvaan warriors, augmented with cybernetic implants and weapons. He watches as the latest Nelvaanian to be captured is submerged in a mutagen to be processed. The Techno Union scientists hurriedly release the \"specimens\" as Skywalker races in and destroys the battle droids. Skywalker tries to reason with the advancing creatures, insisting he is here to help them, but they slowly raise their weapons, roaring in anger."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "According to the DVD commentary, director Genndy Tartakovsky wanted the brief scene where Grievous kills the remaining clone troopers behind the closed door in Palpatine's office to sound extremely violent. So he told the sound designers that he wanted \"everything\" to be heard, including, he joked, a buzzsaw. He was then surprised when a buzzsaw sound effect was put into the scene. It is left to the viewer to wonder if Grievous wields a buzzsaw weapon."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Anakin's vision in the Nelvaan cave directly foreshadows the events of Revenge of the Sith."}, {"tag": "p", "text": "The Wilhelm scream is heard during this episode when one of Grievous's bodyguards kills a clone trooper."}, {"tag": "p", "text": "At one point, when Anakin enters the cave, his facial scar is missing."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}