{"url": "Clone_Wars_Chapter_21", "categories": ["Category:Real-world articles", "Category:Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Wars Chapter 21"}, {"tag": "p", "text": "\"Chapter 21\" is the twenty-first episode of the Star Wars: Clone Wars animated television series, and the first episode in Season Three and Volume Two. The episode originally aired on Cartoon Network on March 21, 2005."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A customized Low Altitude Assault Transport/infantry speeds across the surface of Hypori. On board the gunship, a squad of Advanced Recon Commandos prepare their weapons for attack. A jamming signal prevents their detection by an army of B2 super battle droids surrounding a crashed Acclamator-class assault ship. The gunship drops a cluster of thermal detonators, armed on standby, among the droids."}, {"tag": "p", "text": "The troopers disembark, their commander—Captain Fordo—detecting three life signs. Two of the ARC troopers go after the nearest two, while the rest follow Fordo to the third reading; the transport is flown skywards to open fire on the approaching battle droids. As the troopers exit a tunnel, they encounter General Grievous, who is in the midst of a vicious lightsaber duel with Jedi Master Ki-Adi-Mundi. Just as he disarms Mundi and prepares to finish him off, they both notice the clones, who unleash a barrage of blaster fire at the cyborg. Grievous flees the attack, climbing up the wall and onto the ceiling. As Grievous leaps down and quickly kills four of the troopers using two of his lightsabers, the commander calls for backup. The hovering LAAT/i breaks into the area and opens fire on the General with its blasters and missiles, which he evades."}, {"tag": "p", "text": "Fordo orders his men to retreat, despite Ki-Adi-Mundi's initial insistence that they pursue Grievous. Two Jedi, Aayla Secura and Shaak Ti, have survived the attack by General Grievous and are recovering aboard the LAAT/i. Meanwhile, Grievous takes a lightsaber from the seemingly lifeless body of K'Kruhk and adds it to his collection."}, {"tag": "p", "text": "The ARC troopers detonate the explosives, destroying hundreds of droids. General Grievous watches the transport head into space, musing that they have only prolonged their downfall…"}, {"tag": "p", "text": "On Coruscant, Yoda has a vision of the nine-year-old Anakin Skywalker and the late Qui-Gon Jinn on Dagobah. Qui-Gon tells Skywalker he must face his fear by entering the Dark Side Cave, and to trust in the Force."}, {"tag": "p", "text": "At a meeting of the Jedi High Council, Ki-Adi-Mundi tells his fellow council-members of the defeat on Hypori. Since the Jedi numbers are spread so thinly, the Council decide to promote Anakin Skywalker to full Jedi Knight status at Obi-Wan Kenobi's request, despite protests from Master Oppo Rancisis."}, {"tag": "p", "text": "Skywalker walks through crowds amid the lower levels of Coruscant, surveying the surrounding people with suspicion. He thinks a hooded figure is following him, so he races off. At the entrance to an alleyway, he grabs the mysterious figure and ignites his lightsaber before realizing his pursuer is his beloved wife, Padmé Amidala. They share a kiss and, thinking they have been seen by a passerby, Skywalker rants that they should not have to hide their love. Amidala reminds him of his duty to the Jedi Order and that she'll always love him. He jokes that Amidala does look good in the dark and they kiss again, though this time they are interrupted by C-3PO, who is clad in brand-new, gold-colored coverings. Skywalker claims to be impressed; most impressed."}, {"tag": "p", "text": "Skywalker is called by Kenobi to the Jedi Temple, but he arrives late, interpreting his being summoned as a prelude to another scolding. Kenobi reminds his Padawan that he is no longer a child but must still follow his Master's orders. Skywalker retorts that Kenobi is \"no Qui-Gon Jinn.\"; this saddens Kenobi visibly and Skywalker immediately regrets his hurtful comment, apologizing. Master Kenobi forgives his student thus confessing that he misses their old friend and mentor Qui-Gon too and then shows him to a dark room, where Kenobi and the other Jedi Masters surround Skywalker and ignite their lightsabers."}, {"tag": "p", "text": "Yoda knights Skywalker, cutting off his Padawan braid, which C-3PO later presents to Amidala, which she happily stores away with her Japor snippet for safekeeping. In return, Amidala gives R2-D2 to Skywalker, the droid showing the new Knight a hologram recording of Amidala presenting him the gift and accepting his own. Skywalker smiles at the sight and reaches into the hologram with his mechno-arm as if to hold her in his hand. He and R2-D2 then board his Actis-class starfighter and leave once again to serve together in the Clone Wars…"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are several easter eggs during the Coruscant street scene: an animated version of Genndy Tartakovsky, a creature resembling \"The Creeper\" from the Scooby-Doo cartoons, the Cylon Centurion from the original Battlestar Galactica and a \"Woolie\" from Tartakovky's series Samurai Jack. When C-3PO reveals his new golden plating to Anakin, a musical cue of \"stripper music\" can be heard. In the same scene, Anakin's line \"Impressive. Most impressive.\" mimics the same line he says (as Darth Vader) over two decades later to his son Luke (in The Empire Strikes Back )."}, {"tag": "p", "text": "When Genndy Tartakovsky and team began working on this episode, George Lucas's first instruction to the crew was to resolve the Hypori storyline which the crew had begun in \"Chapter 20.\" He specified this because his son Jett was eager to find out how that particular story ends, as there were originally no plans to continue the series beyond \"Chapter 20.\" The unique designs on the front of the clones' LAATs were inspired by nose art seen on military aircraft. According to Paul Rudish on the Volume Two DVD commentary, the front of the LAAT featured at the beginning of this episode was meant to look like the face of a rancor. The clones' customizations of their helmets in this episode and in the rest of Volume Two is based on real-life actions done by soldiers during World War II and the Vietnam War."}, {"tag": "p", "text": "According to the commentary for \"Chapter 3,\" the creators had studied how special forces teams acted in real combat situations, to ensure the ARC troopers acted very much like a crack special forces team would. They apparently reapplied their knowledge for this episode (Captain Fordo used hand signals instead of actually speaking, and as they approach Ki-Adi-Mundi and General Grievous he directed members to perform what appear to be flanking maneuvers). According to the episode commentary, Ki-Adi-Mundi's concern for Shaak Ti was intended to hint at a possible relationship between the two. Most of the sentient species in the Mos Eisley Cantina scenes in A New Hope appear in the underlevels of Coruscant."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "In the series, Anakin is depicted as being knighted very early on (while his hair is still short) as a response to a shortage of Jedi Knights, and believing that Anakin was long overdue for knighthood. This seemingly conflicts with the novel Jedi Trial by David Sherman and Dan Cragg, in which Anakin, only a few months prior to Revenge of the Sith, is sent on a mission to earn his knighthood. However, Leland Chee did confirm that there is in fact a jump in time between the conclusion of the Hypori battle and the Jedi Council scenes leading up to Anakin's knighting, claiming Anakin's hair was in a top-knot that he merely let down after being knighted."}, {"tag": "p", "text": "Although K'Kruhk appears to have been killed by Grievous in \"Chapter 20,\" and is not rescued with the other Jedi, he is actually known to have survived this battle and is in a state of hibernation when Grievous takes his lightsaber. Although Eeth Koth remained canonically dead after the First Battle of Geonosis, a Zabrak Jedi High Council member that appears in the Council scene, officially credited as Agen Kolar, was animated instead with the likeness of Eeth Koth. It is unknown if the character was originally intended to be Eeth Koth (in ignorance of his canonical death) and then retroactively credited as Agen Kolar to avoid a continuity problem, or if the Zabrak was always intended to be Kolar and the animators accidentally used the wrong reference photographs."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}