{"url": "Clone_Wars_Chapter_16", "categories": ["Category:Real-world articles", "Category:Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Wars Chapter 16"}, {"tag": "p", "text": "\"Chapter 16\" is the sixteenth episode of the Star Wars: Clone Wars animated television series, the sixth episode in Season Two, and the sixteenth episode in Volume One. Directed by Genndy Tartakovsky, the episode originally aired on Cartoon Network on April 2, 2004."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Padmé Amidala and Captain Gregar Typho watch the Jedi ice cave with their electrobinoculars. Amidala and R2-D2 are concerned that Yoda has not returned, but Typho and C-3PO assure her that the Jedi Master will be fine. When Typho returns to the ship to check the communications array, Amidala heads off after Master Yoda, telling the two droids that they will accompany her. Artoo's sensors pick up multiple objects approaching, and the trio dive for cover as a barrage of laser fire blasts out of the blizzard. Amidala throws her cloak out as a decoy, and then fires her blaster, destroying the cloaked chameleon droid. However, Artoo says that there are two more. With this, she asks 3PO if he can get her coat but actually carelessly using him as a decoy. All of a sudden, the other two appear and open fire upon C-3PO, while Amidala uses a thermal detonator to destroy the remaining two droids."}, {"tag": "p", "text": "Master Yoda appears out of the snowstorm with Luminara Unduli and Barriss Offee. The Jedi are safe, but the cave temple has been nearly destroyed. Master Yoda wonders how the temple's location was known. Artoo patches into one of the chameleon droids, and provides the answer: Count Dooku."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The appearance of the J-type 327 Nubian royal starship is a blooper, as the ship was intended to be a H-type Nubian yacht, which is seen in the two previous episodes."}, {"tag": "p", "text": "This episode contains a variation on the Lawrence of Arabia musical theme. It can be heard when Yoda, along with Barriss Offee and Luminara Unduli, emerge out of the snow on the horizon."}, {"tag": "p", "text": "Clone Wars producer Genndy Tartakovsky revealed in his Hyperspace audio commentary on StarWars.com and on the Star Wars: Clone Wars Volume One DVD that he designed C-3PO the way he did and animated C-3PO's eyes in a way that pays homage to the animators of and the animation style of Nelvana, who were the production company behind the animated segment from The Star Wars Holiday Special and the Droids and Ewoks animated series. Tartakovsky explains that he made his version of the character similar to Nelvana's."}, {"tag": "h2", "text": "Bibliography"}]}