{"url": "Clone_Wars_Chapter_7", "categories": ["Category:Real-world articles", "Category:Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Wars Chapter 7"}, {"tag": "p", "text": "\"Chapter 7\" is the seventh episode of the Star Wars: Clone Wars animated television series, and the seventh episode in Season One and Volume One. Directed by Genndy Tartakovsky, the episode originally aired on Cartoon Network on November 17, 2003."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After Asajj Ventress claims to be a Sith, Count Dooku scoffs at her, assuring her of its impossibility. Angered, Ventress charges him, but is rendered unconscious by a blast of his Force lightning."}, {"tag": "p", "text": "Ventress awakens in her large, elaborately-furnished penthouse, her two lightsabers nearby in a silver tray. As soon as she takes them up, Dooku suddenly appears and instantly attacks. A long, brutal fight ensues, in which Dooku demonstrates obvious fighting superiority. Ventress is eventually defeated—her lightsabers having been destroyed by Dooku—and driven to the ground by a Force Push. Left at the point of his blade, she asks him to finish her off."}, {"tag": "p", "text": "At that point, a mobile hologram unit enters the room, making its way down the stairs. Dooku introduces her to Darth Sidious, his master. Sidious applauds her efforts, and personally gives her first mission for the Sith: hunt down and kill Anakin Skywalker."}, {"tag": "p", "text": "Dooku then presents Ventress with both a pair of new lightsabers, as well as a starfighter. As she flies off to complete her task, Dooku remarks that he is confident in her success. Sidious replies that her success or failure is unimportant—the point is to test Skywalker."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Like the previous episode, this one takes place several weeks before the previous five episodes."}, {"tag": "p", "text": "Although it is not stated in the episode, the lightsabers that Dooku gives Asajj were taken from Komari Vosa, his former Padawan, whom he slew after she fought Jango Fett as seen in Star Wars: Bounty Hunter."}, {"tag": "h2", "text": "Bibliography"}]}