{"url": "Clone_Wars_Chapter_9", "categories": ["Category:Real-world articles", "Category:Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Wars Chapter 9"}, {"tag": "p", "text": "\"Chapter 9\" is the ninth episode of the Star Wars: Clone Wars animated television series, and the ninth episode in Season One and Volume One. Directed by Genndy Tartakovsky, the episode originally aired on Cartoon Network on November 19, 2003."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After the joust and battle with Durge, General Kenobi rushes through the city and rides his speeder bike straight up the side of a building to the command tower, where he meets up with The Muunilinst 10. Captain Fordo reports that they are ready, and Kenobi tells them \"Let's end this battle.\" In their command tower, San Hill and other members of the InterGalactic Banking Clan are watching the attack on their holographic display. Blasting open the roof of the structure with explosives, the troops—led by Kenobi—descend to the floor on lines and quickly destroy all of the droids in the room. Three droidekas roll in, but they are quickly destroyed by Kenobi, who deflects their shots and uses saber throw against them. Fordo announces that they have captured San Hill, who pleads for his life. Kenobi then offers to spare his life in exchange for an unconditional surrender. Before Hill has a chance to answer, a regenerated Durge smashes through the tower window into the room on a jetpack. However, he is quickly shot down, as the ARC troopers shoot him with blasters and a missile launcher. In the excitement, Hill takes cover under the situation table."}, {"tag": "p", "text": "Thinking Durge to be dead, the troopers approach the smoking crater they had made, only to be knocked aside by a massive fleshy arm seemingly made of pure muscle fiber. Durge climbs from the crater. All his armor and gloves, except his helmet, blasted off, revealing his true Gen'Dai form. He quickly attacks Kenobi, driving the Jedi atop the situation table, which Durge snaps in half with his fists. Suddenly, all the clones in the room launch grappling hooks at Durge, hoping to restrain him while they blast him."}, {"tag": "p", "text": "The blaster fire has no effect, and Durge simply rips the lines from the wall with his sheer strength, toppling the clones. Charging at Kenobi, Durge goes over Obi-Wan and uses his body`s tentacles to absorb him into his body. The ARC Captain, Fordo, fires a wire at Durge and pumps electricity through it, hoping to fry Durge. This only succeeds in enraging the Gen'Dai, who charges Fordo."}, {"tag": "p", "text": "However, before Durge can kill him, Durge suddenly bloats to a massive size and explodes—throwing the Gen'Dai's remains all over the room. Apparently, Kenobi had used the Force to push outward and destroy Durge's body from the inside out. Commenting on how much of a 'mess' he has made, Kenobi turns back to Hill, who surrenders. As the troopers lead San Hill away, Kenobi picks up Durge's helmet - unnoticed by the Jedi Master, the Gen'Dai's pulverized remains slither away."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This episode marks the first appearance of droidekas in the series. They later appear for a second and final time in the series in \"Chapter 23\"."}, {"tag": "h2", "text": "Bibliography"}]}