{"url": "Clone_Wars_Chapter_5", "categories": ["Category:Real-world articles", "Category:Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Clone Wars Chapter 5"}, {"tag": "p", "text": "\"Chapter 5\" is the fifth episode of the Star Wars: Clone Wars animated television series, and the fifth episode in Season One and Volume One. Directed by Genndy Tartakovsky, the episode originally aired on Cartoon Network on November 13, 2003."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A voice-over from Yoda explains that the planet Mon Calamari has split between its two native species: the Mon Calamari who are loyal to the Galactic Republic, and the Quarren, who have joined the Confederacy of Independent Systems. The Quarren have formed a Separatist-aligned government, the Quarren Isolation League, and taken over the planet."}, {"tag": "p", "text": "The voice-over is revealed to be a hologram of Yoda communicating to Jedi Master Kit Fisto on the bridge of his Acclamator-class assault ship. Yoda orders Fisto to help the Calamari to retake the planet in the name of the Republic."}, {"tag": "p", "text": "The Acclamator fleet carrying Fisto's army \"lands\" on Mon Calamari, floating on top of the world-spanning sea. The aquatic Fisto leaps first into the water, with several divisions of Kit Fisto's SCUBA troopers following behind him."}, {"tag": "p", "text": "The Battle of Mon Calamari begins when the Republic forces come under attack by Manta droid subfighters, Sub Carriers and Mini-subs, as well as Quarren and battle droid soldiers. The Republic army is reinforced by the Mon Calamari Knights."}, {"tag": "p", "text": "The trouble begins for Kit when the Quarren unveil their Crab cannon, using it to destroy several of his floating Acclamators. With the help of the Knights, as well as a use of the Force, the Cannon is first critically damaged, then pushed off the edge of a steep underwater ravine. The tide of the battle then turns in favor of the Republic."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Star Wars: Clone Wars Volume One DVD swaps this chapter with \"Chapter 4\"."}, {"tag": "p", "text": "The short comic Fierce Currents is a follow-up to this episode."}, {"tag": "p", "text": "Kit Fisto's belt buckle is in the shape of two fish conjoined together like the Tao, a symbol of Chinese philosophy."}, {"tag": "h2", "text": "Bibliography"}]}