{"url": "Clone_Wars_multimedia_project", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Clone Wars multimedia project"], "nodes": [{"tag": "h1", "text": "Clone Wars multimedia project"}, {"tag": "p", "text": "The Clone Wars multimedia project was a three-year project created by Lucasfilm Ltd., in conjunction with Del Rey, Dark Horse Comics, Cartoon Network and LucasArts."}, {"tag": "p", "text": "Set largely between the films Attack of the Clones and Revenge of the Sith (in terms of both in-universe and real-life chronology), the Clone Wars multimedia project attempted to tell the story of the Clone Wars in real time—through books, comics, television, and video games. This echoes the previous project Star Wars: Shadows of the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Timeline"}, {"tag": "p", "text": "The Multimedia Project followed an expanding time line during the three years between Attack of the Clones and Revenge of the Sith's releases. The time line itself could be found in the books marked \"A Clone Wars Novel\" and the Boba Fett series. Each medium was listed along with how many months after the Battle of Geonosis it took place."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Television"}, {"tag": "p", "text": "The television aspect of the Clone Wars project was covered by Star Wars: Clone Wars, directed by Genndy Tartakovsky. This \"micro-series\" consisted at first of two seasons: (Season One, from November 7 to 20 of 2003, and Season Two, from March 26 to April 8 of 2004), each consisting of ten episodes, each roughly three minutes in length. In addition to movie characters, the show used several characters from the Star Wars: Republic comics from Dark Horse Comics, and was notable both for introducing the character of General Grievous in Chapter 20 and for promoting Anakin Skywalker from Padawan to Jedi Knight in Chapter 21."}, {"tag": "p", "text": "Initially, the episodes were meant as a form of commercials for the other products of the Clone Wars multimedia project. But after the series became a huge success and the first two seasons won an Emmy Award for \"Outstanding Animated Program,\" they were continued in Season Three, consisting of five 12- to 15-minute episodes. These episodes detailed the timeframe leading up to Star Wars: Episode III Revenge of the Sith. Although criticized by fans (primarily for not being consistent with the Episode III tie-in novel Labyrinth of Evil) they were also a hit, and led to George Lucas announcing plans to continue the show as a half-hour, 3D cartoon, which began in 2008 under the title The Clone Wars."}, {"tag": "p", "text": "The collected episodes of the show were made available on DVD in Star Wars: Clone Wars Volume One and Volume Two. The style of animation for the show was the inspiration for the Clone Wars Adventures comics. Many of the show's voice actors went on to reprise their character(s)' roles for various Clone Wars–related computer games, or had come from such roles to the show."}, {"tag": "h3", "text": "Books and short stories"}, {"tag": "p", "text": "Seven official novels were written in the Clone Wars series. They have the designation \"a Clone Wars novel.\""}, {"tag": "p", "text": "The Boba Fett young-adult book series also bears the Clone Wars brand. Another novel, Escape from Dagu, was finished but was replaced with the Yoda: Dark Rendezvous. All Clone Wars books were published by Del Rey. Another series of the Clone Wars multimedia project are the Republic Commando novels following the game of the same name. Although they were not introduced until two and half years into the project, only Republic Commando: Hard Contact and the game are part of the Clone Wars Multimedia Project time line due to the others being released after Revenge of the Sith."}, {"tag": "p", "text": "Star Wars Insider also published short stories for the series. They are The Clone Wars: The Pengalan Tradeoff, the three-part Hero of Cartao, and League of Spies."}, {"tag": "p", "text": "Although Star Wars Episode II: Attack of the Clones, Republic Commando: Triple Zero, Republic Commando: True Colors, Order 66: A Republic Commando Novel, Labyrinth of Evil, Star Wars Episode III: Revenge of the Sith, and Dark Lord: The Rise of Darth Vader are set in this era and cover the Clone Wars, they are not considered part of the Clone Wars book series."}, {"tag": "p", "text": "Four short stories and e-books were also written as part of the Clone Wars series. These were The Hive, Storm Fleet Warnings, Equipment, and Duel (the last three of which were formed into the Hasbro Short Story Collection)."}, {"tag": "h3", "text": "Comics"}, {"tag": "p", "text": "The comics segment of the Clone Wars storyline was told primarily through the Star Wars: Republic serial, starting with Issue 49 (four issues after the comic had been renamed from Star Wars to Star Wars: Republic) and continuing until the final Issue 83. It was in the Republic comics that Anakin Skywalker got the scar on his face that he has in Episode III."}, {"tag": "p", "text": "The five-part Obsession and Jedi comics, and the Star Wars—Free Comic Book Day 2005 Special, Purge, and Routine Valor one-shots, were tie-ins to the Republic Clone Wars storyline. Together, the comics were collected into the nine-part Star Wars: Clone Wars trade-paperback series."}, {"tag": "p", "text": "A collection of six Clone Wars Adventures comics (four more have been added since), based on the art of the TV show, were also released. Several of the stories from latter Star Wars Tales also tied in to the Clone Wars storyline, with varying levels of continuity. From May to September 2002, the Jango Fett: Open Seasons comic (the counterpart to the Bounty Hunter game) was released; while not part of the Clone wars series, it depicted the events that led to the creation of the clone army."}, {"tag": "p", "text": "All Clone Wars comics were published by Dark Horse Comics."}, {"tag": "h3", "text": "Video games"}, {"tag": "p", "text": "The majority of Clone Wars games were released in 2002. Two of these were Star Wars: The Clone Wars, released on November 28, and Star Wars: Bounty Hunter, a game that centered on the buildup to the clone army's formation and a tie-in to the Jango Fett: Open Seasons comic. The game Republic Commando was released on March 1, 2005."}, {"tag": "p", "text": "Other games depicting the Clone Wars are Star Wars: Battlefront, which contained several levels depicting both original and movie, comic, or game-based Clone Wars battles, released on September 20, 2004. The sequel, Star Wars: Battlefront II, again with Clone Wars missions, was released on November 1, 2005. Star Wars: Jedi Starfighter was released March 10 in 2002, with Star Wars: Galactic Battlegrounds: Clone Campaigns released shortly after Episode II and the Episode III video game (May 5, 2005)."}, {"tag": "p", "text": "Many of the computer-game characters had the same voice actors as in the Star Wars: Clone Wars show."}, {"tag": "h3", "text": "Toys"}, {"tag": "p", "text": "Hasbro Inc. and other Star Wars licensees have produced many toys to tie in to both the multimedia project and the more recent TV series."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "On April 25, 2014, the contents of the Clone Wars multimedia project were declared part of the continuity of Star Wars Legends and non-canon as a whole, though certain book titles would remain in print under the \"Legends\" banner. Prior to this declaration, much of the material within the Clone Wars multimedia project had been directly contradicted by material from Star Wars: The Clone Wars, which often told its stories without regard to continuity previously established within this project and was declared part of the new canon continuity. One such example was that the episode \"Nightsisters\" presented an entirely different background for the character of Asajj Ventress from that shown in previous material."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}