{"url": "Clone_assassin", "categories": ["Category:Legends articles", "Category:Assassins", "Category:Clone trooper variants", "Category:Jedi hunters"], "nodes": [{"tag": "h1", "text": "Clone assassin"}, {"tag": "p", "text": "Clone assassins were a specialized class of clone troopers created by the Kaminoan cloners on the planet of Kamino. These troopers were commissioned by Supreme Chancellor Palpatine, through a special order during the Clone Wars. The assassins were trained specifically to eliminate Jedi by utilizing Teräs Käsi, a form of unarmed combat. Through training duels with Padawans of the Jedi Order, the clones developed greatly enhanced speed as well as an aptitude for anticipating strikes and the ability to resist Jedi mind tricks."}, {"tag": "p", "text": "Assassins were fully put in use following the activation of Order 66, a measure trained into all clone troops that commanded them to kill their Jedi superiors. A unit of the clone variant was sent by Palpatine to assist in an assault on the Jedi Temple on the planet of Coruscant, which took place in 19 BBY. There, Darth Vader, the leader of the assault, along with the 501st Legion, cleared the Temple of all Jedi. Vader activated a beacon, inside the Jedi Temple communication center, designed to contact all Jedi across the galaxy and sent a message ordering all Jedi to return to the Temple, where a large garrison of clone troops was waiting to eliminate each one that did so. The squad charged with defending the beacon was killed by Jedi Master Obi-Wan Kenobi, who was attempting to alter the message to ward any surviving Jedi away, when they attacked him and were rebuffed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Clone assassins were specially commissioned by Supreme Chancellor Palpatine, actually the Sith Lord Darth Sidious, as an addition to the Grand Army of the Republic through the Galactic Senate. Palpatine justified the need for these troops in the legislation as a way to combat Jedi if they ever decided to rebel against the Senate and the Republic."}, {"tag": "p", "text": "In 19 BBY, the final year of the Clone Wars, Anakin Skywalker, a Jedi Knight and friend of the Chancellor, swore fealty to Sidious' Sith teachings and became his Sith apprentice, taking the name Darth Vader. Afterward, the Dark Lord sent a unit of clone assassins to the Jedi Temple on Coruscant, with Vader and the 501st Legion, to exterminate the Jedi inside. Amidst of the battle inside the Temple, Vader assigned a squad of six assassins to protect the Jedi Temple communication center, where he had activated a beacon that transmitted to all Jedi in the galaxy, informing them that the war was over and that they were to return to the Temple. A large garrison of clone troops was left in the Temple to intercept and eliminate any returning Jedi."}, {"tag": "p", "text": "After receiving the beacon's message and hearing of the attack on the Jedi Temple, Jedi Master Obi-Wan Kenobi and Grand Master Yoda, deeming it an obvious trap, decided to infiltrate the Temple in an effort to stop the signal's broadcast. Kenobi entered the Communication Room and was cornered by the squad of assassins Vader had stationed there, though he successfully rebuffed them all."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Clone assassins were outfitted in a standardized variation of the Phase II clone trooper armor to protect them in battle. Wearing this full-body armor, they were still able to perform incredibly dexterous moves to avoid attacks with no obstruction to their movements. The armor had two twin vibro-blades attached to the elbows which extended their reach and increased the lethality of their attacks. These blades spun out from a neutral position and could be locked in place to either follow the troopers' upper arms or their forearms as they swung at their opponents. The assassins wore parted kamas, which were kept on by a belt with two storage pouches on each hip. They also carried blaster pistols. Clone assassins used sniper rifles to execute intruders."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "Assassins were commissioned and created for the sole purpose of combating Jedi on equal terms. They were trained to use the martial art of Teräs Käsi, a form of unarmed combat that was created specifically for defeating Jedi, in conjunction with twin vibro-blades on their arms. They honed their skills by fighting Padawans, Jedi trainees, and these battles allowed the clones of the late bounty hunter Jango Fett to increase their speed to a level far beyond that of their template. Their dexterity, mental fortitude, and reflexes were also increased greatly by these battles. They could easily dodge or parry most strikes from melee weapons, such as lightsabers, and were also able to withstand Jedi mind tricks without flinching. A squad of clone assassins could easily defeat a Jedi Knight though were not a true match for a Jedi Master. In addition to their unarmed combat, the assassins were also familiar with the use of blaster technology and carried blaster pistols on their persons. They were used to assist in the cleansing of the Jedi Temple and, later, to defend the temple beacon room from Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This clone trooper classification first appeared as an enemy character in the Star Wars: Episode III Revenge of the Sith video game adaptation. There is a bonus level of the game where Yoda is confronted in the Temple by several squads of clone troops and among them is a squad of six assassins, though the canonicity of this encounter is ambiguous. Concept art from the game depicts a clone assassin with dark armor as opposed to the white and blue seen in the game."}, {"tag": "p", "text": "In the game, it is indicated that the clone assassins were trained by fighting Padawans. The Clone Wars Campaign Guide stated that the class of clone trooper was commissioned via special order by Palpatine, implying that it was done in secret, possibly indicating that the duels were conducted without the knowledge of the Jedi, that these duels never took place, or another option. Adding to the confusion, Obi-Wan Kenobi, a Jedi who sat on the High Jedi Council, was familiar with clone assassins prior to his encounter with them in the Temple. Kenobi also specifically stated that they weren't \"fighting Padawans anymore,\" though this could have been in reference to their operations inside the Temple that day.\nThe assassins are voiced by Raphael Sbarge who also voiced Carth Onasi in Knights of the Old Republic, and RC-1262 Scorch in Republic Commando."}, {"tag": "p", "text": "In the second Jedi Temple level of Obi-Wan's storyline in the GBA/DS versions of the game adaptation. Obi-Wan ends up fighting a clone trooper that had similar colors to the Clone Assassin, although his method of attacking was closer to the Heavy Weapons Specialist, which was using a launcher to fire several grenades into the air to trap Obi-Wan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}