{"url": "Clone_commando/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Clone commandos", "Category:Clone trooper variants", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Clone commando"}, {"tag": "p", "text": "Clone Commandos, also known as Republic Commandos and later as Imperial Commandos, were elite clone troopers of the Grand Army of the Republic and later the Stormtrooper Corps. Cloned from the genetic template of the famous Mandalorian bounty hunter Jango Fett, clones selected for the commando program were trained by Mandalorian drill sergeants that were recruited by Fett himself to train them to become the deadliest soldiers in the Clone Army. Often working in Squads of four, clone commandos were assigned to carry out special operations that the average clone trooper couldn't handle. These missions included covert infiltration, sabotage, demolition and assassination, all of which were standard tasks for the clone commandos."}, {"tag": "p", "text": "When Order 66 was issued by Chancellor Palpatine near the conclusion of the Clone Wars, the Jedi Order became targeted for extermination while Palpatine brought a swift end to the Old Republic by declaring himself emperor of the first Galactic Empire. The remaining Republic commandos were rechristened as Imperial commandos and incorporated into a special forces unit attached to the 501st Legion, under the command of the Sith Lord Darth Vader."}, {"tag": "p", "text": "However, a minority of commandos refused to comply with Order 66, either out of sympathy for the Jedi or due to other personal reasons. For instance, Ion Team did not carry out the command to kill their Jedi officers, viewing it as an invalid order and not believing that the Jedi would betray the Republic, and instead opted to ensure the survival of General Roan Shryne. Other commandos fled to Mandalore, choosing to go into hiding rather than serve as the enforcers of the Emperor's New Order."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "Soon after the Kaminoans began developing the Galactic Republic's secret clone army on their homeworld of Kamino, a special forces unit was conceived as a necessary addition to the overall operational effectiveness of the new military force. Jango Fett, a Mandalorian bounty hunter and the genetic template for the entire clone army, was confident that progeny would be engineered into the best soldiers in the galaxy, but also knew that there were situations that regular infantry was not suited for. As a result, he requested for a special batch of clones that he would personally train as Advanced Recon Commandos. The Kaminoans reluctantly agreed, although due to their disappointment in the failed prototypes, they felt little confidence that the second generation of ARC troopers would meet their expectations. Thus, they compromised with Fett; the bounty hunter would be allowed to personally train his ARC troopers while the Kaminoans proceeded with their plan to create the clone commandos, otherwise known as Republic Commandos."}, {"tag": "p", "text": "Unlike the ARC troopers, the Republic commandos would be more loyal and susceptible to following orders without question, yet they would still retain greater ability for independent thought than the standard clone troopers. This however could not prepare them for Order 66. Thus, they were to be the perfect balance between two extremes. With a greater capacity for independent thinking, the commandos would be better suited to handling delicate missions with complicated objectives. If necessary, they would also be capable of devising their own way for completing missions. By being indoctrinated with absolute loyalty to the Republic, the commandos would not be difficult to control as the notorious Null-class ARC troopers were."}, {"tag": "p", "text": "The first batches of clone commandos were separated into squads, also known as \"pods\", of four clones each, in reflection of the native aiwha hunting pods from Kamino. In addition to being subjected to the computerized flash-training program, the commando squads were divided amongst the Cuy'val Dar, a group of professional mercenaries covertly brought to Kamino and hired to train the commandos in a variety of ways, such as teamwork, infiltration methods, demolition techniques, assassination and much more. The majority of the trainers were Mandalorians, such as Kal Skirata and Walon Vau; the rest were mercenaries of different backgrounds. Although Fett's Cuy'val Dar were primarily responsible for the commandos' training, Kaminoan scientists personally oversaw the development of their creations as well. Taun We took a vested interest in the training of Delta Squad's leader, RC-1138, and helped to guide him throughout the first ten years of his life. Word of the commando's skill spread through the clone ranks, with trooper Three-Five believing the rumors made it seem like they would effectively win a war all by themselves."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "When the Clone Wars erupted between the reigning Galactic Republic and the Confederacy of Independent Systems, the clone commandos had just completed a decade of training and were prepared for deployment into Republic service. The Kaminoans' efforts to breed a special forces unit resulted in a number of small, operational squads, each capable of carrying out self-contained or campaign-augmenting missions. They were also highly trained and fiercely cohesive, yet capable of carrying out a variety of mission profiles."}, {"tag": "p", "text": "As the Clone Wars began with its first battle on the Separatist world Geonosis, the clone commandos were among of the first units deployed onto the battlefield, undertaking stealth missions to disrupt and destroy droid factories; Delta Squad was responsible for assassinating Geonosian Lieutenant Sun Fac. However, due to the fact that the Jedi had not yet been prepared to lead an army, nor could they distinguish clone commandos from regular infantry troops, roughly fifty percent of the commandos died in the first battle. Despite their training as elite soldiers, the commandos were unfit to perform the role of the infantry-based clone troopers. In the aftermath of the battle, squads that survived intact were kept together, such as Delta Squad, while surviving commandos from various squads were merged together, thus creating new units like Omega Squad. Over the course of the Clone Wars, the commandos were set to work in various other flash-points across the galaxy, wreaking havoc on the Separatist forces."}, {"tag": "p", "text": "Throughout the Clone Wars, there were many different opinions about the commandos. Some clones were impressed by the commandos' status within the Grand Army and were awed by their skills as a special forces unit. Other clones, especially the ones belonging to the infantry-based units, disliked the commandos and felt that their reputation was grossly exaggerated. Later in the war, many clones grew to hate the commandos' for their delving too much in the Mandalorian culture. Prior to the Clone Wars, Alpha-Ø2, a defective ARC trooper, went rogue and escaped from Kamino. He reunited many Mandalorians into a new mercenary force and fought against the Republic on behalf of the Separatist cause; the treason of Alpha-Ø2 even resulted in a Mandalorian assault on Kamino, where many of his clone brethren were killed in defense of their homeworld."}, {"tag": "p", "text": "Due to the Mandalorians' declaration of war against the Galactic Republic, as well as the fact that they were led by a treacherous clone of Jango Fett, many clone troopers rejected their genetic template's heritage and began to despise anything that had to do with the Mandalorians, including fellow clones who still imitated certain Mandalorian customs and traits. The clone troopers of the 2nd Airborne Company, having suffered high casualties against the Mandalorian Protectors, displayed open contempt for Omega Squad, a unit of clone commandos that felt deeply connected to their Mandalorian roots. As far as the vast majority of clones were concerned, the Mandalorians had become enemies of the Republic, and the mere notion that some of their own brethren behaved like the enemy was deeply offensive to the clones that swore absolute loyalty to the Republic."}, {"tag": "h3", "text": "The Rise of the Empire"}, {"tag": "p", "text": "In the waning hours of the Clone Wars, the Sith plot to seize control of the galaxy was realized after a thousand years of preparation. Darth Sidious, the Dark Lord of the Sith and the true identity of Supreme Chancellor Palpatine, initiated the near-extermination of the entire Jedi Order by issuing Order 66 to all clone troopers. Trained from birth to be unflinchingly loyal and to obey all legal orders without question, the clones executed their orders, thus resulting in the immediate deaths of thousands of Jedi throughout the galaxy. After Palpatine declared himself Emperor shortly afterward, the 25,000 year-old Galactic Republic ceased to exist, clearing the way for the rise of the Galactic Empire. Among the many changes that were enacted to reflect the Emperor's New Order, the Grand Army of the Republic was soon reorganized into the Imperial Army and Stormtrooper Corps respectively, the clone troopers were re-designated as Imperial stormtroopers, and the Republic commandos were rechristened as Imperial Commandos."}, {"tag": "p", "text": "As the Emperor's new apprentice and Supreme Commander of the Imperial Fleet, the Sith Lord Darth Vader wasted no time in taking on his task to exterminate all surviving Jedi that escaped Order 66 and fled into hiding. As such, all of the remaining ARC troopers and Imperial commandos were incorporated into the 501st Legion as a new special forces unit, thus placing them under Vader's direct command. In addition to their new role as Jedi hunters, the Imperial commandos were also tasked with tracking down and killing anyone who either sympathized with the Jedi, or aided them in any way. Another objective that the Imperial commandos took on was to hunt down and exterminate clone deserters and traitors, mostly former Republic commandos and rogue ARC troopers."}, {"tag": "p", "text": "Among the first to compose the ranks of the Imperial commandos were the remaining members of Delta Squad and Omega Squad respectively. Although still capable at operating in the field, due to their combat experience as veterans of the Clone Wars, one of their primary tasks was to train the Empire's newly-engineered clone stormtroopers. However, the new clones were barely a standard year old, having been speedily grown through Spaarti technology. As a result, they were far less independent-minded than the clone troopers from Kamino, and much more likely to depend upon the flash training and rhetoric that they had been taught. As soldiers, the Spaarti-Fett clones demonstrated poor marksmanship skills and disregarded traditional strategy for a simple charge towards the enemy. Commandos such as IC-1136 were shocked and exasperated by the operational effectiveness of the Empire's latest clone soldiers, or lack thereof."}, {"tag": "p", "text": "Under the 501st Legion, the Imperial commandos were divided into slightly larger squads than the \"pods\" that operated under the Old Republic. Galaar Squad and Omega Squad were combined into the Imperial Squad 40. Due to the commando casualties in the Clone Wars and the traitors that deserted the Empire, it was clear that the Imperial commandos' ranks could not be filled only by the first generation commandos that served under the Republic. In addition to the remaining commandos, the 501st Special Unit was also composed of regular clones grown from the Spaarti cylinders, much to the dismay of the original clone commandos."}, {"tag": "p", "text": "As previously mentioned, not all of the Republic commandos chose to obey Order 66. A small minority of commandos disregarded the command from the highest level of Republic authority, either out of sympathy for the Jedi Order or due to different personal reasons. With the exception of IC-1309 and IC-1136, the remaining commandos of Omega Squad fled in exile to Mandalore. Due to the influence of Sergeant Kal Skirata, who introduced them to Mandalorian culture, Omega Squad's commandos had been harboring thoughts of desertion for some time prior to Order 66. Instead of serving Emperor Palpatine, they opted to start a new life on Mandalore while also living as fugitives. Also, the Republic commandos of Ion Team regarded Order 66 as an invalid command and refused to execute their Jedi officer Roan Shryne. But unlike the deserters who retreated into hiding on Mandalore, Ion Team was unable to escape from the Empire's wrath. With the 501st Legion behind him, Darth Vader confronted Ion Team and personally killed two of its members; the remaining two commandos were captured alive by the 501st stormtroopers."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "Clone commandos were trained by a group of one hundred elite training sergeants chosen by Jango Fett, of which seventy-five were Mandalorian mercenaries. These men and women, known as the Cuy'val Dar trained the commandos in a variety of tactics and fighting techniques, but the impressionable commandos also developed a few behavioral traits similar to their instructors. The first generation of clone commandos were selected from the regular clone batches and then segregated into \"pods\" of four, effectively forcing them to depend on each other and work together in order to survive. During their training, commando squads were often pitted against each other during combat sessions."}, {"tag": "p", "text": "Clone commandos were trained in live-fire exercises, giving them a sense of the reality of combat long before the regular clones. Anti-terrorist training was conducted in a building nicknamed the Killing House. Though many commandos failed to survive their exercises, the rest learned rapidly, allowing them to become better soldiers. However, the the loss of fellow squadmates was felt by any commando who lost a vod—a brother. The commandos also experienced near-death torture to train them in resisting interrogation, and many clones were left mentally scarred from the experience."}, {"tag": "p", "text": "By the end of the commandos' training, the Kaminoans were very pleased with the results. Although unfit to fight on the battlefield as infantry soldiers, nor capable of performing complete solo operations like the ARC troopers, the clone commandos nevertheless demonstrated themselves as a new breed of warriors that few could challenge. Neither the regular clone troopers or even the elite ARC troopers could match the clone commandos in organization and team-work. Despite the fact that many commandos were indoctrinated in Mandalorian culture and regarded each other as brothers, the Kaminoans were impressed enough to dub their experiment a complete success."}, {"tag": "h3", "text": "Specialized training"}, {"tag": "p", "text": "Each clone commando was trained to handle a specialized task, varying from commando to commando. Some, like Sev, specialized in sniping and assassination. Others, like Fi, specialized as medics and received more advanced training than their other brethren in that field. Others, like Boss or Niner, showed more leadership potential and acted as squad leaders. Some, like Scorch and Darman, showed a natural skill with demolitions ordnance and acted as demo specs. Others, like Fixer or Atin, were trained to be able to handle a variety of technology-based tasks, such as slicing computers. Clone commandos were trained in: siege assault, counterinsurgency, hostage extraction, demolitions, assassination, surveillance, tactics, sabotage, espionage, and ambush."}, {"tag": "h2", "text": "Integration into trooper training regime"}, {"tag": "p", "text": "It appears that the clone commando program was so successful that some clone troopers were trained in commando skills and tactics. Some commando-trained troopers were CT-19/39, \"Green Wizard\", a recon trooper killed on Praesitlyn; RC-5108/8843, \"Corr\", a former bomb disposal expert taken under Kal Skirata's wing; the clone trooper squad that accompanied Mace Windu and Valiant during the hunt for Darth Sidious; and the non-ARC members of The Muunilinst 10."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Clone commandos were equipped with DC-17m Interchangeable Weapon Systems, kamas, and Katarn-class commando armor. For armament, some instead used DC-15s side arm blasters, E-Web heavy repeating blasters, Accelerated Charged Particle Repeater Guns, Accelerated Charged Particle Array Guns, or shotguns. For explosives, Commandos wielded improvised explosive devices, bore bangs, sonic detonators, flash-bang grenades, EMP grenades,, ribbon charges,[source?] frag grenades, ion grenades, and stun grenades."}, {"tag": "p", "text": "In addition, commandos utilized vibrodaggers, Geonosian force pikes, LJ-50 concussion rifles, Knuckle plate vibro blades, Night Ops Armor, and TIVs. RC-1138 used DC-17 hand blasters, while some clones used WESTAR-20 blaster pistols, Kamino saberdarts, garrotes, commando recon droids, remotes, or hydraulic shearing machine."}, {"tag": "p", "text": "Some clone commandos used EMP disruptors, detonation packs, AP Micromines, thermal detonators. Some had miniature bacta tanks, thermal detonator tape, bacta sprays, heads-up displays, dampener aerosols."}, {"tag": "p", "text": "Clone commandos were known to be heavily armed with an array of weapons and technology that were often vital to the success of their missions. Each commando was armed with the configurable DC-17m Interchangeable Weapon System that served as a blaster, sniper rifle, and anti-armor launcher all in one. They also carried either DC-15s side arm blasters, or shotguns. Commando generally wore advanced Katarn commando armor equipped with an integral backpack system and retractable vibroblade along with a built in tactical display and full spectral night vision in their helmets. Because the armor was silvery-gray, the other clone troops called them \"shiny boys\". However, some squads would customize their armor with special colors, or a number of dots on the left breast armor pad to symbolize rank and position in the hierarchy of the squad. Other squads would opt for improved camouflage, as was the case with Omega Squad, which wore matte black armor, and Yayax Squad, who wore gray splinter camouflage. Some commandos would add additional equipment to their armor like ammo packs, communications gear, additional sensors and even extra pieces of armor depending on their position in the squad."}, {"tag": "p", "text": "By default, the commandos were trained with the DC-17m, but oftentimes other weapons would be used or issued to them, depending on the situation. Katarn-class armor also featured a retractable knuckle plate vibro blade for melee combat. However, they were also supplied with an array of non-Republic exotic weaponry, such as slugthrowers, Accelerated Charged Particle Array Gun, Accelerated Charged Particle Repeater Gun, LJ-50 concussion rifle, LS-150 Heavy Accelerated Charged Particle Repeater Gun, improvised explosive devices, bore bangs, flash-bang grenades, and EMP grenades."}, {"tag": "p", "text": "Often one member of the squad would be given an E-web repeating blaster. This was an extremely cumbersome and heavy weapon as it had to be moved in several parts. When used by normal troopers, the E-web was manned by two troopers but such was the training given to the commandos that it was only manned by one. Some times commandos would each carry a section of E-web, dividing it into four parts if the mission required moving fast and/or over long distances."}, {"tag": "p", "text": "Shortly after the rise of the Empire had begun, the newly christened Imperial commandos received a new set of armor, painted in the Imperial uniform white and later employed a similar divison titled Storm commandos. Although IC-1136 preferred the old Katarn armor, the new Imperial armor helped him to forget about his past service to the Republic, as well as his dead secret wife, Jedi Knight Etain Tur-Mukan, Other commandos were not excited by the change as well, but nevertheless wore their new Imperial armor without complaint."}, {"tag": "h2", "text": "Known operations"}, {"tag": "p", "text": "Republic commandos were deployed across the galaxy following the First Battle of Geonosis, battling through the murky Geonosian hives and the dangerous forests of Kashyyyk."}, {"tag": "h2", "text": "Rank and color notation"}, {"tag": "p", "text": "The standard color of the Katarn armor worn by Republic commandos was silver-gray, regardless of rank. However, an experiment by the Kaminoans allowed for one squad, Delta Squad, to paint their armor as they saw fit and to test its effects on morale in combat. Delta Squad's superior performance during the Battle of Geonosis would pave the way for all other commando squads to paint their armor as well. Some commandos decorated their armor to their individual tastes or according to rank, while others, such as Omega Squad, ordered identical suits of matte black stealth armor, as they found the regular armor was easily spotted when crossing an open field."}, {"tag": "p", "text": "Delta Squad used circles on the left breast plate to designate rank. Boss, being the leader, had four circles. The other three squad members had two circles each, but only Fixer's are visible through the naked eye. Sev's and Scorch's are only visible through vision enhancement devices such as the electromagnetic scope of the DC-17m's sniper rifle attachment, possibly because the three of them share the same rank but Fixer is the accepted second-in-command."}, {"tag": "h2", "text": "Clone commando units"}, {"tag": "h3", "text": "Training companies"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the customization menu during multiplayer online gameplay there are a number of skins available for the clone commando. These include Night Ops, Demolitions, Ranger, Sniper and Recon."}, {"tag": "p", "text": "Delta Squad has been featured in the third season of The Clone Wars cartoon series which marked their first onscreen appearance."}, {"tag": "p", "text": "The term \"clone commando\" is misused in the novel The Cestus Deception, in which it is used to describe a squad of ARC troopers that form part of the novel's cast. Additionally, the term is used oddly in Jedi Trial, which portrays clone commandos as being deployed in waves led by an ARC trooper, rather than in groups in four as is usually seen in Clone Wars-related media."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}