{"url": "Clone_engineer", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Clone trooper variants", "Category:Engineers"], "nodes": [{"tag": "h1", "text": "Clone engineer"}, {"tag": "p", "text": "The clone engineers, also known as clone combat engineers, were members of special Combat Engineer Battalions in the Grand Army of the Republic that were well versed in a range of engineering techniques, from repairing vehicles to performing demolitions work."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "On Kamino some clones were randomly chosen to become engineers and became attuned to their vehicles and idiosyncrasies. On the battlefield they were assigned to heavy artillery units, such as HAVw A6 Juggernauts and SPHA units for armored ground assault."}, {"tag": "p", "text": "Clone engineers were equipped with dispensers that held bacta and ammunition, as well as F-187 fusioncutters that enabled them to repair vehicles, turrets, medical and power droids. They were armed with detonation packs for sabotage and shotguns, or blaster pistols in case they had to engage enemy units."}, {"tag": "p", "text": "During the Phase I stage of Clone Troopers, the Grand Army of the Republic utilized repurposed clone pilots to fulfill the role of the engineer, and performed many of the same tasks with slightly less specialized kits, many keeping their DN Bolt Casters in place of shotguns."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Various Galactic Republic military units were known to include Combat Engineer Battalions, such as the 38th Armored Division or the famed 501st Legion. Engineers played crucial role in the Battle of Thule, where they were deployed into energy farms to take down their enemy's shields, leaving them vulnerable to attack. Clone engineers were also charged with constructing outposts in the name of the Galactic Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}