{"url": "A_Quick_Salvage_Run", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "A Quick Salvage Run"}, {"tag": "p", "text": "\"A Quick Salvage Run\" is the second episode of the second season of Star Wars Resistance and the twenty-third episode overall. It premiered on television October 13, 2019, on Disney Channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Colossus, low on hyperfuel, arrives at D'Qar only to find the aftermath of a deadly battle — but Kaz looks to seize an opportunity."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Kaz's comlink"}, {"tag": "p", "text": "The episode opens with a shot of Commander Pyre and Agent Tierny's Resurgent-class Star Destroyer floating in space. Tamara Ryvora, who is now a First Order TIE fighter pilot is standing by her bed in her barrack. Two TIE fighter pilots walk past her. The male pilot asks his comrade if she has heard about the new TS-7s coming out next cycle. The female pilot replies that she prefers the V-series, which she regards as more powerful."}, {"tag": "p", "text": "When they have left, Tam takes her comlink out of her locker and plays back Kazuda Xiono's message. Kaz tells her that he has made a terrible mistake by lying about who he was and why he came to the Colossus. But Jace Rucklin arrives and interrupts, recognizing Kaz's voice as Tam hurriedly shuts off the message. Tam chastises him for sneaking up on her."}, {"tag": "p", "text": "Jace warns her that she will be in trouble with the First Order if they catch her with the comlink. He tells her that she has to turn it in. Tam asks if he will turn her in if she doesn't. Jace says that he would have to and adds that her friends lied to her. He tells Tam that Kaz and Jarek Yeager used her and kept her in the dark about Kaz being a spy, putting her in danger every single day. Rucklin asks what she is going to do."}, {"tag": "h3", "text": "A bumpy voyage"}, {"tag": "p", "text": "Insider Aunt Z's Tavern aboard the Colossus, Kazuda Xiono tells Neeku Vozo that things have gotten lively since the pirates have joined them. Neeku regards the pirates as a fascinating lot and wonders whether he would make an adequate pirate. A drunken Bith pirate coughs into Neeku's face before laughing and stumbling over. Kaz says there is only one way to find out and buys Neeku a drink."}, {"tag": "p", "text": "He tells G1-7CH to give them two drinks but the droid tells them they are running low on supplies. Neeku remarks that the platform will soon run out of food, water, gorgs, and fuel at their current rate of consumption. Synara San tells them that this is becoming a real problem and asks Kaz if he has talked to the captain about it. Kaz reassures her that they will be able to refuel and resupply at the destination they are traveling to."}, {"tag": "p", "text": "When Synara asks Kaz where they are going, he replies that they are not at liberty to say just yet. Synara says he can keep his secret and offers to help in anyway. Just then, the Hassk pirate Snarl is thrown onto their table and Synara flicks him off. Kaz accepts her offer."}, {"tag": "p", "text": "Shortly later, he receives a comlink message from Jarek Yeager telling him to come to the command deck since a long-range communications is coming in for him. Neeku wonders if it is from Tam but Synara asks why she would contact Kaz if she defected to the First Order. Neeku says he will refrain from comment before backing away."}, {"tag": "p", "text": "Synara confronts Kaz for contacting Tam. Kaz replies that he sent her a message to check if she was okay and begs her not to tell anyone. Synara warns him to consider whether he can trust Tam. Kaz replies that he trusted Synara. Synara doesn't respond but has a concerned expression on her face."}, {"tag": "h3", "text": "Transmission from Hamato"}, {"tag": "p", "text": "On the Colossus command bridge, Kaz asks Yeager where the transmission is coming from. Yeager says he has no idea but tells him that it is a secure frequency and that he better answer before they lose the signal. Kaz discovers that the transmission is a hologram feed of his father Hamato Xiono. Kaz is amazed that his father survived the Hosnian Cataclysm."}, {"tag": "p", "text": "Hamato is relieved that his son is safe and fine. Kaz asks if the rest of the family made it. Hamato tells Kaz that their family was offworld during the Hosnian Cataclysm. He says that he and Kazuda Xiono's mother had been trying to contact their son for several days. Hamato tells Kaz that the galaxy is officially at war. Kaz asks Hamato to join them at D'Qar but he tells his son to get as far away from D'Qar as he can."}, {"tag": "p", "text": "Xiono says that he can't because people are counting on him. Hamato says he has no idea what he has gotten himself into. The transmission begins to fade. Hamato tells Xiono that the First Order has identified him and that his actions have put his whole family in danger and that there may be bounty hunters coming after him. Just then, the transmission is lost. Xiono cries out for his dad."}, {"tag": "p", "text": "Just then, 4D-M1N informs Captain Imanuel Doza that they are approaching the Ileenium system system but that magnetic interference is preventing communications. Doza tells her to approach the system with caution and to scan the area when they are in range since they don't know what they might find."}, {"tag": "h3", "text": "Arriving in the Ileenium system"}, {"tag": "p", "text": "A stormtrooper brings Tam and Rucklin to Agent Tierny and Commander Pyre on the bridge of the Star Destroyer, telling her that these two recruits wanted to see her. Tam brings the comlink to Agent Tierny and tells him that Kazuda Xiono contacted her. Tierny thinks that they can put the comlink to good use and asks if Commander Pyre agrees. He says immediately before walking away. Tierny dismisses Cadet 533 and allows Tam and Rucklin to walk away."}, {"tag": "p", "text": "The Colossus approaches D'Qar and the planetary ring around the planet. Neeku tells the others that he is not getting a response from the Resistance base but just static. Yeager remarks that the Resistance must have put up a fight recently. The crew see scattered starship debris and a red patch of blazing inferno on the planet's surface. Xiono tries to contact the Resistance base but receives no response. Yeager thinks that they are too late. Xiono is horrified that the Resistance base has been wiped out by the First Order."}, {"tag": "p", "text": "While ploughing through the debris, Yeager tells Kaz that this was a huge battle and that there is nobody left down there. Yeager tries to comfort Kaz by telling him that Commander Poe Dameron and General Leia Organa must be on the other side of the galaxy by now. Captain Doza backs up Yeager and tells Kaz that this entire area is now compromised. He advises them to jump into hyperspace."}, {"tag": "h3", "text": "Enlisting the pirates"}, {"tag": "p", "text": "Neeku points out that they cannot replenish their coaxium hyperdrive fuel now that the Resistance base has been destroyed. He adds that they do not have the ability to jump anywhere. When Captain Doza asks how they are going to find coaxium, Kaz points out a wrecked First Order Mandator IV-class Siege Dreadnought floating in the distance. Kaz speculates that the ship would have coaxium."}, {"tag": "p", "text": "Yeager thinks this is a good idea and proposes sending a team if scans prove that there is nobody there. Kaz responds that they have the best salvage team around. Captain Doza asks if he doesn't mean the pirates. Kaz thinks that the pirates will jump at the chance to help them out."}, {"tag": "p", "text": "In Aunt Z's Tavern, the pirates play fight while their leader Kragan Gorr laughs at Kaz's request that they help Captain Doza. Gorr says that they are not Captain Doza's lackeys while the Weequay pirate Drell says that they only answer to Captain Kragan. Kaz is disheartened."}, {"tag": "p", "text": "He tries to tell the pirates that they have to work together to survive. However, Snarl rubs his face against Kaz and laughs aloud. Synara tells Snarl to back off. Kaz responds that if the First Order shows up, they cannot run away and are all doomed. Synara comes to Kaz's aid by enticing Kragan with the promise of weapons and tech sitting aboard the wrecked ship ripe for the taking. Kragan agrees to help but warns that Captain Doza is going to owe them big time."}, {"tag": "h3", "text": "The hunt for the Colossus"}, {"tag": "p", "text": "Meanwhile, a First Order officer informs Commander Pyre that they have decrypted 533's comlink and have traced the signal back to the Ileenium system. Pyre realizes that is D'Qar and asks why they would go there because they wiped out the Resistance base. Tierny suggests that the Colossus is unaware of that development and remarks that Tamara is becoming quite the asset. Commander Pyre issues orders for the Star Destroyer to set a course for D'Qar and to prepare all TIE fighters for battle. He says that he hopes this is not a waste of his time."}, {"tag": "p", "text": "Later, a stormtrooper visits Tam and tells DD-533 that Commander Pyre and Agent Tierny want to speak with her. Tam and Rucklin stand at attention as the two First Order senior officers enter the room. Tierny congratulates Tam that her information has helped them to discover the location of the Colossus. Tam pretends to be pleased."}, {"tag": "p", "text": "Tierny tells Tam that she listened to the message that Kazuda Xiono sent her and thinks that it must have caused her great pain and anger to hear his \"heartless admission of betrayal.\" Tierny says she can't imagine how it would make her field except to further her conviction that she made the right choice. She tells Tam that is why she wanted to do something special for her. Tierny invites Tam to join her and watch the price of her friends' betrayal. Tam pretends to be grateful while a smiling Rucklin playfully elbows her."}, {"tag": "h3", "text": "A salvage operation"}, {"tag": "p", "text": "The Warbirds fly out in their sail barge Galleon towards the wrecked Mandator IV-class Siege Dreadnought. Kaz tells Synara that the dreadnought is massive and that he has never seen such a big ship. Kragan observes that the ship still has power and tells Valik to dock the Galleon against the hangar. Kaz reminds them that they need to get in and out fast because the First Order could arrive any second."}, {"tag": "p", "text": "The pirates, Kaz, Neeku, and CB-23 step into the darkened corridors of the dreadnought. CB-23 warns them in Binary that the air supply is low and Kaz translates for her. Kragan leads the salvage team in a certain direction. Valik tells Snarl to grab that crate. Neeku tells Valik that he finds her life choices intriguing and asks her what is life like being a pirate."}, {"tag": "p", "text": "Valik replies that it is mainly pillage and plunder while Snarl adds salvaging. Synara tells the group to stop lagging. Skreek tells Kaz and the group that he has found some coaxium by the door. Xiono and the pirates enter the dreadnought's hyperdrive chamber. Kaz contacts Neeku by comlink, telling him that he found the coaxium and the hyperdrive."}, {"tag": "p", "text": "Neeku soon enters carrying several boxes of salvage. When Kaz asks what is going on, Neeku replies that life being a pirate is exhilarating. Kaz tells him to put it down because they need his help. Neeku remarks that he did not know being a pirate would be so much work."}, {"tag": "p", "text": "Neeku observes that the hyperdrive was badly damaged but that the reserve canister of coaxium is still intact. Synara tells him to grab it and go. Neeku presses a red button but finds that the coaxium canister is still locked. When Kaz asks if they can unlock it, Neeku replies that the locks are very sophisticated. Kaz says that he doesn't do \"sophisticated\" but only does fast. Kaz is fearful that the First Order will arrive."}, {"tag": "h3", "text": "Skirmish above D'Qar"}, {"tag": "p", "text": "Aboard the Star Destroyer, Tam stares into the viewport with Agent Tierny and Commander Pyre. The ship soon emerges out of hyperspace near the Colossus. Agent Tierny smiles and says there she is. Aboard the Colossus command deck, Yeager warns Captain Doza about the appearance of the First Order Star Destroyer. Doza sighs that it was only a matter of time and asks Kaz if he is there. Kaz tells Doza they have found the coaxium. Doza tells him to get back to the ship."}, {"tag": "p", "text": "The First Order bridge officer tells Commander Pyre and Agent Tierny that he has detected the Galleon inside the dreadnought. Pyre remarks that the pirates are up to something suspicious. Tierny orders that the TIE battalion be dispatched to engage the Colossus. As TIEs approach the Colossus, Captain Doza orders Ace Squadron to scramble their ships in order to buy the pirates some time. Torra Doza fires up the Blue Ace and the Ace fighters exit their hangars to engage the TIEs."}, {"tag": "p", "text": "Hype Fazon tells them to stay sharp or they will join this junk field. Captain Doza radios Kaz and tells him and the salvage team that they are engaging the First Order to but them some time. Kaz says they will be back in five minutes. Synara asks CB-23 if she can burn through the coaxium canister's locks. The droid lights her blowtorch but Neeku warns that shaking or releasing the coaxium would be dangerous. Kragan responds that they don't have time for this and applies pressure onto the nozzle despite Kaz's protests."}, {"tag": "p", "text": "Commander Pyre orders his Star Destroyer's gunners to fire on the wrecked dreadnought. Kragan manages to trigger open the coaxium's hatch but the coaxium cylinder slips out onto the floor. Kaz manages to stop it from falling over the edge and tells them they have to evacuate while they still can."}, {"tag": "h3", "text": "Evacuating the coaxium canister"}, {"tag": "p", "text": "The outnumbered Ace fighters lead the TIEs on a chase through the debris. Torra Doza tells them to fly around the debris. Freya Fenris doesn't think the debris will make a difference because they are outnumbered. As the battle rages, Neeku, who is holding the coaxium cylinder, struggles to maintain his balance in the dreadnought's corridor. While navigating their way through the corridor, they encounter Snarl and Valik, who are laden with loot. Kaz is outraged that these pirates are still obsessed with loot while Kragan tells them to head back to the Galleon."}, {"tag": "p", "text": "Aboard the Star Destroyer's bridge, Commander Pyre tells Tam that the Colossus won't escape them this time. As the Star Destroyer opens fire on the wrecked dreadnought, the Galleon narrowly escapes the explosion. Kaz tells the Aces that they have the coaxium and to return to the Colossus. Torra tells her fellow pilots to retreat."}, {"tag": "p", "text": "Freya remarks that these TIE fighters are good with Torra responding that they are here to kill them. The Galleon is hit in the rear by enemy laser fire. Kragan tells Synara to prepare the portside cannons. Synara manages to activate the portside cannons and also the starboard cannons, taking out one TIE fighter. With difficulty, Valik manages to land the Galleon inside the Colossus hangar."}, {"tag": "p", "text": "Kaz and Neeku cradle the coaxium cylinder as the ship makes a rough landing. Neeku questions Kragan's definition of a gentle landing. After disembarking, he tells Captain Doza they have acquired the coaxium and are heading to the hyperdrive chamber. Under Doza's orders, 4D-1MN prepares the Colossus for a hyperspace jump."}, {"tag": "h3", "text": "Installing the coaxium"}, {"tag": "p", "text": "Kaz, Neeku, Synara and CB-23 enter the hyperdrive chamber. Kaz passes the coaxium cylinder to Neeku and tells him to work his \"magic.\" Neeku wishes that the First Order would be so kind as to stop bombarding them for a micro-second. Over the intercom, Captain Doza asks the Aces where they are. Torra replies that she is coming in now. The Aces enter their hangars with TIEs hot on their trail."}, {"tag": "p", "text": "Meanwhile, Neeku says that he must first release the inner casing gently. An alarmed Kaz says that releasing it is a bad idea. Neeku warns it may explode. Freya and the other Aces crashland into the hangar. As the Star Destroyer strafes the Colossus, Neeku removes the volatile inner casing. Synara warns that the coaxium is growing brighter."}, {"tag": "p", "text": "4D-M1N warns Captain Doza that the shields cannot hold on any longer. When Captain Doza tells Kaz and his team to hurry up, Kaz whispers that you cannot rush these things. As Neeku places the coaxium into a slot, the gunnery officer informs Commander Pyre that the Colossus has lost its shields. He orders the Star Destroyer to wipe out the station. Neeku manages to slot the coaxium into the hyperdrive just as Quadrant C takes hull damage and Doza asks Kaz where is his power. The hyperdrives come to life and 4D initiates a hyperspace jump."}, {"tag": "h3", "text": "A narrow escape"}, {"tag": "p", "text": "Aboard the Star Destroyer, Tam breathes a sigh of relief while Agent Tierny and Commander Pyre are visibly disappointed. Pyre reassures them they that have only lost them temporarily and thanks DD-533 for her invaluable help. Before Tam can leave, Tierny asks Tam to notify them if Xiono reaches out to her again. Tam says of course and prepares to leave. Tierny reminds her to put on her helmet before turning back to the viewport. Pyre tells Tierny that Tam needs to be reconditioned. If she can be reconditioned to their cause, she can be expendable. Tierny disagrees and says that it is advantageous that they keep Tamara as she is. She surmises that Tam is key to finding the Colossus."}, {"tag": "p", "text": "As the Colossus travels through hyperspace, Captain Doza thanks Kaz for his good work. Kaz says that he could not have done it without Neeku, Synara, and CB-23. Doza thanks them all. In private, Yeager confides to Captain Doza that something troubles him. If the First Order had already wiped out that base, there would be no reason for them to return to D'Qar. He asks how they would know how to find the Colossus. Doza speculates that we must have triggered something when they arrived at D'Qar. Yeager replies maybe."}, {"tag": "p", "text": "Meanwhile, Synara asks Kaz and Neeku to consider how the First Order was able to track them down. She confronts Kaz about the conmlink message he sent to Tam. Kaz refuses to believe that Tam gave them up. Neeku supports Kaz but Synara warns that she can't be too sure."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}