{"url": "Clone_jet_trooper", "categories": ["Category:Legends articles", "Category:Clone trooper variants"], "nodes": [{"tag": "h1", "text": "Clone jet trooper"}, {"tag": "p", "text": "Clone jet troopers, or aerial clone troopers, were clone troopers equipped with and trained in the use of jetpacks."}, {"tag": "p", "text": "They were the successors of the Republic rocket-jumpers of the Old Sith Wars and Darca Nyl's airborne mercenaries from before the Invasion of Naboo and the predecessors of the jumptroopers and sky troopers of the Galactic Empire."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Clone jet troopers were part of the Grand Army of the Republic. Jet troopers utilized their limited flight jetpacks to rapidly cover great distances and gain aerial advantage over their enemies. The agility of the flying jet trooper made him difficult to hit and could ambush their enemies from behind."}, {"tag": "p", "text": "Jet troopers were issued Merr-Sonn electromagnetic pulse launchers. They were also equipped with the DC-17 commando pistol, which was very powerful and accurate, especially for its size. It also had a better cooling capacity so it could continue firing for a long period of time without overheating. They also carried V-1 thermal detonators. The troopers learned to incorporate their jetpacks in battlefield tactics, sometimes mounting ambushes like the Mandalorians who had trained them."}, {"tag": "p", "text": "Two different types of jet trooper armors were in use during the Clone Wars. The first wore standard Phase I clone trooper armor with the addition of a short-duration JT-12 jetpack. They later adopted Phase II clone trooper armor. The Kaminoan resistance to the Galactic Empire utilized jet troopers as their primary infantry, but carried DC-15x sniper rifles as one of their primary weapons."}, {"tag": "p", "text": "Phase I jet troopers wore clone trooper armor with green markings. Phase II jet trooper lacked these markings, instead having a darker tone with a green visor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jet troopers first saw action at the First Battle of Geonosis. They were incorporated into many units, one of them being the 501st Legion."}, {"tag": "p", "text": "In the Battle of Geonosis, a jet trooper was assigned to acquire a Geonosian holocron that fell from one of the Geonosians. The holocron was successfully delivered to Checkpoint Alpha and sent to be analyzed for its secrets. Jet troopers which were part of the 501st Legion also saw action in other battles of the Clone Wars."}, {"tag": "p", "text": "After the rise of the Galactic Empire, the jet troopers were succeeded by the Imperial jumptroopers and Sky troopers."}, {"tag": "h2", "text": "Variations"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clone jet troopers are one of the Republic classes in the 2004 video game Star Wars: Battlefront and its 2005 sequel, Star Wars: Battlefront II."}, {"tag": "p", "text": "Clone troopers using jetpacks have appeared in Star Wars: The Clone Wars TV series, but nothing has connected these troops to the jet troopers."}, {"tag": "p", "text": "LucasArts designed the clone blaze trooper, a division of the jet trooper, after looking at the concept art for the jet trooper."}, {"tag": "p", "text": "LEGO included an \"aerial trooper\" based on the sky trooper concept art with the Clone Turbo Tank set. The aerial trooper also appeared as a Hasbro action figure and was described in Star Wars Insider 84 as a trooper of the Sky Corps."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}