{"url": "Clone_gunner", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Clone trooper variants"], "nodes": [{"tag": "h1", "text": "Clone gunner"}, {"tag": "p", "text": "Clone gunners were clone troopers that manned vehicle-mounted weapons or artillery, wearing specialized clone trooper armor throughout their service. Clone gunners participated in multiple battles against Separatist forces, including in the Battle of Christophsis and the Second Battle of Geonosis. Clone Sergeant \"Stew\" served aboard the Endurance and at one point, participated in the instruction of a group of clone cadets from the Clone Youth Brigade."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Description"}, {"tag": "p", "text": "Clone gunners were specialized clone trooper operators that were trained in the usage of artillery, other heavy ground weapons, and starship armament. Gunners used a variant of the Phase I clone trooper armor early during the war, which contained reinforced chest armor and helmets with additional noise insulation to protect against the recoil and sound of the weapons they operated. Additionally, standard shoulder armor was replaced with reinforced shoulder pieces. Commonly, clone gunners had dark green reinforced armor, with brownish helmet protection, however, clone gunners were also known to use orange reinforced armor, with orange helmet protective gear."}, {"tag": "p", "text": "This armor was usually modified to represent unit affiliation. The clone gunners of the 7th Sky Corps could customize their armor in orange and brown desert camouflage. Clone gunners of a clone tank division's ground squadron that operated alongside the 104th Battalion customized their armor with dark colors and the stylized mouth of a creature on their helmet."}, {"tag": "p", "text": "Once the Republic Military transitioned to Phase II clone trooper armor, clone gunners were also provided with the upgraded clone trooper armor. One variant of the armor included helmet modifications, as well as a large chest and right shoulder pauldron. Clone majors were equipped with this Phase II clone gunner armor. Additionally, another type of Phase II armor was used by clone gunners, which was a direct upgrade of the previous set of armor. This armor set included the additional helmet insulation equipment, as well as reinforced chest and shoulder armor. Both Phase I and the secondary Phase II armor of the clone gunner were identical to the armor used by Clone Engineers, which were a different specialization of clone troopers that confirmed that Republic vehicles were operating in top condition."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "In the Grand Army of the Republic, clone gunners manned the main turret cannon of All Terrain Tactical Enforcers, which were designated as Firefont 04 mass driver cannons. Clone gunners also operated AV-7 Anti-vehicle Artillery Cannons in many battles, as well as the light laser cannon turret or the KB-50a beam cannon that were situated on TX-130 Saber-class fighter tanks. Clone gunners also crewed HAVw A6 Juggernauts, serving under the Juggernaut's clone major. In the Republic Navy, clone gunners operated capital ship weapon turrets to defend their starship against enemy starfighter attacks."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Christophsis, Teth, and Bothawui"}, {"tag": "p", "text": "Clone gunners saw action within the Galactic Republic early during the Clone Wars against the Confederacy of Independent Systems, participating in the Battle of Christophsis. There, four clone gunners, each operating an AV-7 artillery piece, held Separatist forces at bay with the support of ground troops and tanks from the 501st Legion and the 7th Sky Corps, respectively under the command of Jedi Generals Anakin Skywalker and Obi-Wan Kenobi. Gunners subsequently participated in the Battle of Teth with the 501st's Torrent Company, as they manned the cannons of two All Terrain Tactical Enforcers. Both gunners were killed during the engagement, the first when a walker was destroyed, and the second was shot out of the cannon and fell to his death. During the Battle of Bothawui, the naval task force of General Skywalker deployed a large contingent of AT-TE walkers on the asteroid field surrounding the planet Bothawui. There, the walkers and its gunners ambushed the Separatist fleet under the command of General Grievous, allowing Republic forces to win the battle."}, {"tag": "h3", "text": "Ryloth, Felucia, and Devaron"}, {"tag": "p", "text": "Clone gunners once again took part in the Battle of Ryloth, when the AT-TE walkers of the 91st Mobile Reconnaissance Corps were deployed to liberate the Twi'lek homeworld. Gunners later participated in a battle on Felucia, where Republic forces separated into two tank groups, which included AT-TE walkers and a HAVw A6 Juggernaut, and were overwhelmed and trapped by Separatist ground forces. Surviving Republic forces were evacuated by gunships from the 104th Battalion. During the Battle of Devaron, three gunners manned the cannons of AT-TE walkers that were deployed atop a Separatist Munificent-class star frigate in an attempt to rescue Jedi Master Bolla Ropal. During the topside boarding action, one walker was destroyed, killing its gunner in the process."}, {"tag": "h3", "text": "Second Battle of Geonosis"}, {"tag": "p", "text": "Clone gunners notably participated in the Second Battle of Geonosis, manning the cannons of the multiple AT-TEs deployed by the 7th Sky Corps, the 501st Legion, and a special forces battalion. The gunners assigned to the 7th's 212th Recon Division fielded desert camouflage, and provided fire support from their walkers as they defended Point Rain from being overrun. The 501st's walkers were destroyed, while the special forces battalion's tanks were diverted from the main battlefield after encountering obstacles. Once all forces regrouped at Point Rain and pushed back the advancing Separatist forces, the encircling tanks were deployed to destroy a nearby deflector shield generator. Once the 501st's troops created an opening, the gunners on several AT-TEs fired upon the structure, destroying it."}, {"tag": "p", "text": "After some time, Republic forces besieged the Separatist primary droid foundry, and advanced with troop columns and AT-TEs, and several AV-7s were called to the front lines of battle. Once the area was temporarily cleared, the gunners engaged Separatist super tanks, which were being deployed from the foundry. The gunners and their cannons were unable to impact the tanks, and were all destroyed and killed by Separatist forces. Eventually, the Republic forces emerged victorious."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}