{"url": "Clone_shadow_trooper/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Clone trooper variants", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Clone shadow trooper"}, {"tag": "p", "text": "Clone shadow troopers were an elite cadre of clone troopers, devised by Director Armand Isard of Republic Intelligence during the Clone Wars. Since the numbers of the Advanced Recon Commandos were dwindling, Isard created the shadow troopers as a reconnaissance unit, who, with the benefit of greatly modified and expensive armor, could operate covertly and undercover. Using magseals installed in their armor, shadow troopers could attach plates to themselves that could pass them off as mercenaries belonging to certain factions. With that advantage, they could infiltrate facilities and gather intelligence with ease."}, {"tag": "p", "text": "During the late stages of the war, the role of the shadow trooper expanded, with some performing sniper duties, while others would be used on the battlefield. Though their jamming systems would prevent them from working alongside standard troopers, shadow troopers were occasionally dispatched before large-scale invasions to install jamming devices in key cities, which would allow their comrades to infiltrate their targets with stealth and efficiency. Shadow troopers saw later use in the Galactic Empire as guards to both facilities and individuals. In particular, Inquisitor Valin Draco enlisted a group of the troopers for his expedition to the Almas Academy. The shadow troopers would later become the model on which storm commandos and shadow stormtroopers were based."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, Director Armand Isard of Republic Intelligence developed the shadow trooper division, which was created to serve as a reconnaissance tool. Their formation was designed to combat the dwindling numbers of Advanced Recon Commandos, but they could operate in a far more covert manner than that of the commandos. The shadow troopers were given highly modified and highly expensive armor that suited their roles better than the standard fatigues."}, {"tag": "p", "text": "In 19 BBY, when General Grievous of the Confederacy of Independent Systems was located on Utapau, shadow troopers were called in to infiltrate six of the planet's sinkhole cities and place jammers that would allow General Obi-Wan Kenobi and the Third Systems Army to invade the planet without notice. As a result, Grievous was killed, and Utapau was placed under Galactic Republic control."}, {"tag": "p", "text": "In the aftermath of the Clone Wars, Palpatine, now Emperor of the galaxy following his Declaration of a New Order, established a secret storehouse on Utapau and assigned the shadow troopers to guard it. While the rest of the Stormtrooper Corps received an upgrade from the Phase II clone trooper armor to stormtrooper armor, shadow troopers retained their original appearance under the new regime, as a grim reminder of Palpatine's ascension. The phrase \"Emperor's black bones\" was said to have originated from someone who set eyes upon members of the cadre during Palpatine's reign."}, {"tag": "p", "text": "In 19 BBY, Palpatine sent his apprentice, Darth Vader, to the Ghost Nebula to find an Imperial Star Destroyer, under the command of Admiral Garoche Tarkin, which had gone missing. Landing on the planet Atoa, Darth Vader and his 501st Legion troopers engaged the Atoan forces. During the fighting, shadow troopers under the command of Captain Shale were able to launch a sneak attack on the Atoans allowing the Imperial forces to defeat them."}, {"tag": "p", "text": "Inquisitor Valin Draco enlisted the shadow troopers for his own cause, reasoning that if they were good enough to guard Palpatine's storehouses, they were good enough to guard him. In circa 17 BBY, he took a small detachment of the troops to the Almas Academy, where he searched for Darth Rivan's holocron. Within the academy, he and his guard were confronted and defeated by a group of Alderaanian Resistance agents working for the fugitive Jedi Master Denia."}, {"tag": "p", "text": "The success of Isard's shadow troopers would breed several variants in the Imperial Period, in particular the storm commandos and the shadow stormtroopers, which were used by Imperial agent Blackhole."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Shadow trooper armor was based on standard Phase II clone trooper armor, although it featured several strategically placed magseals. The magseals allowed for the placement of cosmetic plates that could alter each individual trooper's appearance, with different plates giving them the appearance of a Hutt Cartel or Black Sun mercenary, or other miscellaneous factions. While the plates could disguise the wearer's sensor signature and project the image of something other than a Human, they were primarily for appearances only."}, {"tag": "p", "text": "The plates could also alter the walk of a clone trooper, disguising the \"clone gait\" that was familiar to some. A jaw switch was installed in the armor, in case a shadow trooper's identity was discovered. Activating the switch would disengage all magseals and allow the trooper to regain full use of his Phase II armor. As a further modification, the Phase II armor was covered with a sensor reflective material, which absorbed active scans. It was also protected from passive scans by thermal dampers and electro-magnetic hardening. The visor of the helmet gave off a red glow, which, in conjunction with their dark appearance, was considered intimidating by some. Some shadow troopers would wear kamas and pauldrons."}, {"tag": "p", "text": "Omni-directional jammers further enhanced the shadow trooper's invisibility, although with such devices in operation, they usually could not operate in close proximity with standard clone troopers, whose helmet systems would suffer the effects of the jamming. Instead of wielding the standard DC-15S, shadow troopers were equipped with the DC-19 \"Stealth\" carbine, which featured a sound suppressor, so the troopers could operate in relative silence. An optional function, which allowed the blaster to fire bolts invisible to the regular visual spectrum, was favored by shadow trooper snipers. The invisible bolts, however, were highly expensive, had to be reloaded after ten shots, and as a result of their usage, the DC-19s had to be cooled down afterwards to prevent damage to the weapon's dampeners. Vibrodaggers rounded out the shadow trooper armory. In addition to their standard kit, troopers could use DC-15A blaster rifles and blaster pistols commonly utilized by scout troopers."}, {"tag": "p", "text": "Although the distinctive standard Republic gunship was not well suited for shadow troopers' generally low operational numbers and need for stealth, modified shadow trooper gunships, equipped with highly advanced sensor-jamming packages and specialized sensor-refractive armor plating, were employed in cases where an entire squad was to be inserted behind enemy lines."}, {"tag": "h2", "text": "Application"}, {"tag": "p", "text": "Used primarily for reconnaissance, shadow troopers would operate alone, in pairs, or, less commonly, in squads. While still in their armor, they would work undercover, posing as bounty hunters or other mercenaries, which allowed them to discreetly enter and leave locations and adequately collect valuable intelligence. They were aided in their efforts by their effectively sensor-proof suits of armor. Due to the high-tech jamming equipment built into their armor, shadow troopers, for the most part, did not operate alongside standard clones, for fear of disrupting their comrades helmet systems."}, {"tag": "p", "text": "Some shadow troopers operated as snipers, using the \"invisible bolt\" feature of the DC-19 carbine to great effect. In some situations, such as the one on Utapau in the waning days of the Clone Wars, shadow troopers were inserted to ensure the successful entry of a much larger invasion force. During the reign of Emperor Palpatine, shadow troopers' roles would extend to protection, and they would be assigned to guard either installations or key personnel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The shadow trooper originated as a Hasbro action figure from the 2005 Revenge of the Sith line. The figure was a Target exclusive, and was labeled \"Utapau shadow trooper.\" The backstory of the shadow troopers was elaborated on by Sam D. Garito, writing under the alias of \"Maso Tirag,\" through StarWars.com's Hyperspace feature \"What's The Story?\" In his writings, Garito made connections between the troopers and such elements from the Expanded Universe as Armand Isard from Michael A. Stackpole's X-Wing: Rogue Squadron, and the Blackhole stormtroopers from Russ Manning's Gambler's World. The shadow troopers would later be used by Abel G. Peña and Jean-François Boivin in the role-playing adventure Echoes of the Jedi as non-player characters. In Star Wars Insider 100, the shadow troopers were listed at number sixty-two in the 100 Greatest Things About Star Wars... Ever! list. The article erroneously listed the Dusty Duck, which came in at number seventy-one, to be the only \"What's the Story?\" entry to make the list. In 2008, more shadow trooper figures were produced by Hasbro, and were at first exclusively sold at Jedi-Con 2008, before being made available on StarWars.com."}, {"tag": "p", "text": "In the 2011 non-canonical video game LEGO Star Wars III: The Clone Wars, a clone shadow trooper model can be built by obtaining all ten LEGO minikits in the \"Blue Shadow Virus\" level. When this has been done, a clone shadow trooper can be purchased and used in the Free Play mode of the game. However, the “clone shadow trooper” is in reality an Imperial shadow stormtrooper."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}