{"url": "Clone_tank_gunner", "categories": ["Category:Legends articles", "Category:Clone trooper variants"], "nodes": [{"tag": "h1", "text": "Clone tank gunner"}, {"tag": "p", "text": "Clone tank gunners were specialized clone troopers who served in the Grand Army of the Republic during the Clone Wars as gunners on several of the Galactic Republic's vehicles, warships, and heavy artillery cannons."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "While all clone troopers were trained to fire larger weapon platforms such as artillery and starship turbolasers, there were some who were selected for specialized training in this field. These individuals were trained to become experts in such an art and engaged enemies long before they could reach close range combat. One of the hardest lessons for such recruits to forget was the fact that sustained fire gave away their position. While a useful trait amongst clone troopers on the battlefield, clone gunners had to forget such an aspect in combat in order to work effectively."}, {"tag": "p", "text": "In terms of equipment, they were often provided with DC-15 blaster pistol for close range combat though they were typically seen using heavy weapon emplacements. These troopers wore custom Phase I clone armor that had grey and tan on the helmet and a little extra armor on the chest plate. The helmet was insulated from noise and in addition their armor was reinforced to better protect themselves from the recoil of the cannons that they manned. In terms of artillery, these soldiers were often seen operating AV-7 Antivehicle Cannons, the cannon of AT-TEs, and the heavy repeating blaster of Juggernaut tanks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "These clones were born and bred on the planet Kamino which was considered their \"homeworld\" and swore their allegiance to the Galactic Republic. Clone gunners served in many campaigns for the Republic such as the Battle of Christophsis, the Battle of Teth, the Battle of Bothawui, the Battle of Ryloth, the First Battle of Felucia, the Battle of Devaron, the Second Battle of Geonosis, and the Battle of Saleucami, among others."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}