{"url": "Clone_stormtrooper", "categories": ["Category:Legends articles", "Category:Clone stormtroopers", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Clone stormtrooper"}, {"tag": "p", "text": "Clone stormtroopers were the original elite soldiers of the Galactic Empire. After the fall of the Galactic Republic and the formation of Emperor Palpatine's New Order, the Republic Grand Army's clone troopers were re-designated as stormtroopers. Throughout the early years of Palpatine's reign, the Empire continued to utilize the Jango Fett template, but later commissioned the creation of new troopers from different genetic sources. Cloning remained essential to the Imperial Military, although the introduction of birth-born recruits into the ranks of the Stormtrooper Corps gradually reduced clone soldiers to a minority status."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "From clone troopers to stormtroopers"}, {"tag": "p", "text": "As the Clone Wars entered their final stage, the clone shock troopers of the Coruscant Guard earned the nickname \"stormtroopers\" in their capacity as military enforcers of martial law on the Republic capital. Their presence on Coruscant was a visible symbol of the planet's new security measures, enacted by Supreme Chancellor Palpatine in order to transform the ecumenopolis into a virtual fortress world."}, {"tag": "p", "text": "The term \"stormtrooper\" was officially adopted by all clone troopers in 19 BBY following Emperor Palpatine's reorganization of the Old Republic into the first Galactic Empire. The newly formed Stormtrooper Corps served as the Emperor's elite military wing throughout the era of the New Order, using clones of the same template that produced the original clone army of the Republic. For a time, the Empire maintained the same army that enabled Palpatine—the public persona of the Sith Lord Darth Sidious—to gain absolute power of the galactic government. Though the majority of clone soldiers were still produced in the cloning facilities of Kamino, the Empire also retained the services of Arkanian Microtechnologies, a corporation that used Spaarti technology to grow adult clones in a full year's time."}, {"tag": "p", "text": "During the galaxy's transition from democracy to despotism, the stormtroopers retained the Phase II battle armor they customized with unit colors and markings during the Clone Wars. But the alterations that the New Order introduced soon affected the Empire's shock troopers, particularly their armor and weapons. Prior to the creation of stormtrooper armor, the Empire brought an end to the Republic tradition of unit markings and armor customization. Stormtroopers restored their clone armor to a blank white condition, thus emphasizing the Empire's preference for uniformity and obedience in contrast to individuality and creativity."}, {"tag": "h3", "text": "GeNode program"}, {"tag": "p", "text": "A modified version of the Arkanian cloning process was developed during the early years of the New Order, enabling the Empire to initiate the GeNode Program that created clone lines of soldiers that were noted for efficiency and obedience. But unlike the clones that were created through Kaminoan and Arkanian techniques, GeNode clones were conditioned to believe that they were real Human beings, a falsehood reinforced by artificial memories and full names. As a result of their programming, they could not comprehend the fact that they were clones, nor were they able to discuss cloning with other GeNode clones."}, {"tag": "p", "text": "GeNode clone lines were maintained in clandestine facilities located in the Empire's Outer Rim territories. The program used at least four genotypes, although GeNode subjects were conditioned with the inability to recognize fellow clones of the same template. A unit of GeNode stormtroopers participated in an Imperial invasion of Kashyyyk, the Wookiee homeworld, where they served under the command of the Emperor's apprentice, the Sith Lord Darth Vader."}, {"tag": "p", "text": "The GeNode program ultimately fell out of favor due to cases of psychological instability in its clone subjects. Despite all efforts to prevent the clones from discovering their true origins, some GeNodes overcame their programming and were horrified to find themselves surrounded by identical soldiers, leading to several occasions where defective troopers killed their fellow clones in rage and terror."}, {"tag": "h3", "text": "Cases of clone uprisings"}, {"tag": "p", "text": "In the months that followed Palpatine's rise to absolute power, Darth Vader contracted Arkanian Microtechnologies with the task of creating six prototype clones from a Force-sensitive template—the Dark Jedi Sa Cuis, one of the Emperor's Hands. Though outfitted with the standard armor of all stormtroopers, the Cuis clones were armed with red-bladed lightsabers, mirroring the weapons of their Sith creators. Vader occasionally tested the clones' combat skills in practice duels, but their training was personally overseen by Sheyvan, another Hand who instructed the clones in basic Force techniques and lightsaber combat."}, {"tag": "p", "text": "Vader and his Master regarded Sa Cuis's progeny as a complete success and quickly placed an order with the Arkanians for a battalion of Force-sensitive stormtroopers. Sheyvan undermined their plans for the Cuis clones, however. Dismayed to learn that he was merely one of many personal assassins employed by Palpatine, the once-loyal Hand co-opted the loyalty of Cuis's clones and used them in an attempt to overthrow the Emperor. Their efforts to kill Palpatine were thwarted by Vader, who killed the rogue Hand and the six prototype clones with the aid of ordinary clones from the Lekauf template."}, {"tag": "p", "text": "Aside from a few outside sources, the vast majority of stormtroopers were Fett clones, engineered through Kaminoan and Arkanian processes. Their dominance of the stormtrooper ranks, however, began to erode by 12 BBY after a failed rebellion on Kamino exposed a secret army of clones that had been engineered to fight against the Galactic Empire. Though the rogue clones were annihilated and the uprising neutralized, the incident convinced Palpatine that the Empire could no longer depend on an army of clone stormtroopers from the same genotype. New clone lines were established soon after the Kaminoan rebels' defeat, leading to the production of soldiers from various non-Fett templates. With the exception of the 501st Legion, the new stormtroopers quickly grew to outnumber the Fett clones throughout the entire military."}, {"tag": "p", "text": "In addition to two failed clone rebellions of Kamino in the Empire's history, a third conspiracy against the Emperor's rule was discreetly carried out by Grand Moff Trachta and a clique of ambitious Imperial officers who discreetly engineered a small army of clone stormtroopers. Programmed to be obedient to the conspirators, the rogue clones spared no sense of loyalty to the Sith regime. The first phase of the plot was initiated while Darth Vader was away from Coruscant. The second part involved detonating a bomb on the Emperor's Lambda-class T-4a shuttle. Although Palpatine was unharmed due to his Force-based sense of precognition, many of his personal stormtroopers and Royal Guards were killed in the explosion. Trachta offered to deploy his own clone soldiers to the Imperial Palace for the Emperor's protection, intending to trap and kill his isolated sovereign."}, {"tag": "p", "text": "But the conspiracy was foiled by internal strife; Trachta had been betrayed and killed by his fellow subversives, shortly before they marched into the Emperor's throne room with the rogue clones. The attack was over almost as quickly as it had begun. Anticipating the officers' intentions, Palpatine ordered several Red Guards to ambush the conspirators. After a brief skirmish between his bodyguards and the treacherous stormtroopers, Palpatine unleashed a wave of Force lightning to kill his would-be assassins."}, {"tag": "h3", "text": "The decline"}, {"tag": "p", "text": "To maintain the Galactic Empire's monopoly on the cloning industry, the New Order banned the creation of more clone soldiers while also keeping its existing cloning operations in full production. The locations of all cloning facilities throughout the Empire were classified and placed under military jurisdiction for security purposes. However, the significance of clone soldiers steadily declined over the course of several years with the introduction of enlisted stormtroopers."}, {"tag": "p", "text": "Although Emperor Palpatine and Darth Vader both favored clones as soldiers, the Empire began to gradually supplement its clone units with birth-born recruits due to the strain that cloning had on the Imperial economy and armed forces. The Kaminoan process created an army that had been hailed during the Clone Wars as the greatest fighting force in galactic history, but their clones were an expensive drain on financial resources and took a decade to mature. Arkanian technology was meant to compensate for the long growth process of Kaminoan clones, but their products were well below the efficiency rate that had been credited to the Republic's clone army. Given the drawbacks of the military's dependence on cloning, the Empire had no shortage of Humans that could be recruited to serve as stormtroopers. The number of enlisted troopers increased exponentially throughout the decade before the Battle of Yavin, culminating in their rise as the dominant majority in the ranks while clones became a rarity in the once all-clone Stormtrooper Corps by 1 BBY."}, {"tag": "h3", "text": "Thrawn's clone army"}, {"tag": "p", "text": "The deaths of Emperor Palpatine and Darth Vader in 4 ABY left the Galactic Empire in a state of utter chaos and disorder following the Rebel Alliance's victory at the Battle of Endor. Without a clear line of succession, the central government on Coruscant failed to prevent the Stormtrooper Corps from becoming fragmented into smaller units under the control of various warlords who squabbled over leadership of the Empire. By 9 ABY, five years after the Imperials' defeat on Endor, Grand Admiral Thrawn launched a campaign to reunite the fractured Empire under his own leadership by destroying the Rebels—now reconstituted as the New Republic."}, {"tag": "p", "text": "In order to realize his dream of a resurgent Empire, Thrawn replenished the Stormtrooper Corps with a new army of clone soldiers engineered via several Spaarti cylinders. The clones were bred from a variety of templates, including General Maximilian Veers, Baron Soontir Fel, Corporal Terkuss of the Imperial Army and Lieutenant Creb of the Imperial Navy. In addition, the stormtrooper clones were cut off from the Force via the use of Ysalamiri, resulting in the production of clones in a matter of weeks, putting them at an advantage. The creation of clone stormtroopers rejuvenated the Empire's depleted manpower, but the Imperial counteroffensive against the Republic was short-lived due to the assassination of Thrawn by his own Noghri bodyguards."}, {"tag": "h3", "text": "Post-Galactic Civil War"}, {"tag": "p", "text": "After the Galactic Civil War ended in 19 ABY with the decisive victory of the New Republic, the Stormtrooper Corps survived the dissolution of Palpatine's New Order, but as a remnant of its former glory. Stormtroopers still existed throughout the decades after the Battle of Endor. However, the Empire of the Hand, the Imperial Remnant and various other successor states of the original Empire became heavily reliant on the recruitment of enlisted troopers. Under Palpatine's reign, stormtrooper recruits and clones were exclusively Human. The reforms introduced by the Hand and Remnant governments allowed Non-Humans to join the Stormtrooper Corps. By 130 ABY, clone stormtroopers were virtually unheard of as the military became heavily diverse in a sea of enlisted troopers from a variety of different backgrounds."}, {"tag": "h2", "text": "Notable clone stormtroopers"}, {"tag": "h2", "text": "Prime clones"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}