{"url": "A_Race_to_the_Finish", "categories": ["Category:Real-world articles", "Category:Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"], "nodes": [{"tag": "h1", "text": "A Race to the Finish"}, {"tag": "p", "text": "\"A Race to the Finish\" is the fourth episode of Star Wars: Droids: The Adventures of R2-D2 and C-3PO. Written by Peter Sauder and Steven Wright and directed by Ken Stephenson, the episode originally aired on ABC on September 28, 1985."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "C-3PO, R2-D2, Thall Joben, Kea Moll and Jord Dusat are on their way to the Boonta Speeder Race in the Sand Sloth—with the White Witch attached to the hull. While Artoo and Threepio are securing the speeder for lightspeed, a broken down Lambda-class shuttle attacks out of nowhere. Commanding the shuttle is none other than Sise Fromm, the disgraced crime boss seeking revenge for the racers' capture and destruction of his Trigon One super weapon. Manning the controls are Tig Fromm and Vlix Oncard, the only two henchmen Sise has left. Kea manages to jump to hyperspace just in the nick of time, but one of the engines gets hit badly and Jord hurts his left arm."}, {"tag": "p", "text": "After coming out of hyperspace and making their descent to the planet Boonta, the Starrunner crash-lands in the Boonta scrapyard. There, the group meet the old Proto Droid Proto One, to whom C-3PO takes an immediate dislike. Proto still offers Kea to fix her broken ship while they take Jord to a medical unit. Meanwhile, Sise Fromm has hired Boba Fett to help him with his manhunt. Despite the fact that Jabba the Hutt has placed a price on Fromm's head, Fett decides to help the old gang leader because of a debt he owes him."}, {"tag": "p", "text": "Boba orders his droid BL-17 to befriend C-3PO and offer accommodations to fix the White Witch in time for the race. Artoo proposes to hire Proto One to fix the speeder, but Threepio will hear none of it. BL-17 soon betrays the team, locking Kea and Artoo in the garage with a gas leak. However, Proto One and R2-D2 manage to disable BL-17 just in time for C-3PO to realize that he has put his trust in the wrong droid. Boba Fett then arrives and tries to destroy the heroes. Tig Fromm, trying to get to the racers before Fett, manages to plant a Thermal detonator on the Witch."}, {"tag": "p", "text": "When the day of the Boonta Race arrives, Jord cannot compete because of the injury to his left arm, so Thall has to pilot the Witch. Boba Fett also competes, piloting his Silver Speeder as a late entry. Boba uses various weapons against Thall, but is knocked out of the race when the thermal detonator gets detached from the Witch's hull. Having lost the race, his speeder, his droid and nearly his life, Boba Fett decides that his debt to Sise Fromm is paid, and turns him over to Jabba the Hutt."}, {"tag": "p", "text": "After winning the race, the team is contacted by the Zebulon Dak Speeder Corporation and offered a position designing and building speeders for them. Taking the job would require C-3PO and R2-D2 to be reprogrammed, which Thall, Jord and Kea object to. Upon hearing this, R2-D2 and C-3PO decide that it is time to part ways with their friends, because it will enable the humans to take the job, and allow the droids to keep their memories intact for the time being. The droids enter an escape pod, and eject it into space."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This episode was adapted into the children's storybook of the same name."}, {"tag": "p", "text": "In this episode, C-3PO claims that another droid graduated from the same \"production facility\" as he had. This may be a continuity issue, as in Star Wars: Episode I The Phantom Menace it is revealed that C-3PO was built by Anakin Skywalker, although this contradiction could be explained by the fact that his memory was set to be erased at the end of Star Wars: Episode III Revenge of the Sith."}, {"tag": "p", "text": "The video game Star Wars: Racer Revenge features similar racing tunnels to those found in \"A Race to the Finish\"."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}