{"url": "Clone_trooper_captain", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Clone trooper captains", "Category:Clone trooper variants", "Category:Grand Army of the Republic ranks"], "nodes": [{"tag": "h1", "text": "Clone trooper captain"}, {"tag": "p", "text": "During the Clone Wars, the clone trooper captain was a specialized clone trooper breed which was bred on Kamino as battlefield officers and special mission operatives."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "At the start of the war, clone trooper captains were recognized by their unique red markings on their helmets and torso armor, but as the war progressed, clone trooper armor became more customized and red marking no longer signified the rank of captain. Clone trooper captains were assigned to lead companies of 144 standard clone troopers which were divided into four separate platoons. Each platoon was commanded by a Clone trooper lieutenant that would report directly to their respective captains. These clones were often equipped with a DC-15A blaster rifle and a line of thermal detonators, although as the war progressed a number of clone captains would use specialized weaponry which suited their respective combat styles. Trained in both squad and company-level tactics, as well as to handle the 74-Z speeder bike, clone trooper captains were diverse leaders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They first appeared during the First Battle of Geonosis. The officers commanded at Forward Command Centers and position of great visual range. A handful of captains used speeder bikes to destroy the huge and clumsy Confederacy OG-9 homing spider droids, throwing pulse grenades as they raced across the battlefield. Also, a branch of jet trooper captains participated in many prominent battles, such as Mace Windu's defense of Dantooine. A notable clone captain was Rex who fought in the front lines with the grit of an Advanced Recon Commando. He participated in many campaigns throughout the war and was initially the senior clone officer of the elite 501st Legion until clone trooper sergeant Appo was promoted and became a clone trooper commander, taking over Rex's duties as Legion's commanding officer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}