{"url": "Clone_trooper", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Clone trooper"}, {"tag": "p", "text": "Clone troopers, also known as Republic troopers, Republic troops, Republic soldiers, and nicknamed the \"Boys in White,\" were highly trained soldiers in the Grand Army of the Republic. Representing the future of galactic warfare, clones were designed to be far superior to battle droids. During the last years of the Galactic Republic, clones formed the backbone of the Republic Military that waged war against the droid armies of the Confederacy of Independent Systems. The Clone Wars was named after the Republic's clone army, which became symbolic of the conflict that had spread throughout the galaxy after a millennium of peace."}, {"tag": "p", "text": "Clone troopers were grown on the planet Kamino at the request of Jedi Master Sifo-Dyas, who commissioned the Kaminoans to build an army for the Republic, although some clones were secretly grown on Coruscant and became the shock troopers in the Coruscant Guard. After Sifo Dyas' death, the project was taken over by the Sith. Clones were modeled on a human template, the bounty hunter Jango Fett, although their genetic structure was modified to make them less independent and more docile than their progenitor. They were also designed to age at twice the rate of natural humans, accelerating their growth and making them ready for combat in a decade's time. As the Separatist Crisis gave way to open war, the Galactic Senate empowered Supreme Chancellor Sheev Palpatine to call the clone troopers into action, leading to their debut on the battlefield of Geonosis. For three years, clones fought the Separatist droids on all fronts across the galaxy. They were loyal to their Jedi Generals and the Supreme Chancellor; though some clones questioned their service, leading to isolated cases of desertion and treason, most were proud to serve the Republic as it was the only life they had ever known."}, {"tag": "p", "text": "Galactic history was forever changed by a hidden behavioral modification biochip implanted in every clone, which was part of the Sith's plot to destroy the Jedi. Chancellor Palpatine, discovered by the Jedi to be the Sith Lord Darth Sidious, as well as the reason behind the Clone Wars, branded the Jedi as the enemies of the state and issued Order 66, with the latter being a calling for the annihilation of the Jedi Order. All across the galaxy, the clones turned against their generals, slaughtering them and storming the Jedi Temple on Coruscant under the stewardship of the Sith Lord Darth Vader. Sidious subsequently assumed absolute power as the self-proclaimed Emperor of the Galactic Empire. Clones initially served as Imperial stormtroopers in the New Order, but were soon replaced by human recruits and conscripts. Their armor, weapons, and training inspired generations of white-armored warriors, especially the First Order stormtroopers who were also trained from early childhood to become super-soldiers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "Years before the Invasion of Naboo, Jedi Master Sifo-Dyas came to believe that the galaxy would soon become engulfed by war. He therefore advocated for the creation of an army to ensure the defense of the Galactic Republic, but his views were ultimately rejected by his peers and he was cast out of the Jedi High Council. Undeterred by the lack of support from the other Jedi, Sifo-Dyas secretly contacted the Kaminoans—a species of experts in cloning, native to the planet Kamino—and commissioned them to create an army of clone soldiers for the Republic without authorization from either High Council or the Galactic Senate."}, {"tag": "p", "text": "Shortly afterward, Sifo-Dyas was killed by the Pyke Syndicate at the behest of the Sith, resulting in the Sith's takeover of the clone trooper project. Darth Tyranus, the apprentice of the Sith Lord Darth Sidious, recruited the Mandalorian bounty hunter Jango Fett to become the genetic template of the clone army. Various modifications were made to the Fett genome so that the clones would grow faster and be more susceptible to following orders. Hyper-aggressive and volatile tendencies were tailored; the Kaminoans resorted to growth acceleration in order to create mature clones in half the time a human took to reach maturity. Fett's genetic structure was further modified to make the clones less independent and more docile than their template. However, the clones were also designed to be capable of creative thinking, making them far superior to battle droids according to Prime Minister Lama Su. Some clones were secretly bred and raised on Coruscant and became the shock troopers in the Coruscant Guard. Fett became a near-mythologized figure to his clones, who regarded him as their father figure. Despite this, Fett did not feel a sense of pride in his clones, and rather saw them as \"livestock\" made to be \"cannon fodder.\" As such, he considered them to be the Kaminoans' creations instead of his."}, {"tag": "p", "text": "Fett was paid a considerable amount of credits for allowing the Kaminoans to use his genetic material as the clone army's template; his only other demand was the creation of an unaltered clone of himself, which the Kaminoans found unusual but nevertheless obliged. Whereas the clone army was genetically modified for growth acceleration and enhanced docility, Alpha was an example of \"pure genetic replication\" and therefore possessed \"pure, first generation Fett DNA.\" The only other clone like Alpha was an adolescent female known as Omega. Fett took Alpha to raise as his son, renaming the clone \"Boba Fett.\" Omega remained in the custody of the Kaminoans and was serving as an aide of the Chief Medical Scientist Doctor Nala Se by the end of the Clone Wars. Like the rest of the Fett clones, they were regarded as Kaminoan property by Lama Su."}, {"tag": "p", "text": "Although the Kaminoans believed that the army was meant to serve the Republic, the Sith intended to use the clone troopers as their secret weapon against the Jedi Order. The clone army's true purpose was to exterminate the Jedi, and to that end an organic inhibitor chip was implanted into the brain of every clone trooper at the third stage of their development, of which at least one failed in clone trooper Tup, causing him to kill a Jedi beforehand. Officially, the chips were supposed to make the clones less aggressive and independent than Jango Fett. The significance of the inhibitor chip was supported by the assertion that a clone would become mentally unstable and dangerous to everyone around him if his chip was damaged or surgically removed. The chips were, in fact, created to compel the clone troopers to execute Order 66—a secret protocol that authorized the destruction of the Jedi Order."}, {"tag": "p", "text": "Each clone trooper had an identifying code inserted in his left wrist. During the Clone Wars, the codes were linked to the file of every individual trooper in the Republic's military database. The files, which could be accessed by an astromech droid via the scanning of a clone's identifying code, contained the clones' designation, rank and overall service record, as well as any specialized training and the units that he was affiliated with. Most clones also shared their template's dark-brown eyes, black hair, and olive skin. While there were some genetic variations, most of these clones would ultimately remain confined to Kamino, being embarrassments or case studies. Only five clone anomalies remained by the end of the war, including Nala Se's assistant Omega. The other four clones formed the original lineup of Clone Force 99. \"Hunter,\" \"Tech,\" Wrecker,\" and CT-9904 \"Crosshair\" were genetically enhanced clones who possessed unique combat skills, setting them apart from the standard \"reg\" clone troopers as well as each other."}, {"tag": "p", "text": "The term \"generation one\" designated the first group of clones who were created from the Jango Fett genotype, including Clone Captain CT-7567 \"Rex\" of the 501st Legion and Clone Sergeant \"Slick.\" The first two-hundred thousand units were ready a decade after Sifo-Dyas commissioned the creation of the clone army. In addition to the first units, a million clones were being developed in the facilities spread across Kamino at the time of Jedi Knight Obi-Wan Kenobi's arrival. Kenobi discovered the clone project on Kamino and duly informed the Jedi High Council. By then, the galaxy was on the verge of a civil war between the Republic and a secessionist movement that ultimately formed the Confederacy of Independent Systems. Since the Jedi lacked sufficient manpower to guard the entire Republic, the Senate resolved to grant emergency powers to the executive branch. As a result, the clone troopers were formally organized into the Grand Army of the Republic by Supreme Chancellor Sheev Palpatine—the elected leader of the Senate and public persona of Darth Sidious, Dark Lord of the Sith. With war imminent, Grand Master Yoda traveled to Kamino to personally inspect the clone army while Jedi Master Mace Windu led the vanguard against the Separatists on Geonosis."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Soldiers of the Republic"}, {"tag": "p", "text": "Clone troopers were deployed into battle for the first time on the planet Geonosis, where twelve Acclamator-class assault ships supplied by Kamino were loaded with two battle armies, or 192,000 troops. Under the leadership of the Jedi, the Grand Army of the Republic forced the Separatist Droid Army into full retreat and consequently won the first battle of the Clone Wars. In the wake of the Republic victory on Geonosis, Count Dooku—the alter ego of Darth Tyranus—rallied a growing number of dissenting worlds to the Separatist cause, further dividing the Republic and forcing the clone troopers to fight the war on all fronts across the galaxy."}, {"tag": "p", "text": "Throughout the conflict, clone troopers continuously demonstrated extreme loyalty to the Galactic Republic, especially their Jedi Generals and the Supreme Chancellor. Clones were expected by their brethren to be obedient to the chain of command, believing that their compliance reflected their commitment to the Republic. The Advanced Recon Commando CT-5555 \"Fives\" supported the system, and was driven by his sense of duty as a loyal soldier of the Republic."}, {"tag": "p", "text": "Fives also believed that clone troopers were not disposable \"numbers\" and as such he opposed complying with orders that he considered to be wrong, though Captain Rex maintained that a soldier should obey his commanding officer if he supported the system that they fought for. However, by the end of the bloody Umbara Campaign, Rex agreed with Fives, feeling that clones sometimes needed to disobey their orders in order to do what was right. While the clones were conditioned to be absolutely obedient, every clone developed his own unique identity. Insufficient or rushed field care led some clone veterans to have deep, physical scars. These soldiers wore their scars with pride, and some refused rehabilitative treatment to remove them."}, {"tag": "p", "text": "The distinction between each clone ranged from loyal units, such as Clone Commander CC-2224 \"Cody\" and Captain Rex, to a minority of clones who proved to be disloyal or uncommitted to the Republic's cause, such as Sergeant Slick. Regarding service as slavery, Slick betrayed the Republic by accepting bribes from the Separatists and was therefore arrested as a traitor by the Grand Army. Another clone trooper displayed aberrant behavior by deserting the Grand Army and becoming a farmer under the name \"Cut Lawquane.\" For the most part, however, the clones found pride in their purpose as soldiers, and many continued to sacrifice their lives for the Republic as the war wore on."}, {"tag": "p", "text": "Many of the clones that remained loyal throughout their service looked down on their brothers that had deserted, thinking them to be cowards. However, there were clones that were able to redeem themselves and willingly re-enter the ranks alongside their brothers. When a squad of deserters were given the opportunity to leave the army after completing one last mission together, the group came together and decided to remain in the army with their brothers."}, {"tag": "p", "text": "In addition to fighting alongside the Jedi and each other, the clone troopers viewed each other as brothers. While admirable, this quality could keep them from seeing the bigger picture and make them willfully ignorant of the Republic's politics, but such a feeling also made the clones family to each other, with troopers even using the word when talking to a fellow clone they had never met before. Troopers also tended to see their barracks or starships as places of work. In addition, the clones viewed Kamino as their homeworld. During the Battle of Kamino, the clones fought bravely to prevent the Separatists from destroying the clone hatcheries as well as the remaining supply of their donor's genetic material. Their efforts resulted in a Republic victory, ensuring the continued production of clone troopers for the duration of the Clone Wars."}, {"tag": "p", "text": "As the Clone Wars dragged on, the stress of combat and high casualties caused cracks and strains among the ranks of the clone soldiers. Personality quirks, once considered harmless or even essential to their mental development, began to express themselves in extreme and polarizing ways. Each unit created their own rituals, small ways to identify squad mates, those from the same company, and veterans of specific campaigns. A soldier that talked about \"cracking that crystal\" identified themselves as a veteran of Christophsis and the assault on Crystal City, while an officer calling targets \"bugs\" revealed he fought in the hives on Geonosis. While many clones respected a soldier with a different background, some felt separated by time, space, and the unique aspects of their struggle."}, {"tag": "p", "text": "Though the vast majority of clones remained loyal to the Republic over the course of the three-year conflict, as time progressed a small number began to question their strict obedience. Naïve new clones found themselves fighting alongside veterans with years of combat experience that included the deaths of comrades, objectives gained and failed, and the often-ineffectual civilian Republic leadership. Consequently, some veterans developed a skepticism of Republic bureaucracy that shocked even the most cynical of rookie clones. Unlike most natural species where youth questioned their elders, it was the older clones of the Grand Army of the Republic who found themselves questioning their values and traditions. These clones still found comfort in the company of their brothers, but life no longer seemed as cut and dried to them."}, {"tag": "p", "text": "Many clones realized that they were not in high regard among the Republic and were treated as expendable soldiers who did not have personal feelings. This would help clones grow closer to each other and those who went against this convention, notably Jedi Generals Plo Koon and Obi-Wan Kenobi. Although a rift existed between clones and Jedi, which was widened in the aftermath of General Pong Krell's massacre of clone troopers during the Umbara Campaign, clones remained very loyal and formed friendships with their Jedi officers, especially those that demonstrated loyalty back to them. Among the Jedi who were highly respected was Padawan Ahsoka Tano, who believed all clones sounded different despite their genetic sameness; Yoda told her that was because she took the time needed to actually listen to them. Yoda also saw the clones as individuals, seeing that every trooper was different in the Force."}, {"tag": "h4", "text": "Public image"}, {"tag": "p", "text": "Throughout the Clone Wars, clone troopers featured prominently in propaganda sponsored by both the Republic and Separatist media. Through the Commission for the Protection of the Republic, a populist organization commonly known as COMPOR, clones were portrayed as the public face of the Republic's war effort, resulting in the publication of patriotic artwork such as Unite and Support the Boys in White. The posters expressed patriotism and civic duty to the citizens of the Republic. Part of a large outreach campaign, clone troopers became the symbol of the war effort, largely replacing the Jedi of previous years. Projecting strength and unity, they reminded citizens that their sacrifices were funding peace through military might."}, {"tag": "p", "text": "Such messages were intended to ingrain the image of the clone trooper as brave soldiers risking all for freedom, democracy and the Republic. Although COMPOR also wanted to use the Jedi Order as a tool for propaganda, Chancellor Palpatine advised against this course of action, citing sympathy for the Jedi's reluctant acceptance of their new role during wartime. As a result, very few examples of pro-Jedi messages exist as COMPOR devoted their full attention to promoting support for the clone troopers as well as loyalty to the Republic and, in particular, Chancellor Palpatine."}, {"tag": "p", "text": "By contrast, the Confederacy of Independent Systems decried the clone army as a biological abomination—an inhumane practice in which weaponized embryos were carried to artificial term and turned into disposable killing machines. The Separatist cause was, therefore, portrayed as the more \"humane\" approach due to the Confederacy's use of battle droids.  In some way, this dehumanizing sentiment was shared in the Republic. Under Republic law, clone troopers were property of the Galactic Republic. However, Nala Se took the position that the clones were Kaminoan property, as they had been created in the laboratories of Kamino. Senator Christo of the Galactic Senate considered the clones disposable, supported increasing the cloning production, and rationalized their deaths as the fulfillment of their purpose."}, {"tag": "p", "text": "Galactic citizens could also be unaware of the friendships that could grow between clones and Jedi; farmer Kaeden Larte believed clones only followed Jedi like Ahsoka Tano because they were superior officers, unware of how Jedi like Tano had truly earned the troopers' respect. As the war carried on, more Republic citizens became disillusioned with the seemingly endless conflict, allowing Separatist and antiwar propaganda to take root in the Republic's territory. Widespread discontent began to erode the clones' public image despite COMPOR's efforts; even their civilian-coined nickname \"Boys in White\" backfired as antiwar activists pointed to the fact that the clones were barely thirteen years old by the third year of the Clone Wars."}, {"tag": "h3", "text": "Order 66"}, {"tag": "h4", "text": "Sith conspiracy"}, {"tag": "p", "text": "Near the end of the war, Order 66 was nearly discovered by the Jedi. CT-5385 \"Tup\" was a clone trooper in the 501st Legion who became mentally unstable when his inhibitor chip malfunctioned during the Battle of Ringo Vinda, causing him to kill Jedi General Tiplar. This premature execution of Order 66 resulted in an investigation by the Republic, the Jedi, and the Kaminoans. The Sith also took an interest in the matter; Count Dooku—whom Lama Su and Nala Se knew only as \"Tyranus,\" their secret benefactor—instructed the Kaminoans to prevent the Jedi from discovering the true purpose of the inhibitor chips. Tyranus was also disturbed by the degree of individuality that the clones displayed in spite of their psychological conditioning; Nala Se believed that the Jedi were responsible for encouraging greater creative thinking in the clones. Nevertheless, she was certain that, with the exception of Tup's damaged chip, the rest of the chips would function according to their design."}, {"tag": "p", "text": "During the investigation, the ARC trooper \"Fives\" became increasingly convinced that the inhibitor chip was part of a conspiracy against the Republic and the Jedi. Against Nala Se's advice, he was allowed to plead his case to Chancellor Palpatine. However, their meeting led the ARC trooper to believe that the Chancellor was involved in the conspiracy, although he was unaware of to what extent. Jedi Master Shaak Ti witnessed Fives' attempt to assassinate the Chancellor and prevented him from succeeding. Although Fives escaped from the Grand Republic Medical Facility, he was confronted by a group of Coruscant shock troopers led by Clone Commander CC-1010 \"Fox\" while attempting to warn Jedi General Anakin Skywalker and Captain Rex. After Fives was killed by Fox, Palpatine convinced the Jedi that a rare parasite from Ringo Vinda was responsible for the malfunction in Tup and Fives, and that the clone troopers had to be inoculated to prevent their inhibitor chips from malfunctioning."}, {"tag": "p", "text": "Shortly before dying, Tup and Fives—both of whom had their chips removed—described Order 66 as a mission that they repeatedly experienced in their nightmares. With their deaths and the removal of any evidence that could alert the Jedi to the existence of Order 66, the Chancellor convinced the Jedi Council that the clone troopers did require their inhibitor chips. Still, Rex, who had held Fives as he died, submitted a grievance report, where he stated the inhibitor chips could have an alternate purpose. While he was not sure if he believed it and knew the report would be ignored, Rex believed he owed it to Fives to record what he had learned."}, {"tag": "p", "text": "The death of Fives did not completely ensure the secrecy of Order 66, however. The Jedi Council began inquiring into the specific circumstances regarding the mysterious death of Sifo-Dyas, the founder of the clone army. Alarmed by the Jedi's interest in the matter, Darth Sidious tasked his apprentice with the responsibility of eliminating any remaining loose ends that could connect the Sith with the creation of the clones. Darth Tyranus journeyed to the planet Oba Diah and killed Minister Lom Pyke of the Pyke Syndicate, but not before the Pyke revealed to the Jedi that Tyranus and Dooku were one and the same."}, {"tag": "p", "text": "The Jedi Council was disturbed by the revelation of the Sith Order's involvement in the creation of the clones. Yet in spite of their suspicions regarding the reasons the Sith would provide the Jedi with an army, the Council ultimately chose to conceal their findings from the public and the government, fearing that such a discovery would undermine public confidence in the war. Grand Master Yoda insisted that their priority remained the same, to end the war as swiftly as possible before the Sith's plans came to fruition. Moreover, the Grand Master believed that the clones were genuinely loyal to their Jedi leaders, having saved them on numerous occasions throughout the war."}, {"tag": "h4", "text": "Fall of the Jedi"}, {"tag": "p", "text": "After three years of constant warfare, the Separatist forces attacked Coruscant, the Republic capital world, and managed to abduct Chancellor Palpatine in the process, a plan which was organized by Sidious in order to being Anakin to the dark side and make him his apprentice. The clone troopers rallied to Coruscant's defense while the Jedi Knights Obi-Wan Kenobi and Anakin Skywalker rescued the Chancellor. During the battle, Darth Tyranus was betrayed by Sidious, who swayed Anakin to killing him. With Dooku dead, this brought the Clone Wars closer to a successful conclusion for the Republic. The Jedi Council moved to capitalize on the momentum gained by Tyranus' death in the hope of ending the war."}, {"tag": "p", "text": "The Grand Army continued to fight the war on various worlds across the galaxy, including Mygeeto, Felucia, Cato Neimoidia, and Saleucami. New fronts were opened as clone troopers were deployed to Kashyyyk and Utapau; and other planets as part of the Outer Rim Sieges. CC-1004 \"Gree\" and the 41st Elite Corps fought side-by-side with the Wookiees in the Battle of Kashyyyk, under the command of Yoda, while Kenobi and Cody oversaw the Battle of Utapau between the 212th Attack Battalion and General Grievous's droid army. By this time, the 332nd Division had been formed out of Skywalker's 501st Legion in order to participate in the Siege of Mandalore. The new division was placed under the command of Rex, who was promoted to the rank of Clone Commander, while Skywalker's former Padawan, the Force-Sensitive Outcast Ahsoka Tano, accompanied the 332nd as an advisor."}, {"tag": "p", "text": "As the Republic drew closer to achieving total victory in the Clone Wars, Chancellor Palpatine revealed his true identity as Darth Sidious to the Jedi, provoking an immediate response from the Jedi Council. The consequent confrontation between the Council and the Dark Lord ended in the deaths of several Jedi Masters, including Mace Windu, and Anakin Skywalker's fall to the dark side of the Force. Now anointed as the Sith Lord Darth Vader, Sidious's new apprentice participated in the 501st Legion's assault on the Jedi Temple. Under the influence of Order 66, the 501st clone troopers stormed the Temple and exterminated the Jedi within. None of the Jedi were spared, including the younglings."}, {"tag": "p", "text": "Around the same time, Darth Sidious issued Order 66 to the clone troopers throughout the galaxy—declaring every Jedi an enemy of the Republic. Order 66 triggered the hidden chips within the clones, compelling them to comply without question or hesitation with the plan to annihilate the Jedi. The clones turned on their unsuspecting allies and slaughtered them across numerous worlds. With the exception of a few survivors, the Jedi were all but extinct in the aftermath of the initial execution of Order 66. In addition, this protocol did not end with members of the Jedi Order, as clone troopers who failed to comply with the order were to be killed as well."}, {"tag": "p", "text": "Aboard the Venator-class Star Destroyer Tribunal, Ahsoka Tano and the rogue Sith Lord Maul were also targeted by the clones of the 332nd Division shortly after their victory on Mandalore. Commander Rex managed to resist his chip's control for long enough to tell Tano to find Fives. When Rex finally fell victim to its control, Tano escaped the troopers and released Maul from captivity, intending to have him be a distraction. Tano then looked into Fives, finding Rex's grievance report on the chips. With the help of astromech droids R7-A7, CH-33P, and RG-G1, Tano incapacitated Rex in order to remove his chip."}, {"tag": "p", "text": "Freed from the influence of the control chip, Rex informed Tano that the entire Grand Army had turned against the Jedi. The former Jedi, the Clone Commander, and the astromech droids planned to steal a shuttle from the Venator's main hangar; Rex complied with Tano's wishes to only stun the clones in their path, despite knowing that his brethren fully intended to execute them as traitors to the state. Elsewhere, Maul continued to move through the warship, ultimately entering and destroying the hyperdrive room. This pulled the Star Destroyer out of hyperspace and into the gravitational field of a moon, but the 332nd remained determined to kill Tano, even if it would result in their own deaths. Even though the clone troopers blocked their path to a Nu-class transport shuttle, Tano did not want to harm the soldiers, but Rex, who shed a tear, informed her that the clones were willing to die executing Order 66."}, {"tag": "p", "text": "Tano was still unwilling to take their lives and devised a plan to stall the troops; while R7 prepared to drop parts of the floor, Rex distracted Clone Lieutenant CT-5597 \"Jesse,\" and the other clones by bringing Tano at gunpoint before them. He argued that while Order 66 called for the execution of all Jedi, Tano had not been a Jedi for some time. Jesse was not dissuaded from his task, however, stating to Rex that they were under direct orders from Darth Sidious to kill the former Jedi as well as any clone who refused to comply with their protocol. When Rex made a final plea to Jesse, the ARC Trooper accused his former friend as a traitor to the Republic, and subsequently demoted him in rank from Commander, and sentenced him to die alongside Tano via firing squad in accordance with Order 66."}, {"tag": "p", "text": "The clone troopers destroyed the astromechs in the ensuing firefight, which Maul used as a distraction to escape from the doomed Star Destroyer. Jesse and the remaining clones were killed when their warship crashed into the moon, while Tano and Rex escaped using a BTL-B Y-wing starfighter/bomber before the Tribunal entered the atmosphere. They recovered the clones' bodies and buried them at the crash site, using their helmets to mark each clone's grave. Tano then abandoned her lightsabers at the gravesite and eventually parted ways with Rex, both agreeing to leave for the Outer Rim Territories."}, {"tag": "h3", "text": "Imperial service"}, {"tag": "h4", "text": "Soldiers of the Empire"}, {"tag": "h5", "text": "The future of clone troopers"}, {"tag": "p", "text": "Without the Jedi Order, the galaxy fell under the power of the Sith once more. Sidious, having accumulated absolute political and military control over the Republic, was able to become the self-proclaimed Emperor of the First Galactic Empire. The Republic ceased to exist, henceforth, with the ideals of democracy and liberty replaced by the absolute rule of the Sith. This was followed by sweeping alterations that distinguished the New Order from the old system. The clone troopers who survived the Clone Wars went on to serve the Empire as the the first generation of Imperial stormtroopers. The clones were considered the Empire's elite shock troops, and therefore responsible for enforcing the Emperor's will and destroying his enemies during the early days of the Imperial Era. Without the Jedi who encouraged their soldiers to think as individuals instead of only adhering to protocol, the clone troopers became fully obedient as a result of their programming."}, {"tag": "p", "text": "Nevertheless, the value of all clone troopers was called into question by the newly risen Galactic Empire. Admiral Wilhuff Tarkin visited Kamino to inspect the clones and determine whether the Empire had any further use of them. As leader of the Kaminoan government, Lama Su opposed the shutdown of the cloning facilities; his world's contracts with the Galactic Republic stipulated the continued production of clone troopers after the end of the Clone Wars. However, Tarkin countered that Kamino's contracts were with the Empire's predecessor and therefore voided after the Republic ceased to exist. Lama Su argued that the new Empire's situation was precarious and that future clones were needed to enforce order across the galaxy."}, {"tag": "p", "text": "While Tarkin agreed that the Empire needed a large military, he deemed the clone army too expensive to maintain. As such, he believed that service conscription was a more cost effective alternative to cloning. Despite Tarkin's argument that conscripted soldiers cost half the price of clone troopers, Lama Su dismissed the idea, believing that recruits were inferior to the clones produced on Kamino. Although cloning operations would continue for a short while longer, rumors spread across the clone ranks during the early Imperial Era that the Empire had already halted the Kamino operations, making clones such as \"Ding\" and \"Kicker\" ponder the Empire's future and the fate of their kind. Knowing that the clone army had only one generation left in its future, older clones dreaded the notion of retirement and, therefore, sought ways to remain on active duty, such as joining the Emperor's Royal Guard."}, {"tag": "p", "text": "With clones dispatched to secure Jedi sites, Ding and Kicker were part of the clone force sent to a Mid Rim way station named the Brighthome, which the former trooper feared represented the overall future of their kind; while new soldiers would be able to fight the enemies of the Empire, he feared the clones would be reduced to clean up operations. Nevertheless, the two thought they had a chance to prove themselves when an individual believed to be a surviving Jedi attacked the station. In reality, the intruder was Darth Vader, who had elected to not send out his clearance codes to fight the clones aboard. Vader slaughtered the majority of the troops who came against him, and, although Ding and Kicker briefly gained an advantage over the Sith Lord, Vader killed both with a Force choke, allowing him to leave for the moon of Al'doleem."}, {"tag": "h5", "text": "End of the clone trooper program"}, {"tag": "p", "text": "Despite Lama Su's continued insistence that clone troopers were superior to recruited soldiers, possessing superior skills as a result of their training, Tarkin still considered the Kaminoan cloning operation a costly endeavor. The admiral's colleague, Vice Admiral Rampart, also advocated the creation of a volunteer force. But while Tarkin looked on conscription as a cost-effective solution, Rampart sought to have recruits supplement the Clone War veterans. Additionally, the Vice Admiral saw the potential for loyalty in the recruits who willingly enlisted in the Empire's military. Tarkin sactioned the formation of a team of Elite Squad Troopers; four non-clone volunteers recruited from across the galaxy, they were placed under the command of CT-9904, the only member of Clone Force 99 who remained loyal to the Empire as a result of his programming. Rampart believed that CT-9904's Elite Squad could be trained to be just as effective as the clone troopers who served the Republic throughout the Clone Wars, and their first mission as a unit was their opportunity to prove this to Tarkin."}, {"tag": "p", "text": "The Elite Squad returned to Kamino after killing a group of insurgents and civilians on Onderon. Despite the death of ES-01, who was executed for refusing to comply with the clone's order to kill unarmed prisoners, Tarkin considered the mission a success not only for the Empire, but Project War-Mantle as well. The Imperial officers' determination to replace clones with conscripted soldiers caused Lama Su to fear for the future of Kamino and its cloning facilities. Their situation was compounded by the degradation of the last genetic samples of Jango Fett; therefore, Lama Su instructed Nala Se to continue her experiments in the hope of yielding a superior clone. He believed that the Kaminoans' relationship with the Empire hinged on the fate of the clone trooper program."}, {"tag": "h5", "text": "Continued Imperial service"}, {"tag": "p", "text": "Despite the clones' role in the formation and enforcement of the early Empire, the clone trooper production line was halted. At that early time, though, Imperial service clones still made up the backbone of the Imperial Army, and some units were elevated to the ranks of the Emperor's bodyguards. In order to maintain order, the clones were given orders to arrest civilians for actions as small as engaging in fights, which confused smuggler Has Obitt; according to Obitt, during the war the clones would have been the people that started a bar fight, yet the troops were now breaking them up."}, {"tag": "p", "text": "The drop in casualties following the end of the war allowed the Empire to suspend clone production without a major disruption in manpower as new, non-clone recruits took up the mantle.  Nevertheless, the Empire continued to make use of clones even as they were gradually phased out of service. In addition, shock troopers continued to patrol the upper levels of Coruscant and even supported Darth Vader in his efforts to capture Jedi Master Jocasta Nu, the Chief Librarian of the Jedi Archives. Around a year into the Imperial Era, the Empire was already pulling clones out of the Imperial Army, although Ahsoka Tano assumed newer clones would still be part of its ranks."}, {"tag": "p", "text": "As time passed, the remaining clones were deemed no longer fit for military service due to their rapid aging process. In addition, Imperial propaganda created an influx of non-clone recruits in the Imperial Military, accelerating the Empire's decision to phase the clones out of the military. The clones, having fulfilled the purpose for which they were created and trained to complete, were no longer needed by the Emperor. As a result, most clones quietly retired but their legacy endured through the soldiers who replaced them. No longer using fresh clones to replenish the army due to the shutdown of the cloning hatcheries on Kamino, the Empire introduced birth-born human recruits and conscripts into the stormtrooper ranks, thereby causing the military to transition from a clone army to a volunteer force. In 14 BBY, Sergeant \"Crest\" was a clone trooper who still served the Empire, although Darth Vader stated that the clone's aging may have been too fast for him to remain on active duty. However, Vader ultimately promoted Crest to the rank of lieutenant."}, {"tag": "p", "text": "By 4 BBY most clones had been decommissioned and were regarded as obsolete. A small number of clones remained in Imperial service, acting as training instructors for the next generation of stormtroopers, but such a position did not guarantee the clones would like their cadets; clone trooper \"Lassar\" resented enlisted recruits despite becoming an instructor. Another clone was TX-828 \"Torrent;\" as one of the last clones in the Stormtrooper Corps, he was a rare sight by the time of the Battle of Yavin. At that time he was nearing the age of forty due to his accelerated growth process, with strands of gray coloring his black hair. By then the rarity of Torrent's kind was such that ISB Senior Commander Alecia Beck was surprised to encounter a stormtrooper from the original Kaminoan production line."}, {"tag": "p", "text": "An Imperial clone stormtrooper known as Crag remained in military service well into the Empire's reign, despite his accelerated age. The old clone had a strong sense of duty, which he believed was maintaining order in the galaxy. However, his personality earned the ire of a fellow trooper, Sardis Ramsin, who regarded Crag as a \"relic.\" Crag was serving as a sandtrooper of Foot Patrol 7 when his team deployed to Mos Eisley on Tatooine, shortly before the Battle of Yavin in 0 BBY. They had been sent to capture two droids belonging to the Rebellion, C-3PO and R2-D2, but fell under the influence of a Jedi mind trick performed by an old hermit. Unbeknownst to Crag and his team, the old man with the droids was the Jedi fugitive Obi-Wan Kenobi, who used the Force to dominate the weak-minded troopers in order to move the droids into the city unopposed."}, {"tag": "h4", "text": "Life after retirement"}, {"tag": "p", "text": "During the later years of the Clone Wars, many clones talked about retirement as a reward for their service, but few knew what it entailed. Indeed, the Republic planned to retire the clones, but neither the government nor the clones knew what that meant. If a soldier brought the subject up, their commander would often put an end to the idle chatter. A few forward-looking clones contemplated work in corporate security or consultation with local militaries owing to their lack of civilian job skills, and their accelerated aging process decreased the likelihood of them learning and mastering such job skills before they died. However, strong loyalties to the former Republic created a moral quandary when it came to security work, as retired clones would possibly be fighting some of their former brethren."}, {"tag": "p", "text": "Before the Republic collapsed, politicians had vetted certain officers about staying in a formalized and permanent Republic military to maintain the peace. A few exceptional clones had even been approached to run for political office. Having proven their loyalty to the Republic, and with the civilian population loving military heroes, many clones would have made ideal candidates were it not for the clones' general disdain for politicking."}, {"tag": "h3", "text": "Psychological impact of Order 66"}, {"tag": "p", "text": "Some clones felt bitter and horrified by their actions, having been traumatized by the aftereffects of Order 66. On one occasion, CC-10/994 \"Grey\" was dismayed by his own thoughtless execution of Order 66—an experience which he described as being in trance, and therefore, unable to control his actions. Captain \"Styles\" did not share his commander's concern over the moral issues of Order 66, however. In an effort to atone for his participation in the Jedi Purge, Grey sacrificed his life to save Caleb Dume, the apprentice of Jedi Master Depa Billaba whom the clone killed while under the influence of Order 66."}, {"tag": "p", "text": "Sometime after the issuing of Order 66 and the removal of Rex's chip, CC-3636 \"Wolffe,\" and CC-5576-39 \"Gregor\" had their chips removed. In the years that followed the Clone Wars, Rex and the other two clone veterans lived in retirement on Seelos, where they made a home out of a modified All Terrain Tactical Enforcer. Despite the effects of their accelerated growth, the aging clones decided to oppose the Empire by joining the nascent rebellion, a movement dedicated to the restoration of the Republic that the clones once served. Regarding the clones' view of stormtroopers, Rex was generally dismissive of the humans who replaced his brethren."}, {"tag": "h3", "text": "Clones in the Rebellion"}, {"tag": "p", "text": "Although the extensive majority of clone troopers were loyal to the Empire, held in place by training and established organic programming, a few clones were able to discover how to disconnect or repel their programming. Of those few, even fewer decided to rebel against the Empire, mostly due to their increasingly old age or situations. The rebellious clones brought their combat training and experience to the various resistance groups that they joined and were also knowledgeable in Imperial strategy and military bureaucracy. Although clones active in the growing rebellion operated apart from each other, some instances saw several clones working together."}, {"tag": "p", "text": "At least one Jedi survivor harbored a grudge against the clones. Kanan Jarrus was traumatized by the events of Order 66, including the sudden execution of his Master, Depa Billaba by their own clone troopers, who betrayed and murdered the Jedi Master without hesitation. This experience caused him to develop a strong sense of bitterness towards the clones. After Clone Captain Rex joined the rebellion, Jarrus still possessed his grudge for a time, but Jarrus came to respect and view him as a friend after the Captain nearly sacrificed himself for Jarrus. After the mission, Jarrus went as far as to salute the clone, which surprised Rex, but he quickly returned it. After the rebellion fully formed into the Alliance to Restore the Republic, Rex continued to serve, and was eventually promoted to the rank of commander in the organization. He served in the Battle of Endor, which would prove to be a major loss for the Empire because of the deaths of Emperor Palpatine and Darth Vader."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Galactic Empire"}, {"tag": "p", "text": "Although the clone trooper program was decommissioned under the Empire, their service in the Clone Wars inspired a generation of birth-born humans, both throughout the conflict and the years that followed. At the time there was no army to enlist in; save for the clones' Jedi Generals, the Grand Army of the Republic was exclusively based on a single template. The Republic faithful nevertheless wanted to do their part as citizens of the thousand-year democracy; as such, they were encouraged by COMPOR propaganda to purchase war bonds or report acts of sedition to the authorities."}, {"tag": "p", "text": "The Commission for the Preservation of the New Order (COMPNOR) built upon the carefully engineered symbols and messages of its COMPOR predecessor to accelerate the vast military expansion as decreed by Emperor Palpatine. For all of COMPOR's efforts to mythologize the clone troopers, portraying them as gallant heroes of the Republic in a barrage of propaganda, clones remained an abstraction in the public's mind. Yet whereas the Grand Army's ranks were exclusively clone-based, the galactic populace was encouraged by COMPNOR to serve the state by doing more than purchasing bonds, reporting treason or rationing supplies. With the cloning operation on Kamino suspended, ordinary citizens volunteered for military service in the hopes of wearing the armor of the Imperial stormtrooper and becoming heroes like the clone soldiers they idolized."}, {"tag": "p", "text": "By the later years of the Galactic Empire, clone troopers and the Grand Army of the Republic were virtually forgotten, becoming what some called a \"lost generation,\" despite their valiant service. By the war's end, clones had saved billions of lives across the galaxy, while their vehicles and equipment inspired new weapons such as the E-11 blaster rifle, based on the common clone weapon the DC-15, and AT-AT, based off the clone tank the All Terrain Tactical Enforcer."}, {"tag": "h4", "text": "New Republic Era"}, {"tag": "p", "text": "The clones of Jango Fett were said to have been extinct by the time of the New Republic Era. Although Boba Fett stood apart from the other Jango Fett clones, being an unmodified clone, he was still physically identical to them. His voice revealed him as a clone to Bo-Katan Kryze, who recognized Boba's voice inflection and tone as that of his donor, having heard the late Jango through thousands of clone troopers."}, {"tag": "p", "text": "At least one clone trooper was said to have sired a child before dying in the Clone Wars. Sconto, according to his mother, was the son of that clone. Unlike the clone, Sconto aged at a normal rate and was living as a merchant in Utapau's Pau City—the site of one of the final battles in the Clone Wars—about thirty years after the Battle of Yavin. Sconto was proud of his heritage and therefore harbored resentment towards the Jedi, whom he held responsible for his father's death."}, {"tag": "p", "text": "CT-6116 \"Kix,\" a clone trooper of the 501st Legion, was discovered by the pirate Sidon Ithano over fifty years after the end of the Clone Wars. At the time Ithano located a downed Separatist vessel and decided to raid it, assuming he would find valuable kyber crystals once belonging to Count Dooku. Instead, he found Kix, who had been frozen in stasis since the late Clone Wars, because he had discovered Order 66. The clone medic was deeply saddened when he learned about the end of the Republic and the loss of his brothers, and ultimately joined Ithano's crew due to his expertise in Clone Wars-era technology and the knowledge he possessed regarding the locations of former military locations."}, {"tag": "h4", "text": "First Order"}, {"tag": "p", "text": "Among military circles, the clones were remembered for their effectiveness. Determined to reclaim the Imperial legacy, the First Order initiated a clandestine project that centered on conscripting human children into its forces. Trained in live-fire drills and programmed through First Order propaganda, they became the new generation of stormtroopers. As the latest iteration of one of the most distinctive symbols of military might in the galaxy, First Order stormtroopers wore stark white armor derived from that of their Imperial predecessors and the Republic clone troopers who came before them."}, {"tag": "p", "text": "Though General Armitage Hux had complete confidence in his soldiers, convinced they were well trained and programmed, his rival Kylo Ren doubted their loyalty to the First Order and Supreme Leader Snoke. During the Cold War with the New Republic, Ren accused Hux's stormtroopers of harboring the potential for treason after FN-2187 betrayed the First Order. The dark warrior suggested that a clone army would be more reliable, using the rogue trooper as an example of a flaw that was potentially systemic to the stormtrooper program. The general responded to Ren's criticism by assuring him that the stormtroopers were exceptionally reliable in their combat skills and allegiance to the First Order."}, {"tag": "p", "text": "At the height of the First Order/Resistance War, the Sith Eternal cult readied an army of elite soldiers to support the First Order's ultimate push toward galactic conquest. Though they were named after a revived sect of the dark side, Sith troopers were the culmination of decades that the Empire spent attempting to strip individuality from its soldiers. Molding individual beings into fervently loyal extensions of the Emperor's will was a process that experienced much trial and error since the Clone Wars. Darth Sidious was dismayed to discover that clone troopers exhibited disconcerting amounts of free will despite their genetically engineered background and numerous alterations. While the Sith troopers were not clones, they underwent flash-imprinting and loyalty conditioning built upon and advanced beyond the Kaminoan procedures of earlier generations. As a result, they were far more loyal and machine-like than the First Order's trained-from-childhood stormtroopers."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "In order to rapidly produce a large army, the clones were subscribed to an accelerated training and aging program. All clones went through painful accelerated growth before reaching maturity, all while enduring nonstop training, simulations, and testing. Letter and number identifications were assigned to the clones to remove any sense of identity, as the cloners and trainers on Kamino viewed them as pieces of a machine, and not people. Endless mental and physical drills bled into the clones' \"recreation,\" where they participated in sports and games that resembled battle situations. Any bouts of anger or rebellion were dealt with by placing clones in retraining pods, essentially isolation tanks. Throughout their time on Kamino, their engineers muttered veiled threats of \"disposal\" if the clones failed their testing. As the war progressed, the Jedi clamped down on the more egregious attitudes, but the engineers of Kamino maintained their view of the clones as merely a product."}, {"tag": "p", "text": "Clone education was very rapid, and their learning consisted of intense classes that used screens and focus-enhancing helmets to help clones memorize information that might have one day been useful on the battlefield. Young clones were assigned to wear either an \"odd-class\" or an \"even-class\" helmet, in order to foster a sense of teamwork and competitiveness. Helmets that had gold-fittings were \"odd-class\", and helmets that had black fittings were \"even-class.\""}, {"tag": "p", "text": "As trainees, clones held the rank of clone cadet and were organized into multiple squads for the purpose of learning cooperation and teamwork. Cadets had several kinds of instructors; younger clones were monitored by full-grown clone sergeants and bounty hunters were hired to supervise the older clones. If a clone was unable to complete training, they could be assigned to maintenance duty. By the time of the Clone Wars, Jedi Master Shaak Ti personally oversaw the training of new generations of clone troopers. ARC troopers were also assigned to inspect the progress of future troopers. Clones deemed exceptional in comparison to the average, rank-and-file trooper, were given specialized training in order to become elite soldiers, such as clone commandos or ARC troopers."}, {"tag": "p", "text": "During the war, Shaak Ti observed how some cadets such as Domino Squad struggled to complete their training. Lama Su, who regarded the Domino clones as sub-standard units, believed they were the result of the Kaminoans' need to stretch their remaining supply of Jango Fett's DNA due to the template's untimely demise on Geonosis. The prime minister also opined that a new genotype would have to be selected in order to produce more clones fit for combat."}, {"tag": "p", "text": "The clones lived and trained in Tipoca City, the capital city of Kamino, throughout their time as cadets. Naturally, clones came to regard Kamino as their homeworld, just as official records did. Training and studying under the soft white lights of the clone facilities, most never saw the rain, oceans, clouds, or sky until they left for combat. Still, from the moment of their birth, the clones received encouragement from their trainers and genetic engineers to leave Kamino, and become soldiers among the stars."}, {"tag": "p", "text": "At least two clone squads were given a tour of the Venator-class Star Destroyer Endurance during the Clone Wars as part of the Clone Youth Brigade. The point of this on-site training exercise was to test the cadets' knowledge regarding the functions and layout of a Star Destroyer. It was also meant to help prepare the cadets for their future as fully trained clone troopers."}, {"tag": "p", "text": "The clones who failed to complete their training were disqualified from becoming soldiers. Instead of military service, failed clones—such as 99—were given janitorial duties and menial work. The cadets who succeeded in their trials were promoted to active duty. Despite the status of trooper, a novice clone trooper was regarded as a rookie or \"shiny\" by the older, more battle-experienced clones. If a clone survived his first battle, he was no longer considered a shiny but rather a full-fledged soldier of the Republic."}, {"tag": "p", "text": "Ahsoka Tano felt as though the clones knew battle in their very blood, while trooper CT-5555 \"Fives\" once proclaimed that a clone's training was in his blood. Clones were taught Galactic Basic Standard, the language of the Galactic Republic. Those who spent a lot of time stationed on a specific planet could adopt a patois of the local language. Clones tended to litter their speech with jargon and slang—such as \"clankers\" for droids—incomprehensible to a civilian or a Jedi unfamiliar with military culture."}, {"tag": "p", "text": "As the war progressed, command allowed clones to pursue hobbies within limited parameters to supplement their off-duty training and improve mental health. This improved morale and recovery; however, it also gave clones insight into the \"other side\" and how the civilian population lived."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Phase I clone trooper armor was the first version in the clone trooper armor series. It was issued to clone troopers on Kamino prior to the Clone Wars, and was in service until it was rendered obsolete by Phase II around the time of the Battle of Mon Cala. Both versions of clone trooper armor could be modified with an array of attachments, such as jetpacks and macrobinoculars. To better monitor ground movements and coordinate attacks, all clone troopers held a tracking device within their helmets that allowed controllers on Acclamator-class transgalactic military assault ships to better monitor the combat zone."}, {"tag": "p", "text": "At first, Phase I armor used color to distinguish clones trained for leadership roles, such as captains and commanders, from each other and the standard troopers in the Grand Army of the Republic. As the Clone Wars progressed, color gradually became used for the purpose of armor customization and unit identification. The trend was maintained during the service of Phase II armor, but was ultimately discarded by the time of the creation of stormtrooper armor after the Clone Wars. The identifying white armor of both Phases signified an honorable symbol of defense; however, the creation of the stormtrooper skewed this symbolism into one of a faceless icon of conformity."}, {"tag": "p", "text": "Clone troopers were armed with the DC-15A blaster rifle and DC-15A blaster for long ranged combat, as well as blaster pistols for standard-ranged combat. They also wielded several types of grenades, including Electro Magnetic Pulse grenades and thermal detonators."}, {"tag": "p", "text": "With the exception of the Coruscant Guard's red-armored shock troopers, the clone troopers who served the Galactic Empire restored their Phase II armor to its standard white appearance. Under the leadership of the Jedi, color was used to distinguish the various units in the Grand Army of the Republic, allowing clones to express their individuality with the Jedi's encouragement. Returning to a force of white-armored soldiers symbolized the loss of the Jedi's influence and the individualism of the clones, replaced by programmed conformity."}, {"tag": "h2", "text": "Specialized clone troopers"}, {"tag": "p", "text": "To fill the demand of the different situations that occur during wartime, various clone troopers received extra or specialized training. The battles took place in many different environments during the Clone Wars and as such, the need for specialized gear also arose."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Prequel trilogy clone troopers were created through computer-generated imagery. In Star Wars: Episode II Attack of the Clones, the school-aged clones were played by Daniel Logan, the young adult versions by Bodie Taylor, and the mature versions by Temuera Morrison.[source?]"}, {"tag": "p", "text": "For Star Wars: Episode III Revenge of the Sith, Morrison wore a blue bodysuit to play troopers Cody, Odd Ball, and Jag. The suit was later digitally replaced with computer-generated clone armor.[source?]"}, {"tag": "p", "text": "Dee Bradley Baker voiced all of the clone troopers in Star Wars: The Clone Wars and Star Wars Rebels, while Logan reprised his role as the clone cadets in The Clone Wars episodes \"Death Trap\" and \"ARC Troopers.\""}, {"tag": "p", "text": "The 2019 Fantasy Flight Games sourcebook Collapse of the Republic claims that, during their time training on Kamino, clone troopers had no time to form friendships with their cohort beyond a soldier's bond. However, The Clone Wars episode \"Clone Cadets,\" which depicts Domino Squad during their training on the water world, establishes that clones already view each other as brothers during this time, with cadets \"CT-5555\" Fives and \"CT-1409\" Echo going as far as to look out for each other by requesting a transfer. As Collapse of the Republic is only a roleplaying sourcebook, this article assumes \"Clone Cadets\" is correct."}, {"tag": "p", "text": "Another 2019 FFG sourcebook, Rise of the Separatists, stated that clones tended to view their fellow soldiers as family, fallen comrades as ancestors, and new recruits as descendants. However, various other sources instead establish all clones view each other as brothers. Therefore, this article assumes Rise of the Separatists is incorrect."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}