{"url": "Clone_trooper_lieutenant", "categories": ["Category:Legends articles", "Category:Clone trooper lieutenants", "Category:Clone trooper variants", "Category:Grand Army of the Republic ranks"], "nodes": [{"tag": "h1", "text": "Clone trooper lieutenant"}, {"tag": "p", "text": "During the Clone Wars, clone trooper lieutenants were clone troopers specially trained as officers on Kamino, and recognized by the unique blue markings on their helmets and torso armor. They would however, often wear armor that was specifically painted to match the environment."}, {"tag": "h2", "text": "Function"}, {"tag": "p", "text": "Clone lieutenants commanded platoons comprising four squads, or thirty-six troops. Numerous lieutenants participated in the First Battle of Geonosis, where they made their debut in battle, along with many of the other ranks of clones. Clone trooper lieutentants often reported to their respective clone trooper captains."}, {"tag": "h2", "text": "Gear"}, {"tag": "p", "text": "Clone trooper lieutenants wore distinguished blue Phase I clone trooper armor during the first years of the Clone Wars; later they wore armor that distinguished them by division and not by rank. ARC trooper lieutenants sported ARC trooper armor, which optionally provided some of these units with additional weaponry, such as hidden flamethrowers. These ARC lieutenants also wore skirt-like kamas that dampened blasts, had rangefinders attached to their helmets, and wore command shoulder pauldrons. However, the markings on the ARC lieutenants' armor remained blue."}, {"tag": "h2", "text": "Rank"}, {"tag": "p", "text": "They were a rank above Sergeant and below a Captain. The rank of lieutenant among clones is also used for the ARC trooper private units. They sported additional command, along with better training and varying weapons, including wrist-mounted flamethrowers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}