{"url": "Clone_trooper_officer", "categories": ["Category:Canon articles", "Category:Military stubs", "Category:Incomplete lists", "Category:Clone trooper variants", "Category:Grand Army of the Republic ranks"], "nodes": [{"tag": "h1", "text": "Clone trooper officer"}, {"tag": "p", "text": "Clone trooper officers, also known as Clone Officers, were clone troopers who served as officers in the Grand Army of the Republic during the Clone Wars, a pan-galactic conflict between the Galactic Republic and the Confederacy of Independent Systems. Clones serving in the Republic Navy were known as clone navigation officers."}, {"tag": "p", "text": "Clone trooper officers had a number of ranks, with some clones being trained for a higher rank, while others were promoted to it. The highest rank given to clones was normally that of Clone Commander. These commanders led regiments of sixteen companies."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Description"}, {"tag": "p", "text": "Clone trooper officers, also referred to as Clone Officers, were clone troopers who served as military officers within the Grand Army of the Republic, the Republic Navy, and medical units within the Republic Military. When foregoing clone trooper armor, army clone officers used a blue uniform, identical to the uniforms used by clone navigation officers, which crewed and commanded Republic starships, as well as aided their superior Republic officer."}, {"tag": "p", "text": "Clone medical officers wore a white version of the naval clone uniforms, and were present at medical space stations and commanded hospital ships. Eventually, medical officer clones had a different uniform, with red stripes and insignia."}, {"tag": "h3", "text": "Ranks and duties"}, {"tag": "h4", "text": "Grand Army of the Republic"}, {"tag": "p", "text": "Multiple military ranks were used by clone trooper officers, each with different or additional responsibilities and powers. In the Grand Army of the Republic, a Clone Lieutenant served as the leader of a platoon and its four Clone Sergeants. In turn, a Clone Captain commanded a company of troopers, which consisted of four platoons. Additionally, Clone Captains could also serve as the first-in-command of a legion's commanding officer."}, {"tag": "p", "text": "Above Clone Captains was the military rank of Clone Commander. Clone troopers with that rank could lead battalions, regiments, or legions within the Grand Army. Above Clone Commander was the high rank of Clone Marshal Commander, who had the capability of leading an entire corps. Special forces, specifically Advanced Recon Commandos, could attain the rank of Clone ARC Commander. Clone majors also served within the Republic Army."}, {"tag": "h4", "text": "Republic Navy"}, {"tag": "p", "text": "The Republic Navy's clone officers used the military ranks of Clone Captain and Clone Commander. A Clone Captain could serve onboard a Star Destroyer, in consort with a Clone Commander. Additionally, Clone Captains could also serve as the commanding officers of sub-capital ships including a Pelta-class Medical Frigate or a Consular-class c70 cruiser."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}