{"url": "Cloning_tank", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Cloning technology"], "nodes": [{"tag": "h1", "text": "Cloning tank"}, {"tag": "p", "text": "Cloning tanks were used by cloners to develop and provide life support to clones. Clones were stored in cloning tanks until they reached the desired state of development. Growth jars were a type of cloning tank."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation of the clone troopers"}, {"tag": "p", "text": "The Kaminoans of Kamino used specialized cloning tanks while creating the clone troopers of the Grand Army of the Republic. Cloning tanks were also found in Mount Tantiss on Wayland, and were used by Grand Admiral Thrawn to create an army of clone stormtroopers during his campaign against the New Republic."}, {"tag": "h3", "text": "Clones of Galen Marek"}, {"tag": "p", "text": "With the death of Galen Marek, Vader's secret apprentice, the Dark Lord ordered scientists in Kamino to make clones of the dead man as a replacement army. However, the first clones were a failure. Until one time, the first genetically successful one was created. However, this clone also obtained the visions from his original man, making him a threat to Darth Vader, he then sought allegiance to the Rebels in order to search for his true identity. When he fought with the Dark Lord, in the Timira Cloning Spire, several failed clones were used as an army to slow him down, but he succeed in killing them all. Most of the cloning tanks were found in the city of Timira on Kamino where Vader developed his clone followers. However, a successful clone loyal to the dark side was eventually cloned. He was willing to follow his master and was stronger than the other clones. He had also freed himself from visions and emotions which prevented him from failures which made him the only perfect clone of Starkiller, and was given a customized Sith armor for battle."}, {"tag": "h3", "text": "Clones of Boba Fett"}, {"tag": "p", "text": "When Vader hired Boba Fett and Xasha to find Starkiller, Vader ordered the bounty hunter to remain. Unknown to Fett, DNA samples were collected by Xasha and given to the scientists to clone him. During the assault of the rebels on Kamino, Fett found this one out, and he killed the scientists and burned the cloning tanks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The original type of cloning tanks were cylinder tanks filled with growth liquid, wherein the clones are under development. However, in Star Wars: The Force Unleashed II an extension type of the tanks were seen. These were likely to be found in the Timira Cloning Spire, the game's last chapter, they are like platforms with a glass cover on the rear, most likely to release the clones after their development."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}