{"url": "Cloning", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Clones", "Category:Cloning technology"], "nodes": [{"tag": "h1", "text": "Cloning"}, {"tag": "p", "text": "Cloning was the process of duplicating an organism into one or many genetically identical individuals known as clones. During the final years of the Galactic Republic, an army of clone troopers was grown on the planet Kamino. Using the human Mandalorian bounty hunter Jango Fett as a template, the Kaminoans tampered with Fett's genetic structure to make his clones more docile. In addition, they were designed to grow at twice the rate of normal human aging, making the clone troopers ready for deployment in a decade's time. At Fett's request, an unmodified clone—Boba Fett—was created from his template and given to him to raise as his son."}, {"tag": "p", "text": "During the Clone Wars, Fett's clone soldiers served in the Grand Army of the Republic under Jedi leadership until Order 66 called for the destruction of the Jedi Order. The clones carried out their mandate due to their programming, eliminating most of the Jedi Knights across the galaxy, after which the Galactic Empire was formed by the Sith Lord Darth Sidious. Shortly thereafter, the clone army was decommissioned and replaced by birth-born stormtroopers."}, {"tag": "p", "text": "The Empire ultimately fell to the New Republic after the Emperor's destruction. However, Sidious managed to cheat death. Through the combined use of cloning and the dark side of the Force, the Sith Lord transferred his spirit to a new host that had been cloned from his original body. Though the transference had been a success, Sidious' new vessel suffered from rapid deterioration and was unable to contain the dark energy of his soul. His followers, the Sith Eternal, experimented with Sidious' template in the hope of creating a more suitable vessel. Their efforts produced various Strand-Casts, including Supreme Leader Snoke and multiple genetic copies of him, as well as a modified clone that was healthy yet lacked Sidious' connection to the Force. As such, the clone's only worth to Sidious lay in continuing the Palpatine bloodline through more natural means, resulting in the birth of Rey who, unlike her father, was regarded as the ideal host for her grandfather's essence following Ben Solo's rejection of the dark side."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Cloning was the scientific procedure of growing a clone from the genetic template of a living organism. The template's DNA was the foundation for clones, which could number from at least one genetic copy to millions of specimens that shared the same face, voice, and even skills inherited from the original source. The template's genetic code could be altered through modifications to the cloning process for various purposes, including growth acceleration and greater docility. Without alterations to the genome, a clone would be the exact duplicate of its template at the genetic level."}, {"tag": "p", "text": "The practice of cloning humans was an imperfect science. In spite of the Kaminoans' efforts to perfect the art, it was still possible to discover the occasional genetic or physical defects in their specimens, producing both wanted and unwanted results."}, {"tag": "p", "text": "Millions of clones could be grown from a single genetic sample, but only while it was viable. Over time the sample would degrade. Therefore, cloners required regular access to the original source or donor in order to extract replacement samples. Otherwise a new host would have to be adopted to continue the cloning production. Clones were also considered mentally superior to droids. Their physical conditioning could be enhanced through technological augmentation, which, in the case of clone troopers, increased their chances of surviving against numerous endless waves of battle droids."}, {"tag": "p", "text": "Clone troopers were created for the sole purpose of fighting; as such, they were afforded little respite. They were also capable of developing genuine resentment for their opponents, in particular the battle droids who they referred to by the derogatory slang \"clankers.\" Some clones developed a habit for collecting droid parts as war trophies, although this act was considered a sign of defectiveness or deviant behavior."}, {"tag": "p", "text": "A clone's DNA could be modified in a way that made it impossible for the clone to disobey a specific order. This was accomplished by encoding a directive in the clone's biology. A more extensive modification of the cloning process resulted in the creation of a strandcast. Strandcasts were \"artificial genetic constructs\" made from a hybrid of donated cells, some of which could be extracted from cloned tissue samples. This was the case with Rey's father, a strandcast whose composite genetic structure comprised the cells of various specimens, including the cloned DNA of the Sith Lord Darth Sidious. The father of Rey was, therefore, a non-identical clone of Sidious."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Fall of the Republic"}, {"tag": "p", "text": "Though not the only practitioners of cloning in the galaxy, the Kaminoan government turned its mass production of clones into a large-scale commercial enterprise. It was through the Kaminoan cloning process that an army was created for the Galactic Republic, almost ten years before the Clone Wars, at the behest of Jedi Master Sifo-Dyas. Under the leadership of Prime Minister Lama Su, the Kaminoans utilized their cloning expertise to create millions of genetically-engineered soldiers who would form the backbone of the new Republic Military. The Chief Medical Scientist of Kamino, Doctor Nala Se, was directly involved in the clone army's creation as one of its primary engineers."}, {"tag": "p", "text": "Following the death of Sifo-Dyas, the Sith took control of his project and hired a human bounty hunter, Jango Fett, to serve as the army's clone template. Fett's genetic code served the foundation for millions of clone troopers who all shared the same face, voice, and combat prowess as their progenitor, although they were also structurally modified at the genetic level to make them less independent and more docile. The first clones of the Jango Fett genotype were designated as \"generation one,\" and among their ranks was Clone Captain CT-7567 of the 501st Legion."}, {"tag": "p", "text": "Further genetic tampering caused Fett's clones to grow at twice the rate of the human species, making them ready for deployment in a decade's time. While the process of growing clone troopers was left to Kaminoan scientists, the Sith took a more active role in their programming, having supplied their cloners with behavioral modification biochips to be implanted in the brain of every clone at the earliest stage of their development. Portrayed as a structural inhibitor chip, they ostensibly made their hosts more docile and less aggressive than their template, but their true purpose was to force the clones to obey Order 66—a secret protocol authorizing the immediate extermination of the Jedi Order as enemies of the state."}, {"tag": "p", "text": "In addition to Fett's considerable monetary fee, the Kaminoans compensated him by creating a clone—codenamed Alpha—that stood apart from the rest of his artificial progeny. Unlike the others, Alpha was an example of pure genetic replication and as such he was neither programmed for loyalty nor designed to grow at an accelerated rate. Fett took custody of the unmodified clone to raise as his son, granting him the name \"Boba Fett.\" Alpha was not the only example of pure genetic replication, however. Another unmodified clone of Jango Fett was created, possessing first generation DNA, and was codenamed Omega. Omega was a human female clone who, by the end of the Clone Wars, was serving as Nala Se's medical assistant."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The clone army's development had proceeded according to schedule as the Separatist Crisis entered its final days. The Kaminoan capital, Tipoca City, housed tens of thousands of clones, while millions more were in development in facilities scattered across the planet Kamino. When the Jedi Knight Obi-Wan Kenobi discovered the clone army, Lama Su praised it as one of the finest ever produced by his people. As war became imminent, with thousands of secessionist star systems joining the Confederacy of Independent Systems, the Galactic Senate empowered Supreme Chancellor Sheev Palpatine, secretly the Sith Lord Darth Sidious, to mobilize the clone troopers as the Grand Army of the Republic."}, {"tag": "p", "text": "Clone troopers were the legal property of the Galactic Republic, although Doctor Nala Se—one of the clones' main engineers—believed that the Kaminoan government still owned them. Clones fought for the Republic on all battlefronts across the galaxy and were loyal to their Jedi Generals as well as Chancellor Palpatine. During the conflict, the Jedi oversaw the training of younger clones on Kamino. With only a limited supply of genetic material from the late Jango Fett, Lama Su was concerned that the new clones would be less effective as soldiers. He recommended that the Jedi acquire a new template, but his Jedi liaison, Shaak Ti, advocated her support for the remaining Fett clones, particularly the clone cadets of Domino Squad."}, {"tag": "p", "text": "Fett's genetic record was considered a military asset of the highest importance to the Republic's continued war effort. Knowing this, the Separatists sought to halt the production of new clones by invading Kamino and destroying the last source of Fett DNA. Though the clone troopers were soldiers of the Republic, they harbored an affinity for the Kaminoan homeworld which they viewed as their home as well. This collective sentiment motivated the clones to make every effort in pushing back against the Separatist invasion, ultimately winning the Battle of Kamino through acts of bravery and sacrifice."}, {"tag": "p", "text": "As the war continued, the Senate broached the subject of buying more clones to augment the Grand Army's ranks. While Senator Padmé Amidala and other like-minded politicians advocated fiscal responsibility and a diplomatic solution to the war, others argued for increased military spending. Senator Halle Burtoni favored legislation that would deregulate the InterGalactic Banking Clan, thereby providing the Republic with new lines of credit to purchase more clone troopers from Burtoni's homeworld of Kamino."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "In the aftermath of the Clone Wars, Sidious proclaimed himself Emperor of the Galactic Empire. During the early Imperial Era, the clone troopers that fought for the Republic became the first generation of stormtroopers. At first the clones continued to form the backbone of the army, and some troopers joined the ranks of the Emperor's Royal Guard, but to their own surprise the New Order terminated the cloning operation on Kamino. The decision to phase the clones out of military service was influenced not only by their rapid aging process, but also the influx of non-clone humans who were inspired to enlist by Imperial propaganda."}, {"tag": "p", "text": "The decision to terminate the production of clone troopers also came as a surprise to Prime Minister Lama Su, who had believed that the Kaminoan government would continue to grow clones for the Galactic Republic after the Clone Wars ended. With the rise of the Galactic Empire, however, the contract between Kamino and the Republic was effectively nullified. Following the Emperor's announcement, Admiral Wilhuff Tarkin was sent to Kamino—under the protection of Imperial shock troopers of the Coruscant Guard—to assess the remaining clone units and determine whether there was a need to produce future clone troopers for the Empire. Lama Su argued that the Empire needed more clones to maintain order throughout the galaxy, although the admiral countered that order could be maintained by conscripted soldiers at less cost to the Empire."}, {"tag": "p", "text": "The final batches were brought online, but the Stormtrooper Corps was henceforth comprised of birth-born human volunteers and conscripts. Although clones could be programmed for unconditional loyalty, the Empire discovered that a more uniform, malleable soldier could be produced through the fervent patriotism of the young than the genetic duplication of a single template. Boba Fett also survived the Clone Wars and became a notorious bounty hunter like his father before him. While the relationship of Jango and Boba was that of donor and clone, Boba considered Jango his father."}, {"tag": "p", "text": "The Tarkin Initiative utilized the genetic template of the Hutt species to create a line of Hutt clone troopers. The Empire possessed a small supply of Hutt clones, which were frozen in stasis aboard the Hivebase-1 space station, having rejected them for mass production. Armed with supercharged carbines, the Hutt clones were activated by Commander Yewl to serve as soldiers alongside his personal guard of death troopers."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "Clones were remembered long after the Clone Wars, having made an impact on galactic history, well past the fall of the Empire and throughout the era of the New Republic. Bo-Katan Kryze recognized Boba Fett by his clone origins, due to her past dealings with the Galactic Republic and its clone army during the Clone Wars. She also knew that Fett's donor also provided the genetic material that spawned thousands of identical soldiers."}, {"tag": "p", "text": "Moff Gideon's Imperial remnant employed the services of Doctor Pershing, a clone engineer as well as a high-value target of the New Republic. Gideon tasked Pershing to oversee the remnant's experimentation on blood samples with a high count of midi-chlorians. Pershing was captured, however, by Marshal Carasynthia Dune as part of the Mandalorian warrior Din Djarin's efforts to rescue the foundling Grogu."}, {"tag": "p", "text": "During the Cold War, the First Order warlord Kylo Ren had an argument with his rival, General Armitage Hux, concerning the newest generation of stormtroopers. Ren openly criticized Hux's soldiers, convinced that they were all capable of treason due to the actions of a single traitor in the ranks, and declared that Supreme Leader Snoke should consider the advantages of using a clone army."}, {"tag": "h3", "text": "Darth Sidious reborn"}, {"tag": "h4", "text": "The Emperor's cloned body"}, {"tag": "p", "text": "After a generation of Sith rule over the galaxy, Darth Sidious was destroyed by his Sith apprentice, Darth Vader, who gave his life to save his son, Luke Skywalker. With their deaths, the lineage of Sith Lords from Darth Bane to Darth Vader was broken. Anakin Skywalker fulfilled his destiny as the Chosen One by bringing balance to the Force, but Sidious had discovered a way to return from death."}, {"tag": "p", "text": "The Emperor died when his body was destroyed on the DS-2 Death Star II Mobile Battle Station during the Battle of Endor in 4 ABY. However, he was then revived on the Sith world of Exegol where a clone of his original body had been hastily prepared in order to serve as his spirit's new vessel. Using the knowledge that he gained from Darth Plagueis, the Sith Master who instructed Sidious in the ways of the dark side, Sidious succeeded in transferring his essence to his clone, but the process had been rushed. While Sidious had grown to suspect his apprentice's loyalty, having long sensed a remnant of the light side of the Force within Vader, he did not foresee that Vader would turn against him at Endor."}, {"tag": "p", "text": "Sidious' cloned body was deemed an imperfect replacement, suffering from physical deterioration as a result of the Emperor's connection to the dark side. His followers, a group of Sith cultists known as the Sith Eternal, attempted to perfect the procedure that led to Sidious' revival. They conducted many experiments on his genetic template, creating multiple specimens through the process of gene splicing, but none of their creations were deemed a suitable replacement to Sidious' temporary vessel. Although his second body was wracked with pain, Sidious sought to prolong its survival by relying on Clone War-era technology as well as an ancient Ommin harness."}, {"tag": "p", "text": "Rey's father was a byproduct of the Sith Eternal's efforts to create a more stable host for their master. He was engineered from the Emperor's cloned tissue as well as other genetic samples, producing a healthy strandcast instead of an exact clone of Sidious. He was regarded as the Emperor's son, but although he inherited Sidious' DNA, he did not possess his father's connection to the Force. This condition made the strandcast a disappointment to his father, the Emperor, who could not stand to look at his powerless creation. Nevertheless, the Emperor permitted the strandcast to live in order to preserve the Palpatine family bloodline through natural methods. His plan succeeded when the strandcast sired Rey, who was Force-sensitive like her grandfather. Although Sidious had not anticipated his cloned son's relationship with Rey's mother, he was determined to take possession of their child nonetheless, having reached the conclusion that his granddaughter was an ideal host for his spirit."}, {"tag": "h4", "text": "Return of the Emperor"}, {"tag": "p", "text": "Sidious' cloned body was on the verge of death by the time he broadcasted his return to the galaxy during the First Order/Resistance War. His flesh had become putrid; he was blind in both eyes; and he was completely dependent on the support of his medical harness for survival. Supreme Leader Kylo Ren estimated that only a short time remained before the Emperor's clone was completely destroyed by his connection to the dark side. In addition to finding Sidious on Exegol, Ren discovered the genetic duplicates of his late master, Snoke, who were kept sedated in a tank of nutrient fluid."}, {"tag": "p", "text": "Sidious' return baffled Aftab Ackbar, Rose Tico, and other members of the Resistance. The Emperor was believed to have been long dead by this time. However, Resistance trooper Beaumont Kin correctly theorized that cloning was involved in the Emperor's revival. As the Emperor's plot for revenge continued apace, Rey confronted her grandfather on Exegol where she learned the details of his survival through cloning in a Force vision. Sidious goaded Rey to surrender herself to the dark side by participating in a ritual sacrifice. By killing the Emperor in anger and hatred, Rey would become possessed by Sidious' spirit, freeing the Emperor from the confine of his cloned vessel."}, {"tag": "p", "text": "Rey's youth, her strength in the Force, and her lineage made her the most suitable host in Sidious' mind. While his plan relied on her ending the existence of his cloned body, Sidious was content to know that their souls would be merged within her body, allowing Sidious to rule the galaxy in spirit. However, Sidious abandoned this plan upon discovering the extent of Rey's Force-bond with Ben Solo, who renounced the dark persona of Kylo Ren. The realization that they were a dyad in the Force led Sidious to drain them of their combined power, thereby healing his body and restoring himself to full power. Vowing to herald the return of the Sith, the reborn Emperor moved to annihilate the Resistance but was opposed by Rey, who managed to destroy his spirit's vessel with the help of all the Jedi who were one with the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}