{"url": "Cloud-Riders", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Cloud-Riders members", "Category:Pirate organizations", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Cloud-Riders"}, {"tag": "p", "text": "The Cloud-Riders, also known as Enfys Nest's marauders, were a pirate gang led by Enfys Nest during the reign of the Galactic Empire that rode swoop bikes. Nest inherited leadership of the Cloud-Riders from her deceased mother. At some point the gang encountered Han Solo. There, they revealed themselves as rebels that wanted revenge on the crime lords who persecuted the inhabitants of resource-rich planets and wanted to fight the Empire.\nYears later, whilst undertaking a job for Jabba Desilijic Tiure, Solo saw a Caelli-Merced Skyblade-330 and noted that he hadn't seen one since his run-in with Nest's marauders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Cloud-Riders were a group of pirates led by a woman who fought reprisal against the Galactic Empire, the Five syndicates, and Crimson Dawn. Around 12 BBY, the Cloud-Riders' leader perished and leadership of the Cloud-Riders fell to her 16-year-old daughter, Enfys Nest, who took up her mother's mantle, mask, and armor. The Cloud-Riders carried on with their mission of fighting back against the threats to the galaxy's safety under their new leadership."}, {"tag": "p", "text": "In 11 BBY, six of the Cloud-Riders under Nest raided a Imperial spice cache on Gargon. They stole emergency packs and medical spice before they made their escape, leaving behind the valuable unprocessed spice."}, {"tag": "h3", "text": "Run-ins with Beckett"}, {"tag": "p", "text": "The Cloud-Riders, posing as Crimson Dawn's leader, Dryden Vos, were able to trick the smuggler Tobias Beckett into stealing a shipment of identichips from the Pantoran Dvorad on Hovun IV. The Cloud-Riders revealed themselves to Beckett and his gang when they arrived on Munt Ontdal with the indentichips. Unfortunately, Beckett destroyed the indentichips and his gang made their escape."}, {"tag": "p", "text": "The Cloud-Riders ran into Beckett and his gang when they attempted to steal a coaxium shipment from a Imperial transport train on Vandor. The two gangs fought each other to take the coaxium. Despite killing Beckett's pilot, Rio Durant, the Cloud-Riders were unable to retrieve the coaxium when they were forced to drop it. Despite the setback, one of the Cloud-Riders, Weazel was able to follow Beckett and learned about his plans to steal coaxium from the spice mines of Kessel. Weazel was then able to plant a tracking device on Captain Lando Calrissian's ship, the Millennium Falcon."}, {"tag": "h3", "text": "An unexpected ally"}, {"tag": "p", "text": "Tracking the Millennium Falcon, the Cloud-Riders awaited Beckett's arrival on Savareen. The Cloud-Riders confronted Beckett, his gang and Qi'ra. After Calrissian escaped aboard the Falcon, Nest told Beckett, and his gang, and Qi'ra that the Cloud-Riders were not marauders, but freedom fighters. Nest was able to convince Solo to give the coaxium. However, Beckett betrayed them to Vos' Hylobon Enforcers."}, {"tag": "p", "text": "Fortunately for the Cloud-Riders, Solo knew Beckett would betray them. Nest and her riders were able to fool the by having several of the Savarians pose as them. Nest and her riders then took out the enforcers. Nest and her riders were then given the coaxium and offered Solo a chance to join the rebellion though he refused. Nest then gave the coaxium to Partisans' leader, Saw Gerrera."}, {"tag": "h2", "text": "Members"}, {"tag": "h3", "text": "Enfys Nest"}, {"tag": "p", "text": "As leader of the Cloud-Riders, Enfys Nest led them in stealing shipments from both the Empire and Crimson Dawn. Nest also showed sympathy toward people who had been ravaged by Crimson Dawn."}, {"tag": "h3", "text": "Benthic"}, {"tag": "p", "text": "Following the exploitation of his people by the Empire and Crimson Dawn, Benthic joined the Cloud-Riders. However, he eventually left the riders and joined Gerrera's Partisans and became his second in command."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In response to Phil Szostak about if the concept of the Cloud-Riders originated from the 1977 Star Wars Legends comic Star Wars 9 or if it was just coincidental, Jon Kasdan, writer of Solo: A Star Wars Story, replied on Twitter that it was no coincidence, as when former directors Christopher Miller and Phil Lord settled on swoop bikes, Kasdan found the Star Wars Legends Cloud-Riders when browsing Wookieepedia, and the name stuck. Unlike the Legends Cloud-Riders, who were criminals, the canonical Cloud-Riders are rebels who fight against the Galactic Empire."}, {"tag": "p", "text": "The red flags on the Cloud-Riders' swoop bikes were inspired by the Sashimono, banners worn by both foot and cavalry soldiers in feudal Japan, particularly the ones depicted in classic samurai movies like the 1985 film Ran. The swoop bikes' sawn-off X-wing vibe was a nod to the Alliance to Restore the Republic's origins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}