{"url": "Cloud/Legends", "categories": ["Category:Legends articles", "Category:Articles with non-canon elements", "Category:Articles needing additional sources", "Category:Weather"], "nodes": [{"tag": "h1", "text": "Cloud"}, {"tag": "p", "text": "Clouds were visible masses of particles of condensed watery vapor suspended in the atmosphere of a planet or moon. Desert environments had very little cloud cover, which caused them to change temperature rapidly, reaching temperatures of well over a hundred degrees by day, then losing up to eighty of those degrees during the night."}, {"tag": "p", "text": "When the droplets of water contained within a cloud became heavy enough to fall under gravity, causing a meteorological phenomenon called rain. Because they floated high above the general level of the ground, clouds were extremely cold inside. Because of that, some of the water vapor turned into ice crystals and ice pellets known as graupels, and fierce atmospheric winds would sometimes toss them around."}, {"tag": "p", "text": "Occasionally, two kinds of ice would collide, becoming charged with static electricity. Those crystals then became positively charged, while the graupels became negatively charged. Being lighter, the crystals were blown to the top of the cloud, which gave its upper part a positive charge, while the heavier graupels sank toward the bottom of the cloud, which became negatively charged. That configuration resulted in a huge discharge that manifested in the form of lightning. That phenomenon frequently occurred within a type of cloud called cumulonimbus."}, {"tag": "p", "text": "On some planets, clouds could be also formed from particles of Mooxx fat, a lighter-than-air substance. Warm climates on a Raspar system world generated this phenomenon, which made the irrigation of arzen fields difficult."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the 2001 LucasArts video game Star Wars: Galactic Battlegrounds clouds appear as a unique terrain type that can be placed in player created levels. The also appeared in the sixth level of the Imperial campaign, \"Cloud City Attack.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}