{"url": "A_Reckoning_of_Wraiths", "categories": ["Category:Real-world articles", "Category:Dawn of Defiance"], "nodes": [{"tag": "h1", "text": "A Reckoning of Wraiths"}, {"tag": "p", "text": "A Reckoning of Wraiths is the seventh adventure in the Dawn of Defiance campaign. It is written by Gary Astleford and was released on November 7, 2008."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "The heroes escape from Coruscant but are confronted with betrayal."}, {"tag": "p", "text": "After transmitting their knowledge of the project to Senator Organa's agents, the heroes are instructed to make contact with a group of loyalists in Coruscant's seedy underbelly. When they arrive at the meeting location, however, they discover that the loyalists are all dead. The heroes return to their safe house—only to fall into a trap set by the Empire! Fighting their way back to their ship, the heroes find the hangar being defended by a massive AT-AT. They must bring the AT-AT down (using whatever means necessary) before they can board their ship.\nBlasting their way out of Coruscant, the heroes arrive at a rendezvous point where a Nebulon-B frigate (the Resurgence) waits for them. Unfortunately, when they arrive, they learn that the trap was sprung not only on them but also on their allies. As an Imperial Star Destroyer pounds on the Resurgence's shields, the heroes board the Nebulon-B and try to rescue survivors. Battling an Imperial boarding party on the ship, they fight their way to the main launch bay just in time to see Inquisitor Draco—apparently still alive after the confrontation on Almas, and now cybernetically enhanced—dragging Master Denia into his shuttle.\nAs Draco blasts off, the heroes must flee the crumbling ship and make their way into hyperspace. Worse, as they blast their way free of the exploding Resurgence, they discover the architect of their betrayal: Admiral Varth. They receive a transmission from the Admiral aboard the Imperial Star Destroyer, who reveals that he has merely been trying to uncover Organa's treachery all along. The heroes manage to escape the Empire, but only after suffering grievous losses."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}