{"url": "Clouzon-36", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Fuels", "Category:Gases"], "nodes": [{"tag": "h1", "text": "Clouzon-36"}, {"tag": "p", "text": "Clouzon-36 was a type of blue-green gas that was used as a hyperdrive fuel for starships. It was also inhaled by vacuum-based lifeforms such as grallocs and purrgil, the latter of which used it to power their natural ability to jump into hyperspace."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Clouzon-36 was a rare but powerful fuel; according to Sabine Wren, one decent-sized shipment of Clouzon-36 was enough to keep the entire fleet of the Phoenix Cell fully fueled for a whole cycle. Standard starship sensors had trouble identifying the gas at a distance, making it difficult to locate spills or deposits."}, {"tag": "p", "text": "Clouzon-36 conduits on starships were generally well armored to prevent leakage, though they were sometimes exposed as a result of starship combat. Containers of the gas were identifiable by markings of red-yellow-red-white-red."}, {"tag": "p", "text": "Although species such as humans and Lasats could not breathe in Clouzon-36, Rodians and Moyn could."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial Era, hijacked Clouzon-36 was on the permanent watchlist of the Imperial Security Bureau. In 3 BBY, the crew of the Ghost raided the Mining Guild's Asteroid Belt Gas Refinery, hoping to steal Clouzon-36 to replenish the Phoenix Cell's fuel supplies."}, {"tag": "p", "text": "In his corrupt scheme to steal components of the Project Stardust, Grand Admiral Balanhai Savit employed Clouzon-36 canisters to attract grallocs to his freighters, allowing their crews to feign hyperdrive malfunctions and escape the system. The discovery of trace amounts of the gas in a dissected gralloc's stomach contributed to the exposure of the scheme by Grand Admiral Thrawn."}, {"tag": "p", "text": "During her hunt for the 204th Imperial Fighter Wing, Lieutenant Yrica Quell discovered trace amounts of Clouzon-36 in the atmosphere of Jiruus; the presence of the hyperdrive fuel indicated a significant battle there."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}