{"url": "Club_Penguin_Star_Wars_Takeover", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:2013 computer and video games", "Category:Non-canon computer and video games", "Category:Parodies"], "nodes": [{"tag": "h1", "text": "Club Penguin Star Wars Takeover"}, {"tag": "p", "text": "Club Penguin Star Wars Takeover was an event within Disney's children's MMO, Club Penguin. It began on July 25 and ended on August 15, 2013. The event was initially announced in June 20, 2013 on ClubPenguin.com, with StarWars.com posting an official cinematic trailer on their website in early July."}, {"tag": "p", "text": "The event featured many characters from Club Penguin, donned in Star Wars–themed attire and personalities such as Princess Leia and Darth Vader. The event reenacted the occurrences of Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Opening crawl"}, {"tag": "p", "text": "CHAPTER 1"}, {"tag": "p", "text": "THE THREAT OF DARTH HERBERT"}, {"tag": "p", "text": "It is a time of grave danger. DARTH HERBERT and the evil Empire threaten the island."}, {"tag": "p", "text": "Join the rebel forces to battle Stormtroopers, steal the secret plans, and destroy the Death Star."}, {"tag": "p", "text": "Without your help, destruction is certain."}, {"tag": "p", "text": "Defeat the dark side and restore freedom to the galaxy..."}, {"tag": "h3", "text": "Summary"}, {"tag": "p", "text": "Herbert returns to seek revenge for his defeat during Operation: Hot Sauce. He assumes the role of Darth Herbert (an obvious spoof of the famous Sith Lord Darth Vader), and recruits an army of stormtrooper penguins to make up the Galactic Empire. He builds a huge floating space station known as the Death Star, and makes plans to destroy Club Penguin Island with the Death Star superlaser."}, {"tag": "p", "text": "The island is in a code red alert as they discover the space station floating in the sky. The Rebel Alliance sends out a call for help to Club Penguin Island. Penguins work around the clock to build a landing pad for the Millennium Falcon at the dock, so that when it lands on July 25, penguins can blast into space to destroy the Death Star and save the galaxy."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "Each week, penguins traveled to different parts of the galaxy and played a minigame to save the galaxy from Darth Herbert and the Galactic Empire."}, {"tag": "p", "text": "During week one, players had to travel to Tatooine and defeat the enemy in the Defeat Stormtroopers minigame to receive a Stormtrooper Helmet. Playing more as a member gave players the Stormtrooper costume and Sandtrooper Pauldrons. During week two, players were required to travel to the Death Star and complete challenges to receive a Rebel Trooper Helmet. During week three, players needed to travel to the Rebel Base on Yavin 4 to participate in battle flying an X-wing and receive a X-Wing Pilot Helmet."}, {"tag": "p", "text": "Members could buy more than twenty costumes from the Star Wars Catalog and had the chance to become Jedi Masters. To do this, they needed to equip Anakin's Lightsaber and duel with other penguins. Winning a battle would award an item; winning thirty battles would unlock more items."}, {"tag": "h2", "text": "Features"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}