{"url": "Clutch", "categories": ["Category:Canon articles", "Category:Garnac's hunting guild members", "Category:Males", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Clutch"}, {"tag": "p", "text": "Clutch was a male Trandoshan big game hunter who was a member of a hunting guild that hunted down sentient prey on the moon of Wasskah. During the year 20 BBY, Clutch served as a pilot for the guild's Trandoshan prisoner ship. During an expedition to find new prey, Clutch and his co-pilot Goron captured the Wookiee Chewbacca."}, {"tag": "p", "text": "However, while attempting to drop the prisoner off on an island, the previously captured Jedi padawan Ahsoka Tano, along with two other captured Jedi, attacked the Trandoshan freighter in a bid to get off of the island. Tano managed to break into the cockpit and dueled Clutch, with the latter's shotgun damaging the cockpit's controls and overloading the computer systems. The damage caused the ship to nosedive into the island's beach, with Clutch and Goron both dying in the incident."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Garnac's blood-sport"}, {"tag": "p", "text": "Clutch was a Trandoshan male pilot who was a member of a hunting guild led by the Trandoshan Garnac. The guild, populated solely by other Trandoshans, captured prey from across the galaxy—namely sentient individuals, although not exclusively—before bringing it back to the moon of Wasskah. Prey would be dumped off on the moon and then summarily hunted by the Trandoshans for sport. Occasionally, Clutch would pilot the guild's Trandoshan prisoner ship and travel to capture the guild's targets."}, {"tag": "p", "text": "During the year 20 BBY, Garnac's son Dar was preparing to enter the guild as an official member. Clutch participated in a hunting outing on the day of Dar's initiation ceremony, and later attended the ceremony itself, where Clutch cheered on Dar as the young hunter was initiated into the guild. However, Dar was killed the very next day by the captured Jedi Padawan Ahsoka Tano during his first hunt."}, {"tag": "h3", "text": "Duel with a Jedi"}, {"tag": "p", "text": "At some point, Clutch and a co-pilot, Goron, took the Reugot freighter and departed Wasskah to search for more prey. They managed to capture the Wookiee Chewbacca during their outing, and later returned to Wasskah with their single prisoner. By this point, Tano had teamed up with the stranded Jedi younglings O-Mer and Jinx. Wishing to escape the moon at any cost, the Jedi decided to attack the freighter head on and overwhelm its crew."}, {"tag": "p", "text": "While Clutch steered the ship towards Island Four, Tano appeared on the ship's windshield. Surprised, Clutch sent Goron after her. However, upon walking onto the ship's long hull, Goron was distracted by O-Mer and Jinx, who had also climbed onto the ship. With Goron occupied, Tano snuck inside the ship. However, Clutch was aware of the padawan, and pretended to be oblivious to her presence as she approached him from behind. Finally, Clutch spun around in his pilot seat, shotgun in hand, and began opening fire on the Jedi. Tano either evaded the shots or used the Force to chuck off Clutch's killing aim, which caused the cockpit's controls and computer panels to sustain substantial damage. The destruction caused the ship's power to flucuate, and the ship began to free-fall to the ground."}, {"tag": "p", "text": "Clutch tried to attack Tano again, but the Jedi telekinetically pushed Clutch through the ship's windshield, killing the Trandoshan pilot. Meanwhile, Goron had fallen from the ship to his own death and the ship crashed into Island Four's beach soon after. The Jedi recovered Chewbacca, who had survived the crash, and escaped back into the hunting island's jungle. Clutch and Goron were found the next day by the Trandoshans, and Clutch's body was pulled from the wreckage by the hunters Krix and Ratter. Clutch's death led to Lo-Taren having conclusions that the Jedi had grown more bold in their efforts to escape."}, {"tag": "p", "text": "Lo-Taren's hunch proved correct when the Jedi, alongside Wookiee reinforcements, attacked and dismantled the hunting guild entirely."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Clutch was a stocky, golden-scaled Trandoshan with orange eyes who was excited by Garnac opening the announcement of the new hunt. When preparing for what would be his final hunt on Wasskah, Clutch cheered by hooting and thrusting his arms in the air as he grabbed his weapon and proceeded to Wasskah's surface. Clutch was happily among his peers during Dar's initiation ceremony and excitedly chanted the young hunter's name along with the other Trandoshans."}, {"tag": "p", "text": "During the Jedi attack of the Reugot freighter it was Clutch who took charge and gave the orders when it came to repelling the attack. In addition, Clutch exhibited patience and a knack for ambush when he pretended to ignore Tano's sneak-attack before spinning around in his pilot seat, with his shotgun readily in hand in an attempt to shoot the Jedi. However, he proved unable to best Tano, and was instead killed by her. Clutch referred to the Jedi as \"whelps.\""}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As one of the guild's pilots, Clutch commanded their Trandoshan prisoner ship, identifiable as guild property due to the custom \"teeth\" paint-job on the ship's nose, during missions to capture prey. Going through horrific combats, Clutch utilized either a blaster or a shotgun."}, {"tag": "p", "text": "Clutch wore gray fatigues during Garnac's Jedi hunt, which included a gray jacket that featured yellow geometric tactical lining of hinting shapes and sleeves. A small pouch was strapped to his left arm, and he wore an electronically powered gauntlet around his other wrist."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clutch was one of many Trandoshan characters created for the Star Wars: The Clone Wars episodes \"Padawan Lost\" and \"Wookiee Hunt,\" both of which aired as a part of the show's season three on April 1, 2011. Clutch's voice was provided by Matt Lanter, who also voiced series regular Anakin Skywalker."}, {"tag": "p", "text": "All of the Trandoshans that appeared in the Wasskah story arc, including Clutch, were designed by concept artist Pat Presley. Clutch's stocky appearance was designed in a deliberate effort to diversify the physical builds of the Trandoshan characters. Clutch's name is taken from the term for the terminology for a group of eggs, which is a \"clutch.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}