{"url": "CoCo_Town/Legends", "categories": ["Category:Legends articles", "Category:CoCo Town locations", "Category:Coruscant districts"], "nodes": [{"tag": "h1", "text": "CoCo Town"}, {"tag": "p", "text": "CoCo Town, also known as CoCo District, was a commercial district located in the upper levels of Coruscant. Notable locations in CoCo Town included Dex's Diner, the CoCo Penitentiary, the CoCo District Theatre, Pom Plaza, Pets' \"N\" Pieces, Bithuband, Dewback Inn, and an archive building of the Galactic Museum."}, {"tag": "p", "text": "CoCo Town (short for Collective Commerce District) was an upper level district full of exclusive stores, restaurants and old-style diners. Many of these establishments catered to the maintenance crews and support staff working in the upper levels, while more refined eateries served the wealthier citizens of Galactic City. Diners and canteens such as the one owned by Dexter Jettster were frequented by spacers, freighter pilots and an array of beings, including the Jedi Master Obi-Wan Kenobi."}, {"tag": "p", "text": "Many of the more fly-by-night cantinas in CoCo Town operated without trading licenses, and were fitted with repulsorlifts for quick getaways from the CoCo District Constabulary."}, {"tag": "p", "text": "Prior to the Clone Wars, CoCo Town experienced a garbage collection crisis, which resulted in huge piles of trash being deposited in city streets and outside major buildings. This forced Skyroute D25D—connecting CoCo Town to the Boribos and Hirkenglade Prefectures—to be detoured between Kansen Entrance and Trotus Exit. A new refuse launch port was constructed in the area to combat the growing accumulation of garbage."}, {"tag": "p", "text": "CoCo Town was also the location where the infamous death sticks were invented in a medical laboratory. While the death sticks did not heavily influence CoCo Town, they did affect the underworld life, eventually prompting a HoloNet News article about the addiction issues."}, {"tag": "p", "text": "CoCo Town had its own edition of HoloNet News, a news network for the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The streets of CoCo Town as shown in the 2002 film Star Wars: Episode II Attack of the Clones were shot as miniatures in natural outdoor lighting."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": "Star Wars: Attack of the Clones: The Illustrated Companion"}, {"tag": "h2", "text": "Notes and references"}]}