{"url": "Coalition_for_Progress/Legends", "categories": ["Category:Legends articles", "Category:Commission for the Preservation of the New Order organizations", "Category:Culture of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Coalition for Progress"}, {"tag": "p", "text": "The Coalition for Progress, or simply Progress, was a sub-agency of the Commission for the Preservation of the New Order, or COMPNOR. It began as a weak cultural organization, understaffed and underwhelming, but developed into a massive information-gathering agency with monitors throughout the galaxy. It examined massive amounts of data, the majority of which was mundane, for indications of dissident or Rebel activity, and forwarded summaries to the more-important Imperial Security Bureau."}, {"tag": "h2", "text": "Sector Monitor"}, {"tag": "p", "text": "Each sector had a Sector Monitor, a collection of agencies whose intended purpose was to report on the cultural progress within a sector toward the enhancement and perfection of the New Order, and did rough sorting of data by division type. Below the Sector Monitor were the various divisions made up of COMPNOR members dispersed throughout the systems of the sector."}, {"tag": "h3", "text": "Art"}, {"tag": "p", "text": "Considered the most despised group within Progress by most citizens of the Empire, the Art group reported on the various art forms throughout the galaxy and passed judgment on the art in order to ensure the art stayed in line with the ideals of the New Order, though the Art group did not necessarily ban works of art that might have been unfavorable to the Empire."}, {"tag": "p", "text": "Instead, when the Art group had a particularly bad review of a piece of art, they attached a holopanel near the site that continuously replayed their review. The text had an intense red wavelength, which caused these holopanels to earn the name \"scarlet\". As a result, \"drawing a scarlet\" was a guarantee of success on scores of worlds, as many were attracted to these \"unworthy\" pieces of art."}, {"tag": "h3", "text": "Science"}, {"tag": "p", "text": "Originally its own organization within COMPNOR, the Science group was moved to Progress to report on the political acceptability of scientific research within their assigned sector and to actively coordinate research and development efforts in the New Order to enhance the scientific progress of the Empire."}, {"tag": "p", "text": "COMPNOR placed pressure on the scientists to focus on military programs, and while the Imperial Security Bureau kept a close eye on the Science group, COMPNOR took few reprisals against the scientists who continued to do basic research rather than weapons programs."}, {"tag": "h3", "text": "Commerce"}, {"tag": "p", "text": "Tasked with working in conjunction with the large commercial businesses to design programs for economic improvement on worlds within the Empire, the Commerce division of Progress was highly successful in giving crucial and effective aid to frontier worlds which had been neglected during the collapse of the Galactic Republic, with programs such as the Corporate Sector System Development Programs, or D-Progs. These worlds were made economically self-sufficient thanks to the efforts of Commerce, and in return the Corporate Sector Authority secured profitable new markets."}, {"tag": "p", "text": "Not all programs were successful, however, such as the well-publicized disaster of the Native Management and Industrialization Service, or NAMIS, on Gamorr."}, {"tag": "p", "text": "Commerce eventually shifted away from this economic improvement initiative sometime after the Battle of Yavin and began focusing on industrial espionage against the large corporations and smaller businesses who might have had sympathies for the Rebellion, aimed to make certain that the Empire lost no more valuable technology to the Rebels. In addition, Commerce also passed on breakthrough technologies in the Science group to the corporations which served the Empire well."}, {"tag": "h3", "text": "Education"}, {"tag": "p", "text": "Unlike the SAGEducation branch of the Sub-Adult Group, the Education division of Progress did not teach. They were given the mandate to homogenize the level of education throughout the Empire and to place emphasis on the values directed by the New Order. Education gathers data on individual worlds and informs the governor of that world how to transform their educational system to better conform with the dictates of the New Order."}, {"tag": "p", "text": "The Select Committee, the executive branch of COMPNOR, used Education as a dumping grounds for incompetents who were still politically useful, and being reassigned to Education was called \"being sent to the idea dusters.\""}, {"tag": "h3", "text": "Justice"}, {"tag": "p", "text": "The Justice group was tasked to produce a uniform legal code which would apply to the entire Empire, and this group greatly improved the legal system throughout the galaxy, thanks to the fervent efforts of its members. Unlike the Education group, Justice implemented their ideas as well as presented their legal theories to local systems."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Crueya Vandron, one of the founders of COMPNOR, tried to work the idea of \"Imperial Infallibility\" into the legal code, but his efforts were mostly resisted by the members of Justice, which caused the ISB to start harassing the group. False charges were made up against the less prominent members in order to intimidate the more politically powerful, and Progress started assigning new members to Justice who were more in line with the Emperor's views."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}