{"url": "Coar_Maw", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bounty hunters", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Coar Maw"}, {"tag": "p", "text": "Coar Maw was a male bounty hunter who operated during the later years of the Galactic Republic. At some point during the Clone Wars, Maw traveled to the Cularin system, where the Dark Jedi Raik Muun hired him to delay a group of freelance agents who threatened to interfere with her plans to attack the liner Luxury. Maw attempted to distract the agents with an audio recording, then ambushed them on the planet Cularin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Coar Maw was a male individual who lived during the waning years of the Galactic Republic. Maw worked as a bounty hunter through the Bounty Hunters' Guild; during the Clone Wars, he relocated to the Cularin system, in the Expansion Region. While Maw was still a relative newcomer in the system, he was hired by the Dark Jedi Raik Muun, who contacted the bounty hunter via a holoprojection that gave the Dark Jedi the appearance of a scarred Ithorian female. Muun wanted to prevent the Heroes of Cularin, a group of freelance agents who operated in the system, from interfering with her plans to disrupt a conference that was being held aboard the liner Luxury, so she asked Maw to delay them. Maw realized that the holoprojection was not his client's true appearance, but he accepted the assignment anyway, and Muun paid some dataries into his account."}, {"tag": "p", "text": "The Heroes of Cularin were summoned by the Jedi Master Lanius Qel-Bertuk to travel to a Jedi enclave that was located in the city Gadrin on the planet Cularin, and Maw planned to ambush them while they were on their way there. The bounty hunter tried to distract the agents by playing an audio recording of someone being assaulted, a sound he projected from a device placed in an alley. He then prepared to attack them from atop a stolen swoop, which he hoped would allow him to escape easily."}, {"tag": "p", "text": "Maw picked out one of the agents to attack first, and began his ambush. He fought against the heroes for a short time, then put his swoop into gear and sped off across the rooftops of Gardrin. Shortly thereafter, Office of Peace and Security officers arrived at the scene and set off in pursuit of him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Maw was a skilled bounty hunter who followed a code whereby he never revealed information about a contract that he had accepted from an employer. Maw's chest, arms, and face were covered in bandages due to a skin condition from which he suffered, leaving him in agonizing pain. However, this agony strengthened his resolve to find his targets, because he spent most of the money he earned from collecting bounties on researching a cure for his ailment."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "To protect himself, Maw wore a blast vest and a helmet, and was armed with a N'Gant-Zarvel 9118 heavy carbine, stun grenades, and a knife. He also carried with him a pair of stun cuffs and a datapad, which contained detailed reports on each of the Heroes of Cularin and documentation relating to his Bounty Hunters' Guild membership."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Coar Maw was created by Matthew Domville for Force Convention, the third scenario in the Forces of Cularin trilogy of the Living Force campaign, a supplement to the Star Wars Roleplaying Game. During the scenario, Maw's first name is spelt as both \"Caor\" and \"Coar\"; this article assumes that the latter is the correct spelling, because it is used more frequently."}, {"tag": "p", "text": "In Force Convention, the actions of the player-characters, who roleplay as the Heroes of Cularin, can affect how their encounter with Maw goes. If only one player walks into the alley where Maw has placed the audio recording, the hunter shoots at them with his blaster. However, if more than one player walks into the alley, Maw throws a stun grenade and then shoots at them. Afterward, Maw flees on his swoop and, unless the players are able to destroy the vehicle or have any means of following him, escapes. If the player-characters do manage to capture Maw, he refuses to answer any questions and only reveals information about his employer if the players use Force techniques or very intense interrogation methods. In the aftermath of Maw's attack, members of the Office of Peace and Security arrive at the scene and they take custody of Maw if he was captured, or leave in pursuit of him if he escaped. If the OPS do take custody of Maw, the player-characters can try to persuade the officers to let them have a few more minutes to question the bounty hunter before he is taken away."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}