{"url": "Cobb_Unser", "categories": ["Category:Legends articles", "Category:FarStar crewmembers and personnel", "Category:Humans", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Cobb Unser"}, {"tag": "p", "text": "Cobb Unser was a free trader pilot and member of the FarStar crew."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A young free trader, Cobb traveled with his sister, Corla. He was constantly in debt, and resorted to desperate measures to change their situation. Unfortunately, everything he tried slid him further and further into debt. Around 7 ABY, Cobb was fleeing from bounty hunters when he put down on Kal'Shebbol. His freighter was impounded when he couldn't pay the harsh starport tariffs set by Moff Kentor Sarne."}, {"tag": "p", "text": "Along with his sister, he settled in the starport and tried to earn enough money to get transport away from the planet. He found work fixing droids and starships, and Corla became a repulsorlift driver. A few weeks later, Corla disappeared. With the help of Loh'khar the Finder, Cobb found out that Sarne had become drawn to his sister when she made regular deliveries to his palace, and had sent her off on one of his small courier ships into the unknown expanse of the Kathol sector. Since then, his only goal was to find her someday."}, {"tag": "p", "text": "When the New Republic liberated Kal'Shebbol, Cobb joined the crew of the FarStar in an effort to track down his sister."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Sullen and pessimistic, Cobb was easily cowed by those of higher rank. In fact, even those beneath him could bully him into doing their bidding. He spent much of his time with the ship's droids, repairing them and talking to them as if they were his friends. He avoided the majority of the crew, but he did owe Loh'khar a favor for the information regarding his sister."}, {"tag": "p", "text": "Cobb tolerated the situation for only one reason: to find his sister, Corla. Even so, he still kept a wary eye out for bounty hunters and debt collectors who might have still been after him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}