{"url": "A_Sunny_Day_in_the_Void", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "A Sunny Day in the Void"}, {"tag": "p", "text": "\"A Sunny Day in the Void\" is the eleventh episode of the Star Wars: The Clone Wars television series' fifth season. It aired on December 8, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"After a comet damages their shuttle, R2-D2, Colonel Gascon, and the other droids crash on a desolate planet where they must make their way across a bewildering expanse of emptiness to carry out their mission.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While the D-Squad is on its way back to Coruscant, the astromech droids take the opportunity to try and repair their damaged comrade M5-BZ. Just as they succeed, a comet storm intercepts their course. WAC-47 manages to get their shuttle out of hyperspace before a collision can yield more catastrophic results, but the ship is nevertheless caught in the middle of the swarm and hit by several ice comets, which disable the power feed. Under the constant danger of getting hit and swept off into space by ice fragments, the astromechs manage to restore power at the very last instant, but another hit damages the ship critically and QT-KT nearly ends up lost in the void of space; only a combine effort by her droid comrades saves her from certain doom."}, {"tag": "p", "text": "With the ship being unable to continue its journey, the team is forced to crash-land on a nearby wasteland planet named Abafar. Meebur Gascon insists on waiting near the ship, but R2-D2, who has taken possession of the encryption module, takes matters into his own hands and rolls off into the wasteland to conclude the mission. He is promptly joined by his droid comrades and, finally, Gascon himself, who does not want to lose his prestige of being the one who made this mission a success."}, {"tag": "p", "text": "As the group travels across the featureless waste, Gascon once again begins to lose his temper and claims himself better due to his training and supposed mental flexibility while the droids \"merely\" act on their programming. WAC, however, manages to point out the flaws in Gascon's reasoning, and a chance encounter with another shipwreck and the dead remnants of its crew tears the last shred of resolve from Gascon. In his desperation, he begins to lose his mind, and when as a result WAC impertinently announces himself the new leader of the group, he finds himself overruled and abandoned by the others."}, {"tag": "p", "text": "While remaining with the Colonel, it is ironically WAC's single-mindedness in going ahead no matter what which revives Gascon's will to live. But then they are surprised to discover that Afabar is not completely lifeless when a whole herd of strange, rat-like creatures comes stampeding across the plain. Trusting the creatures' survival instincts, Gascon makes himself and WAC hitch a ride on their backs, and indeed the creatures take them to a waterhole and a nearby city sunken into the surface of the planet, where to their surprise they find the rest of the D-Squad already present. With WAC having proven himself so much alike him, Gascon field-promotes the delighted droid to Corporal, while the astromechs are left a bit baffled at this new development."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The episode was first mentioned as \"The Void\" at Celebration VI by Series Director Dave Filoni. Some aspects of the episode were based on the work of the comic artist Mœbius. The episode was pitched to the The Clone Wars story team by George Lucas, who thought of a story set in an environment akin to the white room in his 1971 film THX 1138 of droids questioning whether they were real. Dave Filoni drew images of bleak landscapes during the meeting, and thought that the idea was bizarre."}, {"tag": "p", "text": "\"A Sunny Day in the Void\" was originally reported by Star Wars Insider 137 as the tenth episode of Season Five, but the reported order was revised following the magazine's publication."}, {"tag": "p", "text": "This was the second episode (the first being \"Secret Weapons\") to feature a light blue opening logo, which serves as a salute to R2-D2. The following two episodes (\"Missing in Action\" and \"Point of No Return\"), which are also parts of the arc, also feature this logo. However, it is not the first time the logo changes color. In Season 4's last two episodes (\"Brothers\" and \"Revenge\"), the logo was painted red, for the return of Darth Maul."}, {"tag": "p", "text": "In an interview featured on The Star Wars Show, George Lucas said the episode's arc was his favorite of The Clone Wars."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}