{"url": "Code_of_the_Sith/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Stub", "Category:Religious codes and documents", "Category:Sith culture", "Category:Sith books and documents"], "nodes": [{"tag": "h1", "text": "Code of the Sith"}, {"tag": "p", "text": "The Code of the Sith, known as Qotsisajak in Sith, was the mantra that reinforced the core beliefs of the Sith Order. It was considered the dark side counterpart to the Jedi Code, and was first authored on the planet Korriban in 6900 BBY by the Jedi heretic Sorzus Syn. The code remained remarkably unchanged through the millennia, as the Sith Lord Darth Bane still taught the words of Sorzus Syn when he began rebuilding the Sith Order around 1000 BBY, after the Seventh Battle of Ruusan."}, {"tag": "h2", "text": "The Sith Code"}, {"tag": "p", "text": "The Sith Code, as written by Sorzus Syn and taught by Darth Bane:"}, {"tag": "p", "text": "There also existed a version of the code in Sith, known as Qotsisajak—literally \"Way of the Sith doctrine\":"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "According to the Human Qordis, founder and master of the Sith Academy on Korriban, the Code of the Sith served as the backbone of the Order since Jedi Exiles enslaved the red-skinned Sith Purebloods from the Horuset system. Indeed, the first recorded appearance of the Code dates back to the personal journal of Sorzus Syn, one of the fallen Jedi who set foot on Korriban in the year 6900 BBY."}, {"tag": "p", "text": "Syn had been impressed by the lifestyle of the Sith Purebloods, who would take all what they needed, kill the rest, and use everything to its fullest. Inspired by their example of brutal impulsiveness, Syn decided to write a pendant to the Jedi Code, a new mantra that was based on passion and the channeling of rage through anger. In her journal, Sorzus Syn stated that the Jedi beliefs only encouraged acceptance of one's limitations and passivity. The Sith Code was created so as to point to the \"failings\" of the Jedi Code, and it was meant to become a unifying mantra for the followers of the newly created Sith Empire."}, {"tag": "p", "text": "By 990 BBY, the Jedi Order knew of the Sith Code. In The Jedi Path: A Manual for Students of the Force, the Human Chief Librarian Restelly Quist wrote a chapter on Sith history, including a brief commentary on the Code of the Sith. According to Master Quist, the tenets of the Sith were self-centered and focused on individual needs and desires, while the Jedi defended the idea of achieving greatness through self-humbling."}, {"tag": "h2", "text": "Analysis of the Sith Code"}, {"tag": "p", "text": "Some have speculated that the Code of the Sith was created in direct contrast with the Jedi Code, to illustrate the fundamental philosophical differences between the orders. This could certainly account for the first line of the Sith Code discounting the Jedi's proclamation of peace, as well as the similar structure of the two Codes, although the Jedi claimed the Code spoke only of the Sith's individual wants and desires."}, {"tag": "h3", "text": "Peace is a lie, there is only passion"}, {"tag": "p", "text": "According to Yuthura Ban, a Twi'lek Sith practitioner who taught at the Korriban Academy, the \"peace\" of the Jedi, meaning the lack of conflict, was an agent of stagnation. Conflict, however, was seen as the source of progress for both the single beings and the civilizations. She also stated that the necessity of conflict was a law of the universe and not just a Sith thinking.\nFundamentally, the Code of the Sith expressed their rejection of selflessness and their full embrace of passion and lust. Although some individuals turned to the dark side out of a philosophical ideal or even wished to wield its violent powers for altruistic purposes, all Sith ended up prisoners of their own crave for power. The deeper nature of the Sith Order was a predatory one, a trait that Sorzus Syn had admired in the Sith Purebloods."}, {"tag": "h3", "text": "Through passion, I gain strength."}, {"tag": "p", "text": "The Sith saw themselves as seekers, challengers of old and stagnant ways, in touch with the laws of nature and the universe. They saw the Jedi as denying their natures and afraid of the truth around them. Yuthura Ban gave examples of the tuk'ata hunting prey, feeding on weaker creatures. Passions were what kept all creatures—from the most rudimentary to the most evolved sentient—alive. Yuthura Ban explained this to the amnesiac Revan, \"To think us creatures beyond the need of simple passions is a delusion.\" They believed that mastery of their passions gave them strength the Jedi lacked."}, {"tag": "h3", "text": "Through strength, I gain power"}, {"tag": "h3", "text": "Through power, I gain victory"}, {"tag": "p", "text": "The Sith did not believe that victory by any means was desirable, but believed that unless victory proved your superiority, it was an illusion and temporary. Though there might be different types of victories—peaceful victory, victory by sacrifice, even a truce—Sith dogma taught that unless the victory was achieved by demonstrating that one's power was superior, it was not true victory. The stronger a Sith became in the Force, the more power he could achieve, but he always had to fight for that power."}, {"tag": "h3", "text": "Through victory, my chains are broken"}, {"tag": "p", "text": "The true meaning of the line \"…my chains are broken\" was a subject of argument among many Sith. According to Yuthura Ban, the chains represented a being's restrictions; not just a Sith but any being in the universe. The restrictions could be those placed upon a being by someone else, or restrictions that one placed upon oneself. The ultimate goal of any Sith was to free himself from such restrictions, but not in the simplistic meaning of just being able to do whatever he wanted. The Sith desired to free themselves in order to reach perfection and fulfill their potential. They wanted perfect strength, perfect power, and perfect destiny, which, in turn, allowed one to do whatever they wanted for the most part. The person who had these abilities was known as the Sith'ari."}, {"tag": "p", "text": "The Sith'ari was supposed to destroy the Sith and then make them stronger than ever. This caused many Sith to treat perfection as a goal to work towards rather than a strict state of being, and in that way they were very like the Jedi. General historical consensus has considered Darth Bane to be the Sith'ari. Indeed, Bane destroyed the Sith using the thought bomb at the Seventh Battle of Ruusan in 1000 BBY and rebuilt it under the Rule of Two, which would ultimately lead to Sith domination of the galaxy in the form of Palpatine's Galactic Empire."}, {"tag": "h3", "text": "The Force shall free me."}, {"tag": "p", "text": "The Sith believed that those who strove for perfection through knowledge and mastery of the Force would be rewarded. The Sith also believed that those who followed their code were free of the mundane restrictions of others, that they strove for a greater purpose and thus threw off the restrictions normally placed upon individuals by society and other organizations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Code of the Sith was created by David Gaider, who wrote the Korriban segment of the 2003 video game Star Wars: Knights of the Old Republic. Initially, Gaider had asked Lucasfilm whether the Sith had a written creed like the Jedi did. When he was told to write one specifically for the game, Gaider reversed the existing Jedi Code and complemented it with a Sith philosophy partly inspired by Mein Kampf, the infamous autobiographical manifesto written by the Nazi leader Adolf Hitler."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}