{"url": "A_Test_of_Strength", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "A Test of Strength"}, {"tag": "p", "text": "\"A Test of Strength\" is the seventh episode of the Star Wars: The Clone Wars television series' fifth season. It aired on November 10, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"As the younglings return from Ilum with Ahsoka, their ship comes under attack by Hondo's gang of pirates. The children must use ingenious and improvised traps to thwart the brigands.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the younglings' successful test on Ilum, Ahsoka Tano prepares to escort them back to the Jedi Temple on Coruscant. In the meantime, as part of their journey, the younglings are to be instructed in the proper construction of their lightsabers under the expert tutelage of the Jedi's prime lightsaber designer and engineer, Huyang. Huyang comments on how Gungi is a Wookiee, and how it is rare for members of his species to join the Jedi Order, then wastes no time introducing the younglings into the basics of determining the styling of their individual lightsabers. Ganodi doubts him due to him being a droid, but Huyang gives them the necessary instructions to assemble their lightsabers from the parts he provides."}, {"tag": "p", "text": "Unfortunately, the Jedi training cruiser is intercepted by Hondo Ohnaka and his pirate band, who seek to convert the younglings' crystals into easy profit on the black market. They attack the ship, disabling its engines before R2-D2 can effect an escape, then board it in order to corral the younglings and gather their prize. As they come aboard, Huyang asks the younglings to surrender their crystals for safekeeping, and all do, except for Petro, who pretends to drop his crystal into Huyang's canister, but actually holds onto it."}, {"tag": "p", "text": "Just before the pirates can find them, Ahsoka manages to evacuate the younglings and Huyang into the ship's ventilation systems. Temporarily safe, Ahsoka sends Zatt and Ganodi to join Artoo in securing the cockpit, while Huyang and the other younglings are to lock themselves inside the hold. Ahsoka first intends to reroute power to the engines, whereupon they will be able to rip loose of the pirates' boarding tube connecting the two vessels, thus blowing the intruders out into space. While Ahsoka, Zatt and Ganodi manage to achieve their respective targets, Huyang and the other younglings are smoked out of the ventilation system and cornered by the pirates. Petro slyly uses his crystal and his lightsaber, which he assembled with an inverted emitter matrix, and cons one of the pirates to activate it, causing it to explode and stun them."}, {"tag": "p", "text": "Following this, the younglings decide to slow the pirates by employing their lightsaber training drones as part of a cunning trap. They manage to kill two pirates this way, but just before the safety of the hold, they run into Ohnaka himself. Alerted by Zatt and Ganodi, Ahsoka arrives just in the nick of time to engage the pirates in a duel, allowing the younglings and a damaged Huyang to escape to safety. While still outside the safety of the hold, Ahsoka instructs Zatt to execute the last part of the plan, and as the Jedi cruiser rips loose, the docking tube's sealing is broken and pulled out of the ship, managing to grab onto their own ship. But just as Ahsoka closes the outside hatch, a straggler pirate knocks her into the tube as well. As a result, she ends up becoming Ohnaka's prisoner. Holding her responsible for his defeat, Hondo intends to find a way to turn Ahsoka into profit, leaving the younglings alone to deliver this serious news to the Jedi High Council."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"A Test of Strength\" is the second episode in a four-part story arc, which was titled \"Young Jedi\" and previewed as a full-length 80-minute feature at Celebration VI in August 2012 to family viewers. It replaced \"The Rise of Clovis\", originally reported by Star Wars Insider 134, as the seventh episode in Season Five. Some of the ideas in this story came from a scrapped pilot script for a spin-off TV series."}, {"tag": "p", "text": "Petro's lightsaber move \"the Whirlwind of Destiny\" was created by Star Wars fan Brendon Lake, as an entry in Hasbro's \"Join the Jedi\" contest."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}