{"url": "Codia_system", "categories": ["Category:Legends articles", "Category:Freestanding subsectors star systems", "Category:Mid Rim star systems"], "nodes": [{"tag": "h1", "text": "Codia system"}, {"tag": "p", "text": "The Codia system was located in the freestanding subsectors of the Mid Rim. It contained the terrestrial, moss-covered natural satellite known as the Codian Moon."}, {"tag": "p", "text": "In several ranches on the Codian Moon, reeks, mammals native to the Hutt Space planet Ylesia, were bred—initially, as beasts of burden, and by 22 BBY, for use in gladiatorial arenas, such as the Petranaki arena on the Outer Rim Territories planet Geonosis."}, {"tag": "p", "text": "By 20 BBY, the Codian Moon remained undecided on its affiliation to one of the opposing factions of the Clone Wars, the Galactic Republic and the Confederacy of Independent Systems. The population of the Codia system numbered less than one million around 25 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 2003 reference book Inside the Worlds of Star Wars: Attack of the Clones by Simon Beecroft was the first of a series of sources that depict the Codia system, labeled as \"Codian Moon,\" on maps of the galaxy. In those maps, the Codian Moon was placed in the trailing direction from the world Cerea."}, {"tag": "p", "text": "In contrast, the 2006 book The New Essential Guide to Alien Species claimed that the Codian Moon was a natural satellite of Ylesia. That statement contradicted the prior map placement of the moon, with Ylesia being depicted on several maps as part of Hutt Space, on the opposite side of the galaxy. It also created a continuity problem due to the 1997 novel The Paradise Snare explicitly noting that Ylesia had no moons."}, {"tag": "p", "text": "The information from The New Essential Guide to Alien Species was definitively overridden by the 2009 reference book The Essential Atlas, which named the Codia system and placed it in grid square H-15, trailing from the Cerean system,—a placement that is in agreement with the information from the pre-2006 sources."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}