{"url": "Cody_Sunn-Childe", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Alliance Military members", "Category:Jashwik", "Category:Males", "Category:Mayors"], "nodes": [{"tag": "h1", "text": "Cody Sunn-Childe"}, {"tag": "p", "text": "Cody Sunn-Childe, a male Jashwik, was a hero of the Rebel cause who disappeared for many years after dedicating himself to a pacifist way of life. Sunn-Childe was one of Mon Mothma's early supporters. Over a decade after the first Galactic Empire was declared, Sunn-Childe called to arms and led a group of insurgents against the Empire, becoming the public face of the opposition for a time around 3 BBY. His public opposition and success against the Empire inspired many to follow in his footsteps, and gave hope to many more."}, {"tag": "p", "text": "According to an account Sunn-Childe gave to Lando Calrissian and Chewbacca, he was injured and fell into a large crevasse during a battle with Imperial forces on a newly-conquered planet. There, he was engulfed in an everlasting flame created by the native M'usts, though he survived, gaining the ability to make his dreams come to life. Eventually, Sunn-Childe left the M'usts and used his newfound abilities to build an ornate City of Dreams. He invited his former comrades to live a life of peace and harmony in an alternate dimension, where they waged a more personal war against the Empire. Soon after the Battle of Hoth, outsiders visited the City of Dreams for the first time, when Lando Calrissian and Chewbacca inadvertently created a rent in Sunn-Childe's dimension because of a hyperdrive malfunction; however, the Millennium Falcon had been followed by a fleet of Imperial Star Destroyers. Sunn-Childe was eventually forced to break his vows and conjure dream-beasts to fend off the Imperials, though he immediately changed his mind. Determined to maintain his philosophy of peace, Cody Sunn-Childe allowed the Star Destroyers to destroy his City of Dreams and kill its inhabitants."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Resistance fighter"}, {"tag": "p", "text": "Cody Sunn-Childe was a Jashwik from the planet Jashwa, a species of orange-skinned humanoids that were related to the Sullustans of Sullust. Sunn-Childe was a capitalist with business interests, and when he had the opportunity to purchase the Wheel, a space station in the Besh Gorgon system, he jumped at the chance. The previous administrator of the station, Dominic Raynor, pawned the station off to Sunn-Childe after falling into legal trouble, and Sunn-Childe became the station's fifth administrator. Sunn-Childe's administration coincided with the beginning of the Clone Wars, an intergalactic conflict between the Galactic Republic and the Confederacy of Independent Systems. Sunn-Childe was a Separatist sympathizer, but when the Republic prevailed in the conflict and transformed into the Galactic Empire, he continued to preside over the Wheel for a further two years. However, Sunn-Childe was forced to abandon the Wheel and his duties as administrator when Imperial troops began an aggressive nationalization of his space station. Although Sunn-Childe violently opposed the Imperial takeover, he was unsuccessful in repelling them. This Imperial takeover had been orchestrated by Senator Simon Greyshade of Columex, who made a backroom deal with the Empire to seize control of the Wheel. Sunn-Childe fled his station, and the Imperials supported Greyshade in becoming the next administrator."}, {"tag": "p", "text": "Many resistance groups had formed following the demise of the Republic, with the intention of combating what they viewed as an oppressive regime. The actions aboard his space station had made Sunn-Childe disillusioned with all galactic governments, and he resolved to join the growing resistance. During the formative years of the rebellion against the Empire, Sunn-Childe waged a violent resistance, and came into contact with Mon Mothma, one of the Rebellions notable leaders. At least three years before the Battle of Yavin, Sunn-Childe led one of the most violent resistances, who opposed the Empire with force, rather than peaceful idealism. Along with his right-hand-man, Ansible Beelyard—nicknamed the \"Holy Terror\"—and other rebellions such as Garm Bel Iblis's Corellian Resistance, Sunn-Childe became one of the most public and charismatic faces of the opposition to the Empire, and for a brief time he and his comrades were immensely successful. His success inspired many others, including Janu Godalhi of the Teth resistance, Earnst Kamiel of the Justice Action Network, and the Socorran businessman, Lando Calrissian. Despite his violent ways and vicious temper, Sunn-Childe was a much adored figure in anti-Imperial regions of the galaxy, earning the nickname, \"Enemy of the Empire\". He unofficially worked for Mon Mothma, one of the most prominent anti-Imperial figures, though his allegiance with her was secret. Despite inspiring countless other rebels, Sunn-Childe eventually abandoned his fight, believing that the struggle was hopeless. Abandoning his cause, he disappeared into parts unknown."}, {"tag": "h3", "text": "The City of Dreams"}, {"tag": "p", "text": "Cody Sunn-Childe gave the following account to Lando Calrissian and Chewbacca in 3 ABY: On a planet recently conquered by the Empire, Sunn-Childe was wounded while in battle against Imperial stormtroopers; a blaster shot sent him hurtling into a large crevasse, and he fell into the planet's bowels. His fall was broken by a mysterious flame surrounded by hordes of natives, the primitive M'usts. Sunn-Childe was not harmed by the flames; this awed the M'usts, who had never seen anyone survive immersion in the fire, which they considered a deity. The M'usts began to worship Sunn-Childe because of his survival but also because of his newly-discovered power, which allowed him to conjure objects out of thin air—Sunn-Childe theorized that it may have been the latent Force-sensitivity shared by his species, mingled with the flame-god itself, though he never fully understood or comprehended his power."}, {"tag": "p", "text": "Sunn-Childe decided to stay among the subterranean M'usts while he learned how to wield his new ability, though he ultimately learned a new way of life while living in the M'ust caves. The natives were a calm, peaceful species, who sought harmony; a stark contrast to Sunn-Childe's life-philosophy, which advocated action and violence. In time, however, Sunn-Childe learned from the M'usts, and when he finally decided to return to the surface, he was a changed man."}, {"tag": "p", "text": "He returned to the surface to find an abandoned world littered with the corpses of his former comrades; the Empire, as well as the few survivors, had left. Upon seeing the hundreds of dead bodies, Sunn-Childe realized that his power had increased drastically. While the power allowed him to create great things, he also knew that to allow himself to feel anger or to harm other beings would unleash the savagery hidden in the darkest part of his heart, creating hordes of vicious beasts, and he dedicated himself to a life of peace. His revolution would not be physical as his previous attempt had been, but rather a personal, secret one. Sunn-Childe's power allowed him to turn any of his dreams into reality, and the humanoid created a kingdom of dreams from \"psychic energy\"—the City of Dreams."}, {"tag": "p", "text": "Sunn-Childe called his old battle comrades—who had secretly continued their fight against the Empire in his absence—to join him, knowing that they would share in his vision. Members of a plethora of species—Wookiees, Gotals, and even droids among them—joined him, living a life that they felt showed what could be achieved when a being put his sword down. Sunn-Childe's dream universe was contained in a sort of pocket dimension, inaccessible to the outside galaxy. The City of Dreams was suspended in the air, covered over by a huge bubble and surrounded by wild forests. Sunn-Childe was constantly trying to keep his anger and other negative emotions at bay, because whenever he showed his other, violent side, vicious creatures were created from thin air. The only way to destroy them was to use his power to take them back into his body, further building up the anger he was attempting to suppress."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "In 3 ABY, soon after the Battle of Hoth, Lando Calrissian and Chewbacca of the Alliance to Restore the Republic arrived at the City of Dreams by accident after a hyperdrive malfunction. They set their starship, the Millennium Falcon, down in the jungles, but were attacked by its predators. After realizing that the first visitor in many years had arrived, Sunn-Childe and a team of his fellows entered the jungle to greet Calrissian. They chanced upon the two outsiders struggling with a wild beast, though Sunn-Childe was able to make the creatures disappear. Calrissian recognized him as Cody Sunn-Childe, who he had witnessed in action against the Empire as a boy. Sunn-Childe, however, was in no mood to speak of the past, and he invited Calrissian to the City of Dreams. He told Calrissian that he was welcome to stay for as long as he wished, so long as he did not violate the rules Sunn-Childe and Ansible Beelyard had put in place."}, {"tag": "p", "text": "Although awed by the City of Dreams, Calrissian was perplexed as to why such an outspoken enemy of the Empire was now living in such a place. Sunn-Childe told the Rebel his story, though Calrissian was not convinced; he hated Sunn-Childe for not using his power for a greater good and claimed that he was a coward. When Calrissian lashed out at Sunn-Childe, the jungle beasts attacked, but Sunn-Childe stopped them. Calrissian wanted to leave, upset that his childhood hero had become afraid to fight, but Sunn-Childe told him that if none set an alternative, peaceful example, then none would follow it. Calrissian asked Sunn-Childe what good his example was when millions were enslaved while he and his comrades lived in their secure city, which angered Sunn-Childe greatly and prompted a furious outburst. Calrissian sarcastically congratulated Sunn-Childe for showing his emotions, believing the freedom fighter he remembered might return, before making to leave. Ashamed at having lost his temper, Sunn-Childe let Calrissian return to the Millennium Falcon."}, {"tag": "p", "text": "The two later returned to their conversation again, though they were interrupted when a large blaster bolt almost killed Calrissian. In pursuit of the Millennium Falcon, a fleet of Imperial Star Destroyers led by Captain Plikk had discovered a tear in the dimensional fabric that led to the City of Dreams and attacked Sunn-Childe's home. Calrissian and Chewbacca departed in the Millennium Falcon to try to fend off the attack, though they had little hope for success—only Sunn-Childe and his powers could save the City of Dreams, though he refused to break his vow. Sunn-Childe was not entirely sure he had made the right decision, though; if he used his power to destroy Plikk's Star Destroyers he would be breaking his principles, but to allow Calrissian and Chewbacca to die would do the same."}, {"tag": "p", "text": "Despite the objections of his fellow city-dwellers, Sunn-Childe gave in to his anger and frustration and conjured huge dragon-like creatures, which attacked the Star Destroyers and allowed Calrissian to escape back to the City of Dreams. Almost immediately, Sunn-Childe realized he had made the wrong choice and called off the creatures. For all his talk of \"shining examples,\" Sunn-Childe had been unable to uphold his principles in the face of adversity, and he decided that the only way to prove that his dream of peace was worth living for was to die for it. After consulting with his companions, he allowed the Star Destroyers to destroy his City of Dreams, taking him and everyone else with it."}, {"tag": "p", "text": "In destroying the city, the Star Destroyers expended all their power and were unable to return to their home dimension. Calrissian decided to leave them there to let them die as revenge for their actions against Cody Sunn-Childe and his City of Dreams. Additionally, when Calrissian liberated the Wheel from the Empire in 4 ABY, he refused to take administrative control, claiming that its liberation was a tribute to Sunn-Childe."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cody Sunn-Childe was initially a simple businessman with capitalist leanings, and a sympathy towards the cause of the Separatists in the Clone Wars. However, the dirty dealings of the Empire and the Senator Simon Greyshade caused him to become disillusioned with galactic governments and caused him to embark upon a violent crusade against the reigning Galactic Empire. During his time as an insurgent against the Empire, Sunn-Childe was a being of action, and while many other anti-Imperials, such as Mon Mothma and Bail Organa, were reluctant to begin a military rebellion themselves, he embraced and even enjoyed the idea of an armed resistance. He was known to have a vicious temper, and his violence shed much blood; unlike most of the leaders of the other rebellions against the Empire, he led from the front, commanding troops against Imperial forces. He abhorred the Empire, and was among the most radical of the leaders of the anti-Imperial front."}, {"tag": "p", "text": "However, after his time with the M'usts, Sunn-Childe became a pacifist, determined never to harm another living being again. He stuck strictly to his principles and only gave into his anger after Calrissian insulted him. Calrissian's words about how his peaceful example meant nothing while slaves suffered all over the galaxy deeply affected Sunn-Childe, though, and they brought about a moment of doubt in which he had his magical creatures attack the Imperial forces. In the end, however, Sunn-Childe cared more for his principles than his life and allowed himself to be killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cody Sunn-Childe was created by J. M. DeMatteis for Star Wars 46, published by Marvel Comics in 1981. He was drawn by Carmine Infantino, Tom Palmer, and Glynis Wein. The character was named after the writer's son, Cody. DeMatteis was unhappy with changes made to the story by Lucasfilm Ltd., deciding to use the pseudonym \"Wally Lombego.\""}, {"tag": "p", "text": "Sunn-Childe went unmentioned until Daniel Wallace's The New Essential Guide to Characters briefly mentioned him in 2002, and Wallace again mentioned Sunn-Childe in passing in The New Essential Chronology in 2005. He was also mentioned in Janu Godalhi's Databank entry, written by Adrick Tolliver, \"gohan316427\", and \"General Tarfful\", as part of StarWars.com's What's The Story? feature. Sunn-Childe's latest appearance was in the Star Wars Blog article Viva Space Vegas! The History of the Marvelous Wheel, which gave background information on Sunn-Childe before he had become a rebel."}, {"tag": "p", "text": "There is a slight timeline discrepancy between The Dreams of Cody Sunn-Childe and the New Essential Chronology. The Dreams of Cody Sunn-Childe states that Sunn-Childe lived in the City of Dreams for over a decade, though the New Essential Chronology puts his disappearance around 3 BBY, to fit with the changes made to the timeline of the Empire in the Prequel trilogy. The New Essential Chronology and New Essential Guide to Characters also misspell his name as \"Cody Sun-Childe.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}