{"url": "Cohden_K%27Reye", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Gamblers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Cohden K'Reye"}, {"tag": "p", "text": "Cohden K'Reye was an infamous, loudmouthed Corellian gambler. He was well-traveled and knew several stories and secrets connected to establishments like Bantha Traxx and Exovar's Emporium."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cohden K'Reye was a world galactic traveler and had spent time in bars all across the galaxy. Sometime around 0 BBY he offered to give would-be adventurers the heads up about some of the galaxies most wretched hives of scum and villainy for 20 credits."}, {"tag": "p", "text": "K'Reye had gambled at the infamous casino The Ace of Sabres, he had traded at the elusive Exovar's Emporium and he had gambled on the fights in the Dool Arena at the Broken Tusk. The loud mouthed Corellian had made deals with Yin Vocta at the Bantha Traxx and he had seen Blizz Pinnix race on his remarkable swoop the Black Raptor. He had partied at the Glow Dome and was clever enough to realize the dangers at Starlyte Station. In the end he put together his thoughts and stories into a travelog that he sold around the galaxy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "K'Reye was loud, cocky, and brimming with confidence. A typical Corellian he was not afraid to speak his mind. He was skeptical about the Force and put his faith into more tangible items. He could talk at length about almost any topic and seemed to have a story about almost everyone."}, {"tag": "p", "text": "K'Reye would use his uncle's advice as the basis for his own wisdom imparted to fellow adventurers."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Despite his loud mouth and brash attitude, K'Reye was a keen observer and had a good eye at figuring out what exactly was going on behind the scenes. For someone uninvolved he had tremendous knowledge of numerous criminal organizations and was willing to share that information, for a price."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cohden K'Reye was designed by Paul Danner and Bill Smith for Wretched Hives of Scum & Villainy, a supplement for the Star Wars Roleplaying Game that was published by West End Games in 1997. He was illustrated by Joey Robinson throughout the book. K'Reye was created to be the narrator for the RPG supplement and there were numerous segments where he would appear in a sidebar to provide additional information and provide adventure plot hooks."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}