{"url": "Col_Serra", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Army officers", "Category:Cyborgs", "Category:Humans", "Category:Males", "Category:Pilots", "Category:Renegade Squadron personnel", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Col Serra"}, {"tag": "p", "text": "Col Serra, a Human male, was a smuggler who operated during the Galactic Civil War and was an old friend of another smuggler, Han Solo. After the Battle of Yavin, Serra was asked by Solo, who had joined the Rebel Alliance, to assemble a new unit of trained soldiers for the Rebellion. Serra scoured the galaxy, recruiting a ragtag bunch of scoundrels, pirates, bounty hunters, and other outlaws, forming Renegade Squadron in the process. Serra himself became the commander of the new unit. The Renegades first saw action during the evacuation of the Rebel base on Yavin 4, where they acted as a cover for the retreating Rebel troops, who fled from the invading forces of the Galactic Empire. During the battle, Serra was assisted by the Force-sensitive clone trooper X2, and the two of them managed to take down an Imperial-class Star Destroyer by destroying its reactor core. Following the evacuation, Serra and Renegade Squadron helped Commander Gial Ackbar to find a suitable location for a new Rebel base. Once it was established on the planet Boz Pity, though, the Rebels had to escape again, as the Empire had followed them to the planet."}, {"tag": "p", "text": "When the Alliance had finally settled on Hoth, Serra and Renegade Squadron began carrying out constant strikes against the Empire. They attacked an Imperial starship repair facility on Rori, and an Imperial weapons depot on Naboo. During the latter mission, Serra and his men uncovered evidence about a new Imperial superweapon, the superlaser-equipped Star Destroyer Conqueror. Serra and Renegade Squadron undertook a daring mission to the Mustafar system to destroy the Conqueror and successfully carried out their objective despite the intervention of the Dark Lord of the Sith Darth Vader himself. When the Empire finally discovered Echo Base on Hoth in 3 ABY, Serra and the Renegades once again assumed the role of a rearguard for the Rebel evacuation, planting explosives throughout the base and escaping in the last moment before its destruction."}, {"tag": "p", "text": "One year later, Serra's squadron played a crucial role in both the run-up to the Battle of Endor and the battle itself, during which they assisted Solo's strike team in destroying the shield generator bunker that projected the deflector shield protecting the second Imperial Death Star. On Endor, Serra once again teamed up with X2, and together they helped Rebel ground and space forces, sabotaging the Imperial communications network and taking down shields of enemy Star Destroyers. After the battle was won by the Alliance, Serra and his men disbanded Renegade Squadron, returning to their underworld activities. Many years later, Serra was located by the Jedi archivist Tionne, who was compiling a record on Renegade Squadron. Serra then told her about his and his squadron's role in the Rebellion's fight against the Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "From smuggler to Rebel"}, {"tag": "p", "text": "Col Serra was a Human male smuggler active during the Galactic Civil War, who was friends with fellow smuggler Han Solo. At some point in his life, Serra lost his left eye and replaced it with a cybernetic patch. In 0 ABY, Solo—now allied with the Rebel Alliance—asked Serra to recruit soldiers that did not need any additional training in order to strengthen the defenses of the Alliance base on Yavin 4, which was soon going to be attacked by the Galactic Empire in retaliation for the destruction of the Death Star superweapon by the Rebels. At the time, the Alliance was mostly made up of farmboys and dreamers, and the Rebellion needed a force of formidable fighters who knew military tactics and could follow orders without question. Serra accepted the mission and began searching the galaxy for the right mix of pirates, bounty hunters, and other renegades who would agree to fight for the Alliance. It turned out to be somewhat easy work, due to the abundance of individuals in the galaxy who hated the Empire. Unexpectedly for Serra, many of the recruits even brought their own stolen starfighters for the cause."}, {"tag": "p", "text": "Soon enough, Serra's task was complete, and he found the right amount of soldiers. Most of them were wanted men who had been on the run from bounty hunters and were used to keeping a low profile, so they made sure that there were no records of them in the Alliance archives. Serra then became the commander of Renegade Squadron—as the newly formed unit had been christened—and together with Solo, started to prepare them to fight against the Empire. Soon after the formation of the squadron, the Yavin base was invaded, forcing the Alliance to begin a full-scale evacuation. Renegade Squadron acted as a cover for the retreating forces and pushed the invading enemy back from the Alliance's main base temple, but one Imperial scout trooper infiltrated the temple and stole the Alliance communication codes. Renegade Squadron hunted down the trooper and returned the logs back to the temple. After destroying all databanks with sensitive information to prevent it from falling into enemy hands, the Renegades and Serra boarded their X-wing starfighters and joined the battle in space, where they engaged an Imperial-class Star Destroyer."}, {"tag": "p", "text": "The squadron could not handle the Star Destroyer by themselves, though, so Serra called in X2, a Force-sensitive clone trooper and the leader of Grey Squadron, and asked him for assistance. X2, who was still on the ground when Serra contacted him, soon joined the space battle in his X-wing. Serra told him to help Renegade Squadron take down the Star Destroyer's communications array, to prevent the ship from calling reinforcements. Once the array was destroyed, X2 and Serra landed their X-wings inside the Star Destroyer's hangar and fought their way through stormtroopers to the ship's reactor core. X2 destroyed the core and the two returned to their starfighters, successfully evacuating just as the Star Destroyer exploded, thus buying the necessary time for the Alliance to complete the evacuation."}, {"tag": "h3", "text": "On the run"}, {"tag": "p", "text": "After the retreat from the Yavin base, the Alliance was faced with a difficult challenge of finding a new central base to operate from. It was soon discovered, however, that before the planet Alderaan had been destroyed by the Death Star, the Rebel leader Bail Organa had encrypted a list of possible locations for a base into a holocron encased in phrik, a material strong enough to have survived the planet's destruction. To this end, an operation was organized to recover the holocron, with Solo given command of a Rebel fleet consisting of a Mon Calamari Star Cruiser, two EF76 Nebulon-B escort frigates and a Corellian corvette. Renegade Squadron pilots also participated in the attack and were stationed along with their starfighters aboard the Mon Calamari Cruiser. When Solo's fleet had reached the remains of Alderaan, however, they discovered an Imperial force there. Despite the presence of the Imperials and the sudden intervention of the bounty hunter Boba Fett, the Renegades were able to retrieve the holocron, and Serra transmitted its contents to the Rebel Commander Gial Ackbar, who was tasked with finding a new base."}, {"tag": "p", "text": "Serra was then ordered to go to Ord Mantell to rendezvous with Solo, where the latter was in the middle of repairs to his starship, the Millennium Falcon, after the damage it had sustained during the battle at Alderaan's remains. Ord Mantell was a backwater world with only a small Imperial garrison, so Serra and Renegade Squadron believed that they would be safe there and decided to have some rest. When Serra, Solo, and the Renegades were relaxing in a local cantina, however, bounty hunter IG-88 burst in, intent on collecting the bounty on them. A firefight ensued, and soon enough the entire Imperial garrison was after Serra and Renegade Squadron. The Renegades needed to get off-planet quickly before Imperial reinforcements arrived. Nevertheless, the Falcon still needed some repairs, so the Renegades, along with Solo's co-pilot Chewbacca, had to scour the nearby junkyard for spare parts. After finishing the repairs, defeating IG-88 in a shootout, and destroying an anti-aircraft turret, Serra and Renegade Squadron evacuated on the Falcon, just as Imperial Star Destroyers appeared above the planet."}, {"tag": "p", "text": "Still shaken after their disastrous vacation, Serra and Solo received more bad news from Alliance Command. While checking the sites listed in the holocron, Commander Ackbar had been captured by the Empire and was being transported to the prison world of Kessel. Many of Serra's friends from his smuggling days had been sent there, never to return again, so he was determined not to let the same happen to Ackbar, the Alliance's greatest tactician. A rescue operation was quickly set in motion, and the Rebel fleet attacked the Star Destroyer that was transporting Ackbar over Kessel. During the battle, Renegade Squadron used an LAAT to land in the Star Destroyer's hangar. They located Ackbar inside, escorted him to the LAAT, and flew back to the Rebel Mon Calamari Cruiser. Once in safety, Ackbar told his rescuers the story of his capture. He had been investigating the world of Boz Pity and had found it to be an ideal place for a new base. Deciding to visit other worlds on Organa's list, he took a group of scouts and droids to the planet of Saleucami. They never reached their destination, though, as their transport was attacked by Boba Fett, and those aboard were captured by the bounty hunter. Fett sold Ackbar to the Imperials and took the rest of Ackbar's crew to Tatooine to sell them to the Hutts."}, {"tag": "p", "text": "Not willing to abandon the scout team, Serra, Solo, and Renegade Squadron set off to Tatooine to rescue them. After landing in the planet's Mos Eisley spaceport, the Renegades, on Serra's advice, dispatched the Imperials stationed in the local Chalmun's Cantina. Inside the cantina, they found a Rodian, who told them that the prisoners were being held in a nearby shipyard and promised to show the way. Serra was initially distrustful as to the Rodian's information, but he agreed to follow him, as the Rodian was Renegade Squadron's only hope to find the prisoners. The squadron soon reached the shipyard, but found it sealed by a force field. After destroying force field generators scattered throughout Mos Eisley and clearing the shipyard of enemy troops, the Renegades found the prisoners kept in a small sealed cell inside the shipyard. Solo used his fusioncutter to break them out, and after destroying two AT-ST walkers, Renegade Squadron and the rescued prisoners evacuated on the Falcon."}, {"tag": "p", "text": "Rejoining with the rest of the Alliance forces, Serra and Renegade Squadron traveled to Boz Pity, where the Alliance established a new base. Only a few hours after that, however, an Imperial assault force attacked the base. It turned out that Fett had placed a tracking beacon onto an R5 droid that Renegade Squadron had rescued from Tatooine. The Rebels had to fight against a sizable Imperial force, complete with AT-AT walkers, but managed to stall the enemy thanks to a clever usage of particle cannon turrets and booby traps. While Renegade Squadron held their line, Solo and Chewbacca prepared the evacuation craft for takeoff. In the end, the Alliance was able to safely evacuate from Boz Pity. Eventually, Rebel Jedi-in-training Luke Skywalker discovered the remote ice planet of Hoth, which became the site of the new Rebel base for the next few years. Renegade Squadron used Hoth as their base of operations, continuously undertaking missions against the Empire, and forcing Emperor Palpatine to assign his elite storm commandos to hunt down the Renegades."}, {"tag": "h3", "text": "Later missions"}, {"tag": "p", "text": "In 1 ABY, a shipment of ryll headed for a Rebel medical facility went missing, and the Rebels dispatched several agents to find it. Some time later, Solo was assigned to go to Corellia to meet with one of the agents, Major Coret Bhan. Serra and a group of Rebels accompanied Solo to Corellia. While Serra and Solo were waiting for Bhan in a local cantina, the rest of the Rebels took position outside. Instead of Bhan, however, a mysterious smuggler soon appeared in the cantina. Offering Solo a drink, he started questioning him about the ryll shipment. Somehow, Serra discovered that the smuggler was in fact an agent of the Imperial Security Bureau who was also tracking the shipment and who had subdued Bhan on Tatooine. Serra approached Solo and warned his friend about the agent, while at the same time the remaining Rebels entered the cantina, their blasters drawn. A fight broke out, and the Imperial agent emerged victorious. He subdued Solo and the Rebels, but let them go immediately afterward. Unbeknownst to Solo, however, the agent had planted a homing beacon on him during the cantina fight, so when the shipment was finally located in the asteroid field Smuggler's Run, and Solo set off to retrieve it, the agent followed him and ambushed him while Solo, Chewbacca, and Solo's friend Lando Calrissian were loading the cargo into the Millennium Falcon. Solo managed to get away with only a few crates of ryll, while the rest of the cargo was claimed by the agent in favor of the Empire."}, {"tag": "p", "text": "Some time later, Serra led Renegade Squadron in an attack on an Imperial starship repair facility on Rori. Landing in an assault shuttle, the Renegades assaulted the facility, expecting to easily overwhelm the garrisoned troops. Serra and his men, however, were surprised to find a unit of storm commandos there, who were repairing their own starship at the time. The storm commandos put up a fierce resistance, forcing Serra and Renegade Squadron to fall back to their assault shuttle and retreat from the planet. Fortunately for Serra, the storm commandos' ship had not been repaired yet, so they could not pursue Renegade Squadron. With the Renegades off-planet, however, a secret Rebel outpost on Rori was left virtually defenseless. The storm commandos attacked it and found some valuable intel there concerning Rebel sympathizers among the Royal Naboo Security Forces."}, {"tag": "p", "text": "Renegade Squadron's next mission was to take out an Imperial weapons depot on Naboo. Before that, Serra personally contacted and recruited into his squadron a Rebel who had already managed to gain some reputation in the fight against the Empire. Once he joined the team, Renegade Squadron embarked on the mission. Reaching position near the depot, Serra and the new Renegade took a look around with electrobinoculars, only to find the place guarded by storm commandos led by Captain Sarkli, coincidentally the same commandos that Renegade Squadron had fought on Rori. Fully realizing the threat the storm commandos posed, Serra still decided to attack the depot. The Renegades managed to make it halfway to the depot building before the storm commandos spotted them, sounded an alarm, and started firing from the roof of the building. Serra and his men took cover and engaged Sarkli's troops, ultimately forcing them to escape into the wilderness."}, {"tag": "p", "text": "Inside the depot, the Renegades found a number of crates with weapons and ammunition and one crate filled with datafiles, which they decided to check. One of the datafiles showed an image of an Imperial-class Star Destroyer. Serra found nothing special with that, but the new recruit noticed a strange weapon at the Star Destroyer's bow. Serra then decided to collect all the files from the depot and let Rebel slicers take a look at them. Analyzing the data from the depot, the slicers soon found out that the Star Destroyer was equipped with a powerful superlaser, much like the one on the Death Star. The files also showed that the superlaser had been developed in a research facility on Naboo, and Serra picked it as the Renegades' next target, hoping to learn more about the Star Destroyer. Infiltrating the facility, Renegade Squadron proceeded to look for the main control room, but were soon confronted by Sith Acolyte Namman Cha, who was determined to keep the facility's secrets safe and attacked the Renegades. Cha fought ferociously, but Serra's men managed to overwhelm him with their superior numbers, and Cha retreated. Renegade Squadron then returned to their objective and soon found the main control room. The slicers downloaded all the data kept there, which revealed the Star Destroyer's name, the Conqueror, as well as its location—the Mustafar system."}, {"tag": "h3", "text": "One less superweapon"}, {"tag": "p", "text": "The data also showcased the Conqueror firing at an uninhabited planetoid in the Mustafar system as a test for the superlaser, obliterating the planet completely. Serra was shocked by the starship's firepower, and Renegade Squadron set off to Mustafar to destroy the vessel. There, the Renegades met with a Rebel intelligence officer, who told them that supply shuttles from the Conqueror landed on Mustafar once a day. With this information, Serra and Renegade Squadron decided to use a shuttle to infiltrate the Conqueror. They went to the shuttles' landing site and lay in wait. They soon witnessed the Director of Imperial Intelligence Ysanne Isard arriving at the site with a group of Blackguard Dark Jedi. Serra realized that the fact that Imperial Intelligence and the Blackguard were working together meant that the Conqueror project was very important to the Empire. Deciding to take Isard down before the shuttle arrived, Renegade Squadron attacked her. After a brief shootout, Isard retreated along with the Blackguard."}, {"tag": "p", "text": "Serra and Renegade Squadron then returned to their cover. When the shuttle arrived, the Renegades easily subdued its crew and put on their uniforms. Aboard the shuttle, Serra discovered that the Conqueror was captained by Victor Strang, a former storm commando. Having heard about Strang, Serra advised his men to prepare for heavy resistance. The shuttle soon landed in the Conqueror's landing bay. Renegade Squadron's Imperial uniforms provided the necessary distraction, and Serra's men were able to quickly dispatch the landing bay's guards. Shedding the stolen uniforms, Serra and Renegade Squadron proceeded to the ship's reactor core, but were stopped just before it by a set of blast doors. On Serra's command, his troopers planted some explosives on the doors, blowing them open, only to find Strang and a team of storm commandos waiting for them on the other side, already warned of Renegade Squadron's mission by Isard. The ensuing battle was fierce, but swift. Renegade Squadron used overlapping support fire, gaining an advantage and forcing Strang to retreat."}, {"tag": "p", "text": "Before the Renegades could pursue him, another blast door slammed shut behind Strang's back, and Serra commanded his troops to proceed with their original mission. Inside the reactor core room, Renegade Squadron's demolition experts set explosive charges on the reactor core, and the squadron made their way back to the landing bay. As they prepared to enter the shuttle that had brought them aboard, they were surprised to see the Dark Lord of the Sith Darth Vader emerging from it, escorted by a squad of elite stormtroopers. Vader was determined to ensure that the Conqueror would be delivered safely to the Emperor. Another battle began, and when Vader's men took cover behind one of the Lambda-class shuttles that were stationed in the landing bay, the Renegades fired missiles at it. The shuttle was destroyed, and Vader and his stormtroopers were temporarily stalled by the explosion. Serra and the Renegades were quick to use this pause to their advantage, boarding the supply shuttle and blasting off from the Conqueror. Explosions started to tear the Star Destroyer apart, but a TIE Advanced and an Incom gunship also managed to evacuate before there was nothing left of the Conqueror. Serra believed that Vader had been killed in the explosion, but the new Renegade correctly guessed that the TIE Advanced had been piloted by the Sith Lord. The trooper also believed that Strang might have escaped on the gunboat. Still, the Renegades' mission was a success, and the Conqueror was no longer a threat to the Alliance."}, {"tag": "h3", "text": "A bitter winter"}, {"tag": "p", "text": "In 3 ABY, the Empire discovered the Rebels' Echo Base on Hoth and launched a full-scale invasion. Renegade Squadron was once again chosen to act as a cover for the retreating Rebel troops. Having destroyed the base's shield generator, the Imperial forces entered the base. Receiving orders from General Carlist Rieekan, Serra directed his unit to the base's control room to destroy databanks with sensitive information to prevent it from falling to the Imperials. Meanwhile, Serra himself planted explosive charges throughout Echo Base. After Renegade Squadron destroyed the databanks, they set off timers on the explosives planted by Serra. The Renegades were then ordered to protect the crew of the Rebel ion cannon, which was used to clear the way for the retreating Rebel transports. Once the ion cannon crew evacuated, Serra and the Renegades proceeded to the extraction point as well, being the last squadron to evacuate from Hoth as the explosives detonated, destroying Echo Base and leaving the Empire with nothing but dust on their hands."}, {"tag": "p", "text": "While the ground battle came to a close, the fight in space above Hoth still continued, where the Rebel fleet consisting of a Mon Calamari cruiser and Nebulon-B frigates protected the last transport that had not evacuated yet. The Renegades escorted the transport, helping it to safely make a jump to hyperspace. Serra's squadron engaged the Empire's experimental TIE Defender as the rest of the fleet were preparing to make a hyperspace jump. Serra then ordered the Renegades to commandeer one of the TIE Defenders to study it. The Renegades completed their mission, and after defeating Darth Vader himself in his TIE Advanced, they fled from Hoth and regrouped with the rest of the Alliance forces. The defeat at Hoth, combined with the loss of Solo, who had been encased in carbonite and claimed by Fett, badly influenced the Rebels' morale. Nevertheless, the Renegades continued their service, participating in numerous battles and trying to show with their actions that there was still some hope for the Rebellion."}, {"tag": "p", "text": "A year after the Battle of Hoth, Solo was finally rescued by Skywalker and his friends. Additionally, it was discovered that the Empire was building a new Death Star in orbit of the forest moon of Endor. The Death Star, however, was protected by a defensive energy shield projected from the surface of the planet. Solo, now promoted to general, decided to lead a strike team to the surface of the planet by using the stolen Imperial shuttle Tydirium and take down the shield, allowing the Rebel fleet to destroy the Death Star. Before proceeding with the mission, though, the Rebels needed to learn more about the Imperial positions on Endor. When it was discovered that the Emperor was going to make a pilgrimage to the Sith tomb world of Korriban, a mission was organized to learn more about Endor's defenses from his personal shuttle. Every member of Renegade Squadron volunteered for the mission, which was described by Serra as \"crazy\" and \"foolhardy.\""}, {"tag": "p", "text": "The Renegades arrived on Korriban before Palpatine did and captured the Sith Academy and a Sith tomb. Serra then placed explosive charges on all three exits from the tomb, hoping to collapse them and trap Palpatine inside once he entered it. To lure the Emperor inside, the Renegades destroyed some Sith artifacts in the tomb. Enraged, Palpatine entered the tomb and was trapped there when the exits collapsed, allowing the Renegades to retrieve the data from his shuttle. The data showed that Palpatine was expected to soon visit the Death Star with an inspection. The Alliance decided to take their chances and destroy both the second Death Star and the Emperor with one single blow. To lure at least some of the Imperials away from Endor, a diversionary assault on the Imperial-controlled planet of Sullust was organized, and Renegade Squadron was assigned to carry out the mission."}, {"tag": "p", "text": "The Renegades were disappointed that they would not be present on Endor, but agreed to participate in the Sullust raid, realizing its importance. Arriving on the planet, Renegade Squadron captured the Imperial garrison building without any resistance, leading Serra to believe that something was not right. He then decided to contact Alliance Command to tell them about his thoughts. Serra's suspicions proved true—the Renegades had walked into a trap on Sullust. Soon, IG-88 appeared, who, as Serra suspected, had been hired by Vader because of the problems Renegade Squadron had caused to the latter on Hoth. Moreover, the Empire was using gravity well projectors to keep the Renegades stranded on Sullust. Renegade Squadron was able to defeat IG-88 in a fight once again, and they destroyed the generators, eventually securing Sullust."}, {"tag": "h3", "text": "The last battle"}, {"tag": "p", "text": "Serra's men then immediately traveled to Endor, arriving just in time to slip past the shield through an opening created for Solo's strike team. Renegade Squadron landed some way from Solo, and soon discovered that Solo had been pinned down near the shield generator bunker by the Imperial troops. To make matters worse, the entire Death Star affair was revealed to be a trap set by Palpatine, as the Death Star turned out to be operational and the Imperial fleet emerged at Endor to battle the Rebels. As the full-scale battle began, Renegade Squadron fought their way through Imperial troops on the surface, hoping to reach Solo's team and help him destroy the bunker. Serra himself opted to fly his X-wing to give his men air support. Serra then contacted X2, who also participated in the battle and was at the time defending Admiral Ackbar's flagship, Home One, from invading enemy forces. Serra requested that X2 assist Renegade Squadron on the surface. After securing Home One, X2 used an escape pod to reach Endor's surface. Serra then contacted X2 once again, telling him that several of the native Ewoks who had been helping Solo's team and Renegade Squadron had been captured by the Empire. After X2 rescued them, Serra decided to join him on the ground."}, {"tag": "p", "text": "When he began his landing run, however, his X-wing was shot down by a turbolaser battery, and Serra crashed the starfighter into a tree. He survived the crash and rendezvoused with X2, and together, they made their way into the bunker. They sabotaged the Imperial communications network, leaving Solo to destroy the bunker itself. Soon enough, Solo's strike team and Renegade Squadron destroyed the bunker, lowering the Death Star's shield. This created an opportunity for Lando Calrissian—now also a Rebel general—to fly the Millennium Falcon into the Death Star's inner structure and destroy its reactor core, causing a chain reaction that destroyed the superweapon. Prior to the Death Star's destruction, Skywalker had turned Darth Vader to the light side of the Force, and Vader had killed Palpatine, though he had sacrificed his life in the process. Nevertheless, both the battle in space and on the ground continued. While Renegade Squadron mopped up the remnants of the Imperial Army, Serra and X2 made their way to an Imperial ion cannon, using it to disable the shields of two Star Destroyers in orbit, leaving them open for Ackbar's fleet to destroy."}, {"tag": "p", "text": "Meanwhile, two AT-ATs attacked the nearby Ewok village, and Serra told X2 to destroy them. X2 used a rocket launcher, targeting the AT-ATs' cranial section, ultimately taking down the vehicles. Renegade Squadron managed to deal with the rest of the enemy troops, and the battle was won by the Rebels. Following the Battle of Endor, Renegade Squadron decided to disband themselves, believing that the upstart New Republic needed heroes like Skywalker, Solo, and Calrissian, and not the ragtag bunch that was the Renegades. After disbanding the unit, its members, including Serra, returned to a life of crime."}, {"tag": "h3", "text": "Post-war"}, {"tag": "p", "text": "Many years later, Serra was contacted by the archivist of the Jedi Temple on Coruscant, Jedi Knight Tionne, via a hololink. She had found old, encrypted data about Renegade Squadron, but it did not reveal much. With much effort, she located Serra and asked him about Renegade Squadron. Believing that enough time had passed since the end of the Rebellion and that people deserved to know about Renegade Squadron, he went on to tell her about the squadron's exploits."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gruff and battle-weary, Serra was nevertheless a noble person. He had a very friendly relationship with Han Solo, responding to his request to form a new squadron without hesitation. He was cautious and attentive to details, not trusting the Rodian's information on Tatooine and suspecting a trap on Sullust after Renegade Squadron captured the garrison building too easily. While viewing the datafiles on Naboo, though, he failed to notice the strange weapon installed on the Star Destroyer's bow. He later believed that Renegade Squadron had killed Vader, not suspecting that the latter could have escaped on the TIE Advanced. Serra hated being constantly on the run from the Empire after the evacuation of Yavin and was relieved when the Rebel Alliance finally settled on Hoth and started striking back at the Empire. After the defeat at Hoth, Serra and his squadron tried their best to keep the Rebels' hopes up."}, {"tag": "p", "text": "Unlike Solo, who preferred not to shoot first when dealing with bounty hunters, Serra demonstrated the exact opposite attitude. Having survived many battles alongside Renegade Squadron, he came to trust his men completely and was willing to even entrust them with his life. In turn, Renegade Squadron and Serra's reputation was such that the elite storm commandos considered them a threat to be reckoned with. As a smuggler, Serra preferred to keep a low profile and did not talk about his shady business over an open hololink, believing that such an attitude had helped him to stay alive for so long. Serra had light skin and brown eyes. His brown hair had started graying by the time of the Renegade Squadron's creation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Col Serra was created for the video game Star Wars Battlefront: Renegade Squadron, developed by Rebellion Developments and released in 2007, exclusively on the PlayStation Portable. In the game, he served as the narrator of the campaign mode. In 2008, Serra was mentioned in Renegade Squadron's entry in The Complete Star Wars Encyclopedia, compiled by Stephen J. Sansweet and Pablo Hidalgo. In June of 2009, Serra was briefly featured in the dark side scenario campaign of Agents of Deception, an expansion set of the Star Wars Galaxies Trading Card Game. A card depicting Serra was also included in the set, though it mistakenly claimed that he commanded Rogue Squadron instead of Renegade Squadron. The mistake was later corrected in a subsequent patch. In November of the same year, Serra was featured in the PSP version of another Battlefront game, Star Wars Battlefront: Elite Squadron. This time, however, Serra acted as an NPC, appearing in two levels of the game. Finally, in 2010, Serra and Renegade Squadron received a major role in both the dark side and the light side scenario campaigns of another expansion set of the Star Wars Galaxies Trading Card Game, Threat of the Conqueror. This set included another card depicting Serra."}, {"tag": "p", "text": "Though clearly portrayed with a cybernetic replacement over his left eye in Renegade Squadron, Elite Squadron, and in Rebellion Developments' artwork, Serra is depicted with a simple patch on both of his Trading Card Game cards."}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "In Renegade Squadron, if the player does not pick a name for their profile, the name \"Col Serra\" will be assigned. When asked about this fact in the game's official development blog, the blog master Chris Baker replied that it can be interpreted that whatever character you play as in the game is Col Serra. This, however, contradicts the fact that the player's character receives orders from Serra throughout the whole game."}, {"tag": "p", "text": "During the planning stages for Renegade Squadron, the first designs of Serra depicted him as a burly Zabrak smuggler. The design was dropped because the producers thought that this design demonstrated obvious similarities in style with the movie Blade Runner, and because they believed that people would relate better to a Human character, rather than a Zabrak. The Human character also went through two more changes in appearance before the final look was decided. According to an early story outline, the name of Col Serra's squadron was originally Phantom Squadron, but this was changed to Renegade Squadron. Serra was also at first intended to be questioned by a brand new Jedi named Hes Jor-Sharu, not Tionne."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}