{"url": "Cold_assault_stormtrooper", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cold assault stormtrooper units", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Cold assault stormtrooper"}, {"tag": "p", "text": "Cold assault stormtroopers, also known more simply as snowtroopers, were Imperial stormtroopers trained to operate in arctic climates. Some snowtroopers were deployed under Death Squadron's Blizzard Force, as well as other arctic forces."}, {"tag": "p", "text": "The snowtroopers were the successors of the clone cold assault troopers and the Galactic Marines under Clone Commanders Keller and Bacara, respectively, during the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Snowtroopers were utilized on many different icy worlds, including the Imperial garrison on the planet Akuria II. Their most notable conquest was at the Battle of Hoth, where the Imperial Blizzard Force defeated the forces of the Alliance to Restore the Republic and overran Echo Base. The Rebel general in charge of Echo Base, Carlist Rieekan, later reflected that the snowtroopers just stepped right in to assault the base fully equipped, when the Rebel Alliance had had to spend months trying to prep their gear for the winter conditions on the planet."}, {"tag": "p", "text": "One of the first missions involving the snowtroopers was the surprise Imperial assault on the Rebel founders on Corellia. Darth Vader had tracked his Sith apprentice Galen Marek to the planet, in a secret plot to both capture the would-be founders of the rebellion and destroy Marek. Snowtroopers stormed the shelter atop the snowy mountain, quickly wiping out Rahm Kota's guards."}, {"tag": "p", "text": "A unit of 10 snowtroopers, called Baker Company, were deployed to Goratak III to recover an Imperial I2-CG droid before the Rebel Alliance could find it. The contingent was led by a bounty hunter named Feskitt Bobb."}, {"tag": "p", "text": "Later, in 13 ABY, a unit of snowtroopers fought for the Imperial Remnant on the planet Pallaxides against the New Republic."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Armor"}, {"tag": "p", "text": "Snowtrooper armor was well suited to the climate extremes of frozen worlds such as Hoth, Rhen Var, and Toola. Unlike other troopers, snowtroopers wore a white, rugged body glove, which provided camouflage, and provided thermal insulation from the cold. Over this was an eighteen-piece outer shell altered to include more powerful heating and personal environment units, and an airtight fabric oversuit for additional protection from the cold. To facilitate breathing in extremely cold or dangerous atmospheres, a breather hood enveloped the snowtrooper's faceplate and fed into the suit liner. Each trooper was equipped with terrain-grip boots, a standard utility belt containing high-tension wire, grappling hooks, ion flares, additional blaster ammunition, a survival kit, and ration packs. Their equipment was supplied by the company Garlostar."}, {"tag": "p", "text": "Their helmets had built-in polarized snow goggles. The breastplate worn by the snowtroopers was constructed of a plastoid composite armor. Near the center were all of the controls for the completely self-sufficient troopers' life-support systems. These included an external temperature monitor, power cell monitor, and the controls for the suit's heater. The troopers' backpacks housed the main heating unit, main power cell, communications unit, and a homing beacon. The pack also had the ability to work as a power source for other equipment. Snowtroopers could survive up to two weeks in even the harshest frozen environments on their internal suit power and supplies. They also wore white heated pants with pockets."}, {"tag": "p", "text": "They were among the few stormtrooper units who had rank insignia plaques on their armor while in the field, as most other stormtrooper units lacked rank insignia plaques and instead wore either distinctive markings or orange pauldrons identifying their rank while in the field, and instead only wore them if they were non-commissioned officers.[source?]"}, {"tag": "h3", "text": "Weaponry"}, {"tag": "p", "text": "Snowtroopers were armed with the standard-issue E-11 blaster rifles of stormtroopers, SE-14r light repeating blasters, two concussion grenades, and one fragmentation grenade. Elite snowtroopers were given the DLT-20A blaster rifle as a replacement for the E-11, and two stun grenades. Snowtroopers commonly employed E-Web heavy repeating blasters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Assault on Hoth, snowtroopers are divided into two categories as part of the game mechanics: light snowtroopers and heavy snowtroopers, the former operating on foot and the latter operating an E-Web heavy repeating blaster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}