{"url": "Cold_War", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles in need of major additions", "Category:Articles to be expanded", "Category:Cold War", "Category:Conflicts involving the First Order", "Category:Conflicts involving the New Republic", "Category:Conflicts involving the Resistance", "Category:Conflicts of the Colonies", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Expansion Region", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Cold War"}, {"tag": "p", "text": "The Cold War (29 ABY–34 ABY) was a five-year period of intense galactic geopolitical conflict between the New Republic and the First Order, a hermit state formed by remnants of the fallen Galactic Empire in the galaxy's Unknown Regions during the era of the New Republic. The Republic was clandestinely supported by the Resistance, a splinter cell of the New Republic Defense Force formed during the Cold War to operate independently of the New Republic Senate and Command in their monitoring of First Order activities."}, {"tag": "p", "text": "The informal term \"cold war\" was used because there was no direct, large-scale fighting between the two sides, only occasional minor skirmishes. The Resistance was formed by former Senator Leia Organa to act as a check on the First Order due to the New Republic not believing the First Order to be a credible threat to galactic peace. Skirmishes were more frequent between the Resistance and the First Order, and eventually led to open war after the First Order destroyed the New Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "At the end of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Supreme Chancellor Sheev Palpatine, who was in actuality the Dark Lord of the Sith Darth Sidious, reorganized the democratic Republic into the first Galactic Empire and declared himself the Galactic Emperor. The Emperor also declared the Jedi to be enemies of the state, and launched a campaign that nearly led to the Order's extinction. Eventually, conflict between the Empire and various rebel cells, which had united into a single military alliance, led to an all out war."}, {"tag": "p", "text": "The Empire suffered a critical defeat at the Battle of Endor at the hands of the Rebel Alliance with the deaths of the Emperor, his chief enforcer and apprentice Darth Vader, and the destruction of the Sith. The Rebel Alliance began to reform into the New Republic."}, {"tag": "h3", "text": "Fall of the Empire"}, {"tag": "p", "text": "The defeat of the Galactic Empire at the Battle of Jakku one year after the Battle of Endor, and the conclusion of the Galactic Civil War in 5 ABY marked what would prove to be the beginnings of decreased hostilities between the shattered superpower that was the Empire and the New Republic. Not long after, a conference was held on Chandrila between Grand Vizier Mas Amedda, during which the latter formally surrendered to the New Republic. The following Galactic Concordance sealed the Republic's victory over the Galactic Empire and began the process of the restoration of democracy to the galaxy. Although peace was formally declared, fighting between the new government and certain Imperial factions would continue for quite some time, until the hostilities would finally die out, with some warlords either suing for peace or escaping into deep space. Those Imperial officers who did not yield were then declared enemies of the state."}, {"tag": "p", "text": "Some elements of the Empire's leadership and military rejected the stipulations, and, while the violence did not resume, the New Republic and an organized remnant of the Galactic Empire became locked into a cold war. While this standoff was of certain significance, the rest of the Empire, while disjointed, did not cease to exist by any means. As per the conditions of the Galactic Concordance, the Imperial capital of Coruscant was ceded over to the New Republic, where a provisional government was established. Agreeing to the terms of the Concordance, all non-military officials and those officers who respected all conditions were granted pardons. Many Imperials within the higher echelons of the armed forces refused to immediately agree to the terms, and, in turn, they were branded as war criminals. Despite this, the empire was allowed to survive in the form of successor states that maintained full sovereignty over territories that did not fall under the New Republic's jurisdiction. With Coruscant no longer the seat of executive power for the Empire, Imperial leadership was forced reconstitute itself. As such the central Imperial government was officially dissolved, with some of its leaders going as far to leave the Empire altogether and joining the New Republic. Additionally, those territories that fell under the authority of these former Imperials were assimilated into the New Republic. Although some chose to do this, there were still those who remained loyal to the actual Imperial establishment, unlike their comrades who joined the restored Republic, those Imperials who sought independent sovereignty, and the aggressive hardliners who refused to acquiesce to the Concordance's stipulations."}, {"tag": "p", "text": "As patriotism and loyalty towards what remained of the true Empire did not die with its fragmentation, there were still dedicated Imperials, both civilian and military, who remained dedicated to its existence. The organized Imperial Navy and constituents the Empire's war machine were still very much consolidated, as not all forces had joined with warlords or the hardliners who had retreated and partitioned themselves in regions outside of the New Republic's influence. As the Empire was simply too vast to disband altogether, a conditional accord was decided upon between the New Republic and the Galactic Empire in regards to what would finally become of the latter's foundational aggregation and the powers that it still held. The agreement called for a conditional restructuring of the Empire, allowing it to persist as an official and self-governed entity, but ensuring limitations on its ability to wage war. Imperial borders were redrawn and a successor state was formed by what remained of the old Imperial establishment, and, as per the terms of the Galactic Concordance, the new government that would ultimately agree to the stipulations. At the command of the New Republic, the remnant leaders ordered that all fleets that were still loyal to the Empire be recalled to the Core and Inner Rim. although Empire remained a divided force, with the remnant factions that went rogue refusing to acknowledge the order, now standing as a hawkish confederation locked into a cold war with the New Republic."}, {"tag": "p", "text": "Despite the reluctant agreement, a militarized faction of the Empire refused to admit defeat, as rest of the Empire in the Core Worlds and Inner Rim had. While these hardliners did not actively carry out any major military campaigns against the New Republic and vice versa, both powers remained hostile towards one another. Although the Old Empire was decentralized and divided into various official and recognized states that preserved the Imperial tradition in certain non-Republic sectors, the residual faction founded by those hardliners was considerable enough to be a cause of concern to the New Republic, thereby prolonging the cold war. Since resentments left over from the Galactic Civil War never truly went away, with those on both sides despising the other, the cold war between the non-compliant Imperial remnant and the New Republic would last for decades. As it wore on, the remnant began to retreat and then colonize the Unknown Regions of the Galaxy, where it would consolidate its power and initiate a rapid military buildup. During this period, political hardliners who opposed the Republic assumed leadership of the remnant and transitioned it into the First Order, a powerful military junta based upon the policies and principles of the \"Old Empire.\""}, {"tag": "h3", "text": "Republic Gridlock"}, {"tag": "p", "text": "By 28 ABY, infighting in the Republic's Galactic Senate between the Populists and Centrists factions had created a state of political gridlock. The Populists favored the status quo of strongly sovereign member worlds while the Centrists advocated a stronger central government and military, something associated with the \"Old Empire.\" These divisions prevented the New Republic from enforcing financial regulations and patrolling the hyperspace lanes, leading to a resurgence in crime syndicates like Rinnrivin Di's cartel."}, {"tag": "p", "text": "Rinnrivin Di's cartel was a recent group that was secretly funded by the First Order through the auspices of a paramilitary faction called the Amaxine warriors. Rinnrivin Di's cartel channeled the revenue derived from its smuggling and gambling activities back to the Amaxine warriors, who funneled them back to the First Order through a group of shadow corporations. These shadow corporations were owned by several Centrist senators such as Lady Carise Sindian, who worked as double agents for the Order. By 28 ABY, the cartel's activities had taken a heavy economic toll on the Gaulus sector, damaging the offworld trade of worlds such as Ryloth."}, {"tag": "p", "text": "At the request of the Ryloth's Ambassador Yendor, the Populist senator Leia Organa and the Centrist senator Ransolm Casterfo undertook a joint investigation into the syndicate's activities on Bastatha. After a botched kidnapping attempt by Rinnrivin Di, Leia and Casterfo discovered that Rinnrivin Di was secretly channeling Bastatha's gambling revenue to a group of shadow corporations based in the Outer Rim Territories. Their investigation coincided with Lady Carise's efforts to introduce legislation creating a powerful office called First Senator, that would command the New Republic's military and economy. This only inflamed political divisions in the Senate."}, {"tag": "p", "text": "Leia dispatched her senatorial staffer Greer Sonnel and starfighter pilot Joph Seastriker to Pamarthe to investigate how Rinnrivin Di was hiring pilots. There, they discovered that the Amaxine warriors operated from Daxam IV. Despite their political differences, Leia struck a friendship with the idealistic Senator Casterfo. In an attempt to hamper the senatorial investigation, Lady Carise secretly hired the Amaxine leader and former Imperial Arliz Hadrassian to bomb the New Republic senatorial complex. Despite the political uproar, Leia and Ransolm persisted with their investigation. On Daxam IV, Casterfo and Greer met Arliz and learned about the Amaxine warriors' illegal rearmament efforts. Casterfo managed to gain Hadrassian's trust by posing as an Imperial sympathizer and collector of Imperial artifacts."}, {"tag": "p", "text": "Leia also investigated Rinnrivin Di's operations and ascertained that the crime lord was not behind the \"Napkin Bombing.\" Meanwhile, Lady Carise inherited the Governorship of Birren and discovered evidence that Leia was the daughter of Darth Vader. Intending to drive a wedge between Casterfo and Leia, Lady Carise informed Casterfo about this incendiary information. Feeling betrayed, Casterfo upstaged Leia's candidacy for First Senator by revealing her true parentage. Due to the widespread hatred for Lord Vader for his role as the Emperor's executor, this revelation created a political scandal which destroyed Senator Organa's political career."}, {"tag": "p", "text": "Despite this setback, Leia persisted with her investigation into the Amaxine Warriors. She along with Greer, Joph, and C-3PO infiltrated the underwater city on Sibensko. There, they discovered evidence that Amaxines and a mysterious entity, later revealed to be the First Order, was funneling funds into Rinnrivin Di's syndicate. Following a brief skirmish with both Rinnrivin Di and the Amaxine Warriors, Leia and her companions escaped with the help of her husband, Han Solo. Despite obtaining the evidence, the Sibensko complex was destroyed when the Amaxine Warriors' munitions depot exploded when a downed starfighter crashed into it, effectively neutralizing the Amaxine Warriors and Rinnrivin Di."}, {"tag": "p", "text": "In the Galactic Senate, Senator Organa presented evidence about the Amaxine Warriors and Rinnrivin Di's syndicate and warned that the New Republic needed to be ready to face threats to its existence. A penitent Casterfo also came to her defense by presenting visual recordings of the Amaxine Warriors' military stockpile on Daxam IV. This angered Lady Carise, who fabricated evidence linking Casterfo to the Amaxine Warriors. Lady Carise also hired the Amaxine leader Hadrassian to assassinate Tai-Lin Garr. Due to Casterfo's purported links to the Amaxines, he was arrested for allegedly masterminding the Amaxine Warriors and arranging the assassination of Tai-Lin Garr. While most of the public accepted Casterfo's guilt, Senator Organa realized that Lady Carise was responsible for framing Casterfo and convinced the Elder Houses to strip her of all her royal titles. With the Senate unwilling to take external threats seriously, Senator Organa founded the Resistance, a private military outfit formed to defend the New Republic."}, {"tag": "h2", "text": "The cold war"}, {"tag": "h3", "text": "Uneasy peace"}, {"tag": "p", "text": "In 29 ABY, the Centrist systems formally seceded from the New Republic and joined the First Order, marking the public formation of the regime, though the First Order had originally been formed in the Unknown Regions. Over the years, an uneasy peace existed between the New Republic and the First Order. In defiance of the Galactic Concordance, the First Order began building up a military force and acquiring advanced weapons and starships. First Order forces also frequently crossed the Trans-Hydian Borderlands and launched several incursions into Republic space. Despite mounting reports of First Order re-militarization and aggression, the Galactic Senate and New Republic High Command refused to take forceful military action against the Order. The New Republic Defense Fleet was ordered not to seek engagement with First Order forces and to patrol Republic space."}, {"tag": "p", "text": "Military officers like Major Lonno Deso generally regarded the First Order as an ill-equipped, ill-funded group of loyalists that simply had a good propaganda arm, and even considered Organa and her allies scaremongering troublemakers trying to relive their glory days, believing that the First Order was remaining within their assigned borders and following the tenants of the concordance, and saw little cause for alarm."}, {"tag": "p", "text": "Sometime after the First Order made themselves known to the Republic, the New Republic starfighter commander Poe Dameron and his Rapier Squadron, while patrolling the Mirrin sector, responded to a distress call from the freighter Yissira Zyde above Suraz 4. The freighter was carrying a cargo of 46 high-powered charging arrays, which could be easily converted to military use. During the ensuing Suraz engagement, Rapier Squadron managed to shoot down several First Order starfighters but were unable to prevent the hijacked freighter from jumping into hyperspace. One pilot Muran was also killed during the dogfight. In response, Dameron reported the skirmish to Major Lonno Deso and advocated tracking down the ship and investigating why the First Order was interested in it. Deso, however, ordered Poe not to pursue the First Order, citing the New Republic Defense Force's purely defensive policies."}, {"tag": "p", "text": "Defying Major Deso's orders, Poe undertook an unsanctioned mission to track down the Yissira Zyde. Facing sanction from the Republic military for disobeying orders, Poe left the Republic Starfleet and joined the Resistance at the advice of General Leia Organa. Poe was also joined by his remaining Rapier pilots Karé Kun and Iolo Arana, who shared his sentiments. Later, General Organa obtained intelligence that the Hevurion senator Erudo Ro-Kiintor was secretly colluding with the First Order by sabotaging motions in the Galactic Senate. Lacking hard evidence, Leia dispatched Poe and his former Rapier Squadron colleagues on a covert mission to steal Ro-Kiintor's ship Hevurion Grace and obtain its computers. Despite opposition from the First Order, the Resistance pilots managed to steal the Hevurion Grace and expose Ro-Kiintor's collaboration with the First Order. In addition, Leia found information leading to her brother Luke and sent Poe on a quest to find Lor San Tekka."}, {"tag": "h3", "text": "The Resistance"}, {"tag": "p", "text": "Following the events of Operation: Sabre Strike, Poe Dameron was ordered by General Organa to form a small squadron of no more than four pilots and a technician. Dameron formed his Black Squadron, consisting of himself, Captains Karé Kun and Temmin Wexley, the Duros L'ulo L'ampar, Jessika Pava and the Abednedo technician Oddy Muva. Tracing Lor San Tekka's whereabouts, Black Squadron traveled to the planet Ovanis where he encountered the Crèche cult, who worshiped a large blue egg. The Crèche elder told Poe that Tekka had visited them a long time ago."}, {"tag": "p", "text": "However, the First Order learned of their presence on Ovanis and dispatched Agent Terex to recover the information that Dameron had obtained from Senator Ro-Kiintor. Black Squadron was subsequently caught up in a dogfight with First Order stormtroopers and TIE fighters. Amidst the fighting, the Crèche egg hatched and unleashed two large winged creatures that fought each other. Dameron gained the upper hand over Terex in a fight and managed to force the First Order Security Bureau agent to call off his forces. Unwilling to provoke a war between the First Order and the New Republic, Dameron reluctantly released Terex after the Crèche had departed with one of the creatures to find a new home. Continuing their search for Lor San Tekka, Dameron and Black Squadron bribed their way into Megalox prison on the high gravity world of Megalox Beta. They wanted to question Grakkus the Hutt, who had encountered Lor San Tekka a long time ago. However, the First Order learned of their presence and dispatch Terex to obtain the information first. Grakkus agreed to give the information but only to whoever broke him out first. Despite Terex convincing the local crime bosses Papa Toren, Kan Be, and Isin to recruit gangsters into storming Grakkus' fortress, Dameron managed to shut down the gravity field around Megalox with the help of BB-8 and the astromech droids."}, {"tag": "p", "text": "Donning gravity belts, Dameron and Black Squadron managed to rescue Grakkus and escape offworld. On the way, they stopped a vengeful Terex from attacking the prison's space station and shuttles with his starship Carrion Spike, which had once belonged to Grand Moff Wilhuff Tarkin. After returning to D'Qar, Grakkus provided the Resistance with information on Tekka's last known whereabouts. While Dameron wanted to resume the search for the explorer, General Organa instructed him to investigate how the First Order had learned of their trip to Megalox Beta."}, {"tag": "p", "text": "Later, the Squamatan Galaxy Beacon journalist Suralinda Javos discovered that the First Order was illegally building military installations, shipyards, weapons research facilities and a mysterious project in violation of the Galactic Concordance. She arranged to meet with Dameron on the Inner Rim gas giant of Pheryon for a meeting. She wanted Dameron to bring him to General Organa so that she could sell her the information in order to boost her journalistic career. However, Dameron and Javos were ambushed and captured by the First Order intelligence agent Lieutenant Weel and his stormtroopers. Javos was captured but managed to kill Weel and free Dameron. During the return journey, Javos experienced a change of heart and decided to join the Resistance. At the request of General Organa's spymaster C-3PO, Dameron along with BB-8 and the technician Oddy Muva embarked on a mission to Kaddak to retrieve a member of the Resistance spy droid network who had obtained information on the First Order including the location of Supreme Leader Snoke. Unknown to Poe, Oddy Muva was an unwilling spy who had been blackmailed by Terex into spying on the Resistance. Terex had taken Oddy's wife Sowa Chuan captive aboard his flagship Carrion Spike. Terex also returned to Kaddak and retook control of the Ranc gang. Against the orders of Captain Phasma, Terex embarked on a rogue mission to destroy Poe and the Resistance. His plan involved feeding the Resistance BX-series droid commando N1-ZX with false intelligence and following Poe's ship back to the Resistance base. Terex planned to use the Ranc gang to wipe out the Resistance, eliminating a major threat to the First Order. As planned, Dameron and his team recovered N1-ZX and escaped Kaddak. Oddy then embarked on a mission to rescue his wife and infiltrated the Carrion Spike. While traveling through hyperspace, Dameron rightfully suspected that Terex had planted the information and traveled instead to a remote desert planet."}, {"tag": "p", "text": "Terex and his Ranc pursued Poe's T-70 X-wing starfighter to the desert world. After crash-landing, Poe and the droids fled into the caves. Terex led a landing party while Oddy freed Sowa and the other slaves. Shortly, Poe's Black Squadron mates arrived and engaged in a dogfight with Terex's fleet of \"Uglies\". With Temmin's help, Poe managed to install Mister Bones's personality template into N1-ZX, who killed Terex's landing party before being disintegrated by Terex himself. In space, Black Squadron provided covering fire for Oddy and the slaves' escape pods. L'ulo L'ampar was killed during the dogfight. The tide of the battle soon turned in Black Squadron's favor when First Order forces under Commander Malarus arrived and wiped out Terex's Ranc gang fleet. Malarus had arrived to apprehend Terex for disobeying orders. With both sides seeking to avoid open warfare, Poe allowed Commander Malarus to arrest Terex."}, {"tag": "h3", "text": "A shattered peace"}, {"tag": "p", "text": "By 34 ABY, Dameron learned Lor San Tekka was living in the village of Tuanul on the planet of Jakku and went to meet with him. Lor San Tekka entrusted him with a piece of the map leading to Luke. However, the First Order tracked them to Jakku and dispatched several assault landers to the planet. The local villagers, who were members of the Church of the Force, made a valiant effort to fight off the attackers but were massacred by the First Order. Dameron gave the piece of the map to his droid BB-8, telling him to get as far as away from the village as possible and that Dameron would come back for him. After the villagers had been subdued, Kylo Ren arrived on the planet and had Lor San Tekka executed after he did not reveal the location of the map. Angered, Poe attempted to shoot Kylo Ren, but his laser was held off by Kylo Ren's use of the Force, and he was captured. Kylo Ren then ordered the massacre of all of the villagers, with the First Order stormtroopers firing on them and burning down their houses with flamethrowers; stormtrooper FN-2187 did not fire any shots, and he became disillusioned with the First Order. Dameron refused to give up any details under torture while aboard the Resurgent-class Star Destroyer Finalizer, but Kylo Ren eventually figured out that the map was in the droid. He dispatched some stormtroopers to Jakku to locate and capture the droid. Unbeknownst to both Dameron and the First Order, the droid had fallen into the hands of a scavenger named Rey."}, {"tag": "p", "text": "Eventually, Dameron escaped with the assistance of FN-2187, who told him that he was rescuing him because he was doing what was right. FN-2187's decision to aid Dameron was influenced by a moral dilemma he had encountered during an earlier First Order operation to put down a strike at Pressy's Tumble. FN-2187 assisted Dameron in reaching a TIE fighter, and they shot their way out of the hangar while also destroying the ventral cannons of the Finalizer. During this action, Dameron decided to call FN-2187 by a nickname, \"Finn,\" which he adopted as his name. They escaped to Jakku, but their TIE fighter crashed in two separate areas. The main body of the fighter crashed in a sinkhole, leading Finn to believe that Poe was dead. He wandered towards the nearest village, where Rey was fighting off some thugs who set out to steal the valuable droid BB-8 for their boss. BB-8 noticed that Finn was wearing Dameron's jacket, so he identified him as a thief, leading to Rey attacking him. However, Finn lied and told her that he was with the Resistance, and that the droid contained a piece of a map that needed to reach them. Just then, TIE fighters and stormtroopers arrived and began to attack. The two of them bypassed the old Millennium Falcon to reach another ship, but when that ship was destroyed, they entered the Falcon and tried to escape. Rey and Finn succeeded in destroying the pursuing TIE fighters and left the planet with BB-8, but before they could leave the system, they were sucked into the freighter Eravana by Han Solo and Chewbacca, former owners of the ship. The duo met Rey and Finn, and Han Solo was initially opposed to taking part in the conflict and helping them, but he later agreed."}, {"tag": "p", "text": "While aboard the Eravana, the quartet ran into trouble when the Kanjiklub and the Guavian Death Gang confronted Han Solo about his debts, and this led to a stand-off. Rey decided to close the blast doors to separate Han Solo from the two gangs, but she accidentally released three rathtars, giant monsters that had killed most of Han's crew when he captured them. Han, Chewbacca, Rey, Finn, and BB-8 narrowly escaped, with Finn almost being eaten by one. The four of them left the ship as the rathtars attacked the gangsters, but not before Bala-Tik reported Han Solo's escape to the First Order."}, {"tag": "p", "text": "Under Snoke's order, Hux prepared the Starkiller weapon to be fired against the Hosnian system in the Core Worlds, the capital of the New Republic. When the weapon was ready, Hux addressed the legions of stormtroopers under his command who assembled to witness the destructive firepower of the weapon. Hux promised that this day would be the end of the New Republic and ultimately, the Resistance, the culmination of everything the troops had worked towards. Hux then commanded that the weapon be fired, and massive beams of energy were fired across the galaxy towards the Hosnian system. When they arrived, the astronomical bodies of the system were destroyed, including Hosnian Prime."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "A First Order spy on the planet alerted the First Order to the presence of the droid, so Kylo Ren dispatched several stormtroopers and TIE fighters to the planet. They destroyed much of the castle and killed several people, and Maz Kanata decided to entrust Luke's lightsaber to Finn. Rey, Han, Chewbacca, and Finn fought against the stormtroopers until T-70 X-wing starfighters of the Resistance arrived and destroyed many starfighters. Rey was captured by the First Order, however, and the First Order took her back with them to Starkiller Base. Dameron reunited with Finn, embracing each other as friends. Kylo Ren decided that the droid was unimportant, as Rey had seen the map; he abandoned the search for the droid and interrogated her. However, she resisted his torture, and read his thoughts instead. Meanwhile, Han, Chewbacca, Finn, and Dameron all headed to the Resistance base on D'Qar to meet with General Organa for a counterattack against Starkiller Base, while Finn sought to rescue his friend."}, {"tag": "p", "text": "On D'Qar, Organa, Gial Ackbar, and other Resistance leaders were planning an attack on the Starkiller to prevent other systems from being destroyed. Finn made a special request to Organa, asking her to rescue Rey. She allowed Han, Chewbacca, and Finn to embark on this mission, which would also include destroying the shields so that the X-wings could destroy the base. The three of them were inserted onto the cold planet, and they captured Captain Phasma and forced her to shut down the shields. This allowed for the X-wings to begin their attack, and the trio set out to find Rey. They met up with her after she escaped, having used a mind trick to force a stormtrooper to let her escape with a weapon. They planted explosives in the base, but as they were about to leave, Han encountered Kylo Ren, Han seemingly convinced Kylo Ren to rejoin him, but Kylo Ren impaled him with his lightsaber, and Han fell into the abyss below. Chewbacca wounded Kylo Ren with a bowcaster shot, and he detonated his explosives after killing many stormtroopers. Chewbacca, Rey, and Finn made it out of the base, and Ren went after Rey and Finn. They dueled, with Rey being injured and Finn fighting Ren with Luke's old lightsaber; later, Finn was slashed on the back, forcing Rey to fight Ren. At the same time, the X-wings went in and destroyed the weak center of the base, leading to the base using its own abilities against itself as the planet quaked. General Hux was ordered by Snoke's hologram to get Kylo Ren and flee the base; Kylo Ren dueled Rey and failed to convince her to join the dark side. Rey slashed Kylo Ren and nearly killed him, but an earthquake separated them. Chewbacca arrived in the Falcon and rescued the injured Finn and Rey, and they left the planet with the X-wing squadron as the planet exploded."}, {"tag": "p", "text": "They returned to the base, with the happiness of victory being replaced by despair over Han's death. General Organa embraced Rey. Finn was taken to a medical center and regained a heartbeat, and R2-D2 woke up for the first time since Luke's disappearance to show an incomplete galactic map. BB-8 revealed the missing piece, pinpointing Luke's location to the Resistance; Rey, along with the mourning Chewbacca, set out with the Millennium Falcon to the location. She found Luke on an island on Ahch-To, an ocean planet that she had dreamed about, and she silently took out Luke's lightsaber and offered it to him, with Luke turning around and facing her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cold war was first indirectly mentioned in Moving Target: A Princess Leia Adventure, was formally mentioned in the 2015 reference book Star Wars: The Force Awakens: The Visual Dictionary, and made its first appearance in Star Wars: Episode VII The Force Awakens, where it transitions into open warfare between the First Order and the Resistance."}, {"tag": "p", "text": "The cold war was most likely named after the real-life conflict between the United States of America and the Soviet Union for geopolitical expansion, which lasted from 1947 to 1991."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}