{"url": "Cold_weather_assault_stormtrooper", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Cleanup", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Cold weather assault stormtrooper"}, {"tag": "p", "text": "Cold weather assault stormtroopers, commonly known as snowtroopers, were the elite stormtroopers of the Galactic Empire trained and equipped to operate in frigid environments."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Imperial cold weather assault stormtroopers were either direct descendants of the Clone cold assault trooper part of  the last batch of clones made under the Galactic Empire."}, {"tag": "p", "text": "Clone cold assault troopers and the 21st Nova Corps fought during the Clone Wars in frigid environments such as Orto Plutonia, Rhen Var, and Toola. Specialized types of snowtroopers included Snowtrooper Scouts, Heavy Snowtroopers, and Arctic Jumptroopers."}, {"tag": "p", "text": "Snowtroopers serving under Captain Magna Tolvan pursued the rogue archeologist Chelli Aphra at the Citadel of Rur."}, {"tag": "p", "text": "When the Empire located the Alliance to Restore the Republic's base on Hoth three years after the Battle of Yavin, the elite Blizzard Force, led by General Maximilian Veers, were involved in the Battle of Hoth that would later become a major Imperial victory and a major blow for the Rebel Alliance."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Snowtrooper armor was well insulated to protect against extreme cold, with a suit and heated breather mask powered by a battery pack that could last up to two standard weeks. For greater survivability, it also included ice boots, an insulated belt kama, polarized snow goggles, grappling hooks, ion flares, and a homing beacon. Snowtroopers were often equipped with E-11 blaster rifles and E-Web heavy repeating blaster cannons. Some could be trained to handle either flamethrowers or T-7 ion disruptor rifles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}