{"url": "A_Vader_Family_Sithmas", "categories": ["Category:Real-world articles", "Category:Future books", "Category:Darth Vader and Son"], "nodes": [{"tag": "h1", "text": "A Vader Family Sithmas"}, {"tag": "p", "text": "A Vader Family Sithmas is an upcoming non-canon young readers book set to be written by Jeffrey Brown and published by Chronicle Books on October 5, 2021. It was announced in February of that year on an installment of This Week! in Star Wars."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Celebrate Sithmas in style and good cheer with this sweetly funny holiday gift book from the New York Times bestselling author of Darth Vader and Son."}, {"tag": "p", "text": "Sithmas time is here, and the Vader family—little Luke, Leia, and the Dark Lord of the Sith—are busy trimming the tree, hanging their stockings, building stormtrooper snowmen, and listening for Santa's tauntons [sic] on the roof. This sweetly funny seasonal celebration sees Vader doing his best to raise his rebellious kids while running the galactic Empire [sic] and navigating holiday cheer (including the Imperial gift exchange). Featuring Force-wielding snowball fights, gingerbread Death Stars, sledding with Han Solo, and much more, this charming family album of festivity in Jeffrey Brown's now-classic New York Times bestselling Vader series is the stocking stuffer of the season for fans across the galaxy far, far away."}, {"tag": "p", "text": "CLASSIC HOLIDAY CHEER WITH A STAR WARS TWIST: Whether it's trimming the tree with Yoda or using the Force for a snowball fight, baking a gingerbread Death Star or sledding with Han Solo, this book is full of the spirit of the season."}, {"tag": "p", "text": "RETURN OF THE BELOVED SERIES: The next installment in Jeffrey Brown's bestselling series, Darth Vader and Son. Featuring the galaxy's first family and their friends in the delightful style you know and love."}, {"tag": "p", "text": "FESTIVE FUN FOR THE WHOLE FAMILY: Kids will love this sweet collection of holiday celebrations and adults will laugh along with the trials of running a galactic Empire AND making the season bright for the family."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "p", "text": "ISBN 9781797207735; October 5, 2021; Chronicle Books; US Hardcover"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}