{"url": "Colicoid_cargo_ship", "categories": ["Category:Legends articles", "Category:Cargo freighters", "Category:Container ships", "Category:Freighter classes", "Category:Transport classes", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Colicoid cargo ship"}, {"tag": "p", "text": "Colicoid cargo ships were massive, utilitarian ships built for ingenuity and practical uses rather than style. Their Colicoid designers, by compressing living space, made possible an ability to pack more cargo into their spaces than any other type of freighter transport or container ship in the galaxy. Although it blocked lighting, ceilings, too, were fitted with finely spun durasteel nets with which to suspend cargo boxes, while the overall effect created an atmosphere of claustrophobic gloom; needless to say, space for any other purpose which might be antithetical to the transport of freight was always at a premium."}, {"tag": "p", "text": "Even the Colicoid diplomatic ships were cargo ships pressed into service to assume a diplomatic function. As a result, luxury and beauty were best put out of mind for anyone seeking the ships' services who traveled aboard, for cabins and public areas were purposefully cramped and oddly shaped, mostly tucked into stray corners. At best, the ships' anti-aesthetic appearance could only be described as ugly."}, {"tag": "p", "text": "In 29 BBY, Jedi Master Obi-Wan Kenobi and his 13-year-old Padawan Anakin Skywalker, embarked on a mission to protect against attack by the slave raider Krayn one such Colicoid cargo vessel—which, by the nature of the Jedi duo's presence, meant that the freighter, piloted by Captain Anf Dec, had been pressed into service as a diplomatic barge. The two shared a cramped cabin with narrow sleep-couches."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Jedi Quest comic, Jude Watson's original Colicoid cargo-turned-diplomatic ship is shown instead to be a standard Republic Corellian Consular-class diplomatic cruiser."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}