{"url": "Colin_Higgins", "categories": ["Category:Real-world articles", "Category:Deceased actors", "Category:Star Wars: Episode IV A New Hope actors"], "nodes": [{"tag": "h1", "text": "Colin Higgins"}, {"tag": "p", "text": "Colin Higgins was a British actor who appeared briefly as Wedge Antilles in Star Wars: Episode IV A New Hope. While his character was never called by name during the Battle of Yavin briefing scene, the script and novelization identified him as Wedge Antilles, who was played by Denis Lawson in all other scenes. Because this inconsistency went unexplained for so long, the character who says, \"That's impossible, even for a computer,\" is sometimes nicknamed by fans as \"Fake Wedge.\""}, {"tag": "p", "text": "The fact that Denis Lawson did not play Wedge in the briefing scene sparked some discussion between fans who wanted to know who did. The speculation eventually revolved around two actors: Jack Klaff (who played John D) and Colin Higgins. It was thought by the majority of those concerned that Klaff was \"Fake Wedge.\" However, Pablo Hidalgo confirmed in 2004 that Colin Higgins was the actor in question when he released the information through the Homing Beacon email newsletter and then later in 2013 on his weblog."}, {"tag": "p", "text": "Colin Higgins made his first Star Wars-related appearance at Celebration IV, where he confirmed that he was, in fact, hired for the role of Wedge Antilles. According to his story, he had never worked on an American film before, resulting in several misunderstandings and mishaps. One of the biggest was his flubbing of his lines in the briefing scene. According to Higgins, his infamous line was actually supposed to be much longer, but he couldn't remember how it went. After wasting a lot of time trying to say it right, he ended up going with the shortened version quoted above. This and other things led to his being fired shortly after filming the scene. At this point, Denis Lawson was chosen to take his place, which is why Wedge Antilles is played by Lawson in all remaining scenes, as well as the following films."}, {"tag": "p", "text": "Higgins's other roles have mostly been on British television, including a role as \"Tak\" in an episode of Blake's 7 which helped Hidalgo identify him."}, {"tag": "p", "text": "Higgins passed away in December 2012. Five years after his death, his brief appearance as Wedge was retconned into a separate character, named Col Takbright."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}