{"url": "A_War_on_Two_Fronts", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "A War on Two Fronts"}, {"tag": "p", "text": "\"A War on Two Fronts\" is the second episode of the Star Wars: The Clone Wars television series' fifth season. Prior to its airing on Cartoon Network on October 6, 2012, it premiered on September 21 at a special screening for fans by Lucasfilm Ltd., held at the Letterman Digital Arts Center."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Anakin, Obi-Wan, Ahsoka, and Rex travel to Onderon, a world under Separatist control. There, they will train a group of insurgent rebels—including Lux Bonteri—to help take back the capital city of Iziz from the rule of a duplicitous king.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Contacted by the rebels of Onderon, whose ranks include Ahsoka Tano's friend Lux Bonteri, a native of that world, the Jedi High Council considers how to help them fight the Separatists. Anakin Skywalker's suggestion is to train the rebels in subversive combat tactics, thus splitting the Separatist forces' strength in a two-front confrontation. This proposal, however, is met with criticism by the Council, who fear that this would spawn the foundations of terrorism, and terror is a weapon the Jedi never wish to employ. Nevertheless, considering Anakin's arguments, the Council sees no other way of aiding the Onderonians, and so Anakin, Ahsoka, and Rex depart for Onderon, accompanied by Obi-Wan Kenobi, who wishes to keep Anakin's temper firmly on the ground in this endeavour."}, {"tag": "p", "text": "Following their dropoff into Onderon's wilderness, the group meets one of the rebel leaders, Steela Gerrera, and are taken to their base, where they also meet Saw Gerrera and Lux. The Jedi proceed to train the insurgents in effective combat techniques and teamwork. In the course of the training, a rivalry becomes apparent between Lux, who fights for the welfare of his homeworld, and Saw, who fancies himself the born leader of the rebellion. He considers Lux a weakling politician unfit for fighting and through the training Ahsoka becomes aware of this conflict. In addition, she becomes aware that Steela has a close personal interest in Lux."}, {"tag": "p", "text": "As it turns out, the Jedi dropoff did not go unnoticed, and the Separatist occupation forces send out three recon droids to investigate. After locating the rebel base, a battle droid detachment is sent out to destroy them. The droids burst into the middle of a meme shooting drill session, forcing the Jedi and the rebels to fight their first battle together, in which Lux and Saw succeed in taking out an enemy tank together. Following this victory, the Jedi and the rebels plan a covert assault on the droids stationed in the capital city, Iziz. Sneaking into the city, disguised as a group of hunters and foragers, they split up to secure vital supplies. When Anakin professes his pleasure at his suggestion in training the rebels, Obi-Wan answers with cautious enthusiasm, expressing himself with the term \"hopeful.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "\"A War on Two Fronts\" was initially reported by Star Wars Insider as the premiere episode, before the episode \"Revival\" took its place as the first episode of the season."}, {"tag": "p", "text": "\"A War on Two Fronts\" was produced prior to \"Revival,\" hence the appearance of Adi Gallia despite her death in \"Revival,\" which aired prior to \"A War on Two Fronts.\" The episode guide makes note of this error, along with the appearance of Yoda's older character model, though it speculates that it could be Stass Allie, Gallia's successor on the Jedi Council, who appears instead. It was later verified that \"Revival\" had to take place after \"A War on Two Fronts,\" given the appearance of the not-yet-destroyed Ohnaka Gang pirate post in \"Tipping Points.\" Later, it was confirmed by the online guide for the episode, \"A Necessary Bond,\" that \"Revival\" did indeed take place after \"A War on Two Fronts\" given that Hondo's base was destroyed by Grievous in \"A Necessary Bond\" as Hondo says in \"Revival.\" The matter was laid to rest with the home video release of Star Wars: The Clone Wars The Complete Season Five, in which \"A War on Two Fronts\" is the season premiere, and \"Revival\" is in its correct chronological placement as the thirteenth episode of the season."}, {"tag": "p", "text": "During the training of the insurgents, Anakin congratulated them saying: \"Impressive. Most impressive\", resembling his compliment to Luke after he eludes being carbon frozen during their fight in The Empire Strikes Back."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}