{"url": "Colla-Arphocc_Automata_versus_the_Galactic_Alliance", "categories": ["Category:Legends articles", "Category:Legal trials"], "nodes": [{"tag": "h1", "text": "Colla-Arphocc Automata versus the Galactic Alliance"}, {"tag": "p", "text": "Colla-Arphocc Automata versus the Galactic Alliance was a legal trial in 43 ABY that was brought by the Colicoid Creation Nest, and its sister company, Colla Designs, against the Galactic Federation of Free Alliances. The case was a major galactic event that caught the attention of key political, industrial, and criminal figures."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Preceding and through-out the Clone Wars the Colicoids were infamous for the creation of their deadly battle droids. At the end of the Clone Wars and the proclamation of the Galactic Empire, the Colicoids were ordered to disarm or face violent reprisals from Imperial forces. Fearing the Empire the Colicoid Creation Nest hid itself, but not before receiving documents signed by Emperor Palpatine stating that a ban on the production of battle droids was limited to a set period of time.\nBy 42 ABY the ban had allegedly expired and that the Colicoids could once again compete with other weapons manufacturers such as Roche and the Givin Cartel."}, {"tag": "p", "text": "The Colicoids, armed with the Imperial documents, hired a renowned attorney from Epica named Lestra Oxic who petitioned the Galactic Alliance courts starting the fair-trade case. Oxic worked hard finding discovery before the trial date and in the end found a star witness, a Colicoid who was a former member of a Colla Designs think tank. The judgment of the entire case hinged on the testimony of this one witness so much that Oxic had ordered men working under him to safeguard the Colicoid."}, {"tag": "p", "text": "Three lawyers were chosen to represent the Galactic Alliance and Chief of State Natasi Daala herself was said to have taken an interest in the case. Daala's anti-Colicoid views were widely know, however she was said too have been so preoccupied with other matters she had not had any dealings in the case."}, {"tag": "p", "text": "In the industrial world, Lando Calrissian, like the Chief of State, had taken interest in the case. His company, Tendrando Arms, was already facing competition from the Verpine, Mandalorians and Baktoid, the last thing Calrissian wanted was for the Colicoids to get back in the droid market."}, {"tag": "p", "text": "Of all the individuals who had taken an informal interest in the trial, criminal boss Rej Taunt had taken the greatest amount of action in the case. Early on Taunt had tasked his employees with the job of sabotaging the trial. His reason for the sabotage was he wanted revenge against the Colicoids for the deaths of his crew members from his personal ship, the Second Chance. His vendetta was also fueled by an incident involving buzz droids that ultimately ended with his sixty year incarceration and loss of the Second Chance. Searching for information on the Second Chance, formerly the Stellar Envoy, Tobb Jadak and Flitcher Poste had gone to Taunt for information on its whereabouts. Taunt had agreed to supply them with the information in exchange that they help him with his plot."}, {"tag": "h2", "text": "Trial"}, {"tag": "p", "text": "The trial was hosted on Holess and was presided over by Holessian Chief Justice Margo in the Mount of Justice. Before the trial the judges, lawyers, and jury members scaled the ramp of the Mount of Justice; it was at this point that Taunt's plot was executed. Jadak and Poste had commandeered the control room for the Mount's media screen that was to display the trial to the general public. As Oxic's assistant, Koi Quire, and star witness walked up to the entrance of the Mount of Justice, an image of a hueche appeared. Like all Colicoids the witness had a natural fear of hueche, so the witness curled up into a ball and ran from the image displayed. As the Colicoid fled, Taunt's men directed the fleeing Colicoid to the bottom of the Mount of Justice where a speeder truck was waiting with a containment sphere that was used to imprison the witness. After a minor debacle between the Holessian police the witness ended up securely in Taunt's hands and was exported off world."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the abduction Oxic requested one Holess day to to locate the witness. Oxic's theory was that his witness was abducted by the Galactic Alliance itself as a plot by Chief of State Daala to sabotage the case. With a lack of evidence to suggest Galactic Alliance involement Oxic decided he would make an appeal before a Coruscant criminal court rather than a Holess criminal court."}, {"tag": "p", "text": "Since Oxic was incapable of finding his witness the Holess Chief Justice dismissed the case and ruled that the Colicoids were responsible for all of the cost incurred during the trial. It was shortly after the verdict was proclaimed that Oxic had discovered that Rej Taunt was behind the kidnapping."}, {"tag": "h2", "text": "Appearances"}]}