{"url": "Collector", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Collectors", "Category:Occupations"], "nodes": [{"tag": "h1", "text": "Collector"}, {"tag": "p", "text": "A collector was any individual who assembled a group of items, primarily antiques or relics, as a hobby or occupation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Collectors assembled items such as antiques, relics or art as a hobby or occupation. While a collector was not necessarily wealthy, they often were. Truly wealthy and serious collectors were aware that it was a standard to show they had the necessary credits to pay before they were allowed to see the goods by merchants. Some derided those who spent large amounts on items they collected, considering these people to have more money than brains. Some collectors both bought and sold the object they sought out, such as the junk boss Unkar Plutt or Dok-Ondar's Den of Antiquities proprietor Dok-Ondar. Dok-Ondar, who was galaxy-renowned as a collector, chose the planet Batuu as the site of his Den of Antiquities. A collector's paradise, Traveler's Guide to Batuu author Eloc Throno considered it the finest shop of its kind in its region of the galaxy and a must-do stop for collectors and other curious individuals."}, {"tag": "p", "text": "There were written guides for collecting, such as the Antique Military Collector's Guide, which gave readers guidance on how to collect and how much their items of interest were worth."}, {"tag": "h2", "text": "Collectors in the galaxy"}, {"tag": "p", "text": "The Hutt Grakkus collected items related to the fallen Jedi Order, the pirate Maz Kanata had a vast collection of treasures kept in her castle, and anonymous collectors such as the \"Avenger of Jakku,\" \"Emperor's Wrath,\" and \"Interceptor Fire\" collected artifacts of the Galactic Empire following the Galactic Civil War."}, {"tag": "p", "text": "The Imperial Chiss Grand Admiral Mitth'raw'nuruodo was an avid collector of art, as both a personal hobby and as a means to understand his military enemies. Through studying the art he collected, Thrawn gained insight into the values and culture of other species and used those insights to predict how they would act. Karr Nuq Sin, a Force-sensitive teenager with the ability of psychometry, collected any items with a history that he believed could induce a vision, including military antiques and Jedi artifacts. In time, Nuq Sin narrowed his collecting to any objects relating to Jedi history, hoping to understand the Jedi and his own connection with the Force. During the same period, Trudgen, a member of the Knights of Ren, collected grim trophies from fallen conquests. He added these trophies to his weapons and armor as symbols of his triumphs. One such trophy was a fragment of the helmet of a death trooper defeated by Trudgen, which he attached to his own helmet."}, {"tag": "p", "text": "The Crimson Dawn crime lord Dryden Vos was a collector with a passion for antiquities. He used his power and resources to build a vast collection that included a near-complete set of Mandalorian rally master armor, a reconstructed Sith holocron, a traditional Noghri carver set and the mummified hand of the Lost King of Duro. Unlike most archaeologists, he disregarded the ethical regulations that prevented the taking of items sacred to other cultures. Vos displayed many rarities in his study on the Nau'ur-class yacht First Light, and rotated other items to be displayed from his storehouses on Cato Neimoidia, Byblos, and Taanab. Vos employed relic-hunters and well-paid buyers to risk their lives acquiring new prizes for his collection. Other items were given as gifts by those seeking to curry Vos' favor or forgiveness, although even the most priceless offerings did not guarantee his favor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}