{"url": "A_World_Between_Worlds", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "A World Between Worlds"}, {"tag": "p", "text": "\"A World Between Worlds\" is the thirteenth episode of the fourth season of the animated television series Star Wars Rebels. The episode premiered on February 26, 2018."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Now inside the Jedi Temple portal, Ezra finds himself in a place like no other."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Through the Gateway"}, {"tag": "p", "text": "During his journey through the portal of the Force wielders, Ezra hears the voices of Yoda, Obi-Wan Kenobi, Qui-Gon Jinn, Ahsoka Tano, and his late master Kanan Jarrus echoing through time. Once he comes through, he finds himself in the World Between Worlds, a mystical dimension of the Force that connects all of space and time. Here the voices continue to echo around him, flashbacks of past events and events yet to come."}, {"tag": "h3", "text": "Behind enemy lines"}, {"tag": "p", "text": "Back at the Imperial command center at the excavation camp outside the Lothal Jedi Temple, Minister Veris Hydan has Sabine Wren brought in for questioning, so that she may help him enter the Jedi Temple. He immediately recognizes her and tells Sabine that Grand Admiral Thrawn has spoken highly of her talents and has acquired a small collection of her works, to which she mockingly replies that she is both flattered and honored."}, {"tag": "p", "text": "When Hydan demands to know how she and Ezra managed to open the portal, Sabine quips that it's simply because \"she is smarter than him\". Hydan laughs and informs her that the Emperor now knows that Ezra has entered the portal. He muses that the journey must be difficult for Ezra now, seeing how he is without his master Kanan. Though saddened, Sabine in anger tells Hydan that he is merely a pawn, something Hydan is aware of and believes his power to simply be a reflection of the might of the Emperor."}, {"tag": "p", "text": "Sabine taunts Hydan, claiming that for all the power the Emperor has, he still managed to fail where both she and Ezra had succeeded. He smugly responds that Ezra is not safe beyond the veil and that it is only a matter of time before the Emperor finds him, that it is in Sabine's best interest to work with him if she wants any chance of saving Ezra. During their conversation, Sabine comes to the realization that the portal is not just a door into the Temple, with Hydan interjecting that it is a pathway into all time and that whoever controls it, controls the very universe itself."}, {"tag": "p", "text": "Back outside the temple, Hera Syndulla, Chopper, and Garazeb Orrelios continue to monitor the Imperial excavation site. Hera notes that the Imperials took Sabine into one of the buildings on the far side of the camp and worries for her safety. When Zeb asks if Ezra got inside the Temple, Hera admits that she doesn't know where he is and that he probably doesn't know either."}, {"tag": "h3", "text": "Saving Ahsoka Tano and enduring Hydan"}, {"tag": "p", "text": "While walking through the World Between Worlds, Ezra hears the past (in the voices of Qui-Gon Jinn, Anakin Skywalker, Yoda, The Father, and The Daughter), the present (in the voices of Jyn Erso, Chirrut Îmwe, and Kanan Jarrus), and the future (in the voices of Leia Organa, Maz Kanata, Finn, Rey, Poe Dameron, and Kylo Ren). Ezra tries to call out to Yoda and Kenobi as he walks across the bridge. Ezra then finds the convor hovering over a doorway and asks how he got there. The convor nods to the portal below."}, {"tag": "p", "text": "Ezra finds himself seeing the moment where his lost friend Ahsoka Tano fought Darth Vader so that Ezra, and his master Kanan could escape during their mission to Malachor. Tano is parrying her white lightsabers against Darth Vader's lightsaber. The convoy squeaks. As the duel continues, Ahsoka plunges her blades into the floor of the Malachor Sith Temple. Vader collapses into the hole just as Ezra pulls her to safety through the doorway."}, {"tag": "p", "text": "Back in the command center, Hydan tells Sabine that he found those paintings while he was exploring the former Jedi Temple on Coruscant. Sabine replies that she is still not interested. Hydan sees through her facade and turns his attention to the Mortis \"gods\", who he says featured prominently in Jedi history. Sabine says that they were archetypes. Hydan agrees and says they are also referred to as the Father, Son, and Daughter. He then asks if she notices anything different about their depiction on the Lothal Jedi Temple."}, {"tag": "p", "text": "Sabine feigns ignorance and Hydan warns her not to mistake his pleasant demeanor for weakness. He adds that the paintings have changed with the loth-wolves having moved away from the portal. Hydan also notices that the position of the Daughter's head and the Father's hand have changed since Ezra's arrival. Hydan asks Sabine about her perspective as a pair of death troopers enter the room. With little choice, Sabine tells him that the hands are a language. Hydan replies that he could not find any similarity between this and other languages. When he demands to know how she can read it, Sabine reiterates that she is smarter than him. Hydan responds that the Mandalorian in her only understands one form of discourse. At Hydan's signal, one of the death troopers strikes Sabine in the head with his blaster rifle. Hydan mockingly asks \"now where were we?\""}, {"tag": "h3", "text": "Reunion with Ahsoka Tano"}, {"tag": "p", "text": "The convor hoots as Ezra and Ahsoka awake. Ahsoka is surprised to see Ezra, who tells her that he saved her before Darth Vader could deliver the final blow. Tano then says Anakin and tells the convor, whom she calls Morai, that she is pleased to see her. Ahsoka says that she owes Morai her life and that she now owes her life to Ezra as well. Ahsoka asks Ezra how he got here and where Kanan is. Ezra responds that she has missed a lot. Meanwhile, Hera, Zeb, and Chopper infiltrate the Imperial camp. When Zeb asks what she is doing, Hera replies that these are mobile command centers. Zeb quips he likes where this is going and tells Chopper to keep an eye out for Ezra. Hera tells Zeb let's move. Chopper keeps watch over the excavation site."}, {"tag": "p", "text": "Back in the World Between Worlds, Ahsoka tells Ezra where they are, remarking that is ancient. Ezra likens it to the dream he experienced after Kanan died. Ahsoka explains to Ezra that Kanan's will was transferred into the Loth-wolf called Dume, and is still helping Ezra through that vessel. She explains that Kanan is now part of the Cosmic Force and that there are always ways for those who have passed on to continue influencing the living. She adds that this is not impossible."}, {"tag": "p", "text": "Ezra says that he thought that he was sent here to stop the Galactic Empire but that he instead found her. When Ahsoka asks if he thinks that Kanan wanted him to save her, Ezra believes that he can also save Kanan just as he saved her. She disagrees and tells Ezra to wait. Ignoring her, Ezra runs to a portal as he hears Kanan speaking about his reluctance to fight. Ezra believes that the portals can lead him to save Kanan but Ahsoka warns him to think about what he is doing. Ezra is adamant on stopping his master from dying. Ahsoka tells him not to but Ezra approaches the portal."}, {"tag": "p", "text": "He sees Kanan holding back the explosive wave. Ezra tries to intervene but Ahsoka tells him that his master gave his life so that he and the others could live. If he is taken out of this moment, she warns him that the other rebels would die. When Ezra says that she doesn't understand, Ahsoka responds that she couldn't save her master and neither could he. She tells him to let go and honor Kanan's sacrifice. Ezra reluctantly agrees and watches his master's final moments. She tells him that he must recognize that Kanan found the moment when he was needed most and that he did what he had to do for everyone. Ezra realizes that this was his final lesson. He wishes that his life was different and that his parents were still around."}, {"tag": "h3", "text": "Facing the Emperor and Sabine's escape"}, {"tag": "p", "text": "The two then hear rumblings and Ahsoka says that they can't stay here. She tells him that he opened the door to this World and asks if he can close it. Ezra says Sabine will know and that they can do it together. He adds that the other rebels will be happy to see her but Tano responds that she can't join them. At that moment, the same portal opens up again and the Emperor remarks \"perhaps I can.\" They discover that the Emperor has found a way to reach the World Between Worlds through Sith sorcery. They see the Emperor looking at them through the portal where they had seen Kanan's last stand. Darth Sidious gloats that Ezra Bridger and Ahsoka Tano are his at last as he cackles with laughter."}, {"tag": "p", "text": "Back at the Imperial camp, Hera is activating one of the thrusters beneath Minister Hyden's command center. Zeb tells her to hurry and Hera warns him to be ready to signal Sabine before blast off. Inside the center, Hydan observes that the Father is clearly showing the way to the portal and that the wolves are portal guardians. When Sabine asks about the convor, he speculates that it is a servant of the Daughter or the Daughter acting as a spirit guide. Sabine realizes that if the Daughter opens the Gateway, focusing on the Son will cause the portal to close; thus giving Sabine the information she needs to help Ezra. Hydan is pleased that Sabine has learnt something."}, {"tag": "p", "text": "He suggests that they could help each other. The stormtrooper reports that something is happening to the portal. Sabine tells him that she knows that \"language\". After Zeb warns Sabine by coded knocking, Hera activates the command center's thrusters. The command center begins tilting upwards as one of the thrusters lifts off. On the other side of the portal, Sidious sends a flow of blue flames after Ezra and Ahsoka, which Ahsoka at first resists using the Force. Ezra helps her and the flames dissipate. The two run as the Emperor unleashes a second volley of blue flames which pursue Ezra and Tano."}, {"tag": "p", "text": "Back at the Imperial command center, Sabine, Hydan, and the troopers dodge falling objects as the structure tilts on its back. Sabine knocks out a death trooper while Zeb punches a stormtrooper. The Spectres flee before the command center topples on several crates in the landing pad. When Sabine asks about Ezra, Hera says he is on the way as they make their way to the portal."}, {"tag": "h3", "text": "Sealing the portal"}, {"tag": "p", "text": "Back in the World between Worlds, Ezra and Ahsoka race Darth Sidious' blue flames. Ezra is caught in a tendril and the Emperor gloats. However, Ahsoka hacks at the blue flame with one of her lightsabers, causing Sidious to howl in rage. Ahsoka tells Ezra to flee back to his portal. He responds by asking her to find him when she gets back. She agrees to keep her promise. Ahsoka and Morai escape back to their portal on Malachor. Ahsoka wishes that the Force be with Ezra before walking into the depths of the Sith Temple."}, {"tag": "p", "text": "Ezra runs towards the Lothal Gateway and narrowly escapes the Emperor's clutches. He arrives back on Lothal but is quickly shaken to his feet as the rebels flee Imperial stormtroopers and death troopers. Sabine helps Ezra up but he insists on sealing the portal first. The rebels shoot several Imperial troops as they run. Chopper also arrives with the Mining Guild excavation driller and forces the stormtroopers to retreat. Under Sabine's guidance and with Zeb's help, Ezra activates the Son. Minister Hydan orders the Imperials to stop the rebels but they are blocked by Chopper's driller."}, {"tag": "p", "text": "Ezra touches the Son, whose eyes glow on the mural. Hearing the Son's words about the possibility to change the future, Ezra falls back onto Zeb, who catches him. The Father moves his hand and the Son joins his hands and sinks with the Daughter. The rebels retreat aboard Chopper's driller with Zeb carrying the unconscious Ezra. Hydan realizes that Ezra has caused the Temple to collapse. The sinking Temple emits a bright light and the wolves flee to the mural. As Hydan falls into the growing chasm, he laments that everything will be lost."}, {"tag": "h3", "text": "Resolution"}, {"tag": "p", "text": "Aboard the hijacked drill, Sabine tells the rebels to hang on. Below deck, Ezra falls unconscious, hearing Kanan's words \"The Force will be with you. Always.\" After Ezra wakes up, Zeb tells him that if this what he and Kanan used to do on their Jedi missions, he can keep him. Sabine tells Ezra that Hera is outside and that he has got to see what is outside. Ezra stands beside Hera, who tells him that the temple has sunk into the ground. Ezra recalls that he and Kanan stood on the ground when they first entered the Temple years ago. He confirms to Hera that Kanan is \"really gone\" but not before teaching him one last lesson. Before leaving, Ezra sees the white Loth-wolf and says \"Goodbye Kanan\" before returning to the driller."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}