{"url": "Colonial_Phalanx", "categories": ["Category:Legends articles", "Category:Chiss military units"], "nodes": [{"tag": "h1", "text": "Colonial Phalanx"}, {"tag": "p", "text": "Colonial Phalanxes were the military forces of the individual colony worlds of the Chiss Ascendancy. The Phalanxes protected the worlds they were assigned to, in case an invading threat managed to get past the Chiss Expansionary Defense Force. In case of emergencies, the Colonial Phalanxes would be called upon to augment the CEDF."}, {"tag": "p", "text": "It is not clear whether there was a correlation of any sort between Colonial Phalanxes and the units known as Household Phalanxes, which seem to have been associated with the Ruling Families; given the interest of the Families in Chiss frontier systems, it is possible that some or all colony worlds were essentially controlled by them as autonomous domains, and on such worlds, it would be understandable if the Colonial Phalanxes were Ruling Family militias."}, {"tag": "p", "text": "A study prepared by the University of Sanbra in the last years of the New Republic said that Colonial Phalanxes were typically under the authority of a Syndic appointed by a House leader, while the best-documented Household Phalanx was answerable to Syndic Mitth'raw'nuruodo of the Eighth Ruling Family; it is true that the Sanbra study suggests the Syndic of a Colonial Phalanx was a line officer, whereas direct command of a Household Phalanx was normally vested in a subordinate of the Syndic with the title of Commander, but the New Republic researchers may have misunderstood the exact function of the Syndic within the Phalanx's command structure."}, {"tag": "p", "text": "Nevertheless, the putative connection between Colonial Phalanxes and Household Phalanxes remains entirely inferential; there are hints that a democratic apparatus existed on at least some colony worlds, and some or all of the Colonial Phalanxes may have answered to such public authorities, rather than to the Ruling Families."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}