{"url": "Colonies", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:The Colonies", "Category:Regions"], "nodes": [{"tag": "h1", "text": "Colonies"}, {"tag": "p", "text": "The Colonies was a region of the galaxy located between the Core Worlds and the Inner Rim. It contained numerous planets, including Abednedo, Carida, and Uquine. The Colonies sat along major trade routes, and some of them were extremely wealthy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Colonies was a ring-shaped region of the galaxy that sat between the Core Worlds and the Inner Rim, meaning it was considered part of the \"inner planets.\" Important hyperspace routes made the worlds of the Colonies hubs for education, fashion, finance, and technology."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "The Colonies, along with the Core Worlds, were overpopulated during the High Republic Era. Thus, poorer individuals from the Colonies decided to move to the Outer Rim Territories to make new lives for themselves and their families."}, {"tag": "p", "text": "Ten years before the Clone Wars,[source?] a group of usurpers captured the planetary government of the Colonies world of Halcyon to protest the planet's membership of the Galactic Republic. After failed negotiations with the usurpers, the Republic dispatched the Jedi Order and the Judicial Department to deal with the usurpers. The Colonies planet of Castell was the homeworld of the Gossam Shu Mai, who later became Presidente of the Commerce Guild during the Clone Wars."}, {"tag": "p", "text": "The Colonies were also home to several Neimoidian Purse Worlds, including Cato Neimoidia and Narq. The Neimoidians enslaved the Narquois species and kept them in servitude for several centuries."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, a Separatist and Trade Federation fleet led by Cad Bane attacked the Republic outpost on the Colonies planet of Devaron and captured the Jedi Master Bolla Ropal. Bane tried to force Ropal to unlock a holocron he had stolen from the Jedi Temple on Coruscant. Despite a rescue mission mounted by the Jedi Knight Anakin Skywalker, his Padawan Ahsoka Tano, and Admiral Wullf Yularen, Ropal was killed and Bane managed to steal the holocron and a Kyber memory crystal."}, {"tag": "p", "text": "At the request of the Jedi Council, Senator Padmé Amidala undertook a mission to Cato Neimoidia in 21 BBY[source?] to spy on Senator Rush Clovis, who was secretly colluding with the Trade Federation and the Separatists. During the mission, Amidala obtained a hologram disc which proved that Clovis had dealings with the Separatists, who were planning to build a new droid foundry on Geonosis."}, {"tag": "p", "text": "In 20 BBY,[source?] Count Dooku sent Savage Opress to Devaron to take out the Jedi Temple of Eedit in order to test his prowess. Savage killed the Jedi Master Halsey, his Padawan Knox, and several clone troopers. Satisfied, Dooku took Opress as his new Sith apprentice in his plot to overthrow Darth Sidious. Later, the Republic Colonel Meebur Gascon and his D-Squad including R2-D2 foiled a Separatist plot to use a captured Venator-class Star Destroyer to disrupt a Republic strategy conference being held in the Carida system."}, {"tag": "p", "text": "In 19 BBY,[source?] Anakin and Ahsoka took part in the defense of Cato Neimoidia against the Separatists before being recalled to Coruscant to investigate a bombing at the Jedi Temple."}, {"tag": "p", "text": "Following the disappearance of the Dagoyan Masters on the Colonies world of Bardotta, Queen Julia enlisted the help of Junior Representative Jar Jar Binks and Master Mace Windu in rescuing the masters. Binks and Windu discovered the existence of a secret society called the Frangawl Cult which worshiped the demon Malmourral. After the Frangawl Cult kidnapped Julia, Binks and Windu pursued her kidnappers offworld to Zardossa Stix where they stopped a plot to revive the Nightsister Mother Talzin."}, {"tag": "p", "text": "Following the initiation of Order 66, Jedi Master Plo Koon's fighter was shot down after the Battle of Cato Neimoidia. Shortly later, the Republic was transformed into the Galactic Empire, which exterminated the Jedi and defeated the Separatists."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "During the Imperial Era, the Imperial cadet and later rebel informant Zare Leonis was born on the planet Uquine. Due to his parents' work as agricultural scientists, Leonis lived on several offworld locations including the space station Hosk Station and the planet Lothal. By 5 BBY,[source?] the planet Carida was known to host an Imperial Academy for senior cadets."}, {"tag": "p", "text": "Following the Battle of Yavin, the Jedi and Rebel Alliance starfighter pilot Luke Skywalker visited the Jedi Temple of Eedit on Devaron. He was subsequently involved in a skirmish with Imperial forces and the scavenger Sarco Plank. This was the young Jedi's first duel with a lightsaber."}, {"tag": "p", "text": "During the Galactic Civil War, Castell was a colony world of the Empire that was ruled by Moff Ssaria. At some point following the events above Yavin, the gambler and entrepreneur Lando Calrissian stole Emperor Palpatine's luxury yacht Imperialis, which was undergoing repairs at the Sienar Fleet Systems Orbital Shipyard CC-24 above Castell. In response, the Emperor dispatched ships to CC-24 to punish its Commander Pasqual for failing to prevent the theft of the Imperialis."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "Prior to the Battle of Jakku, the Acolytes of the Beyond attacked a New Republic outpost on Devaron. Following the rise of the New Republic, the Narquois sued the Neimoidians in the New Republic courts and sought compensation for centuries of enslavement. In 35 ABY, during the war between the First Order and the Resistance, all hyperlanes leading to the Colonies were blocked, though Zorii Bliss and Poe Dameron believed that a First Order captain's medallion could get someone through them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}