{"url": "11,987_BBY", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Years in the Kymoodon Era", "Category:Years in the Pius Dea Era"], "nodes": [{"tag": "h1", "text": "11,987 BBY"}, {"tag": "p", "text": "The year 11,987 before the Battle of Yavin (BBY) was a span of time that featured significant changes in the leadership of the Galactic Republic. A cult of conspiratorial religious zealots known as Pius Dea usurped power over the Republic with the help of a secretive society called the Malkite Poisoners. The zealots impeached reigning Supreme Chancellor Pers'lya and installed the Pius Dea figurehead Contispex I, assassinating the Bothan not long after he was removed from office. The new chancellor, housing Humanocentric beliefs, then unleashed a series of religious-based crusades against alien species and those who worshiped other deities. The rise of the Pius Dea cult marked the end of the Kymoodon Era and the beginning of the Pius Dea Era."}, {"tag": "h2", "text": "Proem"}, {"tag": "p", "text": "During the years of the Old Republic, the governing body gradually but steadily expanded its boundaries. Most of the settlements, however, were in a wedge-shaped region of space known as the Slice. Aside from occasional protrusions into unknown areas and isolated settlements, most of galactic society lived within the confines of known hyperspace routes and the established hyperlanes. Settlers and explorers, however, continued to search the wild and unexplored areas of the galaxy. In the years leading up to 12,000 BBY, this steady advancement continued. The Supreme Chancellor during this time was the Bothan Pers'lya. At the same time, however, the religious conspiracy-based cult of zealots known as Pius Dea was growing in power. The group held the beliefs of anti-alien Humanocentrism and that followers of other religions were \"unbelievers\" and idolaters."}, {"tag": "h2", "text": "The galaxy in 11,987 BBY"}, {"tag": "p", "text": "During that year, Supreme Chancellor Pres'lya became embroiled in an impeachment scandal. The religious and conspiratorial cult Pius Dea, coupled with the assistance of the secret group known as the Malkite Poisoners, led the ousting of Pers'lya and the installation of Pius Dea figurehead Contispex. With Contispex in power, the Pius Dea cult would begin a series of religious-based conflicts known as the Pius Dea Crusades within several years. The beginning of the crusades marked the end of the Kymoodon Era and the beginning of the Pius Dea Era."}, {"tag": "h2", "text": "Impact"}, {"tag": "p", "text": "Contispex, as part of Pius Dea, held the belief that alien species and religious-followers were heathen \"unbelievers.\" This view, coupled with the idea that the deities of the non-Human cultures needed to be destroyed, led the chancellor to attack Hutt Space. To some, the Hutts posed a legitimate threat to the Republic. Eventually, however, the Pius Dea crusades turned against other alien species which did not threaten the security of the Republic. Even after the reign of Contispex, Pius Dea controlled the chancellery for about one thousand more years, resulting in a devastating series of crusades. In the end, the crusades caused a rift between the rimward planets and the Core Worlds which would be exploited as late as the Galactic Civil War."}, {"tag": "h2", "text": "Notable events"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The reign of Contispex and Pius Dea is first mentioned in The New Essential Chronology with supplemental mentions in The New Essential Guide to Droids and The Complete Star Wars Encyclopedia. The circumstances surrounding the installation of Contispex and the Pius Dea crusades were expanded upon in the StarWars.com Hyperspace-published story Tinker, Tailor, Soldier, Praji by Nathan O'Keefe. The Pius Dea era was greatly expanded upon in The Essential Guide to Warfare, which established definite years for many of the events in the era."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}