{"url": "Colt/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles that are known by a nickname", "Category:Advanced Recon Commandos", "Category:Clone trooper commanders"], "nodes": [{"tag": "h1", "text": "Colt"}, {"tag": "p", "text": "\"Colt\" was the nickname of an Advanced Recon Commando who served in the Grand Army of the Republic during the Clone Wars. Commander of the Rancor Battalion and an advocate of unity on the battlefield, Colt was assigned to Tipoca City on Kamino to select potential ARC trooper candidates from squads of clone cadets nearing the end of their training. Colt was still on Kamino when the Confederacy of Independent Systems launched an attack on the cloning facilities there. The ARC trooper participated in the defense of Tipoca City but was killed by the Confederate Dark Jedi Asajj Ventress."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "One of many soldiers cloned from the Mandalorian bounty hunter Jango Fett on the planet Kamino and trained to serve the Galactic Republic, Colt was an Advanced Recon Commando commander tasked with leading Rancor Battalion of the Grand Army of the Republic during the Clone Wars. He was also given the task of overseeing the selection and training of new ARC trooper recruits. Around 22 BBY, Colt was reassigned to Kamino to oversee the final stages of training for clone cadets in Tipoca City, and the members of the cadet squad who performed the best in the last challenge were to be selected as ARC troop candidates. Introduced to the cadet squads by the Siniteen instructor Bric, Colt addressed the men, stressing the importance of unity on the battlefield."}, {"tag": "p", "text": "He selected Bravo Squad to first perform the final challenge, as the squad's cadets had completed their trial run in record time—\"ARC trooper time,\" as Colt saw it. From an observation platform overlooking the practice chamber, the commander instructed the Arcona trainer El-Les to initiate version THX, variable 1138, of the Citadel Challenge. Bravo Squad's performance in the test greatly impressed Colt, who congratulated the instructors on their training of the cadets. Domino Squad was the next to run the simulation, but Colt felt their handling of the test was \"sloppy\" and \"unorthodox,\" and he soon ended the challenge when the cadets left one of their own behind. The ARC trooper additionally berated the squad for disobeying directives and breaking formation. Left with no choice, El-Les failed Domino Squad, though the cadets later succeeded when given a second opportunity to pass the simulation."}, {"tag": "p", "text": "Colt remained on Kamino as the war progressed and was in Tipoca City when the Confederacy of Independent Systems launched an attack on the planet. The commander assisted with the defense of the city, leading ARC troopers during the battle and engaging Separatist B1-Series battle droids within one of the city's halls. Outnumbered, Colt was preoccupied with fending off the remaining droids when the Confederate Dark Jedi Asajj Ventress sneaked up behind him. Ventress grabbed Colt in a Force grip, telekinetically lifting the helpless ARC commander off the floor before slamming him into the opposite wall, knocking off his helmet on impact. Still holding Colt within her Force grip, Ventress telekinetically pulled the commander into the blade of her lightsaber, impaling and killing him. She then kissed him as she disengaged her lightsaber, letting his body crumple to the floor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An expert in ground and aquatic warfare, Colt believed strongly in the unity of and brotherhood between his fellow clone troopers—especially when in battle—and stressed this lesson to the clone cadets whose training he was assigned to supervise. Bravo Squad's performance, specifically, greatly impressed the commander—the cadets had completed their trial run in record \"ARC trooper\" time and had performed their final test flawlessly. His evaluation of Domino Squad, conversely, was quite different—the cadets' shoddy handling of the Citadel Challenge had revealed their disunity and noncompliance, and Colt wasted no time in berating them for their mistakes."}, {"tag": "p", "text": "When faced with a Separatist attack on Tipoca City, Colt and other clones fought against invading battle droids despite overwhelming odds. The commander continued to fight even after his comrades were killed, until he himself was struck down in battle. The pattern on his helmet identified Colt as a member of the Rancor Battalion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Commander Colt first appeared in \"Clone Cadets,\" the first episode of the third season of Star Wars: The Clone Wars, having previously been shown in promotional material for the season. He later appeared in the second episode, \"ARC Troopers.\" Although he was not identified by name in either \"ARC Troopers\" or the accompanying episode guide, the ARC trooper killed by Ventress in the episode wears armor identical to that of Colt, and this article therefore assumes that both characters are one and the same."}, {"tag": "p", "text": "A portion of Colt's death in \"ARC Troopers\" was removed from the aired episode. In the original scene, Ventress gave Colt a kiss on the cheek after impaling him but before deactivating her lightsaber. This modification was done at the insistence of Cartoon Network at Celebration V. However, the full scene was still present in the Dataclip summary of the episode on Cartoon Network's website, as well as on the third season's home video release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}