{"url": "Columex/Legends", "categories": ["Category:Legends articles", "Category:Commonality planets", "Category:Confederacy of Independent Systems sectors", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Perlemian Trade Route", "Category:Terrestrial planets", "Category:Trade worlds", "Category:Vorzyd sector planets", "Category:Xim's empire", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Columex"}, {"tag": "p", "text": "Columex, originally known as Nardolin, was a trade planet located in relative proximity to the Vorzyd Cluster of the Outer Rim Territories, on the Perlemian Trade Route."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Columex was located in the Vorzyd sector of the Outer Rim Territories, near the Vorzyd Cluster, at the intersection of two major hyperlanes: the Perlemian Trade Route and the Salin Corridor. It was a major trade world, dominated by Humans known as Columexi. Columex was the capital of the Commonality, a confederacy of five sectors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally known as Nardolin, the world was conquered by Xim the Despot as he expanded his empire in the Thanium Worlds. Remembrance of the Xim era was eventually lost outside of the Tion Cluster due to the Hutt devastation of the Kiirium Reaches. Some scholars later identified incorrectly Columex as the ancient Huronom."}, {"tag": "p", "text": "During the Draggulch Period, Columex was a minor Galactic Republic outpost. However, the proximity with the wealthy Vorzyd Cluster attracted Commenorian investors, including the Greyshade family, five centuries after the discovery of Vorzyd. They settled Columex and began trading with the Vorzyd Cluster and its confederacy known as the Commonality. Columex joined the confederacy and, in a few generations, Columex became a major trade world. The aggressive Columexi traders allowed Columex to take control of the entire Commonality and expanded it. The Commonality eventually joined the Republic as a group of five sectors."}, {"tag": "p", "text": "Columex seceded from the Galactic Republic during the Clone Wars. By this time, the Commonality was represented by in the Galactic Senate by Senator Jheramahd Greyshade. He was later succeeded in office by his cousin, Simon Greyshade."}, {"tag": "p", "text": "When the Republic fell, Senator Simon Greyshade declared a state of emergency in the Commonality. Greyshade later agreed the Galactic Empire to seize a part of the Commonality gambling profits in exchange of the control of the Wheel, a space station located in the Mid Rim, to a Columexi company controlled by Greyshade. Simon Greyshade remained senator until the dissolution of the Imperial Senate. The Commonality was later ruled by a Moff, Diedrich Greyshade"}, {"tag": "p", "text": "After the Battle of Endor, Columex was annexed by Warlord Treuten Teradoc and became one of the major trade worlds of the Greater Maldrood. After the fall of the Greater Maldrood, the planet remained under Imperial control until the Thrawn campaign Columex and the Commonality later refused to join the New Republic and became independent. Columex briefly returned under Imperial rule when the planet surrendered to Imperial forces during Operation Shadow Hand."}, {"tag": "p", "text": "Columex was conquered and razed by the Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}