{"url": "Com-scan", "categories": ["Category:Legends articles", "Category:Capital ship components", "Category:Communications sensors", "Category:Emplacement sensors", "Category:General purpose sensors", "Category:Ground vehicle components", "Category:Starship sensors", "Category:Vehicle sensors"], "nodes": [{"tag": "h1", "text": "Com-scan"}, {"tag": "p", "text": "A com-scan, or comm/scan, was a computer system which controlled and integrated the hundreds of complicated communication and sensor systems, from electro-photo receptors and full-spectrum transceivers to dedicated energy receptors and subspace transceivers, found aboard large capital ships like Imperial Star Destroyers (located inside the conning tower's sensor globes) and Mon Calamari Star Cruisers."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Comparing data from both communication and sensor networks allowed com-scan operators to more easily detect hidden starships or bases than stand-alone systems. This was because a com-scan computer could instantly process and analyze the incredible volume of data it received and, when indicators matched preprogrammed warning conditions, automatically activated reserve sensors for a more detailed look: for example a sudden energy spike which may indicate the presence of a starship. Highly skilled sensor and communication officers and specially programmed droids then evaluated the information and determined which was important enough to alert the command staff."}, {"tag": "p", "text": "In addition to detecting hidden targets com-scan computers were used for other purposes as well, such as run battle simulations or coordinate large-scale fleet battles across multiple star systems through encrypted subspace and HoloNet transmissions, with enemy movements displayed through hologram projectors and flatscreen monitors. Much smaller com-scan computers could also be found on military command vehicles, like the LAVr QH-7 Chariot which used the CO-0012 com-scan."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rebel Alliance used a com-scan computer during the Battle of Yavin to remotely assist Rebel starfighters when their sensors were jammed by the Death Star. It was able to identify sources of communications and triangulate enemy units with the intercepted communications signals."}, {"tag": "p", "text": "The Executor used such systems upon entering the Hoth system to verify the location of Echo Base, while General Rieekan used a MicroThrust Processors OrC-19 com-scan integrator console to monitor Imperial forces and coordinate the ground defense and evacuation efforts during the Battle of Hoth."}, {"tag": "p", "text": "Both Grand Admiral Thrawn and the reborn Emperor used com-scan computer systems during their respective campaigns to bring down the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}