{"url": "Combined_Defense_Forces_of_the_New_Republic", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:New Republic military units"], "nodes": [{"tag": "h1", "text": "Combined Defense Forces of the New Republic"}, {"tag": "p", "text": "The Combined Defense Forces of the New Republic, commonly referred to as the New Republic Defense Force (NRDF) or New Republic Armed Forces, were the integrated military forces charged with the defense of the New Republic. Formed from the Alliance Military in 4 ABY after the Alliance to Restore the Republic reformed into the New Republic in the aftermath of the Battle of Endor, the New Republic military went on to liberate Coruscant, defeat Imperial warlords like Ysanne Isard, Zsinj, and Grand Admiral Thrawn, defeat the Reborn Emperor's Dark Empire, and finally defeat Gilad Pellaeon's Imperial Remnant and end the Galactic Civil War."}, {"tag": "p", "text": "Throughout its history, the New Republic Defense Force also fought numerous local conflicts, including the Black Fleet Crisis of 16 ABY and the Almanian Uprising of 17 ABY. After the Yuuzhan Vong invaded the galaxy in 25 ABY, the New Republic Defense Force suffered a series of defeats that culminated in the loss of Coruscant in 27 ABY. A revitalised Defense Force managed to inflict a devastating defeat on the Yuuzhan Vong at the Battle of Ebaq in 28 ABY, and was reorganized that year into the Galactic Alliance Defense Force."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Combined Defense Forces of the New Republic comprised the New Republic Defense Fleet, the New Republic Starfighter Corps, and until 12 ABY, the New Republic Army. However, all three elements were heavily-integrated, and in contrast to the Imperial Military's role of planetary invasion and occupation, the New Republic military concentrated on peacekeeping, patrolling, and defense against external attacks. The New Republic military was intended to complement the Planetary Security Forces that answered to local sector authorities. Consequently the New Republic military was smaller than the Imperial Military that had preceded it (though was much larger than the pre-Clone Wars Judicial Forces of the Old Republic), with a focus on rapid response over firepower."}, {"tag": "p", "text": "The New Republic military's early organization emphasised flexibility, largely owing to the disparate collection of heterogeneous units that had comprised the earlier Alliance Military. Naval battle groups were designed so they could be shifted rapidly within the four main fleets and area commands as required while planetary assault became the most common mission profile. The Alliance Special Forces were reorganized as bridgehead commandos while a larger New Republic Army was created for peacekeeping and garrison duties. Integration and standardisation proceeded apace after 8 ABY and the defeat of Warlord Zsinj, with a more serious military reform in 12 ABY after the defeat of the Dark Empire, with all federal military forces coming under the control of the four main fleet commands as part of a fully-integrated Defense Force. This period saw the abolition of the New Republic Army, with its defensive responsibilities shifted to the Planetary Security Forces and the role of planetary assault taken by the New Republic Marines. In the New Republic Defense Fleet, battle groups became subcommands with defined sectors, with larger forces blockading the main Imperial holdouts and smaller squadrons assigned to peacekeeping patrols inside New Republic territory."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "From Endor to Coruscant"}, {"tag": "p", "text": "After the Battle of Endor in 4 ABY, the former Rebellion's military consisted primarily of donated starships converted to military duty, volunteer resistance force fleets, and a small number of vessels purchased with limited Rebel Alliance funds, headed by Admiral Ackbar. As the Rebel Alliance reformed into the Alliance of Free Planets, and one month later, the New Republic, Ackbar worked to forge his forces into a centralized military that could accomplish the Provisional Council's primary goal: the capture of Coruscant and the liberation of the galaxy from Galactic Empire. A decisive moment was Mon Mothma's issue of the Defense Declarations, which proclaimed the New Republic's intent to devolve control of the Planetary Security Forces, nationalized by the Empire, back to the sectors. Admiral Ackbar would later describe the Declarations as more decisive in delivering worlds from the Empire than any military campaign: members of the new government would be expected to support the common military, but could also now control their own planetary defense forces and at greater strength than under the Empire or the Republic. Imperial loyalist sectors dismissed the measure as illegal, but for others the Declarations caused many sectors that had been on the edge to side with the New Republic. Other sectors divided over whether to accept the Declarations, fomenting further Imperial warlordism and infighting and significantly reducing the number of enemies the New Republic had to fight."}, {"tag": "p", "text": "Early campaigns for the New Republic military included the unexpected invasion by the Ssi-ruuk at Bakura, and the war between the extra-galactic Nagai and Tofs, who advanced as far as Zeltros before the Tofs were defeated, and finally expelled from the galaxy at the Battle of Saijo. The campaigns stretched the New Republic military to the breaking point, and so it would not make any overt military moves against the Empire until over six months after Endor, but had reassured citizens that the former Rebellion could defend the galaxy and legitimized the new government. It was at this time that the New Republic Defense Fleet created its four original fleets: the First Fleet under the command of Admiral Firmus Nantz operated out of Saijo in the Western Reaches; the Second Fleet under Admiral Hiram Drayson defended the New Republic's redoubt in the Calamari sector; the Third Fleet operated out of Bothan Space into the Slice under Ackbar's personal command; and the Fouth Fleet under Admiral Voon Massa operated from Bothawui along the Corellian Run as a mobile reserve for the First and Third Fleets. Flexibility was the guiding principle for the Defense Force's organization in this period, with pre-existing squadrons and flotillas from the old Alliance Fleet remaining intact and local loyalties being taken into account. Battle groups were designed so they could be shifted within the four main fleets as required or if necessary deployed independently."}, {"tag": "p", "text": "Over the next two years, the New Republic military fought a complex campaign aimed at isolating and marginalizing Imperial warlords from the rump of the Empire in the Core Worlds. In 4 ABY, Nantz's First Fleet separated warlords Delvardus and Prentioch at the Battle of Abraxas and isolated Par Lankin in the Lambda sector in the Hevvrol Sector Campaign. Massa's Fourth Fleet captured Druckenwell while Admiral Ackbar personally led the Third Fleet to liberate Kashyyyk and, with Rogue Squadron, capture Brentaal IV, bringing the New Republic into the Core Worlds. 5 ABY, however, saw morale fall as the New Republic was embroiled in attritional slogs on Milagro and Mindor: the New Republic Army and the Fourth Fleet engaged in both a surface and subterranean struggle against Admiral Uther Kermen's Imperial Army and Stormtrooper forces in the Milagro campaign, while General Luke Skywalker led the Rapid Response Task Force to assist the Third Fleet against Lord Shadowspawn at the Battle of Mindor. A needed lift came with the Delvardus campaign, which saw the First Fleet collapse the border of Warlord Delvardus' dominion and force him to flee into the Deep Core."}, {"tag": "p", "text": "The New Republic consolidated its holdings in 6 ABY, with the First Fleet eliminating Warlord Prentioch's dominion at the Siege of Bomis Koori and the Fourth Fleet capturing Denon in a savage battle that saw the death of Admiral Massa. Meanwhile, Admiral Ackbar encircled the Core Worlds from the north in preparation for the capture of Coruscant, winning battles at Uviuy Exen and Palanhi, before launching the Coruscant campaign in mid-6 ABY. Rogue Squadron fought twin battles to capture Borleias as a stepping stone to Coruscant itself, and finally liberated the galactic capital from the self-proclaimed Empress Ysanne Isard several weeks later."}, {"tag": "h3", "text": "Against Thrawn and the Reborn Emperor"}, {"tag": "p", "text": "After the capture of Coruscant, the New Republic reorganized under the Common Charter, which also organized the military might of the New Republic into a single unified command structure. Starships, starfighters and soldiers all served under the Supreme Commander, an office built from the remains of the Minister of Defense, Minister of the Army, Minister of the Navy and Minister of the Starfighter Corps. The Defense Force was also under New Republic High Command. While the Defense Force was organized into Fleet Command, Intelligence, Technology and Quartermaster sections, the Defense Fleet served as its primary action body, and was led directly by the Supreme Commander, Ackbar. Many also referred to the Defense Fleet as the New Republic Navy."}, {"tag": "p", "text": "In 7 ABY, the Solo Fleet, an independent task force under the command of General Han Solo, was deployed to defeat Warlord Zsinj, the most powerful of the independent Imperial warlords. Zsinj was forced into hiding after the Battle of Selaggis and was subsequently killed at the Battle of Dathomir. Despite Zsinj's death, however, in the fighting that followed to claim his empire, the New Republic took significant casualties from both Warlord Teradoc and Admiral Teren Rogriss, leading forces out of Imperial Space. Though Teradoc was forced to retreat into the Deep Core, fleet numbers on both sides largely stabilized owing to the losses of the campaigns, and at the end of 8 ABY Mon Mothma ordered a suspension in military operations, leaving the New Republic in nominal control of three-quarters of the galaxy, having pushed the Galactic Empire into a rump state in the New Territories beyond the Hydian Way."}, {"tag": "p", "text": "Grand Admiral Thrawn returned in 9 ABY from his expedition in the unknown regions(where he founded The Empire of The Hand), and with handful of ships at the start of his campaign was able to gather a large armada and nearly defeated the New Republic if not for his guard's betrayal at the battle of Bilbringi."}, {"tag": "h3", "text": "Fighting the Imperial Remnant"}, {"tag": "p", "text": "Ostensibly it was during this period that the navy began to organize into battle groups. Each of the four fleets now consisted of hundreds of warships, transports, and support vessels organized into battle groups and task forces, in addition to ground troop divisions and starfighter wings. These fleets patrolled segments of the New Republic on a rotating basis, with at least one always assigned to defending Coruscant and another assigned to patrolling \"Thunder Alley\". Prior to 16 ABY, four fleets existed to fulfil this function."}, {"tag": "p", "text": "In the nine years following the reorganization of the fleet, the variety of vessels that comprised the Defense Fleet grew; starships from hundreds of shipyards across New Republic space made up the frontline, support and civilian vessels of the Fleet. The resulting inefficiencies of this diversity prompted a program to streamline the Fleet's ships and increase maintenance efficiency. This program, named New Class, offered the Fleet a new level of standardization, power and flexibility previously enjoyed by the Imperial Starfleet. By 16 ABY, a new battle group, the Fifth Battle Group constructed wholly of New Class starships completed its proving missions and demonstrated the success of the program in the Black Fleet Crisis."}, {"tag": "h3", "text": "The Yuuzhan Vong War and end"}, {"tag": "p", "text": "However, the Fleet's battle groups were designed as response forces and, despite the concerns of some politicians during the launch of the Fifth Battle Group, not a tool of conquest. Thus, the Fleet was woefully unprepared to launch counteroffensives against the Yuuzhan Vong in the early stages of the Yuuzhan Vong War, and once again had to rely on its talented commanders to achieve victories. Unfortunately, the New Republic Senate kept withdrawing fleets to the Core Worlds, effectively forcing the Defense Force to sacrifice the Mid and Outer Rim. The Defense Force suffered serious defeats due to the political leadership, draining morale and resources, and members of the Defense Force came close to mutiny."}, {"tag": "p", "text": "With the collapse of the New Republic and the formation of the Galactic Alliance, the New Republic Defense Force formally ceased to exist, and was replaced by the Galactic Alliance Defense Force."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Headquarters"}, {"tag": "p", "text": "The Defense Forces were headed by the Supreme Commander, who took orders from the Chief of State, the civilian leader of the New Republic. In the first few years after Endor, the Defense Forces were organized under the Ministry of Defense, which had been reorganized from the Rebel Alliance's Ministry of War, with separate ministries below for the Army, Fleet, and Starfighter Corps. In practise this proved overly-bureaucratic and cumbersome, and following the Liberation of Coruscant in 6 ABY, the whole command structure was reorganized again, with the position of Minister of Defense being abolished and the Supreme Commander becoming a Ruling Council position. New Republic High Command was the senior professional military body in control of the Defense Forces, which in turn controlled Fleet Command and Starfighter Command."}, {"tag": "p", "text": "Legislative scrutiny of defense policy was conducted by the Defense Council of the New Republic Senate."}, {"tag": "h3", "text": "Administrative organization"}, {"tag": "p", "text": "The branches of the New Republic military before integration were the New Republic Defense Fleet, New Republic Starfighter Corps, and the New Republic Army. Federal military forces were fully integrated into the four fleet commands in 12 ABY, with the Army being abolished and its responsibilities transferred to the Defense Fleet's Marines and the ground elements of the Planetary Security Forces."}, {"tag": "p", "text": "Other administrative departments within the Defense Forces included the Technology Section, the Training Section, the Quartermaster Section, New Republic Special Operations, New Republic Special Forces, and the New Republic Fleet Office. New Republic Fleet Intelligence was the military intelligence branch of the Defense Force, and was a separate agency to the civilian New Republic Intelligence Service. The New Republic Honor Guard provided ceremonial duties."}, {"tag": "h3", "text": "Tactical organization"}, {"tag": "p", "text": "The Defense Forces were built around four main fleets and area commands, derived from the four original fleets that had conducted the advance on Coruscant from 4 to 6 ABY. Early organization emphasized flexibility, with pre-existing squadrons and flotillas from the old Alliance Fleet remaining intact and local loyalties being taken into account. Battle groups were designed so they could be shifted within the four main fleets as required or if necessary deployed independently, such as the Solo Fleet deployed against Warlord Zsinj."}, {"tag": "p", "text": "As the New Republic grew, Admiral Ackbar was faced with the challenge of creating a unified Defense Force out of the disparate units that had comprised the Rebel Alliance's Sector Forces, which had contrasting regulations, tactics and traditions. To achieve this, the squadrons that had not originally been part of the central Alliance Fleet Command were largely broken up and their ships and crews sent to different units. This provoked a degree of resistance, but on the whole Defense Force integration proceeded quickly. By 8 ABY, the New Republic First Fleet guarded Coruscant as the Home Fleet, while the Second defended Elom, the Third, Kashyyyk and the Fourth, Bothan Space. This arrangement fought in the Thrawn campaign, the Imperial advance out of the Deep Core, and Operation Shadow Hand."}, {"tag": "p", "text": "By 12 ABY the battle group and squadron forces met standards for strength, unity and discipline, allowing a more sweeping military reform. The New Republic Army, which had suffered heavy casualties in Operation Shadow Hand, was abolished, with its defense and garrison responsibilities transferred to the local Planetary Security Forces, and all federal military forces were placed under the four fleet commands as part of a integrated Defense Force. Naval battle groups became subcommands with defined sectors of operations, with large forces blockading the main Imperial holdouts and smaller squadrons assigned to peacekeeping patrols inside New Republic territory. One battle group in each fleet served as a mobile reserve, but temporary attachments of multi-role task forces—standardized squadrons built around a mix of vessels with complementary capabilities—could turn each battle group into a powerful fighting fleet."}, {"tag": "p", "text": "After the reorganization led to the four fleets becoming increasingly tied-down as territorial deployments, a new rapid-reaction command was activated in 16 ABY. The Fifth Roving Battle Group contained five task forces, and fought with distinction in the Black Fleet Crisis. The Fifth Battle Group was soon assigned full fleet status, and by 19 ABY the New Republic Fifth Fleet was enlarged to a full strength of five hundred capital ships in five battle groups."}, {"tag": "h2", "text": "Departments"}, {"tag": "h2", "text": "Ships"}, {"tag": "h3", "text": "Capital ships"}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h3", "text": "Support craft"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}