{"url": "Comet_Squadron", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:New Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Comet Squadron"}, {"tag": "p", "text": "Comet Squadron, also known as Comet Group, was a starfighter squadron that served the New Republic Defense Force during the early years of the New Republic. The squadron was equipped with A-wing interceptors and was under the command of Colonel Edor Crespin. Some time before 7 ABY, Garik \"Face\" Loran, a former Imperial holovid star, joined the squadron after buying his own A-wing and flew only two missions with the unit. Colonel Crespin was promoted to general while still leading the squadron before being given command of the fighter training base on Folor in around 7 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Comet Squadron, also known as Comet Group, was an A-wing starfighter squadron in the service of the New Republic Defense Force. During the early years of the New Republic, the squadron was under the command of Colonel Edor Crespin."}, {"tag": "p", "text": "Some time before 7 ABY, former Imperial holovid star Garik \"Face\" Loran joined Comet Squadron after purchasing his own A-wing. Loran flew two missions with Comet Squadron before he was forced to eject from his starfighter during an operation in order to avoid a proton torpedo. Loran then left the squadron and purchased an X-wing."}, {"tag": "p", "text": "While in command of Comet Squadron, Crespin was promoted to the rank of general. Around 7 ABY, General Crespin was placed in command of the fighter training base on Folor, one of the moons of the planet Commenor, and took personal command of the base's two A-wing training squadrons."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The pilots of Comet Squadron were equipped with RZ-1 A-wing interceptors, the fastest starfighter in the service of the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Comet Squadron was first mentioned as \"Comet Group\" in the fifth novel in the X-Wing series, Wraith Squadron, written by Aaron Allston and published in February 1998. It later gained an entry in the 2008 reference book The Complete Star Wars Encyclopedia, as well as being mentioned under the entry for Garik Loran. Both entries identified the unit as \"Comet Squadron.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}