{"url": "Comet_(clone_trooper)", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Clone trooper corporals", "Category:Members of the 104th Battalion"], "nodes": [{"tag": "h1", "text": "Comet  (clone trooper)"}, {"tag": "p", "text": "\"Comet\" was the nickname of a Clone Corporal who served in the Grand Army of the Republic during the Clone Wars, a conflict between the Galactic Republic and the Confederacy of Independent Systems. Serving under the command of Jedi General Plo Koon and Clone Commander Wolffe, Comet was part of the clone trooper unit known as Wolfpack—a military unit that was part of the 104th Battalion."}, {"tag": "p", "text": "Throughout the war, Comet served on various missions, working with fellow Wolfpack troopers Boost and Sinker early in the war to infiltrate the Nexus as well as performing a rescue mission on Vanqor to save Jedi Master Mace Windu and Jedi General Anakin Skywalker. He also fought in multiple larger conflicts, including at the Second Battle of Felucia alongside Koon, Skywalker, and Padawan Ahsoka Tano, and at the Battle of Kadavo. Comet survived into the last year of the war, where he traveled to a moon of the planet Oba Diah with Koon and the Wolfpack, searching for signs of the deceased Jedi Sifo-Dyas."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "Comet was created as a clone of the bounty hunter Jango Fett on the Wild Space planet Kamino, like all clone troopers in the Grand Army of the Galactic Republic. Comet served as a Corporal in the 104th Battalion's Wolfpack. The battalion was led by Clone Commander CC-3636 \"Wolffe\" and Jedi Master and Jedi Council member General Plo Koon."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Early missions"}, {"tag": "p", "text": "Early on in the Clone Wars, Comet accompanied Wolfpack troopers Boost and Sergeant Sinker under the command of Commander Wolffe to use JT-12 jetpacks to infiltrate the Nexus, a floating city and trading outpost, which was controlled by Separatist forces led by Emir Wat Tambor. After their successful infiltration, Tambor destroyed the station instead of allowing it to fall into the Republic's hands. The four clones barely escaped and rescued a hostage, earning praise from Koon."}, {"tag": "p", "text": "After Boba Fett sabotaged the Venator-class Star Destroyer Endurance, Mace Windu and Anakin Skywalker went off in search of any survivors of the ship's crew, particularly Admiral Kilian and Commander CT-411 \"Ponds.\" However, young Fett and his allies, Aurra Sing, Bossk, and Castas, were waiting for the Jedi: Jango Fett's helmet was left with a bomb inside, blowing debris upon Windu and Skywalker. As the two lay in the collapsing wreckage, Skywalker's droid, R2-D2, arrived in the Jedi Temple on Coruscant, informing Plo Koon and Padawan Ahsoka Tano of the two Jedi's current state. Koon and Tano, with the 104th Battalion \"Wolfpack,\" left to rescue the Jedi. On the planet Vanqor, Koon and Tano held the ruined bridge in place while Comet and Wolffe rushed to Skywalker's and Windu's rescue, pulling them from the ship and helping them into their gunship before the cruiser fell apart and was destroyed."}, {"tag": "h4", "text": "Felucia"}, {"tag": "p", "text": "During the Second Battle of Felucia, Comet led a group of clones, including Sinker and Boost, that accompanied Tano around the back wall of a droid base. As they neared the wall, Tano told Comet to stop and after he halted the troops, Tano told him that she sensed something nearby. Comet asked if it was a droid, but Tano replied that is was probably just an animal. Telling the men to remain alert, Comet and his fellow troopers made their final approach to the wall and took cover at the tree line. As Skywalker and Koon made their assault to draw the Separatists towards them, Comet and the others took out the sentry droids and successfully scaled the wall with grapplers. As Tano guarded the rear, Comet told her to come up after them as the men secured their position. However, as Tano reassured Comet that she was right behind them, she was captured by the Trandoshan hunter Lo-Taren as Comet and the men continued on, unaware that she had been captured."}, {"tag": "h4", "text": "Kadavo"}, {"tag": "p", "text": "After the population of Kiros was enslaved by the Zygerrian Slave Empire and brought to a slave processing facility on Kadavo, Koon led the Wolfpack to attempt a rescue. Comet was part of a squad that used jetpacks to deploy grappling cables for the slaves to escape down and onto their ship. As the platform the slaves were standing on began to retract, multiple Togruta fell, with one of them being caught by Comet. When the rescued slaves made it into the hangar, Comet and the other troopers helped them receive medical treatment."}, {"tag": "h4", "text": "Oba Diah"}, {"tag": "p", "text": "Late in the war, Comet and the men traveled with Koon to one of the moons of Oba Diah to locate a shuttle that had belonged to Jedi Master Sifo-Dyas. As they conducted a search through the howling winds and dust, Comet used his comlink to attempt to find the other search parties and tell them that they hadn't found anything. As Comet noted that they were probably way off, Wolffe replied over the comm from the clone turbo tank he was traveling in that the data said they were very close. Comet assured his commander that they had scoured the area three times, declaring the area to be a wasteland as he could not see anything by visual or using the scanner. However, a trooper soon discovered the wreckage of the shuttle and Koon reported their findings to the Jedi Council."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Nearly twenty years after the end of the Clone Wars, Wolffe and former clone commando Gregor fought in the Liberation of Lothal from the Galactic Empire. During the conflict, Lothal's native loth-wolves joined the fight against Imperial forces. Observing the similarity between the wolves and the \"Wolfpack\" nickname for his squad in the 104th Battalion, Gregor commented that Wolffe had his Wolfpack back. Wolffe responded that they fought just like Comet and his other men."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Comet had standard Phase I clone trooper armor with reddish and eventually gray-blue markings consistent with his unit, including unique markings on his helmet. Comet's Phase II armor was also unique and painted with gray-blue markings. During their mission to one of the moons of Oba Diah, Comet and the troops wore sand-proof armor designed for the harsh weather conditions that included unique helmets and kamas. Comet was capable with a standard DC-15A blaster carbine and also frequently used a jetpack during missions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Comet first appeared in \"R2 Come Home,\" the twenty-first episode of the second season of Star Wars: The Clone Wars. He made several other appearances in later seasons, including in the episode \"The Lost One\" in the The Clone Wars: The Lost Missions. Like all other clone troopers in the series, he was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}