{"url": "Commandant%27s_Cadets", "categories": ["Category:Canon articles", "Category:Imperial organizations", "Category:Secret societies"], "nodes": [{"tag": "h1", "text": "Commandant's Cadets"}, {"tag": "p", "text": "The Commandant's Cadets was a secret student society found within the Galactic Empire's Arkanis Academy on the planet Arkanis. Created by the academy's leader, Commandant Brendol Hux, the organization was made up of cadets handpicked by Hux. Potential members were identified by their strong performance at the academy, but first had to pass a test to get in."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Commandant's Cadets was a secret society based at the Galactic Empire's Arkanis Academy, a senior Imperial Academy that specialized in officer training. The Arkanis Academy's Commandant Brendol Hux was a veteran of the Clone Wars who admired the combat prowess of the Galactic Republic's clone troopers. He attributed their superior fighting qualities to the fact that they had been trained from birth as soldiers. However, the clone troopers' genetically identical nature made them vulnerable to Separatist biological agents and pathogens. As a result, the Emperor had opened the ranks of the Imperial Military to non-clone recruits."}, {"tag": "p", "text": "Since the non-clone recruits could not match the fighting quality of their clone trooper predecessors, Hux had conceived the idea of training non-clone recruits as stormtroopers from birth. Over successive generations, Hux planned to cultivate an Imperial Military that had the same fighting qualities of the clone troopers but were immune to their genetic weaknesses. In Hux's view, these stormtroopers would be raised to view the Empire as their family. Unable to find officers within the Imperial Military who would support his ideas, Commandant Hux decided to \"create\" these officers by recruiting talented young cadets from the Arkanis Academy. As part of the induction test, prospective cadets were required to kill a fellow cadet but to stage it as an accident. Cadets would be initiated at Area Null, a secluded tower within the Academy complex that hosted several secret Imperial operations."}, {"tag": "h3", "text": "Challenges"}, {"tag": "p", "text": "By the time that Zare Leonis had arrived at the Arkanis Academy, the Commandant's Cadets had ten members including Orman le Hivre and Rav Horan. Unknown to everyone, Leonis was a rebel sympathizer who had infiltrated the Imperial Academy to find his missing sister Dhara Leonis. Upon trying to sit at a particular table during lunch, he was told that only members of the Commandant's Cadets could sit at a particular table and that membership required an invitation. Shortly afterwards, he spoke with a girl named Anya Razar, who hinted that she had been selected for membership and would soon be a member once she had passed a test. Leonis soon learned that this \"test\" was of a deadly nature when a \"low-performing\" cadet named Xan Lanier was killed during a live-fire exercise in the Academy. Razar had served as the commander of Leonis and Lanier's squad during that particular field exercise. Lanier's death was hushed up and Razar was shortly later inducted in to the Commandant's Cadet, making her the eleventh member."}, {"tag": "p", "text": "Later, Lieutenant Chiron, who had been Leonis's mentor at Lothal's Academy for Young Imperials, arrived at the Arkanis Academy to investigate reports that Commandant Hux was creating a group independent of the official Imperial chain of command. Leonis agreed to infiltrate the Commandant's Cadets. Shortly later, Leonis was invited to join the secret society but was stunned to learn that his task was to kill fellow cadet Penn Zarang during a field exercise, which would be reported as a weapons malfunction. He reported this information to Chiron, who arranged to fake Zarang's death so that Leonis could join the Commandant's Cadets. With the help of Zarang, Leonis and Chiron buried a side of nerf in Zarang's \"grave\". Chiron also promised he would make arrangements to get Zarang transferred to a different Academy."}, {"tag": "p", "text": "The following day, Leonis managed to convince the other Commandant's Cadets that he had killed Zarang during the night and buried his body. Later that night, Leonis was invited to attend a formal dinner with Commandant Hux and the eleven other Cadets. During the dinner, Hux revealed the truth about the organization's ultimate purpose. Hux had served with the clone troopers during the time of the Galactic Republic and admired their combat prowess. Dissatisfied with the caliber of non-clone recruits, the Commandant wished to create soldiers that would be loyal to the Galactic Empire from birth. Before Leonis could formally be inducted as the twelfth member of the Commandant's Cadets, he was exposed as a traitor by his former friend Beck Ollet, who had been captured and inducted into Project Unity."}, {"tag": "p", "text": "Commandant Hux and the eleven other Commandant's Cadets later attended Leonis' trial. While Colonel Julyan presided over the proceedings, the Cadets sat on a bench below the Colonel's dais. During the trial, Leonis pleaded guilty to various charges including fraudalent enlistment, treason, sedition, and conspiring to undermine the Empire. However, he withheld any information about Chiron's investigation into the Commandant's Cadets out of respect for his former mentor. Colonel Julyan formally expelled Leonis from Imperial service and sentenced him to death. As part of the sentence, the Commandant's Cadets stripped Leonis of his uniform and publicly turned their backs on him. Before Leonis could be executed, he and his sister Dhara were rescued by his girlfriend Merei Spanjaf and several members of the Spectres."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Since Chiron was killed during Leonis's escape, Commandant Hux was presumably able to continue his ideas. After the Empire signed the Galactic Concordance with the New Republic which ended the Galactic Civil War, Brendol Hux left the Arkanis Academy and fled to the Unknown Regions, where he and other like-minded officers established a military junta known as the First Order. Hux's ideas influenced the First Order military and were continued by his son, Armitage Hux, who became a general in the First Order. Under the direction of General Hux, the First Order's stormtroopers were trained from infancy and underwent vivid simulations and intense political indoctrination designed to create fearsome and deeply-loyal soldiers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}