{"url": "Commando_droid_captain", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:BX-series droid commandos", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "Commando droid captain"}, {"tag": "p", "text": "Commando droid captains were BX-series droid commandos tasked with commanding their fellow BX-series droids. The standard design of these droid captains possessed white head and chest markings."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Commando droid captains, like other commando droids, were programmed with improved combat tactics and battlefield awareness. The droids had glowing white photoreceptors, like normal commando droids, however, captains and other high-ranking commando droids bore white markings on their heads and chests."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One participated in the Defense of Rishi Station. After landing in boarding ships on Rishi moon, the droid killed Clone trooper Droidbait. As he entered the listening post, he shot and killed clone trooper Sergeant O'Niner, and another clone, CT-327. The remaining four clones escaped, and the captain thought they were inferior though one of the commando droids reported there were four missing clones. The droids took control of the base and replaced the alarm with an \"All Clear\" signal. They contacted General Grievous, who instructed the captain to continue transmitting the signal. When clone troopers Cody and Rex arrived, the droids destroyed their Nu-class attack/transport shuttle. Later, the clones were able to take control of their station and destroy all the droid commandos, including the captain."}, {"tag": "p", "text": "One commando droid captain served at the Citadel and was present during the Battle of Lola Sayu. The droids were also used by the Separatist Gungan Rish Loo on Naboo against Anakin Skywalker and Padmé Amidala, and parts from a commando droid captains were turned into monster droids. One monster droid and another were used with other monster droids as target practice for Death Watch."}, {"tag": "p", "text": "The droids were also used by the Confederacy during the Battle of Dathomir, the Battle on Florrum, and the Battle of Ringo Vinda."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}