{"url": "Commando_pistol", "categories": ["Category:Legends articles", "Category:Blaster pistols"], "nodes": [{"tag": "h1", "text": "Commando pistol"}, {"tag": "p", "text": "The commando pistol was a class of powerful blaster pistols utilized by elite or specialized units in various militaries, particularly by the belligerent factions of the Clone Wars and Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Commando pistol was a moniker used to describe blaster pistols that were of superior firepower and capabilities than their base counterparts. Capable of great rates of sustained fire and low recoil, they were in general pistols designed for greater efficiency than average blaster pistols. This was in part due to the fact that many commando pistols were merely heavily modified or upgraded versions of the standard issue pistols in various militaries, a notable exception being the DC-17 hand blaster. In this capacity, they were commonly issued to pilots or other specialized units during the Clone Wars and Galactic Civil War and associated with elite soldiers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, commando pistols were first issued as the standard side-arm of clone jet troopers, a specialized unit that saw deployment on battles such as the First Battle of Geonosis, First Battle of Kamino, Battle of Rhen Var, Battle of Mygeeto, Battle of Felucia, and Battle of Kashyyyk. The model utilized by the jet troopers was the DC-17 blaster pistol, and it became an iconic weapon of some Advanced Recon Commandos as well. Throughout the war, Alpha-77 \"Fordo\" and CT-7567 \"Rex\" employed twin DC-17 blasters to great effect."}, {"tag": "p", "text": "After the transition from Phase I clone trooper armor to Phase II, clone trooper pilots, formerly issued the standard DC-15S blaster carbine, began to equip themselves with commando pistols. This practice was emulated by the Confederacy of Independent Systems, as commando pistols—in the form of customized SE-14 blaster pistols—saw service with OOM pilot battle droids aboard warships."}, {"tag": "p", "text": "In the time of the Galactic Civil War, this practice continued, with rebel pilots and TIE fighter pilots wielding modified versions of DL-44 heavy blaster pistols and SE-14r light repeating blasters respectively."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The commando pistol is the class of blaster that the DC-17 hand blaster employed by Fordo and Rex in the animated miniseries Star Wars: Clone Wars and Star Wars: The Clone Wars belong to. The DC-17 is not identified as such in the shows, and the classification is only given in the Star Wars: Battlefront and Star Wars: Battlefront II video games. In those games, the clone jet trooper is equipped with a side-arm called the \"commando pistol\", a blaster with a higher rate-of-fire and firepower and lower recoil than that of the DC-15S carried by the other clone units. While the commando pistol is given the same skin model as the DC-15S—Battlefront being notorious for using incorrect models for weapons such as the WESTAR-34 and EE-3 carbine rifle—the video games' strategy guides confirms that the commando pistol is intended to be a \"DC-17 blaster pistol\"."}, {"tag": "p", "text": "With the addition of space combat in Star Wars: Battlefront II, pilots of every faction are also equipped with side-arms called \"commando pistols\", albeit all of different models, each identical in appearance to the standard blaster pistol of their respective factions. Unlike the commando pistol of the jet trooper, the model names of the commando pistols of the pilots are not given in the strategy guide, owing to the fact that the guide decides to only present the generic pilot class without delving into the profiles of the four different pilots. Because the Battlefront series generally reduces the skins of all side-arms to that of the standard blaster of each faction—often incorrectly and non-canonically—its depictions of the appearances of weapons is unreliable. Nevertheless in the absence of further sources, this article assumes that the commando pistols of the droid pilot, imperial pilot, and rebel pilot are modified SE-14, SE-14r, and DL-44 blasters respectively. An exception is made for the commando pistol of the clone pilot, as it is confirmed as a DC-17 for the jet trooper, but it is unknown whether the clone pilot is also using a DC-17 or whether he is using a modified DC-15S."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "See also"}]}