{"url": "Commission_for_the_Preservation_of_the_New_Order/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Commission for the Preservation of the New Order"], "nodes": [{"tag": "h1", "text": "Commission for the Preservation of the New Order"}, {"tag": "p", "text": "The Commission for the Preservation of the New Order (COMPNOR) was an umbrella organization for various entities of the Galactic Empire that were designed to maintain support for Emperor Palpatine's New Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "COMPNOR, which replaced the Galactic Republic's COMPOR, originated as a popular ideological organization, and the Emperor quickly acted to draw it into his sphere of influence—within months of the Declaration of the New Order, the cultural and youth groups had been grafted onto the pre-existing framework of COMPOR. Crueya Vandron, one of the Emperor's advisors, played an important role in establishing COMPNOR as an asset of the Empire, with Sate Pestage and Ishin-Il-Raz also playing important roles."}, {"tag": "p", "text": "Under the leadership of Vandron and Il-Raz, COMPNOR gained a powerful hold over the citizens of the Empire, and its organs insinuated themselves into every corner of society. The Imperial Security Bureau (ISB) was established as a branch of COMPNOR to act as a counterweight to Imperial Intelligence, and it became the Emperor's all-pervasive secret police organization. The Coalition for Progress established monitoring agencies to keep track of all aspects of life."}, {"tag": "p", "text": "COMPNOR also influenced the Imperial bureaucracy, which was technically under the control of the Imperial Senate. The organization was able to place its members, indoctrinated to be loyal to Emperor Palpatine, in every level of government bureaucracy, thus strengthening the Emperor's hold over the Empire."}, {"tag": "p", "text": "In 0 BBY, the Imperial Senate was suspended by direct order of Emperor Palpatine. The end of the Senate left the field wide open for COMPNOR to step in. For all the power of the Moffs and Grand Moffs, COMPNOR stood behind them, still more powerful."}, {"tag": "p", "text": "In 5 ABY, COMPNOR stated that it would give its support to the Imperial claimant Trioculus once he received the \"dark blessing\" of Supreme Prophet Kadann."}, {"tag": "p", "text": "When Coruscant was retaken by the Empire in 10 ABY, the Imperial Ruling Council decided that it was time to elect a new Galactic Emperor. COMPNOR officials along with various admirals, generals, and Moffs disagreed, and an armed conflict soon broke out amongst the various Imperial factions on Coruscant."}, {"tag": "p", "text": "By the end of the Imperial Civil War, COMPNOR no longer existed, which left only the Empire Youth as a Humanocentric organization.[source?]"}, {"tag": "h2", "text": "Ideology"}, {"tag": "p", "text": "The New Order, which was the underlying ideology of the Galactic Empire, was strongly supported by COMPNOR. It criticized the perceived decadence and weakness of the Republic, and advocated an authoritarian and militaristic social and political culture."}, {"tag": "p", "text": "The New Order emphasized Human and, to a lesser extent, near-Human supremacy, with other alien species like Wookiees, Mon Calamari, and Lurrians subjected to discrimination or outright slavery. Antislavery laws were repealed and legislation legalizing the persecution of aliens was passed. As a result, the vast majority of the government officials were composed of Humans, with only rare exceptions like Grand Admiral Thrawn climbing in the ranks of the military."}, {"tag": "p", "text": "A high degree of male chauvinism was also seen in the Empire's military and government. Combining this with the alien persecution, the Empire was often referred to as having pro-HuMan policies."}, {"tag": "h2", "text": "Structure"}, {"tag": "h3", "text": "Select Committee"}, {"tag": "p", "text": "The Select Committee was the executive body for COMPNOR. The Select Committee had a variable number of members, and the COMPNOR charter provided for electoral and honorary means of being named a member of the Select Committee."}, {"tag": "h3", "text": "Sub-Adult Group"}, {"tag": "p", "text": "The Sub-Adult Group, or SAGroup, was COMPNOR's youth organization, and was made up of enthusiastic youths who firmly believed the New Order was the best regime for the galaxy, and devoted their lives to upholding and respecting it."}, {"tag": "h3", "text": "Coalition for Progress"}, {"tag": "p", "text": "The Coalition for Progress was an information-gatherers agency of the Commission for the Preservation of the New Order. It began as a weak cultural organization, understaffed, and underwhelming, but developed into a massive information-gathering agency with monitors throughout the galaxy."}, {"tag": "p", "text": "It examined massive amounts of data, the majority of which was mundane, for indications of dissident or Rebel activity, and forwarded summaries to the more-important Imperial Security Bureau."}, {"tag": "h3", "text": "Coalition for Improvements"}, {"tag": "p", "text": "The Coalition for Improvements was a socio-political engineering agency of the Commission for the Preservation of the New Order. It was assigned to \"improve\" systems, which had deviated from the ideals of the New Order. These systems required long term solutions, and improvements were required to keep their work behind closed doors, as their solutions were typically not best associated with the Empire."}, {"tag": "h3", "text": "CompForce"}, {"tag": "p", "text": "CompForce was the military wing of COMPNOR, created to provide Emperor Palpatine with an army of utterly loyal soldiers separate from the Stormtrooper Corps. Stormtroopers were trained to obey orders without thinking, but at the same time, they were proudly independent of the line military; CompForce units, in contrast, were embedded within the hierarchy of the Imperial Army and Imperial Navy, and their members were motivated primarily by conscious adherence to the tenets of the New Order. In theory, they were shock troops and officer candidates; in effect, they were security troops and political police, answerable to the New Order's ideologues rather than the High Command—an army within the Army, designed to tighten the grip of the Imperial hierarchy on the military."}, {"tag": "h3", "text": "Imperial Security Bureau"}, {"tag": "p", "text": "The Imperial Security Bureau was a part of the Commission for the Preservation of the New Order charged with maintaining morale and loyalty among members of the Imperial military and government, as well as policing its citizens."}, {"tag": "h2", "text": "Membership"}, {"tag": "p", "text": "Imperial citizens were encouraged to join COMPNOR. Members were given exclusive access to breaking news, a free subscription to Iron Will, and a special welcome message from Palpatine himself."}, {"tag": "p", "text": "Presumably, only Emperor Palpatine and a few other key Imperials, including Sate Pestage, Lord Crueya Vandron, and Ishin-Il-Raz, knew exactly how many members there were on the Commission for the Preservation of the New Order. At the height of the Galactic Empire, membership of Sub-Adult Group alone exceeded two trillion members."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}