{"url": "Commission_for_the_Protection_of_the_Republic/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic organizations"], "nodes": [{"tag": "h1", "text": "Commission for the Protection of the Republic"}, {"tag": "p", "text": "The Commission for the Protection of the Republic (COMPOR) was established during the Clone Wars as a political movement of patriotic citizens of the Galactic Republic. Its members were fiercely loyal to the Republic government's head of state, Supreme Chancellor Palpatine, and often lobbied for constitutional amendments that invested greater power within the executive branch. When the Republic was transformed into the Galactic Empire in 19 BBY, with Palpatine as its self-appointed emperor, COMPOR was reorganized into the Commission for the Preservation of the New Order (COMPNOR)."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Commission for the Protection of the Republic (COMPOR) was a political organization created and sponsored by the Office of the Supreme Chancellor during the Clone Wars. Designed to promote loyalty and patriotism within the Galactic Republic, COMPOR's primary function was to brainstorm ideas and reforms that could be implemented in order to ensure the continuation of the Republic amidst the chaos of a galaxy divided by war. The vast majority of its suggestions included, in some form or another, strengthening the power of the executive branch at the expense of the other parts of government. The committee's subdivisions included the Sub-Adult Group (SAGroup), a youth organization composed of adolescent citizens who strongly supported the Republic and its Commander-in-Chief, Supreme Chancellor Palpatine."}, {"tag": "p", "text": "COMPOR also lobbied for the deportation of certain beings from Coruscant, particularly those whose homeworlds supported the rebellion of the Confederacy of Independent Systems. In order to achieve its objectives, the committee sought to encourage government officials to comply with COMPOR's demands, even to the point of resorting to coercive tactics. One such official who was compelled to support COMPOR was First Minister Tannon Praji of the Coruscant Ministry of Ingress. At COMPOR's insistence, Praji deported various alien species from Coruscant, such as the Aqualish and Gossam."}, {"tag": "p", "text": "Near the end of the Clone Wars in 19 BBY, many COMPOR members were commissioned as officers in the Republic Navy. Ensign Luszgoti, an officer with ties to COMPOR, had a confrontation with Captain Null-11, a Null-class Advanced Recon Commando, aboard the naval support ship Redeemer. Luszgoti asserted that clone soldiers and recruited mercenaries did not outrank official members of the Republic Military, such as enlisted personnel and commissioned officers."}, {"tag": "p", "text": "When the Clone Wars was concluded with the decisive defeat of the Confederacy of Independent Systems and the near annihilation of the Jedi Order, Chancellor Palpatine issued the Declaration of a New Order during a special session of the Galactic Senate on Coruscant. In his speech, Palpatine decreed that the Republic was to become the first Galactic Empire, ruled by himself as emperor. COMPOR enthusiastically supported the new absolute monarch and his move to finalize the end of the Republic and its democratic system. Mere days after the birth of Emperor Palpatine's New Order, COMPOR merged itself with the Imperial Security Bureau, an offshoot of the newly formed Imperial Intelligence, to create the Commission for the Preservation of the New Order (COMPNOR). Crueya Vandron and Ishin-Il-Raz, two of COMPOR's earliest members, became leading figures in COMPNOR during the reign of Emperor Palpatine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}