{"url": "Common_Ground", "categories": ["Category:Real-world articles", "Category:Articles with spoilers", "Category:Articles needing illustration", "Category:Incomplete lists", "Category:The Bad Batch episodes"], "nodes": [{"tag": "h1", "text": "Common Ground"}, {"tag": "p", "text": "\"Common Ground\" is the tenth episode of the animated web-TV series Star Wars: The Bad Batch. The episode was released on July 2, 2021."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Batch has their ideology challenged."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Curfew on Raxus"}, {"tag": "p", "text": "The Galactic Empire has occupied Raxus Secundus, the former capital of the Confederacy of Independent Systems. Captain Bragg, who is among the Imperial officers overseeing the occupation, addresses a crowd of citizens who have assembled in a square in the capital city Raxulon. She states that the Empire is not their enemy and will treat all former Confederacy planets fairly in exchange for loyalty. However this has not been forthcoming."}, {"tag": "p", "text": "Former Raxus senator Avi Singh is also present and tells the RA-7 protocol droid GS-8 that he cannot go through with this. GS-8 says this is his only option and warns that he will be arrested like the other senators if he doesn't comply. Captain Bragg announces that due to a rise in incursions, a mandatory curfew will be put in place. Bragg claims that such measures were approved by Senator Singh."}, {"tag": "p", "text": "As the crowd grumbles, Bragg she then summons former Raxus senator Avi Singh to publicly voice support for the Empire. Singh tells GS-8 to follow his instructions in case anything happens. Addressing the cheering crowd, Singh implores his fellow citizens to embrace the new Imperial laws and that Raxus will flourish once more. After struggling with his conscience, Singh instead publicly declares that he can no longer condone the Imperial occupation of Raxus. He says that the Empire wishes to intimidate and to scare them."}, {"tag": "p", "text": "To the crowd's outrage, Bragg has him arrested, and subsequently orders the Imperial troops and several AT-TE walkers to move in on the square. As the Imperial forces disperse the crowd, GS-8 escapes the palace in the confusion and contacts Cid as Singh had instructed prior to his arrest, informing her of the situation and saying that they require assistance."}, {"tag": "h3", "text": "Job on Raxus"}, {"tag": "p", "text": "On Ord Mantell, Omega enjoys Mantell Mix with Wrecker, and inquires about when their next mission will be. Tech reminds her that she is being tailed by two bounty hunters, and advises that it would be best to keep a low profile, to which Hunter agrees, noting that there is too much heat on the group at the moment. Wrecker says that such pressure has not stopped them before, but Hunter argues that Omega has been through a lot and needs a break."}, {"tag": "p", "text": "They enter Cid's Parlor, where Cid assigns them to a mission to extract Singh from confinement on Raxus. Hunter initially objects due to Singh being a former Separatist, but Cid reminds them that their debt is still not paid. Hunter argues that taking Omega to Raxus is far too dangerous due to the heavy Imperial occupation there. Cid offers to look after Omega while the rest of the Bad Batch go on the mission. Hunter reluctantly agrees to leave Omega at the parlor, despite his distrust of Cid."}, {"tag": "p", "text": "Omega wants to come along since she believes she is part of the squad. Hunter replies that following orders should not be a problem. He tells her to stay close with Cid and not to leave the parlor. As the rest of the squad leaves, Cid assigns Omega to janitorial duties including scrubbing."}, {"tag": "h3", "text": "Meeting with GS-8"}, {"tag": "p", "text": "The squad travels aboard the Havoc Marauder to Raxus through hyperspace, planning to land outside the capital city. Wrecker says that they have never been to Raxus before. Tech replies that the coordinates from Cid have them landing outside the capital city of Raxulon, the home of their senator. Echo voices his distaste at the idea of helping a Separatist senator while Tech notes that he has made his distaste vocal repeatedly. Hunter says he did not imagine traveling to Raxus like this."}, {"tag": "p", "text": "The Havoc Marauder descends into Raxus' atmosphere. While flying through the clouds, they encounter two Alpha-3 Nimbus-class V-wing stafighters who tell them that they are flying into restricted airspace. When they request clearance codes, Hunter tells Tech to transmit the clearance codes that Cid supplied. Echo reminds Hunter that their client is a Separatist and asks how can they be sure this is not a trap. The clearance code works but Echo is still not convinced. The Clones fly their ship over a red forest and land in a forest clearing."}, {"tag": "p", "text": "After disembarking, Tech says that their code worked and that their client being a Separatist is irrelevant. Echo disagrees but Hunter tells them to forget politics and that they are here to do a job. The Bad Batch soon meet their client GS-8, who tells them that her master Senator Singh was arrested for speaking out against the \"unjust\" occupation. Hunter says they don't care and insists on getting the job done. GS-8 leads the squad."}, {"tag": "h3", "text": "Babysitting Omega"}, {"tag": "p", "text": "Back on Ord Mantell, Cid notices that Omega is sulking and tells her that she is affecting the mood of her parlor. Omega apologizes. Cid asks what is wrong and Omega explains that she hasn't heard back from her friends. Omega wonders if they will be okay. Cid says that the Clones better be for what this job is paying. Omega wishes she could come with them and says that it is not fair. Cid says that life isn't fair and thinks that Omega should do something about it. She suggests that if Omega was not so helpless, the Bad Batch would not have left her here."}, {"tag": "p", "text": "While the Ithorian Bolo and Weequay Ketch chat at a table, Omega walks away. Cid asks what they are looking at. Omega tells Cid that she is not helpless, sounding hurt. Cid explains that she made a promise to Hunter to keep an eye on her and ensure that she is safe. Omega asks for how much and Cid replies that it is not enough as she walks away."}, {"tag": "h3", "text": "Infiltrating Singh's palace"}, {"tag": "p", "text": "Meanwhile, an AT-TE marches through the streets of Raxulon while Imperial clone troopers stand guard outside Avi Singh's residence. Using his macrobinoculars, Tech spots six exterior guards and multiple heat signatures inside including four in the subterranean level. Echo and Wrecker are suspicious of GS-8 and accuse her of leading them into a trap. Hunter asserts his authority and tells them that they need to take out the compound's surveillance system."}, {"tag": "p", "text": "Moving into position, Hunter takes out a clone trooper. Hunter sends GS-8 out as a distraction. She orders the clone troopers to leave her master's residence. When they approach her, she leads them into a corner where the Bad Batch take out the sentries. GS-8 opens a grill gate door, which allows the clones to enter the compound. Inside the compound, Tech taps into the security system which allows the Bad Batch to keep an eye on the Imperial patrols outside the compound."}, {"tag": "p", "text": "Hunter sends Wrecker and Echo to clear the upper levels while he and Tech will take out the main floor and below. Hunter tells GS-8 to follow them. Inside, Wrecker and Echo stun a pair of clone troopers. Meanwhile, Hunter and his team spot two in the corridor with four adjacent. Hunter says he will handle them and mistakenly tells Tech and Omega to look back around. Tech reminds Hunter that Omega is not on the mission. GS-8 decides to distract the guards by claiming to be lost."}, {"tag": "p", "text": "When the guards confront her, Hunter stuns them with stun grenades. A third clone trooper enters through the door and Hunter fights him, knocking out a vase in the process. GS-8 narrowly saves a second vase from being destroyed and warns the Clones to be careful. She explains that this vase is a priceless relic gifted to Senator Singh for his years of service. Hunter grumbles."}, {"tag": "h3", "text": "A game of dejarik"}, {"tag": "p", "text": "Meanwhile on Ord Mantell, Bolo and Ketch play a game of dejarik with Cid. The Ithorian appears to have the upper hand and Cid is in a tight corner. Omega advises Cid not to make a certain move. Cid ignores Omega's advice and moves her K'lor'slug into position behind her Mantellian Savrip. Bolo's Kintan strider knocks out Cid's K'lor'slug. Omega says that she told her so."}, {"tag": "p", "text": "Cid asks Omega what she should do next. Omega uses the Mantellian Savrip to take out the Kintan strider and the monnok, tipping the scales in favor of Cid. Bolo is furious with his Weequay colleague while Ketch says that he was the one to bet it all. As the two leave two settle their scores outside, Cid asks Omega how she knew how to do that. Cid says that dejarik is a strategy game and that she is good at strategy. Cid asks if Omega is good enough to win a few matches with some money. Omega asks what her cut would be. Cid offers 30% but Omega proposes 60%. Cid strokes her face thoughtfully."}, {"tag": "h3", "text": "Rescuing Senator Singh"}, {"tag": "p", "text": "Back at Senator Singh's residence, Captain Bragg and clone troopers bring an IT-O interrogation unit into the lounge, which has been repurposed into an interrogation chamber. Bragg charges Singh with defying Imperial law and openly inciting civil discord while pouring some wine into glasses. She tells the Senator that they had an understanding. Singh refuses to be an Imperial puppet and says that his loyalty is to the people and not the Empire."}, {"tag": "p", "text": "Bragg dismisses Singh's \"unwise\" choice and says that they will acquire what they need from him. Singh is defiant and says that their draconian tactics won't work on him. Bragg is undeterred and orders the IT-O droid to move into position. Before the droid can inject Singh, someone throws a smoke grenade into the room, blinding the Imperials who are then stunned. The IT-O droid is also stunned. Just then, Hunter and Tech enter the room with GS-8, who tells her master that she has followed his orders to the letter."}, {"tag": "p", "text": "Singh is grateful to GS-8, who adds that she has saved his most prized vase. Hunter asks how they can get out of here. Singh offers to help his rescuers but Tech warns them that an alert has been triggered. Through a datapad that has sliced into the residence's surveillance system, Tech realizes that their position has been compromised. Singh and GS-8 accompany the clones to a balcony where they are joined by Echo and Wrecker."}, {"tag": "p", "text": "Spotting an approaching AT-TE walker, Hunter thinks that they should steal it and blow their way out of Raxulon. GS-8 asks how their plan would work. Just then, the Clones use a grappling cable to land on the AT-TE walker. Tech stuns the gunners and crew with a stun grenade. Wrecker evacuates Senator Singh while Echo evacuates GS-8, who compliments him. Tech takes over the AT-TE walker, while Wrecker throws the unconscious crew out."}, {"tag": "p", "text": "Captain Bragg realizes that the Bad Batch have commandeered an AT-TE walker and orders that they be stopped.  A second AT-TE walker is dispatched after the Bad Batch. It manages to hit the Bad Batch's rear axial stabilizer. Tech warns they have to recalibrate manually. Hunter tells him to get the tank running while he and the others hold off the Imperials. Hunter and Echo manage to stun several clone troopers while Wrecker grabs the walker's cannon, redirecting its blast away from the hijacked walker. Wrecker and Hunter use a stun grenade to stun the crew."}, {"tag": "p", "text": "However, more clone troopers and a third AT-TE walker arrive. The Bad Batch are soon surrounded by clone troopers, who order them to surrender. GS-8 enters the fight and knocks out one with the vase, allowing Tech and his comrades to stun the rest. Senator Singh admits he never much cared for that vase. With their repairs complete, the Bad Batch escape in their hijacked walker. Singh advises the clones to bring their hijacked walker down a certain alleyway. Tech warns they will be trapped, but Singh tells them to trust him."}, {"tag": "p", "text": "The pursuing Imperial walkers follow the hijacked AT-TE walker into the alleyway. Singh tells them to move into position near that wall, since it leads to a subterranean passage. The Clones bring their walker to kneel. Under Singh's guidance, Wrecker blows a hole in the wall with a grenade. The Imperials blast the runaway walker while the Clones, Singh, and GS-8 flee underground. Meanwhile, the Imperials find the walker is empty."}, {"tag": "p", "text": "Singh, GS-8 and the Bad Batch find their way back to the Havoc Marauder in the forest clearing. Before boarding the ship, Singh asks GS-8 what he is doing. Singh doesn't want to abandon his people and help them. GS-8 says he will help them if he is not in Imperial custody. Echo agrees with GS-8 and counsels Singh to live to fight another day. The Bad Batch depart the forests of Raxus and fly into space."}, {"tag": "h3", "text": "Omega's new strength"}, {"tag": "p", "text": "Back on Ord Mantell, the Bad Batch discover speeders parked outside Cid's parlor. Inside, they find several patrons including a Gotal, Bolo, and Ketch gathered around a table as Omega plays dejarik against a Pantoran. The Pantoran's Kintan strider knocks out Omega's K'lor'slug. However, Omega with Cid's support uses her monnok to take out the Pantoran's Kintan strider and Mantellian Savrip, winning the match. The Pantoran looks with dismay before walking away."}, {"tag": "p", "text": "As the crowd cheers, Omega spots the Bad Batch and runs over to Wrecker. Wrecker asks where she learned to do that. Cid remarks that Omega is a natural strategist. Hunter says that he told her to keep a low profile but that this is the opposite. Cid tells him to cheer up because Omega made enough money to help them pay off the debt that they owe her. Cid praises Omega before turning her attention to Senator Singh's payment."}, {"tag": "p", "text": "Later, Hunter asks if Omega paid off their debt. Omega says that she wanted to be useful even though she could not go on the mission. Hunter asks if Omega is interested in putting her strategy skills to the test. He proposes one match with the promise that if she wins, she doesn't have to sit out on missions. Omega accepts the challenge. Hunter asks if she is ready, prompting Omega to ask if he is ready. The two sit down for a game of dejarik."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}