{"url": "Communication_station", "categories": ["Category:Legends articles", "Category:Christophsis locations", "Category:Galactic Republic locations", "Category:Outer Rim Territories structures"], "nodes": [{"tag": "h1", "text": "Communication station"}, {"tag": "p", "text": "The communication station, also known as the comm station, was a base of operations built by members of the Galactic Republic's Grand Army of the Republic in the Outer Rim planet Christophsis's capital, Chaleydonia, in 22 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The communication station was built on the Outer Rim planet Christophsis's capital, Chaleydonia. It was utilized by the Republic's 501st Legion during the Battle of Christophsis to coordinate transmissions in the ongoing battle, and was equipped with a holoprojector to show an active map of the battle."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Construction and usage"}, {"tag": "p", "text": "During the Battle of Christophsis in 22 BBY, Jedi Generals Anakin Skywalker and Obi-Wan Kenobi used the station as a command center to plan a strike on a shield generator being used by the Confederacy of Independent Systems to give its forces protection from the Republic's AV-7 cannons during the latter faction's assault on the city."}, {"tag": "p", "text": "In the ensuing battle, the Confederacy forces overran the Republic lines, including the communication station, as the battle progressed. In the process, the communication station was heavily damaged and the Confederacy troops overwhelmed the Republic clones, and Kenobi was forced to order Clone Captain CT-7567 \"Rex\" to retreat while he delayed the incoming droids in an attempt to buy time for the shield generator to be destroyed."}, {"tag": "h3", "text": "Aggressive negotiations"}, {"tag": "p", "text": "Kenobi stood his ground against the oncoming battle droids and managed to eliminate numerous droids before being forced to surrender to Separatist General Whorm Loathsom/Legends in an attempt to buy time for Skywalker to destroy the shield generator. The negotiations ended with Kenobi holding his lightsaber to Loathsom's throat, forcing the latter's escort to hold their fire on the Jedi."}, {"tag": "p", "text": "Shortly thereafter, the shield was destroyed by the combined efforts of Skywalker and his Padawan Ahsoka Tano, the clone troopers surged forward to Kenobi's position and regained their former positions, fighting past the communication station and securing their victory over the Separatists. After the victory over the Confederacy forces, Grand Master Yoda convened with Kenobi at the communication station and proceeded to inform him of his next assignment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The communication station first appeared in the  junior novelization of the 2008 film Star Wars: The Clone Wars by Tracey West and simultaneously in the adult novelization by Karen Traviss on July 26 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}