{"url": "Communications_relay", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Comm units"], "nodes": [{"tag": "h1", "text": "Communications relay"}, {"tag": "p", "text": "A communications relay or a relay dish was a communications unit widely used by militaries to send and receive transmissions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A communications relay consisted of a main dish through which an antenna was installed. A relay was used for sending, receiving, and in certain cases, intercept transmissions."}, {"tag": "p", "text": "Widely used by the military of the Galactic Empire, communications relays were a common sight throughout Imperial worlds, perched atop Imperial ground-based installations. The Empire's KX-series security droids were also each fitted with a full comm relay."}, {"tag": "p", "text": "The TIE/fo space superiority fighter of the First Order were optionally installed with a Comm Relay upgrade."}, {"tag": "p", "text": "The comm booth and holobooth both functioned in a similar way, only being public stations for communications."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "There were communications relay emplacements throughout Imperial worlds, including Mustafar, Stygeon Prime, and Lothal. In particular, during Lothal's period of Imperial occupation, an Imperial installation there had a communications relay that was disabled along with the facility itself during a sabotage mission conducted by the Spectres, a rebel cell seeking to undermine Imperial control. The rebel Ezra Bridger first assaulted the facility with an appropriated All Terrain Missile Platform during the extraction of the Ithorian rebel sympathiser Dorthu Santim, before the rebel group's leader, Hera Syndulla, arrived with her modified VCX-100 light freighter, the Ghost, and landed the rebel Sabine Wren, who broke into the Imperial base amidst confusion in its personnel and sabotaged it."}, {"tag": "p", "text": "Jalindi Station was a massive relay dish developed and used by the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}