{"url": "Community", "categories": ["Category:Legends articles", "Category:Unknown Regions organizations"], "nodes": [{"tag": "h1", "text": "Community"}, {"tag": "p", "text": "The Community, also known as the Jedi-Sith clones, were clone humans created in a top-secret Imperial facility under Grand Admiral Thrawn on a Frozen moon in the Unknown Regions. They were created using the DNA of Emperor Palpatine and that of various Jedi, including Kam Solusar, Jaden Korr, Lumiya, Kyle Katarn and possibly Mara Jade Skywalker and Lassin. Their creation was supervised by Dr. Gray."}, {"tag": "p", "text": "These clones were kept in isolation, which contributed to their slow descent into madness. Over time, they gathered spare parts and were able to create lightsabers. The clones soon rebelled, killing the entire science team and stormtrooper detachment. The clones remained in the lower levels of the facility until 41 ABY, when Jaden Korr and Khedryn Faal stumbled upon them while following one of Korr's Force vision, and by the Anzat assassin Kell Douro. Korr killed Alpha, a clone of Kam Solusar, before the rest of the clones and their progeny escaped from the moon using Douro's ship, the Predator. There were at least ten clones on the ship when it escaped."}, {"tag": "h2", "text": "Community members"}, {"tag": "p", "text": "Many clones were created in the experiments of Thrawn, but many of them died because of a genetic degeneration and during internal conflicts resulting from their mental instability. Their children also died in large numbers, having inherited the disease gene from their parents. So when Jaden Korr came back on the Frozen Moon in 41 ABY, they were only eight clones and three of their children still alive."}, {"tag": "h3", "text": "Clones"}, {"tag": "h3", "text": "Clones' children"}, {"tag": "h2", "text": "Other Jedi-Sith clones"}, {"tag": "p", "text": "In addition to the clones who formed the Community on the Frozen Moon, there were the Jedi-Sith clones created by the One Sith in order to perpetuate Thrawn's project and maybe Jaden Korr who was placed on Coruscant and later joined the New Jedi Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi-Sith clones first appeared in the novel Crosscurrent by Paul S. Kemp. While it is not confirmed precisely which Jedi were cloned, the Force vision Korr received implies that, at minimum, Mara Jade, Lassin, and Lumiya were cloned. There were other clones of unidentified Force-sentitives."}, {"tag": "p", "text": "In the novel Riptide it was hinted that Jaden Korr himself was a clone but there was no secure proof."}, {"tag": "p", "text": "At both the end of Crosscurrent and several times in Riptide, it is mentioned that eleven clones escaped from the moon in Kell Douro's ship. However, only twelve clones are ever named, and two of them - Alpha and Wry - are known to have died on the moon. It is unknown if Jaden Korr was simply mistaken in his count or if there is indeed an eleventh clone unknown to or already split from The Community."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}