{"url": "CompForce_Assault_trooper", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Imperial military specializations"], "nodes": [{"tag": "h1", "text": "CompForce Assault trooper"}, {"tag": "p", "text": "CompForce Assault troopers are the soldiers of CompForce's Assault branch."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Assault troopers were recruited directly from SAGroup and were required to serve a five year tour of duty with both a re-up option and recall-to-service clause. Training for an Assault trooper included the fundamental basics of combat, but the the majority of the training was in political indoctrination. Training was extremely dangerous for Assault troopers, with an 88% failure rate as trainees were driven to the limits of exhaustion, live-fire exercises, and survival training with no rescue. This resulted in extremely loyal and dedicated troops, but ones that were poorly trained."}, {"tag": "p", "text": "Due to CompForce's reputation with the regular Imperial Army and Navy, Assault troopers were despised by the rank and file. Their reputation was not helped by the view that they had access to superior medical facilities and equipment than line units. Other military units would often find better things to do than reinforce Assault units, and military commanders often deployed them as \"soak\" units to absorb casualties to protect more useful troopers."}, {"tag": "p", "text": "Despite their poor training, Assault troopers who manage to survive began to train themselves and become more formidable soldiers. These veterans passed on their skills to the newer recruits, increasing their combat effectiveness. Due to their indoctrination, Assault units never broke or retreated."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Assault troopers wore uniforms that were distinct from those worn by other regular Imperial units, combined with heat reflective power armor. Standard equipment included blaster rifles, heavy blaster pistols, knives, and grenades."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}