{"url": "Company/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Company"}, {"tag": "p", "text": "A company was a military ground infantry unit, normally comprising an average of 144 soldiers."}, {"tag": "h2", "text": "Grand Army of the Republic"}, {"tag": "p", "text": "In the Grand Army of the Republic, a normal company of clone troopers consisted of four platoons, totaling 144 clone troopers, 16 sergeants and 4 lieutenants, led by a Captain. This gave a company a full strength of 165 soldiers, not including support personnel. Four such companies formed a standard battalion. Among the clone commando forces of the Special Operations Brigade, however, a company contained 100 commandos, organized in 5 troops, and five companies formed a Commando Group."}, {"tag": "h2", "text": "Galactic Empire"}, {"tag": "h3", "text": "Imperial Army"}, {"tag": "p", "text": "Once the Grand Army of the Republic had been reorganized into the Imperial Army, the company of four platoons remained standard, but companies dedicated to specialized roles were now organized differently, with different numbers of troops and equipment. In addition to the four combat platoons, each company was equipped with a dedicated detail of command and support personnel. This made the company the smallest type of unit which could operate autonomously of its parent formation for any extended period of time. The Imperial Army's company formation was considered sufficient force for capturing an entire city."}, {"tag": "p", "text": "The company commander, a Captain, was assisted by a command element of four staff officers of Lieutenant rank designated SC1 through SC4, along with 23 support personnel and an average of 118 droids. If the company was expected to go on a mission longer in duration than usual or completely isolated from all other support, the support staff would be augmented with additional droids."}, {"tag": "p", "text": "The company could also be augmented per their standard Order of Battle (OB), in which case the additional units were commanded by the company's second-in-command."}, {"tag": "h4", "text": "Line Company"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "A line company was a standard, run-of-the-mill infantry company, having four line platoons for a total of 152 troopers and 180 personnel total. It could be augmented with two heavy weapons platoons and two additional line platoons."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Drop Company"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Drop companies were essentially line companies given additional support staff and designed to operate independently on missions of up to six weeks, although two weeks was the standard. The support staff was given additional training for survival in hazardous environments and taught this information to the troopers. Ideally the support staff could keep the company going until they ran out of ammunition, though realistically keeping the company functional after a month on a planet's surface was considered a good job. The drop company's OB differed from a normal line company in that it could be augmented first with a heavy weapons platoons, then two additional line platoons, and finally an armor platoon."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Assault Company (Heavy Weapons Company)"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "This company unit had two assault platoons and two line platoons which, depending on the configuration of the assault platoons, gave it a total strength of 180 to 198 men with 152 to 170 combat troopers. The line platoons in these companies equipped all of their squads with light repeating blasters, though in later years each platoon replaced one of these for a medium repeating blaster to improve firepower flexibility. It could be further augmented two additional assault platoons and two additional line platoons, essentially doubling in size."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Repulsorlift Company"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Consisting of two line platoons and two repulsorlift platoons, a repulsorlift company totaled 220 men, of which 188 were combat troopers and the rest command and support personnel, along with 22 combat vehicles, 8 support vehicles and a command vehicle. Each of the repulsorlift platoons carried a line platoon for deployment in combat. An augmented company could have first a scout platoon and one additional repulsorlift platoons too accommodate a third line platoon."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Scout Company (Scout Troop)"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "A scout troop contained four scout platoons plus the support and command element, for a total of 116 troopers and 40 speeder bikes. The whole command element was mobile, using high-powered command speeders instead of bikes, as was the support element, though the staff was smaller than in other company types and contained fewer droids due to their independent nature, the normal \"lean and mean\" mentality of scout troops, and the sheer fact they wanted for storage space. Scout troops could be enlarged with four additional scout platoons to double their size."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Attack Armor Company"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "This generalist armored company contained three armor platoons and a heavy weapons repulsorlift platoon. The size of these companies varied from from 200 men, 16 heavy tanks and 9 heavy weapons repulsorlifts to 232 men, 28 light or medium tanks and 9 heavy weapons repulsorlifts. Additionally the company had a modified heavy tank as a command vehicle for the captain which, unlike modified medium command tanks, was expected to perform all functions simultaneously and so featured extra heat extractors. Fully augmented companies had an additional armor platoon, followed by a repulsorlift platoon, a line platoon, and finally a second repulsorlift platoon."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Breakthrough Armor Company (Heavy Armor Company)"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Breakthrough armor companies were designed specifically to penetrate enemy lines, cause havoc in their rear, and seize lightly held objectives until further troops arrived. For this reason they consisted of four armor platoons for a total of 21 or 37 tanks (depending on the platoon's configuration), one of which was the captain's heavy command tank. Unlike other companies, the support element of this company stayed with the battalion's headquarters and did not travel into the combat zone. Since the company was usually cut off from any resupply, their mission profile limited them to operating for a maximum of 72 hours before significant supply problems started rendering them combat ineffective. Four more armor platoons could augment this company to its full size."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Artillery Company (Artillery Battery)"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Artillery companies consisted of four artillery platoons, totally 16 heavy or medium artillery pieces or 32 light artillery pieces. They were smaller than other companies with a total of 152 troopers, 23 support personnel and only 70 droids. Normally requests for fire support were routed through battalion headquarters, although if there was time to plan before a battle a company could be assigned to support several specific platoons in a process known as \"grafting.\" Request from these platoons went directly to the artillery company's captain, who was given discretion to respond to them as he saw fit. An artillery company could be augmented with two heavy weapons platoons and two additional artillery platoons."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Special Missions Company"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Three special mission platoons and an augmented scout platoon made a special missions company. It had a command element of 28 and 136 troops for a personnel total of 160, although the support staff was usually omitted if the mission was of short duration. The augmented scout platoon was smaller than a normal scout platoon but consisted entirely of scout lances for a total of 22 scouts and just as many speeder bikes. Their bikes were also modified to carry additional spare parts and munitions, and the scouts generally saw far more combat than scout platoons normally saw. Each company could be augmented with two additional special mission platoons and two repulsorlift platoons."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "These companies were deployed on planets considered hostile to the Empire, even those nominally a part of it, and were expected to operate without much support. In rare instances when it was needed, naval support missions of line size or greater would appear suddenly from hyperspace and launch scores of containers of various sizes which landed at various points on the planet's surface. Normally only five contained actual supplies, the rest being decoys, and once received the naval support either left or stayed to provide additional orbital support."}, {"tag": "h3", "text": "Stormtroopers"}, {"tag": "p", "text": "The Stormtrooper Corps appears to have employed companies of 225 men, as there are references to units of 45 troopers within a company structure (probably five-squad platoons), and to three-company deployments with 540 troopers. Standard stormtrooper battalions, however, are cited as comprising 800 to 820 men, very close to the size of standard line battalions of 810 to 826 men, and it may be that some stormtrooper companies were organized on a four-platoon model, similar to that of comparable Army units."}, {"tag": "p", "text": "Under the Empire of the Hand, the stormtrooper company structure seems to have undergone some reorganization: by 22 ABY, Aurek Company in the 501st Legion consisted of just forty troopers, divided directly into numbered squads of four men each. Something similar may have persisted in the revitalized Empire of the second century ABY, where it seems that squads were still directly subordinate to company command."}, {"tag": "h2", "text": "Other"}, {"tag": "p", "text": "Another known company with the Grand Army of the Republic was the Tango Company.\nThe Yuuzhan Vong equivalent of a company was a scourge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}