{"url": "Compellor", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Captured starships", "Category:Immobilizer 418 cruisers", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Compellor"}, {"tag": "p", "text": "The Compellor was an Immobilizer 418 cruiser in the Imperial Navy under the command of Captain Rigell. It was stolen by members of the Alliance to Restore the Republic, who removed its gravity well projectors and then scuttled the ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the Compellor was assigned to Admiral Senn's Task Force Vengeance, as a key tactical vessel in the mission to assimilate the Airam Sector into the Galactic Empire. Paired in a small battle group with the Imperial-class Star Destroyer Rage, Compellor acted as a powerful tool in the task to hunt down hiding Rebels and Airam pirates. When the fleet encountered an enemy staging area, the Compellor prevented the enemy from escaping into hyperspace."}, {"tag": "p", "text": "The Rebels were quick to understand the tactical importance of the Compellor and repeatedly tried to destroy it without success. It survived an assault by pilots of Viper and Phoenix Squadrons at the attack on the Compellor, and was ordered to Repair Yard KDY-77 in the Swellen system to have an anti-warhead missile defense system installed. En route, it was diverted to join Battlegroup Orion to the ambush in the Goff system, where Compellor was the only ship to escape the Rebel trap."}, {"tag": "p", "text": "Subsequently, the Rebels managed to track it to the repair facility, captured the Interdictor during the Battle of Swellen, and took it to an Airam X7 Factory facility in the Mobetta system. There, the Rebels removed the gravity well projectors from the damaged vessel and incorporated them into the modified Strike-class cruiser Peregrine."}, {"tag": "p", "text": "Once the Peregrine left the facility, an Imperial search group located the now useless interdictor. Sending in a flight of Delta-class stormtrooper transports to investigate the dead vessel, the Imperials were taken by surprise when the Compellor, rigged with explosives, exploded from within. All the transports were destroyed along with the cruiser, erasing all evidence of the Rebels' possession of the gravity well projectors and opening the retreat from Gallofree."}, {"tag": "h2", "text": "Appearances"}]}