{"url": "Computer/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Computer technology"], "nodes": [{"tag": "h1", "text": "Computer"}, {"tag": "p", "text": "A computer was a ubiquitous piece of hardware utilized in a multitude of applications throughout the galaxy, from droids to starfighters to datapads. A computer consisted of an input system, a processor to accomplish tasks, and an output to relay information or commands. A computer generally used complex mathematics to run varying protocols, such as numerical calculations, synchronous communication (with encryption), sensor interpretation and coordination, even the complex systems of artificial life-forms, such as droids, built around an artificial intelligence."}, {"tag": "p", "text": "The complete details of computer systems, sub-routines, computing languages and processing functionality are probably too manifold to specify in a comprehensible fashion. However, the clear purpose and usage of computer systems throughout the galaxy can be enumerated and commented on at length."}, {"tag": "p", "text": "A minicomputer referred to a smaller version of a computer."}, {"tag": "h2", "text": "Data"}, {"tag": "h3", "text": "Personal computing"}, {"tag": "p", "text": "In everyday life throughout the galaxy, sentients of all types used computers to work more efficiently, store and retrieve information and communicate extensively."}, {"tag": "p", "text": "A commonly used device was a datapad, the computing capacity of a datapad allowed for it to interface with other computer systems, at times analyze surroundings through sensors, even play holo-recordings for informational or entertainment purposes. These personal computing devices could serve as mobile workstations to access and maintain facility and starship systems through wireless and hard-wired connections.\nThe systems within personal starships were all coordinated and integrated through computers. The Navigation computer, also known as a \"navicomputer\", is a prime example. The Hyperdrive and navigational systems needed to communicate in order for travel in Hyperspace to be possible. At the heart of this communication was the Navicomputer, a computing device that factored the location of the given starship, desired destination, and intended travel route through Hyperspace in order to determine a safe route for the starcraft. This required the accessing and processing of starcharts, interpretation of sensor data from the ship's own sensors, communication with the systems of the Hyperdrive and its various failsafes as well as diagnostics of every involved system. The Ship's computer handles all of these tasks with near instantaneous results and an incredibly high rate of success and efficacy.\nNumerous facilities and affiliations maintain and use computer systems for informational and organizational purposes. The Jedi Order maintained an information archive, in effect a massive encyclopedic computer system for data storage and access. A communication system built around computers with a beacon to alert traveling Jedi to recent events was used. A Holo-security recording system was run via computers on the Jedi Temple premises. These are just some of the applications of computers known throughout the galaxy."}, {"tag": "h3", "text": "Droids"}, {"tag": "p", "text": "Droids were humanoid frames, made of various materials, that were loaded with artificial intelligence units. The materials varied by the droids designed use. Different droids were loaded with different AI's and programs, which were classified under one of five classes. Class one droids dealt with medicine, mathematics, and physical sciences.Class two droids dealt with engineering tasks, environmental work, and repairing starships.Class three droids interacted with organic beings in tasks dealing with protocol, tutoring, and child care.Class four droids included security droids and assassin droids. Class five droids were for basic labor.Astromech droids were loaded with navigational, repair, and ship design computer programs that allowed them to preform these tasks. While Protocol droid AI units were loaded with Language, Diplomatic, and other Computer programs. Medical droids contained programs that dealt with medications, surgical procedures, biology, and other medical protocols. Astromech droids such as R2-D2 and T3-M4 were very talented at slicing. R2 was able to open virtually any door, which has saved many lives. R2 was able to open the doors on the shield base on Endor, allowing the Death Star to be destroyed. As well as opening the doors on Bespin, to try and reach Han Solo and Boba Fett."}, {"tag": "h3", "text": "Starships"}, {"tag": "p", "text": "Among computers, some were made for specific tasks, such as Navigation computer's or nav computers. These computers were specialized processing units used to calculate hyperspace and realspace jumps, trajectories, and routes. These computers plotted routes based on received drift charts and other navigational data based on the data received from the ship sensor array. The Millennium Falcon was equipped with a FabritechANq-51 sensor array computer. This sensor allowed the Millennium Falcon to scan up to 500,000 Kilometers for ships and other objects. Sensor arrays have a long-range sensor device, to scan around the ship; a computer to read the sensor data; and a display to show the data. There are many different types of sensors: Passive-mode sensors, which gather immediate area data; Scan-mode (Active sensors), which collect long-range data; Search-mode sensors, which scan specific areas; and Focus-mode sensors, which scan small areas with great accuracy. Full-spectrum (universal sensors) have multiple scanners that scan in different ranges and modes to detect nearly all objects, emissions, or energy fields. Electrophoto receptors (EPR's) are short-range visual scanners combining infrared, ultraviolet, and standard ranges to gather information. These scanners can focus on emissions left by engines, heat, comm transmissions, and weapons. Most scanners can also detect organics, gravitational anomalies, and disturbances in hyperspace All of these sensors are controlled and monitored by the ship computer, which sends the data to the operator through text or graphics on a data screen."}, {"tag": "h3", "text": "Slicers and hackers"}, {"tag": "p", "text": "Where there were computers, there were safeguards. Passwords, retinal scanners, fingerprint scanners, and voice-recognition were among these. These safeguards were programs that protected a persons personal data and unauthorized use of the computer, but programs could be made to find glitches, introduce viruses, spy-ware, and ways to get around those safeguards. The people that dealt with these illegal programs were called slicers. Slicers used computer programs that were usually self-made to find the glitches and loop-holes, as well as slicing by hand. Slicing by hand took very detailed knowledge of computers and skill to hack using sheer knowledge of code to cheat around security and find passwords through information around them. Some companies made anti-security devices to hack through security, such as the Anti-register device. Slicers used their computer and hacking skills to cheat people out of money in their bank accounts, steal personal information to obtain profit, and access information that is restricted. Even though it was illegal, many criminals indulged into the role of slicing. Republic clone commando units were taught to slice into computers blocking their path or to get information needed to complete their mission for the good of the Republic. Though Jaing, a Null-class Advanced Recon Commando created and introduced a virus into thousands of banks, that siphoned off very small amounts of credits out of millions of bank accounts, which led to him gaining billions of credits."}, {"tag": "h3", "text": "Anti-Security devices"}, {"tag": "p", "text": "Anti-Security devices were created to break security without needing to hand slice, or making programs to slice.\nSeveral known Anti-Security devices include:"}, {"tag": "p", "text": "An Anti-register device was a tool that enabled the user to crack into any-print reliable security system, thought the only one known was destroyed on Phindar during its liberation."}, {"tag": "p", "text": "An Electronic Lock Breaker was an anti-security device that could override alarms and open most computerized locks and were carried by most slicers, criminals, espionage agents, bounty hunters, and thieves."}, {"tag": "p", "text": "A Slicer Chip was a miniaturized electronic lock breaker that was specifically modified to hack into computers, droids, and automated devices."}, {"tag": "p", "text": "A Universal Jammer was a sensor countermeasure device the was able to foil most common scanners, and were extremely expensive."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "During the early stages of the Galactic Civil War, a passenger attempted to bring a tablet computer along for a ride. However, it ended up deleted by the baggage check droid, G2-9T, after some miscommunication with Spaceport THX1138's main computer regarding what the object was."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Computers were a type of technology present in both the Star Wars franchise and in real life."}, {"tag": "p", "text": "The tablet computer that G2-9T accidentally destroyed was a MacBook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}