{"url": "Computer_spike", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Computer spikes"], "nodes": [{"tag": "h1", "text": "Computer spike"}, {"tag": "p", "text": "Computer spikes, also known as data spikes, were electronic devices that, upon insertion into a computer, allowed the user to access classified data and programs. Spikes could be set to initiate a program or be operated manually, and plugged into the same kind of sockets as scomp links. They were often used in infiltrations and thefts."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Computer spikes were handheld, vaguely cylindrical devices designed for hijacking computer systems. They could be inserted into a target computer by an astromech droid, or be inserted and operated manually. They could be used in infiltrations or to open locked doors. Spikes were also a common tool in starship thefts, used to overload the target ship's defences."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Computer spikes were in use by the end of the Republic Era. In 19 BBY, during the issuing of Order 66, mind-controlled clone troopers onboard the Tribunal used a data spike to manually open the door of the medical bay former Jedi Padawan Ahsoka Tano had sealed herself inside with three astromech droids in order to perform emergency surgery on Clone Commander Rex to remove his behavioral modification biochip and free him from the brainwashing. The clones succeeded in getting the door open, however, the efforts of droids RG-G1 and CH-33P were able to reseal the door, and Tano was able to fight off the attackers with some last-minute assistance from Rex. The attacking clones eventually cut the door out of the frame with blowtorches, but by that time Tano and her allies had finished what they needed to do inside the room, and successfully fought their way out."}, {"tag": "p", "text": "During the early rebellion against the Galactic Empire, members of the Spectres rebel cell hijacked the Imperial Communications Center on Lothal so they could send an anti-Imperial broadcast. During the raid, Sabine Wren and C1-10P \"Chopper\" plugged a data spike into the communication tower's computers in order to carry out the hijacking."}, {"tag": "p", "text": "Later, during the Galactic Civil War, Chopper was himself hijacked by Imperial controller LT-319 during a mission to the moon Killun 71. After the crew of the Ghost had subdued the rogue droid, Captain Hera Syndulla used a data spike while hooking Chopper up to her ship in a successful ploy to both undo the hacking and destroy LT-319 and his ship remotely."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first canonical appearance of a computer spike was in the Star Wars Rebels season 1 episode \"Call to Action\". They were first identified as computer spikes in the accompanying episode guide on StarWars.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}