{"url": "Con_artist/Legends", "categories": ["Category:Legends articles", "Category:Con artists"], "nodes": [{"tag": "h1", "text": "Con artist"}, {"tag": "p", "text": "A con artist, grifter, flammer, or hustler was a person who tricked, or conned, other individuals out of their credits or property by way of lying, cheating or defrauding."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Most con artists preferred to make a quick turnaround, choosing their mark, deceiving them and then disappearing with the pilfered credits all within a matter of minutes. Due to their desire to avoid violent confrontations, con artists chose their marks carefully."}, {"tag": "p", "text": "The rarer, and more dangerous type of con artist performed the long con. These grifters set up extensive and elaborate cover stories to gain their target's confidence. These con artists often made off with a much larger fortunes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 4000 BBY, the space pirate Quanto attempted to con a young Nomi Sunrider out of her collection of precious pontite crystals. He \"accidentally\" bumped her, while pickpocketing her at the same time. He was subsequently found out and confronted by Sunrider's husband, Andur."}, {"tag": "p", "text": "Dannl Faytonni and Achk Med-Beq were two experienced Human con artists on Coruscant in the years leading up to and during the Clone Wars. They tended to prefer the lucrative payoffs of the long-con rather than quick turnaround sort. The pair were able to win two Republic Security Force uniforms through their gambling exploits using them to pose as Security Officers. They were selecting marks in the Outlander Club in 22 BBY when Obi-Wan Kenobi and Anakin Skywalker apprehended the bounty hunter Zam Wesell."}, {"tag": "p", "text": "During the Clone Wars, after a plan to scam a dowager out of her money at the Galactic Senate failed, their target decided to call the Senate Guard. The pair were chased by Senate Commandos led by Faro Argyus away from the Senate. Faytonni decided that they would need to leave the planet's surface and escape to Coruscant's orbit. They took a speeder to a landing platform on which Senator Padmé Amidala's J-type star skiff was located. The skiff was being prepared for takeoff by Amidala's protocol droid, C-3PO, and Representative Jar Jar Binks. The told C-3PO and Binks that they were commandeering the skiff for \"government business,\" before Faytonni instructed the droid to finish his preparations. Entering the cockpit, C-3PO prepared to disengage the ship's autopilot, before the landing platform, and the ship, were suddenly flipped upside-down due to an error made by Binks in his preparations. The Gungan righted the platform, and Faytonni hurriedly beckoned Med-Beq onto the ship once the droid had exited. Unfortunately the ship was programmed to bring them back to the Senate."}, {"tag": "p", "text": "Lirin Banolt was a Human conman and thief operating on Tatooine. He posed as an Imperial Procurement Agent to perform his cons. This offense was overlooked by the Empire due to the fact that he was in the employ of Sate Pestage, stealing priceless artifacts for his personal collection. He was executed by agents of Pestage when he became too greedy and attempted to blackmail the Grand Vizier."}, {"tag": "p", "text": "In 19 ABY, the con artist Flim was hired by Moff Vilim Disra to impersonate Grand Admiral Mitth'raw'nuruodo in an attempt to bring several officers within the Imperial Starfleet under his command and ultimately cause a civil war within the New Republic. His charade was discovered and exposed by Gilad Pellaeon, Supreme Commander of the Imperial Remnant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}