{"url": "Cona/Legends", "categories": ["Category:Legends articles", "Category:Desert planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Inner Rim planets", "Category:New Republic planets", "Category:Planets with ammonia atmosphere"], "nodes": [{"tag": "h1", "text": "Cona"}, {"tag": "p", "text": "Cona was an arid, desert world which orbited the blue giant Teke Ro, located in the Teke Ro system of the Inner Rim. The homeworld of the serpent-like Arcona species, Cona had a minimal water supply due to a geological catastrophe early in its history."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Cona was a world with a lush, tropical environment. Thanks to the lack of planetary axial tilt and temperature-distributing air currents, the climate remained effectively constant across the entire planet—hot and dense. The atmosphere had a high concentration of ammonia, which permeated the planet's jungles. Oxygen was found in Cona's bedrock, and was only brought to the surface through highly complex plant life that stored it in gastric pods. Water was hard to find on Cona, and what little there was on the world was collected and stored by native plant life. The Arcona, living in small, low-tech communities on Cona, harvested the water from plant pods."}, {"tag": "p", "text": "Because of the atmosphere's high concentration of ammonia, most non-Arcona species were forced to don breath masks when on the planet. While most non-native species dwelt in massive colonial cities, legends persisted that a colony of Duinuogwuins made their home in the ammonia-filled jungles of the world."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A low-tech world located on the galaxy's Inner Rim, Cona was home to the reptilian Arcona species. Discovered by scouts from the Galactic Republic during the settling of the Slice, Cona's natives were quick to venture from the world aboard starships developed by other cultures to explore the greater galaxy and bring back technologies of other species to Cona. As non-Arcona began exploring Cona, entrepreneurs discovered the rich mineral resources of the world and traded mass shipments of water in exchange for mining rights. Cona swiftly became home to many of the galaxy's largest mining companies, and some smaller ones like Nemlor Minerals; the world gained a seat in the Galactic Senate as its importance in the mining industry increased."}, {"tag": "p", "text": "Under the control of spin-based corporate entities throughout the weakening of the Republic during the Alsakan Conflicts, Cona was able to grow its infrastructure significantly during this time. Erecting impressive starports for their guests and imposing cities around their headquarters, Cona quickly drew in many visitors hoping to reap vast wealth from the planet's minerals. In 50 BBY, prospectors discovered that sodium chloride was a highly addictive hallucinogen to Arcona. Once the species was exposed to mass amounts of salt, an entire generation of salt addicts nearly crippled society on Cona. Imposing draconian laws on the planet, the Republic intervened and saved Cona from financial and social ruin with the aid of a concerned government. Despite these efforts, salt addiction remained a problem for Arcona in the following decades. In 22 BBY, a salt-smuggling operation was halted by Jedi Knight Stass Allie after the world called upon the Jedi Order for assistance."}, {"tag": "p", "text": "The space surrounding Cona was patrolled by the 4th Sector Army of the Grand Army of the Republic. When the war came to an end and the Republic was replaced with the Galactic Empire, Cona willingly submitted to Imperial rule. Despite their fondness of the uniformity the Empire promised, support dwindled during the Galactic Civil War and the planet eventually joined the New Republic. When the Yuuzhan Vong invaded the galaxy, Cona was attacked by the Yuuzhan Vong and the Ailon Nova Guard. Falling to the invaders, Cona was once more liberated by the Galactic Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Cona in the Mayagil sector of the Outer Rim Territories."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}