{"url": "Concert_of_the_Winds", "categories": ["Category:Legends articles", "Category:Ceremonies", "Category:Holidays", "Category:Musical events"], "nodes": [{"tag": "h1", "text": "Concert of the Winds"}, {"tag": "p", "text": "The Concert of the Winds was a cultural festival of the Vor to celebrate the changing of seasons on the planet Vortex. It was hosted by the Cathedral of Winds, a magnificent, delicate, and extremely intricate crystal structure. Winds rushed through the structure, with the Vors blocking tunnels with their bodies to create beautiful music."}, {"tag": "p", "text": "In 19 BBY, Supreme Chancellor Palpatine of Naboo proclaimed himself Emperor of the galaxy and began the Galactic Empire. The Vors considered the Empire as the perpetrator of several excesses that were to be resisted. As the Vors were a peaceful species, they did not resist militarily; instead, they ceased to welcome visiting aliens, although they did not close the borders of Vortex to tourists. Also, as an objection to Palpatine, the Vors sealed all the openings in the Cathedral of Winds to prevent its music from sounding, thus cancelling the annual Concert of the Winds. During Palpatine's reign, the species refused to perform for any non-Vor."}, {"tag": "p", "text": "In 11 ABY, after Palpatine's death, the New Republic made advances to the Vors, courting them to join the new, anti-Imperial government. As a token of good will, the Vors invited Leia Organa Solo, a diplomat from the New Republic, to the Concert of the Winds. Organa Solo's friend, Admiral Gial Ackbar decided to ferry her using his personal ship, a B-Wing shuttle customized by himself and by his trusted chief mechanic Terpfen. Unbeknownst to Ackbar, Terpfen was an unwilling agent of the Galactic Empire, obeying Imperial Ambassador Furgan. Terpfen sabotaged the ship, causing Ackbar to crash into the Cathedral itself, destroying it and causing the death of more than 358 Vors."}, {"tag": "p", "text": "The Vors began the reconstruction of their Cathedral almost immediately, with a near-religious fervor. Instead of building the exact same Cathedral, they followed a new layout that apparently existed only in their collective minds. This new Cathedral, although still bright, crystalline, and made of cylinders, was sleeker than the original and had a more organic aspect. The Vors directed all of their creative energies to this new task, not wanting to sing or perform any music until they could finish."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}