{"url": "Conclave_of_the_Raining_Leaves_Clan_and_the_Broken_Columns_Clan", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Stub", "Category:Meetings"], "nodes": [{"tag": "h1", "text": "Conclave of the Raining Leaves Clan and the Broken Columns Clan"}, {"tag": "p", "text": "This conclave took place in 43.5 ABY on Dathomir between the all-female Raining Leaves Clan and the all-male Broken Columns Clan. The two Clans were holding the conclave for the possibility of a marriage between their leaders—Broken Columns' Tasander Dest and Raining Leaves' Kaminne Sihn—in order to merge the two Clans into one new Clan."}, {"tag": "p", "text": "Meanwhile, Sith apprentice Vestara Khai had arrived on Dathomir on the run after her strike team had been demolished during an attack on Luke Skywalker at Sinkhole Station. She came under the protection of the Raining Leaves Clan by the time of the arrival of Skywalker and his son, Ben, on the planet. Sihn attempted to deter the Skywalkers from traveling through the rain forest as they neared the Clan's territory, and eventually set up an ambush for them alongside several other Witches. However, the Skywalkers defeated them with the help of Han and Leia Solo and the Solos' guides. Upon learning the identity of Luke Skywalker, Sihn decided to allow the Skywalkers, Solos, and their guides to travel with them to the conclave."}, {"tag": "p", "text": "Upon meeting the Raining Leaves Clan, the Skywalkers discovered that Vestara Khai was in their midst. However, when the Jedi confronted her, the Clan forced them to back down, claiming that they had adopted her. The conclave thus began with the Skywalkers living alongside the Clan, unwilling to leave their quarry. Khai, meanwhile, had contacted the planet's Nightsisters through Halliava Vurse, a Nightsister who was undercover within the Raining Leaves Clan, and arranged a deal with them to exchange information with her Sith Tribe."}, {"tag": "p", "text": "The Nightsisters, who strongly opposed the merging of the Clans, staged several attacks on them during the Conclave. Eventually, the Clans moved the Conclave to a new neutral ground, termed the Jedi Hill Camp. There, the two Clans finally merged to become Bright Sun Clan, and the hill was renamed Bright Sun Hill. However, that night, the Nightsisters staged an attack on the hill. Despite losing at least 20 Clan members, Bright Sun Clan, along with help from Khai and the Skywalkers, managed to defeat the Nightsisters."}, {"tag": "p", "text": "Shortly afterward, reinforcements from Khai's Sith Tribe arrived and betrayed and captured the Nightsisters with whom Khai had promised to exchange Force techniques. The Skywalkers, however, found the Sith and dueled with them, defeating them, capturing Khai, and revealing Khai's and Vurse's treachery. The Bright Sun Clan then refuted all responsibility for Khai as a member, finally allowing the Jedi to take her."}, {"tag": "h2", "text": "Appearances"}]}