{"url": "Conclave_on_Kessel", "categories": ["Category:Legends articles", "Category:Battles of the Great Jedi Purge", "Category:Battles of Kessel", "Category:Duels", "Category:Jedi convocations"], "nodes": [{"tag": "h1", "text": "Conclave on Kessel"}, {"tag": "p", "text": "The Conclave on Kessel was a meeting of Jedi survivors of Order 66 within an abandoned mine on Kessel. After the execution of Order 66 and the beginning of the Great Jedi Purge, a number of Jedi secretly established contact with each other. Jedi Master Shadday Potkin was one of them."}, {"tag": "h2", "text": "Invitation"}, {"tag": "p", "text": "Shadday had become disillusioned with the Jedi methods of meditation, reflection, and careful planning, seeing these as forms of inaction that had led to the rise of the Galactic Empire. Wanting to take direct action, she planned to use the prospect of a gathering of Jedi to lure Emperor Palpatine's enforcer, Darth Vader, into a trap. Through her contacts she learned that Vader desperately sought the whereabouts of Obi-Wan Kenobi, although she did not know why. She called for a meeting of Jedi in an abandoned spice mine on the planet Kessel, and leaked this to the Empire, including misinformation that Kenobi would be present, in the hopes that this would entice Vader to come quickly, heedlessly, and alone."}, {"tag": "p", "text": "Seven other Jedi answered the call, including such prominent Masters as Tsui Choi. As they discussed their plans for the future of the Jedi, it quickly became apparent that they differed on what the proper course to take was. Some favored waiting, some favored direct action against the Sith, and one, Koffi Arana, proposed using the dark side to aid them. The deliberations were quickly cut short when Shadday's ninth invitee, Vader, arrived."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Vader smashed open the door and burst into the room, demanding to know the location of Obi-Wan Kenobi. Potkin revealed that Kenobi's presence was a lie to lure in Vader. Offering to let live the one who gave him Kenobi's location, Vader only provoked Sia-Lan Wezz, who lost patience and charged. Vader thrust his lightsaber into her chest and slashed her hand off as she fell."}, {"tag": "p", "text": "The rest of the Jedi present quickly attacked, with Tsui Choi and Bultar Swan hanging back, not wanting to fight Vader. While Vader engaged Ma'kis'shaalas and Roblio Darté, Koffi Arana came around and prepared to attack Vader from behind. Vader covered his flank with a quick Force Push that sent Arana flying while Shadday Potkin advanced. Vader used the distraction to slash open Ma'kis'shaalas' chest. However, by killing Ma'kis, Vader left himself an opening Jastus Farr quickly exploited, slashing Vader across the back with his double-bladed weapon."}, {"tag": "p", "text": "Vader, crying out in pain, leapt on top of one of the mining machines to evade an attack from a recovered Koffi Arana, and gain the high ground, having a brief midair exchange with Tsui Choi. He was followed by Shadday Potkin, who used her cortosis sword to disable his lightsaber. As Vader discarded his useless lightsaber, Shadday raised her blade and leapt forward for a killing stroke, only for Vader to seize her by the neck with one hand and clamp down on her wrist with the other."}, {"tag": "p", "text": "Vader promptly snapped her neck, killing her instantly. As Potkin's corpse plummeted to the floor of the mine, Vader took up her cortosis blade and attacked the remaining Jedi, disabling the blades of Jastus Farr, Koffi Arana, and Roblio Darté. As Vader prepared to finish them, Tsui Choi and Bultar Swan suddenly appeared, Choi amputating Vader's sword arm while Swan slashed him across the leg. Vader, disarmed and wounded, having taken three lightsaber hits, surrendered."}, {"tag": "p", "text": "Koffi Arana saw the trick for what it was and demanded that Swan kill him, as his lightsaber wasn't working yet. She refused, citing that Jedi never kill unarmed opponents. Arana took her lightsaber and killed her, before leaping at Vader, blade raised. Vader telekinetically summoned the cortosis blade, still clutched by his amputated arm, and hurled it at Arana, impaling him."}, {"tag": "p", "text": "Vader took up Swan's lightsaber and turned to face the remaining Jedi, reaffirming his earlier offer to let live the one who gave him Kenobi's location. However, instead of engaging, they used the Force to attack Vader, summoning the contents of the derelict mining carts and hurling them at Vader. The rubble smashed into Vader, injuring him severely and leaving him partially buried. Choi then demanded Vader's surrender, but Vader simply declared that he would destroy them."}, {"tag": "p", "text": "As Choi prepared to attack Vader, clone stormtroopers, under the command of Commander Bow, arrived and showered the Jedi with blaster bolts. Jastus Farr, his lightsaber still disabled, was mercilessly shot to death. As Farr fell, Roblio Darté shielded himself with a piece of mining equipment while Choi deflected the bolts aimed at him. Choi leapt up to the catwalk the clone stormtroopers were firing from, hoping to distract them long enough for Roblio Darté to escape, only to get caught in mid-air by Vader's Force grip."}, {"tag": "p", "text": "While Darté was shot to death, Choi hurled his lightsaber at Vader before being killed himself, hoping to take the Sith Lord with him. The lightsaber slashed open Vader's helmet exposing his real eye, but failed to kill him. As Choi's corpse was unceremoniously dumped to the floor, Vader inquired about the clone stormtroopers presence, learning that the Emperor was requesting, and thus commanding, his presence."}, {"tag": "p", "text": "The Jedi were dead. Like the ancient Conclave at Katarr, the attempt to draw out and defeat the Sith had ended only in failure."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon his return to Coruscant, Vader's injuries were tended to and the damage to his armor repaired. Vader subsequently appeared before his master. Palpatine stated that while Vader had disobeyed him, Vader's disobedience proved to be useful. By the time of the meeting between the two, Palpatine had already caused the circulation of rumors of what had occurred at Kessel, helping to cement Vader's image as a symbol of fear for the Empire, and a further warning to all who stood in his way."}, {"tag": "p", "text": "Palpatine further stated that Vader must overcome his fixation on Obi-Wan Kenobi, as that was a remnant of the Anakin Skywalker persona, of which Vader must purge himself."}, {"tag": "p", "text": "The official report by Sate Pestage stated that some of the Jedi had killed each other in a power struggle and the others were executed for numerous crimes."}, {"tag": "h2", "text": "Participants"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}