{"url": "Concordian/Legends", "categories": ["Category:Legends articles", "Category:Languages", "Category:Mandalorian culture"], "nodes": [{"tag": "h1", "text": "Concordian"}, {"tag": "p", "text": "Concordian was the common language of the planet Concord Dawn and Mandalore's moon, Concordia. As a dialect of Mando'a, the two languages were mutually intelligible, meaning that they were similar enough that an individual speaking one could easily converse with someone speaking the other."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Known words"}, {"tag": "h3", "text": "Phrases"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Concordian language was first introduced to the Star Wars universe in the 2004 novel, The Cestus Deception, by author Steven Barnes, where it was referred to as the Mandalorian language by the character Sheeka Tull. However, the Star Wars Insider article, Guide to the Grand Army of the Republic, later retconned the language as Concordian. The Concordian name was later applied to the dialect spoken by the residents of Mandalore's moon of Concordia, in the twelfth episode of the Star Wars: The Clone Wars television series' second season, entitled \"The Mandalore Plot\"."}, {"tag": "p", "text": "At least one Concordian phrase from \"The Mandalore Plot\"—specifically the line exclaimed by the Death Watch bomber before leaping to his death, and featured as this article's main quote—appears to have been drawn from a 2007 post on the Empire at War forum in which a user had compiled a list of fanon words and translations for the Mandalorian language. The aforementioned quote, \"Calhava bru'chun dralshye'ran\", is translated in the post as \"Compassionate [sic] leaders will burn\", but although the translation would seem contextually appropriate to the episode's storyline, to date there has been no official confirmation that this is the canonically accepted translation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}