{"url": "Confederacy_of_Independent_Systems/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Incomplete lists", "Category:Confederacy of Independent Systems", "Category:Interplanetary governments", "Category:Slaver organizations"], "nodes": [{"tag": "h1", "text": "Confederacy of Independent Systems"}, {"tag": "p", "text": "The Confederacy of Independent Systems, also known as the Confederacy, the CIS, the Separatist Confederacy, the Separatist Alliance, the Separatist State, the New Order, the pro-secessionists; or colloquially as the Separatists, Seps, or Sepies; was the government and separatist movement led by Darth Sidious and his apprentice Count Dooku. Formed by various planetary and sectorial governments, as well as some mega-corporations, that declared intentions to leave the Galactic Republic, refusing to comply with its excessive taxation and corruption in the Senate during the Separatist Crisis."}, {"tag": "p", "text": "Eventually, tensions between it and the Republic developed into war after Anakin Skywalker, Obi-Wan Kenobi, and Padmé Amidala were sentenced to execution on Geonosis and a group of Jedi led by Mace Windu attempted to rescue them. After the Republic revealed its clone army on Geonosis, the Separatists were forced to retreat, beginning a great war that would last for three years and tear the galaxy apart."}, {"tag": "p", "text": "The CIS put fear in the hearts of countless citizens of the Republic, largely due to General Grievous, Supreme Commander of the Droid Armies. The Confederacy won many battles in the ensuing war but was dissolved when the Separatist Council leaders were massacred on Mustafar, allowing Palpatine to reform the Republic into the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The rise of the Separatist movement"}, {"tag": "p", "text": "In the decades prior to the Clone Wars, the Republic was seen by many as a failing government, plagued by corruption and mindless bureaucracy that stifled the voices of many constituents represented in the Galactic Senate. Secession grew during the period following the Invasion of Naboo, and the commerce guilds and trading corporations became disillusioned with the Republic after the law was passed to place taxation on all trade routes to outlying star systems."}, {"tag": "p", "text": "Into this critical situation stepped Count Dooku, a former Jedi Master who had become disillusioned with the Republic and the Jedi Order that served it. This charismatic figure stirred up anti-Republic sentiments on many worlds, paving the way for a rebellion against the government. A loose affiliation of separatists was formed, with Dooku at their head, pushing for a new government to take the place of the stagnant Republic. Eventually, this Separatist movement established itself as the Confederacy of Independent Systems, a body formally opposed to the Galactic Republic. The members of the CIS included the Corporate Alliance, Trade Federation, Commerce Guild, InterGalactic Banking Clan and the Techno Union. Although the Republic recognized that many of its member worlds were in rebellion, it refused to formally acknowledge the existence of the CIS as their common government, deeming that doing so would legitimize it."}, {"tag": "p", "text": "Unknown to the Republic, Dooku was also Darth Tyranus, Sith apprentice to Darth Sidious, who had previous ties with the Trade Federation ordered the Invasion of Naboo. Under the guise of Supreme Chancellor Palpatine of the Republic, Sidious had used Tyranus as the public leader for the CIS in the Sith's plot to destroy the Jedi Order and transform the galaxy."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The Confederacy marshaled armed forces to its cause, to be eventually used to topple the Republic and take the capital planet of Coruscant. The Trade Federation, commanded by the Republic to downsize its Droid Army after the Naboo incident, instead expanded its forces in secret, adding its battle droids to the Separatist arsenal steadily growing with input from other factions, such as the Techno Union. Foundries on Geonosis, Hypori, and elsewhere created countless billions of battle droids ready to fight for the Separatist cause, all while Dooku continued to recruit more star systems to his cause."}, {"tag": "p", "text": "However, the CIS would soon lose the advantage of surprise when Obi-Wan Kenobi, having tracked the bounty hunter Jango Fett from Kamino to Geonosis, managed to send a message to Anakin Skywalker and the Jedi Council, betraying the Confederate presence on Geonosis. In the middle of sending the message, he was attacked by a droideka, prompting Anakin and Padmé to go and rescue him and upon arriving on Geonosis, both were captured in one of the massive Geonosis droid foundries, and were sentenced to death in a combat arena alongside Obi-Wan."}, {"tag": "p", "text": "However, as the execution was being carried out, Mace Windu and a vast number of Jedi arrived to rescue them from the Separatist's and after a skirmish with droids in the combat arena the sheer numbers of Separatist forces proved overwhelming, killing large numbers of Jedi and before long only a dozen or so remained."}, {"tag": "p", "text": "Fortunately for the remaining Jedi, Master Yoda soon arrived with a large military force of LAAT/i gunships, rescuing the Jedi and engaged in what was to be known as the The First Battle of Geonosis against the Geonosian natives and their battle droid forces. Republic forces struck all over Geonosis, and the Clone Wars officially began. The CIS was defeated at Geonosis, but it was ultimately inconsequential."}, {"tag": "p", "text": "For the next three years, the Republic and CIS would be engaged in a brutal war, with many dying on both sides. Unbeknownst to all, the war was merely all part of a plan by Darth Sidious to bring about his ultimate goal: domination of the galaxy by the Sith."}, {"tag": "p", "text": "For the first half of the war, the Confederacy was doing well, capturing many planets, despite losses on Muunilinst and Dac. However, the tables turned and it began to suffer a series of defeats, which led to the Outer Rim Sieges. The Confederacy was responsible for some atrocities during the war, particularly by General Grievous. Throughout the war, the Confederacy attempted to gain the advantage using superweapons, such as the Dark Reaper and the Malevolence ion pulse cannons."}, {"tag": "p", "text": "During the war, there were many heroes on the side of the Confederacy, including Sev'rance Tann, Durge, and Asajj Ventress, and General Grievous, many of whom were driven by hatred of the Republic or the Jedi. At around the midpoint of the war, Grievous initiated Operation Durge's Lance, a campaign which spearhead into the Inner Rim, leading to a string of Confederate victories, including the conquest of Duro. At this point, many were certain that CIS victory was inevitable."}, {"tag": "p", "text": "However, soon the Republic began going on the offensive, winning battles at Bomis Koori IV, Boz Pity, and others. With the death and loss of Confederate heroes Durge and Asajj Ventress, the Confederacy began to lose the advantage. The Republic began laying siege to what Palpatine called a Triad of Evil: Felucia, Mygeeto, and Saleucami, and the Separatist council was forced to keep on the move. However, the Confederacy still had plenty of fight left, as it began launching assaults on Kashyyyk and other worlds. This culminated when Grievous led a massive assault on Coruscant to \"capture\" the Supreme Chancellor. However, Palpatine was rescued and despite many losses, the Republic did inflict more damage on the Separatists, and even killing Count Dooku in the process."}, {"tag": "h3", "text": "The Fall of the Confederacy"}, {"tag": "p", "text": "The Confederacy of Independent Systems was eventually defeated, though this was not its own fault. Suffering losses—and victories, for that matter—right from the beginning of the war, and despite the might of General Grievous and its vastly superior numbers, the droid forces were often defeated by the Republic. However, as Darth Sidious manipulated the war, influencing some of the defeats of the CIS as well as some of its victories, the Separatists had lost before they had even started fighting—Sidious wanted the Republic to win. At the end of the war, Count Dooku was struck down by Anakin Skywalker on board the Invisible Hand, General Grievous was killed on Utapau by Obi-Wan Kenobi, the CIS leadership was murdered by Darth Vader, Sidious' new apprentice, on Mustafar, and the commerce guilds faded quietly into oblivion."}, {"tag": "p", "text": "The Confederacy's legacy lived on in the form of the Death Star project, which became the Empire's feared superweapon, as well as the Imperial battle droids."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The corporations that made up the Confederacy were Imperialized and assimilated into the Imperial war machine, and most of the Separatist worlds were absorbed into the Empire, with many prominent races of the Confederacy enslaved, while others, such as the Trandoshans, allied themselves with the Empire. The majority of the droid armies were shut down, providing no opposition to the Imperial stormtroopers. The Death Star project, originally the CIS's, was absorbed by the Galactic Empire."}, {"tag": "p", "text": "However, reminders and relics of the Confederacy continued to survive the ages. On Jaguada's moon, a small army of droids was accidentally reactivated by some fugitive Jedi. Old droid parts were used by Wookiee forces during a battle against Imperial forces. In that same battle, an old CIS warship was used to the advantage of escaping Jedi. A contingent of B1 battle droids continued to function on Geonosis, although they were defeated by a squad of stormtroopers that crashed on the planet, as well as Wedge Antilles. The Zann Consortium used an old droid factory on Hypori to build droideka Mark IIs for its forces. Even after the decline of the Empire, regular droidekas were used by some smugglers, as well as races like the Vagaari."}, {"tag": "h4", "text": "Separatist holdouts"}, {"tag": "p", "text": "After the deaths of the members of the Separatist Council, some Separatist-loyal worlds still refused to be absorbed into the new Galactic Empire. These remnants, some organized and unorganized, would continue to fight throughout the Imperial era. The Empire would use these holdouts as justification for expansion of the Imperial Navy. Many of them ended up joining the Rebel Alliance at its formation."}, {"tag": "h5", "text": "Gizor Dellso's rebellion"}, {"tag": "p", "text": "At some point after the war, Gizor Dellso, a Geonosian droid manufacturer who managed to survive the demise of the Confederacy leaders at the end of the Clone Wars, initiated a plan to revive the Confederacy. He reactivated a droid factory on Mustafar and built a small army. He was preparing to start another war, in an effort to take advantage of the reorganization of the newly christened Galactic Empire."}, {"tag": "p", "text": "He started by activating a droid fleet around Mustafar's orbit to defend his factory. He drew up prototype plans for a Confederate infantry prototype, similar to the B2 super battle droid, that had layers of armor."}, {"tag": "p", "text": "As his soldiers were guarding the factory, an Imperial fleet bearing the 501st Legion arrived at Mustafar. A Heavy Missile Platform landed in the hangar of the Imperial-class Star Destroyer, and several battle droids emerged and attacked the stormtroopers inside. However, with the use of thermal detonators, rocket launchers, and time bombs, the troops destroyed the droid gunship. The Empire then engaged and destroyed the still weak Separatist fleet and proceeded to the planet's surface. The Battle of Mustafar erupted, but due to the insufficient time for Gizor Dellso to unleash his new droid army, his obsolete droids fought a losing battle. Dellso and his Geonosian retinue died along with their hopes for a new war. The factory was subsequently destroyed by heavy orbital bombardment and the Separatist holdouts began to decline rapidly."}, {"tag": "p", "text": "By 2 BBY, the remaining holdouts joined the Rebel Alliance and supplied the Alliance Fleet with many remaining separatist vessels including a Providence-class carrier/destroyer called Rebel One."}, {"tag": "h2", "text": "Government and Politics"}, {"tag": "p", "text": "The Confederacy had a single Head of State, and beneath him was the Separatist Council. The official leader of the Confederacy was a former Jedi Master named Count Dooku, also known as Darth Tyranus, Darth Sidious's second known apprentice. Operating between the Head of State and the Separatist Council was the Supreme Commander of the Droid Armies, General Grievous who had no direct power over government but assumed command should the Head of State be incapacitated. If both Dooku and Grievous are incapacitated then Nute Gunray would take over as Head of State, being the head of Council (leading member to finance the war). Operating alongside the council was the Separatist Parliament who dealt with diplomatic and civilian issues. However, the real power behind the Confederacy was the Sith Lord Darth Sidious, though few knew, such as Tyranus and Grievous, that he had control."}, {"tag": "p", "text": "The Separatist Council consisted of ten leaders. Each leader had his or her own assistants, advisors and delegates. The Separatist Council consisted of :"}, {"tag": "p", "text": "These individuals represented eight independent galactic governments, that made up the Confederacy, including the Trade Federation, Techno Union, InterGalactic Banking Clan, Geonosian Industries, Commerce Guild, Corporate Alliance, Hyper-Communications Cartel, and Quarren Isolation League. Eight worlds (all the origins of the leading species) were the capitals of the eight separatist governments, including Neimoidia, Skako, Muunilinst, Geonosis, Castell, Kooriva, Ando and Dac. Although the governments were affiliated with each other into one galactic government against the Galactic Republic, each had played their own part in the Separatist Crisis from 24 BBY– 22 BBY and the Clone Wars that followed, from 22 BBY– 19 BBY."}, {"tag": "p", "text": "Republic Senators who joined the cause:"}, {"tag": "p", "text": "Other members of power included:"}, {"tag": "p", "text": "Government Branches:"}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The military forces of the CIS was a mix of weapons of war, super weapons, battle droids, organic forces, and natives on different planets under their control."}, {"tag": "p", "text": "The CIS was controlled mainly by large business conglomerates with representatives such as Trade Federation Viceroy Nute Gunray, InterGalactic Banking Clan Chairman San Hill, and Techno Union Foreman Wat Tambor. These individuals were not warriors or generals, but merchants, more interested in commerce than battle, and thus were ill-equipped to lead troops into battle. Of the entire political leadership, only Count Dooku, Poggle the Lesser, and Nute Gunray had any experience in warfare, although some of the Council members had skills with leading, like Wat Tambor, who was renowned as a superior strategist by many. Other military officials included General Whorm Loathsom, General Oro Dassyne, General Lok Durd and Commander Merai. Sentepeth Findos, later the Acting Viceroy of the Trade Federation was a lieutenant."}, {"tag": "p", "text": "The CIS leaders believed their superior numbers and advanced droid designs would win the Clone Wars and in some ways they were right, with Droidekas being able to use weaponry and shields capable of killing Jedi, and Battle Droids and Super Battle Droids capable of overwhelming forces with sheer numbers that the clones couldn't contend with. However, the incompetence of some droids, like the B1 battle droids, lost the CIS many skirmishes."}, {"tag": "p", "text": "One of the largest contributions was by the Techno Union, which donated not only its new B2 super battle droids, but numerous foundries capable of producing thousands more droids for the Confederacy. Other companies that supported the Separatist's included Colla Designs, Phlac-Arphocc Automata Industries, Baktoid Industries, Haor Chall Engineering, Free Dac Volunteers Engineering Corps, Republic Sienar Systems, Retail Clan, and Feethan Ottraw Scalable Assemblies."}, {"tag": "p", "text": "Other allies were quick to offer help. The Confederacy controlled countless worlds across the galaxy, and was able to recruit many of their local forces to the cause. The Jabiimi Separatist leader Alto Stratus's Nimbus commandos, the Quarren Isolation League, the Mandalorian Protectors, and many more aided the CIS in fighting the Galactic Republic. The Separatist Army also used a number of organic forces, from Gossam Commandos to Koorivar Fusiliers, they brought new tactics onto the field and were capable of independent thought and the use of real time military strategy that could give them an advantage over the AI of droids and many could rival even the Republic's Clone Troopers capabilities."}, {"tag": "p", "text": "Bridging the gap between organic and automation was: General Grievous, Supreme Commander of the Droid Armies. A cyborg with a brilliant tactical mind and a powerful armored body, Grievous turned the war in favor of the Confederacy. He led his troops to a number of victories across the galaxy including the conquest of Duro and the destruction of Humbarine, the attacks of strategic Loyalist worlds, and spearheaded an assault towards Coruscant itself capturing the leader of the Republic Supreme Chancellor Palpatine in the process. He also targeted the Jedi Knights — particularly problematic to the droid army — and killed many in one on one combat. He had ultimate power over his troops, able to command them with but a gesture. One thing that made him a force to be reckoned with was his use of four lightsabers, from a personal collection of his taken from fallen Jedi Generals he had bested in combat. With the use of weapons to such a proficiency he was able to crush all in his path, leading to countless victories for the CIS. Asajj Ventress and the bounty hunter Durge were also effective commanders on the battlefield."}, {"tag": "p", "text": "The Separatist Army was not merely composed of ground troops. It also deployed much larger weapons of war during the Clone Wars. Commerce Guild OG-9 homing spider droids were a common sight on Confederate frontlines, and NR-N99 Persuader Tank Droids, Manta Droid Subfighters, and Federation AATs provided heavy firepower in countless conflicts. Added to this the use of super weaponry such as the powerful Protodeka, the massive Seismic tank, and the terrible Dark Reaper. However, weaknesses found in these machines were often exploited by the Republic."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "The territory of the Confederacy of Independent Systems varied in size a great deal during the course of its short history. As of 22 BBY, the Confederacy of Independent Systems numbered at several thousand star systems, as well as the various commercial factions with the planets they controlled, allied under its banner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Confederacy of Independent Systems first appeared in Star Wars: Episode II Attack of the Clones. Early in production of Attack of the Clones, the various commerce guilds were to all employ the same type of battle droids that were used by the Trade Federation, albeit with different color schemes to differentiate allegiance, but it was later decided that having each guild have their own wholly unique droids would provide visual diversity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}