{"url": "Confederacy_military/Legends", "categories": ["Category:Legends articles", "Category:Separatist military", "Category:Separatist military units"], "nodes": [{"tag": "h1", "text": "Confederacy military"}, {"tag": "p", "text": "The military of the Confederacy of Independent Systems (CIS) operated during the Separatist Crisis and subsequent conflict. It had two main branches—the Separatist Droid Army, and the Confederate Navy—but consisted of an amalgam of military forces from the various allied organizations of the Confederacy, with battle droids as their infantry. The Confederate Head of State held supreme authority at a civilian level as Commander-in-Chief, while military authority was chiefly under the purview of the Supreme Commander of the Droid Armies, General Sev'rance Tann and her successor General Grievous."}, {"tag": "p", "text": "The military was dissolved when Darth Vader killed the Separatist Council on Mustafar at the order of newly-crowned Emperor Palpatine, and subsequently gave the command for most of the droid forces to shut down. Later, the droids of the former Confederacy would be reactivated for the duration of Gizor Dellso's rebellion during the Imperial Period."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Though the severity of the Separatist Crisis was not fully realized until 24 BBY, the militarization process of the Trade Federation and other Rimward economic organizations had already been underway for the better part of a decade. The secretive schemes and machinations of then-Senator Palpatine—secretly, the Sith Lord Darth Sidious—had exacerbated existing tensions between the more developed Core systems and the lawless frontiers of the galaxy. Arguably the most significant of these events was the deployment of the Trade Federation's droid army in the organization's blockade and subsequent invasion of Naboo in 32 BBY, where the mettle of the droid soldiers was tested on a large scale for the first time."}, {"tag": "p", "text": "It would not be long after these events before Jedi Master Dooku became disillusioned with both the Jedi Order and the Republic itself and departed from both to claim his birthright as a Count of Serenno. In his new position of authority, Dooku began to rally the disparate economic and trading bodies of the Commerce Guild, InterGalactic Banking Clan, Techno Union and Trade Federation, among others, into an alliance in opposition to Republic policies and governance. And along the way, the militarized forces of these groups were amalgamated into a unified military for the new Confederacy."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The military build-up and increasing hostility of the Confederacy—driven in no small part by Dooku himself, who had become Sith apprentice to Darth Sidious—came to a head in 22 BBY on Geonosis. As a foundry planet for the manufacturing of countless battle droids, the appearance of Jedi and Republic forces on the planet were the spark which ignited the powder keg that was the Separatist Crisis. At the Battle of Geonosis, the Clone Wars erupted in earnest, with the Republic's clone army clashing in open conflict with the droid armies of the Confederacy for the first time."}, {"tag": "p", "text": "Though the battle at Geonosis would be a defeat for the Separatist Alliance, their military would go on to be an effective fighting force for the remainder of the war. For the three years of the conflict, the Separatist military would fight in hundreds of battles across the galaxy, matching the Republic's forces in many respects. Many of the Confederate military's victories came from the leadership of their Supreme Commander, the dreaded cyborg Kaleesh General Grievous."}, {"tag": "p", "text": "The droid armies under Grievous' command would lead many daring and devastating assaults on Republic holdings, culminating with an assault on the Republic capital, Coruscant. During this particular engagement, the forces of the Confederate military were able to briefly capture Supreme Chancellor Palpatine before he was rescued by Jedi Knights Anakin Skywalker and Obi-Wan Kenobi—with Count Dooku killed in the process."}, {"tag": "h3", "text": "End of the war"}, {"tag": "p", "text": "With the Confederate Head of State dead, the droid army under Grievous effectively became the de facto ruling body of the entire Separatist movement. Shortly afterward, on Utapau, Grievous was killed in single combat with Kenobi, leaving the Confederacy devoid of both civilian and military leadership; and placing rulership of the movement in the hands of the Separatist Council on Mustafar."}, {"tag": "p", "text": "Even as the droid armies continued to battle for Kashyyyk, Cato Neimoidia, and a number of other worlds, their fight came to an unexpected end. Anakin Skywalker—now Darth Vader, Sith apprentice to newly-Emperor Palpatine—killed the members of the Separatist Council on Mustafar at the behest of his new master, and broadcast the shut-down order for most of the Separatists' armies. Across the galaxy, in an instant, the military of the Confederacy of Independent Systems ceased to exist."}, {"tag": "h2", "text": "Makeup"}, {"tag": "h3", "text": "Leadership"}, {"tag": "p", "text": "As head of the Confederate state, Count Dooku held ultimate authority over the direction of the CIS military's efforts, commanding general overall strategy."}, {"tag": "p", "text": "Dooku, however, was also responsible for maintaining civilian authority of the CIS, and so many of the main military responsibilities were delegated to his generals and Dark Acolytes. Chief amongst these was the General Sev'rance Tann and her successor Grievous, who carried the rank of Supreme Commander of the Droid Army. Under Grievous served a number of other high-ranking generals, including Durge, Sev'rance Tann, Asajj Ventress, and a number of others."}, {"tag": "h3", "text": "Army"}, {"tag": "p", "text": "Perhaps the largest droid army ever assembled, the army of the CIS outnumbered the clone soldiers of the Republic 100 to 1. The army was cobbled together from the droid soldiers of the Commerce Guild,  the Corporate Alliance, the InterGalactic Banking Clan, the Techno Union, and the Trade Federation"}, {"tag": "p", "text": "Though the Confederacy made use of a wide variety of droid soldiers, chief amongst these were the B2 super battle droids and the ubiquitous B1-Series battle droids, which saw combat in countless theatres of war."}, {"tag": "h3", "text": "Navy"}, {"tag": "p", "text": "As with the army, the Confederate Navy was an amalgam of the militaries from which it originated. In spite of this, however, the backbone of the navy was comprised of a relatively small number of capital ship classes, including Recusant-class light destroyer, Munificent-class frigates, Lucrehulk-class battleships and their droid control variants, as well as their C-9979 landing crafts. The fleet was led, until its destruction at the Battle of Coruscant, by the Invisible Hand."}, {"tag": "p", "text": "The capital ship fleet was augmented by its legions of starfighters, which were composed largely of droid tri-fighters and, in particular, Vulture-class droid starfighters."}, {"tag": "p", "text": "The Confederate Navy was also home to a number of experimental superweapons throughout the war. One of these was the Malevolence, a massive Subjugator-class heavy cruiser equipped with a pair of ion pulse cannons designed to disable Republic capital ships. The Malevolence was later destroyed at the Battle of the Kaliida Nebula."}, {"tag": "h2", "text": "Historical impact and legacy"}, {"tag": "p", "text": "The unprecedented build-up of the Separatists' droid armies and navy had a number of ramifications, both immediate and long-term. Identifying the impending threat, Jedi Master Sifo-Dyas, without the authorization of the Jedi Council, ordered the production of an army of clone soldiers in the cloning facilities of Kamino. In the short term, this led to both the Clone Wars themselves, but also served to ultimately undermine the moral authority of the Jedi Order itself."}, {"tag": "p", "text": "In the longer term, the build-up of the Confederacy's droid army and navy led directly to the massive re-militarization of the Republic and its successor state, the Galactic Empire. Without the threat of the Confederate military to urge the Senate on, there would have been little incentive for the creation of the clone army or the growth of the Republic Navy. When the droid armies were deactivated, the new Empire was left in a position of uncontested dominance, with the Grand Army of the Republic and Republic Navy being reorganized into the Stormtrooper Corps and Imperial Navy, respectively."}, {"tag": "p", "text": "The new Imperial forces and the droids of the defunct Confederacy would go on to clash at least twice more. During the rebellion of Gizor Dellso on Mustafar, battle droids would be reactivated and fight the Imperial forces for a period, before being defeated once more. In addition, at least one of the Trade Federation's Lucrehulk-class battleships would eventually find its way into the hands of the Alliance to Restore the Republic, before it too was destroyed by the Imperial military."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}