{"url": "Confrontation_in_the_Caverns_of_the_Hidden_One", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles of Dorin", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Confrontation in the Caverns of the Hidden One"}, {"tag": "p", "text": "A confrontation took place in 43.5 ABY between Jedi Grand Master Luke Skywalker and Koro Ziil, leader of the Hidden Ones, a secret sect of the Force-based organization Baran Do tasked with preserving their knowledge. The duel took place in the Hidden Ones' home, the Caverns of the Hidden One. Skywalker—who had recently been exiled from Coruscant for failing to prevent Jedi Knight–turned–Sith Lord Jacen Solo's fall to the dark side of the Force—and his son, Jedi Knight Ben Skywalker, had traveled to the Kel Dor homeworld of Dorin, where they hoped to speak with Ziil to find out more about Solo's fall. After a short time training with the Baran Do Sages on the surface, they discovered the existence of the Hidden Ones. The Baran Do allowed the Skywalkers to go to the Caverns of the Hidden One, where they were allowed to speak with Ziil, who had become known as \"The Hidden One.\""}, {"tag": "p", "text": "However, in order to protect the Hidden Ones' secrecy, Ziil told the Skywalkers that they could never leave the caverns. Luke believed that the Hidden Ones had inadvertently turned their backs on the Force, and to prove that they were weakening, Luke suggested that Ben duel Chara, the Hidden Ones' newest member and best fighter. Ben defeated Chara, despite the Kel Dor by far being his superior. The Hidden Ones began to believe Luke's theory, greatly angering Ziil. The Hidden One attacked Luke, and they dueled with the Force, with Luke emerging the victor. The Hidden Ones then returned to the Baran Do on the surface."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 43.5 ABY, Jedi Grand Master Luke Skywalker and his son, Jedi Knight Ben Skywalker, traveled to the planet Dorin after Luke's trial and exile from the Jedi Order and the galactic capital of Coruscant for failing to prevent Jedi Knight Jacen Solo's fall to the dark side of the Force and subsequent reign of terror as Sith Lord Darth Caedus. They hoped to talk with Koro Ziil, the Master of the Baran Do Order, who had briefly trained Solo during his travels after the Yuuzhan Vong War, in order to find out the cause of Solo's descent to the dark side. The Skywalkers met with the Baran Do Sages, the Kel Dor Force-based organization, only to learn that Ziil had recently died. Since they could not speak with Ziil, they decided to stay in Dor'shan and train with the Sages for a short time."}, {"tag": "p", "text": "A few days after the Skywalkers' arrival, one of the Sages—senior combat instructor and former apprentice of Ziil, Charsae Saal—decided that it was time to die. According to the Baran Do culture, when one decided that it was time to die, they simply gave themselves over to the Force. Luke and Ben attended Saal's funeral, along with the other Baran Do Sages. Luke, however, was not convinced that Saal had indeed died; he believed that Saal had hidden his presence in the Force and then gone through a trap door or some other quick and easy exit. He later scouted the area with Ben, and they found that the platform upon which Saal had \"died\" in fact concealed a door leading to an underground chamber. There, the Skywalkers found Saal very much alive, along with current Mistress of the Order, Tila Mong, and two other Sages. The Skywalkers confronted them and were allowed to accompany Saal in rolling carts that led them down a long passage to the system of caverns that were home to the Hidden Ones, a secret sect of the Baran Do dedicated to preserving the Order's knowledge."}, {"tag": "p", "text": "Once there, Saal took the name of \"Chara,\" and he told the Skywalkers that in order to protect their secrecy, they could never leave and must change their names. However, Saal also revealed to them that Ziil had also joined the Hidden Ones and had become their leader, and was now known as \"The Hidden One.\" Luke and Ben met with Ziil and talked to him about Solo, but Ziil did not have much information on why the former Jedi became a Dark Lord of the Sith. During their talk, Luke and Ben found Ziil to be paranoid and corrupt, and they discovered that he was filling the Hidden Ones with lies. The Skywalkers were told to begin excavating caves, where they would live and spend the rest of their lives."}, {"tag": "p", "text": "A few days after the Skywalkers' arrival, the female Kel Dor Ithia—formerly the best fighter in the Baran Do Order—dueled with Chara in a set of three matches. Chara defeated her each time, a feat he had never accomplished before. Luke began to believe that, in accepting their death and turning their backs on life, energy, and the will to fight and survive, the Hidden Ones had turned their backs on the Force. Luke decided to prove to them that every minute they stayed down in the caverns, accepting their \"deaths,\" their power was weakening."}, {"tag": "h2", "text": "The confrontation"}, {"tag": "h3", "text": "Demonstrating the theory"}, {"tag": "p", "text": "Luke gathered all of the Hidden Ones into Koro Ziil's throne chamber by spreading the word that he and Ben were finally going to adopt new names. Luke, however, had no intention of doing so. Instead, he explained his theory to the Hidden Ones and went on to suggest that Ben—who was barely a Jedi Knight—should duel Chara, the Hidden Ones' best fighter and newest addition. If Ben lost, Luke promised that he would accept their fate and stay in the caverns. Ziil allowed Chara to accept the challenge, and both combatants were armed with only hardwood staffs."}, {"tag": "p", "text": "Chara immediately took control, landing the first blow on Ben's ankle. Ben recovered quickly, but as the duel progressed, Chara clearly had the upper hand, slamming Ben into a pillar with the Force and hitting Ben's ankle again, causing the young Jedi to limp. Ben, however, managed to hit Chara's head, and the elder combatant began to lose the will to fight. After the two traded a series of glancing blows, a kick from Ben connected solidly with Chara's chest, knocking him down. Now having the advantage, Ben intentionally allowed Chara to disarm him; surprised, Chara was knocked off-balance, and Ben capitalized on the error with a series of punches. Finally, an attempt by Chara to attack with his staff again was met with an open-hand strike from Ben that split the weapon into two pieces; the follow-through landed squarely on Chara's chin, and the defeated Kel Dor fell to the ground, unable to get up immediately."}, {"tag": "h3", "text": "Seeing the light"}, {"tag": "p", "text": "Chara and other Hidden Ones began to believe that Luke was right; they were growing weaker, not stronger. Ziil, however, refused to accept the revelation. He became angry at the Skywalkers as well as with the other Hidden Ones who began to speak out in agreement with the Jedi. When his former apprentice, Chara, admitted that he believed that the Skywalkers could be right, Ziil said the Skywalkers were too dangerous to remain living among them. Ithia and a very old Kel Dor named Burra spoke out against his statement, but the Hidden One revealed that he had already told those on the surface that the Skywalkers had died when a cave collapsed, and that sending any more oxygen-nitrogen canisters would not be necessary. Without the canisters, the Skywalkers would die within the next day or two from the helium-rich atmosphere of Dorin that only the native Kel Dor could breathe. Several of the Hidden Ones pleaded with Ziil to change his mind, but he refused. The Hidden Ones continued to protest, and Ithia told Ziil that the Hidden Ones—which she referred to as the \"experiment\"—had failed. Ziil ordered the assembly to be quiet and obey, but Ithia refused, and the Hidden One was finally pushed over the edge."}, {"tag": "h3", "text": "Master vs. Master"}, {"tag": "p", "text": "Ziil declared that because their influence among the Hidden Ones was too great, the Skywalkers could not be allowed to remain in the caverns even for the short time before their deaths. He then stepped forward and blasted Luke with white Force lightning. Luke absorbed the attack with his lightsaber, but the strength of the lightning threw him backward into a pillar. Still managing to deflect the lightning, Luke got up and began moving slowly toward Ziil. Ziil created a Force whirlwind, but it was not enough to stop Luke's advance. Many of the other Hidden Ones fled from the throne chamber, as Ben directed them out a blast door."}, {"tag": "p", "text": "Ziil broke off the lightning and increased the power behind the whirlwind, sending it straight at Luke. Luke deflected it off to the side, and it slammed into a pillar. Deactivating his lightsaber, Luke started forward again. The whirlwind began moving around the room until it paused directly behind Luke, and it hammered continuously at a pillar until the pillar broke and toppled down toward Luke. Luke caught the pillar in midair and redirected it, dropping it down to the ground. Ziil then picked up his throne with the Force and hurled it at Luke. To counter the blow, Luke threw the fallen pillar toward Ziil with the Force. They collided in midair; the throne shattered, and the pillar fell to the floor. Luke rolled the pillar forward with the Force, forcing Ziil to jump over it. Luke charged forward and kicked the unprepared Hidden One in the stomach, sending him flying. Ziil tried to get up, but he could not stay on his feet and collapsed to the ground."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Even after his defeat, Ziil tried to enforce his rules. He stated that he would tell those on the surface that his earlier message about the Skywalkers' deaths was a mistake, and he promised to free his servants and appoint a board of advisors, and in a couple of years they would reassess the situation. However, the Hidden Ones had turned against him. When Ziil still refused to listen to reason, Ben set off a secret explosive that collapsed what Ziil had claimed to be the only exit from the caverns. Ben continued to reveal all of Ziil's lies to the Hidden Ones; Ziil, however, still refused to admit to the existence of another way out of the caverns. At last Burra gave in, revealing he knew of a secret turbolift chamber that led to the surface. The Hidden Ones left the caverns, returning to the Baran Do on the surface, and the Skywalkers left Dorin soon after."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The showdown was chosen by Star Wars author Aaron Allston to be the final event of his first Fate of the Jedi novel, Fate of the Jedi: Outcast, released in March 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}