{"url": "Confrontation_on_Crseih_Station", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles in the Pakuuni sector", "Category:Battles of the Empire Reborn campaign", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Confrontation on Crseih Station"}, {"tag": "p", "text": "The Confrontation on Crseih Station was the final conflict between the Empire Reborn and the New Republic forces on Crseih Research Station."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Having traced the movements of Lord Hethrir, leader of the Empire Reborn, Leia Organa and Rillao were determined to rescue Anakin Solo from being \"purified\" by the Waru. They had already rescued Jacen and Jaina Solo, and the other kidnapped children from Hethrir's worldcraft, and then traveled to Crseih Station."}, {"tag": "p", "text": "On unrelated business, Han Solo and Luke Skywalker had also traveled to the station to investigate reports of Jedi activity there—a ruse by former acquaintance of Solo, Xaverri, to draw their attention to Waru."}, {"tag": "p", "text": "Waru was a being brought from another dimension through savage rites performed on the station by Lord Hethrir. A sinister pact existed between the two, whereby Hethrir supplied Waru with Force-sensitive victims, in exchange for a promise of ultimate power when a sufficiently strong candidate was offered. It was for this reason Hethrir had kidnapped Anakin and planned to offer him to Waru."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "The conflict came to a head when the three parties met in the temple of the Waru. Hethrir's disowned son, Tigris, refused to hand over Anakin to be sacrificed. Luke Skywalker, suffering a break-down due to his inability to connect with the Force, dove into the Waru to sacrifice himself. Han and Leia followed after to rescue him."}, {"tag": "p", "text": "Hethrir recognized that Luke was a more powerful victim than Anakin, and believed he would finally receive ultimate power from Waru. His ex-mate Rillao, however, had other plans. She attacked Hethrir, aware he could not use the Force to defeat her. Xaverri and Chewbacca assaulted the Empire Youth, and though outnumbered, overcame them with the aid of the Chironian Lusa."}, {"tag": "p", "text": "Han and Leia were able to retrieve Luke from the Waru, who consumed Hethrir to fulfill their bargain. The Empire Youth and many of the supporters were rounded up and captured."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "This defeat ended the plans of the Empire Reborn, with the last of the three major leaders killed (Galak Fyyar and Desann had both fallen in earlier battles)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}