{"url": "Connor_Freeman%27s_father", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Unidentified clone troopers", "Category:Unidentified fathers"], "nodes": [{"tag": "h1", "text": "Connor Freeman's father"}, {"tag": "p", "text": "A Human male was a clone of the bounty hunter Jango Fett and was part of the clone army being developed for the Galactic Republic on the planet Kamino. Having no desire to be a soldier, the clone escaped from the planet to live a life of his own. He met and married a woman and soon fathered a son, Connor Freeman. The three of them settled on the planet Atzerri. In 22 BBY, feeling that it was dangerous to let the clone live because of the information he possessed regarding the clone army, Count Dooku hired Jango Fett to assassinate the clone, and Fett did so. Fett spared the clone's wife and son and even created an inheritance fund to support the child."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Human individual was one of the many clones of the bounty hunter Jango Fett bred on the planet of Kamino to serve in the Grand Army of the Republic as clone troopers. Unwilling to spend his life in service to the Galactic Republic, the clone escaped from Kamino in pursuit of a peaceful existence. He did not tell anyone about his origins and made a point to always wear a helmet in public in order to hide his resemblance to Fett. Eventually, the clone met and married a woman, and the two had a son, whom they named Connor Freeman. By 22 BBY, the family had settled in the city of Talos on the planet Atzerri, taking care over the infant Connor. In 22 BBY, unbeknownst to the clone, he was targeted for assassination by Count Dooku, who had been secretly involved in the creation of the army and who believed that the deserter was too dangerous to be left alive because of the information he possessed regarding the Kamino operation. Dooku hired Jango Fett himself to kill the clone, although the Count did not reveal the true identity of his target to Fett."}, {"tag": "p", "text": "While he was inside his apartment in Talos, clad in his helmet, the deserter was nearly hit by a blaster bolt fired through a window by Jango's son, Boba, who accompanied his father on the mission. The shot barely missed, the only damage being some scratches on the clone's armor from the window's shattered glass, and the clone hid inside the apartment, waiting to confront his assassin. When the elder Fett burst in, the clone attacked him from behind, demanding to know who had sent the killer. In a brawl that followed, the clone tore off his opponent's helmet but was wounded in the chest when Fett fired his blaster pistol. As Fett prepared to fire a lethal shot, the clone recognized his progenitor and removed his own helmet. Fett was taken by surprise by the sight of his own face and hesitated to fire for a moment."}, {"tag": "p", "text": "The clone then tried to explain to Fett that he had only wanted to live a peaceful life, but Fett was unmoved by his words and shot the clone, killing him. As Fett prepared to leave the apartment, he discovered the clone's wife and son, who had been hiding during the entire fight. Seeing as the wife was baffled to discover that her husband's killer had the same face as the victim, indicating that she did not know anything about the clone army—and because killing the two was not in his contract—Fett spared their lives and left. His feelings stirred by the meeting with the clone and his family, Fett set up an inheritance fund shortly before the Battle of Geonosis, during which he was killed. The fund provided Connor Freeman with small payments in credits every week since he was one year old."}, {"tag": "p", "text": "Freeman eventually grew up and discovered that his father had been a clone and that he had been killed by Fett. He did not know who had set up the inheritance fund, believing that it had been his father. Seeing the money as the only legacy of his deceased parent, Freeman felt the need to make this legacy larger to make a dead man proud. To this end, he withdrew all the money from his fund and waged it all in a sabacc game against the crime lord Tayand. Freeman won, but Tayand claimed that he had cheated and placed a bounty on his head. The bounty was accepted by several bounty hunters, one of them Boba Fett. This led to a series of events that culminated with the younger Fett rescuing Freeman from the other bounty hunters and killing Tayand, allowing Freeman to claim Tayand's treasures."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A clone of Jango Fett, the individual had the same height of 1.83 meters as his genetic template. He also had black hair, brown eyes and tan skin. Like all of Fett's clones, Connor Freeman's father was trained in the use of blasters, a skill that Connor also developed. The clone did not want to be a soldier like the rest of his clone brethren, and he escaped from Kamino. In pursuit of normal life, he became a husband and a father. He tried to keep a low profile by wearing a helmet to hide his identity and did not tell anyone that he was a clone. When confronted with Fett on Atzerri, the clone tried to plead for his life and believed that he would not have killed his clone had he been in Fett's place. This proved to be the major differentiating factor between the clone and his genetic template, as Fett did not hesitate to kill the clone."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This clone first appeared in Blood Ties: A Tale of Jango and Boba Fett 1, a 2010 comic book written by Tom Taylor and illustrated by Chris Scalf, and the first part of the Star Wars: Blood Ties: A Tale of Jango and Boba Fett comic series. The clone also appeared in the second issue of the series, in which he was killed, and was mentioned in the final two issues. None of the comic books revealed the clone's name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}