{"url": "Conqueror_(Imperial-class_Star_Destroyer)", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Imperial-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Conqueror (Imperial-class Star Destroyer)"}, {"tag": "p", "text": "The Conqueror was an Imperial-class Star Destroyer in service during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Conqueror was assigned to Task Force Vengeance. Early on in this campaign the Conqueror was engaged by a Rebel fleet consisting of two Nebulon-B2 frigates (Lance and Lion), a Nebulon-B escort frigate (Ornik) and several squadrons of starfighters, including Rogue Squadron. Conqueror was defended by Avenger Squadron."}, {"tag": "p", "text": "Within Task Force Vengeance, the Conqueror was a part of Battlegroup Orion together with another Imperial Star Destroyer, Nemesis. Both Star Destroyers were seen among Admiral Senn's fleet when it moved through the Almaran system headed for the Airam sector. Following a skirmish near Almaran, Battlegroup Orion was lured into a Rebel trap in the Goff system where the Conqueror and Nemesis were destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Conqueror appears in the Balance of Power add-on to the X-wing vs. TIE Fighter game. The game engine does not differentiate between the older Imperial I-class Star Destroyer and the newer Imperial II-class Star Destroyer types."}, {"tag": "p", "text": "One of the new multiplayer battle scenarios features the clash between the Conqueror and the 3 Rebel frigates mentioned above, and players can fly for either side. No exact time and no place are given for this battle, but it is explicitly featured among missions for the Balance of Power campaign in the Airam sector. Naturally, the outcome of the scenario depends on the player's skills and actions. However, the Rebel side's briefing explicitly states that a retreat of the Compellor already counts as a victory."}, {"tag": "p", "text": "The ship reappears in missions of the more linear Spreading the Rebellion campaign. During the ambush mission at Goff (Rebel mission #6) the destruction of the Conqueror is a primary mission objective, and its success is required for the Rebel campaign to continue."}, {"tag": "p", "text": "It can therefore be considered canon that the battle with three Rebel frigates occurred, but that the Conqueror survived the encounter and was later destroyed at Goff."}, {"tag": "h2", "text": "Appearances"}]}