{"url": "Consolidations_Unlimited", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Slaver organizations"], "nodes": [{"tag": "h1", "text": "Consolidations Unlimited"}, {"tag": "p", "text": "Consolidations Unlimited was a slaving organization founded by an opportunistic smuggler known as Tarnta Bane during the Galactic Civil War. He took advantage of the chaos caused by the Rebel Alliance, and gathered a small group of equally ruthless scum to carve out his own little criminal empire. The slavers created a fiendishly simple modus operandi; they would kidnap friends or relatives of star-port controllers, customs officials, militia captains, or anyone else with information they needed. Upon doing so, they would then contact the family member and blackmail them into providing regular data for their organization. In some cases, all they wanted was the official to plant a transponder program in the proper computer system, allowing them to access particular pieces of information. Other times, a more permanent relationship would be required, and the kidnapped is kept for months of even years on end. In any case, the web of reluctant informants provided Tranta and his group with everything they need to strike quickly and effectively, taking whatever they need and then vanishing before any kind of help arrived."}, {"tag": "p", "text": "They operated out of a small planetoid called Vicerv 3 in the Elrood sector, where they had constructed a veritable fortress beneath the surface of the planet. Due to the increasing profits from their business, the base was able to have comfortable living quarters and all manner of amusement facilities for the men, as well as a docking platform for attack ships, a well-stocked arsenal, and an entire floor of slave pens. No one but the slavers themselves, and the slaves they captured, were ever allowed to come to the planet, buyers were never brought there. To keep their secrecy, they would arrange a neutral site to meet and do business."}, {"tag": "p", "text": "The flagship of the slavers was known to be Tarnta's Fang, a modified CR90 corvette, which Bane himself could usually be found on. Along with many crewmembers, the ship also home to Nuubsal the Hutt, who took care of the slave pens."}, {"tag": "p", "text": "During the height of the Galactic Civil War, the Rebel Alliance decided to track down the base of Consolidations Unlimited, so that they could shut the operation down. To this end, a group of rebels boarded the Fang to gain the coordinates of Vicerv 3. Unfortunately, the rebels accidentally caused the ships engines to malfunction, causing the ship to crash into the planet Darstell 4. Bane himself managed to escape, but it is thought that Nuubsal was killed during the revolt of escaping slaves."}, {"tag": "h2", "text": "Sources"}]}