{"url": "Construction_droid", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Construction droid models"], "nodes": [{"tag": "h1", "text": "Construction droid"}, {"tag": "p", "text": "Construction droids were droids that could be utilized for construction."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Kamino"}, {"tag": "p", "text": "After the great flood of Kamino, the native Kaminoans built their modern cities with repulsorlift construction droids. One such city was their planetary capital, Tipoca City, which rested upon large stilts that extended to the waterworld's seabed. Building and repair work mostly took place during the short annual break of Kamino's otherwise unceasing rain storms."}, {"tag": "h3", "text": "Lothal"}, {"tag": "p", "text": "When the Galactic Empire took over the jogan fruit orchards of Beck Ollet's family on Lothal, they utilized massive construction droids and other equipment for strip-mining that was so outdated that Zare Leonis described them as \"primitive stuff that should have been melted down before the Clone Wars.\" More precise equipment could have left the surrounding land intact, but the Empire was unwilling to spend anything more than bare-bottom credits for the job."}, {"tag": "p", "text": "While serving as a cadet at the Academy for Young Imperials, Leonis observed construction droids ruining grasslands in the Easthills in order to construct a new BlasTech Industries weapons lab."}, {"tag": "p", "text": "During his time at the Arkanis Academy, Leonis was given the task of killing Penn Zarang as an initiation into the Commandant's Cadets. With the help of Lieutenant Chiron and Zarang himself, he buried a side of nerf as a stand-in for the body. Orman le Hivre, doubtful that the body was real, suggested using a construction droid to unearth it, but Anya Razar didn't feel it worth the trouble, and the group accepted that Leonis had in fact killed Zarang."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}