{"url": "Consular_III-class_cruiser", "categories": ["Category:Legends articles", "Category:Consular III-class cruisers", "Category:Corellian Engineering Corporation products", "Category:Cruiser classes", "Category:Galactic Republic starship classes"], "nodes": [{"tag": "h1", "text": "Consular III-class cruiser"}, {"tag": "p", "text": "The Consular III-class space cruiser was a model of starship used by the Galactic Republic to transport diplomats to troubled spots across the galaxy in the years that led up to the Clone Wars. It was distinguishable by its red hull and its unusual design, harking back to the sailing ships of ancient times. At least one such cruiser was captured and modified into a pirate ship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Consular III-class space cruiser was a vessel conceived by the Corellian Engineering Corporation. It was used by the Galactic Republic to provide safe transport for its diplomats. Following old Republican conventions, its hull was coated in crimson to denote the vessel's status of neutrality. The cruiser was shaped like one of the archaic sailing ships that were used for aquatic transport prior to space travel. Even though the design of the Consular III differed drastically from usual construction, it was no unicum. Vessels with similar designs were built throughout galactic history, such as the Fairwind, a large gunship once owned by Jedi Lord and Master Valenthyne Farfalla, or the Merriweather, a bulk cruiser of Tof make."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Consular III belonged to the same line as the earlier Consular-class cruiser, which was put into service by 990 BBY and was still used around the Invasion of Naboo in 32 BBY. By the end of the Clone Wars in 19 BBY, a Consular III cruiser christened the Dura-Khan III had been claimed as booty by the pirate named Reddjak, who had modified it for piracy and renamed it Blood Brother."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The pirate ship Blood Brother was the first Consular III-class cruiser to appear in a Star Wars product. It was featured in the 1986 story The Scarlet Pirate, the third issue of the Star Wars: Droids series of comics, although its class went unmentioned at the time. The Blood Brother was first identified as a Consular-class cruiser in Dawn of Defiance, a 2007 campaign for Wizards of the Coast's version of the Star Wars Roleplaying Game."}, {"tag": "p", "text": "However, the vessel's appearance differed significantly from that of the Radiant VII, a Consular-class cruiser seen in Star Wars: Episode I The Phantom Menace. To resolve that discrepancy, the class to which the Blood Brother belonged was later renamed Consular III by Abel G. Peña and Rich Handley in the first part of \"The Droids Re-Animated,\" a pair of reference articles at the StarWars.com blog."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}