{"url": "Consular-class_cruiser_(Charger_c70_retrofit)", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Ship stubs", "Category:Incomplete lists", "Category:Frigate classes", "Category:Galactic Republic starship classes", "Category:Retrofitted Consular-class cruisers", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "Consular-class cruiser (Charger c70 retrofit)"}, {"tag": "p", "text": "The Consular-class cruiser (Charger c70 retrofit), also known as the Charger C70 Combat Refit, or the Republic frigate, was a modified variant of Consular-class space cruiser that saw service with the Galactic Republic during the Clone Wars. Converted from Judicial Forces starships as part of Project Supercharger, the combat-oriented Charger c70 featured new battle-armored hull and laser turrets and proved a mainstay of the Republic Navy during the conflict."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Charger c70 retrofit, also known as the Republic frigate, was a product of the Corellian Engineering Corporation, based on the hull of the company's earlier Consular-class space cruiser; at 138.55-meters long, it was slightly larger than the original Consulars (at 115 meters). The most important difference between the Charger c70 and its predecessor, however, was its combat configuration. Unlike the unarmed Judicial cruiser, the Charger c70 was equipped with four turret-mounted heavy laser cannons (ventral port and starboard and dorsal port and starboard), a forward-mounted twin light laser cannon, and dorsal turret-mounted quad laser cannon. Furthermore, it was outfitted with forward twin concussion missile launchers as well as armored hull plating."}, {"tag": "p", "text": "Like the Consular, the Charger c70 had three sublight engines, though it could travel 1,200 kilometers per hour. to the Consular-class's 900 kph. It featured a forward navigational sensor dish, a port and starboard docking ring, a communications and sensor dish towards the stern, and a deflector shield generator, with sturdier models introduced during the retrofit. The vessel was also equipped with four Republic escape pods and a detachable salon pod in the bow below the bridge for diplomatic meetings."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Republic frigates saw extensive use during the Clone Wars, and served in various roles; while they were often as escort vessels and armored transports, they were considered to excel in the role of scout ship or picket. Some instances also saw them as hospital ships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "With the outbreak of the Clone Wars, the newly-formed and largely-unprepared Republic Navy was forced to press existing ship classes into combat; the Consular-class space cruiser, already in service with the Judicial Forces and the Republic Diplomatic Corps, was selected for this purpose by the Department of Naval Procurement due to its speed and durability. In cooperation with Corellian Engineering, the Department initiated Project Supercharger, with the objective to convert Consular frigates to a war footing. As early as the Battle of Christophsis in 22 BBY, Charger c70s had entered service, with the Swift Return being destroyed by Admiral Trench. During the Battle of Ryloth, Grand Master Yoda of the Jedi Order made use of a Republic frigate to travel to Rugosa with his clone trooper escort in order to negotiate a possible alliance with Katuunko, the King of Toydaria. When they arrived, the vessel was ambushed by a pair of Separatist Munificent-class star frigates."}, {"tag": "p", "text": "Republic frigates also participated in the Defense of Rishi Station as part of the Republic fleet commanded by Kenobi and Skywalker. After Skywalker's astromech droid, R2-D2, was obtained by General Grievous, R2-D2's datafiles were intact, and Grievous was able to glance at Republic military strategies and information, including information on Republic frigates. After the capture of Trade Federation Viceroy Nute Gunray on Rodia, Jedi Master Luminara Unduli and Padawan Ahsoka Tano used a Republic frigate to ferry Gunray from the surface to the Tranquility, a Venator-class Star Destroyer in orbit above Rodia, and docked with the vessel. After Separatist agents managed to liberate Gunray, they used the same Republic frigate to escape."}, {"tag": "p", "text": "When Jedi General Aayla Secura's vessels were attacked by Separatist naval forces that culminated in the Battle of Quell, Skywalker, Tano, and their forces arrived to evacuate Secura and her troops. During the battle, a Republic frigate docked with Secura's flagship, and after Skywalker sustained critical injuries during the escape, planned to dock with the Resolute, Skywalker's flagship under the command of Admiral Yularen. During the docking procedure, however, Vulture droid starfighters attacked the frigate, destroying its forward navigational dish and sensor, and damaging the bridge, killing a clone trooper pilot. The damage inadvertently caused the vessel's hyperdrive to activate; it had to take evasive action to prevent a collision with the Resolute and jumped into hyperspace in-atmosphere. When the frigate turned out to be on a collision course with a star, Secura, Tano, and others deactivated the power to exit hyperspace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Republic frigate debuted in the 2008 Star Wars: The Clone Wars film. It was first identified as the Republic frigate in the StarWars.com Encyclopedia, and was identified as a Charger c70 retrofit in the 2018 canon reference book Star Wars Encyclopedia of Starfighters and Other Vehicles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}