{"url": "Contingency", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Cleanup", "Category:Pages needing citation", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Contingency"}, {"tag": "p", "text": "The Contingency was a plan devised by Galactic Emperor Darth Sidious for the future of the Galactic Empire in the event of his death. The task of putting the Contingency into effect was given to Gallius Rax, a protégé of the Emperor. The Emperor's plan was to have the Empire destroyed, culling its weak elements and punishing it for failing to protect him, while also ensuring its rebirth in the Unknown Regions of space at the hands of an elect assembled by the Emperor and Rax in order to continue its legacy."}, {"tag": "p", "text": "Ultimately, the plan was to destroy the planet Jakku during a great battle between the Empire and its adversaries; namely, the New Republic, the government established by the Rebel Alliance. After the Emperor's death at the Battle of Endor, Rax began the Contingency with Operation: Cinder, scouring both loyal and rebel worlds across the galaxy, such as Naboo and Vardos, which was ordered via Messenger droids. He also arranged for the deaths of several Imperial Military commanders, and allowed the opposing New Republic to win a succession of victories against the Empire."}, {"tag": "p", "text": "Rising to become the self-appointed Counselor to the Empire, Rax was able to unite the Empire under his command. He brought them to Jakku, where he intended to blow up the planet during the battle between Imperial and Republic forces, effectively crippling both sides. However, he was prevented from fulfilling the final stage of the plan by Grand Admiral Rae Sloane, who fatally shot Rax during the Battle of Jakku. The mortally wounded Rax urged Sloane to flee to the Unknown Regions and regroup with the others, telling her that she now served the Contingency in his place. Sloane did so, retreating to the Unknown Regions aboard the Imperialis alongside Brendol Hux, his son Armitage Hux, and their child soldiers. They regrouped with others aboard the Eclipse, where Sloane planned to rebuild the Empire. This movement eventually gave rise to the First Order."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Contingency was a secret plan devised by Emperor Palpatine, whose true identity was that of the Dark Lord of the Sith Darth Sidious, to ensure that the Galactic Empire did not outlive him should he die prematurely, while also simultaneously ensuring the Empire's rebirth among the resources and personnel that would manage to survive the Contingency. In secret, Emperor Palpatine had been sending Imperial scouts into the Unknown Regions of the galaxy over the course of many decades. During this time, he had been investing in expensive resources used to seed the Unknown Regions with storehouses, shipyards, and laboratories, a fact known only to Emperor Palpatine and an elect assembled by him."}, {"tag": "p", "text": "The first part of the Contingency was the Jakku Observatory, one of many Observatories established by Palpatine across the galaxy. The Jakku Observatory was an underground storehouse and repository in the Plaintive Hand plateau which was built over a borehole that led directly to Jakku's core. In 30 BBY, while still Supreme Chancellor of the Galactic Republic, Palpatine and his Adviser Yupe Tashu had initiated the construction of the Observatory and the borehole. Palpatine used an army of droids to build the facility. The Contingency involved pouring Sith relics and artifacts down the borehole to detonate Jakku's core, triggering a cataclysm that would destroy the planet and the orbiting and grounded Imperial and enemy forces. Using the analogy of a Shah-tezh game, Palpatine viewed this as a means of destroying both the Empire and his enemies."}, {"tag": "p", "text": "The second part of the Contingency was Gallius Rax, a human native of Jakku whom Palpatine had taken on as a protégé after Rax stumbled upon the construction site. Palpatine tasked Rax with guarding the site during his absence, during which Palpatine engineered his rise to power. After Rax had proven his service, Palpatine rewarded him by inducting him into Imperial service once the Empire was fully formed. Palpatine arranged for him to become a Commander in the Naval Intelligence Agency before rising to the rank of Fleet Admiral. In the event of his own death, Palpatine intended for Rax to carry out the Contingency, referring to it as the latter's destiny. In order to transmit posthumous orders, Palpatine had special sentinel droids built to communicate with Rax and other \"worthy\" Imperial officers."}, {"tag": "p", "text": "The third part of the Contingency involved Rax and Palpatine's elect—a select number of \"worthy\" Imperial officers and personnel, which Rax expanded upon—fleeing into the Unknown Regions, which were notorious for being near impossible to navigate, using secret hyperspace coordinates. Using information partially gleaned from Grand Admiral Thrawn, a native of the Unknown Regions, ancient computers housed inside the Jakku Observatory plotted routes through the Unknown Regions for years, eventually charting a safe passage. Once the safe route had been mapped, Rax arranged for the Emperor's Super Star Destroyer, the Eclipse, to travel in advance to the Unknown Regions. There, Rax planned to form a new Empire."}, {"tag": "h3", "text": "Imperial apocalypse"}, {"tag": "p", "text": "After Emperor Palpatine perished at the Battle of Endor in 4 ABY, the Contingency was activated. The Contingency began with Messenger droids delivering the Emperor's final command: Operation: Cinder, which involved the use of climate disruption arrays to scour Naboo and many other planets, both those loyal to the Empire, such as Vardos, and those that were rebellious. Fleet Admiral Gallius Rax received a Sentinel droid of his own informing him of the Emperor's death and ordering him to begin the Contingency. In the time following the events on Endor, Admiral Rax engineered the deaths of numerous Imperial commanders by leaking information about Imperial fleet movements and the emergency summit on Akiva to the New Republic, the government established by the Rebel Alliance after the Battle of Endor."}, {"tag": "p", "text": "Admiral Rax kept the Contingency a secret from even his own subordinates, including Grand Admiral Rae Sloane, who disliked his secretive style of leadership, and his Shadow Council, an advisory council assembled by Rax consisting of senior Imperial officials and commanders. After Sloane was presumed lost or captured during an attack on the New Republic capital of Chandrila, Rax assumed leadership of the united Empire as Counselor to the Empire. He then ordered the Empire to assemble at Jakku for a final showdown with the New Republic. Unknown to the Shadow Council, Rax was planning to kill them, with the exception of the former Commandant Brendol Hux, whom he regarded as essential to the Contingency and the Empire's future."}, {"tag": "p", "text": "On Jakku, Counselor Rax put the Contingency into motion by setting the stage for a massive battle with the New Republic. Intending to destroy the \"Old Empire,\" Rax had Commandant Hux train local children into a force of soldiers who would become the foundations of the new Empire; Commandant Hux had previously run a secret society of child soldiers at his academy. While the battle was raging, Rax and Yupe Tashu poured Sith relics down the planet's core in order to trigger a cataclysm. Rax then killed Tashu as part of the Contingency, pushing him into the borehole. Before Rax could escape offworld with Brendol Hux, his son Armitage Hux, and their child soldiers aboard a replica of Palpatine's yacht, the Imperialis, Rax was killed by a vengeful Grand Admiral Sloane with the help of the New Republic operatives Norra Wexley and Brentin Lore Wexley."}, {"tag": "p", "text": "In his last dying moments, Counselor Rax told Sloane that she now served the Contingency in his place and told her to accompany the others aboard the Imperialis to the Unknown Regions, where the Emperor's flagship Eclipse was waiting in uncharted space. Despite Sloane foiling Rax's plot, the attrition afflicted by the Contingency helped bring about the Empire's defeat during the Battle of Jakku. Following the Battle of Jakku, Grand Vizier Mas Amedda formally surrendered the Empire to the New Republic and signed the Galactic Concordance in 5 ABY. The Galactic Concordance decentralized the Empire, forcing it to remain within defined boundaries in the Core and Inner Rim, while on Coruscant, the capital world of the Empire, a provisional government overseen by the Republic was established."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Several Imperial remnants rejected the peace treaty signed between the Empire and the Republic and continued to hold out in the months following the end of the Galactic Civil War, although they were few in number as a result of the Emperor's Contingency. Other Imperial forces fled into the Unknown Regions using the secret hyperspace coordinates. Chafing under New Republic restrictions and war reparations, the \"Old Empire\" eventually withered away into a remnant of hardliners locked into a Cold War with the Republic. Other Imperial sympathizers were part of the Republic itself, some of whom joined with the Centrists in the Galactic Senate."}, {"tag": "p", "text": "Aboard the replica Imperialis, which was piloted by a Sentinel droid, Rae Sloane, Brendol Hux, Armitage Hux, and their child soldiers eventually reached the Eclipse in the Unknown Regions, where the Emperor's elect awaited Rax. There, Sloane saw an opportunity to rebuild the Empire, deeming it their \"first order.\" This movement birthed the First Order, which sought to reclaim the lost Imperial cause and glory. During their military buildup, the First Order colonized large swaths of the Unknown Regions. The First Order would later be joined by Imperial secessionists from within the New Republic as well as Imperial fleets whom vanished from Imperial Space. The First Order was eventually taken over by Supreme Leader Snoke, whose rise to power was seen as unexpected by the last of the old Imperial leadership. Years later, as the First Order invaded the New Republic, Snoke reflected on the Contingency, recalling how Emperor Palpatine had arranged for various assets and materials to be sent to the Unknown Regions beforehand."}, {"tag": "h3", "text": "A new Sith Empire"}, {"tag": "p", "text": "Though Snoke initially maintained an iron grip on the fascistic military junta, his reign was cut short during the conflict between the First Order and Resistance spearheaded by General Leia Organa. Snoke had, in reality, been genetically engineered by members of the Sith Eternal cult, a zealous collection of dark side loyalists which sought to revive the Sith religion and establish a galaxy-wide authoritarian regime once again. Deep within the reaches of the Unknown Regions existed Exegol, the hidden world of the Sith, which housed the reborn Darth Sidious as he pulled the strings of Snoke in order to seduce the scion of the Skywalker bloodline, the young Jedi Ben Solo. As Snoke's apprentice, Ben Solo took the name of Kylo Ren, Master of the Knights of Ren and champion of the First Order; a dark warrior who possessed raw strength in the Force. Ren tolerated years of abuse under Snoke's wing, eventually culminating in the assassination of Snoke at the hands of the dark knight and his subsequent usurpation of Snoke's position of Supreme Leader. Believing he had at last freed himself from harsh confines of apprenticeship, Ren had, in actuality, completed the final test crafted by Sidious' Sith Eternal by acting as a true Sith and killing his own master in the name of obtaining greater power. It was now clear that Kylo Ren had established himself as worthy of inheriting the mantle of Dark Lord of the Sith, with Sidious eager to harness the power of his new Imperial heir."}, {"tag": "p", "text": "Within a year of Ren's ascension to Supreme Leader, the galaxy was shaken by a broadcast of the presumed-dead Emperor, threatening revenge against free worlds and heralding the return of the Sith. Unwilling to allow this threat to his power to persist, Supreme Leader Ren immediately shifted his efforts from annihilating the remnants of the Resistance to locating and eliminating the phantom Emperor on Exegol. Though Ren had discovered the whereabouts of Sidious, he abandoned his original plan to simply kill the Emperor upon being informed of the extent of the Dark Lord's thirty-year-long machinations. Immediately prior to the death of his original physical body, Sidious had transferred his consciousness far into the depths of the Unknown Regions, where an imperfect clone body crafted by the Sith Eternal awaited possession. It was on this hidden world where Sidious and his underlings forged the groundwork of their new regime: the Final Order, a reincarnated Sith Empire comprised of Xyston-class Star Destroyers, each housing an axial superlaser capable of obliterating entire worlds."}, {"tag": "p", "text": "With the combined might of the Final Order and sizable First Order Naval fleet, Palpatine was confident that his new Sith Empire would subjugate the galaxy at large through sheer intimidation and military might. Supreme Leader Ren was emboldened by the prospect of himself as the galaxy's new Emperor, though this position was promised to him on the sole condition that he would eliminate the only threat to Sidious' plan: Jedi aspirant Rey, whom was also revealed to be the granddaughter of the Emperor himself. Ren feigned allegiance to Sidious, although the Supreme Leader had no intention of obeying the fallen Emperor."}, {"tag": "p", "text": "Through the bond the two Force users possessed, Ren deduced that he and the Jedi Rey formed an exceedingly powerful dyad in the Force, a phenomenon which had not been seen for generations. It was the extent of their bond which gave Ren the confidence to declare that the combined strength of him and Rey would overpower Sidious and allow the dyad to rule the galaxy together as Emperor and Empress. While he nearly maintained his darkness to the very end, Ren was eventually redeemed by the combined compassion of his family and Rey herself, reclaiming the identity of Ben Solo once more. Sidious was not discouraged by this setback, however, as he then shifted his attention to his granddaughter, seeking to possess her physical body through an ancient Sith Ritual which involved Rey striking down her grandfather in anger. Rey journeyed to Exegol in an effort to confront the phantom menace in the flesh, though she nearly succumbed to the temptations of Sidious immediately before Ben Solo's arrival."}, {"tag": "p", "text": "Together, the dyad stood in defiance of Sidious, although the reunion was interrupted by the Emperor's mastery of the Force, inadvertently discovering the existence of the dyad which was held between the two Jedi. Seeing no need for a host body, Sidious drained the life force from both Ben and Rey, eventually restoring himself to full power and naming himself as the Sith Eternal's God-Emperor. In retaliation for his initial death thirty-one years prior at the hands of the Chosen One Anakin Skywalker, Palpatine disposed of Ben Solo into a nearby chasm, declaring the end of the Skywalker bloodline with Solo's death. The restored Emperor's reign was short-lived, however, as Rey called upon the strength of all the Jedi past in order to ultimately defeat Sidious. The immense strain and exertion to completely obliterate the Emperor as well as the surrounding amphitheater led to the subsequent death of Rey, whose life was restored by Solo (who had survived the Emperor's attempt on his life), at the cost of his own. With the permanent death of their figurehead, both the Sith Eternal and Final Order crumbled into nothingness, owing to the arrival of the Citizens' Fleet which bolstered the Resistance force that had invaded Exegol. The conclusion of the actions on Exegol marked the end of Sidious' decades-long tyrannical influence over the inhabitants of the galaxy, with the decisive victory serving as the catalyst for a series of galaxy-wide uprisings which saw countless systems counter the authoritarian rule of the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Contingency was first featured in the novel Lost Stars and later appeared in the Aftermath trilogy of novels as an explanation for the quick fall of the Galactic Empire.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}