{"url": "Coovern", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Moffs of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Coovern"}, {"tag": "p", "text": "Coovern was a moff in the highest ranks of the Galactic Empire who attempted to replace Colonel Shakara Nuress as leader of the Empire's 204th Imperial Fighter Wing with Captain Jothal Gablerone. After the Rebel Alliance began a campaign into the Mid Rim around 1 ABY, Coovern and Minister Khemt were killed by the Sith Lord Darth Vader. Their deaths, reported as tragic accidents, were part of a purge of those who were blamed by Emperor Palpatine for the destruction of the Death Star superweapon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Galactic Civil War, Coovern served among the highest echelons of the Galactic Empire, holding the rank of moff. Coovern once assigned Imperial Captain Jothal Gablerone to the Empire's 204th Imperial Fighter Wing to replace its commanding officer, Colonel Shakara Nuress, who ultimately refused to retire. Shortly after the Rebel Alliance began a campaign into the Mid Rim around 1 ABY, Coovern and Khemt, a minister who was also among the Empire's highest ranks, were both killed by the Sith Lord Darth Vader. Their deaths came as part of a purge of those whom Emperor Palpatine blamed for the loss of the Empire's Death Star superweapon."}, {"tag": "p", "text": "Coovern and Khemt were officially claimed to have died in tragic accidents. However, Everi Chalis, the governor of the planet Haidoral Prime, learned how the moff had actually died through her own sources. In 3 ABY, Chalis defected to the Alliance's 61st Mobile Infantry and revealed the true nature of Coovern's death to the rebel company's captain, Micha Evon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Coovern was first mentioned in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}