{"url": "CorSec_Database_A-G", "categories": ["Category:Legends articles", "Category:In-universe source material", "Category:Online reference databases", "Category:Star Wars Galaxies articles"], "nodes": [{"tag": "h1", "text": "CorSec Database A-G"}, {"tag": "p", "text": "The CorSec Database A-G is the first part of the in-universe CorSec Database for Star Wars Galaxies gamers. It was published on June 9, 2006 on the Star Wars Galaxies official website."}, {"tag": "h2", "text": "Content"}, {"tag": "p", "text": "The database accounts for the following non-player characters and organizations:"}, {"tag": "p", "text": "The database is continued in the second part, which accounts for H-Z."}, {"tag": "h2", "text": "In-universe perspective"}, {"tag": "p", "text": "The database is written from an in-universe perspective and presented as a database being hacked, but the hacking process is interrupted by the arrival of CorSec authorities."}, {"tag": "h3", "text": "Introductory text"}, {"tag": "p", "text": "---Welcome to the Corellian Security Forces HoloNet Database, Please enter your security code to continue---"}, {"tag": "p", "text": "\"I've almost got it....\""}, {"tag": "p", "text": "\"You better hurry up and finish hacking into their computer. We only have a few more minutes before another patrol comes by. If you don't get those data files, the boss isn't going to be happy...\""}, {"tag": "p", "text": "---Invalid Code, Please enter a valid security code to continue-----"}, {"tag": "p", "text": "\"Wait a minute... almost there....\""}, {"tag": "p", "text": "\"Got it.\""}, {"tag": "p", "text": "---Please choose a category---"}, {"tag": "p", "text": "\"Criminal Database, Galactic, Notorius, A through G\""}, {"tag": "p", "text": "---Below you will find background information on known criminals, various organizations, species and other individuals tracked by CorSec Intelligence. This information is to be used to assist with your investigations and reporting, under no circumstances is this information to be transmitted to unauthorized personnel.---"}, {"tag": "h3", "text": "Exit text"}, {"tag": "p", "text": "\"Hurry up, I hear a guard coming!\""}, {"tag": "p", "text": "\"I'm going as fast as I can, dang we are going to have to get the rest later\""}, {"tag": "p", "text": "\"Let's get out of here now!\""}, {"tag": "p", "text": "---Thank you for using the CorSec Database---"}, {"tag": "p", "text": "\"What's this? Security there are intruders in the complex......\""}, {"tag": "p", "text": "To be Continued..."}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}