{"url": "Cord-class_starfighter/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Galactic Republic starfighter classes"], "nodes": [{"tag": "h1", "text": "Cord-class starfighter"}, {"tag": "p", "text": "Used by the Galactic Republic during the Clone Wars, the Cord-class starfighter was a starfighter model equipped with a single laser cannon. A Cord-class starfighter was stationed aboard the Republic Acclamator-class assault ship Candaserri when the assault ship was in orbit over Raxus Prime following the Battle of Raxus Prime in 22 BBY. After a battle, the starfighters were serviced by repair droids or the clone trooper pilots themselves."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Cord-class starfighter was a starship model utilized by the Galactic Republic during the Clone Wars against the Confederacy of Independent Systems. Cord-class starfighters were armed with a single laser cannon and were often carried aboard the Republic's Acclamator-class assault ships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 21.9 BBY, at least one Cord-class starfighter was stationed aboard the Republic Acclamator-class assault ship Candaserri while the cruiser was in orbit of the planet Raxus Prime following the planetside battle. When the refugee Boba Fett—who had masqueraded as an orphan named \"Teff\" to hide his identity from the Republic—was brought aboard the Candaserri soon after the battle, he witnessed a group of Republic clone troopers servicing the Cord-class starfighter in one of the Candaserri's hangars. Fett believed that a pair of the troopers servicing the starfighter might have been the clone pilots CT-4/163 and CT-5/501, but he could not tell for certain due to the clones' nearly identical armor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Cord-class starfighter first appeared in the second installment of the Boba Fett young reader book series, Crossfire, written by Terry Bisson and released in 2002."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}