{"url": "Cord%C3%A9/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic individuals", "Category:Humans", "Category:Naboo", "Category:Naboo Royal Handmaidens", "Category:Political decoys"], "nodes": [{"tag": "h1", "text": "Cordé"}, {"tag": "p", "text": "Cordé was a Human female handmaiden and decoy for Senator Padmé Amidala of Naboo during the end of the Separatist Crisis."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "While Amidala was Queen of Naboo, the role of decoy was mainly filled by Sabé. Cordé replaced her when Amidala stepped down from the throne and became the Senatorial representative of the Chommell sector. Like Sabé, Cordé worked closely with Padmé, and the two women became close friends."}, {"tag": "p", "text": "In 22 BBY, Cordé was killed in an assassination attempt on Amidala when the Senator returned to Coruscant for the Senate vote on the Military Creation Act. A Clawdite bounty hunter named Zam Wesell was responsible for the attack. One of Amidala's other handmaidens, Versé, and five Naboo guards were also killed in the blast."}, {"tag": "p", "text": "Cordé died apologizing to Amidala, disheartened in thinking she had failed her duty to her mistress. On the contrary, the Senator was heartbroken by Cordé's sacrifice, regrettably accepting that she had performed her duty. At Captain Typho's insistence, Amidala reluctantly left the bodies of Cordé and the other victims behind, promising herself that their sacrifice would not be in vain."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cordé was played by three people during her brief appearance in Attack of the Clones. She was played by Natalie Portman for her small scenes inside the cruiser and walking down the ramp, by a stunt actress for the explosion, and by Veronica Segura for her death scene."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}