{"url": "Cord%C3%A9", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Republic individuals", "Category:Humans", "Category:Naboo Royal Handmaidens", "Category:Political decoys"], "nodes": [{"tag": "h1", "text": "Cordé"}, {"tag": "p", "text": "Cordé, formerly known as Cordyn, was a handmaiden who served Senator Padmé Amidala in the days leading up to the Clone Wars. She was acting as a decoy when she was killed in an attempt on Amidala's life by Clawdite bounty hunter Zam Wesell."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cordyn was a human female born on the planet Naboo. She had a sister who worked as a jeweler. In 32 BBY, Cordyn was one of several girls considered by Captain Quarsh Panaka of the Royal Naboo Security Forces while he was looking for additional handmaidens for newly-elected Queen of Naboo Padmé Amidala, along with Rabene Tonsort. Cordyn strongly resembled Amidala, but Panaka removed her from consideration because her poor hand-eye coordination meant she lacked skill with a blaster or other forms of combat."}, {"tag": "p", "text": "Four years later, after Amidala's two terms as monarch ended, she was asked by Queen Réillata to serve as the Chommell sector's Senator in the Galactic Senate. She came to the conclusion that she would need additional handmaidens to act as decoys. Rabé suggested Cordyn, pointing out that her resemblance to the senator would make her an excellent decoy despite her poor fighting skills. Cordyn was tracked down by Saché on behalf of Amidala and eventually agreed to take on the role, taking on the name Cordé. Amidala also took on two other handmaidens, Versé and Dormé."}, {"tag": "p", "text": "In the days leading up to the outbreak of the Clone Wars, Amidala returned to the galactic capital of Coruscant to take part in a vote on the creation of a Republic army in the wake of the Separatist Crisis."}, {"tag": "p", "text": "On the orders of Amidala's chief of security, Captain Typho, Cordé served as her decoy, traveling on the senator's ship posing as Amidala while the senator piloted a Naboo starfighter in disguise. Upon landing, Cordé descended the ramp with her retinue, but was soon caught up in an explosion that destroyed the ship and killed both her and six other people. The explosion was set up by bounty hunter Zam Wesell, who had been hired by Jango Fett to assassinate the senator."}, {"tag": "p", "text": "While Cordé lay dying, Amidala ran to her handmaiden's side. With her dying words, Cordé apologized for failing her mistress, though Amidala insisted that she had not. Sometime later, Amidala shared private tears for Cordé with Duja, another of her handmaidens."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cordé had brown hair, brown eyes and light skin. Despite being slightly taller than Padmé Amidala, she was considered the closest physical match to her."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Cordé was able to perfect Amidala's voice to the point that even a voice identifier couldn't tell the difference. However, she lacked combat ability, especially with a blaster, due to poor hand-eye coordination."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cordé was played by Natalie Portman inside the cruiser and walking down the entry ramp, a stunt actress during the explosion that took her life, and Veronica Segura during her death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}