{"url": "Core_ship", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Confederacy of Independent Systems starship classes", "Category:Core ships", "Category:Trade Federation starship classes"], "nodes": [{"tag": "h1", "text": "Core ship"}, {"tag": "p", "text": "Core ships were modified Lucrehulk-class Battleship central spheres that were used by the Trade Federation for planetary landings during the Clone Wars and often hosted Separatist leaders. Equipped with both land and air defenses, those autonomous spheres were 696 meters in diameter and could carry numerous B1-series battle droids."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Core ships were huge autonomous Trade Federation command vessels modified from the central spheres of Lucrehulk-class Battleships. A core ship's central diameter came to 696 meters, or 2,283 feet, and the vessel possessed landing legs which retracted into the hull during travel in space. Towards the top of the ship was a command tower and a sensor antenna."}, {"tag": "p", "text": "Core ships could carry vast numbers of B1-series battle droids. The ships had air and land defenses. The Federation would use core ships for planetary landings during the Clone Wars, and the craft were often used to host leaders of the Confederacy of Independent Systems. Circular repulsorlift pits were used as service areas for core ships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Several core ships were present on Geonosis prior to and during the First Battle of Geonosis. DH-Omni Support Vessels, a Hoersch-Kessel Drive Inc. supply ship used by the Confederacy, were built from salvaged core ships. Skytop Station was a core ship converted to serve as a listening post. In 19 BBY, a modified core ship served as the venue for a meeting between the Separatist Council and General Grievous on Utapau, shortly before Grievous' final duel with Jedi Master Obi-Wan Kenobi."}, {"tag": "p", "text": "In 14 BBY, the fifth year of the Imperial Era, Moff Wilhuff Tarkin and Sith Lord Darth Vader led an Imperial mission to Murkhana. While Tarkin was looking through a viewport on the Carrion Spike, it was impossible to tell the core ship repulsorlift pits from bomb craters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearacnes"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}