{"url": "Core_ship/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems starship classes", "Category:Core ships", "Category:CSA starship classes", "Category:Trade Federation starship classes"], "nodes": [{"tag": "h1", "text": "Core ship"}, {"tag": "p", "text": "Core ships were modified Lucrehulk-class modular control cores that were used as an autonomous transport by the Trade Federation and later the Confederacy of Independent Systems during the Clone Wars as well as the Separatist holdouts during the Imperial Period."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "While fully capable spacecraft in their own right, the core ships were also able to reattach themselves to the outer ring hull of a Lucrehulk-class battleship and thus could resume their role as command cores.\nThanks to their modular design, the spherical vessels could also be attached to a number of other Federation ship-designs, like cruisers, destroyers, tankers and container vessels."}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The hierarchical arrangement of living quarters on a core ship resembled that of Neimoidian hives. The command bridges, executive suites and treasuries were located in the core ship's upper pole and towers. Lower levels were for junior managers, publicists and droid storage, and on at least some variants, much of the hull above the ship's equator served as a single vast hangar bay and flight deck."}, {"tag": "p", "text": "The lowest levels were given over to engineering areas and conference rooms, areas habitually shunned by high-ranking Trade Federation officials, who preferred to use droids to perform the demeaning and difficult responsibilities of dealing with outsiders or complex equipment."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "Core ships were designed to be capable of planetary landing, and equipped with massive repulsorlift suspensor units installed on their ventral section. In addition to these repulsorlift units, a ventral ion-thruster allowed for rapid take-off and escape from orbit. The core ship was also equipped with numerous landing legs, though the landing gear required repulsorlift assistance to support the hull in launch posture for any length of time."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The basic type of core ship was a transport equipped only with point-defense laser cannons, designed to carry supplies around the galaxy. It had a sensor array at the top of its command tower that was similar in style to the sensor globes on the later Star Destroyer models."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The core module design was at least a century old by 22 BBY, and had undergone few changes throughout that time.\nHowever, after the Invasion of Naboo, the Galactic Republic ordered the Trade Federation to disband its military forces. The crafty Trade Federation pretended to comply with this command by apparently disassembling most of its battleships, only to transform their centrispheres into Lucrehulk-class core ships."}, {"tag": "p", "text": "During the First Battle of Geonosis, core ships successfully withdrew legions of battle droids from the planet's foundries in the face of the Republic assault, and during the Clone Wars, they transported military equipment and troops to many worlds. During the battle, some core ships were brought down by Republic SPHA-T walkers."}, {"tag": "p", "text": "Towards the end of the Battle of Geonosis, a squad of clone commandos was able to infiltrate a disabled core ship and retrieve its launch codes. This allowed the Republic to prevent any more Separatist ships from leaving the planet."}, {"tag": "p", "text": "During the Clone Wars, core ships underwent upgrades and modifications which led to a variety of internal and external configurations. Some of these were combat-capable variants, destroyers equipped with heavy weapons and droid starfighter swarms that could match the Republic's medium capital ships."}, {"tag": "p", "text": "In 21 BBY, the Separatist force deployed to secure Spaarti Creations on Cartao consisted of a core ship equipped with three C-9979 landing craft and around five thousand battle droids."}, {"tag": "p", "text": "Later on in the Clone Wars, a ship of this type, the Gahenna, was involved in an orbital duel above Honoghr and subsequently crashed on the planet, while two more participated in the Battle of Rendili, where they proved an equal match for two Acclamator-class assault ships. When a third Acclamator and five Dreadnaught-class cruisers of the Rendili Home Defense Fleet had their firepower added to the battle, the two were destroyed."}, {"tag": "p", "text": "At least one core ship, the Unlimited Projection, was modified for long-term planetary deployment as a semi-permanent surface base on Utapau as the headquarters of General Grievous. Another core ship was left derelict on Geonosis during the Galactic Civil War."}, {"tag": "p", "text": "Following the end of the Clone Wars, the few remaining Lucrehulk battleships and core ships were sold to the Corporate Sector Authority and to wealthy merchants."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}