{"url": "Corellia/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederation planets", "Category:Core Founders", "Category:Corellia locations", "Category:Corellia system planets", "Category:Corellian Run", "Category:Corellian Trade Spine", "Category:Fortress worlds", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Infinite Empire planets", "Category:New Republic planets", "Category:Planets with shipyards", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Corellia"}, {"tag": "p", "text": "Corellia was the capital planet of the Corellian system, which included Selonia, Drall, Tralus, and Talus. It was also the birthplace of smuggler and New Republic General Han Solo as well as Rogue Squadron pilot and New Republic hero Wedge Antilles, along with many other humans who played important roles in the histories of the Rebel Alliance, New Republic and Galactic Alliance."}, {"tag": "p", "text": "Collectively, the planets of the system were known as the Five Brothers. As the largest planet and the closest to Corell, Corellia was often called the \"Eldest Brother\" or the \"Eldest.\" Historians believed the Celestials assembled the system artificially, the worlds brought from other parts of the galaxy for unknown reasons. Some believed that these Celestials populated Corellia with Humans from Coruscant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Corellia was the first planet from the star Corell in the Corellian system of the Corellian sector, which was itself part of the Core Worlds region of the galaxy. Considered to be one of the inner worlds of the Core, Corellia was also located at the intersection of the Corellian Run and the Corellian Trade Spine. Corellia was one of the Five Brothers, a collective term for the five terrestrial planets in the Corellian system. Corellia, known as the \"Elder Brother,\" served as the administrative center for its entire sector. Its day lasted 25 standard hours, while its year consisted of 329 standard days."}, {"tag": "p", "text": "A terrestrial world with a diameter of 11,000 kilometers, Corellia possessed a breathable atmosphere, a temperate climate, standard gravity, and a moderate hydrosphere. Corellian weather was characterized by warm, sunny days separated by long, severe rainstorms. Like every other planet in the Corellian system, Corellia had a planetary repulsor. The surface of Corellia contained rolling hills, dense forests, lush fields, vast seas, beaches, mountain peaks and crystal swamps, as well as an eastern ocean and a western ocean. Corellia also featured urban terrain, was designated as an industrial world, and was considered a highly developed planet."}, {"tag": "p", "text": "Three large continents were present on Corellia; the planet's capital of Coronet was located on the coast of the southernmost and primary continent, near the eastern ocean. Outside of such cities, the landscape hosted small towns and farms. Corellia was an exporter of alcohol, starships, agricultural goods imported luxury items, raw materials and weapons. Its starship construction facilities had been moved into space, leaving its surface largely rural. The shipyards of the Corellian Engineering Corporation were located in orbit around Corellia, and facilities fitted with warship docks were on the planet."}, {"tag": "p", "text": "Corellian lifeforms included the Corellian grass snake and the Corellian sand panther. The primary law enforcement agency on Corellia was the Corellian Security Force, also known as CorSec, a branch of the planetary government that resembled a police force. The jurisdiction of CorSec included the entirety of Corellia and while each city on Corellia was allowed its own police and detective agencies, CorSec acted in all cities, towns and rural regions, acting as a coordinating force in investigations involving multiple cities or regions."}, {"tag": "p", "text": "Snow-covered mountains dominated part of the landscape. It was rumored to have many deep underwater caverns with orange lightsaber crystals. The largest cities were Coronet, the tourist haven of Kor Vella, the double-city Tyrena and the mountain hamlets of Doaba Guerfel and Bela Vistal. Immigrants from the neighboring planet of Selonia constructed an elaborate network of tunnels beneath the planet's surface. These Selonian Tunnels were used by people of all races as a kind of subterranean metropolis."}, {"tag": "p", "text": "The Corellians were known for their prowess with starships. From building ships to flying them, Corellians were well known for their skills. Because piracy and smuggling were well-known occupations of a strong number of Corellians, the local navy had been specializing in techniques designed to combat economic loss due to their activities. Because of this need, the navy was well-developed and modernized. The CR90 corvette and the Corellian Gunship were two examples, as well as the powerful Corellian Dreadnaught."}, {"tag": "p", "text": "Of interest is the fact that Corellia's navy remained autonomous from the Imperial Navy throughout the time of the Galactic Empire, maintaining its own independence and individual naval traditions until it was dissolved following the original Centerpoint crisis. From this point until partway through the Yuuzhan Vong War, Corellia lacked any autonomous military forces, relying solely on the sector fleet provided by the New Republic."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Republic"}, {"tag": "p", "text": "Corellia may have been placed in its orbital position in the Corellian system by the ancient device known as Centerpoint Station. The world's population of Humans, Drall and Selonians predated its recorded history. Corellia eventually became a slave world of the Infinite Empire. In circa 30,000 BBY, Corellian slaves helped build the Star Forge. When the Rakata fell victim to a plague, the Corellians freed themselves in a revolt that occurred around 25,200 BBY. Corellian explorers early in their history scaled the Kor Vella mesa."}, {"tag": "p", "text": "Corellians spent the next 200 years reverse-engineering the hyperdrive without the Force tools of the Rakata. A midstep, hyperspace cannons, connected Corellia with other Core Worlds such as Coruscant and Duro. The reinvention of the hyperdrive in circa 25,053 BBY let the afore-mentioned and other worlds become the Core Founders of the Galactic Republic."}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "The Corellian Engineering Corporation was founded by a consortium of Corellia's finest designers and shipbuilders early on, perhaps before the dawn of the Republic. While rumors of the Jedi Order's dawn on Corellia were false, as the Jedi were originally from Tython, the Corellian Jedi did keep a distinct set of traditions that set them apart from other Jedi, including green robes and Jedi Credits."}, {"tag": "p", "text": "Corellia was a political power by the time of the Galactic Republic's formation, and the foundation of the Corellian Run in 25,000 BBY ensured its economic dominance within the emerging Republic, of which it was a member in good standing. As Corellia prospered, it expanded its influence into neighboring space, acquiring and colonizing several dozen star systems which collectively became known as the Corellian sector. Over millennia, the world gained a reputation as a source of excellent ships and pilots and a refuge for smugglers."}, {"tag": "p", "text": "Along with Coruscant, Corellia enjoyed the greatest benefits from transactions occurring along the Perlemian Trade Route and the Corellian Run and scouts from Corellia established the Corellian Trade Spine around 5500 BBY. Corellia StarDrive splintered off CEC in c. 5000 BBY, but was bought out by CEC in c. 3000 BBY. CEC was one of the larger shipbuilding firms in the galaxy and its shipyards were one of the most extensive in the galaxy. Examples of Corellian ships included the CR90 Corellian Corvette, the YT-1300 freighter and the DP-20 Corellian Gunship."}, {"tag": "p", "text": "Corellians were among the first and foremost hyperspace explorers. The Corellians discovered New Plympto in 10,000 BBY, Goroth Prime in 8000 BBY and Koboth prior to 219 BBY. They colonized Rabaan in the Subterra Period, Socorro (3000 BBY), Trulalis, and Trigalis. Corellia was an early trading partner of the Wookiees when Kashyyyk entered the Republic (c. 3956 BBY). In the Mandalorian Wars, it was the site of important Republic Navy drydocks."}, {"tag": "p", "text": "Almost 10,000 BBY, a spartan sect established a monastery on Kor Vella. During a boom in CEC's popularity, miners discovered ore deposits near the mesa, transforming the Kor Vella community into a luxurious center of tourism and wealth."}, {"tag": "p", "text": "In 3640 BBY Corellia was invaded by the Sith Empire. Following a period of large-scale conflict the Republic successfully liberated the planet."}, {"tag": "p", "text": "During the third Galactic War in 3627 BBY, Darth Malgus launched a large-scale invasion on Corellia in an attempt to destroy the newly constructed Republic shipyard known as the Meridian Complex."}, {"tag": "p", "text": "Corellia allied with Selonia and Drall circa 500 BBY in a failed attempt to conquer the Federation of the Double Worlds. 30 years later, Corellia attempted to secede from the Republic; although progressing far enough to close its sector's borders and withdraw from the Senate using Contemplanys Hermi, the plan ultimately failed and the system continued as a begrudging Republic member-state."}, {"tag": "p", "text": "The elitist Nomad's Retreat in the Nomad Mountains expanded its membership to become a public resort in 400 BBY. Over the next few centuries, a village grew around the retreat, known as Doaba Guerfel and eventually merged with the Retreat, becoming a resort town. A few decades later in 380 BBY, a Corellian Jedi named Keiran Halcyon defeated the Afarathu pirates, a sect of Selonian terrorists, whom were trying to kill all Humans on Corellia. The Afarathu were not gone forever and would plague Corellia during the Galactic Civil War."}, {"tag": "p", "text": "Although it has most often been regarded as a monarchy due to the presence of royal rulers of some kind, these leaders' direct hand in affairs of state has varied wildly throughout history. At various points, Corellia has been everything from an anarchic kleptocracy to a parliamentary democracy. King Berethron e Solo established a democratic government in 312 BBY, replacing his own absolute monarchy. Corellia was home to several multi-stellar corporate conglomerates, including Gowix Computers (founded in 219 BBY), the Corellia Mining Corporation and of course, CEC. Many of these competed directly with the Trade Federation and InterGalactic Banking Clan for galactic influence. Over time these companies became very powerful and in 150 BBY overthrew the historic parliamentary constitutional monarchy founded by the Royal House of Solo in favor of a government more amenable to unrestricted commerce. This new business-supported regime was called the Diktat."}, {"tag": "p", "text": "Between 46 and 36 BBY, the Nagai scout Krai H'voc settled on Corellia, where she fell in love with and married a Human. After giving birth to Bey, the first known Human-Nagai hybrid, H'voc reluctantly obeyed orders from her Nagai superiors to end her relationship and continue her mission elsewhere. In 33 BBY, Corellia was represented directly in the Galactic Senate by Com Fordox, who in the next year helped elect Palpatine Supreme Chancellor."}, {"tag": "p", "text": "In 27 BBY, Jedi Master Oppo Rancisis personally defended Corellia during the crisis with Ashaar Khorda. The planet's name was pronounced K'rell by Mitth'raw'nuruodo in 27 BBY, but it is unknown if this is the actual name of the planet in Cheunh or if this was on account of Mitth'raw'nuruodo's unfamiliarity with Basic, or indeed if he even knew of the existence of Corellia prior to his first contact with Humans."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Garm Bel Iblis became the Senator of Corellia in 35 BBY and represented the world during the Separatist Crisis in 22 BBY. After a week of secret meetings with Diktat Shyla Merricope, Bel Iblis announced on 13:3:13 GrS that Corellia would close its borders and abstain from the upcoming vote on the Military Creation Act, invoking Contemplanys Hermi, an obscure clause in the Galactic Constitution that allowed Corellia to unilaterally withdraw from the Galactic Senate for the duration of the Separatist Crisis. The closure of Corellia's borders was carried out on 13:3:14."}, {"tag": "p", "text": "Bel Iblis's attempt to insulate the system failed and Corellia was soon embroiled in the subsequent turmoil of the Clone Wars; the world supported the Republic war effort and dispatched task forces from its sector fleet to repel Separatist advances and aid the Jedi. Though the planet was spared an invasion or aggressive military action, presumably the intense fighting on nearby Duro weakened its already troubled economy. The Corellian sector was heavily fortified, but the CIS fleet bypassed it through the Deep Core to attack Coruscant in 19 BBY."}, {"tag": "p", "text": "At some point during the Clone Wars, a Separatist unit successfully infiltrated the planet Corellia. In a remote region of the planet, they managed to secretly build an underground automated droid factory in preparation for a possible invasion of Corellia. The objective was to produce and deploy large amounts of battle droids to cause chaos on the ground while the bulk of Separatist forces engaged the planetary defenses from space. However, the CIS bypassed Corellia when they invaded the Core Worlds and struck directly at Coruscant. The invasion of Corellia never happened and the factory was never activated."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "With the declaration of the New Order, Diktat Dupas Thomree made a deal with Palpatine: Thomree could govern the Corellian Sector as he wished and mostly free of Imperial mandates so long as he paid taxes, war matériel and homage to the Emperor. Immediately after the start of the New Order, Corellia was wracked by anti-Imperial protests."}, {"tag": "p", "text": "The Republic's planetary Governor of Corellia, Fliry Vorru, became the Imperial Moff of the Corellian sector. The Moff tended to turn a blind eye to crime, being more interested in greater power and was considered a rival of Palpatine. In 7 BBY, Vorru was sent to Kessel after being framed by Prince Xizor. This allowed Xizor to set up his Black Sun lieutenant Zekka Thyne as a criminal kingpin on Corellia."}, {"tag": "p", "text": "The Hutt Groola arrived on Corellia in 5 BBY and reopened a bar, which was renamed Groola's Place and transformed into an underground complex. Diktat Dupas Thomree died in 2 BBY. He was replaced by Daclif Gallamby, who was little more than a puppet of the Imperial Governor. At this time, Thrackan Sal-Solo went underground and began plotting secession."}, {"tag": "p", "text": "Garm Bel Iblis's concerns that the New Order was causing Corellia to lose its distinctive identity motivated him to participate in discussions regarding organized resistance to the Empire. As Corellians were drafted into military service for the Empire to deal with the growing Rebellion, the overall security of the sector decreased. Pirates took advantage of the opportunity that presented itself and grew more brazen, launching many raids upon starships that used nearby trade routes."}, {"tag": "p", "text": "Following the abandonment of Massassi Station, the Rebel Alliance established a base on Corellia in 1 ABY before moving on to Hoth. That same year, investors on Corellia found their shares in Bansche Tech and SGI Systems, Inc. worthless after Imperial officers announced the nationalization of the companies in 36:4, and Gowix Computers later transferred its corporate charter from Corellia to Corulag. By 1 ABY, Corellia was one of the few Core Worlds that allowed aliens to work in strategic manufacturing jobs."}, {"tag": "p", "text": "The defecting General Crix Madine was rescued from an Imperial ambush in Coronet City by Rogue Squadron and Han Solo. One year later, Zekka Thyne was captured on Corellia by Colonel Maximilian Veers and Grand Admiral Thrawn. During this action, Thrawn placed a tracking device on a freighter that led the Empire to the Rebellion at Derra IV."}, {"tag": "p", "text": "Although Corellia was a fortress world of the Galactic Empire in 4 ABY, delegates from Corellia were among the main signatories of the Declaration of the Alliance of Free Planets and Corellia was one of the founding member worlds of the New Republic. A week after the Battle of Endor in 4 ABY, Alliance pilots from Rogue Squadron, as well as Ten Numb and Han Solo, were ambushed by Imperial forces on Corellia. A large number of Imperials streamed into the planet following the death of Palpatine, giving new power to pro-Imperial factions on the world. A large Imperial fleet was soon sent by the Imperial Ruling Council to defend the world and its shipyards, including forces from Ord Mirit."}, {"tag": "p", "text": "Six months after Endor, this fleet was one of the most powerful concentrations of Imperial might anywhere in the Core Worlds, consisting of twenty-five Imperial Star Destroyers under Admiral Jaeffis—by comparison, Kuat had just fifteen Star Destroyers and Corellia's defenses were scheduled to be even more heavily reinforced when Admiral Roek arrived to assume overall command, with the Super Star Destroyer Aggressor and five more Imperial-class ships."}, {"tag": "p", "text": "In spite of this massive defending presence, the Rogues returned to Corellia to rescue Fyric Fel and Wynssa Starflare from their kidnappers."}, {"tag": "p", "text": "In the year after Endor, the Imperial Intelligence liaison officer with CorSec, Kirtan Loor, ordered CorSec to attack \"Rebels\" of the New Republic. Many CorSec officers would not cooperate, believing CorSec answered only to the Diktat and not to the Empire and was for fighting criminals rather than \"Rebels.\" One such officer, Corran Horn, was targeted by Loor for assassination and fled the planet. He was soon followed by fellow officers Gil Bastra and Iella Wessiri, as well as Iella's husband Diric Wessiri, all of whom faked their own deaths. In the light of this lack of cooperation, the Diktat dissolved CorSec and replaced it with the pro-Imperial Public Safety Service."}, {"tag": "p", "text": "Grand Admiral Danetta Pitta had taken command of the Imperial forces at Corellia in 6 ABY, largely by bribing the Diktat, although it is likely that both Pitta and Gallamby remained nominally loyal to Imperial Center. They were challenged by Josef Grunger, who had seized control of Aggressor and possibly some other elements of the defending fleet and who was now aiming to claim the Imperial throne. As Grunger moved to seize control of Corellian space, he clashed with Pitta at the Battle of Tralus, which left both Grand Admirals dead, Aggressor and Pitta's Torpedo Sphere destroyed and both fleets badly mauled."}, {"tag": "p", "text": "Corellia was an Imperial fortress world as late as 6 ABY and was under Imperial control as late as the Thrawn campaign of 9 ABY. It is not clear how effective the Imperial military presence at Corellia was after Tralus, but, the New Republic was slow to take control and the Diktat remained in power as late as 12 ABY. It was probably only after this date that Gallamby withdrew to hiding in the Outlier systems, with Thrackan Sal-Solo and other Imperial functionaries;"}, {"tag": "p", "text": "Due to the many Corellian fighters serving in the Rebel military, Corellia had long been accorded a leading political role in the Alliance and now, with countless Corellian expatriates at large within New Republic-held territory, the planet was represented in absentia by Doman Beruss on the New Republic Provisional Council. As an unhappy consequence, many Corellian expatriates loyal to the New Republic were forbidden from returning to their homeworld by the Diktat, so the Corellian Sanctuary was built on Coruscant to honor the war dead and provide a focus for the community."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "Around 12 ABY, the Corellian Sector finally joined the New Republic. Diktat Daclif Gallamby was replaced by the New Republic-appointed Governor-General Micamberlecto of Froz to administrate Corellian Sector. The New Republic Medical Institute was established on Corellia."}, {"tag": "p", "text": "In 14 ABY, Kyle Katarn and Jaden Korr went on an investigation mission after receiving reports of cult activity in Coronet. Upon receiving a distress call from a mag-lev train, Jaden and Kyle found out that the Disciples of Ragnos were behind the attempts to blow up the train. Korr eventually stopped the bomb and the train and Katarn destroyed mercenary cargo ships successfully, thus ending the Disciples of Ragnos presence there for the time being."}, {"tag": "p", "text": "However, the New Republic government had little actual power and was unable to prevent the rise of the Human League, led by Thrackan Sal-Solo. Corellia and the sector as a whole, had taken an economic downturn because of its growing isolationism and anti-alien policies. Sal-Solo usurped power during the Corellian Crisis in 18 ABY, murdering Micamberlecto and declaring himself Diktat. He was defeated and Marcha of Drall was made Governor-General."}, {"tag": "p", "text": "Sal-Solo tried again to restore Corellian independence and actually managed to get elected Governor-General after his attempt to control Centerpoint Station during the Battle of Fondor, which ended in disaster for a New Republic/Hapan task force at Fondor in 25 ABY. This resulted in Marcha's resignation."}, {"tag": "p", "text": "The Jedi Master Eelysa maintained an eye on Sal-Solo's Centerpoint Party and escaped Corellia with the Solos in 26 ABY after being injured, only to return upon her recovery. A year later, Eelysa was killed by a voxyn on Corellia, although Corran Horn and his wife Mirax Terrik managed to escape another voxyn."}, {"tag": "p", "text": "A year after the Battle of Coruscant, Sal-Solo traveled to Yuuzhan'tar, in an effort to gain their help in expelling the New Republic, but was instead forced to lead the Peace Brigade and was impeached as Governor-General and kicked out of the Centerpoint Party. Corellia remained a loyal member of the New Republic and later the Galactic Alliance."}, {"tag": "h3", "text": "Galactic Alliance"}, {"tag": "p", "text": "In 40 ABY, following the political unrest sparked by a disastrous Jedi mission to uncover an illegal missile factory on Adumar, Corellia joined several other worlds in resisting the Galactic Alliance. Thrackan Sal-Solo also initiated an attempt to bring Centerpoint Station back online. In response the Galactic Alliance launched a preemptive strike on and above the planet Tralus in the Corellian system in an attempt to bring the rogue worlds to heel."}, {"tag": "p", "text": "This only widened the divide between the Galactic Alliance and the rebellious worlds. Even worse, the furious Corellians launched a counterstrike, thus worsening the confrontation even further and turning it into a full scale war. Corellia would be joined by Commenor, Bespin, elements from the Corporate Sector, Adumar and Fondor."}, {"tag": "p", "text": "During the insurrection, the government of the Corellian system was led by a Prime Minister and each of the five worlds had a Head of State. The systems' military was led by a Minister of War and answered to the Prime Minister. At the start of the uprising, Aidel Saxan was Prime Minister and Thrackan Sal-Solo was the Head of State of Corellia. In the midst of chaos the Galactic Alliance made its first strike at Corellia, starting a full scale war. While all of this was going on Thrackan Sal-Solo was assassinated by his cousin Han Solo with the help of Boba Fett and Mirta Gev."}, {"tag": "p", "text": "During the war, the Corellian leadership planned on drawing the Hapes Consortium into the war on their side by assassinating its Queen Mother, Tenel Ka and her child, Allana. The result of their plan failed as the Queen Mother and her daughter survived and most of the Hapans allied with the Corellian Alliance were captured or killed during the Battle of Hapes."}, {"tag": "p", "text": "The Corellians later reactivated Centerpoint Station. Darth Caedus, learning of this, led a task force to Corellia to capture it, but sabotage by the Jedi Coalition destroyed the station before Caedus could take control of it. When the war ended, although Corellia and the rest of the Confederation made peace, they did not rejoin the Galactic Alliance. However, they did resolve post-war disputes two years later by Turr Phennir on the Alliance capital of Coruscant."}, {"tag": "p", "text": "By 137 ABY, Corellia was within the Core Worlds Security Zone and, by extension, space controlled by the Empire of Darth Krayt."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The people of Corellia were a mixture of Humans, Drall and Selonians; Corellia's Humans may have been transported to the planet by Celestials, while Drall were native to Drall and Selonians hailed from Selonia. In spite of the differing origins of the species, the New Republic Intelligence Service accepted that all three were native to Corellia. The majority of Corellia's inhabitants lived on farms or in small towns on the world's three large continents. Galactic Basic Standard was spoken on Corellia."}, {"tag": "p", "text": "The population of Corellia ranged from 16.5 billion to 3 billion; Humans comprised 60% of this number, while Selonian and Drall minorities each took up 20%. The term \"Corellian\" usually neglected the presence of Selonians and Drall, instead referring specifically to Human natives of Corellia. Corellia's Humans viewed the Corellian system's Double Worlds of Talus and Tralus as a dumping ground for prisoners and undesirable beings."}, {"tag": "p", "text": "Individuals native to Corellia included Rebel Alliance and New Republic hero Crix Madine, the smuggler Han Solo, Senator Garm Bel Iblis, Bel Iblis's advisor Sena Leikvold Midanyl, the mercenary Irenez, Imperial commander Saz Tyrson, and Dannl Faytonni."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Coronet, the capital city of Corellia and the site of a spaceport, was where most offworlders arrived. The headquarters of the Corellian Engineering Corporation, as well as those of CorSec and many trade guilds and unions, were located in Coronet, along with the Diktat's complex and the Corellian Stock Exchange. The world was also the site of tourist attractions including amusement parks, museums such as the Corellian Space Museum and several others devoted to the history of Corellians in space and the Gold Beaches on the coast between Coronet City and Tyrena. A grav-train line connected Tyrena to the Gold Beaches and Tyrena, having its own spaceport, handled the majority of offworlders visiting the beaches. Altogether, Corellia boasted at least eight spaceports: one Imperial class, three Stellar and four Standard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When developing Han Solo's background for licensees in 1977, George Lucas named the Corellian homeworld as Crell, describing it as a \"grim\", \"gaseous\" world. The cities of Crell were satellites floating in the gas clouds, while the natives of Crell were winged fliers with clawed hands. This description appears to be derived from the Imperial Capital in his earlier drafts (then called Alderaan), which was reused for Bespin in Episode V."}, {"tag": "p", "text": "In the Polish language Corellia is named Korelia, as a matter of pronouncing issues. The same fact applies to Carida (named \"Karyda\" in some translations). Other planets starting on the letter 'C' however are named in their original form. Both 'C' and 'K' versions are used in the Polish fan fiction and web boards, depending on the point of view on the original names and translations. In Outbound Flight, Commander Thrawn pronounces \"Corellian\" as K'rell'n. In the Marvel Star Wars comics, Corellia was often referred to as Correlli."}, {"tag": "p", "text": "Both Coruscant and the Core Worlds and The Essential Atlas state that Corellia has no moons. However, Star Wars Galaxies indicates that Corellia has three moons and later sources have established Gus Talon and Gus Treta as two of them."}, {"tag": "p", "text": "In the canceled novel Alien Exodus, Corellia is named after Antonia Corelli, the pilot of the 25th Century Earth spacecraft, displaced by a wormhole en route to Alpha Centauri, whose passengers and crew were the first Humans in the Galaxy."}, {"tag": "p", "text": "Although it has long been established as being a predominantly Human world with Drall and Selonian populations, the MMORPG Star Wars: The Old Republic depicts the planet as having a large Twi'lek population, fully integrated with the Human one."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}