{"url": "Corellian_Engineering_Corporation/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic organizations", "Category:Corellian Engineering Corporation products", "Category:Corellian organizations", "Category:Corporate Sector Authority voting sponsors", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:New Republic organizations", "Category:Shipwrights", "Category:Techno Union corporations"], "nodes": [{"tag": "h1", "text": "Corellian Engineering Corporation"}, {"tag": "p", "text": "Corellian Engineering Corporation, abbreviated CEC and originally called Corellian Engineering Corps, was one of the three largest starship manufacturers. This corporation was widely considered the most prolific starship manufacturer in the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "CEC, whose shipyards were located in the Corellian system, owed much of its success to the abnormally high numbers of skilled designers, engineers, and shipwrights the system produced.\nThe shipyards were well known for their modular freighters which could be upgraded for combat with both legal and illegal after-market kits. These popular freighters ranged from the YG-series first made centuries before the Battle of Yavin to the VCX series produced shortly before the Yuuzhan Vong War."}, {"tag": "p", "text": "During the rule of the Eternal Empire, the Corellian Engineering Corporation was rumoured to be developing an experimental stealth technology for a mysterious buyer."}, {"tag": "p", "text": "Unlike the company's main competitors (Kuat Drive Yards and Sienar Fleet Systems), CEC relied almost solely on civilian sales rather than military contracts. Even so, CEC's reputation for solid spaceframes and excellent engines meant that it was often subcontracted to build warships using other companies' designs: Star Destroyers built by CEC had a reputation for being the fastest ships in the Imperial Navy, both at sublight and hyperspace speeds. The smuggler Han Solo boasted of having outrun such ships. CEC also constructed vessels for the Alliance to Restore the Republic."}, {"tag": "p", "text": "In the centuries before the Clone Wars, the Corellian sector was guarded by warships bigger than Acclamator-class assault ships. These were presumably also homemade designs rather than imports from other notable shipwrights, like Kuat Drive Yards or Rendili Star Drive."}, {"tag": "p", "text": "CEC also teamed up with Loronar Corporation to jointly fund The Nerfworks, a radical think tank responsible for a number of starship designs, including some droid starships. In addition, it jointly owned Chempat Engineered Defenses with Kuat Drive Yards. A competing shipwright, Corellia StarDrive, was bought by CEC after their senior design team was killed in a shuttle crash."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Note and references"}]}