{"url": "Corellian_hound", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Canines", "Category:Creatures of Corellia", "Category:Creatures of unspecified diet", "Category:Domesticated creatures"], "nodes": [{"tag": "h1", "text": "Corellian hound"}, {"tag": "p", "text": "Corellian hounds, also known as Sibian hounds, were a type of hound from the planet Corellia. They were quick and nimble canines used by locals for a number of tasks. Due to their keen sense of smell, they were often used for hunting and tracking. They had a vicious bark and bite, which meant they could be quite effective for protection. Criminal gangs were fond of using the hounds for defense or to attack their rivals. They also had regenerating teeth. Corellian hounds could also be found on the planet Ushruu, where they were known as snarlers."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Corellian hounds were fast and had an excellent sense of smell. They had a bone-like ridge along the crest from head to shoulder. Their bites were savage and so they often lost teeth, which were regrown."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Corellian hounds were prone to fighting."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 34 ABY, Dok-Ondar had the head of a Corellian hound mounted on the wall of his store on Batuu. The plaque the head was mounted on had the words \"In memory of Yay-Jakk\" painted on it in Aurebesh."}, {"tag": "h2", "text": "Corellian hounds in the galaxy"}, {"tag": "p", "text": "Corellian hounds were often employed by gangs as guards, attack-dogs, and trackers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Corellian hounds were featured in the 2018 Star Wars Anthology film Solo: A Star Wars Story. They were played by four actual dogs named Blackie, Boyce, Saxon, and Elsa in specially made costumes. Use of the dogs was inspired by Mardji, the Asian elephant who played two banthas in the original 1977 Star Wars film, Star Wars: Episode IV A New Hope."}, {"tag": "p", "text": "According to writer Jon Kasdan, the hounds were his tribute to the Death Dogs from Lucasfilm Ltd.'s 1988 film Willow, which was also directed by Ron Howard and starred Warwick Davis."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}