{"url": "Corellian_slavers", "categories": ["Category:Legends articles", "Category:Corellian organizations", "Category:Criminal organizations", "Category:Slaver organizations"], "nodes": [{"tag": "h1", "text": "Corellian slavers"}, {"tag": "p", "text": "The Corellian slavers were a group of slavers who operated on Corellia during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Corellian slavers started their operation by the time of the Battle of Yavin. They were particularly active all over the city of Tyrena and their base was located just northwest of the city. They captured random people on Corellia and enslaved them in their bunker. Faye Patrick was one of the criminals who captured the future slaves. Dozens and dozens of persons were captured by the slavers, including Kyran Silene, Noro Bok and Akkus Meik, Anyza Ekull, Gordo Zek, Zorgom, Norith and Neeka Z'all, Bannoc G'noc and Narlissa, Vermon Skeetz, Dulor Norr and Akers Radch. The slavers were responsible for a 500% increase in the number of missing persons on Corellia in one month. Major Alana Walden of the Corellian Security Force therefore went to investigate the case."}, {"tag": "p", "text": "Circa 1 ABY, a group of slaves that included Anyza Ekull, Zorgom and Norith Z'all, Bannoc G'noc, and Vermon Skeetz, and led by Kyran Silene managed to escape the slaver bunker. They did not reach Tyrena and were forced to establish a camp in the wilderness."}, {"tag": "p", "text": "In the meantime, Kyran Silene's wife, Madison Silene, recruited a spacer to investigate the disappearance of her husband. After killing Faye Patrick, the spacer managed to find the camp and the escaped slaves. The spacer agreed to help the former slaves and moved to the Corellian Slaver Bunker. The spacer fought several guards but successfully infiltrated the bunker. With the help of several slaves, the spacer managed to access the depth of the bunker, and even killed the slavemaster. The spacer finally sliced the bunker's main computer. Using the bunker's own communications array, the spacer broadcasted the slavers' records on the CorSec emergency request channels. Dozens of CorSec agents quickly moved to the slaver bunker and freed all the slaves."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Corellian slavers appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online-role playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Corellian slavers were added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}