{"url": "1137", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Clone troopers", "Category:LEGO"], "nodes": [{"tag": "h1", "text": "1137"}, {"tag": "p", "text": "1137 was a clone trooper who served the Galactic Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Once during a mission, 1137 and his fellow clone trooper, 1139 were forgotten on a desert planet after their unit miscounted and departed. Ultimately, this proved fortuitous, for while abandoned the two soldiers learned of a CIS secret weapon project. As dutiful soldiers, 1137 and his companion resolved to destroy it. To aid in this endeavor, they built a TX-130 fighter tank, with which they destroyed the Separatist weapon. Soon thereafter, realizing their absence, a Republic gunship returned to retrieve the duo."}, {"tag": "p", "text": "Having proven his competence, 1137, together with 1139, were then assigned to hunt the missing astromech droid R2-D2, and it was during this search that he briefly encountered Anakin Skywalker's Jedi Padawan Ahsoka Tano. His partnership with 1139 became momentarily contentious, however, when the latter expressed desire for names to supersede their numerical designation—a sentiment not shared by 1137. Nevertheless, their disagreement was quickly resolved, and their search continued. Eventually, it took them and their pilot to an ice planet, whereat their ship crashed. As with their previous abandonment, this, too, proved fortuitous, as it begat a chance encounter with none other than the prominent CIS leader, Nute Gunray. Deciding against direct assault upon the Neimoidian's shuttle, 1137 and his companions settled on a ruse. Feigning that they were selling Clone Scout cookies, 1137 and the pilot distracted Gunray while 1139 and their commander subdued him. This being accomplished, the clone troopers absconded with the shuttle."}, {"tag": "p", "text": "The next stop on the astromech-hunt was Endor. Mistaking the local flora as being indicative of hostile Wookiees, 1137 retreated into the shuttle. This action drew the attention of a local Ewok, who sought to establish contact with 1139. However, the Ewok's attempt ultimately resulted in the capture of the whole party. Taken to the natives' camp, 1137 found himself with his comrades-in-arms being employed as percussion instruments and 1139 being roasted. Their dilemma proved temporary as soon Nute Gunray arrived, escorted by droids and tanks, seeking vengeance for his humiliation. This intervention inadvertently allowed the troopers to free themselves, after which they quickly dispatched their foes. Dismayed by their ferocity, Gunray retook his shuttle and fled."}, {"tag": "p", "text": "Despite the rather chaotic turn of events, 1137 and his companions retained enough composure to search for another means of transportation, which ultimately proved to be three BTL-B Y-wing starfighters. Leaving Endor, they were intercepted by a Venator-class Star Destroyer. Aboard was, to 1137's surprise, none other than Supreme Chancellor Palpatine. Extremely displeased with their performance, citing the fact that Anakin and Ahsoka had already recovered the missing R2-D2, the Republic leader discharged them from the Grand Army of the Republic. Without further ado, 1137 and his comrades took a beach-side vacation."}, {"tag": "p", "text": "Despite his discharge, 1137, together with 1139, was later present at an attempt to restore peace to Orto Plutonia."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "1137 and 1139 are the numbers before and after 1138. The name of the comic that in which 1137 and 1139 are introduced, \"Always count your clones before take-off\", derives from the plot point of the duo having been left behind."}, {"tag": "h2", "text": "Appearances"}]}