{"url": "Corinna_A%27Daasha", "categories": ["Category:Legends articles", "Category:Business owners and executives", "Category:Corellians", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Corinna A'Daasha"}, {"tag": "p", "text": "Corinna A'Daasha was a female Human and co-owner of the Glow Dome nightclub, located on the world of Adarlon, along with her twin sister Kandria A'Daasha. She was a Rebel Alliance sympathizer who would allow her nightclub to be used as a safehouse on occasion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Corinna and her twin sister Kandria were born into a wealthy family that provided for all their needs. As children they never struggled for anything and although her sister Kandria enjoyed a life of luxury, Corinna became bored and restless by it. Corinna ended up taking some of her wealth and left their household to explore the galaxy. Separation did not suit either sister and shortly afterwards Kandria joined Corinna on her travels. Kandria convinced Corinna to travel to the pleasure world of Adarlon but Corinna enjoyed her stay and the two sisters decided to try their hands at business."}, {"tag": "p", "text": "The twins started up the Glow Dome a nightclub featuring elaborate sound and light displays that became extremely successful. Despite her success, Corinna still felt unfilled by her life until she met a member of the underground group No-Holds-Barred that introduced Corinna to banned holos of the Rebel Alliance and Jedi. Shortly after her introduction to their cause, Corinna became sympathetic to the Rebellion and although she never formally joined she did allow underground holos to be sold through her nightclub and allowed Rebel operatives to use her business as a safehouse."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Corinna had a rebellious streak that caused her to both reject her opulent upbringing as well as made her sympathetic to the Rebellion. She was also mischievous and enjoyed playing practical jokes, especially on boorish, obnoxious and mean-spirited people that would frequent her club. Corinna was a very attractive woman and wore tight-fitting clothes to accentuate her slim figure. She often wore a flight jumpsuit that was cut to be very revealing. One way that she would trick her clientele would be to work as a bartender in her nightclub, using the holoprojectors to alter her appearance and disguise her true self."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Although she was modestly skilled at ranged combat, Corinna's main strengths was her intelligence and business skills. She was a master negotiator and had a wide vocabulary in a large number of languages."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "More practical than her sister, Corinna concealed both a hold-out blaster and a vibroknife on her. She also carried around a personal holoplayer and datapad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Corinna A'Daasha was designed by Paul Danner and Bill Smith for Wretched Hives of Scum & Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. She was created as a co-owner of one of the bars and a potential contact for Rebel aligned player characters."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}