{"url": "Cornelius_Evazan/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Alsakanians", "Category:Criminals", "Category:Galactic Empire science and engineering personnel", "Category:Healers and doctors", "Category:Humans", "Category:Males", "Category:Revived individuals", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Cornelius Evazan"}, {"tag": "p", "text": "Cornelius Evazan, alias Roofoo and Doctor Cornelius, also nicknamed Doctor Death or simply The Doctor, was a notorious Human male outlaw and sociopath who was active during the Galactic Civil War. He considered himself a skilled surgeon, even though his patients were often maimed or killed after botched \"operations.\" By the time of the Battle of Yavin, his activities had earned him a death sentence in at least twelve systems."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early criminal career"}, {"tag": "p", "text": "Cornelius Evazan originally hailed from the ecumenopolis planet of Alsakan in the Core Worlds. No one knows if Evazan ever obtained a true medical degree. Nonetheless, he was remembered as a promising surgeon. His application to the Imperial Academy was rejected when his innate madness was revealed during an interview, and he was shipped off to the prison on Delrian. Evazan escaped to the Hindasar system, where he established his own \"practice\" specializing in cyborging and inexpensive surgery. Once the medical and law-enforcement authorities caught up with him, he disappeared to another system, where he began his operations anew. He would repeat this process on several worlds, with occasional forays into spice smuggling, slaving, assassination, and other crimes. He never stayed in one location too long, and his movement from planet to planet helped him gain more and more victims."}, {"tag": "p", "text": "Evazan was searching for immortality, and was hoping that his experiments on his patients' insides would point him on a path to discover it. This pursuit of immortality earned him the nickname \"Doctor Death,\" among others.[source?]"}, {"tag": "p", "text": "His legacy of victims led him to be pursued by the bounty hunter Jodo Kast, who nearly caught up to him in the Corellian system. Thanks to the intervention of the Aqualish thug Ponda Baba, Evazan escaped, but not before one of Jodo Kast's blaster shots caught him in the face. Evazan was scarred for life, but he and Baba formed a beneficial partnership."}, {"tag": "h3", "text": "Partnership with Ponda Baba"}, {"tag": "p", "text": "Evazan and Ponda Baba fled Corellia to hide out on Tatooine. It was there that he encountered a young moisture farmer named Luke Skywalker in the Mos Eisley Cantina. They tried to bully the youth into a fight, but found themselves on the wrong side of Obi-Wan Kenobi's lightsaber. The two of them fled the scene after Baba's arm was cut off. Evazan did his best to replace his partner's arm with a cheap cybernetic replacement. The surgery was not a success, and Baba swore revenge, pursuing Evazan across the galaxy."}, {"tag": "h3", "text": "Project Starscream and the search for immortality"}, {"tag": "p", "text": "Evazan went into hiding on Tatooine, where he set up the Cutting Edge Clinic in Mos Eisley. Under the name Doctor Cornelius, Evazan began operating on unsuspecting patients. He continued to specialize in cyborging and would occasionally use droid parts purchased from Jawas. He was eventually forced to flee Tatooine and, soon after, he was confronted by his old partner, Ponda Baba. The two reconciled and set up base in a castle on Ando, where Evazan made a new breakthrough. He came to the conclusion that it was the mind and not the body that was the key to immortality. He created a mind-transference machine, planning to transfer Ponda Baba's mind into a new body. He lured and trapped the Aqualish senator chosen to provide the body."}, {"tag": "p", "text": "Evazan hoped to transfer his own mind into the body of a \"perfect\" young man he had captured earlier. Unfortunately for Evazan, the young man was actually a bounty hunter named Gurion Silizzar using a holoshroud to disguise himself. Gurion sought revenge because seven members of his family had been victims of Evazan's operations. Gurion forcibly escorted Evazan up to the castle's roof, where Gurion planned to kill the doctor. Evazan's pet meduza, Rover, saved Evazan's life by attacking Gurion, who then fell off the roof to his death. It was then that the Aqualish senator in Ponda Baba's body went up onto the roof and detonated a thermal detonator. Evazan fell off the roof moments before the explosion. Once again, Rover saved Evazan's life by sacrificing his own to cushion his master's fall."}, {"tag": "p", "text": "At an unknown time during the Galactic Civil War, Dr. Evazan conducted experiments on peko-pekos from the planet Naboo, hoping to create invincible creatures that would act as his protectors and mounts. This experiment resulted in the creation of the toxic peko-peko."}, {"tag": "p", "text": "Soon after the Battle of Yavin, Evazan went to work for Borborygmus Gog, hoping to gain information from Project Starscream on bringing life to the dead. Evazan moved to Necropolis to work on bringing corpses to life as part of the project. However, during this time, Boba Fett was pursuing Evazan. The bounty hunter caught up to Evazan on the planet Necropolis and executed the mad doctor while he was holding Zak Arranda hostage."}, {"tag": "p", "text": "Pylum required that Fett leave Evazan's body behind, in hopes of holding off the Curse of Sycorax, and Fett agreed, but held them all responsible if he never collected the full bounty. Unknown to them all, Evazan had injected himself with a megadose of his own reanimation serum, and he eventually returned to life. However, the serum only worked well on recently dead bodies. The longer the body stayed dead before being injected, the less likely it was to survive reanimation. Evazan nearly completed his work, but was stopped by the zombie Kairn. Evazan tried to eliminate Hoole, Zak, and Tash Arranda, but Kairn refused to see his friends killed. He used the anti-serum created by DV-9 to kill the zombie army Evazan had created, then he and Evazan were seemingly killed when the potion touched them."}, {"tag": "p", "text": "However, Evazan seemingly cheated death yet again. As late as 9 ABY, the doctor was reportedly still at large. Baba also survived, in the body of the senator, and again sought revenge against Evazan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alfie Curtis played Dr. Evazan in A New Hope."}, {"tag": "p", "text": "Evazan first appeared in the novelization of A New Hope, ghostwritten by Alan Dean Foster and published in 1976, half a year before the film. Evazan was unnamed and described as a short Human. In his scene, he was accompanied by a many-eyed and a rodent-like alien—early incarnations of Ponda Baba and Kabe—when they insulted Luke Skywalker. In this version, Obi-Wan Kenobi sliced Evazan's hand and cut Kabe and Baba in half. In the Revised Fourth Draft of the screenplay—calling Evazan and Baba \"Human\" and \"Creature\"—the scene was about the same. In the final film, Kabe didn't accompany Evazan, and Obi-Wan Kenobi dealt less drastically with the outlaws."}, {"tag": "p", "text": "In Robot Chicken: Star Wars, Evazan is portrayed as a compulsive joker who doesn't know when to keep his mouth shut—which leads to the loss of Ponda Baba's arm when he jokes that he and Ponda are wanted men."}, {"tag": "p", "text": "During the 2012 Super Bowl, Evazan appeared shortly after the Volkswagen commercial of a dog exercising and chasing a car, mocking \"The Force\" ad from the previous year (where a child dressed up as Darth Vader attempts to use the Force to start a Passat, only to be stunned when his father engages the remote ignition). He ends up nearly strangled by Darth Vader, who was present among the patrons and apparently overheard Evazan, prompting Evazan to apologize."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}