{"url": "Cornered", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:The Bad Batch episodes"], "nodes": [{"tag": "h1", "text": "Cornered"}, {"tag": "p", "text": "\"Cornered\" is the fourth episode of the animated web-TV series Star Wars: The Bad Batch. The episode was released on May 21, 2021."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Batch's supply run goes awry."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Short on supplies"}, {"tag": "p", "text": "The Havoc Marauder travels through space. Hunter proposes that they go to Idaflor, but Wrecker says that it is not inhabited, which is why Hunter thinks it will be a good place to hide. Omega complains that she has been stuck on Kamino for her whole life, asking if they can do some exploring. Hunter disagrees and says that it is time to lie low. Tech tells them that they are out of fuel and rations. Since they are no longer serving the Galactic Republic, they are on their own. Echo also warns them that the Marauder's signature is on the wanted list."}, {"tag": "p", "text": "Tech proposes scrambling the starship's signature, but says that he needs to land in order to perform those calculations. He states that the nearest world is Pantora. Hunter agrees and the adult clones exit the ship's deck. Omega stares at the map and marvels about visiting there."}, {"tag": "h3", "text": "Landing on Pantora"}, {"tag": "p", "text": "The Havoc Marauder reaches Pantora and descends through the clouds towards a large outpost known as Ro Station surrounded by valleys. The ship lands in a docking station. As the Bad Batch descend down the gangplank, Wrecker grumbles about being hungry, but Tech reminds him that their priority is to change the ship's signature. They are greeted by a Sullustan who asks if they are here for repairs. Tech replies that they just need a minor calibration and fuel."}, {"tag": "p", "text": "The Sullustan says he needs to scan the ship but Wrecker stares him down. The Sullustan offers to skip the step for a bribe, although neither Wrecker nor Tech realize what he is asking for until he explicitly says as much. Tech pays the manager some credits, after which he returns to his office. He goes to his computer screen and files a report, identifying himself as Raspar Six. He tells an armored bounty hunter that he has sighted a modified Omicron-class attack shuttle that he's heard she is looking for, before requesting payment. The female bounty hunter summons a hologram of Omega and tells Raspar Six to send her the coordinates and not to let the clones leave. The bounty hunter takes her ship into hyperspace."}, {"tag": "p", "text": "Back at Ro Station, the GNK-series power droid Gonky carries tools while Wrecker unloads explosives. Wrecker is unhappy about selling their armaments, but Hunter, placing one charge in his backpack, says that it's the only thing they own worth any money. Wrecker grumbles about having to do repairs wile the others go sightseeing. Omega is curious, but Hunter clarifies that this is a supply run and that they have to move in and out quickly and quietly. Echo adds that Wrecker sticks out too much. Wrecker asks about Echo, but the cyborg has donned a full-body disguise that covers his face. The clones are being watched by the Sullustan spy."}, {"tag": "p", "text": "Omega is curious about the marketplace. Hunter, Echo, and Omega watch a column of clone troopers marching by while civilians cheer. When Omega asks what the celebration is about, Hunter explains that they are celebrating the end of the Clone Wars. The clones also see a recording of Imperial Vice Admiral Rampart encouraging citizens to register for chain codes and to exchange their Republic currency for Imperial credits at no cost, which they recognize from Saleucami. Hunter thinks that they should be fast with their supply run. Omega asks whether the end of the war is a good thing, but Echo says it depends whose side they are on."}, {"tag": "p", "text": "Back at the landing pad, Wrecker removes a panel from the Havor Marauder while Tech shines a light inside. He says that the signature key should be embedded below the rear parallax inverters. Wrecker asks where he should start, and at Tech's direction, begins pulling out components."}, {"tag": "h3", "text": "Getting lost"}, {"tag": "p", "text": "Omega inspects a device at a shop while Hunter tries to sell a pyro denton explosive for 1,800 credits to a Gran merchant. He tells Hunter that he should sell it at the black market. Omega accidentally knocks down a metal container, prompting the merchant to warn her that she has to buy whatever she breaks. While Omega shows Echo a doll she was looking at, the Gran merchant watches them keenly through his two remaining eyes. Mistaking Echo for a droid, he proposes that Hunter sell him for 2,000 credits."}, {"tag": "p", "text": "Echo is not enthusiastic about the plan, but Hunter says that once they get the supplies, he will give him the signal to leave. Echo reluctantly complies but convinces Hunter to bid for 4,000 credits. The merchant insists on 3,000 credits. Echo complies while Omega takes an interest in several young voorpaks in a box. She pats one of the voorpaks, which snatches her doll. The repulsorcraft carrying the voorpaks moves along, and Omega runs after the doll and the creatures. Unknown to her, she is being watched by the masked bounty hunter."}, {"tag": "p", "text": "The trader pays Hunter for his new \"droid\" before leading him away. Hunter realizes that Omega is missing and runs after her. Omega pursues the voorpak craft. One of the voorpaks spits out the doll. As she retrieves it, she bumps into a Gotal who tells her to be careful. While being spooked by some animals in a cage, Omega meets the unmasked bounty hunter, Fennec Shand. She asks Omega if she is alright and offers to help Omega find her friends, helping her up. Shand puts her arm around Omega and leads her off."}, {"tag": "h3", "text": "Omega and the bounty hunter"}, {"tag": "p", "text": "Meanwhile, the Gran trader sets Echo to work supervising his droid crew in the back room. Flipping up his mask, Echo meets a female protocol droid named CG-67 who insists that she is in charge, before quickly realizing that he is not a droid. An LE-series droid named Clink agrees. CG wants to report Echo, but he draws his blaster pistol and suggests that he would be glad to take her complaint, prompting her to remain silent."}, {"tag": "p", "text": "Elsewhere, Hunter finds Omega's doll on a street corner. After retrieving it, he runs on. Omega walks with Fennec Shand, who asks if she is hungry. After Omega confirms it, Shand deliberately bumps into a vendor carrying fruit, causing her to trip and some of the fruit to fall from her basket. Fennec slips two pieces of fruit into her helmet while they are helping the trader by picking up her fruit. Omega notices a weapon concealed under the woman's tunic. The vendor thanks them for their kindness before moving on."}, {"tag": "p", "text": "While the two help themselves to the fruit, Omega notes that she did not pay for it. Shand replies that it is okay to sometimes break the rules. Omega asks Shand if she is a soldier. She replies that is no. When Omega asks why she has a blaster, Shand replies that the galaxy is a dangerous place to be alone. Omega says that is why she has her friends, suggesting that Shand should come with them if she's alone. This pleases Shand, who says that is the best offer she has heard in a long time."}, {"tag": "p", "text": "Hunter finds them and calls to Omega, who tells Shand he is one of her friends. He tells Omega to step away from the woman, and the girl says that she was helping her look for him. Shand replies that she and Omega were getting to know each other before donning her helmet. She and Hunter stare each other down as he reaches for his knife, but Shand fires first with her blaster pistol. Omega grabs Shand's arm to try and stop her from shooting, before the mercenary shakes her off. Hunter throws his knife at Shand, who blocks it with an object before dodging another attack from him and taking the knife herself, forcing him on the defensive. As the two fight, Hunter manages to grab both of Shand's wrists before telling Omega to run. As the girl flees, Hunter forces Shand to drop both weapons, but she headbutts him unconscious. Just then, Pantoran Security officers arrive, prompting Shand to retrieve her pistol and flee."}, {"tag": "h3", "text": "Trouble on two fronts"}, {"tag": "p", "text": "Meanwhile, Wrecker finally reaches the signature key, which makes a beeping sound. Taking the component, Tech says that with a slight adjustment, they will be able to scramble their signature at will. Just then, Hunter contacts Tech, Wrecker and Echo by comlink, warning them that he has lost Omega and that someone has attacked them. Hunter tells them that the woman is highly trained and is after the kid. Tech decides to tap into the CCTV system in order to find Omega and the woman. Hunter warns Tech to get the ship ready quickly since he made some noise, but Tech responds that a team of maintenance droids will be necessary for that since the Marauder isn't exactly a ship at the moment."}, {"tag": "p", "text": "Echo replies that he can help with that and enlists the astromech droids' help. CG-67 says that they are prohibited from leaving their post. Echo says that the sooner they do this, the sooner she will be back in charge. The droid protests that she is not able to remove their restraining bolts. Echo brandishes his scomp link and remarks that's why he is the supervisor. The droids and Echo walk out of the storeroom, Echo casually returning the restraining bolts to the merchant. The Gran merchant protests, shocked to see that Echo is not a droid, but Echo retorts that he got him for a bargain."}, {"tag": "p", "text": "Meanwhile, Shand pursues Omega through the streets. Omega crouches behind a crate before spotting a manhole, which she opens. Tech hacks into the city's surveillance system. He tells the other Clones that Omega went down into the maintenance tunnels and to head northwest at 155. Tech spots Shand behind Omega. Omega flees through the tunnels but collides with Wrecker. Omega is delighted to meet up with Wrecker, who picks her up. Wrecker tells the others she is on her way."}, {"tag": "p", "text": "Shand closes in on them. Wrecker tells Omega to climb up a ladder while he faces down the bounty hunter, warning her that anyone who messes with Omega has to contend with him. Wrecker lunges at Shand but she knocks him down, causing him to hit a pipe which lets out gas. The hunter continues her pursuit. Meanwhile, Omega reaches the top of a high tower with no escape."}, {"tag": "h3", "text": "Repairs and pursuit"}, {"tag": "p", "text": "Back at Ro Station, Echo arrives back with the droids. The protocol droid protests that she is not programmed to repair or assemble starships. However, the astromech droids particularly Clink are enthusiastic to help. The protocol droid reasserts her authority and orders 225 and DK-3 to work on the repulsors."}, {"tag": "p", "text": "Elsewhere, a blast on the door causes Omega to stumble and she grabs a ledge. As Hunter looks for her, Tech intercepts com chatter discussing reports of a child hanging from a tower in the lower division. Tech conveys the news to a shocked Hunter. Hunter steals a speeder bike. Meanwhile, Shand saves Omega from falling off the tower, telling her that she can thank her later."}, {"tag": "p", "text": "Shand spots Hunter weaving through the skyway traffic to reach them. She tells Omega to tuck and roll when she lands before dropping Omega onto a hovertruck below. The bounty hunter follows. Meanwhile, Wrecker wakes up and Tech updates him about the pursuit. Meanwhile, Omega raises a level which causes the truck's pickup bed to tilt and release its goods including the bounty hunter, who loses her blaster. She drops onto an airspeeder."}, {"tag": "p", "text": "While the Aqualish driver obliviously listens to music in the cab, Omega grabs on to a rope as bales drop out. Two Pantoran security officers follow in speeder bikes. Shand throws a driver out of his airspeeder and continues the hunt. Hunter flies to the hovertruck and reaches out to Omega. However, Shand rams into him, causing him to swerve into the air. She also shoots at the two security officer's speeder bikes, hitting one and causing them to crash into each other."}, {"tag": "p", "text": "Hunter tears after Shand and Omega. He blasts at the hijacked airspeeder's engines, causing them to explode. Hunter catches Omega just as she loses her grip. Warning Omega they are not yet out of trouble, he reverses his speeder bike into Shand's hijacked speeder. He plants a detonator, which causes the speeder to explode. The hunter manages to jump out in time onto the street."}, {"tag": "p", "text": "Meanwhile, Wrecker watches several Pantoran security officers flying in speeder bikes and grumbles about missing the action. Back at Ro Station, the protocol droid tells Echo that her diagnostic test indicates the Havoc Marauder is now operational. Echo thanks the astromech droids for their help and passes them back to CG-67, who reasserts her authority. The droids follow CG-67."}, {"tag": "h3", "text": "On the run"}, {"tag": "p", "text": "Hunter and Omega arrive back at the hangar. Tech tells Wrecker to pick up the pace. Wrecker soon follows and the clones take off in the Havoc Marauder. As the engines fire up, the Sullustan manager runs out but is unable to stop them from escaping. He grumbles that he hasn't been paid."}, {"tag": "p", "text": "In space, Hunter tells Omega that their opponent was a bounty hunter but is unaware of her identity. Echo explains that a bounty hunter is someone who hunts targets while Tech adds that she is the target. Wrecker thinks they should not scare the child. Hunter says they need to find out who the hunter is and who hired her. Omega wears a worried expression."}, {"tag": "p", "text": "Meanwhile, Shand confronts the Sullustan manager, who tells her that he tried to stop them. She throws him a credit chip, telling him to contact her if they return. The bounty hunter walks away and removes her helmet. Speaking into her comlink, Shand says that the target got away but vows to find her."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Pantora is referred to as a planet, despite having been long-established as a moon. When Hunter, Omega and Echo are watching a hologram of Vice Admiral Rampart, Echo's kama is seen missing. However, in the next shot, his kama can be seen again."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}