{"url": "Corona_Squadron", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Corona Squadron personnel", "Category:New Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Corona Squadron"}, {"tag": "p", "text": "Corona Squadron was a starfighter squadron that served the Alliance to Restore the Republic and later the New Republic. It was designated for reconnaissance duty but also served in the Battle of Hoth and the Battle of Endor. The squadron flew X-wing starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early years of the Galactic Civil War, Corona Squadron included the Contessa (Corona Leader), Yendor (Corona Two),  Smikes (Corona Three), Thane Kyrell (Corona Four), and Kendy Idele (Corona Five). They were a ragtag group that came together from across the galaxy with vastly different backgrounds."}, {"tag": "h3", "text": "Rebel Alliance"}, {"tag": "h4", "text": "Battle of Hoth"}, {"tag": "p", "text": "In 3 ABY, Corona Squadron was stationed on the ice planet of Hoth when the Galactic Empire discovered the location of the hidden rebel base there. When the Imperial fleet arrived on Hoth sooner than was expected, the job of Corona Squadron was to delay the oncoming army until the rebel transports could evacuate the base. Two members of Corona Squadron, Thane Kyrell and Yendor, piloted a snowspeeder together and managed to take down an Imperial AT-AT on their own by shooting at its joints, where walkers were most vulnerable. Once the transports had taken off, the squadron took their X-wings into space, where they rendezvoused with the rest of the rebel fleet."}, {"tag": "h4", "text": "Rendezvouz on Liberty"}, {"tag": "p", "text": "After the Battle of Hoth, they were personally thanked for their service by Mon Mothma, the leader of the Rebel Alliance. She then gave them a special mission — to do reconnaissance for the Rebel Alliance — in which they were to be based on the MC80 Liberty Type Heavy Star Cruiser Liberty. In the coming months, they participated in many intelligence missions."}, {"tag": "h4", "text": "Scouting D'Qar"}, {"tag": "p", "text": "Corona Squadron took part in a scouting mission to the Outer Rim planet of D'Qar for any signs of an Imperial outpost. The Alliance had received reports from deep-cover agents on Coruscant that the massive amounts of material was being processed for the Imperial fleet, including rumors of a new large-ship construction facility, but nobody knew for certain. While the Squadron found no sign of artificial power sources or Imperial activity, they identified D'Qar as a potential rebel base for the future. With nothing further, the squadron returned to the Liberty for maintenance on their X-wings."}, {"tag": "h4", "text": "New base on 5251977"}, {"tag": "p", "text": "Some time later, Corona Squadron relocated to the Alliance Fleet's new base, a small uninhabited no-name planet, designation 5251977. The Alliance had built a much larger hangar than usual, to accommodate a fleet that was double the size it was two months previous."}, {"tag": "h4", "text": "Skirmish in the Hudalla system"}, {"tag": "p", "text": "Ten hours after reaching 5251977, the squadron were informed of a large gathering of ships in the Hudalla system, and were sent on an intelligence mission to investigate. While there, they found a large fleet of Imperial ships and learned of the construction of the second Death Star. Despite hiding in the rings of the planet in low power mode, they were detected by the Imperial fleet and a squadron of four TIE fighters was sent to root them out. In the battle, Smikes (Corona Three) was shot down before the X-wings could escape."}, {"tag": "h4", "text": "Battle of Endor"}, {"tag": "p", "text": "In 4 ABY, after the discovery of the second Death Star, Corona Squadron was assigned to cover the starfighters of the Gold, Red, Green, and Gray squadrons, as they penetrated the Death Star. Due to Endor's shields being up when they pulled out of hyperspace, they were forced to face off with a large number of TIE fighters and Imperial Star Destroyers. On orders from Gold Leader in the Millennium Falcon, they moved in close to the Star Destroyers, working as a team and successfully disabling the engines of the Subjugator. When the shields surrounding the second Death Star fell, they protected the other squadrons, as they made their entry into the Death Star. By the conclusion of the battle, the squadron had suffered no casualties, however they did lose their headquarters, the Liberty, which was destroyed in an instant from a single blast of the Death Star's superlaser."}, {"tag": "h4", "text": "Celebrations after Endor"}, {"tag": "p", "text": "After surviving starfighters landed on Home One, a rebel was asking about the squadron's status. Members of the squadron, including Kyrell and Idele, participated in the  celebrations on the forest moon of Endor."}, {"tag": "h3", "text": "New Republic"}, {"tag": "h4", "text": "Naboo invasions"}, {"tag": "p", "text": "Corona Squadron continued to participate in a full-out war almost a year after the Battle of Endor, now serving the New Republic, but their composition had changed. The Contessa had left the squadron to run for presidency on her homeworld, resulting in Yendor becoming the new Corona Leader. They also acquired two new members, an exile from Coruscant and the other a rookie from Nea Dajanam. As the Empire sought to regain control of Naboo, the squadron fought on the planet in several separate battles."}, {"tag": "h4", "text": "Battle of Jakku"}, {"tag": "p", "text": "Shortly after, Corona Squadron participated in the Battle of Jakku. Due to their experience as ex-Imperials and knowledge of ship design and procedures, General Carlist Rieekan tasked Kyrell, recently promoted to commander, and Lieutenant Idele, to lead a boarding party to capture the Imperial Star Destroyer Inflictor. The boarding party disabled the ship's engines and self-destruct system, and so the Star Destroyer's captain — Kyrell's childhood friend and lover Ciena Ree — ordered her crew to abandon ship while she remained on board to scuttle it on the surface of Jakku. Idele recognised her voice over the intercom, so Kyrell made his way to the bridge to persuade Ree to leave with him, but she refused, fearing reprisal against her parents from the Empire. After a brief struggle, Kyrell used his blaster to stun Ree and they evacuated in an escape pod. After crash-landing on the planet's surface, New Republic soldiers found them and took Ree, a high-ranking Imperial officer, into custody."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Two decades later, Yendor had become the ambassador from his homeworld of Ryloth to the Republic, and Senator Leia Organa mentioned meeting the squadron to him during her investigation on the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Corona Squadron first appeared in Claudia Gray's 2015 young adult novel Lost Stars, which was released as part of the Journey to Star Wars: The Force Awakens multimedia project."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}