{"url": "Coronet/Legends", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Liners", "Category:Mandalorian starships"], "nodes": [{"tag": "h1", "text": "Coronet"}, {"tag": "p", "text": "The Coronet was a luxurious spaceliner constructed by Kalevala Spaceworks as a testament to Mandalorian engineering. Used as the personal starship of Duchess Satine of the New Mandalorians, the Coronet was the only ship of its kind, designed and furnished with the finest materials Mandalorian space had to offer. Over two hundred meters in height, the Coronet was divided between stately cabins and elegant halls at its top, and utilitarian crew quarters and cargo holds in its long ventral spine. Despite the New Mandalorians' dedication to peace, the Coronet was equipped with both laser and ion cannons for defense."}, {"tag": "p", "text": "By the time of the Clone Wars, the Coronet saw significant use transporting Republic tourists to the planet Mandalore, and officials in the New Mandalorian government as well as Mandalorian entrepreneurs took advantage of the starliner's journeys between Mandalorian space and the Core Worlds to import and export cargo. Around 21 BBY, Duchess Kryze utilized the Coronet on a trip to the Republic capital world of Coruscant, to speak before the Galactic Senate. During this journey, however, the Coronet was attacked by Separatist battle droids aligned with the Mandalorian Death Watch splinter group, in an attempt to capture or kill Kryze. Fortunately for the New Mandalorian leader, Jedi Knights Obi-Wan Kenobi and Anakin Skywalker—along with a detachment of Republic clone troopers—were aboard, and managed to neutralize the droid attackers, saving Kryze and the Coronet, which safely landed on Coruscant."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The vessel was built on Kalevala, the home planet of the Duchess Satine. It was considered to be a flying palace, with the interior being ornately decorated. The ship carried many 3PO-series protocol droids, BD-3000 luxury droids and LEP servant droids. It had an interior cargo hold."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 22 BBY, the ship traveled to the planet of Mandalore to transport Duchess Satine Kryze to Coruscant. Before the ship left, Senator Tal Merrik had several boxes marked with the Senate seal smuggled on board. These boxes contained assassin probes. During the trip, the probes were released and unsuccessfully tried to kill the Duchess. Soon after, the vessel was attacked by three Separatist Droch-class boarding ships that released battle droids onto the Coronet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Coronet first appeared in Star Wars canon in the Star Wars: The Clone Wars television series' second season episode, \"The Mandalore Plot,\" which aired January 29, 2010. The Coronet was the setting for the following episode \"Voyage of Temptation\", and appeared in a flashback at the start of the subsequent episode, \"Duchess of Mandalore\"—airing February 5 and February 12, 2010, respectively. Details and information on the Coronet were provided by author Jason Fry in the series reference books Star Wars: The Clone Wars Official Episode Guide Series 1 & 2 and Star Wars: The Clone Wars: Incredible Vehicles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}