{"url": "Coronet_City", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cities on Corellia", "Category:Coronet City locations", "Category:Galactic Empire cities"], "nodes": [{"tag": "h1", "text": "Coronet City"}, {"tag": "p", "text": "Coronet City, also known as Corellia City, was a major city located on the prestigious Core Worlds planet Corellia."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Coronet City, also known as Corellia City, had one known district, the Teeno Village district, as well as mag-lev subways and trains, which stopped at various stations, among them Juni Street Station. There were also several casinos and Peace and Security stations, one of which shared a basement with a museum. Diadem Square was located in the downtown area of the city, and had stores and air-tuks. The city also had its own HoloNet news channel, known as Coronet City Info, abbreviated as CCI."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the late stages of the Galactic Civil War, the Corellian bounty hunter Dengar and Mercurial Swift once had a fistfight on a holoplex rooftop in the city."}, {"tag": "p", "text": "In 5 ABY, a group known as the Acolytes of the Beyond began to attract followers in the city but also harangued the locals. The Acolytes, dark-side adherents and worshipers of Darth Vader, organized a revolution, which involved coordinated attacks on several locations throughout the city including Diadem Square, the 1-line of the mag-lev subway, Juni Street Station, and several casinos. Acolytes also jumped on top of several air-tuks to pull them down to the ground. These attacks were a ruse to enable the Acolytes Kiza and Remi to attack a Peace and Security station in order to steal a red-bladed lightsaber from its basement."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Coronet City first appeared in the Star Wars Legends book Ambush at Corellia, the first book in Star Wars: The Corellian Trilogy. It was written by Roger MacBride Allen and published by Bantam Spectra in February 1995. The city became canon in Chuck Wendig's 2015 novel, Aftermath."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}