{"url": "Corpse_vision", "categories": ["Category:Legends articles", "Category:Alter powers", "Category:Dark side powers", "Category:Mind-affecting powers", "Category:Sense powers", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Corpse vision"}, {"tag": "p", "text": "A corpse vision was a dark-side Force power, akin to invoke spirits, conjured through Sith magic by a Sith sorcerer, that summoned the spirits of deceased Dark Lords while playing upon the Force sense of Force-sensitives to produce mind-tricking visions. Under the Sith practitioner's spell, the corpses would metamorphose into intimate images from the Force-sensitive's past that would whisper twisted, potentially damaging messages to the recipient."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 23 BBY, Darth Tyranus, in alliance with Korriban's dead Dark Lords, employed mind-tricking corpse visions against the Jedi Order coalition team sent to Korriban to track down galactic criminals Granta Omega and Jenna Zan Arbor. As the eight-member Jedi team entered the Valley of the Dark Lords, assaulting them on all sides were waves of darkness, the oppressive effects of which required great effort to wade through and overcome. Entering the Valley's ancient mausoleums, the Jedi were simultaneously assaulted by dark-wave whispers and corpse visions amidst the tombs of the Sith Lords. The visions were summoned by the Sith Lord Darth Tyranus in an effort to fend off the Jedi intrusion into the Valley, where he planned to rendezvous with Omega and Zan Arbor, to establish an \"alliance\" with them."}, {"tag": "p", "text": "Padawan Anakin Skywalker experienced a corpse vision of his mother, Shmi (accompanied by Sith whispers that it was the Jedi who kept him from her and the Jedi who took him away), and Obi-Wan Kenobi of his deceased Master Qui-Gon Jinn (who Sith-whispered that he had failed him). The other Jedi experienced similar visions, after which they also encountered not only an undead platoon of Korriban zombies, but also dark energy traps, which they (with the exception of Skywalker) were able to stay clear of with Kenobi's advance warning."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}