{"url": "Corridan_Ordo", "categories": ["Category:Legends articles", "Category:Captains", "Category:Clan Ordo", "Category:Humans", "Category:Males", "Category:Mercenaries", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Corridan Ordo"}, {"tag": "p", "text": "Corridan Ordo was a Human male Mandalorian soldier who lived during the time of the Great Galactic War between the Galactic Republic and Sith Empire. A member of Clan Ordo, Corridan Ordo grew to become a respected alor'ad—or captain—in the Mandalorian community, and became close friends with fellow Mandalorian Torian Cadera. Ordo, Cadera, and several other Mandalorian commandos were at one point tasked to destroy a weapons factory on Eriadu, a task which Ordo saw completed with the use of thermal detonators. During the Cold War that followed the end of open conflict between the Republic and Sith, Ordo took up mercenary work for the Empire, and it was in that capacity that he was tasked to kill a Republic senator currently under Jedi protection. Together with several of his Mandalorian comrades, Ordo succeeded, though he was struck in the head by a lightsaber blow during the course of the fighting, saved only by his beskar iron helmet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A member of Clan Ordo, Corridan Ordo was a Human male Mandalorian who lived during the tumultuous period of time known as the Great Galactic War, a galaxy-spanning conflict between the forces of the Galactic Republic and the resurgent Sith Empire. Having passed his verd'goten rite of passage at the age of thirteen and become an adult in Mandalorian culture, Ordo grew up to become a respected alor'ad—or \"captain\" in Mando'a—among the Mandalorian community, and he became close friends with his fellow Mandalorian, Torian Cadera. At some point during the war, Cadera joined Ordo and his clan as part of a Mandalorian team sent to destroy a weapons factory on the Mid Rim world of Eriadu. Ordo's unit of soldiers were faced with snipers and mines on the way to the factory, which they had little trouble passing, but inside the factory they discovered cloaked resistance fighters hidden among the workers. Ordo evacuated as many of the innocent bystanders as he could before ordering his comrades behind cover and assaulting the resistance fighters with thermal detonators, killing them and destroying the factory."}, {"tag": "p", "text": "During the Cold War that followed the Treaty of Coruscant and the end of the hostilities between the Republic and Empire, Corridan Ordo contacted several old friends and arranged a hunting trip to Dxun, the beast-infested jungle moon of Onderon. Many of the individuals he had served with previously were able to join Ordo on the trip, including Torian Cadera, whom Ordo came to owe fifty credits over the course of the trip. While the group hunted mainly bomas and maalraas, one Mandalorian by the name of Jagger managed to bring down a zakkeg to the group's surprise and delight."}, {"tag": "p", "text": "Later, as tensions heightened between the Republic and Empire, Ordo and his clan were contracted to assassinate a senator holed up in a heavily fortified area under the protection of a significant Jedi presence. Ordo invited Cadera to take part in the mission, leaving him a message with instructions to meet Clan Ordo at the Baliss estate on Alderaan if we were interested. Cadera, who was serving aboard the vessel of the latest Grand Champion of the Great Hunt, met up with Corridan and Clan Ordo and pursued their target. The Jedi protection detail proved a challenge to Ordo's people, causing casualties among the clan. Ordo was struck in the head by a glancing lightsaber blow, however his helmet saved him from injury as it was made of beskar iron, an incredibly resilient metal ore capable of withstanding a lightsaber, and found only on the planet Mandalore and one of its moons."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Corridan Ordo was a respected member of Clan Ordo, and maintained a close friendship with Torian Cadera, despite the dishonor that had been brought upon his clan by the actions of Cadera's father, Jicoln. He enjoyed hunting, and was known to be a bit of a showoff in the presence of an attractive female."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ordo wore a set of Mandalorian armor forged from beskar iron ore, giving it the ability to withstand blows from a lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Corridan Ordo first appeared in Star Wars canon in the massively multiplayer online game, Star Wars: The Old Republic, created by BioWare and released December 20, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}