{"url": "Cortosis/Legends", "categories": ["Category:Legends articles", "Category:Lightsaber-resistant materials", "Category:Ores"], "nodes": [{"tag": "h1", "text": "Cortosis"}, {"tag": "p", "text": "Cortosis ore was a very rare, brittle, fibrous material, the conductive properties of which would cause lightsabers to temporarily short out upon contact. This effect made cortosis a useful material for anti-lightsaber melee weapons, though with repeated strikes, a lightsaber could still cut through it. Cortosis, due to its energy resistant properties, was also resistant to blaster fire."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Cortosis ore was used extensively in shadowtrooper armor, as well as the C-B3 cortosis battle droids during the Clone Wars, and the Force-using group known as the Jensaarai. The cortosis used for this armor was smuggled out from Bespin's Cloud City. The walls of the Imperial Palace were also lined with cortosis ore. It was also used to strengthen starfighter and capital ship hulls, and was woven into body armor."}, {"tag": "p", "text": "Cortosis was expensive to mine because it was so rare and it had to be absolutely refined. Pure, unrefined, cortosis ore was for unexplained reasons, energized, killing anyone who touched it with his/her bare skin, even Hutts, who had energy-resistant enzymes in their sweat. Miners had to have filtering equipment, or else the cortosis particles would accumulate in their systems, causing hair loss, sickness, and eventually death. The substance was energy-resistant, meaning energy tools (such as plasma torches) were virtually useless. The brute force of hydraulic jacks were used to mine it, though it quickly wore the head of the jack to uselessness and its dust would clog the pistons. Pockets of highly-combustible lethane gas often formed near cortosis deposits."}, {"tag": "p", "text": "The most valuable type of cortosis was the purified variation. It was known as Cortosis-Shield, used by Roan Fel's Imperial Knights on their gauntlets. It was effective, and could short out a lightsaber for a short period of time."}, {"tag": "p", "text": "During the New Sith Wars, the Outer Rim Oreworks Company mined cortosis on Apatros. This was where future Dark Lord of the Sith Darth Bane was born and drilled cortosis for several years before fleeing to the Sith Army."}, {"tag": "p", "text": "The Jin'ha mined cortosis on Obredaan. During the Invasion of Naboo, Trade Federation assassin droids used cortosis weapons."}, {"tag": "p", "text": "During the Clone Wars, the Jedi Council discovered that the Confederacy of Independent Systems was mining cortosis on Bal'demnic, and dispatched a task force led by Halagad Ventor and Sha Koon to sabotage the operation."}, {"tag": "p", "text": "Large deposits of cortosis were also known to be on Duro and Katanos VII."}, {"tag": "p", "text": "Quinlan Vos wore a cortosis gauntlet on his left arm during the Clone Wars"}, {"tag": "p", "text": "The Pau'an Sith Lord, Darth Desolous, used a cortosis shield to block lightsaber attacks."}, {"tag": "p", "text": "Cad Bane used a cortosis slugthrower against Bolla Ropal to disable his lightsaber and capture him."}, {"tag": "p", "text": "Galak Fyyar had an entire powered suit of shielded battle armor created out of cortosis alloy."}, {"tag": "p", "text": "Riot stormtroopers were armed with electrostaffs made with cortosis."}, {"tag": "p", "text": "Luke Skywalker and Mara Jade encountered a vein of cortosis on Nirauan while infiltrating the Hand of Thrawn during the Caamas Document Crisis."}, {"tag": "p", "text": "The Umbaran Nyss Nenn used twin vibroblades coated with cortosis in combat. However, they proved ineffective against the Force-sensitive clone Soldier, who kept contact between their weapons minimal by striking fast, which therefore only caused his lightsaber to spark."}, {"tag": "p", "text": "Roan Fel and all of his Imperial Knights had pure cortosis gauntlets."}, {"tag": "p", "text": "Only lightsabers that used a special kind of lightsaber crystal mined on Mestare were immune to the effects of cortosis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sources conflict over the nature of cortosis and its effects on lightsabers. Old Republic era sources, such as the Star Wars: Knights of the Old Republic and Star Wars: Knights of the Old Republic II: The Sith Lords video games, treated the effects of cortosis weapons as merely energy-resistant and only capable of blocking lightsaber attacks (though it may have been so due to gameplay mechanics, so cortosis blades wouldn't be too overpowered). This portrayal of cortosis is similar to that of phrik and Mandalorian iron. This is similar to the effect in Star Wars: Obi-Wan, where assassin droids which carry cortosis blades can block lightsabers but not shut them down. In the games Star Wars: Jedi Knight II: Jedi Outcast and Star Wars: Jedi Knight: Jedi Academy, when the player slashes a shadowtrooper with his/her lightsaber, the saber will not be deactivated however the damage is reduced and slight \"exploding\" effects appear around the area the armor was struck. In Darth Bane: Path of Destruction, a cortosis mine is described and cortosis is said to be incredibly dense and difficult to mine, but highly sought for its energy resistant properties that make it useful for weapons, armor, and in starship construction. In these sources, cortosis items and weapons are commonly used in the conflicts that make up the Dark Wars and the Sith civil war. This differs greatly from later-era portrayals, such as I, Jedi, in which cortosis is described as a brittle, highly malleable metal capable not only of blocking energy attacks, but of disabling lightsaber weapons when it comes into contact with them."}, {"tag": "p", "text": "Different types of cortosis have been named in various sources, such as cortosis alloy, purified cortosis, and cortosis weave, but no consistent explanation for the different portrayals has been provided by sources."}, {"tag": "p", "text": "The \"shut-down\" duration of time for the later-era portrayal of cortosis also varies in different sources. In Vision of the Future, when Luke Skywalker first encounters it, it deactivates his lightsaber, but he is able to reignite the blade immediately. In other depictions, however, including Purge and the Legacy comic series, it renders lightsabers useless for several minutes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}