{"url": "Coruscant-class_Heavy_Courier", "categories": ["Category:Legends articles", "Category:Corellia StarDrive products", "Category:Courier classes", "Category:Galactic Republic starship classes", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "Coruscant-class Heavy Courier"}, {"tag": "p", "text": "The Coruscant-class Heavy Courier was a model of starship manufactured by Corellia StarDrive. It was used by the Galactic Republic some four thousand years before the Battle of Yavin. The Nebulon Ranger was a Coruscant-class Heavy Courier used by the Jedi Ulic Qel-Droma, Cay Qel-Droma, and Tott Doneeta during their mission to Onderon."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Coruscant-class a large multi-sectioned ship, measuring 110 meters. The ship incorporated two main engine arrays, mounted on a starframe tilted at a right-angle. The engine configuration gave the Coruscant-class greater maneuverability without the need to rely on maneuvering jets."}, {"tag": "p", "text": "The large wing on the ship's right side was the Coruscant-class Heavy Courier's most notable feature. At a 45-degree angle to the cockpit, the heavily-armored wings had retractable fins for better control in atmospheric flights. The airlock and sensor array pylon were also visible on the wing. The ship also featured an access corridor in the neck that held a boarding ramp and escape hatch, which led to the living area. The drop bay at the base of the craft could be used as a cargo bay."}, {"tag": "p", "text": "Six AlderaanMotors power generators and engines were mounted in two distinctive boxes of three and were set at 90 degrees to each other on a starframe around which the rest of the courier was constructed. The ship's fuel tanks were located in the main wing, and directly fed the power generators."}, {"tag": "p", "text": "The Coruscant-class was armed with a forward firing pulse-wave cannon. The weapon was powerful enough to cut through the shields of any pirate vessel. Three rotating laser cannons were mounted on the Coruscant-class, one on each wingtip and one of the secondary engine array. Four proton torpedo launchers were installed on the ship, a fire-linked pair in each mandible. Each mandible had a magazine of six proton torpedoes. Each mandible also housed a single short-range concussion sphere launcher with a magazine of eight concussion spheres feeding it. Eight deflector shield generators provided protection, but the power draw was so great that they were only activated in combat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Corellia StarDrive developed the Coruscant-class for the Republic to use for courier missions into the Galactic Frontier. Often entering hostile and disputed territory, the Coruscant-class would relay important Republic information regarding law enforcement policies."}, {"tag": "p", "text": "The Coruscant-class earned a reputation for excellence in combat situations, leading the Republic to commission hundreds more of the class. These ships were deployed on picket duty along the Republic's contested borders and trade routes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name Coruscant-class Heavy Courier was first established in The Essential Guide to Vehicles and Vessels and reinforced in the Tales of the Jedi Companion. The Power of the Jedi Sourcebook, published in 2002, stated that the Nebulon Ranger was a Crescent-X9 manufactured by Krasten Shipyards. Other information was also changed, such as the ship's length and armaments. However, 2008's The Complete Star Wars Encyclopedia once again states the Nebulon Ranger is a Coruscant-class vessel. As The Complete Star Wars Encyclopedia is most recent source, this article presumes that the Power of the Jedi Sourcebook information is incorrect."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}