{"url": "Coruscant_Administrative_Sector_terrorist_attack", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Coruscant", "Category:Terrorist attacks"], "nodes": [{"tag": "h1", "text": "Coruscant Administrative Sector terrorist attack"}, {"tag": "p", "text": "In 22 BBY, a terrorist attack occurred on the planet Coruscant."}, {"tag": "h2", "text": "The attack"}, {"tag": "p", "text": "Four explosions were detonated, damaging the Coruscant Central Court building, Coruscant Court of Appeals building, and the Senate Overflow Offices. During the attack, Jedi Knight Obi-Wan Kenobi was injured when the explosion disrupted the skylane he was flying with when the explosion occurred. The damage caused thousands of deaths. In the immediate aftermath, medwagons and Coruscant Rescue Ops responded to put out the fires and rescue the victims. The Coruscant Security Force (CSF) set up emergency checkpoints and police officers secured the damaged areas. Jedi including Anakin Skywalker, Yoda, and Vokara Che also searched for Obi-Wan Kenobi who they found and took back to the Jedi Temple's Halls of Healing."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the aftermath, the skylanes around the Administrative Sector remained empty and the vast numbers of dead overwhelmed the CSF's ability to clear them and they remained there for days after. As the Coruscant Central Court and the Coruscant Court of Appeals did not have any facilities and many of its members killed, current cases were put on hold and new cases were backlogged. The Judiciary struggled to find judges to hear cases as well as facilities in which to hold court. Also, many government officials had lost their offices and documents causing a rush on office equipment and supplies. The attacks were blamed on the Separatists and Supreme Chancellor Palpatine took Senator Padmé Amidala and Bail Prestor Organa on a tour of the damage which caused both to stand firmly behind Palpatine. This allowed him to act more aggressively in expanding security measures and heighten the ongoing Clone Wars between the Galactic Republic and the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}