{"url": "Coruscant_Health_Administration", "categories": ["Category:Legends articles", "Category:Galactic Republic organizations", "Category:Medical organizations"], "nodes": [{"tag": "h1", "text": "Coruscant Health Administration"}, {"tag": "p", "text": "The Coruscant Health Administration (CHA), also known as Coruscant Health or Coruscant Health Office, was an organization within the Galactic Republic that was responsible for the health care of Coruscant's citizens. The agency was also responsible for running medcenters on Coruscant. Coruscant Health Officials were in charge of issuing warnings and analysis of disease, enacting quarantines, and giving vaccinations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This administration was founded before the Clone Wars. As of 22 BBY, it was headed by Medxec Harribore Onuta. During that time, an increase in Brainworm Rot Type A in the Manarai Heights district of Coruscant, caused the CHA to increase quarantines and vaccinations especially for travelers entering Coruscant at spaceports such as Eastport."}, {"tag": "p", "text": "Later, Coruscant Health Officials were a part of a special report on death sticks and their increased use by youth on Coruscant."}, {"tag": "p", "text": "In 20 BBY, Republic Treasury agent Besany Wennen was attempting to discover where the funds for the Grand Army of the Republic had come from. In an attempt to see how wounded clone troopers were handled, she called the CHA policy planning department. Their she learned that the CHA only handled civilian cases and none from the GAR."}, {"tag": "p", "text": "Later, Wennen began an armed siege at a CHA medcenter to prevent a comatose clone commando, Fi, from having his life support removed. Wennen was rescued by Coruscant Security Force Captain Jaller Obrim and other police officers from the CSF Anti-Terrorism Unit. Wennen worried that the CHA administrators would call her boss and have her fired though Obrim promised her not to worry."}, {"tag": "p", "text": "In Nuvo Vindi's underground laboratory on Naboo, the CHA's logo was present on the bombs he used to spread the virus. The flashing warning signs in the lab were set off when the virus was released also displayed the symbol. Padmé Amidala and Jar Jar Binks's bio-suits had this symbol on their chest sections."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The logo for the Coruscant Health Administration appeared in episodes seventeen and eighteen of Star Wars: The Clone Wars, \"Blue Shadow Virus\" and \"Mystery of a Thousand Moons\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}