{"url": "Coruscant_Livestock_Exchange_and_Exhibition", "categories": ["Category:Legends articles", "Category:Events"], "nodes": [{"tag": "h1", "text": "Coruscant Livestock Exchange and Exhibition"}, {"tag": "p", "text": "The Coruscant Livestock Exchange and Exhibition was held every year on Coruscant and was the largest livestock fair in the galaxy. It was held in the stables, corrals, and halls of the Grand Symposium. The exhibition was a major event for animal dealers and traders of all sorts. Many transactions, legal or otherwise, were held amidst the competitions, auctions and revelry. The Livestock exhibition gave many different beings an opportunity to learn more about one another and their various worlds through the exotic creatures they brought with them."}, {"tag": "p", "text": "Amongst the animals in the outdoor exhibits were rontos, kybucks, banthas, and eopies. Avians included nunas, urusais, pylat birds, and neekoflight. Orbalisks, droch, and energy spiders were among some of the arthropods present. Amongst the Small Animal Hall were such creatures as chitliks, gizkas, twirrls, and voorpaks. Reeks, rancors, boarwolves, tusk cats, and nexu were all kept in an eerily lit area known as the Dangerous Animal level. Tauntauns, jerbas, bursas, blurrgs, fambaas, falumpasets, kaadu, shaaks, gualamas, zeer, gundarks, unidentified ungulates from Quermia, horses, and ysalamiri could be found as well."}, {"tag": "p", "text": "This popular and well-attended event presented many opportunities for smuggling and escape. Each year, unclaimed nunas ran about everywhere. Sometimes it was hard to tell which creatures were traders and which were livestock—at some point, some confused traders tried to purchase Ewok traders present at the event."}, {"tag": "p", "text": "The intense pollution on Coruscant claimed the lives of dozens of animals that were not used to the dirty air. The thranta, a highly sought-after beast at the Exchange, was unable to handle the atmosphere, so used was it to the atmosphere of its natural habitat of Alderaan, a planet that had a naturally clean atmosphere, and the life zone of Bespin, where some were transplanted prior to Alderaan's destruction in 0 BBY. Tendau Nandon and Dusque Mistflier went to one of the exhibitions prior to 1 ABY."}, {"tag": "p", "text": "In 43.5 ABY, a skirmish broke out at the Livestock Exchange and Exhibition when the Jedi Knight Natua Wan fell prey to the psychosis that was plaguing the Jedi Order while visiting the Exhibition with Han Solo, Leia Solo, their daughter Jaina, granddaughter Allana, and fellow Knight Radd Minker. Wan freed many of the animals from the cages, hoping to cover her escape from the Grand Event Center. Organa Solo was forced to kill five boar-wolves in order to save a young boy who had fallen into their pen, and a mother nexu clamped down on an Ithorian's leg. Organa Solo stabbed the beast as the ramps stopped retracting. While pandemonium flooded the facility, Jaina Solo entered into a lightsaber duel with Wan, who was emptying a bordok cage. Organa Solo and Minker soon arrived to assist Jaina, and Minker knocked Wan unconscious with a head-butt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}