{"url": "Coruscant_Ministry_of_Ingress/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire Law enforcement", "Category:Galactic Republic law enforcement"], "nodes": [{"tag": "h1", "text": "Coruscant Ministry of Ingress"}, {"tag": "p", "text": "The Coruscant Ministry of Ingress (CMoI), or simply Ministry of Ingress, was an immigration enforcement service operating on the planet Coruscant. It was responsible for monitoring immigration and emigration on Coruscant as well as protecting the capital planet from terrorists entering as refugees. During the reign of the Galactic Republic, the CMoI answered to the Office of the Supreme Chancellor. At the time of the Clone Wars between the Republic and the Confederacy of Independent Systems, the CMoI, under its First Minister, Tannon Praji, came under public criticism for preventing immigration of refugees and deporting several species. During the Republic's successor government, the Galactic Empire, the CMoI was controlled by Coruscant's military police, the Coruscant Guard, becoming little more than the Guard's puppet. After the capture of Coruscant by the New Republic government, the CMoI was dissolved."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Ministry of Ingress served as the immigration enforcement service of the planet Coruscant. It was led by a First Minister, who directed the operations of the CMoI and was supported by its deputy, the Second Minister. Both positions were political appointments that could be installed or dismissed by the head of the government. The CMoI was composed of bureaucrats who ensured the continuation of the ministry's daily services, and customs officials who enforced the CMoI policies and regulations. Branch offices were located throughout Coruscant's Galactic City, including the Financial District."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Republic, the CMoI functioned as a ministry under the control of the Office of the Supreme Chancellor. At the time of the Separatist Crisis, in the waning years of the Republic, Zelebitha Effhod served as First Minister of the CMoI. After the election of Senator Palpatine as the Republic's Supreme Chancellor, he appointed Tannon Praji, a member of the old Coruscanti Praji family, to become the CMoI's Second Minister under Effhod."}, {"tag": "p", "text": "With the Separatist Crisis intensifying, the CMoI faced a daunting task, as billions of refugees attempted to gain entry at Coruscant's various spaceports. New policies on required documents for entry were issued, mandating that newcomers have a Core Worlds Visa, a Perlemian Standard Passport, proof of planetary citizenship, and that incoming vessels have valid Coruscant identi-tags as well as a Bureau of Ships and Services Core Worlds operating license. However, the new restrictions only served to increase the clogged entry lines, and security at the spaceports became perilously dangerous. Though Effhod stood indecisive in the face of the problems, Praji was able to convince her to take action. Coruscant's borders were closed indefinitely to newcomers. Meanwhile, those immigrants who were able to get through the long and arduous entry process often fell to exploitation as menial servants or worse. For its actions, CMoI received criticism from various factions including free traders, independent operators, Galaxy Tours Vice President Bronwynn Koft, and Senator Bail Organa of Alderaan."}, {"tag": "p", "text": "In 22 BBY, the Separatist Crisis exploded at the First Battle of Geonosis into the Clone Wars between the Republic and the Confederacy of Independent Systems. On the eve of the battle, Effhod died due to Quannot's Syndrome, leaving Praji to take the post of First Minister of the CMoI. The war brought increased challenges for the immigration ministry. Customs agents were charged with observing immigrants for potential terrorists and Separatist spies. Facing intense pressure from the Commission for the Protection of the Republic, Praji ordered the deportation of all members of several whole species whose homeworlds had gone over to the Separatists, including Gossams and Aqualish. While the deportation of billions was a goal never fully realized, Praji became the target of several assassination and kidnapping attempts. With the subsequent formation of the Galactic Empire in 19 BBY, the CMoI came under the control of Coruscant's military police, the Coruscant Guard, and became little more than the Guard's puppet. After the capture of Coruscant by the New Republic government in 7 ABY, the CMoI was dissolved."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Coruscant Ministry of Ingress first appeared in a section of HoloNet News Vol. 531 51, which was released on April 11, 2002. The CMoI received an entry in The Complete Star Wars Encyclopedia, published on December 9, 2008. Later, the CMoI appeared in a short story by Nathan O'Keefe called Tinker, Tailor, Soldier, Praji, which was published online through Hyperspace in 2009. The short story provided more information on the CMoI through the backstory it detailed about Tannon Praji."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}