{"url": "Coruscant_Nights_II:_Street_of_Shadows", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Coruscant Nights"], "nodes": [{"tag": "h1", "text": "Coruscant Nights II: Street of Shadows"}, {"tag": "p", "text": "Coruscant Nights II: Street of Shadows is the second installment of the Coruscant Nights trilogy by Michael Reaves. It was released on August 26, 2008. Before the final title, the book was to be called Chiaroscuro and later Sins of the Father. A preview of the book was published in Coruscant Nights I: Jedi Twilight."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "With the Jedi all but wiped out in the grim aftermath of Order 66, the Empire's power seems unchecked. But one lone Knight continues to fight the good fight — against all odds and when all else fails."}, {"tag": "p", "text": "Deep in the bowels of Coruscant, Jedi Jax Pavan seekes out a living as a private investigator; a go-to, can-do guy for the downtrodden. Now a mysterious Zeltron knockout named Deejah approaches Jax with a case that needs to be cracked: to find out who killed her artist lover Volette, brutally murdered hours after his triumphant unveiling of a dazzling new light sculpture with obvious links to lightsaber pyrotechnics."}, {"tag": "p", "text": "Finding Volette's killer won't be easy — too many secrets, too many suspects, and all kinds of motives. But with the droid I-5YQ's help, and ex-reporter Den Dhur's excellent snooping skills, the investigation is soon operating like a well-oiled machine."}, {"tag": "p", "text": "Unfortunately, there's a far more efficient machine hunting Jax. It's a deadly game of cat-and-mouse as the clock starts ticking toward the final explosive showdown… to see who strikes first and who will die first."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts off in 19 BBY on Naboo where Gregar Typho, who was once the late Padmé Amidala's bodyguard, is visiting her grave. The narrative reveals that he loved Padmé deeply, and vows that he will find and track down her killer, thus avenging her death."}, {"tag": "p", "text": "Skipping over some time after the previous novel, Jax Pavan, Laranth Tarak, Den Dhur, I-5YQ and Haninum Tyk Rhinann are living as private investigators in the bowels of Imperial Center. They come across a new case when they are encountered by Dejah Duare where she leads the party to her apartment to find her lover, Ves Volette, has been murdered."}, {"tag": "p", "text": "Force-using bounty hunter Aurra Sing is tasked by Darth Vader to go to Imperial Center to hunt down Jax."}, {"tag": "p", "text": "During their investigation to Ves Volette's murder, Jax and I-Five work out that Volette was killed by an Umber 3PO unit owned by a wealthy family who purchased Volette's artworks. The 3PO unit destroys itself so that its masters won't suffer. The reasoning for the droid's murder of Volette was because it was worried that the Caamasi (Volette) was having an affair with the wealthy woman, and thus, might destroy the marriage between the family. This raises something to I-Five about sentience, which he wants to achieve, because this droid went beyond its protocol to defend its masters' honor."}, {"tag": "p", "text": "Gregar Typho learns that Darth Vader was somehow responsible for Padmé's murder, along with the \"death\" of Anakin Skywalker. So he decides to kill Vader on Imperial Center in order to avenge her death. But Vader catches Typho off guard and asks why he was hunting him. Typho reveals about his wanting to avenge Padmé, and, to a lesser degree, Anakin. Vader confirms of his murder of Padmé and Anakin, and Force-chokes Typho to death. But Typho died knowing that he somehow hurt Vader more than killing him would have ever done to avenge Padmé."}, {"tag": "p", "text": "With the case of her lover's murder solved, Dejah Duare decides to leave Imperial Center for her home, accompanied by Jax and his party. But they are attacked by Aurra Sing. Jax and Sing fight, and Sing is defeated, if not killed (later sources reveal that Sing may have survived her duel with Jax). Because of the Jax-Sing fight, Dejah decides to stay with him. This prompts Laranth, who Den knows loves Jax, to leave the group, with Dejah replacing Laranth in the position."}, {"tag": "p", "text": "The novel ends with Rhinann plotting to leave Jax's group and regain favor with Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the cover variations of Coruscant Nights II: Street of Shadows."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}