{"url": "Coruscant_Nights_III:_Patterns_of_Force", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Coruscant Nights"], "nodes": [{"tag": "h1", "text": "Coruscant Nights III: Patterns of Force"}, {"tag": "p", "text": "Coruscant Nights III: Patterns of Force is the third installment of the Coruscant Nights trilogy by Michael Reaves, released on January 27, 2009. A preview of the book was published in Coruscant Nights II: Street of Shadows. At the end of the book is an introduction to Fate of the Jedi: Outcast, the first novel in the Fate of the Jedi series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "After the Empire's bloody purge of the Jedi, one lone Knight still fights for those who can't, unaware that he's about to be swept into a cataclysmic battle against the Master of Darkness himself."}, {"tag": "p", "text": "Throughout the galaxy, a captured Jedi is a dead Jedi, even in Coruscant's most foul subterranean slums, where Jedi Knight Jax Pavan champions the causes of the oppressed with the help of hard-nosed reporter Den Dhur and the wisecracking droid I-5YQ. But Jax is also involved in another struggle -- to unlock the secrets of his father's death and his own past."}, {"tag": "p", "text": "While Jax believes that I-5YQ holds some of those answers, he never imagines that the truth could be shocking enough to catapult him to the frontlines of a plot to kill Emperor Palpatine. Worse yet, Darth Vader's relentless search for Jax is about to end... in triumph."}, {"tag": "p", "text": "The future looming over the valiant Jedi and his staunch pals promises to be dark and brief, because there's no secret whatsoever about the harshest truth of all: Few indeed are those who tangle with Darth Vader and live to tell the tale."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "As the story opens, Jax Pavan, Den Dhur, I-5YQ, Dejah Duare and Haninum Tyk Rhinann are assisting Pol Haus with his investigation into the murder of a Toydarian spice dealer. Some time later, Jax has a dream of being in the Jedi Temple on the day that Anakin gave him a pyronium nugget for safekeeping. The dream alters from how it happened, with Anakin giving a cryptic message in a deep voice, before his image shifts into a horribly burned version of himself, the shock of this causing Jax to awaken. He reveals to I-5 how odd it is for the Force to have altered a memory in a dream, rather than having a prescient dream as he has heard of before. Jax and I-5 then hear someone at the door, and Jax opens it to reveal Tuden Sal, who has been sent by Whiplash to find Jax. I-5 is not at all happy to see Sal, and holds him at laserpoint."}, {"tag": "p", "text": "Den walks in on this scene as I-5 explains his and Sal's history, with Jax realizing that Sal was the man that his father Lorn Pavan entrusted the Sith holocron and I-5 to years prior. Sal apologizes for his actions, revealing that immediately after Lorn's death, he fell prey to a hostile takeover of his business holdings that was engineered by then-Senator Palpatine. He sent his family off-world after a kidnap attempt was made on one of his children, then joined the Whiplash in an effort to battle the Empire. When he met Laranth Tarak and learned of I-5's existence, Sal formulated the plan that he is now presenting: for I-5 to assassinate Emperor Palpatine. Rhinann rejects the plan as too risky, Den points out that I-5 is a much older model of droid than would likely be seen in Palpatine's company, and Dejah voices the opinion that if the plan fails, it would likely focus Palpatine's attention on the Whiplash. She also argues that Jax could be killed if his role in the plot is found out, with I-5 observing that perhaps it is Jax's responsibility to train new Force-sensitives, and therefore not be involved in the assassination attempt. I-5 finally says that he wants to hear everyone's opinions before making his decision, but he will give Jax's view the most weight. Jax, however, says that he doesn't know what his answer will be."}, {"tag": "p", "text": "Elsewhere, Kajin Savaros, an untrained human Force Adept, is living a marginal existence on the streets of Coruscant, attempting to stay alive while avoiding the Inquisitorius, Darth Vader's personally trained Jedi hunters. This is problematic for Kajin, because he was never properly trained in how to control the Force, and his emotions cause it to build up inside him, making him need to use it to relieve his anger. He senses an Inquisitor near him as he steals some food, but manages to stay hidden and make his escape. Meanwhile, Inquisitor Probus Tesla, who has been tracking Jax, is given a new assignment by Vader, to focus on finding I-5 instead. Disappointed, Tesla nevertheless promises to find the droid."}, {"tag": "p", "text": "Rhinann, meanwhile, has learned that Tesla has been narrowing his search for Jax to an uncomfortable proximity, and finally decides that he has overstayed his welcome, setting up transportation for the next day, regardless of whether he has obtained the bota plant extract or not. Jax finds himself wondering why Laranth left the group months prior, but before he can devote too much thought to it, he senses a strong Force presence and heads toward it. Tesla and Laranth, who are both in the area, have felt it too, with Jax meeting up with Laranth on the way to its source. Tesla arrives at a huge, malfunctioning repulsor field expecting to find Jax, but instead finds Kajin. Tesla chases Kajin down a tunnel, and they struggle against each other with the Force. To Tesla's amazement, Kajin is able to literally tear out a piece of repulsor field energy and hurl it back at him, almost knocking him completely out of the passage."}, {"tag": "p", "text": "He challenges Kajin verbally, then fires a bolt of Force lightning at him when Kajin rebuffs his offer to join the Inquisitorius, but the lightning interacts with the unstable repulsor field and arcs back on Tesla, injuring him severely. Jax and Laranth find Kajin when he exits the area, and Jax brings the teen back to the group's dwelling intending to train him in the ways of the Force. Upon Dejah's entry, Laranth abruptly leaves to make a report to the head of Whiplash, while Jax and Dejah talk about Kajin's abilities. Den tells I-5 privately that he believes Dejah is manipulating Jax. Rhinann observes most of this and worries that perhaps Kajin is a plant to find Jax and the others, then accelerates his plans to leave Coruscant, with or without the bota extract."}, {"tag": "p", "text": "Jax begins Kajin's training the next day, trying to work through the problems caused by Kajin's anger, and Rhinann begins his inquiries by asking I-5 about the vial's location, though I-5 is cryptic in answering him, saying that he does not want Rhinann to have any information that Vader would want, in case Rhinann should be captured. Near the end of the day, Pol Haus visits the group, and reveals both that he knows Jax is a Jedi and that Vader has taken a personal interest in finding the rogue Force-sensitive who injured an Inquisitor. Haus claims to want to find Kajin and get him to one of the surviving Jedi that he believes exist, saying that the easiest way would be to tell Vader that Kajin was killed in an accident that left no physical evidence."}, {"tag": "p", "text": "When Haus leaves, Jax asks Dejah and I-5 for their opinions on Haus, with Dejah saying she sensed no malice from him and I-5 saying that if Haus is an enemy, he has the ability to have all their means of offworld passage watched. Jax brings Kajin out to talk with him, but is confused when the teen disappears from his Force sense even though he can still see him. This happens again moments later, and when Jax asks how he is doing it, Kajin claims to not be doing anything. When he steps closer to one of Ves Voltte's light sculptures, Jax and Dejah both lose any Force or empathic sense of him."}, {"tag": "p", "text": "Dejah becomes upset and leaves the room, with Rhinann following her, and I-5 theorizes that the crystal-based power source of the sculpture shunts the Force from being sensed. Jax wonders about using an enclosure made of the sculptures to contain Kajin's abilities from detection, while in the meantime, Rhinann has learned that Dejah believes Ves knew of the sculptures' properties and used them to hide his true feelings from her. She is stung by the realization, and Rhinann makes a token attempt to comfort her, also telling her about the bota extract in an effort to learn from her if she knows who has it. Rhinann then questions Den about the location of the extract, who claims not to have it, with Den and Dejah later talking about who actually does have it, deciding that they can't be sure what I-5 has done with it."}, {"tag": "p", "text": "Back at the group's dwelling, Kajin's anger gets the better of him and threatens to expose him to the Inquisitorius before Jax manages to calm him down. Jax learns that Kajin feels angry at Palpatine, blaming him for his parent's decision to send him away from the Inquistorious squad that was on their planet. Den and I-5 have gone to set up a departure for an Ortolan refugee through the Underground Mag-Lev and Den questions\nI-5's reasons for not rejecting Sal's assassination plot outright. Den questions I-5 about the bota, but before they can continue the conversation, I-5 spots a group of Inquisitors moving towards the area where they felt Kajin's power emanating from. Jax asks Dejah if Kajin can be moved to Ves Volette's studio, where there are more light sculptures, and Dejah grudgingly gives her permission, even after learning that it may be necessary to modify the sculpture's waveforms. Jax dispatches Rhinann to find a way to get Kajin to the studio, while I-5 and Den see the Inquisitors enter the group's residential area. I-5 disguises himself as a Koorivar, with Den pretending to be a real-estate agent, so as not to draw the Inquisitors' attention."}, {"tag": "p", "text": "When they reach the conapt, they disguise Kajin as the Koorivar and send him, I-5 and Den to the speeder that Rhinann has hired. Kajin sees one of the Inquisitors and panics, trying to remove the disguise before they're airborne, and Jax is forced to reveal himself in the Force to draw the Inquisitors' attention, then he abandons the dwelling and makes his way to Volette's studio normally. Laranth arrives at the studio after Kajin, I-5 and Den arrive, and through her they learn that the sculptures also make it difficult for her to sense when Kajin actively uses the Force inside their fields. Jax and Laranth try to further modify the sculptures so that they will shield more of Kajin's power, but Haus contacts them, telling Jax that soon \"the client\"—referring to Vader—will take matters into his own hands if Haus fails to give him any information. Jax asks Laranth to set up a meeting with Thi Xon Yimmon, the head of Whiplash, and asks her opinion about Sal's plan. When Laranth demands to know if Jax cares what she thinks, Jax assures her that he does, with Laranth saying that he didn't seem to care when he left her in the medcenter after she was injured during the battle with Aurra Sing. Jax begins to respond, but they halt the conversation rather than have it in front of Kajin."}, {"tag": "p", "text": "Finally done modifying the sculptures, Jax has Kajin attempt to deflect fire from a training remote. Realizing that Kajin is only using the Force to increase his reaction time, Jax blindfolds him and tries to instruct him in how to use the Force to anticipate the attacks. Kajin succeeds in blocking several shots, but then gets hit and lashes out in anger, almost killing Jax with the duraluminum pole he's using instead of a lightsaber.\nJax calms Kajin down, and Kajin apologizes for his actions, begging Jax and Laranth to teach him how to restrain himself. The rest of the exercise passes without incident, and after Kajin goes to sleep, Jax and Laranth discuss his training. Jax finds himself wondering if he should ask Laranth to rejoin the group, when I-5, Den and Dejah return from sending the Ortolan refugee offworld. Laranth leaves, saying that she will set up the meeting with Yimmon, and I-5 asks that the group now vote on Sal's plan. Den and Rhinann vote against it, while Dejah has changed her mind, and now votes for it. Jax still hasn't made up his mind, but promises I-5 that after he speaks with Yimmon he'll have an answer."}, {"tag": "p", "text": "Jax then goes to meet Laranth at a bar so they can meet Yimmon. While waiting for her, he considers her attitude and actions in several instances, including the brief moment of emotional intimacy they shared months prior, when she was injured. He questions whether he's let himself be manipulated by Dejah, then Laranth arrives. She asks him if he's alright, and Jax says he's realized that he's been cocky, and has made a serious mistake. Laranth offers the opinion that everyone makes \"that kind of mistake once in a while.\" Jax again senses a connection, but he hesitates and the moment passes. They get up and leave under the pretense of a romantic interlude, and Laranth takes Jax to Yimmon's lair. Laranth begins to leave, but Jax asks her to stay. He finds out from Yimmon that Haus is one of the original Whiplash operatives, and that Yimmon also considers Sal to be a trustworthy member of the group. Jax then reveals that Sal wants I-5 to assassinate Palpatine, which neither Laranth or Yimmon knew about. Jax says that he believes Sal's primary motive is vengeance, and Yimmon then questions if this is also Jax's reason. Laranth supports the plan, but Yimmon questions how assassinating Palpatine would make Jax and his group any different from the Empire. Jax thanks Yimmon for his advice and leaves."}, {"tag": "p", "text": "Jax returns to the group and tells them that he can't give his approval of the plan, which Dejah disapproves of. Jax goes to contact Haus, and Jax apologizes to I-5, saying that he wishes his father was there to advise him. This activates a recording Lorn made for Jax just before his attempt to recover the Sith holocron from Darth Maul, where Lorn says that he never considered himself a hero, but felt he owed it to Darsha Assant, the Jedi who sacrificed her life to save him and I-5, and because he wants Jax to be proud of his father. Jax realizes that his father was a hero, and decides to go ahead with the plot to assassinate Palpatine. Jax wonders if perhaps by killing Palpatine there can be a Jedi Order that allows the Jedi to have families, then he and I-5 head back to the abandoned conapt to get a piece of equipment from the sculpture they left there. While Jax and I-5 are out, Rhinann and Dejah take Kajin outside for a walk, but the Inquisitors locate them. Jax and I-5 return to the studio to find Dejah, Rhinann and Kajin gone, and Haus shows up for their rendezvous. Kajin tells Dejah and Rhinann to run, then attempts to make his way past the Inquisitors. Laranth finds him and accompanies him, but soon their path is blocked by Tesla."}, {"tag": "p", "text": "Laranth suddenly arrives on the scene, and fires at Tesla. But at the same time, Kajin has Force-pushed Tesla away, and Laranth's shots detonate a vehicle, causing a panic on the street. Kajin, Laranth, Jax and the Inquisitors battle, with Jax crippling one before Laranth kills him. Kajin faces off against Tesla, but both he and Jax see the third Inquisitor attacking Laranth from behind. Kajin hurls a massive Force push against him, disintegrating the man and saving Laranth, but allowing Tesla to escape. Tesla is amazed by the teen's skill, and also realizes that he somehow sensed I-5 in the Force. Back at the studio, Dejah apologizes for taking Kajin outside, saying she was afraid that Haus would arrive while Jax was gone and try to take Kajin. Haus asks if they should send Kajin to Yimmon, and then the group realizes that Den is gone, having intended to head back to Sullust earlier. Jax tells I-5 that he can sense him, and that this means I-5 wouldn't be able to get close enough to Palpatine to assassinate him. Tesla makes his report to Vader and is surprised by Vader's telling him that one of Jax's group is a double agent, and that capturing Kajin is what will be needed to have Jax, I-5 and the bota extract as well."}, {"tag": "p", "text": "Laranth goes to take Kajin to Yimmon, while Jax and I-5 meet with Sal and inform him that I-5 somehow generates a Force signature. Sal is determined to carry out the plan, and tries to figure out some way for I-5 to kill Palpatine anyway, but the only way I-5 would no longer show up in the Force would be if his programs were stripped down to his basic level, which I-5 points out would make it impossible for him to kill Palpatine, as it is only his modifications that allow him to kill people. Sal then raises the prospect of I-5 assassinating Palpatine during the next Senate debate in two days time, with Jax accompanying a disguised I-5 while himself disguised as an Inquisitor. On their way to Yimmon's, Laranth and Kajin are drugged and captured by Inquisitors, and Jax has a Force-induced nightmare that worries him enough to go see Kajin. Before he can leave, Yimmon contacts them, saying that Laranth and Kajin were ambushed and taken. Yimmon realizes this means someone who had knowledge of some Whiplash activities must have informed the Inquisitors, but unlike Jax, he doesn't believe it was Haus. Jax alters the plot, changing it from an assassination to a rescue."}, {"tag": "p", "text": "Kajin wakes up in a nondescript room, not having any memory of who or where he is. When he heads out into the main area, he meets Tesla, who tells him that Jedi attempted to kidnap him. Kajin decides that must mean he is a Sith and Tesla tells him he is one of the most promising Inquisitorius recruits. Jax, in his Inquisitor disguise, manages to get close enough to the ISB Central Office to sense that Laranth is being tortured, but he cannot sense Kajin. He returns to the others and tells them this, and is surprised when Dejah says they should try and rescue Laranth. Jax decides to offer himself to Vader in exchange for Laranth and Kajin, intending to perhaps play Vader against Palpatine by using the bota extract as a bargaining chip. Rhinann sets up a conversation with Vader where Jax offers to turn I-5 and the bota over to him in exchange for Laranth and Kajin, to which Vader seemingly agrees. Afterward, Vader tells Kajin he was the one that rescued Kajin from the Jedi and shows him the restrained Laranth, causing Kajin to react with anger."}, {"tag": "p", "text": "I-5, Dejah and Rhinann arrive at the ISB and are escorted by Inquisitors, one of whom is Jax in disguise, to an abandoned docking chamber control room, faced by the still-bound Laranth, Vader, Palpatine and Kajin. Rhinann wonders why I-5 doesn't go on with the plan and fire at Palpatine, before realizing that Palpatine is only a holograph, which promptly disappears. Vader asks Dejah who has the bota, and she replies that she doesn't know, and then reveals that one of the Inquisitors is actually Jax in disguise. Jax is upset by this and by her reasons for betraying them—a sensual addiction to the energy given off by Force Adepts, which, when she couldn't manipulate Jax into providing her, was indulged by Tesla. Vader demands the bota, telling Jax that if he hands it over, he will let Laranth go. He then demonstrates his willingness to kill them all by momentarily torturing Laranth with the Force, which Jax uses as a distraction to reactivate I-5's personality. Vader again demands that Jax order I-5 to turn over the bota, but I-5 replies that he doesn't have it, firing his lasers at Vader, who blocks them. Vader admits fascination with the fact that he can sense I-5's emotions, then threatens to kill Jax and Laranth if I-5 doesn't give him the bota. Jax catches Laranth's gaze and she signals to him that she has the bota vial, but Vader loses his patience and hurls Jax against the wall. Laranth tells Vader that she has the vial and gives it to him, then Vader asks Jax to \"return\" the pyronium nugget Anakin gave him years previously. Jax does so, and Vader also demands the Sith holocron, which I-5 informs him they no longer have. Vader reveals that the bota combined with the pyronium will \"purify and exponentially increase\" his connection to the Force, and that the holocron contained instructions on exactly how to do this."}, {"tag": "p", "text": "Vader, however, is confident that he can figure it out without the holocron, and pours the contents of the vial into a receptacle on his chest plate. A frightened Tesla steps forward, but Vader says it is merely an analysis, before he is overcome by the power of the Cosmic Force, causing him to toss out Force energy in random directions. One blast shatters the control room window, a chair pins I-5 to the wall, and the energy surges short out Laranth's bonds, letting her rush to Kajin's side. Dejah attempts to get close to Vader but is hurled into a wall and killed. Another Force blast kills the other Inquisitor, and when Laranth and Jax are both unable to use the Force to contain Vader's power, Jax draws his lightsaber and heads toward Vader, only to be met by Tesla, before Tesla is caught by another burst and thrown into a pile of debris. Jax finds himself face-to-face with Vader, and hears Vader say \"You can't.\""}, {"tag": "p", "text": "When Vader is momentarily distracted by the opening of the room's doors, Jax slashes at him, his lightsaber bouncing off the bubble of Force energy hard enough to cause Jax's arm to go numb. Laranth calls for Jax and he sees Yimmon, Sal, Den and other Whiplash operatives, heavily armed, coming into the room. Sal tries to get Kajin, who is frantically trying to reach Vader, and is then grabbed by a tendril of Force energy as Vader heads toward the blasted-out window. Jax pursues them, only to be caught himself by another loop of energy. Rhinann, enraged that the bota extract is gone, hurls himself at Vader and attempts to damage his breathing apparatus, which distracts Vader enough to lose his grip on Kajin and Jax. Rhinann lunges at Vader and they fall out of the window to the hangar, with Rhinann feeling the Force at last as he dies. They realize that Tesla has vanished again, then run as Vader's power erupts again and begins to destroy the control room."}, {"tag": "p", "text": "In the aftermath, I-5 is repaired and upgraded with several new weapons, while Den admits that he stayed because he now thinks of Coruscant, rather than Sullust, as his home. Jax and Laranth try to restore Kajin's memories, but when they are unable to, Yimmon suggests sending him to the planet Shili, where the mysterious healers known as The Silent can help him recover, though it is unclear if Kajin will ever use the Force again since Vader removed his memories of it. After Kajin leaves, Laranth tells Jax that Dejah's betrayal wasn't his fault, but Jax argues that he should have anticipated her actions, that he was so certain that the Force allowed him to counteract her pheromone discharges and empathic gifts that he let himself be fooled. He brings up the moment that he and Laranth shared in the medcenter, only for Laranth to dismiss it as the past. Jax refuses to do so, however, and he and Laranth again share their feelings for each other through the Force. Neither of them are sure what is meant by their feelings, and they decide to hold off on any romance for the time being."}, {"tag": "p", "text": "Laranth questions why Jax wagered that the bota would affect Vader that way, and he says it was a combination of the bota being twenty years old and Vader not being prepared for the power surge he experienced, although he does not mention that Vader's aura and his comment about \"returning\" the pyronium have led him to suspect that Vader is Anakin. Jax tells Laranth that he doesn't think Vader is dead, but that he intends to stay on Coruscant, working with Whiplash, regardless. Arriving back at their new residence, Den introduces them to a Mirialan named Chan Dash who has come to them for assistance. Suddenly, Jax is hit with a connection to the Force unlike any he has ever felt, a momentary resonance with the Cosmic Force. He realizes that with the bota gone, the only way this could have happened is by the Force itself granting him the moment, and that what it means is that he was where he is meant to be. Jax then asks the Mirialan how they can help."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "On page 285, Jax Pavan states that I-5YQ has carried the bota \"for two decades,\" despite the fact that the droid acquired the vial only a couple years earlier from Padawan Barriss Offee at the end of the Battle of Drongar."}, {"tag": "p", "text": "The cover of the novel depicts Pavan facing off against Vader in a lightsaber duel. However, though they meet in battle, they do not duel lightsaber-to-lightsaber."}, {"tag": "p", "text": "In Chapter 18, Sullustan is misspelled as \"Sullistan.\" Similarly, in the final paragraph of the book, Mirialan is misspelled as \"Mirelian.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the cover variations of Coruscant Nights III: Patterns of the Force:"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}