{"url": "Coruscant_Security_Force_Headquarters", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Coruscant government buildings", "Category:Coruscant Security Force"], "nodes": [{"tag": "h1", "text": "Coruscant Security Force Headquarters"}, {"tag": "p", "text": "The Coruscant Security Force Headquarters, located in Galactic City on the planet Coruscant, served as the main base of operations for the Coruscant Security Force. It contained the offices of the CSF's senior command as well as the Anti-Terrorism Unit, Organized Crime Unit, and the dispatch center. Missions were planned and coordinated from the headquarters, and the Anti-Terrorism and Organized Crime units held briefings there on any on-going operations."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Coruscant Security Force Headquarters, located in Galactic City on the planet Coruscant, was the base of police operations of the Coruscant Security Force and contained the offices of the CSF's senior command and the dispatch center. It also housed the offices and briefing rooms of the Anti-Terrorism Unit and the Organized Crime Unit. The CSF Headquarters were separate from the CSF's various divisional headquarters, which were located across Galactic City."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The CSF Headquarters was built prior to the Cold War between the Galactic Republic and the Sith Empire. Around 3643 BBY, police officer Anstiss arrested a criminal named Gambo who was escorted back to the headquarters to be booked. Around that time as well, CSF Agent Jaffkee reported back to headquarters after planting listening devices in the sector of Coruscant controlled by the Justicars' Brigade, an outlawed militia. In 21 BBY, during the Clone Wars between the Republic and Separatists, the Organized Crime Unit had meetings in its briefing rooms on illegal weapons shipments. Along with the Anti-Terrorism Unit and several Republic commandos, the Organized Crime Unit conducted raids to stop the flow of weapons onto the planet. When on a case, Captain Jaller Obrim, commander of the Anti-Terrorism Unit, sometimes spent days at the headquarters without going home to see his wife."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Coruscant Security Force Headquarters first appeared in Republic Commando: Triple Zero, a novel written by Karen Traviss and published on February 28, 2006. It was mentioned in several other novels before being mentioned again in Star Wars: The Old Republic, a massively multiplayer online roleplaying game by BioWare, released on December 20, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}