{"url": "Coruscant_Security_Force/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Coruscant Security Force"], "nodes": [{"tag": "h1", "text": "Coruscant Security Force"}, {"tag": "p", "text": "The Coruscant Security Force (CSF), also known as the Coruscant Police or the Coruscant Constabulary, and depending on the era, less commonly known as the Imperial Sector Police, Galactic City Police, and Republic Security, was the primary police force in charge of maintaining law and order on the galactic capital planet of Coruscant during the reigns of the Galactic Republic, the Galactic Empire, the New Republic, and the Galactic Federation of Free Alliances. Its duties included regular patrols of Galactic City, criminal investigations, counter-terrorism and counter-intelligence operations, crowd control, diplomatic protection, maintaining the world's skylanes, and, in some cases, the military defense of Coruscant. Early during the Republic, the CSF was commanded by the Chief of Security and centuries later by the Coruscant Security Force Senior Command, later the Sector Command. As the Empire established its rule, control of the CSF was changed from the Sector Command to a Commander, that position itself later replaced by a Commissioner. The CSF operations were based out of a central headquarters and various divisional headquarters."}, {"tag": "p", "text": "Though staffed mostly by sentient police officers, droids were used as well, including different kinds of police droids, probes, and crime scene investigation droids. Major crimes were investigated by detectives, although high-ranking officers could also investigate such crimes. Specialized units included the SWAT unit, the Anti-Terrorism Unit, the Organized Crime Unit, Traffic Division, and the Forensics Unit. The lower levels of Coruscant were patrolled by the CSF's Underworld Police division. The CSF utilized VAAT/e ships, assault ships, and Republic police gunships as rapid troop deployment and patrol craft. They also had Coruscant police speeders and RapidResponse police speeders which were used as patrol and pursuit airspeeders. If at times officers felt they could be entering a dangerous area, they could receive an escort by a police cruiser backup unit."}, {"tag": "p", "text": "The CSF was one of the oldest planetary police forces in the known galaxy. After the Sacking of Coruscant and the subsequent Cold War, it battled for control of Coruscant against crime syndicates such as Black Sun and the Migrant Merchants' Guild. However, with severely depleted resources and a high rate of burnout among its embittered officers, the CSF had to leave large sections of Coruscant under gang control. During the later years of the Galactic Republic, the CSF was assisted by the Senate Guards—who served as a secondary police force for Coruscant—and the Jedi Order. Together, they would investigate severe crimes though rivalry and resentment were always present. During the Clone Wars, the CSF was supported by clone shock troopers of the Coruscant Guard and the Republic's clone commandos. With them, the CSF was able to investigate and bring down several terror networks operating on Coruscant."}, {"tag": "p", "text": "When Order 66 was issued, the CSF assisted in hunting down Jedi, although many CSF officers were privately resentful of Emperor Palpatine and his New Order. Some officers turned a blind eye when spotting Jedi, and in the following years others spied for the Rebel Alliance. Under the Empire, the Coruscant Guard took over the primary responsibility of Coruscant's security. The CSF acted in a support capacity to the Guard and was staffed by stormtroopers as well as regular police officers. It was also given a new name, the Imperial Sector Police, though many still referred to it as Coruscant Security, Police, or Constabulary. During that time, CSF commanders shared their police officers' resistance to the Emperor's rule. A CSF Moff even took part in and led a coup to oust Palpatine, though it ultimately failed."}, {"tag": "p", "text": "The New Republic captured Coruscant in 6 ABY, disbanded the Coruscant Guard, and reinstated the CSF as the primary law enforcement agency. With the Fall of Coruscant during the Yuuzhan Vong War, most of the CSF was wiped out; however, it was re-established after the end of the conflict. The Second Galactic Civil War placed the CSF in the middle of the conflict between the Galactic Alliance and the Confederation. Some CSF officers were recruited into the Galactic Alliance Guard (GAG) to counter Corellian terrorist activities on Coruscant. The GAG was later disbanded following the death of the Dark Lord of the Sith Darth Caedus. After the Civil War, the CSF continued to serve as Coruscant's police force. During the liberation of Coruscant by the Jedi Order from the control of the Lost Tribe of Sith, the CSF assisted the Jedi as the Sith began committing acts of terror on Coruscant. However, the CSF's casualties during the battle ran into the thousands."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Duties and overview"}, {"tag": "p", "text": "The Coruscant Security Force was tasked with providing law enforcement and security on the galactic capital of Coruscant. This included regular patrols of the various districts and neighborhoods of Galactic City, criminal investigations, counter-terror and counter-espionage operations, crowd control at major events and public disturbances, maintaining the planet's skylanes, handing out speeding tickets, diplomatic protection, and responding to a variety of other emergencies and situations. The CSF also had the authority to pursue investigations outside of their normal jurisdiction on Coruscant—an ability that extended even to Simpla-12 in the Outer Rim Territories."}, {"tag": "p", "text": "From their central headquarters and various divisional headquarters in Galactic City, the CSF performed these duties throughout the reign of several galactic governments. Police officers would train at one of several police academies before beginning their duties. The majority of crime on the planet occurred in the lower city levels. Most politicians and influential citizens refused to do much about the situation, preferring to live in the upper levels and skyscrapers away from the unpleasantness of the lower levels and slums. Areas such as the Factory District and the Crimson Corridor were especially heavy with crime. The environment of the underworld was very cutthroat and police officers on patrol traveled frequently in groups. The cops who patrolled the underworld were also notoriously harder and burlier than officers assigned to the upper levels. A database was maintained by the CSF that tracked a variety of data including a list of criminals and known areas of heavy crime."}, {"tag": "p", "text": "The CSF could be reached by their emergency call number of 9–1–1. The CSF Staff and Social Club was a bar favored by CSF officers. It was a location to which CSF officers often invited members of other organizations as a favor or sign of respect. Officers also frequently visited the Kragget, a restaurant with low rates that was known for its greasy food."}, {"tag": "h3", "text": "Organization and units"}, {"tag": "p", "text": "Ultimate authority over the Coruscant Security Force rested with the current reigning government. The Supreme Chancellor and Galactic Senate during the Galactic Republic, the Emperor during the Galactic Empire, and the Chief of State during the New Republic and the Galactic Federation of Free Alliances. Though they rarely interfered in day to day activities, they could, under certain circumstances, give orders to the CSF including assigning command positions to individuals and giving or removing responsibilities. The CSF provided protection services to the Chief of State, including bodyguards and intelligence information. Day to day control of the Coruscant Security Force changed several times throughout its history. During the Old Republic era, a senior officer was appointed to lead the CSF with the title of Chief of Security though he would also hold a separate police rank. Centuries later, the commanding officers who were placed in charge of daily operations were collectively referred to as Coruscant Security Force Senior Command, later changed to Sector Command under the Galactic Empire. A few years later, a commander was placed in charge of the CSF which at the time was staffed by stormtroopers and regular police officers. The post of commander was at some point removed and replaced by the position of commissioner."}, {"tag": "p", "text": "Lower ranks included those of Captain, Lieutenant, Chief of Detectives, Detective,Sergeant, and Officer. Although the rank of detective existed, officers of other ranks could also perform investigative-type duties. They were then referred to as inspector, along with the title of the rank that they held. It was common for high ranking officers to investigate high profile cases, such as those involving senators. The CSF also had other titles for various duties—Agent was used to describe those working undercover or on special assignments, and the title of Incident Commander was used by the officer in charge of a major police operation. The slang terms \"Cop\" and \"Boys in Blue\" were also used to refer to CSF officers."}, {"tag": "p", "text": "The patrol of the lower levels of Coruscant was left mostly to a separate CSF division, the Underworld Police. The CSF also had units that specialized in responding to and dealing with specific crimes and situations. The units included SWAT teams, an ordnance disposal unit of bomb disposal experts, a Forensics Unit that was staffed by Scenes of Crimes Officers and crime scene investigation droids, the Organized Crime Unit, the Anti-Terrorism Unit, and the Tactical and Operational force. Major investigations were handled by the Detective division. During the Old Republic era, CSF's Coruscant Control would monitor incoming and outgoing space traffic and the Customs Enforcement Division was charged with customs and immigration operations and checkpoint enforcement. The CSF's Traffic Division was charged with maintaining order in the massive skylanes of Galactic City. A Special Investigation Panel oversaw all investigations of use of deadly force by law enforcement and Jedi."}, {"tag": "h3", "text": "Uniforms and equipment"}, {"tag": "p", "text": "During the Great Galactic War which began in 3681 BBY, the Coruscant Security Force uniform consisted of an off-white or tan-colored uniform shirt, tan pants, dark knee-high boots, a utility belt, a gray blast vest, and a gray blast helmet or headset comlink. Shortly thereafter, the CSF uniform changed to blue-gray shirt and pants with a yellow strip that ran up the side of the pants and on the arms of the shirt, brown utility belts, and black boots. They could also done blue-gray blast vests over their chest and lower torso. In the waning years of the Republic, the general CSF uniform was a dark blue shirt and pants, dark boots, a utility belt, and dark blue body armor with a yellow blast vest as optional. This uniform would be used as the CSF standard in the decades to come."}, {"tag": "p", "text": "Apart from the general, day-to-day uniform, special uniforms were used as well. If so inclined, officers could make use of black or dark blue full body armor for patrol or during demonstrations and major operations. Higher ranking officers could also choose to wear a strap over their right shoulder that attached to their utility belt, as well as markings on their sleeves denoting their rank."}, {"tag": "p", "text": "Officers assigned to the Underworld Police would wear heavy leather and metal armor in dark gray with yellow shoulder pads to protect them from the harsh and cut-throat environment of the Coruscant Underworld. The armor covered their faces, revealing only mechanical eye coverings. Their uniforms and armor gave them a presence of anonymity and authority. It also had the effect of gaining them a mystic reputation as few knew if they were humanoid, droids, or something else."}, {"tag": "p", "text": "Police officers and droids had access to a variety of regular pistols and heavier rifles including issue blasters, heavy blaster pistols and other pistol variations. During riots and urban unrest, officers utilized the Merr-Sonn R-88 Suppressor riot rifle to pacify large crowds."}, {"tag": "h3", "text": "Droids and speeders"}, {"tag": "p", "text": "To assist in policing Coruscant's vast city, the CSF relied heavily on droids. They were also utilized for tasks such as crime scene investigations, and as personal assistants. Police probes were used to assist in detecting crimes and identifying suspects. During the Old Republic, security droids assisted in armed fights and street battles between the CSF and various gangs. At spaceports such as the Coruscant Spaceport, customs droids assisted in handling immigration and customs processes."}, {"tag": "p", "text": "Specialized Guardian police droids were specifically used for assisting in patrol duties. This included setting up a perimeter, collecting evidence, conducting preliminary interrogations, and holding and arresting suspects. Crimes that required in-depth investigations were handed over to detectives or other higher ranking organic officers. The droids could also use lethal force if certain perimeters were met. The rigid programming of the droids resulted in them being beyond weariness or corruption though it also would mean slick criminal could outsmart. In this, the droids, while heavily deployed, never fully replaced sentient officers. By the end of the Clone Wars, the aging police droids were gradually phased out, though they continued to be used in the lower levels, and were replaced by new models such as Policebots during the Galactic Alliance."}, {"tag": "p", "text": "The CSF used a variety of police vehicles to perform their duties. For large deployments, SWAT raids, or riot response, the CSF used the Variable Altitude Assault Transport/enforcement, also known as the VAAT/e. Toward the end of the Clone Wars, the Coruscant Security Force assault ship took over those duties as the CSF's preferred assault and transport ship. In the waning years of the Republic, the Republic police gunship was developed and put into use for search operations, troop transport, and general patrol. Its use continued into the years of the Empire. An incident support vessel was also used for transport, crowd control, and various other support operations at major police operations and incidents."}, {"tag": "p", "text": "Depending on the area, the CSF mostly used Coruscant police speeders for patrols, along with specialized RapidResponse police speeders. A BARC speeder was sometimes accompanied by a police cruiser backup unit if the officers felt they needed extra assistance or were entering a potentially dangerous area. For escort duties, the CSF also made use of swoops. During the time of the Great Galactic War, the CSF was responsible for monitoring the space traffic in and around Coruscant, and it used orbital security stations for that purpose. During the reign of the New Republic, the CSF utilized the Coruscant Security Force interceptor as a space and high altitude pursuit and defense fighter."}, {"tag": "h3", "text": "Relationship with other law enforcement"}, {"tag": "h4", "text": "Jedi Order"}, {"tag": "p", "text": "During the time of the Galactic Republic, the Jedi Order served as a quasi-police force. Their positions as keepers of the peace and as protectors of the Republic gave them authority to supersede the needs of the local police to that of their own. Specifically, the Jedi could claim jurisdiction over a matter if a Jedi was involved, or at the request of the Republic. If involved in an incident, Jedi would inform the CSF of that but would not always give full explanations of their involvement. Up until the end of the Republic, the CSF had a standing order to assist Jedi in any duties they may require. CSF officers often felt resentful when the Jedi did involve themselves, even if the CSF needed their help."}, {"tag": "p", "text": "However, certain Jedi, specifically the Jedi Peacekeepers willingly assisted the CSF in crime fighting on Coruscant instead of simply taking over. They would provide resources and support outside the abilities of the CSF, such as using the Force to study crime scenes and when conducting interrogations. The Temple district was nominally under the protection of these Jedi and the Temple Security Force. The Jedi, however, relied on the CSF for various purposes as well. All information the Jedi had on criminal activity in the Republic would be accessed from the CSF database in the Jedi Temple Analysis Rooms. As such, the Jedi relied on the CSF for information on crimes, criminals, and case files not only Coruscant, but throughout the galaxy. When warrants were issued by the Jedi on subjects, they relied on the CSF to assist in locating and arresting the wanted persons."}, {"tag": "p", "text": "A former Jedi by the name of Lexia Ginorra was well known to the CSF. In the waning years of the Republic, she had renounced her ties to the Jedi Order and continued life in the underlevels of Coruscant as a vigilante. However, since she put an end to a significant level of gang violence there, the CSF did little to stop her. Instead, in many of the tales that CSF officers told amongst themselves and to others, she became the protagonist and gained the famous yet inaccurate title of \"the Sith.\""}, {"tag": "p", "text": "The end of the Clone Wars drastically changed the relationship between the CSF and the Jedi. The CSF disliked Supreme Chancellor Palpatine for his politics, his handling of the war, and his restriction of the resources available to the CSF. However, most CSF officers saw the Jedi as traitors for attempting to overthrow the institution of the Supreme Chancellor, and thus had no qualms assisting in the hunt for Jedi during Order 66. Nevertheless, some turned a blind eye to any Jedi they discovered. In the time of the Galactic Alliance, some CSF officers continued to resent the need of Jedi assistance, as they had in the days of the Republic."}, {"tag": "h4", "text": "Senate Guard"}, {"tag": "p", "text": "During the Old Republic, the CSF was charged with ensuring the security of the Senate Building, a task they shared with the military in the form of the Senate Security Officers, or SSOs. As time went on the CSF was removed from this task and the duties of the SSOs developed into the long standing tradition of the Senate Guard. Though originally used strictly as a bodyguard detail, the role of the Senate Guard gradually expanded from protecting senators and other government officials to becoming a secondary police force for Coruscant. Traditionally, there was continual friction between the Senate Guard and the CSF. This began with the Senate Guard's expansion into police services which lured away the CSF's best cops as well as trainees from the CSF's police academies. Later, in demand for greater abilities to protect the senators and government officials, the Senate Guard placed the entire surrounding Legislative District under its authority leading to open hostility between them and the CSF."}, {"tag": "p", "text": "Never the less, the CSF still depended on the support of the Senate Guard. As the Senate District is under the control of the Guard, they were adapt at not only the protection of the senators, but also in intelligence gathering, patrol duties, and investigative techniques. It was well known that the Guard had access to the best forensic equipment available on the capital planet. Senate Commandos would frequently be called on to function as a special tactical force in extreme situations and it was not uncommon to see a Jedi as well working with the Guard detachment. The Guard also assisted the CSF with uprisings that occurred in the lower levels."}, {"tag": "p", "text": "By the time of the Clone Wars, the Guard had become a legacy systems with whole families working as Guards for generations. Corruption became common and the effectiveness of the Guard had decreased. The ability of the Guard to conduct independent and honest investigations had been put into such a question that when a homicide occurred in the Senate, the CSF was called to conduct the investigate with the Guard serving in a support capacity. Later, with the formation of Palpatine's Red Guard, the authority of the Senate Guard was further diminished. With the formation of the Empire, the Guard was disbanded and its members joined other security forces."}, {"tag": "h4", "text": "Coruscant Guard"}, {"tag": "p", "text": "When the Clone Wars erupted, the Grand Army of the Republic came into existence to serve the Republic's defense needs. With this clone army came a specialized division composed of clone shock troopers. These units were trained on Coruscant and when the war began, they were formed as the Coruscant Guard. The troopers were stationed at important government buildings and other vital infrastructure areas to protect them from sabotage. As the war went on, the Guard's presence and authority increased and they began to take on a larger role of providing police services. Riot clone troopers, specially trained in crowd control, were garrisoned across Coruscant in case of trouble and also assisted the CSF with fugitive chases."}, {"tag": "p", "text": "The Coruscant Guards, like most clone forces on Coruscant, maintained a good relationship with the CSF. Though the clones had superior training to the CSF cops, they worked better together than the CSF had with the Senate Guard. As the war drew to a close, it was not uncommon to see troopers on patrol with CSF officers. When the Empire was declared, the Coruscant Guards occupied the Senate Building and CSF officers assisted with securing the capital."}, {"tag": "p", "text": "Later, the Guard became the primary law enforcement agency for Coruscant. Renamed the Imperial Guard, though still referred to as the Coruscant Guard, they were placed in primary control of investigations and policing with the CSF in a support capacity. This did not go well with the CSF and it caused constant friction between the CSF and the Imperial government. In response to their downgraded status, many CSF officers became spies against the Empire."}, {"tag": "h4", "text": "Galactic Alliance Guard"}, {"tag": "p", "text": "The Galactic Alliance Guard (GAG) was designed to fill a void between the military and Coruscant's police in combating terrorism. Members of the GAG were recruited from the CSF, the military, and the intelligence services. For the former cops, it became immediately apparent there was a difference in philosophy in how the GAG should operate, especially during interrogations and raids. Though the CSF was responsible for such issues as riot control and tracking criminals or other suspicious persons, information would be handed over to the GAG for assessment."}, {"tag": "p", "text": "During GAG raids, the CSF would assist by providing officers and equipment to secure the area as well as clearing out innocent civilians before an attack. The GAG also depended on CSF for intelligence gathering on suspected terrorists and any other information gathered from other agencies. Initially, the CSF officers, mostly originating from the Anti-Terrorist Unit, were enthusiastic about tackling the issue of terrorism on Coruscant with an expanded budget and an expanded ability to take action. But as time passed and the methods of the GAG became more and more brutal, the CSF cops and other top-of-the-line operatives left the GAG. Those cops that remained passed on information to the Jedi to help bring the GAG down."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Old Republic"}, {"tag": "h4", "text": "Beginnings and Sith invasion"}, {"tag": "p", "text": "The Coruscant Security Force was formed by the Coruscanti government and was one of the oldest planetary police forces in the Republic. Though tasked with the responsibility of keeping the peace on a planet with a massive population, the CSF maintained a reputation of effectiveness, diversity in its officers, and in general, positive relations with the population of Coruscant. Continuous warfare between the Republic and several enemies, including the Mandalorians during the Mandalorian Wars and Revan's Sith Empire during Jedi Civil War, had drained the Republic's resources. While Coruscant was placed under tight security in fear of external threats, the government lacked the necessary manpower to properly police the planet itself. As such, various corporations provided private security guards for patrol duties to supplement the government's police and military troops. The move, while deemed necessary, raised concerns and questions from many Republic citizens."}, {"tag": "p", "text": "Several centuries later in 3653 BBY, the CSF were the first to come in contact with the reformed Sith Empire when the Sith began the Sacking of Coruscant. At the time of the attack, CSF's Orbital Security Station Six was in charge of monitoring starship traffic around Coruscant. An all-clear report was given to Coruscant Control by the Twi'lek female Femi, a CSF agent assigned to Orbital Station Six. Following the report, a Sith armada entered Coruscant space, and the CSF security station requested clearance codes from the fleet, unsure of who they were. The Sith fleet was commanded by the Sith Lord Darth Angral, who ordered the fleet to destroy the station, killing the CSF agents on board in the process. The Sith then began their invasion of the planet."}, {"tag": "p", "text": "A hijacked Republic transport was used to attack the Jedi Temple and disable Coruscant's security grid, allowing the Sith to bombard the planet. Within minutes, communications, military, and security installations were destroyed. A dropship landed at the Senate Building, where the Sith were met with resistance from CSF officers, Republic Special Forces Division Lieutenant Harron Tavus, and Jedi Master Orgus Din, but they were unable to prevent the Sith from storming the Senate Building and killing Supreme Chancellor Berooken. A small group of security forces rallied a defense but were quickly overwhelmed. The Sith occupied key sections of Coruscant; however, the majority of the lower levels remained firmly under Republic and CSF control though the security forces were shocked and disorganized."}, {"tag": "p", "text": "The Sith armies did not have the numbers to press the attack or to maintain an extended occupation. It was noted later on by the Jedi that had security forces been able to launch a counterattack, while causing a significant toll on the civilian population, it would have been successful. Thus the Sith quickly withdrew from Coruscant, but not before they had used their occupation of the planet to force the Senate into the Treaty of Coruscant, starting the military and economic Cold War between the Republic and the Sith Empire. After signing the treaty, the Galactic Senate was forced to make difficult decisions on prioritizing the Republic's resources. Only those parts of Coruscant that were vital for the running of the government and for trade were rebuilt and large parts of Galactic City remained in ruins. The lack of resources fell heavily on the CSF which was pulled back from various sectors to protect the Senate Building and other vital government and infrastructure areas."}, {"tag": "h4", "text": "Picking up the pieces"}, {"tag": "p", "text": "In the aftermath of the Sacking of Coruscant, the CSF had to deal with not only the limited resources, but also the loss of life from the invasion and the burnout from the years following it, all of which took their toll. In the years after the invasion as the Republic struggled to rebuild, the CSF was constantly engaged in riot control only to see those areas fall to major criminal syndicates. The inability to prevent the takeover by gangs embittered many of the CSF's young recruits. Veteran cops were equally frustrated, as they had been trained to investigate crimes and track individuals, not fight gangs for territory block by block."}, {"tag": "p", "text": "The territory controlled by the Black Sun crime syndicate was especially dangerous, and the CSF rarely ventured into it. Traffic in the area was erratic and dangerous with illegal craft flying everywhere. When the CSF did enter the Black Sun area, they regularly ended up in desperate fights over territory, even over just the landing platforms. Officers Berric, Kennerlo Erlo, Tomin-brel, and Shassa were stationed in the area to provide armor and weapons. In response to the takeover by Black Sun, several ex-soldiers formed a militia, the Justicars' Brigade. They claimed to be responsible for peace and order, but their methods were brutal, and they were subsequently seen as bloodthirsty and a law unto themselves. Coruscant's government declared them illegal, but the Justicars cut themselves off from the outside world and enforced a heavy-handed marshal law in their territory. Initially the CSF had enthusiastically supported the Justicars, intending to work together to restore order. However, with their brutal methods revealed, the CSF began investigating the Justicars and sent in undercover agents to disrupt their activities."}, {"tag": "p", "text": "Debates over how to deal with the problems of retaking areas from gangs were common. Many advocated that the CSF be trained as a military unit and given military-grade equipment, arguing that without it, the CSF would be overwhelmed. Few in the CSF itself were for increased militarization, however—their goal was to keep the peace, not fight a war on the streets of Coruscant more than they already were. In an attempt to regain control over the areas dominated by the Black Sun, the Republic Strategic Information Service assisted the CSF in monitoring areas known for criminal activity with the hopes that tracking Black Sun's slavery ring would also yield information about the Sith Empire."}, {"tag": "h4", "text": "Struggles and investigations"}, {"tag": "p", "text": "Around 3643 BBY, when plans of long-forgotten secret tunnels running under Coruscant were stolen by the Justicars, CSF Lieutenant Doorn was tasked with recovering them. An individual offered their assistance to Doorn. Happily accepting, Doorn sent the individual to a female agent of the Strategic Information Service, Fieler Dan. Though Dan informed the individual of the plan's location, she requested to be able to copy the plans to give to her daughter. They would then be used to assist in bringing food and supplies to Coruscant's needy. After they infiltrated the Justicars' stronghold and retrieved the plans, the individual let Dan make a copy of the plans. The individual then returned them to Doorn, who accepted them gratefully. Though the CSF did not try to retake the Justicar territory by force, they conducted undercover operations to disrupt Justicar activities. CSF Agent Jaffkee was sent to infiltrate the Justicars' Territory and set up listening posts. This allowed the CSF to monitor Justicar conversations."}, {"tag": "p", "text": "The individual also assisted CSF Officer Anstiss. Anstiss felt she had an enemy at CSF Headquarters since she had been assigned the task of arresting a brutal Houk criminal named Gambo by herself. However, Gambo had resisted and beaten her up. Anstiss asked the individual for help in arresting the suspect. The individual entered the Dealer's Den cantina where Gambo was staying and convinced him to surrender to Anstiss. Gambo did so and was escorted back to CSF Headquarters."}, {"tag": "p", "text": "When several of the Jedi Order's prized noetikons went missing, the order sent a Jedi Consular to retrieve the stolen noetikons. During the search, the Jedi discovered that a Gand criminal who was arrested by CSF Officer Alec Efran was connected to the thefts, specifically that of the Noetikon of Science. The Jedi met Efran, who was holding the Gand, at the Old Galactic Market CSF barricades. There, the Jedi questioned the Gand, leading to the retrieval of the missing Noetikon of Science."}, {"tag": "p", "text": "Around that time, CSF Lieutenant Semphi Talen was assigned to investigate a break-in at the First Bank of Coruscant. Two individuals were caught attempting to crack open a safety deposit box belonging to the Alderaanian noble House of Ulgo. The robbers claimed to be Ulgo cousins, trying to reclaim \"valuable family heirlooms.\" The deposit box contained items smuggled from the Mid Rim. Lieutenant Talen assumed the Ulgos were planning to sell them on the black market to start raising more supporters for their cause. As Alderaan had seceded from the Republic, the case was a legal gray area. The Senate authorized for the safety deposit box to be placed in Jedi custody and the matter turned over the Order, much to the relief of Lieutenant Talen."}, {"tag": "p", "text": "The CSF also investigated an airspeeder crash in Coruscant's upper levels that killed Zorin Krasul, Senator of Anaxes. The CSF refused to comment on the cause of the crash. Senator Krasul, incidentally, had been at a senate hearing where he had ordered another senator, Grom Zian, arrested by CSF Senate Guards for treason."}, {"tag": "h4", "text": "Fighting the Merchants' Guild"}, {"tag": "p", "text": "Riots that had occurred in the Old Galactic Market had left the area vulnerable as the CSF pulled back their resources. Taking advantage of the situation, the Migrant Merchants' Guild took over the area. While on paper it officially advocated for the refugees, the Guild was a well organized gang involved in money laundering, extortion, bribery, and goods smuggling resulting in clashes with the CSF who tried to keep the peace."}, {"tag": "p", "text": "The Guild's presence prevented the CSF from assisting citizens with various complaints that were not significant enough to start a street battle over. One such case invloved Nik Deleru and his mate Ria. Deleru reported to Officer Mal that Ria had been taken by the Guild to become a dancer. However Mal was unable to pursue the investigation as Ria was in deep in the Guild's territory. An individual was able to locate Ria and discover that she had voluntarily left Deleru as he had mistreated her."}, {"tag": "p", "text": "Around 3643 BBY, the Migrant Merchants' Guild attempted to blackmail Coruscant's Senator Vanara Kayl over her use of their funds to pay for support in the election. In response to the threat, the Senator sent the CSF to move out the Guild from the Old Galactic Market as well as to prevent them from carrying out an attack on the skylanes around the Senate Building. The CSF Chief of Security, Captain Winborn, personally led the attack on the Guild with several officers and security droids. The CSF were assisted by an individual who not only was able to neutralize several dozen of the Guild thugs, but also prevent them from accessing the secure skylane infrastructure. After the fight, the individual found a recording of Senator Kayl arguing with a leader of the Merchant Guild, exposing her illegal actions during the election. Feeling the issue was above his head and a political minefield, Winborn asked the individual to confront the Senator with the information."}, {"tag": "p", "text": "The CSF was brought in to investigate the theft of valuable items from Senator Doli-bur Barc. The investigating officer, Captain Denal-zon, was able to determine that the Migrant Merchant Guild had been behind the theft. Denal-zon also discovered that the valuable items were in fact computer chips meant to be used in slave collars. Since the existence of the collars violated Republic Law 44-12 and were also not to be found, the investigation subsequently stalled. Later, an individual was commissioned by one of Senator Barc's assistants to investigate the theft. After speaking with Denal-zon the individual was able to recover the computer chips from the Migrant Merchant guild. The individual than turned the chips over to Denal-zon who destroyed them since they were against Republic law."}, {"tag": "h4", "text": "Battling Black Sun"}, {"tag": "p", "text": "In the years after the Sacking of Coruscant, Black Sun had quickly established itself as a major force especially in Coruscant's lower levels. Though the CSF was underfunded and under equipped to properly push Black Sun back, attempts were still made to shut the crime syndicate down, one step at a time. One such instance involved CSF Officer Stansun. He had discovered a medical clinic that was a front for Black Sun to conduct surgeries altering the appearances of wanted criminals. Stansun was assisted by an individual who infiltrated the clinic. The individual then destroyed the medical droids present at the clinic and removed all the records of the clinics patients. The records gave Officer Stansun the names of all those who had had face altering surgery and their present appearance."}, {"tag": "p", "text": "As reconstruction efforts continued, Coruscant was flooded with refugees whose homes were destroyed during the war. As the refugees scavenged for food, Black Sun booby trapped supply boxes to explode when a person would try to open it. Though most of the CSF had pulled out from those areas, Captain Theraguin continued to work in the area attempting to help the refugees by disarming the bombs. However, he was outnumbered and unable to keep up with Black Sun's terrorism campaign. A little later, an individual offered their assistance in disarming the bombs and Theraguin gladly accepted. The individual was able to locate and diffuse the explosives as well as take out the Black Sun members responsible for the acts."}, {"tag": "p", "text": "As Black Sun's power grew, the CSF began operations to infiltrate the organization. Agent Folaris was in charge of a network of spies, infiltrators, and snitches who reported on Black Sun activities. However, Black Sun planned to clean house and was able to obtain a list of the snitches and spies within its ranks. Folaris requested assistance from an individual to retrieve the list. The individual was able to locate the list and hand it over to Folaris. List in hand, Folaris contemplated selling it but was convinced instead to hand it over to her superiors."}, {"tag": "h4", "text": "Securing the Planet Prison"}, {"tag": "p", "text": "While jostling for advantage in the Cold War, the Republic government began secretly building weapons in expectation of an inevitable renewed war with the Empire. One of the weapons included the Planet Prison, a superweapon designed by Doctor Tarnis to trap all occupants of a planet on its surface. However the data files for the Planet Prison along with valuable military hardware were stolen around 3643 BBY. Republic Strategic Information Service Agent Galen was brought in to head the investigation along with members of the CSF. After the investigators found that a Rodian smuggler named Vistis Garn was behind the theft, a Jedi Knight was charged with recovering the plans. They tracked Garn to his hideout in the Migrant Merchants' Guild territory and recovered the data files."}, {"tag": "p", "text": "While the Jedi recovered the files, Doctor Tarnis was kidnapped by members of Black Sun. The Jedi Knight and Padawan Kira Carsen were sent with a detachment of CSF agents to the Coruscant Spaceport Docking Bay 84 to rescue Tarnis. Though somewhat outnumbered, the Jedi and CSF agents were able to kill or arrest the Black Sun members. They discovered that the Black Sun members had been a distraction and that Tarnis had really been taken deep into Black Sun territory."}, {"tag": "p", "text": "SIS Agent Galen offered the Jedi the assistance of a special tactical unit of CSF and Republic soldiers under the command of CSF Sergeant Nidaljo. The unit had been able to battle their way into the Black Sun territory and set up a barricade. However, the fight had been costly and the unit had lost four men and at least seven were wounded with the remaining forces now surrounded by Black Sun's soldiers. Nidaljo and his men had lost hope for recovering Doctor Tarnis and surviving when the Jedi arrived to assist. Together, the tactical unit and the Jedi were able to break through Black Sun's forces. They found Salarr, leader of Black Sun, talking with Doctor Tarnis via a holocam. Tarnis was in actuality a Sith Lord who had been manipulating the situation from the beginning and was in league with Black Sun. In the ensuing confrontation, Salarr was killed. Though a devastating blow had been struck on Black Sun, it was not enough to hold on to the territory and the CSF forces withdrew. The Jedi meanwhile continued on in their hunt for Lord Tarnis."}, {"tag": "h4", "text": "Intercepting smugglers"}, {"tag": "p", "text": "Around 3643 BBY, the smuggler known as Voidhound was stopped by the Customs Enforcement Division at the Coruscant Spaceport. The customs droid noticed an error in the smuggler's identification protocols and the cargo logs. The customs droid was about to request assistance from a customs enforcement agent when the smuggler uploaded false data that convinced the droid the smuggler was really named Admiral Numinn. The customs droid approved the smuggler's entry into Coruscant."}, {"tag": "p", "text": "In 3640 BBY, Strategic Information Service Agent Theron Shan sent the smuggler Teff'ith to Coruscant to give vital information about his mission to Supreme Commander Jace Malcom and Jedi Grand Master Satele Shan. As she entered Coruscant's airspace, Teff'ith was contacted by Coruscant Flight Control 473 who directed her to land at Diplomatic Spaceport 27-B. Upon her arrival at the spaceport, Teff'ith was checked and searched by CSF guards. To them, the shoulder wound Teff'ith had sustained before leaving for Coruscant and the fact that she was not a Jedi, did not match with the fact that she had been flying a Jedi craft. Teff'ith continued to insist that she wanted to speak with Grand Master Shan but the guards simply took her into the spaceport office. However, the guards were unhurried. In frustration, Teff'ith grabbed the blaster pistol side arm of one of the guards. His partner ordered her to drop the weapon and release her hostage but she refused. Demanding he exit the spaceport office, the partner retreated outside and Teff'ith barricaded herself inside with the other guard. She insisted he contact Grand Master Shan which he set about attempting to do. Meanwhile his partner had called for backup and within five minutes over twenty CSF officers had responded to the scene, constructing a cordon around the office. The guard inside was able to contact Grand Master Shan who agreed to come to the spaceport. When she arrived, Teff'ith surrendered and informed her of the vital information."}, {"tag": "p", "text": "Shortly after the defeat of Revan, Lylos Tannon was investigating a cybernetics scam run by Doctor Zeke and his assistant Bolgm. Though she tracked their activities for weeks, she was unable to catch them in the act and enlisted the help of SIS Agents Theron Shan and Jonas Balkar. During a sting operation in the Dealer's Den, Tannon accused Shan of cheating at Sabacc which brought the attention of Bolgm since Shan had cyber implants. Though Shan was at first unaware of Tannon's identity, he went along with the ruse until Doctor Zeke showed himself. Tannon then distracted Bolgm and Shan charged at him before Tannon knocked the criminal unconscious with the butt of her blaster. Shan meanwhile chased after Doctor Zeke and was joined by Balkar. Shan tackled the doctor and Tannon was able to place him in cuffs."}, {"tag": "h3", "text": "The Galactic Republic"}, {"tag": "h4", "text": "Politics and murders"}, {"tag": "p", "text": "Millennia later, in 76 BBY, the CSF took custody of the pirates Lorian Nod, a failed Jedi Knight, and Eero Iridian from Jedi Knight Dooku and his Padawan, Qui-Gon Jinn. The pirates had attacked Senator Blix Annon and were captured on Von-Alai by the Jedi, and they were then transported to Coruscant for trial. Nod was incarcerated for his crimes, but he helped the CSF with problems they were having inside the prison, serving as an informer. In gratitude for his assistance, Nod was granted early release from prison."}, {"tag": "p", "text": "In 52 BBY Senator Vidar Kim of Naboo was assassinated while riding in an airspeeder with his son, Jedi Knight Ronhar Kim. The assassin approached from behind on a speeder bike and killed the senator. Jedi Kim jumped from the speeder and knocked the assassin to the ground. While Kim attempted to interrogate the assassin, the being produced a hypodermic needle and injected himself, dying instantly. The CSF initially investigated the murder with little success. Later the Judicial Department as well as the Jedi Order and Senate Investigative Committee attempted to unravel the mystery but with equal little success. Unknown to them, Palpatine had ordered the hit on Kim to allow him to become Naboo's senator. Three months later, the Senate held a major vote on whether to allow several planets who were under the Trade Federation's control to enter the Republic and receive senatorial representation. In anticipation of the event, the CSF cordoned off a large area around the Senate Building including from Level 55 to Level 106. They also deployed snipers, security cam droids, and bomb detecting droids."}, {"tag": "p", "text": "After the vote, the CSF were summoned by two Jedi Knights to investigate a grisly crime scene at the headquarters of the Order of the Canted Circle in the Fobosi District. Upon their arrival they discovered dozens and dozens of dead including two Echani warriors believed to be bodyguards, twelve Muuns of the InterGalactic Banking Clan, and triple that number of Maladian assassins dressed in the Canted Circle Order's robes who had been killed by blaster fire and traumatic amputations. The Order's members whose robes had been borrowed, were bound and unconscious and lay in various locations. The amputated remains of the Maladians were so scattered that the CSF detectives initially surmised an explosive had detonated though no explosive evidence could be found. The Jedi who had notified the police, did not reveal why they had been at the location and why they had an interest in the case."}, {"tag": "p", "text": "A second major crime scene at the Malastare embassy also had the CSF engaged. There, Senator Pax Teem of Malaster along with several guest had been killed and the embassy completely burned. The CSF was able to determine that due to numerous amount of blood discovered at the scene of the fire, the victims had been killed first before the setting of the fire. This led the police detectives to believe that the mass killings and fire were a hit orchestrated by organized crime. Unknown to the CSF, the scene at the Chanted Circle headquarters was the result of Senator Teem hiring the Maladian assassins to kill Hego Damask, the alter ego of Darth Plagueis. The assassination had been interrupted by Palpatine and Sate Pestage who together with Plagueis had killed the Maladians. Palpatine, filled with rage, had gone after Senator Teem, invading the residence and massacring the security guards and the dinner guests before setting Teem on fire along with the rest of the building. The sudden activity of the dark side of the Force had alerted the Jedi who sent two members of the Jedi Council to scene. However, the Jedi, as before, refused to clarify their presence and interest in the case. With the Jedi, the Order of the Canted Circe, InterGalactic Banking Clan, and the Gran Protectorate remaining silent, the case stalled despite attempts by the Senate Investigative Committee to continue the investigation."}, {"tag": "h4", "text": "Scientists, Sith, and Jedi"}, {"tag": "p", "text": "In 42 BBY, the Bothan Yur T'aug was a captain in the CSF. He was called in to investigate the murder of Fligh, who had been found in the Lane of All Worlds, an alleyway next to the Senate Building. Fligh was a petty thief but also an informant for Jedi Master Qui-Gon Jinn. T'aug discovered what he thought was an interesting detail: Fligh's body had been drained of blood. Didi Oddo, a friend of Jinn, informed the Jedi of Fligh's murder. When Jinn and his Padawan, Obi-Wan Kenobi, went to the crime scene and asked to see the body, T'aug consented. After some questioning by the Jedi, T'aug reluctantly revealed information about the case."}, {"tag": "p", "text": "On Simpla-12, the body of Ren S'orn was discovered, and T'aug was sent to investigate. As S'orn's body had likewise been drained of blood, T'aug decided to drop the case. When he was confronted about this by Kenobi, the Captain openly refused to cooperate with the Jedi. He did, however, reveal that the case had been dropped at the request of Senator Uta S'orn, Ren S'orn's mother. When questioned by Kenobi, the Senator said that she was afraid of what T'aug would find and that she simply wished the matter to go away. The Jedi later discovered that Ren had been murdered by Jenna Zan Arbor, a scientist who had conducted experiments on Ren before killing him. Fligh had faked his own death in order to escape to Belasco after he had stolen Senator S'orn's datapad."}, {"tag": "p", "text": "In 32 BBY, the CSF came into conflict with the Dark Lord of the Sith Darth Maul when he was pursuing a group through the Crimson Corridor that included Jedi Padawan Darsha Assant and information broker Lorn Pavan, as they were in the possession of a special holocron containing information about the ongoing blockade of Naboo. The Dark Lord, wanting to quickly gain a means of transportation, hacked into Coruscant's security dispatch system, sending out a call reporting a droid banking crime. Two CSF officers, accompanied by a police cruiser backup unit, responded to the call. However, Darth Maul disabled the PCBU by jumping on top of it and destroying the droid with his lightsaber. The officers turned their speeder bikes around, only to be killed by the Sith, who sliced through their armor with his weapon. The Sith then took one of the officer's speeders and continued his pursuit of Pavan and Assant."}, {"tag": "p", "text": "The CSF later investigated the incident but was unable to explain how someone could jump fifteen feet into the air to reach the PCBU without getting shot. Kenobi was present at the investigation while searching for the missing Assant. He discussed the matter with the two investigators, a Mrlssi and a Sullustan, promising the assistance of the Jedi Order. However, the issue was pushed aside upon his return to the Jedi Temple, as he was sent to respond to the Trade Federation's blockade of Naboo. It was also at that time that the CSF investigated the death of a Hutt nightclub owner and several of his thugs, who had all been killed by Maul in an attempt to find Pavan. A fragment of the report would be found years later by former Imperial aide, Haninum Tyk Rhinann."}, {"tag": "h4", "text": "Death sticks and Jango Fett"}, {"tag": "p", "text": "During the time of the Invasion of Naboo, the CSF had several bounties open for various cases. One was for Regg Kuuga, a male Draag from Ninzam VI. Kuuga made a habit of stealing medical frigates, scrapping them for parts, and then transforming them to attack tourist ships. Another was on Panza Hondi, a Guineo crime lord who lived in the industrial district. While working with crime lord Groff Haugg, Hondi had brutally murdered an off-duty officer. The Gran Ninopas Orocc was wanted for disrupting a meeting of the Galactic Senate; Orocc had managed to get into the Senate Building and smear Cornesian wax across the base of several hover platforms, resulting in the injury of three senators. There was also a bounty open on Kiatha, a male Jawa who had had mishandled his Ronto, resulting in the creature causing extensive property damage. All of those bounties were claimed by the Mandalorian bounty hunter Jango Fett."}, {"tag": "p", "text": "During his time on Coruscant, Fett collected several bounties that had been issued by various organizations and cartels for the capture or death of various CSF officers. Officer Loowil Galt, who had arrested a contractor resulting in the collapse of a major deal between the contractor and the Techno Union. In response, the Techno Union placed a bounty on Galt's head. Fett was able to locate and kill him. Captain Max Ryko received a bounty for attempting to blackmail a senator; Captain Lye Rooker, for not paying back a loan; Officer Mill Timmer, a corrupt cop who took too much than what he was allotted and was killed by Fett. And finally Fett assassinated Officer Raim Tibekk for his part in a raid in the Entertainment District where Tibekk killed a Hutt Cartel operative."}, {"tag": "p", "text": "Around the same time, the sale of death sticks on Coruscant rose dramatically as the Dug Sebolto expanded his cartel into the Coruscant system with the help of several Grans—including Kram Ayuk, Byhdee Kees, Seed Machees, and Leek Onees—who smuggled the death sticks into Coruscant. The CSF became aware of Sebolto's smuggling activities and placed bounties on all four of the Gran's heads. The bounties were later collected by Fett. While the CSF was investigating the death stick distribution network, they were called to respond to a situation at the apartment of Senator Connus Trell. When they arrived in a VAAT/e police craft, they found Fett interrogating Trell while holding him over the balcony of the Senator's apartment. Fett had learned earlier from Jervis Gloom, a death stick dealer also wanted by the CSF, that Trell was involved in the death stick scheme and Fett wanted Trell's contacts. The CSF officers demanded that Fett release the Senator, but Fett did so by dropping the Senator to his death. The bounty hunter then fired on the VAAT/e, destroying it and escaping the scene."}, {"tag": "h4", "text": "Routine investigations"}, {"tag": "p", "text": "In 22 BBY, Detective Constable Dherik Rule was on call in the Taung Heights district when a women by the name of Latika Garboren called to report that she had discovered a Sith emblem in her pastebread. Rule responded to the scene but in the end dismissed the call as their had been no evidence of any crime."}, {"tag": "p", "text": "Soon thereafter, CSF investigators responded to the scene of an airspeeder collision in the Bindai District. There they discovered the dead body of Senator Nemrileo irm-Drocubac of Tanjay IV. The senator had been traveling in his airspeeder when it collided with a delivery truck. Upon investigating the scene further, investigators came to the conclusion that there had been an internal guidance error. The police did not expect to file any charges in the incident and the senator was laid to rest."}, {"tag": "p", "text": "Later that year, Senator Padmé Amidala of Naboo became the victim of an attempted assassination. At the request of Supreme Chancellor Palpatine, the Jedi Council assigned Jedi Knight Obi-Wan Kenobi and his padawan, Anakin Skywalker, to protect the Senator. However, Skywalker felt that the job of protecting the Senator should be the job of the local security forces so that they could investigate the assassination attempt itself."}, {"tag": "p", "text": "At that time, Officer Wets Tranoj investigated the theft of Senator Simon Greyshade's XJ-6 airspeeder. The speeder was discovered thirty minutes after it had been stolen from a Senatorial Quarters parkway. The police were notified of the theft by a security system after seeing a young Human male leap into the vehicle and tear away from the parkway. As the CSF was looking at the found speeder, a youth came out from the Snapping Septoid entertainment facility. Seeing the CSF police officers, the youth started running away from them and yelling. Tranoj arrested the youth, Reymet Autem, and charged him with the theft after he admitted that he had been at Greyshade's quarters. This was somewhat of an embarrassment for all concerned because not only was Reymet the son of Senate Guard Sagoro Autem, but Sagoro was the designated bodyguard of Greyshade, the owner of the stolen speeder."}, {"tag": "p", "text": "The speeder again went briefly missing from the crime scene while the CSF processed Reymet Autem. However, the speeder was found returned to its original parking spot at the Senatorial speeder barn. Tranoj explained it as an error by rookie police officer overlooking some paperwork. This allowed its use by the Jedi Anakin Skywalker and Obi-Wan Kenobi—who had borrowed the speeder to chase down the assassin Zam Wesell after she attempted to again assassinate Senator Padmé Amidala—to go unnoticed."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Clones and Jedi take action"}, {"tag": "p", "text": "In 22 BBY, the Clone Wars broke out between the Republic and the Confederacy of Independent Systems with the Battle of Geonosis. As part of the increasing security changes, shock troopers from the Grand Army of the Republic were stationed on Coruscant and assigned to the Coruscant Guard. Though their primary responsibilities were to provide a military presence for the capital and to protect important government buildings, the shock troopers quickly took on a larger role of providing police services. Shock trooper Guards were involved in such operations as the raid on Ziro the Hutt's Coruscant club and the Senate hostage crisis."}, {"tag": "p", "text": "In 22 BBY, the CSF responded to a hostage situation at the Galactic City Spaceport. Korunnai terrorists under the leadership of the terrorist Nuriin-Ar seized the spaceport and took several hostages, including Mon Calamari Senator Meena Tills and his aide, Vun Merett Jai. The group was tired of continual Republic interference in Haruun Kal affairs, and they demanded that the Republic immediately withdraw from the planet or they would detonate several explosives. Though Lieutenant Dovel of the CSF took charge of the response forces as the incident commander, the Senate Guard also arrived with a contingent claiming jurisdiction as one of the hostages was a senator. To assist with breaching the spaceport, the clone commando unit Omega Squad of the Republic military was dispatched to the scene. Jedi Master Kaim was sent in to attempt to negotiate with the hostage takers; however, he was killed, and his body, thrown outside, was rigged with explosives. Before the bombs detonated, clone commando RC-8015 \"Fi\" jumped onto the body. His heavy armor saved both his life and that of the CSF police officers near him. When Omega Squad subsequently stormed the building, the terrorists were all killed and the hostages were saved. A explosives disposal officer discovered that the bombs had in fact been fakes. Fi's action was never forgotten by the CSF officers; to them, Fi became highly regarded. They frequently asked after him and shared his stories with each other and anyone who listened."}, {"tag": "p", "text": "On one occasion, the CSF was called in by Jedi Master Tera Sinube—an expert in the workings of Coruscant's criminal underworld—to assist in the investigation of the murder of Trandoshan assassin Nack Movers. Upon their arrival, they found that one of the suspects, Cassie Cryar, had escaped, with Jedi Padawan Ahsoka Tano in pursuit. The other suspect, Ione Marcy, escaped as well upon the CSF's arrival, but not before Sinube placed a tracking device on her. Both suspects were eventually traced to a train station, where they were confronted by the CSF and the Jedi. Marcy was apprehended, and after a brief attempt at taking hostages, Cryar was arrested as well. The incident resulted in the dismantling of two CSF police droids by Cryar when she used Tano's lightsaber to try to escape."}, {"tag": "h4", "text": "Intrigues and murders"}, {"tag": "p", "text": "CSF forces were patrolling the Coruscant underlevels when the Duchess of Mandalore, Satine Kryze, was found next to the body of a Republic Ministry of Intelligence agent, Davu Golec. Although a Death Watch assassin had murdered Golec, the police probe that found Kryze noticed that she had a weapon and identified her as a suspect. The Duchess fled, resulting in a chase by the CSF and Coruscant Guard troops as well as the Death Watch assassin himself. Kryze was able to elude them by tricking them into believing that she had escaped in an airspeeder in a different direction. While the police kept searching for her, she met with Jedi Master Kenobi in Coruscant Park and gave him a video concerning Republic aid for the Mandalore system. With the information in secure hands, she surrendered to Senate Guards at the Senate Building. The video was played for the Senate, resulting in the Duchess's exoneration and the resolution of the situation."}, {"tag": "p", "text": "In 22 BBY, Lieutenant Tan Divo was called to investigate the kidnapping of Chi Eekway and Che Amanwe, the daughters of the Pantoran Chairman Notluwiski Papanoida. However, in their search of Papanoida's apartment, the CSF failed to realize that Papanoida's Icon of the Moon Goddess had been misplaced and so missed the trace amount of blood underneath the statue. After the CSF left the apartment, Chairman Papanoida discovered the blood when replacing his idol. An analysis of the blood showed it to be that of Greedo, a Rodian bounty hunter from Tatooine. Papanoida and his son, Ion, recovered Chi Eekway on Tatooine, and Che Amanwe was found aboard a Trade Federation battleship by Senator Riyo Chuchi and Jedi Padawan Tano, who had been instructed by her Master, Anakin Skywalker, to assist unofficially in the investigation since the Jedi could not officially interfere with a matter delegated to the local police."}, {"tag": "p", "text": "In 21 BBY, during a political debate in the Senate over a Republic military spending bill, several Republic senators were attacked in an attempt at intimidation. One attack was against Senator Padmé Amidala by the bounty hunters Chata Hyoki and Robonino, whom the Separatist Head of State Count Dooku had hired to kill her. Two CSF police droids, seeing Amidala being attacked outside of Senator Christo's apartment, interfered, although the thugs shot them and destroyed them by beating their heads on the ground. Amidala escaped in a speeder, with the two assailants in pursuit. Amidala was able to shake off Robonino and Hyoki as she fled past two police droids holding a position in a Coruscant police speeder. They noticed the speeding Amidala and also took after her, identifying her speeder was officially stolen."}, {"tag": "p", "text": "Several other police speeders joined the chase and surrounded the senator, stopping her for the theft of the speeder. Amidala was released from their custody after the situation had been explained, but the two thugs had already escaped. Later, Hyoki and Robonino attacked Alderaan Senator Bail Prestor Organa in the Senate Building parking area. Organa called for help, and his Alderaan Guard engaged the attackers in a firefight. The CSF immediately responded to the scene, and upon arriving in the hanger one of the police droid–driven speeders slammed into Robonino, knocking him unconscious. The CSF droids engaged Hyoki and overwhelmed him at which point Hyoki was also taken into custody."}, {"tag": "p", "text": "Lieutenant Divo, as well as several police droids, later responded to investigate the death of Senator Onaconda Farr of Rodia, who had collapsed after unknowingly drinking a poison. Divo ordered a forensic report on Farr, and the investigation made progress mostly through the assistance of Senators Amidala and Bail Organa. Following Farr's funeral, Divo interrogated several of the senators in the Chancellor's Suite, but Amidala and Organa decided to investigate the murder as well. They followed a lead given to them by Senator Mee Deechi to the Coruscant docks, where they were attacked by Representative Lolo Purs, who had been Farr's assistant as well as his murderer."}, {"tag": "p", "text": "However, the senators did not know who had attacked them and were able to catch the attention of a CSF patrol. While the police droids secured the docks as a crime scene and questioned potential witnesses, Organa and Amidala were given a lecture by Divo for trying to take matters into their own hands. Amidala suspected that Deechi had set them up, but when they returned to the Senate Building, they found that Deechi had been fatally stabbed. With two murders in the Senate, Divo was quick to react when Purs came to claim that she was attacked by Senator Halle Burtoni, a political ally of Deechi. Purs told Divo that she believed Burtoni was the killer, and the inspector arrested Burtoni and attempted to get a confession to both murders from her by showing evidence from his extensive forensic report on Farr. In the ensuing conversation, Purs herself was revealed as the killer of both Farr and Deechi, and after a brief attempt to take Amidala hostage, she was arrested by the CSF."}, {"tag": "h4", "text": "Terrorism and enhanced security"}, {"tag": "p", "text": "During the Clone Wars, the CSF's Anti-Terrorism Unit was headed by Captain Jaller Obrim, a former commander in the Senate Guard. In 21 BBY, the Separatists initiated a brutal terrorist campaign against bases on Coruscant belonging to the Grand Army of the Republic, beginning with Depot Bravo Five. An explosion of a transport speeder killed fifteen clone troopers, and the ATU began the task of investigating the crime scene in conjunction with the Forensics Unit. To assist them, the ATU requested the help of Jedi Knight Bardan Jusik, along with Sergeant Kal Skirata and Advanced Recon Commando Captain Ordo of the GAR. In the aftermath of the Depot Bravo Five attack, Director of Special Forces Arligan Zey unofficially and secretly authorized Skirata to conduct an operation to uncover the terrorists. Along with clone commandos from Omega Squad and Delta Squad, they began tracking the terrorist cells. The CSF's Organized Crime Unit came close to focusing an investigation on the commandos who got into the crossfire of underworld thugs. However, Obrim was able to deflect the investigation away from the commandos, allowing them to continue their mission. The commandos eventually located the terrorists, and in a joint venture with the CSF's ATU and OCU, they conducted raids that brought down the terrorist network."}, {"tag": "p", "text": "Though the Homeworld Security Command had already improved coordination between civilian police and the military, with the passage of the Enhanced Security and Enforcement Act in 21 BBY, security on Coruscant was drastically tightened. CSF patrols were increased, along with the visibility of the Coruscant Guard and other clone troopers. Even the lower levels of Galactic City, which traditionally had little police presence, became heavily subdued. In an area that had once been a haven for crime and an unregulated market, illicit goods and services became difficult to find."}, {"tag": "p", "text": "In 21 BBY, clone commando Fi was injured and taken to the Republic Central Medcenter's neurology unit. However, since the medical staff had no standing orders on treating a clone, particularly one they declared to be brain dead, they planned to euthanize him. Republic Treasury agent Besany Wennen, who had been watching Fi, threatened the medical droids with a blaster and locked herself into the patient room with Fi, causing a standoff. Kal Skirata called Jaller Obrim and asked him to get Wennen and Fi out, and Obrim responded with half of the CSF shift from the Anti-Terrorism Unit and several CSF paramedics. After Obrim threatened the administrative medical droid, Wennen and an unconscious Fi were escorted out of the medcenter under the devoted and protective eye of the CSF officers whom Fi had saved from the terrorists a year before. They were taken to Jaller Obrim's residence, where Obrim rented a medical droid to take care of Fi. Over time, Fi was able to recover."}, {"tag": "h4", "text": "Hunting a Jedi"}, {"tag": "p", "text": "Around 20 BBY, an explosion occurred at the Jedi Temple docking complex that killed six Jedi and several clone troopers and Temple employees. The investigation by Crime scene investigation droid, Russo-ISC and Jedi Anakin Skywalker and Ahsoka Tano, found that Letta Turmond, the wife of Temple employee Jackar Bowmani, had fed him volatile Nano-droids which then exploded killing Bowmani and causing the bombing at the Temple. Turmond was arrested and held at the Republic military base. When Tano went to visit her, Turmond was killed using a Force-choked making Tano seem to be the murder. Though unknown to all, the true murderer was rogue Jedi Barriss Offee. However, Tano was arrested by the Coruscant Guard and placed in a cell."}, {"tag": "p", "text": "However, Tano managed to escape with, to her unknown, the assistance of Barriss Offee. During the escape, several Coruscant Guards were killed by a lightsaber leading the pursuing troopers to believe it was Tano. In response to this, the Jedi Council ordered Tano's arrest. The CSF was told that she had been last seen fleeing to the lower levels, and so the Underworld Police were also put on high alert. Tano managed to temporarily avoid notice by using a cloak to hide her identity. However, at one point two officers boarded a Coruscant train that Tano was on and they began checking IDs of the passengers. As Tano attempted to leave the train at the next station, she ran into three more officers on the platform. The cops identified Tano and moved in to arrest her. Tano pushed the officers away, throwing one back onto the platform. He signaled ahead to other units as the train left the station and the remaining four officers gave chase."}, {"tag": "p", "text": "Dodging passengers, Tano fled through the train cars. A civilian attempted to hold her and the CSF officers managed to briefly overpower her. However, Tano fought them off during the scuffle and opened a door of the train. She then jumped onto the adjacent platform as the train passed. Believing herself safe, Tano began walking away. Three officers standing on the platform then noticed her and ordered her to stop. Tano fled from the station and towards an open turbolift door. The cops, seeing they were about to loose their quarry, opened fire on her, but Tano had already entered a lift by that time had escaped the officers' shots. The search continued and shortly thereafter, two police officers on Level 1315 spotted an explosion at a warehouse. They gave an alert to a search group composed of Jedi Knight Anakin Skywalker, Jedi Master Plo Koon, and Coruscant Guard troopers, all of whom responded and were able to capture Tano at the warehouse."}, {"tag": "h4", "text": "War's end"}, {"tag": "p", "text": "In the waning days of the Clone Wars, the CSF had a number of files on sightings of an armored individual who eluded them and escaped into the Darkside region of the Coruscant Undercity. The individual was in fact the Dark Jedi Garth Ezzar, who was based in the Darkside region. He was eventually tracked down and defeated by the Heroes of Cularin."}, {"tag": "p", "text": "In 19 BBY, the Separatist Droid Army under General Grievous attacked Coruscant. and the CSF deployed assault ships to attempt to keep civilians away from the areas of Galactic City where heavy fighting was occurring. In the aftermath of the Republic victory, clone units patrolled with the CSF officers as looting, vandalism, and civil unrest took hold of Galactic City."}, {"tag": "p", "text": "Although the clone trooper units were brought in under the guise of combating possible Separatist terrorist organizations and restoring order, they allowed Supreme Chancellor Palpatine to further his control and plot to destroy the Jedi. When the Jedi discovered that Palpatine was in truth the Sith Lord Darth Sidious, four of the Order's Jedi Masters were sent to arrest him. However, they were defeated, and the Supreme Chancellor issued Order 66, condemning all Jedi as traitors to the Republic. Anakin Skywalker—now known as Darth Vader—and the 501st Legion marched on the Jedi Temple, and the CSF's age-old standing order to assist the Jedi was rescinded. CSF units were instead tasked with assisting clone troopers in the hunt for Jedi and in securing the Temple district and surrounding areas."}, {"tag": "p", "text": "Captain Obrim, in particular, monitored the resulting operation against the Jedi Order from his police speeder with the intention of ensuring that Skirata and his crew escaped Coruscant. He helped locate Etain Tur-Mukan as she made her way to the rendezvous point to escape to Mandalore, but Tur-Mukan found several clone troopers confronting a group of Jedi Padawans in the checkpoint on the Shinarcan Bridge Extension. Tur-Mukan rushed to the defense of the clones, but she was sliced by a lightsaber wielded by one of the Padawans. Obrim rushed in to help and covered Tur-Makan's body, but he was forced to use the stun setting on his blaster to render Skirata, who was yelling and screaming, unconscious long enough for Ordo to remove him from the scene. Obrim promised to keep an eye out for Darman and RC-1309 \"Niner\", who had been forced to stay behind after Niner's spine was broken during the skirmish. Obrim also guarded Tur-Mukan's body both at the scene and afterward, until Null-12 \"A'den\" was able to move it to Mandalore."}, {"tag": "p", "text": "Although the CSF as a whole followed their orders in tracking down Jedi, such as Tru Veld, many officers disliked Palpatine and turned a blind eye when they saw a Jedi or outright helped them avoid the clone troopers. Many officers, however, still viewed the Jedi to a certain degree as untrustworthy and as traitors for trying to overthrow the institution of the Supreme Chancellor, even if they disliked Palpatine himself."}, {"tag": "h3", "text": "The Galactic Empire"}, {"tag": "h4", "text": "Changes and political dissent"}, {"tag": "p", "text": "After the establishment of the Galactic Empire, the CSF underwent several major changes making it hard for some to recognize it as the old CSF. Though still used at times, the name \"Coruscant Security Force\" was largely discontinued as the Empire officially abandoned the name \"Coruscant.\" Instead usage of \"Imperial Sector Police,\" or the \"Constabulary\" became common. Major organizational changes took place as the Anti-Terrorism Unit and the detective division were absorbed into the new Imperial Security Bureau. The ISB also housed their new information and technology center in an old CSF building. The police ranks of Prefect and Centurion were added with the Prefects placed in charge of station houses. The CSF's police droids, who at that time were older models, were phased out and their usage on the upper levels was discontinued. Instead, officers from the underworld police division were used for patrol on the upper levels."}, {"tag": "p", "text": "The void left by the discontinued police droids was largely filled by Imperial stormtroopers who were assigned to the CSF and worked with the regular officers. The preference given to having stormtroopers work as police, especially in the more public areas of the city, was resented by older police officers who believed that policing should be conducted by a civilian force, not military. Additionally, while the CSF continued its functions as a police force including investigations of homicides and other street crimes, the Coruscant Guard, then commonly known as the Imperial Guard, was given the primary responsibility of security for the planet. While most visible in public areas, protecting infrastructure and at government buildings, the Guard had primacy on major cases and together with the Imperial Security Bureau, conducted most of the high profile investigations. This in effect relegated the CSF to a position of non-importance, a status highly resented of by the CSF's commanders. Their resentment over the diminished status, as well as over limited resources to properly police Coruscant, brought them into conflict with other Moffs, Darth Vader, and Emperor Palpatine himself."}, {"tag": "p", "text": "Along with the resistance by the commanding officers, there was also resistance from the police officers themselves, many of whom were not happy with the New Order. Though Palpatine had initiated a purge throughout the government of those disloyal to him, many in the CSF escaped notice because they followed his orders during Order 66 and its aftermath. While many of those who had done so had felt no love for Palpatine, they viewed the Jedi as dangerous traitors, a belief that they continued to hold in the years that followed. As the Empire's changes came, many of the officers secretly joined anti-Imperial groups such as Whiplash. Publicly, while the CSF was officially under the Empire's command, police officers would distance themselves from the rest of the Empire, claiming themselves to not be political or interested in political issues. To counter the growing resentment and mood of rebellion, Agent Tian Chyler succeeded in a mission from the ISB to infiltrate the CSF and ferret out police officers who were Rebel spies."}, {"tag": "p", "text": "In 19 BBY, a routine traffic stop turned violent when the driver pulled out a lightsaber and severed an officer's hand. The CSF pursued the suspect at a distance before cornering him in a building and calling in Squad 40 of the Imperial Commando Special Unit that was attached to the 501st Legion. When Squad 40 broke down the door and killed the suspect, they found that he had only been a thief who had happened upon the lightsaber. Officer Anskow was the part-time officer in charge of the police squad that had responded. Anskow reflected the belief that Jedi were dangerous but also showed frustration with Palpatine over a lack of resources to keep an eye on the lower levels where most of the crime occurred."}, {"tag": "h4", "text": "Working with private detectives"}, {"tag": "p", "text": "Around 18 BBY, Prefect Pol Haus was sent by the Sector Command to investigate the death of Ves Volette. Though usually the investigation would be left to someone of lower rank, Prefect Haus investigated the case since Volette had been a Caamasi and the Empire wanted to find a quick resolution to avoid more publicity of the Caamas Firestorm. Haus found that Dejah Duare, Volette's girlfriend had discovered the body along with private investigator Jax Pavan. Pavan and his team were able to uncover that Volette was killed by an Umber 3PO unit owned by a wealthy family who purchased Volette's artworks. The droid believed that Volette was having an affair with its owner and thus might destroy the marriage between the family. Haus and Pavan confronted the family and its droid. The droid confirmed it had killed Volette before self destructing. Later, Haus was suspected by Darth Vader of being a member of the Whiplash underground movement. Haus was indeed a founding member of the group. However, Haus was able to assist Pavan, who Haus knew to be a former Jedi, in escaping Vader's clutches and fleeing Coruscant. Haus remained undetected by Vader and stayed in his post as a police prefect."}, {"tag": "p", "text": "After Pavan left Coruscant, Haus fully committed himself to Whiplash. Between the reports Haus received from police patrols, reports from other prefects and their districts, and his own network of informants throughout the police and the Imperial Security Bureau, Haus was able to track the movements of security personnel, the Inquisitorius, Darth Vader, and to a certain extent, the Emperor himself. This placed him in an ideal position to be in charge of security and intelligence for Whiplash. Haus was able to warn them several times of impending raids by Imperial forces and eventually moved the group's headquarters into an old maglev train that was out of service but continued to run its rounds. When Whiplash leader Thi Xon Yimmon was captured, Pavan returned to Coruscant. Haus intercepted him and Pavan's droid I-5YQ at the spaceport and took them maglev headquarters. There, the Whiplash Council debated whether or not to attempt to rescue Yimmon which they eventually decided against."}, {"tag": "p", "text": "However, Pavan disagreed. Pretending to be an Ubese merchant, Pavan visited Haus in his office and they left for the cover of the Ploughtekal Market. There Pavan revealed his plans to rescue Yimmon to which Haus agreed to remain silent on. Haus also gave Pavan a police lieutenant's uniform to allow Pavan unlimited access to his offices should Pavan need to visit him again. Later, Haus received information that the Emperor was visiting his villa at the Western Sea. Haus, worried that fellow Whiplash operative Tuden Sal would attempt to assassinate the Emperor resulting in a brutal crackdown on Whiplash, decided to keep the information quiet. However, Sal found out about the Emperor's plans and confronted Haus who admitted he had kept quiet to protect Whiplash. Believing Haus was now under suspicion, Sal told Haus he was no longer part of Whiplash."}, {"tag": "h4", "text": "Undermining the Empire"}, {"tag": "p", "text": "Though Haus left at Sal's demand, he continued to believe that attempting to attack the Emperor would be a fatal mistake. To that end, he had several private meetings with poetess Sheel Mafeen, a fellow Whiplash operative. Mefeen provided Haus with Sal's plans to attack the Emperor. Despite having warned Sal repeatedly and yet promising to not interfere, Haus decided to arrest Sal to prevent the attack from taking place. Haus called in a tactical unit and informed them that they were to raid a dangerous criminal headquarters. Together with the tactical unit and his lieutenant, Kalibar Droosh, Haus pretended to follow Mafeen to the platform of Whiplash's maglev train though he and Mafeen had already discussed the plan. However, the maglev train never arrived. Haus realized that Sal had mislead Mafeen as well and already suspected Haus was going to attempt to stop him. The tactical unit under Sergeant Amry and Lieutenant Droosh found an abandoned maglev car. Alarmed, Haus ordered everyone to leave the area but not before the train car exploded, injuring several officers. Fearing the worst, Haus speed towards the Emperor's villa only to find that Whiplash had already attempted and failed to kill the Emperor. Though turned away by ISB security personnel, Haus saw the bodies of Whiplash operatives and discovered that most of the Whiplash council and many of their top operatives were dead."}, {"tag": "p", "text": "Haus returned to the scene of the blown maglev train where the Forensics Unit was sifting through the debris. Haus began searching for the remainder of the Whiplash train, discovering it further down the tracks. Upon entering it, he found and confronted Sal who was hiding in his room. While Sal voiced his disgust at Haus as well as himself, Lieutenant Droosh had secretly followed Haus and surprised both men. Droosh revealed to Haus that he had suspected the prefect of strange activity for some time and would take him into custody to be turned over to the ISB. Before he could do so, however, Sal shot and killed Droosh but received a fatal wound himself. Sal told Haus to hide the evidence before dying. Together with Mafeen, Haus retrieved vital data from the train and they disposed of it in the lowest levels before they reported to Pavan what had occurred. Together, they were determined that Whiplash would survive and set about rebuilding the resistance network."}, {"tag": "p", "text": "By 1 BBY, Moff Kadir was placed in command of the CSF. His predecessor had been executed for requesting additional men, and Kadir found himself dealing with similar problems of limited resources and troops. Frustrated and angry with the Sith, Kadir and several other high-ranking Imperial officers attempted to use specially trained clones to kill Emperor Palpatine and take control of the Empire; however, the plot failed, and Kadir was killed. At some point after the failed plot, a commissioner was given command, replacing the position of Moff. In 0 ABY, two officers responded to a firefight at Landing Platform DDF453-17 between stormtroopers and smuggler Han Solo. The officers requested backup but were told to stand down as the incident was an Imperial matter. In 4 ABY, the security forces were attacked by angry crowds, spurred on by the news of Palpatine's death at the Battle of Endor. In the ensuing uprising, many people were killed as Director of Imperial Intelligence Ysanne Isard took command of the security forces and brought the planet back under control."}, {"tag": "h3", "text": "The New Republic"}, {"tag": "h4", "text": "New government and changes"}, {"tag": "p", "text": "The New Republic captured Coruscant from Imperial forces in 6 ABY. During the battle, sixteen of the galaxy's worst criminals, who had been freed from the prison colony of Kessel by the New Republic, were set loose on Coruscant. They caused criminal riots and distracted CSF stormtroopers and other security forces, which helped the New Republic capture the planet. In the aftermath of the New Republic victory, the Krytos virus, an attack by Ysanne Isard, was released on Coruscant targeting the planet's non-human population. Its only cure could be found in bacta and as supplies dwindled, a black market grew to meet the demand. Though most of the Imperial bureaucracy had been left in place, the use of stormtroopers had been rejected by the New Republic Provisional Council and so the Constabulary stormtroopers and Coruscant Guard had been disbanded. Faced with a crisis and the basic need for law enforcement, the Provisional Council ordered the formation of the New Republic Security Force though found it would take time to organize the new agency to an effective level. In the interim, former Corellian Moff Fliry Vorru offered to supply law enforcement needs in the Coruscant Underworld. He rejected the idea of becoming the Coruscant Constabulary's Commissioner and instead, with the Provisional Council's hesitant blessing, he was given a rank of Colonel in the Coruscant Constabulary and formed the Imperial Center People's Militia which \"policed\" the Coruscant underworld. However, Vorru became a pawn of Ysanne Isard and fled the planet with her a short time later. At some point soon after, the use of the name Coruscant Constabulary was dropped in favor of Coruscant Security and it was reinstated as the primary law enforcement agency for Coruscant."}, {"tag": "p", "text": "Before the wedding of Jedi Master Luke Skywalker and Jedi Mara Jade in 20 ABY, Princess Leia Organa Solo, Jade, and several of their friends were riding in an airspeeder through Galactic City to go shopping. They were protected by two Coruscant Security units on speeder bikes. A group attempting to disrupt the wedding, led by ex-Moff Derran Takkar, made a note of the loose security cordon and the fact that the officers could easily intercept any approach. Takkar later infiltrated the wedding through Coruscant's sewers. While down there, he killed two Coruscant Security officers on patrol who noticed him but were not able to react fast enough before he shot them both."}, {"tag": "h4", "text": "Military actions"}, {"tag": "p", "text": "In 23 ABY, the CSF was involved in a military incident between the New Republic Defense Fleet and the Second Imperium—a faction of the Imperial Remnant led by the Dark Jedi Brakiss and the Nightsisters Tamith Kai. In their bid to recapture the galaxy, they learned of the bulk cruiser Adamant, which was carrying turbolasers and hyperdrive cores to Coruscant. Because Admiral Gial Ackbar was in command of the vessel, it was guarded by fourteen corvettes and a number of X-wings and E-wings, which escorted the bulk cruiser to Coruscant before handing it over to the CSF. In the few minutes of transition between the two forces, a Second Imperium Imperial Assault Shuttle, hidden by the cloaking capabilities of the Second Imperium's Shadow Academy, appeared and attacked the Adamant, with the shuttle's crew boarding the cruiser. Though they called for CSF assistance, the crew was forced into escape pods and jettisoned. New Republic and CSF forces attempted to halt the hijacked Adament, but the cruiser managed to escape."}, {"tag": "p", "text": "The Yuuzhan Vong War began in 25 ABY with the invasion of the galaxy by the extra-galactic Yuuzhan Vong. Seeing the Jedi as their greatest threat, the Yuuzhan Vong offered peace if the New Republic handed over the Jedi, causing an increase in public anti-Jedi sentiment. The sentiment reached such a peak in 26 ABY that it forced Chief of State Borsk Fey'lya to order the arrest of Luke and Mara Jade Skywalker. When they tried to flee Coruscant aboard the starship Jade Shadow, a CSF captain ordered them to stop. Luke refused and they were pursued by four CSF interceptors. No one was killed in the incident, and the Jedi managed to escape due to the intervention of Rogue Squadron who forced the CSF interceptors to back off."}, {"tag": "p", "text": "In the middle stages of the Yuuzhan Vong War, the New Republic established the Coruscant Planetary Defense Force (PDF) as a sister agency to the CSF, although its main concern was the military defense of Coruscant. During the Battle of Coruscant, the New Republic fleet was separated from Coruscant by the Yuuzhan Vong, leaving the planet's defense to the PDF and the CSF along with the few New Republic fighters that managed to get through. Coruscant's defenses began to quickly crumble—the planetary shield, orbital defense platforms, and the Orbital Defense Headquarters were soon destroyed, and the fighting descended to the planet's surface. Although the PDF and CSF continued the fight from rooftops and airspeeders, most were wiped out by the overwhelming attack. Those who survived evacuated the planet or escaped down into the substructures until Coruscant was recaptured by the Galactic Alliance in 29 ABY."}, {"tag": "h3", "text": "The Galactic Alliance"}, {"tag": "h4", "text": "Bombings and riots"}, {"tag": "p", "text": "With the return of the government after the Yuuzhan Vong War, the CSF was reestablished under the Galactic Federation of Free Alliances. The CSF was later pulled into the conflict between the Galactic Alliance and Corellia, which erupted over Corellia's demanded for more independence and its refusal to pay Galactic Alliance taxes and to supply military recruits, while simultaneously taking advantage of the Galactic Alliance infrastructure and trade benefits. CSF officers were present at the Senate Building during a demonstration held by Corellian supporters, although the protest remained peaceful. After a bomb exploded in The Elite Hotel, the CSF, with Captain Lon Shevu in command, responded and immediately began investigating the incident, which had left 634 civilians dead. Along with members of Coruscant Fire and Rescue, Coruscant Air Traffic Control, medcenter managers, and members of the Galactic City Authority, Shevu coordinated the response to the bombing at the Strategic Center, which was the emergency response center for Galactic City, located deep under the Senate Building."}, {"tag": "p", "text": "Later on, Corellian militants waged an attack on Coruscant's water supply, causing half of central Coruscant's water supply to be turned off. Although the CSF warned residents not to use the contaminated water, the attack still caused 456 deaths and left more than 5,000 beings with nerve damage. In response to the attack, a riot ensued at the Corellian Embassy. The CSF mobilized by setting up a police line to protect the embassy, diverting traffic, and sending in an assault ship. Still, the riot intensified the more the CSF tried to stop it, and the police eventually had to shoot tear gas into the crowds in order to disperse them. During the incident, Jedi apprentice Ben Skywalker, who was curious about the condition of the Corellians, was visiting the Corellian Quarter, where he saw a friend pull a blaster and aim it at one of the police officers. Eyes burning from the tear gas, Skywalker deflected the bolt with his lightsaber, saving the officer's life and preventing an escalation of violence. The police officer pulled the young Jedi to safety away from the crowd, as he was disoriented from the tear gas. In the aftermath of the contamination attack and the riot, the CSF doubled its police patrols of Galactic City."}, {"tag": "h4", "text": "The Guard and homicides"}, {"tag": "p", "text": "After the riot, Galactic Alliance Chief of State Cal Omas offered Jedi Knight Jacen Solo a commission as a colonel and command of the CSF's Anti-Terrorist Unit. However, Solo felt that having civilian police perform the duties of a secret police would make ordinary police work harder, and it was decided that it was best to have an agency politically separate from the CSF to perform the duties of rounding up and interning Corellian suspects and fighting terrorist threats by Corellians on Coruscant. Thus, the Galactic Alliance Guard was formed, with Jacen Solo as its commander. The CSF's first operation with the GAG was in Jabi Town in the Corellian district of Galactic City. They blocked off several skylane intersections with CSF traffic division repulsorlift ships before beginning the operation. After the actions of the GAG troopers during the raid, the CSF gave the GAG troopers the nickname \"stormies,\" seeing the troopers as reminiscent of the stormtroopers of the Empire."}, {"tag": "p", "text": "Later, three days into the Galactic Alliance's Blockade of Corellia, a large protest again took place outside the Senate Building. The CSF positioned their police line to protect the Senate Building as well as to divide the groups taking part in the protest—one pro-Corellia, the other Coruscanti. The scene soon escalated into violence as the groups clashed and turned the protest into a riot. The riot was eventually dispersed with tear gas and other police actions. However, more rioting had broken out in one of the commercial zones of Galactic City, and the CSF had to redeploy to deal with the situation. Soon, the conflict with Corellia intensified into the Second Galactic Civil War, and the CSF took less direct actions against Corellian terrorist activities as the GAG took over those operations. Instead, the CSF focused on more of the regular police duties, including breaking up demonstrations and providing the GAG with intelligence and other general support."}, {"tag": "p", "text": "During the war, Grand Master Luke Skywalker asked Jedi Master Tresina Lobi to keep an eye on his son, Ben Skywalker, who was apprenticed to Jacen Solo. Master Skywalker was concerned with Solo's methods and actions in leading the GAG, as well as with Ben's involvement in them. However, while trailing Ben one night, Master Lobi was ambushed and killed by the Dark Lady of the Sith Lumiya and Dark Jedi Alema Rar. Luke Skywalker and his wife, Mara Jade Skywalker, were notified of the Jedi's death by the CSF and were asked to come to the crime scene. There, they found two detectives, Gwad Raatu and Chal Tozr, as well as several crime scene investigation droids. The Jedi and CSF detectives agreed to work together to find the killer. They were able to track Lumiya to an apartment where they successfully gained entry, but they found the apartment empty and laced with traps. Using the Law Enforcement Tools Provision, Detective Raatu sliced into the apartment's central comm port."}, {"tag": "p", "text": "Meanwhile, the CSF Chief of Detectives had sent detectives to investigate the murders of several Bothans, including a Bothan ambassador. When Detectives Raatu and Tozr sliced into Lumyia's comm port, they discovered that she had been responsible for the Bothans' murders. The detectives also found that the apartment was a GAG safe house. The fact that the GAG was behind the murders of the Bothans scared the detectives, especially when the comm port announced that their inquiries were being recorded by the GAG. The detectives, seeing that the situation was out of their control, formally closed the case on the murdered Jedi, leaving the Skywalkers to deal with the GAG."}, {"tag": "h4", "text": "Coups and manipulations"}, {"tag": "p", "text": "The CSF had been given the responsibility of the protection of the Chief of State, serving as bodyguards on and off planet. When Jacen Solo became suspicious of Chief of State Cal Omas, he had the GAG relieve the CSF of the responsibility of protecting Omas, allowing the GAG to better monitor the Chief of State. Over the course of the war, Jacen Solo had turned to the dark side of the Force and became the Sith Lord Darth Caedus. Through a bloodless coup during which Omas was arrested by the GAG for treason, Caedus and Admiral Cha Niathal became Co-Chiefs of State of the Galactic Alliance, although, Caedus retained direct control of the GAG. Shortly after the coup the CSF received an alert of an intruder in Cal Omas' apartment, where he was under house arrest. Caedus had suggested to Ben Skywalker that Omas was responsible for the recent murder of his mother, Mara Jade, and so Skywalker broke into Omas' apartment to murder him. While Omas and Skywalker talked, the CSF attempted to enter the locked-down apartment to no avail. During their conversation, Skywalker realized that Omas was not at fault, but Omas knew that a fake death would not fool Darth Caedus, and he impaled himself on Skywalker's lightsaber. When the CSF officers finally breached the door, they threw two stun grenades into the room, but Skywalker used the Force to send them back out, stunning the officers and allowing him to escape. Omas, meanwhile, had rigged himself to a bomb that would detonate with his death. The CSF officers in the lobby saw Skywalker running toward them and attempted to stop him, but he was able to convince them to leave before the bomb on Omas exploded."}, {"tag": "p", "text": "Following Caedus' death and the end of the war, the GAG was disbanded. Two years later, Grand Master Luke Skywalker was charged for failing to stop Caedus and sent into exile. Around that time several Jedi within the New Jedi Order began experiencing a Force psychosis, suffering delusions that everyone, except for other beings suffering from the same psychosis, had been replaced by impostors. As a result, they attacked family, friends, and strangers without provocation, in the process causing damage to their surroundings. In 43.5 ABY, Jedi Knight Sothais Saar developed the psychosis and was captured by Jedi Master Cilghal. Coruscant Security officers were soon dispatched to the Jedi Temple by Chief of State Natasi Daala; they were met at the front steps to the Temple by several Jedi, who refused to let them enter and take Saar into custody. When the Jedi refused to turn Saar over, Daala ordered a raid on the Jedi Temple by Mandalorian commandos."}, {"tag": "p", "text": "Later, an individual used the name of CSF \"Captain Koltstan\" as a front to sign off on the funeral procession for Admiral Cha Niathal, who had committed suicide after Daala ordered that she be arrested and tried for her actions during the recent war. A quick investigation showed that no \"Captain Koltstan\" existed in the CSF, and Daala ordered the CSF to find out who had really paid for the procession. Though they failed to prevent Cal Omas' death, the CSF continued to protect the Chief of State with bodyguards and intelligence information. As a result of Niathal's suicide, Daala's public approval ratings dropped steeply. Therefore, the CSF's protection branch believed that someone might try to attack Daala, and they suggested that she not attend the funeral. Daala was reluctant to comply, but her Chief of Staff, Wynn Dorvan, convinced her to take the CSF's advice. The CSF reported that the threat level against the Chief of State during the procession went up significantly. Soon after that, protection of the Chief of State became the responsibility of Galactic Alliance Security."}, {"tag": "h4", "text": "Fighting against the Sith"}, {"tag": "p", "text": "While in exile, Skywalker and his son Ben had encountered a hidden Sith order called the Lost Tribe of Sith as well as a dark side entity called Abeloth. Pursuing both, they uncovered a plot to take over the Galactic Alliance. Following Daala's removal from power and the return of Skywalker from exile, the Jedi Order formerly left Coruscant to lure the Sith to the planet. At the same time, Abeloth had sized control of the Lost Tribe and continued with the Sith infiltration of the Galactic Alliance Senate and other key positions including a Superintendent of the GAS, the Grand Justice of the High Court. Previously, the Sith had formed BAMR News to support their actions and undermine the Jedi which they continued by claiming the Jedi were involved in a major spice ring. In the guise of newly appointed Senator Rokari Kem, Abeloth was able to be elected Chief of State and take over the GA government. The Jedi Order and several GA government officials who were aware of the situation, calling themselves Club Bwua'tu, began planning to retake Coruscant from the Sith."}, {"tag": "p", "text": "Moving carefully, the Jedi returned to Coruscant in disguises to avoid detection by Sith who had infiltrated the Coruscanti Immigration Service. Having previously identified their targets, the Jedi took out several Sith in high government positions. Abeloth, angered by the attacks and under the advice of Wynn Dorvan who she held prisoner, ordered the remaining Sith to fortify themselves in the Jedi Temple. As this plan had been previously discussed by Wynn Dorvan and members of Club Bwua'tu, the Jedi moved forward to assault the Temple along with the Galactic Alliance Marines. During the assault, several hundred Sith managed to escape into the city. With the confusion caused by BMAR news stating that the attacks on the Sith were the results of the Jedi spice ring, initial responses by the CSF were limited. As the Sith began to commit terror acts on Coruscant including the destruction of seven hundred buildings and causing a death toll of over three million, the CSF began to assist the Jedi. CSF officers reported suspicious activities to the Jedi and in some cases actively attacked Sith. However, even with the assistance of Special Weapons Teams, only twenty-two Sith were killed with Jedi losses at fifteen and CSF casualties in the thousands. With the death of Abeloth by the Luke Skywalker, the Sith were defeated and Coruscant was liberated. In the aftermath, as the planet had suffered severe damage especially in the lower levels, Galactic Alliance and Coruscanti emergency services and government agencies began the work of stabilizing the planet and taking care of the casualties."}, {"tag": "p", "text": "Later that year, security troopers arrived at a pedestrian market in response to a fight. When the first officer arrived, he discovered two bodies that witness claimed had been killed by a Jedi. A few minutes later, a speeder exploded as it attempted to leave the parking area. Unknown to Security and the witnesses, the Jedi was actually Wraith Squadron commander Garik “Face” Loran in disguise. The assassins had been following him with plans to kill him but using the Jedi disguise, Loran had killed them first. The speeder had also belonged to Loran who had entered it after ditching his Jedi disguise. Though another assassin had witnessed Loran entering the speeder and Security later found trace evidence of Loran in the speeder's wreck, Loran had managed to escape before the bomb exploded."}, {"tag": "h2", "text": "Notable members"}, {"tag": "p", "text": "Police work on Coruscant was dangerous, especially in the underlevels, and many officers were injured and killed in the line of duty. Characteristically, CSF police officers were generally known as hard-nosed cops. Most officers performed their duties faithfully, and a few had bounties placed on their heads by criminals as revenge. Some officers, however, fell to the corruption that was prominent particularly during the waning years of the Galactic Republic. Other officers had bounties placed on their heads for failing to repay debts or upholding their end of deals they had made with criminal organizations or other businesses."}, {"tag": "h3", "text": "Winborn"}, {"tag": "p", "text": "Winborn was a Human captain in the CSF during the time of the Cold War. By 3643 BBY, he was also CSF's Chief under Senator Vanara Kayl, the head of Coruscant's government. However, the captain preferred to stay away from the political infighting on Coruscant and instead focused on the day to day grit of police work. Yet, he felt discouraged by CSF's problems with gangs on Coruscant. His view was that the CSF should be worried about keeping the peace, not engaged in open warfare with crime syndicates who had taken over several sectors of Galactic City. Winborn, however, was not above personally leading his men during fights. He was in charge of an attack on the Migrant Merchants' Guild base of operations in the Old Galactic Market. During the fight, an individual assisted him in preventing a terrorist attack that was aimed at taking down the skylanes around the Senate Building. After the fight, a recording of Senator Kayl was found arguing with the leader of the Merchant Guild. The Guild was blackmailing Kayl for taking money and using it to win the election. Kayl in response sent the CSF to push the Merchant Guild out to show she would not bend to blackmail. Winborn felt the issue was too politically volatile for him to deal with and instead asked the individual who had helped him with the skirmish to confront the senator."}, {"tag": "h3", "text": "Denal-zon"}, {"tag": "p", "text": "Denal-zon was a Zabrak captain during the time of the Cold War. He was assigned to investigate the theft of several valuable chips belonging to Senator Doli-bur Barc. After beginning his investigation, he discovered that the chips were designed to power slaving collars. He also discovered that the chips had been stolen by members of the Migrant Merchants' Guild criminal gang. With the CSF at war with the Guild in an attempt to push them out of Coruscant's Old Galactic Market sector, Denal-zon was unable to retrieve the collars, and the investigation subsequently stalled. However, since slave collars and the chips that powered them were illegal in the Republic according to Republic Law 44-12, Denal-zon felt little sympathy for the Senator's plight. He firmly believed in the importance of regulations and the rule of law, which he would often quote. His belief in the law also added to his strong sense of right and wrong, which he refused to compromise on."}, {"tag": "h3", "text": "Theraguin"}, {"tag": "p", "text": "Theraguin was a Human who held the rank of captain during the Cold War. After the Sacking of Coruscant, the CSF struggled to maintain order and eventually called for Republic Military support. However, large areas of the planet were lost to gangs who consolidated into the Black Sun criminal syndicate. The CSF, having sustained casualties both during the sacking and the years of aftermath, all but abandoned the area as they drew back to police vital government and commerce districts. A veteran police officer, Theraguin was one of the few, if not the only, cop who continued to work in the Black Sun Territory though most officers had abandoned it, including his superior. Determined to do what he could to relieve the suffering of the locals, Theraguin defied Black Sun's thugs and went beyond the CSF's barricades into the territory. He went so far as to risk his life to diffuse explosive bombs set by Black Sun to kill refugees. However, the violence and hopelessness of the Black Sun Territory left Theraguin frustrated. He sarcastically would refer to himself as the \"last officer on the job\" in that sector. As with many of his fellow veteran cops, Theraguin had joined CSF to keep the peace. The years after the Sacking of Coruscant, however, brought with them a brutal urban warfare—this was something Theraguin and CSF were not trained for. Though he knew his limitations, Theraguin continued to work in the Black Sun Territory despite all the difficulties."}, {"tag": "h3", "text": "Doorn"}, {"tag": "p", "text": "Doorn was a Human who achieve the rank of lieutenant before the Great Galactic War. During the Cold War period that followed the war, Doorn was posted to the Black Sun Territory. The assignment was difficult, with constant street warfare against the Black Sun crime syndicate. At one point he was assigned the task of securing plans for Coruscant's secret tunnels. Working with Agent Fieler Dan of the Strategic Information Service, Doorn tracked the plans to Coruscant's Justicars' Sector. When Dan failed to contact Doorn, he sent a Republic individual after her who was able to locate the plans. Though he had once been proud of both his job and his rank, he no longer felt so by the time of the Cold War. As with his fellow veteran cops, Doorn felt burned out and frustrated. The constant street warfare had taken its toll on living conditions, and cops suffered as much as civilians. To Doorn, police work no longer served to keep the peace, but was instead a difficult job with barely enough pay."}, {"tag": "h3", "text": "Nidaljo"}, {"tag": "p", "text": "Nidaljo was a Human sergeant in the CSF during the Cold War. In the aftermath of the Sacking of Coruscant and Black Sun's rise to power, the Special Tactical Unit composed of CSF cops and Republic soldiers was formed with Nidaljo as its commanding officer. The Units goal was to give the CSF a better edge in fighting Black Sun. However, ten years after the Sacking of Coruscant, the CSF had made little progress, frustrating both Nidaljo and his men. Nidaljo and his men were sent into Black Sun's territory to assist in retrieving Republic scientist Doctor Tarnis and the Planet Prison superweapon. During the fighting, Nidaljo lost four of his men and seven others were killed. With his remaining forces surrounded, Nidaljo saw little prospect of escape and felt embittered by the seeming futility of the fight with Black Sun. When the Jedi arrived to help, they were able to rally Nidaljo and his men to break through Black Sun's forces. The skirmish resulted in the death of Black Sun's leader, Salarr. With this blow to Black Sun, Nidaljo felt a renewed sense of purpose and though unable to retain possession of the territory, he and his men set about the task of setting up booby traps for Black Sun."}, {"tag": "h3", "text": "Stansun"}, {"tag": "p", "text": "Stansun was a Human who served as a police officer with the Coruscant Security Force. During the Cold War Stansun was assigned to the Black Sun Territory. Though Stansun remained positive, he was frustrated by the lack of progress in fighting the Black Sun criminal syndicate. He had tried several times to shut down an illegal surgery clinic without success before he was able to enlist the help of a Republic individual. The individual was able to infiltrate the clinic and defeat Black Sun's thugs as well as several droids and downloaded a list of criminals the clinic's droids had operated on. The list was then turned over to Stansun so that CSF could identify the criminals' faces and track them down. While he kept a positive attitude, Stansun was realistic about the fighting between the police and Black Sun. Even with the CSF seemingly losing the battle, Stansun remained determined to press on. He was certain that with Black Sun gone, peace could be brought to Coruscant."}, {"tag": "h3", "text": "Mal"}, {"tag": "p", "text": "Officer Mal was a Human who was assigned to the Old Galactic Market commercial district of Galactic City. In the aftermath of some riots, the Old Galactic Market had been overrun by refugees and a criminal organization known as the Migrant Merchants' Guild. The Guild claimed to protect the interests of the refugees, but in reality, it demanded protection money and was involved in illegal actives such as money laundering and smuggling. Though the CSF had been able to retake a portion of the Galactic Market, most of it remained under the Guild's control. On one occasion a Nautolan named Nik Deleru reported to Mal that his mate, Ria Deleru, had been taken by the Guild. Nik requested Mal's help in retrieving her; however, Mal did not have enough men to enter the Guild control area and retrieve Ria. Mal was dedicated to his job and felt it was his duty to protect. Faced with the struggles of the refugees, Mal believed that since they had no business living in the Old Galactic Market, any situation in which they became involved was partially of their own doing. The refugees in turn blamed the CSF for not stopping the Guild. Tired of being blamed for their problems by the refugees, Mal nevertheless cared for their plight. Yet with the CSF's lack of manpower and resources, he was unable to get involved and help the refugees with problems involving the Guild. This led Mal to become frustrated with the Guild, the refugees, and his inability to act."}, {"tag": "h3", "text": "Anstiss"}, {"tag": "p", "text": "Anstiss was a Zabrak officer. She was assigned the task of arresting a Houk criminal named Gambo. However, Gambo was known to be a brutal Black Sun enforcer and murderer, and Anstiss was to arrest him by herself. She made several attempts to arrest Gambo inside the Dealer's Den Cantina in the Old Galactic Market sector but was unable to subdue Gambo. On her final attempt Gambo beat her severely, nearly killing her. With that, Anstiss retreated to outside the cantina and called for backup. Despite her pleasant attitude, Anstiss believed she had made some enemies at CSF Headquarters as she had been assigned the task of arresting Gambo by herself. She was also a courageous person, as she went ahead to try to arrest Gambo knowing that he would probably be too much for her. Yet her somewhat stubborn will did not let her give up, and she was determined to not let him out of her sight while she waited for backup."}, {"tag": "h3", "text": "Folaris"}, {"tag": "p", "text": "Folaris was a Human police officer working as an undercover agent in the Black Sun Territory. Around 3643 BBY, Folaris discovered that the Black Sun criminal syndicate was planning to purge several members—informants and rival gang leaders—it suspected of undermining its operations. Folaris wanted access to that list so that the persons targeted could be warned. However, she also saw an opportunity in selling the list: if the names went public, the targeted persons would possibly be warned and Folaris would be able to supplement her income. A Republic individual whom Folaris had recruited to help her convinced her not to sell the list but turn it over to her superiors. She served with determination, if also frustration. Folaris felt that for the risks she was asked to take, she was not compensated financially enough to make the effort worth it. Though Folaris claimed loyalty to the people of Coruscant, she also had a certain amount of personal greed. When the opportunity came to sell the list of Black Sun targets, Folaris jumped at the chance, despite her duty as a cop. However, Folaris was not so consumed by her resentment and greed that it took much convincing for her to abandon her scheme."}, {"tag": "h3", "text": "Jaffkee"}, {"tag": "p", "text": "A young Human, Jaffkee became a police officer with the Coruscant Security Force, which, at the time, had undergone severe hardships. The Sith Empire's Sacking of Coruscant and the immediate aftermath of rioting and looting had drained the CSF in lives lost and in resources. He eventually attained the rank of Agent and was sent as an undercover operative to the Justicars' Sector to try to plant listening devices and monitor Justicar communications. However, the Justicars had set up several jamming devices that prevented Jaffkee from monitoring them. It was then that Jaffkee met a Republic individual who offered to assist Jaffkee in disabling the jamming devices. Dedicated to his job and displaying enthusiasm for it, Jaffkee remained at his post in the Justicar sector despite the constant threat of discovery and ultimately death. Despite his young age and enthusiasm, Jaffkee displayed the characteristic bitterness of many of the CSF's younger officers and recruits. The resentment came about as the Republic put greater emphasis on allocating money and manpower for the military and not the CSF."}, {"tag": "h3", "text": "Yur T'aug"}, {"tag": "p", "text": "Yur T'aug was a Bothan captain and a police officer in the CSF around ten years before the Trade Federation's 32 BBY blockade of Naboo. He was very dedicated to the CSF, and was reluctant to share information with outsiders, including the Jedi. Quick to establish the CSF's authority in an investigation, T'aug was also realistic in agreeing, albeit reluctantly, to outside help when dealing with a situation beyond his abilities. T'aug held strong principles of loyalty, honor, and responsibility, and stood by his actions even if it meant defying the law to a certain extent. When confronted by Obi-Wan Kenobi as to why he had dropped the investigation of Ren S'orn, the Captain openly refused to answer, even though the CSF was required to cooperate with the Jedi. However, T'aug also had a keen sense of justice, and when Kenobi pointed that out, the Captain agreed to answer the Jedi's questions. T'aug sometimes came across as tough and mean, but he had a sense of empathy for the victims of crimes; he dropped the Ren investigation in order to spare Ren's mother from further pain."}, {"tag": "h3", "text": "Jaller Obrim"}, {"tag": "p", "text": "Jaller Obrim was a Senate Guard, who, during the Clone Wars, was transferred to and placed in command of the CSF's Anti-Terrorism Unit. While there, he formed a close relationship with Kal Skirata and several of the clone commandos. Together, they were able to arrest and destroy a terror network on Coruscant. Although Obrim was a dedicated police officer, he was not above bending or breaking the rules if he felt that it was the right thing to do. Due to his high position in law enforcement, he was capable of helping Skirata's black ops mishaps disappear from official records. On one occasion, he used his authority to escort an injured Fi out of a hospital as a favor for Skirata. Obrim was one of the few non-clones trusted with Skirata's plans to help clone troopers desert from the Grand Army of the Republic. Although he refused to hear specifics for reasons of deniability, he helped Skirata and his clan escape when Palpatine issued a warrant for the arrest of Skirata. Obrim was also well aware of the dangers of being a police officer on Coruscant, and he had a security system in his house to protect his family from the many enemies he had made during his tenure."}, {"tag": "h3", "text": "Tan Divo"}, {"tag": "p", "text": "Tan Divo held the rank of lieutenant and served as an inspector for the CSF during the Clone Wars. A dedicated law officer, Divo believed that without rules, order could not exist. Throughout his investigation of the murder of Senator Onaconda Farr, Divo went by the book. He was very annoyed when Senator Padmé Amidala did not inform him that she was conducting her own private investigation, and felt that her actions were thus out of line since he was the investigator and she was not. Divo had a dry sense of humor, and was very logical and analytical. When he believed that he had the right answer based on the evidence, he would pursue it with enthusiasm, sometimes to the point of blindness for other theories. As with most police officers, he showed a dislike for paperwork."}, {"tag": "h3", "text": "Kadir"}, {"tag": "p", "text": "Kadir was a Moff in command of the CSF and its stormtrooper units by 1 BBY. He was an ambitious Imperial officer who resented anyone who questioned his authority. When Darth Vader ordered a whole battalion of stormtroopers to accompany Grand Moff Tarkin to the Death Star because of their shooting accuracy, Kadir objected because the stormtroopers had been assigned to the CSF. However, when Vader threatened Kadir with execution, the Moff consented; although he retained hostile opinions toward the Sith. He joined a conspiracy with Grand Moffs Trachta and Bartam, General Skosef, and an assassin named Gauer to kill the Emperor and Darth Vader. His ability to manipulate and maneuver people and politics was evident as he remained in the background of the disagreement over power between Trachta and Bartam. Trachta was eventually assassinated by Gauer and Skosef executed Bartam only to be killed by a stormtrooper guard himself, so Kadir thus took over leadership of the conspiracy, a plot that aimed to use clone stormtroopers not loyal to the Emperor to overthrow both Palpatine and Vader. However, the plot failed when most of the stormtroopers were killed by the Royal Guard and Palpatine himself. Kadir, fixated with killing Palpatine, attempted to shoot him with a blaster, but the shot missed the Emperor, who executed the Moff with Force lightning."}, {"tag": "h3", "text": "Lon Shevu"}, {"tag": "p", "text": "Lon Shevu held the rank of Captain and was in command of the emergency response center for Galactic City until he was transferred to the GAG. Shevu was a dedicated police officer who was known for not shying away from tough situations. He had strong principles on how to treat suspects and how a police force should operate. Shevu thus did not approve of Jacen Solo's methods—including Solo's treatment of Ben Skywalker as an adult, even though the boy was only fourteen, and Solo's brutal interrogation methods—and constantly came into conflict with them. Eventually, this turned him into a double agent; Shevu used his high position in the GAG to spy on Solo for Cha Niathal and the Jedi. Shevu missed his job with the CSF and wanted to return to it, but he was accidentally killed by the Sith apprentice Tahiri Veila, who released Force lighting on Shevu in an attempt to force Ben Skywalker to reveal information."}, {"tag": "h3", "text": "Chal Tozr"}, {"tag": "p", "text": "Chal Tozr was a male Bith detective with the CSF during the time of the Galactic Alliance. Although he worked well with his partner, Gwad Raatu, Tozr had a tendency to get annoyed and sometimes lost his patience with Raatu—his aggravation often had to do with Raatu's pride and over-suspicious attitude toward other beings. Tozr and Raatu investigated the murder of Jedi Master Tresina Lobi, and when Luke and Mara Jade Skywalker offered their assistance, Tozr gladly accepted, knowing that he would need all the help he could get in confronting anyone who had been able to kill a Jedi Master. Both Tozr and his partner were very much aware of the influence that the Galactic Alliance Guard carried, and when the murderer was traced back to a building registered to the GAG, both detectives were nervous and perceived the situation as over their heads."}, {"tag": "h3", "text": "Gwad Raatu"}, {"tag": "p", "text": "A Rodian, Gwad Raatu served as a detective with the CSF during the reign of the Galactic Alliance. He was characterized by his frequent suspicions of everyone around him as well as a somewhat proud attitude of both his abilities as a detective and the CSF's authority on Coruscant. Consequently, these attitudes made him wary of Jedi. Raatu also had a very cynical outlook on life, which bred in him a rather dry humor. His partner frequently became annoyed with him over many of these characteristics and attitudes, serving as a nullifying and balancing influence on Raatu. As a Rodian, Raatu's hunting instincts served him well as a detective, and he took great pleasure in chasing down leads and suspects."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Coruscant Security Force first appeared in three novels of the X-Wing series that were written by Michael A. Stackpole. First identified as the \"Coruscant Constabulary,\" they appeared or were mentioned in X-Wing: Wedge's Gamble, X-Wing: The Krytos Trap, and X-Wing: The Bacta War, published on May 2, 1996, October 2, 1996, and February 6, 1997, respectively. Specifically the novel Wedge's Gamble noted that the Coruscant Constabulary worked with stormtroopers to provide security on the capital. However, the \"civilian\" constabulary appeared to be intended as comparatively small in number and unable to handle policing on their own, as the loss of stormtroopers to augment security becomes a vital plot point in The Krytos Trap. This retconned the 1997 special edition of Star Wars: Episode VI Return of the Jedi into becoming the CSF's first visual appearance in the form of brief shots of a stormtrooper being attacked by revolting Coruscanti. This storyline was also continued in the comic series Star Wars: Mara Jade – By the Emperor's Hand, published beginning in 1998, which explained that Ysanne Isard subsequently took control of Coruscant's security forces and brutally put down the revolt using Coruscant security stormtroopers."}, {"tag": "p", "text": "The CSF would next appear in and were first identified as the \"Coruscant security force(s)\" in the Shadows of Coruscant section of the Star Wars Roleplaying Game Core Rulebook, published in November of 2000. The Jedi Apprentice books The Deadly Hunter (December 2000) and The Evil Experiment (February 2001) were the first novels to expand the CSF beyond a brief mention and included police officers as part of the main storyline. They also referred to the CSF as \"Coruscant security force\" or \"Coruscant security\" using lowercase letters. These books were closely followed by Edge of Victory II: Rebirth (July 2001), which established the continued existence of the CSF (named as \"Coruscant Security\", uppercase) during the New Jedi Order era, after the capture of Coruscant by the New Republic. Though not mentioned by name, in the film Star Wars: Episode II Attack of the Clones which was released on May 16, 2002, Anakin Skywalker states that protection is supposed to be the job of the \"local security.\""}, {"tag": "p", "text": "In the December 2002 Star Wars: Bounty Hunter video game, the CSF became a major character in the overall story. In the Star Wars: Bounty Hunter: Prima's Official Strategy Guide (published in November prior to the game's release), they were identified as the \"Coruscant Security Police Force\". However, during the game they were simply referred to as the \"Coruscant Police Force\" or \"Coruscant Police\". The comic series Star Wars: Empire: Betrayal, published from September 2002 to January 2003, continued building on the story of stormtroopers on Coruscant who were assigned to the CSF (referred to as \"Coruscant Security\") along with the civilian police officers versus the palace guard stormtroopers and other military detachments. The series also added an extra dimension to the relationship of Coruscant Security with the rest of the military and the Empire. It established a history of rebellion by the Coruscant Security leadership. This theme also was later expanded in the Databank entry for Tian Chyler and other later published material."}, {"tag": "p", "text": "The CSF was mentioned in three novels (as \"Coruscant Security\") by Jude Watson: Legacy of the Jedi (August 1, 2003), Jedi Quest: The School of Fear (February 1, 2003), and Jedi Quest: The False Peace (July 2004); however, they did not play another major role in a work until 2006. That year, publication began on the Republic Commando series and the Star Wars: Legacy of the Force series. The Republic Commando series was written by Karen Traviss, and beginning with the first novel, Triple Zero, it first used \"Coruscant Security Force\" as the full official name as well as establishing the \"CSF\" abbreviation. The Republic Commando series delved deeper into the CSF's ranks, presenting new characters and revealing the loyalties that many CSF police officers had for the clone troopers during the last days of the Old Republic, as well as their resentment of Palpatine. The CSF was written as a dedicated and hardworking police force that was nevertheless barely able to deal with the threats that a war on the home front presented. This explanation necessitated the intervention of clone troopers and provided the backdrop for much of the clone commandos' activities on Coruscant."}, {"tag": "p", "text": "As the Republic Commando series continued, the CSF's strained relationship with the Jedi and Palpatine was further explored. The last novel in the series, Imperial Commando: 501st, published in October 2009, explored the CSF in the early Imperial era. Stripped of much of its power and resources to fight everyday crime, CSF officers' resentment of Palpatine is a recurring theme. The Legacy of the Force series cast the CSF in a similar light as the Republic Commando series. Again facing threats to the home front, the CSF was portrayed as capable of taking action but removed from that responsibility for political reasons. The theme of CSF officers being resentful and at the same time grateful for Jedi assistance was carried over into the series, and a view into the power structure and power struggles on Coruscant was given as well. The second novel in the series, Bloodlines, where much of this played out, was also written by Karen Traviss."}, {"tag": "p", "text": "The CSF received an entry in The Complete Star Wars Encyclopedia published on December 9, 2008. Though the entry was short, it listed them as \"Coruscant Security Force (CSF),\" confirming both the full name and the abbreviation. However, the next several novels to feature the CSF starkly deviated from previously established canon. The Coruscant Nights trilogy written by Michael Reaves, which began publication in June 2008 and ended in January 2009, named the CSF as the \"Imperial Sector Police\" and called by the characters as \"planetary police\" or \"sector police.\" Reaves also used \"constabulary\" when referring to them, harking back to the X-Wing series. However, Reaves' follow-up novel to the series, The Last Jedi, published on February 26, 2013, had lessened usage of \"Imperial Sector Police\" and instead, more often than not, used the term \"Coruscant Police.\" Reaves also focused more fully on his police character he had introduced in the triology, Pol Haus, and his efforts to help the underground resistance against Palpatine."}, {"tag": "p", "text": "The Star Wars: The Clone Wars television series brought the CSF to the screen for the first time since the retcon in the special edition of Return of the Jedi. In the episode \"Lightsaber Lost,\" which aired in 2010, the police droids were first introduced. The droids were based on the Keystone Kops, a series of silent film comedies about an incompetent group of policemen. The droids also played a prominent role in the episode \"Senate Murders,\" and the episode commentary for \"Senate Murders\" states that the police droids had been used by the CSF for a long time before being phased out by the time of the events of Star Wars: Episode III Revenge of the Sith."}, {"tag": "p", "text": "\"Senate Murders\" also introduced Tan Divo, a detective who was cast as an \"old school,\" \"by the book\" police officer, yet who had a slightly comical element to him. The online Star Wars Encyclopedia entry for Tan Divo stated that he was an officer with the \"Coruscant Security Force.\" However, other entries for CSF entities, including the Coruscant Underworld Police, the police droids, and the Republic police gunship, called the CSF the \"Coruscant Police.\" Specifically, the entry for the Republic police gunship named it the \"Coruscant police force\" and detailed the relationship between mechanical and organic CSF cops and their Coruscant Guard (clone trooper) counterparts. \"Pursuit of Peace\" revealed that the CSF's emergency call number was 9–1–1, which is also the emergency number for North America. \"Pursuit of Peace\" also shows a police droid drinking an unidentified substance. Whether or not the scene was to be taken seriously or as comic relief remains to be clarified."}, {"tag": "p", "text": "With the launch of the MMORPG Star Wars: The Old Republic on December 20, 2011, new areas of the CSF's history were explored. The in-game codex entry for the CSF revealed that they were among the oldest planetary police forces in the Republic and explored their relationship with the Coruscanti citizens. The game was the first time in Star Wars media where the CSF made an extensive and detailed appearance with numerous storylines that explored CSF characters, the opinions, histories, and personalities of those officers, their relationships with citizens and criminals, the history of the CSF as a whole, and their activities and relationship with the government during and after the war. Other details included a new Old Republic era symbol, the title of Chief of Security, a different uniform design, and more. The game also interchangeably referenced the CSF as \"Republic Security\" and \"Coruscant Security\" though it never used the actual \"CSF\" abbreviation. As Coruscant is a Republic \"light side\" affiliated world, this article assumes that all storylines referenced under the game mechanics section of this article end with the \"light side\" choice."}, {"tag": "p", "text": "While the CSF appeared in the Fate of the Jedi series, notably in Backlash by Aaron Allston and published on March 9, 2010 and Apocalypse by Troy Denning published on March 13, 2012, the usage of its full name as well as the \"CSF\" abbreviation was not used and the novels returned to referring to the CSF simply as \"Coruscant Security\" or \"Security\" as was done prior to the Republic Commando and Legacy of the Force series. With the establishment of the \"new canon,\" on April 25, 2014, overseen by the Lucasfilm Story Group, most of the material featuring the CSF was rebranded under Star Wars Legends and the canon appearances reduced to the brief mention in Attack of the Clones, the storylines in The Clone Wars, and a short story published in Star Wars Insider 151 under the new canon banner entitled One Thousand Levels Down."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}