{"url": "Coruscant_campaign", "categories": ["Category:Legends articles", "Category:Battle stubs", "Category:Articles needing additional sources", "Category:Battles of the Coruscant campaign", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Coruscant campaign"}, {"tag": "p", "text": "During the Galactic Civil War, as a culmination of their multiple campaigns over the last two years after the Battle of Endor, the New Republic launched a campaign in 6 ABY to capture the galactic capital of Coruscant."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "By the middle of 6 ABY, the New Republic had encircled the Core Worlds and was finally, in a position to seize Coruscant from Imperial rule. The New Republic realized the importance of Coruscant beyond its mere designation as \"000\" in galactic charts. The planet was the most densely-populated ecumenopolis in the galaxy and controlled two of the galaxy's five most heavily trafficked super-hyperroutes. Possession of the system would massively increase the New Republic's legitimacy. To this end, the New Republic began a complex campaign aimed at isolating Coruscant."}, {"tag": "h2", "text": "The campaign"}, {"tag": "h3", "text": "The feint at Talasea"}, {"tag": "p", "text": "Deployed from Folor Base in the Commenor system, the New Republic's elite starfighter unit Rogue Squadron moved to a new base on the uninhabited world of Talasea. There they were to begin operations as a feint to draw the Empire away from Admiral Gial Ackbar's true target, the Colonies world Borleias, codenamed \"Blackmoon\"."}, {"tag": "p", "text": "En route to Talasea Base, however, Rogue Squadron was coincidentally pulled out of hyperspace in the Chorax system by the Interdictor cruiser Black Asp, which was attempting to capture Mirax Terrik's smuggler ship Pulsar Skate. In the resulting battle, the Rogues rescued Terrik, but also allowed the Empire to identify the X-wings as belonging to Rogue Squadron. The Imperial Intelligence agent Kirtan Loor was tasked by Ysanne Isard to locate and destroy the Squadron."}, {"tag": "p", "text": "Loor tracked Rogue Squadron to Talasea, and the Squadron only survived the subsequent Imperial raid on the planet thanks to Admiral Devlia's incompetence. Admiral Gial Ackbar swiftly evacuated Talasea and Rogue Squadron was relocated to Noquivzor after a retaliatory raid that killed Devlia at Vladet and forced the Empire to commit numerous resources to rebuilding its headquarters in that sector."}, {"tag": "h3", "text": "The battles of Borleias"}, {"tag": "p", "text": "With the Talasea feint a failure, Ackbar devoted all efforts to the capture of Borleias. The planet was a vital stepping stone on the Namadii Corridor to Coruscant. Bothan Spynet agents under the command of General Laryn Kre'fey had determined from Imperial HoloNet transmissions that the planet was weakly defended. However, the Bothans were unaware that Imperial General Evir Derricote had secretly increased Borleias' defenses in order to protect his own illegal Alderaan Biotics facility, among other things, drastically increasing the power on the planet's deflector shield. Additionally, Derricote had become aware of the Bothans' spying operation and had been feeding them false information for some time."}, {"tag": "p", "text": "Additionally, Kirtan Loor had previously identified Borleias as the likely site of a New Republic preparatory attack for the advance on Coruscant. Ysanne Isard sent him to Borleias, and Loor mistakenly believed that she too was aware of his conclusions. In fact, Isard sent Loor only to spy on Derricote, who she believed possessed horticultural and scientific skills that could be developed into a bioweapon against the New Republic. Had Loor shared his theory with Isard, she would have dispatched a greater defense force with more resources to utterly destroy the attacking New Republic forces."}, {"tag": "p", "text": "Regardless of Imperial miscommunication, the First Battle of Borleias was a disaster for the New Republic: the unanticipated strength of the deflector shield meant that Kre'fey's plan to bombard the Biotics facility from orbit was a failure. The New Republic lost two capital ships, Kre'fey was killed, and Rogue Squadron had to be rescued by General Horton Salm's Y-wings to escape. However, Loor and Isard's miscommunication meant that the Star Destroyer Eviscerator was not in the system during the battle, when it could have destroyed the entire New Republic force."}, {"tag": "p", "text": "Several weeks later, the New Republic launched a feint in the Venjagga system, targeting Jagga II, which produced missiles for the Imperial Navy. The attack lured the Eviscerator away from Borleias, and with an improved plan, Rogue Squadron attacked Borleias again. Hiding behind a meteor shower from the planet's moon, Rogue Squadron successfully severed the deflector shield's power conduit. With the cornerstone of their defenses destroyed, the Imperial defense collapsed and the Second Battle of Borleias was a Republic victory."}, {"tag": "h3", "text": "The Liberation of Coruscant"}, {"tag": "p", "text": "With Borleias captured, Admiral Ackbar was now in a position to assault Coruscant directly. However, the capital was protected by a powerful planetary shield. Before the attack could begin, the shields would have to fall. Wedge Antilles and Rogue Squadron were sent undercover into Imperial City to sabotage the shield generator. Sixteen of the galaxy's worst criminals, including former Moff Fliry Vorru and gangster Zekka Thyne were also freed from the prison colony of Kessel and loosed on Imperial City so that they could create trouble for Imperial authorities."}, {"tag": "p", "text": "Meanwhile, Rogue Squadron decided that if they could condense a large amount of water and create a super storm, they could destroy the energy shield protecting Coruscant with lightning strikes. The Rogue operatives hijacked a construction droid to take them to the command building. There, they took remote control of one of Coruscant's orbiting solar mirrors. The tightly-focused light beam from the solar mirror rapidly boiled one of the planet's reservoirs. This caused a huge storm and the shields soon collapsed."}, {"tag": "p", "text": "With the shields down, a New Republic force led by Admiral Ackbar entered the Coruscant system. This task force easily overwhelmed the Imperial force, since Ysanne Isard kept only a few Imperial-class Star Destroyers to defend the capital world. Very soon, Coruscant was in the hands of the New Republic."}, {"tag": "h3", "text": "Operations against Zsinj"}, {"tag": "p", "text": "Concurrent to operations against Coruscant was a series of raids into the New Republic's rear by Warlord Zsinj, the former Grand Moff of the Quelii Oversector who had carved out his own dominion after Palpatine's death at Endor. Battles were fought at Mrisst and Noquivzor that cemented Zsinj's growing reputation as a dangerous opponent to the New Republic."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though the New Republic had taken Coruscant, the Empire was not finished. Many Imperial leaders became independent warlords, of whom Zsinj had emerged as the most dangerous. Isard was not found in the Imperial Palace. Worse, the planet's Non-Human population was being killed by an artificial pathogen called the Krytos virus. The virus was Isard's final attempt to undermine the leadership of the New Republic, and she fled to Thyferra to continue her struggle. The New Republic government was forced to spend billions of Credits on bacta in an effort to treat the plague, which Isard, having maneuvered to be elected Head of State of Thyferra, was able to control. Rogue Squadron resigned their commissions en masse to continue the war against Isard, and the so-called \"Bacta War\" ended with Isard's defeat at the Battle of Thyferra and the Republic securing the bacta supply."}, {"tag": "p", "text": "The Republic would later regret its decision to release criminals on to Coruscant, since they criminals would later resurrect the criminal syndicate Black Sun."}, {"tag": "h2", "text": "Battles"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}