{"url": "Coruscant_civil_war", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles with conjectural titles", "Category:Battles of Coruscant", "Category:Battles of the Galactic Civil War", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Coruscant civil war"}, {"tag": "p", "text": "After the death of Galactic Emperor Palpatine at the Battle of Endor, a civil war broke out on Coruscant, the capital of the Galactic Empire, when celebrating crowds turned into riots when confronted with brutal repression. In the ensuing months, whole sectors of Coruscant freed themselves from Imperial rule supported by rebel fighters as the Imperial forces, mostly stormtroopers and the Imperial Security Bureau led by Grand Vizier Mas Amedda, remained entrenched in government districts. The New Republic imposed a blockade over the planet, and eventually the fighting reached the Federal District and Mas Amedda was placed under house arrest inside his Imperial Palace quarters. Once he was freed by Rebel youths, he officially signed the surrender of the Empire with the Galactic Concordance, ending the civil war. Amedda was installed as a figure head of a provisional government with New Republic overseers."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During a large battle on the planet Endor, the Rebel Alliance defeated the Galactic Empire, destroying the second Death Star where Emperor Palpatine and his Sith apprentice Darth Vader died. With both the Emperor and Vader dead, the citizens of Coruscant celebrated, pulling down statues of Palpatine, overwhelming the stormtroopers on the streets, and setting off chimes and fireworks. In response, Coruscant police forces on speeders entered Monument Plaza and opened fire on the crowds without warning, killing many who were present. The Coruscanti erupted into rioting and some climbed edifices to jump onto the police speeders. One officer was flung from his speeder to the plaza's ground while another was struck in the head with thrown debris. The other police speeders retreated as blaster fire and fighting erupted across the capital between Coruscanti and the Imperial security forces."}, {"tag": "h2", "text": "Civil war"}, {"tag": "p", "text": "During the fighting that erupted, Rorak was killed by Imperial Commander Orkin Kaw. Rorak's son Jak determined to seek vengeance and joined the Anklebiter Brigade, a group of children familiar with the inner workings of Galactic City and who passed on information to Rebel fighters. He then staged a rescue from police custody of Lazula, the women of Level 1313 crime lord Talvee Chawin, in order to gain the crime lord's favor. Using the favor as leverage Jak negotiated the procurement of an EMP device that he planned to place at the abandoned Dex's Diner to disable the power grid underneath the Imperial forces fighting the Rebels for control of Coco-Town. Jak hoped to use the loss of power and the subsequent Rebel attack as a distraction to kill Kaw and take revenge for his father's death. The Rebels were eventually able to capture CoCo Town from Imperial forces."}, {"tag": "p", "text": "In the ensuing months the New Republic was formed and re-established the Galactic Senate on Chandrila. Meanwhile Coruscant dissolved into a true state of civil war with some sectors remaining free from Imperial control and its citizens entrenching themselves with Rebel resistance fighters while other sectors actively fought against their neighbors and supported the Imperial forces. As the Empire fractured all over the galaxy, Grand Vizier Mas Amedda took control of Imperial forces on Coruscant. However, the Imperial Navy withdrew support from the throne world as Fleet Admiral Gallius Rax refused to allow Grand Admiral Rae Sloane, the figurehead of the Navy, to send reinforcements seeing the planet as a part of the decay Rax wished to separate from to make room for his new vision of the Empire. In this vacuum, the Imperial Security Bureau was left to coordinate Coruscant's Imperial forces and so Amedda remained an administrator with little true power in the overall Empire beyond Coruscant."}, {"tag": "p", "text": "The ISB established a nominal blockade around the planet utilizing ISB spaceships and coordinated the efforts of the security forces and stormtroopers. Areas with vital government buildings such as the Verity District and the neighboring Federal District were heavily fortified with checkpoints and barricades manned by stormtroopers and the area skylanes were diverted with ISB craft flying patrol. While the Federal District was relatively secure the other Imperial sectors and fortifications fell prey to continual attacks with the rebel soldiers and Coruscanti fighting a guerrilla war against the Imperials. Amedda, in his despair and desperation, sought to turn himself over to New Republic Chancellor Mon Mothma and Princess Leia Organa. However they refused to take him prisoner instead insisting that he find a way to capitulate the Empire and sign a full surrender."}, {"tag": "p", "text": "As the fighting intensified, Imperial forces steadily lost ground as they had no continual support from outside Imperial forces. Eventually the ISB placed Amedda under house arrest in quarters of the Imperial Palace as the fighting reached the Federal District. A group of youths from the Anklebiter Brigade managed to sneak their way into the palace and freed Amedda. Having lost all hope of Imperial victory in the greater war, Amedda contacted Mon Mothma."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "At the Battle of Jakku, the New Republic engaged and defeated the vast majority of the Empire's armed forces, though mop-up fighting lasted for several months. The Galactic Concordance was signed and saw the surrender of the Empire to the Republic, with one of the conditions involving the handover of the throneworld of Coruscant to the fledgling galactic government. However, it was decided by the Senate that all worlds would have an equal say in their government, in which member worlds such as Chandrila and Hosnian Prime would host the Republic's capital on a rotating basis rather than Coruscant alone. Mas Amedda was installed as a figurehead of a provisional government for Coruscant which was also given membership in the Galactic Senate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}