{"url": "Coruscant_riots_(3653_BBY)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Events of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Coruscant riots  (3653 BBY)"}, {"tag": "p", "text": "In the aftermath of the Sacking of Coruscant in 3653 BBY, riots broke out across the Galactic Republic's capital planet Coruscant. Caused by a lack of food, lack of police presence, and refugees desperate for supplies the unrest ripped through Galactic City adding to the damage caused by the Imperial forces. Though eventually put down by the Republic Military, the riots resulted in the take over of the Old Galactic Market by refugees and the Migrant Merchants' Guild, the formation of Black Sun and its own territory, the eventual formation of vigilantes known as the Justicars' Brigade, and the withdrawal of the Coruscant Security Force's presence in Coruscant's lower levels."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "With the Sacking of Coruscant, the Sith Empire decimated the Republic's defenses. Republic soldiers and the remaining Coruscant Security Force police officers retreated to lower areas to protect refugees. As the Imperial forces left the looted and destroyed planet, the Republic attempted to re-establish control."}, {"tag": "h2", "text": "Rioting"}, {"tag": "p", "text": "With the lack of food, the angry, starving population turned to rioting. Homeless refugees from the lower levels swarmed the Old Galactic Market seeking shelter. With the already decimated police unable to control the situation, Republic military forces were called in. As they attempted to push refugees out of the Galactic market, rioting broke out. Later, a money laundering gang called the Migrant Merchants' Guild imposed its own order on the Galactic Market as its thugs demanded protection payments from the refugees. The Galactic Senate ordered the Coruscant Security Force to pull back from the lower levels to protect the Senate Building and other vital infrastructure from the rioting. Seeing an opportunity, a criminal syndicate later known as Black Sun began seizing control of the lower areas."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Republic Military intervention quelled the riots and CSF police forces regained control of various areas including sections of the Galactic Market. Later attempts were made to regain control. Other sectors however were lost to continued gang violence, rioting, and vigilantes for years to come."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}