{"url": "Coruscant_provisional_government", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles with conjectural titles", "Category:New Republic-aligned governments", "Category:Planetary governments"], "nodes": [{"tag": "h1", "text": "Coruscant provisional government"}, {"tag": "p", "text": "The Coruscant provisional government was an interim governmental authority established on the Core World Coruscant in the aftermath of the Galactic Civil War. Throughout the reign of the Galactic Empire, Coruscant was the political and cultural center of the galaxy. With the death of Galactic Emperor Darth Sidious in 4 ABY, however, the planet fell into a state of civil war as rebellious citizens fought against Imperial forces across much of Coruscant. During the conflict, the Emperor's nominal successor, Grand Vizier Mas Amedda, was imprisoned in the Imperial Palace by forces loyal to Fleet Admiral Gallius Rax, who seized power as the self-styled Counselor to the Empire. Following the Battle of Jakku, the Empire was represented by Amedda at the signing of the Galactic Concordance, a peace treaty that officially ended the war in 5 ABY. As a result, the Empire ceded control of Coruscant to the New Republic, which ultimately broke with a millennia of tradition in which Coruscant was the center of galactic power. The Republic's capital shifted between its member worlds on a rotating basis, leaving Coruscant under the nominal rule of a provisional government with Amedda as its figurehead."}, {"tag": "p", "text": "Coruscant remained with the Republic for decades, becoming entangled in the politics of the Galactic Senate as well as the rivalry between Centrists and Populists, the two major factions with diametrically opposed political standpoints. At the time of the Napkin Bombing in 28 ABY, both of Coruscant's senators, Arbo and Orris Madmund, supported the Centrist faction."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Throughout the millennia the galaxy's political power was concentrated in the Core World Coruscant, and the alleged homeworld of humanity became a galactic hub of cultural diversity from the age of the Galactic Republic to the reign of the Galactic Empire. When Galactic Emperor Darth Sidious was killed in the Battle of Endor in 4 ABY, the Empire splintered into various political and military factions such as Governor Ubrik Adelhard's domain in the Anoat sector. At the same time, the Alliance to Restore the Republic capitalized on its victory at Endor by reforming itself into the New Republic. Meanwhile, the Empire's authority became increasingly diminished across the galaxy."}, {"tag": "p", "text": "Coruscant fell into a state of civil war between Imperial forces and Rebel factions fighting for control of the Federal District as well as other government sectors. Grand Vizier Mas Amedda sought to negotiate his personal surrender to the New Republic. He secretly met with a Republic delegation on Velusia during the final months of the war, seeking amnesty for his role in the Emperor's regime. Neither Chancellor Mon Mothma nor Senator Leia Organa were willing to settle for Amedda alone, however, and demanded that he instead surrender the whole of the Galactic Empire. Their conditions left the Grand Vizier stunned; despite his legal authority, he did not have the power to force the Empire to capitulate."}, {"tag": "p", "text": "Amedda returned to Coruscant where he contemplated suicide, knowing that the Republic would not accept a treaty unless he could give them the Empire's unconditional surrender. As Amedda's influence waned, Fleet Admiral Gallius Rax assumed de facto control of the state as the self-styled Counselor to the Empire. His supporters on Coruscant seized custody of Amedda and placed him under house arrest in the Imperial Palace, forcing the Grand Vizier to become Rax's figurehead for propaganda purposes."}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "Within a year of the Emperor's death, the Empire was decisively defeated by the Republic at the Battle of Jakku, resulting in the death of Counselor Rax. Though a few Imperial remnants continued to persist in their resistance, the Galactic Civil War came to an end in 5 ABY. Following the end of Imperial rule on Coruscant, a provisional government was established on the capital planet of the former Empire—under the leadership of Mas Amedda. The Grand Vizier represented the Empire at the signing of the peace treaty, known as the Galactic Concordance, on the former Republic capital of Chandrila. The Republic in turn allowed Amedda to resume his rule on Coruscant, but only as a powerless figurehead."}, {"tag": "p", "text": "The conditions of the Concordance required the Empire to cede control of Coruscant to the Republic, with a planetary provisional government being permitted to form on the former Imperial capital while the remaining old establishment relocated to Imperial-held territories. As such, Republic observers were tasked with monitoring Amedda's government while the Republic itself concentrated on restoring the rule of democracy."}, {"tag": "p", "text": "Despite the restoration of Amedda as the head of Imperial state, the people of Coruscant celebrated the New Republic's victory over the Galactic Empire and the official end of the Galactic Civil War. Unlike before, in the aftermath of the Battle of Endor, the Coruscanti were allowed to celebrate in public. The New Republic encouraged this festive atmosphere that spread across Coruscant and other planets across the galaxy, as a way to distinguish the New Republic Era from the Empire's reign."}, {"tag": "h3", "text": "Disestablishment"}, {"tag": "p", "text": "The provisional government's transitional rule was ultimately followed by the New Republic's annexation of Coruscant, thereby allowing the former Imperial capital to have representation in the Galactic Senate as a member world of the fledgling democracy. During the later years of the New Republic's rule, Coruscant was part of a political bloc that advocated the adoption of a stronger military and centralized government, informally known as the Centrists. By the time of the Napkin Bombing in 28 ABY, Coruscanti political interests were represented by Senior Senator Arbo and Junior Senator Orris Madmund, both of whom supported the goals of the Centrist faction. Senator Arbo was well known for his war hawk views and support of the New Republic Defense Force."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The provisional government of Coruscant was a powerless regime led by a de facto head of Imperial state. The Grand Vizier of the former Galactic Empire, Mas Amedda retained his position for his part in ending the Galactic Civil War. By design of the New Republic, however, he would only serve as a figurehead overseen by Republic officials."}, {"tag": "p", "text": "Coruscant was in a state of turmoil at the time of the provisional government's formation, having experienced a decline in public order and the planetary civil war that followed in the wake of Emperor Palpatine's death. With the signing of the Galactic Concordance and the dissolution of the Imperial government, the provisional government lacked the power to suppress the Coruscanti who celebrated the Empire's downfall. Under the New Republic's oversight, the provisional government allowed the civilian population to openly celebrate in the streets of Imperial City without the threat of reprisal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Coruscant provisional government was first mentioned in the 2017 novel Aftermath: Empire's End, which was written by Chuck Wendig."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}