{"url": "Coruscant_terrorist_attacks_and_riots", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Coruscant", "Category:Battles of the Second Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Coruscant terrorist attacks and riots"}, {"tag": "p", "text": "A series of terrorist attacks and riots occurred in 40 ABY on the galactic capital planet Coruscant that escalated the Second Galactic Civil War. Reflecting the political atmosphere between the governments of the Galactic Alliance and Corellia, tensions had increased on Coruscant between the Coruscanti and their fellow Corellian citizens. The tension boiled over with the bombing of The Elite Hotel that left hundreds dead and wounded. The incident was perceived as a Corellian terrorist attack. Unknown Coruscant supporters retaliated by desecrating the Corellian Sanctuary, a deep blow to the Corellian population."}, {"tag": "p", "text": "Reprisal came from Corellian militants who poisoned the water supply of central Galactic City. The toxin proved to be the deaths of hundreds and left over 5,000 citizens with nerve damage. The event sparked a massive protest outside the Corellian Embassy that quickly developed into a riot. Facing an increasing threat of war, the Galactic Alliance government, under the leadership of Chief of State Cal Omas, saw a need for special action by a security service that could fill the void between the Coruscant Security Force and the military. With the support of Senator G'vli G'Sil of the Security and Intelligence Council, the Galactic Alliance Guard was formed to lead the governmental response to the unrest."}, {"tag": "p", "text": "Following a massive raid in the Corellian portions of Galactic City and subsequent internment of Corellian citizens by the GAG, both sides of the citizenry conflict took to protesting in front of the Senate Building. While CSF forces attempted to protect the Senate Building and keep the two crowds of protesters from each other, the situation dissolved into a riot that was eventually broken by police. Though events on Coruscant had been brought under control, the actions of the GAG and the Galactic Alliance government at large proved to much for the Corellia led coalition of planets and the galaxy broke once more into civil war."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In 40 ABY, the conflict between the Galactic Alliance and Corellia erupted over Corellia's demands for more independence and its refusal to pay Galactic Alliance taxes and to supply military recruits, while simultaneously taking advantage of the Galactic Alliance infrastructure and trade benefits. Coruscant Security Force police officers were present at the Senate Building during a demonstration held by Corellian supporters, although the protest remained peaceful."}, {"tag": "h2", "text": "Terrorism and riots"}, {"tag": "h3", "text": "The Elite hotel bombing"}, {"tag": "p", "text": "At eight in the morning an explosion shook the Senate District. Shortly after that, HoloNet News reported the explosion had occurred in the hotel district south of the Senate and speculated that it had been a bomb. The explosion caused transparisteel to shatter with fierce sharpness, speeders to fall thousands of meters and concentrated shock waves all of which resulted in instant turmoil. The area around the blast suffered a traffic gridlock and parts of Galactic City were sealed off. The first causality count of 105 dead and rising with 300 injured had the Office of the Chief of State declare an emergency."}, {"tag": "p", "text": "From the Galactic City Strategic Center deep withing the Senate Building, the Coruscant Security Force took charge of the response efforts. They were coordinated by CSF Captain Lon Shevu and assisted by personal from Coruscant Fire and Rescue, Galactic City Air Traffic Control, various medcenter managers, and members of the Galactic City Authority. The bomb itself was detonated in The Elite Hotel on Skylane four-four-six-seven and officers from CSF's Tactical and Operational force sifted through the debris looking for evidence. The initial investigation suggested the bombing was the work of a single individual. Though the CSF refused to guess on the identity of the subject and no one claimed responsibility, it was assumed to be a Corellian terrorist."}, {"tag": "p", "text": "Chief of State Cal Omas, who was also present at the Strategic Center, was quickly joined by Jedi Grand Master Luke Skywalker, Jedi Master Mara Jade Skywalker, and Jedi Knight Jacen Solo and the four discussed with Captain Shevu the political implications of the blast. Shevu informed them that the Coruscanti Immigration Service reported nearly twenty million Corellians living on Coruscant. Though the group disagreed over the threat posed by the Corellian residents, it was evident to them that the explosion which ultimately resulted in 634 deaths and hundreds more wounded, could be the beginning of all out war."}, {"tag": "p", "text": "The next day, the Corellian Sanctuary, a resting place for deceased Corellians, was vandalized with marks of paint and plaques of marble smashed. Also, stone-set diamonds created from the cremated remains of Corellians were carved out of the ceiling and stolen from the Sanctuary causing a greater psychological blow to the Corellians than the actual physical damage. The CSF investigation determined it was retaliation for the bombing of the Elite Hotel however they were unable to identify the individuals who performed the vandalism."}, {"tag": "h3", "text": "Water supply attack"}, {"tag": "p", "text": "The following day, Coruscant's water supply was poisoned causing half of central Coruscant's water supply to be turned off. Although Corellian militants claimed responsibility, the water supply was contaminated in areas that included Corellian residents. Throughout the crisis, CSF patrol ships flew throughout various neighborhoods warning citizens not to use the contaminated water. However, in the end the attack resulted in 456 deaths and left more than 5,000 beings with nerve damage."}, {"tag": "h3", "text": "Corellian Embassy riot"}, {"tag": "p", "text": "In response to the attack, a crowed of protesters gathered at the Corellian Embassy. The CSF was mobilized and officers formed a protective line around the embassy. Traffic was diverted and parts of the Senate District were unreachable except on foot. CSF assault ships were brought in to monitor the crowd. As time went on, the demonstration escalated into violence. Initial attempts by the CSF to disperse the crowd yielded no results and the police eventually shot tear gas into the crowds. As the police battled the protesters, Corellian supporters also began attacking the police. One of the police officers was almost shot by a Corellian sympathizer in the crowd. Hasty action by Jedi Ben Skywalker, who deflected the blaster bolt, prevented further escalation that would have resulted from the death of a police officer. In the aftermath of the contamination attack and the riot, the CSF doubled its police patrols of Galactic City in attempt to dissuade further escalation."}, {"tag": "h3", "text": "Formation of the Galactic Alliance Guard"}, {"tag": "p", "text": "After the riot, Galactic Alliance Chief of State Cal Omas offered Jedi Knight Jacen Solo a commission as a colonel and command of the CSF's Anti-Terrorist Unit. However, Solo felt that having civilian police perform the duties of a secret police would make ordinary police work harder. As the CSF had been assaulted by both Coruscanti and Corellians during the Embassy riot, their neutrality and role was in question. However, a strict military response was not seen as a viable solution. The decision was reached to form a separate agency, physically and politically from CSF to perform the duties of rounding up and interning Corellian suspects and fighting terrorist threats by Corellians on Coruscant. The name Galactic Alliance Guard was chosen and the GAG was given emergency powers with Jacen Solo as its commander. In disgust over the formation of the secret police, Supreme Commander Gilad Pellaeon resigned from his post. Several members from CSF's Anti-Terror Unit and shock troopers from the 967 Commando Unit were transferred to the GAG. The first GAG operation began in Jabi Town in the Corellian district of Galactic City. The CSF blocked off several skylane intersections with CSF traffic division repulsorlift ships before the beginning the operation. After the signal was given, the GAG entered several residents led by Jacen Solo and they began the internment process of Corellians. In the aftermath of the raid, the CSF gave the GAG troopers the nickname \"stormies,\" seeing the troopers as reminiscent of the stormtroopers of the Empire."}, {"tag": "h3", "text": "Senate Building riot"}, {"tag": "p", "text": "Later, three days into the Galactic Alliance's Blockade of Corellia, a large protest again took place outside the Senate Building by two groups, one pro-Corellia, the other Coruscanti. The CSF positioned their police line to protect the Senate Building as well as to divide the two hostile demonstrations. The protests soon escalated into violence as the groups clashed and erupted into a full scale riot. Though the situation was brought under control by police action and tear gas, more rioting had broken out in one of the commercial zones of Galactic City and CSF units were quickly redeployed to deal with the unrest."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By the end of the mass civil unrest on Coruscant, over a thousand had died and thousands more were several injured. Riots and other forms of civil unrest continued though not on the scale surrounding the initial terrorist attacks and the formation of the GAG. In the following days and throughout the rest of the war, the GAG continued their operations of seizing and interning Corellians. The government's response by forming the GAG and interning the Corellian population of Coruscant escalated the tensions between the Galactic Alliance and Corellia and tipped the balance sending the galaxy into the Second Galactic Civil War. The authority granted to Jacen Solo as commander of the GAG placed him in a position of power from which he was able to launch a coup d'état placing him in control of the Galactic Alliance. From there he attempted to pursue his vision of the galaxy as the Dark Lord of the Sith, Darth Caedus. Though Caedus was eventually brought down, the war ended, and the GAG disbanded, the actions taken by Caedus and the GAG would haunt the galaxy for years to come."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The riots and civil unrest on Coruscant were described in the Star Wars: Legacy of the Force novel Legacy of the Force: Bloodlines. Written by Karen Traviss and released on August 29, 2006, Bloodlines detailed the escalation of the civil war both militarily and on the domestic front. The events described set the stage for the rest of the Legacy of the Force series including the formation of the Galactic Alliance Guard. Though no official name for the set of events exists, they together form a comprehensive spiral ending in full scale civil war."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}