{"url": "Coruscanti_Immigration_Service", "categories": ["Category:Legends articles", "Category:Galactic Alliance law enforcement"], "nodes": [{"tag": "h1", "text": "Coruscanti Immigration Service"}, {"tag": "p", "text": "The Coruscanti Immigration Service, also known as Customs and Immigration, was the customs and immigration enforcement service for the planet Coruscant during the Galactic Federation of Free Alliances. The agency was charged with verifying the identity of persons wanting to enter Coruscant and they monitored for suspected smugglers and illegal spice operations. They also tracked the levels of immigration and residency of various groups and species on Coruscant."}, {"tag": "p", "text": "During the Second Galactic Civil War between the Galactic Alliance and the Confederation, the immigration service assisted the Coruscant Security Force and the Alliance secret police, the Galactic Alliance Guard, by monitoring for suspected spies and terrorists entering Coruscant. They also provided information on the numbers of species living on Coruscant who may have had ties with the Confederation or were sympathetic to its cause."}, {"tag": "p", "text": "At the start of the Liberation of Coruscant by the Jedi Order from the control of the Lost Tribe of Sith, the Lost Tribe had placed some of its members within the immigration service, unknown to the service's regular officers and inspectors, to identify and capture any Jedi attempting to enter Coruscant. However, their efforts were fruitless and the Jedi were able to infiltrate and reclaim Coruscant."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Coruscanti Immigration Service, also called Customs and Immigration, was an immigration and customs enforcement service for the planet Coruscant under the Galactic Federation of Free Alliances. It was responsible for verifying the identity of all persons entering Coruscant and ensuring their paperwork was in order, monitoring for smugglers, spies, terrorists, and others attempting to enter Coruscant illegally, searching incoming vessels and check their passengers and manifests, operating customs checkpoints at Coruscant's spaceports, and tracking the immigration, emigration, and residency population levels of groups and species on Coruscant."}, {"tag": "p", "text": "Immigration inspectors and their supervising officers, such as captains, were supported at spaceport checkpoints by troopers from Galactic Alliance Security (GAS). The GAS troopers would provide extra manpower for searches and to make arrests should the inspectors need it. Immigration captains also had the authority to order GAS troopers to hold suspects for further investigation. Any information that the immigration service received on suspected smugglers or other wanted persons who made it past checkpoints, was turned over the Coruscant Security Force (CSF) which would then track the suspects through Coruscant's Galactic City and make an arrest if possible."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 40 ABY during the Second Galactic Civil War between the Galactic Alliance and the Confederation, Corellians were closely monitored as suspected terrorists. The immigration service estimated that over twenty million Corellians lived on Coruscant. The number of Corellians caused concern for Galactic Alliance Chief of State Cal Omas who had ordered the newly formed counter terrorism police force, the Galactic Alliance Guard (GAG), to begin interning Corellians. It was at that time that the immigration service received a tip about three suspected Corellian agents and a bounty hunter who had slipped past their checkpoints. The immigration service turned the information over to the CSF which was able to track the four suspects. The information was then given to the GAG who arrested the suspects."}, {"tag": "p", "text": "In 44 ABY the Lost Tribe of Sith had managed to infiltrate Coruscant and had secretly taken over the Galactic Alliance government and Senate as well as many of the planet's vital bureaucracies. Subsequently, the Jedi Order under Grand Master Luke Skywalker planned to enter and liberate the planet. Sith operatives and been planted within the immigration service to monitor for Jedi attempting to enter Coruscant. One Sith in particular posed as a corrupt inspector who took bribes while checking incoming ships. He inspected the passengers of the starliner Plain Lady and cross-examined the Jedi Knight siblings Valin and Jysella Horn, who at the time were disguised. Detecting no falsehood from the sibling's answers through the Force, the Sith inspector allowed them to go their way."}, {"tag": "p", "text": "Meanwhile at the Galactic Center Spaceport, Jedi Knights Yaqeel Saav'etu and Yantahar Bwua'tu, while being questioned by immigration Inspector Modt, had aroused suspicion in the Force by immigration Captain Suhale, who was reality a Sith. Jedi Bazel Warv, seeing the two knights were being questioned by the Sith, was able to find some spice smugglers and convinced them to give him their illegal packages. He then intentionally aroused the suspicion of Suhale who ordered him over the inspection station. Suhale proceeded to question him and ordered that he open the packages and suitcases, believing she had caught several Jedi. However, Inspector Modt, unaware of the maneuvering going on the Force, assumed that in reality the three simply had some form of contraband and showed disdain for his superior's obvious inexperience with dealing with smugglers. When the cases were opened, revealing the Neutron Pixie spice, Modt's assumptions appeared to have been accurate. Suhale, believing the spice to be the reason the three suspected Jedi had been uncomfortable in the Force, ordered them arrested by a GA Security squad. Promising to personally submit it as evidence, Suhale took possession of the high valued spiced, much to the disapproval of Inspector Modt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Coruscanti Immigration Service was first mentioned in Legacy of the Force: Bloodlines, written by Karen Traviss and published on August 29, 2006. It later appeared Fate of the Jedi: Apocalypse, written by Troy Denning and pusblished on March 13, 2012"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}