{"url": "Coruscanti", "categories": ["Category:Canon articles", "Category:Races and species stubs", "Category:Incomplete lists", "Category:Coruscanti", "Category:Planetary cultural groups"], "nodes": [{"tag": "h1", "text": "Coruscanti"}, {"tag": "p", "text": "The Coruscanti were the inhabitants of Coruscant, a city-wide planet and the historic capital of the galaxy during the time of the Galactic Republic and the age of the Galactic Empire. The homeworld of the human species, individuals native to Coruscant included Letta Turmond, Inspector Tanivos Exantor Divo of the Coruscant Security Force, and Supreme Chancellor Finis Valorum. At the end of the Clone Wars in 19 BBY, the millennium-old Republic was replaced by the Empire; a new system that invested absolute power in Galactic Emperor Sheev Palpatine."}, {"tag": "p", "text": "During the early years of the Empire, most Coruscanti were satisfied with the regime shift, particularly those who lived and worked in the upper tiers of Imperial City. If for no other reason, the Coruscanti were relieved to see an end of the devastation brought by the Clone Wars. However, the self-anointed Emperor Palpatine made few public appearances, and a number of Coruscanti confessed to having fond memories for Chancellor Valorum. After the Emperor's death in 4 ABY, Coruscant descended into a state of civil war as many Coruscanti took to the streets of the city, rioting in Monument Plaza to celebrate the end of Palpatine's reign."}, {"tag": "p", "text": "Those who identified themselves as Coruscanti often had what some would consider a superior accent, with it being frequently attributed to propaganda broadcasts, rebel satire, and the Imperial elite during the reign of the Empire. Coruscanti were considered principled, able to verbally parry and weave in debates and politics. According to Chieftain Gruppe, the human females of Coruscant were not known to carry or deliver their own progeny. Instead, they hired others to do so for them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}