{"url": "Coruscant_weather_control", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Atmosphere and weather technology"], "nodes": [{"tag": "h1", "text": "Coruscant weather control"}, {"tag": "p", "text": "A weather control system manipulated the weather of Galactic City on the planet Coruscant, the capital of the Galactic Republic and later the Galactic Empire. Coruscant thus had an artificial, temperate climate."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Climate solution"}, {"tag": "p", "text": "Coruscant's relatively far orbit from its small sun posed a not particularly habitable climate for many species, although the use of technology and the vast amount of heat generated by the multi-leveled city overcame this issue. However, the troposphere-piercing buildings that covered the galactic capital's surface affected its weather patterns to the extent of creating unusual and unpredictable microclimates through large, dichotomous differences in temperature and air pressure between the higher and lower altitudes within the tallest of buildings."}, {"tag": "h3", "text": "Air of the wealthy"}, {"tag": "p", "text": "The air in the city's upper levels was filtered, with the rich air being breathed by wealthy citizens of the Core World. However, the Coruscant undercity, buried by the constant upwards growth of skyscrapers and the resulting addition of megastructure levels to the sprawling planetary metropolis, had no such system, and its inhabitants instead inhaled the barely breathable toxic fumes produced by millennia of the planet-wide cityscape's vehicle and factory waste. Residing within their room in a low-level sector, the typical Coruscanti lived on artificial air. As remembered by Imperial officer Wilhuff Tarkin, Coruscant's weather control was one of the many luxuries the Galactic City possessed that his homeworld of Eriadu lacked."}, {"tag": "p", "text": "Despite the weather control, the richest of citizens in Galactic City breathed high-grade, purified gas of their preferance, and their buildings were routinely scanned for issues in relation to the purity of gas, which were handled by quality-control droid teams. Many regular visitors from off-world also chose to bring private supplies of air for their stay."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The weather control system cleansed the Federal District's skyscrapers during the Imperial Era, leaving its towering structures shining like new before clearing clouds away. Seen from space, the planet's hazy cloud cover only slightly dimmed the artificial lights of Coruscant. Rain also touched other areas of the Galactic City. A lightning storm took place over the Republic Center for Military Operations during Ahsoka Tano's escape from the Republic military base at the time of the Clone Wars, and a large grey cloud prevailed over the Temple Precinct as the Jedi High Council discussed assassinating the Confederacy of Independent Systems' Head of State Count Dooku to end the galactic conflict, the Jedi Grand Master Yoda using an analogy between the cloud's covering of Coruscant's sun and all life to justify the Council's decision. Just after the end of the war and the founding of the Galactic Empire, rain fell over Darth Vader as he was admitted to the Grand Republic Medical Facility."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Coruscant weather control was first mentioned in the 2014 novel Tarkin, which was authored by James Luceno. In the Star Wars Legends continuity, Coruscant Weather Control referred to the Coruscant WeatherNet, an organization responsible for weather conditions on Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}