{"url": "Corva_sector/Legends", "categories": ["Category:Legends articles", "Category:Corva sector", "Category:New Republic sectors", "Category:Outer Rim Territories sectors"], "nodes": [{"tag": "h1", "text": "Corva sector"}, {"tag": "p", "text": "The Corva sector was a sector in the Outer Rim Territories, near the territory of the Pentastar Alignment. A number of its systems were connected by the Daranc Run hyperlane which ran through the middle of the sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early years of settlement in the sector, a colony on the planet Corva, located in the Galaanus system, was infested by clodhoppers from Naboo. Before the infestation was discovered, the insectoid pests had devastated the planet's ecosystem, and consumed the majority of the colonists."}, {"tag": "p", "text": "After the defeat of Grand Admiral Thrawn, the New Republic gained a significant foothold in the sector, with a Sector Fleet commanded by Captain Naren Bluuis. Based on the carrier cruiser Nova, Bluuis kept a close eye over developments in the sector. This included the surfacing of an ancient Kashi Mer relic found by the Gotal crime lord Mahk'khar, which Bluuis dispatched a number of agents to retrieve."}, {"tag": "p", "text": "Bluuis also confronted a growing Imperial splinter movement that assaulted his forces in the Battle of H'ken asteroid belt. This movement, known as the Kaarenth Dissension, strongly advocated alien dominance, proving popular with many of the sector's alien inhabitants. Bluuis dispatched further agents to root out the Dissension's agitators, eventually discovering their fleet—and shipyard—hidden in the Spawn Nebula. Infiltrating the shipyard, the agents managed to destroy it, creating a large shockwave that ruined the amassed fleet."}, {"tag": "p", "text": "The New Republic Corva sector fleet contained the cruiser Nova as its flagship, a Trianii RX4 Patrol Ship named the Instigator, at least one squadron of X-wing starfighters, and numerous other starships."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}