{"url": "Corvax%27s_descendant", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Captains", "Category:Individuals of unspecified gender", "Category:Smugglers", "Category:Unidentified criminals", "Category:Unidentified Force-users", "Category:Unidentified humans"], "nodes": [{"tag": "h1", "text": "Corvax's descendant"}, {"tag": "p", "text": "A human smuggler operated as the captain of the starship Windfall, along with the droid ZO-E3. The smuggler was unknowingly Force-sensitive, and was a descendant of Lady Corvax, an ancient resident of the planet Mustafar. Seeking out the descendants of Corvax, Darth Vader had Imperial Admiral Gable Karius use an Interdictor vessel to pull the Windfall out of hyperspace above Mustafar and capture the smugglers, taking them to his fortress. With the help of the Mustafarian Vylip F'alma, the smuggler and ZO-E3 escaped, discovering Corvax's sanctum in the caverns of the planet."}, {"tag": "p", "text": "Eventually taking command of The Marching Horde, the smuggler helped lead an attack on Fortress Vader. The Dark Lord of the Sith was attempting to activate the Bright Star, hoping it would resurrect his wife, Padmé Amidala. The smuggler stopped Vader and destroyed the artifact, which meant Mustafar would be able to heal from its hellish state. Escaping the planet on the Windfall, the smuggler and ZO-E3, after they placed a totem into Lord Corvax's Lightsaber, realized they now had what seemed to be a treasure map."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The smuggler serves as the player character of Vader Immortal: A Star Wars VR Series, a three-part virtual reality series created by ILMxLAB, first appearing in Vader Immortal: A Star Wars VR Series – Episode I."}, {"tag": "p", "text": "As Vader Immortal is played in the first person, and the character has no voice lines, the smuggler's gender is undetermined. The smuggler's name is not given, referred to only as \"Captain\" by ZO-E3."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}