{"url": "Corvax", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Females", "Category:Force-sensitives", "Category:Individuals of unidentified species", "Category:Mustafar residents"], "nodes": [{"tag": "h1", "text": "Corvax"}, {"tag": "p", "text": "Lady Corvax was a Force-sensitive female individual who resided on the planet Mustafar along with her husband, Dorwin. When the latter fell in battle, she attempted to resurrect him by using the Mustafarians' most sacred artifact, the Bright Star. Instead, the energies unleashed completely destroyed the surface of Mustafar. However, a descendant of hers destroyed the Bright Star and freed Dorwin, allowing Mustafar to slowly heal."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Long before the rise of the Galactic Empire, Lady Corvax and her husband, Dorwin Corvax, resided on Mustafar, which was then a lush planet thriving with life, and the two spouses lived in harmony with the natives. One fateful day, however, Mustafar came under attack, and Dorwin fell in battle, sword in hand. Struck with grief, the woman stole the most sacred artifact of the Mustafarians, the Bright Star crystal, to power her Aeon Engine, which she hoped could resurrect her love."}, {"tag": "p", "text": "That attempt, however, utterly failed. Not only was Dorwin cursed to be trapped between the real world and what came after, but the powerful energies that burst from the Bright Star transformed the beautiful planet of Mustafar into a hellscape. Following the incident, Lady Corvax kept the artifact hidden in her sanctum, whose key could only be used by one of her descendants. She hoped that one day, a future descendant would be able to recover the Bright Star, bring it back to the Mustafarians, and perhaps repair some of the damage she had done. During the Imperial Era, one of her descendants, a smuggler who was partially aided by Dorwin, destroyed the artifact, freeing Dorwin from his curse and allowing the planet to slowly heal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}