{"url": "Cosia", "categories": ["Category:Canon articles", "Category:Planet stubs", "Category:Cosian Space planets", "Category:Galactic Empire planets"], "nodes": [{"tag": "h1", "text": "Cosia"}, {"tag": "p", "text": "Cosia was a planet located in the Cosian Space part of the Deep Core, a region of the galaxy, within the system of the same name. Cosia was the only inhabited planet in that system, and served as the homeworld of the Cosian species, which included Jedi Master Tera Sinube. Cosia was home to large forests and rolling hills, containing the immense cosa trees, of which the Cosians built their cities in. All of the villages on Cosia operated independently, so there was no true capital, but the largest city was Nu-Cosa."}, {"tag": "p", "text": "Cosia had many small starports and landing strips, as the Cosians did not boast a formal starport on the planet. One such starport was home to the Imperial occupiers of the world."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Cosia was located in Cosian Space, a region of the Deep Core, the innermost region of the galaxy, in a star system that shared its name. The planet was the only inhabited world in the system, which was home to only one star. Cosia had two moons, Tabu and Tebu, which were exhibited in full view in the nighttime sky."}, {"tag": "p", "text": "The planet was covered in rolling hills that were home to the immense cosa tree, which made up the planet-spanning forests. The cosa tree produced massive palm leaves, over a hundred meters in length. Within those forests were numerous Cosian cities, like the planet's largest—Nu-Cosa—that were built into the cosa trees. The homes in those cities were connected by finely carved wood stairways, and walkways of etched planks and cultivated vines."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, a reptilian sentient species, the Cosians, emerged into the world's forests as the only sentient species on the planet, and in Cosia's solar system. Over time, the Cosians would come to build villages across their homeworld, each ruled by a council of elders. When Cosian eggs hatched, a great celebration would be held to honor the emergence of new life and wisdom."}, {"tag": "p", "text": "When the Galactic Empire rose, they occupied Cosia and constructed a starport within the planet's forests."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Cosia's only sentient inhabitants were the Cosians, of whom Jedi Master Tera Sinube was a member. Other than sentient inhabitants, Cosia was home to insects with bright carapaces and wings as well as predators that stalked the forest floors."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Across the entire planet were numerous Cosian villages, each of which operated separately. Due to that, there was no set capital city, however Nu-Cosa was the largest of them all. All of the villages were built into the massive cosa trees, connected by wooden walkways and stairways. Alongside that, each village was led by a council of elder Cosians."}, {"tag": "p", "text": "Cosia did not contain a major starport due to the independence of each village, however the Galactic Empire constructed one to serve as the staging ground for their occupation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cosia was first mentioned in the Star Wars Legends reference book Star Wars: The Clone Wars Character Encyclopedia, which was written by Jason Fry and released in 2010. The world was confirmed to be canon by the reference book Ultimate Star Wars, which was released in 2015."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}