{"url": "Cosmic_Balance", "categories": ["Category:Legends articles", "Category:Culture of Bakura", "Category:Deities", "Category:Religions"], "nodes": [{"tag": "h1", "text": "Cosmic Balance"}, {"tag": "p", "text": "The Cosmic Balance, or sometimes just Balance, was the primary religion of the planet Bakura."}, {"tag": "h2", "text": "Beliefs"}, {"tag": "p", "text": "The Religion of the Cosmic Balance was based on the tenets that every action in the universe had an equal and opposite reaction elsewhere. If someone had good luck, at the same time, someone would have an equal amount of bad luck. If two people fell in love, elsewhere two lovers were separated. If one person found three credits, then another person would lose three credits at the same time."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Balance flowered as a faith under the hierophant Dif Istuvi. Dif wrote its sacred text, Fulcrum. He also founded the order of priest prophets known as Zanazi. Founded on the planet of Hemei IV, the religion died out there but found its way to Bakura where it prospered."}, {"tag": "h2", "text": "Symbolism"}, {"tag": "p", "text": "The symbol of the Cosmic Balance was a half-black, half-white ring; it was customary for adherants of the faith to wear pendants of this symbol, usually on necklaces."}, {"tag": "p", "text": "The concept of pruning excess spikes off cloudberries being necessary for agreeable fruit was used as a allusion for followers of the Cosmic Balance."}, {"tag": "p", "text": "The followers of the Cosmic Balance believed that the Jedi, through their use of the Force, upset the balance of the universe. As the \"greedy\" Jedi made themselves more powerful through mastery of the Force, the Cosmic Balance ensured that the malaise and squalor around them increased. Thus, followers of the Cosmic Balance blamed the decay of the Old Republic on the Jedi. The followers of the Cosmic Balance celebrated the Great Jedi Purge as helping the universe return to equilibrium, even integrating it into their religion as a \"morality tale.\""}, {"tag": "h2", "text": "Adherents"}, {"tag": "p", "text": "Families who counted themselves among the Equilibrates had pairs of children close in age that followed the Rule of the Feather and Bowl. When each pair were teenagers, they underwent tests. The most promising youth obtained a small feather, while the other was given a golden bowl. The Child of the Bowl left home to join a communal Simple Home, serving the Zanazi. The Child of the Feather stayed as a part of Bakuran society and was given Zanazi funds for a more prestige education. Some Children of the Bowl left the Faith, but most submitted to a lifetime of service."}, {"tag": "p", "text": "Gaeriel Captison was a follower of the Cosmic Balance; when her parents were killed, she became even more devoted to the religion, finding solace in the fact that if her parents died, then others must have had their lives improved. When Luke Skywalker's presence on Bakura during the Invasion of Bakura became known, she - and many other Bakuran followers of the Cosmic Balance - believed that the Balance had caused the Ssi-ruuvi invasion to counteract the return of the Jedi."}, {"tag": "p", "text": "Dark Jedi Alema Rar was supposedly a follower of the Balance, although she twisted the philosophy and believed the wrongs done to her entitled her to punish others, as opposed to the reverse."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}