{"url": "Council_of_Moffs", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Imperial organizations", "Category:Imperial Remnant", "Category:Legislatures"], "nodes": [{"tag": "h1", "text": "Council of Moffs"}, {"tag": "p", "text": "The Council of Moffs or Moff Council was the governing body of the Imperial Remnant, and later the Fel Empire and Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "In the Imperial Remnant"}, {"tag": "p", "text": "The Council of Moffs was, throughout its history, the governing body of the Imperial Remnant, the Fel Empire,and Darth Krayt's Galactic Empire. Although a strong military was the basis of the Imperial Remnant, and the state was led by the Supreme Commander of the Imperial Fleet from its inception in the year 12 ABY, the holder of that position was technically subordinate to the Moffs. The Council had the authority to order the Supreme Commander into military action and to choose the wars in which the Remnant would fight. The Supreme Commander was unable to execute any large scale decisions without the council's consensus, and in the year 19 ABY, Supreme Commander Gilad Pellaeon addressed each Moff as \"Your Excellency\" while seeking their blessing."}, {"tag": "p", "text": "Nevertheless, Pellaeon was actively withholding information and intelligence from the Moffs by 28 ABY, maintaining that the Remnant was not run by a committee. Although the Council had kept the Remnant out of the Yuuzhan Vong War three years earlier, 28 ABY saw Pellaeon tell the Moffs that the Remnant would finally be joining the war effort, their consensus nothing more than a mere formality. Pellaeon's temporary retirement after the war saw the Moff Council lead the Remnant in his absence, as did his death in 41 ABY. However, the Moffs soon afterward agreed to Jedi Master Luke Skywalker's proposal that they install a new Head of State as the Remnant's leader—the alternative was to be brought to justice for several war crimes they had recently committed."}, {"tag": "p", "text": "Each Moff governed one of the Remnant's sectors and was in command of a Sector Fleet. The size of the council was dependent on how much territory the Remnant controlled."}, {"tag": "h3", "text": "In the Fel Empire and Darth Krayt's Empire"}, {"tag": "p", "text": "At some point after 44 ABY, Fel became new Galactic Emperor, and Imperial space ceased to be known as the \"Remnant\". The Moff Council remained an important element of the government, not fully controlled by the monarchy, although its organization changed further over time. By the end of the Sith–Imperial War in 130 ABY, although the Empire had expanded in size, the Council had contracted, and appears to have numbered just six Moffs. It was now led by a High Moff, and known as the \"Moff High Council.\""}, {"tag": "p", "text": "These Moffs still controlled one sector each, but all of them were now also in charge of elements of the federal Imperial apparatus. The High Moff was Morlish Veed, who also served as the Grand Admiral in charge of the Imperial Military, suggesting that the ex officio connection between the role of Supreme Commander and the leadership of the Council had been restored. The other positions on the council were the Director of Imperial Intelligence (a role taken by the female Moff Nyna Calixte in 130-137 ABY), the head of the Imperial Mission (Konrad Rus), the commanders of the Imperial Navy (Rulf Yage), and the Imperial Army (Geist), and the leader of the Imperial Diplomatic Corps (a position held at this time by Fehlauur, the only alien on the Council, a Chiss who was also responsible for relations with his people's government). The Council of Moffs answered to Darth Krayt, who usually did not bother himself with bureaucratic matters of the state, leaving them to the Council."}, {"tag": "p", "text": "Some Moffs still retained the old prejudices, and many of them were opposed to letting Princess Marasiah Fel become Empress simply because of her sex, but others were more open-minded and liberal, and as well as women, at least one near-Human alien had become a Moff by this date.\nBy 130 ABY, the Moffs held considerably more power, and were true partners to the Emperor. They, and not the Emperor, also controlled the Imperial Service and Imperial Intelligence; the Director of Imperial Intelligence and the Grand Admiral were on the Council. It was the Council who invoked the Treaty of Anaxes to launch the Sith–Imperial War."}, {"tag": "p", "text": "At the end of the war, they pledged allegiance to Darth Krayt, although some of them still harbored sympathy to the then fugitive Roan Fel. With Coruscant under the grip of the Empire, the Council held its meetings inside a conference chamber within the New Imperial Palace. While some Moffs considered the war and the coup as a way to reassert their dominance, in the new order established by Darth Krayt, the Council now answered to Krayt's Sith Lords, particularly Darth Maladi and Darth Wyyrlok."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Council of Moffs was in existence as early as 12 ABY, when the Imperial Remnant was born. By 19 ABY they were based in Disra's palace on Bastion. In 41 ABY, the Council supported an alliance with Jacen Solo in order to reclaim Borleias and Bilbringi; when Gilad Pellaeon was murdered at the Second Battle of Fondor, they took over the Remnant and directed it to continue working with Darth Caedus."}, {"tag": "p", "text": "When the Imperial Remnant reasserted itself as a Galactic power, the Moff Council continued to exist under the rule of the Fel dynasty. Seeking to reassert Imperial domination over the Galaxy and tired of how Emperor Roan Fel constantly played them off against one another, they overruled his objections and declared war on the Galactic Alliance with the help of the One Sith. By the later stages of the Sith–Imperial War, the Moffs on the council were known by the title of High Moff. With the defeat of the Galactic Alliance in 130 ABY, they relocated to Coruscant, and by 137 ABY if not earlier, the body was styled the \"Moff High Council.\""}, {"tag": "p", "text": "They soon came to regret their decision however, as once the war ended, the new Sith leader, Darth Krayt, promptly deposed Roan Fel, and installed himself as the new Emperor, forcing Fel into exile. The council immediately realized that they'd helped replace a relatively benevolent ruler for a dictatorial one. Krayt forced them into swearing allegiance to him, though some soon started plotting against him and the rest of the Sith."}, {"tag": "h3", "text": "In 19 ABY"}, {"tag": "h3", "text": "During the Yuuzhan Vong War"}, {"tag": "h3", "text": "During the Second Galactic Civil War"}, {"tag": "h3", "text": "Following the Second Galactic Civil War"}, {"tag": "h3", "text": "During the Second Imperial Civil War"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}