{"url": "Council_of_Reassignment/Legends", "categories": ["Category:Legends articles", "Category:Jedi Councils"], "nodes": [{"tag": "h1", "text": "Council of Reassignment"}, {"tag": "p", "text": "The Council of Reassignment was one of the four Jedi Councils of the Jedi Order in operation during the rule of the Galactic Republic. The Reassignment Council met in the northeast tower of the Jedi Temple on Coruscant."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Council of Reassignment was made up of five Jedi Masters tasked with leading the Jedi Service Corps and the Councils that governed each branch. Meeting in the austere Council Chamber at the Jedi Temple, membership on the Council was granted through appointment after a vote of all members. Two permanent members sat for life or until they stepped down, while the other three rotated out after serving a five year term."}, {"tag": "p", "text": "Leading the Service Corps meant monitoring Jedi Initiates and their progress through the Jedi academy. If an Initiate failed to pass the Initiate Trials or the Force did not wish them to continue down the path of a Jedi Knight, the Council would step in and assign them to a branch of the Service Corps. Membership in the Corps was often viewed as a sign of weakness or failure; however, this was not the case. The Council would state that the work of the Corps aided galactic society just as a Knight would, however through use of other skills than wielding a lightsaber. The Council also looked after Padawans who failed the Jedi Trials or who were not selected for training by a Master. Membership was not restricted to those who failed out of the academy; the Council also assigned full-fledged Knights and Masters to serve a rotation with the Corps."}, {"tag": "p", "text": "To assist in the operation of the Corps, the Reassignment Council organized four smaller satellite Councils to directly oversee each of the branches of the Corps. The Agricultural Corps was led by a Council generally made up of Ho'Din and Ithorians while the Medical Corps was led by the Circle of Healers. The Educational Corps was overseen by the Librarian's Assembly and the Chief Librarian; the Exploration Corps by several ranking masters."}, {"tag": "p", "text": "The Reassignment Council existed nearly continuously throughout the history of the Order, right up until the end of the Clone Wars when the Republic was dissolved and reorganized into the Galactic Empire. With a Dark Lord of the Sith at the helm of the Grand Army of the Republic, the Council was caught unaware when Supreme Chancellor Palpatine issued Order 66 and began the Great Jedi Purge. Following the fall of the Jedi Temple, the members of the Council were hunted down and killed or else fled into self-imposed exile."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}