{"url": "Count_of_Serenno/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Counts of Serenno"], "nodes": [{"tag": "h1", "text": "Count of Serenno"}, {"tag": "p", "text": "A Count of Serenno was a title bestowed upon the heads of the Great Houses of Serenno. More specifically, the liege lord of all the Counts was referred to as the Count, Duke or Regent of Serenno, with the head of each family bearing the title of \"Count\" and then the name of their house; Count Dooku being the head of House Dooku being an example of this. The Counts of Serenno were properly addressed as \"Your Grace\" or \"Your Highness.\" The traditional outfit of the Counts of Serenno included an elegant dark cape that enlarged the wearer's silhouette to intimidating effect."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Making up the leadership of the planet Serenno, the Counts were believed to been among the wealthiest and most influential beings in the galaxy. In the wake of the Ruusan Reformations, the six most influential Counts welcomed Supreme Chancellor Tarsus Valorum to their world, although they did not take lightly to outsider influence in their world's affairs. During the Chancellor's arrival at House Nalju's retreat, a group of rebels attacked the Chancellor in an attempted assassination. Thwarted by Jedi Knight Johun Othone, the radicals were purged by the Counts as an attack on their guest was considered an attack on the Counts themselves."}, {"tag": "p", "text": "Following the death of the Jedi Master Dooku's brother, Adan Dooku was next in line, but was too young to take the title of Count, so his mother Kostanza became Regent. During the Republic's Separatist Crisis, Adan Dooku and his mother were then ousted by his uncle, former Jedi Master Dooku and went into self-exile. Indeed, Dooku had fallen to the dark side of the Force and abandoned the Jedi Order and took up leadership of the Confederacy of Independent Systems. Leading the Confederacy in to open conflict in what would be known as the Clone Wars, Dooku's reign of terror would bring the iron fist of the Galactic Empire down on Serenno at the end of the war. Adan Dooku then returned and took the title of Count of House Dooku and Regent of Serenno. Led by Darth Vader, the Cleansing of Serenno saw the execution of the other Counts' and their replacement by more compliant Imperial sympathizers."}, {"tag": "p", "text": "In 3 BBY, Count Adan Dooku was assassinated by Imperial Agent Jahan Cross disguised as Boba Fett. His son and the new count, Bron, was too young to be Regent. The leaders of the fiver other Great Houses then met at Serenno's Great Assembly House to elect a new regent. They then met again aboard the Count Bron Dooku's airship, the Windrunner, to continue electing a new regent. The four other Counts refused to elect the Empire's first choice, Lord Rodas Borgin of House Borgin, and preferred Lord Orom Malvern as the new regent. Following the kidnapping of the new Count Dooku, at the behest of Lord Borgin, the Empire then decided to send a fleet of Star Destroyers to take the young Count and dictate a new regent, who would be Borgin despite the risk of civil war. Following the apparent death of Count Bron Dooku, Orom Malvern was then named the Count of Serenno with support of both the Great Houses, the new Count Pero Borgin and Imperial Fleet. The Young Count Dooku was left in the care of Ambassador Davim Cross to await his return to reclaim his birthright."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}