{"url": "Counter-intelligence_at_Klaymor_4-2", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Counter-intelligence at Klaymor 4-2"}, {"tag": "p", "text": "Counter-intelligence at Klaymor 4-2 was a skirmish in the Galactic Civil War that took place in 3 ABY or earlier."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "An Imperial reconnaissance unit encountered a Rebel probe within Klaymor 4-2. As such, Alpha 1 was dispatched to take out the probe, while also looking out for the likely Rebel presence in the probe's vicinity."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Upon arrival, Alpha 1 headed over to the probe, with two Star Wings from Nu Squadron arriving to back Alpha 1 up. The CR90 Corvette Astin then hyperspace from the battlefield until further notice. Nu Squadron then proceeded to attack the Red and Blue Squadrons of X-wings as well as Gold Squadron A-wings, with Alpha 1, while heading over to take out the probe, taking care of any stragglers."}, {"tag": "p", "text": "Alpha 1 ultimately succeeded in destroying the probe, and was about to head back to the Astin. However, a Rebel-aligned Nebulon frigate called the Rogelo moved in to intercept, also launching four waves of Z-95 headhunters proceeding to attack them. Alpha 1 as well as Nu Squadron ultimately destroyed all Z-95 headhunter squadrons while maintaining distance from the Rogelo before returning to the ship."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The events of this mission were immortalized as one of the Galactic Empire's Combat Training sequences for newly ordained TIE pilots within the Imperial Navy, specifically for upcoming pilots of the TIE/LN starfighter, with then-rookie pilot Maarek Stele eventually assuming the role of Alpha 1 for this simulation, also earning the Gold TIE fighter combat medallion for participation in this as well as basic exercises, a reenactment of a Rebel raid against an Imperial Navy Supply Depot, and a reenactment of the elimination of a Rebel depot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Counter-intelligence at Klaymor 4-2 first appeared in the 1994 video game Star Wars: TIE Fighter. It is the fourth Combat Training mission for the TIE Fighter, titled \"Destroy a Probe\"."}, {"tag": "p", "text": "The player can optionally eliminate all fighters for the secondary and bonus goals. The article assumes Alpha 1 did so."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}