{"url": "Coy", "categories": ["Category:Legends articles", "Category:Grand Moffs of the Galactic Empire", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Coy"}, {"tag": "p", "text": "Coy was a Grand Moff and later an admiral in the Imperial Navy, commanding officer of the Imperial-class Star Destroyer Mathayus."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When Emperor Palpatine declared his Galactic Empire in 19 BBY, Coy was made Grand Moff of the Pallis Oversector and assumed the role of commander of the Sixteenth Army."}, {"tag": "p", "text": "In 1 BBY, the Mathayus, under Admiral Coy's personal command, was assigned to transport Darth Vader to the Inner Rim world known as Dargulli, because Vader was ordered by Emperor Palpatine to eliminate a lightsaber-wielding Force-sensitive on the planet. Aboard the bridge of the Star Destroyer, Coy asked Vader why the Mathayus, one of the most powerful warships in the Imperial Starfleet, was required to arrest an outlaw on a backwater world. Irritated by Coy's straightforward question on sensitive matters, Vader punished the admiral for curiousness by using the Force to choke the admiral while asking Coy to state his questions to the Emperor. Afterward, Coy introduced his subordinates, First Officer Atali and Second Officer Dezsetes. Neither did Coy or Vader suspect that Dezsetes was, in fact, one of the conspirators in Grand Moff Trachta's scheme to overthrow the Sith and that Dezsetes had orders to eliminate Vader aboard the Mathayus."}, {"tag": "p", "text": "During the mission for Dargulli, Vader was informed that the Mathayus had detected a distress signal of a Rebel ship near Yorn Skot, a gas giant near Dargulli. The Mathayus pursued the Rebels until the ship was captured in a tractor beam and dragged to the hangar bay of the Mathayus. However, the signal was falsified by Dezsetes and the spacecraft was rigged with explosives. First Officer Atali and several stormtroopers boarded the ship, but unexpectedly the ship exploded, killing Atali and his boarding party. Despite Vader's presence in the hangar bay, he survived the explosion. Soon after, a Rebel ship hiding in the depths of Yorn Skot was detected by the Mathayus. Coy, wishing to take revenge on the loss of his First Officer, requested Vader to permit the Mathayus to track down and destroy the ship. The Mathayus fired on the surface of the gas planet, forcing the ship to abandon its hiding place. As the Rebel ship attempted flee to hyperspace, it was annihilated by a turbolaser barrage coming from the Mathayus."}, {"tag": "p", "text": "When the Mathayus reached Dargulli and orbited the planet, Dezsetes intruded into Coy's private quarters. The treacherous second officer surprised Coy by drawing his blaster pistol and shooting the admiral in the shoulder. Then, Dezsetes shot Coy in the chest, killing him. After murdering his superior officer, Dezsetes became the commanding officer of the Mathayus and apparently covered up Coy's cause of death. The motive for Coy's assassination was to ensure that Dezsetes could eliminate Vader with a squad of clone stormtroopers, \"programmed\" loyal to the members of the conspiracy and transferred aboard the Mathayus. Dezsetes felt that his plans were compromised by Coy's staunch loyalty to Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}