{"url": "Crab-harp", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Creatures of unspecified diet", "Category:Crustaceans", "Category:Non-sentient species", "Category:String musical instruments", "Category:Yuuzhan Vong creatures"], "nodes": [{"tag": "h1", "text": "Crab-harp"}, {"tag": "p", "text": "Crab-harps were bioengineered non-sentient creatures created by the Yuuzhan Vong species. Crab-harps had long legs with tendons that linked the tips of each of their legs to their bodies. When their legs were locked in an extended position, the stretched tendons could be used to create music by plucking them. In existence by 26 ABY, during the Yuuzhan Vong War, these crustaceans were used by the Yuuzhan Vong as musical instruments or were set loose at ceremonies to make their own music."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Bioengineered by the sentient Yuuzhan Vong species, crab-harps were long-limbed crustaceans that were about the size of a Yuuzhan Vong torso, and they had translucent tendons that connected the tips of each limb to the body. Colored red on their limbs and gray on their bodies, crab-harps could lock their limbs in an extended position so that the tendons were stretched tight; in this position, the crustacean resembled a type of harp. Stroking or plucking the tendons produced an eerie, atonal music."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Classified as non-sentient, crab-harps allowed Yuuzhan Vong to play them as musical instruments when their legs were locked in their extended positions. When set to roam free, they played themselves by rubbing their legs together to create music."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Yuuzhan Vong had genetically engineered crab-harps for the sound of their music by the year 26 ABY. At that time, the Yuuzhan Vong were in the process of invading the New Republic–controlled galaxy. Crab-harps were widely used and participated in ceremonies undertaken by Yuuzhan Vong priests, with the crustacean musical instruments either being played by attendants or set loose to roam freely in order to create background music."}, {"tag": "p", "text": "In 26 ABY, a trio of attendants used two crab-harps during the Yuuzhan Vong attack on the planet Duro. There, the creatures made music as Yuuzhan Vong Warmaster Tsavong Lah tortured the captured Leia Organa Solo, a representative of the New Republic. Later in the war, crab-harps were used to provide music as part of a grand ceremony that took place in the Place of Sacrifice on the captured world of Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crab-harps first appeared in the novel The New Jedi Order: Balance Point, released in 2000 and written by Kathy Tyers. Balance Point was a part of The New Jedi Order series of books. Crab-harps were later mentioned in The New Jedi Order: The Unifying Force, by James Luceno, and also received an entry in 2008's The Complete Star Wars Encyclopedia. Crab-harps were also mentioned in the 131st installment of The Official Star Wars Fact File. However, the Fact File incorrectly describes that two crab-harps were connected with their tendons to another drum creature to create a large musical instrument. As all of the other sources describe the crab-harp as not being attached to the drum creature, this article assumes that the Fact File is in error. The Essential Reader's Companion, published in 2013, is the only source to date to show a picture of a crab-harp."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}