{"url": "Cracken%27s_Rebel_Operatives", "categories": ["Category:Real-world articles", "Category:West End Games sourcebooks"], "nodes": [{"tag": "h1", "text": "Cracken's Rebel Operatives"}, {"tag": "p", "text": "Cracken's Rebel Operatives was a roleplaying supplement intended for use in conjunction with the Second Edition rules of Star Wars: The Roleplaying Game. Written and illustrated by various authors and artists, this book contained entries pertaining to the Rebel Alliance's \"most famous and colorful operatives,\" for use by gamemasters and players in a variety of ways."}, {"tag": "p", "text": "The body of Cracken's Rebel Operatives takes the form of an in-universe report compiled some time after the Battle of Yavin by General Airen Cracken on who he views to be the Alliance's \"more useful\" operatives. Each entry contains a brief biography of the character that it covers, the character's game statistics, and a brief opinion from Cracken on the subject. Some entries give a brief description that goes into detail regarding a unique aspect of a character such as his or her species, an esoteric piece of equipment or ship that the character has access to, or a short story that delves deeper into some aspect of the character's history."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "How does the Alliance get its information? If Rebels are stranded in the field, where do they go for protection? Who works for the Alliance to help overthrow the Empire?"}, {"tag": "p", "text": "Cracken's Rebel Operatives is a collection of saboteurs, operatives, spies, contacts ad informants who work with or the Rebel Alliance in its valiant struggle against the evil Galactic Empire."}, {"tag": "p", "text": "This supplement provides detailed information on some of the more famous and important individuals in the ranks of the Rebellion. These characters provide rich background and personalities and are suitable for inclusion in any Star Wars: The Roleplaying Game adventure!"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}