{"url": "Crado", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Cathar", "Category:Fallen Jedi", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Members of the Sith Brotherhood", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Crado"}, {"tag": "p", "text": "Crado was a Cathar male from the planet Cathar, and a Jedi apprentice of Master Vodo-Siosk Baas. He studied the Force, along with his fellow Cathar and life-mate, Sylvar, as well as the Human Exar Kun, on the world of Dantooine. After years of rivalry, Crado chose to follow his fellow student when Kun became Dark Lord of the Sith and promised to renew the Jedi Order by combining its teachings with his own Sith knowledge."}, {"tag": "p", "text": "Conducting a number of missions for Exar Kun, Crado turned on the Jedi—as well as his former lover, Sylvar—in order to serve Kun, whom he admired greatly. In the end, Crado's service came to nothing, as Exar Kun sent him on a suicide mission in order to destroy a Republic and Jedi fleet. The Cathar Dark Jedi died at the Battle of Kemplex IX in an artificially-created supernova that destroyed the Cron Cluster as well as the nearby Jedi library world of Ossus."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Crado, along with his mate, Sylvar, and the Human Exar Kun, was trained in the Jedi arts under the Krevaaki Jedi Master Vodo-Siosk Baas, among peaceful ruins on the world of Dantooine. This was quite an honor for Crado, as Baas had previously trained successful Jedi such as Qrrrl Toq, Dace Diath, and Shoaneb Culu. Exar Kun was an extremely talented rival for the two Cathar Jedi, whom Kun regularly bested in lightsaber combat. Perceiving his fellow apprentice's gifts as a sign of superiority, Crado sought to impress Exar Kun, behaving submissively to the Human and assisting him when possible."}, {"tag": "h3", "text": "The Krath conflict"}, {"tag": "p", "text": "Following a lightsaber match in which Exar Kun injured Crado, Sylvar challenged the Human, only to be defeated as well. The three students' master intervened, using only his cane and hoping to teach Kun a valuable lesson in strengths and weaknesses, but Crado came to his rival's aid, giving him another lightsaber with which to defeat Master Vodo. Exar Kun left Dantooine, declaring himself a Jedi Knight and going in search of ancient Sith knowledge."}, {"tag": "p", "text": "After this incident, Vodo-Siosk Baas and his two remaining apprentices received news of a great meeting of the Jedi Order on the planet Deneba. The Conclave was held to discuss the rise of the dark side cult known as the Krath and its repeated attacks against the Republic. En route to Deneba, Crado asked Sylvar to marry him, that they might return to Cathar and use the knowledge imparted to them by Master Vodo to gain renown. Sylvar replied that while she would be more than willing to bear his whelp, she would remain a Jedi nonetheless."}, {"tag": "p", "text": "Little did the Jedi know that the Krath were plotting against them even as they debated what course of action to take: the servant droids used by the Jedi Masters were reprogrammed to attack their owners on command, and a shipment of custom-built battle droids was on its way to the great assembly as well. Master Baas and the two Cathar Jedi arrived on Deneba just as the Krath droids attacked. Sylvar distinguished herself in the battle by coming to the aid of Nomi Sunrider and her daughter, Vima. In the end, the Jedi won out against the Krath droids, but not without suffering heavy losses."}, {"tag": "h3", "text": "The Great Sith War"}, {"tag": "p", "text": "Having returned from his quest for dark side knowledge—and having been secretly named the new Dark Lord of the Sith—Exar Kun traveled to the library world of Ossus, where many Jedi, including Crado, had gathered. Kun's mission on Ossus was twofold: to cultivate the support of other Jedi Knights and to obtain Sith artifacts, which had been confiscated by the Order. Crado was among the young Jedi who quickly accepted Kun's promises of a new Jedi Order, and was mystified by the Sith amulet—which Exar claimed was a Jedi artifact kept secret from the Jedi apprentices by their masters—that his former rival now possessed."}, {"tag": "p", "text": "However, in order to call even more Jedi to his cause, Exar Kun knew that he had to obtain a Sith holocron, and the only such object on Ossus was in the possession of the Jedi Master Odan-Urr. Odan-Urr resisted Kun, who was forced to draw on the new powers of his Sith amulet in order to defeat him. When Jedi arrived on the scene of this murder, Exar Kun claimed that Master Odan-Urr had simply died, but not before declaring Kun a Jedi Master. Along with an ever-larger group of fellow students, Crado traveled with Kun to the fourth moon of Yavin aboard Kun's starship, Starstorm One."}, {"tag": "p", "text": "On Yavin IV, Crado and the other Jedi converts who chose to follow Exar Kun were led to a temple, where the rogue Jedi issued more promises of glory and a new Order. One of the students, a Jedi by the name of Oss Wilum, was unconvinced, having felt the dark side's considerable influence on the moon and around the temple. Wilum attempted to return to the ship, but was confronted by the Massassi, whom the long-past Dark Lord Naga Sadow had altered from their original form as Sith warriors and Kun had enslaved. When the Massassi warriors blocked Wilum's path, he fought them, and Crado and the rest of the Jedi came to his aid. Exar Kun rushed to stop the conflict, explaining that the Massassi were simple natives trying to protect their master. Upon their return to the temple, Kun explained that the holocron he had obtained was not, in fact, a Jedi artifact, but a Sith holocron—a source of dark side energy, which must be destroyed. Exar Kun pounded the item, shattering it, and its crystal shards embedded in the palms of the Jedi students, possessing them with the spirits of the Sith—all except Crado, who was an easy mark for the Dark Lord. Kun explained to Crado that he had given the other Jedi the knowledge he had promised them, and Crado easily accepted this version of the story, as his blind admiration of Kun quelled any doubts in his heart."}, {"tag": "p", "text": "As Exar Kun began to wage the Sith War against the Jedi and the Republic, Crado stayed by his former rival's side as a trusted and eager companion. After the dark side minions had retrieved their personal vessels from Ossus, Kun sent them each on a very special mission: they were to kill their own Jedi Masters, in order to make room for the new Jedi Order of his visions. As Kun himself went to Coruscant in order to save his Sith apprentice, Ulic Qel-Droma, and personally deal with Master Vodo-Siosk Baas, Crado was sent with Oss Wilum to Ambria in order to assassinate Wilum's former master, the formidable Tchuukthai known as Thon."}, {"tag": "p", "text": "Upon arriving on Ambria, Crado and Oss proceeded to Lake Natth, which was home to the hssiss, dark-side monsters which Thon had managed to contain. Drawing upon their new Sith powers, the pair summoned a large group of hssiss from the turbid waters and directed them to Thon's house. As they neared the dwelling, Crado discovered that Master Thon had visitors: Nomi Sunrider and Vima, as well as his very own mate, Sylvar. There, Crado was faced with a choice: either he could call off the hssiss' attack to spare Sylvar, or the attack could continue, possibly killing Crado's only mate for life. Crado betrayed his mate, declaring that all present at Thon's house were to die."}, {"tag": "p", "text": "The Jedi sensed the impending attack and rushed to defend against the beasts—Nomi and Sylvar with their lightsabers, and Thon with his very teeth and claws. The fight was savage, and the hssiss very nearly overwhelmed the Jedi. But Oss Wilum's control of the beasts was no match for Sunrider's skills at battle meditation, and the hssiss were thrown into disarray and defeat. Thon neutralized his former student Oss, leaving Crado to face the Jedi alone. Crado knew that he could not defeat his enemies without help, but as he approached Sylvar, his former mate raked his face with her claws, declaring him a traitor and a murderer as well as blaming Crado for Master Vodo's cruel death at the hands of Exar Kun. Crado rushed back to his ship—leaving Oss Wilum behind—and fled Ambria to return to his new master's side."}, {"tag": "h3", "text": "Crado's final mission"}, {"tag": "p", "text": "Returning to Exar Kun's base on Yavin IV, Crado begged for mercy, as well as another chance to prove himself to his former rival. However, Kun seemed less bothered by the setback than he should have been, and gave Crado what he'd craved all along. Crado was to go with the Krath sorceress Aleema Keto on a grand mission to lure the Republic fleet to its destruction, and he was personally named Aleema's battle commander for the mission."}, {"tag": "p", "text": "They embarked on Naga Sadow's ancient flagship, the Corsair, which the Dark Lord had used to flee Republic forces centuries before. The Corsair came equipped with a terrible weapon that had only been used once before: a Sith crystal that gave its user the power to manipulate the awesome energies of a star."}, {"tag": "p", "text": "The Corsair attacked Kemplex IX, a huge space station near the Cron Cluster in the Auril sector, in order to get the attention of the Republic fleet. When the fleet arrived, led by the Jedi Shadows Dace Diath, Qrrrl Toq, and Shoaneb Culu, the station had been devastated, and the old Sith battleship was fleeing towards the relative safety of the Cron Cluster. The Jedi gave chase as the Corsair slipped between the stars, drawing the pursuers to their doom. As they closed in on the Sith flagship and began to fire upon it, Aleema released the fury of the Sith crystal, tearing the stellar core from one of the ten stars of the Cluster and hurling it toward the incoming fleet. The Republic ships and their Jedi allies were destroyed instantly. Yet something unforeseen occurred next."}, {"tag": "p", "text": "The stellar core underwent a chain reaction and imploded, and the star's intense energy had nowhere to go but outward. Aleema and Crado knew then that they had both been betrayed: Exar Kun and Ulic Qel-Droma had failed to mention to them that the weapon's power was very likely to backfire upon any who hadn't been instructed in its proper use. Crado died in a wave of intense radiation, wondering why his fellow student of the Force had decided that he should die, unaware that it was his very eagerness to please Exar Kun that had spelled his doom."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "A full decade after Crado's death and the end of the Sith War, Sylvar still held resentment against Ulic Qel-Droma for Crado's fall to the dark side and demise. The former Sith Lord lived in a self-imposed exile, but Sylvar did not believe that this was enough. After attempting to sway the Jedi Order to punish Qel-Droma for his crimes, Sylvar took matters into her own hands and tracked the former Sith apprentice down on Rhen Var, where she attacked and intended to kill him, taking a step herself towards the dark side. In the end, however, Crado's mate could not bring it upon herself to avenge Crado if it meant killing an unarmed opponent. She re-embraced the Jedi way and refused to kill Ulic, although the man was shot only moments later by a spacer named Hoggon, who only sought glory in the death of Qel-Droma. Crado, along with Sylvar, was remembered on his homeworld in the form of a detailed work of tree art. His people always remembered his plight, and though they took comfort in the fact that Sylvar was able to turn away from the dark side, further Cathar Jedi were discouraged, because most believed that their natural instincts were in direct opposition to the Jedi way."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As Vodo-Siosk Baas's apprentice, Crado suffered many defeats at the hands of Exar Kun, and so he developed the belief that Exar was simply a better Jedi than he was. Yet Exar Kun's attitude, towards their master as well as Sylvar, did not bode well with Crado. This underlying resentment broke through during Kun's fight with Master Vodo, when Crado gave his rival another weapon and challenged him to prove his superiority."}, {"tag": "p", "text": "Later, when Crado and his mate had trained further under Master Baas—without the continued disruption by Exar Kun—the Cathar Jedi felt pride in his accomplishments. His desire was to marry Sylvar and return with her to the Cathar homeworld, where they would become famous among their people."}, {"tag": "p", "text": "However, when Exar Kun returned from his journeys in search of Sith knowledge, Crado was once again impressed with the Human, and had faith in what Exar told him and the other Jedi of his visions of a new Jedi way. Unlike the other Jedi who followed the rogue knight to Yavin IV, Crado was not possessed by the Sith spirits Exar Kun released when he destroyed the Sith holocron. Still he followed Kun, completely loyal and eager to please. The Cathar even went to far as to order the death of his own former mate, in order to carry out Exar's instructions. However, when Crado's mission failed and he approached Sylvar to seek forgiveness, she denied him, and Crado fled back to his master, dejected. Crado's enthusiasm would be his undoing however, as Exar Kun found him to be expendable, sending his old rival on a mission from which Exar knew that Crado would not return."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Crado first appeared in Tales of the Jedi – Dark Lords of the Sith 1 of the comic book series Tales of the Jedi. Writer Kevin J. Anderson created him for the series, and Crado continued to appear in subsequent issues of the Dark Lords of the Sith and The Sith War sub-series. He is briefly mentioned in the video game Star Wars: Knights of the Old Republic II: The Sith Lords, in which the player can find a robe that supposedly, although even stated improbably, belonged to Crado."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}