{"url": "Craitheus_Qreph", "categories": ["Category:Legends articles", "Category:Business owners and executives", "Category:Columi", "Category:Crime lords", "Category:Males"], "nodes": [{"tag": "h1", "text": "Craitheus Qreph"}, {"tag": "p", "text": "Craitheus Qreph was a male Columi who headed a criminal enterprise with his brother, Marvid, for decades. Together, the brothers took over several major industries that, by 45 ABY, represented the hints of a hostile takeover of the galactic economy. During this time, Craitheus and Marvid, who grew up living hard lives for Columi, hunted down and not only killed people who they suspected of having put their mother in a coma, but they also destroyed everyone and everything that their victims cared for."}, {"tag": "p", "text": "By 45 ABY, Craitheus and Marvid stationed themselves in the Chiloon Rift as they began literally robbing the competition of the mining cooperative stationed in the Rift. As well, they stationed their primary headquarters, Base Prime, on top of an unknown monolith that may or may not have been the Mortis monolith so that they could, hopefully, gain the ability to use the Force. To rob the mining cooperative, they hired pirates to steal the ore that the miners harvested. In addition, the brothers hired Mandalorians to protect their activities, and to work with the Nargons, a race of biologically-engineered organisms whose creation was funded by the Qrephs."}, {"tag": "p", "text": "As the brothers funded the pirate activities in the Chiloon Rift, they also attempted to swindle Lando Calrissian of his asteroid refinery on the world of Sarnus, something that Calrissian refused to do. In response, the Qrephs ordered for the refinery to be destroyed, and to have thousands of workers there killed in the process. This event was what triggered Calrissian going after the brothers with the help of his legendary friends, Luke Skywalker, Han Solo, and Leia Organa Solo. This led to a series of events that culminated at Base Prime when the Millennium Falcon attacked the base with four Jedi—Skywalker, Organa Solo, Ben Skywalker, and Tahiri Veila—along with six YVH droids. During the attack, Craitheus was hit by several bolts that rendered him half-dead thanks to the Force-sensitive mercenary Savara Raine defending herself. Marvid, who had been fond of Raine previously, betrayed her as a result and left her to die in the attack as he took his half-dead brother to the gate between Base Prime and the monolith, with a human-Columi hybrid clone of Raine, known as Savara Two, acting as the key to entering the monolith. Inside, the brothers gained Force powers and, after Savara Two was killed by Luke Skywalker, the Qrephs fought against Skywalker, his sister, and Han Solo. While Marvid was disintegrated by Skywalker's Force powers, Craitheus was set aflame by Organa Solo, rendering the brothers to ashes, foiling their plans to escape the monolith to roam free in the galaxy."}, {"tag": "h2", "text": "Appearances"}]}