{"url": "Crawler_Commandeers", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Crawler Commandeers"}, {"tag": "p", "text": "\"Crawler Commandeers\" is the eighth episode of the fourth season of the animated television series Star Wars Rebels. The episode premiered on Disney XD on November 6, 2017. It is also the sixty-seventh episode of the series overall."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "In need of a long-range transmitter, the rebels look to infiltrate one of the Empire's massive ore crawlers."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Blocked signal"}, {"tag": "p", "text": "In the caves they recently discovered, the Lothal resistance group sets up shop. Sabine Wren tinkers with an old transmitter, which she tells Ezra Bridger and Ryder Azadi was the best they could salvage. Despite her best efforts, she can't get the device to send a long-range transmission, and notes that the Galactic Empire is blocking all non-Imperial transmissions. Kanan Jarrus says that they need to get in contact with Hera Syndulla. Ezra agrees, stating that they have to be ready to help if an attack occurs. Ryder points out that the rebels are hiding in a few caves with only a few blasters, to which Ezra replies that they've done more with less. Just then, Sabine picks up something nearby on the transmitter, and the rebels set out to inspect it."}, {"tag": "h3", "text": "Attack plans"}, {"tag": "p", "text": "In the Great Temple on Yavin 4, Hera attends a briefing with Mon Mothma, General Jan Dodonna, Erskin Semaj, and Bail Organa, attending via hologram. Dodonna explains that, after analyzing the TIE Defender Elite's flight data recorder, the Rebel Alliance now has a better picture of the fighter's capabilities. He states that they have yet to discover a weakness in its design. When Organa asks whether their ships are a match for it, Dodonna replies that in individual starfighter combat, the Alliance's fighters will be at a disadvantage. Hera states that if that is the case, the Rebels have to prevent it from being manufactured in the first place, meaning they must attack Lothal's factories. She adds that she has a team on the ground ready to assist. Mothma says that Hera has a point, and asks her and Chopper to wait outside while the Alliance leaders discuss it."}, {"tag": "h3", "text": "The ore crawler"}, {"tag": "p", "text": "Back on Lothal, the Rebels, approaching on a landspeeder, discover a Mining Guild ore crawler, which Sabine notes is used to strip planetary surfaces of any useful materials to fuel the Empire's factories. Ezra states that he saw some of them burning the plains in the north, and is concerned that the crawlers have made it halfway across the planet. Zeb suggests that they hijack the vehicle and use it to contact Hera. Sabine, scanning it, tells him that he may be more right than he knows, as it has a long-range transmitter."}, {"tag": "p", "text": "Ryder brings the Spectres in behind the crawler on the speeder, and Sabine flies up on her jetpack. She spots a security droid, and alerts the others before landing. Sneaking up behind the droid, Sabine hits it with a paralyzing dart and heaves it over the guardrail. Ryder brings the speeder alongside the crawler, and Ezra, Zeb and Kanan hop aboard. As Ryder drives away, Sabine spots another droid exiting the crawler's interior and shoots it in the head, before flying to the top of the vehicle to await the guys, who are climbing a ladder."}, {"tag": "p", "text": "Entering the cockpit, they find Crawler 413-24's captain, Seevor, oblivious to his surroundings while listening to music on a pair of headphones. The rebels walk up and surround him, and Zeb pulls off one of the earpieces, informing the Trandoshan that he also enjoys that song. Seevor is pulled out of his chair, and is enraged at what he assumes are pirates. As he is restrained by Zeb, the captain hits a button on his wrist, which sets off an alarm and halts the crawler. Kanan tells Sabine to shut it off, and she races to the controls. As she works, Ezra pulls the device off Seevor's wrist and crushes it beneath his foot. Seevor shouts that the \"pirates\" do not know what they're dealing with, as he struggles in Zeb's grasp. The vehicle is contacted by Mining Guild headquarters, wondering why the alarm has been triggered. Sabine tries to figure out how to respond, as Kanan warns her they're running out of time and Seevor taunts them. Ezra is waved up to the comms and does a passable impersonation of the Trandoshan, claiming that the crawler is suffering mechanical difficulties. Seevor is insulted that that's what he sounds like, and Zeb smacks him. As Ezra attempts to persuade the Guild headquarters that sending a repair team is not necessary, as the crew can fix it themselves, Seevor yells in the background, attempting to be heard over the comm channel. Zeb knocks him unconscious, as the comms cut out."}, {"tag": "h3", "text": "Unexpected reunion"}, {"tag": "p", "text": "Sabine discovers that the transmitter is older than she had thought, and works to get enough power to it. She discovers a signal coming from the back, in the reactor room, and Kanan and Zeb go to check. Zeb dumps the unconscious Seevor on the floor, and Kanan warns Ezra and Sabine to watch him while exiting. Kanan and Zeb head over to the processing room, and Kanan tells Zeb to check the upper level while he searches below, and jumps down. In the smoke and steam from the machinery, Kanan senses presences and reaches for his blaster. However, he quickly realizes that they are slaves, and moves his hands away from his weapons as he tells them he's not there to hurt them. As the slaves approach, dropping the tools they were holding as makeshift weapons, Cikatro Vizago emerges, to Kanan's considerable surprise."}, {"tag": "p", "text": "The Devaronian crime lord boastfully states that he told the other slaves that the rebels would be coming to rescue them, and that the foreman is no match for a Jedi. Kanan is startled at the mention of a foreman, at which point the individual in question, a large, powerfully-built Trandoshan, emerges and attacks the Jedi Knight with an electro-whip. He pulls out his lightsaber, and as the whip wraps around the blade, Kanan tells Vizago that he hopes so. The foreman pulls hard enough for Kanan to lose his grip on his weapon, and it clatters to the floor. In his second attack, the foreman attacks Kanan with the whip and shocks him unconscious. Before he can do anything else, Zeb, pointing his bo-rifle at the Trandoshan, growls for him not to move."}, {"tag": "p", "text": "In the cockpit, Sabine, still working on the transmitter, suggests to Ezra that he should check on Kanan. Ezra responds that he doesn't need to, just as Seevor comes to. As the captain begins issuing threats, once again, Sabine asks Ezra if he can get him to shut up. Ezra promptly locks Seevor in a closet, as the captain continues to vehemently protest the hijacking of his crawler."}, {"tag": "p", "text": "The foreman quickly ascends to the upper level using his whip and attacks Zeb. The large Trandoshan is a more difficult opponent for the Lasat warrior than the scrawny Seevor. Zeb attempts to strike the foreman with his rifle's electrostaff mode, but it is unsuccessful. Eventually, the fight heads to the outside catwalk. The foreman eventually grabs Zeb and tries to throw him off the crawler, but Zeb uses his prehensile feet to pull the foreman over, leaving both combatants dangling from the guardrail. As the fight continues, Kanan, having come to, runs outside on the lower catwalk, and Zeb tells him that he's up there. Kanan heads back inside to get upstairs. Eventually, the foreman gets his whip around Zeb's wrist and shocks him with it. Zeb withstands the shock, and eventually dislodges the foreman's grip from the catwalk, leaving him dangling by the handle of his whip, attached to Zeb's wrist. The foreman soon loses his grip on the whip handle and falls to his death. As Zeb's one-handed grip on the catwalk begins to slip, Kanan arrives just in time and pulls him up, commenting that the Lasat is very heavy."}, {"tag": "h3", "text": "Striking a blow"}, {"tag": "p", "text": "On Yavin 4, Hera is waiting outside the briefing room with Chopper. Mothma comes out and tells her that they are still debating it, as there is another concerning matter. The Empire has activated Protocol 13, the evacuation of all Imperial personnel. Hera responds that this means the Rebels don't have any more time to waste. She storms into the briefing, as Organa tells her that it is private. Hera tells the Alliance leaders that this isn't an issue that they can afford to delay on, and that she has a team on Lothal that are ready and waiting to assist the attack. She states that this is the time to strike a blow to the Empire and remind them that the Rebellion will not surrender or give up. In response to her speech, Mothma agrees, and tells Hera that permission for the attack is granted."}, {"tag": "h3", "text": "Complications"}, {"tag": "p", "text": "Vizago is somewhat disappointed that the Rebels did not come specifically to rescue him. Sabine calls everyone up to the cockpit, as she's spotted incoming trouble: two Imperial gunships. Ezra quickly suggests that the rebels pretend everything is business as usual, stating that the slaves should go outside and seem to be still at work. He has Zeb, who is still in possession of the foreman's whip, put on a spare work helmet and pretend to be the slave driver. Vizago is pressed into impersonating the captain when the Imperials call, and claims that the crawler is suffering mechanical problems, resulting in them having lost all of their clearance codes. The Imperials respond that they are still coming aboard for an inspection, and the gunships land on the top deck, where Zeb and the slaves are waiting. Several stormtroopers enter the cockpit, forcing Vizago out of the way. As they begin to search, Vizago complains that they are interrupting Mining Guild business. Hiding in the closet with Kanan and Sabine, Ezra whispers that all they have to worry about is the captain squealing on them. Hearing this, Vizago accidentally draws the stormtroopers' attention to the closet Seevor is locked into, and they insist on opening it, only to find it empty as the three rebels are hiding in the other closet."}, {"tag": "p", "text": "After the Imperials leave, it's revealed that Seevor managed to escape into the ventilation system. The rebels are worried about what he could do, but Sabine has finally gotten the transmitter working. When she activates it, however, they discover that power has been diverted away so it can't work. Seevor, tapping into the crawler's intercom, taunts the rebels, and they quickly discern that he's gone to the reactor room. Kanan and Zeb attempt to enter, but find that the door has been locked and magnetically sealed, preventing Kanan from cutting his way in. Sabine suggests that they need someone who can fit into the vents, looking at Ezra. He protests, stating that he hasn't crawled through the vents in a long time, but is forced to go in, coughing at the smoke inside."}, {"tag": "p", "text": "When Ezra reaches the engine room, he discovers that the reactors have, indeed, been deactivated, and Sabine tells him to turn them on again. As he approaches the controls, Seevor stalks him from below. Ezra senses the Trandoshan approaching him from behind as he works on the control panel, and at the last second turns and slashes at Seevor with his lightsaber. Seevor dodges, and a fight begins. As Ezra activates the reactors, Seevor attacks him again, and causes Ezra to drop his lightsaber on the floor in front of the door to the smelter, which is constantly opening and closing. Ezra is pushed back up to the guardrail, and he awaits Seevor's next attack. However, Seevor, failing to notice Ezra's lightsaber on the floor, slips on it and falls into the smelter. Ezra retrieves his weapon and smiles."}, {"tag": "h3", "text": "Resolution"}, {"tag": "p", "text": "Ryder returns to the crawler in his speeder, and Kanan asks him if he's become a believer. Sabine manages to get a signal through to Rebel Command, and Ezra says they'll have to wait for a response. He also remarks that the crawler must belong to them now, and is relieved that some plains have been spared. The freed slaves, when asked, are happy to join the Rebellion, and Vizago decides to appoint himself permanent captain of the crawler. A signal gets through, and Hera informs the Rebels that the attack has been approved, and fighters are being prepped now. The Rebels are cheered up, and prepare to assist in the attack."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}