{"url": "Crazy_Legs", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone trooper pilots"], "nodes": [{"tag": "h1", "text": "Crazy Legs"}, {"tag": "p", "text": "\"Crazy Legs,\" was a male Human clone trooper pilot of the Grand Army of the Republic. In 22 BBY, he was part of a mission to the planet Oznek under the command of Sergeant Banks and Commander Griebs Kishpaugh, during which he was killed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Crazy Legs was a male Human clone trooper, bred on Kamino for the Galactic Republic. When the Clone Wars broke out in 22 BBY, he was one of millions of clones who made up the Republic's Grand Army of the Republic. At some point during the war, he had been shot down in a vessel. That same year, Crazy Legs was sent on a mission to the planet of Oznek, under the direct command of Sergeant Banks and Commander Griebs Kishpaugh. While flying above the planet's forest aboard a Low Altitude Assault Transport, his clone brothers Cutter, Syke, and Ghost mocked their new sergeant for cleaning his armor and weapons. Banks admonished the team for their behavior, but shortly after that, their ship came under heavy fire. The area was supposed to be unoccupied by Confederate forces, but they discovered a large droid army, which blasted them out of the sky. Crazy Legs did his best to right the ship, yet only managed to crash-land amongst the trees."}, {"tag": "p", "text": "Several other clones were killed on impact, while Crazy Legs was wounded, breaking his right leg and hurting his left arm. Syke escaped from the wreckage via a hatch, only to find hundreds of B1 and B2 battle droids bearing down on them. The clones fought off the attacking droids while trying to protect their wounded and burying their dead. Syke cut into the LAAT/i's side and pulled Crazy Legs from the wreckage. Eventually, the waves of unending droids ceased, and the remaining seven clones covered their tracks by detonating a thermal detonator. Setting up camp in the woods, Syke attempted to use a communications array to no avail. Crazy Legs grabbed some food from the supplies they'd saved from the wreckage and began to eat. He then asked Banks where he had received his nickname, since earlier he had told the clones that he didn't want to be called by it. Syke, who was aware of the nickname's origin, urged the sergeant to show him, and Banks complied. An avid student, Banks had an unusual ability to calculate angles and bank his blaster bolts off of objects without losing their strength and still hitting his target. He ricocheted a blaster shot off of two objects, which then shot the food out of Crazy Legs's hand. Crazy Legs wasn't too pleased with the demonstration, but they were then contacted via holoprojector by Commander Kishpaugh after Syke managed to get the array working. Kishpaugh informed them that there was a droid command center twenty kilometers away, and that they were to destroy it despite their losses. He then ordered Crazy Legs and the rest of the clone troopers from the shelter, speaking with Banks alone."}, {"tag": "p", "text": "When the team moved out before sunrise, they left Crazy Legs behind, as he'd be unable to keep up with the rest of his brothers. He sat behind in the shelter, seemingly not bothered, and told the others that he'd wait until they were far away, then activate a beacon so that he could be rescued. This rescue was never to come, however, as he was surrounded by B1 battle droids shortly after. He pulled a blaster pistol, preparing to defend himself, but was killed nonetheless."}, {"tag": "p", "text": "The mission would turn out to be a falsehood from the beginning, the circumstances and details manufactured by Kishpaugh and Ghost, both of whom were planning to defect to the Confederacy. The price of their escape from the Republic was creating a pretense for war on Oznek—namely, blowing up a \"droid command center\" that was really a power plant. Banks managed to foil the plan, killing Ghost and capturing Kishpaugh. Banks, when later facing interrogation regarding his actions on Oznek, remarked that he learned that Crazy Legs was never able to even activate his beacon."}, {"tag": "h2", "text": "Appearances"}]}