{"url": "Credit", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems", "Category:Currency", "Category:Galactic Empire", "Category:Galactic Republic", "Category:New Republic"], "nodes": [{"tag": "h1", "text": "Credit"}, {"tag": "p", "text": "The Galactic Credit Standard, also known as the galactic credit or simply the credit, was a standardized form of currency in use throughout the Galactic Republic, the Galactic Empire, and territories of the New Republic, Resistance and other non-aligned systems following the Empire's fall. Credits were considered acceptable as currency on most major planets, though on some planets in the Outer Rim Territories, such as Tatooine, some merchants considered them to be \"no good,\" desiring something \"more real\" in exchange for their goods. They were sometimes referred to as \"Republic credits\" or Republic dataries during the time of the Galactic Republic. They became known as Imperial credits during the Age of the Empire. During the Clone Wars, the Confederacy of Independent Systems issued its own Confederacy credits. Following the Battle of Endor, credits were known as New Republic credits as the New Republic replaced the Empire as the galactic government. The citizens of Milvayne used Milvayne credits. \"Creds\" was a colloquial term for credits. The credit symbol () resembled an Aurebesh letter R with two vertical strokes at the top."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Credits could be carried on a person via credit chips. Credits also came in the form of credit ingots, which were often kept in vaults and transported under heavy guard. During the Age of the Empire, Arquitens-class light cruisers were often used for this task."}, {"tag": "p", "text": "One such merchant that was wary of the value of credits was Watto, who refused Qui-Gon Jinn's offer of 20,000 credits in exchange for a T-14 hyperdrive generator. When Jinn then attempted a mind trick on him to get him to accept the credits, he replied that he was a Toydarian and that mind tricks didn't work on him, only money."}, {"tag": "p", "text": "The mercenary AD-W4 considered credits to be the highest power and true ruler of the galaxy, even more powerful than a god."}, {"tag": "p", "text": "After the formation of the Galactic Empire, Galactic Republic credits were phased out within days, with Imperial citizens induced to register for identifying chain codes in order to exchange their now-worthless currency for Imperial credits. Eventually, credits from the time of the Republic became mostly worthless. Credits from the Galactic Empire likewise became worthless following the rise of the New Republic, to the point that Grand Admiral Rae Sloane was forced to pay the bounty hunter Mercurial Swift \"in owed favors.\" The New Republic also issued credits, but their value became volatile in 34 ABY following the Hosnian Cataclysm. Consequently, the city of Canto Bight prohibited New Republic credits and required all visitors to exchange their credits for currency made of aurodium."}, {"tag": "p", "text": "Hoping to win the Millennium Falcon, the smuggler Han Solo once tracked Lando Calrissian to a jungle outpost on Numidian Prime and played him in a game of sabacc. A bronze credit was used in the sabacc pot."}, {"tag": "p", "text": "When attempting to secure passage to Alderaan aboard the Millennium Falcon, Obi-Wan Kenobi stressed to Han Solo the importance of avoiding \"Imperial entanglements.\" Concerned with the danger, Solo asked for a price of 10,000 credits up front. As Kenobi and Luke Skywalker didn't have much with them, Kenobi instead negotiated an upfront price of 2,000 credits with the promise of an additional 15,000 upon safe arrival at Alderaan. Solo deemed it worth the risk, as he and his partner Chewbacca were heavily in debt to Jabba the Hutt and had a bounty on them."}, {"tag": "p", "text": "Around 34 ABY, the shop Dok-Ondar's Den of Antiquities at Black Spire Outpost on Batuu sold individual, mint-condition Imperial credits to collectors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Credits first appeared in the 1977 film Star Wars: Episode IV A New Hope before being identified in the 1999 film Star Wars: Episode I The Phantom Menace. Credits is the form of currency in the 1971 film THX 1138, which was written by the creator of Star Wars, George Lucas, and his friend Walter Murch at American Zoetrope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}