{"url": "Creet", "categories": ["Category:Canon articles", "Category:204th Imperial Fighter Wing members", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Creet"}, {"tag": "p", "text": "Creet was a female Imperial TIE mechanic in the Galactic Empire's 204th Imperial Fighter Wing. During a celebration, Major Soran Keize, the 204th's commanding officer listened to the stories from crewmembers like Creet, and the mechanic expressed her desire for a counterattack on the New Republic for its capture of the astronomical object Andara."}, {"tag": "p", "text": "While the 204th was at the planet Jakku, Creet attended another celebration, where she and the since promoted Colonel Keize carried the pilot Bansu Ro to his bunk after he became under the influence of narcotics. The New Republic soon attacked and defeated the Empire's forces at Jakku, and Creet was split from her unit. The ex-New Republic pilot Nath Tensent convinced her to join his crew within four months after the battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stories with Soran"}, {"tag": "p", "text": "During the Galactic Civil War, Creet served as a TIE mechanic in the Galactic Empire's 204th Imperial Fighter Wing, serving as crew aboard one of its Quasar Fire-class cruiser carriers by around 5 ABY. Around that year, the 204th captured the Imperial II-class Star Destroyer Edict, which the fighter wing brought into its complement. Creet attended a celebration to welcome a number of survivors from the Edict into the 204th's ranks. During the gathering, though, Lieutenant Nord Kandende, one of the 204th's pilots declared that the New Republic had captured the astronomical object Andara from the Empire, news which had spread prior between personnel in the Aerie's hangar."}, {"tag": "p", "text": "Major Soran Keize, the commanding officer of the 204th, had the squadron commanders present take their pilots away, leaving behind the crew of the  Edict and the Quasar Fire-class cruiser-carriers Aerie and Allegiance, the latter of which had been destroyed not long before. The crew told stories about Andara and the late Allegiance while Keize listened. Creet then stressed that they could not let the New Republic keep winning, asking the major if the New Republic thought they had already won as he had briefly attempted to live under New Republic rule for a short amount of time."}, {"tag": "p", "text": "Keize confirmed Creet's suspicions, leading the mechanic to insist that 204th should fight back at the New Republic for the people of Andara. Keize assured her that the fighter wing was already doing so, and Creet asked what it was like for the major to live under New Republic rule. Keize complied with Creet's question and told all of the crew present about how the New Republic appeared to not know how to govern and that worlds suffered from societal breakdown and shortages."}, {"tag": "h3", "text": "Fall of the Empire"}, {"tag": "p", "text": "The 204th fought a New Republic battle group in the Cerberon system not long after, losing the Edict and Aerie during the initial attack. The fighter wing ultimately escaped on a bulk freighter which became the units headquarters and was named the Yadeez. Aboard the Yadeez, the 204th operated for the Empire's loyalist forces before eventually amassing with the majority of them at the planet Jakku. During their time there, a number of the fighter wing's personnel, including Creet, had a gathering at the Yadeez's hangar. After Keize joined the celebration, the commanding officer, since promoted to colonel, and the mechanic hauled the pilot Bansu Ro, who was under the influence of narcotics, to his bunk."}, {"tag": "p", "text": "Creet stood behind Keize and squeezed his arm while he spoke to Ro. Both then returned to the celebration. Shortly after, the Empire's forces at Jakku were attacked by the New Republic, which claimed a decisive victory. The 204th itself took many casualties and the Yadeez was brought down. Creet became estranged from the fighter wing and evaded a fate at the hands of the New Republic. Within four months after the Battle of Jakku, she approached by Nath Tensent, an ex-New Republic pilot. Tensent convinced her to join his crew of freelancers and also recruited Kandende. When he later tried to recruit the Ro, he cited the intake of Creet and Kandende to try and convince the other 204th veteran to join his crew on the planet Freerock."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A female individual, Creet spoke in a thick Twi'lek accent. After learning of the fall of Andara into New Republic hands, she was keen to see the 204th make a counterattack to show the enemy that they were not winning. When Soran Keize spoke to the intoxicated Bansu Ro at the latter's bunk, Creet squeezed the colonel's arm during the talk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Creet first appeared in the 2020 novel Shadow Fall, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}