{"url": "Crest", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Articles to be expanded", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Crest"}, {"tag": "p", "text": "\"Crest\" was the nickname of a clone trooper who served as a stormtrooper sergeant during the reign of the Galactic Empire. Cloned from the template of Jango Fett, a human male bounty hunter whose genetic material spawned the Grand Army of the Republic, Crest fought in the Clone Wars as a soldier of the Galactic Republic. Although he managed to remain in military service under the New Order, his accelerated aging led his superior, the Sith Lord Darth Vader, to doubt the clone's reliability."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The clone trooper known as \"Crest\" was part of an army of genetically identical soldiers, bred from the template of the human bounty hunter Jango Fett to fight for the Galactic Republic. After serving in the Grand Army of the Republic during the Clone Wars, Crest became a stormtrooper of the Galactic Empire."}, {"tag": "p", "text": "Crest served with a contingent of stormtroopers accompanying the Sith Lord Darth Vader and Moff Wilhuff Tarkin on a mission to Murkhana. At the time, he held the rank of sergeant. Crest accompanied Vader and Tarkin as they investigated a building which held former Separatist contraband. However, as they did so, their vessel, the Carrion Spike, was hijacked. The guards and two crewmen aboard were killed, and Vader was angry at Crest for allowing such a thing to happen. To get a new vessel, Vader and Tarkin intimidated a local Sugi crime boss to give up his ship to them by threatening to destroy his warehouse with his family inside. The sergeant and his troopers took control of the warehouse, and later secured the crime lord's ship when he gave into the pressure and gave it up to the Imperials."}, {"tag": "p", "text": "When they pursued the Carrion Spike aboard the crime lord's ship, Crest and his troopers served as gunners. Despite their efforts, the unit failed to halt the Spike's multiple attacks on Imperial installations, and eventually stayed aboard the Liberator, a Venator-class Star Destroyer. By that point, only Crest and six troopers remained of Vader's original contingent that was on Murkhana. Later, they met up with a task force led by the Executrix, an Imperial-class Star Destroyer, which Tarkin appropriated as his flagship. Crest, having been promoted to lieutenant by Vader, was present with the Dark Lord aboard a picket ship. Their planned ambush for the Spike failed, however. He later reported to Vader and Tarkin on the capture of a freighter during the ambush, which he presumed had links with the hijackers of the Spike."}, {"tag": "p", "text": "Later, Lieutenant Crest accompanied Vader aboard the Conquest, a Secutor-class Star Destroyer, which served as the command vessel of Vice Admiral Dodd Rancit. Vader told Rancit he knew that it was he who was the traitor that provided aid to those who stole the Spike, and provided them with information to carry out attacks on Imperial targets. Vader ordered Crest and his men to lock Rancit in an escape pod and launch it out to a safe distance; whereon the treacherous admiral was forced to give the fleet a fire order that destroyed him for his disloyalty."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}