{"url": "Crev_Bombaasa/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Corellians", "Category:Crime lords", "Category:Humans", "Category:Males", "Category:Smugglers' Alliance members"], "nodes": [{"tag": "h1", "text": "Crev Bombaasa"}, {"tag": "p", "text": "Crev Bombaasa was a crime lord who founded a powerful cartel in the Kathol sector and later served the Hutt Borga Besadii Diori during the Yuuzhan Vong War. A well-educated man of refined manner and much literary knowledge, he was considered to have a distinctly beetle-like appearance, due to his stick-like limbs and pudgy body. Starting out as a small-time criminal working on Corellia early in the Galactic Civil War, he eventually moved to Pembric II in the Kathol sector, where law enforcement was almost non-existent. He and numerous fellow criminals merged their organizations and formed the Bombaasa Cartel, as a means of protection from large organizations, such as that of the Hutts. With Bombaasa at its head, the cartel became very influential in the Pembric system, and after Imperial Moff Kentor Sarne pulled out of the area in 8 ABY, Bombaasa seized control of Pembric II, making it a haven for smugglers, pirates, swoop gangs, and myriad other criminals. He had dealings with the New Republic envoy FarStar soon thereafter, but was able to repel any attempts by the Republic at diminishing his power."}, {"tag": "p", "text": "He remained on Pembric II for many more years, increasing in power and stature until his territory covered many systems. He eventually grew bored of the Kathol sector, and left to become an underling of Borga, the most powerful Hutt of the time. Bombaasa operated from a giant, nine hundred meter-long freighter named Starmaster, and was in charge of Hutt operations and spice smuggling in the Tynnani system and the Bothan worlds. During the Yuuzhan Vong War, he helped Borga feed information to the New Republic about impending targets of the extragalactic Yuuzhan Vong invaders, but after the Hutts' demise he became a member of Talon Karrde's reformed Smugglers' Alliance. Bombaasa contributed to the Galactic Alliance victory over the Yuuzhan Vong at the Recapture of Coruscant in 29 ABY, and along with Karrde, smuggler Booster Terrik, and Lando Calrissian, he pledged to change his ways and make an honest living."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rise"}, {"tag": "p", "text": "Crev Bombaasa originally hailed from Corellia. A cultured, well-educated man with a taste for sharp suits and expensive jewelry, he had an insect-like appearance and a genteel, refined manner. Despite this, however, he was known to have a vicious streak, and became a criminal early in his life. He operated predominantly in the Outer Rim, proving himself to be a competent crime lord with no qualms about doing harm to others, though he avoided doing any of the dirty work personally, as he abhorred participating in physical violence. During the Galactic Civil War, between 1.5 and 3.5 ABY, Bombaasa was in the employ of Shalera the Hutt and several other criminals, offering various services. He worked for Shalera in Tyrena, Corellia, often collecting dirt on her rivals or enemies for use as blackmail. Prior to the Battle of Hoth, he had a Bothan informant named Sli'woon Biul follow small-time criminal Didina Lippinoss and prepare a report on her activities. Lippinoss worked for Karrek Flim, a Viceprex of the Corporate Sector Authority, performing various activities for him that would stain his reputation if made public; Flim was not cooperating with Shalera, so Bombaasa sought to blackmail Lippinoss. He sent a spacer to collect Biul's report, which he found more than satisfactory; he attempted to blackmail Lippinoss, threatening to make public the information if she would not provide him with secret Corporate Sector Authority information. She refused, and subsequently sent a bounty hunter, Morrng, to kill Bombaasa. The Corellian had the spacer who had previously worked for him intercept and kill the bounty hunter. However, Bombaasa recognized that his feud with Lippinoss would not end until one of them perished."}, {"tag": "p", "text": "Some time later, Bombaasa relocated to the Kathol sector in the Outer Rim, a largely lawless area of the galaxy where entrepreneurial \"businessmen\" such as Bombaasa could make great profit. Pembric II in particular was a world mired with corruption and crime, which the Empire largely ignored, and Bombaasa operated from that world. Bombaasa's criminal organization was successful but small, like many others in the region, so he decided to form an umbrella organization consisting of various criminal enterprises similar to his own. The Bombaasa Cartel, as it became known, was a loose collection of Bombaasa's fellow criminals, and it wielded significant influence on Pembric II. Bombaasa's cartel was unable to compete on a level akin to the Hutts or other large syndicates, but it protected smaller criminal organizations such as his own from such large groups. The cartel also maintained a number of legitimate mining and shipping enterprises, building up a network of smugglers, shippers, and Imperial contacts which served a multitude of purposes. Bombaasa supported the local Des'maric Pirates, feeding them freighter travel plans so they could plan their assaults. He also bought off senior members of the gang in an effort to assume control of the group, and his biggest success was subverting Ginzet, the trusted lieutenant and friend of the pirates' leader, Miktiss. Bombaasa owned a number of sites on Pembric II, including the highly-popular ThrusterBurn Tapcafe, a tapcafe atypical of most similar locales in that it was bright and airy. Order was always maintained in the ThrusterBurn, with rowdy or troublesome individuals dealt with quickly and harshly. Bombaasa spent much of his time at the ThrusterBurn, gambling in the casino at the back. He tended to enjoy great success there."}, {"tag": "p", "text": "In 4 ABY, after the death of Emperor Palpatine and the fragmentation of the Empire, the Imperial moff of the Kathol sector, Kentor Sarne, withdrew the sector from the Empire and installed himself as a warlord dictator. While he ruled with an iron fist on most worlds, Sarne entered into a precarious alliance with the Bombaasa Cartel, allowing them to continue with their shady activities unencumbered in exchange for a link with the underworld and all the services it provided. Despite their allegiance, Sarne barely trusted Bombaasa, and the feeling was mutual. Bombaasa had faith in no one who had been in contact with Sarne; when Gaelin, an expert slicer native to Pembric II who had previously left to work for Sarne on Kal'Shebbol, returned to his homeworld, Bombaasa had him and his computers shut away in a subterranean laboratory, fearing he was still on Sarne's payroll. His suspicions of Gaelin were not unwarranted, though, as the slicer had in actuality been sent to monitor Bombaasa for Sarne. Even after being locked away, he was still able to send regular reports on the crime lord's activities back to Sarne on Kal'Shebbol."}, {"tag": "h3", "text": "Dealings with the FarStar"}, {"tag": "p", "text": "For several years, Bombaasa personally continued to rise in prominence until he effectively ruled Pembric II. In 8 ABY, after the New Republic had captured sector capital Kal'Shebbol, Sarne pulled out of Pembric II entirely. The cartel acted quickly, taking control and purging the planet of all Imperial loyalists. Bombaasa's methods of keeping control on the criminal- and cutthroat-ridden planet were described as ruthless, but they were very successful. Bombaasa and his men soon learned of the New Republic's victory at Kal'Shebbol, and that Republic forces were making inroads into the rest of the Kathol sector. Fearing Republic interference with their criminal activities, the cartel installed a puppet government with supposedly pro-Imperial tendencies on Pembric, hoping to discourage the New Republic from approaching. Bombaasa also froze practically all travel off the planet, with only those able to pay extremely high \"tariffs\" allowed to leave. The cartel began building up arms, with the corrupt Pembric Security Legion patrolling the system."}, {"tag": "p", "text": "A short time later, the New Republic arrived in the Pembric system. A local mining outpost identified a ship hovering around the edge of the system as the FarStar, a New Republic vessel. The information was relayed to Bombaasa and his underlings, who believed its covert presence was a prelude to a full-scale Republic invasion attempt. They monitored the ship after it sent a shuttle down to the surface; one of Bombaasa's foremost agents, the Rodian Kebbo, met the shuttle's occupants upon their arrival and directed them toward the ThrusterBurn tapcafe. While the Republic agents, posing as illegal arms merchants, conversed with manager Breslin Drake, Kebbo notified Bombaasa of their arrival. The crime lord wanted to speak with the agents personally, and Kebbo took them to the casino."}, {"tag": "p", "text": "Bombaasa dispensed with pleasantries entirely, informing the Republic agents that he knew who they were and making it clear that they were not welcome. He also made it known that he was aware of the New Republic presence in the system. He requested that they provide him with a guarantee that the New Republic would not encroach on his \"pro-Imperial\" territory, and assurances that the FarStar was not the spearhead of an impending attack by the New Republic. He suspected they did not have clearance to make such a guarantee, and told them that if this was the case they were to leave Pembric II post-haste, though they attempted to persuade Bombaasa that the New Republic had no intention of invading Pembric. He mocked them about the need to purchase a highly expensive travel permit, without which they would be stranded on the planet. However, they had already acquired some through other means, which sparked a confrontation between Kebbo and his backup Legionnaires. A firefight ensued, with Breslin Drake—the manager of the tapcafe, who was also a former New Republic Intelligence Service operative—and his bouncers assisting the New Republic agents, in the hopes that the agents would be able to help them find passage offworld. The group—consisting of the New Republic envoys, Drake, and the ThrusterBurn's bouncers—ultimately fled Kebbo and a fuming Bombaasa. Kebbo had the escapees' shuttle watched, though to no avail. The New Republic ambassadors broke into Gaelin's laboratory and freed him to use his expertise on their ship, and they were eventually able to escape back to the FarStar, along with Drake and his bouncers."}, {"tag": "h3", "text": "Karrde's visit"}, {"tag": "p", "text": "Bombaasa's power and stature continued to increase, and he continued to act as the effective leader of Pembric II for more than ten years. However, he had many enemies. Around five years after the FarStar's departure from Pembric II, an assassination plot was instigated against Bombaasa. Two individuals, Mara Jade and Lando Calrissian, of whom Bombaasa knew nothing aside from their appearances, foiled the attempt. Jade told Bombaasa they worked for a \"chieftain,\" whose true identity also eluded the crime lord; they refused to accept any payment, and Bombaasa never saw them again. By 19 ABY, he ran most of the illegal operations in the region of the Kathol sector that encompassed the Pembric system, and some referred to him as \"Lord Bombaasa.\" It was considered wise for any outsiders passing through the region to first get clearance from Bombaasa, which usually cost an inordinate amount of money. Bombaasa's organization also developed ties with the Hutts, though he kept these as secret as he could; the Hutts often provided him with information on potential rivals. During this time, a new slaving ring cropped up in Bombaasa's territory. Led by the Rodian Rei'Kas, the group had relocated from another area, and were considered to be particularly vicious by the cartel. Despite his efforts, Bombaasa and his forces were unable to either eliminate Rei'Kas or take control of his syndicate, and for over a year the Rodians proved particularly resilient and troublesome toward the cartel. At their height, the pirate syndicate possessed a sizable fleet of SoroSuub Corsair-class assault starfighters and other, larger vessels, and they preyed upon Bombaasa's freighters."}, {"tag": "p", "text": "In 19 ABY, Pembric II was visited by the Wild Karrde, operating under the guise of the Hab Camber, the ship used by Talon Karrde, a powerful crime lord and information broker; Bombaasa, however, had no idea who he was, knowing only that he seemed suspicious. Karrde left his ship in the company of an attractive woman, and Bombaasa had them followed; he suspected he might have been sent by the New Republic to coax Pembric into joining it. Karrde and his companion made their way to the ThrusterBurn, before entering an altercation with a gang of swoop riders, who had refused them entry. Bombaasa watched via remote hologram coverage as Karrde's accomplice—Shada D'ukal, his bodyguard and a former member of the Mistryl Shadow Guard—incapacitated all the bikers bar one, whom Karrde downed personally. Bombaasa then communicated with Karrde—whose identity he was still unaware of—from inside the casino via a hidden speaker; the information broker wanted to recall an old debt, the nature of which Bombaasa did not recall, and, intrigued, the cartel leader invited Karrde in to meet him face-to-face inside the casino."}, {"tag": "p", "text": "Karrde and D'ukal entered shortly, exchanging pleasantries with Bombaasa. Karrde revealed that he had been the mysterious \"chieftain\" of whom the two individuals who'd saved Bombaasa's life several years prior had spoken. Karrde wanted to call in the debt and gain Bombaasa's clearance to travel through his region unhindered, to conduct business. Warming to the man because of his the previous actions of his underlings, Bombaasa agreed to provide Karrde's ship with a special ID overlay that would identify it as being under the cartel's protection. However, he warned Karrde of the increasing activity of Rei'Kas and his fellow pirates, explaining that they could expect no protection from them. After finally revealing his identity to Bombaasa—and his knowledge of the cartel's ties with the Hutts—Karrde departed; the two postulated that they might meet again in the future. Karrde did indeed run into Rei'Kas during his journey, but the Rodian's fleet was destroyed by the Aing-Tii, a species of monks in the Kathol sector who despised slavery."}, {"tag": "h3", "text": "Working for the Hutts"}, {"tag": "p", "text": "Bombaasa ultimately grew bored with life in the Pembric system. By 25 ABY, he had begun to work directly for the Hutts, leaving the Kathol sector for the Outer Rim, Expansion Region, and Mid Rim. He worked predominantly in the lucrative spice trade, and was in charge of Hutt operations in many systems, including the Tynnani and Both systems. He worked as a direct subordinate of Borga Besadii Diori, leader of the Besadii clan and the most powerful Hutt of the time. Operating out of worlds like Ryloth, where spice was mined and easily exported, he and his men used the freighter Starmaster—a giant ship, approximately nine hundred meters long, equaling the size of a Victory-class Star Destroyer—as their headquarters. Scores of tenders, gunboats, and shuttles as well as a costly Ubrikkian Industries luxury yacht were constantly tethered to it. During the six years between Karrde's visit to Pembric II and 25 ABY, Bombaasa mellowed somewhat; while still committed crime on a regular basis, the viciousness for which he was renowned was less apparent. However, in 25 ABY, the extra-galactic Yuuzhan Vong struck at the galaxy, waging war on the New Republic and any others who stood in their path. The Hutts had mixed fortunes as a result; the despair brought by the Yuuzhan Vong War meant even more sentients were turning to spice as a means of escape, resulting in increased revenue, but Hutt Space was in risk of being attacked. Before the Yuuzhan Vong struck, Borga formed an uneasy alliance with the invaders, but the Hutts were in constant fear of being betrayed."}, {"tag": "p", "text": "The Yuuzhan Vong provided Borga with intelligence on which worlds were due to be attacked. Still fearful that the aliens planned to backstab her, the Hutt decided to surreptitiously feed the New Republic with information, in the hopes that it would come to her aid if and when the Yuuzhan Vong betrayed the Hutts. When she learned her temporary allies planned to attack Corellia, Tynna, and Bothawui—the latter two of which were in Bombaasa's territory—she ordered her subordinates to immediately suspend the spice trade within the planets' systems, hoping that the New Republic would pick up on it and fortify the systems accordingly. From his ship in orbit above Ryloth, Bombaasa did as he was instructed, focusing all his efforts elsewhere. Borga informed Bombaasa of her reasons for doing so, making him one of few with the knowledge. A short time later, the Wild Karrde docked with the Starmaster, and a number of beings boarded the massive freighter to meet with Bombaasa's underlings, among them Rol'Waran, a local. Rol'Waran identified two of the beings as Karrde and D'ukal—the others were Jedi Knights Ganner Rhysode and Kyp Durron—though Bombaasa ordered him to go ahead with the meeting as planned. Karrde wished to purchase a large amount of spice, asking for it to be delivered into Tynna and, when Rol'Waran refused that, Bothawui. This was out of character for Karrde, a man who had never really been interested in spice and who had somewhat \"legitimized\" himself shortly after his brief time in the Kathol sector in 19 ABY; deducing that Karrde had noticed the peculiar and sudden change in shipping patterns, Bombaasa revealed himself."}, {"tag": "p", "text": "Karrde was surprised to see Bombaasa, unaware that the Corellian had left Pembric. Both men treated each other cordially, but Bombaasa made it clear his debt to Karrde had been repaid and that the information broker could expect no similar favors from him. Bombaasa ordered Karrde to stop lying about wanting in on the spice trade and to tell him exactly why he was on the Starmaster; Karrde replied with a short speech about how the times were changing and that former enemies were working with each other. Bombaasa agreed, and though Karrde made it clear he would continue to work on the New Republic's behalf, Bombaasa was unsure which side of the line he stood on; above all else, he wanted to live comfortably. Despite this, he implied to Karrde that Borga had ordered him to suspend trading into Tynna and Bothawui because of Yuuzhan Vong intelligence, and tacitly informed him that Borga was playing both sides, intentionally allowing the likes of Karrde to warn the New Republic of impending attacks. Karrde thanked him for his help, promising to put in a good word for Bombaasa to the New Republic, and postulating that, eventually, smugglers, pirates, mercenaries and other fringers might form an alliance to help repel the Yuuzhan Vong."}, {"tag": "h3", "text": "Shifting allegiances"}, {"tag": "p", "text": "Bombaasa subsequently traveled to Nal Hutta to apprise Borga of the situation with Karrde; meanwhile, Tynna was conquered by the Yuuzhan Vong. Borga was due to meet with Yuuzhan Vong Supreme Commander Nas Choka, Commander Malik Carr, and Nom Anor, the latter of which had had previous dealings with her in the guise of \"Pedric Cuf,\" New Republic traitor. Borga recalled many of her trusted confidants, including Bombaasa, Pazda Desilijic Tiure, Gardulla Besadii the Younger, and former Hutt ambassador to the New Republic Golga Besadii Fir, to listen in, hidden, on the conversation between Borga and the Yuuzhan Vong. Nas Choka declined Borga's offer to transport captives for the invaders in exchange for further forewarning of any planned invasions, though he agreed to inform the Hutts of his activities as he saw fit. Choka also informed Borga that she could resume trading into the Bothan worlds, as they were no longer being considered as a target; however, he warned that, should she share the information with any third party, she and Hutt Space would be in dire peril. He also intimated that, should his superiors decree it necessary, he would raze Nal Hutta without hesitation."}, {"tag": "p", "text": "When the Yuuzhan Vong departed, Borga's confidants returned to her throne room to discuss proceedings. Pazda immediately told Borga that any dealings with the aliens would end in disaster for the Hutts, which the others agreed with. Borga also feared that the web of backstabbing between the Hutts and the Yuuzhan Vong was growing too intricate; she was unsure whether Choka was using her to feed the New Republic with false information. Ultimately, she ordered Bombaasa to triple all spice shipments into the Both system, hoping to make it clear to the New Republic that Corellia was Choka's intended desire. Bombaasa preached caution, reminding Borga of her promise to Choka and the consequences that would ensue if the Supreme Commander caught wind of her deception and of the fact that her child, Randa, was currently aboard a Yuuzhan Vong ship, deep in occupied territory at Kalarba. Borga was unfazed; she reiterated her earlier order to Bombaasa, and told him to make contact with Talon Karrde with some information unearthed by her child. Aboard the Yuuzhan Vong ship, Randa had discerned that the Yuuzhan Vong were also keeping a Jedi, Wurth Skidder, captive. Bombaasa was to inform Karrde of this in the hopes that Karrde could instigate a rescue mission; the end result, she hoped, would leave her further endeared to the New Republic and would see Randa freed."}, {"tag": "p", "text": "Bombaasa did as instructed with both orders. Talon Karrde had a team sent to rescue Skidder, and Randa was freed. However, ultimately, Nas Choka had been playing Borga; his true target was neither Corellia nor Bothawui, but Fondor. His attempt to take the world was partially halted by the last minute use of the Centerpoint Station superweapon by the New Republic, but Borga's deception had been discovered. The Yuuzhan Vong conquered Hutt Space and terraformed Nal Hutta. Without an employer, Bombaasa eventually turned to Talon Karrde and joined his resurgent Smugglers' Alliance, which was serving almost as an extension of the newly-formed Galactic Alliance Defense Fleet. Bombaasa became one of Karrde's trusted right-hand-beings, alongside Shada D'ukal, Booster Terrik, and Lando Calrissian."}, {"tag": "h3", "text": "War's end"}, {"tag": "p", "text": "In 29 ABY, four years after the beginning of the war, the New Republic was preparing to make inroads towards retaking Coruscant and defeating the Yuuzhan Vong. The Yuuzhan Vong, meanwhile, were planning to attack Mon Calamari, and were using the planets Toong'L and Caluula as staging areas. The New Republic hoped to use a portion of their fleet to attack Coruscant while the majority of the enemy forces were in the Calamari system. A ground team consisting of Leia Organa Solo and Han Solo, as well as Alliance operatives Judder Page, Kyp Durron, Meloque and Graw was sent to disable the yammosk war coordinator on Caluula, a piece of biotechnology vital to the Yuuzhan Vong's war effort. Han Solo had Karrde, Bombaasa, Lando Calrissian, and Booster and Mirax Terrik dispatched in Booster's Star Destroyer Errant Venture to rid the system of any Yuuzhan Vong forces while the team was on the ground. The Star Destroyer's crew was surprised to find, upon entering the system, the area almost entirely devoid of any Yuuzhan Vong presence, despite Caluula housing a vital yammosk war coordinator. Booster Terrik was annoyed that they had used his ship when the smaller Wild Karrde would have sufficed, but they mopped up the few Yuuzhan Vong ships present with ease. Bombaasa oversaw the gunners' efforts, which were successful."}, {"tag": "p", "text": "Karrde, D'ukal, and Calrissian journeyed to Caluula's surface to rescue the Solos and their team from the Yuuzhan Vong base, fending off a number of Peace Brigaders en route. Karrde and his companions were successful, as were the Solos, who had successfully completed their mission. They also bore the news that the Galactic Alliance had covertly released a toxin known as Alpha Red which would target and eradicate only Yuuzhan Vong organisms; however, it had also killed some of the plant life on Caluula, and they believed it to be extremely dangerous. Hoping to contain the toxin in the Caluula system, Karrde contacted Bombaasa, who was busy overseeing the Errant Venture's gunners' attempts to take down the sole remaining Yuuzhan Vong ship, a type of corvette analog which they had not encountered before. As Karrde requested that Bombaasa ensure the ship did not flee, it escaped into hyperspace, a feat regular Yuuzhan Vong starfighters lacked. All they could do was hope that its pilots perished before returning to Coruscant—neither the Solos nor the Smugglers' Alliance wanted genocide. The Battle of Mon Calamari, meanwhile, ended in a stalemate, and Jedi Master Luke Skywalker returned to the Coruscant system from the Unknown Regions with Zonama Sekot, a living planet that he believed was key to defeating the Yuuzhan Vong; fighting stopped as the Yuuzhan Vong began deciding what to do about Sekot. A Jedi Convocation was called, with Bombaasa and his companions on the Errant Venture ferrying numerous Jedi to the world, and later transporting Luke Skywalker to Contruum to meet with the upper echelons of the Galactic Alliance military, before returning to Sekot."}, {"tag": "p", "text": "Before long, the Recapture of Coruscant had begun, with Galactic Alliance forces attempting to take Coruscant while Warmaster Nas Choka's fleet engaged the Galactic Alliance fleet at Muscave. Meanwhile, the Smugglers' Alliance and the Hapans were tasked with defending Zonama Sekot. Before long, a portion of Choka's forces made a move for the living world, sending their fastest ships toward it. The joint defense perimeter of Bombaasa and the Smugglers' Alliance and the Hapans was able to act as a screen, but the Errant Venture identified one of the enemy vessels as that which escaped Caluula, and feared that Alpha Red might also harm Zonama Sekot. Ultimately, however, Sekot was able to defend itself from the ship; the Galactic Alliance was victorious, and the Sekot Accords were signed, signaling the end of the devastating war. Bombaasa, Terrik, Karrde, and Calrissian traveled to Sekot's surface in the aftermath of the battle, though the place was practically deserted, as a Jedi meeting was ongoing. The three men began to have a drink, and were soon joined by Han Solo and veterans of the Rebellion Wedge Antilles and Tycho Celchu. They discussed the implications of the war, and Solo eventually told Bombaasa, Terrik, Karrde, and Calrissian that they deserved the plaudits for their work in defending the galaxy from the Yuuzhan Vong. The four men took the time to announce that they had decided to change their ways and seek a more honest living."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Crev Bombaasa was known for his distinctive appearance. A short, pudgy man, his limbs were much thinner than the bulk of his body, giving him what many noted to be a beetle-like appearance. His eyes were round and slightly bulging, which only added to his perceived resemblance of an insect. Bombaasa was fastidious about his appearance, always ensuring that his thinning black hair was neatly styled, and regularly wearing business suits, usually tan in color. Additionally, he often wore expensive jewelry, which was described as tasteful."}, {"tag": "p", "text": "Bombaasa liked to consider himself a cultured man, which was rare in his line of business. He was always polite, even when dealing with enemies or rivals, maintaining an air of genteelness and civility. The well-educated Bombaasa often used figures from obscure culture in his speech, such as Rastus Khal, a character from a famous piece of Corellian literature. He always used manners and was known to mince his words and use sophisticated language at times; however, when the occasion came, he was able to cut to the chase and make his points clearly and plainly. Underneath his polite, refined exterior, however, Bombaasa was considered to be extremely ruthless and a vicious cutthroat, who would take advantage of, or harm someone, without a second thought. He cared little for the lives of petty criminals; Bombaasa watched Shada D'ukal kill a number of swoop riders with glee, and ordered their bodies to be carted away unceremoniously by his underlings. A competent criminal, he was involved in crime for much of his adult life, starting off as a small time middleman and eventually becoming the kingpin of a large domain."}, {"tag": "p", "text": "Despite his vicious streak, Bombaasa was loathe to ever actually inflict damage on another being with his own hands, preferring to hire others to do his dirty work. He was also a man of his word; after promising to allow Karrde safe passage through his territory, Bombaasa stayed true to his word, and Karrde never suspected he would renege on the deal. The Corellian also had an interest in women; he found Shada D'ukal very beautiful, offering to have her gown cleaned if she would remove it and suggesting she become his concubine. Bombaasa liked to gamble, and had a special casino built at the back of the ThrusterBurn tapcafe, where himself and other select beings could gamble without interruption."}, {"tag": "p", "text": "As he grew older, Bombaasa mellowed somewhat, and was more sympathetic toward the New Republic, which he had always feared would interfere in his affairs on Pembric II. Additionally, Bombaasa tended to grow bored of doing the same thing for long periods of time; at some point between 19 and 25 ABY, he left the Pembric system, which he had called home for over a dozen years, to work directly for the Hutts. Even though it meant he was no longer his own master, it increased his revenue. After the Yuuzhan Vong struck, however, Bombaasa began to think of his future, with the Hutts in potential peril after surreptitiously working against their temporary ally, Supreme Commander Nas Choka. Bombaasa supplied Talon Karrde with information about Yuuzhan Vong targets, and even though he did so on Borga's orders, Bombaasa requested that Karrde inform the New Republic of Bombaasa's actions. Bombaasa was extremely cautious when asked his opinion by Borga during the Yuuzhan Vong War; he felt that ending the alliance with the invaders would be suicide but also preached against Borga's continual breaking of her promises to the aliens. Bombaasa's newfound sympathy toward the New Republic meant that, when Borga was defeated, he joined with the Galactic Alliance-allied Smugglers' Alliance, and vowed to turn away from crime after the war's end."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Crev Bombaasa was created by West End Games for The DarkStryder Campaign, a series of adventures for Star Wars: The Roleplaying Game published in 1995. He appeared as one of the antagonists of the Crisis adventure, and was mentioned in the subsequent adventure, Traitor in our Midst. In Crisis, depending on what options the players choose, Bombaasa can either become an ally of the FarStar or an enemy. In 1998, Timothy Zahn, who was involved with The DarkStryder Campaign, featured Bombaasa in his novel Vision of the Future. James Luceno featured the character in two of his books in The New Jedi Order series, The New Jedi Order: Agents of Chaos II: Jedi Eclipse, and The New Jedi Order: The Unifying Force. Bombaasa also features as a non-player character in Star Wars Galaxies."}, {"tag": "p", "text": "Although the spelling of \"Bombaasa\" is used in Crisis, Vision of the Future, and Jedi Eclipse, The Unifying Force incorrectly spells his name as \"Bombassa\" and, in one case, \"Bombossa\". In Star Wars Galaxies, Bombaasa's appearance differs greatly from his description in previous sources; Crisis and Vision of the Future describe him as a pudgy man with thin limbs and a distinctly beetle-like appearance and his picture shows him with a full head of hair, but in Galaxies he is a thin, tall man with little hair."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}