{"url": "Crevasse_City_(Alderaan)/Legends", "categories": ["Category:Legends articles", "Category:Cities on Alderaan", "Category:Twenty Wonders of the Galaxy"], "nodes": [{"tag": "h1", "text": "Crevasse City  (Alderaan)"}, {"tag": "p", "text": "Crevasse City was a city on Alderaan. It was considered one of the Twenty Wonders of the Galaxy by the historian Vicendi in his 10,000 BBY publication Arturum Galactinum."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Crevasse City was located in a canyon. It had no spaceport, but public transportation linked the city with Aldera, which handled all the city's space traffic. The city boasted creature comforts of all kinds, including restaurants, bars and parks, and by reputation had the best hotels on the planet."}, {"tag": "p", "text": "The city was constructed downwards, meaning the oldest buildings were on the surface, with newer facilities being built lower into the crevasse. The lowest levels of the crevasse remained untouched throughout Alderaan's history and featured a maze of caverns containing beautiful crystal formations, hot springs and underground lakes."}, {"tag": "p", "text": "The surface of Crevasse City received no more than six hours of sunlight a day, and the city streets and hallways were filled with artificial lighting built into the architecture in various artistic and clever forms. The colors of the lights took on unique meanings: white for death and mourning, blue for happiness, green for love, silver for prosperity, and orange for danger or warning."}, {"tag": "p", "text": "Hidden in a far corner of the city lay its industrial section. Crevasse City was powered by geothermal power plants. It was also the home of one of Alderaan's only mining operations and the Crevasse City Collegium for Young Ladies."}, {"tag": "p", "text": "Like the rest of Alderaan, it was destroyed by the Death Star's superlaser in 0 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}