{"url": "Crian_Maru", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Knights of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Crian Maru"}, {"tag": "p", "text": "Crian Maru was a Human female Jedi General in the Army of Light during the latter days of the New Sith Wars. She had a Rodian Padawan named Dree Vandap and flew the Golden Song, named after her impression of the Force. In the end, Crian was nearly close to the dark side and was killed at the Duel on Balowa in 1000 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Crian Maru was a Human Jedi Knight during the time of the uprising of the Sith Brotherhood of Darkness. As an apprentice, Crian had taken on the young Rodian female, Dree Vandap. At the time of Crian's role as a teacher, the Jedi were at war with the Sith, and Crian had taken on the mission of locating and dealing with the Dark Sider known as the Marauder, the Madman, and the Dark Killer, Kaox Krul. Traveling across the galaxy in her ship, the Golden Song, Crian and her apprentice had tracked Kaox Krul to the planet Harpori in the Balowa system. Following the Madman`s trail of massacres and darkness, Crian and her apprentice finally pinpointed Kaox`s location."}, {"tag": "p", "text": "However, the Marauder got the jump on the two Jedi and in a daring space battle, Kaox engaged the duo. Although they survived his attack, their ship was greatly damaged. As Kaox attempted to finish them off, the two Jedi crippled the dark sider's own ship sending it to the planet's surface below. Damaged beyond capability of flight, the Jedi brought the ship to a safe landing only made possible by the Force, both the Jedi and Madman were able to survive their crash. However, the Jedi were not safe; for Kaox was unwavering in his goal to destroy them. The Jedi managed to salvage a speeder bike from the wreckage of the Golden Song and began to flee the area; hoping to avoid Krul until they could regroup."}, {"tag": "p", "text": "Before they were able to flee however, Kaox Krul engaged Dree in battle as Crian readied the speeder bike for take-off. She managed to start it, snatching Dree upon the bike as she drove off into the forest."}, {"tag": "p", "text": "Empowered with dark side energies, Kaox was able to pursue the fleeing Jedi at amazing speed; catching them and destroying their bike with his blade. The lightsaber strike to the speeder caused Kaox to lose his balance, allowing Crian and Dree an escape on foot. For two days Crian was able to keep her and her apprentice ahead of Krul, but eventually he drew closer."}, {"tag": "p", "text": "Kaox approached the Jedi Knight at a lake in the forest where she had stopped to rest. Realizing that she could no longer run from the Madman, Crian engaged him in a fierce battle. It took all of Crian's strength in the Force to keep up with Kaox and the two traded blow after blow until Dree jumped into the battle herself, forcing Kaox to fight an adversary on each side. Using the Force to send Crian flying into the lake, Kaox vaulted over Crian's apprentice, landing behind her to deliver a killing blow. Mortified at the loss of her apprentice, Crian gave into the anger that was deep within her. Crian and Krul eventually took their battle over the surface of the lake, using the dark energies to hover above the water. With so much energy pouring into keeping themselves in the air, the two impaled each other simultaneously. Crian's body disappeared, becoming one with the Force as well as Krul's body."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}