{"url": "Creysis", "categories": ["Category:Legends articles", "Category:Ebruchi", "Category:Males", "Category:Pirates", "Category:Warlords"], "nodes": [{"tag": "h1", "text": "Creysis"}, {"tag": "p", "text": "Creysis was a pirate captain in a clan of Ebruchi Pirates. He commanded his own scout squadron within the pirate clan. Ambitious, he sought to move up the command chain."}, {"tag": "p", "text": "One such opportunity presented itself when the Imperial Star Destroyer Admonitor arrived in the system which he patrolled. Passing himself off as a warlord king, Creysis boarded the ship, which its commander, Grand Admiral Thrawn, passed off as a colony ship. In this game of mutual deception, Thrawn had the upper hand, divining Creysis's position from his actions while scrupulously maintaining the illusion of weakness."}, {"tag": "p", "text": "Thrawn offered Creysis a statue as a token of goodwill before opening negotiations for help finding a planet to colonize. Thrawn promised to have the fictitious \"Council of Colonists\" look into the matter."}, {"tag": "p", "text": "Creysis received the \"Council\", consisting of Commander Voss Parck and a few stormtroopers out of uniform, then attacked and captured a TIE/LN starfighter, desirous of the advanced technology. Thrawn kept up the facade of harmlessness, pursuing slowly and luring Creysis into a false sense of security. Additionally, the TIE had been stripped of its advanced technology by Thrawn's technicians, giving Creysis a false idea of the Imperials' capabilities."}, {"tag": "p", "text": "Falling further into Thrawn's trap, Creysis deployed a courier to his superiors with the statue as a token. He also dispatched multiple decoys on separate vectors, but failed to realize Thrawn had installed a tracking device in the statue. With the knowledge of where Creysis's base lay, Thrawn suddenly attacked, easily overwhelming the Ebruchi and taking Creysis prisoner."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}