{"url": "Crime_scene_analysis_droid", "categories": ["Category:Legends articles", "Category:Analysis droid models"], "nodes": [{"tag": "h1", "text": "Crime scene analysis droid"}, {"tag": "p", "text": "A crime scene analysis droid was an analysis droid utilized by the Jedi Order to assist Jedi investigators when they were working on cases. Towards the end of the Galactic Republic, as the Dark side of the Force grew stronger, the abilities of the Jedi waned and they had to turn more and more to analysis droids to assist in solving crimes. Russo-ISC was a crime scene analysis droid assigned to the Jedi Temple and assisted Jedi Anakin Skywalker and Ahsoka Tano when they investigated the explosion in the Jedi Temple hangar."}, {"tag": "p", "text": "The SP-4 and JN-66 models used by the Jedi are also popular with scientists and police forensics units. They work best as a team, with JN-66 handling the experimentation and SP-4 drawing conclusions from the results. Cybot Galactica saved on manufacturing costs by repurposing many structural pieces from its popular line of PK worker droids."}, {"tag": "p", "text": "The SP-4 is designed to interact with organics, and possesses a humanoid body and oversize photoreceptors arranged in a style that most consider endearing. The attenuated stalk that houses the droid's vocabulator is reminiscent of the vocal organs of the Pa'lowick species."}, {"tag": "p", "text": "The SP-4, which can wirelessly access mainframe data libraries, is built to analyze reams of data and arrive at a single, accurate solution. In a hypothetical case involving a shooting death, a police department SP-4 might look at weapon discharge patterns, weather reports from the day of the crime, biological charts of the victim's species, and a geometric triangulation of firing angles before fingering a likely suspect. Critics of SP-4s claim that droids are simply incapable of making the intuitive leaps that often provide the key to cracking difficult cases."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}