{"url": "Crimson_Axe", "categories": ["Category:Legends articles", "Category:Frigates", "Category:Pirate starships", "Category:Residential buildings", "Category:Socorro locations"], "nodes": [{"tag": "h1", "text": "Crimson Axe"}, {"tag": "p", "text": "The Crimson Axe was the starship of Rav that later served as his permanent headquarters."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Crimson Axe had a vertical configuration, with the command and control decks mounted on top. The hull was heavily armored, and had a wedge shape. It was often used to ram vehicles to board or disable them."}, {"tag": "p", "text": "It had several hangars, with the main hangar being on the front of the vessel. The main hangar was protected by armored doors. The auxiliary hangars were aft-facing, and were on the decks below the main engines. Although Rav encouraged the idea that the Crimson Axe was still operational, it is unknown if the ship was still capable of flight after being grounded in the sarlacc pit on Socorro."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Crimson Axe was used by the Bloody Bones pirates to attack ships and settlements throughout the Outer Rim. It was also used to ransack defeated military bases or pick through the debris field left by massive space battles."}, {"tag": "p", "text": "It was the ship that found Cade Skywalker floating in space above Ossus following the Massacre at Ossus in 130 ABY. Skywalker and Jariah Syn worked onboard the ship as part of Rav's pirate crew."}, {"tag": "p", "text": "By 137 ABY, the Axe was located in an old sarlacc pit high above the Killee Wasteland of Socorro, having been converted into a stationary base of operations. That year, Syn, Skywalker, and Deliah Blue brought gambler Naxy Screeger and Jedi Hosk Trey'lis to the Axe, turning the pair over to Rav for the bounty on their heads."}, {"tag": "p", "text": "The Crimson Axe contained the Golden Gorg Cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}