{"url": "Crimson_Dawn", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Criminal syndicates and cartels", "Category:Crimson Dawn personnel", "Category:Shadow Collective organizations"], "nodes": [{"tag": "h1", "text": "Crimson Dawn"}, {"tag": "p", "text": "Crimson Dawn was a criminal organization led by the former Sith Lord Maul, who employed the gangster Dryden Vos as the public face of the syndicate during the reign of the Galactic Empire. Crimson Dawn was based aboard Vos' yacht First Light. During its existence, Crimson Dawn quickly cemented a reputation for being ruthless. Qi'ra publicly served as Vos' top lieutenant, but later directly worked with Maul after killing Vos."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Mercenary roots"}, {"tag": "p", "text": "Before reorganizing into a larger criminal enterprise, the forerunners of Crimson Dawn were a band of ruthless mercenaries who traveled from planet to planet, seizing the resources they coveted or needed while brutalizing the natives into complying. One such world was the desert planet Savareen, which possessed a resource that they desired. After several raids on their world, the Savarians rose up against them, refusing to comply anymore. As punishment for their defiance, the mercenaries cut out the tongues of every single man, woman, and child they could find."}, {"tag": "h3", "text": "Member of the Collective and Imperial Era"}, {"tag": "p", "text": "In 19 BBY, Crimson Dawn became a member of the Shadow Collective, a vast criminal organization under the control of the rogue Sith Lord Maul. At the time of the Siege of Mandalore, Crimson Dawn was led directly by Dryden Vos. Just prior to the enactment of Order 66, Maul ordered Vos, as well as the other leaders in the Shadow Collective, to go into hiding, in anticipation for the chaos following the rise of the Empire."}, {"tag": "p", "text": "Maul eventually took a more direct role in Crimson Dawn's activities. Much like his previous rule over Mandalore, Maul elected to rule from the shadows rather than establish himself as the visible leader of his syndicate. However, unlike the Shadow Collective, most of the rank-and-file of the organization did not report to him directly and few even knew his identity. Instead, Maul relied on a figurehead to serve as the executor of his will to his men. By 10 BBY, Dryden Vos still served as the public leader of the organization until his death. From there, Qi'ra, Vos' second-in-command, would take up the position formerly filled by Vos after she was promoted by Maul. The Galactic Empire often clashed with Crimson Dawn in security enforcement missions."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Even after Maul's death during the mission to Tatooine, the mark left by Crimson Dawn on the galaxy could still be felt. In the years following the formation of the Galactic Senate of the New Republic in 4 ABY criminal organizations that evolved from Crimson Dawn held substantial power. Although the New Republic Senate formed the Sector Rangers to combat such criminal groups, it was a mere fraction of the size of the Galactic Empire, under which Crimson Dawn thrived as one of the deadliest and most powerful syndicates around. Though still active in the decades following the fall of the Empire, Crimson Dawn itself no longer held the influence it once did and was viewed as a relic of the past by contemporary underworld denizens such as Kanjiklubber Razoo Qin-Fee and the Master Codebreaker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Solo: A Star Wars Story script writer Jon Kasdan stated that the name \"Crimson Dawn\" for the organization was conceived as a subtle way to hint Maul's appearance in the film, in addition to the artifacts from Dryden's study and Qi'ra's use of Teräs Käsi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}