{"url": "Crimson_Empire", "categories": ["Category:Real-world articles", "Category:Crimson Empire"], "nodes": [{"tag": "h1", "text": "Crimson Empire"}, {"tag": "p", "text": "Crimson Empire was a series of comic books written by Mike Richardson and Randy Stradley. They were originally released by Dark Horse Comics in 1997 and 1998 as a 6-issue monthly series, which were later compiled and sold as a trade paperback. Its sequel, Crimson Empire II: Council of Blood, was released later in 1998 and 1999. It is primarily acclaimed for the twelve-page final duel between Kir Kanos and Carnor Jax. In late 2008, it was claimed that work on Crimson Empire III: Empire Lost, Crimson Empire's second sequel, would begin; Randy Stradley later debunked this claim. At Celebration V it was announced Crimson Empire III would be released in 2011."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In all the Empire, there are no more fearsome warriors than the Emperor's Imperial Guard, and none is more loyal than Kir Kanos. But when Carnor Jax—the most formidable of this elite brotherhood—betrays the Emperor and orders the murder of the Guard, Kir must escape to carry out his duty to avenge his master. Devoted to the last, Kir must nonetheless ally himself with Rebel forces to help him attain his retribution in the face of the Empire's full might brought down to destroy him. For Kir Kanos, the last royal Imperial Guard and the final threat to Jax's rise to power, there are no alternatives—loyalty never dies."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet of Zaddja in the Trilon sector, General Wessel's men have tracked down former Imperial Royal Guardsman Kir Kanos. Upon the closer inspection, the dwelling is revealed to be empty except for a time bomb that Kanos left behind, which detonates, killing every troop in the strike team."}, {"tag": "p", "text": "Kir Kanos finds himself on a remote Imperial planet called Phaeda. After a group of drunk off-duty stormtroopers start a cantina brawl, Kanos is forced to violence, killing the entire group and revealing his presence. A man named Merkon offers him a place to hide and rest before reinforcements arrive."}, {"tag": "p", "text": "While he waits, Kanos recounts his first experiences as a royal guardsman. He is fighting on a faraway world alongside his onetime ally Carnor Jax. Their fighting skills impress their commanding officer, who transfers them to Yinchorr, the secret training grounds for the Emperor's red guard. Time jumps forward several years to his first meeting with the Emperor and Darth Vader during one of their inspections of the guardsmen-to-be. Darth Vader challenges the most talented recruit, Burr Danid, to a duel in the Squall, a terrifying arena suspended over a bottomless pit. Vader crushes him mercilessly in combat and kicks him into the abyss. Kanos recalls this as the moment he realizes that mere perfection is not enough in the service of the Emperor."}, {"tag": "p", "text": "Meanwhile, in present day, Colonel Shev, the corrupt bureaucratic ruler of Phaeda, investigates the cantina murders. He seeks to capture Kanos and turn him in before the murders bring undue attention to his corrupt activities."}, {"tag": "p", "text": "Merkon brings Sadeet and Mirith Sinn to Kanos's hiding place. After a tense incident in which Kanos threatens Mirith and Sadeet with a blaster, Mirith offers him a place among the Phaeda rebels. As they leave, Merkon promises to sidetrack Shev's investigation."}, {"tag": "p", "text": "The cantina incident has attracted the attention of General Wessel and the reigning Imperial lord, Carnor Jax. They are en route to Phaeda and order Colonel Shev to stand down. Shev disobeys the order and continues the search. He is aided in his search by his informant, Tem Merkon, the man who hid Kanos. Merkon gives him the location of the rebel base. Shev orders an assault on the Rebel base in the remote mountains around the spaceport."}, {"tag": "p", "text": "Upon arriving at the rebel base, Kanos wastes no time in making Sadeet and Massimo feel threatened. Unaware that Kanos is a former royal guardsman, the rebels set him up in temporary quarters and offer him shelter. Over a meal, Mirith tells Kanos about her past on Nez Peron and her motives in rebelling against the empire."}, {"tag": "p", "text": "Mirith leaves Kanos alone, and Kanos continues recounting his past into his recording device. This time, he recalls the final day of his training on Yinchorr. After killing Lemmet Tauk, his training partner, during a forced duel for a place in the Royal Guard, Kanos graduates and joins the Royal Guard. Darth Vader strikes him across the face with his lightsaber and gives him his scar."}, {"tag": "p", "text": "After a poor command decision by Mirith Sinn, one squad of rebel troops ends up surrounded by Shev's troops and without reinforcements. As Massimo is about to be captured, a mysterious royal guard begins single-handedly eliminating Shev's army. As Mirith confronts him, a TIE Interceptor strafes the group. The guardsman takes a hand blaster and shoots the pilot through the viewport, killing him and causing the ship to careen out of control and crash into the remote command post, winning the battle. After the battle, the guardsman reveals himself as Kir Kanos. The rebels, their base discovered, begin evacuations."}, {"tag": "p", "text": "Mirith, looking for Kanos, finds his recorder lying around in his room. She listens to his third recorded entry, which recounts the events following the battle of Onderon. Kyle Hannad, who barely survived the battle, returns to Yinchorr to tell the other guardsmen what he has learned: Carnor Jax was not killed when Byss was destroyed; Jax is alive, he had paid the Emperor's physician to create faulty clones for the Emperor, and he had gained control of two divisions of stormtroopers. He orders the troops into the guardsmen's stronghold on Yinchorr. Though the former Royal Guards killed hundreds of stormtroopers in the battle, sheer numbers overwhelmed even immeasurable talent, and all of the guardsmen died that day, save Kanos, who escaped, and Jax, his sworn enemy."}, {"tag": "p", "text": "In the present day, Kanos plans to leave the planet. In the aftermath of the battle, Merkon goes once more to Colonel Shev to offer him the location of Kanos's ship, just before Jax and Wessel drop out of hyperspace. Merkon returns to the rebel base once more to rendezvous with Mirith and Sadeet. Sadeet has already begun to suspect Merkon at this point and tries to mislead him about where the rebels are going, but Mirith corrects Sadeet and tells Merkon about the fallback point at Collo Fauale."}, {"tag": "p", "text": "Jax scolds Colonel Shev and receives information from Merkon about the location of the rebel base and Kanos's ship. The rebels discover Merkon's treachery and kill him. To save Kanos, Mirith disguises herself and goes to Kanos's ship to be captured in Kanos's place. Jax tortures her (to no avail) to find out Kanos's location. She talks when he threatens to destroy the rebel base using the turbolasers aboard his orbiting star destroyer, the Emperor's Revenge. Jax does not keep his promise, ordering the Steadfast to bombard the rebel base even though Mirith talked. However he does allow Mirith to leave safely."}, {"tag": "p", "text": "Jax leaves for Yinchorr, where Kir Kanos is waiting for him. The Steadfast is left alone in orbit over Phaeda, where Rogue Squadron delays them until General Wedge Antilles and the captured Imperial Super Star Destroyer Lusankya drop out of hyperspace and capture the Steadfast. Mirith and Sadeet commandeer Kir Kanos's old ship in the Phaeda spaceport and leave for Yinchorr."}, {"tag": "p", "text": "In orbit around Yinchorr, the Emperor's Revenge boards a lone Scimitar-class fighter. The ship is found empty but for a pilot droid and another of Kanos's bombs, which detonates, destroying the Emperor's Revenge. Carnor Jax has already taken 6 stormtroopers and left for the planet's surface, having predicted Kanos's move. Upon arrival on the planet's surface, Jax tells the troops that they are the best in the Empire and that if anyone can beat Kanos, it will be them. Kanos eliminates them quickly and efficiently, leaving him alone with Jax in the Squall. Jax offers him a place at his side, ruling the Empire. Kanos refuses, reminding Jax that he murdered the emperor, and attacks."}, {"tag": "p", "text": "Kanos and Jax fight their final battle in the Squall on Yinchorr. Jax is confident in his victory, reminding Kanos that in the squall, he always wins. Kanos disarms and nearly defeats Jax, but Jax has been fostering his newfound dark force powers and uses them to knock Kanos back and regain his weapon."}, {"tag": "p", "text": "Mirith's and Sadeet's arrival on Yinchorr provide enough of a distraction for Kanos to regain his feet. He renews his attack on Jax, disarming him and knocking him to the ground."}, {"tag": "p", "text": "Mirith realizes that Jax has information that would enable the rebels to swiftly and efficiently destroy the Empire. She cries out for Kanos to stop, but Kanos ignores her and executes Jax anyway. Sadeet is drawn into a murderous rage and charges Kanos. Kanos, left with no choice, kills him in self-defense."}, {"tag": "p", "text": "Angry and grief-stricken, Mirith asks Kanos what he will do now that Jax is dead. Kanos swears to eliminate the rest of the Imperial ruling council, and leaves the planet. Some time later, Massimo arrives on the planet to find Mirith alone. Mirith swears to find and someday kill Kir Kanos for what he has done."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The original idea was conceived for a one-shot by Stradley. This project never materialized and eventually became the Crimson Empire series."}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}