{"url": "Crimson_Empire_(audio)", "categories": ["Category:Real-world articles", "Category:Crimson Empire", "Category:Legends audio dramas"], "nodes": [{"tag": "h1", "text": "Crimson Empire (audio)"}, {"tag": "p", "text": "Crimson Empire was a dramatization in form of two audio CDs (or cassettes) of the popular comic-book Crimson Empire, originally published by Dark Horse Comics. The audio drama was released in 1999, one year after the comic series, with mainly the same plot."}, {"tag": "p", "text": "It is noteworthy because usual voice actors for Star Wars, such as Nick Jameson, did not work in this project."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The explosive Star Wars saga continues! Crimson Empire introduces you to a new generation of space heroes and thrilling adventures!"}, {"tag": "p", "text": "As the story opens, the Empire is in turmoil; Luke Skywalker has destroyed the last of Emperor Palpatine's clones, and the Dark Lord Carnor Jax plans to seize the throne. But he has a formidable opponent to contend with: the brave Kir Kanos. The only survivor of the elite Crimson Guard, he alone stands between Jax and universal domination."}, {"tag": "p", "text": "On the run and fighting for his life in a world of disloyalty and deceit, Kanos takes refuge on the planet Phaeda, joining forces with the fierce, beautiful New Republic leader Mirith Sinn and her underground warriors. Soon, the Empire holds Mirith's band under siege, and none other than Kanos comes to their rescue. Why is he fighting with them? Is he on their side?"}, {"tag": "p", "text": "Finally, the stage is set for the clash between the last of the Royal Guard: Kir Kanos vs. Carnor Jax. Only one can walk away. Who dies? What happens to the New Republic?"}, {"tag": "p", "text": "Listen and find out as the suspense and action of this galactic story reaches its compelling conclusion to the first part of the Crimson Empire series."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Crimson Empire (audio)."}]}