{"url": "Crimson_Empire_(Galactic_Empire)", "categories": ["Category:Legends articles", "Category:Galactic Empire", "Category:Crimson Empire", "Category:Governments"], "nodes": [{"tag": "h1", "text": "Crimson Empire  (Galactic Empire)"}, {"tag": "p", "text": "The Crimson Empire referred to the true vestige of the Galactic Empire, established by Palpatine in 19 BBY, as opposed to the thirteen Imperial warlords in the Deep Core. The surviving Imperial nobility had relocated to Ord Cantrell after the fall of Empire where they ruled a narrow but long strip from the Colonies to the Outer Rim. It lasted less than a year, in 11 ABY. Its name derived from the color of the Emperor's Royal Guard uniform worn by its founder, Imperial Sovereign Protector and aspiring Dark Lord of the Sith, Carnor Jax."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Crimson Empire had its origins in the Dark Empire established by the reborn Palpatine in 10-11 ABY. The Imperial Sovereign Protector Carnor Jax supervised the poisoning of Palpatine's clone bodies, ensuring the Emperor's final demise. After Palpatine's final death at Onderon, Jax seized control of the Empire, declaring himself Emperor and ruling with the assistance of a twelve-person Imperial Interim Ruling Council. The Council contained a number of aliens on it, the first time in the Empire that aliens had been given such major political positions."}, {"tag": "p", "text": "Although many of the Empire's military commanders established themselves as independent warlords in the Deep Core and ignored Jax and the Council, Jax's Crimson Empire represented the last vestige of the centralized Imperial state established by Palpatine."}, {"tag": "p", "text": "Jax himself was killed shortly after by his rival Guardsman, Kir Kanos. Burr Nolyds became head of the Empire, but was assassinated as part of a plot supervised by Nom Anor. Under Anor's guidance, Xandel Carivus eventually purged his enemies in the Council, disbanding it and proclaiming himself Emperor. His rule was short lived, as Kanos killed Carivus while the New Republic captured the capital of Ord Cantrell, taking the remaining councilors into custody."}, {"tag": "p", "text": "The capture of Ord Cantrell would be the end of the original Imperial state. The remaining Imperial warlords recognized no central authority and the remnants of the former Crimson Empire would have little power. This splintered state would last for a year, until Natasi Daala's drive for Imperial Reunification would result in the establishment of the Imperial Remnant in 12 ABY."}, {"tag": "h2", "text": "Government and politics"}, {"tag": "p", "text": "The Crimson Empire, like the Galactic Empire prior to 4 ABY and the Dark Empire before it, had the Galactic Emperor as the head of state. However, it also utilized a twelve-person executive body known as the Imperial Interim Ruling Council, also nicknamed the \"Council of Blood\". In contrast to the Galactic Empire, it allowed aliens to serve on the Council. The Diet of Imperial Planetary Governors was a body established by the Interim Ruling Council to create a facade of representative democracy in the Empire, though in reality it served as a rubber-stamp legitimiser for the Council's edicts."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "As the Imperial commanders had become independent warlords in the Deep Core, the Crimson Empire's forces were at a minimum. However, it nonetheless had access to All Terrain Scout Transports, HAVw A5 Juggernauts, TIE Crawlers, Chariot LAVs, TIE/sa bombers, TIE/IN interceptors, Imperial-class Star Destroyers and Carrack-class light cruisers. The 133rd Imperial Fighter Group was also among the Crimson Empire. The supreme commanders during its time were General Redd Wessel, General Immodet, and lastly, an unidentified officer."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "The Crimson Empire existed in a long strip running from the Colonies to the Outer Rim, and bordering on the Pentastar Alignment. Notable worlds under its control included Qiilura, the Kol Huro system, Celanon, Ord Cantrell, Phaeda, Yinchorr, and the D'Astan sector. Additionally, the support of its alien councilors (specifically the Whiphid Ch'Unkk, Defel Za, Devaronian Manos, and Givin Kooloota-Fyf) gave the Crimson Empire isolated pockets of control outside that region."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The empire that Carnor Jax ran was not actually given a name when the comic series was released. It wasn't until The Essential Atlas where it was given a name, which was also the same name as the series it originated in. A similar action happened with its predecessor, the Dark Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}