{"url": "Crimson_Empire_4", "categories": ["Category:Real-world articles", "Category:Crimson Empire"], "nodes": [{"tag": "h1", "text": "Crimson Empire 4"}, {"tag": "p", "text": "Crimson Empire 4 was the fourth issue in the 6 part Crimson Empire series of comics, and was released on March 18, 1998 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Rebels recover from last issue's Imperial attack and are forced to abandon their secret base -- but not before they deal with Tem Merkon, the traitor in their midst! And if they thought an attack by the Empire was bad, wait till they find out that the evil Carnor Jax and his elite stormtroopers have arrived . . . and he's after the Rebel leader, Mirith Sinn! Will she betray the location of Kir Kanos? And where is he, anyway? Find out in the next chapter of this incredible, star-studded saga!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Mirith Sinn and the New Republic forces on Phaeda are preparing to move to Collo Fauale following the Imperial attack by Colonel Xexus Shev. However, Sinn and Sish Sadeet both come to acknowledge that Kir Kanos could not have been involved in the attack based on how well and how ferociously he fought the stormtroopers. Sinn and Sadeet determine that there must be a traitor within their ranks. Tem Merkon appears and informs them that he will be returning to the city to keep an eye on Shev's forces. Sadeet suspects that Merkon may not be as trustworthy as they have all thought thus far."}, {"tag": "p", "text": "Meanwhile, Carnor Jax has arrived at Phaeda and lands aboard his shuttle from the Emperor's Revenge. Jax was accompanied by his private contingent of shadow stormtroopers. As Jax discusses his plan to capture Kanos with his officers, among those present General Wessel and Blim, none other than Tem Merkon appears to divulge knowledge."}, {"tag": "p", "text": "Upon Merkon's return to the New Republic base, Sinn and Sadeet confront him, now fully-aware of Merkon's betrayal. Merkon offered to share Jax's bounty with Sinn and Sadeet, who refused. Realizing the danger he was now in, Merkon attempted to flee but was intercepted and killed by Lieutenant Massimo. Based on the intelligence given to Jax by Merkon, a squad of stormtroopers stake out Kanos' ship in the spaceport. Surely enough, they capture a cloaked figure and return to Jax."}, {"tag": "p", "text": "Much to the dismay of General Wessel, the cloaked figure was not Kanos, but Mirith Sinn in disguise. Jax, however, used the situation to his advantage and tortures her for information regarding Kanos. Meanwhile, Jax's forces seeking Merkon discover his body – wrapped in explosives. When Jax resumes torturing Sinn, the Star Destroyer Steadfast has arrived in orbit to join Emperor's Revenge. When Sinn continues not to divulge anything regarding Kanos, Jax orders an orbital bombardment of Collo Fauale, the location given by Merkon. Hoping to spare her comrades, Sinn tells Jax that Kanos has gone to the spaceport in Chinesti. Jax, however, sees her lie through the Force and slaps Sinn. Sinn then tells Jax that Kanos has gone to Yinchorr – which was true. Jax orders the Steadfast to continue firing on Phaeda and prepares to depart for Yinchorr. True to word, Jax allows Sinn to escape alive."}, {"tag": "p", "text": "As Sinn returned to the base, Sadeet met her and knocked out a Kubaz spy sent by Jax to follow her. Sadeet also said that the base at Collo Fauale might be saved by a surprise for the Imperials. Soon thereafter, Jax leaves the Phaeda system, leaving orders for Commander Vivant to reduce Collo Fauale to a \"crater.\" Immediately after Jax's departure, a squadron of starfighters emerges from hyperspace: E-wings and B-wings representing the latest iteration of the New Republic's most elite squadron - Rogue Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}