{"url": "Crimson_Empire_3", "categories": ["Category:Real-world articles", "Category:Crimson Empire"], "nodes": [{"tag": "h1", "text": "Crimson Empire 3"}, {"tag": "p", "text": "Crimson Empire 3 was the third issue in the 6 part Crimson Empire series of comics, and was released on February 18, 1998 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Mirith Sinn's band of Rebels is under siege by the Empire as their hideout is discovered! But who should come to their rescue but . . . Kir Kanos, the last member of the Crimson Guard?! Is he on their side -- or is there another reason he is fighting with them? This issue finally reveals just why the Empire is after Kanos -- and why Kanos is after Carnor Jax, the Imperial who covets the Empire's throne! Plus, at last, you'll learn just what happened to the Crimson Guard after the death of the Emperor in Star Wars: Empire's End!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The New Republic forces on Phaeda are under attack by Colonel Xexus Shev! An assault force of AT-ST's, Juggernauts, TIE crawlers, and TIE Interceptors bears down against the limited defenses of the Rebels. Although they put up a vicious fight, their mysterious visitor proves to be an unimaginably deadly warrior - Kir Kanos single-handedly slaughters the Imperial forces. After killing dozens of stormtroopers, Kanos takes down a TIE Interceptor with a single blaster bolt to save the lives of Mirith Sinn and Sish Sadeet. In the face of disaster, Shev orders an emergency retreat, disgraced at failure and terrified by the consequences of disobeying Carnor Jax."}, {"tag": "p", "text": "Following the battle, Kanos shares with Mirith the events that transpired that brought him to Phaeda. Following the death of the cloned Emperor, the surviving Guardsmen gathered on Yinchorr to decide on a course of action. Only a handful of Royal Guards were alive, most having been killed on Byss when it was destroyed by the Galaxy Gun or aboard Eclipse II. A number of survivors were also killed by Luke Skywalker and Rayf Ysanna."}, {"tag": "p", "text": "However, one guardsman survived the encounter with Skywalker and learned about the intrigue surrounding the Interim Ruling Council - including Carnor Jax's scheme to become Emperor and the sabotage of Palpatine's clones by his physician. On the tenth day of their mourning, the survivor reached Yinchorr and informed his comrades of what he had learned. Then and there, the guardsmen swore to avenge their Emperor and kill the traitor Carnor Jax. Moments later, Imperial forces loyal to Jax attacked them."}, {"tag": "p", "text": "Jax had not only seen to the death of Palpatine, but to all those loyal to him as well, including the Royal Guards. Although the guards were nearly unparalleled in combat skill, the sheer number of stormtroopers overwhelmed them and all but two were killed, leaving only Kir Kanos and Kile Hannad. They both knew that only one of them could survive so that the other might live to eventually kill Jax. With the flip of a coin, it was decided that Kanos would be the one to live."}, {"tag": "p", "text": "Kanos eventually found himself wandering the galaxy, contemplating and planning on how to kill Jax. Kanos decided he needed to lay low once he realized that Jax was hunting him just as eagerly, first on Zaddja and then on Phaeda. Following the discussion between Mirith and Kanos, the New Republic forces are moved into the mountain base at Collo Fauale, fearing a second Imperial attack. Sadeet begins to suspect that Tem Merkon may be the traitor he has suspected to be among them."}, {"tag": "p", "text": "In the Imperial base, Colonel Shev is in a panic because he understands the consequences for having deliberately disobeyed Jax. However, an intelligence report concerning a recently-landed freighter revives his hope that he will be able to capture Kanos. Meanwhile, Jax is en route to Phaeda aboard the Emperor's Revenge, and swears that if Shev has compromised the capture of Kanos, he will crush Shev..."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}