{"url": "Crimson_Empire_2", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Crimson Empire"], "nodes": [{"tag": "h1", "text": "Crimson Empire 2"}, {"tag": "p", "text": "Crimson Empire 2 was the second issue in the six-part Crimson Empire series of comics, and was released on January 28, 1998 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The last member of the Crimson Guard, Kir Kanos, has found some possible allies with a band of Rebels . . . but can they trust a former servant of the evil Emperor? This issue also details an amazing untold encounter with Darth Vader and Emperor Palpatine! Plus, not one, but two groups of Imperials are after Kanos -- with their own agendas!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Back on Phaeda, the local who assisted the visitor reveals his name to be Tem Markon and is a member of the local New Republic fighters. Markon tells the visitor that the only combatants he had seen of such skill were either Jedi or Palpatine's Royal Guards. As Markon leaves the visitor in a safehouse, the visitor ponders his situation: for he is Kir Kanos."}, {"tag": "p", "text": "Alone in the safehouse, Kanos recalls a particularly intense memory of his training on Yinchorr, when he and the other trainees were visited by Palpatine himself and Darth Vader. The two arrived while the trainees fought in The Squall, a combat arena precariously above a pit into which anyone who fell would die. Trainees fought to the death."}, {"tag": "p", "text": "Palpatine and Vader arrived to meet and inspect the latest batch of trainees. Vader demands to meet the best among them, and Burr Danid is called forward. In The Squall, Vader and Danid duel with - Vader without a lightsaber, though - and Danid holds his own for a time. Ultimately, Vader severs Danid's right hand and kicks him into the pit to his death. Vader comments to the others, \"If he was your best, you are not yet fit to serve the Emperor.\" The lesson was well-learned."}, {"tag": "p", "text": "On Phaeda, General Wessel responds to a report of one man killing dozens of stormtroopers and Imperial officers. Wessel suspects this incident could lead to Kanos. Meanwhile, Kanos meets Markon again as well as Mirith Sinn, commander of the New Republic's presence on Phaeda, and her second-in-command, Sish Sadeet. Realizing that Kanos is no friend of Jax and his forces, Mirith takes him to their hideout."}, {"tag": "p", "text": "Meanwhile, Colonel Xexus Shev is contacted by Carnor Jax, who informs Shev that he en route to Phaeda to investigate the slaughter of Imperials, believing it to be the handiwork of Kir Kanos. Jax orders Shev not to take any action against the Rebels, but Shev receives intelligence from his informant, Tem Markon, concerning the whereabouts of the mysterious visitor, Kir Kanos. Shev then deliberately orders an attack on the New Republic base in direct defiance of Jax's orders."}, {"tag": "p", "text": "When Mirith returns to the base with Kanos, there is resistance from her lieutenants, such as Massimo, who argue that he may be an Imperial spy. Mirith speaks with Kanos, and recognizes a scar across as his face as being a distinctive lightsaber scar. As Kanos listens to Mirith spar with Massimo concerning the safety of allowing Kanos to enter the compound, he recalls another memory."}, {"tag": "p", "text": "Kanos's final test before becoming a full-fledge Royal Guard was to battle to the death with his friend and classmate, Lemmet Tauk, before the Emperor. Kanos won, impaling Tauk on the end of his blade. Kanos mourned the loss of his friend, but was told off by Darth Vader, who sliced Kanos's helmet with his lightsaber - giving him the scar - and reminding Kanos that he ought never to underestimate the power of the dark side."}, {"tag": "p", "text": "However, Kanos is shaken out of his reverie and the New Republic forces panic as Colonel Shev begins his attack on their hidden base..."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}