{"url": "Crimson_Empire_1", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Crimson Empire"], "nodes": [{"tag": "h1", "text": "Crimson Empire 1"}, {"tag": "p", "text": "Crimson Empire 1 was the first issue in the six-part Crimson Empire series of comics, and was released on December 7, 1997 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Kir Kanos is the last surviving member of the elite Crimson Guard. He's on the run -- and the Empire will stop at nothing to destroy him. Featuring flashback appearances detailing the unknown pasts of Emperor Palpatine and Darth Vader."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "It is a time of turmoil. The last of Emperor Palpatine's clones has been destroyed by the Rebel Luke Skywalker and his allies, and control of the Empire is up for grabs. A temporary ruling Council has formed behind the scenes to maintain order, but the Council itself is splintered - divided by the conflicting ambitions of its members. Intrigue, deception, and betrayal are commonplace as those who would replace the Emperor pursue their goals."}, {"tag": "p", "text": "One man, Carnor Jax, holds sway over the Council. He knows the secrets about the members of the ruling body that could destroy their control and further weaken the Empire. He uses this knowledge to force the creation of a special position for himself within the Council."}, {"tag": "p", "text": "Jax's plan is actually much more ambitious than the Council members know: he seeks to position himself as a new Dark Lord—with the aid of the equally ambitious General Wessel—and eventually acend to Palpatine's throne."}, {"tag": "p", "text": "One other knows the Council's secrets - and Jax's ambitions. Hiding on the galaxy's outer edges, he bides his time, awaiting his chance to destroy them all..."}, {"tag": "p", "text": "On the planet Zaddja, far from the Empire, an Imperial task force of stormtroopers aboard the Destiny land to attack a lone settlement. The settlement, however, is empty - save for a huge number of explosives that kills the landing party instantly."}, {"tag": "p", "text": "On the planet Phaeda, closer to the Empire but still relatively unimportant, a cloaked figure lands an common-looking freighter and bribes his way past spaceport security with no trouble at all. The visitor finds his way to a local cantina, where numerous Imperial officers have gathered to discuss current events within the Empire. Colonel Shev, a supporter of Carnor Jax, irritates another officer and attracts the attention of the cloaked visitor. An officer notices the visitor and demands to know why he was being eavesdropped upon."}, {"tag": "p", "text": "The visitor asks the officer to step away, but the officer draws a gun and the visitor swiftly kills him with a double-bladed sword. Violence erupts as stormtroopers converge on the scene - but the visitor slaughters them all with no trouble. Surrounded by dead Imperials, a local exhorts the visitor to go with him to safety before more Imperials arrive. Reluctantly, the visitor goes with him."}, {"tag": "p", "text": "Meanwhile, aboard the Star Destroyer Emperor's Revenge, Carnor Jax discusses with General Wessel how imperative it is to find Kir Kanos. The conversation reveals that Jax bribed Palpatine's physician to sabotage his remaining clones after the destruction of Byss. Jax also learned of Kanos's survival after an encounter between the remaining Royal Guards and Luke Skywalker and an inexperienced Ysanna Jedi who failed to kill the guardsman who knew of Jax's treachery. Jax, who perceives himself to be the next Darth Vader—and, ultimately, Emperor—focuses all effort on killing Kir Kanos..."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}