{"url": "Crimson_Empire_III:_Empire_Lost_4", "categories": ["Category:Real-world articles", "Category:Crimson Empire"], "nodes": [{"tag": "h1", "text": "Crimson Empire III: Empire Lost 4"}, {"tag": "p", "text": "Crimson Empire III: Empire Lost 4 is the fourth issue of the Star Wars: Crimson Empire III—Empire Lost series of comics, and was released on February 8, 2012 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Escaping from the Imperial hardliners who are intent on killing Leia Organa Solo and bringing the New Republic to its knees, Kir Kanos tries to warn his one-time enemies, only to be thrown into a New Republic prison."}, {"tag": "p", "text": "Mirith Sinn is the only one willing to trust Kanos, but neither of them is aware of the extent of the Imperials' plans. It's not until Luke Skywalker plays a hunch that the true danger is revealed!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Kir Kanos made a theatrical arrival on the New Republic capital Coruscant, landing in a hangar of the Imperial Palace escorted by a squadron of A-wings and still wearing his Royal Guard armor. He requested to speak to Mirith Sinn, now Chief of Security of the Palace but he was immdiatly arrested by the guards and imprisoned. He later met Sinn who accepted to introduce him to Chief of State Leia Organa Solo and her brother, Jedi Master Luke Skywalker. The former Royal Guard revealved them Devian's plot against the New Republic and, despite their doubts, accepted to trust him, especially because Skywalker didn't sense treason in him."}, {"tag": "p", "text": "But Kanos ignored that his escape was part of Devian's plan. The shuttle stolen in the Restored Empire base was in fact containing the zinethium ready to detonate. The New Republic technicians who inspected the ship reported some radiations but didn't realize the threat. Thanks to Kanos's information, Luke Skywalker quickly understood the gravity of the situation. He entered the shuttle and took off to drive the ship away as far as possible of the planet. The Jedi managed to evacuate in an escape pod just before the zinethium exploded."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The blue armored guards of the cover are not present in the story, Kir Kanos is arrested by simple New Republic troopers."}, {"tag": "p", "text": "The shuttle used by Kir Kanos looks like a Delta-class JV-7 escort shuttle in Crimson Empire III: Empire Lost 3 but is clearly identifiable as a Nu-class attack shuttle in Empire Lost 4."}, {"tag": "h2", "text": "Notes and references"}]}