{"url": "Crimson_Jack%27s_pirate_gang", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pirate organizations"], "nodes": [{"tag": "h1", "text": "Crimson Jack's pirate gang"}, {"tag": "p", "text": "During the era of the Galactic Civil War, the Pirate Master Crimson Jack led a gang that became notorious on the starlanes of the Outer Rim. Originally a group of bandits that robbed spice caravans on the galactic frontier, the gang came into possession of a damaged Imperial Star Destroyer after the Battle of Toprawa, which allowed the outfit to take its operation to new heights."}, {"tag": "p", "text": "In 0 ABY, the gang captured and imprisoned notorious smuggler and Rebel hero Han Solo, who promised to lead the gang to a lucrative Rebel treasury on Drexel. However, Solo and his friends slipped away from the battlecruiser once they reached the Drexel system, leading to a heated battle. During a dogfight between Jack's starfighters and Solo's Millennium Falcon, Jack abandoned his right-hand woman, Jolli, after her Y-wing was grievously damaged. Infuriated by his betrayal, Jolli flew her disintegrating craft on a suicide run into the cruiser's munitions deck, causing an explosion that annihilated Jack's operation. In the chaos, Solo shot and killed Jack, bringing an end to him and his gang."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "During the era of the Galactic Civil War, the charismatic, red-bearded Pirate Master known as Crimson Jack led a pirate gang that preyed upon and robbed starships in the Outer Rim Territories. Specifically, Jack's gang claimed an area in the Outer Rim that included the planet Aduba-3 as their \"sector.\" By 0 ABY, Jack's gang operated out of a massive former Imperial Star Destroyer he had chanced upon after a Galactic Civil War battle. The acquisition of the battlecruiser necessitated a fundamental change in Jack's operation: he had to seek out funding from outside investors to afford the repairs to the damaged warship, promising a cut of future profits in exchange. While the gang had started by ambushing spice caravans on the galactic frontier, it now had bona fide shareholders."}, {"tag": "p", "text": "Jack found the battlecruiser drifting in space, and often used a similar tactic when targeting upon passing ships: Jack would lure curious pilots in by making the cruiser appear to be a drifting, lifeless hulk, before launching his starfighters and catching his prey unawares. However, Jack preferred not to chance full-out battle, instead using his fighters to usher the ship into his cruiser's tractor beam and capture them whole before boarding and robbing them. He also preferred to keep his targets alive, if possible, feeling that killing was an unnecessary waste of a potential revenue stream—however, he was not above ordering his men to kill captives brutally if he felt it served a purpose."}, {"tag": "p", "text": "By 0 ABY, Jack's gang consisted of dozens of men, who although entirely Human, came from a widespread number of diverse backgrounds and who outfitted themselves with a variety of eclectic arms and armor. Crew members outfitted themselves with blasters, archaic cutlasses and other weapons, while at least one was known to wear full Imperial stormtrooper armor when boarding ships. The gang's starfighter arsenal was similarly varied, consisting of X-wings, Y-wings, TIE fighters and several other different kinds of craft."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Meeting Han Solo"}, {"tag": "p", "text": "Crimson Jack's gang got its start ambushing spice caravans on the Outer Rim, crossing paths with outlaws and lowlifes such as the Corellian smuggler Han Solo. Originally operating out of a single DP20 frigate, the gang stumbled upon a major upgrade during the Galactic Civil War. After a landmark Rebel victory over the Imperials in the Battle of Toprawa, the gang came across a drifting Imperial Star Destroyer that had been heavily damaged in the fighting. After dispatching a trio of TIE fighters, the gang boarded the cruiser, initially intending to merely scavenge what they could and move on. However, Jack noticed that most of the damage to the ship appeared to be superficial, and after eliminating the ship's few surviving defenders, decided to take the Star Destroyer as his new flagship. The cost of repairing the cruiser was massive, but Jack managed to find several wealthy backers—among them, notorious Hutt crime lord Jabba Desilijic Tiure—willing to bankroll the repairs in exchange for a share of future profits."}, {"tag": "p", "text": "In 0 ABY, that included ambushing Solo, who by then had become a Rebel hero for his actions in the Battle of Yavin. Disguising his battlecruiser as an abandoned ship, Jack lured Solo's Millennium Falcon in before launching his starfighters and chasing Solo into his tractor beam. Jack, Jolli—a relatively recent addition who had quickly become one of his most trusted guns—and a large boarding party thoroughly ransacked the ship, coming away with a large amount of treasure confiscated from Solo's smuggling compartments. Jack then let Solo go on his way, but not before leaving a homing beacon behind on the ship. Soon afterward, Jack's gang found an even more interesting prize traveling alone on the starlanes: Princess Leia Organa of Alderaan, a major Rebel leader."}, {"tag": "p", "text": "Although Jack believed that he could secure a hefty ransom from the Rebels for Organa, he was unable to get the stubborn Princess to give up the location of their base. However, the reappearance of Han Solo gave Crimson Jack an idea. With his tracer still aboard the Millennium Falcon, Jack had always intended to swoop down on Solo again if he found him in his territory, and it was not long before he captured the Falcon again near the planet Aduba-3. This time, Solo allowed himself to be tractor beamed without a fight. Jack planned to use Solo and his Wookiee companion Chewbacca to get Organa to budge: specifically, he meant to kill them slowly and brutally in front of the Princess, to show her give her an example of what would be in store for her if she didn't cooperate."}, {"tag": "p", "text": "However, the execution didn't go as planned. Jack's gang didn't account for the freakish fortitude of the Wookiee Chewbacca, who simply waded through the lower-power blaster bolts and incapacitated and disarmed several of Jack's men. A stalemate forced, Solo offered to parley with Jack, promising that he could help them acquire a much greater treasure than the one they had previously taken from his Millennium Falcon. Intrigued, Jack accepted Solo's offer, meeting him for a feast in his quarters. There, Solo revealed that he and the Princess were previously acquainted: in fact, the treasure Jack had stolen from the Falcon was actually a reward from the Rebels for rescuing Organa from Imperial captivity. As such, Solo had gained knowledge of the supposed Rebel treasury in the Drexel system, which he offered to lead Jack and the gang to in exchange for a cut of the proceeds. Although Solo had previously given Jack little reason to trust him, the promise of Rebel riches was too much for the pirate to ignore, and he ordered his ship full speed ahead to the Drexel system."}, {"tag": "h3", "text": "Chaos in the Drexel system"}, {"tag": "p", "text": "As Drexel was far afield from Jack's gang's usual hunting grounds, their navicomputer did not have much data on their destination. However, Solo had much more detailed charts on the Millennium Falcon, and Jack allowed Chewbacca to tap into his battlecruiser's computer system to transfer their data. The connection finished as the battlecruiser arrived out of hyperspace at Drexel. There Jack found, to his fury, that Drexel was a waterworld, meaning to him that the Rebel treasury could not possibly be on the planet. A heated confrontation on the ship's bridge was interrupted, however, with a sudden gravity disturbance that started to bring the cruiser lurching down towards Drexel's surface: the result of planetside ship-wreckers that used a sonic jammer to ensnare visiting vessels. In the frenzy and the confusion, Solo, Organa and Chewbacca managed to make it to the Millennium Falcon and flee to the planet's surface, taking out several crewmembers and ravaging the gang's starfighter arsenal on the way."}, {"tag": "p", "text": "Although Jack was furious at Solo's escape, all his gang's energy had to be devoted to keeping the cruiser from being dragged to the planet below. With the ship's emergency drive maintaining a tenuous stalemate against the sonic jammer, Meanwhile, Jack set Jolli to oversee repairs on the sabotaged starfighters. The problem of the sonic jammer soon resolved itself, as Solo and his friends managed to disable the device—although Jack's chief engineer attempted to convince him to leave Drexel behind with the jammer deactivated, Jack was dead set on confronting Solo. In the meantime, Jolli had managed to restore three of the gang's starfighters, and Jack assigned her to lead the three-person Raider Squadron to chase the Millennium Falcon off Drexel's surface. Although Jolli managed to draw the Falcon into a dogfight, Raider Squadron was unable to ferry the ship into the cruiser's tractor beam. Instead, Solo evaded pursuit with a sudden sharp turn, opening the opportunity for him to destroy two of his pursuers and severely damage Jolli's Y-wing."}, {"tag": "p", "text": "Still outgunned, Solo had one last trick up his sleeve: he still had a link maintained with Jack's battlecruiser's computer systems, allowing him to wipe every star chart in the ship's navicomputer and essentially trap the gang in the Drexel system. His hand forced, Jack agreed to parley with Solo, ostensibly to work out an exchange of Solo's Rebel treasure for the return of his star charts. As Jack prepared to meet with Solo, he received a plaintive message from Jolli, whose damaged Y-wing was beginning to break apart. Jack immediately denied Jolli's request for a magnetic pulse beam to bring her back to the ship, fearing that it would interfere with his signal system—he then swiftly forgot about his right-hand woman as she faced death in the void. Jack then donned a breath mask and met Solo out in space, protected by the cruiser's magnetic field. Both were armed however, and neither truly intended to parley."}, {"tag": "p", "text": "Jack had brought plenty of backup, and it appeared that Solo was heavily outgunned, until a badly damaged Y-wing screamed into view. Furious at Jack's abandonment of her, Jolli drove her dying starfighter in a death run towards the cruiser, using the craft's guns to take out Jack's backup. She then pushed her Y-wing into the cruiser's munitions deck, causing a massive explosion that utterly destroyed the ship. Solo shot and killed Crimson Jack in the chaos, conclusively bringing an end to him and his gang. Some time afterward, beings in the employ of Jabba Desilijic Tiure happened across the wreckage of Jack's cruiser, finding that the ship's log remained intact. The log conclusively showed that Han Solo was at fault for the ruin of Jack's gang—as bankrolling the repairs to Jack's cruiser represented a major investment for the Hutt, Jabba was furious, and placed a sizeable bounty on Solo's head."}, {"tag": "h2", "text": "Members"}, {"tag": "h3", "text": "Crimson Jack"}, {"tag": "p", "text": "The charismatic leader of the gang, Crimson Jack was known for his distinctive red beard and his ruthless ambition. Wanting to use the gang's exploits to become more than just a pirate, Jack transformed the outfit from a common group of raiders on the Outer Rim to something akin to a full-fledged corporation, brokering deals with private investors to help bankroll the gang's activities in exchange for portions of the group's profits. Jack combined a cunning mind with a disregard for the welfare of his underlings, including his close companion Jolli. Jack had long held a grudge against Han Solo, believing the Corellian to be as clever as himself. However, against his better judgment, Jack decided to trust Solo in trying to rob the supposed Rebel treasury on Drexel, which proved to be a fatal mistake. Although Jack managed to get the drop on Solo in their showdown, his lack of care for his subordinates led Jolli—whom he had abandoned to die in the void—to make a suicide run on Jack's cruiser, leading to his death and the destruction of his gang."}, {"tag": "h3", "text": "Jolli"}, {"tag": "p", "text": "The daughter of a fugitive from the Empire, Jolli was orphaned and abandoned as a young girl and left to fend for herself on the galactic frontier. Jolli became skilled with a blaster and a capable starfighter pilot, before joining Jack's gang not long before their fateful trip to the Drexel system. Impressed by her skills and her roiling temper, Jack quickly made Jolli one of his most trusted guns. However, after encountering Han Solo, Jolli developed an unwelcome attraction to the Corellian, which caused her to display violent and erratic behavior as she failed to reconcile her feelings for Solo with a deep hatred of men that stemmed from her father's abandonment. Driven by her compulsion to prove herself as better than any man, Jolli led the gang's starfighter group against the Millennium Falcon, but suffered catastrophic damage to her Y-wing. Infuriated by Jack leaving her to die, Jolli reacted in one final explosion of anger, making a suicide run on the cruiser that led to the gang's utter destruction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crimson Jack's pirate gang first appeared in Star Wars 7, written by Roy Thomas and released in 1977. The gang reappeared in Star Wars 11: Star Search, and featured heavily in the next several issues until the group was destroyed in Star Wars 15. During its appearances in the Marvel Star Wars series, the gang was illustrated by Howard Chaykin and Carmine Infantino."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}