{"url": "Crisis_on_Naboo", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Crisis on Naboo"}, {"tag": "p", "text": "\"Crisis on Naboo\" is the eighteenth episode of the Star Wars: The Clone Wars television series' fourth season. This is the conclusion to a four-part storyline about Obi-Wan Kenobi's undercover story to unveil the assassination plot against Chancellor Palpatine, which began with the last three episodes: \"Deception,\" \"Friends and Enemies,\" and \"The Box.\" It aired on February 10, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"The Chancellor travels to Naboo to preside over a public ceremony, guarded by Jedi Knights. Dooku and his bounty hunters—including an undercover Obi-Wan Kenobi—launch their kidnapping plot.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the Jedi Temple, the members of the Jedi High Council, along with Anakin and Ahsoka, discuss the security measures for Chancellor Palpatine's visit to Naboo for its traditional Festival of Light. Mace Windu and Yoda have since disclosed to the others that Obi-Wan is still alive and in disguise, infiltrating Count Dooku's plot to strike against and kidnap the Chancellor. Anakin proves confident and determined to see the mission done – but perhaps a little too much, earning him concerned glances from Windu, Yoda and Ahsoka."}, {"tag": "p", "text": "In the meantime, Count Dooku, Moralo Eval, Cad Bane, and his team, consisting of Obi-Wan, Embo, Derrown, and Twazzi, claim possession of a small hangar in Theed by murdering the mechanics inside. The group congregates, and Bane proceeds to assign his fellow members' individual roles in the plot: Derrown is to take down the deflector shield erected for the Chancellor's protection; Eval is to provide the getaway transport; Embo and Twazzi, disguised as Senate Guards, are assigned to escort the Chancellor; and a disguised Obi-Wan is to provide cover fire and incapacitate the Chancellor with a sniper blaster. A special mapping device is issued to each of them, to lead them to the rendezvous point once the mission has been complete, and a special holographic disguise matrix is used to make them appear as Senate Guards. But as they leave for their posts, Dooku takes Bane aside for a moment and advises him to keep a special lookout for Hardeen, of whom the Count has grown suspicious. Finally, Palpatine and his escort, which includes Windu, Anakin and Ahsoka, arrive in Theed, where the Chancellor is welcomed by Queen Neeyutnee and a group of esteemed Galactic senators, among them Naboo's own representative Padmé Amidala and Sio Bibble, governor of Naboo. While security is in place, Palpatine shows little concern for the Count's imminent strike, and in worry of Padmé's safety, Anakin assigns Ahsoka to accompany his wife and the Queen while he takes his place in the mission's front line. While assuming his position, Obi-Wan is finally able to contact Windu and inform him of the important elements of the Count's plan."}, {"tag": "p", "text": "On that evening, the Naboo and their Senate guests gather at the Royal Palace to perform the initiation of the festival, with Bane infiltrating the crowd holographically disguised as a Neimoidian. However, when Dooku's operation commences and Derrown prepares to disable the deflector shield generator, Obi-Wan gives a warning to Windu, but he and Anakin are unable to prevent the shield's deactivation or Derrown's escape. Obi-Wan attempts to prevent the latter, disabling Derrown's jetpack, but his blaster is only charged for one shot. The Chancellor is knocked out by the shield generator's explosion, and amidst the resulting confusion Embo and Twazzi make Palpatine look like a fallen Senate Guard with a holographic matrix while Twazzi takes on the Chancellor's appearance. Anakin and Windu intercept the two and fall for the ruse, whilst Bane and Eval make their escape with the unconscious Chancellor. As the only one closest to the kidnappers, Obi-Wan commandeers a speeder and follows Bane and Eval to the rendezvous point, where their escape ship is waiting (though Dooku apparently is not). When Obi-Wan arrives, he claims custody of the Chancellor at gunpoint, triggering a vicious fight against Bane. Obi-Wan eventually overpowers the two criminals and hands them over to the authorities (who just arrived, along with Anakin and Windu), and when his true name is revealed by Windu, Bane swears bitter revenge against the Jedi."}, {"tag": "p", "text": "The next morning, Palpatine and the Jedi prepare to return to Coruscant, but even though the kidnapping was successfully thwarted, Anakin is still furious at Obi-Wan and the Jedi Council about having withheld the truth from him, even if this was meant to convince Dooku of \"Hardeen's\" sincerity. An angry comment of his, however, triggers a suspicion in Obi-Wan, and before shedding his disguise, he returns to his position from the previous night and finds an activated com device in his sniper blaster's case, meaning that Dooku had not shown because he had listened in on Obi-Wan's com calls to Windu. In fact, the Count awaits Palpatine and Anakin in an ambush, which was subtly arranged by Palpatine in order to draw out Anakin's frustrations and anger to their fullest and thus make him pass to the dark side of the Force for good.[source?] Anakin dispatches the two MagnaGuards that accompanied Dooku quickly, but when Palpatine tries to run away at Anakin's orders, a third MagnaGuard intercepts him and holds him in place. Both watch as Anakin and Dooku duel across the halls - Darth Sidious observing with pleasure as Anakin gives in to his anger - and although Anakin holds Dooku down for a few seconds, Dooku manages to overpower him with Force lightning. Obi-Wan, however, catches up to Anakin and together they manage to thwart Dooku's plan once again, destroying the lone MagnaGuard and rescuing Palpatine, forcing Dooku to throw Anakin off his ship, ending the duel leaving empty-handed and escaping in his shuttle. While Palpatine thanks the Jedi for their timely rescue, he makes an expression of mock concern about what the galaxy would become if the Jedi were no more."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The clone trooper who is taking Cad Bane into custody is a shock trooper, but after the scene cuts, he turns into a normal clone trooper."}, {"tag": "p", "text": "When Anakin and Obi-Wan are walking away from the loading ramp to the Republic ship, they appear to be moving faster than they actually are."}, {"tag": "p", "text": "One of the fireworks that Palpatine launches resembles the Star Wars opening crawl."}, {"tag": "p", "text": "As Anakin attacks Dooku whilst he is shielding himself with a chair, Anakin's lightsaber can be seen attached to his belt whilst also being used to stab through the chair."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}