{"url": "Crisis_on_Coruscant", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:LEGO Star Wars: Droid Tales"], "nodes": [{"tag": "h1", "text": "Crisis on Coruscant"}, {"tag": "p", "text": "\"Crisis on Coruscant\" is the second episode of LEGO Star Wars: Droid Tales. It follows C-3PO and Admiral Ackbar to Coruscant on their quest to find R2-D2, who has been kidnapped by a mysterious stranger. In the episode, C-3PO tells the story of the events leading up to Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Republic battle plans"}, {"tag": "p", "text": "Following the kidnapping of R2-D2 on Endor, C-3PO and Admiral Ackbar travel to Coruscant on a starship. Using his tracking computer, C-3PO reports that the stolen ship was abandoned somewhere in the vicinity. Admiral Ackbar smells out their own starship under a pile of paper. C-3PO then has memories about the battles, betrayals, and other events that took place on Coruscant at the end of the Clone Wars. Shortly later, C-3PO and Ackbar are approached by an Multi-Troop Transport carrying several B1-series battle droids, who have been reprogrammed as garbage collectors. C-3PO asks whether the droids have seen R2-D2 but they deny."}, {"tag": "p", "text": "While sitting nearby on a fallen statue of the Emperor, the two travelers reminisce the old days. While Ackbar talks about how he first bought the Delta-7B Aethersprite-class light interceptor Daisy Mae from a dealer, Threepio convinces him to let him continue the story about his and R2-D2's involvement in the Clone Wars. C-3PO begins with the story of how R2-D2 thwarted General Grievous and Count Dooku's plans to obtain the Galactic Republic's battle plans on Coruscant. Darth Sidious passes the secret plans to Grievous, who is shortly later ambushed by Obi-Wan Kenobi, and several Clone troopers. Grievous' ship is destroyed but he manages to commandeer Senator Bail Organa's ship. C-3PO, who was preparing food in the ship's galley, finds himself an unwilling passenger."}, {"tag": "p", "text": "Later at the Jedi Temple, Jedi Master Yoda tells Anakin Skywalker that he has potential to be a great Jedi but chides him to be patient. At that point, Skywalker sees Grievous' stolen vessel outside the window and leaps out the Jedi Council Chamber's windows with R2. Grievous tries to shake off Anakin in the skylanes of Coruscant. Kenobi and the Clones give chase in several airspeeders. While 3PO flies the ship, Grievous engages Skywalker in a lightsaber duel. The ship narrowly avoids a skyscraper, causing Anakin to fall off the ship."}, {"tag": "p", "text": "Anakin lands on Kenobi's airspeeder while Grievous takes the opportunity to flee to Geonosis with the stolen plans and C-3PO. Grievous submits the plans to Count Dooku and the Separatist Council including Poggle the Lesser. R2-D2 then sneaks into the Separatist Council chambers and overpowers a R2-Q5. He then passes himself off as R2-Q5 and discreetly makes contact with Threepio. Meanwhile, Dooku and Grievous gloat that the battle plans will lead them to victory over the Republic."}, {"tag": "p", "text": "Back at the Jedi Council, Master Mace Windu reprimands Skywalker for his recklessness in jumping out of windows while Yoda advises him to think first. R2-D2 then manages to broadcast a recording of Dooku and Grievous with the secret battle plans. With the Republic's safety at stake, the Jedi Council and Anakin travel to Geonosis, (and in a comedic fashion, everyone in the room jump out through the window, including Yoda). At the Separatist Council chambers, Dooku screens a recording of the stolen battle plans. However, R2 has substituted the real disc for another one showing a video of Ewoks dancing and singing to the Yub Nub song. The Jedi then enter the Separatist Council chambers and fight Dooku and Grievous."}, {"tag": "p", "text": "3PO, who is serving cocktail weenies, is caught up in the fighting and knocked to the ground. R2 tries to flee with the plans but is corned by Grievous and several B2-series super battle droids. However, the astromech droid activates his booster rockets and flees into the droid foundries. In the process, R2 gets stuck in the gears, causing the factory to overheat and triggering a chain reaction that destroys the Separatist factories and headquarters. R2-D2 and C-3PO escape and bring the plans back into the hands of the Republic. Republic LAAT gunships and ARC-170 starfighters also arrive on Geonosis. 3PO praises R2 for his actions before hitting him on the dome, telling him to \"Never do that again!\""}, {"tag": "h3", "text": "Fall of the Republic"}, {"tag": "p", "text": "Going back to the present, 3PO recalls that he was cross with R2 for putting them into danger and wishes to swot him on the head. However, he still misses his friend despite his annoying traits. They then find Ackbar's stolen ship Daisy Mae under a pile of paper. 3PO deduces that the mysterious kidnapper has ditched the stolen ship before boarding a shuttle in Coruscant's spaceport. While Ackbar tends to his stolen ship, 3PO asks a gatekeeper droid if he has seen R2. Though the droid is unwilling to help, a sympathetic Ithorian male expresses interest in hearing more about R2's exploits during the Clone Wars."}, {"tag": "p", "text": "C-3PO goes back to Count Dooku and General Grievous' plot to kidnap Supreme Chancellor Palpatine during the last days of the Clone Wars. 3PO witnesses Grievous' fake kidnapping of the Chancellor in his office and their escape in a Scimitar ship. Meanwhile, Anakin is walking with his secret wife Senator Padmé Amidala, who is pregnant, and R2 who congratulates them with a fanfare. Skywalker confides his unhappiness with Kenobi and the Jedi for not seeing his \"awesomeness\" before going on to discuss the name of Padmé's unborn child. Padmé settles on Leia for a girl and Kitster, Embo, Wicket, Jubnuk and IG-88 before settling on Luke. At that point, the three witness a kidnapped Palpatine blowing the horn from Grievous' ship."}, {"tag": "p", "text": "Anakin and Obi-Wan pursue Grievous in their Eta-2 starfighters and avoid several Buzz-droids. On the Separatist flagship Invisible Hand, Dooku discusses Palpatine's \"brilliant plant\" to lure the Jedi into a trap while simultaneously revealing the full strength of the Sith Order. Dooku thinks that he and his master Darth Sidious will be able to defeat the Jedi together. However, Palpatine betrays Dooku and exhorts Anakin to defeat the Separatist leader. During the fighting, Dooku and Grievous are sucked out the window of the Wizard's Tower into space. (Grievous is able to survive in the vacuum of space due to his cybernetics, swearing that they haven't seen the last of him; Dooku, however, presumably perishes, saying, \"You have seen the last of me!\")"}, {"tag": "p", "text": "The Invisible Hand crash lands on Coruscant's surface where Anakin and Obi-Wan argue who should go after Grievous until Yoda, emerging from the wreckage, makes the decision to send his former master. Frustrated and unhappy with his seemingly restricted lifestyle as well as though he were being treated like a child, Anakin walks angrily away from the wreckage, but is stopped by Palpatine, who sows discord between Anakin and Yoda by telling him that Yoda does not see his full potential, but he can. When Palpatine's head swivels between himself and the identity of Darth Sidious, Anakin comes to the conclusion that Palpatine is a Sith Lord. Mace Windu decides to investigate. Meanwhile, on Utapau, Obi-Wan finds Grievous hiding behind a pillar suggested by Tion Medon, and the two engage in a lightsaber duel that results in Obi-Wan slicing off three of the general's hands."}, {"tag": "p", "text": "Back on Coruscant, Master Windu confronts Palpatine alone and discovers that he is indeed Darth Sidious. Windu manages to gain the upper hand in the fight until Anakin arrives. Palpatine convinces Anakin that the Jedi is attacking him as he holds him off with force lightning. Anakin, after three seconds of impasse, disarms Windu with a force push, and Palpatine kills the Jedi Master by scorching him with the lightning and sending him out the window. With Anakin now rechristened into his new Sith apprentice Darth Vader, Palpatine puts Order 66 into action."}, {"tag": "p", "text": "On Utapau, Grievous falls to his death when his TSMEU-6 personal wheel bike tumbles over the cliff in reverse. Obi-Wan announces their victory, but elation is cut as he witnesses Commander Cody and the Clones departing on LAAT gunships and ARC-170 starfighters. Narrating the story, 3PO mentions the Great Jedi Purge and the rise of the Galactic Empire in passing."}, {"tag": "p", "text": "Obi-Wan confronts Vader on Mustafar, and after a heated exchange of words, the two lock their lightsabers in combat while Yoda squares off with Sidious in the Senate Building. Yoda apparently escapes while a Force push gone awry sends Anakin falling into the dangerous lava. With his transformation into Darth Vader complete, Anakin fully embraces the dark side of the Force while his children Luke and Leia are born."}, {"tag": "p", "text": "As he finishes his story, 3PO catches a glimpse of R2 and the mysterious kidnapper on a holocam video leaving on a shuttle. After urging the gatekeeper droid to zoom in on the picture, 3PO learns that they are heading to Mos Eisley on the planet Tatooine and books a shuttle there. Meanwhile, Admiral Ackbar has to deal with Daisy Mae being towed away by a tow truck, but not until after 3PO thanks him for the ride."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}