{"url": "Crispus_Commons", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Gorse locations", "Category:Residential buildings"], "nodes": [{"tag": "h1", "text": "Crispus Commons"}, {"tag": "p", "text": "Crispus Commons was a commons residence area on the planet Gorse. One of its residents, Skelly, was a demolitions expert who served during the Clone Wars. It was conceived as a housing project for homeless Clone Wars veterans, constructed at the very end of the conflict, but was poorly maintained by the Galactic Empire. Crispus Commons' features included a number of apartments, an exercise yard, and a disused bomb shelter, which Skelly later appropriated for his personal use."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Crispus Commons, located on the planet Gorse, was a housing project for veterans of the Clone Wars, an approximately three-year conflict fought between the Galactic Republic and the Confederacy of Independent Systems. The project served as a retirement colony of sorts where veterans were sent to live out their days if they had nowhere else to go. It was sandwiched between two of the planet's industrial districts, placing it within easy commuting distance of most of the planet's major work sites. The facility featured an exercise yard for residents, at the far edge of which was housed its trash bin. Behind the trash bin was a rusted-out grate that led to a bomb shelter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Crispus Commons was conceived during the final days of the Galactic Republic and continued during the reign of the Galactic Empire. Though many of the veterans of the Clone Wars were shipped to the complex, the Empire did not subsidize any expansion or improvement of the grounds once they were created. Skelly, a demolitions expert hired to assist clone troopers during the war, was a resident of Crispus Commons during the time of the Empire. He cleaned out the moldy mess that had grown in the facility's bomb shelter, which had been intended for use in the event that the Separatist military were to attack it, which Skelly considered to be improbable. Skelly instead used the space as his own area to work on and display his manifesto on the negative effects that mining was having on the planet. Skelly considered the room \"his world\" and used one wall for hand-scrawled notes about the planet's military industrial complex, another for his study into wars throughout galactic history, and a third for notes about Gorse's moon, Cynda, and its geological structure. The room was also filled with computers personally built by Skelly."}, {"tag": "p", "text": "Skelly attacked Count Denetrius Vidian—an \"efficiency expert\" in service of the Empire—trying to draw attention to mining activity that Skelly felt could lead to Cynda's destruction. The assault resulted in stormtroopers sacking Skelly's apartment in Crispus Commons looking for him and any information they could find about him. Later, Hera Syndulla, a Twi'lek female who was seeking to form a resistance against the Empire, became interested in Skelly after learning of his actions against Vidian and tracked him to the shelter. Though what Syndulla learned there did little to convince her that Skelly would be a worthwhile ally to her cause, as she considered his ideals too unreasonable, the two nevertheless later ended up working together."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crispus Commons appeared in the novel A New Dawn, written by John Jackson Miller and published on September 2, 2014. A New Dawn was the first Star Wars novel released as part of the franchise's new canon and served as a prequel to the television series Star Wars Rebels."}, {"tag": "p", "text": "Crispus Commons was named in reference to Saint Crispin, also known as a Crispinus, a patron saint of shoemakers, saddlers, and tanners. Miller took inspiration from Crispin's Day, on which the Battle of Agincourt took place, and Miller presumes that Crispus was the name of some battleground or war hero from the Clone Wars. Miller's conception of Crispus Commons is that no actual clones were housed at the facility but rather various planetary volunteers and draftees."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}