{"url": "Cristoph_Jam", "categories": ["Category:Legends articles", "Category:Alderaanians", "Category:Businesspeople", "Category:Humans", "Category:Males", "Category:Nobility"], "nodes": [{"tag": "h1", "text": "Cristoph Jam"}, {"tag": "p", "text": "The eccentric, opinionated Cristoph Jam was a Human male member of the Alderaanian nobility, and a secret purveyor of vigilante justice. He created an elaborate network of spies and informants to report violent or aggressive incidents, usually those focusing on terror and injustice. He would then hire teams of \"Rectifiers\" to handle the situation."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cristoph Jam was born on Alderaan prior to the world's destruction. While he once used his nobleman status to enter politics in an attempt to bring about change, he eventually gave up in frustration after he realized how difficult it was to get the ball rolling in the inertia-heavy political arena of the Republic's heyday. He eventually became head of Descorp, laundering chunks of his company's profits into paying and equipping the vigilantes he called \"Rectifiers.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An impatient but fair man, Cristoph couldn't stand to see innocent people pushed around or living in misery. Highly opinionated and used to getting his way, his solid build and piercing eyes gave him an imposing demeanor, while his walking stick, expensive clothes, and the long, braided hair hanging down his back befitted his position as incumbent nobleman. However, Jam was in the habit of donning a cloak and wandering incognito through spaceport bars in search of deserving or downtrodden folk—much to the chagrin of Jam's professional bodyguards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The phrase 'you are all gathered at the inn, and then a mysterious stranger…' is a running joke among the players of certain fantasy RPGs, assuming all or most gamemasters have at some point started an adventure with the player characters already gathered at an inn, after which a hooded stranger suddenly walks in and offers them a quest out of the blue. Cristoph Jam's habit of searching bars in a cloak and hood, looking for adventurers, fits this stereotype."}, {"tag": "h2", "text": "Sources"}]}