{"url": "Crseih_Station", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Asteroid bases", "Category:Outer Rim Territories asteroids", "Category:Pakuuni sector", "Category:Prisons"], "nodes": [{"tag": "h1", "text": "Crseih Station"}, {"tag": "p", "text": "Crseih Station was an Outer Rim asteroid prison of the Galactic Empire, also known as Asylum Station and Crseih Research Station. It was run by Procurator of Justice Hethrir, who used it as a research center where experiments that tested the limits of realspace, hyperspace, and otherspace."}, {"tag": "h2", "text": "Construction"}, {"tag": "p", "text": "Crseih Station consisted of habitat domes and docking tubes arranged in an exotic and decadent bazaar and was also capable of making jumps into hyperspace. The station was also large enough to host a number of hotels including Crater Lodge which had several artificial pools and streams to stimulate a terrestrial climate. Following the Battle of Hoth in 3 ABY, Crseih Station had relocated to the Crseih system where it orbited a black hole and a crystallizing white dwarf star. Due to a combination of the disturbances in the Force of the crystallizing star and Hethrir's torturing of his prisoners, a mysterious alien known as Waru was brought into the galaxy from another dimension. He was blob-shaped and covered in gold scales, but when the scales were exposed, there was an appearance of raw flesh that oozed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Hethrir made a deal with Waru: he would help him back to his dimension if Waru would help him obtain complete mastery over the Force. Waru agreed, and Hethrir began sacrificing selected prisoners to Waru."}, {"tag": "p", "text": "Waru could heal people by feeding them some of the Force energy he had collected from previous victims, but to replace that energy, he had to kill others. Soon, the fact that Waru could heal people by absorbing them into him was made into a cult, and Waru had made it appear that the failure to heal some people were either accidents, or that the person being healed did not believe in him enough."}, {"tag": "p", "text": "Thus, due to this, and as Crseih Station became a free trading spot and a slave market, religious worshipers began flocking to Crseih to seek healing at the Altar of Waru. Eventually, this reached Jedi Master Luke Skywalker who decided to investigate and left for Crseih with Han Solo and C-3PO. Later, Hethrir kidnapped the Force-strong children of New Republic Chief of State Leia Organa Solo and decided to sacrifice Anakin Solo - the youngest and yet the strongest in the Force - to Waru in exchange for his help."}, {"tag": "p", "text": "However, their plan was stopped by Leia, Luke, Han Solo and Hethrir's former mate Rillao. After Anakin Solo had been rescued, Waru gave up hope of creating a portal back to his galaxy, and instead pulled Hethrir into his energy field and vanished. Meanwhile, the white dwarf star had completed its \"freezing\" state into an unstable quantum crystal. It was also being drawn by the nearby black hole's gravity pull. The fragmentation of the star would take less than three standard hours and the resulting explosion would destroy everything in its path."}, {"tag": "p", "text": "Crseih Station's hyperdrive was quickly reactivated and made a quick jump into hyperspace as the crystal star exploded into countless quantum fragments, destroying any possibility of recreating the conditions which allowed Waru to enter the Galaxy. When Crseih Station arrived at Munto Codru, its passengers were detained by New Republic Intelligence for questioning over their role in the slave trade. The slaves housed there were also freed and returned to their homeworlds. However, its bazaar was not closed down. After the Codru-Ji Chamberlain Iyon of Munto Codru complained to sector authorities, Crseih Station was moved into orbit over nearby Pakuuni."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}