{"url": "Crusader-class_corvette", "categories": ["Category:Legends articles", "Category:Corvette classes", "Category:Crusader-class corvettes", "Category:Galactic Empire starship classes", "Category:Mandal Hypernautics products", "Category:Mandalorian starship classes", "Category:Zann Consortium starship classes"], "nodes": [{"tag": "h1", "text": "Crusader-class corvette"}, {"tag": "p", "text": "The Crusader-class corvette, also referred to as the Crusader-class gunship, was a warship in use during the Galactic Civil War. It was produced by Mandal Hypernautics and named after the ancient Mandalorian Crusaders."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Mandalorian corvette was similar in appearance to the Kandosii-type dreadnaught of earlier millennia, complete with sharp edges marking the superstructure."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "Made to counter starfighters and bombers, the Crusader-class corvette carried as many weapons as it could without compromising its space-worthiness."}, {"tag": "p", "text": "Crusaders were known to utilize an advanced point-defense weapon system that allowed the ships to actually shoot down enemy missiles or torpedoes before they damaged friendly ships. This made the corvettes a valuable support addition to a fleet."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The corvette was faster than any other similar ship of its time. This attribute, along with its large weapons-complement, made the Crusader an extremely pricey vessel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Crusader-class corvette was a designed by Mandal Hypernautics several years after the end of the Clone Wars, with Danar Len working as the lead designer on the project. They initially offered the ship to the Galactic Empire, but the Imperials chose to purchase only two Crusaders, so that they could evaluate the corvette's performance. The two corvettes performed well, but the Empire chose not to purchase any more and assigned the two corvettes to defend the Maw Installation."}, {"tag": "p", "text": "Len was left distraught by the Empire's rejection of the Crusader, so he mothballed the design and left Mandal Hypernautics, despite the encouragement given to him by his colleagues to persevere with the design. Following Len's departure, Mandal Hypernautics offered the ship to the Mandalorians, who agreed to purchase some. Production of the corvette began and a number of them were also sold to planetary and small interstellar governments."}, {"tag": "p", "text": "Ships of this class were part of the naval forces built up by the crime lord Tyber Zann in his crusade to gain galactic influence. They were used as a component of his relatively sizable fleet."}, {"tag": "p", "text": "Many years later, Admiral Natasi Daala began a campaign against the New Republic and utilized the two Crusader-class corvettes that had been purchased by the Galactic Empire. The corvettes proved to be highly effective, so the Imperial Remnant renegotiated with Mandal Hypernautics and purchased a sizable number of them. Two Crusaders later served in Admiral Daala's Maw Irregular Fleet and participated in the Second Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}