{"url": "Crushgaunt/Legends", "categories": ["Category:Legends articles", "Category:Glove and knuckle weaponry", "Category:Mandalorian armor", "Category:Mandalorian weapons"], "nodes": [{"tag": "h1", "text": "Crushgaunt"}, {"tag": "p", "text": "The crushgaunt (or shuk'orok in Mando'a) was a gauntlet designed to augment its wearer's strength."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Developed by the Mandalorians, the armored glove used a reactive fabric that exponentially enhanced the natural hand-arm strength of its wearer. Its name was earned from the wearer's new ability to crush bone, metal, or any other material with relative ease. Made of micronized Mandalorian iron, a crushgaunt was difficult to damage or destroy. Crushgaunts were used to collapse throats, crush skulls, and shatter bones. Also, due to the unique properties of the micronized Mandalorian iron, also known as beskar, the user of a crushgaunt could easily catch and hold a lightsaber blade in his grasp, or summarily block an opponents blade."}, {"tag": "p", "text": "The crushgaunt was later outlawed by the Mandalorians themselves at least 250 years before the Battle of Yavin, although it was brought back into use by the Death Watch."}, {"tag": "p", "text": "Unconfirmed reports hinted that at least one of Darth Vader's black gauntlets was a long-lost Sith-imbued crushgaunt. This is possibly his right hand, as it was rumored to be \"indestructible\", a most likely exaggerated legend attributed to the durability of proper beskar crushgaunts."}, {"tag": "p", "text": "During the Yuuzhan Vong War, Boba Fett and various Mandalorian commandos ensured the protection of Mandalore by serving the Yuuzhan Vong as saboteurs. Secretly, however, they used this as an opportunity to gather intel on the Yuuzhan Vong to aid the New Republic. During one mission, Fett and a team of Mandalorian commandos were forced to kill a Yuuzhan Vong soldier wearing Vonduun crab armor. Goran Beviin buried his beskad into the Vong, and was unable to remove it. Releasing his saber, Beviin immediately gripped the warrior's neck with his crushgaunts. After a short time, and with great effort, Beviin caused the Vong's armor to crack, killing both the armor and its owner. Fett then said he would rescind the ban on crushgaunts due to their effectiveness against the Vong."}, {"tag": "p", "text": "Upon hearing of the death of Mara Jade Skywalker, Mandalore Boba Fett requested that a gift be sent to Han Solo, which included a set of crushgaunts so that he could end his son's life when the time came, a set of armor plates, a small blade, and a note saying, With deepest sympathy. These crushgaunts were later used by Jagged Fel to kill Alema Rar, snapping her neck on The Home, an asteroid near Bimmiel."}, {"tag": "p", "text": "In about 43 ABY, Imperial Head of State Jagged Fel used crushgaunts to hang on to the bottom of a speeder and it was mentioned that there were servos in the crushgaunts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}