{"url": "Crymorah_syndicate", "categories": ["Category:Canon articles", "Category:Stub", "Category:Crymorrah syndicate"], "nodes": [{"tag": "h1", "text": "Crymorah syndicate"}, {"tag": "p", "text": "The Crymorah syndicate was a set of crime families who operated during the reign of the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Five years after the end of the Clone Wars, the syndicate provided the Galactic Empire with intelligence during their attempts to capture Berch Teller and his rebel cell."}, {"tag": "p", "text": "In the aftermath of the Battle of Yavin and the destruction of the Empire's superweapon, the Death Star, the Emperor sent his apprentice, Darth Vader, to secure a deal with the Hutts to gain new raw materials for Imperial Military production. After the destruction of Weapons Factory Alpha on Cymoon 1 and the failure of negotiations with the Hutts, the Emperor ruled out opening negotiations with the Crymorah to secure resources and instead ordered Vader to go to Tatooine to negotiate directly with Jabba the Hutt."}, {"tag": "p", "text": "After destroying a base of pirates who had been raiding the Empire's supply lines, Vader discovered that the pirates were being backed by the Crymorah and their allies, the Droid Gotra, a band of Separatist-era battle droids who were not deactivated and who were acting against the Empire. Several of these droids were upgraded due to the efforts of droid archaeologist Aphra such as two droidekas who were equipped with missile launchers."}, {"tag": "p", "text": "In 0 ABY, it was reported by Cynabar's InfoNet that the Crymorah and the Son-tuul Pride had become the latest casualties in Grand General Cassio Tagge's undeclared war on the underworld, though by 4 ABY it had become active again the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Crymorah syndicate was first mentioned in the novel Tarkin, which was written by James Luceno and released in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}