{"url": "Crymsin_Ost", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Fallen Jedi", "Category:Females", "Category:Force-sensitive Believers", "Category:Humans", "Category:Jedi Guardians", "Category:Post-Ruusan Jedi"], "nodes": [{"tag": "h1", "text": "Crymsin Ost"}, {"tag": "p", "text": "Crymsin Ost was a Force-sensitive Human female who became a member of the Jedi Order during the latter years of the Galactic Republic. Ost later succumbed to the dark side of the Force and became a member of the Believers, a Sith cult that operated from the Cularin system. In about 21 BBY, during the Clone Wars, she traveled to the Caarimoos system and directed a Believer operation to attempt to disperse a deadly virus on the planet Caarimon and wipe out most of the Caarite species. However, she was attacked by a group of freelance agents who defeated her and prevented the infection from being released."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Crymsin Ost was a Force-sensitive Human female who served the Jedi Order during the waning years of the Galactic Republic, and she trained as Jedi Guardian, a combat-oriented Jedi specialization. At some point Ost lost her sanity and fell to the dark side of the Force; she abandoned the Jedi and affiliated herself with the Believers, a Sith cult that was based in the Cularin system. She eventually became an important member of the cult and, with help from the Ithorian Believer Force Adept Disch'l, constructed a pink-colored lightsaber for herself."}, {"tag": "p", "text": "In about 21 BBY, during the Clone Wars, the Believers embarked upon a plot to wipe out most of the Caarites—a sentient species that operated the Metatheran Cartel trade organization—by dispersing a deadly virus on the Caarite homeworld, Caarimon. Ost was placed in command of the operation, and she journeyed to Caarimon aboard a transport that had collected large quantities of the virus from a secret Believers laboratory on the planet Genarius. On arrival in the Caarimoos system, Ost's transport docked with the research station Creautaa-V in orbit of Caarimon, and she disembarked from the vessel along with the rest of her strike team: Disch'l, the Believer Eph, and Melo Centris, a renowned assassin who had been hired to assist the Believers with their mission. The Believers released a sample of the infection and wiped out all of the installation's Caarite crew, then off-loaded a tank of the virus and ferried it to the lowest level of the station. There, they filled some escape pods with the virus and prepared them for launch in the direction of the planet, and they also rigged the pods with explosives, hoping to crash them into fault lines in the Desolation region of the world and cause a major cataclysm. Meanwhile, another group of Believers landed on Caarimon and rigged a homing beacon in the Desolation region, and Ost and her crew waited to receive a signal from the transmitter."}, {"tag": "p", "text": "A group of freelance agents from the Cularin system known as the \"Heroes of Cularin\" traveled to Caarimon to investigate the Believer plot, and, after disabling the homing beacon in the Desolation, they boarded the Creautaa-V and confronted Ost's strike team. Ost ignited her lightsaber and moved to attack the operatives, while Disch'l used the Force to create an illusory version of the fallen Jedi, as a distraction. Despite their efforts, Ost and the other Believers were eventually defeated, and the agents prevented the virus from being dispersed on the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Crymsin Ost was insane and devoted to the ideals of the Believers, and she was willing to commit genocide in order to further the cult's aims. Like all Believers, she had a tattoo on the front of her right shoulder that depicted the Sith Fortress on the planet Almas, with a lightsaber handle snapped in two, which formed the base of the fortress's spire. However, Ost's tattoos were modified such that if she clicked her teeth in a particular pattern, a fatal dose of poison would spout from sub-dermal implants beneath the tattooed lightsaber handle, giving each halve a red-colored blade."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ost was used to going into battles with an illusory version of herself beside her, such as the apparition created by Disch'l during her fight against the Heroes of Cularin. She knew how to use the Force to sense things, to move objects, to heal herself, to improve her combat abilities, and to drain energy. In addition, she was familiar with the powers Battlemind, Force rage, Force stealth, and Hatred, and she was trained in the use of martial arts."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ost wielded a lightsaber, which had a bright-pink blade with traces of red. The weapon had a black-colored steel handle and was ignited via an internal switch, through use of the Force. In addition, she carried a blaster pistol as a secondary weapon, and she wore street clothes during her assault on Creautaa-V."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crymsin Ost made her first and only canon appearance in Belly of the Beaast, a roleplaying adventure written by Morrie Mullins in 2003 that formed part of the Metatheran Caution trilogy of the Living Force campaign. During the adventure the player-characters roleplay as the Heroes of Cularin, and the amount of Force powers possessed by Ost varies, depending upon the roleplaying experience tier of the players. She can only utilize the powers Drain Energy, Force rage, and telekinesis, or use martial arts when facing off against players in the middle or upper experience tiers, and she can only wield the power Hatred when engaging upper-tier players. As a consequence, when fighting lower-tier players, Ost has to have her lightsaber ignited for her by Disch'l, because she lacks the ability to use telekinesis and thus cannot operate her weapon's Force-activated switch. It is possible for the player-character to kill Ost during their encounter with her, and also to loot her lightsaber. If she is captured by the players, she attempts to activate the implants in her tattoos and commit suicide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}