{"url": "Crys/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles that are known by a nickname", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Crys"}, {"tag": "p", "text": "\"Crys\" was the nickname of a clone trooper who fought during the Clone Wars. Around 21 BBY, Crys took part in a battle that involved finding and capturing the Confederate General Grievous on the planet Saleucami. During the battle, Crys served under Jedi General Obi-Wan Kenobi and Clone Commander Cody. After discovering a destroyed battle droid near Grievous's crashed landing shuttle—from which Grievous had escaped—Crys and Cody performed a robolobotomy on the droid and learned that Grievous was planning to escape the world via an abandoned escape pod. Although Crys and the Republic forces found and engaged Grievous, the general escaped after a shuttle arrived to extract him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "\"Crys\" was the nickname of one of the many clones of the Mandalorian bounty hunter Jango Fett, created on the planet Kamino to fight for the Republic's Grand Army. Around 21 BBY, during the Clone Wars, the Confederate General Grievous escaped to the surface of the planet Saleucami in a landing craft, after battling Republic forces in orbit above the the world. However, the general was forced to use an escape pod after the craft was damaged by debris and crash-landed on the surface of Saleucami."}, {"tag": "p", "text": "To find the Confederate general on Saleucami, Crys; Jedi General Obi-Wan Kenobi; Clone Commander CC-2224, nicknamed \"Cody\"; and a group of clone troopers ventured to the planet's surface. After landing on the planet in several Acclamator-class assault ships, the Republic forces deployed to search for Grievous. They soon found remnants of Grievous's landing craft and also an intact, albeit deactivated, B1-Series battle droid. Kenobi ordered his troopers to load the droid on board an AT-TE walker so that a robolobotomy could be performed on it later."}, {"tag": "p", "text": "Inside the AT-TE, Crys and Cody began the robolobotomy, and the two broke the battle droid's access codes, which activated the guidance system of the droid. Soon after, Kenobi appeared, and Crys, with Cody, told the Jedi Master that the droid held information of an escape pod that crashed due to a near-collision with another pod during its atmospheric descent; the other escape pod was simultaneously being located by Grievous on the planet's surface. With this information, Cody was able to determine an approximate location of the escape pod that Grievous was after. After discovering the pod, Crys and the rest of the team found Grievous and his troops by the escape pod and engaged the droid forces. While both sides fought briefly, a shuttle arrived to extract Grievous from the area. After Grievous escaped in the shuttle, Kenobi requested a transport to pick up Crys and the other Republic troops."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Crys was able to perform a robolotomy on a B1 battle droid and successfully used this ability on Saleucami, giving the Republic troops the chance to find and engage Grievous. After completing the robolotomy, he gave Kenobi a short and useful report. On their hunt for Grievous, Crys and Cody worked close together with their superior Jedi officer, and Kenobi even gave orders to his men via Crys. As a clone of Jango Fett, Crys stood 1.83 meters tall, had brown eyes, and had tan skin. At some point, Crys dyed his original black hair blond."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his service on Saleucami, Crys wore Phase I clone trooper armor with yellow markings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crys first appeared in \"The Deserter,\" the tenth episode in the second season of the Star Wars: The Clone Wars television series, which aired on January 1, 2010. In the episode, the clone trooper was voiced by Dee Bradley Baker, who voices all clone troopers in the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}