{"url": "Crysta_Markon", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Bounty hunters", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Crysta Markon"}, {"tag": "p", "text": "Crysta Markon was a Human female Bounty hunter who served the reconstituted Sith Empire during the Cold War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3643 BBY, she worked as a handler at the Mandalorian Enclave on Dromund Kaas where she met an unidentified bounty hunter who was there to participate in the Great Hunt. She sent the bounty hunter on several assignments across the planet in order to earn a spot in the final melee. After the hunter managed to win the final melee and became a Great Hunt competitor, Crysta then instructed the hunter to steal a D5-Mantis Patrol Craft from the spaceport as part of the competition. Despite interference from Tarro Blood alerting the spaceport authorities, the hunter was able to get away with the ship."}, {"tag": "p", "text": "Throughout the Great Hunt, Crysta provided holorecordings with information on their assigned target. When the hunter reached the final round, Crysta personally explained via holo that the final target was Jedi Master Kellian Jarro, known for the most Mandalorian kills. As Jarro was stationed aboard the Republic starship, Aurora, not only would the hunter be required to kill him, but to also disable the ship's hyperdrive regulator so that the ship would be destroyed when it jumped to hyperspace. She also tipped off the hunter that Blood had reached the Aurora first."}, {"tag": "p", "text": "Crysta was later witness to the hunter returning to Dromund Kaas victorious and commended her friend."}, {"tag": "p", "text": "In 3637 BBY, Crysta sent a message to the Hunter, suggesting various planets to go to for a vacation. Not long afterwards, while visiting Rishi, she sent a message back to her daughter Thera Markon about her travels there. However, she was killed by the Kanawyn Syndicate, leading her daughter to travel to Rishi to investigate Crysta's death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crysta Markon is a flirt option for male bounty hunters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}