{"url": "Crystal_Cave_(Dantooine)", "categories": ["Category:Legends articles", "Category:Caves", "Category:Dantooine locations", "Category:Locations of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Crystal Cave  (Dantooine)"}, {"tag": "p", "text": "The Crystal Cave was located on the southeast end of the Khoonda plains in the Sandral fields on the world of Dantooine. The Jedi Order, which discovered the caves circa 4016 BBY when Jedi Master Vodo-Siosk Baas established the Jedi Enclave there, was given sole access to the world's wealth of precious crystals which were vital to the construction of the Order's lightsabers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Crystal Cave on the planet of Dantooine had been burrowed by its non-sentient inhabitants, the kinrath, a species of poisonous arachnoids. The original entrance to the cave was located at the East end of a territory called \"the Sandral Grounds,\" which was named after the family of Human colonists that had established their estate in the area. At some point after 3956 BBY, the entrance was sealed, but the kinrath slowly dug a new tunnel that led to the Khoonda plains, an area that had once hosted the compound of the Matale family. In its first incarnation, the Crystal Cave consisted of a large tunnel ending on a single chamber. Following the carving of a new, bigger cave by the kinrath, it contained two chambers and more complex network of tunnels."}, {"tag": "p", "text": "Among the naturally occurring crystal structures were the rare Adegan crystals, once believed to only grow on Adega, which produced blue, green and yellow variations. A mystery for the Jedi, red crystals would sometimes form in unhatched kinrath eggs; rubat and bondar crystals were also occasionally seen with the cave system. In the fourth millennium before the Galactic Civil War, at least one Ultima-Pearl, while those gems were normally found on the oceanic floor of the planet Dac."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Discovered by the early Jedi that accompanied Jedi Master Vodo-Siosk Baas to Dantooine, these members of the Jedi Order established the Jedi Enclave near to the mouth of the cave in order to guard and protect its precious treasure trove of crystals which were vital to the construction of the Jedi lightsaber. As the academy grew, Jedi pilgrimages became more frequent and traversing the caves became a rite of passage similar to that experienced on the Jedi fortress world Ilum. The cave, burrowed by the dangerous kinrath native to the world, used the tunnel system leading into the cave as a nesting site and would attack any who they perceived as a threat to the nest."}, {"tag": "p", "text": "During the Jedi Civil War, a conflict between the Republic and the Sith Empire of Darth Revan and Darth Malak, the number of students at the Enclave dwindled and the Caves became greatly infested with kinrath as the Jedi were no longer able to cull their numbers. Following Revan's retraining as a Padawan and forced amnesia, he entered the cave and collected numerous crystals to enhance his lightsaber during his quest to find the mysterious and deadly Star Forge. During the Dark Wars that followed the death of Malak and the destruction of the Star Forge, the Jedi Enclave was devastated and closed. When the city of Khoonda was formed, the Dantooine militia sealed the kinrath caves, closing off access to the precious crystals. Despite this, the kinrath quickly made a new tunnel to the surface that was even closer to the city and attacks by the vicious creatures increased."}, {"tag": "p", "text": "During this dark period for the Jedi Order, the exiled Jedi Meetra Surik entered the cave complex in 3951 BBY and killed the kinrath matriarch in order to pacify the local kinrath population. While exploring the tunnels, she and her companions stumbled across the Crystal Cave, and with the help of Jedi Master Kreia, she was able to detect the imprint that Revan had left upon the chamber. While she was there, Surik collected several lightsaber crystals, including a unique personal crystal which would prove quite useful during her campaign against the Sith Triumvirate."}, {"tag": "p", "text": "Over three hundred years following Revan's visit a group of Jedi, including Satele Shan, Fortris Gall and Master Dar'Nala entered the cave to meet with representatives of the resurgent Sith Empire in the weeks following the shocking Treaty of Coruscant. When Darth Baras and Darth Angral arrived to negotiate, Jedi Shan attacked and refused to negotiate with Sith. During the skirmish, Shan realized that Master Dar'Nala had succumbed to the dark side of the Force in her attempts to destroy the Sith. Before Shan could intercede and help her former master, the Togruta was killed by the Wookiee mercenary Dalborra. Fleeing the caves, the Cold War between the Sith and the Galactic Republic would continue on for years after."}, {"tag": "p", "text": "By the time of the Clone Wars some two millennia after the Cold War, the Order had reestablished some ties with Dantooine, and saw some visits to the Dantooine Caves. Padawan Jax Pavan was one Jedi apprentice who traveled from the Coruscant Jedi Temple during the conflict to obtain a rare Dantooinian crystal for use in his lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}