{"url": "Crystal_Web_Station", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Expansion Region space stations", "Category:Palamut sector"], "nodes": [{"tag": "h1", "text": "Crystal Web Station"}, {"tag": "p", "text": "Crystal Web Station was a space station built around a huge crystal asteroid which floated in deep space."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The station had three massive crystal engines which anchored it in place, holding it in a web of glowing energy lines. These engines kept the station from drifting into the Voidfire Nebula, which it was placed precariously near to, so as to keep a constant location for arriving ships. Without these engines, the station would have drifted into the nearby nebula, where it would have suffered severe damage to the computer and electronics systems due to the clouds of ionized gas."}, {"tag": "p", "text": "Due to peculiarities of hyperspace travel in the nebula, Crystal Web Station had become a necessary stopping point for ships traveling along the three major spacelanes which intersected in the nebula, including the Hydian Way. The most advantageous drop-and-jump point along all three hyperlanes was in the vicinity around the Crystal Web Station. From this location, all the major star systems along each route could be accessed with a single recalculated jump, thus cutting days or even weeks off the longest hauls. Before the station was discovered, travelers had to bypass the hyperlane cluster completely and use a slower, less direct pathway."}, {"tag": "p", "text": "Though it is not known exactly when the Crystal Web Station was constructed, it is known that it had to have been sometime between the Imperial survey of the nebula in 8 BBY and the accident that forced Daran Tal's scout ship out of hyperspace in 1 BBY, as the station was already fully functional when Tal arrived at it. The intelligent crystal spiders, which Tal named the Lucents, had built the station to interact and get to know members of the galactic community."}, {"tag": "p", "text": "The Lucents welcomed Tal with open arms, and he quickly formed friendships with the crystalline beings. He learned some small details about them in this time, but they would always remain secretive about their homeworld, simply gesturing vaguely toward the nebula whenever he brought it up. In the time he spent with them, he learned that the Lucents were natural navigators, and used no instruments to plot courses or calculate jumps. Additionally, he discovered that their crystal technology was based on principles similar to but different from the technology used by the galaxy at large."}, {"tag": "p", "text": "The more Tal learned about them, the more he was convinced that the Crystal Web Station could provide the Lucents with precisely the contact they desired while also turning a tidy profit. He outlined his plan to the Lucent leaders, got their agreement, then had them calculate a jump for his ship so that the plan could be brought into action. When he returned to the station two months later, he brought with him a small staff to man the station including Klaar and Lianna Tagon. They hoped to turn the Crystal Web Station into a smaller version of Cloud City, designed to serve all travelers in need of quicker routes along the three major hyperlanes. Knowing that the Empire had a distinct dislike of nonhumans, Tal took the title Baron Administrator and became the visible, if not actual, leader of the station."}, {"tag": "p", "text": "The Lucents stayed the real leaders of the station, remaining behind the scenes and keeping the station in good repair. They guided the ships through the ionized regions with their Crystal Star Tugs and calculated lightspeed jumps for them while they observed the beings moving around the station. The Lucents built the station for the comfort of other beings. Except for their private levels and hidden access tubes, the station looked much like any deep space station that could be found throughout the galaxy. Even in areas designed for others, however, alien touches abounded. The architecture had a distinct web pattern, and crystalline construction could be seen throughout."}, {"tag": "p", "text": "After the destruction of the second Death Star in 4 ABY, the Crystal Web Station was the location of a meeting between an Imperial Admiral, newly formed New Republic agents, and Orta the Hutt. They had all been asked to attend by Daran Tal on behalf of the Lucents. Tal had convinced the Lucents to offer a small piece of their crystal web technology in lieu of the galactic shift in power caused by the Emperor's death. While each group wanted to have sole access to the item, the Lucents had already decided that all groups interested in the technology would receive it. Though there were some difficulties, the meeting managed to go rather smoothly, and all parties involved walked away happy. Later in the year, Moff Jeckor attempted to forcefully conscript \"volunteers\" into the Imperial navy to crew one of their new capital ships by invading one of the cantinas with stormtroopers. Thanks to security chief Klaar and a group of New Republic agents, the abduction was repelled."}, {"tag": "h2", "text": "Station Layout"}, {"tag": "h3", "text": "Levels 1-59"}, {"tag": "p", "text": "Located on the bottom of the station, this was the most alien portion of the station, as it was designed to provide the maximum comfort for Lucents. The upper levels of this section contained the Lucent living areas. Crystal webs stretched across the open decks to form nest platforms. On each platform, a different Lucent family kept a nest. At the very bottom of this section, built into the crystal core itself, were the power cells and energy generators which constantly emitted a hum and glow. These generators provided power to the entire station, much the same way that standard power cells did for the rest of the galaxy. The technology, however, appeared alien, as it took the form of crystals and glowing webs that looked as beautiful as they were functional."}, {"tag": "h3", "text": "Levels 60-79"}, {"tag": "p", "text": "These decks were generally off limits to visitors as it was the area in which most Lucents worked, and the secret access tubes leading throughout the station originated from here. Most of the Crystal Star Tugs were docked in service bays on this level also, while the maintenance bays and deep storage facilities stretched toward the crystal core. Many of the stations supplies were stored in special units on these decks. In addition, the Lucents maintained a number of huge factories designed to accommodate their unusual manufacturing style on these levels. The most impressive of these crystal web looms were used to weave kilometers of crystalline building materials."}, {"tag": "h3", "text": "Levels 80-89"}, {"tag": "p", "text": "These are the second \"highest\" levels on the station and are generally called the merchant and visitor decks. For those visiting the station, this was the heart of the complex; hangar bays and maintenance docks gave way to port services and a ring of inns. The hangar bays ranged from small craft bays extending to docks for multideck hangars suitable for large freighters and small capital ships. Hangars were located all over the exterior of the station, but visitors were most often directed to those connecting to levels 80-89. Port services included refueling depots, maintenance and repair stations, customs and inspection, trade councils, and jump coordinate scheduling."}, {"tag": "p", "text": "The cost for receiving a hyperspace coordinate uplink was generally 10 credits times the ship's cargo capacity in metric tons. The inns situated throughout these decks ranged from multibed bunk houses right up to luxury suites that cost a fortune. There was a place to rest and clean up for every taste and budget. The merchant ring was built around the crystal core itself, and featured a wide variety of shops, cantinas (including Moko's Cantina), restaurants, casinos, and entertainment facilities. Most visitors frequented these decks, basking in the light of the beautiful crystal while they conducted business, met people, spent credits, and had fun. Because these decks were furnished by the merchants who established the shops here, they had the most \"Human\" (or equivalent alien standard, depending on which race owned the shop) feel and design. The outer structure and station surrounding these shops, however, maintained the alien design favored by the Lucents."}, {"tag": "h3", "text": "Levels 90-100"}, {"tag": "p", "text": "The \"top\" levels of the station housed the control centers and administrative offices that kept the place running smoothly. Lucent controllers monitored all incoming and outgoing space traffic, watched for changes in the ionic field emanating from the nebula, and oversaw all the station's systems. The Baron Administrator and his staff also had offices on these levels, though he and his security chief, Klaar, spent more of their time wandering the station than staying cooped up in their office complexes."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}