{"url": "Cr%C3%A8che_egg", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Religious objects"], "nodes": [{"tag": "h1", "text": "Crèche egg"}, {"tag": "p", "text": "In the years following the Galactic Civil War, the reclusive culture known as the Crèche guarded a giant egg hidden deep in caverns on Ovanis. The Crèche believed that the egg would one day hatch the savior of the galaxy. The egg was destroyed by First Order flametroopers under the command of the First Order Security Bureau Agent Terex."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Crèche egg was a large egg that emitted a ghostly blue light. It was suspended from the ceiling of the Cave of the Crèche by a series of tubes. The Crèche egg could be damaged by sustained fire from flamethrowers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For generations, members of the Crèche cult devoted their lives to protecting and nurturing the egg. They believed that the egg held their unborn savior. When the egg hatched, the Crèche believed that their savior would reward them for keeping it safe for many generations. Following Operation: Sabre Strike, the Resistance General Leia Organa dispatched the starfighter pilot Poe Dameron and his Black Squadron to search for the explorer Lor San Tekka. Leia believed that Lor San Tekka could help her find her lost brother Luke Skywalker. When Poe arrived on Ovanis, the Crèche elder told her that Tekka had visited them a long time ago."}, {"tag": "p", "text": "She then proceeded to brief Poe about the Crèche egg and its importance to her community. When BB-8 found a tracker on Poe's T-70 X-wing starfighter, Poe confronted the Crèche. Mistaking the tracker for a detonator, the Crèche elder ordered her people to attack Poe. Poe managed to reassure the Crèche that he was not a threat. Shortly later, the First Order agent Terex arrived with a contingent of stormtroopers and demanded the Crèche hand over Poe. The Crèche elder feigned ignorance but one of Terex's stormtroopers sensed the presence of Poe's tracker."}, {"tag": "p", "text": "In retaliation, Terex threatened to torch the Crèche egg. To save the egg, Poe surrendered himself. When Poe revealed that Black Squadron was attacking Terex's forces, Terex ordered his flametroopers to torch the egg. Ultimately, the egg cracked open and released two large winged creatures, who fought each other. The black creature ultimately triumphed over the blue winged creature. After the First Order forces were defeated by the Resistance pilot Dameron and Black Squadron, the grateful Crèche cultists regarded the black winged creature as their savior and departed with it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Crèche egg first appeared in the 2016 comic Poe Dameron 1, written by Charles Soule and illustrated by Phil Noto."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}