{"url": "Csilla/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Chiss Ascendancy planets", "Category:Csilla locations", "Category:Ice planets"], "nodes": [{"tag": "h1", "text": "Csilla"}, {"tag": "p", "text": "Csilla, the homeworld of the Chiss, was a cold world of glaciers and snowy wastes located deep within Chiss Space, and served as the capital of the Chiss Ascendancy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Csilla was a terrestrial planet in the Csilla system of the Unknown Regions of the galaxy, occupying the second orbit from the star Csilla and located at the junction of the Path of the Houses and the Vagaari Corridor. With standard gravity, a frigid climate, and a diameter of 11,080 kilometers, Csilla was orbited by three moons and had terrain featuring glaciers and caves. Due to the mineral content of the hydrosphere, glaciers on Csilla were a striking blue in color. A day on Csilla lasted 25 standard hours and a year lasted 462 local days. Chiss starships relied on a series of navigational anchor points that spread out from Csilla."}, {"tag": "p", "text": "Csilla was the capital of the Chiss Ascendancy and imported resources including foodstuffs, luxury goods, and technology from other Chiss colonies. A network of underground tube transports connected its largest city, Csaplar, to every other area on the planet, including other cities buried in the ice. Cities on Csilla were kept livable by heat from the interior of the planet. Csilla was also the center of Chiss politics; their Cabinet and Parliament could be found at the House Palace in Csaplar. The Csapla family was responsible for the distribution of resources to the populace of Csilla."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Between 27,500 BBY and 27,000 BBY, Humans reached Csilla in sleeper ships and colonized the planet. Genetic analysis indicated that these Humans developed into the Chiss, who quickly developed a global government. The need to manage Csilla's population and obtain resources without damaging their homeworld's ecosystem motivated the Chiss space program, which may have benefited from memories of the original colonization effort."}, {"tag": "p", "text": "The planet entered an ice age in 5000 BBY. Glaciers covered the normally-warm equatorial regions of the planet, while solid ice locked the poles in perpetual winter. In order to survive, the Chiss built energy-efficient warrens beneath the ice, as close to the warmth of the inner planet as possible, with underground carriage travel routes to connect the various underground sections of Csilla. The iceways were bored through the bedrock of the planet, so that they were unaffected by the shifting ice found on the planet's surface.[source?]"}, {"tag": "p", "text": "Locked in an ice age for millennia, Csilla forced many socioeconomic and technological changes upon the Chiss, but few physical changes. Contrary to beliefs in a link between the Chiss skin color and the Csillan temperature, scientists concluded that the Chiss' blue skin was caused by a mineral found in the Csillan hydrosphere.[source?]"}, {"tag": "p", "text": "During the Great Galactic War, negotiators from the Chiss Ascendancy—the Chiss' government—and diplomats of the Sith Empire met in a summit, which resulted in the Ascendancy offering resources, tax revenues, and armies to the Empire in return for its sovereignty; as part of the decision, no Imperials would enter Csilla without permission."}, {"tag": "p", "text": "It was also home to the Expeditionary Library. Grand Admiral Thrawn was born here."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Csilla was inhabited by eight billion sentients and was the homeworld of the Chiss, who comprised 99% of the population. The Chiss were near-Humans whose blue skin color was partly caused by the mineral content of Csilla's hydrosphere."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Csilla /ˈt͡ʃilːɒ/ is a Hungarian female given name from csillag (meaning \"star\")."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}