{"url": "Cthon/Legends", "categories": ["Category:Legends articles", "Category:Core Worlds species", "Category:Human and Near-Human species"], "nodes": [{"tag": "h1", "text": "Cthon"}, {"tag": "p", "text": "Cthons, also known as Troglodytes, were inhabitants of the lowest levels of the Coruscant underworld."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Visually, Cthons resembled decaying corpses with loose flaps of flesh, stringy, dirty hair, and a lipless mouth filled with sharp teeth. Skin grew to cover their eyes; there was an egg-like organ where the eye could be seen moving restlessly while sealed within its sockets. If clothed at all, they wore nothing but simple loincloths. They were zombie-like humanoids who preyed on living flesh."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Their ancestors were Humans who were banished from the surface for their crimes, subsequently residing in the darkness of the undercity for thousands of years, which genetically changed them into terrifying creatures that became the subject of countless horror stories and nightmares."}, {"tag": "p", "text": "Cthons were also known to use electroshock nets to catch their prey, as demonstrated on Jedi Padawan Darsha Assant and her companions, I-5YQ and Lorn Pavan. Cthons were said to be the analog of the Tarisian Rakghoul of the Taris Undercity and perhaps may be related to the underlevels' corridor ghouls."}, {"tag": "p", "text": "Cthons were also used as slaves by the Flesh Raiders of Tython. Some of these Cthons would burrow underground and then burst from the ground and attack when an enemy approached their Flesh Raider masters. It is unknown how these Cthons arrived on Tython, though these Cthons were purple-grey in color instead of the normal white."}, {"tag": "p", "text": "Following Operation: Knightfall, one of the few surviving Jedi was Sha Koon, who attempted to kill Darth Vader by luring him into an ambush. By using the Force, she manipulated the Cthon into attacking the Sith Lord, but they were easily dispatched."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}