{"url": "Cularin_Question", "categories": ["Category:Legends articles", "Category:Galactic Republic laws and acts"], "nodes": [{"tag": "h1", "text": "Cularin Question"}, {"tag": "p", "text": "The Cularin Question was a political contention that took place during the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In about 32 BBY, the Galactic Republic granted the Thaereian military a charter that made the Cularin system a Thaereian protectorate and allowed the Thaereians to establish a presence in the system. However, by the time of the Clone Wars, many of the system's inhabitants had came to resent the presence of the Thaereians, due to the Thaereian military's heavy-handed approach to policing in the system. The Cularin Militia, an anti-Thaereian paramilitary force, began an armed conflict to drive the Thaereians out of the system and in about 21 BBY, the Cularin government requested that the Galactic Senate rescind the Thaereians' charter. The Senate scheduled a formal presentation to decide the matter and Senator Lavina Wren, the Cularin system's Senate representative, and a number of other anti-Thaereian Cularin system dignitaries traveled to the planet Coruscant to present to their case to the Senate. During a mission to assault a Separatist base in the Ando system, the Cularin Militia had obtained evidence that the Thaereian military had secretly colluded with the Confederacy of Independent Systems, the Republic's enemy. The Militia planned to present the evidence to the Senate, believing that the evidence would turn the favor of the Senate against the Thaereians. A team of freelance agents delivered the evidence to Coruscant, but were attacked by Thaereian agents, who attempted to stop the agents from divulging the evidence to the Senate. However, the freelance agents defeated the Thaereians, and the agents and the Cularin system dignitaries subsequently addressed the Senate. Afterward, on the recommendations of Supreme Chancellor Palpatine the Senate voted to revoke the Thaereians' franchise to operate in the Cularin system and ordered the Thaereian military to withdraw their forces from the system. The Thaereians refused to pull their forces from the Cularin system and were driven out a short time later by a combined Republic and Cularin Militia force during the Battle of Cularin."}, {"tag": "h2", "text": "Appearances"}]}