{"url": "Cularin_Trade_Show", "categories": ["Category:Legends articles", "Category:Events during the Clone Wars"], "nodes": [{"tag": "h1", "text": "Cularin Trade Show"}, {"tag": "p", "text": "The Cularin Trade Show was an event that was held by the Cularin Trade Alliance during the Clone Wars."}, {"tag": "h2", "text": "The show"}, {"tag": "p", "text": "The show was organized to celebrate the creation of the Trade Alliance and to demonstrate the benefits that it could bring to the Cularin system. It was held aboard the CTA ship, the TAV Prosperity and various businesses were invited to attend."}, {"tag": "p", "text": "The show was attended by Joh's New and Used Droid Emporium, the Kashyyyk Academy of Wrestling, Nenmo's Curios, BlasTech Industries, Merr-Sonn Munitions and SoroSuub, who all set up stalls in the ship's trade hall. Ma'Haffee Shipyard also showed off some of its products in the hangar bay and representatives from the Almas Academy, the Cularin Militia and Lony Hertz's Force Adept Club were there in an unofficial sense, to try and recruit new members."}, {"tag": "p", "text": "The CTA Vice President Cyreno Taegon made a speech to the show's attendees about the Alliance, but was interrupted by a hologram of Thurm Loogg, the leader of the rival company, the Metatheran Cartel. The hologram was being broadcast by a Cartel plant who had infiltrated the show and he was soon discovered and escorted out by Trade Alliance Security. Taegon also boasted about the Prosperity's modified hyperdrive, which would allow it to enter hyperspace in the shadow of the Cularin comet cloud. To demonstrate this, ship tried to go to hyperspace, but it failed and the ship was shaken and left floating in a dangerous area of the cloud with no operational control systems. This caused chaos aboard the ship and nearly lead to a riot. Osten Dal'Nay and some of the show's attendees were able to save the day by flying out in the Ma'Haffee ships and helping the Prosperity out of the cloud. Taegon apologized to the attendees and said that use of the new hyperdrive technology would be abandoned for the time being."}, {"tag": "h2", "text": "Appearances"}]}