{"url": "Cularin_resistance", "categories": ["Category:Legends articles", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Cularin resistance"}, {"tag": "p", "text": "The Cularin resistance was a group organized to resist the perceived threat of the Metatheran Cartel on Cularin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Velin Wir of the Metatheran Cartel announced the Cartel's plans to establish a trading and distribution center on Cularin, only to reveal shortly thereafter that such a center had already been built, it raised concerns among many Cularin citizens. Political activist Gerta Haman was concerned enough to gather a resistance to find proof of the Cartel's wrong-doing, and if necessary, fight to prevent the Cartel becoming too powerful and plundering the planet's resources."}, {"tag": "p", "text": "Gerta Haman turned to a previous supporter of her efforts, Kris Wahl, to be one of her financial backers, and she (or another friend of the Hiironi irstat acting on her behalf, perhaps Nim'Ri or Shayne Gerrare) approached Mother Dariana of the Hiironi for a suitable sanctuary to use as the resistance's base. Mother Dariana pointed her to the Cloud Mountain mines."}, {"tag": "p", "text": "So as to act outside of the view of the Cartel, the members of the resistance vanished quietly from the lives and made their way to the Cloud Mountain base. Somehow, the Metatheran Cartel got wind of this and tried to nab at least one resistance joiner, Shayne Gerrare, but other resistance members arrived and fought off the Cartel forces on Gerrare's front lawn."}, {"tag": "p", "text": "Though the battle went unnoticed, the disappearances of large numbers of people did not. Sensing a disturbance on Cularin, Master Lanius Qel-Bertuk of the Almas Academy sent E1-6RA to find a group of people to look into the disappearances for him. This group was able to find several mentions of Hiironi amongst the possessions of the missing people, and with Mother Dariana's help, they were able to locate the resistance in their base."}, {"tag": "p", "text": "By this time, the resistance had recordings of Cartel work forces cutting ch'hala trees—a violation of the Cularin Compact—and a credit trail indicating that the Cartel was behind a group of pirates that had been attacking local trading concerns in the previous months. The credit trail dried up just before reaching the Cartel, however, and the recordings could be accused of being doctored, so the resistance did not have anything actionable. They asked the group working for Lanius to reassure the Jedi Master that the missing people were fine without revealing their location or what they were doing. Gerta felt that the Jedi would want to negotiate, and that negotiations favored the Cartel, since that sort of thing was their specialty."}, {"tag": "p", "text": "The group did not reveal specifics to E1, and a month later, Gerta approached them for help in gathering some final evidence from the Cartel's Gadrin office. They did so, and even brought back an extra datapad which contained information on the bribes that Velin Wir had been giving to those in power. Though the information they brought back was helpful, two final files was needed that could only be gained in the Cartel's jungle base. Unfortunately, the extra datapad had a transmitter that led the Cartel to the resistance's base, and they sent a hit squad to attack the base. A number of resistance members died in the attack, and Gerta Haman would have been one of them if not for the quick actions of the allied group."}, {"tag": "p", "text": "The resistance carried through with the plans to attack the Cartel's jungle base to gain the information, led by Broof Yurdel and his Gungans, along with Nim'Ri and fifty other resistance members. Due to the Cartel's attack, however, the original plan to only use stun settings was forgotten by many of the resistance members. Broof did reset his weapon for stun shortly before the attack, because it was what Gerta would have wanted."}, {"tag": "p", "text": "While the main bulk of the resistance members battled with the Cartel's guards, the allied group went around the fighting to defeat Velin Wir and gain the needed piece of evidence from the base's computers. Soon afterward, the resistance forces prevailed, and led their Cartel prisoners from the base. Once the base had been emptied, turbolasers fired from a Cartel ship in orbit destroyed the jungle base."}, {"tag": "p", "text": "With the jungle base destroyed and the evidence gained, the Metatheran Cartel declared Velin Wir a rogue and tried to placate the people of Cularin. The members of the resistance returned to their lives, but a number of them, such as Broof Yurdel, joined the Cularin Militia when it formed."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The resistance was led by Gerta Haman, with Broof Yurdel and Nim'Ri as her senior advisors and co-leaders. It was an informal affair, with Gerta telling the strangers that she \"guessed\" she was the leader. Though Broof and Nim'Ri both worked in the security sector, Broof seemed to be in charge of the base's security and also led the resistance's forces on their one military expedition."}, {"tag": "p", "text": "The members of the resistance in the Cloud Mountain base numbered over two hundred people. Not all resistance members had left their lives. Some remained in their jobs to assist the resistance in other ways, though Gerta preferred not to use them and thus expose them to danger."}, {"tag": "h2", "text": "Logo"}, {"tag": "p", "text": "The colorful logo of the resistance was found painted on the Jax Warehouse the morning after its night shift disappeared. The center of the mural was a sun representing Morasil. Etched upon this sun was a distinct human-like eye. There were two brilliant blue-white stars for the planets Cularin and Almas as well as three scattered pale blue stars for the moons Dorumaa, Ulbasca, and Tilnes—the habitable bodies of the Cularin system. The mural was criss-crossed with red and white lines of varying thicknesses, corresponding to trade routes. Termadus was missing from the mural."}, {"tag": "p", "text": "This logo was loosely based on the Sunburst Mining logo, which could be found throughout the Cloud Mountain mines, in that Sunburst's logo also featured suns which seemed to have eyes in them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The resistance's logo is the source of the name for the Eye of the Sun trilogy. It is missing a bright star for Genarius, and Ulbasca was barely habitable and remained uninhabited, so seems a strange inclusion. Although the resistance's logo was more important to the story, Sunburst's company logo was the one included as a player handout in A Resistance Within."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}