{"url": "Cult_of_Darth_Phobos", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Sith cults", "Category:Unidentified organizations"], "nodes": [{"tag": "h1", "text": "Cult of Darth Phobos"}, {"tag": "p", "text": "After she was betrayed and nearly killed by her Sith brethren, the Theelin Sith Lord Darth Phobos organized a fanatical cult devoted to her. She employed the cultists to assassinate Jedi and Sith leaders, which led those two rival factions to join forces and kill Phobos. Phobos' cult existed for long afterward, but eventually disappeared as well."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A fanatical cult was created by the Sith Lord Darth Phobos many years prior to 2000 BBY. Darth Phobos was a manipulative being who murdered many of her Sith brethren in a bid for power. Her fellow Sith eventually turned against her and destroyed her starship while it was in low-orbit above the Sith burial-world of Korriban. The Sith believed that she was killed, but Phobos had survived the attempt on her life and went into hiding. She organized a cult devoted solely to her and worshipped her as a deity."}, {"tag": "p", "text": "Phobos then sent her agents across the galaxy to recruit more members and to assassinate both Jedi and Sith leaders. The latter faction eventually began to suspect that Phobos was still at large and began referring to her as \"The Hidden Fear.\" Recognizing the cult as a major threat to the galaxy, Jedi and Sith overcame their differences to join forces, and killed Phobos in battle. However, her cult continued to exist for years, disappearing only around the time of the Great Schism of 2000 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cult of Darth Phobos was mentioned in Darth Phobos' databank entry in the Krome Studios-developed PlayStation 2, Wii, and PlayStation Portable versions of the 2008 video game Star Wars: The Force Unleashed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}