{"url": "Cult_of_M%27dweshuu", "categories": ["Category:Legends articles", "Category:Nikto culture", "Category:Pre-Republic", "Category:Religions"], "nodes": [{"tag": "h1", "text": "Cult of M'dweshuu"}, {"tag": "p", "text": "The Cult of M'dweshuu was a brutal religious sect that originated on the Nikto homeworld of Kintan."}, {"tag": "p", "text": "The cult, which predated the Republic, worshiped the nearby star M'dweshuu, whose radiation caused a high Nikto mutation rate. Followers of the Cult sought to appease the star through blood sacrifices. As such, its followers were common among violent or dangerous professions. The Hutts put down the M'dweshuu Cult \"on numerous occasions\", but never quite succeeded in eradicating it. The Cult once ruled Kintan, which necessitated the planet's brutal annexation by the Hutts centuries before the Clone Wars."}, {"tag": "p", "text": "During the Great Sith War, the Cult briefly gained a resurgence as they attempted to kill Churabba the Hutt. Shortly before the Clone Wars commenced there was an outbreak of increased M'dweshuu Cult violence when adherents found their way off Kintan and plagued the Sisar Run area of the Periphery. As of 13:2:28, they had killed and ritually mutilated 27 travelers. At this point in time, the Cult was estimated to number less than 100 individuals. Dorosii the Hutt, Appointed Intermediate to the Galactic Senate, assured Republic officials that the Hutts did not require their intervention to resolve the situation. However the Jedi Council was reportedly looking into the matter."}, {"tag": "p", "text": "Jasper McKnives was an adherent of this cult."}, {"tag": "h2", "text": "Practices and beliefs"}, {"tag": "p", "text": "The Cult of M'dweshuu was considered bizarre by those who studied the records of it. Cultists performed blood sacrifices on those they deemed impure, hoping to appease the spirit of the M'dweshuu Nova."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "M'dweshuu was a volatile star located in the heart of the Si'Klaata Cluster in the Outer Rim Territories. Millions of years before even the rise of the Republic, the dying star hurled massive amounts of radiation emanating from its death throes, which reached the nearest star system, home to the nondescript, blue-green world of Kintan. After making its way into the planet's biosphere, the radiation wiped out most of Kintan's native inhabitants. Some species survived, but the radiation caused great mutations in them. During a sped-up process that lasted thousands of years instead of millions, giant, fearsome monsters, similar to the likes of the feared rancor of Dathomir, were formed. Creatures such as spine dragons, tuskbeasts, and horned trogwhales made the world a dangerous place. However, the radiation affected different species in different ways, and it caused certain diminutive, non-sentient reptilian quadrupeds to evolve into an intelligent, sentient species: the Nikto."}, {"tag": "p", "text": "Living in such a dangerous environment made the Nikto a hardened, warlike species, and after many technological advancements, they conquered the world, using atomic weapons to clear their homeworld of some of its more vicious predators, but turning it into a desert wasteland in the process. The Nikto's scientific advancement eventually led to the discovery of the M'dweshuu Nova, and the source of the creatures they had ruined their planet to annihilate. Word of the radiation and its effects on the planet spread quickly, and from it a death cult known as the Cult of M'dweshuu arose."}, {"tag": "h3", "text": "Reign"}, {"tag": "p", "text": "Details about the cult's founding were few and far between in later eras. Some Nikto began to worship M'dweshuu as a death god, and a religion sprouted from this, advocating living, sentient sacrifices to the deity. Its followers also believed in a doomsday prophecy related to the star. Later historians came to regard the cult as bizarre, and no-one was really sure of how and why it had come about. The cult grew in size and influence, beginning a reign of terror. Thousands of \"infidels\" were put to death—or \"purified\"—by the burgeoning cult; thousands joined the cult and embraced its beliefs; but most Nikto hid, waiting for the tyranny to end. The cultists established numerous strongholds on Kintan, as well as a main, though relatively small, headquarters in the planet's northern continent."}, {"tag": "p", "text": "Those that joined the cult in the interests of their own self-preservation spread the cult's beliefs to each and every corner of Kintan, until the cult took power over the world. Its followers were brutal and fanatic, fierce and unpredictable warriors; its subjects lived in fear. Even though the cult's members numbered less than its terrorized subjects, it had a firm stranglehold over Kintan's population and ruled comfortably for thirty years from its small, northern seat of power. However, while the cult's leaders believed their subjects to be loyal, the Nikto were in fact a disgruntled people, who hated the Cult of M'dweshuu."}, {"tag": "h3", "text": "Enter the Hutts"}, {"tag": "p", "text": "Three decades after taking power, however, the cult finally met a worthy adversary. The Hutt Empire, embroiled in a struggle against Xim the Despot, ruler of another interstellar empire, sent envoys into the Si'Klaata Cluster, looking to recruit warriors to aid in the struggle against Xim and his empire. Churabba was the Hutt envoy dispatched to the Kintan. During their time in the Si'Klaata Cluster, the Hutts had already recruited the Vodrans and Klatooinians to their cause, but the Nikto presented a far greater challenge, because they were more technologically advanced. Upon arriving in the Kintan system, the keen, business-minded Churabba realized that the cultists were feared by the Nikto population, and that they were a people ripe for a rebellion in which they were destined to be victorious. It was said that Churabba respected the cult, because it was few but ruled many."}, {"tag": "p", "text": "Churabba decided to simply bombard the cult's seat of power from orbit. She did so, without regret, destroying the stronghold and killing many cultists, while at the same time displaying the Hutts' might and the fallibility of the cult. Many Nikto regarded the Hutts as saviors, and all were grateful for Churabba's actions; thus, it took little persuading for them to sign the Treaty of Vontor in 25,100 BBY. The treaty bound the Nikto and two other species, the Vodrans and Klatooinians, to the Hutts as permanent slaves. This represented something of a coup for the Hutts, as the Nikto were far more technologically advanced than the Vodrans or Klatooinians, and Churabba feared it would take much bargaining or trickery to recruit them. Hordes of Nikto warriors fought against Xim's empire at the Third Battle of Vontor, helping the Hutts to defeat him. The pact between the Nikto and their Hutt masters stood unbreakable for centuries, and the cult was thought to be vanquished."}, {"tag": "h3", "text": "Resurgences and insurrections"}, {"tag": "p", "text": "However, the Hutts began taking much of Kintan's population to worlds such as Nal Hutta and giving the Nikto less and less say into their own affairs. The species began to resent their once-saviors and question the value the Hutts had brought to their lives, for millions had perished fighting the Hutts' wars and millions more had been forced to leave their homes for their masters. Around 4000 BBY, the Cult of M'dweshuu rose again. Looking at their history, the Nikto found that the cult was opposed to the Hutts, and saw it as their best way to achieve freedom. The entire population fully embraced the cult, unlike before, and the Cult of M'dweshuu quickly rose in popularity and power. Its members overthrew the minimal Hutt presence on Kintan, but the Hutts retaliated by sending in an army of mercenaries to brutally quell the uprising. The Republic was embroiled in a war of its own, so it did not come to the Nikto's assistance."}, {"tag": "p", "text": "The cult was destroyed, but it continued to return in different forms and start minor insurrections for centuries. The Hutts who ruled the Si'Klaata cluster consistently quashed the cult, only for it to rise once again. One thousand years before the Battle of Yavin, the cult once again gained planetwide prominence, and managed to drive the Hutts off Kintan for a second time. Again, though, the Hutts responded with force, regaining control after a series of bloody mercenary attacks that left almost a third of Kintan's population dead. After this, the Hutts totally liquidated the Nikto government, giving the Nikto zero say in the running of their homeworld. Minor uprisings and insurrections against the Hutts occurred almost every year, though these were disorganized and often unpopular, especially since offworld Nikto cared little about their homeworld. Each uprising was put down, either by the Hutts, the Jedi, or the Nikto themselves. The Hutts still saw an aura of danger around the species, though, and tried to keep them in check."}, {"tag": "h3", "text": "Separatist Crisis incarnation"}, {"tag": "p", "text": "The cult returned once more around the time of the Separatist Crisis. Numbering less than one hundred individuals, the cultists were based deep within the Endless Wastes, in a series of caverns, and were described as smart, merciless, and heavily armed. The cultists were mainly active offworld, along the Sisar Run on which Kintan was situated, where they embarked upon a bloody campaign of scattered violence against the myriad traders who utilized the route. The Nikto plagued and terrorized the Sisar Run for a time, killing over twenty-seven travelers by 22 BBY, piloting their own freighters in Nikto \"war packs.\" This outraged the Republic, and garnered much media attention; the Bureau of Ships and Services warned spacers who would be using the Sisar Run to use caution, and many local businesses and planetary government put bountys on any free Niktos—those not in the employ of the Hutt Empire—believing them to be potential cultists."}, {"tag": "p", "text": "The Hutts, via Appointed Intermediate to the Senate Dorosii, assured the Republic they could handle the cultists themselves, and hired mercenaries to scout the Nikto's suspected hideout. The Jedi High Council ignored the Hutts' assurance and dispatched Jedi Master Ma'kis'shaalas, himself a Nikto, and his Hiitian Padawan to Kintan, early in the Clone Wars. The Jedi and mercenaries then joined together to combat the cultists, eventually tracking a war pack from Kintan to Sriluur, where the cultists murdered a number of Republic-sanctioned Vaathkree traders. These attacks prompted the Republic to dispatch another task force to Sriluur; this force, along with Ma'kis and the Hutt mercenaries, tracked the cultists to the slick volcanic canyons of the world's deserts, defeating them. This further sparked the media interest in the M'dweshuu affair. The cult lived on, though, in some form, during the continuing Clone Wars. The mentally unstable Jasper McKnives was one of its followers during this time, fighting in gladiator tournaments on Rattatak out of fanatical devotion to the cult."}, {"tag": "h3", "text": "Manipulated by the Azure Cabal"}, {"tag": "p", "text": "At the time of the Galactic Civil War, a group of Nikto cultists had established a base of operations on the Mid Rim world Naboo. They had built a small stronghold inside a cave in the Nabooian wilderness."}, {"tag": "p", "text": "In 1 ABY the Azure Cabal mercenary organization used this group of cultists as pawns in their ongoing struggle with other mercenary groups. The Mon Calamari Cam'doen, a leading member of the Azure Cabal, considered the Nikto to be not very bright and easily manipulated. They would be quick to attack targets of his choice if given a nudge in the right direction. So Cam'doen ordered a member of his organization to break into a safe house of the rival Mistryl Shadow Guard on Naboo and steal some of their Emberlene essence. The mercenary then attacked the cultists' stronghold while masking his own scent with he stolen essence, leading the Nikto to believe that they had been attacked by the Mistryl."}, {"tag": "p", "text": "When the Mon'Shallok terrorist group tried unsuccessfully to slice the Azure Cabal's database, the Azure Cabal identified their data-trail. Cam'doen decided to manipulate the blood-cult once again into attacking the Azure Cabal's enemies. He sent his mercenary back to the M'dweshuui stronghold and had him kill several of the cult's overseers. The mercenary then sliced into the stronghold's power grid and deliberately botched the job, leaving the Mon'Shallok's data-trail behind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Cult of M'dweshuu was created by Pablo Hidalgo as part of Galaxy Guide 12: Aliens — Enemies and Allies in 1995. It was subsequently referenced by The Essential Guide to Alien Species, University of Sanbra Guide to Intelligent Life: The Nikto, Geonosis and the Outer Rim Worlds, several StarWars.com Databank entries, and The Complete Star Wars Encyclopedia, as well as Hidalgo's HoloNet News Vol. 531 45. The developers of the MMORPG Star Wars Galaxies added a dungeon of M'dweshuui cultists to the game as part of the Azure Cabal quest series in the Chapter 6 update in April 2007"}, {"tag": "p", "text": "There are several timeline and continuity errors surrounding the cult. Galaxy Guide 12 establishes that a major cult revolt occurred on Kintan in 4,000 BBY, culminating in the revolt being quelled by Hutt mercenaries, and the Hutts taking much power away from the Nikto. However, in University of Sanbra Guide to Intelligent Life: The Nikto and The Essential Guide to Alien Species, a revolt with the same description is mentioned as having taken place in 1,000 BBY. This may be an error, or could be considered a separate revolt."}, {"tag": "p", "text": "In The Complete Star Wars Encyclopedia, the 4,000 BBY revolt is said to be put down by Churabba the Hutt. However, Galaxy Guide 12 establishes that Churabba existed over twenty-thousand years earlier, and her actions against the cult were entirely separate from the revolt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}