{"url": "Cult_of_Lord_Nyax", "categories": ["Category:Legends articles", "Category:Corellian organizations", "Category:Religions", "Category:Terrorist and anarchist groups"], "nodes": [{"tag": "h1", "text": "Cult of Lord Nyax"}, {"tag": "p", "text": "The Cult of Lord Nyax, also known as Lord Nyax's Cult or as the Followers of Nyax, was a religion on Corellia that worshiped the mythological character Lord Nyax and made several terrorist attacks in his name."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Followers of Nyax worshiped Lord Nyax, an ancient Corellian ghost whose name was invoked to scare children. The Cult of Lord Nyax was a secretive and dreaded order. The Nyax cultists were dangerous fanatics who sought to terrorize the citizens of Corellia, following the example of Lord Nyax himself. While Lord Nyax was only a mythological character, the Cult nonetheless was led by a man who referred to himself as Lord Nyax."}, {"tag": "p", "text": "According to the Rebel Alliance and to former Followers of Nyax, the Cult was secretly backed by the Galactic Empire. Indeed, the Cult hated the Jedi and thus, when Darth Vader came to Corellia to destroy the Jedi residing their, terrified citizens gave the name of Nyax to Vader himself. The Cult picked up on this, and believed Vader was in fact inhabited by the ghost of Nyax. This led the Followers of Nyax to treat Vader somewhat reverentially, and look to him as an inspiration to slaughter additional Jedi throughout the galaxy. Despite these notions, and the rumors of Imperial backing, the Cult of Nyax did not particularly identify with the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Cult of Lord Nyax was formed years prior to the Galactic Civil War. As the Cult had grown in power, it emerged as a source of trouble for the Corellian Security Force. During numerous years, the Corsec had adopted a policy of containment rather than destruction. However, after the Battle of Yavin, the Cult of Nyax was in open conflict with CorSec and its mercenaries allies of Beldonna's League."}, {"tag": "p", "text": "During the time of the Galactic Civil War, the Cult of Lord Nyax operated out of a hideout in the Riverlands region of Corellia. After the Battle of Yavin, the Follower of Nyax Lock Vlash managed to escape the Cult. Vlash remained worried that some cultists could try to take revenge on him, especially after he tried to sell the location of the Lord Nyax's Cult hideout."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}