{"url": "Cult_of_Ki_Sazen", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Nikto culture", "Category:Religious organizations"], "nodes": [{"tag": "h1", "text": "Cult of Ki Sazen"}, {"tag": "p", "text": "The Nikto Cult of Ki Sazen worshiped the fallen Jedi Ki Sazen during the Galactic War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Cold War the Zabrak Jedi Ki Sazen slew the Spine dragon of M'dweshuu while on an assignment to Tas-La. This had profound consequences on her life, as a large group of Nikto considered themselves life debt bound to Sazen, forming a cult that worshiped her as a and followed her off-world when she asked them to fight for Galactic Republic and be paid in land and weapons in return. Sazen's Jedi Master urged her to release them from the life debt, but Sazen believed that she along with these Nikto followers were capable of greatness, calling the most promising of them Chosen. The cultists in turn recorded her words in the Chronicles of Ki Sazen holorecordings, which they honored as sacred."}, {"tag": "p", "text": "Coming to Taris, Sazen searched for Nasan Godera's Ultrawave Transmitter - a device that she hoped to use to control the rakghouls and made them into her army. She send Chosen Chevuk to search the laboratory of Doctor Dorant for rakghoul biological research, Chosen Bo'kesh to seek data on rakghoul colony movements and Chosen Fhentar to track down Ianna Cel. At this time an Imperial Agent Cipher Nine, posing as the Republic Strategic Information Service operative \"Legate\" encountered Sazen's cultists while searching for the Ultrawave Transmitter himself. Cipher Nine defeated Chosen Chevuk, who relayed the story of Sazen and found the Chronicles of Ki Sazen scattered among the ruins, piecing together the history of Sazen's fall."}, {"tag": "p", "text": "Eventually Cipher Nine infiltrated Sazen's hideout, where Sazen and Fhentar were defeated in combat. The Agent offered to spare Sazen's life if she went to Korriban academy and became a Sith, to which Sazen agreed. She took her Nikto with her, hoping to find a planet where they could be left in peace."}, {"tag": "h2", "text": "Appearances"}]}