{"url": "Cult_of_Veroleem", "categories": ["Category:Legends articles", "Category:Religions", "Category:Unknown Regions organizations"], "nodes": [{"tag": "h1", "text": "Cult of Veroleem"}, {"tag": "p", "text": "The Cult of Veroleem was a cult that ruled the planet Veroleem in the Unknown Regions. The world was first settled by a group of colonists that sought to live outside the jurisdiction of the Galactic Republic, and among the settlers was a Force Adept named Kryo Tinwole. After Tinwole discovered some Sith laboratories on Veroleem, he uncovered an elixir of immortality and used it to grant himself eternal life. He then used his Force powers to corrupt the rest of the colonists and warp their minds, and the settlers formed into a cult. The leaders of the settlers were then forged into the Council of Enlightened Elders, which became the cult's governing body. The cult tried to persuade off-worlders to come to Veroleem and join their ranks, and in addition, the cultists began to manufacture the narcotic kryotin, to addle the minds of new disciples and ensure that they remained subservient to the cults' high priests."}, {"tag": "p", "text": "During the time of the Jedi Civil War, the Republic's records of the colonization of Veroleem went missing and the planet was sold to a front company of the Exchange, which claimed that it wanted to mine Veroleem's lommite deposits. Not wanting to have off-worlders become involved in their affairs, the Council of Enlightened Elders took legal action and forced the Republic to remove the Exchange-backed concern from their world. However, the cult insisted that the company's mining equipment be left behind, and they used the machinery to grant themselves a new sources of revenue. The legal battle brought the Cult of Veroleem to the attention of the Jedi Order and over the next few decades, there were several conflicts between Jedi Knights and groups of cultists."}, {"tag": "p", "text": "Around the time of the formation of the Galactic Empire, the cult cut back on its recruitment efforts. Following the rise of Darth Krayt's Sith Empire, the cult re-initiated it's recruitment drive, taking advantage of the fact that Veroleem's location had long been forgotten by the wider galaxy."}, {"tag": "h2", "text": "Philosophies"}, {"tag": "p", "text": "The cult was a sham and it existed to lure victims to Veroleem, so that they could be sacrificed and their brain chemicals used in the immortality elixir that kept Veroleem's oldest residents alive. New converts that joined the cult were forced to sever all ties with their old lives and had to take on new names, and the new initiates were often taken to a temple that the cult operated in the Coreesh Mountains, on Veroleem."}, {"tag": "h2", "text": "Sources"}]}