{"url": "Currahee", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Currahee"}, {"tag": "p", "text": "Currahee was a female human sergeant in the Galactic Empire. During his time at Lothal's Academy for Young Imperials, Zare Leonis came into conflict with this lieutenant, who seemed determined to push him to his breaking point. Her harsh methods earned her the nickname \"Curry\" among some of the Academy cadets. Some also considered her a \"witch.\" Despite her harsh training methods, she was known to produce able and competent soldiers. On one occasion, she seconded Lieutenant Chiron's recommendation that Zare Leonis be transferred to the Arkanis Academy for officer training."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Orientation"}, {"tag": "p", "text": "The female human Currahee served the Galactic Empire as a sergeant. Five years before the Battle of Yavin, she and her superior Lieutenant Chiron transferred over summer from Marleyvane to the planet Lothal, where she became the local Imperial Academy's intake officer. Shortly after her transfer, the young Human Zare Leonis applied to join the academy, and Currahee interviewed him, telling the boy that he had good field-of-vision and reaction times, but was poor at selecting targets meaning his initiative needed to improve. Currahee showed little interest in Leonis when talking to him, although he was able to tell when she read that his sister had disappeared on her datapad. She then questions his motivation and plans for his time in the academy, asking if he would accept a position in the Imperial Army or Stormtrooper Corps. The intake officer then spoke with Leonis about his elder sister Dhara Leonis, specifically asking if he had dreamed about her. The elder Leonis had previously attended the academy, but disappeared during her time there, with the official Imperial line being that she had abandoned the Empire."}, {"tag": "p", "text": "In autumn that year, Currahee and Chiron led four squadrons of the Lothal academy's cadets on a training run through a steep terrain in the Easthills. During the run she ran up and down the column of runners barking orders, and when she heard the four of the members of Unit Aurek of LRC077 squadron talking she ordered the whole group to increase their pace to double time. When one cadet stopped running because he felt sick, Currahee began yelling at the squadrons more, telling them they could drop out of the academy at any time. After she caught Leonis smiling at a private thought, she began yelling at the cadet and questioning if he would desert like his sister. The following day, Currahee woke the cadets in their bunks, and began yelling at Pandak Symes, whose name she forgot. She then shouted at Oleg for smiling, before inspecting the cadets' footlockers and giving each member of Aurek Squad three demerits and half an hour to clean to possessions to an acceptable level."}, {"tag": "p", "text": "Currahee was not satisfied by Aurek, or any of the other squad's cleaning and made all of the cadets take another run up the Easthills, accompanied again by Currahee and Chiron. Symes struggled with the task, and when Leonis tried to aid his squadmate, Currahee shouted at him to stop, claiming teamwork was not part of the mission. For the final kilometer of the climb, the sergeant followed closely behind Symes, who was the slowest cadet, and constantly hounded him about dropping out of the academy. Later on while Currahee and Chiron ate dinner in the mess hall with the cadets, Currahee noticed Leonis slapped his squadmate Nazhros Oleg's fork out of his hand after Oleg tried to force Symes to give him his fruit bar. When Oleg got up and confronted Leonis, Currahee did not intervene, and let Chiron interrupt the situation, giving Oleg two demerits and taking Leonis to his office."}, {"tag": "p", "text": "Later in autumn, Currahee issued helmets and harnesses at dawn to each of the cadets in orientation, expecting them to know all of the equipment's functions by the following day. 3 days after the helmets were issued, the sergeant woke Unit Aurek and found their response tolerable, bringing them and the other squads to one of the academy's hangar bays, where Chiron waited with a Sentinel-class landing craft. The cadets boarded the shuttle, followed by the two Imperial officers who sealing the vehicle's hatch behind them. When the ship took off, several members of the all-female Unit Forn cheered, causing Currahee to tell them off. The sergeant then order Unit Aurek up and out of the vehicle, letting them know their rendezvous point was to the east before the cadets lept from the vehicle into water below."}, {"tag": "p", "text": "Currahee and Chiron then waited for all of the cadets at a second rendezvous point, which the students had to reach with assembled E-11 blaster rifles. When Leonis and Symes arrived at the point five minutes before the time limit, Currahee took each of their rifles and checked it by firing it into the pavement, finding both satisfactory. Once the time limit for reaching the rendezvous point expired, Chiron gathered around the successful cadets while Currahee took up position to intercept those who had failed once they arrived."}, {"tag": "h3", "text": "The Well and visit day"}, {"tag": "p", "text": "Later in autumn after the cadets' two weeks of orientation had finished, Currahee announced a room inspection just as Leonis finished speaking with his girlfriend Merei Spanjaf over their datapads. She returned eight minutes after the announcement and found Unit Aurek's equipment and bunks satisfactory."}, {"tag": "p", "text": "When the time came for the cadets to be introduced to the Well, a training facility in the academy, Currahee awoke the students with particularly loud yells, assembling them in the barracks and then bringing them to the academy's main hangar. At the hangar, Currahee and Chiron stood to attention and saluted as Commandant Cumberlayne Aresko and his assistant Myles Grint arrived. Aresko then inquired about the cadets that had dropped out during orientation, with Currahee and Chiron both providing reasons for why each student had left. Once he had his answers, the Commandant congratulated the cadets present, causing them to celebrate until Currahee ordered silence. Chiron and Currahee then rounded the cadets into a circle, after which the floor within the ring dropped to form the Well. Within the Well a pillar then formed, which the cadets attached their harnesses to before it extended further to the ceiling of the hangar. Having been carried up with the pillar, the cadets then had to race to the bottom of the Well."}, {"tag": "p", "text": "Currahee later interrupted the cadets as they sat down for a meal, and summoned them again to the hangar, where they were to undergo another exercise in the Well. This time, the Sergeant had the cadets climb up the pillar instead of down, in order to reach a holographic flag. A few days later, the Currahee gave orders to the cadets via the comms in their helmets while they worked in pairs to cross an assault course in the Easthills. When Oleg complained at having been paired up with a cadet from Besh Squad named Lomus, Currahee gave him to demerits via comm. She then gave orders for the pairs to use projectile launchers, warning them that should they miscalculate their shots they might hit the other pair in their squad. Leonis and squadmate Jai Kell as well as Oleg and Lomus all made their shots accurately, and the Sergeant congratulated the two pairs."}, {"tag": "p", "text": "When Visit Day came around, where the cadets families and friends were allowed to come see them, Currahee carried out a particularly thorough search, making Lomus redo the buttons on his tunic and half of Unit Dorn rebuff their boots. She then hustled them to the academy's amphitheater, where the cadets stood on either side of the stage and formed up under Currahee's supervision before marching on stage to the Imperial anthem. The Sergeant then joined Chiron, Grint, and Aresko on stage, as the Commandant gave a short speech. The cadets were then allowed to see their families and friends in the mess hall. When Leonis's girlfriend Merei Spanjaf gave him a kiss, Currahee barked her disapproval but then moved off to other parts of the room."}, {"tag": "p", "text": "Following Visit Day a group of transfer students arrived at the academy from other academies across Lothal to replace dropouts. Currahee reprimanded Dev Morgan, one of the new students twice during his first few days for not paying attention, and during a room inspection she found him slow to respond, screaming at him for not being fast enough. She then informed squad NRC-077 that they were spending the day with Aresko, who had approved them for field training after the winter break. The sergeant then warned the unit that if any of them made mistakes in front of the Commandant and made her look bad she would punish them with cleaning duties for the rest of term. The Sergeant handed over the squad to Grint, who led the cadets to the Well for a training exercise, but sent two members of Unit Besh back to Currahee as they were not considered capable enough. Currahee then waited with Unit Cresh and Unit Dorn while NRC-077 completed the training exercise set for them, with Morgan coming first place followed by Leonis and Kell. The three victors earned assignments at the Lothal Imperial Headquarters, and were given a few tasks before heading there, although Currahee assured them that they would be given more jobs once there and told them she expected them to make her proud."}, {"tag": "h3", "text": "The field exercise"}, {"tag": "p", "text": "Sergeant Currahee continued training cadets at the Academy as the Lothal insurgency escalated. Several members of the rebel cell known as the Spectres staged an attack on the Academy itself and rescued Dev and another Cadet from Unit Aurek named Jai Kell. Dev was actually a young rebel named Ezra Bridger, who had infiltrated the Academy to steal a decoder containing the location of a Kyber crystal shipment. Cadet Leonis assisted with the rebel escape but managed to maintain his cover by pretending to fire on the fleeing rebels. Leonis was awarded a commendation for defending the Academy. Unknown to Currahee and her fellow officers, Leonis was a rebel sympathizer who had infiltrated the Academy to find his sister Dhara."}, {"tag": "p", "text": "At some point after the attack, Sergeant Currahee and Lieutenant Chiron led the cadets of squad LRC077 on a routine ten kilometer predawn run. By this stage, the weaker cadets had been weeded out of the training program. Those that remained were physically and mentally tough and had gotten used to the Sergeant's frequent yelling, which they realized was just for show. During their run, the two officers and their cadets passed a new BlasTech weapons laboratory that was being built. While Chiron briefed the cadets about the new facility, Currahee reprimanded Leonis when she saw him tiring from the run."}, {"tag": "p", "text": "Shortly later, Sergeant Currahee and Lieutenant Chiron directed their cadets to a nearby field for a life-fire training exercise. This exercise was supervised by Captain Piers Roddance and involved the cadets securing high-value targets, which turned out to be decommissioned droids. Currahee intervened during a scuffle between Leonis and Oleg, a mean-spirited cadet who claimed that Leonis was a traitor. For fighting in front of the Captain, she punished the entire Unit Aurek by issuing each cadet with three demerits and forcing them to do an early predawn run at the hangar the following day."}, {"tag": "p", "text": "After sorting out Leonis and Oleg, Currahee briefed the entire squad and informed them that the coordinates for the exercise were loaded into their helmet's nav units. She then assigned Leonis as squad leader and warned Unit Aurek that she would \"Base Delta Zero\" them if they performed another \"screw-up.\" During the exercise, Unit Aurek was tasked with ferreting out three trainers, who were designated as the \"oppo force.\" Under Leonis' leadership, the squad succeeded in knocking out the trainers and securing the target, which turned out to be a decommissioned nanny droid. After securing their objectives, Unit Aurek contacted Sergeant Currahee, who ordered them to take their \"suspect\" into custody."}, {"tag": "h3", "text": "A promising cadet"}, {"tag": "p", "text": "Following the field exercise, Sergeant Currahee escorted the cadets to a briefing by Commandant Aresko, who announced that the cadets would be screened for further specialized training. Some would be assigned to the Stormtrooper corps while others would be evaluated for officer training. Later, Currahee intervened to investigate an \"incident\" in squad LRC077's barracks. Leonis had attacked Oleg, who had called his sister a deserter. Both cadets had suffered bruises. When the other cadets, who disliked Oleg, reported that the cadets had sustained their injuries by slipping from their bunks, Currahee decided not to take any disciplinary action. However, she warned the cadets that she would fully investigate any more accidents in the squad."}, {"tag": "p", "text": "Currahee was later present when the cadets departed the Academy for their winter break. Following the winter break, Sergeant Currahee and Lieutenant Chiron were present in the Academy's main hangar when Captain Roddance announced that the cadets would be assisting Governor Arihnda Pryce's crackdown by taking part in law enforcement operations in Capital City. She and Lieutenant Chiron assigned different pairs of cadets to a grid of city blocks to investigate illegal activities. Later, she seconded Chiron's recommendation that Leonis be transferred to the Arkanis Academy for officer training the following year. This transfer was approved by Commandant but was opposed by Captain Roddance, who disliked Leonis and had tried unsuccessfully to get him questioned by the Imperial Security Bureau."}, {"tag": "p", "text": "Later, Leonis took charge of an Imperial raid on a smuggling den after his fellow Cadet Oleg attempted to shield his uncles from prosecution. As a result, Leonis' standing rose at the Academy while Oleg was expelled for associating with criminals. A higher Imperial authority, the Grand Inquisitor, then took an interest in Leonis' case and sped up his Arkanis transfer to a matter of days. Sergeant Currahee woke Leonis to inform him of the \"good news\" and escorted him to Captain Roddance's office, where the Cadet was briefed by Roddance and the Grand Inquisitor."}, {"tag": "p", "text": "After Leonis' transfer had been finalized, Sergeant Currahee congratulated the young Cadet for his transfer, which she took as a reward for his loyalty to the Empire. She then informed Leonis that he had been upgraded to a class-three intel/courier clearance, which he needed on Arkanis. When Leonis asked Currahee what Arkanis was like, she admitted she had never been there. She then escorted Leonis to the security office, where an Imperial protocol droid handed him the class-three code cylinder. Showing her softer side, she warned him to take care of his cylinder since it was exceeding difficult to obtain a replacement form. Prior to departing, she winked a smile. Unknown to Currahee, the Grand Inquisitor had transferred Leonis to Arkanis for the purpose of investigating his links to the rebel known as Dev Morgan."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Currahee had small black eyes in a ruddy slab of a face with thin lips. Pale scars ran from her collar to hair, which was gray in color. Her form was squat and looked powerful, with a pair of meaty hands and short legs. During the run in the Easthills, Currahee's gray clothing was stained with sweat and her face was red from exertion, but she continued to run."}, {"tag": "p", "text": "When speaking to Leonis she steepled her fingers and placed them against her chin. Leonis got the impression from Currahee that she had never been curious about anything. When she welcomed Leonis to the Empire, she gave a thin smile which did not reach her eyes. During cadet orientation Currahee forgot Pandak Symes name and referred to him as Skyes, claiming she could call the cadets whatever she wanted when he tried to correct her. The sergeant had a history of training capable cadets, although her superior Chiron did not agree with her harsh methods of degrading her students. Although she hardly ever showed it, Currahee cared for the cadets under her responsibility. Seeing that Zare Leonis had potential to become an Imperial officer, she seconded Chiron's recommendation to transfer him to the Arkanis Academy the following Fall. When Leonis' transfer was accelerated by the Grand Inquisitor, she gave him one of her rare smiles."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Currahee wore an industrial gray Imperial uniform and used a datapad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Currahee was created by Jason Fry for the novel Servants of the Empire: Rebel in the Ranks which was released in 2015.\nHer name is an homage to the TV series Band of Brothers, being the name of the series' first episode. Currahee is also an actual mountain in Stephens County, Georgia, that paratroopers from Camp Toccoa had to run up and down. Fry described her as being \"straight out of central casting\" as \"the tough-as-nails drill instructor.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}