{"url": "Curved-hilt_lightsaber/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Lightsaber variations"], "nodes": [{"tag": "h1", "text": "Curved-hilt lightsaber"}, {"tag": "p", "text": "The curved-hilt lightsaber, also called a dueling lightsaber, was a standard lightsaber design that was often seen during the prime of Form II lightsaber combat, both among the Jedi and Sith Orders."}, {"tag": "p", "text": "The degree of the curve at the top of the hilt in relation to the hand holds was the important factor. The curve at the bottom of the hilt (if present) only affected electronics and power core placement. The bottom curvature on many lightsabers was mostly ornamental."}, {"tag": "h2", "text": "History and use"}, {"tag": "p", "text": "The use of curved hilts allowed for more precise movements as well as near-perfect flexibility when engaged in lightsaber-to-lightsaber combat. It was also more complex and gave the creator of such a hilt more of a challenge in aligning its crystals, as well as requiring a minor variation in holding the grip. Curved hilts needed to be held more in the palm, farther away from the fingertips. The hilt's curvature also gave the wielder more power when delivering overhand strikes and would change the angle of the attacks by the merest fraction of a degree; this was usually just enough to confuse and disorient an unsuspecting opponent, as evident when Valenthyne Farfalla fought and lost to Darth Bane in the Duel on Tython, and again when Anakin Skywalker and Obi-Wan Kenobi quickly lost to Darth Tyranus in their duel on Geonosis."}, {"tag": "p", "text": "Some techniques were more difficult when using a curved hilt, but many others became far more effective. This hilt design was not limited to Form II; its advantages in dueling carried over to every form including Form V, as in the case of Darth Bane, when Sith Blademaster Kas'im gave him the weapon of his late master. Anakin Skywalker was another duelist who used a curved hilt with Form V to great effect: during his first duel against Asajj Ventress, after being disarmed, he stole one of Ventress' lightsabers and defeated her with it, despite having no training with the weapon."}, {"tag": "p", "text": "Unfortunately, curved-hilt lightsabers were generally more difficult to use in blaster-bolt deflection. This, coupled with Form II's weakness in this area, made a Makashi user wielding a curved hilt particularly vulnerable to blasterfire. However, Darth Bane had been able to compensate for such weaknesses, parrying blaster bolts fired by six Sith mercenaries on Ruusan and members of the Skelda clan on Onderon, the latter occasion in which he was mounting a Drexl. Likewise, Darth Tyranus deflected shots from members of the Pyke Syndicate on Oba Diah, using just one hand. His former pupils, Komari Vosa and Asajj Ventress, had no trouble in redirecting blaster bolts back at their opponents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars Galaxies, players of the Jedi class could find a lightsaber hilt called the \"Old Republic Hilt\" on Mustafar, indicating that the curved hilt was a possibly common design during the days of the Old Republic. This hilt is one of the more powerful lightsaber hilts in the game, and it resembles a curved-hilt saber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}