{"url": "Customs_Enforcement_Division", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Coruscant Security Force divisions and units"], "nodes": [{"tag": "h1", "text": "Customs Enforcement Division"}, {"tag": "p", "text": "The Customs Enforcement Division was a branch of the Coruscant Security Force charged with customs enforcement on the planet Coruscant during the Cold War era. CSF police officers were assigned as spaceport guards and as customs enforcement agents, in which case they were assisted by customs droids."}, {"tag": "p", "text": "A hostage situation at Diplomatic Spaceport 27-B ensued when a smuggler named Teff'ith took a CSF Customs guard hostage and demanded to speak with Jedi Grand Master Satele Shan. The guard's partner called for backup, and over twenty CSF officers responded to the scene. The hostage situation was resolved when Grand Master Shan arrived and Teff'ith surrendered."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Customs Enforcement Division was a section of the Coruscant Security Force charged with customs enforcement duties on the planet Coruscant. The division stationed police officers as spaceport guards and as customs agents at checkpoints. Customs droids were also utilized at checkpoints to assist the division in identifying new arrivals, verifying their identification, and inspecting their ship manifests."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 3643 BBY, during the Cold War between the Galactic Republic and the Sith Empire, the Customs Enforcement Division stopped the smuggler known as Voidhound at the Coruscant Spaceport. The on-duty Customs Droid noticed an error in the smuggler's identification protocols and cargo logs. When the droid was about to request assistance from a customs enforcement agent, the smuggler uploaded false data that convinced the droid that the smuggler was really named Admiral Numinn. With this information, the customs droid approved the smuggler's entry into Coruscant."}, {"tag": "p", "text": "In 3640 BBY, Republic Strategic Information Service Agent Theron Shan sent the smuggler Teff'ith to Coruscant to give vital information about his mission there to Supreme Commander Jace Malcom and Jedi Grand Master Satele Shan. As she entered Coruscant's airspace, Teff'ith was contacted by Coruscant Flight Control 473, which directed her to land at Diplomatic Spaceport 27-B. Upon her arrival at the spaceport, Teff'ith was checked and searched by CSF guards. To them, the shoulder wound that Teff'ith had sustained before leaving for Coruscant and her not being a Jedi did not match with the fact that she had been flying a Jedi craft. Teff'ith continued to insist that she wanted to speak with Grand Master Shan, but the guards simply took her into the spaceport office."}, {"tag": "p", "text": "In frustration, Teff'ith grabbed the blaster pistol sidearm of one of the guards. His partner ordered her to drop the weapon and release her hostage, but she refused. Instead, she demanded he exit the spaceport office. At first hesitant, the guard complied when his hostage-held partner insisted he do so. Teff'ith then barricaded herself inside the office with the remaining guard. She insisted he contact Shan, which he set about attempting to do. Meanwhile, his partner had called for backup, and within five minutes over twenty CSF officers had responded to the scene, constructing a cordon around the office. The guard inside was able to contact Shan, who agreed to come to the spaceport. When the Grand Master arrived, Teff'ith surrendered and informed her of the vital information."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Customs Enforcement Division appears in Star Wars: The Old Republic, a massively multiplayer online roleplaying game (MMORPG) by BioWare released on December 20, 2011, as part of the missions to Coruscant. The division later appeared in the novel The Old Republic: Annihilation, which was written by Drew Karpyshyn and published on November 13, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}