{"url": "Cut_content_from_Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords", "categories": ["Category:Real-world articles", "Category:Cut content from Star Wars: Knights of the Old Republic II: The Sith Lords", "Category:Pages needing citation"], "nodes": [{"tag": "h1", "text": "Cut content from Star Wars: Knights of the Old Republic II: The Sith Lords"}, {"tag": "p", "text": "Cut content from Star Wars: Knights of the Old Republic II: The Sith Lords refers to content which was originally intended to appear in the video game Star Wars: Knights of the Old Republic II: The Sith Lords but was not included in the game, or content which can be found in the game files but was not incorporated into the game. There has been some controversy regarding this content. LucasArts pressured developer Obsidian Entertainment to finish the game for a 2004 holiday release, leading many to speculate that the development had been rushed. The game contains a sizable number of bugs, which occasionally cripple game play. Also, some of the content from the game proper appears to be missing; however, much of it can be found inside the game files."}, {"tag": "p", "text": "The originally planned ending would have provided in-game fates - and in many cases, deaths - for all of the characters who travel with the main player character. In-game, the game ends with Darth Traya revealing the party member's futures. By explaining their futures, instead of showing the events leading up to those futures, it leaves just what happened to the designers of the unreleased KOTOR III."}, {"tag": "p", "text": "In a gesture to the game's fans, Obsidian Entertainment provided the PC version of the game with many resources meant to be used for the original ending (such as screen plays, voice-acting, etc.), which was abbreviated because of pressure from LucasArts to release the game in time for the Christmas season. Obsidian Entertainment also petitioned to LucasArts themselves for a Content Patch which would restore the content, though LucasArts denied the request."}, {"tag": "p", "text": "They were extracted and arranged by two users of the Forum Community known as \"HighPriest\" and \"Aurora\" to produce The Sith Lords Restoration Project. While the files do not resolve everything, they do clarify what would have happened to many of the members of your party, and elucidate many in-game events."}, {"tag": "h3", "text": "Known Cut Content"}, {"tag": "h4", "text": "Ebon Hawk"}, {"tag": "h4", "text": "Peragus II"}, {"tag": "h4", "text": "Telos IV"}, {"tag": "h4", "text": "Dantooine"}, {"tag": "h4", "text": "Nar Shaddaa"}, {"tag": "h4", "text": "Dxun"}, {"tag": "h4", "text": "Onderon"}, {"tag": "h4", "text": "Korriban"}, {"tag": "h4", "text": "Ravager"}, {"tag": "h4", "text": "M4-78"}, {"tag": "h4", "text": "Malachor V"}, {"tag": "h4", "text": "Miscellaneous"}, {"tag": "h4", "text": "Items"}, {"tag": "h3", "text": "Modding projects"}, {"tag": "p", "text": "A team of modders from the KOTOR and KOTOR II modding community using tools from Holowan Laboratories started a project to restore the appropriate missing content and release it as a mod."}, {"tag": "p", "text": "The main restoration mod was called \"The Sith Lords Restoration Project\" and was in development by Team Gizka. It would have restored almost all of the cut content (apart from M4-78). However, in early 2010 Team Gizka dissolved. No one knows what happened but all work has stopped and all contact has been lost with the team. As of today there is only a half completed beta floating around torrent sites."}, {"tag": "p", "text": "Another team of modders (Team Exile) encouraged by the efforts of Team Gizka plotted out and considered restoring the majority of content TG is not touching. Their project was called \"The Sith Lords Restoration Project II: The Un-Restored Content.\" However, after problems concerning the team's leader Darth Balor - including accusations of plagiarism, the team disbanded."}, {"tag": "p", "text": "Several months after the trouble with Darth Balor, the project was picked up by a user called Pikmin and the name was changed to The Sith Lords Content Restoration. On February 28th 2009, Pikmin was exposed as being Darth Balor."}, {"tag": "p", "text": "The cut planet M4-78 was restored by a modder called Darth Stoney, and was made public on The Knights of the Old Republic FileFront website. Later, a heavily expanded version of Darth Stoney's mod called M4-78 Enhancement Project was developed."}, {"tag": "p", "text": "Stoney also teamed up with Zbyl to create their own restored content mod called \"The Sith Lords Restored Content Mod\". It was completed as of March 14, 2010 and can be downloaded at Filefront. Version 1.7 was released 19th October 2010. So far it is the only large scale restoration mod to have been fully completed with regular updates being added.The final 1.8 patch, which restores all the content planed TSLRCM was released on the 25th of July, 2012. A version of the M4-78 mod called M4-78EP was released on December 28th and is compatible with TSLRCM 1.8.2."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}