{"url": "Cut_Lawquane/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Clone troopers", "Category:Farmers", "Category:Galactic Republic defectors"], "nodes": [{"tag": "h1", "text": "Cut Lawquane"}, {"tag": "p", "text": "Cut Lawquane was a clone trooper who served in the Galactic Republic's Grand Army. Following the Battle of Geonosis, which sparked the Clone Wars, Lawquane's clone trooper transport was attacked by two Confederate gunships. The gunships fired on the clone transport, which caused it to crash. While most of his team had been injured or killed in the crash, Lawquane deserted the squad, escaping death. After leaving the Grand Army and the war, the former clone trooper met and married a female Twi'lek named Suu. Lawquane became the adoptive father of Suu's two children: a girl named Shaeeah and a boy named Jek. As Lawquane wanted to avoid being detected by the Republic, the family lived on a farm on the planet Saleucami."}, {"tag": "p", "text": "However, the war eventually came to Saleucami, when Republic troops were hunting the Confederate General Grievous. While Lawquane was away from the farm delivering his first harvest, the homestead was visited by a squad of clone troopers looking for refuge for their wounded captain, Rex. After returning to the homestead that night, Lawquane invited Rex to join his family inside their homestead. Soon afterward, Shaeeah accidentally activated a series of BX-series droid commandos, who were inside an abandoned escape pod in the farm's nearby field. Lawquane and Rex defeated the droids, and Rex departed Lawquane's farm the next day. Before he left the farm, the clone captain told the former clone trooper that he was not going to turn him in for deserting, allowing Lawquane to live in peace with his family."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Soldier of the Republic"}, {"tag": "p", "text": "Cut Lawquane was the name of a clone trooper who served in the Grand Army of the Republic. Like all clone troopers who were born on the planet Kamino, Lawquane was a clone of the Mandalorian bounty hunter Jango Fett. In 22 BBY, following the Battle of Geonosis, the first battle of the Clone Wars, Lawquane and a team of clone troopers were on board a transport. Their transport, however, was soon attacked by two Confederate gunships. The gunships loosed all their ordnance into the clone transport, which caused it to crash. Most of Lawquane's team was injured or killed in the crash, and the Separatists that were in the two gunships landed and began to search through the wounded and dead. Before the Separatists found Lawquane, the clone trooper ran from the area, knowing that there was no chance of survival if he remained with his comrades."}, {"tag": "h3", "text": "Desertion"}, {"tag": "p", "text": "Following the crash, the Grand Army of the Republic listed Lawquane as killed or missing in action. However, Lawquane had in fact taken the opportunity to slip away to a quieter life. He met and fell in love with a female Twi'lek named Suu. The two married, and Lawquane became the adoptive father of Suu's two children: a daughter named Shaeeah and a son named Jek. Suu and her children took Cut's surname."}, {"tag": "p", "text": "After he deserted the Republic's Grand Army, Lawquane maintained a life with his new family on the planet Saleucami, where the former clone trooper came to repair and claim a farm. Sometime around 21 BBY, Lawquane left the farm to deliver the family's first harvest. Although Lawquane wanted to avoid being detected by the Republic, the war came to Saleucami when Republic troops were hunting the Confederacy's General Grievous. Following an orbital battle, Grievous and his troops landed on the planet's surface in separate escape pods. One of the pods crashed onto Lawquane's farmland."}, {"tag": "h3", "text": "Encounter with Rex"}, {"tag": "p", "text": "When a group of clone troopers arrived at Lawquane's farm, they were greeted by Suu. She allowed the clones to use the family's barn as shelter for their Captain, CT-7567, nicknamed \"Rex,\" who had been injured when a commando droid shot him with a sniper rifle. Lawquane returned later that night from delivering the harvest to find Rex in his barn. The former clone trooper armed himself with a staff and approached Rex, who was apparently unconscious on a flatbed. When the clone captain awoke and attempted to fire his hand blaster at Lawquane, the former clone trooper disarmed him, pointing the staff warily at Rex's neck. After Lawquane began to question why Rex was in his barn, Rex, having noticed Lawquane's appearance, identified him as a clone. The captain deemed Lawquane a deserter of the Republic and demanded to know his name and number. Lawquane began to debate with Rex, before Suu, Shaeeah, and Jek entered the barn to greet Lawquane. Suu explained to her husband why Rex was in their barn and said he would be staying for the night, which Lawquane happily agreed upon. Lawquane extended to Rex an offer to eat with his family, which the clone captain accepted."}, {"tag": "p", "text": "Over a meal of roast Nuna, Lawquane began to discuss the principles of what made a good clone trooper with Rex. Rex stood by his beliefs of turning in a deserter of the Grand Army. While Suu and the children remained silent through the meal, the two clones continued to exchange words to one and another. After their meal, Lawquane and Rex began to play a game of dejarik, and started to discuss why Lawquane left the army. The former clone trooper told him the story of his transport crashing after it was shot down by the two Confederate gunships, as well as the life-changing choice he made. Immediately after, Lawquane revealed that while he knew that Rex believed he was a coward, the former clone trooper told the clone captain that he was not. He loved his children and would fight to his last breath to keep them safe from harm. Soon, Shaeeah approached her father and asked if she could play outside with her brother. Lawquane agreed, and the two children went outside and began to play in the field. After finding an abandoned escape pod, Shaeeah accidentally activated the pod, which also awakened a platoon of commando droids. The two children ran from the droids, alerting Lawquane, Suu, and Rex."}, {"tag": "p", "text": "After Lawquane used his macrobinoculars to identify the droids, he told Suu and the children to hide in the upper floors of their homestead. The former clone trooper maintained a hidden stash of weaponry inside his home and gave Rex a hand blaster. Lawquane began arming himself with a blaster rifle and a carbine. However, when Rex started suggesting their attack strategy, Lawquane ordered the captain to protect his wife and children, as he would be their last line of defense if something happened to Lawquane. After Rex agreed and departed to the upper floors, Lawquane locked the doors leading into the home and turned off the lights. The droids, however, breached the house after blasting through a door. Utilizing his weapons, as well as recalling his former clone trooper training, Lawquane managed to shoot down many of the droids, but the firefight caused damage to the house. A support beam collapsed onto a table, which caused Lawquane to lose his balance and be lodged under the table. The droids walked past the trapped Lawquane and made their way to the upper floor of the house."}, {"tag": "p", "text": "After being warned by Lawquane of the danger, the clone captain fired at the droids, before the floor beneath him collapsed to the main floor of the house. Lawquane freed himself from the table and joined Rex in the ongoing fight. The droids were soon defeated, and Suu, Shaeeah, and Jek reunited with Lawquane. The following day, Rex began to pack his belongings on an eopie. Lawquane told Rex that he was welcome to stay with his family, although the clone captain declined, saying that his family was elsewhere. Before departing the farm, Rex warmly told the family that he was not going to turn Lawquane in, which allowed the former clone trooper to live in peace with his family."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Lawquane's adopted children survived to adulthood. His story came to the attention of the greater galaxy during the New Republic era with Shaeeah Lawquane's publication of her memoir of her childhood on Saleucami, entitled My Stepfather's Face: A Soldier's Secret."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cut Lawquane could not find his place within the Clone Wars and had a difficult time accepting the fact that he was trained to kill for a living. Memories of the life-changing situation on Geonosis, as well as his squad crashing, haunted him. Lawquane called himself a simple farmer living his own individual life. While Rex deemed Lawquane a deserter of the Republic, Lawquane simply believed he was exercising his right to choose not to kill for a living. Lawquane believed that clones were individuals; distinguishing themselves by having a name would make them unique. Lawquane did not support Rex's comment when the clone captain told him he had sworn an oath to fight for the Republic; instead, he stood by his beliefs. A skilled fighter, Lawquane used various combat tactics to fight off the invading commando droids, and even used his old clone trooper training. He loved his adopted children and would do anything he could to keep them safe from harm. The former clone trooper was also a caring man, as he never turned away from those in need. Lawquane believed in the saying, \"To each, his own,\" meaning that an individual could do anything with their life."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cut Lawquane was first briefly mentioned in the Star Wars Insider 114 article, Bringing Back the Bounty!. He would later make his debut in \"The Deserter,\" the tenth episode in the second season of the Star Wars: The Clone Wars television series, which aired on January 1, 2010. Like all clones in the show, Lawquane was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}