{"url": "Cut_and_Run", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:The Bad Batch episodes"], "nodes": [{"tag": "h1", "text": "Cut and Run"}, {"tag": "p", "text": "\"Cut and Run\" is the second episode of the animated web-television series Star Wars: The Bad Batch. The episode premiered on May 7, 2021, on Disney+."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Bad Batch visit an old contact."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Landing on Saleucami"}, {"tag": "p", "text": "As the Havoc Marauder travels through hyperspace, Hunter exits the cockpit to find Echo watching over a sleeping Omega and Wrecker. Echo says that Omega tired herself out from exploring the ship. He asks what they are going to do with a child. From the cockpit, Tech informs them that they are approaching the planet Saleucami. The Havoc Marauder descends into the planet's atmosphere, scattering a nexu that was hunting several nuna birds. The ship lands on the dusty terrain."}, {"tag": "p", "text": "The Bad Batch descend down the gangplank followed by Omega, whose eyes are initially struck by the bright sunshine. Having experienced sunshine for the first time, Omega is initially hesitant but exits the ship, breathing in the planet's fresh air. Omega also samples some dirt with her fingers for the first time, which she finds amazing. A cheerful Omega skips her way to Hunter. After hearing thunder rumbling in the background, the clones walk through a forest of Towering Bith."}, {"tag": "p", "text": "Later, they walk through a field of plants with bulbous fruits. Omega admires the natural scenery and chases a carrier butterfly. Meanwhile, Echo asks Tech about his friend who is hiding on Saleucami. Hunter adds that staying off the radar is not their specialty, but that this friend has been doing it for years as a deserter. Echo asks if they trust a deserter, prompting Tech to respond that they are all deserters now. Hunter holds up a fist, motioning for the clones to stop. He pulls Omega back from stepping on a tripwire."}, {"tag": "p", "text": "The boisterous Wrecker is not intimidated and springs the trap, which brings up several repurposed B1-series battle droids. Before Wrecker can exchange fire, Hunter tells him to stand down. They are soon confronted by the Twi'lek Suu Lawquane and her clone husband Cut Lawquane. Suu and Cut recognize the clones and invite them into their home."}, {"tag": "h3", "text": "Guests of the Lawquanes"}, {"tag": "p", "text": "At Cut Lawquane's farmstead, Hunter introduces Echo and Omega to Cut and Suu, who welcome the guests. When Cut asks where Crosshair is, Hunter replies that the situation is complicated. Cut says that it is similar to what Rex told him about the clone troopers turning against the Jedi. When Echo asks about Rex, he informs them that a mutual friend of theirs, Captain Rex, stopped by only a day before to warn him about the arriving Imperial presence, and explains that he told them about the inhibitor chips that caused the clone army to kill all of the Jedi."}, {"tag": "p", "text": "Omega explains that the Kaminoans implanted inhibitor chips in the clones to modify their behaviour. Hunter recalls that Tech said that the regulars were programmed to never mention their chips. Tech comments that this was why Order 66 worked so well."}, {"tag": "p", "text": "Shortly later, Cut and Suu's children Shaeeah and Jek Lawquane enter the hunt, telling their parents there is a ship outside. Wrecker is delighted to see the two children and lifts up Shaeeah. The two children taken an interest in Omega since they rarely see other children. With Hunter's approval, Omega walks out with Shaeeah and Jek."}, {"tag": "p", "text": "Outside in the playground, Omega watches Shaeeah and Jek playing a ball game. Bemused, she asks Shaeeah what the purpose of the game is. Shaeeah replies that it is to have fun and passes the ball to her. Unfamiliar with the game, Omega dodges it. Jek then explains that she is supposed to catch it."}, {"tag": "p", "text": "Inside the hut, Cut asks Hunter about Omega. Hunter explains that the child is a defective clone like they are. Cut replies not exactly, explaining that the Kaminoans do not create without purpose. When he asks Omega's purpose, Hunter says that it doesn't matter because she is a kid. Cut remarks that battling droids was easy compared to raising a child and tells Hunter that he has no idea what he is getting into. Hunter says they had no choice since Kamino is no longer safe."}, {"tag": "p", "text": "Cut says neither is Saleucami and says that Rex has warned them of the coming storm. He says that clone troopers have started to show up. Hunter tells Cut that he plans to travel to a nearby spaceport to book them offworld transport and invites Cut along. Cut says that Hunter is a wanted man and that it is too risky. Cut says he has to do what is best for the children. Hunter watches with a smile as Omega plays ball with the Lawquane children."}, {"tag": "h3", "text": "The Imperial occupation"}, {"tag": "p", "text": "Later that day, Cut leads Hunter to the nearby town, ducking his head as they pass by a clone trooper patrol. Hunter thinks that the troops should be pulling their forces rather than securing a post since the Clone Wars are over. Cut replies that it doesn't feel that way as they enter the town. The two watch a larger ship carrying a confiscated ship within a forcefield."}, {"tag": "p", "text": "Cut explains that the Imperials started confiscating all ships a week ago. He explains that they are tagging them inside an impound lot. Cut leads Hunter to the stall up ahead. Cut plans to book his family passage offworld so that they can start a new life on a distant planet. Hunter adds that is the key to not being found. Cut advises Hunter that the best way to disappear is to put his life as a soldier behind."}, {"tag": "p", "text": "Just then, they are greeted by an Aleena merchant who asks them what they want. Cut says he wants to book passage offworld. The Aleena responds that he needs to have a chain code to travel offworld legally, per a new galactic policy. Cut is surprised by the new announcement. A holoprojector plays the broadcast with Vice Admiral Rampart announcing that all citizens can exchange their invalid currency for Imperial credits. He adds that the war is over. He promises that peace will bring opportunity and prosperity for all."}, {"tag": "p", "text": "A frustrated Snivvian traveler, who had booked passage offworld, argues with a pair of clone troopers. One of the clones says he cannot travel without a chain code. The Snivvian insists that he has to get on the ship but is rebuffed. The clone trooper tells him to get a chain code and not to make any trouble. Watching the confrontation, Hunter realizes that the Empire is not only registering ships, but people. Cut sighs and says that getting off the planet is going to be harder than he thought."}, {"tag": "h3", "text": "Encounter with the nexu"}, {"tag": "p", "text": "While playing a ball game with the Lawquane children, Omega throws the ball past the fence. She wants to retrieve it but Jek says that they should do it later. When Jek is distracted by Shaeeah, Omega takes the opportunity to sneak through the barbed wire. Shaeeah tells her brother Jek that they need to start packing. Jek protests that it is too early but his sister reassert her authority. They soon realize that Omega is missing."}, {"tag": "p", "text": "Omega retrieves the ball, which has fallen outside the fenced field of bulb-like plants. Shaeeah calls out to her, warning Omega not to move. A nexu converges on Omega from a nearby clearing. Inside the hut, Tech informs the others that all public transport is now restricted without a chain code. Suu warns that Cut can't sign up for one because the Imperial authorities will discover that he is a deserter. Cut says that the next shuttle leaves in a few hours and that they have to get offworld regardless of whether they have a code or not."}, {"tag": "p", "text": "Shaeeah comes in and warns the adults that Omega went outside the perimeter. While the other clones go outside, Suu climbs up the roof with a slugthrower rifle. A terrified Omega watches as the snarling nexu converges upon her. As Omega turns to run, the nexu leaps at her. Suu shoots at the creature, wounding it. Hunter swipes at the nexu with a knife. Suu manages to drive the creature away with a second shot."}, {"tag": "p", "text": "After returning to the farm, Hunter asks Omega what she was doing outside the fence, raising his voice and saying that she could have been killed. Cut tells Hunter to go easy on her, reminding him that she is not a soldier. Cut bends down and checks if Omega has been hurt. Omega, somewhat traumatized, apologizes that she was trying to get the ball. Cut gives her a comforting hug and reassures her that she is safe. He carries her inside."}, {"tag": "p", "text": "Wrecker asks if Omega is alright. Cut says that she will be fine. Tech points out that it could have been worse. Hunter then asks if Tech could create some false chain codes for the Lawquanes to travel offworld. Tech says that he only learned of them a moment ago but agrees to give it a try. Hunter is determined to get Cut, Suu and their kids on the next shuttle offworld. Later, a chastened Omega sits in the rear gunner's seat on the Havoc Marauder, watching the sunset. She removes the amulet from her head and holds it in her hands for a moment, shedding a tear."}, {"tag": "p", "text": "Meanwhile, Suu walks out of the house to find Hunter watching a forest of towering Bith. Suu asks if he needs another set of eyes outside. Hunter praises her marksmanship and says that he owes her one. Suu explains that children will always find a way of getting into trouble. She adds that protecting them is what they do as parents."}, {"tag": "p", "text": "When Hunter asks where Omega is, Cut says that she wanted to stay on the ship. Hunter says that he has been reflecting on what Cut said and agrees that she is not a soldier. Cut suggests giving her some time. Hunter tells Cut and Suu that he wants them to bring Omega with them when they leave Saleucami. He believes that they can provide her with something that they can't. Suu asks if that is what he really wants. Hunter replies that is what she really needs."}, {"tag": "h3", "text": "A risky plan"}, {"tag": "p", "text": "Aboard the Havoc Marauder, Echo comments on the irony of clones wanting names rather than numbers. He remarks that people are now signing up to be given numbers. Tech says that it is ingenious that someone could create a database to identify anyone in the galaxy. Echo asks where they are going to find the data for the chain codes and the disks."}, {"tag": "p", "text": "Tech says he has already thought of that. Since the clone troopers control the spaceport, they can tap into their network and replicate the codes. Since the Imperials are tagging ships inside that compound, he believes that is their way inside. Echo asks Tech if his plan is to call the Imperial authorities and get them to impound their ship. Tech assents. Echo opines it is risky but that it might work. Omega listens from the gunner's seat."}, {"tag": "p", "text": "On the ground, Hunter learns the news via comlink and watches an impound ship dragging away the Havoc Marauder. Tech tries to explain but Hunter disagrees with the idea of getting their ship impounded. Tech replies that he will meet the rest of the clones at the spaceport with the chain codes. He promises that he has this under control and it will work. Hunter warns that Omega being on the ship may complicate their plans. As Tech and Echo turn in shock to look at the gunner's seat, Omega reveals herself and says she thinks their plan is good."}, {"tag": "h3", "text": "The chain code heist"}, {"tag": "p", "text": "At the spaceport's impound lot, a clone trooper with a tablet directs two others to the Havoc Marauder. He orders two clone troopers to clamp it down before running a signature test on it. While a clone trooper applies magnetic clamps, two other board the ship. One of them asks what kind of ship it is while the other says that it looks like a modified Omicron-class attack shuttle."}, {"tag": "p", "text": "The troopers opine that the ship is in a mess before leaving. Shortly later, Tech and Echo drop down in full armor from an overhead compartment. Tech carries Omega down. Omega asks how she can help but Echo thinks she has seen enough action for today. He thinks they can handle it. Tech sends Echo down to the security kiosk to copy the data and grab blank disks for him to program."}, {"tag": "p", "text": "Echo exits the Havoc Marauder, avoiding a clone trooper and an astromech droid. After a guard exits the security kiosk, Echo enters and seals the doors. He inserts his scomp link into the console. Echo can't find the disks but Tech tells him that they are in a safe in the corner of the kiosk. Echo finds the safe and obtains several disks and a programming device. He then sneaks out of the security kiosk without being detected."}, {"tag": "p", "text": "Meanwhile, Hunter approaches the spaceport with the Lawquanes. Contacting Tech by comlink, he informs him that they have reached the spaceport and asks about his status. Tech informs him that creation of the fake chain codes is in progress and that encryption should not be a problem."}, {"tag": "p", "text": "As Hunter and the others pass through the spaceport security, Jek is frightened by the presence of armed soldiers. His mother assures him that they will be alright. Hunter tells Tech to hurry up or they will have to blast their way out. Tech reassures Hunter that he can slip through security undetected and deliver the disks momentarily."}, {"tag": "p", "text": "Just then, Tech and Echo hear some comm chatter. Peering out the cockpit window, they see a column of clone troopers marching by. Tech says that they can't get caught with the chain codes. Echo disagrees with the idea of starting a blaster fight since the Imperials will then lockdown the spaceport. He soon discovers that Omega and the disks are missing. The two see Omega sneaking through the spaceport facilities with the disks. Echo starts to question Tech's plan."}, {"tag": "p", "text": "Hunter and the Lawquanes join the queue. A clone trooper reminds them to have their chain codes ready. Tech tells Hunter that Omega is going to pass them the chain codes. Hunter is fearful of Omega's safety. Suu responds that kids always find trouble. Wrecker runs off to find Omega."}, {"tag": "h3", "text": "Escape and firefight"}, {"tag": "p", "text": "Meanwhile, Echo attempts to disable the magnetic clamp but is spotted by a clone trooper. Echo tries to convince the trooper that he is a maintenance technician. Before the clone trooper can report him, Tech stuns him. As clone troopers converge on the impound lot Omega bumps into a rust R-series astromech droid who squeals in alarm. Wrecker knocks out the droid with a punch to its dome-shaped head. He helps Omega up. After promising to help Tech and Echo, Wrecker sends Omega to meet the others."}, {"tag": "p", "text": "After Omega climbs a barrier, Wrecker is confronted by three clone troopers who demand his chain code. After making a show of pretending to search for it, he knocks them unconscious by banging their helmets against each other. He is spotted by reinforcements and a gun battle ensues. While clone troopers are sent to quell the disturbance, Cut begins to worry but Hunter tells him to stick to the plan. While stormtroopers inspect and allow an alien porter to move along, Omega arrives with the chain codes. Shaeeah praises Omega."}, {"tag": "p", "text": "Omega notices that Tech made five chain codes instead of four. Cut is surprised that Hunter did not inform her of his plan. As Cut and his family move up with the rest of the queue, Hunter speaks with Omega and tells her that the extra chain code is for her so that she can leave with Cut and Suu."}, {"tag": "p", "text": "Omega is shocked and asked if she did something wrong. Hunter tells her that she needs a family and that the Lawquanes are good people who will give her the life she deserves. Omega responds that she wants to stay with Hunter and the Bad Batch. Hunter replies that she has to go, for her own good. Before leaving, she gives Hunter a sad, unyielding stare. Arriving at the security kiosk, Cut passes his family's chain codes through a tray to the clone trooper guarding it. Omega joins them. The clone trooper puts the chain codes through a scanner while the family waits anxiously."}, {"tag": "p", "text": "Back at the Havoc Marauder, the other members of the Bad Batch keep the clone troopers at bay while Echo works on deactivating the magnetic clamps. After a tense moment, the clone trooper manning the security kiosk approves the Lawquanes' chain codes and allows them to enter the spaceport. Inside the spaceport, a sad Omega looks back at Hunter. Hunter is also contacted by Tech, who informs him that they have outlasted their welcome. Suu touches Omega's shoulder and asks if she is ready. Omega looks up, unsure of what she should do."}, {"tag": "p", "text": "Inside the spaceport, Wrecker hurls a crate at several clone troopers. Hunter joins the fight, knocking down a clone trooper and commandeering a rifle. He shoots two more troopers before joining Wrecker and Tech behind a barricade. Echo informs Hunter that the magnetic clamp's system is not responding to his efforts."}, {"tag": "p", "text": "Wrecker runs to Echo and uses his brute strength to pull the magnetic clamp off. The Bad Batch board the Havoc Marauder. Wrecker asks where Omega is. Before someone can explain, they hear Omega telling them to wait for her. She runs towards them, but a clone trooper grabs her by the ankle and pins her down. Hunter shoots the clone trooper and a few more converging on them."}, {"tag": "p", "text": "As Cut boards the shuttle, a clone trooper appears to recognize him. Before he can question him, the trooper is called to leave his post since more reinforcements are needed at the impound dock where the Havoc Marauder is docked. The trooper allows a relieved Cut to join his family aboard the shuttle, which then lifts off."}, {"tag": "p", "text": "Back at the impound dock, Omega runs up the gangplank while Hunter and Wrecker provide covering fire. After seeing the Lawquanes' shuttle leaving, they board the Havoc Marauder which takes off under a hail of fire. The ship leaves Saleucami and flies into space."}, {"tag": "h3", "text": "Finding a family"}, {"tag": "p", "text": "Inside the ship's cockpit, Wrecker uses a Gonk droid to practice with his biceps while Tech and Echo fly the ship. Elsewhere, Omega finds Hunter working on a computer. She apologizes that she made a mistake, but tells Hunter that he did not need to get rid of her. Omega reminds Hunter that she left Kamino with him and the others. She says she wants to be with them. Hunter admits that he has a lot to learn. If this is where she wants to be, this is where she will stay. Omega turns to sit on the opposite desk as she faces Hunter, whose face softens."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}