{"url": "Cutter_(clone_trooper)", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Cutter  (clone trooper)"}, {"tag": "p", "text": "\"Cutter\" was a male Human clone trooper of the Grand Army of the Republic. In 22 BBY, he was part of a mission to the planet Oznek under the command of Clone Sergeant Banks and Commander Griebs Kishpaugh."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cutter was a male Human clone trooper, bred on Kamino for the Galactic Republic. When the Clone Wars broke out in 22 BBY, Cutter was one of millions of clones who made up the Republic's Grand Army of the Republic, though he differentiated himself by painting his armor with red designs. That same year, Cutter was sent on a mission to the planet of Oznek, under the direct command of Clone Sergeant Banks and Commander Griebs Kishpaugh. During this time, he was close friends with another clone named Syke. While flying above the planet's forest aboard a Low Altitude Assault Transport, Cutter, Syke, and Ghost mocked their new sergeant for cleaning his armor and weapons. Banks admonished the team for their behavior, but shortly after that, their ship came under heavy fire. The area was supposed to be unoccupied by Confederate forces, but they discovered a large droid army, which blasted them out of the sky."}, {"tag": "p", "text": "The LAAT crashed, killing the pilot and several other clones on impact. Syke escaped from the wreckage via a hatch, only to find hundreds of B1 and B2 battle droids bearing down on them. Wielding a RPS-6 rocket launcher, Cutter and the other clones fought off the attacking droids while trying to protect their wounded and burying their dead. Eventually, the waves of unending droids ceased, and the remaining seven clones covered their tracks by detonating a thermal detonator. Setting up camp in the woods, Syke attempted to use a communications array to no avail. After Crazy Legs asked, Banks then demonstrated the origin of his nickname— an unusual ability to calculate angles and bank his blaster bolts off of objects without losing their strength and still hitting his target. They were then contacted via holoprojector by Commander Kishpaugh after Syke managed to get the array working. Kishpaugh informed them that there was a droid command center twenty kilometers away, and that they were to destroy it despite their losses. He then ordered Cutter and the rest of the clone troopers from the shelter, speaking with Banks alone."}, {"tag": "p", "text": "Cutter and the others moved out before sunrise, leaving Crazy Legs behind, as he'd broken one of his legs in the crash. They moved through the forest, encountering dangerous terrain and creature everywhere, and lost another clone, who was eaten by an animal. As they traveled, Syke told a war story from early in the conflict, then asked Ghost for a story of his own, but the older clone demurred. Cutter, leading the way, then brought the others' attention to an ancient city in ruins. The clones remarked that their scanners hadn't picked up any trace of the large settlement, and suddenly found themselves surrounded by Toma, the native sentient species of Oznek. With their hands bound, the clones readied themselves for death after the Toma's leader ordered their executions, but were discovered and attacked by droids once again. Banks asked the Toma to cut their binds so they could fight together, and the Toma did so. Cutter and the others picked up their weapons and held back the droids, but Cutter realized that Banks had to complete their mission. He told the sergeant to take Syke and Ghost, while he and the other surviving clone trooper held off the droids. Banks said that he wouldn't leave Cutter behind, but when Cutter pointed out that the Toma couldn't be allowed to live either, Banks and the others fled."}, {"tag": "p", "text": "The mission would turn out to be a falsehood from the beginning, the circumstances and details manufactured by Kishpaugh and Ghost, both of whom were planning to defect to the Confederacy. The price of their escape from the Republic was creating a pretense for war on Oznek—namely, blowing up a \"droid command center\" that was really a power plant. Banks managed to foil the plan, killing Ghost and capturing Kishpaugh."}, {"tag": "h2", "text": "Appearances"}]}