{"url": "Cuy%27val_Dar", "categories": ["Category:Legends articles", "Category:Cuy'val Dar", "Category:Galactic Republic organizations", "Category:Galactic Republic soldiers", "Category:Mandalorian culture"], "nodes": [{"tag": "h1", "text": "Cuy'val Dar"}, {"tag": "p", "text": "The Cuy'val Dar were a group of one hundred individuals summoned by Mandalorian bounty hunter Jango Fett, to come to the watery world of Kamino to train clone troopers for the Galactic Republic. Of these one hundred males and females, seventy-five were Mandalorians like Fett, and in the Mandalorian language Cuy'val Dar meant \"those who no longer exist\"—a name stemming from the need for these individuals to disappear to Kamino without contact with the outside galaxy due to the secrecy surrounding the developing Grand Army of the Republic. For close to ten years, these one hundred training sergeants trained the Grand Army's ten thousand clone commandos until their deployment at the Battle of Geonosis in 22 BBY, which sparked the galactic Clone Wars. With their contract up, many of the Cuy'val Dar trainers went back to their lives, but a small number continued professional relations with the Republic, returning to train further generations of clones on Kamino, and later cross-training standard clone soldiers with commando skills."}, {"tag": "p", "text": "Nearly fifty years later, in 25 ABY, New Republic Intelligence agent and Jedi Knight Kubariet, met with Mand'alor Boba Fett on Vorpa'ya in the first year of the Yuuzhan Vong War. There, Kubariet requested that Fett form a new Cuy'val Dar group made up of experienced Mandalorian commandos, who could take on the task of training planetary militias to combat the Yuuzhan Vong."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 32 BBY, Count Dooku of Serenno—a former Jedi Master who left the Jedi Order only to fall to the dark side of the Force, becoming the Sith Lord \"Darth Tyranus\"—convinced the Mandalorian bounty hunter Jango Fett to become the progenitor of an army of clones to be grown on the planet Kamino. Fett, an accomplished soldier himself, knew that an effective army would require variety, and troops that could handle more dangerous and complex missions. With this in mind, Fett reached out to individuals throughout the galaxy to train elite clone commandos, beings with special skill sets ranging from military and survival skills, to tracking and communication experts. Numbering one hundred in total, seventy-five of these trainers were Mandalorians like Fett, and these unique, hand-picked individuals formed the group known as the Cuy'val Dar, which in the Mandalorian language of Mando'a meant \"Those Who No-Longer Exist.\" The origins of the name stemmed from the necessity of the Cuy'val Dar to leave their lives behind and vanish to Kamino for an indeterminate amount of time, where they would have no contact with the outside galaxy beyond its borders. Most were thought dead or missing in action, having left any family and friends they had without explanation."}, {"tag": "p", "text": "A large number of the Cuy'val Dar came from professional backgrounds that would commonly be considered fringe by the standards of Galactic Republic society, with bounty hunters, mercenaries, and assassins among their ranks. Yet upon answering Fett's summons to Kamino, this eclectic assortment of beings took up the role of training sergeants for the commandos that would make up the Grand Army of the Republic's special forces. With the exception of Fett—who personally took on the responsibility of training the one hundred Alpha-class Advanced Recon Commandos—circa 30 BBY, each Cuy'val Dar sergeant was given a company of one hundred and four clone cadets to turn into commandos. The commandos-in-training were not limited to their assigned sergeants in the course of their education, and there were several members of the Cuy'val Dar who had unique skills to be passed on. Sergeant Mij Gilamar was a trained doctor in addition to being a Mandalorian soldier, and he instructed the clones in the techniques of a combat medic. Kal Skirata, another Mandalorian and one reputed as a dirty fighter, taught the clones counter-insurgent tactics."}, {"tag": "p", "text": "The Cuy'val Dar trainers came to have a substantial impact on the clones they trained, stretching beyond teaching skills and moving into influencing their personalities. Mandalorian sergeant Walon Vau believed in training his men hard so that they would be able to face whatever actual combat had to offer, making them into survivors on an animal level. His theory was be given credence by the fact that squads trained by Vau had the highest survival rating following their devastating first deployment. The commandos of Delta Squad came to look upon Vau with genuine gratitude for his training, but RC-3222—or \"Atin\"—resented and came to hate Vau for his brutality. Sergeant Kal Skirata took a different approach: though no less dutiful in his training, Skirata encouraged the men in his charge, and treated them as he would his sons. Fellow Mandalorian sergeant Rav Bralor had a similar approach with her own squads, and both Skirata and Bralor were looked upon with familial feelings by their clone trainees in return. Nearly all of the Mandalorian training sergeants, regardless of their training styles, imbued a sense of being Mandalorian upon their charges, teaching the clones of Jango Fett about their Mandalorian heritage, and in response, a large number of the clone commandos took to that heritage enthusiastically. This was not a trait unique to the Mandalorian trainers and their clones, however, as commandos trained by a Corellian just as readily took on Corellian traits and elements of the culture as well, and the same could be said of clones trained by sergeants from Concord Dawn, such as the former Journeyman Protector Cort Davin."}, {"tag": "p", "text": "One Mandalorian instructor, considered among the finest in the Cuy'val Dar, trained a clone soldier by the name of Kaddak, a name the aspiring commando took from the ancient destroyer god Kad Ha'rangir of Mandalorian mythology. Kaddak and his Cuy'val Dar instructor developed a contentious relationship over time, which eventually led to a fight between the two. Using nothing but his bare hands, Kaddak killed the instructor, and was subsequently incarcerated by the Kaminoans and subjected to testing. According to rumor, Kaddak was ultimately terminated by the Kaminoans, though in truth he managed to escape Kamino, coming to reside on Ostor."}, {"tag": "p", "text": "The Grand Army was finally mobilized in 22 BBY, approximately ten years after it was created. However, because of the rapid nature of the army's deployment, many—if not all—of the Cuy'val Dar sergeants were unable to say their farewells to the commandos they had trained, some of whom never returned from the battle on Geonosis. With the Kamino contract over once the Clone Wars had broken out between the Republic and the Separatist Confederacy of Independent Systems, nearly all of the Cuy'val Dar went their separate ways, returning to the lives they left almost a decade prior, and doing so with a significant sum of credits for their rendered services. Kal Skirata, though, managed to secure himself a role as military advisor to the Grand Army's Special Operations Brigade as part of a deal with Jedi Master Iri Camas, and later Director of Special Forces, Jedi General Arligan Zey. By the second year of the war, Walon Vau had also returned to the employ of the Republic, even taking part in a strike against Jabiimi terrorists operating on Coruscant. As time went on, Vau also became involved in the cross-training of standard clone troopers with commando skills, along with the re-employed Cuy'val Dar sergeants Mij Gilamar and Wad'e Tay'haai."}, {"tag": "p", "text": "Members of the Cuy'val Dar were also employed in the training of clones on Kamino for a second time, as part of the enhanced training program instituted by ARC trooper Alpha-17. During the course of the training, Cort Davin was responsible for imbuing Clone Commander Bacara of the Galactic Marines with the traditions and culture of the Journeyman Protectors, while Mandalorian trainers passed on elements of their culture to Clone Captain Rex, awarding the soldier the right to wear jaig eyes on his armor. The Mandalorian huntress, Vhonte Tervho, imparted her skills with dual DC-17 blasters to more than a thousand up and coming clone commanders."}, {"tag": "p", "text": "Several members of the Cuy'val Dar, all of whom were of Mandalorian origin, continued to work together in the years after the Kamino contract was finished in a secret and personal mission aimed at aiding the clones they had trained. Under the unofficial leadership of Kal Skirata, former Cuy'val Dar trainers Walon Vau and Rav Bralor attempted to obtain a means of halting the accelerated aging that plagued the clones by kidnapping Kaminoan scientist Ko Sai. Kamino's former Chief Scientist defiantly took her own life at Skirata's Mandalore home, Kyrimorut—a location Bralor had secured for Skirata as a hideaway, and as a refuge for any clone who wished to desert the Grand Army in favor of freedom. Fellow Cuy'val Dar sergeant and doctor Mij Gilamar attempted to continue what research they had gained from Ko Sai prior to her death, in addition to acquiring further research from other sources such as Arkanian Microtechnologies with the help of the Null-class ARC troopers, before the group abducted the Separatist geneticist Ovolot Qail Uthan, and convinced her to aid them in their quest; the endeavor eventually bore fruit, and a cure for the clones' accelerated aging was found and administered. Skirata, Gilamar, Vau, and Bralor, along with their former Cuy'val Dar comrade Wad'e Tay'haai, spent a good deal of time at Kyrimorut in the weeks and months following the transformation of the Republic into the Galactic Empire, under the newly crowned Emperor Palpatine. While Skirata his comrades attempted to distance themselves from the Empire and its presence on Mandalore, the former Cuy'val Dar trainers Dred Priest and Isabet Reau—now members of the renegade Death Watch—allied themselves with the Empire as part of Death Watch leader Lorka Gedyc's plan to strengthen the Mandalorians. Gilamar later killed Priest in the Mandalorian capital city of Keldabe after his Death Watch ties became known."}, {"tag": "p", "text": "Many years later, during the first year of the Yuuzhan Vong War, the New Republic Intellegence agent and Jedi Knight Kubariet met with Mand'alor Boba Fett on the planet Vorpa'ya in the Mandalore sector. There, Kubariet reminded Fett of the Cuy'val Dar formed by his father, Jango, and suggested he form a new group of Cuy'val Dar from his most experienced commandos in order to train planetary militias to resist the Yuuzhan Vong."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Cuy'val Dar were first referenced in the 2004 novel Republic Commando: Hard Contact, by Karen Traviss. There, their role as trainers to the clone commandos hand-picked by Jango Fett was first established. Cuy'val Dar member Walon Vau made cameo appearances in the loading screens of the 2005 video game Star Wars: Republic Commando, which Hard Contact was originally written to tie in with. The Cuy'val Dar would make their first true appearance in Traviss' short story Omega Squad: Targets, and her second novel entry in the Republic Commando series, Republic Commando: Triple Zero, with the appearance of sergeants Kal Skirata and Walon Vau as full-fledged characters. Members of the Cuy'val Dar appeared in Traviss' subsequent novels Republic Commando: True Colors, Order 66: A Republic Commando Novel, and Imperial Commando: 501st. The Cuy'val Dar was also mentioned in Traviss' e-novella, Boba Fett: A Practical Man."}, {"tag": "p", "text": "\"Clone Cadets,\" the first episode of the third season of the Star Wars: The Clone Wars television series, introduced the characters of El-Les and Bric. While not directly identified as Cuy'val Dar members in the episode, the two are mercenary bounty hunters employed by the Republic in the training of clone troops on Kamino, a role previously established as belonging to members of the Cuy'val Dar."}, {"tag": "p", "text": "In her blog, Karen Traviss noted that \"[the Cuy'val Dar] either needed the fee very badly, or they were insanely loyal to Jango, or they wanted to disappear for reasons best known to themselves...and so on.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}