{"url": "Cyan_Squadron", "categories": ["Category:Canon articles", "Category:Rebel Alliance stubs", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Cyan Squadron personnel", "Category:Squadron callsigns"], "nodes": [{"tag": "h1", "text": "Cyan Squadron"}, {"tag": "p", "text": "Cyan Squadron was a Rebel Alliance airspeeder squadron stationed on the planet Vrogas Vas during the Galactic Civil War. The squadron operated T-47 airspeeders and operated out of the Rebel base there."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Cyan Squadron consisted of T-47 airspeeders and were stationed at the Rebel Alliance's refueling base on the planet Vrogas Vas during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 0 ABY, Darth Vader initiated a surprise attack on the Rebel Alliance at their base on Vrogas Vas, that started with Vader's complete destruction of Blue and Yellow Squadrons. While Vader was locked in a space battle with Red Squadron, Luke Skywalker (Red Five) intentionally rammed Vader's TIE Advanced x1 starfighter with his own, causing both to crash-land on the planet below. Cyan Squadron's T-47 airspeeders were dispatched to locate the two crash sites and kill Vader if possible. Cyan Leader and Cyan Two were unable to locate the Sith Lord, but Cyan Three encountered Vader with fatal results — Vader had stripped his downed TIE of it's blaster array and used it to destroy Cyan Three."}, {"tag": "p", "text": "In the aftermath, Commander Arhul Narra of Red Squadron, described the event as one of the worst cullings of starfighter pilots he'd ever seen, with the total destruction of Blue, Gray and Yellow Squadrons, as well as abandoning their starfighter outpost following the arrival of the Imperial fleet. Darth Vader escaped capture, however all Alliance High Command staff members were evacuated and all sensitive information stored at the outpost was recovered or intentially destroyed. The Alliance were able to capture Dr. Chelli Lona Aphra, a high-value prisoner, who was remanded to a max security penitentiary at Sunspot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cyan Squadron first appeared in Darth Vader 13, the third installment of Star Wars: Vader Down, a comic book crossover series. Vader Down, Part II was written by Kieron Gillen and penciled by Salvador Larroca, and published on November 25, 2015"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}