{"url": "Cyphar_Incident", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Battles of Nightswan's campaign"], "nodes": [{"tag": "h1", "text": "Cyphar Incident"}, {"tag": "p", "text": "The Cyphar Incident occurred during the Imperial Era when a land dispute took place on the planet Cyphar between the local Cyphari Afe clan and human colonists based on the Hollenside Enclave. The land dispute was rooted in the colonists' desire to harvest a pre-spice material used in the manufacture of scarn that was running in a vein beneath the Afe territory. After a brief battle Commander Thrawn and his aide Eli Vanto managed to arrest Clay Tanoo and a group of other colonists that had entered Afe lands in the dark of night to collect the pre-spice, but they could not be brought on charges because possession of pre-spice was not considered to be illegal. To destroy the colonists' source of profit, Thrawn used turbolaser fire to burn out the entire pre-spice vein, which angered the Afes, whose farmland suffered a considerable amount of damage in the process. In response to angry report of Afe Chief Joko Thrawn had to explain his actions for a court-martial panel, but he was cleared of all misconduct over the incident, and soon after Thrawn and Vanto both received promotions to higher ranks in the Imperial Navy."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The planet Cyphar was home to the indigenous Cyphari species, who were living in a clan based society. Humans had established a colony called Hollenside Enclave on Cyphar pressing against the territory that had belonged to the Afe clan for centuries. During the Imperial Era some of the colonists discovered that a vein of pre-spice was running under the croplands farmed by the Afes, that could be refined to a rare variety known as scarn. Humans began to raid Afe territory in order to provoke them to strike at the humans in retaliation, hoping that a confrontation would result in human casualties. They knew Afes would recoil in shame for such action and would consequently be at a disadvantage in any future dealings with humans."}, {"tag": "p", "text": "About four months into the conspircy, one of the conspiartors, Lenora Scath, contacted Nightswan asking for advice on how to improve their smuggling operation. She explained that their group was pressed from both sides between Cyphar government and the Afes and the Empire refused to pay attention to their complaints. While Nightswan was eager to help smuggling metals and other valuable materiels, he wanted nothing to do with smuggling spice, but after arriving on Cyphar and lerning what the conspirators wanted to smuggle out, he no longer could bow out from the sceme without risking being shot on the spot. To maintain his reputation as a creator of clever smuggling tricks, Nightswan adviced the conspiratorts to hide their contraband inside shellfish—a smuggling trick he had used once before to transport iridium. Nightswan hoped that the spice smuggling ring would be noticed and dealt with by his long-time opponent Thrawn, who had also halted the earlier iridium smuggling operation."}, {"tag": "p", "text": "After the new way of smuggling was implemented the conspirators wanted an easier access to the pre-spice vein and the border incidents escalated. The humans claimed that the Afes were raiding their areas and had caused injuries during the scirmishes, duping even the Mayor Pord Benchel to believe that the native Cyphare were to blame. The mayor sent slanted reports to Coruscant, demanding a safety buffer zone to be established between the Hollenside Enclave and the Afes, which would have taken nearly half of the Afe's land and forced them to relocate elswhere on areas controlled by other clans. Afes also petitioned for Imperial authorities to intervene, claiming that their attacks had only been a fair retaliation against border raids by humans."}, {"tag": "h2", "text": "Resolution"}, {"tag": "p", "text": "After Thrawn arrived along with Ensign Eli Vanto, Thrawn met with Pord Benchel, the mayor of the colony, along with 9 other members to listen to their complaints. After the conference, Thrawn and Vanto headed to meet Chief Joko of the Afe clan. After hearing Joko's complaints and learning more about the dispute, Thrawn analyzed the land around him and noticed that the crops developed improperly as a result of heavy metal poisoning. Thrawn informed Joko to move his people from the area as he anticipated a strong human incursion. Thrawn and Vanto also noticed that the movement of the human colonists are moving further northward towards the larger Cyphari cities in order to provoke the Afe clan into attacking."}, {"tag": "p", "text": "Thrawn and Vanto remained in the area inside the Afe clan meetinghouse to monitor the human colonists as they trespassed. After monitoring the colonists, the pair learned that the colonists were actually attempting to collect scarn. Thrawn called in Imperial reinforcements and instructed to use stun. After Thrawn and Vanto took up positions, they engaged the colonists just as Imperial forces were landing and after capturing most of the colonists, they learned from Clay Tanoo that no raid were made for the night, instead the conspirators were to move their supply to a safe location, and since the scarn was not a spice yet, it was not a crime."}, {"tag": "p", "text": "Thrawn ordered his forces to protect Afe lands if a skirmish were to erupt, and ordered Lieutenant Gimm to map the vein of scarn under the land. After doing so, Thrawn ordered the Thunder Wasp to fire, destroying the scarn but also damaging Afe land. The next morning, Joko protested to Thrawn, and informed him that he planned to appeal his action to Coruscant. Due to Thrawn's actions, his superiors were furious. In the end however the majority of the colonists were not aware of the true motivations of their fellow humans."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Thrawn's resolution of the Cyphar land dispute ended the conflict between Clan Afe and the human colonists. In addition, it disrupted the colonists' scarn smuggling operation and Nightswan's illegal doonium operation on Cyphar. Thrawn and Vanto spent the next week hunting down smugglers in obscure systems. A week later, they were summoned back to Coruscant where they were promoted. Thrawn was promoted to Commodore while Vanto received his long overdue promotion and attained the rank of Lieutenant Commander. Thrawn and Vanto's career progression was due to the lobbying of the future Lothalite Governor Arihnda Pryce, an ally of Thrawn who had disrupted Nightswan's spy ring on Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Cyphar Incident first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted Canonical origins story of the titular character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}