{"url": "Cytharat", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:LGBTQ+ individuals", "Category:Males", "Category:Sith Lords of the reconstituted Sith Empire", "Category:Sith species"], "nodes": [{"tag": "h1", "text": "Cytharat"}, {"tag": "p", "text": "Cytharat was a pureblood Sith male Sith Lord of the reconstituted Sith Empire during the Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cytharat was brought out of the Sith Academy by Darth Malgus, who would later betray the Empire; despite his association with Malgus, Cytharat remained with the real Empire, and continued to serve to atone for his master's treachery. During the Empire's campaign against the Hutt Cartel on the planet Makeb in 3638 BBY, Cytharat served as tactical advisor to the support team sent by Dark Council member Darth Marr to secure the planet's supply of the rare substance isotope-5. He arrived at the orbital docking ring of Gravity Hook 7 along with support team leader Katha Niar and Captain Hanthor after the gravity hook was captured by the ground team."}, {"tag": "p", "text": "When the Hutts' stored supply of isotope-5 was discovered in a fortress codenamed \"Stronghold One\", the ground team moved in to capture the vault with Cytharat leading troops in support to ensure the InterStellar Regulators did not send in reinforcements. However, the vault was found to be empty, the isotope installed in an army of war droids by order of Archon Szajin. Outnumbered and outgunned, the ground team was forced to pull out; looking for possible solutions, New Thinking Division scientist Nadrin Tro sent Cytharat and his team schematics for the stronghold's heat shields; Cytharat and the ground team would work in unison to disable it and flood the vault with magma, but at the cost of Cytharat and his men."}, {"tag": "p", "text": "The ground team ultimately went with Nadrin's plan, and Cytharat accepted his fate as a matter of duty. With his men killed and surrounded by isotope-5 war droids, Cytharat lowered the heat shield and filled the security center with magma, taking the war droids with him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cytharat professed unwavering loyalty to the Empire in general and to his superiors. Despite having been Malgus' protégé, he did not approve of his treachery. In addition to his reliability, Lord Cytharat was also a skilled tactician, and he would always keep his cool, even in crisis situations or when badly wounded. In regards to romance and sexuality, Cytharat was only interested in other men."}, {"tag": "p", "text": "Because of his Sith blood, Cytharat had decidedly non-Human features, such as glowing yellow eyes, crimson skin, pointy cheekbones and a set of tendrils hanging down from his chin and temples. His hands, however, had five fingers, while those of the then-extinct pure Sith had only three. Cytharat had raven black hair, which he kept cropped and slicked back, and he wore a piece of golden jewelry on the bridge of his nose."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cytharat first appeared in Star Wars: The Old Republic: Rise of the Hutt Cartel, a digital expansion released in 2013 for the video game Star Wars: The Old Republic."}, {"tag": "p", "text": "Cytharat's fate is determined on the player's conversation choices; the article assumes that the dark side option is canon. The alternative light side option is to order Cytharat to rendezvous with the player at the security station; he and his men will be wounded, but they will survive and be sent back to Dromund Kaas for recovery. After the Archon is defeated in the mission \"Revenge of the Archon\", Captain Hanthor will mention to Darth Marr in the debriefing that Cytharat is nearly recovered and will return from Dromund Kaas soon."}, {"tag": "p", "text": "When Rise of the Hutt Cartel was released, Cytharat became the first male same-sex romance option in series through a storyline limited to Makeb. Cytharat is portrayed as a gay man; only male player characters can begin an ongoing flirtation with him. The flirtations will only culminate in a kiss if the light side option is taken and Cytharat lives."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}