{"url": "Czerka_Arms/Legends", "categories": ["Category:Legends articles", "Category:Arms manufacturing companies", "Category:Czerka", "Category:Czerka Arms products", "Category:Droid manufacturers", "Category:Slaver organizations"], "nodes": [{"tag": "h1", "text": "Czerka Arms"}, {"tag": "p", "text": "Czerka Arms, also known as Czerka Weapons, formerly known as the Czerka Corporation, and founded as Czerka Mining and Industrial, was a galaxy-spanning business during the reigns of the Galactic Republic, Sith Empire, Galactic Empire, New Republic, and Galactic Federation of Free Alliances."}, {"tag": "p", "text": "It controlled interests on Korriban, Kashyyyk, Tatooine, Telos IV and to a much lesser extent Trandosha, Taris and Dantooine along with countless other planets. The corporation exported many of their weapons to Justa Starport on Mutanda."}, {"tag": "p", "text": "In 3638 BBY, the Republic nationalized the Czerka Corporation and dissolved it as a company; however, the company's former employees regrouped into Czerka Interstellar, and the company eventually took on the name Czerka Arms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of the Jedi Civil War, Czerka, under the leadership of President Pollard Seario, allied itself with the Sith; it supplied the contemporary Sith Empire armies and the Sith supplied exclusive trade rights on conquered planets. Because of this, and earlier behavior, Czerka gained a reputation as an unethical opportunist."}, {"tag": "p", "text": "Not all of Czerka's enterprises at this time were successful; indeed, many became financial disasters. An example of this was its operation of and involvement in the Wookiee slave trade which, although illegal in the Republic, was made possible by legal loopholes concerning Kashyyyk's location. This lucrative market was ended when the visiting Revan, along with his Wookiee companion Zaalbar, helped instigate a revolt: the Wookiees then proceeded to drive the company from the planet. Czerka sought to conceal the setback through a public announcement that it was \"scaling back\" regional operations but was met with skepticism; the deaths of so many personnel led to questions regarding their \"reassignments\" which Czerka refused to answer."}, {"tag": "p", "text": "Another failed Czerka enterprise at this time was the claim it laid to the planet Tatooine. Responding to enthusiastic surveys, a number of outposts, including the town of Anchorhead, were built and mining operations begun. To its subsequent dismay, Czerka become another in a long line of companies deceived by Tatooine's inferior, quickly corroding ore. Nevertheless, such an investment had been made that officials were unwilling to close it down and the sale of ore from Tatooine continued. Customers and investments declined, and marauding bands of natives also proved a source of trouble for the corporation. Revan became involved here as well when the administrator of Anchorhead hired him to butcher the local tribes of Sand People. The amnesiac Jedi, unknown to his employer, deftly avoided this by negotiating a reduction in attacks with the tribes' chieftain. From the native dewback, company scientists also attempted to breed \"war dewbacks\" that were larger and more aggressive than their easily domesticated cousins. Although the scientists eventually succeeded, the project was written off as a failure when the test herd broke out of its enclosure and rampaged through the research facility. Eventually, however, Czerka did depart Tatooine, abandoning their sandcrawlers and their settlements."}, {"tag": "p", "text": "Other enterprises included a work colony at Dreshdae on the ancient Sith homeworld of Korriban. Czerka supplied freighters and supplies to the local Sith Academy in accordance with its Sith alliance."}, {"tag": "p", "text": "In the years after the war, Czerka sought to ingratiate itself with the victorious but shaken Republic through involvement in the reconstruction effort of Telos IV. The deal was this: Czerka supplied workers and investment in return for exclusive exploitation of Telosian resources, including rights to any abandoned war matériel. Success, it was hoped, would bring the company similar contracts on other reconstruction projects. Czerka, however, clashed with the Ithorians running the project and the Telosian branch, in alliance with the local Exchange, acquired control of several restoration zones—all of which soon were ruined. But if not for the intervention of the Jedi Exile Meetra Surik, Telos might well have followed."}, {"tag": "p", "text": "By the time of the Cold War, the proxy conflict between the Sith Empire and Galactic Republic, Czerka was noted to have diversified businesses ranging from consumer food products to military weapons. It owned multiple star systems, employed several billion individuals and had representation in the Republic Senate. It was also unique, being able to negotiate trade agreements with the Hutt Cartel and independent worlds, crossing political borders with impunity to generate staggering profits. Whatever one may have thought about Czerka Corporation's business practices, no one could afford to simply stop doing business with them."}, {"tag": "p", "text": "During this period, Czerka Corp was victim to several slicer attacks. The company's officials offered a reward to any other slicer who could help stop the security breaches."}, {"tag": "p", "text": "Czerka's Czerka Secret Weapons Division 7 in the Dune Sea of Tatooine also dug up a Rakatan Mind prison that contained the Imprisoned One, who used nanotechnology to turn all the employees into mindless drones."}, {"tag": "p", "text": "Some time after the next Republic defeat of the Sith, Czerka, perhaps wanting to disassociate itself from its past, changed its name to Czerka Arms."}, {"tag": "p", "text": "Czerka sold their products freely during the days of the Galactic Republic, for example selling Czerka Outland Rifles to the Kaleesh during their war with the Huk, but signed an exclusivity contract with the Galactic Empire when it rose to power. However, Czerka munitions made their way to aftermarket sales from warehouses, despite the official stance of the company. One example of this was the Czerka ZX miniature flame projector used by the bounty hunter Boba Fett."}, {"tag": "p", "text": "During the Galactic Civil War, Czerka was on the list of legitimate targets for Rebel privateers. When the New Republic replaced the Galactic Empire, Czerka ended its contract with the Empire and offered its products once more to the galactic market, even going so far as to actively pursue production contracts with the New Republic. Czerka maintained its position as the third-largest weapons manufacturer in the galaxy, superseded only by BlasTech and Merr-Sonn. Czerka produced some energy weapons, but found a niche in the manufacture of non-blaster personal weapons and \"non-standard\" munitions, such as flame projectors, vibroblades, and slugthrowers."}, {"tag": "h3", "text": "Reputation and ethics"}, {"tag": "p", "text": "Czerka, at least in its earlier days, was widely known as a successful, if unscrupulous, corporation. Illegal and unethical revenue-generating practices were tolerated, sometimes encouraged, by its sectoral officers so long as the flow of credits was uninterrupted and word did not leak out. Likewise, the politics of its customers were overlooked for the sake of lucrative markets. Also, as might be expected in such a corporation, rumors spread of profiteering; particularly that Czerka officials had allowed starvation of colonists when their high prices were not met. This distaste did not, however, compromise Czerka's income."}, {"tag": "p", "text": "During the Old Republic Era, Czerka was a sponsor in the Hutt-run death game, Huttball, supplying many of the death traps used in the popular sport. One of Czerka's most foolhardy projects was the creation of the HK-51 assassin droid, modelled after HK-47. A large shipment was purchased by the Sith Empire, but disappeared somewhere over Belsavis."}, {"tag": "p", "text": "Czerka also engaged in the illicit slave trade. During the Jedi Civil War, Wookiees from Kashyyyk, regarded as savage brutes because of their animalistic speech and appearance, were a prime source. Violent resistance by the Wookiees reinforced this belief. Nevertheless, negotiations with the usurper Chuundar led to a mutual aid agreement in which Czerka supplied him with weapons with which to enforce his rule and he supplied Czerka with slaves. As previously described, this agreement was ended when Revan aligned himself with Chuundar's deposed father Freyyr and encouraged a revolt. Chuundar was killed, and Czerka evicted."}, {"tag": "p", "text": "On Telos IV, Czerka's illicit actions came to light and caused repercussions for the whole corporation. Under the effective leadership of Jana Lorso, encroachments were made into the Ithorians within Chodo Habat's reconstruction team's sphere of influence. Alliance with the Exchange and deft exploitation of Telos' own laws enabled Lorso to steadily marginalize the Ithorians. The arrival of Meetra Surik changed this. Befriending Chodo and his herd, she gathered information which exposed Czerka's activities."}, {"tag": "p", "text": "The Prosecution's case rested on the following evidence:"}, {"tag": "p", "text": "In the end, Czerka was ordered to leave all Telosian holdings and to stand trial, and that it was fully removed by the time of the Battle of Telos IV."}, {"tag": "h2", "text": "Representatives"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Czerka Arms was first created for The Rebel Alliance Sourcebook, released by West End Games as a supplement for its Star Wars Legends Star Wars: The Roleplaying Game. It was featured in the Legends video game Star Wars: Knights of the Old Republic and its sequel, Star Wars: Knights of the Old Republic II: The Sith Lords, although not the primary villain, appearing as an occasional antagonist faction. Czerka is presented as an amoral entity; not only are they allied with the Sith, but they frequently use underhanded means for their ends, such as stealing from rivals, acting on purely financial motivations, employing the use of violence and slavery, hiring mercenaries, smuggling weapons, etc. They will often ask the player to perform some jobs which would generally be considered \"dirty\"."}, {"tag": "p", "text": "The name Czerka Arms is an obvious nod to the real-life Czech arms manufacturer Česká zbrojovka or CZ for short."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}