{"url": "Czulkang_Lah", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Domain Lah", "Category:Males", "Category:Yuuzhan Vong Warmasters"], "nodes": [{"tag": "h1", "text": "Czulkang Lah"}, {"tag": "p", "text": "Czulkang Lah was once one of the greatest warmasters of the Yuuzhan Vong, a hero to his species, and an experienced commander responsible for developing many of the tactics that the Yuuzhan Vong warrior caste would use in the invasion of the galaxy. Responsible, as warmaster, for leading the warriors and the Yuuzhan Vong fleet, Lah in fact came to oppose the planned attack upon the New Republic and its environs. Czulkang Lah's relationship with his offspring, Tsavong Lah, became strained, as father and son disagreed over the matter. Eventually, Lah was ousted from his position, usurped by Tsavong, and consigned to a life teaching strategy to younger Yuuzhan Vong warriors. The former warmaster led this existence for years, old and physically decrepit when the invasion was launched in 25 ABY. Disheartened by his reversal of fortune, the aged warrior desired nothing more than to lead warriors in battle once again."}, {"tag": "p", "text": "Two years into the Yuuzhan Vong invasion, Tsavong Lah offered his father command of a sizable fleet with which to assault Borleias, a planet recaptured from the Yuuzhan Vong by elements of the New Republic Defense Force. His dreams finally realized, Lah blockaded the Pyria system, maintaining a constant siege of Borleias. The old warrior soon received intelligence indicating that the New Republic garrison was developing a superweapon, known as the Starlancer Project, and thus he chose to initiate a strategy of observation until the extent of his opponent's capabilities could be determined. Tsavong Lah, however, was monitoring his father's progress, and overruled the long approach to the campaign, demanding an all-out assault to destroy the garrison and its superweapon, which resulted in a disastrous defeat. A stalemate persisted in the system, until eventually the former warmaster and his opponent, General Wedge Antilles, met in one final, protracted engagement. During the last clash over Borleias, Lah was outwitted and killed, his flagship rammed by the Executor-class Star Dreadnought Lusankya."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A warmaster's rise and fall"}, {"tag": "p", "text": "Born into Domain Lah, Czulkang Lah was to become one of the greatest military heroes of the Yuuzhan Vong. A shrewd tactician and strategist, Lah eventually rose to the rank of warmaster, the coordinator of the warrior caste, second only to the Supreme Overlord in his command of the Yuuzhan Vong warriors. Czulkang Lah fathered a son, Tsavong Lah, who would go on to become a respected warrior in his own right. Over the years, Lah underwent such a multitude of ritual scarring, customary to the Yuuzhan Vong, that his features were almost black with tattoos; as he grew older, these hid the signs of age upon his weathered person. His experience and prestigious reputation brought respect and notability to other warriors who had served under him. As warmaster, Czulkang Lah was to be tasked with leading the warrior caste during the impending invasion of the galaxy, which the Yuuzhan Vong had traveled for millennia to reach."}, {"tag": "p", "text": "Much like Supreme Overlord Quoreal, Czulkang Lah opposed the invasion, refusing to believe the new ruler of the Yuuzhan Vong, Shimrra of Domain Jamaane, who claimed that the galaxy was ripe for conquest. Czulkang Lah's resistance to the attack led to a rift in the relationship between himself and his son; ultimately, Tsavong usurped his father's mantle, and assumed the rank of warmaster. Politically suspect and threatened by the same fate that had befallen Quoreal, the elderly warrior was in fact saved by the intervention of his son. Tsavong Lah ensured that his father was able to attain a position as a military instructor to younger Yuuzhan Vong warriors. For his part, Lah held no ill will toward his son, however strained their relationship had become. Although listless and depressed in his position as a teacher, unable to lead forces or experience battle, Lah was often referred to as warmaster, as well as a number of other honorifics, out of respect for the illustrious personage he had once been."}, {"tag": "h3", "text": "Teacher"}, {"tag": "p", "text": "Lah taught military strategy for years, protected by the reputation of Tsavong, who went on to coordinate and realize the invasion of the galaxy with a string of successes. Czulkang Lah's advanced age severely impaired his vision, and also forced him to wear modified Vonduun Skerr Kyrric armor in order to protect his elderly frame. Despite his advanced years, Czulkang Lah's lessons on strategy and the arts of warfare became legendary. The scars administered by the former warmaster during his intense teaching sessions became known as Czulkang Lah pits, delivered for incorrect answers, timidity or cowardice. If a warrior had only a few of the scars they were seen as marks of honor, for having studied under the venerable strategist. Too many of the wounds, however, and a warrior had proven instead his or her lack of intelligence. One of Czulkang Lah's luminaries was Supreme Commander Maal Lah, who aided Warmaster Tsavong Lah in the encirclement and capture of Coruscant, the New Republic capital."}, {"tag": "p", "text": "The success of Tsavong was such that following the seizure of Coruscant, Czulkang Lah incorporated the strategies his son had utilized in taking the world into his military classes. The use of a refugee screen to approach Coruscant, forcing the New Republic Defense Fleet either to fire upon civilians or allow the Yuuzhan Vong to advance, had fractured the New Republic Senate and its military. Aboard the Domain Lah Koros-Strohna over the conquered planet of Myrkr, Czulkang Lah delivered a lesson to an inaugural class of warriors on the subject of his son's strategy, as he believed that it was vital to comprehend the extent to which the enemy was prepared to go to defend itself. Lah stated that the New Republic was falling because it failed to understand that individual suffering was unimportant. The lesson, however, was interrupted by the arrival of Tsavong, who approached his father with a proposition."}, {"tag": "h3", "text": "The question of Borleias"}, {"tag": "p", "text": "The Pyria system was a crucial hyperspace junction of which Tsavong Lah himself had overseen the capture prior to the invasion of Coruscant. In a swift reversal of Lah's victory, elements of the New Republic Third Fleet, commanded by famed Corellian strategist Wedge Antilles, had traveled from their lost capital to stage a sudden attack on the main planet in the system, Borleias. Antilles and his forces recaptured Borleias in order to sustain a rear-guard action, which would allow the New Republic's shattered administration to recover from the chaos that had ensued following Coruscant's fall. Czulkang Lah's son had sent Commander Wyrpuuk Cha to retake the planet, but the New Republic forces had crushed Cha's fleet with the help of an Executor-class Star Dreadnought, the Lusankya. The swift destruction of Cha's fleet and the discovery of plans for an unknown weapon on the moon of Pyria VI had led Tsavong Lah to believe that Borleias was of great significance to the New Republic."}, {"tag": "p", "text": "The warmaster, however, was suffering from the treachery of his attendants, and was also needed in other theaters of the war. Therefore, instead of leading the campaign to take back Borleias from Antilles and his garrison himself, Tsavong had decided to approach his father and offer him command of the campaign. True to his desire to attain victory in battle once again, Czulkang Lah informed his son that he would only accept command if he were able to continue to lead forces following his victory in the Pyria system. At first, Tsavong Lah hesitated at allowing the father he had usurped to regain such a prominent position in the warrior caste, but the older warrior persuaded his son that he bore no grudge for his downfall and merely wished to have a reason to persist in living. As Czulkang explained, he had originally opposed his son over the decision to invade this galaxy, but because the invasion had already commenced and their forces were already committed, he could not undo it, and the remaining productive option was to try to aid the invasion as best he could. Finally thanking Tsavong for coming in person, thus repairing to some extent their strained relationship, Lah prepared to assume command of a fleet that would include one of the few remaining healthy worldships, that of Domain Hul. Now, as a supreme commander, Czulkang Lah returned to war."}, {"tag": "h3", "text": "Pyrian blockade"}, {"tag": "p", "text": "Czulkang Lah's fleet approached the Pyria system from the direction of Arkania. The supreme commander's arrival was swiftly detected by the Jedi Jaina Solo and Kyp Durron, and the Imperial I-class Star Destroyer Rebel Dream, but it was no matter to Lah; the Domain Hul Koros-Strohna was screened by a large force of capital ships. Imitating the tactics of his son at Coruscant, Lah decided to probe the response of the enemy—the warrior sent ahead a small force of three yorik-et starfighters and a frigate. As it neared Borleias, the frigate ejected twenty two captives, including Humans as well as members of other species, into vacuum. Czulkang Lah then observed the response of the defenders. While the New Republic forces dealt with the imperiled captives, Lah brought the Domain Hul Koros-Strohna to a distant orbit, beyond that of Pyria's farthest planetary body. There, he held an audience with a Yuuzhan Vong pilot, Charat Kraal. Domain Kraal, the original defenders of Borleias, had been routed by Antilles' first assault, and Charat Kraal had assumed command of the remaining yorik-et and warriors, replenished by the remnants of Wyrpuuk Cha's fleet. Having amassed this collection of warriors and pilots, Kraal had been prosecuting a harassment and reconnaissance campaign against the New Republic forces."}, {"tag": "p", "text": "Lah, despite his initial misgivings concerning Kraal and his guerrilla tactics, was impressed at the amount of intelligence the pilot had garnered. Kraal informed the old warrior that there were Jedi present on Borleias, including Jaina Solo and the famed Luke Skywalker. Solo's presence was of particular interest to Czulkang Lah—the elusive Jedi was greatly desired by the warmaster. Tsavong Lah intended that Solo join her twin brother Jacen Solo in captivity, whereupon it was planned that the two siblings would fight one another, thus fulfilling a religious vow he had made to the Yuuzhan Vong gods in return for Coruscant. Aware of Solo's importance to his son, Lah gave Kraal a reprieve, a full wing of yorik-et, and orders to capture the Jedi. Kraal was able to furnish Lah with further intelligence; he had discovered what appeared to be the construction of a New Republic superweapon, known as the Starlancer Project, on the surface of Borleias. The Alderaan Biotics facility on Borleias, once the private retreat of Imperial General Evir Derricote, was speculated by Kraal to be the New Republic equivalent of a shaping facility, where New Republic scientists were creating the mysterious Starlancer technology. Kraal's report was to guide Czulkang Lah's next actions in the Pyria system."}, {"tag": "p", "text": "Two days after his arrival, Lah sent forth yorik-et squadrons to observe the \"pipefighters\" that Kraal had spoken of in his report, which were, according to Kraal, the chief components of the Starlancer Project. The former warmaster had no intention of making any rash attack on the New Republic forces and their enigmatic weapon until he was certain that he had gauged the enemy correctly, and when he was fully aware of any surprises Antilles may have been preparing. Lah also intended to acquaint himself with his opponent's tactical capabilities. Instead of a frontal attack, therefore, Lah coordinated a surgical operation to capture Solo, utilizing the Starlancer Project as his decoy target; ironically so, as the pipefighters were in fact decoys in themselves. Antilles was caught off-guard by the capture attempt on Solo. The Yuuzhan Vong spy in the New Republic base, Tam Elgrin, was able to inform his superiors when Solo departed, and thus as Solo's squadron and three others moved into position with the four pipefighters and escorted them to various positions in Pyrian space, Lah dispatched a total of eight yorik-et squadrons, two for each pipefighter and the New Republic fighter squadrons guarding them. While the Yuuzhan Vong pilots engaged their New Republic counterparts, Lah maneuvered two Yuuzhan Vong interdictors into position to ambush and capture Solo. Meanwhile, the pipefighters, which were not the target of the attack and thus went untouched, fired a meter-wide laser beam off into deep space, in the direction of Coruscant."}, {"tag": "p", "text": "The strike at Solo, however, did not unfold as planned; not only did the New Republic fighters manage to whisk Solo from the interdictors to relative safety, ravaging the yorik-et as they did so, but the return of the hunted Jedi to the skirmish, as she rescued a fellow pilot, did not result in her capture either. With one interdictor already destroyed, the second, influenced through the Force by Jedi Master Kyp Durron, was drawn into its own gravitic singularity and obliterated. Lah's operation was thus thwarted, as New Republic forces arrived and routed his remaining fighters. Meanwhile, the Starlancer Project fulfilled its intended effect; the laser beam fired toward Coruscant was relatively useless, but an undetected New Republic warship on the outskirts of the Coruscant system fired on the Domain Dal Koros-Strohna, Tsavong Lah's flagship, which was in orbit over the planet. To Tsavong Lah, therefore, the Starlancer Project's laser beam appeared to have reached Coruscant from the Pyria system and, although it inflicted minimal damage upon Lah's gargantuan vessel, the warmaster convened several of his advisers, including Czulkang Lah's old student, Maal Lah, to discuss the threat."}, {"tag": "p", "text": "Disinformation leaked to Tam Elgrin, the Yuuzhan Vong spy, had been communicated back to the warmaster. Elgrin's report suggested that the Starlancer Project was not only a superweapon of massive power, capable of destroying the few remaining Koros-Strohna, but also that it was powered by a giant lambent crystal, a perversion of Yuuzhan Vong biotechnology. Angered and unnerved by the prospect, Tsavong Lah contacted his father via villip, overruled the older warrior's objections, which were based on the strategy of analyzing and fully comprehending the enemy, and ordered an all-out attack on Borleias. Czulkang Lah disapproved greatly of his son's orders, as the lack of intelligence regarding Antilles and his capabilities was still daunting for the old warrior. When Tsavong said that his orders were to be carried out nonetheless, Lah gave his son a severe look of disappointment that made the warmaster step back from his villip in shock. Lah refrained from registering his displeasure verbally, however, so as not to undermine the warmaster, and prepared for the attack."}, {"tag": "h3", "text": "Assault and failure"}, {"tag": "p", "text": "Lah landed sixteen groups of ground forces, including Chazrach reptoid soldiers and giant rakamat siege creatures, on Borleias, a few hundred kilometers out from the New Republic base, to converge upon the facility and destroy it. Many of the groups were, as Antilles correctly guessed, decoys, intended to force the general to divide his attention in order to determine the location of Czulkang Lah's actual staging point. The supreme commander was unaware that New Republic ground-based sensors were monitoring every move of his troops. A day after the mass landings, Lah issued the order to attack. His capital ships moved toward Borleias. The aged warrior contacted his son and informed him of the developing engagement; the New Republic vessels were sending their fighters down to the planet, having detected the approach of his ground forces. Tsavong Lah's only response was to praise his father's ability, but Lah was less than reassured. Wary of failure, he steeled himself and committed his warships and yorik-et squadrons to an attack on the New Republic forces, which remained in geosynchronous orbit above the planet. On the ground, his troops and rakamats continued to close in upon the base, supported by fighters and attacked persistently by the enemy squadrons."}, {"tag": "p", "text": "The sheer number of his troops—thousands of Chazrach with hundreds of yorik-et supporting them—seemed to the old warrior to overwhelm Antilles' defense with ease, as the relentless advance toward the New Republic base was barely hindered by the enemy attacks. The twelve New Republic squadrons defending the facility retreated to the base beneath the onslaught. Lah brought his frigates and capital ships further into the engagement, all advancing steadily upon their target. The New Republic forces had soon lost so much ground that they were massed within a one kilometer radius of their headquarters, with Czulkang Lah's ground forces encircling them, tightly packed among the planet's jungles. Antilles then ordered his capital ships to initiate a saturation bombardment upon these concentrated ground forces. The Lusankya—the Executor-class Star Dreadnought that had crushed Wyrpuuk Cha's fleet—and the Rebel Dream, as well as the other New Republic warships in orbit, obliterated the majority of Lah's troops in their four-minute turbolaser bombardment. Shocked by such tactics, the deployment of which he had never considered, Lah ordered a retreat. A pragmatic withdrawal, however, did nothing to calm the warrior's anger; having chosen to blame the chief Yuuzhan Vong spymaster, Executor Nom Anor, for not furnishing the Yuuzhan Vong military command with such crucial information on Star Destroyer tactics, Lah was nevertheless forced to deliver the news to his son."}, {"tag": "h3", "text": "Siege"}, {"tag": "p", "text": "The old warrior found his failure both disconcerting and embarrassing, but the siege of the Pyria system continued nonetheless. His fighters later fought in an engagement against the Imperial-class Star Destroyer Mon Mothma as it escorted a recently arrived New Republic Gallofree Yards transport, the Reckless Abandon, and its starfighter squadrons, to the garrison on Borleias. The yorik-et pilots were unable to prevent the safe passage of the reinforcements to Borleias, but Lah had his own support forces en route to the system as it was. Tsavong Lah had dispatched his old friend Harrar, with whom the old warrior was already acquainted, to bring aid to Czulkang Lah in his Borleias campaign. Although Harrar, a deception sect priest, had brought ground forces and more fighters to swell Lah's numbers, his true task was the capture of Jaina Solo, who remained elusive. Tsavong Lah had directed his father to aid Harrar in every way possible to secure the Jedi's swift abduction and imprisonment. Czulkang Lah thus placed Charat Kraal and his wing of fighters under Harrar's command, during a brief audience aboard the Domain Hul Koros-Strohna, conducted in the viewing chamber in which Lah enjoyed observing the campaign. Peace Brigade collaborators also came to aid Czulkang Lah in his efforts against Antilles, using their familiarity with New Republic technology to listen in on Antilles' communications."}, {"tag": "p", "text": "Shortly after the arrival of Harrar, Lah initiated another attack against Antilles' garrison. His capital ships moved in on the biotics facility, bombarding the shields that protected the base. The assault, which included no ground forces, was intended as a probe to deny the garrison any respite. Light cruisers and their fighter complements attacked the base, while more of Lah's ships attacked the Lusankya in orbit. The facility's shields took heavy punishment from the guns of Lah's ships. As Charat Kraal and Harrar prepared another attempt to capture Solo, the Jedi and her tactics wiped out one of the matalok cruisers bombarding the base, further giving rise to the rumors that Solo was some form of incarnation of Yun-Harla, the Yuuzhan Vong goddess of trickery. Before long, the attack was called off, as the loss of the matalok was deemed too significant. Concurrently with the assault, however, the Yuuzhan Vong infiltrated another spy into the Borleias garrison, tasked with destroying the massive lambent crystal that both Tsavong and Czulkang Lah believed would soon be installed on the pipefighters and used to destroy the Koros-Strohna. The spy was later compromised and killed before he was able to discover that the Starlancer Project was a fake."}, {"tag": "p", "text": "Lah's forces settled once again into the siege of Borleias, the old warrior's forces continually strengthened by new arrivals, and the New Republic defense gradually eroded. Heavy damage was inflicted on many of the New Republic capital ships, and weariness and fatigue among Antilles' garrison allowed frequent attacks to be coordinated and enacted, each meeting less resistance than the last. The Pyria system was replete with dovin basal minefields, which intercepted any New Republic ships exiting hyperspace and were tasked with pursuing certain vessels known to the Yuuzhan Vong as threats. Thus, when the Millennium Falcon, the light freighter captained by Han Solo, returned to Pyrian space, Lah's mines recognized the ship's gravitic signature and pursued it alongside a squadron of yorik-et, without success. Having the dovin basal mines identify and pursue key ships, however, was a strategy that would come back to haunt Czulkang Lah. Although the Lusankya appeared, to Czulkang Lah, to have been crippled over the course of the long campaign, the New Republic capital ships damaged, the biotics facility pounded, and its starfighter squadrons thinned, the defenders of Borleias persisted. Aware that one final push would oust the New Republic from the planet, both Lah and Antilles readied their forces for the final battle of the Borleias campaign."}, {"tag": "h3", "text": "The final engagement"}, {"tag": "p", "text": "The advent of the last battle was heralded by a mass departure of New Republic starfighters from Borleias, along with the Starlancer vehicles, one of which had indeed been equipped with a lambent crystal. Czulkang Lah felt he had the means to defeat the Starlancer Project and those who escorted it; having trained a great number of pilots to be prepared to fight without the usual coordination of a yammosk, creatures utilized by the Yuuzhan Vong in war to oversee and communicate with their forces, Lah was confident that the elite fighter squadrons protecting the pipefighters would be overwhelmed and crushed. The Yuuzhan Vong who flew in the yorik-et were instructed, however, that Jaina Solo was not to be harmed. Antilles began to evacuate the facility, and the Lusankya moved out of orbit. The Peace Brigade collaborators who had been advising Lah and issuing him with intelligence and updates on the garrison's status were immediately shown to be misinformed as the Lusankya disgorged its fighter complement—squadrons that the old warrior had been told were stationed on the planet's surface. In punishment, Lah ordered his aide, Kasdakh Bhul, to transfer the Peace Brigade advisers to a Yuuzhan Vong ship, to kill one of them for the mistake, and to continue killing a Brigadier each time their errors cost the former warmaster. At the same time as the Lusankya was entering the engagement, another New Republic Star Destroyer, the Errant Venture, broke from orbit; Czulkang Lah ordered two mataloks to destroy her while his mass force of 210 yorik-et descended on the Starlancer vehicles. Unbeknownst to Lah, the turbolaser batteries and ion cannons, which had until recently been installed on the Lusankya, had been transferred to the Errant Venture. In a concentrated barrage of fire, before the Yuuzhan Vong commanders discovered the false weakness of the starship, the Errant Venture destroyed both mataloks and made the jump to hyperspace."}, {"tag": "p", "text": "Czulkang Lah received this disconcerting news, as well as the information that Kraal and his pilots had destroyed the pipefighters but misplaced the squadrons defending them, with trepidation. Matters were already moving beyond the elderly warrior's control. The Lusankya made a micro-jump toward the Domain Hul Koros-Strohna, leaving its fighters behind to oversee the evacuation of the planet. As the Star Dreadnought was dragged from hyperspace by dovin basal mines, it continued to approach Lah's Koros-Strohna. Unexpectedly, the elite force of starfighters, including Solo and Skywalker, which had been protecting the Starlancer vehicles, similarly reemerged from hyperspace alongside the great warship. At the same time as Lah dispatched waves of yorik-et against the Star Dreadnought and its starfighter screen, the Millennium Falcon began to fire missiles toward a dovin basal minefield—missiles that were, through scientific manipulation, broadcasting the same gravitic signal as the light freighter. True to their instructions, the dovin basal mines began to pursue the missiles. For the time being, Czulkang Lah remained confident. On his tactical displays, the Lusankya was analyzed as having become heavily battle-damaged, and although the skill of its starfighter defenders was such that Lah ordered the battle to be recorded into the Koros-Strohna's rikyam for future analysis, he was aware that the New Republic defense of the Star Dreadnought was gradually being thinned. On Borleias' surface, the biotics facility had fallen, finally destroyed under heavy fire from Lah's ships. Warriors were landed at the site, and forced the last member of the New Republic at the base, Wedge Antilles himself, to escape the ruins of his headquarters—true to his orders, Czulkang Lah had re-taken Borleias from the New Republic."}, {"tag": "p", "text": "With the Lusankya driving toward the old warrior's Koros-Strohna, Lah was able to observe through the vessel's viewing lens the continued damage being inflicted upon the Star Dreadnought as it began to shed chunks of its superstructure under the concentrated fire of his fleet. Noticing that the warship's starfighters were fiercely defending the Star Dreadnought's engines, Lah realized that the Lusankya was intending the ram his flagship. His aide, Bhul, was slow in coming to this conclusion, and the aged warrior struck his inferior in anger, mocking his lack of intelligence. Nevertheless, Czulkang Lah himself had failed to comprehend the true nature of the warship's ramming strategy; concealed along the length of the Star Dreadnought was a metal spear, a weapon designed solely to impale and destroy the Domain Hul Koros-Strohna. Unaware of this truth, Lah ordered the destruction of the Star Dreadnought's engines, in order to render it incapable of approaching his vessel at all, while continuing to send waves of yorik-et at the warship and its starfighter screen. Meanwhile, Kraal led a capture attempt on Jaina Solo, but was forced to deal with a failure to follow orders in his own unit as a Domain Hul pilot tried to kill the Jedi. As Kraal's pursuit descended into chaos—the yorik-et pilots were being misled by false gravitic signatures—the priest Harrar left the Koros-Strohna to join the engagement. Unbeknownst to the Yuuzhan Vong, Solo was in fact present near the Lusankya, not, as they perceived, leading Kraal and his fighters through a dovin basal minefield. Lah observed the brief encounter, supposedly between Kraal and his quarry, but neither the former warmaster nor the Domain Kraal pilot comprehended the deception. The missile broadcasting the gravitic frequency of Solo's starfighter hit Kraal's yorik-et at high speed, killing him, and the pursuit of the Jedi was over."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "The Domain Hul Koros-Strohna heightened its defense, but Lah had by that time grown nervous, uncomfortable with the lack of information capable of explaining the behavior of the Lusankya. He was also alarmed by the attention afforded by the New Republic forces to his flagship, as well as the glaring absence of several of Antilles' warships. Aware that a healthy Koros-Strohna was too great a resource to be risked, the aged warrior ordered a withdrawal, despite the misgivings of his subordinates. He was distracted by Bhul, who observed the needle-like protrusion from the Star Dreadnought's bow. Lah quickly determined its purpose, and sought after the status of the retreat. The massive vessel was still unprepared; more yorik-et were dispatched to prevent the approach of the Lusankya, but they were thwarted by the arrival of Mon Mothma, which powered up its gravity well projectors and initiated its yammosk-jamming, both preventing the Koros-Strohna from achieving a swift departure and throwing the Yuuzhan Vong forces into disarray."}, {"tag": "p", "text": "Lah's subordinates began maneuvering the flagship away from the interdictor, but the dovin basal mines pursuing the five pseudo-Millennium Falcons reemerged from hyperspace at that moment, preventing the mighty vessel from escaping the Star Dreadnought's spear. Aware that he was going to die as the Errant Venture similarly reappeared, powered up its weapons and attacked his flagship, Lah ordered Bhul to activate the villip linked with that of his son. Lah informed Tsavong of the fall of Borleias, to which his son responded positively, but went on to tell the warmaster of his impending defeat. Tsavong was confused and attempted to protest the news; the old warrior, however, silenced his son and pledged his final words to the warmaster, invoking the favor of the gods so that it might better protect Tsavong. Moments later, with a nod, Czulkang Lah gave the order to abandon Domain Hul. He was still standing in the viewing chamber when the point of the Star Dreadnought's spear impacted, ending his long life."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "At the news of his father's death and the utter destruction of Domain Hul, Tsavong Lah was shocked and dismayed, unable to come to terms with his sudden loss and unsure whether the gods loved or despised him. The warmaster appealed to Supreme Overlord Shimrra for the opportunity to attack the reeling New Republic once again, but the ruler of the Yuuzhan Vong cited Czulkang Lah's death in his refusal of the warmaster's request. The loss of Domain Hul was a mighty blow to the newly christened Yuuzhan Vong Empire, and the old warrior's demise was felt keenly by the warrior caste. The following year, Tsavong Lah would join his father in death. The priest Harrar, who escaped the final engagement over Borleias and later defected to the enemy, believed that Czulkang Lah had been distracted during the campaign by the presence of Jaina Solo and that the focus on Solo's capture had been the former warmaster's downfall."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "It was Czulkang Lah's caution that came to be his undoing. Not only did it first cost him his position of warmaster, but it was also a major factor in his eventual defeat and death. By putting so much faith in intelligence, Lah failed to realize that his spies were being misled and that the Starlancer Project was nothing but a decoy. His long-term strategy of comprehending Antilles' capabilities granted his opponent the time he needed to ensure that, for the New Republic, the Borleias campaign achieved its goals. Coupled with the need to capture Jaina Solo, the former warmaster had thus set himself up for defeat long before it came. Ironically, the old warrior often predicted his failure in the Pyria system, as circumstances forced him into battle before he felt he was adequately prepared."}, {"tag": "p", "text": "Antilles' second in command, Tycho Celchu, likened Czulkang Lah to Garm Bel Iblis, a contemporary tactician of the New Republic known for his military prowess, and indeed Lah was a gifted strategist. At Borleias, however, he found himself fighting an enemy whose own tactics came as constant surprises, and whose technology was able to outwit his own. Pragmatic in his retreats, cool-headed in the heat of battle, Lah had justifiably attained the respect of the Yuuzhan Vong, even after he opposed the invasion. Often scornful or disparaging of those whom he taught or fought alongside, the old warrior was nevertheless humble, refusing other Yuuzhan Vong the right to refer to him as warmaster. Above all, Czulkang Lah was drawn to the arts of warfare; in awe of his opponent's capabilities, he stood and admired Antilles' innovation as the Lusankya bore down upon him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Czulkang Lah was introduced in Aaron Allston's The New Jedi Order: Enemy Lines I: Rebel Dream as a major Yuuzhan Vong antagonist and the counterpart of Wedge Antilles, a prolific character in Allston's Star Wars portfolio. The father of Tsavong Lah, a predominant villain in the long New Jedi Order series, Czulkang Lah's eventual death at the end of the Enemy Lines duology serves to illustrate the continued changes in the fortune of Tsavong Lah, whose character is also developed in Allston's two novels. In The New Jedi Order: The Unifying Force, the final novel in the series, the Yuuzhan Vong priest Harrar discusses Czulkang Lah briefly, referring to the aged warrior as a supreme commander at the time of the Borleias campaign. As Lah's exact rank was never divulged, this acted as a retcon better illuminating the warrior's status."}, {"tag": "p", "text": "On Allston's personal website, the author dealt with a series of questions asked of him by the readers of his novels. One such question pertains to Czulkang Lah; Allston was asked how Lah was able to attain respect as a skilled military leader if the Yuuzhan Vong had not yet fought the New Republic and were still in transit in the Intergalactic Void, without enemies to face. Allston hypothesized that Czulkang Lah attained his reputation through military exercises, battles fought against any possible species living in the Intergalactic Void, and in action against dissident Yuuzhan Vong. As this information has not been published in any Star Wars material, however, it remains non-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}