{"url": "D%27Jar%27Min", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Gorothite culture", "Category:Planetary defense fleets"], "nodes": [{"tag": "h1", "text": "D'Jar'Min"}, {"tag": "p", "text": "The D'Jar'Min, translated Planetary Defense Arm, was the planetary defense force of the planet of Goroth during the Corellian/Aqualish war."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the tensions rose between the Corellian bloc and the Aqualish Barralenal in the Trans-Nebular sector around 4000 BBY, the government of Goroth commissioned a new military force. Originally, it was created as a symbol of autonomy, but later grew in size. Once the government decided that Goroth's defense was sufficient, all funding to the D'Jar'Min were frozen."}, {"tag": "p", "text": "During the Corellian/Aqualish war, Goroth's position allowed it to remain neutral and made a large profit from selling concessions to both sides. The only trouble the D'Jar'Min had to deal with were brawls and fights between the soldiers who were on planetary leave. All these conflicts remained on a personal level. However, the D'Jar'Min remained constantly underfunded."}, {"tag": "p", "text": "As the government under Rel'Kan J'Kek grew more greedy, one side decided to destroy Goroth and launched five asteroids against the planet. The Bl'Era Har detected the incoming endothermal killers, but the D'Jar'Min only had ion cannons and no ships and therefore no means to stop them. While the planet was hit, the crews of the moon's ion cannons could only watch their homeworld being destroyed. They would soon meet a similar fate, as the asteroids dust from the impact was blown into the moons' orbits, where it destroyed the stations' solar cells."}, {"tag": "p", "text": "Over four thousand years later, the Gorothite rebel cell T'B'Dellyi'Mai attempted to re-activate one of ion cannons on the moon of V'Sar to shoot down an orbiting Star Destroyer. The Rebel Alliance heard of this plan and sent out a team to stop them, fearing that the Empire would retaliate and destroy Goroth for good."}, {"tag": "h2", "text": "Strength"}, {"tag": "p", "text": "The planet of Goroth possessed no ships, it always relied on outsiders to transport goods. The D'Jar'Min also had no fleet, since the government deemed the three moon stations as a sufficient defense."}, {"tag": "p", "text": "On each of the three moons of Goroth Prime, J'Mel, Telar and V'Sar, batteries of ion cannons powered by solar cells had been constructed. It's overlapping arcs provided a constant cover for the planet."}, {"tag": "h3", "text": "Bl'Era Har"}, {"tag": "p", "text": "The B'Era Har, translated Sky-Track, was a system run by the D'Jar'Min. It was responsible for tracking incoming asteroids."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}