{"url": "D%27harhan", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Bounty hunters", "Category:Cyborgs", "Category:Males", "Category:Niordi"], "nodes": [{"tag": "h1", "text": "D'harhan"}, {"tag": "p", "text": "D'harhan was a male Niordi bounty hunter who hailed from the planet of Niorde in the Unknown Regions. Niorde came under attack by members of the Leech Legions during the Clone Wars, who were hired by a neighboring planet to attack Niorde as part of a war that had been fought between the two planets for a century. To defend his planet, D'harhan and several other Niordi underwent cybernetic alteration to their bodies to become living artillery weapons. However, despite the advantage of having D'harhan and the other weapons on their side, the Niordi lost the war, leaving D'harhan the only living weapon left. He and Boba Fett had a long past together, and held each other in high regard."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and transformation"}, {"tag": "p", "text": "A Near-Human Niordi, D'harhan was a scout native to the uncharted planet of Niorde, located in the Unknown Regions. Niorde was at war with a neighboring planet for centuries. During the Clone Wars, the latest threat from that world materialized as mercenaries from the Leech Legion who were hired to attack Niorde. Due to this threat, D'harhan and a select number of other Niordi scouts underwent cybernetic alterations to become living weapons, which would be used to defend their homeworld."}, {"tag": "p", "text": "On the fringes of the Niorde system in a secret laboratory, D'harhan's head was removed to make way for a cannon that was powered by a light-mass core. His brain was flash-frozen and transferred to a square, heavily-armored box on his chest, while most of his other organs were removed, except for the heart and lungs, which were also relocated. The cannon was connected to his spine via neural-feed cables through a hard-splice socket that was located between his shoulder blades. D'harhan's limbs and spine were also enhanced with durasteel to be able to support the weapon that was drilled into his collarbones, while a tail was added to brace against the recoil from the cannon. His communication was limited by the surgery to the usage of a keypad voice box. An internal comm network was also added to all of the living weapons so that they could coordinate their actions with each other. Throughout the whole surgery, the bounty hunter Boba Fett watched, having been taken to the Niorde system by another hunter, Nashtah. That day, D'harhan, in essence, became a life-support system for a cannon."}, {"tag": "p", "text": "By the time D'harhan and the other Niordi scouts who had survived the operation were ready, the Leech Legions had already conquered Niorde. D'harhan and the other living weapons attacked the flagship of the enemy, an attack that in the end left only D'harhan alive. Sometime after the incident, D'harhan became a bounty hunter."}, {"tag": "p", "text": "D'harhan worked with Fett at multiple points in his career, including on Bellassa, hunting down the fugitive Jedi Obi-Wan Kenobi and Ferus Olin. He and Boba Fett attacked Olin, Kenobi, and Trever Flume at the Red Twins spaceport."}, {"tag": "h3", "text": "The Bounty Hunter Wars"}, {"tag": "p", "text": "During the Bounty Hunter Wars, Fett hired D'harhan in 1 ABY, to join his team along with IG-88B, Bossk, and Zuckuss. When he arrived at their meeting point, D'harhan almost attacked Zuckuss when the Gand touched D'harhan's ship. Boba Fett calmed him down, the two bounty hunters commenting on how long it had been since they had seen one another. The group split in two groups to fly to Circumtore to meet with the Shell Hutts, with D'harhan joining Zuckuss aboard Slave I with Fett."}, {"tag": "p", "text": "While D'harhan slept in the cargo hold, his cannon subconsciously tracked Zuckuss's movements, frightening the Gand into joining Fett in the cockpit. When Zuckuss—who was disturbed by the cyborg's transformation—pressed Fett for more information on D'harhan, and why he had never heard of him, Fett simply told him that D'harhan minded his own business, and traveled in areas of the galaxy Zuckuss would never go."}, {"tag": "p", "text": "After arriving in orbit around Circumtore, the Shell Hutts demanded that all the bounty hunters come down to the planet unarmed. D'harhan balked at this demand, saying that he was a weapon, and would not be able to go. When Fett proposed that they take out his light mass core, the power for the weapon. D'harhan rejected the offer at first, saying his weapon was his spirit, and that if Fett took that by which D'harhan killed others, it would be like death to him. Fett told him it would only seem like death, and that real death would come later. D'harhan relented, and allowed Fett to reach deep inside his inner workings, from which Fett pulled the core. D'harhan collapsed to the floor, then declared that Fett owed him big time."}, {"tag": "p", "text": "After meeting with Gheeta planetside, the Hutt betrayed the bounty hunters—due to the fact that Fett had previously rescued an architect that had constructed the palace, Emd Grahvess—and released a large mercenary force upon the group. As the mercenaries attacked—wounding Zuckuss and Bossk—D'harhan stood in the middle of the room, howling in fury that he couldn't fire back. Seeing that their greatest weapon was useless and about to get himself killed in his anger, Fett ran out and slipped the power core back into place, which had been hidden at an earlier date under a dais by the architect, and was revealed only when Fett entered a code into a device on his wrist that detonated it. D'harhan began to blast away at the mercenaries, decimating their numbers."}, {"tag": "p", "text": "Soon though, his wounds began to accumulate, as his body was merely flesh and blood. First his knees buckled, then he fell to the ground, unable to hold up the great weight of his cannon any longer. Fett ran out to his comrade once more, and tore free the connections from D'harhan's back, allowing Fett to fire the weapon himself. Fett finished off most of the remaining mercenaries, forcing those who survived to surrender. Gheeta, furious his plan had failed, confronted both the mercenaries and Fett. Fett then pushed D'harhan forward, placing the cannon inside the Shell Hutt's armored body. He fired the weapon inside Gheeta's shell, completely liquefying the Hutt."}, {"tag": "p", "text": "Fett then laid the mortally wounded bounty hunter on the ground, holding him as he lay dying. D'harhan said he should never have trusted Fett, to which Fett agreed. D'harhan then said that he could stop now, but Fett still must go on. He then died in Fett's arms."}, {"tag": "p", "text": "Fett would later reflect that he considered D'harhan to be just another part of his past that had been erased. In the Marzoon sector in 5 ABY, Fett revealed to the Assembler Balancesheet the story of how D'harhan became enhanced, in exchange for information on a bounty."}, {"tag": "h2", "text": "Weapon system"}, {"tag": "p", "text": "D'harhan had, when his planet was at war, submitted himself to a radical surgery, whereupon he was essentially transformed into a walking cannon. This weapon was reportedly strong enough to pierce light starship armor or vaporize enemy infantry. His entire head had been removed, and its functions replaced cybernetically. The cannon, which took the place of D'harhan's head, was bolted to his collarbones, as well as attached to an anchoring plate placed into his chest. A primitive gear functioned as the cannon's vertical lifting mechanism. Two power cylinders flanked his metal spine, and power cables looped under his arms and around his chest. He also possessed a saurian-like cybernetic tail, which was long and segmented. When firing, the tail functioned like the back leg of a tripod, steadying D'harhan against the weapon's kick. The weapon was cooled by a relatively primitive cooling system, one that dated back to the early days of the Galactic Republic, which generated a great deal of steam when the weapon was powered up (such as when D'harhan was angry) or when it was firing."}, {"tag": "p", "text": "The cannon was flanked on either side with targeting sensors and indicator lights, all of which was wired directly into his nervous system. The targeting sensors functioned as his eyes, and the cannon \"looked\" everywhere D'harhan did. The indicator lights allowed others to know D'harhans mood; yellow was a stand-by mode, orange meant danger, and red meant he was ready to fire."}, {"tag": "p", "text": "D'harhan's brain was moved to an armored box in his midsection, covered by a thick chest plate. As he no longer possessed a mouth, he required the use of a small box that he kept clipped to his belt, which contained both a speaker and a screen which could silently display words. A keyboard allowed D'harhan to communicate with others, albeit rarely, and slowly. It was mentioned by Boba Fett, during the mission to Circumtore, that when there were many cyborgs of the same type they communicated through an internal com-link network, presumably also attached directly to the nervous system."}, {"tag": "p", "text": "During his \"sleep\"—which was more akin to a stand-by function—the cannon still tracked movements around him, as well as allowed him to both sense when others approached, and hear what was being said."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}