{"url": "D%27larah", "categories": ["Category:Legends articles", "Category:Cities on Demophon", "Category:Destroyed cities", "Category:Galactic Empire cities"], "nodes": [{"tag": "h1", "text": "D'larah"}, {"tag": "p", "text": "D'larah was a city on the planet Demophon. During the height of the Galactic Empire, the city became very wealthy. Near the end of the Galactic Civil War, the Demophon star went supernova, devastating the Demophon system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Like all cities on Demophon, D'larah was domed to protect its citizens from hard radiation, and designed to be a center of scientific development and research. Unlike the other cities on Demophon, however, D'larah was also designed to be a pleasant place for the affluent to live. Broad avenues, wide sidewalks, and plenty of shade trees and vegetation add to the atmosphere of the city. D'larah also boasts one of the few parks on the planet, Jhonterius Park, the jewel of the city. In addition to many imported flora and fauna from other worlds, the D'larah Palm Tree was genetically engineered specifically for the park."}, {"tag": "p", "text": "Major employers in D'larah include Shankti Drive Works, Tumleh Navigation, and of course the government. Due no doubt to its beauty, the city also has a healthy tourist trade. There are a few casinos and entertainments brought from off-planet to facilitate this. Marquo's is a renowned local eatery. A small spaceport straddles the commercial and industrial zones, though almost half of the 50 docking bays are reserved for testing prototype vehicles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "D'larah was founded by Jhonterius. One of the previous city governors was related to an Imperial official of high standing. This allowed D'larah to grow and flourish in its early days with very little Imperial interference. The name of this governor and their relation were lost to history by the Galactic Civil War, but their legacy is seen in the relatively light hand the Empire takes in D'larah, at least compared to the rest of the planet."}, {"tag": "p", "text": "Shankti Drive Works and Tumleh Navigation were founded on Demophon almost simultaneously, and they work closely together, with Shankti designing hyperdrives and Tumleh designing the hyperspatial navigation systems."}, {"tag": "p", "text": "Of course the announcement that Demophon's sun was heading for supernova changed everything. The situation became one of barely restrained panic. The citizens told themselves that the corporations that had always governed their lives would protect them, but evacuating six million people would be expensive and time-consuming. Shankti and Tumleh both announced that they had evacuation plans, but many believed these plans only called for the evacuation of a few thousand top employees. Smaller companies began to leave the planet in anticipation, and those that could do so sought to secure their berths on outgoing starships."}, {"tag": "p", "text": "With the rise in panic came a rise in violent crime, especially near the starport and Jhonterius Park. As the D'larah City Patrol found itself stretched thinner, they began shooting first and asking questions later. An old spare parts warehouse was turned into a makeshift jail to house D'larah's new criminal element."}, {"tag": "p", "text": "D'larah was destroyed with the rest of Demophon when the system's sun went supernova."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "D'larah had been a corporate-influenced city since its founding. Most citizens worked for either Shankti Drive Works or Tumleh Navigation. Because both these companies dealt with prototype technology they required high security, provided by the D'larah City Patrol, the local law enforcement agency. As more and more DCP members evacuated prior to the supernova, however, some holes began to open in the normally tight security net."}, {"tag": "p", "text": "Shankti and Tumleh both appointed two members of the City Council, with two more members selected by the residential sector, and two more from the commercial sector. The City Council was D'larah's main policymaking body, although all measures to be enacted first had to be approved by City Governor Jaspar Skeete. The Governor's veto could be overridden, however, by a two-thirds majority vote from the City Council, or by Imperial representatives. This latter option never occurred during the history of the city."}, {"tag": "p", "text": "Outside of Shankti and Tumleh, most inhabitants of D'larah were employed by the government. Not only did the bureaucracy require many members, but D'larah's abundant flora and large park required many maintenance personnel."}, {"tag": "p", "text": "As the supernova drew near, society began to break down. A small black market dealing in suddenly scarce luxuries, the G'uotr Network, made fantastic profits despite the DCPs attempts to shut it down. This brought smugglers to D'larah, and one of the most precious commodities was people trying to evacuate the planet. Some smugglers even took to landing outside the dome for quick getaways, despite the danger of hard radiation."}, {"tag": "p", "text": "Shootouts in Jhonterius Park or the starport became common, and the makeshift jail was overflowing with alleged criminals still awaiting trial. A messenger service and law practice sprang up near the jail, offering to expedite cases and deliver bribes to where they would do the most good, for a price of course."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}