{"url": "D1-series_aerial_battle_droid", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:B-series battle droid models", "Category:Techno Union products"], "nodes": [{"tag": "h1", "text": "D1-series aerial battle droid"}, {"tag": "p", "text": "The D1-series aerial battle droid, also known as the D-wing air support droid, D-wing security droid or simply the D-wing droid, was a D1-series aerial battle droid and a variant of the B-series droid line. The droids had wings that they used to pursue enemies to areas where normal battle droids could not. They were developed by the Techno Union, who operated out of a facility on the planet Skako Minor. They were active throughout the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "D1-series aerial battle droids were security droids that were developed as an experiment of the Techno Union, who were allies of the Confederacy of Independent Systems. The droids were used as security at the Techno Union facility in the city of Purkoll on Skako Minor."}, {"tag": "p", "text": "D-wing droids were variant battle droids that were part of the B-series droid line. They were armed with built-in blasters and could use fold-out wings to enter flight mode. They had programming similar to the common Separatist B1-series battle droid, and, although they had a different shaped head, otherwise appeared similar."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, in 22 BBY, D-wing air support droids were used by Wat Tambor at the floating city Nexus to defend the city from infiltration. However, the clone trooper squad called the Wolfpack, consisting of Clone Commander Wolffe, Clone Sergeant Sinker, Clone Corporal Comet, and clone trooper Boost were able to penetrate the defenses of the Nexus and rescue the city's custodian, Orkle."}, {"tag": "p", "text": "Towards the end of the Clone Wars, the clone commandos of Clone Force 99 and Clone Captain \"Rex\" and ARC trooper CT-5597 \"Jesse\" of the 501st Legion—Jedi General Anakin Skywalker and Clone Captain Rex—infiltrated the Techno Union base to rescue the captured ARC trooper Echo. D-wing droids were deployed to kill the intruders, but ultimately failed as Echo was successfully rescued. After the rescue squad fled to the local Poletec village, more D-wing droids—along with two octuptarra magna tri-droids—engaged the Republic forces in combat. When the Republic was aided by the local Poletecs, they defeated the Separatist forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "D-wing air support droids first appeared in the unfinished version of Star Wars: The Clone Wars episode \"A Distant Echo.\" The droids again made an appearance in the unfinished version of \"On the Wings of Keeradaks.\" Finished versions of these episodes began release in February of 2020 on Disney+, in which the D-wings made their first appearance in a completed render."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}