{"url": "DC-17m_Interchangeable_Weapon_System/Legends", "categories": ["Category:Legends articles", "Category:BlasTech Industries products", "Category:Blaster rifles", "Category:Blaster sniper rifles", "Category:Ion weaponry", "Category:Portable launchers"], "nodes": [{"tag": "h1", "text": "DC-17m Interchangeable Weapon System"}, {"tag": "p", "text": "The DC-17m Interchangeable Weapon System (DC-17m ICWS) was a configurable combat weapons system used by the clone commandos of the Galactic Republic. Designed by BlasTech Industries to be able to meet the demands of the Grand Army of the Republic's elite special forces soldiers, the DC-17m became the unique weapon of the Republic commandos throughout the Clone Wars. An adaptable weapon, the DC-17m was capable of fulfilling multiple combat roles due to its ability to reconfigure into either a standard blaster assault rifle, a compact sniper rifle, or an anti-armor grenade launcher, depending upon the needs of the user. These traits made the DC-17m invaluable to its clone commando owners, and the DC-17 proved a dangerous weapon against the Confederacy of Independent Systems on countless battlefields across the galaxy, from the deserts of Geonosis, to the cityscape of Coruscant, and the forests of Kashyyyk."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A product of BlasTech Industries, the DC-17m Interchangeable Weapon System was a lighter and more versatile version of the DC-15 blaster issued to the clone trooper infantry of the Grand Army of the Republic. Manufactured to a higher level of specification, the DC-17m's design ensured that it never jammed in the presence of excessive heat, cold, dust, or grime, though it required periodic calibration. The DC-17m shared many of its internal parts and components with the smaller and similarly designated DC-17 hand blaster. Unlike the blaster pistol, the DC-17m was, at its root, a base stock which could be configured several different ways depending upon the needs of the user by way of numerous attachments: a standard blaster rifle, a high-powered sniper rifle, and an anti-armor grenade launcher. For the clone commandos for whom the rifle was standard issue and who trained with the DC-17m from a young age, changing the attachments was no more difficult than changing out a spent ammunition clip, and they appreciated the reduction in load the DC-17 afforded them by combining three weapons on one platform. The DC-17m stock was sturdy enough to be used as a melee weapon in close combat, and the rifle had a safety setting to reduce misfires. Each DC-17m cost around 4500, and Republic Procurement was continuously seeking new add-ons for the weapon during the course of the Clone Wars."}, {"tag": "h3", "text": "Blaster"}, {"tag": "p", "text": "Perhaps the most often used attachment, the blaster rifle attachment, made the DC-17m a powerful, rapid-firing ion pulse assault rifle. Drawing its power from side-loaded power pack clips, the DC-17m blaster could fire a maximum of sixty shots before requiring a reload; a commando's typical gear load included five power packs, for a total of three hundred rounds."}, {"tag": "p", "text": "The cross-trained commando, Corr—having served previously as a clone trooper in ordnance disposal prior to learning commando skills—found the left-mounted energy clip on the DC-17m's blaster to be a hindrance when holstering for beings that favored their right hand. First generation commandos that had been trained with the weapon since youth found no such complaint with the DC-17m, though they did note the oddity of the layout once the point was raised."}, {"tag": "h3", "text": "Sniper rifle"}, {"tag": "p", "text": "The second attachment for the DC-17m allowed the blaster to convert into a long-range sniper rifle with a electromagnetic targeting scope. The rifle fired projectiles encased in blaster energy, similar to the quarrels used by Wookiee bowcasters. Ammunition magazines for the sniper attachment carried five quarrels each. The electromagnetic scope had two levels of zoom, adjusting the range between 10x and 20x magnification. The sights also provided an effect similar to an x-ray at close range. A well-placed shot from the DC-17m's sniper attachment was known to be capable of killing many types of enemies, from droids to several species of organics. The sniper attachment was the preferred DC-17m configuration of the clone commandos Sev and Fi, both of whom trained intensively as snipers."}, {"tag": "h3", "text": "Anti-armor"}, {"tag": "p", "text": "A third configuration for the DC-17m was made possible by an attachment that transformed the rifle into an anti-armor grenade launcher. The launcher was loaded, one at a time, with dumb-fire grenades that could be launched several feet away from the user, and detonated on impact with any hard surface. Though the grenades were especially effective against heavily armored targets, the wide blast radius of the explosion made them good for damaging or destroying small enemy formations. Each grenade cost four hundred credits, and due to the size of the grenades, commandos typically carried only around four on their person. However, a number of individual clones chose to equip their armor with additional holsters for carrying extra anti-armor rounds. One such clone was the Delta Squad commando Scorch, who favored the explosive power of the grenade launcher attachment in battle."}, {"tag": "h3", "text": "Additional attachments"}, {"tag": "p", "text": "By the time of the second anniversary of the Battle of Geonosis, a fourth attachment to the DC-17m had been introduced to the Grand Army's clone commandos: the non-lethal Pulsed Energy Projectile—or \"PEP\"—laser. Originally a tool of galactic law enforcement agencies, the PEP laser was effective in riot and crowd control, or any other situation where death was undesirable. The weapon utilized a deuterium fluoride laser to stun targets into submission without inflicting permanent harm, although severe bruising and lingering pain were among potential side effects. The PEP laser attachment produced a powerful shockwave of both light and sound when it was discharged, and the impact from the device was described by one clone user as similar to being hit with a flash-bang grenade and struck in the chest by several plastoid rounds at the same time."}, {"tag": "p", "text": "In the third year of the Clone Wars, the Merr-Sonn Munitions corporation released a fifth attachment for the DC-17m, this time a rapid-entry breaching grenade. While similar to the anti-armor attachment in many ways, the Merr-Sonn breaching grenade was specially designed to blow open sealed doors and hatches from a safe distance, and was fired from a stand-off rod placed at the end of the DC-17's muzzle. The breaching grenade drew a few small criticisms from the soldiers who used it: one clone commando stated that the stand-off rod made the DC-17 unwieldy and could potentially impair aiming, while another believed that it was too blunt of an instrument and an insult to their years of elite training. In spite of these minor complaints, the attachment proved itself to be a useful tool in executing door breach maneuvers where a potentially dangerous and hostile force could be waiting on the other side."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The DC-17m Interchangeable Weapons System was one element of the standard issue equipment provided to all clone commandos in the Grand Army of the Republic's special forces division, and their primary weapon in combat. Growing up on Kamino, the clones were educated from a young age in how to utilize the advanced blaster rifle, first by Kaminoan flash training simulation programs, then by the Cuy'val Dar sergeants recruited by Jango Fett to further train the commandos. Live-fire exercises in the clone military education complex of Tipoca City honed the clones' skill with the DC-17m, and while each commando held their preference for the individual attachments and configurations, by the start of the Clone Wars, the commandos were capable of wielding the DC-17m blaster with incredible efficiency."}, {"tag": "p", "text": "As the weapon of choice for the Republic's clone commandos, the DC-17m made its mark on numerous fields of battle across the galaxy. On the red desert plains of Geonosis during the war's first battle, ten thousand clone commandos brought their DC-17s against the forces of the Confederacy of Independent Systems. Notably, the commandos of Delta Squad wielded their rifles with deadly effectiveness in the destruction of a Geonosian droid foundry and a raid on a Confederacy Lucrehulk-class Core Ship. The DC-17m would further prove its worth on the Mid Rim world of Qiilura, where the Omega Squad's elite commandos destroyed a Confederacy bioweapons facility and captured the CIS scientist, Ovolot Qail Uthan. The DC-17m enjoyed continued use during a Republic covert strike on the snow-covered planet Fest, a multi-squad undertaking to destroy a Jabiimi terrorist cell operating on Coruscant, the hunt for the rogue Kaminoan cloner, Ko Sai, and the battle of Haurgab. Clone commandos relied on their DC-17m blasters during the attack on Coruscant orchestrated by General Grievous, Supreme Commander of the Droid Armies of the Confederacy, late in the war. The specialized assault rifles were also instrumental to the commandos of Delta Squad during their assigned mission to the arboreal homeworld of the Wookiees, Kashyyyk, and in the subsequent battle that erupted between the Confederacy and Republic shortly after. Hondo Ohnaka's pirates also made use of these weapons."}, {"tag": "p", "text": "After the transformation of the Galactic Republic into the new Galactic Empire, the clone commandos that had formerly served in the Republic Grand Army's Special Operations Brigade were reassigned to the Imperial Commando Special Unit—a new special operations division within the Imperial Army's 501st Legion, under the command of Darth Vader. Despite the changes to their serial numbers, their armor, and the names of their squads, the commandos were allowed the retention of their DC-17m rifles. Commandos from Imperial Squad 40 used their DC-17s in a confrontation with former Jedi Master Iri Camas, and to hunt down the Jedi Knight Borik Yelgo, missions that both ended with the targets' death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The DC-17m Interchangeable Weapons System first appeared in the 2004 novel Republic Commando: Hard Contact, by author Karen Traviss as a tie-in to the subsequent 2005 video game Star Wars: Republic Commando, for which the weapon was created and prominently featured. The DC-17, as the blaster used by all the clone commandos, went on to appear in every novel in the Republic and Imperial Commando series. The 2008 reference book The Complete Star Wars Encyclopedia featured a brief informational entry for the DC-17m."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}