{"url": "DC-17_hand_blaster/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles needing additional sources", "Category:BlasTech Industries products", "Category:Heavy blaster pistols"], "nodes": [{"tag": "h1", "text": "DC-17 hand blaster"}, {"tag": "p", "text": "The DC-17 hand blaster, also known as DC-17 blaster pistol, was a heavy blaster pistol wielded by the clone troopers of the Grand Army of the Galactic Republic during the Clone Wars. An advanced firearm, it was fielded to elite soldiers in the army, most notably Advanced Recon Commandos, clone trooper commanders, and clone jet troopers."}, {"tag": "p", "text": "It shared many similarities with the DC-15s side arm blaster used by clone commandos, being a more powerful variant of the standard DC-15S blaster carbine. Capable of a much higher rate of sustained fire than its predecessors, the commando pistol was known for its efficiency and deadliness. As a result, it was a popular style for the clones that favored it to wield two at a time, as typified by ARC-77 \"Fordo\" and CT-7567 \"Rex\"."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Like all blasters of the DC-line manufactured by BlasTech Industries, the DC-17 hand blaster fired blue plasma projectiles that were hyper-ionized to be especially devastating against droids while retaining its lethality against organic beings. As a blaster pistol, it could be utilized as a side-arm, and for these two reasons, it was similar in function to its more common cousin, the DC-15S blaster carbine favored as a standard secondary weapon among clone troopers."}, {"tag": "p", "text": "Unlike the DC-15S, however, the DC-17 was not only more compact, but also more powerful. Alongside its superior firepower, it boasted lower recoil and a higher rate-of-fire, and consequently, it was far more efficient than its predecessors. Because of its status as an elite firearm, it was also known as a commando pistol and was regarded as an extremely deadly weapon."}, {"tag": "p", "text": "The blaster carried a stun setting, as employed effectively by CC-3636 \"Wolffe\" against the Jedi Ahsoka Tano when she was framed for the bombing of the Jedi Temple. Besides this, it could be customized to accommodate a cable launcher, which CC-3714 \"Fil\" used to save his life when he fell down a trap door during a raid on Grievous's castle."}, {"tag": "p", "text": "The DC-17 blaster pistol should not be confused with the DC-17m Interchangeable Weapon System, though it did share its designation with the larger weapon for a reason—they shared many of their interior components, a fact which helped explain the DC-17 hand blaster's unusually high stopping power and firing rate.[source?] This fact was widely appreciated by the users of the weapon, who tended to know them inside and out as part of their training.[source?] As a result, ARCs in particular tended to look down on uninformed people who puzzled over the similarity of the naming for two such apparently different weapons.[source?] High ranking ARC officers sometimes customized their DC-17s by writing on them or adding attachments such as revolving system or even a scope.[source?]"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the DC-17 blasters was standard issue for clone jet troopers but was also favored among high-ranking clone troopers."}, {"tag": "p", "text": "A popular trend adopted by clone commanders was to wield two DC-17 blasters simultaneously in a style reminiscent of their progenitor Jango Fett.. Such examples include CC-3714 \"Fil\", CC-5052 \"Bly\" (whose DC-17 were modified with krayt dragon pearl handles)[source?], CC-6454 \"Ponds\", CC-1993 \"Jet\", and CC-1010 \"Fox\"."}, {"tag": "p", "text": "This style was iconic for the clone trooper captains ARC-77 \"Fordo and CT-7567 \"Rex\", the former who led his forces at the Battle of Muunilinst and the Battle of Hypori in this manner. Unlike his brethren who switched off with a DC-15A blaster rifle or DC-15S in some battles, Rex utilized his twin DC-17 almost exclusively throughout the entire war."}, {"tag": "p", "text": "The DC-17 blaster saw service with the Null-class Advanced Recon Commando Captain Ordo Skirata as well. In one incident, he employed them to great effect when he, along with Omega Squad, Delta Squad, Sergeant Kal Skirata, former Sergeant Walon Vau, Jedi Generals Bardan Jusik and Etain Tur-Mukan,and later Null-class ARC Lieutenant Mereel Skirata raided a landing strip to expose a terrorist operation on Coruscant."}, {"tag": "p", "text": "When Kamino rebelled against the Galactic Empire in 12 BBY, clone jet troopers were prominent among the ranks of the anti-troopers fielded by the Kaminoans, and like their counterparts in the former Grand Army of the Republic, they all equipped DC-17 commando pistols as their side-arms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The design for the DC-17 blaster seen in The Clone Wars film and television series differs markedly from its design in some media that predates it though there is no confirmation whether or not this is meant as a retcon. Though popularized by The Clone Wars, this new design actually first appears in Dark Times 2 where it can can be seen being held by a member of the 203rd Division. The original design appears to have been built from a Magnum Research Desert Eagle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}