{"url": "DC-15x_sniper_rifle/Legends", "categories": ["Category:Legends articles", "Category:BlasTech Industries products", "Category:Blaster sniper rifles"], "nodes": [{"tag": "h1", "text": "DC-15x sniper rifle"}, {"tag": "p", "text": "The DC-15x sniper rifle was a sniper rifle manufactured for the clone snipers of the Galactic Republic through extensive modifications of the standard-issue DC-15A blaster rifle."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "While the DC-15A blaster rifle produced by BlasTech Industries was equipped with a sniper scope that doubled as hand-holds for the long barrel, it was not a true, dedicated sniper rifle. For this reason, the DC-15x was conceived to serve in this capacity, and its design relied on the DC-15A as a base, from which it was heavily modified."}, {"tag": "p", "text": "Featuring additional sights, the DC-15x boasted exceptional accuracy in the hands of a sharpshooter specialist. Like the DC-15A, it fired powerful blue, hyper-ionized plasma bolts that were highly effective against droids and organics alike. The fully automatic capability of the DC-15A was not carried over, however, nor was its ammunition capacity, and each clip held only five or six shots. In exchange, the shots of the sniper rifle were long beams that delivered far more power."}, {"tag": "p", "text": "While the DC-15x carried more ammo than its Separatist counterpart, the E-5s sniper rifle, the E-5s had a higher magnification level and could be fired fully automatic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The DC-15x sniper rifle was manufactured for the express use of clone troopers of the Grand Army of the Republic that had undergone the special flash training needed to become snipers. During the Clone Wars, these clone snipers were deployed from the conflict's very inception, and the sniper rifle saw service on battlefields such as the First Battle of Geonosis, the First Battle of Kamino, and the Battle of Rhen Var."}, {"tag": "p", "text": "Employment of the weapon continued to the end of the war, and snipers of the 501st Legion wielded these rifles at the Battle of Mygeeto, Battle of Felucia, and the Battle of Kashyyyk. With the Great Jedi Purge, the 501st carried these sniper rifles into the Jedi Temple on Coruscant during Operation: Knightfall though the snipers that stayed behind after the mission were also known to have utilized a different, larger model of sniper rifle."}, {"tag": "p", "text": "While the DC-15x was the primary sniper rifle of the Grand Army of the Republic, the DC-17m weapons system employed by clone commandos could be converted into a high-powered ion sniper rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The DC-15x sniper rifle appears in the Star Wars: Battlefront video game series and in the Star Wars: Clone Wars comic The Package."}, {"tag": "p", "text": "It bears a resemblance to the real-life German MG-42 machine gun and FG-42 battle rifle."}, {"tag": "p", "text": "Although BlasTech Industries is mentioned as the manufacturer for many of the weapons of the Star Wars: Battlefront series in their strategy guides, it is not stated as such for the DC-15 line of weapons whose manufacturer is instead simply named as \"Republic\". While the DC-15A blaster rifle and DC-15S blaster carbine are confirmed as products of BlasTech in other sources, this is not the case with the DC-15x even if it is a reasonable assumption."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}