{"url": "DC0052_speeder", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Airspeeders", "Category:Daystar Craft products", "Category:Galactic Republic repulsorcraft"], "nodes": [{"tag": "h1", "text": "DC0052 speeder"}, {"tag": "p", "text": "The DC0052 speeder, nicknamed \"Intergalactic,\" was an airspeeder utilized by the Jedi Order in the waning days of the Galactic Republic. Developed by Daystar Craft, the two-meter long vehicle featured a top speed of eight hundred kilometers per hour and could travel over two thousand kilometers uninterrupted. The craft was inexpensive to maintain and featured a special \"drop-deployment\" panel that allowed Jedi to enter the heat of battle swiftly while letting the DC0052 land itself with autopilot. Sixteen of the vehicles were kept and maintained by the Jedi High Council."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The DC0052 speeder was a cheap, short-range craft and could travel over two thousand kilometers without interruption. It featured a mid-altitude ceiling of one hundred and seventy kilometers, with a top speed of eight hundred kilometers per hour. The craft's aerodynamic surfaces allowed it to travel swiftly across urban areas, while being propelled by dual Sono-class thrust pods."}, {"tag": "p", "text": "To aid it in its movement, the DC0052 also featured four Daystar Craft repulsorlift generators, which were powered by the unit's durable power supply unit. Unique to the DC0052 was a \"drop-deployment\" panel. The panel would allow a Jedi who had set the craft to land on autopilot to drop out from underneath the craft and enter a situation with due haste. Designed in the shape of a flying wing, the DC0052 had a small, one-being cockpit located centrally."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Manufactured by Daystar Craft, the inexpensive DC0052 speeder was exclusively used by the Jedi Order in the waning days of the Galactic Republic as personal transports to ferry Jedi Knights from one location to another. It was a successor to the earlier DC0040 speeder, which had been touted and advertised as \"Intergalactic\" by Daystar's marketers. Though the \"Intergalactic\" moniker was never formally applied to the DC0052, it was later associated with the craft. DC0052s were primarily found on Coruscant during this time, though they were also used on other worlds."}, {"tag": "p", "text": "The Jedi High Council maintained a fleet of sixteen DC0052 speeders, which they used to ferry themselves all over the galactic capital. In doing so, the Council avoided the need to utilize the planet's public transportation system or to use the already overworked Delta-7 Aethersprite-class light interceptors and Eta-2 Actis-class interceptors in the role. The DC0052's range gave the Jedi access to many of the planet's locations without the need to enter orbit. Some of the units were emblazoned with the insignia of the Open Circle Fleet. Jedi Padawan Ahsoka Tano used the speeders several times on Coruscant around 21 BBY. Tano used one of the transports to find her Master, Jedi Knight Anakin Skywalker, and Senator Padmé Amidala of Naboo at one of the landing pads on the ecumenopolis—from where Amidala was preparing to depart from the capital aboard her J-type diplomatic barge—to deliver some news to them. Tano also used a DC0052 speeder to travel from the Jedi Temple to meet up with Amidala at a landing pad, from where the Senator was about to leave Coruscant on another mission. Similarly Tano also used one of these speeders to travel to a republic prison to speak with Letta Turmond after being requested by her, and when Tano was accused of murdering Turmond she attempt to return to the speeder to escape from the prison, but it was destroyed by a nearby turret. In 19 BBY, Skywalker utilized one of the vehicles to ferry himself from the Jedi Temple to the Republic Executive Building, where the attempted arrest of Supreme Chancellor Palpatine was taking place. Later that year, following the Declaration of a New Order, Jedi Master Obi-Wan Kenobi used one of the vehicles to reach Amidala's apartment, where he met with the Senator."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The DC0052 speeder first appeared in 2005 in George Lucas's Star Wars: Episode III Revenge of the Sith, though it went unnamed in the film. It was later named and elaborated on through the StarWars.com Hyperspace feature, \"What's The Story?.\" The vehicle's backstory and specifications were written by Nathan Butler (Equals and Opposites) and \"The Dark Moose\" (Unstable Terrain Artillery Transport in the Databank). The name had already been established in the submission sheet; \"The Dark Moose\" provided most of the information, although his nickname for the vehicle, the \"Deuce,\" did not make it to the final version of the entry. The vehicle was later given an entry in 2008's The Complete Star Wars Encyclopedia, using information from the speeder's Databank entry. In 2010, over five years since its original creation, the DC0052 speeder was featured in the Star Wars: The Clone Wars television series' third season, first in the episode \"Sphere of Influence\" and later in the episode \"Assassin.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}