{"url": "DH-17_blaster_carbine", "categories": ["Category:Legends articles", "Category:BlasTech Industries products", "Category:Blaster carbines"], "nodes": [{"tag": "h1", "text": "DH-17 blaster carbine"}, {"tag": "p", "text": "The DH-17 blaster carbine, otherwise known as the DH-17 Carbine, DH17 carbine, or sometimes as the DH-17 light rifle, was a heavier version of the DH-17 blaster pistol produced by BlasTech Industries. This blaster carbine saw heavy use by both the Imperial Navy and the Rebel Alliance throughout the course of the Galactic Civil War, due to its durability and versatility."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The DH-17 blaster carbine served as the heavier cousin of the widely popular DH-17 blaster pistol used by the Rebellion, weighing over 1 kilogram. As a more streamlined variant of the popular blaster pistol, the DH-17 Carbine sported a number of practical and cosmetic differences, notably the absence of a scope like the one seen on its lighter counterpart. Much like the pistol variation, the DH-17 blaster carbine was powerful enough to penetrate most personal armor, but it lacked the ability to breach bulkheads and starship hulls, making it ideal for shipboard skirmishes. While most basic DH-17 Carbine's featured a silver-colored barrel, some retrofitted versions were entirely black. The weapon was comprised of various materials, including units of ferrous and non-ferrous metal, as well as polymer. In addition to a blaster rifle barrel, DH-17 Carbine's were manufactured with a ranged weapon core, and the carbine could be optionally fitted with a scope and stock. The carbine was capable of firing at a medium range, and had both a stun setting and auto-fire capabilities. The weapon closely resembled the CDEF carbine, a weapon favored by the Corellian Security Force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The blaster carbine variant of the DH-17 saw heavy use by both the Galactic Empire's Imperial Navy and the Alliance to Restore the Republic throughout the course of the Galactic Civil War. Lauded for its durability and versatility, it became a mainstay with Rebel soldiers due to its simple design and the wide availability of replacement parts on the black market. Rebel marines often installed a spread barrel modification to make it a deck sweeper commonly referred to as the DH-17 short carbine. That, combined with the DH-17's auto-fire capabilities, allowed troopers to blanket an entire starship corridor with blaster fire."}, {"tag": "p", "text": "The weapon was suitable for novice marksmen, and polished black versions were favored by bounty hunters, commandos, and spies. Cerca 1 ABY, Rebel Alliance hero Han Solo provided a DH-17 Carbine to at least one intrepid spacer rescued from an Imperial space station. A skilled marksman by the name of Loche Crestingsky also possessed a DH-17 Carbine of his own while staying aboard Tansarii Point Station in the Bright Jewel System. While the carbine was primarily manufactured by BlasTech Industries for a standard price of 900 credits, schematics of the weapon were also available to independent weaponsmiths and munitions traders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The DH-17 blaster carbine was included as a carbine in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The weapon could be crafted by weaponsmiths and used by novice players of the marksman profession. Following the release of Publish 25's New Game Enhancements on November 15, 2005, weaponsmiths were removed, however the weapon could still be constructed by players of the newly created munitions trader profession. The weapon could be constructed using a number of different components and resources, including ferrous and non-ferrous metal, and polymer."}, {"tag": "p", "text": "As part of the New Player Tutorial featuring Tansarii Point Station, Han Solo would give players of the bounty hunter, commando, and spy professions a polished black version of the DH-17. Players could also choose to receive Loche Crestingsky's DH-17 carbine by completing the quest \"Stopping the Slicers\" aboard Tansarii Point Station. In Squadrons Over Corellia, the first expansion of the Star Wars Galaxies Trading Card Game released on December 16, 2008, the DH-17 Carbine was introduced as a game card. The artwork for the carbine illustration was completed by Keun Chul Jang. Capitalization and hyphenation of the weapon's name was somewhat inconsistent between and within sources. In Star Wars Galaxies alone, the weapon was referred to in various descriptions as a DH17 Carbine, DH17 carbine, or simply as a DH-17. At least one description referred to it as a DH-17 light rifle. The Fantasy Flight Games sourcebook Forged in Battle, released on August 18, 2016, provides the full name of DH-17 blaster carbine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}