{"url": "DJ-88", "categories": ["Category:Legends articles", "Category:Droids of the Jedi Order", "Category:Educators", "Category:Masculine programming", "Category:Third-degree droids"], "nodes": [{"tag": "h1", "text": "DJ-88"}, {"tag": "p", "text": "DJ-88, or Dee-Jay, was a third-degree droid affiliated with the old Jedi Order. A white, humanoid droid with red photoreceptors, DJ-88 was designed by its Jedi creator to protect the Lost City of the Jedi, a secret library and terraforming station located deep below the surface of Yavin 4."}, {"tag": "p", "text": "When the infant Ken was brought to the Lost City by a brown-robed Jedi Master, DJ-88 became his tutor. The ancient droid acted as a surrogate father to the young Jedi Prince, until Ken encountered Luke Skywalker and became the youngest member of the Alliance to Restore the Republic in 5 ABY."}, {"tag": "p", "text": "DJ-88's \"life\" ended the same year, when the pseudo-Kadann, an agent of the Galactic Empire posing as the Supreme Prophet of the Dark Side, raided the Lost City and ordered the deactivation of the old droid."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Caretaker of the Lost City"}, {"tag": "p", "text": "After the end of the Great Sith War, the fourth moon of Yavin Prime bore the scars of a terrible orbital attack by the Jedi Order. The Jedi, wishing to repair the damage done to Yavin 4's environment, established an underground city, the function of which was to restore the moon's ecosystem. When all the Jedi Knights left the city for good, the library and weather station were entrusted to the good care of droids. This location, now known as the Lost City of the Jedi, was run entirely by artificial intelligence for millennia, with older droids building newer ones as they aged."}, {"tag": "p", "text": "A few years before the start of the Galactic Civil War, the already ancient but powerful DJ-88 was in charge of the Lost City of the Jedi, serving both as caretaker and teacher. At some point, an unidentified Jedi Master concealed behind brown robes reached the fourth moon of Yavin, bringing the infant Ken with him. Ken was the baby son of Triclops, Emperor Palpatine's own offspring, and the Jedi Princess Kendalina, who had been killed by the Galactic Empire. DJ-88 was instructed to raise Ken and educate him. The chief caretaker droid fulfilled his mandate conscientiously, teaching the young boy ecology, astronomy, computers, and about fifteen other subjects."}, {"tag": "p", "text": "For about twelve years, DJ-88 educated and protected Ken the best way he could, in hopes that the boy's Jedi heritage could win out over the dark side that was also a part of his heritage. The white droid chose not to reveal the terrible truth to his pupil, as knowing he was the grandson of Emperor Palpatine would have have left him with irreparable trauma. The secrets of Ken's origins had to be kept until the prince became a grown man—old enough to face the truth."}, {"tag": "h3", "text": "Protecting the Jedi Prince"}, {"tag": "p", "text": "In 5 BBY, DJ-88's protégé broke the rules and ventured at the surface of the moon. The droid found Ken discussing with Luke Skywalker, a modern-day Jedi and hero of the Rebel Alliance. DJ-88 knew of Skywalker, but the droid didn't immediately agreed to let Ken go with him, despite the boy's eagerness to join the Alliance. The caretaker robot raised his hands and filled the air with a blinding smoke, which allowed him to take the Prince back to the city unnoticed. Some time later, Ken once more escaped, hitting the Topworld during an Imperial attack which was burning the forests to the ground. DJ-88 went to the rescue of his pupil, and he encountered the heroes of the Rebellion. Now properly introduced, Skywalker and DJ-88 decided to work together in hopes of putting an end to the fires. When the battle was over, the old droid admitted it was time for Ken to explore the wider galaxy, and allowed Luke Skywalker to take the child with him."}, {"tag": "p", "text": "However, Skywalker and Ken were captured by stormtroopers while on a quest in the mushroom forests of Arzid. They were taken to the members of the Church of the Dark Side, a sham religion supposedly made up of the Prophets of the Dark Side. Their leader, a Bimm impersonator posing as the Supreme Prophet Kadann, planned to steal the ancient knowledge of the Jedi that was contained in the Lost City's library, and tempted the young Jedi Prince into revealing the location of the Lost City of the Jedi. Eager to learn about his origins, Ken betrayed his city and brought the Prophets to it. When the droid DJ-88 saw the Imperials storming the library, he asked Ken about the motivation of his betrayal. As all seemed lost, the caretaker droid decided the time had come to tell the truth. DJ-88 revealed the Jedi Prince's frightful origin story in considerable detail. Not wanting to believe it, Ken started crying, pounding on Dee-Jay's chest. The old droid tried to console his pupil, and the Kadann impersonator then ordered to deactivate the caretaker droid. An Imperial agent swiftly reacted, opening a panel in the old droid's back and deactivating him. DJ-88 stood silent and motionless."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A third-degree droid, DJ-88 belonged to the most advanced class of droids ever invented. A towering robot, the caretaker had a white plating and vaguely looked a stormtrooper from a distance. It had a strong, dignified face complete with a metallic beard-like appendage and radiant red photoreceptors that shone like rubies. DJ-88 lacked any offensive equipment, but he could raise his hands and release a foggy white smoke from his fingertips. This blinding mist was used as a means of defense against enemies, as a screening device to cover the droid's movements."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}