{"url": "DL-18_Blaster_Pistol", "categories": ["Category:Legends articles", "Category:BlasTech Industries products", "Category:Blaster pistols"], "nodes": [{"tag": "h1", "text": "DL-18 Blaster Pistol"}, {"tag": "p", "text": "BlasTech Industries' DL-18 Blaster Pistol was an inexpensive blaster commonly used during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The DL-18 Blaster Pistol was manufactured by BlasTech Industries. They weighed one kilogram, and the blaster power pack carried one hundred shots. The weapon had a range up to one hundred and twenty meters. DL-18s cost five hundred credits to buy, and replacement power packs retailed for twenty-five credits."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For decades, the DL-18 was one of the galaxy's most prevalent blaster pistols. The basic design was the foundation for several of BlasTech's later designs, and the weapon was versatile to be used in multiple situations. The DL-18's chief competition was Merr-Sonn Munitions, Inc.'s Model 44. The weapons were often modified by their owners. The weapon was considered to be practically disposable due to its inexpensive price."}, {"tag": "p", "text": "Officers serving in the Alliance to Restore the Republic, such as Bria Tharen, favored the lighter, sleeker, DL-18s over heavier blaster pistols. The Sith Shadows also favored the weapon. The weapon was also known as a \"Mos Eisley Special\"—named after the Tatooinian city—due to the fact that it was a common weapon in use amongst the criminals of the settlement. The weapons were common among the guards working for Jabba the Hutt. The gunslinger Longo Two-Guns armed himself with twin DL-18s."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The The Rebel Alliance Sourcebook and Arms & Equipment Guide both feature incorrect images of the DL-18. The correct image is sometimes referred to informally as a \"Skiff guard pistol\" and can be seen clearly in Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}