{"url": "DLT-20A_blaster_rifle/Legends", "categories": ["Category:Legends articles", "Category:BlasTech Industries products", "Category:Longblasters"], "nodes": [{"tag": "h1", "text": "DLT-20A blaster rifle"}, {"tag": "p", "text": "The DLT-20A (also called a \"longblaster\" or \"longbarrel\") was a blaster rifle manufactured by BlasTech Industries sometime before the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The BlasTech DLT-20A blaster rifle was a long-barreled rifle (sometimes referred to as a \"longblaster\") with a top-mounted rangefinder and electronic sight. It had automatic and semiautomatic settings and a rate of fire very close to that of the DC-15A blaster rifle and other longblasters. This was one of the few blaster models produced with a magnatomic adhesion grip, keeping the weapon firmly in the wielder's grip and making him or her more difficult to disarm. With additional collimating rings and longer conduits of galven circuitry, these rifles have improved consistency in their shots."}, {"tag": "p", "text": "The DLT-20A required a power pack, which could hold 30 shots. The weapon cost 1,300 credits to purchase, but its sale and use was restricted to legitimate military organizations and police forces."}, {"tag": "p", "text": "The DLT-20A was similar in design to the BlasTech A295 blaster rifle and the E-17d sniper rifle favored by the Rebel Alliance. From the design of the DLT-20A came the A280 blaster rifle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The DLT-20A was primarily used by mounted troops, especially Republic recon patrols that used local planetary wildlife as their mounts. They favored this rifle since the ability to hit a foe at a great distance was highly valued in their reconnaissance missions."}, {"tag": "p", "text": "This weapon was later commonly used by the stormtroopers of the Galactic Empire when other standard-issue blasters proved to lack long-range accuracy. The notorious droid bounty hunter IG-88 was also known to use this weapon. Because of its high precision, the DLT-20A was often a prized weapon on the black market."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Like many weapons seen in the original trilogy, this weapon appears to be cobbled together from parts of various real-world firearms, such as the action and trigger housing from a late World War II German StG44 assault rifle, with the perforated barrel sleeve from a Browning M1919 machine gun attached. The shoulder stock appears to have been custom-made by the Industrial Light & Magic prop department. While consisting of different parts, the gun is configured closely to the FG42 German Wehrmacht paratrooper automatic rifle, again from the World War II era."}, {"tag": "p", "text": "A Hasbro IG-88 action figure (#87309, 2007) carries a DLT-20A. The Hasbro Battlefront Scout Trooper action figure (#85388, 2004), issued to commemorate the release of the video game, is also equipped with a DLT-20A, but in the game he carries an E-11s sniper rifle, which resembles a DLT-19 with scope added."}, {"tag": "p", "text": "The DC-15x sniper rifle looks similar to these DLT weapons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}