{"url": "DNA/Legends", "categories": ["Category:Legends articles", "Category:Biology"], "nodes": [{"tag": "h1", "text": "DNA"}, {"tag": "p", "text": "DNA was a genetic substance located in the cells of plants, animals, and microorganisms such as bacteria, viruses, and fungi. In animals, it was found in every individual and, with the exception of unaltered clone units and identical twins, was considered unique to each individual. The presence or absence of certain DNA segments could influence the appearance and physical health of an individual, and may even cause some natural mutations to occur in individuals or in populations. Manipulation of DNA was used as the basis in many different types of gene-altering procedures, most notably cloning, gene therapy, genetic hybrid creation and breeding (transmutation), and in the development of bioweapons."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "In animals, DNA was a genetic substance in the body containing units called genes, which contained the genetic information of an individual. Except for unaltered clones and identical twins, DNA was unique to each individual. Depending on what genetic material was inherited from the parents, the presence or absence of some genetic material could influence the appearance of an individual, with certain segments influencing hair (or fur) color, eye color, height, body type, the ability to use the Force, and the aging process, among other things."}, {"tag": "p", "text": "Most DNA samples are recovered via a blood sample, although in at least one case the umbilical cord of a newborn was also useful for genetic studies."}, {"tag": "p", "text": "The structure of DNA differed from species to species. In humans, it appeared as a double helix pattern when viewed."}, {"tag": "h2", "text": "Applications of DNA"}, {"tag": "p", "text": "There are many uses of DNA; listed are some of the most common."}, {"tag": "h3", "text": "Cloning"}, {"tag": "p", "text": "Cloning was the process in which one or more copies of an individual were created from the genetic material of the donor. Clones came in two types: modified and unmodified. Whether modified or unmodified, there was a chance that clones could suffer from genetic defects due to random mutations, even if the genetic structure was untouched."}, {"tag": "p", "text": "Modified clones were clones that have had their genetic material manipulated during the cloning process. Some traits that may have been modified include temperament, intelligence, the acceleration of the aging process, and the ability to augment the clone's connection to the Force. However, sometimes the manipulation of genetic material may cause the clones to become mentally unstable."}, {"tag": "p", "text": "In the development of the Grand Army of the Republic, the first batch of development produced 100 units, twelve of which became the Null-class Advanced Recon Commandos. Since they were highly intelligent and uncontrollable, the Nulls were deemed defective and marked for \"reconditioning\" at the hands of the Kaminoans. Out of the original twelve, six managed to avoid \"reconditioning\" due to Kal Skirata's intervention. The Kaminoans took note of this \"failure\" and used the genetic template of the other 88 clones as the basis of the Grand Army of the Republic."}, {"tag": "p", "text": "One particular cloning study, initiated by Grand Admiral Thrawn, attempted to splice Jedi and Sith DNA into the clones of various Jedi and Sith in order to create super powerful Force-sensitives; this resulted in the clones going insane and homicidal, having murdered those who ran the study and plotted their escape from the research facility."}, {"tag": "p", "text": "Unmodified clones were direct genetic copies of their donors. Depending on the method used and the approach taken, clones could be created within as little as twenty days or over a period of several years. Some clones created in this fashion had a greater chance to suffer from clone madness, especially if they were created using Spaarti cloning cylinders. Example of unmodified clones include Boba Fett; most of the residents of Khomm; Joruus C'baoth; Luuke Skywalker; all of Palpatine's clones; Thrawn's clone; Soontir Fel's clones; Cinzia Xandret, the clone of Eldon Ax; and the Dark Apprentice."}, {"tag": "h3", "text": "Gene Therapy"}, {"tag": "p", "text": "Gene therapy is the use of using modified DNA to treat or cure an illness. This is done by modifying the genetic material of an individual to correct a mutation causing the illness, or to shut off or accelerate the development of a particular gene."}, {"tag": "p", "text": "Gene therapy was used to correct the aging process of the clones from Clan Skirata; although the exact process is unknown, it involved manipulation of the gene responsible for accelerated aging and allowed the clone members of Clan Skirata to live out normal lifespans. This procedure was developed based upon the research data of Kaminoan geneticist Ko Sai, the one responsible for the development of the Fett genome used to make the Grand Army of the Republic."}, {"tag": "p", "text": "Years later, in 40 ABY Boba Fett was suffering from a number of degenerative illnesses related to his status as a clone; when his doctors could not help him, he went to look for Ko Sai's data. Along the way, he came across his long-lost granddaughter Mirta Gev, who informed him that she saw a clone around the same age as Fett, which should have been impossible. The pair tracked the clone down, who revealed himself to be Jaing Skirata. Fett demanded Ko Sai's data, but Skirata stated that the data was destroyed after it was used on his brothers and himself. Skirata mentioned that he could engineer a cure for Fett, but refused to give him a blood sample for fear that Fett might sell it to the Kaminoans. Instead, Fett had Mirta take a sample of his blood for Skirata to test upon. The only condition for this was that Fett had to go to Mandalore and take the advice of a man named Kad'ika. Fett agreed, and a while later, a cure arrived. The cure was a bone marrow transplant, which involves the injection of the sample sent by Skirata into the bone marrow of his sternum. The genetically modified cells in the transplanted sample took root in the bone marrow and reproduced, curing Fett."}, {"tag": "p", "text": "Project Chubar, a medical program initially started by Palpatine but continued under Zsinj, was created by Binring Biomedical Product and headed by Tuzin Gast. This program was designed to genetically manipulate several non-human species to enhance their intellect to meet or exceed human standards. Some test subjects of this program specialized in certain areas; Voort saBinring, a Gamorrean test subject, developed superior mathematical capabilities rivaling supercomputers and the ability to speak Basic via an implanted translator. Project Chubar was presumed terminated when Zsinj was killed aboard the Iron Fist."}, {"tag": "h3", "text": "Bioweapons"}, {"tag": "p", "text": "In some cases, the DNA of an individual or a species may be reverse engineered and combined into a virus to target that specific group but leave other groups alone."}, {"tag": "p", "text": "During the Yuuzhan Vong War, a pathogen named Alpha Red was developed in 28 ABY by Chiss biotechnicians working with agents from the Galactic Federation of Free Alliances. This pathogen was supposed to target and kill all Yuuzhan Vong and their associated biots, but despite Chiss assurances to the contrary, the Alpha Red pathogen mutated and started to kill off some of the local wildlife on the test planet Caluula. The plan to deploy Alpha Red on a galaxy wide basis was cancelled after a Yuuzhan Vong coralskipper escaped the GFFA imposed quarantine of Caluula and Supreme Overlord Shimrra Jamaane tried to use it to kill off the sentient planet Zonama Sekot. After Shimrra's defeat, all test samples of Alpha Red and the blueprints for its creation were believed destroyed."}, {"tag": "p", "text": "Over a hundred years later, in 137 ABY, a Sith scientist named Darth Maladi discovered a copy of the Alpha Red blueprint that somehow escaped destruction. From this, she created Omega Red, a pathogen based on Alpha Red that would kill all non-Sith. After she had been captured by Emperor Roan Fel, Maladi used Omega Red as a bargaining chip during her interrogation, but instead of stating its true intentions, she lied to Fel and told him that it would wipe out the Sith. Fel considered using it, but refused to do it after comparing his potential actions to those of Palpatine. A while later, Fel, frustrated by all of the losses suffered during the Second Imperial Civil War, fell to the dark side and decided to use Omega Red, but was killed by Imperial Knight Antares Draco before he could give the order to deploy it."}, {"tag": "p", "text": "FG36 was a bioweapon that had its roots in the Clone Wars. Developed by Separatist scientist Ovolot Qail Uthan in 22 BBY, the virus was based on the DNA of Jango Fett and was meant to wipe out all of the clone troopers in the Grand Army of the Republic. Her virus unfinished due to not having narrowed down the gene responsible for accelerated aging, Uthan was captured by Republic forces before the virus could be deployed. After her capture, Palpatine acquired some samples of the unfinished virus and used it on Uthan's homeworld of Gibad in 19 BBY when they refused to comply to his demands. Since the virus was unfinished, it infected and killed everyone on the planet. After having been removed from her prison cell by members of Clan Skirata, who brought her to Mandalore on the condition that she finish Ko Sai's data on reversing clone aging, Uthan developed an antidote to FG36. In an effort to prevent Mandalore from suffering Gibad's fate if the Empire's attention ever fell on them, Clan Skirata made sure that the antidote was distributed to everyone on Mandalore."}, {"tag": "p", "text": "Years later, at least three variants of FG36 were developed and refined during the Second Galactic Civil War when the Imperial Remnant obtained genetic samples from three captives: a Verpine soldier, Prince Isolder of Hapes, and Mirta Gev, the granddaughter of Mand'alor Boba Fett. From these three prisoners, three different strains were created: one targeting the Verpine soldier caste, one targeting the Hapan Royal House, and the third targeting Clan Fett. This was done by taking several genetic samples from a specific individual, and then isolating specific sections of that individual's DNA. Once the DNA has been isolated, it is combined with the virus and is let loose on the population to target specific individuals with that DNA segment. The deployment of these specific strains led to the deaths of a lot of the Verpine soldier caste, the deaths of all the Hapans on Queen Mother Tenel Ka Djo's flagship Dragon Queen that were related to the royal house, and the atmosphere of the planet Mandalore being seeded with the Fett virus, preventing Boba Fett and his granddaughter from returning. However, due to the antidote to FG36 spread years earlier by Clan Skirata, the effectiveness of the Fett strain on those with Fett DNA living on Mandalore may have been little to none."}, {"tag": "h2", "text": "Mutations"}, {"tag": "h3", "text": "Transmutation"}, {"tag": "p", "text": "The Arkanians were considered notorious by some throughout the galaxy for their extremely reclusive scientists who, around 17,000 BBY, created the Quermian species from the Xexto. Though the Arkanians abandoned their clandestine experiments, fearing legal action from the Republic, the Quermians resurfaced millennium later. But for generations it was widely acknowledged that the Arkanians, because of their genetic hybrid tampering and alteration, had been involved in the creation (transmutation) and one-time breeding of a new species."}, {"tag": "h3", "text": "Random mutation"}, {"tag": "p", "text": "Some random mutations, of course, also occurred when some of the genetic material passed on by parents was corrupted in some form."}, {"tag": "p", "text": "Random mutation can result in deformities, such as in the case of Triclops, a human who had gained a third eye. Mutations seen via cloning, where the genetic material is otherwise intact and unmodified but the clone turned out deformed or the clone gained a new ability that the original template did not possess (such as in the case of the Khommite Jedi Dorsk 81 and his lineage), are also otherwise inexplicable."}, {"tag": "h2", "text": "Other uses of DNA"}, {"tag": "p", "text": "There were technological readers that could scan DNA to identify persons. In 32 BBY, young Anakin Skywalker—in an attempt to rescue several Ghostling children from Gardulla the Hutt's palace—fled from a runaway slave seeker-droid that, the boy knew, was equipped with expensive sensors, including 'sniffers' and DNA sequencers. Upon detection, the sequencer was set to mark Anakin as a runaway slave, and, as a probable result, his implanted slave tracking chip would explode, killing him. A piece of green skin from Anakin's Twi'lek accomplice, Pala Kwi'teksa, was discovered by their Dug and Sakiyan trackers and run through a DNA scanner in order to identify at least one of the Ghostling thieves. When the DNA scan revealed Pala as one of the culprits, Gardulla attempted to activate Pala's slave chip, intent that she be killed by the resultant explosion, as certainly would have happened, had it not been for the signal scrambler device that Anakin had constructed and gifted to his friend to protect her."}, {"tag": "p", "text": "Eldon Ax was able to use her DNA pattern to gain control over her mother's otherwise uncontrollable hex droids; having recognized her DNA as that of their maker's daughter Cinzia, they obeyed her orders to kill her Sith Master Darth Chratis then destroy themselves."}, {"tag": "p", "text": "Tuzin Gast, the leader of Project Chubar and the creator of Voort saBinring, synthesized lots of blood plasma with saBinring's DNA, then committed suicide. This was done to make it appear that saBinring has died as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In real life, the substance known as deoxyribonucleic acid serves as natural identification between all organisms, but especially between humans in society. It is found through various means such as saliva, blood, skin cells, or hair and is often used to establish the whereabouts of a person during a criminal investigation. DNA manifests its basic structure in humans as a double helix, a term made popular by molecular biologist and geneticist James Watson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}