{"url": "DRK-1_Dark_Eye_probe_droid", "categories": ["Category:Canon articles", "Category:Droid stubs", "Category:Imperial droids", "Category:Probe droid models"], "nodes": [{"tag": "h1", "text": "DRK-1 Dark Eye probe droid"}, {"tag": "p", "text": "The DRK-1 Dark Eye probe droid, also known as the Sith probe droid, Sith seeker, or Repair droid, was a model of probe droid used by the Sith and later the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The DRK-1 probe was a spherical probe droid capable of floating above the ground. Equipped with a single eye, these droids had a black carapace and were fitted with an antenna rising from their globe-like body. Darth Maul's DRK-1 probe droids spoke the language Sisrai. Some DRK-1 probe droids were equipped with a micro-grenade launcher."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sith Lord Darth Maul made use of several DRK-1 probes, keeping at least three of the spy droids aboard his personal starship, the Scimitar. He utilized these droids to track down a freighter belonging to the Haddrex Gang on Nar Shaddaa, which led Maul and his bounty hunter compatriots to the hideout of Xev Xrexus in the Drazkel system. There, Maul followed one of the droids to the location where Jedi Padawan Eldra Kaitis was imprisoned."}, {"tag": "p", "text": "In 32 BBY, Maul launched three probe droids while seeking out Queen Padmé Amidala on Tatooine, and successfully located her Jedi protector, Qui-Gon Jinn. Maul recalled his probes and set out on his speeder, the Bloodfin, to engage Jinn in a lightsaber duel. However one of these droids, after rescuing a labor droid and being saved from a sandcrawler by the same droid, decided to remain on Tatooine with its new friend."}, {"tag": "p", "text": "During the Galactic Civil War, these droids were used as repair units by the Imperial Army to make field repairs to vehicles. They were unarmed however, leaving them defenseless against enemies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}