{"url": "DRN-38", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "DRN-38"}, {"tag": "p", "text": "DRN-38 was an individual who commanded a unit in the Trade Federation Droid Army. Between the years 39 BBY and 36 BBY, DRN-38 was sent to the moon Alaris Prime, where the droids in DRN-28's unit ambushed the Wookiee Attichitcuk, nearly killing him. Attichitcuk's son, Chewbacca, later rescued him, destroying many of DRN-38's droids along the way."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "DRN-38 was an individual who served in the Droid Army of the corporation known as the Trade Federation. Sometime between the years 39 BBY and 36 BBY, DRN-38 commanded a group of droids that was sent to the rediscovered moon Alaris Prime along with a contingent of the Droid Army in an illegal colonization attempt. On the moon, DRN-38's droids encountered a small group of Wookiees led by the Chieftain Attichitcuk, who was leading his species in a legally authorized colonization effort on Alaris Prime. One of DRN-38's Battle Droid Beta Versions ordered Attichitcuk to come with them, but when the Wookiee refused to comply, the droids shot Attichitcuk's party, killing the other Wookiees present and badly wounding the Chieftain."}, {"tag": "p", "text": "Jedi Master Qui-Gon Jinn, who was assisting the Wookiees, sent Attichitcuk's son, Chewbacca, to rescue him. Chewbacca found Attichitcuk, destroying many of DRN-38's droids in the process and, after having a medical droid heal him, returned the Chieftain to their nearby base. In retaliation, DRN-38 sent three droidekas to the base to which Attichitcuk had been taken, but the Wookiees defeated the droids and went on to remove the Trade Federation's presence from Alaris Prime."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "DRN-38 was given command of a unit of droids in the Trade Federation army, which included B1 battle droids and several droidekas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "DRN-38 was mentioned in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds. The individual's name was given as the commander of the Trade Federation forces in the fourth level of the Wookiee tutorial campaign, \"Researching technology.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}