{"url": "DS-1_Death_Star_Mobile_Battle_Station", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Death Stars", "Category:DS-1 Orbital Battle Station locations", "Category:Galactic Republic projects and operations", "Category:Imperial projects and operations", "Category:Kuat Drive Yards products", "Category:Separatist projects and operations", "Category:Sienar Fleet Systems products"], "nodes": [{"tag": "h1", "text": "DS-1 Death Star Mobile Battle Station"}, {"tag": "p", "text": "The DS-1 Death Star Mobile Battle Station, also designated as the DS-1 Orbital Battle Station and referred to as the Ultimate Weapon in early development stages and later as the Death Star I and the First Death Star, was a moon-sized, deep-space mobile battle station constructed by the Galactic Empire. It had been designed to fire a single planet-destroying superlaser powered by massive kyber crystals which would destroy any planet targeted. It was the pet project of Emperor Palpatine, Director Orson Callan Krennic, and its eventual commander Grand Moff Wilhuff Tarkin to expound the military philosophy of the aptly named Tarkin Doctrine."}, {"tag": "p", "text": "Some of the earliest plans for a mobile, planet-destroying superweapon dated back millennia to the ancient Sith. Thousands of years later, shortly before the outbreak of the Clone Wars, the Geonosians, aligned with Count Dooku and the Confederacy of Independent Systems, designed the Ultimate Weapon in secret. After the fall of the Confederacy, construction of the Death Star was appropriated by the nascent Empire. It was built in orbit of Geonosis and supported by a complex logistical network of bases. The station, which took many years longer to complete than expected, was eventually moved from Geonosis to Scarif in its final stages of construction."}, {"tag": "p", "text": "When the Alliance to Restore the Republic learned of its existence, rogue operatives Jyn Erso and Cassian Andor led a mission to steal the Death Star plans, which the Rebellion against the Empire eventually joined, realizing it was essential for its survival. These plans were ultimately transmitted to Princess Leia Organa of Alderaan aboard the Tantive IV, before her capture and demonstration of the weapon's capabilities on her home planet. After a daring rescue, Organa got the plans to the Rebel base on Yavin 4, from which the Alliance launched the Battle of Yavin with a small squadron of starfighters. The original station was destroyed by a shot fired by Rebel pilot Luke Skywalker with the aid of the Force."}, {"tag": "p", "text": "The destruction of the Death Star weakened the Imperial Military, and Rebel assaults on Imperial installations prompted the construction of a second Death Star, both as a sign of defiance and technological terror. Despite this, it, like its predecessor, was destroyed with all hands lost. Decades later, the Empire's successor state, the First Order, constructed Starkiller Base, a much larger planet-destroying superweapon considered to be an evolution of the Death Star project of the Old Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "The station was spheroid, and measured 160 km (100 miles) in diameter with 357 internal levels and a surface area of over 45,000 square kilometers. A large, concave dish in the northern hemisphere made up the superlaser emitter. The station's command bridge, the Overbridge, was located above the dish of the station's superlaser, within the Northern Polar Command Sector. The war room featured designated posts for Tarkin and other officers, a HoloNet booth for communicating with the Emperor, and large banks of viewscreens. Beside the bridge was the Death Star conference room, inbuilt with a circular table and twelve seats for high-ranking Imperial officers. The Emperor's tower and its throne room also fell within the Command Sector."}, {"tag": "p", "text": "The station's equator comprised numerous docking ports of various sizes, all supported by the extraordinarily powerful tractor beam generator tower,[source?] which utilized several tractor-beam projectors and tractor-beam focusing shafts. The station's equator housed docking and hangar bays; tractor-beam generators, projectors and emitter towers; turbolaser emplacements; and mooring platforms for ships of the fleet, including Imperial-class Star Destroyers."}, {"tag": "p", "text": "A habitable crust several kilometers thick was composed of command centers, armories, maintenance blocks, and other requirements for a fully operational space station. Unused stories in the station's lower levels held backup weapons operators in the event of an emergency. Levels in the station's southern hemisphere extended downward through armories, deep storage, and a southern command sector. Massive girders provided grid-like support to the lower levels. Cranes and other abandoned construction material could still be found within the station by the time of its destruction in 0 BBY. With the exception of the crust, the station's entire interior space was uninhabited, and housed the hypermatter reactor, hyperdrive, 123 Kuat Drive Yards sublight engines, and the station's superweapon. The station's outer hull was made of quadanium steel plates."}, {"tag": "p", "text": "The Death Star featured an entirely man-made atmosphere. A vast, central cylindrical atmosphere-processing unit ensured the air inside the station was regulated.[source?] Several modular artificial atmosphere stations and water-recycling tanks were dotted throughout the station's levels for the creation of air and humidity. Several large, cavernous airways served as means for circulation and as an emergency air dump in case of atmosphere contamination. A large, central airway existed for each sector. Magnetic seals and an atmosphere-containment projector kept the station's internal atmosphere in and the vacuum of space out if docking-bay doors were opened."}, {"tag": "h3", "text": "Armaments and defensive systems"}, {"tag": "p", "text": "The most prominent weapon emplacement on the Death Star was its superlaser —a weapon powered by a hypermatter reactor[source?] and focused through giant kyber crystals with sufficient firepower to destroy an entire planet. The hypermatter reactor at the center of the station fed energy into the various components of the superlaser, including the primary power amplifier, the superlaser power cell, the firing field amplifier, and the induction hyperphase generators. When firing, the energy was redirected into eight tributary beam shafts located around the perimeter of the superlaser, producing lasers that were converged using focusing coils,[source?] forming one large beam powerful enough to destroy a planet. If the firing-chamber arrays were not precisely aligned, the crystals would burn out and overload, sending dangerous levels of waste heat back into the Death Star's main reactor."}, {"tag": "p", "text": "In addition to the Death Star's superlaser, its surface was peppered with 15,000 turbolaser batteries along with 768 tractor beam emplacements. As the station's defenses, these were installed in order to repel a large-scale fleet attack, rather than fend off individual starfighters, which the Empire viewed as no real threat. Shield projectors and communications arrays were distributed across the armored surface, analogous to colonies. A network of security stations were situated around the entire circumference and were equipped with holographic maps of the local region of space."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "For space-based offense and defense, the battle station contained numerous TIE fighters, which frequently patrolled the space surrounding the station. Due to the Death Star's enormous size, it had a heavy gravitational pull, which forced TIE fighter pilots to adjust their ships' thrusters for the kind of takeoff more common within a planetary atmosphere than on a space station. TIE staging areas had twenty TIE craft ready at any time for immediate takeoff."}, {"tag": "p", "text": "The battle station housed 342,953 members of the Imperial Army and Navy, 25,984 stormtroopers, and nearly 2 million personnel of varying combat eligibility. Furthermore, although there were communal barracks, there also were enough private bunks that most people could expect to receive one within three to six months after arrival. While enlisted personnel used walkways or turbolifts that could move both vertically and horizontally, officers had access to a high-speed, officer-only shuttle system that orbited the station. Massive housing blocks for enlisted personnel featured a large atrium for off-duty personnel to walk in. Officers could expect their own exclusive accommodations. Life-support modules inhabited by workers during the original construction of the Death Star could still be used in an emergency. The station featured several hospital wings. Several color-coded life-support modules existed in the station's lower levels: gray for workers, red for overseers."}, {"tag": "p", "text": "Meant to function as a world of its own, the Death Star had creature comforts most other Imperial Military postings did not: decent food, recreation areas, cantinas with latest-model bartender droids, and commissaries with selections of expensive treats and luxuries. The Death Star had its own commissary and bar. Off-duty stormtroopers were known to clandestinely meet to play violent, prohibited ball games in the station's zero-gravity filtration system."}, {"tag": "p", "text": "The station's detention block, while large and formidable, was not intended to hold prisoners for extended periods of time. Instead, it served as a place for temporary detention and interrogation, pending transfer to planetary prisons, and execution. Prisoners were kept on the Detention Level in complete darkness, then moved to bright interrogation rooms."}, {"tag": "h3", "text": "Power"}, {"tag": "p", "text": "The station was powered by a cavernous hypermatter reactor encased in radiation insulator plating located at the center of the station,[source?] the destruction of which had the potential to be catastrophic to the station. Doonium and dolovite were essential for shielding the hypermatter reactor core, focusing dish, and superlaser. The reactor was connected to various components in the station, such as the superlaser, the power diversion solenoid, and the station's enormous power cells. The Death Star's tractor beam generator was also coupled to the main reactor through seven power generator terminals located throughout the station. Above the reactor were vast water tanks.[source?] The power of the Death Star's superlaser could be controlled depending on how many reactor ignitions were used to power it. For example, a single reactor ignition was capable of destroying a large area of a world's surface instead of destroying the body entirely."}, {"tag": "h3", "text": "True purpose"}, {"tag": "p", "text": "For all the power the Death Star held, Galactic Emperor Sheev Palpatine, the ruler of the Galactic Empire and secretly the Sith Lord Darth Sidious, had a different view of the battle station, as he planned for it to serve as a constant reminder and tangible symbol of the dark side of the Force's power. With the Emperor freed from needing to portray this, he and his Sith apprentice, Darth Vader, would have devoted themselves to what Palpatine dubbed \"more pressing matters\" which had little to do with his Empire and that only the two of them could investigate. Ultimately, Palpatine wanted to have the power to reshape the universe to his design, a desire beyond mere immortality."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The idea of a massive planet-killing battle station dated back millennia, including to the old Sith Empire, when tyrants were enjoying the idea of such a superweapon. The project that would be the DS-1 originated on Geonosis, and plans for what the Geonosians dubbed as the Ultimate Weapon project were given to Dooku, publicly the leader of the Confederacy of Independent Systems and secretly the Sith Lord Darth Tyranus, by Archduke Poggle the Lesser for safekeeping during the First Battle of Geonosis, in the waning decades of the Galactic Republic. Shortly after the battle, Dooku presented his Sith Master, Dark Lord of the Sith Darth Sidious, and publicly Supreme Chancellor of the Galactic Republic Sheev Palpatine, and used the ploy that the Separatists were building their own superweapon, frightening Republic officials and allowing Palpatine to direct full funding towards secretly creating the station."}, {"tag": "p", "text": "The massive project was funded by a conglomerate of factions, including the Trade Federation, Muunilinst Banking Clan, the Techno Union, and covertly, the Republic itself. During later Republic interrogation, Geonosian leader Poggle the Lesser claimed that the schematics were merely presented to them by Dooku and that the Geonosians had simply refined them. Furthermore, he admitted that the Stalgasin hive hadn't had time to design the station's main weapon before the Battle of Geonosis interrupted development. Its design, centered on a superlaser array using massive kyber crystals, was inspired by technology developed by the ancient Sith."}, {"tag": "p", "text": "By 21 BBY, the Republic Special Weapons Group developed plans for both an automated battlemoon asteroid and a torpedo siege platform, neither of which made it past the design stage."}, {"tag": "p", "text": "Those privy to top-secret intel concluded that the plans for the Death Star must have fallen into Republic hands during or shortly after the Second Battle of Geonosis in the same year, with Supreme Chancellor Palpatine presenting the plans to the Republic Strategic Advisory Cell shortly after the battle in the cell's second briefing. The Strategic Advisory Cell planned the construction of the Death Star and regularly met at the summit of the Strategic Planning Amphitheater of the Republic Center for Military Operations on Coruscant. There, a mixed-species gathering of 150 beings from prestigious and influential positions met to discuss progress on the battle station. The meetings included select senators; representatives from Corellian Engineering, Kuat Drive Yards, and Rendili StarDrive; key advisers; the chief of naval intelligence; the director of COMPOR; high-ranking members of the military; members of the War Production Board; structural engineers; starship designers; theoretical and experimental physicists; Dr. Gubacher; Prof. Sahali; Lieutenant Commander Orson Krennic; Vice Chancellor Mas Amedda; and Supreme Chancellor Palpatine. The Jedi were not invited to the meetings, nor did they even know about the project under construction over Geonosis."}, {"tag": "p", "text": "All members involved in the construction of the battle station were required to sign the Official Secrets Oath. Near-unlimited funding was provided to the project owing to Republic fears that the Separatists had their own battle station under construction, which intelligence surmised was the reason Count Dooku failed to attack the station over Geonosis. Geonosian Leader Poggle the Lesser maintained his position that the Separatists had no project of their own in the works. Despite this, most cell members refused to take Poggle at his word and scoured the galaxy to locate the presumed construction site. While the evidence was specious, rejecting the possibility would have jeopardized Republic funding for the project, regardless of the authority ceded to Supreme Chancellor Palpatine by the Emergency Powers Act. Thus, Republic effort into constructing the battle station was viewed as a priority in order to beat the Separatists at their supposed own."}, {"tag": "p", "text": "Funding for the project would have been viewed as spurious before the Clone Wars. However, as the war dragged on, more and more research firms were dragged into government contracts focusing on a different aspect of the space station, such as in shielding or power supply, and all unaware of what their research was ultimately for. Researchers involved in defense projects were required to sign the Official Secrets Oath."}, {"tag": "p", "text": "Initial construction on the Death Star had been carried out by newly designed machines, some of which were controlled by sentient operators stationed in orbital command habitats. A vast array of ships provided the station with metals, organic materials, and supplies of water. Viable asteroids were towed and tractor-beamed to the station from both around the planet and from fields surrounding the Geonosis system. Once mined, ores were sent to foundries in synchronous orbit for the production of durasteel and other metals. Cannibalized droid factories built by Baktoid Armor on Geonosis's surface allowed additional foundries to go online soon after the start of asteroid mining."}, {"tag": "p", "text": "In 21 BBY, after the Second Battle of Geonosis and before the first anniversary of the First Battle of Geonosis, the Strategic Advisory Cell announced the completion of phase one of the Death Star's construction. The supports for the station's superstructure at one hundred and sixty kilometers from pole to pole had been completed. The next phase of construction revolved around the fabrication of a temporary equator, along with a series of longitudinal bands to roughly form the sphere. As the bands were secured, construction of the hull commenced, along with the partitioning of individual interior sections. The cabin spaces were to be clad, sealed, and pressurized in order to permit the use of sentient laborers in addition to droids."}, {"tag": "p", "text": "Initial sentient labor estimates were in the millions. A Strategic Advisory Cell subcommittee considered providing the Kaminoans with a template to grow a labor force of clones adapted for deep-space work. Orson Krennic independently negotiated a deal with Poggle the Lesser: in return for his cooperation with the Republic, he would have his Geonosian workers begin construction on the facility. Instead of being punished, Krennic was given greater oversight over the project by Mas Amedda. After several months, workers had completed the station's false equator, with what Krennic described as looking like \"an antique gyroscope\" rather than an actual sphere. Following this achievement, several degrees of the upper hemisphere were outfitted with latitudinal structural members, and rudimentary layout work had begun on cladding a portion of the curved hull. Construction droids devoted themselves to fashioning the first interior spaces meant to serve as placeholders until actual cabin spaces could be bulkheaded. The Geonosians were the first organics planned to inhabit the life-support modules. In the wake of Poggle's announcement of the project to the Geonosians, tens of thousands of drones had been transferred to Orbital Foundry 7, the second-largest structure in view from the command habitat. The drones oversaw the construction of enormous pie-slice-shaped concavities that, when assembled, would form the battle station's focusing dish and power well. By this time, three slices had been completed, and another six were in various stages of completion. The drone laborers were overseen by winged soldiers, loyal to castes overseen by Poggle, who had a lavish suite linked by a series of tubular connectors to the foundry."}, {"tag": "p", "text": "The plan for assembling the station's dish called for assembling it in space and maneuvering it by tug and tractor beam into a gargantuan well that had been framed into the sphere's upper hemisphere—the dimple, as some called it. The parabolic dish was engineered to telescope away from the hull to facilitate aiming the early composite-beam proton superlaser design some of the Special Weapons Group scientists had proposed. Because design on the weapon had been incomplete by the time construction had started, most individuals involved in the project held the notion that function would have to follow form. Orson Krennic was placed in charge of the construction, assembly, and installation of the dish."}, {"tag": "p", "text": "As a result of his cooperation, Poggle was allowed a ship to travel between Geonosis and the station. Poggle's production philosophy revolved around forcing the drones to perform work that was beneath their skill or caste level as a means of increasing their final output. As a result, the drones were unhappy with their situation. Weeks later, the last of the pie-slice dish modules had been fabricated, but the dish itself was not fully assembled and the upper hemisphere still undergoing finishing touches. Droid work fashioning cabinspaces in the pole region had proceeded slower than expected. During this time, Geonosians began dying off en masse because they lacked work—a unique physiological trait of the Geonosian species. Poggle insisted that this provided competition and adequate motivation for the laborers to work harder. Marines were required to exterminate workers that refused to follow orders. By 19 BBY, the Geonosian labor force engaged in a full-scale riot, destroying three months of work in the process. During this time, the battle station's parabolic focusing dish was nearing assembly, hull cladding had been added, and interior spaces had been bulkheaded and made habitable. Living conditions for the drones had been improved, and every attempt made to limit overcrowding. In reality, the riot was a diversion to allow Archduke Poggle the Lesser to escape aboard his small craft, which had a hyperdrive secretly installed by his drones."}, {"tag": "p", "text": "Kyber crystals were scoured from across the galaxy in order to construct the station, with the Separatist Alliance doing so by the end of the Clone Wars. One such attempt ended in failure on the Outer Rim world of Utapau after interdiction by Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker."}, {"tag": "p", "text": "In 19 BBY, the three-year Clone Wars came to an end. As the war ended, Darth Sidious got rid of his Confederacy puppets, including his own apprentice, and proclaimed the birth of a new, authoritarian Galactic Empire, anointing himself Emperor."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "The nascent Empire immediately appropriated the Ultimate Weapon project. Access to Geonosis was restricted to an inner circle of Imperial scientists and engineers, and very few members of the Imperial hierarchy even knew about the project. A highly secure supply line with various false routes and outposts was developed to ensure further secrecy, and it was during that time that the battle station was given the official name of Death Star and given the hull designation of DS-1, though the early codename, Stardust was still used in design files. Tiaan Jerjerrod, an architect and starship designer from Tinnel IV, was enlisted to help build the megaweapon. As construction continued under the Empire, Palpatine gave responsibility for the project to the Imperial Navy and charged Wilhuff Tarkin and Orson Krennic responsible for the battle station."}, {"tag": "p", "text": "Despite construction moving ahead, not all Imperials believed in the viability of the project, with some voicing protest over what would later become known as \"Tarkin's folly,\" and others not knowing of the project at all. General Jylia Shale was one of many who protested its development, only to result in her input being marginalized over the coming years. Grand Admiral Balanhai Savit opined that the Death Star might be able to serve for five, ten or even fifty years. However, he believed that eventually someone would figure out a way to disable or destroy it. Likewise, General Cassio Tagge believed that having the Death Star as the Empire's sole weapon was a mistake."}, {"tag": "p", "text": "The Tarkin Initiative, an Imperial think tank, was responsible for some of the ideas behind both the first and second Death Stars. While many starship designers and engineers attempted to claim credit for the station's construction, none besides the Emperor knew the full history of the moon-sized project. While rumors within the Imperial ranks speculated that it was a Confederate weapon engineered by Geonosian Archduke Poggle the Lesser's hive colony for Count Dooku, none could prove the story's validity. Some pointed out, however, that the plans must have fallen into Republic hands before the Clone Wars ended, owing to the station's shell and laser-focusing dish already in the works upon the war's conclusion."}, {"tag": "p", "text": "Shortly after the proclamation of the New Order, Emperor Palpatine and Darth Vader visited the station with Tarkin, arriving aboard a brand-new Imperial-class Star Destroyer. By this time, the focusing dish had been successfully installed. Orson Krennic believed that he was kept off the elite passenger list due to Poggle's recent escape under his supervision. Both Wilhuff Tarkin and Orson Krennic wished to attain control over the entire Death Star project. To further his interests, Krennic had been manipulating his longtime friend Galen Erso since the Clone Wars. By bringing him aboard Project Celestial Power, an Imperial research division dedicated to weaponizing Galen's kyber crystal research, Krennic believed he would be given oversight over the Death Star and promoted to rear admiral. During this time, Krennic began appropriating legacy worlds—worlds legally exempt from exploitation—by using independent contractor Has Obitt to drop off weapons and war materiél on the worlds of Samovar, Wadi Rafa, and others for their reserves of doonium and dolovite. After \"discovering\" the weapons on the planets, Krennic appropriated them to prevent \"Separatist holdouts\" from attaining them."}, {"tag": "p", "text": "Wilhuff Tarkin believed that Krennic's appropriation of planets without the Emperor's permission was a sign of his overreaching ambition, impulsiveness, and disdain for authority and the chain of command. Tarkin, like Krennic, believed that he should ultimately be made responsible for the Death Star project. Consequently, Tarkin planned to use Krennic as a convenient scapegoat for every construction delay and issue that was bound to plague the project, well aware that the Emperor was eyeing them both for a promotion. To avoid accepting the privilege prematurely, Tarkin continued to defer to Krennic until the proper time arose to oust him. Krennic also planned to keep Tarkin occupied. In 18 BBY, Krennic orchestrated an insurgency within the Salient system, aware that Tarkin, unable to retreat, would be caught in a weeks-long battle, lowering his favor with the Emperor."}, {"tag": "p", "text": "Early attempts at test-firing the Death Star's superlaser led to the destruction of an entire city on Malpaz. The first successful test firing occurred much later at an isolated black-hole binary known as the Hero Twins. Preliminary scans indicated that the energy released during the test-fire had the destructive fire of the combined batteries of a qaz-class Star Destroyer. The superlaser was fired by a kyber crystal-assisted twin laser array carefully assembled and calibrated on Hypori, and installed on an Imperial-class Star Destroyer appropriated by the Special Weapons Group. Grand Vizier Mas Amedda wished the test firing to occur closer to the Core, but Krennic urged caution, knowing that a misfire would most likely result in the destruction of the ship. As a result of the successful test firing, Krennic was promoted to full commander."}, {"tag": "p", "text": "For over a year, Galen Erso was employed in Project Celestial Power and was given nearly unlimited supplies of kyber crystals looted from Jedi Temples and lightsabers. Imperial research groups under Celestial Power were given codenames such as Pax Aurora, Mark Omega, and Stellar Sphere. Almost all research divisions relied on research conducted by Galen Erso, who had an intricate knowledge of crystallography. Galen believed that his research was intended to repair worlds devastated by the Clone Wars by providing inexpensive power to civilian populations. Eventually, Galen, suspicious at the lack of information provided to him by Krennic regarding the implementation of his research, discovered that his work was being weaponized without his knowledge. Angered, Galen, his wife, and daughter, Jyn Erso, escaped the Celestial Power facility on Coruscant with infamous rebel Saw Gerrera. The Erso family moved to Lah'mu, hopeful that Krennic, now demoted to lieutenant commander, would not find them. Tarkin was then given oversight of Sentinel Base and the Death Star project."}, {"tag": "h3", "text": "Continued construction"}, {"tag": "p", "text": "The construction of the first Death Star continued for several years above Geonosis in utmost secrecy, under Admiral Wilhuff Tarkin's supervision. The Empire utilized construction modules operated by Wookiee slave laborers and various other species to complete the project. Several manufacturing facilities, such as those on Riosa, were commandeered by the Empire, with their workers pushed to the brink to manufacture components for the battle station. Most of the construction work on the station was done in micro-g, while omni-directional boosters supplied standard gravity to a large cabinspace near the surface of the station that would eventually become the Overbridge. The epicenter of a throng of construction droids, the station was guarded by four Star Destroyers and twice as many frigates and hovered in a fixed orbit above the planet. The northern hemisphere focus lens frame for the superlaser was nothing more than a metallic crater five years after the station's appropriation by the Empire, and while some of the hyperdrive components had been installed, the station was far from being jump-ready."}, {"tag": "p", "text": "Partly to protect the station, as well as to provide several drop-off points to further confuse any attempt to trace the ultimate destination of materiél, outposts such as Desolation Station and Rampart Station were constructed during the Clone Wars, with Rampart acting as a marshaling depot for supplies heading to Geonosis. Such stations were overseen by Sentinel Base, an expansive garrison base initially deployed from a Victory-class Star Destroyer. Supervision of this clandestine project was entrusted to Vice Admiral Dodd Rancit. However, Wilhuff Tarkin replaced Rancit at some point following the Antar Atrocity, with Palpatine attempting to shield Tarkin from the political fallout exhumed by the operation. As such, Tarkin's three years commanding Sentinel Base and the hundreds of supply and sentry outposts constructed for the station were mired in bureaucratic inefficiency and complexity."}, {"tag": "p", "text": "Shipments from research sites were frequently postponed, asteroid mining above Geonosis proved unfeasible, failed meetings of construction-phase deadlines by the engineers and scientists supervising the project fueled frustration, and raids against convoys heading for the station spelled an administrative nightmare. In addition, with the Empire's strategy that no base commander—Moff, admiral or general—should have unrestricted access to all information regarding shipments, scheduling, or construction progress, no single person was in charge of the project unless one counted the Emperor—whose visits were few and far between. Relying on countless suppliers and tens of millions of beings galaxy-wide, the project's immense size and need for secrecy hampered any real efforts at its completion, with the Imperial Security Bureau and Naval Intelligence Agency continually repressing rumors and quashing information leaks. Furthermore, dissatisfied individuals from the former Republic abandoned the project with such regularity that COMPNOR compiled a most-wanted list of missing scientists and technicians with high-priority security clearances."}, {"tag": "p", "text": "Following a sophisticated attack against Sentinel Base by an organized cell of former Republic Intelligence operatives under the command of Berch Teller, Tarkin with the aid of Lord Vader was entrusted with the subsequent manhunt for those involved in the operation. The following investigation ultimately involved the highest echelons of Imperial power, who were worried about the attack's proximity to Geonosis, along with the attacker's ability to introduce a false real-time feed into the local HoloNet relay in an attempt to divert Sentinel's defenses to Rampart Station, which was falsely presumed to be under attack by remnant Confederacy Providence-, Recusant-, and Munificent-class warships. After a meeting in the Imperial Palace with several members of the Joint Chiefs and the Emperor himself, an engagement on Murkhana originally intended to investigate the former Separatist Shadowfeed operation saw Tarkin's personal starship, the Carrion Spike, hijacked by the dissidents. Using the stolen vessel to cast devastation across several Mid and Outer Rim worlds—which the dissidents transmitted through the local HoloNet before being shut down by the Empire—the conspirators were ultimately stopped after an attempt to destroy a supply shipment heading for the new Death Star project, with the Star Destroyers Executrix, Compliant and Enforcer arriving on scene. The rebels and their secret benefactor Vice Admiral Rancit were subsequently tortured and executed in secret by the Imperial Security Bureau (ISB) upon the discovery of Rancit's involvement in the scheme. In reality, Rancit had hoped to ultimately betray the insurgents above Carida, thus making it appear as if he had stopped their rampage, and thus secure support from the Emperor and receive a possible promotion."}, {"tag": "p", "text": "To cover up the military embarrassment caused by Rancit's betrayal, the HoloNet made the attacks appear to be an elaborate attempt to draw out and destroy rebel cells. Thus, while many in the galaxy knew an Imperial construction project was underway over Geonosis, few knew of what it actually entailed. As a result of Tarkin's efforts, the Emperor decreed his ascension to the newly created title of Grand Moff and greater control over the Outer Systems, along with his oversight of the entirety of the battle station project. Roughly two weeks later, several of the station's sublight engines had been completed and were tested with Tarkin on board to oversee the operation as the station surpassed the speed of Geonosis's rotation."}, {"tag": "p", "text": "For years during the station's construction, numerous skirmishes with Imperial shipping delayed construction. When a band of Lothal rebels attacked and destroyed an Imperial supply convoy carrying kyber crystals five years before the Battle of Yavin, construction on the station was hampered. At some point after these attacks, the station was moved from Geonosis to another base, and in order to keep the project a secret, the entire Geonosian species was wiped out. Three years before the Battle of Yavin, one of the modules used during construction was used by ISB Agent Kallus to ambush the same group of rebels previously responsible for ambushing the supply convoy of kyber crystals, who this time were on a mission to find out what the Empire was building above the planet. The Empire's attempt to capture the rebels ultimately failed. During the station's construction, Saw Gerrera came close enough to discovering the Death Star that the Empire was prompted to move it from Geonosis to Scarif for the final stages of the project in 10 BBY, where Director Orson Krennic oversaw the protection of the station with the aid of his personal detachment of death troopers."}, {"tag": "h3", "text": "Completion and demonstration"}, {"tag": "p", "text": "One member of Project Stardust, Assistant Director Brierly Ronan, believed that the Death Star's completion would make the rest of the political structure on the Imperial capital of Coruscant entirely irrelevant. Instead, Ronan believed Emperor Palpatine and Director Krennic would be the only ones who mattered. However, Lieutenant Eli Vanto, a former commander in the Imperial Navy and current member of the Chiss Ascendancy, felt Palpatine could emerge as the sole important figure, though Ronan refused to believe his superior would be swept away."}, {"tag": "p", "text": "Having taken much longer than expected to develop, the massive construction project was finally completed almost twenty years after its conception during the Clone Wars, and at some point was rechristened as the Death Star. Imperial Navy pilots and military personnel were eventually assigned to the station shortly before it was revealed to the public, being new enough to still be labeled as classified. After extracting the last of the kyber crystals from the ancient Temple of the Kyber, in Jedha City, Krennic told Tarkin that the station was ready and prepared to destroy a planet, but Tarkin wasn't confident in the power of the station yet, and ordered that only Jedha City be destroyed. Using minimal power of the superlaser, the order was carried out and Jedha City, along with miles of surrounding terrain were destroyed, including the hideout of Saw Gerrera's extremist group. However, Jyn Erso saw a message from her father, the scientist Galen Erso, that the Death Star had a fatal flaw which he installed, and she and her companions delivered the news to the Alliance to Restore the Republic. Unable to reach a consensus on how to respond to this new threat, the squad team, Rogue One, infiltrated Scarif to steal the plans, which were transferred before the Death Star was used to destroy the Imperial base. With the mission a success, the technical readouts of the battle station were received by Imperial senator and rebel sympathizer Princess Leia Organa of Alderaan, who intended to pass them along to her allies. However, before she could do so, the blockade runner she was aboard was intercepted by Imperial forces commanded by Darth Vader, and she was captured, but not before she passed the plans to the astromech droid R2-D2 and sent him in an escape pod to the planet below."}, {"tag": "p", "text": "As a high-value prisoner, Organa was moved to Cell 2187 of Detention Block AA-23, sub-level five, where she was interrogated in order to learn the location of the Rebellion's secret base. Faced with her considerable resistance to Imperial interrogation techniques, Tarkin opted to try a different approach: intimidation. In a move calculated to force Organa to reveal the Rebel base, Tarkin threatened to use the station's primary weapon to destroy her homeworld. Though she ostensibly relented and supplied the Rebel base's location as Dantooine, Tarkin ordered the attack to move forward in order to demonstrate the military power that the Empire now held. In a matter of moments, the Death Star destroyed the planet Alderaan, leaving no survivors. Nearly all forces on the Death Star were ordered to witness the destruction, including Iden Versio, a Senior Lieutenant in the Imperial Navy."}, {"tag": "p", "text": "Immediately after the planet's destruction, the Star Destroyer Devastator left the station, and a small Imperial force was sent to investigate Leia's claim under the command of General Cassio Tagge. Upon arrival in the system, however, it was discovered that the base was abandoned. Angered by Leia's lie, Tarkin ordered Organa's execution, although Vader convinced him to allow her to be rescued by a group of outlaws, in order to follow them back to the Rebel base themselves."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "The Death Star pursued Organa and her allies to the Yavin system, where the Rebel base was located on Yavin 4. With R2-D2 having supplied them with the technical readouts of the Death Star, the Rebels identified a weakness in the station's design and prepared their starfighters for a desperate attempt to destroy the station before it could bring its weapon to bear on Yavin 4. The plan, as explained by Alliance tactician Jan Dodonna, called for the firing of proton torpedoes down a two-meter-wide thermal exhaust port in the station's meridian trench. The shaft led straight to the station's main reactor, where the flaw left by Galen Erso would start a chain reaction that could destroy the station. Owing to the Death Star's design philosophy focusing on defense against large-scale attacks, the exhaust port was relatively unguarded."}, {"tag": "p", "text": "While the battle initially appeared in the Alliance's favor owing to the small size of the Rebel ships—granting them the ability to dodge turbolaser fire—the launch of numerous TIE fighters under the personal command of Lord Vader in his TIE Advanced x1 destroyed the majority of the Rebel vessels, but ultimately one proved successful. Piloted by Tatooine native Luke Skywalker, his T-65B X-wing starfighter managed to fire a pair of proton torpedoes down the thermal exhaust port. The torpedoes destroyed the Death Star's main reactor by causing a chain reaction as predicted, resulting in the destruction of the Empire's prestigious weapon."}, {"tag": "p", "text": "Where there were once thousands of communications streaming in endless waves from the Death Star, in a mere instant there were none. In the chaotic hours that followed the station's destruction, multiple rumors of the station's defeat circulated across the galaxy, while a Gozanti-class cruiser piloted by Ciena Ree and Berisse Sai was sent to the Yavin system to both confirm the Empire's worst fears and pick up Lord Vader, who was trapped inside his TIE Advanced x1."}, {"tag": "p", "text": "The Rebels, after a brief celebration, immediately began evacuating their base to avoid the inevitable Imperial reprisal against the station's destruction."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "With the loss of Grand Moff Tarkin, numerous members of the Joint Chiefs and Imperial Military manpower, the Empire began to mobilize for a full-scale galactic war, while it also forged ahead and began construction on the DS-2 Death Star II Mobile Battle Station. The Imperial HoloNet subsequently downplayed the destruction of the Empire's ultimate weapon, referring to it only as an \"unprecedented attack by the Rebel Alliance\" while bringing attention to the fact that the Empire had the means to destroy an entire planet in order to strike fear into those who might question the Emperor's rule. In addition, Lord Vader would send pieces of Alderaan as state gifts to seditious worlds needing to be disciplined."}, {"tag": "p", "text": "Despite attempts to devalue the Rebel victory, Imperial statisticians noted a predictable increase in pirate and dissident activity following the loss of such a prestigious weapon. Seeking to punish those responsible for the station's destruction, the Emperor began a culling at the highest ranks of the Empire, executing officials such as Moff Coovern and Minister Khemt, believing that their incompetence was partly to blame for the station's annihilation. As a result, General Cassio Tagge was promoted to the newly created rank of Grand General and given the majority of the powers Tarkin once held, mainly due to his ability to question the invulnerability of the battle station. To Tagge, the Death Star project had been misguided from the start. A strong proponent of the Imperial Navy, Tagge believed that future plans could not be based around an individual asset such as the Death Star, but should instead utilize those assets as a force multiplier, not as a be-all end-all solution to a problem. The Emperor placed his trust in Tagge's new strategy until the second Death Star could be completed."}, {"tag": "p", "text": "In 5 ABY, debris from the Death Star that was collected by the New Republic was given to the Alderaan Flotilla as a gift from Princess Leia Organa to use to build a space station over the ruins of Alderaan. The former plan was to scrap the debris, but Leia used her political connections to see that it was put to good use."}, {"tag": "p", "text": "The design flaw leading to the destruction of the Death Star never became widely known to the public. Though some correctly speculated that the Emperor had been betrayed by someone on the inside, the public story remained that of Luke Skywalker's shot in a single starfighter."}, {"tag": "p", "text": "Over three decades later, the Empire's successor state, the First Order, constructed a similar weapon of planetary destruction dubbed Starkiller Base, which was considered an improvement on the Empire's Death Star design. Unlike the Death Stars of history, this superweapon, built into the kyber-rich planet of Ilum, could fire its planet-shattering beam through sub-hyperspace, destroying multiple targets light-years away. It, like the Death Stars before it, was destroyed in a blow to an aperture comparable to the thermal exhaust port."}, {"tag": "p", "text": "In 34 ABY, during his self-imposed exile at Ahch-To, the Jedi Master Luke Skywalker had a dream about an alternate life where he ignored Organa's message and never joined the Rebellion, thus he never destroyed the Death Star. In his dream, the Death Star remained operative after his marriage to Camie Marstrap, and in addition to Alderaan, the Death Star destroyed Mon Cala and Chandrila."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The British energy supplier Ovo calculated that by real-world standards, it would cost 7.8 octillion dollars to run the Death Star for one day. Forbes also estimated that it could cost 825 quadrillion dollars to build the Death Star in the first place."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}