{"url": "DS-2_Death_Star_II_Mobile_Battle_Station", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Death Star II locations", "Category:Death Stars", "Category:Imperial projects and operations"], "nodes": [{"tag": "h1", "text": "DS-2 Death Star II Mobile Battle Station"}, {"tag": "p", "text": "The DS-2 Death Star II Mobile Battle Station, also known as the Death Star MK. 2, or simply the second Death Star, was a partially completed moon-sized battle station constructed by the Galactic Empire as the successor to the first Death Star. A larger and more powerful Death Star, the second Death Star's long-term purpose was similar to the first: to terrorize planets and star systems in league with the Rebel Alliance through the use of its planet-destroying superlaser. However, the Death Star II also served another purpose: luring the Rebels into a battle that would, the Empire hoped, destroy them once and for all. Though designed in the likeness of its predecessor's appearance and function, the DS-2 Death Star saw a technical improvement through the incorporation of millions of millimeter-sized heat-dispersion tubes in place of the two-meter-wide thermal exhaust port exploited by the Rebel Alliance at the Battle of Yavin."}, {"tag": "p", "text": "Secretly constructed in orbit around the forest moon of Endor, the Death Star II was larger than its 160-kilometer-wide predecessor and was constructed using more efficient methods. Positioned in synchronous orbit above Endor, the battle station was protected by a deflector shield projected by a ground-based shield generator. With the superlaser being the main priority, the weapon was completed by 4 ABY while the rest of the superstructure was still under construction. After the Empire secretly leaked the location of the \"incomplete\" second Death Star to Bothan spies working for the Rebellion, the Alliance Fleet arrived at Endor and were shocked to find the superlaser fully operational. In the ensuing battle, Rebel ground forces managed to destroy the shield generator protecting the Death Star, allowing Rebel starships to infiltrate the battle station's reactor core and destroy the station. Combined with the deaths of Darth Sidious and his apprentice, the Sith Lord Darth Vader, the destruction of the second Death Star was a significant defeat for the Empire. Within a year, the fractured Empire formally surrendered to the Rebellion's recently introduced government, the New Republic. Some of what little remained of the battle station fell on the waters of the ocean moon of Kef Bir."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "Upon completion, the DS-2 Death Star would have been an immense battle station 200 kilometers in diameter that featured 560 internal levels which could house 2,471,647 passengers and crew. The space station was divided into two hemispheres at the equatorial trench, which itself featured a nested hierarchy of lesser trenches, along with 768 tractor beam emplacements, a multitude of docking bays, and an incomplete ion engine array used to rotate the massive installation. The outer \"shell\" of the battle station was made of quadanium steel, with the areas immediately above and below the equatorial trench being heavily armored. On the outer surface were the station's surface decks (\"city sprawl\"), which consisted of a dense conglomerate of towers. Inside were the station's 560 inner decks, which were positioned planarly, parallel to the equator. Artificial gravity was localized throughout the Death Star II. In the stacked inner decks, gravity was directed north to south while on the surface decks, gravity was directed towards the center of the station, allowing gun crews to stand on the surface of the globe. The Death Star II's two polar columns, which ran from the reactor to each pole, helped stabilize the station's rotational capabilities. The station's two command sectors were located at the north and south poles, with the south also serving as temporary quarters for outer shell construction crews and as space for emergency replenishment stations for labor droids. Above the Death Star II's main weapon, the superlaser dish installed in the station's northern hemisphere, was the command bridge. Patterned after the bridge of the original Death Star, the command bridge was where the superweapon's systems were monitored and controlled. Located on the station's north pole was Emperor Palpatine's personal isolation tower, a one-hundred-story tower which served as the Sith Lord's command center and personal abode while on the battle station. The tower, designed from the outside to be intimidating and menacing, was patterned after Palpatine's personal headquarters on Coruscant, the Imperial Palace, formerly known as the Jedi Temple."}, {"tag": "p", "text": "Before its destruction, the Death Star II's superstructure was still incomplete. Large sections of the outer hull were still missing, exposing the inner decks still under construction."}, {"tag": "h3", "text": "Armaments"}, {"tag": "p", "text": "The most prominent weapon on the Death Star II was its immense superlaser, which was located above the equatorial trench in the station's northern hemisphere and was visually identical to that of the first Death Star. Powered directly by the station's hypermatter reactor, energy was passed through an array of massive kyber crystals, forming a series of powerful laser beams. The eight tributary lasers were then converged by the superlaser's exposed concave focusing dish into a single destructive beam. Unlike the previous Death Star's eight equal sized tributary beams surrounding the dish, the Second Death Star's laser consisted of seven smaller equal sized beams circling the dish and one larger beam located in the center. An improvement on that of the first Death Star, the redesigned superlaser required mere minutes—as opposed to hours—to recharge, and could be focused more finely, allowing it to fire at moving targets such as capital ships. Like the original superlaser, the power of the Death Star II's superlaser could be controlled. Though its main purpose was the destruction of planets, the laser could be tuned to a much lower power setting, suitable for destroying individual spacecraft."}, {"tag": "p", "text": "The Death Star II had extensive point-defense capabilities, featuring 15,000 heavy and 15,000 standard turbolaser batteries along with 7,500 laser cannons and 5,000 ion cannons spread across its outer surface. With the battle station housing 637,835 Naval and Army personnel, the installation boasted a large complement of TIE/ln space superiority starfighters and their variants, stored for space-based encounters, and a plethora of All Terrain Armored Transports and All Terrain Scout Transports for ground surface operations."}, {"tag": "p", "text": "Along with its own laser cannon emplacements, the Emperor's isolation tower was surrounded by the largest concentration of anti-starfighter gun emplacements on the station. Placed at intervals of as little as a few hundred meters, the guns also had improved fire-control compared to all other cannons on the station."}, {"tag": "h3", "text": "Power"}, {"tag": "p", "text": "At the center of the station was its hypermatter reactor core. Approximately one-tenth the diameter of the station itself, the cavernous reactor housed a main assembly consisting of a north and south tower, which were stabilized by power regulators. The reactor core was encased in capacitor panels and supplied power to the entire station through two cylindrical polar columns, which ran from the reactor to each pole. Subsidiary shafts ran from the polar column as well as from four large reactor shafts—bent fifteen degrees in five places—that extended from the reactor to the outside of the station, two of which exited at the equatorial trench. In response to the original Death Star's destruction at the hands of Luke Skywalker during the Battle of Yavin, the second Death Star's design incorporated millions of millimeter-sized heat-dispersion tubes in place of the two-meter-wide thermal exhaust port exploited by the Rebel Alliance."}, {"tag": "p", "text": "A pressurized explosion to the core was capable of detonating the reactor, an explosion of which would be, like the first Death Star, catastrophic to the station."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Construction"}, {"tag": "p", "text": "With the destruction of the first Death Star at the Battle of Yavin, the Empire was left in a vertiginous state as the Imperial Military reeled at such a sizable loss of its martial forces. With the dissolution of the Imperial Senate and increasing pirate and rebel attacks, the Emperor immediately began construction on a new and improved battle station, one more powerful and without the fatal flaw of its predecessor. However, despite its main purpose as a terror weapon for use against star systems, Emperor Palpatine also planned another use for the weapon: upon completion of the battle station's superlaser, the Emperor intended to leak the location of the apparently incomplete and inoperable second Death Star to the Rebel Alliance, luring their forces into a devastating final battle. After crushing the Rebellion, the Emperor planned to send invasion fleets larger than any seen in centuries to blockade the rebellious worlds of Mon Cala and Chandrila until the Death Star II's completion. The Emperor hoped the destruction of these rebel-sympathetic worlds would effectively end any hope the galaxy might have had of defeating the Empire and its tyrannical regime."}, {"tag": "p", "text": "To build this even larger station several years faster than its predecessor, newly appointed Moff Tiaan Jerjerrod was given oversight of the project under the cover title \"Director of Imperial Energy Systems,\" who the Emperor trusted due to his previous work in constructing the first Death Star. The moon of Kef Bir was chosen as the initial construction site, though it was later moved to the forest moon of Endor, located in the same system. A secret hyperspace lane was carved to reach the system from the factory world of Sullust. A dozen planets were stripped bare just to acquire the raw materials to make this second Death Star. The metallic moon of Alprezar, for example, was extensivley mined for that purpose."}, {"tag": "p", "text": "The construction of the Death Star II was conducted in four main stages. The primary stage focused on assembling the components necessary for construction of the reactor core as well as the two massive cylindrical polar columns used to distribute power around the station. With the main power systems in place, four reactor shafts were then fixed to the reactor. Next, a polar cap was fixed to the free end of each polar column, and subsidiary shafts were added to the columns and the four reactor shafts. The equatorial, or \"waistband,\" regions were then constructed, as they contained important docking facilities and the ion thrusters that rotated the station. The third stage prioritized construction of the superlaser. After the main weapon's completion, construction efforts were then focused on the station's outer shell and inner levels, including the Emperor's tower, which was anchored to the station long before his arrival. As was confirmed during development of the first Death Star, construction advanced most efficiently when the working surface allowed for sufficient space for the greatest possible number of self-replicating construction droids. This was Moff Jerjerrod's justification for filling the inner structures in a piecemeal manner. During initial construction, the reactor also required temporary thermal exhaust ports, which the Moff ensured were heavily armored. Arrays of temporary repulsorlift generators were installed in engineering sectors to assist construction, and the countless welding droids in operation meant that large areas of the station were constantly illuminated, allowing human crews to supervise construction operations. Convoys of spacecraft were in constant transit to and from construction areas, supplying materials to active crews. During development, outer-shell-construction crews lived in the far south of the station, sharing the space with energy-replenishment stations for labor droids."}, {"tag": "p", "text": "While initial progress was steady, budget cuts, supply chain breakdowns and a lack of laborers soon conflicted with Jerjerrod's schedule. Unbeknownst to him, the Emperor, in keeping with his plan to fool the Rebels into believing the battle station was incomplete, secretly ordered his agents to sabotage supply convoys traveling to Endor. Hoping to show Lord Vader detailed reports on the station's construction and thus sway his opinion to realize the impossibility of his task, Jerjerrod was swiftly brushed aside by the Sith Lord, who professed the Emperor's lack of contentedness with the project, warning him to double his efforts. Despite increasing the pace of construction, much of the station's inner structures were still exposed and many areas covered in scaffolding and girders upon the Emperor's arrival several weeks later."}, {"tag": "p", "text": "The Death Star II was not positioned in a naturally synchronous orbit around Endor and so required considerable uplift force to counteract the moon's gravity. Held in place by a repulsorlift field projected from an installation on Endor's surface, the immense force from this interaction caused disturbances in the moon's crust, including groundquakes and lakes spilling out from their natural basins. During the final stages of the Death Star II's construction, a deflector shield was projected around the station from the same ground installation, protected by a large gathering of elite stormtroopers stationed there in preparation for the Rebellion's arrival."}, {"tag": "p", "text": "At some point before the Battle of Endor, the second Death Star's software was infiltrated by IG-88. However, the droid's plans were thwarted by the astromech droid R2-Q5. At another point, the Empire's Alpha Squadron flew near the station."}, {"tag": "h3", "text": "Rebel discovery"}, {"tag": "p", "text": "Shortly before the Battle of Endor, the-now Admiral Gallius Rax was summoned to Palpatine's throne room on board the second Death Star. Rax's visit coincided with the landing of a rebel strike force that included the Jedi Knight Luke Skywalker on the Sanctuary Moon. Sensing a shatterpoint approaching, Sidious told Rax to be ready to carry out the Contingency. He commanded Rax to move the Super Star Destroyer Ravager to the Vulpinus Nebula until the events of the shatterpoint had been resolved."}, {"tag": "p", "text": "With the Death Star II's superlaser fully armed and operational, the Emperor's plan to draw the Alliance into a doomed attack was coming to fruition. By Palpatine's order, large portions of the Imperial Starfleet began massing in the Hudalla system in preparations for the upcoming engagement. After members of the Rebel Alliance Starfighter Corps under Corona Squadron arrived in the system, the Empire immediately deployed several TIE/ln starfighters to destroy the vessels. Admiral Firmus Piett gave Commander Ciena Ree, in charge of the TIE squadron, secret orders to allow at least one of the Rebel fighters to escape. Ultimately, all but one of the Rebel ships managed to escape and bring their intelligence back to Alliance High Command, who received further information given to them from the Bothan spynet regarding the Death Star's location and presumed vulnerability, which had been purposely leaked by Sidious's agents. In an effort to allow its scattered fleet time to assemble over the Outer Rim world of Sullust, the Alliance embarked on Operation Yellow Moon, which aimed to distract the Imperials from the buildup until it was too late."}, {"tag": "p", "text": "With the station's superstructure still under construction over Endor and the Rebels falsely believing its superlaser was non-operational, along with learning that the Emperor himself would be overseeing the final stages of its completion, the Alliance could not resist the opportunity to destroy not only the Empire's newest superweapon, but also its head of state."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "With the fleet assembled over Sullust, the Alliance began planning their attack. Knowing the Death Star was protected by a ground-based planetary shield generator, a strike team led by General Han Solo was dispatched to the surface of Endor in order to destroy the shield generator and allow the fleet to enter the battle station and destroy the reactor core. However, during the operation, the Rebels were captured by the stormtroopers stationed there, as the Emperor had planned. Upon arrival, the Rebel fleet conducted a scan of the station, indicating the shield was down; however, they soon found out their scanners were being jammed. Realizing they had fallen into a trap, General Lando Calrissian ordered the vessels to pull back from their attack. However, upon turning back, the Rebels discovered the fleet from the Hudalla system had amassed in the distance and were deploying their starfighters. Having ordered the Star Destroyers to stay back, Palpatine revealed his surprise by commanding Jerjerrod to fire on the Rebel fleet. To the Rebels' astonishment, the Death Star's superlaser fired on the Liberty, obliterating it instantly."}, {"tag": "p", "text": "While Admiral Gial Ackbar argued for retreat, Calrissian assured him that Solo's team would take the shield down and ordered the fleet to move towards the Star Destroyers as another Mon Calamari Cruiser was destroyed by the Death Star, hoping the Imperial vessels would provide them with cover. After several more minutes of dogfighting, the Rebels' sensors detected that the Death Star II's deflector shield had finally been deactivated. In response, Calrissian led the starfighters of Red and Gold Squadrons into one of the Death Star's reactor shafts. As the ships made their way to the reactor, Arvel Crynyd of Green Squadron managed to crash his damaged A-wing into the bridge of the nineteen-kilometer-long Super Star Destroyer, Executor, causing it to plummet towards the surface of the Death Star, where it pierced the surface and erupted in flames."}, {"tag": "p", "text": "As the ships made their way through the tight reactor shaft, Calrissian ordered all pilots bar himself and Red Leader Wedge Antilles to split off and return to the surface in an attempt to draw most of the pursuing TIE fighters away. With the Emperor now having been killed at the hands of Darth Vader, some of the battle station's personnel began evacuating as the battle raged outside. Entering the cavernous reactor core, Calrissian told Antilles to destroy the power regulator on the reactor's north tower, while he used the Millennium Falcon to destroy the bottommost component of the tower. As Antilles and Calrissian escaped back into the shaft, the crippled reactor collapsed and detonated. Making their way back through the shaft, Antilles exited the station as Calrissian folllowed close behind. While the final pursuing TIE interceptor was engulfed by the explosion, Calrissian narrowly escaped the collapsing shaft and directed the Falcon towards the Rebel fleet as the Death Star II exploded."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Shattered Empire"}, {"tag": "p", "text": "Following the destruction of the second Death Star, Imperial records were sent into a state of disarray, with numerous missing persons and unconfirmed dead or wounded. In addition, a vast field of detritus orbited Endor. With several thousand death notices to write and records to update, the task was pushed to the side of Imperial priorities in the days after Endor as the Rebel Alliance capitalized on its stunning victory by pushing the shattered Imperial forces off of many worlds across the galaxy, including the Emperor's homeworld of Naboo, one of the first to fall. Holovids of the station's destruction were disseminated across star systems, while the Empire worked to root out and punish those responsible in spreading what it deemed treasonous lies."}, {"tag": "p", "text": "Nonetheless, the truth of the station's destruction eventually became known to the general citizenry, and both the first and second Death Star continued to serve as symbols of fear and oppression for years to come, permanently leaving their marks on citizens across the galaxy. With the Empire falling apart, many believed that total victory for the recently formed New Republic was imminent. Nonetheless, a year and four days later, Imperial remnants were still fighting the Republic for control of the galaxy, culminating in the Empire's last stand at the Battle of Jakku. The Galactic Concordance was ultimately signed mid-battle, formally ending the Galactic Civil War and transforming the Empire into a mere rump state."}, {"tag": "h4", "text": "A New Order"}, {"tag": "p", "text": "Despite the Empire's defeat at the Battle of Jakku and its total surrender, Imperial fanatics and technocrats fled deep into the galaxy's Unknown Regions, where they formed the Empire's first true successor state, the First Order. A hermit kingdom led by yet another Force practitioner entranced by the destructive capabilities of the original Death Stars, he ultimately oversaw the construction of Starkiller Base, a planet-converted superweapon capable of destroying entire star systems through sub-hyperspace."}, {"tag": "h4", "text": "Emperor Resurgent"}, {"tag": "p", "text": "In the aftermath of the battle, some of the remains of the Death Star II fell upon Endor's ocean moon, Kef Bir, where they were still laying as of 35 ABY. The Jedi Rey traveled to the wreckage of this superweapon to find the wayfinder belonging to her grandfather, Darth Sidious."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The idea of a second Death Star dates back from the early drafts of the 1983 film Star Wars: Episode VI Return of the Jedi. In those versions, two Death Stars orbited the Imperial planet Had Abbadon, which ultimately evolved into Coruscant, as seen in concept art by Ralph McQuarrie. Original trilogy producer Gary Kurtz, on the other hand, stated that the earliest outline for Episode VI didn't include another Death Star, and its inclusion was a decision which displeased him."}, {"tag": "p", "text": "The design of the Death Star II's was a challenge for the crew of Return of the Jedi because it was to suggest a weapon that was incomplete yet still formidable, leading the artists to experiment with different stages of completion. The final Death Star model measured 137 centimeters in diameter, and only included the station's \"front\" side. Constructed of Lucite, the station also featured photo-etched thin metal sheets. Micro holes were scored into the Death Star's surface, illuminating the station with hundreds of tiny lights. The second Death Star model is actually the reverse of what appears on film, with most of its left-hand superstructure incomplete. The image of the battle station was flipped horizontally when used in the final film."}, {"tag": "p", "text": "Other sections of the station were created through sectional models and matte paintings. One painting of an equatorial hangar bay features elements of the San Francisco skyline, including the Transamerica Pyramid."}, {"tag": "p", "text": "One early idea for the 2015 film Star Wars: Episode VII The Force Awakens had Rey living on a junk planet where part of the Death Star II was submerged underwater. Concept art in The Art of Star Wars: The Force Awakens shows her diving, swimming through the Death Star's trench to scavenge goods only to eventually discover pivotal information about the remaining Jedi and Luke Skywalker. Later concept art shows Rey taking the Millennium Falcon subaqueous to find the Emperor's chamber submerged deep underwater. However, the idea was later recycled for the 2019 film Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}