{"url": "DS-3-12", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles that are known by a nickname", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "DS-3-12"}, {"tag": "p", "text": "DS-3-12 was the call sign of a TIE pilot who served in the Galactic Empire's navy by 0 BBY. That year, the Battle of Yavin occurred, during which the Alliance to Restore the Republic attempted to destroy the Empire's DS-1 Orbital Battle Station superweapon. DS-3-12 was among the TIE pilots who fought in the battle, which saw numerous TIE/LN starfighters attempting to defend the battlestation from the Alliance starfighters. Ultimately, the TIE fighters were unsuccessful in defending the station, which was destroyed in a major Alliance victory over the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name \"DS-3-12\" was coined by Wizards of the Coast in the 2002 A New Hope expansion of the Star Wars Trading Card Game. Although the card game identified \"DS-3-12\" as the designation of a TIE fighter, 2008's The Complete Star Wars Encyclopedia instead established that name as the call sign of the corresponding TIE pilot. This article assumes the latter source is correct."}, {"tag": "p", "text": "Furthermore, the Star Wars Trading Card Game card for DS-3-12 uses a film still of a TIE fighter destroyed by Rebel pilot Wedge Antilles during the Battle of Yavin scenes in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. That TIE fighter had previously been identified as \"Black 4,\" and its pilot identified as \"DS-61-4,\" in the 1996 A New Hope Limited expansion set of the Decipher, Inc. Star Wars Customizable Card Game. This article treats the identification of DS-3-12 by the Star Wars Trading Card Game as an error and as such avoids linking the subject to any of the onscreen TIE fighters seen in the A New Hope Battle of Yavin scenes."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}