{"url": "DS-55-2", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles that are known by a nickname", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "DS-55-2"}, {"tag": "p", "text": "DS-55-2 was the call sign of an Imperial Navy TIE pilot who served by 0 BBY. That year, during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, the Alliance attempted to destroy the Imperial DS-1 Orbital Battle Station superweapon during the Battle of Yavin. DS-55-2 fought in the battle, alongside numerous other TIE/LN starfighters that attempted to defend the battlestation from the attacking Alliance starfighters. Ultimately, the TIE fighters were unsuccessful in defending the station, which was destroyed in the subsequent Alliance victory over the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The \"DS-55-2\" name was coined by the 2002 A New Hope expansion of Wizards of the Coast's Star Wars Trading Card Game. Identified as the designation of a TIE fighter in the card game, 2008's The Complete Star Wars Encyclopedia would later establish that name as the call sign of the corresponding TIE pilot. This article assumes the latter source is correct."}, {"tag": "p", "text": "Furthermore, the Star Wars Trading Card Game uses a film still of a TIE fighter that was previously identified as Black 4, piloted by DS-61-4, in the 1996 A New Hope Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game. This article treats the Star Wars Trading Card Game identification of DS-55-2 as an error and further refrains from linking the subject to any of the onscreen TIE fighters shown in the Battle of Yavin scenes of the 1977 original trilogy film, Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}