{"url": "DSD1_dwarf_spider_droid/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Out of Universe cleanup", "Category:Baktoid Armor Workshop products", "Category:Galactic Empire vehicles", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "DSD1 dwarf spider droid"}, {"tag": "p", "text": "The DSD1 Dwarf Spider Droid, was a battle droid manufactured by the Commerce Guild to support the cause of the Separatists."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The DSD1 was similar in function to a typical combat vehicle. It was also used to punish customers who had declined to pay their taxes to the Commerce Guild."}, {"tag": "p", "text": "Its main weapon was a long central blaster cannon mounted on its dome that was capable of firing either rapid anti-personnel rounds, or slower high-intensity blasts that could destroy light vehicles. The droid's small frame and four all-terrain legs made it suitable for warfare in extreme environments or environments with lots of verticality such as mines. Its legs were even allowed the droid to walk straight up and down things like walls and narrow cliffsides. The DSD1's adjustable legs also allowed it to attain better elevation for its central blaster cannon. However, because of the fixed laser cannon, it could not turn around to track enemies, thus making it exceptionally susceptible to speedy targets. Also, the length of this cannon sometimes hindered the droids mobility in confined areas, a weakness that Anakin Skywalker exploited on Escarte."}, {"tag": "p", "text": "The droid communicated in a beeping language similar to Binary. It seemed to have basic emotions, such as frustration, as demonstrated on Escarte and Teth. Dwarf Spider Droids were notorious for refusing to perform any action they predicted would harm them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, dwarf spider droids were used on the front lines, in front of platoons of battle droids and other Separatist droids. They were notably used during the Battle of Teth, using their laser cannons to hit the feet of the AT-TE walkers, causing the walkers to fall down the cliff. During the Second Battle of Felucia, there was a large group of them inside the Separatist base, presumably as a nasty surprise to the Republic troops that got in. The dwarf spider droid also worked in conjunction with the larger OG-9 homing spider droid and could operate as an armored scout exploring the battlefields."}, {"tag": "p", "text": "Infrared photoreceptors and powerful scanners enabled the Dwarf Spider Droid to survey the terrain and relay target data back to the Homing spider droid. When these scanners identified a target, they sent a tracking message through a digital channel from the head-mounted aerial to the homing spider droid, which then moved toward the signal to deliver the killing blow. Dwarf Spider Droids also featured a self-destruct mechanism. If a clone unit moved in to destroy the Dwarf Spider Droid, it would usually self-destruct, destroying both itself and any enemies around it."}, {"tag": "p", "text": "Several variants of the dwarf spider droid saw action during the wars, including an amphibious model, designed for water-filled terrain such as marshes, swamps, or wetlands. This variant was equipped with a larger gun, but could not float. There were also at least two heavily armored variants—the heavy dwarf spider droid and the advanced dwarf spider droid. Delta Squad encountered many advanced dwarf spider droids on their missions including two during the Battle of Geonosis, and several during the Battle of Kashyyyk, where they were used to counter the Republic's All Terrain Recon Transport units."}, {"tag": "p", "text": "Though most Separatist war vehicles were deactivated after the end of the Clone Wars, the dwarf spider droids were recommissioned through Imperial command and used by the Galactic Empire to enforce the submission of former Separatist worlds, fighting against the remnants of the very government that once used them, with the Stormtrooper Corps using the droids as their mechanical attack dogs. They would remain utilized throughout the Empire's reign, and it was not uncommon to see these droids alongside stormtroopers at Imperial checkpoints."}, {"tag": "p", "text": "Dwarf Spider Droids were also known as the Burrowing Spider Droid. This nickname stemmed from one of the first encounters with this droid model, where it was used to destroy opposition in narrow mine shafts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dwarf spider droid first appeared in Star Wars: Episode II Attack of the Clones. Early in production, the plan was for the various commerce guilds to employ the same type of battle droids used by the Trade Federation, only with different color schemes to differentiate allegiance. It was instead decided to provide a greater visual diversity by designing wholly unique droids for the Commerce Guild, Corporate Alliance, and InterGalactic Banking Clan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}