{"url": "DT-F16", "categories": ["Category:Canon articles", "Category:Death troopers", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "DT-F16"}, {"tag": "p", "text": "DT-F16 was a human female death trooper commander who, along with her squad, were tasked with guarding a large kyber crystal from the Jedha system for delivery to the Tonnis sector in Freighter 2716 to rendezvous with an Imperial I-class Star Destroyer helmed by Captain Slavin. At a brief stop at Faos Station, the freighter was infiltrated by the rebels Saw Gerrera, Ezra Bridger, Sabine Wren, and Chopper. DT-F16 attempted to combat the rebels, but was killed when Saw rigged the kyber crystal up to the freighter's hyperdrive, creating a bomb, and Ezra, Sabine, Chopper, and the freighter's prisoners escaped in a Lambda-class shuttle intended for the commander."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around 1 BBY, DT-F16 and her squad were traveling on Freighter 2716, a covert Imperial ship disguised as a civilian vessel, guarding a large kyber crystal that was being delivered to a rendezvous in the Tonnis sector. Unbeknowest to most of the freighter's crew, it was infiltrated by the rebels Saw Gerrera, Ezra Bridger, Sabine Wren and Chopper during a stop at Faos Station. When the rebels discovered the hold with the kyber crystal, she encountered the rebels, and ordered her death troopers to open fire. As the troopers quickly fell to the rebels in the smoke generated by several smoke bombs tossed by Wren, DT-F16 ordered the remaining troopers to group up. During the skirmish, one of Gerrera's blaster shots struck the carbon-frozen crystal, prompting her to order a retreat; however, she would be the only one to escape, as her remaining troopers were blasted by Gerrera and Wren."}, {"tag": "p", "text": "DT-F16 later informed the freighter's captain, Wells, that rebels led by Gerrera infiltrated the hold and requested reinforcements. The captain gave her reinforcements, warning her that she had to retake the crystal, something which she was aware of as their heads would be gone if the crystal was stolen. When reinforcements arrived (in the form of four stormtroopers), she returned to the hold, only to find both the rebels and the crystal gone. The captain informed her that they had lost contact with the engine room, so she made her way there."}, {"tag": "p", "text": "Upon arriving, Gerrera, who had turned the crystal into a ticking time bomb, fled the area after freeing Bridger and Wren. DT-F16 and the stormtroopers prepared to fire, but before they could do so, the crystal electrocuted the two troopers in front of her. She realized that she had to leave immediately and ordered the remaining troopers to abandon ship. She made her way to hold 12, where a Lambda-class shuttle was waiting for her departure. By the time she got there, the freighter's prisoners, who had been freed by the rebels, were boarding. She and the two troopers accompanying her attempted to open fire, but Bridger and Wren, who had also arrived, managed to overpower her and the two troopers before getting on the shuttle and taking off. Refusing to give up DT-F16 made a futile attempt to destroy the shuttle with her blaster, and was subsequently killed in the ensuing explosion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "DT-F16 was a female death trooper who had a mechanical voice. She was completely covered in black armor and had a green-tinted visor. DT-F16 was determined to ensure the safe delivery of a large kyber crystal to Slavin's Star Destroyer and feared the consequences of failure. She wielded an E-11D blaster. As a commander, DT-F16 had leadership skills but failed to apprehend rebel boarders and stop them from destroying the kyber crystal and escaping with the prisoners."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "DT-F16 first appeared in \"In the Name of the Rebellion,\" a two-part episode of the fourth season of Star Wars Rebels. She was voiced by Jennifer Hale, who voiced Aayla Secura, Riyo Chuchi, Lolo Purs, and Trella Bare'Ah in Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}