{"url": "DV-692", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Clone stormtrooper officers of the Galactic Empire", "Category:Officers of the 501st Legion (Galactic Empire)"], "nodes": [{"tag": "h1", "text": "DV-692"}, {"tag": "p", "text": "DV-692 was a clone stormtrooper officer of the Galactic Empire who served in the 501st Legion during the Galactic Civil War. In 0 BBY, he was stationed aboard the Imperial Star Destroyer Devastator, under the command of the Dark Lord of the Sith Darth Vader. DV-692 participated in the Devastator's capture of the Rebel CR90 corvette Tantive IV and led his squad to search for the passengers of the ship. In one of the corvette's passageways, the squad spotted the Alderaanian Senator Leia Organa, and DV-692 stunned her as she tried to escape. His unit escorted their captive to Vader and then to the Devastator's prison."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "DV-692 was a Human male clone who served the Galactic Empire as a lower officer in the Stormtrooper Corps during the Galactic Civil War. He was a member of the elite stormtrooper legion known as the 501st, and he was assigned to lead a squad of the legion. In 0 BBY, DV-692 was stationed aboard the Imperial I-class Star Destroyer Devastator, commanded by the Dark Lord of the Sith Darth Vader."}, {"tag": "p", "text": "That year, Rebel agents transmitted the stolen plans of the first Death Star, a new Imperial superweapon, to the Rebel CR90 corvette Tantive IV. Over the planet Tatooine, the Devastator pursued and captured the Tantive IV, which was the consular ship of Senator Leia Organa of Alderaan. Led by an assault commander, DV-692 and his squad boarded the Tantive IV in the first wave of stormtroopers. After the Imperial troopers cleared out the initial Rebel resistance, Vader came aboard the ship and ordered the stormtroopers to search for the passengers of the Tantive IV and capture them alive."}, {"tag": "p", "text": "DV-692 split the troopers of his squad into two groups; he ordered half of them to search a passageway and secure a junction, and led the rest to another corridor. The squad's orders were to search the passageways astern and forward. One of DV-692's squadmates spotted Organa hiding in a small alcove and alerted DV-692 of her presence; however, Organa outdrew DV-692's squadmate and shot him dead. Organa tried to escape, but DV-692 stunned her with his E-11 blaster rifle. The squad escorted Organa to Vader, who ordered them to take the prisoner to the Devastator's holding facility."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "DV-692 wore full stormtrooper armor without rank insignia, and he sported a standard E-11 stormtrooper blaster rifle during the battle aboard the Tantive IV."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of DV-692 first appeared in the December 1976 novelization of George Lucas's 1977 film Star Wars: Episode IV A New Hope, ghostwritten by Alan Dean Foster. In the novel, DV-692 wore rank insignia on his arm, but he did not have any such insignia in the film. His first visual appearance was in the first issue of Marvel Comics's Star Wars series in March 8, 1977, although only his right hand and feet were pictured in the comic."}, {"tag": "p", "text": "His first live-action appearance occurred in the film A New Hope itself, in which he was portrayed by an uncredited extra. The scene was one of the last few of principle photography in the United Kingdom and was filmed sometime between June 29 and July 16, 1976. DV-692's lines, performed by disc jockey Terry McGovern, were said over a walkie-talkie and recorded by sound designer Ben Burtt. The sound effect of his stun shot was a mix of an ARP synthesizer playing a note with a \"rising pitch and a delay\" to bombinate combined with the sound of an air cannon. The script of A New Hope, as presented in Star Wars: Behind the Magic, identified DV-692 simply as \"Trooper.\""}, {"tag": "p", "text": "The script of the 1981 Star Wars radio drama, as presented in Star Wars: The National Public Radio Dramatization, addressed DV-692 as \"3rd Trooper.\" His line in the radio drama was a bit longer and suggested that he did not shoot Organa, but that another trooper from his squad fired on her. In 2002, the A New Hope expansion set of Wizards of the Coast's Star Wars Trading Card Game was the first to identify the trooper as \"DV-692,\" a clone stormtrooper."}, {"tag": "p", "text": "DV-692's dialogue varies slightly from the various adaptations of the film, including the novelization, the radio drama, the Marvel comic, and the Contemporary Motivators: Star Wars. As highlighted in the 2007 StarWars.com Visual Guides, in A New Hope, DV-692's helmet was missing a heat dispenser vent decal, which should have been located on the helmet's \"cheeks.\" Additionally, in Classic Star Wars: A New Hope, the role of DV-692 and his companion shot by Organa is merged into that of a stormtrooper sergeant, who calls out Leia's presence and stuns her, though not before she manages to shoot two other stormtroopers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}