{"url": "Da%27la_Socuna", "categories": ["Category:Legends articles", "Category:Alliance Starfighter Corps personnel", "Category:Females", "Category:Humans", "Category:Pilots", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Da'la Socuna"}, {"tag": "p", "text": "Da'la Socuna was a Human female who served the Rebel Alliance as a pilot during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Within the Alliance, Socuna attained the rank of commander and served with the Crimson Phoenix Squadron as a pilot trainer. Sometime following 0 BBY she worked in the Mos Espa cantina on the planet Tatooine. While there, she recruited a spacer sent to her by Gendra. She issued the novice pilot a Z-95 Headhunter and gave a mission to patrol a Rebel spy route in the Tatoo system. Though the pilot was ambushed by three TIE pilot cadets, they were all destroyed, and the pilot returned back safely."}, {"tag": "p", "text": "Socuna later gave additional missions, which included hunting down TIE fighters, and escorting a crippled refugee transport in the system. All missions were completed successfully, and Socuna awarded the pilot with a Rebel flightsuit. However, Socuna had one final task for her new pilot, which involved eliminated a TIE fighter Veteran Commander and his three escorts. Upon successful completion of the missions, Socuna transferred the pilot to Major Eker for additional assignments."}, {"tag": "p", "text": "She also became involved in the defense of Mos Espa when Tusken Raiders, led by the Tusken King, launched an invasion of the city."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Da'la Socuna is a Non-Player Character (NPC) in the MMORPG Star Wars Galaxies. She was added to the game with the 2004 expansion, Jump to Lightspeed."}, {"tag": "p", "text": "In the game, Rebel players who join the Crimson Phoenix Squadron begin their training with Socuna."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}