{"url": "Dac", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Alliance to Restore the Republic planets", "Category:Calamari sector planets", "Category:Confederacy of Independent Systems planets", "Category:Destroyed planets", "Category:Galactic Alliance planets", "Category:Galactic Republic planets", "Category:Mon Cala locations", "Category:Type I atmosphere planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Dac"}, {"tag": "p", "text": "Dac, as it was called in Mon Calamarian, Quarrenese, and Basic, also known as Mon Calamari and sometimes simply called Calamari or Mon Cala, was a planet in the Calamari system of the Calamari sector, located in the Outer Rim. It was home to a wealth of sentient species: the Mon Calamari, the Quarren, the Moappa, the Amphi-Hydrus, and the Whaladons. Mon Calamari was the name given to the planet by Human explorers from the Galactic Republic who first discovered and revealed the world to the rest of the galaxy. The native species referred to the planet as Dac. The planet was a shining bluish-white orb from space, due to its ocean-covered surface. It was home to 27.5 billion Mon Calamarians and Quarren, as well as surrounded by the impressive Mon Calamari Shipyards."}, {"tag": "p", "text": "In 137 ABY, all life on the planet was wiped out in accordance with the Final Protocol ordered by Darth Wyyrlok of the One Sith with the use of Viral spores to punish the Mon Calamari for rendering aid to the remnants of the Galactic Alliance. Nearly 20% of the planet's population was saved during the Evacuation of Dac."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An aquatic planet in the Outer Rim Territories, Mon Calamari had a bluish-white color. Some cities on the planet, such as New Coral City, were built on the surface of the ocean. The Mon Calamari and Quarren both lived on the world and were often at odds as a result. The Mon Calamari Shipyards were a very important part of the economy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early millennia"}, {"tag": "p", "text": "The Mon Calamari lived comfortably on the surface and below while the Quarren lived in the depths of the oceans. The massive Whaladons meddled little in governmental affairs, swimming in their pods and protected from hunting by law."}, {"tag": "p", "text": "In 4500 BBY, the Quarren made war on the Mon Calamari, but the Mon Calamari won the war, resulting in the near-extinction of the Quarren. The Mon Calamari raised the next generation of Quarren themselves, teaching them Mon Calamari values."}, {"tag": "p", "text": "The planet was discovered in 4166 BBY; by that time its inhabitants had already been exploring nearby star systems for several years."}, {"tag": "p", "text": "During the conflict with the Eternal Empire, the oceans were patrolled by schools of Pliffer Fish who were known to feed on toxins. Some individuals attempted to acquire breeding pairs in order to clean up industrial spills on other worlds."}, {"tag": "p", "text": "Around five hundred years before the Battle of Naboo, a number of needy Mon Calamari and Quarren locals were approached by recruiters sent by Hugo Bartyn. Bartyn wanted amphibian fishermen to settle a new city in Lamaredd and tempted these poverty-stricken individuals with promises of untouched seas in a new frontier. Once they arrived, however, they became slave laborers."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The planet was represented in the Galactic Senate by the corrupt Tikkes, who allowed Thalassian slavers to operate in the Calamari sector for a share of their profits. He was exposed in 22 BBY. He escaped Republic custody on Coruscant and fled to Geonosis, where he became a member of the Separatist Council as leader of the Free Dac movement, which sought to cut ties between Mon Calamari and the Republic."}, {"tag": "p", "text": "During the Clone Wars, the world was attacked multiple times by the Confederacy of Independent Systems. First, Count Dooku devastated the world with the Dark Reaper. Later, Tikkes's Quarren Isolation League attempted to overthrow the Mon Calamari Council. Tikkes's actions led to a conflict between the two native peoples, but the League was defeated by Kit Fisto and the Mon Calamari Knights. It was discovered by Kit Fisto that the League was allied with the Moappa, whom Kit discovered were also sentient. Kit informed the Mon Calamari that they needed to make peace with and respect the sapience of the Moappa."}, {"tag": "p", "text": "Many members of the Quarren Isolation League and the Free Dac movement fled Mon Calamari, settling on the CIS worlds of Pammant and Minntooine, where the Free Dac Volunteers Engineering Corps created shipyards. Using designs based on Mon Calamari Shipyards blueprints stolen by the CIS as a basis, these yards created Recusant-class light destroyers at Minntooine and Providence-class carrier/destroyers at the Pammant Docks for the Separatist fleet."}, {"tag": "p", "text": "There were also Separatist Mon Calamari, led by the heroic Commander Merai, backed by Passel Argente and the Corporate Alliance. Without the approval of Count Dooku, the Mon Calamari led an effective assault during the First Battle of Kamino, using their amphibious fighters and Merai's personal assault ship, the Shark. Ultimately their assault failed, as Dooku betrayed them. Most of the Mon Calamari forces were able to escape the disaster due to the sacrifice of Merai."}, {"tag": "p", "text": "In 21 BBY, tensions between the Mon Calamari and Quarren began to escalate again, with many Quarren especially being dissatisfied with the planet's Mon Calamari–controlled monarchist government and their close relationship to the Republic. While Yos Kolina, the eighty-second and current King of Mon Cala, mediated the dispute, the Separatist leader General Grievous prepared an invasion of the Calamari system. Dac held strategic importance to the Republic's war effort at this time, due to the planet providing Republic shipyards with a special ore to strengthen cruiser armor plating. As part of their invasion plans, the Separatists sent Commander Riff Tamson to assassinate Kolina and push the Mon Calamari and Quarren towards civil war. In the wake of Kolina's death, the Quarren began a dispute with the Mon Calamari regarding their sovereignty and the monarchy's line of succession. Hoping to break free from the rule of the Mon Calamari, the Quarren challenged the monarchy, wanting one of their own on the throne instead of the heir apparent Prince Lee Char. As the diplomatic crisis continued to unfold, Gial Ackbar, captain of the Mon Calamari Guard, asked the Republic to send representatives to help mediate the situation. Senator Padmé Amidala and Jedi General Anakin Skywalker were sent to Dac, but the Quarren Chieftan, Nossor Ri, responded by asking for an envoy from the Separatists' side to be present for the negotiations as well, a call that was answered by Tamson. Exploiting the tensions between the Quarren and Mon Calamari, Tamson convinced Ri to side with the Separatists so that the Quarren could claim control over Dac. Unbeknownst to the Quarren, however, Tamson had made a deal with Dooku to become Dac's ruler after the planet fell under Separatist control."}, {"tag": "p", "text": "Following the failure of a peace conference, the Separatists, led by Tamson, and the Quarren, led by Ri, began a combined assault on Dac's capital, Coral City. The Mon Calamari and their Republic reinforcements continually lost ground, with all of them eventually being captured by Tamson and put to work in prison camps for Dooku and the Confederacy. Tamson then took Kolina's throne for himself, much to the shock of Ri and the Quarren, who began to regret their alliance with the Confederacy. When Lee-Char and his Jedi protector, Padawan Ahsoka Tano, were the only ones who had evaded capture, Dooku sought to finish what he had begun with Kolina's assassination: the termination of the royal bloodline through the execution of the prince. Despite the fear of living up to his father, Lee-Char took his place as leader of the Mon Calamari, using his father's old friendship with Ri to convince the Quarren to re-side with them and the Republic. This led to the defeat of Tamson and the removal of the Separatist presence on Dac, and Lee-Char succeeding his father as Dac's ruler."}, {"tag": "p", "text": "After the Republic loyalty of the planet was cemented, the Loyalist inhabitants agreed to a new arrangement: dual representation in the Senate, with Tundra Dowmeia representing the Quarren and Meena Tills representing the Mon Calamari. Meena Tills was held hostage on Coruscant by Korunnai terrorists, but rescued by Republic Commandos. Both Senators were signatories of the Delegation of 2000's petition, resulting in their arrest upon the Declaration of a New Order."}, {"tag": "h3", "text": "Imperial era"}, {"tag": "p", "text": "The planet was represented in the Imperial Senate by Timi Rotramel until it was harshly subjugated by the Galactic Empire, which saw the people of Mon Calamari as natural slaves whose industries and resources could be used to power the Imperial war machine in the Outer Rim Territories. The Imperial propaganda machine cited the signing of the Petition of 2000 by the planet's previous disloyal senatorial representatives as an excuse for the repression of the Mon Calamari. The Imperials were aided during the occupation by the sabotage of the planetary shields by Quarren saboteurs such as Seggor Tels, swiftly conquering the planet."}, {"tag": "p", "text": "During the Imperial occupation of the planet and its system, the Mon Calamari started a resistance movement, which was unsuccessful at first. Eventually, Emperor Palpatine ordered three of the planet's floating cities to be destroyed in reprisal. Regardless, the Imperial attack did not succeed in breaking the Mon Calamari spirit. Instead of extinguishing the resistance, it pushed the world's natives into open rebellion when the Mon Calamari joined the Quarren against the invaders in a grand and secret military effort which finally repelled the Imperials and pushed them off their planet, their system and indeed the entire sector. Shortly after the uprising, while preparing the planet to join efforts with the Rebel Alliance, the Imperial Senator Timi Rotramel attempted to bring other species and systems into the Rebellion against the Empire; unfortunately for Rotramel, shortly after failing to convince the Tiss'shar to join a Sector rebellion, he was killed on Tiss'shar by Darth Vader, who discovered his secret rendezvous with Tiss'shar President Si-Di-Ri."}, {"tag": "p", "text": "The Imperial propaganda did not wait to attempt to discredit the Mon Calamari, as the Imperial sentientologist Obo Rin, working under the direction of Lord Vader, wrote the Catalog of Intelligent Life in the Galaxy. This work included falsified claims that the first contact between the Mon Calamari and galactic civilization occurred during the reign of the Galactic Empire. This was accepted as truth by many citizens of the Empire, further angering the Mon Calamari."}, {"tag": "p", "text": "After Mon Calamari's revolution against the Empire, the Mon Calamari and the Quarren joined with the Rebel Alliance, proving to be an invaluable asset in the Galactic Civil War. The Mon Calamari, masters of starship construction, supplied the Alliance with badly needed capital ships constructed at the Mon Calamari Shipyards. Prior to joining the Alliance, the Mon Calamari had only built passenger liners and deep-space exploration vessels because of their peaceful ethos, but by heavily retrofitting these vessels, they were able to create warships that could take on the Empire's mighty ships of the line."}, {"tag": "p", "text": "The Mon Calamari disrupted and mined known routes that led to their sector, while searching for new secret routes. In order to retake Dac the Empire would have to launch a long campaign that might embolden other rebel planets. Therefore the Imperial attack was postponed."}, {"tag": "p", "text": "During this time of war, the Mon Calamari and Quarren of Dac lived under the constant threat of an attack by Imperial fleets. The Alliance maintained a strong presence in the star system, including enough capital ships to defend against a standard Imperial battle line or perhaps even a squadron, but the Alliance and the Mon Calamari didn't have enough firepower in the system to repel a full Imperial attack squadron. The main Alliance fleet was considered too precious to risk in such a dangerously exposed position. As early as 1 ABY Imperial Intelligence Operations sent operatives to the planet in preparation for Imperial strikes on the planet's floating cities."}, {"tag": "p", "text": "While the Alliance Fleet was fighting over Endor, massive imperial fleets moved to siege Mon Calamari Space. The Death Star would destroy Dac once completed, but Emperor Palpatine died before the Empire could put its plans into action. Imperial commanders turned into independent warlords after the Battle of Endor and fortunately Moff Kaine withdrew to another side of the galaxy instead of attacking Dac."}, {"tag": "p", "text": "By the time of the Battle of Endor, Mon Calamari Star Cruisers were extensively used by the Alliance, playing a major role in the hands of Mon Calamari Admiral Gial Ackbar, who put them to good use in that decisive battle."}, {"tag": "h3", "text": "Anchor of the New Republic"}, {"tag": "p", "text": "Mon Calamari was a founding member of both the Alliance of Free Planets and the New Republic. Ackbar represented the planet on the New Republic Provisional Council. The New Republic defeated further Imperial invasions thrice at Mon Calamari: the first time against the Whaladon hunting submarines of Emperor Trioculus's Imperial faction; the second against the World Devastators of the resurrected Palpatine's Dark Empire; and the third against the Star Destroyers of Admiral Daala's Maw fleet. These three battles caused many cities to be destroyed, and members of all the indigenous sentient species suffered loss of life. During the battle against Daala, Leia Organa Solo discovered that the Mon Calamari Ambassador Cilghal, Ackbar's niece, was Force-sensitive. Cilghal was the first Mon Calamari to join the New Jedi Order. The planet was later represented in the New Republic Senate by Q-Varx, who was revealed as a traitor and replaced by Cilghal."}, {"tag": "h3", "text": "Birth of the Galactic Alliance"}, {"tag": "p", "text": "During the Yuuzhan Vong War, the planet was represented by both the Quarren Pwoe and the Mon Calamari Gron Marrab. After the fall of Coruscant to the Yuuzhan Vong in 27 ABY, the remaining senators and politicians of the new Republic government fled to Mon Calamari, which had not been taken by the Yuuzhan Vong. The world's massive shipyards, large defensive fleet, and isolation from the front lines made it a desirable location. Pwoe tried and failed to usurp the New Republic presidency and eventually joined the Ylesian Republic on Ylesia. Marrab, however, remained loyal, and represented his homeworld in the Senate. Following the election of Cal Omas as the new Chief of State, the New Republic was reorganized into the Galactic Federation of Free Alliances, or Galactic Alliance in 28 ABY. The Alliance was formed on Mon Calamari, which served as its original capital until the end of the Yuuzhan Vong War."}, {"tag": "h3", "text": "Second Imperial Civil War"}, {"tag": "p", "text": "After the Sith–Imperial War, the planet was once again under Imperial control. Under the rule of usurper Emperor and Dark Lord of the Sith Darth Krayt, the Quarren were placed in charge of the planet, as the new Sith Order held a number of Quarren amongst its members, most notably Darth Azard and the late Darth Maleval.\nIn an attempt to destroy Gar Stazi and the Galactic Alliance Remnant, who the Calamari supported in secret, Admiral Dru Valan laid a trap at Mon Calamari by leaking information about the Imperious, a new type of Star Destroyer that was under construction at the Mon Calamari Shipyards. The resulting battle resulted in the destruction of more than half of the Shipyards."}, {"tag": "p", "text": "Krayt was angered by the theft of the Imperious, and decided to take his anger out on the Mon Calamari people. He traveled to Dac, and during an address to the Mon Calamari Council, he ordered the immediate execution of one-tenth of their population. After initiating the massacre by having the members of the Council itself killed, Krayt commanded that the remainder of the Mon Calamari population be rounded up and incarcerated in work camps; those Mon Calamari who tried to escape this fate were to be pursued and killed. Krayt's ultimate goal in this matter was to render the Mon Calamari extinct and to \"purge the galaxy of their culture and history\" as a warning to anyone else who had notions of defying his empire."}, {"tag": "p", "text": "Following the initial death of Darth Krayt, Krayt's regent, Darth Wyyrlok, fully took control of the One Sith. No longer desiring to waste Imperial resources on the planet or in long and costly campaigns, Wyyrlok issued an edict calling for the immediate termination of the genocide. The ocean's water was then poisoned by Sith scientist Vul Isen in an attempt to wipe out all life on the planet. However, Admiral Gar Stazi refused to abandon the native Mon Calamari and other innocent inhabitants without an evacuation attempt."}, {"tag": "p", "text": "Stazi led the Galactic Alliance Core Fleet to Dac, reinforced by an elite squadron of Jedi to the dying planet. A task force under Jedi Master Drok succeeded in sabotaging the defenses of the Mon Calamari Shipyards, and Jedi Master Asaak Dan led a group of Mon Calamari Rangers in securing Heurkea Floating City to serve as the base of operations for the evacuation. Capturing additional ships in the Shipyards, the Alliance easily overwhelmed remaining Sith forces. With the planet under control, a massive fleet of private ships from all across the galaxy exited hyperspace, and began the rescue operation."}, {"tag": "p", "text": "With the Galactic Alliance fleet engaged in rescue operation, the Sith sprung their trap. The Outer Rim Third Fleet, under the command of Admiral Krion Grail and supervised by Moff Geist and Fist Darth Stryfe, emerged from hyperspace behind the Alliance fleet. Focusing on protecting the evacuation fleet, the Alliance fleet suffered heavy damage. As all seemed lost, however, a number of Star Destroyers belonging to Roan Fel's Empire-in-exile appeared, surrounding the Imperial fleet. Now trapped themselves, Stryfe and Geist ordered a retreat, leaving Dac safe for evacuation."}, {"tag": "p", "text": "Unfortunately, it was already too late for most of the planet's population. The combined Alliance, Imperial, and civilian fleet was only able to save around twenty percent of Dac's Mon Calamari, Quarren, Whaladons, and Moappa. While numbering in the billions, it was only a small percentage of the world's total population of 27 billion, and does not include the even greater amount of creatures and other unique life forever lost beneath the waves."}, {"tag": "h3", "text": "Galactic Triumvirate"}, {"tag": "p", "text": "Following the defeat of the One Sith, the Sith were driven underground again, and a Galactic Federation Triumvirate, consisting of the Fel Empire, the Jedi Order, and the Galactic Alliance, assumed power in Coruscant. In 138 ABY, a large number of Quarren and Mon Calamari were lured back to Dac under the pretext that the planet was being \"renewed.\" Instead, these unfortunate Quarren and Mon Calamari were enslaved by a pirate syndicate led by the rogue Sith Darth Luft, who forced them to build a fleet of ships in the remnants of the Mon Calamari Shipyards. Darth Luft and his pirates also kept their children and elderly relatives hostage. The Quarren and Mon Calamari ship builders were also beaten and mistreated by their pirate captors."}, {"tag": "p", "text": "One Quarren named Tikin befriended a Mon Calamari environmental engineer named Luen. These two encountered the Imperial Knight Jao Assam and the junk dealer Ania Solo, who learned about their predicament and quickly transmitted word of the pirates and their slaving operation to the Triumvirate authorities in Coruscant. Later, Tikin was murdered by Darth Luft and his death triggered a slave uprising by the Quarren and Mon Calamari, who joined forces to rebel against the pirates. This uprising coincided with an attack by the Galactic Triumvirate led by Admiral Stazi and the Imperial Knight Yalta Val, who liberated the slaves and apprehended the pirates. Darth Luft himself was killed during a duel by Jao Assam. The Quarren and Mon Calamari then settled in the space station, which had been flooded with water by Admiral Stazi, to provide a comfortable atmosphere for the former slaves. As a gesture of reconciliation between the Quarren and Mon Calamari, Tikin's son Tilin was raised by Aunt Luen."}, {"tag": "h2", "text": "Government"}, {"tag": "p", "text": "Dac had been ruled by a monarchy for 83 generations. Their king would advise the Mon Calamari Council which was made up of politicians and other experts. Although a small number of Quarren chiefs served on the council, the majority was Mon Calamari."}, {"tag": "p", "text": "But during Dac's enslavement by the Galactic Empire calls for changes to the government spread. Under Imperial rule the monarchy was fragmented, leading to a new government to take shape. The new government was based off the Chandrilian planetary government and renamed \"Dac Council.\""}, {"tag": "p", "text": "Under the Dac Council governors and deputy governors were elected every two years from each colony and district on Dac. The governors and deputy governors on the council served as representatives for their respective districts and colonies. Candidates for leadership of the council are selected by each faction and put to a general vote. The winner of the election would be the Chief of State while the runners-up would fill the positions of prime minister and defense minister."}, {"tag": "h3", "text": "Known senators of Mon Calamari"}, {"tag": "h4", "text": "Old Republic and Imperial Representatives"}, {"tag": "h4", "text": "New Republic and Galactic Alliance Representatives"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This planet has been referred to by at least four different names throughout the Expanded Universe (EU):"}, {"tag": "p", "text": "A 1982 issue of Bantha Tracks provided a preview of the Mon Calamari and named their home planet Dac (before the Mon Calamari and Quarren made their first canonical appearance in Return of the Jedi). Later EU sources, such as Star Wars: Dark Empire and The Jedi Academy Trilogy, refer to the planet as \"Calamari.\" However, in following years, most EU sources began to call the planet \"Mon Calamari.\" To add to the confusion, the novel Assault at Selonia refers to it as \"Mons Calamari.\" In the fourth season of the Star Wars: The Clone Wars television series, the planet is referred to as \"Mon Cala.\""}, {"tag": "p", "text": "Despite its appearance in early sources, canonicity of the name \"Dac\" was initially disputed. The roleplaying game supplement Geonosis and the Outer Rim Worlds brought Dac back into canon, noting that Dac was the name used by the natives in their own language for the world; some newer EU material has begun to refer to the planet by this name, where appropriate. Additionally, other recent EU literature has adopted the name Dac when referring to Quarren CIS members."}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Mon Calamari in the Sluis sector of the Galactic Core. The Sluis sector is actually located in the Outer Rim. Additionally, the in-game encyclopedia entry for the planet incorrectly states that Mon Calamari had only one moon, and is one of the sources that states that the planet was first discovered by the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}