{"url": "Dace_Golliard", "categories": ["Category:Legends articles", "Category:Crucible members", "Category:Galactic Republic defectors", "Category:Humans", "Category:Males", "Category:Republic Navy captains"], "nodes": [{"tag": "h1", "text": "Dace Golliard"}, {"tag": "p", "text": "Dace Golliard was a Human male who served the Galactic Republic as a naval officer during the Great Sith War. He later became a member of The Crucible slavery organization. Golliard was the Fleet Captain of the Gladiator."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Member of the Crucible"}, {"tag": "p", "text": "During the Great Sith War, the Human male Dace Golliard served as an officer in the Galactic Republic's Navy. When Sith forces under the Sith Lord Ulic Qel-Droma attacked the shipyards at the planet Foerost, Golliard fled the battle. Eventually, he was recaptured and was set to be court-martialed. However, Sith forces attacked the ship transporting Golliard, leaving him in the ship's brig. Members of The Crucible slavery organization enslaved the survivors of the Sith's attack on the ship, taking Golliard and the survivors to the Crucible's dueling pits. Golliard killed all of his former crew members in the dueling pits. He advanced in the Crucible's ranks, leading raids on various planets to find more slaves. Golliard eventually became the captain of the warship Gladiator."}, {"tag": "p", "text": "During Golliard's time with the Crucible, he dealt with Antos Wyrick, the professor of the New Generation Academy on Osadia. Wyrick bargained with Golliard and the Crucible for more Arkanian offshoot families for his biological experiments. At some point, Wyrick gave Golliard his daughter, Chantique, to enslave in exchange for a shipment of offshoot families. Golliard eventually led a raid against Wyrick's school and captured his students while the professor was away on a trip. He captured the female Arkanian offshoot Edessa, who had fled Wyrick's academy during the attack."}, {"tag": "h3", "text": "Reunion with \"Snow-Hair\""}, {"tag": "p", "text": "In 3963 BBY, Captain Golliard responded to a distress call from Sariyah Budan, leader of the Sungrazer cooperative, a client of the Crucible located in the Koornacht Cluster. Two beings, Zayne Carrick and Jarael had posed as Crucible agents in order to infiltrate the cooperative and free the slave miners that worked the comets. Golliard immediately recognized Jarael as a young child he had captured many years earlier. He ordered his skyreaper drones to attack the Hot Prospect, the mining ship that the slaves were being taken to. As Golliard ordered a boarding party to attack the ship, the Hot Prospect fired its mining drill into the bridge of the Gladiator, causing it to decompress. The warship suffered further damage when it was hit by mining explosives launched by Mandalorian renegade Rohlan Dyre. Golliard ordered the surviving sky reapers to attack the mining ship, but Carrick shut off the Hot Prospect's centrifuge, sending into a spin that tore it away and enabled it to jump to hyperspace. Golliard was severely punished by Chantique for his failure to apprehend Jarael and Carrick but his life was spared by Bar'injar who still required his knowledge."}, {"tag": "p", "text": "Golliard later found Carrick adrift in an Aurek-class fighter, under the alias of Carth Kamlin, a Republic officer escorting the Vindication. Golliard could tell that the fighter was salvage and discovered a homing beacon in it, immediately putting the Crucible on Carrick's plot."}, {"tag": "h3", "text": "Brought to Justice"}, {"tag": "p", "text": "After the Crucible fled from Volgax, Golliard went into hiding. Soon, however, Zayne Carrick realized that Golliard knew the location of Osadia, and became determined to track him down and retrieve the information so that he could save Jarael. Carrick called in his debt with Cassus Fett, who staged an attack in order to lure Admiral Saul Karath to a mining facility near the Ithor system. At the same time he released a signal out announcing his intent. Golliard swallowed the bait and moved the ship behind some asteroids in order to capture any survivors as slaves. The Mandalorians suddenly fled, and Zayne contacted Admiral Karath, informing him of Golliard's presence nearby. Since he still nursed a grudge against Golliard for causing his father's death, Karath was all too eager to help bring Golliard down. The Gladiator was disabled and brought aboard with a tractor beam. In a last ditch effort, Golliard used an escape pod to flee to the surface hoping to find a shuttle offworld. However, Carrick used the Skyreaper control panel aboard the Gladiator to release the drones; the drones then proceeded to capture Golliard and bring him to the Swiftsure. Golliard was brought before Admiral Karath, who taunted him before having Golliard taken away to be court-martialed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Golliard was very proud of his status as Fleet Captain; he expected his commands to be obeyed to the letter and frequently threatened his subordinates with death if they displeased him. This was at odds with his previous behavior in the Great Sith War, as he was court-martialed by the Republic Navy. Despite his arrogance, Golliard had no desire to ascend in rank since he preferred to see front line action. He was knowledgeable about naval combat and was quick to spot weaknesses in his enemies' tactics. Golliard was nevertheless tricked by the Hot Prospect's unorthodox tactics. He, however, accepted responsibility for his failures, even when faced with death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dace Golliard was created by John Jackson Miller, the writer of the Knights of the Old Republic comic series. He was drawn by Bong Dazo in The Reaping story arc. Golliard was also penciled by Brian Ching in the Destroyer story arc and the second and third issues of the Demon story arc. Miller has stated that Golliard was not a Fleet Captain when he was set for a court-martial by the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}