{"url": "Dadita", "categories": ["Category:Legends articles", "Category:Codes", "Category:Mandalorian culture"], "nodes": [{"tag": "h1", "text": "Dadita"}, {"tag": "p", "text": "Dadita was an ancient Mandalorian code, comprised of a series of long and short tones that together could be used to spell out words or numbers. Dadita could be transmitted and communicated in numerous ways, ranging from simply banging out the code on a piece of metal, to flashing a light source, and even transmitting the tones hidden in bursts of static. The use of dadita was often considered so low-tech as to be obsolete, and few outside of the Mandalorian culture knew that dadita even existed, let alone how to translate it."}, {"tag": "p", "text": "Several Mandalorian members of the Cuy'val Dar—the group of one hundred training sergeants responsible for instructing the clone commando forces of the Grand Army of the Republic—were fluent in dadita, and passed their knowledge of the ancient code on to their trainees. In the year 19 BBY, the former Cuy'val Dar sergeant and veteran Mandalorian soldier, Kal Skirata, was forced to go on the run while on the planet Coruscant, having been named a threat to the Galactic Republic by the office of Supreme Chancellor Palpatine. Skirata transmitted dadita code hidden in static across his helmet's comlink in order to covertly contact his clan. Several weeks after the fall of the Republic and the rise of the Galactic Empire in its place, Skirata's close friend Jaller Obrim, whom Skirata had instructed in the use of dadita, used the code to contact Skirata on Mandalore with information on his adopted sons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dadita first appeared in Star Wars canon in the Republic Commando novel Order 66, written by author Karen Traviss and published September 16, 2008. It was mentioned again in Order 66's sequel, Imperial Commando: 501st, published a year later on October 27, 2009."}, {"tag": "p", "text": "In the Mando'a dictionary posted on Karen Traviss' website, dadita is compared to the real-world Morse code, a similar, pre-existing code based upon long and short tones developed by Samuel Morse."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}