{"url": "Dafi_(criminal)", "categories": ["Category:Legends articles", "Category:Females", "Category:Individuals of unidentified species", "Category:Lemo and Sanda's gang members", "Category:Near-Humans"], "nodes": [{"tag": "h1", "text": "Dafi  (criminal)"}, {"tag": "p", "text": "Dafi was a female member of a green-skinned near-Human species and a member of Lemo and Sanda's gang."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "in 3 ABY, she was present at the gang's base during the arrival of \"Captain Drebble\", Lando Calrissian in disguise. Dafi was generally in awe of the man, especially when he killed Koruu with a combat knife. Dafi joined the group when they brought \"Drebble\" to dinner at an Arcan IV restaurant and helped the group get the man drunk on Deltron spice wine in order to make him spill his plans to find the valuable artifacts, the Dancing Goddess and the Minstrel. After Calrissian accidentally revealed his true identity, the gang pulled their weapons on the \"captain\". However, he was saved by Chewbacca, who came to his rescue by swinging a bench seat at the pirates. As the two Rebel heroes fled back to the Arcan IV Spaceport in a hover car, the pirates pursued in their own vehicles."}, {"tag": "p", "text": "Eventually, Calrissian and Chewbacca were their own worst enemies as they inadvertently crashed their ships into one another. Although thrown free from the wreckage, they landed at the feet of Dafi, who recognized them and prepared to kill the pair. However, before she could, she witnessed a small box that had fallen from Calrissian's pocket. Inside the box was the Minstrel. Dafi became immediately obsessed with the artifact, certain that it would lead her to the other statue, the Dancing Goddess. Having become incredibly possessive of the artifact, when her comrades arrived, she began to fire on them, believing that they were there to steal the Minstrel from her. During the ensuing shootout, Calrissian and Chewbacca managed to escape."}, {"tag": "h2", "text": "Appearances"}]}