{"url": "Dagger-class_starfighter", "categories": ["Category:Legends articles", "Category:Republic Sienar Systems products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Dagger-class starfighter"}, {"tag": "p", "text": "The Dagger-class starfighter was a fighter craft designed by Republic Sienar Systems in the last century of the Republic and produced in large numbers around the time of the Battle of Naboo."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Dagger starfighter had a triple wing design. The wings were pointed and knife-like in appearance, During flight, the whole craft would rotate around the cockpit. The Dagger was armed with three laser cannons which were located on the hull, next to where the wings connected."}, {"tag": "p", "text": "The fighter was small, fast, maneuverable, had powerful weaponry, and was relatively cheap and easy to obtain. However, it lacked a life support system, or inertial dampeners, this dramatically increased the risk of the pilot suffering the effect of extreme G-Forces when quickly accelerating or turning. As such a Pilot had to rely on his own skill (and in no small part the quality of his space suit) in order to survive a battle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The fighters were produced by the thousands over the decades prior to the Clone Wars. The majority were purchased by planetary defense forces, while many others seemingly found their way into the hands of mercenary organizations. Daggers were also used in an assault on a Naboo freighter convoy above Naboo. In 32 BBY, Rhys Dallows and Vana Sage were forced to contend with these craft during their attempts to protect Naboo; the Trade Federation had recruited a mercenary organization whose jobs involved such things as an attempted kidnapping of Queen Amidala. Daggers made up the first three waves of the mercenary assault force during the kidnapping attempt."}, {"tag": "p", "text": "With the advent of the Clone Wars, numerous Daggers were also found in the planetary fleets of Separatist worlds. The production of the Dagger stopped with the rise of the Galactic Empire and Palpatine's disbanding of Republic Sienar. The successor company, Sienar Fleet Systems, borrowed a number of elements from the Dagger in their initial design of the TIE Series. The design was later used for as the basis for the V38 assault fighter and the TIE/ph phantom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dagger Starfighters first appeared in the 2001 video game Star Wars: Starfighter. Daggers also appeared in the game's 2002 sequel, Star Wars: Jedi Starfighter. In this game, they only appear in the bonus missions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}