{"url": "Dagobah/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with conflicting sources", "Category:Confederacy of Independent Systems planets", "Category:Dagobah locations", "Category:Dagobah system planets", "Category:New Republic planets", "Category:Swamp planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Dagobah"}, {"tag": "p", "text": "Dagobah (/'deɪgəbə/; pronunciation (help·info)) was an Outer Rim planet in the Dagobah system. A remote world of swamps and forests, it served as a refuge for Jedi Grand Master Yoda during his exile after the events of Order 66 had taken place."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Dagobah was located in the Sluis sector of the Outer Rim Territories. Despite the fact that it was located near the Rimma Trade Route, it was reachable only by obscure hyperlanes."}, {"tag": "p", "text": "Dagobah was a harsh, humid, swampy planet, mostly covered in shallow marshland, interspersed with stifling forests and at least one cave. There were very few truly open bodies of water on the planet: the water supply was thinly invested throughout the planet's main habitat, swampland, although there were vast expanses of mud fields. Dagobah was home to many creatures, such as bogwings, dragonsnakes, nudj, sleens, vine snakes, and swamp slugs. Examples of flora included the Adder moss, the hassling, Gnarltree and Meat flower. The planet was devoid of any technology advanced civilization, although the reclusive, pre-industrial Hepsalum Tash did call it home."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Surveys"}, {"tag": "p", "text": "Hundreds of years before the Clone Wars, the Jedi Minch battled and killed a powerful Bpfasshi Dark Jedi on the planet. The Dark Jedi's energies absorbed into its surroundings, tainting the cave where he was slain with the dark side."}, {"tag": "p", "text": "The planet seldom appeared in astrography charts and it was discovered and re-scouted several times. The first official Republic survey of Dagobah occurred in 39 BBY. A team of Alderaanian explorers were stranded there but were devoured by wildlife, while a pre-Clone Wars expedition was forced to resort to cannibalism."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In early 22 BBY, a Republic research team under Halka Four-Den was stationed on Dagobah to research the native flora and fauna. From even the initial assessment, the team concluded that Dagobah was crawling with an incredible diversity of life, and made notes to recommend Dagobah for more extensive surveys, given the likely advances in genetics and medicine that even a few of its lifeforms would cause. Unfortunately, Halka Four-Den and her research team died on Dagobah before they could be retrieved. Likely due to the outbreak of the Clone Wars, their distress signals were ignored until it was too late. The few survivors were forced to raise their children as cannibals.\nAt the outbreak of the war, Jedi Master Yoda discovered thirty-eight worlds deleted from the Jedi Archives, Dagobah was one of them."}, {"tag": "p", "text": "During the war, Dagobah was located within Separatist-controlled space."}, {"tag": "p", "text": "In a late stage of the war, and under the guidance of the spirit of Qui-Gon Jinn, Yoda briefly traveled to Dagobah seeking answers to explain mysterious \"voices\" only he could hear. There, he was given the spiritual task of finding out how to become one with the Force and achieve true immortality. Yoda noted how strong the planet was with the Force, and learned from Qui-Gon's Force-spirit that it was one of the purest places in the Galaxy. This formed the basis for why Yoda eventually chose to endure his time in Exile there. During this short visit, Yoda entered the tainted cave and experienced a powerful vision showing him the extent of the Sith's tightening hold on the galaxy, the impending destruction of the Jedi Order, and the confirmed existence of Darth Sidious."}, {"tag": "h3", "text": "Yoda's exile"}, {"tag": "p", "text": "In 19 BBY, at the beginning of the Great Jedi Purge, Yoda entered into exile in the swamps of Dagobah via an Escape pod from Polis Massa, after facing Darth Sidious. Having experienced visions of the impending destruction of the Jedi Order during his first visit to Dagobah, Yoda had decided long before that if this clouded future should become a reality he would return there. By choosing a world that \"didn't exist\" and living on a planet writhing with the Living Force, Yoda remained completely undetectable. He made his dwelling near the Cave of Evil, which further negated his light side presence."}, {"tag": "p", "text": "At some point, Yoda encountered the clone of Galen Marek, who like Marek took on the name Starkiller, when the clone went to Dagobah to find himself. He allowed Starkiller inside the Dark Cave, telling him that he was simply a watcher."}, {"tag": "p", "text": "Tash Arranda and Zak Arranda met Yoda on the planet, but he chose not to train them in the Jedi ways at that time, explaining to them he was awaiting a different student. Afterwards, the Arrandas assisted in the rescue of the descendants of the survey team dispatched in 22 BBY, thus ridding Dagobah of the closest thing to an \"advanced civilization\" it had probably ever boasted. They were likely rehabilitated by the Alliance to Restore the Republic."}, {"tag": "p", "text": "Despite it being a remote planet, it as well as the system it belonged to nonetheless was included as a destination in the Intergalactic Passport, with it being specifically recommended that any space travelers who stop at Dagobah must carry all-purpose antihistamine tablets and topical ointments at all times during visits there in order to lessen the effects of various insect bites that likely occur there."}, {"tag": "h4", "text": "The next Skywalker"}, {"tag": "p", "text": "In 3 ABY, during the Galactic Civil War, Luke Skywalker was visited on the ice planet Hoth by the ghost of Obi-Wan Kenobi, who instructed him to seek Yoda on Dagobah in order that he might be trained in the ways of the Jedi. Skywalker traveled to Dagobah in his T-65 X-wing, along with R2-D2, after the end of the Battle of Hoth. Due to a bumpy landing, Luke's X-wing ended up being half-buried in the swamp, and a grumpy and irritable Luke met a strange creature that turned out to be Yoda. During his grueling training, Luke learned control and power in the Force."}, {"tag": "p", "text": "Many of the teaching methods he learned here were later applied at his Jedi Praxeum on Yavin 4. On Dagobah, Luke confronted a Droid Bounty hunter named Milko, whose mission was to kill Luke. Luke defeated the droid in armed battle. Luke had a feeling that the encounter was a test arranged by Yoda but had no idea whether he had passed or failed. Luke later entered the cave where the Dark Jedi had been defeated to test himself and experienced a vision where he fought a version of Darth Vader with Luke's face underneath his mask, hinting at both Vader's identity as his father and his own later involvement with the dark side. Later in his training, Skywalker had a vision of his friends Han Solo, Leia Organa, and Chewbacca suffering on Bespin. As a result, he left his training early, promising Yoda that he would return to complete it."}, {"tag": "p", "text": "He did return in 4 ABY, but only in time to have one final conversation with Yoda before his teacher's death. Afterward, he spoke extensively with Obi-Wan Kenobi about the conflicting stories of Luke's parentage."}, {"tag": "h3", "text": "Jedi involvement"}, {"tag": "p", "text": "The New Republic established a base on Mount Yoda in 5 ABY."}, {"tag": "p", "text": "Luke Skywalker would return to Dagobah in 9 ABY, this time seeing a vision of the past in the cave and finding the Dark Jedi's beckon call. He would return again in 12 ABY with his then-love Callista Ming, trying to re-establish her connection to the Force. In 14 ABY, the dark side power of the cave there was siphoned by the Disciples of Ragnos. This supposedly removed all of the dark energy, but it presumably returned to its source when the Scepter of Ragnos was destroyed or otherwise somehow regenerated itself."}, {"tag": "p", "text": "In 22 ABY, Anakin Solo along with Ikrit, Tahiri Veila, Uldir Lochett, Peckhum and R2-D2 returned to Dagobah because Anakin had been troubled by visions of himself as a Dark Jedi; this was due to his heritage as the grandson of Anakin Skywalker, who had become the infamous Darth Vader. After surviving encounters with the planet's dangerous fauna, Anakin and his companions finally reached the same cave to which Luke had gone years before. There, Anakin faced the manifestations of his own doubts, but emerged victorious."}, {"tag": "p", "text": "Towards the end of the Yuuzhan Vong War, Tahiri Veila traveled to Dagobah to undertake a similar test to Anakin Solo's, but instead fell in with a Yuuzhan Vong Shamed One, who believed the planet was sacred to the Jedi. Vowing to carry his message back to Yu'shaa, she left Dagobah for Mon Calamari, not venturing into the cave."}, {"tag": "p", "text": "In 36 ABY, Grand Master Luke Skywalker sent Jedi Knights Tahiri, Lowbacca and Tesar Sebatyne to Dagobah to meditate in exile. They had been deemed a threat to Jedi security due to the three Joiners passing Jedi information to Aryn Dro Thul during the Swarm War. Luke told them that he would call them once he felt they were ready to rejoin the order, and that they were not to leave until they felt that call."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Slated to appear in one scene in Revenge of the Sith, the planet was cut from the final film, leaving it for the DVD release."}, {"tag": "p", "text": "Heir to the Empire describes how Yoda returned to Dagobah in pursuit of a Dark Jedi from Bpfassh and killed him on the planet. In Star Wars Insider 98 Leland Chee writes that this is no longer considered part of continuity because Yoda had never been on Dagobah before his exile. It has been suggested the battle occurred shortly after the exile; however, such a theory was never confirmed. The concept of Yoda having never been on Dagobah prior to his exile was, in turn, later contradicted directly by \"Voices,\" an installment of the CGI animated series Star Wars: The Clone Wars, which revealed that Yoda had, in fact, been to Dagobah, having been summoned there by the spirit of Qui-Gon Jinn to learn about the path to immortality."}, {"tag": "p", "text": "A planet map displayed at the original Star Tours attraction in Disneyland Paris and Tokyo Disneyland erroneously places the planet within the Tion Hegemony."}, {"tag": "p", "text": "A segment of Wizards.com's Planet Hoppers feature was planned for Dagobah, but it was never released."}, {"tag": "p", "text": "The Dagobah set was built at Elstree Studios. Because of the demand for such a huge set, a new soundstage was built. \"Stage 6\" which later was renamed \"The George Lucas Stage\". For the interior scenes, real dirt and water was shipped into the studio, and after days of shooting was miserably foul smelling and humid. The stage was 3 feet above ground to accommodate the puppetry scenes for Yoda."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "LEGO Star Wars: The Yoda Chronicles"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}