{"url": "Dahlia_Damask", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Kashyyyk residents"], "nodes": [{"tag": "h1", "text": "Dahlia Damask"}, {"tag": "p", "text": "Dahlia Damask, or Lady Dahlia Damask as her subjects referred to her, was the leader of the Outcasts of Kkowir Forest on Kashyyyk. She and her people were enemies with Kerritamba Village within the forest."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 1 ABY, she instructed a spacer who had joined her people's ranks after being exiled from Kerritamba Village for murdering one of their champions, Wirartu, to wage war on the village. She first tasked them to kill as many of the village's warriors as possible, who were stationed outside Kerritamba Village, in order to thin their numbers. After their numbers had been sufficiently decimated, she ordered the spacer to assassinate the village's warchief, Naloriss. After doing so, her final task for them was to stage a battle of distraction outside the village while one of her assassins infiltrated the village and killed Chief Kerritamba. The distraction was a success and Kerritamba lay dead in the village. The spacer returned to the Outcast's cave dwelling within the forest and was praised as a hero. Dahlia rewarded the spacer with a LD-1 target blaster rifle and named them an Exemplar of Outcast society."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dahlia Damask appears as a non-playable character in Star Wars Galaxies: An Empire Divided. She was added in the expansion pack Rage of the Wookiees in 2005. It is possible for the player to not murder Wirartu during their duel, defeating him honorably in combat. This course of events leads the player to continue working with the inhabitants of the village, eventually battling against the Outcasts. Until an official source claims otherwise, both series of events are believed to have happened."}, {"tag": "h2", "text": "Appearances"}]}