{"url": "Daiman", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Sith Lords of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Daiman"}, {"tag": "p", "text": "Daiman, along with his older brother and major rival Odion, was a male Human who was one of the most powerful Sith Lords during the Republic Dark Age and ruled an area in the Grumani sector known as the \"Daimanate\", one of the rump states which emerged from the collapse of the Chagras Hegemony in 1040 BBY. He was the son of Xelian, a female Sith Lord who was connected to Chagras, the titular ruler of the Hegemony. His mother Xelian openly favored him over his older brother, Odion, breeding an intense sibling rivalry between the two brothers who hated and sought to defeat each other. Daiman's pampered and privileged upbringing imbued him with delusions of grandeur that he was the \"Creator of the Universe.\" In this manichean worldview, his brutish older brother Odion was the enemy and Destroyer, who had to be overcome in order for Daiman to advance."}, {"tag": "p", "text": "By 1032 BBY, Daiman had become the ruler of his own princedom known as the Daimanate. He started baradium mining operations on the planet Chelloa which attracted the attention of the Jedi Order, particularly Jedi Master Vannar Treece. Baradium was a volatile compound used in the production of munitions. The Jedi launched Operation Influx in an attempt to disrupt the transportation of baradium to the frontline. The Jedi mission ended disastrously due to a raid on Chelloa by Odion, who had also intercepted intelligence on the baradium leaks. The sole Jedi survivor was novice Jedi Knight Kerra Holt, who bore much ill will towards the Sith in general for the destruction of her childhood on Aquilaris Minor."}, {"tag": "p", "text": "Kerra attempted to assassinate Daiman but he was able to redirect her attentions towards Odion, using her to mislead Odion with false intelligence about expanding his baradium mining operations on Chelloa. Odion changed his plans of wanting to destroy Chelloa and launched a planetary invasion. These factors worked into Daiman's schemes of trapping Odion on Chelloa and using kinetic corruptors to ignite the planet's surface. While Daiman succeeded in destroying a large part of Odion's army, he failed to kill either Odion or Kerra, who had managed to evacuate much of the population on a makeshift fleet of transports known as the Freedom Fleet. Kerra would continue to frustrate Daiman's \"omnipotence\" by launching lightning strikes on his domain, freeing slaves and beheading his statues as a trademark signature."}, {"tag": "p", "text": "Following the destruction of his Black Fang research facility on his capital Darkknell, Daiman sought to lay another trap for Odion on Gazzari by using the captured Bothan spy Narsk Ka'hane to send his older brother information about a deal with the Quermian Sith Lord Ayanos Bactra involving the sale of an arxeum—a mobile war university. Daiman planned to lure Odion's ground forces onto the volcanic planet where they would be bombarded by his artillery cannons. However, their grandmother and family matriarch Vilia Calimondra intervened and convinced the two brothers to put aside their difference and attack Lord Bactra, since he had outlived his usefulness to the Calimondra family. Following the collapse of the Bactranate, Daiman and Odion were both present during the family Bequest. Tensions between the two brothers flared after Daiman was bequeathed the company Industrial Heuristics, leaving Odion with the Bactranate capital of Jutrand. While Vilia was able to appease Odion by giving him two of her own legions of Trandoshan slave warriors, tensions between the two brothers simmered below the surface."}, {"tag": "p", "text": "Daiman faced a third challenge to his rule in the form of the Hutt crimelord Zodoh, who had ambitions of carving up his own interstellar empire in Sith Space. Zodoh was able to exploit Sith rivalries by persuading the other Sith Lords to harry Daiman's forces while Zodoh himself assailed Daiman's worlds. Odion personally took advantage of his younger brother's misfortunes by keeping Daiman's forces spread thin across the borders while Zodoh assailed the Daimanate. Daiman also lost control of Aquilaris Minor to Kerra and the Republic's Grace Command, a special paramilitary relief agency that was covertly distributing the narcotic Deluge within Sith territory as a means of undermining the Republic's enemies. Daiman was nearly brought to the brink of defeat at Zodoh's hands during the Battle of Darkknell when the Hutt's fleet of Stormdrivers flooded his capital of Xakrea. He was only saved from a watery death by the efforts of his nominal enemy Kerra, who destroyed Zodoh's flagship and scattered his invasion fleet. A victorious Daiman would personally execute Zodoh, ending any Hutt ambitions of assailing his territory."}, {"tag": "p", "text": "Angered by Odion's collaboration with an outsider who had threatened his domain, Daiman established contact with Kerra and helped her infiltrate the Odionate, with the objective of defeating Odion. Despite their mutual animosity, both shared a common enemy in the form of Odion. Daiman himself experienced visions of an apocalyptic tribulation emerging in Odion's domain. However, Odion was merely seeking to overthrow Daiman and establish himself as the ruler of the Grumani sector. Thus, he sought to harness the dark side powers of the Helm of Ieldis, an ancient Sith relic capable of driving sentient beings into a mindless killing frenzy. Ultimately, Odion would be defeated through the efforts of Kerra and Odion's second-in-command General Beld Yulan, which ended in the death of Odion and the destruction of the Helm. Taking an advantage of Odion's death, Daiman and the other Sith Lords invaded and carved up the former Odionate; with Daiman gaining the largest share of territory."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Daiman was the younger son of the Sith Xelian, and the nephew of the Sith Lord Chagras. Throughout his childhood, his mother Xelian openly favored him over his older brother, Odion, whom she regarded as ugly and repulsive. This dysfunctional upbringing led to intense hatred and rivalry between the two brothers, who constantly sought to outmaneuver and frustrate each other. Odion alleged that he constantly suffered excruciating headaches throughout his life from the moment that Daiman was born. While Xelian constantly mistreated and ignored Odion, she spoiled and pampered her younger son Daiman, which caused him to develop a grandiose worldview of himself as the \"Creator of the Universe\" with the power of life and death over other sentient beings. In contrast, Odion's despair and torment led him to establish a nihilistic death cult centered around himself which glorified death as a means of ending the pain of existence."}, {"tag": "p", "text": "The hostility between the two brothers led Daiman to regard Odion as the \"Destroyer\" and his manichean rival. The sibling rivalry between Daiman and Odion was further aggravated by their grandmother Vilia Calimondra, a Sith Lord who ruled extensive territories within the Chagras Hegemony. She promised to bequeath her empire to the heir that conquered the most territory. During the Republic Dark Age, the weakened Galactic Republic had abandoned much of the outlying territories to the various Sith Lords and retreated to a safety cordon behind the Colonies. This left much of the galaxy in anarchy with rival Sith dynasties battling for supremacy. Xelian's actions led to a series of feudal conflicts between her descendants known as the Charge Matrica. In 1040 BBY, Chagras himself died and the Hegemony collapsed into several competing fiefdoms."}, {"tag": "p", "text": "Daiman and Odion were commanders within Chagras' military forces and each commanded substantial manpower and resources. Daiman became the ruler of his own princedom known as the Daimanate, which encompassed a substantial area of the Grumani sector. Daiman made the planet Darkknell the capital of his domain, establishing himself in the administrative capital of Xakrea where he built a fortress palace known as the Sanctum Celestial, which was built at a heavy expense of resources and labor. There, he was known as \"Lord Daiman, creator of all\" and established a cult of personality to enforce his particular view of the universe. He gained notoriety for dressing up guards in his service in gilded armor and burgundy skirts, known as the Correctors."}, {"tag": "p", "text": "Daiman also ran a research facility in Xakrea known as the Black Fang, officially the \"Daimanate Dynamic Testing Facility\". There he developed new war technology to combat Odion in their never-ending attempts to one-up one another in rival combat."}, {"tag": "h3", "text": "Chelloa"}, {"tag": "h4", "text": "Operation: Influx"}, {"tag": "p", "text": "At some point, he established a mining operation on the planet Chelloa, exploiting countless slaves and local inhabitants as he strip-mined the planet of its valuable ores of baradium. His mining operations attracted the attention of both the Jedi Master Vannar Treece and Odion. While his people toiled in atrocious poverty, Daiman lived a luxurious lifestyle in seclusion at an alpine compound above Jenith. However while Treece planned to disrupt the shipping operations and liberate the slaves, Odion desired to exploit Chelloa's baradium ores to fuel his war forge The Spike. The Jedi were assisted by Gorlan Palladane, a field agent who worked as the leader of Daiman's slave workers. Despite initial successes in infiltrating the transport hub at Oranessan during the initial phase of Operation Influx, the entire Jedi team with the exception of the female Jedi Knight Kerra Holt was wiped out during a raid by Odion's forces on Jenith Spaceport. During the assault, Odion's kinetic corruptor caused widespread devastation and killed many slaves and Correctors alike."}, {"tag": "p", "text": "While the survivors began attending to the wounded, Lord Daiman arrived on a repulsorcraft. Despite the enormous loss of lives and wounded particularly burn victims, Daiman was apathetic and demanded to see Palladane. Palladane pleaded for help in treating the wounded but Daiman was more concerned with discerning how his rival Odion and the Jedi discovered his secret baradium mining operations. When Palladane expressed his ignorance of the matter, Daiman used Force choke to strangle the former. However, Kerra intervened and tried to force Daiman to stop tormenting Palladane at gunpoint. Amused by her courage and dismissing her as an orphan, Daiman relinquished his grip on Palladane and fondled with her, making obscene gestures. He mockingly told her to embrace her anger as a diversion and released her since he was preoccupied with the threat of Odion to his goals."}, {"tag": "h4", "text": "The Hidden Jedi"}, {"tag": "p", "text": "Showing little concern for the well-being of his subjects, Daiman ordered them to erect up one of his statues in the village square before dismissing the crowd. Later at his alpine compound above Jenith, he tortured the Rodian worker Skodo with Force lightning in an attempt to force him to confess to contacting Odion. Earlier, Skodo had been found with a transmitter which he and Palladane had used to contact Odion with information about Daiman's baradium operations. His troopers replaced Skodo's transmitter with one of Daiman's and left it at Skodo's house, waiting for any accomplices."}, {"tag": "p", "text": "However, Daiman's torture session was interrupted by the arrival of Holt who dueled him. She trapped Daiman in a suspension field before engaging in an argument with the temporarily incapacitated Sith Lord. When she attacked his maltreatment of his slaves, Daiman countered by reiterating his personal Sith philosophy with himself being the only true living being and everything else being an illusion. To distract Holt, he then revealed that his brother Odion was preparing a second attack and that Odion had a mobile space station known as The Spike which was capable of producing various arsenal particularly kinetic corruptors. One kinetic corruptor was capable of igniting the entire planet of Chelloa due to the vast baradium deposits. Daiman managed to break away but Holt had escaped, hijacking one of Daiman's starfighters deployed to attack The Spike."}, {"tag": "p", "text": "However, this all fell according to Daiman's plans of eliminating both Odion and the Jedi. To bait Odion, he would launch a feign attack on The Spike. Holt would used her Jedi prowess to infiltrate The Spike and then reveal intelligence about Daiman's ten mobile munitions complexes. Odion would take the bait and land an invasion force at the site of the complexes. In reality, the munitions factories were actually disguised world-destroying Kinetic corruptors which would destroy both Odion and Chelloa's surface. Meanwhile, Daiman and the bulk of his army would be evacuated onto troopships, leaving the doomed world and its sentients to their fate."}, {"tag": "p", "text": "The attack on The Spike failed due to its escort fleet of Odionate gunships including Odion's flagship Sword of Ieldis. Kerra infiltrated the space station, dueling Odion and causing extensive damage to the interior by decompression. She hijacked a shuttle and prepared to ram Odion's gunship. Meanwhile, Palladane chanced upon Skodo's house and found Daiman's transmitter in his hiding place. Unaware that Daiman had tampered with the real transmitter, Palladane contacted Odion and attempted to get him to leave Chelloa by claiming there were no more baradium mines. However, Odion dismissed this as a conspiracy by Daiman or another foe. Palladane was quickly apprehended by Daiman's troops and taken to his alpine compound where he was beaten by Daiman's henchmen in his dungeon."}, {"tag": "p", "text": "Believing Palladane to be in the service of Odion, he broadcast the torture live to Odion in an attempt to provoke his estranged brother. In retaliation for sheltering the Jedi, Daiman ordered a full military crackdown on Jenith and other Chelloan towns. He had Palladane suspended by chains over a heap of burning coals while berating his bleeding captive for \"collaborating\" with his enemy Odion. When Daiman threatened to take his life back, Palladane begged for mercy. Daiman also delved into his narcissistic philosophy of himself being the Creator of the universe. After interrogating Palladane about the Jedi infiltrator Kerra, he spared and released Palladane on the grounds that Palladane had unwittingly played into his greater plans to defeat Odion. Out of mercy, he agreed to limit his destruction to Jenith but threatened to destroy all of Chelloa's population if a second Jedi was revealed. He then had Palladnae confined in a cell, presumably left to die of his wounds."}, {"tag": "p", "text": "He also summoned the other Chelloan village leaders for an audience with him. Since they had trouble finding all the village leaders, the mission took a long time and Daiman went on an inspection tour of his compound to stave boredom. However, Holt again infiltrated his compound using the shuttle and killed several of the guards before freeing the prisoners including Palladane. Before safely evacuating to a safehouse in Arboth, Holt beheaded several of Daiman's prized statues using her lightsaber. When an unsuspecting Daiman returned, he discovered what Holt had done. Seeing the damage, he ordered that his new statues be coated in cortosis plating. Aware of Odion's intentions to invade Chelloa and seize his munitions plants, he ordered his troops to be ready for combat."}, {"tag": "h4", "text": "Brothers at War"}, {"tag": "p", "text": "The next day, Odion landed his elite Lightning Guard and ground vehicles on Chelloa near the town of Arboth which was the site of ten pyramidal mobile munitions complexes. Based on false intelligence supplied indirectly by Odion through Holt, Odion cancelled his original nihilistic goal of destroying Chelloa since its high baradium deposits caused an imbalance in force. Odion now intended to seize the pyramid complexes and requisition them for his own war effort. Daiman deployed a disposable contingent of his own troops and vehicles to provide some token resistance. Daiman and his commanders surveyed the battlefield from a high mountain above Arboth. After Odion's forces overwhelmed Daiman's troops and converged on the perimeter of the pyramid complexes, Daiman ordered the \"factory carrier units\" to deploy."}, {"tag": "p", "text": "Within minutes, all ten pyramids had shed their metal exteriors to reveal ten of Daiman's own kinetic corruptors. These had been transported to Chelloa disguised as mobile factories. The corruptors ignited the underground baradium veins beneath the surface, releasing streams of molten lava which engulfed Odion's invading army. Satisfied at his attempt to eliminate his estranged brother, Daiman ordered his commander to prepare his shuttle and the decoy transports parked across Chelloa to depart. However, he was unaware that Holt, Palladane and the Chelloan resistance had organized a mass evacuation of Chelloa's 60,000 sentient inhabitants, dispersed across ten mining towns. They overpowered the crew and took control of the ships, creating the Freedom Fleet. When Daiman's command failed to establish contact with the crew, he seized a telescope and quickly discovered what the two Jedi had done. He caught a glimpse of a freed Palladane fighting off the remnants of Odion's invasion force."}, {"tag": "p", "text": "Daiman was infuriated when the Freedom Fleet departed Chelloa into hyperspace. His forces were unable to shoot them down since his defense fleet had been called away to allow Odion to land his forces. His commander informed Daiman that he had to leave aboard his shuttle before the mountain collapsed from the volcanic activity. An infuriated Daiman tried to affirm his belief in being the Creator of the Universe by saying that his mountain would do as he wanted. His more realistic and skeptical subordinate then counteracted that the mountain was not listening. Daiman manage to evacuate his forces from Chelloa prior to its apocalyptic destruction and then went to Nilash III, a planet within Daimanate space. There, he discovered from Uleeta that the Freedom Fleet had recently passed by and raided the munition plant. Kerra and her followers liberated the slaves and stole a high-powered laser to disrupt Daiman's war effort. This laser was used for cutting cortosis during the manufacturing process. Daiman instructed Uleeta to keep news of Holt's raid a secret and instead propagated the myth of her demise on Chelloa. However, Holt left her trademark message for Daiman: beheading his prized statues, which he took as a message that she was a real existing sentient rather than an illusion."}, {"tag": "h3", "text": "Knight Errant"}, {"tag": "h4", "text": "The Bothan Spy"}, {"tag": "p", "text": "Around 1032 BBY, Daiman had entered into a deal with the Quermian Sith Lord Ayanos Bactra, the ruler of the Bactranate who was regarded as an outsider within the Calimondra family clan. As part of this agreement, Daiman granted permission for agents of Bactra's company, Industrial Heuristics to carry out recruitment operations within Daiman's territories."}, {"tag": "p", "text": "In that same year, two of his enemies— the Odionate Bothan spy Narsk Ka'hane and Jedi Knight Kerra, infiltrated the Daimanite testing center on his capital world of Darkknell. This research facility was used to conduct military research on Daiman's protracted warfare against his Sith rivals including Odion. Narsk succeeded in leaking intelligence on the Convergence , a prototype Convergence Tactical Assault Vehicle developed by the Daimanate. Both of these individuals also planned to destroy the testing facility to sabotage Daiman's war effort. During one night mission, Kerra succeeded in overpowering Narsk and stole his Cyricept Personal Concealment System, Mark VI stealth suit, dumping him in a rubbish bin where he would subsequently be discovered by Daiman's forces. Kerra then destroyed the facility with a baradium thermal charger."}, {"tag": "p", "text": "Following the bomb blast, Daiman's Correctors combed the area, rounding up suspects for questioning including Narsk himself who was brought to the sentry station on Administrative Way. Most of these suspects were homeless vagrants who lived on the streets of Xakrea. During interrogation, Narsk tried to maintain his cover identity that he was a machine operator who had been robbed. However, Daiman's Correctors were able to sense through the Force that he was concealing something in his mind. Daiman himself interrogated Narsk and through mind-reading found out that Kerra was on Darkknell. Under pressure from Daiman's mental prodding, Narsk broke down and confessed that he had been near the Black Fang facility, but refused to divulge who he was working for."}, {"tag": "p", "text": "After several days of interrogating and torturing Narsk, Daiman had the Bothan suspended at the top of a large public arena in a circular metal frame within the Sanctum Celestial. During this session, Daiman and his entourage including his female Woostoid aide Uleeta were seated on a suspended platform at the center of the arena. When Narsk made a snide thought criticizing Daiman's narcissism, Daiman sensed Narsk's thoughts and retaliated by unleashing Force lightning on the Bothan, enough to torment but not to kill him. Daiman then taunted Narsk by telling the Bothan that if he and Kerra had intended to hurt him, they had failed to change his course. Daiman then remarked that the Bothan and the Jedi woman had given him exactly what he had wanted."}, {"tag": "h4", "text": "The Gazzari Trap"}, {"tag": "p", "text": "Rightfully suspecting that Odion had a role in the Black Fang bombing, Daiman concocted an elaborate scheme to lure Odion into a trap on Gazzari. Firstly, he contacted Bactra on a priority communications channel via a holographic projector. During this meeting, Daiman explained to the Quermian the details of the attack, and displayed the captive spy Narsk. In response, Bactra claimed to have no prior knowledge of the strike, or any recognition of the Bothan spy who had been partially responsible for the loss of the research facility. Since the destruction of the testing center had temporarily weakened the Daimanite war effort, Daiman requested that Bactra supply him with an arxeum, a mobile university devoted to the development of war sciences."}, {"tag": "p", "text": "In exchange, Daiman offered to provide students from throughout the Daimanate for the arxeum. Daiman suggested that the deal be conducted on the planet Gazzari, a remote volcanic world that was located near the border with the Odionate. After some discussion, Bactra agreed to all the terms of the deal in return for his forces being granted safe passage across Daimanite space to the planet Vellas Pavo. Vellas Pavo was the site of mines extracting the superconductor Gadolinium, which were competing with Bactra's own superconductor interests. Daiman's aide Uleeta suspected that Bactra planned to destroy the Vellas Pavo facilities."}, {"tag": "p", "text": "Secondly, Daiman contacted several independent mercenaries and convinced them to set up an ambush on Gazzari. These mercenaries would provide fire support for Daiman by attacking the enemy while his forces emerged from hyperspace to trap Odion's forces. Some of those mercenary leaders he contracted included the Human Jarrow Rusher, the Togorian Kr'saang, and the Toong Mak Medagazy. As part of the plan, the mercenary battalions would depart Darkknell at sunset, each making hyperspace jumps to different destinations. In four standard days, they would reassemble on Gazzari."}, {"tag": "p", "text": "Since Gazzari was a volcanic world shrouded in metallic ash, Daiman regarded it as a perfect site for an ambush. As part of the battle plan, the mercenaries would assemble their forces including several large artillery cannons around a massive caldera. Prior to the battle, Bactra's arxeum and the student transports would land within the caldera. Odion's forces would then invade Gazzari and the mercenaries would hold them at bay until Daiman's regular forces and attack fleet emerged from hyperspace. Daiman then planned to trap Odion's forces on Gazzari and kill his estranged older brother once and for all. Daiman's battle plan was controversial among the mercenaries but he was able to use his authority and Force abilities to coerce them into submission."}, {"tag": "p", "text": "The Togorian Kr'saang criticized the deceptive nature of the Gazzari operation and demanded that his forces only be deployed in a \"straight-up\" attack. Angered by the Togorian's recalcitrance, Daiman killed the Togorian with his lightsaber, quartering him into four smoking pieces. Daiman then ordered his Uleeta, to send Correctors to induct Kr'saang's shock troopers—the Specialist Unit Two Hundred Seven— and their troopship Dar'oosh into his slave army. For the remainder of the meeting, Daiman further explained his intentions to use the arxeum and the younglings as bait to lure Odion to Gazzari."}, {"tag": "p", "text": "When Rusher expressed ethical concerns about using younglings as part of his bait, Daiman used the Force to levitate and choke the Brigadier. Rusher managed to save his life by claiming that he was just trying to serve his Creator's will. After Daiman released his Force grasp, Rusher managed to convince Daiman that he was an 'autonomous force' who was still carrying out Daiman's will albeit in a unique way. Rusher also explained that only 'autonomous forces' like himself understood the complexities of operating an artillery brigade; also adding that the complexities of Daiman's galaxy meant that it was difficult for lesser beings to cope. Satisfied with Rusher's explanation that each of his creations had a specific function, Daiman agreed to provide the mercenaries with payments of ordnance and fuel before dismissing them."}, {"tag": "p", "text": "Following the meeting, Daiman had Narsk brought back to his prison where he arranged for the Bothan to escape with the help of Kerra, counting on the fact that the spy would report his plans to Odion. With the help of Holt, who sneaked into the Sanctum with Narsk's Mark VI, the Bothan escaped into the junkyard and made his way to a spaceport where he found passage offworld to a neutral world. There, he met several Odionites and hitched a ride back to the Odionate. Having assembled his military forces, Daiman traveled to Gazzari on his flagship Era Daimanos. Unaware of Daiman's plans but still keeping to his side of the agreement, Bactra traveled to Gazzari with a small flotilla and relinquished an arxeum to Daiman's forces."}, {"tag": "p", "text": "Shortly afterward, a fleet led by Odion, arrived in the system, intent on attacking Daiman's forces and their newly acquired arxeum. As planned, Narsk had returned to his master and told him about the arxeum deal between Daiman and Bactra; leading him into a trap. After sighting Bactra's fleet, Odion contacted the Quermian, and Bactra informed him that the deal with Daiman had taken place, and that the Bactranites were no longer concerned with the fate of the arxeum. Bactra's fleet then remained in the Gazzari system, observing the battle between the Daimanites and the Odionites."}, {"tag": "h4", "text": "The Matriarch"}, {"tag": "p", "text": "However, the family matriarch Vilia Calimondra had decided that her family no longer needed Bactra, and, during the battle, Narsk Ka'hane sent a message from Calimondra to Daiman and Odion, ordering them to turn on Bactra. The two siblings subsequently sent some of their forces to attack Bactra's fleet, destroying half of the Quermian's fleet. The remnants of Bactra's fleet jumped into hyperspace and fled to Jutrand. However, the Daimanite and Odionite forces pursued them, and, within a few days, Bactra's empire had fallen to Daiman, Odion, and the Sith Lioko and Malakite."}, {"tag": "p", "text": "Following the collapse of the Bactranate, Daiman and Odion were later present at a hologram conference where Vilia divided Bactra's former assets up among her grandchildren. During the bequest, Daiman inherited Bactra's corporate assets including Industrial Heuristics and its affiliated enterprises. Daiman was pleased with his acquisition but his older brother protested, claiming he had a stake to the company since it was headquartered in Jutrand which had fallen to the Odionate. As quid pro quo, Vilia allowed Odion to keep Jutrand but ordered that he allow the company's executive staff enough time to relocate to Daimanate territory."}, {"tag": "p", "text": "An enraged Odion retorted that he would kill the staff rather than allow them to leave. In response, the brothers' grandmother reminded her family that corporations were not to be lightly destroyed since they were essential to the war effort against the Republic. Finally, Odion agreed to a settlement whereby Vilia sent two legions of Trandoshan slave warriors from her own forces to augment Odion's forces. They would arrive in the Odionate within the span of three days just as the Industrial Heuristics staff departed for the Daimanate. While tensions between the two siblings were momentarily soothed, these would re-emerge later during the year as both twins sought to undermine each other. His Jedi opponent Kerra was also present during the Bequest and was shocked to learn from her Sith host Arkadia Calimondra that all of the Sith Lords within the Grumani sector were related to each other. This only strengthened her resolve to continue the fight against the Sith warlords of that region."}, {"tag": "h3", "text": "The Deluge campaign"}, {"tag": "p", "text": "Following the events on Chelloa, Daiman's rule was further challenged by the Hutt crimelord Zodoh, who was intent on expanding his drug and slave-trafficking operations to the Grumani sector. While Daiman and Odion were preoccupied with carving up the remnants of the Bactranate, Zodoh led a strike force against the city of Capital Cay on Aquilaris, which Daiman had only recently conquered during the Second Charge Matrica. Zodoh's strike force included a Stormdriver which proceeded to wreck havoc on Daiman's troops by generating artificial floods and storms. Halfway through the battle, Zodoh's forces were driven away by a third party consisting of the Republic-affiliated Grace Command and Daiman's Jedi nemesis Kerra. Attacked from two sides, Daiman's forces on Aquilaris were quickly defeated with the Devil Squadron's Fire Lotus-class starfighters inflicting heavy damage on starfighter and anti-air defenses."}, {"tag": "p", "text": "Daiman was visiting the recently conquered world of Vellas Pavo when he received a call from the embattled garrison's flight commander. Initially, Daiman had dismissed the raid as a Hutt incursion and had ordered his forces on Aquilaris to put up stiff resistance. However, the flight commander quickly updated him with intelligence of the second attack and Holt's latest whereabouts. The flight commander was then killed during a dogfight with Holt and her Republic allies, followed by the destruction of a Daimanate gun outpost which marked the end of the Aquilaris campaign. While Grace Command was officially a paramilitary mercy organization providing relief operations in the Outer Rim, it was in reality a black operation set up by Baron Lemayne to distribute the narcotic Deluge to Sith-occupied territories. Rather than directly assaulting the warring Sith factions, the Republic intended to undermine their resistance without having to commit substantial resources by deliberately weakening their manpower through spice addiction."}, {"tag": "p", "text": "Back at his capital of Darkknell, Daiman vented his frustrations over the loss of Aquilaris to his advisor Uleeta. He was outraged by Hutt interference within his empire and the slow pace of his reinforcements to retake Aquilaris. His advisor responded that Daiman miscalculated the distance of Aquilaris when he \"created\" the galaxy. Uleeta also rationalized that the Deluge drug infiltrating his forces was merely a mind puzzle only his Lord could solve. Daiman concurred with his advisor's observations, concluding that Deluge was merely one more handicap to thwart him. Daiman concluded the meeting by ordering a second purge of the Deluge addicts in his pilot corps before his relatives received intelligence of these developments. Daiman hoped for the Jedi and their Hutt competitor to wipe each other out but aimed to defeat Kerra Holt, whom he regarded as his prime enemy."}, {"tag": "p", "text": "Ultimately, Daiman's under-estimation of Zodoh would prove costly. Having successfully eliminated Devil Squadron and tested his Stormdrivers on Aquilaris during the Aquilaris campaign, Zodoh proceeded to assail Daiman's capital of Darkknell. Daiman's forces had been purged and were quickly swept aside by Zodoh's navy. Using his flagship Voracious to coordinate the Stormdriver fleet, Zodoh created large artificial floods and storms which quickly flooded Darkknell, threatening the lives of billions of sentients. Despite repeated broadcasts to the people of Darkknell that all was fine, the Sith Lord was important in preventing the storm from overwhelming his cities and even damaging his palace. At the Sanctum Celestial, a hapless Uleeta could only comment that her master \"seemed\" to have willed the Southern Reservoir to burst it banks. An exasperated Daiman could only lament ordering a full-scale purge of his armed forces. He also blamed his elder brother Odion for tying up his forces in border feuds and allowing Zodoh to assail his territory. Odion responded by gloating over the impending deaths of billions on Darkknell."}, {"tag": "p", "text": "Daiman was subsequently caught in a floodwave that inundated the Sanctum Celestial and caused extensive damage to its interior. Unwilling to concede defeat, Daiman claimed to have resources everywhere in his universe that would come to his aid. Help came from an unlikely source: his adversaries Kerra and Jenn Devaad, the last survivor of Devil Squadron. They infiltrated Zodoh's flagship and destroyed the data processing center, setting of an explosion which destroyed the Voracious. The two women then escaped the battle in a hijacked starfighter, leaving Zodoh stranded in zero gravity. With the destruction of his flagship, the Stormdrivers were unable to coordinate their artificial storm and Daiman's forces were able to regroup and defeat Zodoh's navy. Zodoh was subsequently rescued and then incarcerated by Daiman's cruisers who brought him as a prisoner before Daiman."}, {"tag": "p", "text": "Daiman had Zodoh stripped oh his armor and bound to a large metal cradle. He also invited fellow Sith Lords Odion, and their cousins Arkadia Calimondra and Malakite to witness the execution of the fallen Hutt crimelord. Zodoh attempted to plead for his life but Daiman ignored his pleas. Daiman blamed Zodoh for the illicit supply of Deluge spice that have crippled his princedom and mocked Zodoh's Stormdrivers concept due to their reliance on a massive data processor for coordinating planetary strikes. Daiman then had his rival executed with a miniaturized Stormdriver which drained the moisture out of the Hutt. Daiman's ruthless treatment of Zodoh was influenced by his near-humiliation at the ends of a non-Force-sensitive Hutt whom he regarded as an illegitimate usurper."}, {"tag": "h3", "text": "Helm of Ieldis"}, {"tag": "h4", "text": "Unlikely Allies"}, {"tag": "p", "text": "Having \"saved\" Daiman from defeat at Darkknell, Kerra gained Daiman's grudging respect. Following the Aquilaris campaign, Kerra established contact with him and solicited his assistance in eliminating Odion, whom both shared a mutual dislike for different reasons. Kerra wanted to avenge the ravaging of her homeworld and to find the whereabouts of her parents. Meanwhile, Daiman sought to punish Odion for indirectly aiding Zodoh during the Aquilaris campaign. With Daiman's acquiescence, she was able to infiltrate Tergamenion disguised as a factory worker. Tergamenion was a bleak factory world and police state that was controlled by a highly-efficient security apparatus of holograms which allowed Daiman to monitor his subjects' every movements and conversations. Unlike other Daimanate worlds, there was no underground resistance movement and its inhabitants lived a life of unending, rigorous labor."}, {"tag": "p", "text": "Daiman obtained intelligence of the presence of an Odionate agent named Wayman, a Claimer who had infiltrated Daiman's security forces. With Daiman as her control agent, Kerra posed as a Force-sensitive factory worker named \"Mercy\" who would pretend to escape and then be apprehended by Wayman. For a safety precaution, Kerra was equipped with a jetpack since it involved diving from a high-rise building. As planned, Kerra attempted to escape from a factory and established contact with Wayman, who detected her Force-sensitivity and altered her records in the worker database to show she was deceased. Wayman succeeded in recruiting \"Mercy\" by appealing to her alleged design to avenge the deaths of her family at the hands of Daiman. He offered to train her as a dark side-using Novitiate. As a test of her abilities and enthusiasm, he told her to make her own trip to Odion but also gave her a signalling device when she arrived at her destination. \"Mercy\" complied and he departed on a speeder bike."}, {"tag": "p", "text": "She then conversed with a hologram of Daiman, who had been monitoring the conversation while posing in his hologram mode. Daiman commented about his omnipresence with Kerra responding that he was deranged and questioned her decision to cooperate with Daiman. In response, Daiman boasted of his omnipotent power of being able to know the past, present and future, and claimed that was why Kerra was working for him. Kerra disagreed and emphasized that this partnership was only a temporary \"alliance of convenience.\" Daiman also claimed that he prophesied a great tribulation in the future originated in Odion's realm. With their briefing concluded, \"Mercy\" or rather Kerra departed in her starfighter for the Odionate. There, she was inducted into the Novitiate and was sent on a mission into Skarpos, part of Malakite's realm known as the Menagerie."}, {"tag": "h4", "text": "Bloodbath on Skarpos"}, {"tag": "p", "text": "Seeking to defeat Odion once and for all, Daiman also sent one of his agents to monitor Kerra Holt. The Kubaz Glenk was a Daimanate plant working undercover within Odion's elite Novitiate corps. Following the First Battle of Skarpos, Glenk learnt about the existence of Project Pandemonium and the Helm of Ieldis, an ancient Sith artifact constructed prior to the Great Hyperspace War which was capable of driving sentient beings into a homicidal frenzy. Glenk went missing following the invasion of Sarrassia and returned to his master to report his intelligence findings. He revealed that the Helm was located on Skarpos, a bleak desert planet which had been recently annexed by Odion. While Glenk's disappearance annoyed his comrades including General Beld Yulan and the Novitiate commander Doyan, they did not suspect that Glenk was actually a double agent in the service of Daiman."}, {"tag": "p", "text": "Unwilling to concede the loss of Skarpos to Lord Ordion, Malakite launched a counterattack to retake Skarpos. The next battle became a massive three-way battle involving the armies of Odion, Malakite, and Daiman. In the midst of the fighting between Odion and Malakite's forces at the base of the Morbollon Mesa, Daiman's fleet arrived in the skies above the battlefield. Daiman himself led the battle from the top of an orbital battle platform and was accompanied by his double agent, Glenk who commented that the sole purpose for his existence was to serve his Lord Daiman."}, {"tag": "p", "text": "Daiman quickly deduced that Odion was after the Helm and that Kerra had led him to it. He expressed his desires of wanting the Helm for himself before ordering his troops to wipe out Odion's forces and to destroy Malakite's forces if he interfered. Daiman's fleet disgorged ground forces who took on Malakite's hordes of Mutates and then assaulted the Odionate camp. However, Odion still got to the Helm before any of his opponents could and then activated it, intending to test his new superweapon on the three armies beneath the Morbollon Mesa. Kerra arrived but was quickly knocked out with Force lightning by Odion, who wanted to \"reward\" her by making her witness its first test demonstration."}, {"tag": "p", "text": "The Helm of Ieldis unleashed a homicidal frenzy among the the three rival armies beneath the Morbollon Mesa. Daiman lost control of his troops as they began killing each other. He himself was threatened when his spy Glenk turned on him. Under the influence of the Helm, Glenk tried to kill the Sith Lord with his lightsaber. However, Daiman struck him with Force lightning and Glenk plummeted to his death several hundred meters beneath the mountain. Daiman himself was forced to flee the battle while he could still retain control over his mind. He managed to escape Skarpos but his entire invasion force was annihilated during the invasion."}, {"tag": "h4", "text": "Avoiding an Apocalypse"}, {"tag": "p", "text": "Following the events on Skarpos, Daiman managed to escape and to contact his Sith family members. Shedding any illusions of being the Creator of the Universe, Daiman contacted the family matriarch Vilia Calimondra and highlighted Odion's threat to the galaxy. He explained that Odion was tampering with forces he did not understand. Since Odion's acquisition of the Helm challenged the balance of power within the Grumani Sector, Calimondra rallied her family to prepare for a military assault on the Odionate. She urged the disparate Sith Lords including Arkadia Calimondra, Lioko, Malakite, and Trevayne to set aside their differences and stop Odion at all costs. While Vilia confided in Daiman that she thought Odion had always been differently guided, she admitted that she had underestimated his nihilistic ambitions of galactic destruction. She added that no one should want to be the \"king of a graveyard\"."}, {"tag": "p", "text": "As Daiman and the other Sith Lords entered hyperspace, Odion made preparations for a death ritual that would destroy all life in the galaxy, beginning with the Grumani Sector. He intended to harness the negative emotions of the children of the Vanahame cloister—a large planet-sized orphanage which housed thousands of children from throughout the Odionate. Odion succeeded in launching his ritual, leading to a series of homicidal killings throughout the sector including his throne room on Vanahame where his loyal Novitiates descended into a killing rampage. The Helm's powers also affected the hastily-assembled anti-Odionate Sith coalition with Daiman himself being attacked by several of his naval crew on his flagship Era Daimanos. In self defense, Daiman unleashed Force lightning on his maddened attackers, presumably killing several of them."}, {"tag": "p", "text": "At the eleventh hour however, Kerra succeeded in convincing Odion's second in command Yulan to turn against his master, by arguing that the lives of the children in the Cloister and the galaxy mattered. Yulan managed to free the Cloister children, creating a surge of positive emotions like joy and relief which ended the Helm's killing rampage. This surge also caused the Helm to overload, killing Odion. With the death of its titular ruler, the entire Odionate collapsed into anarchy. The Calimondra family quickly invaded the territory, dividing it among themselves. During this conflict, Daiman took the largest share of territory and captured several Cloisters before Kerra and Yulan could liberate the children there. During a conversation prior to Yulan's departure into Republic space with the orphans, Kerra commented that it was easier to live under the \"Creator of the Universe\" Daiman than its \"Destroyer\" Odion. Ultimately, Daiman's conspiracy against Odion with the connivance of Kerra succeeded; however, he failed to turn Kerra to the dark side."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Similar to Darth Ruin before him, Daiman believed in solipsism and viewed war as a piece of entertainment. Taking the Sith tenet of self-glorification to its logical extreme, Daiman came to believe that only he was real and that \"reality\" itself was his own creation, little more than a Force vision to test him. His twisted view of reality also made him believe that every action and event in nature was related to him, either to aid him or to harm him."}, {"tag": "p", "text": "As a narcissist, he viewed all matter and energy as manifestations of his spirit. Daiman also had a manichean view of life, viewing himself as the Creator and his rival Odion as merely a creation who had \"rebelled\" against him. Obstacles to his goal of galactic domination like Kerra Holt and the addictive Deluge substance were merely rebuffed as puzzles his mind had created to challenge his skills and power. Daiman also had heterochromia, which caused his right eye to be blue while the left one was yellow. When employing the dark side, however, both of his eyes became yellow."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Sith Lord, Daiman was proficient with Force lightning which he used to torture the Chelloan Rodian mechanic Skodo and Odionite spy Narsk Ka'hane when probing their minds gave little information. Daiman also used the Force to choke the mercenary Jarrow Rusher for a sarcastic thought regarding the Dark Lord."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Daiman was first developed as one of the major antagonists of the Knight Errant comic series which debuted with the release of Knight Errant 0 during Celebration V in August 12–15, 2010. Daiman served as one of the two main antagonists in the series' first story arc Star Wars: Knight Errant: Aflame, which ran from October 13, 2010 through to February 16, 2011. His story background was developed by John Jackson Miller while the character was drawn by artist Ivan Rodriguez, inked by Belardino Brabo, and colored by Michael Atiyeh. The fourth and fifth issues in the story arc explore both his narcissistic worldview and his dysfunctional sibling rivalry with his older brother Odion."}, {"tag": "p", "text": "He also appeared in Miller's tie-in novel Knight Errant, which was first released on January 22 2011. This novel further contextualised Daiman's role within the internal dynamics of the Calimondra family, a powerful Sith dynasty in the Grumani sector. Daiman plays a smaller role within the second story arc Star Wars: Knight Errant: Deluge, which ran from August 17 to December 21, 2010. He makes three separate appearances in the second, third, and fifth issues. In the second and third issues, he was drawn by Iban Coello, inked by Sergio Abad, and colored by Atiyeh. In the fifth issue however, he is drawn by David Daza."}, {"tag": "p", "text": "Daiman also plays a small albeit significant role in the story plot of the third story arc Star Wars: Knight Errant: Escape which ran from June 13 to October 10, 2012. In the third story arc, readers get a glimpse into his childhood albeit from the perspective of his brother Odion. Within this story arc, he is drawn by Marco Castiello and Andrea Chella, inked by Vincenzo Acunzo, and colored by Atiyeh."}, {"tag": "p", "text": "In Knight Errant: Aflame 3, both of Daiman's eyes are incorrectly colored yellow, whereas only one of his eyes, the left eye, is supposed to be colored blue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}