{"url": "Daine_Jir/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Officers of the 501st Legion (Galactic Empire)"], "nodes": [{"tag": "h1", "text": "Daine Jir"}, {"tag": "p", "text": "Daine Jir was a bold and outspoken 501st Legion stormtrooper officer, serving under Darth Vader aboard the Imperial I-class Star Destroyer Devastator as a commander during the hunt for the stolen Death Star plans in 0 BBY. Jir—part of a family that had donated a genetic template for the Imperial stormtrooper development program—started out as a combat stormtrooper in the 501st, but later proved himself to be a competent and ruthless officer. However, many suspected he would not last long under Vader's command after he called one of the Dark Lord's decisions into doubt. Vader was impressed with Jir's brutal honesty, and promoted him instead of killing him."}, {"tag": "p", "text": "In 0 BBY, Jir led a contingent of the 501st in an attack on the CR90 corvette Tantive IV, on which Vader believed Senator Leia Organa had received transmissions containing the Death Star plans. The 501st picked off the Rebel forces aboard the ship and captured Organa, but despite a thorough search of the corvette no trace of the plans could be found. Jir was tasked with destroying the ship and alerting the Imperial Senate that it had been lost in a meteorite strike."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Commander of the 501st"}, {"tag": "p", "text": "A tall, slim Human male, Daine Jir was a member of the Jir family, who were known to have donated a genetic template for the Imperial stormtrooper development program. Jir himself enlisted in the Imperial Army, proving himself extremely capable; he served as a stormtrooper in the elite 501st Legion, before becoming a noncombat officer with the rank of lieutenant in the same legion, known for its exploits at Kamino and Polis Massa as well as quelling a prison break on the Death Star. Jir used constant, rigorous training regimens and crisis simulators to ensure that he and the stormtroopers under his command were maintaining high performance levels."}, {"tag": "p", "text": "By 0 BBY, Jir and the 501st were posted aboard the Imperial I-class Star Destroyer Devastator, and served directly under Dark Lord of the Sith Darth Vader, Emperor Palpatine's enforcer. Vader was a fearsome figure who was known to execute his subordinates for the merest of errors, and most who served under him were too afraid to ever defy him. Jir—a bold and outspoken man—was unafraid of Vader, and spoke out against his suggestions numerous times while still a lieutenant. This was practically unheard of, and Jir's peers began to count his days amongst the living; Vader had Force choked men for far less. The Dark Lord, however, found Jir's brutal honesty a refreshing contrast to the usual manipulative rhetoric of most Imperial officers, and promoted him to commander. Commander Daine Jir became Vader's aide-de-camp for the opening year or so of the Galactic Civil War. It was later said that Jir, like Admiral Firmus Piett and Captain Janus Bonn, was one of the select few Imperial officers who had ever earned Vader's respect."}, {"tag": "h3", "text": "Attack on the Tantive IV"}, {"tag": "p", "text": "In 0 BBY, members of the Alliance to Restore the Republic on the planet Toprawa stole plans to the Empire's secret Death Star project, which were transmitted to Imperial Senator Leia Organa—herself a member of the Rebel Alliance—and her crew on board the CR90 corvette Tantive IV. By the time Imperial Intelligence located the leak, Organa had fled in the Tantive IV; vowing to retrieve the stolen information at any cost, Darth Vader took the Devastator in pursuit, along with Jir and the 501st. Vader also hoped capturing the ship would provide the Empire with the location of the Rebels' secret base."}, {"tag": "p", "text": "The Devastator intercepted the Tantive IV over the remote world of Tatooine in the Outer Rim Territories; the Star Destroyer tractor beamed the ship, and Vader ordered the 501st to prepare to board. Jir stayed behind with Vader as the legion's contingent of stormtroopers entered the Tantive IV to engage what little soldiers the Rebellion had defending the ship. The Imperials killed many of them, allowing Vader—accompanied by Jir—to enter and oversee the search for the Death Star plans; however, no trace of the plans could be found, and the Imperials were also unable to locate Princess Leia Organa. Jir and Commander Nahdonnis Praji stormed the ship's bridge and captured the Tantive IV's captain, Raymus Antilles, whom Vader killed during an interrogation. Eventually, Organa was located, but they were unable to find the Death Star plans."}, {"tag": "p", "text": "Jir's stormtroopers escorted Organa to him and Vader, who began questioning her. Organa was defiant, reiterating that she was on a diplomatic mission and that the Senate would not stand for Vader's actions. Furious, Vader accused her of conspiring with the Rebellion and had her taken aboard his Star Destroyer for interrogation at a later time. When Organa was gone, the Dark Lord of the Sith asked Jir why she had chosen Tatooine, as it appeared to be completely lacking in any military presence; Jir told him that sensors confirmed Vader's suspicion, but could offer no possible reasons for Organa's choosing Tatooine. Jir believed that Organa would not buckle under even Vader's interrogation, and, if it was up to him, he would have released her or had her killed along with the other crew members of the Tantive IV. He bluntly told Vader that holding her in custody could generate sympathy for the Rebel Alliance in the Senate, but the Dark Lord knew she was his only link to the Rebel base, so she could not be released or killed. Jir also had some sympathy for the woman, believing that her death would be a more enjoyable prospect than torture at the hands of Darth Vader."}, {"tag": "p", "text": "Vader ordered Jir to send a distress signal from the ship claiming that it had been hit by a meteorite storm, to destroy the ship and ensure there were no survivors, and inform the Imperial Senate—as well as Leia Organa's father, Bail Prestor Organa—that all had perished. Vader also had Jir send a detachment of the 501st to Tatooine's surface to search for a lone escape pod he believed contained the plans. The Devastator transferred Organa to the Death Star, where Jir's prediction that Organa would not betray the Alliance proved true."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Daine Jir was a bold and outspoken man, known to question the decisions of his superiors when he saw fault in them. Unlike most, he was not afraid of Darth Vader and his Force powers, and he often called his judgment into question while on missions with the Dark Lord. However, Jir was thought to be a model Imperial officer, as he could follow orders explicitly when he saw the sense in them, and he usually accepted Vader's explanation after asking him about his planned course of action. Diligent, ruthless, and efficient, Jir cared about the troopers under his command, and kept them in top fighting condition through constant simulators and training."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Daine Jir first appeared in the 1976 novelization of Star Wars: Episode IV A New Hope, where he was given several lines of dialogue, though he was not identified by name. In 1977, he appeared in A New Hope, where he was given slightly shortened dialogue. His scenes were filmed in mid 1976 in the United Kingdom. He also appeared in the first issue of Marvel's A New Hope adaptation, though he was given a different appearance, with black sideburns. The character also filled the same role in the radio dramatization of A New Hope, and he may have also appeared in an earlier scene on Ralltiir, where an Imperial voiced by the same actor can be heard. Since then, his only appearances have been in the novels Death Star and The Rise and Fall of Darth Vader, which both recap his scene in A New Hope. Thus, all of his appearances have covered the exact same scene."}, {"tag": "p", "text": "After A New Hope's radio dramatization, no source mentioned the Imperial commander and he was never identified, until Decipher's Star Wars Customizable Card Game identified him as \"Daine Jir\" in 1997. \"Daine Jir\" is likely a play on the word \"danger,\" inspired by Jir's line: \"holding her is dangerous.\" In 2005, the video game Star Wars: Battlefront II established that the stormtroopers seen on board the Tantive IV were members of the 501st Legion, making Jir a commander of the prestigious legion. This was later confirmed in The Empire's Finest: Who's Who in the Imperial Military, an article written by Daniel Wallace and Abel G. Peña appearing in Star Wars Insider 96. The identity of the actor who played Jir in A New Hope was not known for many years, but in April 2007 The Making of Star Wars: The Definitive Story Behind the Original Film established that he was played by Constantin De Goguel. However, less than a month later, the StarWars.com Visual Guides authored by Pablo Hidalgo stated that Jir—listed in the script only as an unnamed \"Commander\"—was portrayed by Al Lampert, as per the film's production notes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}