{"url": "Dak_Vesser", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Former Jedi", "Category:Former Sith", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Redeemed Jedi", "Category:Sith of Revan's Sith Empire"], "nodes": [{"tag": "h1", "text": "Dak Vesser"}, {"tag": "p", "text": "Dak Vesser was a Human male Padawan who served the Jedi Order at the Enclave on Dantooine during the Mandalorian Wars. He was also a close friend of Juhani."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dak was too passionate, and felt frustrated by the Jedi. Eventually he decided to leave, but before he did he confessed that he loved Juhani and tried to convince her to leave the Order with him. While Juhani was having doubts of her own prior to her eventual fall, she did not return his feelings, and stayed with the Jedi."}, {"tag": "p", "text": "Hurt over her rejection, Dak left Dantooine. Eventually he fell to the dark side and became a student at the Sith Academy on Korriban in 3956 BBY. When Revan arrived on Korriban during his mission to stop Darth Malak, Dak encountered Juhani once again. After speaking with her he decided to leave the Sith Academy. While unsure where he would go, he desired to get away from both the Sith and the Jedi."}, {"tag": "p", "text": "Revan and his other Jedi companions encountered Dak a second time in The Drunk Side, a cantina in Dreshdae. He expressed his desire to be away from Juhani and promised Revan he wouldn't reveal his identity to the Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the player is Dark Sided, they can visit Dak in the cantina and provoke him into a fight, killing him. If Juhani is in the party she will prevent the player from killing Dak in the cantina."}, {"tag": "p", "text": "Alternately, if the player does not convince Dak to leave the Sith, and takes the path of killing both Headmasters or redeeming Yuthura Ban, he will be among those who attack the player once the ruse is discovered."}, {"tag": "p", "text": "Vesser's entry in The Complete Star Wars Encyclopedia states that he is a Xenobiologist that became tainted by the dark side energy on Korriban and was killed by the Jedi Knights that came to gather information on Darth Malak. The entry does not mention any information that Vesser was Force-sensitive or had studied with either the Jedi or the Sith. This discrepancy has not been addressed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}