{"url": "Dalborra", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Males", "Category:Mercenaries", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Dalborra"}, {"tag": "p", "text": "Dalborra was a male Wookiee who lived during the time of the Great Galactic War. He served in the reconstituted Sith Empire's Army."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Dantooine"}, {"tag": "p", "text": "During the final stages of the Great War, Dalborra was stationed on the planet Dantooine. As the war came to a close and the Sith sacked Coruscant, Dalborra came up behind two Republic Military personnel and knocked their heads together with his bare hands, an example of his strength. A large blaster rifle with numerous scopes caught his eye and he took it."}, {"tag": "p", "text": "While operating, Dalborra was tracked down by a bounty hunter named Braden, who sought to collect one of the numerous bounties on Dalborra despite the ceasefire between the Republic and the Sith Empire. When Braden refused orders to call off his hunt, his client fired on him with concussion missiles. Braden was knocked off his feet, he survived, but Dalborra found him, all the while holding his new weapon."}, {"tag": "h4", "text": "Aftermath"}, {"tag": "p", "text": "Dalborra then escorted and placed Braden on a Sith warship that was transferring Human prisoners to Korriban. While passing through the Kuat sector of the Core Worlds, the warship they were traveling on attacked a Republic transport ship."}, {"tag": "p", "text": "After the following battle Jedi Master Dar'Nala was taken captive and placed on the same ship for torture. After failing to cooperate with the Sith she helped Dalborra's prisoner Braden escape. Due to this and her failure to cooperate, the Sith gave Dalborra the okay to execute her, which he ostensibly did by electrocution. However, Dalborra was really under Dar'Nala's influence, so he faked her death."}, {"tag": "p", "text": "Later when the Imperial Transport landed on Korriban, Dalborra was denied access to the planet due to the loss of his prisoner but was still promised his payment. Soon after he was nearly killed in the bombing and destruction of the Transport he had arrived on. Later, he resumed his mission of tracking Braden and followed him to Coruscant. Braden attempted to tell the authorities of the identity of the Sith Lord who ordered the attack on the Envoy."}, {"tag": "p", "text": "However, he only succeeded in killing the Republic officer who had betrayed him—Lesl—and the Kel Dor Jedi Master Zym. As his quarry departed in his starship, the nearby Galactic Senate was damaged by a bomb attack. Dalborra observed both Braden's departure and the bombing of the Senate."}, {"tag": "h3", "text": "Return to Dantooine"}, {"tag": "p", "text": "Afterwards, Dalborra was brought to the Jedi Enclave on Dantooine under the influence of the Force by recently found alive Jedi Master Dar'Nala, where Dalborra was quickly accused a traitor by Lieutenant Harron Tavus, who held him at gunpoint. Master Dar'nala was able to calm the group, telling Tavus that Dalborra's mind was being \"redirected\". The group then argued about neutralizing the effect of the treaty, while blaming it on Darth Baras."}, {"tag": "p", "text": "Dalborra later accompanied Master Dar'Nala and Lieutenant Tavus to an ancient crystal cave, also on Dantooine, to meet Lord Baras. The group soon engaged in a brutal fight, where Dalborra attacked two Imperial troopers. Jedi Knight Satele Shan then arrived unexpectedly and was asked by Dar'Nala to aid them in the battle. He later struck and killed Dar'Nala during the battle and fled further into the caves."}, {"tag": "p", "text": "As Dalborra fled, Braden managed to locate him and finally captured him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dalborra was part of the Sith Empire, presumably working as a mercenary. He is the only known Wookiee to have allied himself with the Sith. He wore a helmet and goggles similar to those of a podracer. His weapons of choice seemed to be his bare hands, a long staff similar to a force pike, and a heavy rifle. He wore a long body holster similar to what Chewbacca would wear thousands of years later, and a sort of backpack with a sensor-like rod protruding from it. After the battle of the Dantooine caves Dalborra is killed by Braden."}, {"tag": "h2", "text": "Appearances"}]}