{"url": "Dalien_Brock", "categories": ["Category:Legends articles", "Category:Articles with an excess of redlinks", "Category:Former Je'daii", "Category:Humans", "Category:Males", "Category:Stargazers", "Category:Tythans"], "nodes": [{"tag": "h1", "text": "Dalien Brock"}, {"tag": "p", "text": "Dalien Brock was a Force-sensitive\nHuman male born of two Je'daii Masters, who reluctantly trained as a Je'daii Journeyer of the Je'daii Order with his sister, Lanoree, before fleeing after having killed Skott Yun, another Journeyer. After faking his death, he joined and led a sect of the Stargazers, a cabal of fanatics dedicated to finding a way to leave Tython system and to reach the stars of their ancestors by any means."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The youngest child of Je'daii Master Brock and his wife, Dalien Brock grew up on Tython with his sister Lanoree at the Temple of Arts, Bodhi. He and his sister were encouraged to express themselves through art, and in his childhood, Dalien was particularly fond of drawing and painting. He loved fruits, and Mepples were his favorite."}, {"tag": "p", "text": "Because of his Force-sensitivity, Dalien was permitted to reside on Tython and pursue studies to be a Je'daii. But he believed that the Je'daii could not be their own masters, since they served the Force and were bound by it. This belief caused him to eventually began to shun the Force, reacting furiously whenever his sister sought to connect with his mind telepathically. Every time his family visited the Edge Forest to bask in the Force energies of the teeming lives around them, the young Dalien will burst into tears due to his family's indifference towards his feelings and  constant efforts to bring him to embrace the Force.Instead, he turned to history, studying the ancient cultures of Tython and pondering the stars. His mother found this concerning, worried that it will lead him to a destiny away from Tython.\nDuring his childhood, his grandfather passed down a well-used blaster pistol, a weapon that he would cherish and hold on to throughout his life."}, {"tag": "h3", "text": "Great Journey"}, {"tag": "p", "text": "Reaching adolescence, Dalien set out with his older sister away from Bodhi on foot to begin their Great Journey. The pair traveled first to Qigong Kesh, the Temple of Force Skills, surviving encounters with hook hawks and silik lizards along the way. There, they trained under Master Ter'cay, who took them to the Silent Desert, using Force telepathy to communicate with the pair, though Dalien was unable to hear Ter'cay in the Force. Traveling next to Stav Kesh, the Temple of Martial Arts, they were attacked by a flame tygah. Dalien attacked the creature himself with his blaster pistol without any reliance on the Force, causing his sister to intervene when his blaster misfired. Arriving at Stav Kesh with burns from the assault, the two trained with Master Tave, first learning about breathing and its importance to fighting. Throughout their training, Dalien continued to retreat from the Force despite his sister's attempts to promote its use. When he successfully landed a strike on Tave without using the Force, his sister attempted to warn him that Tave had allowed it to instill confidence, not because the Force was weak."}, {"tag": "p", "text": "In one incident, when Master Kin'ade led a training session that required the Journeyers to fight while deprived of their physical senses against the Darrow sphere, Dalien ended up shooting wildly with his blaster, injuring his sister and putting other Journeyers in danger, before he was knocked unconscious by Kin'ade. After the incident, Kin'ade and the Brocks were all asked to give their accounts of the event to Temple Master Lha-Mi. Dalien claimed to only have failed in his best efforts to allow the Force to guide his aim. While Lha-Mi concluded to the group that Dalien had only been reckless in his enthusiasm, he privately warned Lanoree of the deep-seated darkness lurking within her brother."}, {"tag": "p", "text": "On their last day at Stav Kesh, a group of Journeyers, including the Brocks, were asked to fight one other. Dalien thought he had beat his sister but was ultimately knocked back with a Force punch, ending the fight. Before their departure, Lha-Mi reiterated his warning to Lanoree to be wary of her brother's increasing instability and the danger he could pose."}, {"tag": "p", "text": "The Brocks then traveled to Anil Kesh, the Temple of Science, growing further apart with every step. Along the way, they crossed the Moon Channel unescorted, working together to survive attacks by a gelfish swarm and a sea serpent. Upon arrival at the Temple, Dalien relished the fact that his sister felt sick due to the Force Storms caused by the Chasm, which lay beneath the temple. While Lanoree studied at the Temple, Dalien went to the Riftlands with Master Quan-Jang and nine other Journeyers to retrieve samples for the laboratories. However, Dalien fled into the Abyss of Ruh, forcing Master Quan-Jang and other Je'daii to give chase and retrieve him. Returning to Anil Kesh, Dalien confronted his sister and another Journeyer, Skott Yun. Yun attempted to arrest Dalien, but the disillusioned young man shot and killed Yun and escaped. His sister in hot pursuit, Dalien fled across the Red Desert and into the Old City where he faked his own death in the depths below the ancient city. Lanoree found only his bloodied, shredded clothes, leading her and the Je'daii to believe Dalien had been killed, just as he had hoped."}, {"tag": "h3", "text": "Stargazers"}, {"tag": "p", "text": "Escaping off Tython, Dalien laid low for the next nine years, slowly becoming obsessed with escaping from the Tython system until it consumed his mind. Blocking out the Force completely so that only a void filled his heart, Dalien became involved with a little known group known as the |Stargazers led secretly by some of the system's most elite business leaders and philanthropists. Hoping to accelerate their plans to leave the system, the Stargazers worked behind the scenes, pulling strings so that Dalien would be the public leader of a sect of Stargazers using Gree schematics to activate a legendary hypergate rumored to exist in the Old City. Using the diary of Osamael Or for direction, Dalien and his cabal set in motion a plan to create a device that would charge the hypergate so that they could leave Tython. When a member of the Stargazer leadership, Kara leaked information to the Je'daii about Dalien's plans, the Je'daii Council dispatched Lanoree Brock to hunt him down and end the threat."}, {"tag": "p", "text": "Dalien and his sect were operating out of a Dai Bendu temple in the city of Khar on Kalimahr when Kara informed him that his sister was investigating him. Rushing to action, Dalien and his sycophants abandoned the temple and fled to Nox, leaving a bomb behind in hopes of killing Lanoree. Despite his attempts to end Lanoree's hunt, Dalien was tracked to Nox, and with the help of the crimelord Maxhagan, Dalien was discovered once more. While deep within the bowels of the secret laboratories of Pan Deep, Dalien was reunited with his sister as the device for activating the hypergate had been completed. Dalien was unwilling to kill his sister, so he left Pan Deep with the Stargazers, leaving one Cathar Stargazer behind to kill his Je'daii sister. Though a distraction from Sana allowed Lanoree to blind the Cathar, the pair only narrowly survive the Cathar's suicide bomb. Not realizing Lanoree had left a tracking device on his boot, Dalien was followed to Ran Dan's Folly, a small mining output on Sunspot, where Dalien planned to charge the device in preparation for the hypergate. Though Lanoree attempted to intervene, she was unable to stop Dalien from charging his device with a marionium cube. Before departing again, Dalien shot his sister in the chest, leaving her for dead as he left for Tython."}, {"tag": "p", "text": "Arriving on Tython during a massive Force Storm, Dalien's Stargazers lost control of the ship and crashed thirty kilometers from the Old City. Despite these setbacks, Dalien delved down into the labyrinth of caves below the city until he located the hypergate and prepared to activate it. Before he could do so, Dalien was interrupted by his sister, who attempted to stop him by pushing a memory of them together in their childhood into his mind, followed by images of the horrors she had witnessed from Nox, Sunspot, and Tython during her pursuit. Tormented by these images, Dalien screamed in agony, giving his sister the chance to Force push him backwards. Even as he gradually recovered, Lanoree believed that he was defeated and expected him to flee. Instead of running, Dalien attacked Lanoree in a frenzy, throwing a blade into her palm and hitting her repeatedly. However, even with one hand wounded, his sister could not be defeated. With her sword and the aid of the Force, she expertly defended against all attacks he threw at her. At last Dalien threw a knife at her face, which she deflected with the Force. Hoping that this diversion would give him the window to activate the device, Dalien leaped at the it, a motion that forced Lanoree to kill him. She struck off his right arm and lodged her blade in his skull. Sensing his death, Lanoree left Dalien's corpse in the cavern as she returned to Anil Kesh. When Je'daii Master Kin'ade returned to retrieve it, Dalien's body had vanished without a trace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a child, Dalien was highly individualistic, priding himself on being his own man. During his time on Tython, he grew to reject the Force due to his belief that the Je'daii were slaves to the Force since they served it and were bound by it.\nHis rejection of the Force became severe in adolescence, dismissing even praise from Je'daii Masters and scorning all reference to the Force. Whenever Lanoree or any Je'daii used the Force to touch his mind, even to express love and concern, he reacted with utter revulsion. The constant efforts of his family and masters to teach him the ways of the Force despite his rejection to it also led him to grow unsatisfied towards his family and the Je'daii society. He drew within himself and dreamed extensively of carving his own destiny free from the Force and an escape beyond the stars. Instead of seeking the Force, he turned to the stars, with his ultimate ambition being to leave the system. What he regarded as Je'daii enslavement to the Force, he contrasted against his great sense of independence, which was so paramount to him that he reproached Lanoree for saving his life against a flame tygah, preferring to die self-reliant than live with the help of another."}, {"tag": "p", "text": "Nine years after faking his death, Lanoree noted that he grown taller and thinner, and that his child's melancholy had transformed into adult bitterness. By then, his hair was speckled gray and he bore a scar on his left cheek, but did nothing about these due to his dedication to reactivating the hypergate."}, {"tag": "h2", "text": "Power and abilities"}, {"tag": "p", "text": "Although Dalien didn't learn the ways of the Force, his sister noted that his skills had always been in combat. During his Great Journey, he was capable of using Alchaka techniques in combat. In his mortal duel with his sister, he demonstrated tact in exploiting her wounded hand, kicking the knife deeper into her palm and repeatedly targeting it to keep her on the defensive. He was capable of throwing knives with precision, but ultimately, his martial aptitude was not enough to defeat a Je'daii who had the full command of the Force by her side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}