{"url": "Daln%C3%A9", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Females", "Category:Humans", "Category:Monarchs of Naboo"], "nodes": [{"tag": "h1", "text": "Dalné"}, {"tag": "p", "text": "Dalné was a human female who served as the Monarch of Naboo around 3 BBY. Although the kings and queens of the past actually ruled, Dalné's role was mostly ceremonial, as Naboo's concerns now rested in the hands of Emperor Palpatine's governor, Moff Quarsh Panaka. Though the queen resented this, she was unable to countermand or resist it. She was around the same age as Princess Leia Organa of Alderaan, who visited her in 3 BBY. Frustrated by her lack of power and ability to actually rule, Dalné leapt at the chance to do something useful when Organa offered her a place on her relief mission to distribute supplies."}, {"tag": "p", "text": "Learning of the corruption and ill-treatment of the miners, the two women resolved to meet with Panaka and attempt to convince him to act, with the queen lending Organa a Naboo jubilation dress from her personal wardrobe to replace her soot-stained gown. Though Dalné was half-convinced that Panaka would not listen, she was both elated and confused when he did, and even more so when he began asking Organa personal questions regarding her birth parents. Both women were unaware that Panaka had noticed Organa's resemblance to one of Dalné's predecessors, the late Padmé Amidala, who was in fact Organa's birth mother, and that he was intending to inform the Emperor of his idea."}, {"tag": "p", "text": "Both women then bore witness to Panaka's assassination by the Partisans, narrowly escaping death by the skin of their teeth when the Moff's chalet was destroyed by a bomb. Though shaken by Panaka's murder, Organa encouraged Dalné to take the opportunity, before another Imperial governor was appointed, to enforce measures to protect miners on Naboo's moon Onoam. Though the young queen was skeptical of actually succeeding, she nonetheless resolved to do her best."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dalné appeared in Leia, Princess of Alderaan, a 2017 young-adult novel written by Claudia Gray."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}