{"url": "Daluuj/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Albanin sector planets", "Category:Daluuj locations", "Category:Darth Krayt's Galactic Empire planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Daluuj"}, {"tag": "p", "text": "Daluuj was a lightly populated Outer Rim planet covered with barren canyons and muddy slopes."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Daluuj was located within a star system in the Albanin sector of the Outer Rim Territories region of the galaxy. It was a temperate planet with a breathable atmosphere, standard gravity, and two moons. Its surface was covered with barren canyons and muddy slopes. Its rotational period lasted 28 standard hours and its orbital period lasted 391 local days."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Daluuj was originally colonized by humans at some point after 1000 BBY. By the time of the Clone Wars, the planet was considered to be within Hutt Space."}, {"tag": "h3", "text": "Rebellion era"}, {"tag": "p", "text": "Admiral Ackbar crashed on the planet while en route from Mon Calamari to Yavin 4 around 0 ABY. Princess Leia Organa and Han Solo had just rescued Luke Skywalker and C-3PO from his wrecked smuggling ship on Hoth when they intercepted the distress signal sent out from the Admiral's transport."}, {"tag": "p", "text": "Following the trail of the Admiral's escape pod to Daluuj, the Millennium Falcon managed to enter the planet's storm-wracked atmosphere, narrowly missing the gun turret of an Imperial fort in the process. Captain Solo set the Falcon down on what appeared at first to be an ordinary mud plain, only to find out too late that it was in fact a lake occupied by two giant worms that quickly twined themselves about the stricken ship, dragging it to the bottom of the lake."}, {"tag": "p", "text": "Only with the assistance of Admiral Ackbar and his fellow Mon Calamari were the Rebels able to raise the Falcon and evade the Imperial forces led by Commander Orlok. In doing so, the Rebels lured Orlok's ground-skimmers across the mud lake, trapping him and his stormtroopers in the coils of the giant mud-worms that had previously held the Falcon, and thus make their escape."}, {"tag": "p", "text": "The Rebel Alliance suffered a defeat here sometime prior to the Battle of Hoth."}, {"tag": "h3", "text": "Legacy era"}, {"tag": "p", "text": "After the Yuuzhan Vong War, many Yuuzhan Vong relocated to Daluuj, taking advantage of its breathable atmosphere. The Empire of Darth Krayt maintained only a small presence on the planet."}, {"tag": "p", "text": "In 137 ABY, it was the location of the ambush on Daluuj where a conclave of four of the last remaining Jedi, including Wolf Sazen, Shado Vao, and Ahn Rasi Tuum, was held before being attacked by the Sith. At this location, hundreds of impaled droid heads stood on sticks as for a ritual. Cade Skywalker would return to Daluuj during his hunt for Vul Isen along with his master Wolf Sazen and his crew."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Daluuj had a sparse population of Humans, who comprised 88% of the population, and various other species that lived in villages and small cities. Yuuzhan Vong, who comprised 6% of the population, usually lived in isolation away from other settlements."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}