{"url": "Damask_Holdings/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:InterGalactic Banking Clan", "Category:Mining companies"], "nodes": [{"tag": "h1", "text": "Damask Holdings"}, {"tag": "p", "text": "Damask Holdings was a clandestine financial group closely allied to the InterGalactic Banking Clan, which also acted as a lobbying and political pressure organization that involved itself in the affairs of many planets, both to exploit local resources—such as plasma—for financial gain, and to gain influence on a galactic scale as part of the secret Sith Grand Plan to topple the Galactic Republic. It also operated as a secret society, bringing together the galaxy's most influential beings for the yearly Gatherings on Sojourn, attended, at times, by the full presiding body of the Holdings steering committee. Damask Holdings was owned and expertly run by Magister Hego Damask, a Muun of the Damask clan who was secretly the Sith Lord Darth Plagueis. A dozen Muuns, including operating officer Larsh Hill, made up the group."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around the year 120 BBY, Damask Holdings acquired one of Harnaidan's most magnificent superspires. The company, though only recently founded, had left its enduring mark on the galaxy by 99 BBY."}, {"tag": "p", "text": "In 67 BBY, during that year's Gathering, members of the Subtext Mining corporation revealed to Damask that a massive plasma reserve had been discovered beneath the city of Theed on Naboo. Damask personally traveled to Naboo, seeking to establish a foothold on the world by striking a deal with the reformist party of monarchical candidate Bon Tapalo in the heated election season. He sought out the young noble who had released sensitive information to the Tapalo group: Palpatine, heir of House Palpatine, one of the conservative clans. Damask recruited the young Human as a spy, and later trained him as his Sith apprentice, bestowing upon him the name and title of \"Darth Sidious.\""}, {"tag": "p", "text": "Hego Damask continued to run the company until 52 BBY, when all of its guiding members except for Damask himself were killed in an attack at the Lodge of the Order of the Canted Circle during Larsh Hill's initiation ceremony. The group was not re-formed, and Damask, who was severely maimed in the attack, removed himself from galactic affairs to devote his time to the manipulation of midi-chlorians in his Aborah laboratory, although Sojourn Gatherings continued to be hosted until 43 BBY."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "In 32 BBY, Palpatine murdered Damask in his Coruscant penthouse. It remained unknown to the wider galaxy just what happened to Damask's substantial financial holdings, as the Banking Clan refused to release the relevant information.\nAfter his election to the office of Supreme Chancellor, and his own self-anointing as Sith overlord, Palpatine skillfully used Plagueis' vast assets in his gradual transformation of the Republic into the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}