{"url": "Damien_Tantrellius", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles from unlicensed sources", "Category:Actors", "Category:Humans", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Damien Tantrellius"}, {"tag": "p", "text": "Damien Tantrellius was a Jedi Knight who served during the Clone Wars. Following an incident that resulted in the death of future-Governor Zannen's wife, Tantrellius lost his memory, and subsequently took up a new career as an actor. This allowed him to escape the Great Jedi Purge, as even he was unaware of his identity and power. Tantrellius rose to fame playing the lead in Jedi Men From Baronis, and so he formed the Tantrellius Theatre Groupe."}, {"tag": "p", "text": "With his daughter, Plum, Yoh Podd and Annah Dublavviane, Tantrellius and his company of players eked out an existence on the canal world of Peekoine, in the mobile city of Landslasher-4. Though he did not know it, Tantrellius would hold his audiences in a trance-like state with the Force, adding to his performance. During the Galactic Civil War, Plum was briefly kidnapped by a swoop gang, but was rescued by Rebel Alliance agents."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The man who would come to be known as Damien Tantrellius was a Jedi Knight who served during the Clone Wars. During a particular battle, Tantrellius' actions resulted in the death of a woman married to future-Governor Zannen. The trauma surrounding the experience resulted in memory loss for Tantrellius, and he completely forgot about his Jedi heritage. He took on the name \"Damien Tantrellius,\" as he had no recollection of his former name either."}, {"tag": "h3", "text": "Tantrellius Theatre Groupe"}, {"tag": "p", "text": "Becoming an actor, Tantrellius formed the Tantrellius Theatre Groupe. He rose to fame on Bespin performing in Jedi Men From Baronis, playing, aptly enough, a Jedi Knight. Tantrellius also had a daughter, Plum, to look after. Plum deeply admired her father, and sought to follow in his footsteps as a thespian. Also in Tantrellius' acting troupe were Yoh Podd and Annah Dublavviane."}, {"tag": "p", "text": "At the conclusion of the Clone Wars, Palpatine made himself Emperor, transforming the Galactic Republic into an Empire. The Jedi were declared enemies of the state, and were summarily hunted down and executed. Tantrellius, in his new role as an actor, was able to evade death simply through ignorance, as most people did not know that he was in fact a Jedi, least of all himself. Relocating to Peekoine, Tantrellius performed at the Jediboh Theatre on Landslasher-4, a floating city that doubled as a canal cutter. Following the formation of the Alliance to Restore the Republic, Tantrellius reprised his role from Jedi Men from Baronis in the sequel, Two Jedi Men From Baronis. Requesting clearance from Peekoine's governor, none other than Zannen, Tantrellius participated in a particularly tense conversation with the Imperial over a meal. Following the discussion, Tantrellius was allowed to stage the play."}, {"tag": "p", "text": "He received rave reviews in the role from The Slasher Sun Times critic Rojene Eborsisk, who called the performance \"mesmerizing.\" Plum made her debut in Two Jedi Men From Baronis, playing the character of Leia to acclaim. During his performance, Tantrellius would inadvertently use the Force to captivate his audience, keeping them in an almost trance-like state. He would occasionally remember elements of his previous Jedi life, but would attribute the flashbacks to his immersion in the role."}, {"tag": "p", "text": "During a performance of Two Jedi Men From Baronis, Governor Zannen and his daughter, Yuma Zannen, were present. While on stage, Tantrellius was met by a group of agents from the Rebel Alliance, who informed him that Plum had gone missing. Deeply concerned, Tantrellius began searching through official channels for a ransom message, while sending the Rebels, as well as Plum's friend, Grree L'Tharr, and Podd to find his daughter. The Rebels returned with the information that Plum had been mistaken for Yuma Zannen. Yuma had arranged to be \"kidnapped\" by the criminal Gamusha's swoop gang, The Gutterwipes, in an effort for attention, but the plan had backfired."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tantrellius spent most of his time on the stage, even when there was no performance in progress. He was a deep thinker, although he was prone to panic in times of stress. He was admired by critics and colleagues alike, though his greatest fan was his own daughter, Plum. Tantrellius would immerse himself in his roles, so much so that he thought his subconscious was starting to believe that he actually was a Jedi. What complicated matters further was that he genuinely had a connection to the Force, and was a Jedi in the Galactic Republic's heyday."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Damien Tantrellius first appeared in William Herz's role playing adventure Peekoine Opera Blues, which was published in Space Gamer/Fantasy Gamer 88. In the story, Tantrellius serves as a supporting non-player character."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}