{"url": "Dams_Denna", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Dams Denna"}, {"tag": "p", "text": "Dams Denna was a diminutive male who lived on the planet Naboo and worked for the Theed Royal Palace as an animal trainer. During the celebration that followed the Battle of Naboo in 32 BBY, Denna helped guide falumpasets and kaadu ridden by members of the Gungan delegation during a parade in the city of Theed. Denna was a collector of Linn'con memorabilia."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By 32 BBY, the male Dams Denna was a respected animal trainer who lived on the planet Naboo, where he served as a beast handler for the Theed Royal Palace. During the victory parade that followed the Battle of Naboo, Denna took the reins of beasts such as falumpasets and kaadu that had been brought by the Gungan delegation as they joined their Human Naboo counterparts to celebrate their unified victory over the battle droid forces of the Trade Federation. Denna personally handled the kaadu ridden by the Gungan warrior Jar Jar Binks. When the Gungan became tangled in his kaadu's reins upon dismounting, Denna helped him free himself."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dams Denna was a skillful animal trainer and herd-master who was renowned for his talent at handling non-sentient beasts. He collected Linn'con memorabilia. During the celebration that followed the Battle of Naboo, the diminutive, fair-skinned humanoid had shoulder-length brown hair and wore a green jerkin, breeches, and boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The animal handler who appears in Star Wars: Episode I The Phantom Menace was played by Dan Madsen, one of several Star Wars fans and Lucasfilm-affiliated employees who were selected as extras for the 1999 film's final crowd scenes, overseen by the assistant second-unit director, Bernard Bellew. At the time, Madsen was the publisher of Star Wars Insider magazine and the president of the Official Star Wars Fan Club. Nearly a year before the film's release, a behind-the-scenes photograph of Madsen and fellow actor Kenny Baker published in Star Wars Insider 39 showed Madsen in his Theed costume. Of the fans and employees chosen to appear in The Phantom Menace, only Madsen's character appears clearly in the final motion picture. Nevertheless, Madsen's name does not appear in the movie's credits."}, {"tag": "p", "text": "The Naboo animal handler went unnamed until the release of Theed Palace Limited, a 2001 expansion to the Star Wars Customizable Card Game published by Decipher, Inc. The character's name, \"Dams Denna,\" is an anagram of \"Dan Madsen.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}