{"url": "Damutek", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Biological structures", "Category:Building types", "Category:Yuuzhan Vong technology"], "nodes": [{"tag": "h1", "text": "Damutek"}, {"tag": "p", "text": "A damutek was a type of organic building that was created and used by the Yuuzhan Vong."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "A damutek was a plant-like organism which was dropped from orbit onto a planet where it opened like a giant plant as it landed onto the world. Any structures present at the site of its landing were destroyed by powerful acids which were used to feed Yorik coral."}, {"tag": "p", "text": "Once this was complete, the damutek rooted itself into the ground where it continued to grow in size to the point where it became a major structure within a Yuuzhan Vong base, often two stories in height. The star-shaped trunk was wide enough to accommodate a variety of environments with some being reconfigured as bays connected to river canals, transformed into hangar bays or shaped into living structures. The roots themselves rooted into the earth where they extracted copious amounts of water for its own nourishment. This made it necessary for them to be planted at a location near a body of water."}, {"tag": "p", "text": "Intruders that entered the giant plant had to contend with membranes that closed their pathways as well as a poisonous gas that was emitted by the structure-sized organism. Certain individuals, however, managed to gain entry by calling out the password when touching the door organisms."}, {"tag": "p", "text": "At the heart of the damutek was a Succession pool which was used to process the wastes of its inhabitants. As such, these organisms functioned as houses for the Workers, offices for the Intendants, and laboratories for the Shapers. They also contained a brain which was used to track disruptions within its organic structure."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A number of damuteks were deployed onto Yavin 4 when the moon was conquered by the Yuuzhan Vong empire."}, {"tag": "p", "text": "After Coruscant was transformed into Yuuzhan'tar, a number of damuteks were present on the planet such as the Damutek of the Intendants."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}