{"url": "Dana_Cadwell", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Humans", "Category:Journalists"], "nodes": [{"tag": "h1", "text": "Dana Cadwell"}, {"tag": "p", "text": "Dana Cadwell was a Human female reporter on Gandle Ott, a planet located in the Kathol sector of the Outer Rim Territories. A noted figure on the planet, she worked primarily for the KatholNet NewsNet, as well as being TriNebulon News' planetary correspondent. In 8 ABY, Cadwell covered the arrival of the New Republic CR90 corvette FarStar to Gandle Ott. The FarStar—in pursuit of the former Imperial ruler of the Kathol sector, warlord Moff Kentor Sarne—visited the planet for several days, engaging in diplomatic ventures that Cadwell reported on. It was her hope that the story would be big enough news to earn her a position away from Gandle Ott."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dana Cadwell was a Human female reporter based on the planet Gandle Ott in the Kathol sector of the Outer Rim Territories. She worked for the NewsNet KatholNet, as well as being the planetary correspondent for TriNebulon News. Cadwell was a popular personality, and influential enough to be invited to notable parties and events, but longed to leave Gandle Ott and break into a larger news bureau outside of the Kathol sector."}, {"tag": "p", "text": "In 8 ABY, Moff Kentor Sarne, Imperial warlord of the Kathol sector, was forced to retreat from his capital on Kal'Shebbol by New Republic forces. Sarne fled to Gandle Ott, took on supplies and left with the majority of the planet's Imperial personnel, including the governor and defense force. The resulting power vacuum on Gandle Ott created confusion, with both Vice-Governor Marja Lang and General Herron Dade vying for control of the remaining government. Cadwell instantly saw that Sarne's retreat and the arrival of the New Republic in the Kathol sector was just the story she needed to get the attention of TriNebulon News."}, {"tag": "p", "text": "Shortly after Sarne's departure, the New Republic CR90 corvette FarStar arrived in orbit in pursuit of Sarne. When the FarStar landed at Montrol Spaceport, Cadwell was part of a large media presence that witnessed a delegation from the corvette meet with Acting-Governor Lang, Mayor Stanfeld Duffit, and Olaver Lansel, Gandle Ott's Imperial liaison. As the FarStar delegation progressed through the spaceport, Cadwell attempted to learn of the FarStar's mission by asking several questions regarding Moff Sarne, the rumor that he had exotic technology, and the New Republic's intentions toward Gandle Ott. The next day, Cadwell covered the Ceremonial Mushroom Cutting presided over by General Herron Dade, where Dade effectively declared their independence from the Empire and encouraged Gandle Ott to take control of its own future once more."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dana Cadwell had strawberry blonde hair, dressed in smart, subdued clothing and always carried the equipment she needed about her person. Street-smart and savvy, she was well-connected in Gandle Ott society, doggedly determined, and an investigative reporter capable of uncovering facts and hidden secrets. Cadwell's only loyalty was to herself, and getting a story was her top priority. She had a working knowledge of the way bureaucracy worked and an interest in planetary systems and cultures. She could operate a repulsorlift vehicle. Despite her status on Gandle Ott, Cadwell was desperate to attract the attention of a larger news agency and move to a planet closer to the center of the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dana Cadwell was introduced in Death Is Remotely Possible, the third RPG adventure in The DarkStryder Campaign published by West End Games in 1995. Cadwell can be used by the gamemaster to either help or hinder the player characters during their time on Gandle Ott. Since Cadwell is loyal to herself and her story above all else, she has no personal feelings either way about the FarStar's visit and her attitude towards the crew will be determined by the outcome of their first meeting. Cadwell can be used by the gamemaster to put the characters back on track, to get them out of trouble, or to misdirect them completely. As both an investigative reporter and a figure in Gandle Ott society, Cadwell can conceivably appear at any point in the adventure."}, {"tag": "p", "text": "Cadwell is mentioned in the following adventure, Shintel Downtime; during the events in the scenario, the FarStar becomes stranded in the Shintel system. Two options are available to the players; either to send their hyperdrive-equipped T-65 X-wing starfighters for help, or to cannibalize the X-wing's hyperdrives to repair the FarStar's engines temporarily and limp to the Tanquilla Beach shadowport. If the players chose to send their fighters back to Gandle Ott, then Cadwell accompanies a rescue cruiser back to Shintel to cover the story of how the New Republic starship became stranded and had to be assisted by Imperial forces. As Shintel Downtime assumes the players reach Tanquilla Beach by jury-rigging the engines, Cadwell's involvement in the adventure is presumed to have not happened."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}