{"url": "Dane_(bounty_hunter)", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dane  (bounty hunter)"}, {"tag": "p", "text": "Dane was a Human male Bounty hunter who was the brother of Floria."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dane and Floria were orphaned after the death of their parents. As they grew up, they worked at a cafe under the management of a cruel employer. Eventually, the two were saved from his service one day when they discovered that the man was a wanted criminal from a nearby planet. The two siblings tricked him into getting caught and were inspired to begin new careers as bounty hunters."}, {"tag": "p", "text": "During the Separatist Crisis, the siblings were hired by Granta Omega to capture Anakin Skywalker and Obi-Wan Kenobi while the Jedi participated in a training exercise on Ragoon VI. Accepting the job, Dane and Floria were able to board a cruiser which was on course to the planet Aaeton. Dane knew that the Jedi would deflect every blast from his automatic blasters. As the two prepare to engage the Jedi, the ship exploded a few minutes later from a sleeper bomb. Believing that their situation was too dangerous, Dane and Floria befriended the Jedi and explained that the two were in danger."}, {"tag": "p", "text": "Together with the Jedi, Dane and Floria saw that the Jedi were losing the battle against the Teleq and aided them in defeating them. Hoping to find out where Granta was, the Jedi persuaded the siblings to contact him and lie that the Jedi were captured and would meet up with him on Coruscant. The plan failed when the four were attacked by Hunti Pereg who was hired by Omega to take the job. After killing Pereg, the siblings and the Jedi take his ship and set course to Coruscant."}, {"tag": "p", "text": "Years later which led to the start of the Clone Wars, Dane and Floria gave up their career as bounty hunters since it was too dangerous for them. They later took employment as bodyguards for Samish Kash, leader of the planet, Delaluna. They later accompanied him to the planet Null to meet with Count Dooku, leader of the Confederacy of Independent Systems. However, when Samish was shot while attending a conference, Floria and Dane were accused of attempting to assassinate him. Luckily for them, they were reunited with Anakin Skywalker and Obi-Wan Kenobi on Null, and the Jedi repaid Dane and Floria's previous assistance by clearing the pair of the charges against them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}