{"url": "Danetta_Pitta", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Etti", "Category:Grand Admirals of the Galactic Empire", "Category:Imperial warlords", "Category:Males", "Category:Near-Human Hybrids", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Danetta Pitta"}, {"tag": "p", "text": "Danetta Pitta was a Near-Human who served in the Imperial Navy. A rabid xenophobe, Pitta was one of the fiercest champions of Human High Culture in the Galactic Empire, and he would cite his zeal for the cause to hide the fact that he was not quite Human. Pitta's bigotry was such that even the strongest advocates of humanocentrism kept their distance from him. During the New Year's Fete of 2 BBY, Pitta was promoted to the newly formed rank of Grand Admiral, along with eleven other officers. He then set out on a campaign along the Outer Rim Territories, depopulating non-Human worlds along the way."}, {"tag": "p", "text": "In the wake of Emperor Palpatine's death at the Battle of Endor in 4 ABY, Pitta took command of a Torpedo Sphere and became the unofficial protector of the Corellian sector after bribing the local diktat. Pitta's position, however, was challenged by one of his fellow Grand Admirals—Josef Grunger, who was hoping to move against Imperial Center itself. Grunger moved his armada into the sector, prompting Pitta to meet him in the Battle of Tralus. Although Pitta gained the upper hand during the battle, Grunger decided to end the conflict by ramming his Super Star Destroyer, the Aggressor, into Pitta's Torpedo Sphere, killing both Grand Admirals as a result."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Promotion"}, {"tag": "p", "text": "Danetta Pitta, a Near-Human male, was a renowned bigot and xenophobe who served in the Imperial Navy. Pitta kept his mixed ancestry, which included both a Borneck and an Etti, a secret by becoming one of the most zealous defenders of Human High Culture in the Galactic Empire. He emphasized this by constantly scrutinizing the pedigree of others—even officials from the Commission for the Preservation of the New Order balked at his fanaticism."}, {"tag": "p", "text": "Two years before the Battle of Yavin, Pitta, a New Order zealot known only for the ferocity of his politics, was selected—along with eleven others, among them Demetrius Zaarin, Ishin-Il-Raz, and Martio Batch—to be promoted to the newly created rank of Grand Admiral. The promotion was an elaborate ceremony that took place during a New Year's Fete, and was presided over by Emperor Palpatine himself. Pitta's prejudices made him ideal for the task of the Empire's Outer Rim Territories expansion. As a result, he was given command of three dungeon ships: the Apocahk, the Angrix, and the Azgoghk. With them, Pitta tore through the Outer Rim, depopulating non-Human worlds, and either sterilizing or enslaving their respective populaces."}, {"tag": "h3", "text": "Protector of Corellia"}, {"tag": "p", "text": "In the wake of the Emperor's death at the Battle of Endor in 4 ABY, Pitta used the considerable wealth at his disposal to bribe the Corellian diktat, and install himself as the unofficial protector of the Corellian sector. In his new role of authority, Pitta was able to commandeer a Torpedo Sphere for himself. However, his holdings and position were contested by fellow Grand Admiral Josef Grunger. Grunger was planning to move against Imperial Center, which was under the authority of Director Ysanne Isard, and in preparation, he had his armada move into the Corellian sector in 5 ABY. At Tralus, Pitta's forces battled Grunger's for control of the Corellian sector. Through ingenious use of his Torpedo Sphere, Pitta was able to decimate Grunger's armada. Grunger, however, chose not to accept defeat, and rammed his Super Star Destroyer, the Aggressor, into Pitta's Torpedo Sphere, destroying both ships and resulting in the deaths of both Grand Admirals."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Defined by his xenophobia and bigotry, Danetta Pitta immersed himself in Human High Culture to compensate and mask his own lack of racial purity. He took his beliefs to such extremes that he was disliked amongst organizations that were dedicated to Human supremacy, such as COMPNOR. He did not, however, appreciate the irony of being such a rabid humanocentric, despite being only Near-Human himself. His convictions dovetailed with his work, and he was very thorough when going about the depopulation of Outer Rim worlds, even going so far as to have vivisection performed on his captives. Pitta was also a skilled tactician, as he demonstrated when battling fellow Grand Admiral Grunger. As personal armament, Pitta carried a FWG-5 flechette pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Pitta was first mentioned in The Essential Chronology, which was published in 2000 and written by Kevin J. Anderson and Daniel Wallace. Three years later, he was profiled in the article Who's Who: Imperial Grand Admirals, which was published in Star Wars Insider 66 and written by Wallace and Abel G. Peña. The article provided most of the character's biographical history, including his first name and the only artistic depiction of him to date. Pitta was later mentioned in the successor to The Essential Chronology, 2005's The New Essential Chronology, as well as 2008's The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "The Who's Who article, originally entitled Dirty Dozen: The Imperial Grand Admirals, was meant to be published in Star Wars Gamer magazine before that publication ended. The original manuscript contained a greater deal of information about Pitta and included roleplaying game statistics. Amongst the deleted information was the name of Pitta's flagship, the Impenetrable, as well as greater elaboration on Pitta's bigotry, his inspiration for moving to Corellia after the Battle of Endor, and even the source of his considerable wealth."}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "Among those who had their pedigree scrutinized by Pitta was fellow Grand Admiral Miltin Takel. Although Pitta was originally sent to the Outer Rim by Palpatine to pacify the outlying alien worlds, he was convinced he could do much more than that, and he requisitioned three outdated dungeon ships with which to carry out his work. Under Pitta's command, the ships were able to depopulate entire cities within a day. Any non-Humans not executed for lack of performance were vivisected in a series of experiments. As he blazed a trail through the Outer Rim Territories, Pitta accumulated considerable wealth in plunder. Following Palpatine's death, Pitta established his own warlord kingdom out beyond Hutt Space. When it became evident that Ysanne Isard's hold on Imperial Center was tenuous, he moved his forces to the Corellian sector, where a massive Torpedo Sphere was reportedly undergoing construction at the local shipyards. While stationed in the Corellian sector, he constantly dreamed of bringing his prison ships in to rid the sector of its native non-Humans, such as the Drall, the Selonians, and the Nosaurians."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}