{"url": "Dangerous_Business", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "Dangerous Business"}, {"tag": "p", "text": "\"Dangerous Business\" is the thirteenth episode of Star Wars Resistance Season One. It aired on January 20, 2019 on Disney Channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "In exchange for parts, Kaz agrees to watch Flix and Orka's shop. But things take a deadly turn when a mysterious customer arrives."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A better mechanic"}, {"tag": "p", "text": "The episode opens with a speagull flying over the sea around the Colossus as the sun rises. Jarek Yeager apologizes for waking the crew up early and tells them that the Fireball won't fix itself. Tam Ryvora complains about having to constantly repair the Fireball because Kazuda Xiono leaves the ship in a broken state whenever he flies it. Yeager tells her to stop complaining and to focus on installing the new GX engine. Neeku Vozo notices that the new engine has been installed. Tam agrees and finds that the repulsorlifts and injectors have already been installed."}, {"tag": "p", "text": "They find that Kaz has installed these parts. Kaz says that he fixed the ship because Tam wanted to fly the ship this afternoon. Tam compliments his efforts but tells Kaz he needs to install the coupling the right way. She thanks Kaz while Neeku adds that his skills are greatly improving. Yeager asks where he got the parts."}, {"tag": "p", "text": "Kaz tells them that he made a deal with Flix and Orka in exchange for watching their stall for the day. Neeku says that is good, but cautions Kaz not to blow up the stall by accident. Tam quips about Neeku gaining a sense of humor, but he says he was being serious. Yeager praises Kaz for his initiative but asks if he is taking more than he can handle. Kaz leaves with BB-8 and Yeager wishes them good luck because they will need it."}, {"tag": "h3", "text": "The holiday shift"}, {"tag": "p", "text": "At the Office of Acquisitions, Flix tells Orka to hurry up. Orka tells Flix not to hurry him up because he has long legs and moves faster. Just then, Kaz enters the store. Orka thanks Kaz for coming but Flix says that Kaz technically owes them because they gave him the parts. Kaz asks where they are going. Orka replies that it is a long story because they are visiting his mother. He tells Kaz that minding the store is simple and Orka explains the store process and adds that the customer is always right. They tell him to always take the customer's money."}, {"tag": "p", "text": "Flix and Orka also warn Kaz not to wiggle his finger at their pet Gorg Bitey because he will think it is food. Orka warns Kaz not to sell anything from the backroom with Flix adding that it is either a weapon or something dangerously destructive, and that it is probably both. They warn Kaz to stay away from the backroom. Kaz says he can handle it as easily as Valerian pie. Orka says they will be back tonight before the two leave. Their DUM-series pit droid G-LN carries their luggage. Kaz waves his hand but Bitey bites his finger, causing him to squeal in pain."}, {"tag": "p", "text": "Kaz tells BB-8 that running this place won't be so hard especially with the droid as his assistant. BB-8 shakes his head and says people don't like him. Kaz reassures BB-8 he is good with customers and that he can find some parts that can be used for the Fireball. Just then, Jooks enters the shop and orders Premium Deluxe D90 Droid Oil. Kaz rummages the shop for the premium oil but BB-8 finds it for him. After serving the customer, Kaz searches the datapad for spare parts for the Fireball."}, {"tag": "h3", "text": "A suspicious customer"}, {"tag": "p", "text": "The second customer is a hulking brown alien who coughs. When Kaz welcomes him, the alien slams his fist on the counter and angrily complains that he thought Acquisitions was closed today. Kaz confirms it is open. The alien asks who he is and Kaz identifies himself as Flix and Orka's assistant. The alien introduces himself as Teroj Kee and says he is with the Mining Guild and ordered a phase connector several weeks ago."}, {"tag": "p", "text": "When Kaz asks, Teroj says that it is a very hard to obtain part that is very expensive and rare. Kaz checks the stock and finds that Acquisitions did not receive an order from Teroj or the Mining Guild. He finds the shop has a phase connector but that it is in the backroom and has already been sold to a mining colony offworld. Teroj demands the phase connector but Kaz counters that it is not for sale."}, {"tag": "p", "text": "When Teroj wiggles his finger, Bitey bites him before the alien can offer him a prize. Teroj screams in pain and says the thing almost bit his arm off. Kaz warns him not to wiggle his finger around Bitey because the Gorg things it is food. As compensation, Kaz asks if he can sell him something else."}, {"tag": "p", "text": "Teroj requests three tool kits, ten lenses, and a crate of those connector rods. Kaz says no problem and tells BB-8 that he thinks it is going to be a huge sale and that Flix and Orka will be pleased. Teroj requests that Kaz deliver the items to his locker at Loading Dock 23 and claims it will be easier that way."}, {"tag": "h3", "text": "Ambush and a heist"}, {"tag": "p", "text": "Later, Kaz prepares to leave for Loading Dock 23 with the goods on a hoversled. Kaz tells BB-8 to watch the store while he is gone. BB-8 warns that the guy was shady but Kaz remarks that there is something shady about everyone here. He tells BB-8 that he is going to find out what this Teroj Kee is up to. Kaz promises he will be back soon."}, {"tag": "p", "text": "Kaz arrives at Loading Dock 23 and loads the goods into a cargo container. Before he can leave, he is cornered by Teroj Kee who points his blaster at him. Kaz protests that he does not have any credits and claims that he is doing this job as a favor. Teroj says it is nothing personal and it is just business before locking Kaz inside the container. Kaz bangs on the doors of the container but finds it locked. As a crane lifts the container, he contacts BB-8 by comlink."}, {"tag": "p", "text": "BB-8 fends off Bitey with his arc welder. Kaz tells BB-8 that he has been locked into a cargo container in Loading Dock 23. BB-8 races there with Bitey following but the droid stings the Gorg. Shortly later, Teroj Kee forces his way inside the shop with a blaster. BB-8 hides while Teroj uses a blaster to shoot through the control panel outside the backroom. He laughs as he views the phase connector, remarking it will make him rich."}, {"tag": "p", "text": "The crane operator Glem is listening to music and does not hear Kaz's cries for help. He contacts BB-8 in his comlink as the trapdoor below the crane lowers to reveal the sea below. Back at Acquisitions, BB-8 attacks Teroj Kee with his arc welder, stinging him several times. BB-8 leads him on a chase through the store and hurls objects at him. BB-8 also uses his grappling hook to swing himself at Teroj Kee but the alien grabs him. Teroj Kee traps BB-8 by toppling a cupboard on top of him against a wall."}, {"tag": "p", "text": "Inside the crate, Kaz funds a welder and a set of lens and proceeds to burn the lock. Kaz manages to unlock the crate but the crane drops it into the sea. Glem looks up to see Kaz holding on to the crane. He asks Kaz what he is doing up there and Kaz in return asks what he is doing down there. Glem replies that he is working but Kaz replies that he is working up there and tells him to get back to work."}, {"tag": "h3", "text": "Pursuing Teroj Kee"}, {"tag": "p", "text": "Kaz contacts BB-8 who informs him that Teroj Kee stole the phase connector. Kaz is about to ask BB-8 to help him find Teroj's ship but Kaz spots Teroj carting the phase connector away. Kaz follows Teroj into a ship. He tells BB-8 not to worry because he has been in a lot worse situations than this. While hiding among the crates, Kaz spots three stormtroopers and realizes that Teroj is working for the First Order."}, {"tag": "p", "text": "Kaz plans to recover the phase connector but encounters Bitey, who bites his finger. Kaz struggles to muffle his scream. Teroj tells the stormtroopers that they have what they came for and not to stay for longer than necessary. One of the stormtrooper says let's get ready for launch. Kaz can only say no as the cargo bay is sealed and the freighter lifts off. He tells Bitey that this is not good at all. Kaz panics as the ship departs the Colossus."}, {"tag": "h3", "text": "Bringing the ship down"}, {"tag": "p", "text": "Kaz realizes that he has to bring the ship down with the phase generator but gets bitten by Bitey again. Kaz sneaks into the engine room and waits for the stormtrooper to leave. He deduces that the power coupling leads to the electrode systems and that if he kills the power he can bring the whole ship down. Kaz is unable to disable the cables and instead baits Bitey into biting them."}, {"tag": "p", "text": "Teroj and the stormtroopers find Bitey chewing on the power cables and tell him to get away. However, Bitey bites deeper, causing the engines to overload and explode. The ship begins to descend into the seas. While Teroj and the stormtroopers try to find their way out, Kaz also struggles to avoid falling cargo. Teroj fires his blaster pistol at Bitey but the gorg dodges him. Teroj shoots at one of the power circuits, causing a second engine to blow up."}, {"tag": "p", "text": "As the ship lists, Teroj and the stormtroopers try to secure the phase connector but are knocked around by the unsecured cargo. Kaz retrieves Bitey and runs to an exit. On the way, the two are separated by a loose piece of cargo. Kaz reaches the corridor and manages to escape on an escape pod. Teroj and two of the remaining stormtroopers also flee into a pod before the ship crashes into the sea and explodes."}, {"tag": "h3", "text": "Scoring goals for the Resistance"}, {"tag": "p", "text": "As Kaz flies away, he is pleased that no one is getting the phase connector but is upset that Bitey did not make it. He comforts himself with the fact that Bitey gave his life for the Resistance. However, Bitey surfaces on the windscreen and Kaz is delighted to see him. Kaz flies the escape pod back to the Colossus."}, {"tag": "p", "text": "Meanwhile, Teroj is contacted by Commander Pyre. He tells Teroj that he failed to secure the phase connector and that his mission was sabotaged and the goods were destroyed. Pyre says that is unfortunate and Captain Phasma will not be pleased. He orders Teroj to report back at once. Teroj sighs \"that there are days and there are dazed\" before flying off with the other two stormtroopers in escape pods."}, {"tag": "h3", "text": "A messy homecoming"}, {"tag": "p", "text": "Back at the Colossus, Kaz thanks Bitey for his help and returns to the Office of Acquisitions only to find it in a mess. Kaz is horrified that the place is in a mess. He finds BB-8 trapped in a tight corner. Kaz thinks they have time to clean up before Flix and Orka return. However, Bitey tips several crates over. Just then, Flix and Orka come through the door chatting about Flix's father and Gungans not having feathers."}, {"tag": "p", "text": "Orka is shocked to see their shop in the mess. Kaz says he can explain and Orka says he better or Flix is going to kick him into next week. Kaz says it is not his fault. Flix says that we were only gone for a day and that it is appalling they come back to this. Kaz tells them that some guy who knew they had a phase connector came in here and stole it."}, {"tag": "p", "text": "Orka asks if the man claimed to be a member of the Mining Guild and called himself Teroj Kee. Kaz confirms this was the case and says that he tried to get the phase connector back but he had to bring the entire ship down in the process. Orka praises Kaz for destroying the ship and its cargo rather than letting Teroj escape with their merchandise. Orka explains that Teroj has been trying to steal from them for years while Flix adds that no one should leave without paying for it. Orka realizes that Teroj must have been monitoring their comlink to know they were going offworld. Orka dismisses Teroj as a \"slimy womp rat.\""}, {"tag": "p", "text": "When Kaz asks what is a phase connector, Flix tells him that they are used to crack open asteroids and planetoids for heavy mining. Orka adds that they are used for drilling and excavating. Kaz says this is good to know while BB-8 shakes his head. Orka says that they will see Kaz early tomorrow morning for work. Flix quips that nobody should get away without paying for it. Orka says that Kaz has to make amends for his damage or repay his debt."}, {"tag": "h3", "text": "The gathering storm"}, {"tag": "p", "text": "Kaz sighs in agreement. After leaving, he tells BB-8 he will send a message to Poe and that General Organa will want to know about these things. He asks BB-8 if he thinks that the First Order are using it to drill for more dedlanite or something else. Kaz tells BB-8 he doesn't know and thinks this is bad."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}