{"url": "Danielle_Kieran", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Corellians", "Category:Females", "Category:House of Solo", "Category:Humans", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Danielle Kieran"}, {"tag": "p", "text": "Danielle Kieran, known to her friends as Dani, was a hot-shot Corellian pilot, who believed herself to be Han Solo's illegitimate daughter."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Growing up without a father, the young Dani discovered that her mother had been close with the young Han Solo, and she became quietly convinced that she had found the truth about her parentage. All Corellian spacers looked and acted somewhat alike, and Dani deliberately imitated her supposed father's style of dress and behavior; but the strange sense of recognition strangers sometimes felt when they encountered her may have hinted that there was something more than self-belief and hero-worship behind her posturing."}, {"tag": "p", "text": "As soon as she was old enough, Dani borrowed money from Talon Karrde to buy herself a YT-1300 freighter of her own, the Century Hawk. By the time she was seventeen, she was flying her ship out of Crystal Web Station, looking for a chance to prove herself as a pilot. Although she had told no-one of her suspicions about her parentage, she wanted to be a daughter Han Solo would be proud of. To this end, she had planned to fly the Kessel Run, not to beat Solo's time (as that would be impossible as far as she was concerned) but to prove herself as his daughter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dani Kieran is one of a number of characters introduced in articles in the RPG magazine Polyhedron in the 1990s, co-written by Bill Slavicsek of West End Games and intended to be used in conjunction with the official material. Although their canonical status is ambiguous, these pieces are regarded as more reliable than other apocrypha, and material originating in them has reappeared in more recent canon sources—such as Merili and the Church of the Dark Side."}, {"tag": "h2", "text": "Appearances"}]}