{"url": "Dannl_Faytonni/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Con artists", "Category:Corellians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dannl Faytonni"}, {"tag": "p", "text": "Dannl Faytonni was a male Human from Corellia. Although he originally aspired to serve the Republic as an officer, he was conned into fronting a phony spice mine by a changeling. On the run from the law, with his hopes of working in law enforcement dashed, Faytonni decided to make a living as a con artist. Teaming up with his inventive friend Achk Med-Beq, Faytonni set off across the galaxy, gambling and conning his way to Coruscant."}, {"tag": "p", "text": "Upon reaching the galactic capital, the partners in crime were arrested and detained at CoCo Penitentiary, but not for long. Faytonni and Med-Beq made a newsworthy escape from the prison, and set up shop in the Outlander Club, where they constantly hunted and pecked for \"marks.\" They found several, in the form of Oakie Dokes and Magaloof, and were able to successfully pull off several confidence tricks."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Aspirations"}, {"tag": "p", "text": "A Corellian, Dannl Faytonni had initially dreamed of serving as an officer in the Galactic Republic, but he soon discovered he was not suited for the role. He was particularly adept at playing sabacc, and he had a way with women that would have been frowned upon in the Judicials. His suave nature, however, would prove to be his downfall, as he fell for a changeling who was able to scam him into fronting a spice-mining racket. Though he was able to evade the authorities, he found himself the target of several parties, including the Corellian Security Force."}, {"tag": "h3", "text": "Confidence trickster"}, {"tag": "p", "text": "Hoping to escape Corellia, Faytonni enlisted the services of his friend Achk Med-Beq, a fellow con artist. The extraction was a success, and though his original dream of being an officer had been ruined, Faytonni realized that there was a living to be made in the world of gambling and confidence tricks. After several cons and misadventures, the pair found themselves on Coruscant, and, soon enough, in the Moderate Security Ward of CoCo Penitentiary. Imprisonment failed to stop Faytonni and Med-Beq, however, as the pair were able to steal away and con themselves a ride on a laundry speeder. Though the jailbreak made news, the pair were not apprehended."}, {"tag": "p", "text": "Eventually, the pair were able to win two Republic Security Force uniforms through their gambling exploits. Masquerading as a lieutenant, Faytonni joined Med-Beq at the Outlander Club, seeking profitable marks, such as the woman called Whimper Save and the Twi'lek female Ayy Vida. One target was Oakie Dokes, of the Swokes Swokes species. The pair had seen Dokes' macabre art, and approached her with an offer of sponsoring her artistic endeavors. Though the Swokes Swokes was apprehensive, she accepted their offer. Despite the fact that Faytonni and Med-Beq believed themselves to hold the upper hand, Dokes was actually aware that they were likely attempting to con her. One night in 22 BBY, Faytonni and Med-Beq were witness to bounty hunter Zam Wesell's violent arrest. Jedi Knight Obi-Wan Kenobi, having tracked Wesell into the Outlander Club, sliced off her arm with his lightsaber when she attempted to shoot him, before taking her outside for questioning."}, {"tag": "p", "text": "Using their Republic disguises, the pair then decided to con the aspiring Leffingite criminal, Magaloof. Med-Beq pretended to take Magaloof under his wing, and together they pulled off several heists with modest returns. Faytonni never met Magaloof during these operations, in the hope that they would be able to con the Leffingite out of a considerable amount of valuables. Med-Beq sent Magaloof to CoCo Town, where he was to rob a jewelry store. As Magaloof made his getaway, Faytonni, utilizing his new disguise, \"arrested\" Magaloof, confiscated the stolen jewels, and then let the Leffingite off with a strong warning. Their operation a success, Faytonni and Med-Beq departed the area swiftly."}, {"tag": "p", "text": "During the Clone Wars, Faytonni and Med-Beq planned to scam a dowager out of her money at the Galactic Senate. The gambit failed, and their target decided to call the Senate Guard. As they were chased by Senate Commandos away from the Senate itself, Faytonni decided that they would need to leave the planet's surface and escape to Coruscant's orbit. They took a speeder to a landing platform on which Senator Padmé Amidala's J-type star skiff was located. The skiff was being prepared for takeoff by Amidala's protocol droid, C-3PO, and Representative Jar Jar Binks."}, {"tag": "p", "text": "As the pair were wearing their false uniforms, they told C-3PO and Binks that they were commandeering the skiff for \"government business,\" before Faytonni instructed the droid to finish his preparations. Entering the cockpit, C-3PO prepared to disengage the ship's autopilot, before the landing platform, and the ship, were suddenly flipped upside-down due to an error made by Binks in his preparations. The Gungan righted the platform, and Faytonni hurriedly beckoned Med-Beq onto the ship once the droid had exited, as the last thing the pair wanted was more attention. They took off, but Med-Beq quickly noticed that the autopilot was still on. What the pair did not realize was that the autopilot was taking them directly back to the Senate. Several years later, shortly after the Battle of Coruscant, Faytonni attended the Galaxies Opera House, this time wearing a captain's uniform, indicating a \"promotion.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite the fact that he had hoped to become a respectable officer in the Republic, Faytonni's nature prevented him from following that course. His suave way with women placed him into an unfortunate circumstance and would prove to be the downfall of his Judicial career, but he was able to recognize and acknowledge the skill that had placed him in that position. Pursuing a career as a con-man with the more inventive Med-Beq, Faytonni's skill at gambling, combined with his charm, made him a success in his line of work."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dannl Faytonni first appeared in Star Wars: Episode II Attack of the Clones, though a previous reference to the character had been made in HoloNet News. The character was portrayed by Anthony Daniels, the actor who played C-3PO in all the Star Wars films. Daniels' cameo was among the many in the Outlander Club sequence, and the character's name was a tuckerization of his own. Daniels devised the character's backstory in part, with George Lucas suggesting that Oakie Dokes was his date. Daniels reprised the role for 2005's Star Wars: Episode III Revenge of the Sith. In 2008, Faytonni appeared in the Pablo Hidalgo–penned The Clone Wars: Departure, in which he encountered C-3PO, Daniels' other character. Faytonni also received a mention in the Classic Moment feature of the 2011 magazine Star Wars Insider 125, which misspelled his name as \"Dannyl Faytonni.\" He was made into an action figure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}