{"url": "12-4C-41%27s_droid_revolt", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battle stubs", "Category:Battles in Hutt Space", "Category:Droid revolts"], "nodes": [{"tag": "h1", "text": "12-4C-41's droid revolt"}, {"tag": "p", "text": "12-4C-41's Droid revolt was an event that happened in 0 ABY. In it, 12-4C-41's Droid Army rose up against its oppressors in the hope of gaining galactic domination."}, {"tag": "h2", "text": "Assault on the Decimator"}, {"tag": "p", "text": "The Victory I-class Star Destroyer Decimator entered the Kleeva system, awaiting the delivery of a new shipment of droids from Boonda the Hutt. Boonda, however, woke up to find his droids attempting to kill him. The corpulent Hutt, panicked, escaped his would-be murderers using secret escape routes. The droids, led by 12-4C-41 (also known as Wuntoo), prepared to lead an assault on the Decimator, which they planned to capture and take to Vactooine, where they hoped to take over droid production."}, {"tag": "p", "text": "In the Decimator's loading bay, the droids were inspected by Captain Pelvin and Trooper 1219, but upon unloadng, Wuntoo attacked the Imperials, and his droid lackeys started a fire on the deck. Admiral Groot believed this to be a machination of Boonda, and ordered an attack on the Hutt's facility. He, along with Pelvin and Gammat Squad, were able to escape the Decimator, which was quickly overrun by the renegade droids. They are then attacked by droid-piloted TIEs while approaching Boonda's Moon, and the Admiral is injured. Upon landing, the group was attacked by Boonda, but one of the troopers convinced him that they meant no harm. When Boonda discovered that the Imperials are not the ones who have caused the droids to revolt, he realizes that he needs to prove his innocence, and helps the troopers to destroy his own factory."}, {"tag": "p", "text": "Before leaving, the Decimator picked up what was left of the factory. Though Boonda believed that there was nothing of worth within, Wuntoo had a cadre of specially designed battle droids that he had been keeping in reserve. Storing them aboard the Decimator, Wuntoo set course for Tatooine."}, {"tag": "h2", "text": "Appearances"}]}