{"url": "Dantooine_Incursion", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Battles of Dantooine", "Category:Battles of the Third Galactic War"], "nodes": [{"tag": "h1", "text": "Dantooine Incursion"}, {"tag": "p", "text": "The Dantooine Incursion was an engagement between the reconstituted Sith Empire and the Galactic Republic during the Third Galactic War, occurring around 3627 BBY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During a third galactic conflict between Galactic Republic and Sith Empire, the Republic planet Dantooine was positioned in the edge of the Sith Empire's territory. It served as an ideal staging area for Republic Navy ships travelling to the front lines."}, {"tag": "p", "text": "Seeing its threat, the Sith Empire sought to attack Dantooine but were incapable of breaking the Republic's defenses in a direct assault. Darth Xarion, leader of Sith Intelligence and member of the Empire's ruling Dark Council, devised a plan for this purpose and hired the pirate group Nova Blades to attack the planet from within the Republic's own space."}, {"tag": "p", "text": "The Colonel Lenora Trazen, part of the Four-Hundred-Twenty-Fifth Special Infantry, was assigned by Darth Malgus to lead the Empire's covert forces on the planet, as she was a strong advocate for destabilizing Dantooine."}, {"tag": "p", "text": "By 3627 BBY, the Republic garrison on the planet was led by Major Vindo, with support from the Jedi Master Zai-Uram."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Nova Blades' assault was relentless and caught the planet's garrison off-guard. During the chaos, the Empire was able to infiltrate their own elite force and establish a ground base. With the pirates being unable to conquer the planet alone, the Imperial forces provided the needed manpower for both to wreak havoc across Dantooine."}, {"tag": "p", "text": "As the incursion raged, the Nova Blades became more focused on plundering everything on the planet, regardless of faction affiliation which caused the pirates to start attacking Imperial forces."}, {"tag": "p", "text": "Later on, The Commander of the Eternal Alliance arrived on Dantooine to assist the efforts of the Galactic Republic."}, {"tag": "p", "text": "Meanwhile, Lieutenant Yarvok of the Nova Blades seized control of the Dantooine Power Station and asked for 15 million credits in exchange for the reactor. The power station was quickly besieged by Republic forces and a spacer would come to eliminate Yarvok and clear the building of Nova Blades."}, {"tag": "p", "text": "The pirates deployed a prototype assault walker which they had stolen from a weapons-testing facility on Balmorra. A spacer was tasked to destroy the experimental vehicle before it could fall into the hands of either the Republic or Empire."}, {"tag": "p", "text": "Nova Blades were holding slave auctions for selling those captured during their pillaging. One of such was guarded by the infamous exoboar Hugo and terminated by an adventurous spacer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}