{"url": "Danuta", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Danuta locations", "Category:Galactic Empire planets", "Category:Halla sector planets", "Category:New Republic planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Danuta"}, {"tag": "p", "text": "Danuta was a dull, barren brown planet in the Colavas system, thinly populated mostly by miners and hardscrabble farmers. Trid was the planet's de facto capital."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The primary population was the Hutts during the last days of the Old Republic, but later the Galactic Empire converted it to a client of the Brodsport Mining Corporation. Danuta was not notable, aside from its function as a stopover on one of the many hyperspace routes leading to Kessel. However, the city of Trid did have a B'omarr Order Temple."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, the Imperial garrison on the outskirts of Trid was expanded into a full military installment, home to a sprawling yet secret research facility visited by the Imperial Security Bureau and scientists, such as Bevel Lemelisk. A partial set of plans to the first Death Star was hidden there by Atour Riten."}, {"tag": "p", "text": "The curious visits tipped off a Rebel sympathizer, who in turn informed the Alliance. Despite her reservations, Mon Mothma organized an assault and sent defector mercenary Kyle Katarn to acquire the schematics."}, {"tag": "p", "text": "Striking from a hidden base, the Rebel Alliance attacked the Imperial facility with starships and soldiers while Katarn would proceed with his mission to visit the place where the Death Star plans were hidden."}, {"tag": "p", "text": "The presence of Imperial special-forces operative Meck Odom at the base was a small complication for Katarn, as the two were once best friends at the academy on Carida. Kyle however was able to convince Odom to assist the Alliance, though Odom's efforts failed to decrease the difficulty of the mission. Nevertheless, Katarn managed to single-handedly infiltrate the base, steal the plans, and deliver them to the Alliance, all with inexplicable ease."}, {"tag": "p", "text": "The research facility then fell into disuse, but within a few years, Danuta experienced an economic boom, benefiting from the growing prominence of its neighbor Bimmisaari. When the Bimms joined the New Republic, Danuta followed suit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Danuta is mentioned in the alternative ending in Star Wars: Jedi Knight: Dark Forces II as the source of a new Rebellion against the Empire now ruled by Kyle Katarn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}