{"url": "Danyawarra", "categories": ["Category:Legends articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Jedi Commanders", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Danyawarra"}, {"tag": "p", "text": "Danyawarra was a Jedi Padawan who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars. During the Separatist Crisis, Danyawarra was the apprentice of Jedi Master Ludwin Katarkus."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive, Danyawarra began training in the ways of the Force under the tenets of the Jedi Order. After graduating from the Order's academy, Danyawarra was selected as a Padawan learner by Jedi Master Ludwin Katarkus."}, {"tag": "p", "text": "In 23 BBY, the Jedi High Council assigned Master Katarkus to mediate the ongoing Virgillian Civil War between the Virgillian Free Alignment and the Aristocracy. Consisting of two Master-Padawan teams, the diplomatic envoy was made up of Katarkus and Danyawarra, and Master Everen Ettene and Halagad Ventor. As the shuttle carrying the Jedi envoy entered Virgillia 7's orbit and touched down on the planet's surface, it was attacked by terrorists and destroyed. After receiving no word from the diplomatic team for three months, the High Council announced that it presumed the Jedi dead and would be holding memorial services for them within the Coruscant Jedi Temple's walls."}, {"tag": "p", "text": "While the Clone Wars overshadowed this loss, both Danyawarra and Ventor did reappear and rejoin the Order, serving as commander and general respectively in the Grand Army of the Republic. As a commander, Danyawarra was placed in command of the 101st Regiment, commanding well over 2,000 soldiers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Danyawarra's only appearance, neither gender nor species is given."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}