{"url": "Dapp", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Criminals", "Category:Humans", "Category:Males", "Category:Trade Spine League members"], "nodes": [{"tag": "h1", "text": "Dapp"}, {"tag": "p", "text": "Dapp, known by his street name \"Happy\" Dapp, was a human male gangster who operated on the planet Burnin Konn during the Galactic Empire's Iron Blockade of the Anoat sector."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dapp, commonly known as \"Happy\" Dapp, was a male human who worked as a gangster on the small mining planet Burnin Konn during the Galactic Empire's Iron Blockade of the Anoat sector. He hired Riley and her sibling to transport a shipment of synthetic kyber crystals to him on Burnin Konn, paying half in advance for the job; however, the smuggler was forced to destroy the crystals to avoid an Imperial contraband sweep. Dapp's Zabrak bodyguard Tryken confronted the smuggler as the young criminal tried to escape through a set of mine shafts, but was stunned after attacking the smuggler. Dapp himself then confronted the smuggler, complaining about what had happened to Tryken and that he had lost a large amount of credits due to the destruction of the crystals. The smuggler managed to convince Dapp that they could repay the debt through work, and Dapp told them to meet him later at the Carbon Score Cantina."}, {"tag": "p", "text": "Dapp convened with Tryken, Riley, and the smuggler at the cantina, where Riley and her sibling convinced him to discuss his next job. Dapp asked Tryken to train the smuggler and then requested that the smuggler recover the cargo of several ships that had been shot down by the blockade. The first vessel was the Mother of Pearl, which had been shot down in the territory of the criminal Brother Claw Gang. The smuggler successfully retrieved the ship's cargo and returned it to Dapp, who then sent the individual to take the cargo of the downed ship Cruel Mistress from the South Sector Sinners criminal gang. Once the smuggler had brought in the second set of cargo, Dapp sent them on one final mission to claim the cargo of the starship Space Manta from the land controlled by the Red Dwarf Raiders. Once the smuggler collected the final set of cargo, Tryken contacted them and summoned them back to the cantina, as Dapp had an urgent mission for them."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A human, Dapp had light skin and brown eyes. While his hair was entirely white by the time of the Iron Blockade, his eyebrows were noticeably darker. His right temple and cheek bore a black tattoo."}, {"tag": "p", "text": "As his nickname suggested, \"Happy\" Dapp displayed an easygoing, carefree demeanor most of the time. He had, however, a volatile temper that could rise and then recede very quickly, and that unpredictable nature contributed to earning him a dangerous reputation. Although he had his own sleazy charm, Dapp always seemed on the edge of instability. The gangster was also known to enjoy good food just as much as a good fight."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dapp first appeared in the video game Star Wars: Uprising which was released on mobile platforms in 2015. He was voiced by Steve Blum."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}