{"url": "Dar%27manda", "categories": ["Category:Legends articles", "Category:Criminal organizations", "Category:Mandalorian organizations", "Category:Mek-Sha organizations", "Category:Dar'manda"], "nodes": [{"tag": "h1", "text": "Dar'manda"}, {"tag": "p", "text": "The Dar'manda was a band of ex-Mandalorian gun runners and one of the five ruling organizations on Mek-Sha after Huttbreaker's Rebellion."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The group was led by Indigo in 3627 BBY. The Dar'manda were based out of the space station Mek-Sha, acting as one of the ruling organizations after their role in the Huttbreaker's Rebellion. During the renewed conflict between Galactic Republic and Sith Empire, the Commander of the Eternal Alliance arrived to assist Republic forces and enlisting the help of the space station's lead factions, finding the Dar'manda a possible ally. The Dar'manda offered to cut a deal with the Commander on Mek-Sha but refused to take a side in the renewed conflict off the station. The group was known to have an intense rivalry with another one of Mek-Sha's factions, the Harido Wald, whom the Dar'manda believed was severely squeezing their profits."}, {"tag": "p", "text": "A year later, members of the group led by the Recruitment officer Bask Sunn, joined up with Heta Kol's organization known as the Hidden Chain. They aided Kol with their starship, the Fortune's Folly, in an attack on the Spirit of Vengeance II, and helped make off with the banner of Clan Cadera."}, {"tag": "p", "text": "Following the attack on the Spirit of Vengeance II, Shae Vizla landed on Mek-Sha and took out nearly half the Dar'manda trying to discover the whereabouts of Heta Kol, but ultimately came up with nothing. Hylo Visz remarked in a conversation with the Alliance Commander that Indigo probably didn't even know his people were involved with the Hidden Chain, as he was never a hands-on manager for the group."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dar'manda first appeared in the 2019 Onslaught expansion to the video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}