{"url": "Dar_Keyis", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Dar Keyis"}, {"tag": "p", "text": "Dar Keyis was a Human male from the planet Churba who served as a member of the New Republic Starfighter Corps during the Galactic Civil War. In 4 ABY, nine months after the Battle of Endor, he was transferred to Rogue Squadron just prior to the Battle of Brentaal IV and was assigned the call sign Rogue Ten. The New Republic had targeted the planet Brentaal IV as part of an ongoing operation to establish a foothold in the Core Worlds, and to eventually liberate the galactic capital of Coruscant. Keyis served in the assault on the Brentaal IV moonbase, helping to secure it as a staging area for a direct assault on the planet itself. He then participated in the attack on the city of Vuultin, a diversionary feint that allowed the New Republic to establish a base in the city of Oradin. During the evacuation of Brentaal IV—an effort by the Imperial authorities to spirit away the wealthy and elite citizens of the planet—Keyis' fighter was destroyed by weapons fire from a TIE Interceptor, and he was killed in the resulting explosion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dar Keyis, a Human male, hailed from Churba and was a starfighter pilot in service to the New Republic Starfighter Corps in 4 ABY, approximately nine months after the Battle of Endor. During the Galactic Civil War, he had already racked up eight combat missions before being transferred to the elite Rogue Squadron, which at the time was stationed at the secret Base Delta-Nine. His assignment to the squadron—along with the Rodian Standro Jcir, fellow Human Avan Beruss, and the Tunroth Xarcce Huwla—was part of an effort to bring Rogue Squadron up to full strength prior to the Battle of Brentaal IV, a New Republic effort to gain a foothold in the Core Worlds. Assigned the call sign of Rogue Ten upon joining the unit, he and his squadron mates underwent holosimulator training for an assault on the Imperial-held Brentaal IV moonbase. Following a recent reconnaissance mission undertaken by Rogue Squadron to Brentaal IV, Admiral Gial Ackbar and the New Republic Provisional Council decided that it was time to strike the planet as part of their campaign to liberate the Core Worlds and the capital Coruscant. Ackbar was to lead the task force assigned to capture Brentaal IV."}, {"tag": "p", "text": "Staging from the planet Recopia, Keyis participated in the operation, during which the New Republic claimed victory by capturing the Imperial moonbase despite the presence of one squadron of elite TIE interceptors. Returning to Base Delta-Nine, Keyis was engaged in a game of dejarik with Xarcce Huwla when the squadron's commanding officer, Captain Wedge Antilles, shared information with the unit that the TIE Interceptors were from the 181st Imperial Fighter Group, an elite unit under the command of Baron-Colonel Soontir Fel."}, {"tag": "p", "text": "Along with the rest of Rogue Squadron, Keyis was transferred to the Brentaal IV moonbase in preparation for the assault on the planet itself. During some downtime, he was playing sabacc with several other squadron members when Baron Fel's presence on Brentaal IV was confirmed. He listened as members of the squadron recounted their memories of him—Tycho Celchu and Derek \"Hobbie\" Klivian had trained under Fel at the Prefsbelt Fleet Camp. Keyis participated in the subsequent assault on the Brentaal city of Vuultin—while Rogue Squadron hit the capital of the planet's ruler, Admiral Lon Isoto, as a diversion, New Republic Colonel Horton Salm's Aggressor Wing was to hit the city of Oradin and capture its spaceport. The opposition at Vuultin was light, as Fel had correctly surmised that Oradin was the true target for the Republic's assault. However, Isoto felt threatened since the Rogues were attacking him, and called Fel and his units away from Oradin. With news that Fel was heading for Vuultin, Ackbar ordered the Rogues to head to the Mon Calamari Star Cruiser Independence, one of the capital ships assigned to his task force. Despite taking heavy losses, the New Republic succeeded in capturing Oradin."}, {"tag": "p", "text": "Stationed at Oradin with Rogue Squadron, Keyis and Jcir were present in the main hangar when Lieutenant Plourr Ilo profusely thanked Rogue Squadron mechanic Koyi Komad for fixing her maneuvering jets. When Ilo asked Komad how she could repay her, Keyis and Jcir made several smart remarks about buying her a planet or a moon as a reward, due to Ilo's status as the Princess of Eiattu 6. Ilo offered to take the two pilots for drinks, reasoning that their dumb remarks would start a fight that she could enjoy."}, {"tag": "p", "text": "Without warning, an Imperial evacuation fleet arrived at Brentaal IV, intent on rescuing the wealthier citizens from the Republic invasion. Fearful that the escapees would take much of the planet's wealth and leave the economy in ruins, the New Republic Provisional Council authorized a mission to stop the population from evacuating. Rogue Squadron supported Aggressor Wing while they disabled fleeing transports with their ion cannons, first at Vuultin, then in orbit above the planet. During the space battle, Keyis' X-wing was hit by weapons fire from a TIE Interceptor. His fighter was destroyed, and Keyis was killed. Despite his death, the New Republic was victorious; the remaining Imperial forces withdrew from the system, leaving Brentaal and the disabled civilian vessels under New Republic control."}, {"tag": "p", "text": "Keyis' funeral—along with that of the others who had fallen in the battle for Brentaal IV—was held on the hangar deck of a Mon Calamari star cruiser, and was presided over by Horton Salm. Keyis' name was added to Rogue Squadron's roster of the dead."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dar Keyis was a light-skinned individual with blond hair and stubble on his face. He was considered to be a capable pilot, performing well enough to earn a transfer to Rogue Squadron, an elite unit within the New Republic military. Despite being a relative newcomer to the squadron, Keyis was able to integrate himself into the unit's social structure without difficulty, joining in on sabacc games and joking around with Lieutenant Plourr Ilo over her noble status."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dar Keyis was created by Michael A. Stackpole as a replacement pilot for Rogue Squadron in the four-issue Star Wars: X-Wing Rogue Squadron: In the Empire's Service story arc. He debuted in the first issue of the arc, and was killed in the last issue. He was subsequently mentioned in the first issue of the Family Ties arc, as Wedge Antilles muses that Keyis is one of the latest Rogues to join their roster of the dead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}