{"url": "Daran_Tal", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Baron Administrators", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Daran Tal"}, {"tag": "p", "text": "Daran Tal was an ambitious man who saw the potential of the Crystal Web Station, and whose careful planning and attention to details made his plan successful. Not much is known about his past, but in 1 BBY his scout craft was traveling through hyperspace when it had an accident and was forced back into realspace in the vicinity of the Crystal Web Station. Though Tal was the first outsider to lay eyes on it, the station was already fully functional and simply waiting to receive guests so that the Lucents could finally interact with the galaxy at large."}, {"tag": "p", "text": "The Lucents welcomed Tal with open arms, and he quickly formed friendships with the crystalline beings. He learned some small details about them in this time, but they would always remain secretive about their homeworld, simply gesturing vaguely towards the nebula whenever he brought it up. In the time he spent with them, he learned that the Lucents were natural navigators, and used no instruments to plot courses or calculate jumps. Additionally, he discovered that their crystal technology was based on principles similar to but different from the technology used by the galaxy at large."}, {"tag": "p", "text": "The more Tal learned about them, the more he was convinced that the Crystal Web Station could provide the Lucents with precisely the contact they desired while also turning a tidy profit. He outlined his plan to the Lucent leaders, got their agreement, then had them calculate a jump for his ship so that the plan could be brought into action. When he returned to the station two months later, he brought with him a small staff to man the station, including his chief security officer Klaar and his liaison officer Lianna Tagon. Tal hoped to turn the Crystal Web Station into a smaller version of Cloud City, designed to serve all travelers in need of quicker routes along the three major hyperlanes. Knowing that the Empire had a distinct dislike of nonhumans, Tal took the title Baron Administrator and became the visible, if not actual, leader of the station."}, {"tag": "p", "text": "He was quite proud of his accomplishments, but he was also aware that the station's success was mostly due to the Lucents who built it in the first place. He was very careful to keep that fact a secret, however, both for his own pride and for the Lucents' wishes. He was very devoted to cultivating the station's sphere of influence, and he did not look kindly upon those who interfered with that goal, regardless of who they represented."}, {"tag": "p", "text": "Tal was friendly to a point, always trying to be diplomatic but firm with few close friends but many associates. Unlike some Baron Administrators, Daran was not flamboyant or gaudy, preferring to dress in tasteful clothes that suggested his station without flaunting it. He rarely raises his voice in anger, preferring to leave maintaining order to Klaar. If he ever did raise his voice, however, it was a sign that he had been pushed too far and was about to push back."}, {"tag": "p", "text": "In 4 ABY he was responsible for convincing the Lucents to share a small piece of their crystal web technology, so they they could leave a small mark on the galaxy. The Lucents agreed with him on the condition that they could control the deal; they wanted to share their technology with all beings in the galaxy, not simply one faction. Tal was responsible for gathering a mixed group, and ended up inviting a group of New Republic agents, an Imperial Admiral and his two aides, and Orta the Hutt. Though naturally the meeting was full of tension, it went off without any major hitches, and all parties walked away happy."}, {"tag": "h2", "text": "Sources"}]}