{"url": "Daren", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Ferren Barr's disciples", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Daren"}, {"tag": "p", "text": "Daren was a human male who during the Clone Wars was rescued from two B2-series super battle droids by the Jedi Knight Anakin Skywalker. One year into the reign of the Galactic Empire, Daren was on the planet Mon Cala along with Jedi Padawan Ferren Barr and five other acolytes of Barr after informing the group of Anakin Skywalker, the Chosen One who was believed by some to bring balance to the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, Daren's settlement was attacked by the Separatist Droid Army. Daren soon found himself at gunpoint as a B2-series super battle droid prepared to gun him down. However before he could meet his untimely end, the droids were both cut in half by a Jedi Knight who identified himself as Anakin Skywalker. Skywalker prompted Daren to find somewhere to hide and leapt towards the ensuing battle."}, {"tag": "h3", "text": "Joining Ferren Barr"}, {"tag": "p", "text": "At the end of the Clone Wars, the clone troopers turned on the Jedi and almost completely wiped them out. Broadcasts from the new Galactic Empire stated that there were none left. Daren didn't like this seeing as one had saved his life and was lucky enough to run into a surviving Jedi Padawan named Ferren Barr. Barr claimed to be a Jedi Master and offered Daren a purpose in going against the Empire. Daren agreed and joined Barr and his other acolytes."}, {"tag": "h3", "text": "On Mon Cala"}, {"tag": "p", "text": "Barr took Daren and the other five acolytes to Mon Cala, where Barr began influencing King Lee-Char's negotiations with the Empire. This drew more attention from the Empire with Moff Wilhuff Tarkin parking the Imperial-class Star Destroyer Sovereign above Mon Cala. Emperor Palpatine himself soon sent his enforcer, Darth Vader, and three Inquisitors to investigate. Barr, unaware of Vader's arrival, decided to assassinate Tarkin's ambassador, Telvar, prompting Tarking to send his forces down to Mon Cala. Lee-Char warned Barr of the incoming forces and then described Vader to him, to which Barr identified as really being Anakin Skywalker."}, {"tag": "p", "text": "Barr came over to Daren and told them of Skywalker's arrival. Barr then showed them an image of Skywalker attacking the Jedi Temple and explained that he now called himself Darth Vader and continued to hunt surviving Jedi along with Inquisitors, who Barr called Jedi traitors. Daren asked Barr that if Emperor Palpatine's enforcers were Jedi, why didn't he tell anyone about this fact. In response, Barr said that maybe if he had told someone just after Palpatine's ascension to power it would have made a difference, but now no one would care and even if anyone paid attention to him, Palpatine would just simply lie."}, {"tag": "p", "text": "Tarkin's forces were winning at Dac City only to be wiped out by large tidal waves generated by large creatures. Vader and his Inquisitors survived and managed to get the whereabouts of Barr and his acolytes. Lee-Char informed Barr of Vader's imminent approach and Barr ordered Daren and the others to get ready to evacuate. They did so but as they emigrated Barr's refuge, they were met by Vader and the Inquisitors on an Imperial submarine. The acolytes scattered, except for Nipaltoo who attacked Vader's submarine head on. Vader crushed Nipaltoo's helmet and vectored towards the others."}, {"tag": "p", "text": "Barr and the other began towards Bel City where Vader followed. Another acolyte, Orvek, turned around to slow Vader down, sacrificing himself. As they got to Bel City, Rebb and Stell stayed behind to slow them even more. Barr, Daren and Verla made for a ship. They got to a hanger only to find it empty. Barr stated that they needed to act quick and find another way out, but it was too late. Daren was cut down by the Sixth Brother's lightsaber. Sixth Brother and the other two Inquisitors then surrounded Barr and Verla."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Daren first appeared in the canon comic Darth Vader: Dark Lord of the Sith 14 written by Charles Soule and pencilled by Giuseppe Camuncoli."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}