{"url": "Darial_Anglethorn", "categories": ["Category:Legends articles", "Category:Behebothians", "Category:Females", "Category:Force-sensitives", "Category:Humans", "Category:New Republic Senators", "Category:Police"], "nodes": [{"tag": "h1", "text": "Darial Anglethorn"}, {"tag": "p", "text": "Darial Anglethorn was a female Human senator who represented Beheboth in the New Republic during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the time of the Galactic Civil War Darial ran the largest moisture farm on the desert planet Beheboth, and she was a well-respected member in the local community."}, {"tag": "h3", "text": "Water bandits"}, {"tag": "p", "text": "When a band of outlaws known as the Brigands invaded the area and repeatedly stole precious water from the region's farmers, the populace became desperate and paranoid. The outlaws would arrive at a farm in the dead of night and use the being known as the Tirrith to render any guards unconscious, and the bandits would proceed to rob the farm's stockpile of water. Anglethorn led the farmers in their fight against the Brigands, but thus far they had been unsuccessful in stopping the thieves."}, {"tag": "p", "text": "The Rebel pilot Luke Skywalker wandered into the Beheboth town of Garrotine in search of supplies, and a group of locals became suspicious of the stranger and immediately accused him of being a member of the Brigands. Anglethorn arrived on the scene and calmed her neighbors; she instantly took a liking to Skywalker and hired him on to help guard her farm. That night the Tirrith arrived at Anglethorn's farm to subdue the guards, including Luke and Darial, and then the thieves ransacked her farm, stole all of her water, and kidnapped Darial. Luke ventured out to rescue Darial, but was himself captured and brought into the Brigands' headquarters where he met their leader, Gideon Longspar. Here they discovered that Longspar had captured a portion of the Tirrith and held it hostage in order to force the other portion of the ethereal creature to do his bidding. Anglethorn and Skywalker escaped their imprisonment and freed the captured Tirrith, but were soon cornered by the gang of Brigands. The Tirrith convinced Darial to fire upon the stockpile of stolen water to cause a flood of water to rush down upon the advancing outlaws. She hesitated at first, knowing that the water was critical for her people to survive, but eventually opened fire on the tanks allowing the water to flow, drowning the onrushing bandits."}, {"tag": "p", "text": "The Brigands were defeated but with their water reserve gone, Darial and her fellow farmers had to begin building their water stockpile anew. But the Tirrith left them with a gift in return for saving it from Longspar; it seeded the clouds of Beheboth and caused it to rain on the planet for the first time in years, providing the people of Beheboth with a steady supply of the much needed water."}, {"tag": "h3", "text": "Peacekeeper"}, {"tag": "p", "text": "Some time after the defeat of Longspar, Darial was elected the Police officer of Garrotine, which had since been renamed Prosperity. The town's new name matched its growing success since water returned to the region. Seven years after the Battle of Yavin, Darial was chosen as Beheboth's representative to the New Republic, though she would only attend one or two major sessions per year."}, {"tag": "p", "text": "Eight years after the Battle of Yavin, Darial investigated the death of farmer Berl Matoone and believed the Tirrith were to blame. She sent a HoloNet message to Luke Skywalker, believing he could help her learn the truth. Before Skywalker arrived, Darial uncovered Imperial officer Mils Giel's plot to mutate and control the Tirrith to serve as living weapons and assassins. She was nearly killed in a deadly explosion caused by Giel during his escape. After days in an infirmary, Darial met with Skywalker and they discussed tracking down Giel and bringing him to justice. The final result of that mission remains unknown."}, {"tag": "p", "text": "Upon Luke's return, his more developed Force abilities made him realize that Darial was actually Force-sensitive, though she herself remained unaware. Her powers had so far only manifested themselves in the form of intuition and empathic abilities. It is not known if Skywalker revealed this to Darial."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}