{"url": "Dario_Carrasco,_Jr.", "categories": ["Category:Real-world articles", "Category:Comic book pencillers"], "nodes": [{"tag": "h1", "text": "Dario Carrasco, Jr."}, {"tag": "p", "text": "Dario Carrasco, Jr. is an artist who has worked for a large number of comic book companies, including Marvel Comics and Dark Horse Comics. He is best known within the Star Wars community for his work with Kevin J. Anderson on the comic series Star Wars: Tales of the Jedi — The Sith War, The Golden Age of the Sith, The Fall of the Sith Empire, as well as Jedi Academy: Leviathan. In 2002 he started his own online comic studio called Panday Studio, and it is currently a venue for artists starting into the comic industry. Dario Carrasco, Jr. currently lives in Okotoks, Alberta in Canada."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dario Carrasco, Jr.'s artwork was first published in 1990 by Rocket Comics located in Vancouver, British Columbia. Following his breakout into the comic book industry, Carrasco worked a number of minor comic publishers, eventually ending up doing artwork for Marvel Comics, working on a selection of different comic stories between the years 1992 and 1994."}, {"tag": "p", "text": "From 1994 to 1998, Carrasco worked as an artist for Dark Horse Comics, and worked alongside author Kevin J. Anderson on a number of Star Wars related projects. These included being the artist for three Tales of the Jedi story arcs, The Sith War, The Golden Age of the Sith, and The Fall of the Sith Empire. Following the completion of his work on Tales of the Jedi, Carrasco again worked with Anderson on the comic series Jedi Academy: Leviathan, a line of comics which follows several characters originally created by Anderson for his Jedi Academy Trilogy or novels."}, {"tag": "p", "text": "In 2002 Carrasco established his own online comic company by the name of Panday Studio, which currently acts as a venue for new comic artists, as well as seasoned veterans."}, {"tag": "h2", "text": "Star Wars bibliography"}, {"tag": "h3", "text": "Star Wars: Tales of the Jedi — The Sith War"}, {"tag": "h3", "text": "Star Wars: Tales of the Jedi — The Golden Age of the Sith"}, {"tag": "h3", "text": "Tales of the Jedi: The Fall of the Sith Empire"}, {"tag": "h3", "text": "Jedi Academy: Leviathan"}, {"tag": "h2", "text": "External links"}]}