{"url": "Dark_Empire_endnotes", "categories": ["Category:Real-world articles", "Category:Dark Empire"], "nodes": [{"tag": "h1", "text": "Dark Empire endnotes"}, {"tag": "p", "text": "The Dark Empire endnotes were miniature essays by Tom Veitch exploring the backstory of Star Wars: Dark Empire, and later included concept art by Cam Kennedy. They appeared in the back of each issue when they were first published, and were compiled at the back of the first two printings of the trade paperback with some changes made. The endnotes were dropped from the third printing on, which made them extremely rare. However, they became widely available again after being reprinted in Star Wars Legends Epic Collection: The New Republic Vol. 5."}, {"tag": "p", "text": "Among the topics covered are the history of the galaxy since the Battle of Endor, Palpatine's research into the dark side of the Force, superweapons, Nar Shaddaa, Byss, the Skywalker family, lightsabers and holocrons, and ancient Jedi. It also is the first mention of Ulic Qel-Droma, the Krath, and the events that would become the Tales of the Jedi series. However, as the background given in the endnotes was essentially a rough draft, it is very different from the actual Tales of the Jedi comics."}, {"tag": "p", "text": "Much of the information in the endnotes was incorporated into the Dark Empire Sourcebook."}, {"tag": "p", "text": "Unique information was also presented in the opening crawls of each issue, such as the revelation of Palpatine's fifteen-year-old clone. This information has not however been republished as the opening crawls were dropped from all subsequent publications."}, {"tag": "p", "text": "The checklists for the tenth and eleventh issues of Dark Horse International's Star Wars comics refer to a \"Dark Empire Technical Readout\" feature by Veitch and Kennedy that was the \"First time publication anywhere in the Galaxy!\" in 1993. It was promoted to begin with a focus on bounty hunters but the material was not released with issue 10 and that comic ultimately became the last of the series as the book was canceled."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}