{"url": "Dark_Forces:_Soldier_for_the_Empire_audio_drama", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Dark Forces audio dramas"], "nodes": [{"tag": "h1", "text": "Dark Forces: Soldier for the Empire audio drama"}, {"tag": "p", "text": "Dark Forces: Soldier for the Empire was an audio drama adapted by John Whitman, based on material covered in the book of the same title written by William C. Dietz. It was made to bridge the events in the video games Dark Forces and Jedi Knight: Dark Forces II. The performance was directed by Peter Moore and featured a score by veteran Star Wars composer John Williams."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After learning what happened to his father, Kyle Katarn tells Jan Ors, the Rebel agent whom he allowed to escape from Imperial captivity, that he has changed his mind about serving the Empire. Before he can put any more thought into his defection, however, he discovers that he's being watched—and so is Jan. Kyle throws his lot in with the Rebels as they make a hasty escape from the cruise ship, Star of Empire, and soon finds himself wanted by the Empire. Jan takes him to meet Mon Mothma, a Rebel leader who assigns him to what may very well be a suicide mission. Kyle is ordered to infiltrate an Imperial research facility and steal the plans to the Empire's next doomsday weapon, a mobile space station called the Death Star. Mon Mothma also assigns Jan Ors to provide Kyle with backup. Unbeknownst to him, Jan has secret orders: in the event that Kyle shows any sign of being an Imperial double agent, she is to execute him before he can betray them."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "p", "text": "As the story is split into two parts, there are also two opening crawls."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "See also"}, {"tag": "h2", "text": "External links"}]}