{"url": "Dark_Forces_saga", "categories": ["Category:Real-world articles", "Category:Dark Forces", "Category:Multimedia projects"], "nodes": [{"tag": "h1", "text": "Dark Forces saga"}, {"tag": "p", "text": "The Dark Forces saga, also known as Jedi Knight saga, was introduced with the game Star Wars: Dark Forces (1995) by Justin Chin."}, {"tag": "h2", "text": "Corpus"}, {"tag": "p", "text": "Due to the popularity of the game, and the general demand, a sequel was released, featuring lightsabers and Force powers: Dark Forces II: Jedi Knight (1997) and an expansion, Jedi Knight: Mysteries of the Sith (1998)."}, {"tag": "p", "text": "The two first games spun off the Dark Forces novellas based on the plot as well as the background history:"}, {"tag": "p", "text": "Jedi Knight: Dark Forces II therefore spawned its own sequel, Jedi Knight II: Jedi Outcast (2002), and a spinoff, Star Wars: Jedi Knight: Jedi Academy (2003) where Kyle Katarn is an NPC character. A series of in-universe reports were posted on the LucasArts website building up to the release of Jedi Outcast, which provided some background. Known as the N.R.I. Reports, these added to the Dark Forces corpus."}, {"tag": "p", "text": "Sometimes, the comics \"Sand Blasted\" and \"Equals & Opposites\" are considered parts of the Dark Forces saga since they feature characters from the games. The comic series Star Wars: Jedi vs. Sith can also be considered part of the narrative due to it featuring the origins of the Valley of the Jedi and subsequently the Last Battle of Ruusan."}, {"tag": "p", "text": "The documents, The Dark Forces Saga and Kyle Katarn's Tale released by Wizards of the Coast, have expanded more on the background of the stories and the history of characters."}, {"tag": "p", "text": "Two rejected concepts for future games in the series include Jedi Knight III: Brink of Darkness and Jedi Master. Jedi Master was one of the many video game concepts LucasArts considered for what would later become Star Wars: The Force Unleashed. It was to be a survival horror game—a much darker, more violent, and more mature continuation of the Jedi Knight series set during the Great Jedi Purge immediately following Star Wars: Episode III Revenge of the Sith. The concept was originally put out to potential consumers to test the demand for both another Jedi Knight game and a more mature Star Wars game, but both the consumers and the developers felt the concept was too gratuitous and derivative, and so it was thrown out."}, {"tag": "h2", "text": "Significance"}, {"tag": "p", "text": "These works were the first video games (years before the Knights of the Old Republic series) that had new elements later referenced by subsequent Expanded Universe sources and retcons, transitioned afterwards to the wider EU corpus; bringing thus into existence several important and integral concepts in the Star Wars continuity and the galactic history; such have been some Force powers, the dark troopers, the Battle of Ruusan, Prophets of the Dark Side, and Dromund Kaas, the Reborn etc."}, {"tag": "h2", "text": "Nomenclature"}, {"tag": "p", "text": "The Jedi Knight subtitle itself was later renamed to a proper title, with the Dark Forces as its subtitle: Jedi Knight: Dark Forces II."}, {"tag": "h2", "text": "Notes and references"}]}