{"url": "Dark_Jedi_Starship", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Capital ships", "Category:Starships of the Sith Empire", "Category:Unidentified spacecraft"], "nodes": [{"tag": "h1", "text": "Dark Jedi Starship"}, {"tag": "p", "text": "The Dark Jedi Starship was a capital ship used by a party of Dark Jedi Exiles led by Baron Remulus Dreypa that crash-landed on the remote planet Kesh. Following the establishment of the first Sith Empire by Dark Jedi Exiles in the Stygian Caldera during the aftermath of the Hundred-Year Darkness circa 6900 BBY, Dreypa sought revenge against the Jedi Order and the Galactic Republic that had exiled them. He and several other Dark Jedi acquired a starship capable of interstellar travel and used it to travel out of the Stygian Caldera. However, they were intercepted by a Jedi patrol who pursued them across hyperspace."}, {"tag": "p", "text": "The pursuit ended on Kesh when the Dark Jedi starship crashed on Kesh's surface. Dreypa and his followers survived the crash and fought their Jedi pursuers, devastating much of Kesh's surface and disrupting the lives of the indigenous Keshiri natives. Due to Kesh's strong magnetic field, the Jedi were unable to call for reinforcements or leave the planet. During the fighting, Dreypa unleashed several weapons including the Leviathans, monstrous Sithspawn that drain people's life energies. These events would be remembered by the Keshiri as the Great Calamity who regarded the Dark Jedi and their Jedi foes as the Destructors and Protectors respectively."}, {"tag": "p", "text": "In the end, the Dark Jedi made peace with their Jedi adversaries after imprisoning Dreypa within an oubliette where he would remain for nearly four millennia. The two Force organizations then retreated to Kesh's frozen southern continent of Eshkrene where they established a new community known as the Doomed who were dedicated to finding true neutrality in the Force. While the destruction of the Dark Jedi Starship deprived Kesh's inhabitants of any form of hyperspace-capable starships, a secret Jedi starship was hidden beneath the Circle Eternal in Tahv, the Lost Tribe of Sith's capital on Keshtah. It survived until the events of Dreypa's rebellion in 2974 BBY."}, {"tag": "h2", "text": "Appearances"}]}