{"url": "Dark_Knight%27s_Devilry", "categories": ["Category:Real-world articles", "Category:Devilworlds"], "nodes": [{"tag": "h1", "text": "Dark Knight's Devilry"}, {"tag": "p", "text": "\"Dark Knight's Devilry\" is a comic story originally featured in The Empire Strikes Back Monthly 153, written by Steve Moore. It was later reprinted as the second story in Classic Star Wars: Devilworlds 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet Jerne, Luke Skywalker, R2-D2, and Leia Organa are being transported to an Imperial base, after being captured by Captain Ryko Vant. The transport comes under attack from native guerrilla fighters who had set-up an ambush by hiding under the sand of the planet. Distracted, the troopers are attacked by their captives, and are quickly defeated. All troopers aboard the transport are killed, with the exception of Vant, who uses a jetpack to escape the scene. As he is departing, the Captain aims and fires at Organa, who is pushed aside by Luke, while R2 is hit by the shot. The rebels then find themselves prisoners again, this time to the native fighters, who take them to their base."}, {"tag": "p", "text": "Captain Vant arrives back at the Jerne City H.Q. as his jetpack runs out of fuel. In a foul mood, the commander instructs Sgt. Falesh to send a task force to sweep the planet, informing him of the tracer placed on R2. Entering his control room, Vant is surprised and frightened to see Darth Vader waiting for him inside. The Dark Lord is not happy that his prisoners were able to escape, berating the Captain, and informing him the tracer is not needed, since he knows where they are heading."}, {"tag": "p", "text": "Back at the guerrilla's base, Luke and Leia meet the leader of the fighters, Meeka Reen. The young woman demands to know why the two Rebels are on her planet, threatening to \"get rid of them\" if she does not find out. Having no other option, Luke tells the story of finding a lifeless ship in the sector, and going to investigate it. Luke brought the ship to be analyzed by Rebel scientists, who found image tapes, including the ship's log, and an entry on the Eternity Crystal. The tapes stated that the crystal and the ship were both made the by long extinct original Jerni inhabitants, and also described the power of the crystal, being able to turn time backwards to a specific point, and then start time again, along a different path. When hearing of this Leia wished to use the crystal to stop the destruction of Alderaan by the Death Star, or even potentially stopping the Empire from forming at all. They decided to investigate Jerne for the crystal, but were shot down by TIE/LN starfighters while trying to enter the planet."}, {"tag": "p", "text": "After hearing their story, Meeka expresses disbelief over the claims they made, while still entertaining the idea of using the crystal for her own ends. She does insist on traveling to Adony station, where the crystal is supposedly held to check the validity of these claims. Luke notices that something is not right with the station, seeing fresh concrete on the supposedly ancient structure. The guerrillas blow open the door to the station, while entering, they trip a booby trap, and the whole station explodes leaving nothing but a crater."}, {"tag": "p", "text": "Vader and Vant then arrive at the crater that was once the station. Vader reveals that it was he who had set the alien ship orbiting the planet, hoping the rebels would find it. Knowing Leia would want to use the crystal to change the fate of her home planet, the sith lord had set the trap to kill the rebels when they entered the station. Believing both rebels were killed in the blast, neither man notices the two rising from the crater in the sand. Luke finds a proton grenade nearby, and hurls it at the two imperials. Luke and Leia then board the scout ship Vader arrived on, and fly off the planet. While departing Leia asks if Luke thinks Vader died from the grenade, to which Luke replies that with all of the armor he wears, you can't be sure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}