{"url": "Dark_Nest_III:_The_Swarm_War", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: The Dark Nest Trilogy"], "nodes": [{"tag": "h1", "text": "Dark Nest III: The Swarm War"}, {"tag": "p", "text": "The Swarm War is the third novel of Star Wars: The Dark Nest Trilogy by Troy Denning. It was released from Del Rey Books on December 27, 2005. Narration for the audio version was performed by Jonathan Davis."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In the explosive conclusion to the Dark Nest trilogy, Luke Skywalker summons the heroes of the New Jedi Order from near and far as the Star Wars galaxy teeters on the edge of eternal war. Yet even the combined powers of the formidable Jedi may not be enough to vanquish the deadly perils confronting them."}, {"tag": "p", "text": "Luke Skywalker summons Jedi Knights from all over the galaxy as war starts. Yet even the combined might of the Jedi Order may not be enough against the deadly perils confronting them."}, {"tag": "p", "text": "The Chiss-Killik border confrontration is threatening to engulf the entire galaxy in yet another galactic war. The Killik have planned to absorb all living creatures into a single hive mind. The only hope for peace lies in the hands of the Jedi, who must not only end the war between the Chiss and the Killik but also confront the new threat of the Dark Nest and its unseen queen."}, {"tag": "p", "text": "Leia's Jedi skills will be put to the test in the coming conflict, while Luke will have to prove in a brilliant display of Force strength and swordplay, that he is the most powerful Jedi Master in the galaxy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts out on Snevu during its battle in the Swarm War. The Chiss launch a bomb on the planet that doesn't go off, and Jaina Solo, Zekk, Tesar Sebatyne, Lowbacca, Tahiri Veila and Jacen Solo all go to the bomb to stop its activation, but they have to dodge through Chiss fire raining from orbit. They race to the bomb against a Chiss shuttle craft, which has Jagged Fel aboard. This stirs up emotions in Jaina, which makes Zekk jealous in their Force-meld. The shuttle craft dismounts a Chiss commando squadron which the Jedi Knights fight against, and during the battle, the shuttle with Jag aboard is destroyed. Jag survives thanks to some Force manipulation by Jacen, who has Jag activate the bomb when the Chiss commandos have failed. The bomb's effects would kill the Killiks on the planet. Jaina holds it against Jacen for going against them."}, {"tag": "p", "text": "The story then shifts over to the New Jedi Temple on Ossus where Jedi Master Luke Skywalker has called for an audience from all of the Jedi in the galaxy. Because of the Dark Nest Crisis and the concurrent Swarm War, Luke has found that the New Jedi Order and its ideals from the end of the Yuuzhan Vong War are insufficent in this crisis—considering their separate viewpoints and how they had been manipulated by the likes of politicians such as Galactic Alliance Chief of State Cal Omas in the previous novel. Therefore, he makes this announcement: He will become the Grand Master of the New Jedi Order, taking total control of it like his late Master Yoda did with the previous Jedi Order. Also, those who cannot place their Jedi duties above all else must resign. Though Leia Organa Solo finds Luke's action to be brash, she understands why he had to do it. And from Luke's actions, Jedi like Danni Quee and Tenel Ka Djo resign because of Danni's studying of Zonama Sekot and Tenel Ka's duties as Queen Mother of the Hapes Consortium and her daughter, Allana. Concerning Allana, neither Jacen nor Tenel Ka have revealed to anyone, not even Jacen's own family, that Jacen is Allana's father."}, {"tag": "p", "text": "Following Luke's crowning of himself as the ruler of the New Jedi Order, he moves on to other business with the Jedi Masters, Han, Leia, and Jacen. With Tahiri, Tesar and Lowbacca returning with Jacen, the Masters have noted Jaina and Zekk's absence, officially declaring their knowledge that they have become Joiners, fighting alongside UnuThul and the Killiks against the Chiss. Jacen offers a suggestion that can end the war by destroying the Colony—killing UnuThul along with Lomi Plo. This disconcerts Tahiri, Tesar, and Lowbacca, who are just barely Joiners. Luke considers that they would indeed have to somehow remove UnuThul from leadership of the Killiks alongside killing Lomi Plo. Luke and his wife Mara are invited by Madame Aryn Dro Thul to dinner, which leads to the discussion that Luke and Jacen had which suggested eliminating Raynar to end the Swarm War. Luke has discussed that killing Raynar will only be a last resort and that if he can, he can help him become Human again. Despite the emotional unsteadiness that she is going through that the only possible way to end the war would be to kill her son, especially since she lost her husband years earlier, Aryn gives Luke an R2-0 unit which contains the necessary part needed to open up more of Artoo's memory banks in order to fully reveal Luke's parents' past. Later, Zakarisz Ghent makes another breakthrough in R2-D2's memory banks concerning Luke's parents, Darth Vader and Padmé Amidala. The scene shown is when Vader returns to Padmé's residence on Coruscant after he returned from the old Jedi Temple in order to fulfill Order 66."}, {"tag": "p", "text": "Han, Leia, C-3PO, Saba Sebatyne, Meewalh, and Cakhmaim travel to a Lizil nest in disguise of being weapons merchants seeking to profit from the Swarm War. Their mission is to find out where Jaina and Zekk are now in the war, and Han and Leia get their information from the Squibs trio, Emala, Sligh, and Grees, who they have met years earlier on Tatooine and Pavo Prime. Though the trio reveals that Jaina and Zekk are fighting the Chiss on Tenupe, they later try to have Han and Leia killed aboard the disguised Millennium Falcon by sending over their (the Squibs') younger relatives. However, Captain Jae Juun and Tarfang, now intelligence agents under the employ of Admiral Nek Bwua'tu, tell Han and Leia about this. With help from Leia's Noghri bodyguards, they defeat the Squibs, who reveal that they have sent assassin Squibs onto Tenupe to kill Jaina in revenge for Han and Leia meddling in their affairs on Tatooine and Pavo Prime."}, {"tag": "p", "text": "And the conversation has also led to revealing that Tesar and Lowbacca have divulged the information of possibly killing Raynar to Aryn. When Luke and Mara confront them about this, along with Tahiri, who didn't know that Tesar and Lowie revealed the information when she brought them to Aryn, they defend their position by saying that it's wrong to kill Raynar, another Jedi Knight, in order to end the Swarm War. This conversation leads to the three confronted Jedi arguing that Luke confides too often in Jacen on matters of the Killiks. They then accidentally reveal that they believe that Jacen had mind-wiped Ben when they got back from Endor (in reality, Hapes) to prevent him from remembering something. Luke exiles Tahiri, Tesar and Lowbacca to Dagobah in order to reaffirm their allegiance to the New Jedi Order. Then Luke and Mara confront Jacen about mind-wiping Ben, and Jacen lies by saying that he mind-wiped him in order to protect him from a traumatic memory when a monster attacked an Ewok village, when really, he mind-wiped him so that he wouldn't reveal that he was the father of Tenel Ka's daughter."}, {"tag": "p", "text": "Luke and Mara look fondly on Jacen again without suspicion from the lie, and they also successfully launch a mission that results in the Battle of Nickel One. Though they succeed in the mission, they get the bad news on a comm channel from Supreme Commander Gilad Pellaeon that the Killiks have captured Thyferra and have taken hold of the Galactic Alliance's bacta supply. Later, Luke, Mara, and Jacen watch another holovid from Artoo's memory banks that reveals Vader and Padmé's last time together on Mustafar. Though the recording ends on an incomplete bit, ending just after the Sith Lord Force-threw Padmé away, Luke feels ready to kill Lomi Plo despite his own grief that his father would do something like this to his own wife. Along with several other Jedi, Luke, Mara, and Jacen launch a mission on the Gorog nest ship at Sarm, launching the battle in the attempt to kill Lomi Plo. Luke duels Plo inside the nest ship while Mara and Jacen battle off against her Dark Nest forces. The fight ends up with both Mara and Jacen receiving grievous wounds from Plo herself that would have been fatal had the Gorog nest ship not been falling apart by the Jedi's attack. Plo escapes, and so do the surviving Jedi, including Luke, Mara, and Jacen."}, {"tag": "p", "text": "Returning to the Galactic Alliance, with Mara and Jacen having to spend weeks in a medcenter for recovery because of the decrease of bacta supplies since the Killiks captured Thyferra, Luke decides that he will kill Lomi Plo himself the next time they meet. Then Jacen uses a Force-technique to summon up Luke's fears of losing Mara, and Jacen tells him that in order to be fully invulnerable to Plo's influences whenever they fight is to disparage those fears—that way, Plo wouldn't have anything to use in the Force against Luke. In order to fully rid himself of his grief over his mother, Luke watches the rest of the holovid that started out from Vader throwing Padmé on the Mustafar platform. While Vader and Obi-Wan Kenobi duel, C-3PO and Artoo take Padmé's unconscious form aboard her starship, where Obi-Wan later returns after he has finished his duel to fly Padmé to the Polis Massan medical facility. There, he, along with Yoda and Bail Organa, witness Luke and Leia's birth just as Padmé dies in childbirth. While his grief over his mother's death hasn't been lifted, Luke could at least disparage of the horrible notion that his father killed his mother before she birthed him and Leia. Regardless, Luke refuses to give into his own will with the Force in his final battle with Lomi Plo, as was the late Vergere's philosophy."}, {"tag": "p", "text": "At Tenupe, where the battle there between the Killiks and Chiss is raging, Jaina defeats the Squibs trying to kill her and joins Zekk in their StealthX X-wing starfighters to combat the Chiss in the air. Meanwhile, the latter species capture the Millennium Falcon and interrogate Han and Leia to reveal their intentions. Interrogating Leia, they trick her into believing that they are torturing Han so as to get the sufficient information out of her. However, before she is set free by her escaping companions, Leia manages to find out that the Chiss plan to release a bioweapon on Tenupe that can wipe out all of the Killiks. When the Solo company escape in the Falcon, Leia warns Jaina and Zekk through the Force that the Chiss are going to drop their bioweapon soon on Tenupe. Alema Rar then arrives on the scene with her own StealthX and manipulates Jaina and Zekk through their connection as Joiners to act as decoys while Alema herself will destroy the Chiss ships containing the bioweapons. One ship is destroyed, while the other falls onto the surface of the planet, damaged, and lost to both Chiss and Killik parties. They both decide to search for the bomb for completely different reasons; the Killiks wanting to destroy the weapon, the Chiss wanting to activate it. Jaina and Zekk are also shot down, but survive, leading to Han looking for his daughter and her friend. And beforehand, Leia shoots down Jagged Fel, stranding him somewhere on the planet. Leia and Saba then search for the bioweapon bomb, which leads to Leia and Alema's final duel in this trilogy. Leia defeats Alema by having one of Tenupe's jungle beasts, a spidersloth, attack the Twi'lek, and they both disappear into the dark reaches of the jungle, with Alema presumed dead. Leia and Saba successfully find the bomb, and they have it detonate under a river where it can't take any affect on any of the Killiks or the planet."}, {"tag": "p", "text": "In space above Tenupe, Luke launches a YVH squadron to attack the Admiral Ackbar to confront UnuThul. Luke and UnuThul fight while the YVH bugcrunchers combat the Killiks. Luke, after defeating UnuThul by cutting his arm off, convinces Raynar to return as a Human and revoke all control of the Colony to reduce the Killiks back into the disorganized civilization they were before he Joined them. Lomi Plo enters, and Luke, having dispensed with his emotional weaknesses, easily chops Plo into pieces and kills her. The Dark Nest dies off, along with the Colony's organization. Raynar returns to the Galactic Alliance for intense psychological treatment under the Jedi's eye."}, {"tag": "p", "text": "The Swarm War is now over, with the Killiks back as a mindless species and the Chiss agreeing to back off from trying to exterminate the insects. The novel, and the whole trilogy, ends with Leia being declared a full-fledged Jedi Knight for her actions during the Swarm War. Leia then asks Luke what will happen to the New Jedi Order if he were to ever be absent again, now that he's in complete control of the Order. He answers, \"I don't know. I wish I knew the answers.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Emala, Sligh and Grees, the Squibs from one of Denning's previous Star Wars books, Tatooine Ghost, reappear in this book."}, {"tag": "p", "text": "The Skywalker family saga comes full circle as Luke watches a hologram of Anakin Skywalker Force-choking Padmé Amidala, as well as his and Leia's birth (this was omitted from the audio book)."}, {"tag": "p", "text": "On page five, Jacen is misspelled \"Jacon.\" Padmé is repeatedly misspelled as \"Padme\"."}, {"tag": "p", "text": "Despite the cover art, Luke did not cast his unique green Electric Judgment in the book."}, {"tag": "p", "text": "As in the previous two novels in the trilogy, Jacen's downfall to the dark side for Star Wars: Legacy of the Force is implicated when, much to his Uncle Luke and Aunt Mara's chagrin, he appears to sympathize with his late grandfather Anakin's desire to save his wife by turning to the dark side of the Force."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Dark Nest III: The Swarm War."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}