{"url": "Dark_Nest_Crisis", "categories": ["Category:Legends articles", "Category:Conflicts involving the Chiss Ascendancy", "Category:Conflicts of the Unknown Regions", "Category:Conflicts of Wild Space", "Category:Dark Nest Crisis", "Category:Galactic Alliance", "Category:Killik culture", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Dark Nest Crisis"}, {"tag": "p", "text": "The Dark Nest Crisis or Killik Expansion (35 ABY–36 ABY) was the general term for the conflict that took place between the forces of the Galactic Alliance, the Chiss Ascendancy, and The Colony, the ruling body of the Killiks. The major conflict during this time was the Swarm War, largely occurring in 36 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 35 ABY, the Chiss sent a message to the Galactic Alliance, accusing the Jedi of interfering in their internal affairs. The Jedi were puzzled, seeing as they had their hands full with pirates such as Three-Eye and Redstar—not to mention the major Ramoan relocation project. Then, one by one, it was discovered that the surviving Jedi of the Myrkr strike team had left their assignments and headed into the Unknown Regions. When Luke Skywalker and Mara Jade Skywalker, along with a few others headed out there, they discovered that the missing Jedi had heard a call for help from one of the other Jedi from the Myrkr mission—Raynar Thul, who had been presumed dead."}, {"tag": "p", "text": "Instead, he survived and landed among the Killiks, who began taking on many of his qualities. As they expanded their Nests, they came into contact with the Chiss, who used defoliators to ruin their food stocks and drive them off. The Myrkr survivors were helping Raynar defend the Nests, going out into combat to disable the defoliators."}, {"tag": "p", "text": "Luke and Mara forced the young Jedi to come back into the Alliance fold, reminding them of their responsibilities to the Galactic Alliance. However, several of the Jedi had become Joiners, including Jaina Solo and Zekk. They referred to themselves as we and had a very powerful connection to the Nests because of their Force abilities."}, {"tag": "p", "text": "The situation between the Chiss and the Killiks was resolved for a time when Han agreed to give the Killiks a nebula they had found, in exchange for the help of Chief of State Cal Omas to annul a claim by RePlanetHab so the Ithorians would have a world of their own, ten years after Ithor was destroyed."}, {"tag": "p", "text": "One year later, things began flaring up again as the Killiks found that the worlds they lived on had a self-defense mechanism - something they termed the Fizz. It destroyed anything that attacked the planets it was on, which resulted in a great loss of life for the Killiks. They blamed this on the Jedi who had given them the worlds, further destabilizing the Galactic Alliance and making the Jedi look even worse in the eyes of the galaxy. Plus, black membrosia and pirates were being found outside of the nebula, making the Killiks seem responsible for much of the trouble in that area of the galaxy."}, {"tag": "p", "text": "Also at this time, Jacen Solo discovered he was a father of a baby girl named Allana—the year before, he had convinced Tenel Ka to send a Hapan battle fleet to help the Killiks, but her price was that he spend a night in bed with her. She became pregnant, but used the Force to slow her pregnancy so that her nobles would not think that Jacen was the father."}, {"tag": "p", "text": "The Dark Nest sent assassins to kill the baby, having been hired by Tenel Ka's grandmother to kill the heir. They were foiled by Jacen and a modified version of the YVH 1 droid."}, {"tag": "p", "text": "Shortly afterward, some of the Jedi launched a preemptive strike on a Chiss base in order to prevent the Chiss from attacking the Killik Nests. This, however, only served to make the Chiss angrier, and they decided to handle things on their own, rather than allow the Alliance to take care of the matter."}, {"tag": "p", "text": "This act, combined with the capture of the Victory-class Star Destroyer Admiral Ackbar in the Murgo Choke by the Killiks, were the opening acts of the conflict that became the Swarm War."}, {"tag": "p", "text": "Shortly after the capture of the Ackbar, the Killiks used it to ambush a Chiss assault cruiser that was attacking the Iesei nest. As the Star Destroyer and the Chiss vessel fought in orbit, Jaina Solo and Zekk fought attacking Chiss forces with a Killik army, working to keep them from detonating a superbomb that would destroy the entire Nest on the planet."}, {"tag": "p", "text": "While fighting with the Iesei Nest, Jaina and Zekk felt an incredibly powerful call through the Force – a call much like the one from UnuThul, except it was from Luke Skywalker. He was ordering a convocation of Jedi on the planet Ossus, to decide the fate of the Jedi Order."}, {"tag": "p", "text": "Though they both refused to go, nearly the entirety of the Jedi reconvened on the planet. While there, several Jedi – including Danni Quee and Tenel Ka—announced their decisions to leave the Order. Luke himself announced that he was taking control of the Jedi Order—a shocking move on his part, but one that had to be done, if only to keep the Order from fracturing itself apart."}, {"tag": "p", "text": "The Jedi spread throughout the galaxy again, on the move to thwart the Killiks from pushing the crisis even further. Galactic Alliance Intelligence Service had discovered that the Killiks were moving to support coups among the insect species of the Galactic Alliance by supporting them with troops and weapons. This was all a ruse, though—the Killiks' real intent in launching the coups was to distract the Jedi from their real objective—defeating the Chiss fleet engaging the Colony."}, {"tag": "p", "text": "Teams of Jedi stopped most of the coups, though, and Luke and Leia, along with several other prominent Jedi, were able to get to the sector of space the Colony took up and face off against Lomi Plo. They failed to kill her—Lomi had managed to wound Jacen and Mara—and the battles continued."}, {"tag": "p", "text": "Soon, a huge Chiss fleet attacked another Nest, and UnuThul committed most of the Colony's forces—including thousands of dartships and the nest ships against the Chiss. A Galactic Alliance fleet lead by Gilad Pellaeon aboard the Star Destroyer Megador also came into the system to support the Jedi and the Chiss."}, {"tag": "p", "text": "Leia Solo, under the tutelage of Jedi Master Saba Sebatyne, trained officially to become a Jedi Knight and defeated Alema Rar (who had fallen under the sway of Lomi Plo's Dark Nest). Alema Rar was presumed dead, but her body was not recovered. Master Sebatyne relieved Leia of her lightsaber, proclaiming \"it is a terrible weapon, unworthy of her current skills.\" Leia was granted the full title Jedi Knight and was instructed to build a new lightsaber."}, {"tag": "p", "text": "In the end, though, it was Luke killing Lomi, and removing UnuThul from the Colony that ended the Dark Nest Crisis. Without the two fallen Jedi to provide direction and a will, the Colony could no longer function as it was."}, {"tag": "p", "text": "Things soon stabilized between the Alliance and the Ascendancy, with further diplomatic efforts convincing the Chiss to pull their fleets back. The Jedi decided to reestablish the Council, and the galaxy took another breather from the chaos of war."}, {"tag": "h2", "text": "Battles"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}