{"url": "Dark_Reaper", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Confederacy of Independent Systems", "Category:Sith weapons", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Dark Reaper"}, {"tag": "p", "text": "The Dark Reaper was a Sith superweapon created during the Great Hyperspace War (5000 BBY)."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Dark Reaper worked by harvesting the Force using the Force Harvester, a device that killed anything within range by draining its Force energy and focusing it into beams that dealt massive damage to any object. However, the Reaper could not harvest a wound in the Force."}, {"tag": "p", "text": "The Reaper was also equipped with dark side-powered turbolasers. In order to defeat the Dark Reaper, an ancient Jedi Knight named Ulic Qel-Droma taught the Jedi how to withstand the Dark Reaper's effects."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Great Sith War"}, {"tag": "p", "text": "A weapon of mass destruction, it was created by the Sith in an armory on Thule during the Great Hyperspace War and used against the Galactic Republic."}, {"tag": "p", "text": "During the Great Sith War, Exar Kun rediscovered it doing excavations on Yavin 4. As it needed massive amounts of energy to function, the Krath had it target the Living Force to provide power. When fallen Jedi Ulic Qel-Droma returned from the Krath he told the Jedi how to defeat the Reaper."}, {"tag": "p", "text": "The final battle was fought on the world of Thule, deep within the territory of the old Sith Empire. In a calculated strike, a Jedi task force staged an attack on the Dark Reaper and using Ulic's information, were able to disable the weapon. Breaking the deadly device apart, the Republic made great effort to hide the pieces on a myriad of different planets. They then hid the power source of the Dark Reaper, the Force Harvester, on the junkyard world of Raxus Prime."}, {"tag": "p", "text": "During the Great Galactic War, the Sith Emperor and Darth Malgus thought the Reaper was buried on Ord Radama."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Four thousand years later, during the Clone Wars, Count Dooku and his mercenary Cydon Prax scoured Raxus Prime for the Force Harvester. It was a vital part in reconstructing the Dark Reaper to destroy the Galactic Republic. He used Cydon Prax to activate the Force Harvester, destroying the forest on a Kashyyyk moon as a test of its power. To test its power, he planned to use it on captured Wookiees, Bera Kazan, and Anakin Skywalker, whom he'd captured on Raxus Prime. The wave of energy given off killed half of the thriving forest on the moon. Anakin and Bera barely escaped the wave, and then contacted the Republic to warn them of what Dooku had uncovered. Dooku then used the Harvester to collect energy on Dac, Agamar, and Bakura."}, {"tag": "p", "text": "Dooku searched the galaxy and found the pieces of the Dark Reaper. The exact locations are unknown, but Mace Windu stated that it was separated into the farthest reaches of the galaxy, making Outer Rim systems likely choices. Dooku then went to Thule and activated the Dark Reaper in an ancient Sith city on the planet."}, {"tag": "p", "text": "Dooku also deployed it on Dac. The death of millions caused the planet's inhabitants to cooperate with the Confederacy, including the deployment of Commander Merai."}, {"tag": "p", "text": "On Rhen Var, Anakin Skywalker went to the tomb of Ulic Qel-Droma for information on how to withstand the effects of Dark Reaper and the Harvester. Shortly after the Dark Reaper was revived, Anakin led an attack on the city and destroyed the Reaper using his TX-130 fighter tank, disobeying an order from Obi-Wan Kenobi to wait for backup. Although Anakin did manage to destroy the Reaper, the knowledge he gained from Qel-Droma caused him to act more arrogantly towards Obi-Wan, and indirectly led him to take a step towards the path to the dark side of the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}