{"url": "Dark_Reaper_campaign", "categories": ["Category:Legends articles", "Category:Battles of the Dark Reaper campaign", "Category:Military campaigns", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Dark Reaper campaign"}, {"tag": "p", "text": "The Dark Reaper campaign was the first extended campaign by the newly christened Dark Lord of the Sith Exar Kun, and his apprentice, the Sith Lord Ulic Qel-Droma."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Dark Reaper weapon itself consisted of two separate components: the Reaper's weaponry and the \"Force Harvester\" which powered it. After continued excavation on Yavin 4, Exar Kun chanced upon several weapons of the ancient Sith Lords from the defeated Sith Empire. The most powerful of these weapons was the Dark Reaper. This superweapon had the power to focus the Force into beams of energy to cause massive damage. This sucking of the Force also created a type of death threshold around the Dark Reaper which killed anyone within range of it."}, {"tag": "h3", "text": "Great Sith War"}, {"tag": "p", "text": "Apparently claiming a great number of Jedi lives before it was defeated, the device aided Ulic and the Sith fleet in capturing a large portion of space around the Empress Teta system. Ulic unleashed the Reaper on the Republic staging planet of Raxus Prime, killing thousands."}, {"tag": "p", "text": "The final battle was fought on the world of Thule, deep within the old Sith Empire. In a calculated strike, a Jedi task force staged an attack on the Dark Reaper and using Ulic's information, were able to disable the weapon. Breaking the deadly device apart, the Republic made great effort to hide the pieces on a myriad of different planets. They then hid the power source of the Dark Reaper, the Force Harvester, on the junkyard world of Raxus Prime."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During the Clone Wars, Count Dooku and his mercenary Cydon Prax scoured Raxus Prime for the Force Harvester. It was vital in the quest to reconstruct the Dark Reaper as part of the greater scheme to destroy the Galactic Republic. Dooku instructed Cydon Prax to activate the Force Harvester to destroy the forest on one of Kashyyyk's moons as a test of its power. The wave of energy killed roughly half of the thriving forest on the moon, along with its indigenous population."}, {"tag": "p", "text": "Count Dooku then departed and discovered the remnants of the Dark Reaper. The exact locations are not mentioned, but Mace Windu mentioned that it was separated into the farthest reaches of the galaxy. The Separatist forces congregated on and around Thule, where Dooku activated the Dark Reaper in an ancient Sith city on the planet. On Rhen Var, Anakin Skywalker journeyed to the grave of the long-dead Ulic Qel-Droma for information on how to withstand the effects of Dark Reaper and Force Harvester."}, {"tag": "p", "text": "Shortly after the revival of the Dark Reaper, Skywalker led an attack on the city, destroying the weapon, disobeying an order from Obi-Wan Kenobi to await Republic backup forces. Despite Anakin's almost single-handed defeat of the Reaper weapon, his feats in these battles served to fuel his ego and create an even greater personal rift between himself and his master."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}