{"url": "Dark_Side_Cave", "categories": ["Category:Legends articles", "Category:Caves", "Category:Dagobah locations", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Dark Side Cave"}, {"tag": "p", "text": "The Dark Side Cave, also known as the Cave of Evil, was a cave on Dagobah containing a powerful dark side manifestation of the force."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A cave of limestone and dirt, the Dark Side Cave was located deep in the equatorial swamps and contained a vergence in the Force as well as the apparition of a dark jedi. A focal point for the dark side of the Force, the cave challenged the perceptions of anyone who entered into its depths. Drawing visitors in, they often experienced visions of the past, future, or possible futures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Hundreds of years before the Clone Wars, the Jedi Minch battled and killed a powerful Bpfasshi Dark Jedi leader, and his energies absorbed into its surroundings, tainting the passage with the Dark Spirit."}, {"tag": "p", "text": "During the Clone Wars, Yoda had a vision of the Dark Side Cave during one of his meditations. In this vision, Qui-Gon Jinn had survived the battle of Naboo and had taken nine-year-old Anakin Skywalker as his Padawan. He guided Skywalker into the cave to face his fears, telling him the same thing Yoda eventually told Anakin's son, Luke, many years later, including telling Anakin that all that was inside the cave was \"Only what you take with you.\" Later, near the end of the Clone Wars, Yoda himself entered the cave under the guidance of Qui-Gon who had learned how to speak from beyond. Here, Yoda had visions of the fall of the Jedi Order and of the rise of Darth Sidious."}, {"tag": "p", "text": "During the Great Jedi Purge, Yoda realized that proximity to the Dark Side Cave could help neutralize his strong light side Force signature—thus preventing his detection by the Sith—and took up residence near the cave, living there for the next two decades, through the reign of the Galactic Empire. Soon after the exile, an Imperial scout named Keog Boorn investigated a signal near the cave. A hidden Yoda saw how the scout left the place after remembering about the Bpfasshi Dark Jedi and hearing some terrifying sounds. Keog Boorn left the planet and reported that there was nothing on Dagobah, the signal just an atmospheric disturbance."}, {"tag": "p", "text": "During the birth of the Rebellion, the clone of Starkiller spoke with Yoda briefly before entering the cave to look for the answers he sought. Inside, he was unable to use his Force powers, except for mind trick, which he utilized several times. He faced the Dark Spirit who took the form of several other clones of Starkiller and had to carefully traverse some deep pits. He made it deep into the caves, and received a vision of the assault on the Salvation. Starkiller exited the cave, and left the planet."}, {"tag": "p", "text": "In 1 ABY, the young Force-sensitive Zak Arranda accidentally led a group of cannibal younglings into the Cave. The Dark Spirit tortured them reenacting scenes of their past, when their parents were forced to nourish them upon their own flesh."}, {"tag": "p", "text": "When Luke Skywalker traveled to Dagobah to train with Yoda in 3 ABY, the elder Master tasked him to enter the cave. Luke confronted the Dark Spirit in the form of Darth Vader within and defeated it in a lightsaber duel, dipping into the passion of the dark side in the process. It was there that he realized what would happen if he turned to the dark side of the Force. Behind the mask of Darth Vader, he saw his own face. It also presaged the revelation that Vader was, unknown to him at the time, actually his father, Anakin Skywalker."}, {"tag": "p", "text": "Five years after Yoda's death, Luke Skywalker returned to the cave. This time, he had a vision of a possible past, one where Mara Jade accompanied Jabba the Hutt's retinue to the sarlacc. She was able to pull Luke's lightsaber away from him when his vision suddenly ended. While in the cave, he found a beacon left behind by Jorj Car'das. In 14 ABY, the dark side power of the cave was siphoned by the Disciples of Ragnos. This supposedly removed all of the dark energy, but it presumably returned to its source when the Scepter of Ragnos was destroyed or otherwise somehow regenerated itself. In 22 ABY, Anakin Solo, Tahiri Veila, and Uldir Lochett entered the cave after Anakin had a recurring nightmare of becoming the infamous Darth Vader. There, Tahiri encountered a vision of her parents and grandfather, and Anakin faced the manifestations of his own doubts. The two both emerged victorious. Uldir, who was not Force-sensitive however, encountered nothing in the cave but vast emptiness. Other Force-sensitive beings to enter the cave included Tash Arranda and Zak Arranda."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars Infinities: A New Hope, while under the Infinities label, establishes the tainting of the cave as happening some eight hundred years before the Battle of Yavin."}, {"tag": "p", "text": "Vision of the Future describes how Jedi Master Yoda battled and defeated another powerful Bpfasshi Dark Jedi inside the Cave. But, in Star Wars Insider 98, Leland Chee writes that this is no longer considered part of continuity because Yoda had never been on Dagobah before his exile. The concept of Yoda having never been on Dagobah prior to his exile was, in turn, later contradicted directly by \"Voices,\" an installment of the CGI animated series Star Wars: The Clone Wars, which revealed that Yoda had, in fact, been to Dagobah, having been summoned there by the spirit of Qui-Gon Jinn to learn about the path to immortality."}, {"tag": "p", "text": "In Battlefront II's Dagobah map, the cave is one of several command posts; inside it, players can hear Darth Vader's distinctive breathing sound."}, {"tag": "p", "text": "In The Story of Starkiller, a video documentary about the Star Wars: The Force Unleashed II video game, it is revealed that the location's name is The Cave of Evil, as stated by project lead Haden Blackman and executive producer Julio Torres."}, {"tag": "p", "text": "The gnarltree at the entrance to the cave is known as The Magic Tree, after the corresponding soundtrack cue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}