{"url": "Dark_Side_Adept", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Dark Side Adepts", "Category:Jedi hunters", "Category:Titles"], "nodes": [{"tag": "h1", "text": "Dark Side Adept"}, {"tag": "p", "text": "Dark Side Adept was a generic term used to describe any Force-sensitive individual who used the dark side outside of the established traditions of the Jedi and the Sith, either as a tribalistic shaman, an itinerant mystic, or in the service of an established ruler. Dark Side Adepts were often found at the sides of monarchs whose dominion was fortified with dark side teachings, and usually acted as royal guards or advisors."}, {"tag": "p", "text": "Most Dark Side Adepts had a basic affinity for the Force, and had received rudimentary training in the ways of the dark side. While the Masters of these darksiders were most often directly affiliated with the Sith, the Adepts themselves usually were not."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The prominence of Dark Side Adepts dated back as far as the ancient aristocracy of Onderon, under the leadership of Queen Amanoa and her husband, King Ommin, in whose service acted as Royal Guards. While both the King and Queen preferred to employ Adepts as their personal royal protectors, their Naddist army's enlistment consisted mostly of Dark Side Adepts as well. The only well known Adepts under Ommin and Amanoa's service during that time were Ommin's personal aide Novar, and the Dark Jedi Warb Null. After the Freedon Nadd Uprising, nearly all of Onderon's Dark Side Adepts were wiped out; however, by 3997 BBY some were still alive and practicing dark side traditions. Darksiders Rask and Nebo were two such individuals."}, {"tag": "p", "text": "During the tenure of the Galactic Empire, any darksider other than Darth Vader and Emperor Palpatine (Darth Sidious), the current Dark Lords of the Sith, was considered a Dark Side Adept. More specifically, the term referred to any darksider in an administrative position within the Galactic Empire, especially after Emperor Palpatine's resurrection into clone bodies. The exact number of Adepts during Palpatine's reign remains unknown; however, it is known that the total number of his Adepts exceeded six hundred."}, {"tag": "p", "text": "Palpatine planned to eventually replace all officials in the Galactic Empire with Dark Side Adepts. The highest ranking Adepts were the members of the Inquisitorius. Other Adepts included the Prophets of the Dark Side, the Emperor's Hands, the Dark Side Elite, the Byss Mages, the imperial Force Adepts, several of the Imperial Sovereign Protectors, the Emperor's Shadow Guards, several of the Emperor's Royal Guards, the first generation of Imperial Sentinels, the Saber Guards, the Imperial Sith Acolytes, Senior Dark Side Adepts, the Nightsister Sith witches, the Brothers of the Sith, the Terror Biodroid, the Seven Dark Jedi, the Aberrant Clone, the Order of Shasa (during the Galactic Civil War, at least) and various Imperial Dark Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}