{"url": "Dark_Side_pyramids", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Temples"], "nodes": [{"tag": "h1", "text": "Dark Side pyramids"}, {"tag": "p", "text": "The Dark Side pyramids were a group of six highly ornate, massive stepped pyramidal stone structures of obviously complex construction which rose above the trees on an unknown jungle planet once visited by the Interstellar Survey Corps which were completely abandoned and heavily overgrown by the time of the Galactic Civil War, with some of them showing signs of serious disrepair and decay. They surrounded a 100 meter by 200 meter rectangular, stone-surfaced plaza. On top of each pyramid was the ruins of what were once ornate temple structures. The pyramid at the very end of the plaza was considerably larger than all the others, as was the temple atop it. Surrounding these pyramids was the remains of what was once a city which had also fallen down and become overgrown by the encroaching jungle by the time of the Galactic Civil War. There was few massive stone sculptures at the site, but there was considerable architectural embellishment and relief structure which portrayed a short, stocky, bidepal race which had large eyes and ears. The scenes depicted in these depicted six priests who were greatly revered by the inhabitants of the city as well as several battle scenes which showed the priests standing over sacrificial victims. It displayed the priests holding their hands out towards their victims who appeared to be writhing about in pain, clutching at their throats while what appeared to be their \"souls\" or \"spirits\" leaving their bodies in a semi-vapourous state. At the top of the largest pyramid, two meters from the edge of the steps, was a two meter by six meter pit which was ten meters deep. Above this was the Altar of the Dark Side, where many victims had been sacrificed. Sometime during the Galactic Civil War, a team of Rebels led by a Jedi discovered the planet and investigated the pyramids, being attacked several times by the Dark Side wraiths before reaching the top of the pyramid and the Altar."}, {"tag": "h2", "text": "Sources"}]}