{"url": "Dark_illusion", "categories": ["Category:Canon articles", "Category:Dark side powers", "Category:Force rituals", "Category:Mind-affecting powers"], "nodes": [{"tag": "h1", "text": "Dark illusion"}, {"tag": "p", "text": "The Force power of dark illusion gave its user the ability to manipulate Force visions to directly attack a selected target. Dark illusion was summoned through an ancient Sith ritual using both the connection of a Force-bond, one coming from someone with a link to the target, and reciting a Sith incantation in the old Balc language. Compounded with the blood of the bonded and Force lightning, as well as the dark side of the Force, dark illusion could reach its intended victim from across the galaxy."}, {"tag": "p", "text": "During the galactic conflict known as the Clone Wars, the Dark Lord of the Sith Darth Sidious used dark illusion to attack Grand Master Yoda of the Jedi Order, exploiting his Sith apprentice Darth Tyranus' bond to Yoda for the ritual. Also using the power of the long-deceased Sith Lord Darth Bane's tomb, Sidious was able to, while on Coruscant, reach Yoda on Moraband, the ancient homeworld of the Sith."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Force power known as dark illusion was one born out of the dark side of the Force. This ability allowed the wielder to manipulate Force visions to affect a selected target. To harness dark illusion, an ancient Sith ritual was required. This involved the blood of someone who was Force-sensitive and had a Force-bond with the intended victim. The bonded one then needed to focus on their bond with the target, and once the blood was drawn, it had to be compounded with an array of Force lightning in a sacrificial altar basin. An old Sith incantation was spoken in the Balc language to complete the ritual, at which point dipping one's face in the powered basin would allow one to access dark illusion. The resulting Force visions could be used to impersonate specific individuals, resembling them in both physical appearance and voice. The illusion could also be amplified using a source teeming with dark side energy, and could make the affected target believe that they were elsewhere during these visions."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "The art of dark illusion was ancient, known only to a few Sith. When the Dark Lord of the Sith, Darth Sidious, sensed that Jedi Master Yoda was on Moraband, the ancient Sith homeworld, he sought answers to why the Jedi had ventured there and also hoped to break the Grand Master's will. For this reason, he conjured the power of dark illusion, using his own sacrificial altar basin from a lair on Coruscant. As Yoda traveled into the tomb of Darth Bane, an archaic Sith Lord from a thousand years prior, Sidious further amplified the dark illusion's power with the power of the tomb, which had been used as a Jedi sacrificial chamber in centuries past. This power allowed Sidious to tempt Yoda using familiar scenarios in the visions that followed. Ultimately, Sidious sought to subjugate the galaxy, but once Yoda refused the Sith Lord's temptations and visions, he knew he needed more time before the Jedi could be defeated and the Sith could return to power."}, {"tag": "h2", "text": "Users"}, {"tag": "p", "text": "During the Clone Wars, a conflict that tore apart the galaxy and divided the Galactic Republic, the Sith Lord Darth Sidious and his Sith apprentice, Darth Tyranus, used the ritual to summon the power of dark illusion. Sidious closely guarded his Sith identity, acting as the Supreme Chancellor of the Republic Palpatine, as did Tyranus, who was publicly known as Count Dooku, the leader of the Separatist Alliance. When they both felt the presence of Master Yoda, Dooku's former teacher, on the planet Moraband, Dooku was called to Coruscant to confer with his Sith Master."}, {"tag": "p", "text": "In an abandoned industrial sector of Coruscant known as The Works, Sidious informed his apprentice that they would be exploiting Dooku's Force-bond with Yoda, which the two had established during their time together in the Jedi Order, to find out why Yoda had ventured to Moraband and to break his will; prior to Yoda's arrival on Moraband, only the Jedi Council member Ki-Adi-Mundi suspected that the Sith were capable of exploiting Yoda's bond to Dooku. Over a sacrificial altar basin, Sidious cut Dooku with a knife to draw his blood, dripping it into the water-filled basin, and recited the Sith incantation in Balc. Together the Sith Lords then jolted the basin with Force lightning, and once Dooku focused on his bond with Yoda, Sidious harnessed the power of dark illusion. When Dooku expressed concern over Yoda sensing their presence, Sidious said he would come to Yoda in the face of someone familiar as he dipped his face into the sacrificial altar."}, {"tag": "p", "text": "Sidious pretended to be the long-dead Jedi Master Sifo-Dyas, imprisoned in the tomb and sacrificial chamber of the ancient Sith Lord Darth Bane through his vision to Yoda. Sidious tempted the old Jedi Master with an opportunity to—at last—learn Darth Sidious's true identity, since the Jedi were aware only of his existence. When Yoda refused, Sidious entranced Yoda further by using the power of the tomb to enhance his illusion and make the Jedi Master believe himself to be back on Coruscant. Yoda found himself in the presence of Jedi Knight Anakin Skywalker and a squad of clone troopers from the Grand Army of the Republic's 501st Legion, in an ongoing pursuit of both Dooku and Sidious in the Works. When the Jedi cornered the two Sith Lords in the illusion, the 501st troopers were quickly incapacitated and, in turn, Skywalker beheaded Dooku as Yoda pursued the hooded Sidious. The two briefly dueled before the vision of Sidious threatened to kill Skywalker while simultaneously attacking Yoda. The Jedi Master was then presented with a choice: either learn the identity of the Sith Lord once and for all or save Skywalker, whom Sidious had thrown off a catwalk. Yoda chose the latter and sacrificed himself, falling into the depths of Coruscant with the vision of Sidious as the dark illusion fell apart."}, {"tag": "p", "text": "After the illusion ceased, Sidious arose from the altar basin and informed Dooku that they had failed to break Yoda's will, and that they would need more time to defeat the Jedi. Unbeknownst to either of the Sith, Yoda had been put on trial by the ethereal Force Priestesses to learn the secret to immortality, and had passed when he defeated the dark-siders he encountered, including Sidious's own dark illusion. In addition, despite Dooku's presence throughout the ritual, only Sidious was in control of the visions presented to Yoda, leaving Dooku unaware of the foreshadowing of his own death or of Skywalker's eventual fall to the dark side. Near the end of the Clone Wars, Skywalker killed Dooku in the same manner he had slain the count in Sidious's dark illusion. Dooku's death became one of Skywalker's first steps into becoming Darth Vader, Sidious's new Sith apprentice, prior to the beginning of the Great Jedi Purge, which fulfilled Sidious's plot for the revenge of the Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dark illusion Force power debuted in \"Sacrifice,\" the thirteenth episode of The Lost Missions, which was released as the sixth and final season of the Star Wars: The Clone Wars television series. Dark illusion was first identified by name in the \"Sacrifice\" episode gallery on StarWars.com. In the episode's script, the Sith incantation spoken by Sidious was noted as \"Balc speech\" and was written out as \"Kintik hadzuska sutta chwituskak! Kintik hadzuska sutta chwituskak! Jiaasjen Jidai, jiassjen Jidai!\". Darth Sidious, who recited the Sith incantation in Balc to summon the power of dark illusion, was voiced by Tim Curry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}