{"url": "Dark_purple_traveling_dress", "categories": ["Category:Canon articles", "Category:Clothing stubs", "Category:Dresses", "Category:Padmé Amidala's wardrobe"], "nodes": [{"tag": "h1", "text": "Dark purple traveling dress"}, {"tag": "p", "text": "The dark purple traveling dress was a Naboo outfit worn by Queen Amidala. It had purple cerlin sleeves and was ornamented with shoulder decorations on the darker purple velvet overdress. It was paired with an antique tiara embossed with the Naboo royal emblem and a mauve chersilk hair veil with two hanging sections in front criss-crossed by drapa bindings."}, {"tag": "p", "text": "During the Trade Federation's Invasion of Naboo, Amidala traveled to the Galactic Republic's capital on Coruscant to plead for aid from the Galactic Senate. Despite all her efforts, Amidala was unable to secure help from the Republic quickly enough to save her people. On the journey home to Naboo in her royal starship, her handmaiden Sabé assisted her in dressing while the other handmaidens packed the queen's wardrobe. Amidala wore the somber traveling gown in recognition of her people's suffering, and she wore it again at the funeral of the Jedi Qui-Gon Jinn, who died in the fight for Naboo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dark purple traveling dress was created for the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. The finished costume was created by costume designer Trisha Biggar and her department. The paneled velvet overdress was covered with a discharge-printed Naboo pattern and fastened at the shoulders and neck with matching velvet buttons. It parted over a pleated silk underdress, which was worn over layers of stiffened petticoats. Under the overdress were the petal-shaped undersleeves, which were made of a double year of shot-silk chiffon satin, and fitted finger-length corded inner sleeves. The veils were made from chiffon, and the headdress was gold, embossed with the Naboo emblem."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}