{"url": "Darker", "categories": ["Category:Legends articles", "Category:Force entities", "Category:Males", "Category:Pre-Republic"], "nodes": [{"tag": "h1", "text": "Darker"}, {"tag": "p", "text": "The Darker was a being who was composed of the dark energy of the Arbran people, and existed for millennia trapped in an underground city on the planet Arbra. When the Alliance to Restore the Republic constructed a base on the planet, he attempted to escape using captured droids, but he was thwarted and destroyed by the Rebels Chewbacca, C-3PO, and Plif."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Eons before the Galactic Civil War, the Arbrans who originally inhabited the planet Arbra had discovered a method to rid themselves of the emotions of anger, hatred, and fear. But when they removed the dark energy from their bodies, it manifested itself into a sapient being that called himself the Darker. The Arbrans could not bring themselves to destroy the Darker because, despite the fact that he was evil, he was still a part of them. Instead they imprisoned the malevolent creature in an underground city using a force screen, and they abandoned Arbra leaving their evil aspect behind. Over the millennia, a new telepathic species developed on Arbra called Hoojibs. The Hoojibs made their home beneath the surface of the planet, but had never entered the tunnel leading to the Darker's prison because they sensed great evil there."}, {"tag": "p", "text": "Following the Battle of Hoth, the Rebel Alliance established their new base of operations on Arbra. The Darker detected that the Rebels had the technology to free him from his prison so he devised a plan to lure the astromech droid R2-D2 into his city with a feigned plea for help. He captured and disassembled the droid intending to use the components to build a mechanism to disable the force screen which held him captive. Soon more Rebels entered the Darker's city as Chewbacca, C-3PO, Plif, and several other Hoojibs investigated Artoo's disappearance. The Darker intended to dismantle Threepio as well, and used his powers over dark emotions to bring forth hatred in Chewbacca toward C-3PO. But the protocol droid was able to overcome the Darker's influence over the Wookiee by calling upon Chewbacca's loyalty to Han Solo."}, {"tag": "p", "text": "Threepio discovered an ancient Arbran text which revealed the Darker's weakness: the power of the force screen which held the Darker within the city would destroy him if he contacted it. Chewbacca then grasped the Darker and hurled him into the force screen, destroying the abomination, and the screen imploded, razing the ancient city to the ground."}, {"tag": "h2", "text": "Physical appearance"}, {"tag": "p", "text": "The Darker appeared as a green-skinned, biped male humanoid. He had two pairs of arms, a primary pair and a smaller secondary pair which he usually kept hidden beneath his cloak. It is not known whether the Darker's physical appearance in any way reflected the appearance of the Arbrans who created him; he could be more typical of a space wraith or a starweird, rather than a dark side Force-ghost."}, {"tag": "h2", "text": "Special abilities"}, {"tag": "p", "text": "The Darker could float in the air to move about his city, and he had control over dark emotions in living creatures within the confines of the force screen. He was able to heighten beings' fear and anger by making visual contact, although the effect was temporary and apparently required some concentration to maintain. Additionally, this control could be broken by a strong external emotional trigger that would overcome the dark emotional influence. The Darker was also exceptionally resistant to physical attacks; he was struck directly by a shot from Chewbacca's bowcaster at short range with no apparent ill effects."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}