{"url": "Darkstick", "categories": ["Category:Legends articles", "Category:Cultural weapons", "Category:Edged weaponry", "Category:Thrown weaponry"], "nodes": [{"tag": "h1", "text": "Darkstick"}, {"tag": "p", "text": "The darkstick was a weapon unique to the Kerestian people. Wickedly curved to aid slicing, the darkstick was used by the struggling Kerestians to hunt game along their barely hospitable home planet's equator."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Though developed by a spacefaring species, the darkstick was surprisingly primitive in construction and design; weaponsmiths employed lightweight metal to individually craft darksticks, though evidence exists that extinct hardwoods were once used. As a result of their independent creation, darksticks varied significantly in size—some were fifteen-centimeter blades concealable in a sleeve, while others were massive, two handed weapons primarily used for bashing and chopping. The typical design, however, was twenty centimeters long and could fit between a Kerestian's enormous knuckles. Light absorbing cells were also used in darksticks."}, {"tag": "h3", "text": "Usage"}, {"tag": "p", "text": "Attacks consisted primarily of slashing, as the darksticks fit into Kerestian hands like claws. Hunters were armed with several in each hand, transforming into unstoppable killing machines. The darkstick's sweeping curve opened the possibility of throwing the weapon. This was extremely difficult and only the most experienced hunters attempted this; however, a master of this technique could execute powerful assaults from a range of twenty meters. Even harder to learn was the ability to throw the darkstick in such a fashion that it returned to the user's hand. The tactical value of this skill was not underestimated by the Kerestian weaponsmiths, who experimented with metallic systems that automatically recalled a dispatched darkstick to the user's hands. Darksticks could be further modified to explode, and poison was frequently applied to the blade's hollow tip."}, {"tag": "p", "text": "Kerestian legends played into both the application and function of the darkstick. Mythology held that following the death of the body, souls were doomed to wallow in the Great Darkness for all eternity. Kerestians were unafraid of such torment; indeed, they welcomed it by attaching symbolism to darksticks. The weapons were silent and deadly, sometimes painted black to constantly remind the wielder of their fate. Through modern technological advances, weaponsmiths built upon the shadowy image by implanting webs of light-absorbing cells into darksticks. Upon activation, a shroud of blackness descended upon the weapon, its bearer, and anyone else close enough and unfortunate enough to face a Kerestian warrior. The victim was blinded, but the warrior was not; they wore infrared goggles to remain at top efficiency."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galaxy Guide 12: Aliens — Enemies and Allies first described the blade of the darkstick as a beam of \"black light,\" similar to a lightsaber. Ultimate Alien Anthology repeats this description of the darkstick as an energy weapon. This article's description of the darkstick as a solid blade comes from the more recent depiction in The New Essential Guide to Weapons and Technology and Galaxy at War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}