{"url": "Darkwalkers", "categories": ["Category:Legends articles", "Category:Criminal organizations", "Category:Darkwalkers", "Category:Naboo organizations"], "nodes": [{"tag": "h1", "text": "Darkwalkers"}, {"tag": "p", "text": "The Darkwalkers were one of the many criminal gangs that infested Naboo during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Battle of Yavin, the Darkwalkers were considered by the RSF Intelligence Division as one of the four major criminal groups on Naboo, along with the Skaak Tippers, the Nal Raka Criminal Empire and the Mummers. The Darkwalkers had hostile relationships with Borvo's organization and the Skaak Tippers."}, {"tag": "p", "text": "After the Battle of Yavin, the Darkwalkers kidnapped Karl Eckener because of gambling debts. However, Eckener was indebted to the Darkwalkers and the Skaak Tippers and both criminal groups blackmailed Karl Eckener's father, Hugo Eckener.  Circa 1 ABY, they forced Hugo Eckener to hire spacers in order to attack Borvo Bunker. The Darkwalker adjutant Jorgellansel later ordered them to attack the Skaak Tipper Compound while the Skaak Tipper Toff Henrou ordered the spacers to attack the Darkwalker Cave. Nevertheless, Karl Eckener was never freed by the criminals. Hugo Eckener requested RSF agents to liberate his son by force. Bloodlord Marcus Gaw, aegis guard Solon Gaw and underlord Critolus Masse were killed during the assault and Karl Eckener was freed."}, {"tag": "p", "text": "Later, the Darkwalkers shot down a shuttle near Dee'ja Peak in order to steal a bio-scanner. The shuttle crashed in the Gallo Mountains and the Darkwalkers plundered the wreckage. Their objective was to use the bio-scanner to make a bomb that would remain inert until its target with the programmed bio-signature came nearby. A spacer working with the scientist Tanoa Vills then raided the Darkwalker Cave nearby to recover the stolen bio-scanner. Bloodlord Trienial and Chief of Science Flangolial were killed during the assault."}, {"tag": "p", "text": "Boss Rugor Nass later sent a spacer to recover a Gungan artifact that the Darkwalkers had stolen. The spacer killed the Darkwalker Bloodlord Vran Tristen in the Darkwalker Bunker and recovered the artifact."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}