{"url": "Darlyn_Boda/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Anoat sector planets", "Category:Corellian Trade Spine", "Category:Darlyn Boda locations", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Jungle planets", "Category:Shadowports", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Darlyn Boda"}, {"tag": "p", "text": "Darlyn Boda was a criminal trading planet and shadowport originally settled by the Galactic Republic, in the distant Darlyn Boda system of the Anoat sector, located at the far end of the Corellian Trade Spine in the Outer Rim Territories. Known for its humid, twisting jungles, bubbling mud pits, hanging clouds of steam, and a place where the credit was king, Darlyn Boda was a lawless world complementing perfectly the Greater Javin region in which it rested, an area of space negatively publicized for its pirate activity. Although Darlyn Boda fell under Imperial control during the Galactic Civil War, the planet played host to a number of groups, including the Alliance to Restore the Republic, the crime syndicate Black Sun, and the Bounty Hunters' Guild. In 3 ABY, the bounty hunters Zuckuss and 4-LOM delivered a group of ninety Echo Base refugees from the Battle of Hoth, including Toryn Farr, to Darlyn Boda's large Rebel underground."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Darlyn Boda was a steamy, crime-ridden shadowport world in the Darlyn Boda system of the Anoat sector in the Outer Rim Territories. Located at the far end of the Corellian Trade Spine hyperlane, a great distance from the Galactic Core, the planet was a part of the Greater Javin, a region of space known for its relative independence from galactic concerns and politics, as well as being a hotbed for piracy. Darlyn Boda lay just outside the Ivax Nebula, where the Anoat sector bordered the Yarith sector, at the crossroads of the Spine and another Rimward route connecting it with the planet Lutrillia. Darlyn Boda was an approximate half-day hyperspace trip from the nearby planet Hoth, in the direction of the Hydian Way."}, {"tag": "p", "text": "Known for its vast, thick jungles, bubbling mud pits, clouds of hanging steam, an impressively humid, rainy climate, and shadowy cities, Darlyn Boda was a lawless world where money reigned supreme. Still, violence was considered a last resort for dealings gone awry. The planet itself had a standard day of twenty-four standard hours and a year lasting 503 local days."}, {"tag": "p", "text": "The toccat, a beast with four hooves, a long, pink snout, a barrel-shaped body, and black, bristled hair, was native to the deepest thickets of Darlyn Boda's tangled jungles. The planet's local haruspexes used the toccat in their fortune-telling business. The price for captive toccats was exorbitant."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic settlement"}, {"tag": "p", "text": "A thousand years prior to the Battle of Yavin, Darlyn Boda lay in a largely uncharted area of space beyond the fringes of the Mid Rim, considered then a part of Wild Space. At a time before the Corellian Trade Spine extended past the planet Javin at the border of the Mid Rim, only scouts and the most daring traders traveled the area of space surrounding Darlyn Boda."}, {"tag": "p", "text": "Charting Darlyn Boda's region proved difficult as a result of the sprawling Twin Nebulae gas clouds that dominated the area, which restricted hyperspace travel. Only a short war between the Galactic Republic and the local Mugaari paved the way for Republic cartographers to map the Greater Javin, eventually leading to the settling of Darlyn Boda and a number of other worlds. Republic traders continued to search for safe travel routes through the nebulae, staging their efforts from Darlyn Boda and the region's surrounding planets, but it would be centuries before scout ships of the businessman Ecclessis Figg forged shortcuts through the Twin Nebulae. Their success turned Darlyn Boda's region into a booming economic force."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Darlyn Boda eventually developed into a criminal trading world. Although Javin remained the only planet acting as an Imperial stronghold in the Greater Javin during the Galactic Civil War, by early 3 ABY the Empire did control Darlyn Boda's government. Despite being an Imperial world, elements representing the Alliance to Restore the Republic, the criminal organization Black Sun, and the Bounty Hunters' Guild freely operated on Darlyn Boda, all equally suspicious of one another. In fact, Darlyn Boda boasted a large Rebel underground thriving under the Empire's nose in addition to its prevalent criminal presence."}, {"tag": "p", "text": "In the years preceding the Battle of Yavin, the protocol droid 4-LOM, working as a valet and Human-cyborg relations specialist aboard the luxury liner Kuari Princess, jumped ship when the vessel reached Darlyn Boda. 4-LOM had learned to override his droid programming, stealing and valuing wealth as well as any greedy sentient being after growing discouraged with a wealthy passenger, Dom Pricina, who he constantly found absentmindedly leaving jewelry lying around the ship. Specifically, 4-LOM grew concerned for the Ankarres Sapphire, a rare jewel fabled for its healing abilities. He regarded Pricina as incompetent and stole the sapphire for its own safekeeping rather than allowing her to lose it as he knew she would. At Darlyn Boda 4-LOM consigned the Ankarres Sapphire and several other stolen jewels, embarking on a career devoted to crime."}, {"tag": "p", "text": "4-LOM returned to the crime world years later when, in 3 ABY, working then as a bounty hunter, he and his Gand partner, Zuckuss, rescued the Rebel survivors of the destroyed GR-75 medium transport Bright Hope at the Battle of Hoth. While the hunters originally planned to capture the Rebels and collect on their Imperial bounties, Rebel Toryn Farr convinced them to deliver her, her sister, Samoc Farr, and the Bright Hope's eighty-eight other survivors to Darlyn Boda's nearby Rebel underground, where they would find sanctuary from the hounding Imperial Navy."}, {"tag": "p", "text": "Upon landing on the planet, 4-LOM ventured into the city of Darlyn Boda, returning to the same jewel shop where he had pawned the Ankarres Sapphire to an old woman years before. 4-LOM was relieved to learn that the shop proprietor had sold each of his jewels except the sapphire, which he retrieved and provided to Samoc Farr so she may treat her injuries sustained at Hoth. Meanwhile, Toryn Farr had linked up with Darlyn Boda's Rebel cell, handing over care of the Bright Hope's survivors to the cell's leadership. After spending several weeks on Darlyn Boda, 4-LOM and five other Rebels, including the Farr sisters, departed from the planet for the Rebels' predetermined rendezvous point beyond the galactic plane, where the Alliance had regrouped following the Hoth retreat."}, {"tag": "p", "text": "Sometime during the time frame following the Battle of Hoth and the establishment of the New Republic in 4 ABY, Figg Excavations, a subsidiary of the Outer Javin Company, sought to break from its membership in the Mining Guild. They thus dispatched an operative to Darlyn Boda to hire pirates to hit Greater Javin shipping, including FiggEx's own ships, a ruse that would allow them to seek protection from the Anoat sector government and allow them to leave the Mining Guild. After ships begin to disappear from the area's trading lanes, rumors surfaced among Darlyn Boda's populace concerning the reemergence of the notorious pirates Clabburn the Elder and Salmakk, both of whom hadn't been heard from in the Greater Javin for years. In response to the missing FiggEx transports, the Mining Guild set up a temporary office on Darlyn Boda for the Guild Enforcers, a paramilitary agency, as part of an investigation into the matter, hoping to hire a group of smugglers or bounty hunters to go after the two pirates."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Darlyn Boda's lawlessness created a breeding ground for unsavory criminal elements, numerous intrigues, and various groups looking to serve their own ends, including the Rebellion and agents of Prince Xizor's Black Sun crime syndicate, as well as contacts from Figg Excavations and agents of the Mining Guild during the hunt for the pirates Clabburn and Salmakk. By the time of the Galactic Civil War, the planet thrived with a mixed-species population of 200 million."}, {"tag": "p", "text": "Darlyn Boda boasted a booming grassroots industry offered by local haruspexes—entrail-reading. Presenting the entrails of a freshly killed toccat, a native animal, to these fortune tellers would result in a prophetic reading proving to be highly specific and surprisingly accurate. A good way to glean information, Darlyn Boda's haruspexes nevertheless rarely had live toccats caged and ready for sacrifice. Obtaining an entrail-reading might very well have required a trip into the planet's jungles to capture a toccat."}, {"tag": "p", "text": "Among the volatile brew inhabiting Darlyn Boda was the famous Corellian information dealer Nogo Sistek, who could normally be found within Pepper's Pax, a local restaurant in the city Darlyn Boda, and the female Yarkora arms smuggler Sheryc Seka, always staying alert for people asking too many questions about her pirate boss Salmakk."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The planet was known for its humid, sweaty jungles, mud holes, and lawless cities. The city Darlyn Boda, with its shadowy streets, presented a ripe criminal environment, of which the bounty hunting droid 4-LOM took advantage in beginning a life of illegality. Located in the city was a small jewel shop serving Darlyn Boda's criminal element. The shop was filled with a number of glittering gems, including the Ankarres Sapphire for a number of years surrounding the beginning of the Galactic Civil War."}, {"tag": "p", "text": "Pepper's Pax, a combination restaurant and tavern, was located in the city Darlyn Boda at the end of a muddy alleyway, positioned between the jewel shop and a mortuary. A favorite gathering place of the planet's criminal inhabitants of every denomination, the bar had only two rules, enforced by Pepper's quill-covered bouncers: no fighting and no cowards. Consequently, as a result of the second rule, all newcomers were required to eat a mouthful of firespice vegetable pods. Those failing the intestinal fortitude check were ejected. Patrons considered Pepper's Pax to be neutral ground, and it served as a good spot for information brokers, such as Nogo Sistek. Sheryc Seka was another Pepper's regular."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Darlyn Boda first appeared in M. Shayne Bell's short story Of Possible Futures: The Tale of Zuckuss and 4-LOM, first published in 1996 as part of the anthology book Tales of the Bounty Hunters. Darlyn Boda served as the locale where 4-LOM would first embark on a life of crime, as well as where he would return years later on a path to redemption."}, {"tag": "p", "text": "The subsequent Wizards of the Coast Star Wars Roleplaying Game supplements, Galactic Gazetteer: Hoth and the Greater Javin and Rough and Tundra, expanded Darlyn Boda's history based on the information previously presented in Of Possible Futures, providing a number of planet-specific details for Darlyn Boda and establishing several other planets to be located in the surrounding Greater Javin region."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}