{"url": "Darmas_Pollaran", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles that are known by a nickname", "Category:Articles with gameplay alternatives", "Category:Gamblers", "Category:Humans", "Category:Imperial Intelligence personnel of the resurgent Sith Empire", "Category:Information brokers", "Category:Males"], "nodes": [{"tag": "h1", "text": "Darmas Pollaran"}, {"tag": "p", "text": "Darmas Pollaran was the alias used by a Human male Imperial Agent who went undercover in the Coruscant Underworld as a womanizing, gambling pazaak player and Information broker during the Cold War. In his new identity, Pollaran, under the orders from the Voidwolf, coaxed Senator Bevera Dodonna to aid them in their bid to create a pro-Sith Empire pirate fleet, in exchange for her own planet to rule. He was also suspected to help in the establishment of the Migrant Merchants' Guild."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Known as a inveterate gambler and information broker, Darmas Pollaran operated out of the Dealer's Den in the Old Galactic Market. He charged a high premium for his data and contacts, supplementing that sizable income with his impressive winning streak gambling at the card game known as sabacc."}, {"tag": "p", "text": "In 3643 BBY he was visited by the smuggler later known as Voidhound and Corso Riggs who traveled to Coruscant in search of Skavak and the former's stolen starship. Pollaran assisted the two in tracking down the ship and retaking it from Skavak."}, {"tag": "p", "text": "In 3642 BBY, Pollaran contacted the Voidhound after the smuggler had become famous for finding Nok Drayen's lost treasure and invited them to Port Nowhere. When the Voidhound arrived, Pollaran was being held captive along with Senator Bevera Dodonna by Rogun the Butcher's lackeys. The Voidhound managed to fight through Rogun's underlings and free the captive pair, after which Pollaran explained that he had gone legitimate, working for Dodonna. He also claimed that Rogun was working for the Voidwolf, the Imperial Grand Admiral who sought to dominate the galactic underworld. In return for rescuing them, Dodonna appointed the Voidhound a Republic privateer to take on the jobs the respectable military couldn't."}, {"tag": "p", "text": "Pollaran acted as the Voidhound's liaison on Balmorra. He told the smuggler that they were to steal Project Nebula, a former Republic operation of weapons development, abandoned when the Empire took the planet, the latter then taking over the project and intending to use the prototype weaponry against the Republic itself."}, {"tag": "p", "text": "After the Voidhound completed a mission on Hoth for Dodonna, Pollaran summoned his associate back to Port Nowhere to discuss a mutually beneficial business opportunity. He introduced the Voidhound to Vaz Traniff, an enemy of Rogun. The plan was to rescue Traniff's vault cracker, Combo, from Rogun, so they could raid an Imperial treasury ship, the King's Ransom. It would be profitable, a service to the Republic and the Voidhound could do some damage to Rogun's organization."}, {"tag": "p", "text": "After the success of the heist, narrowly escaping the destruction of the treasury ship by the Voidwolf, and saving Dodonna from Rogun's assassins, the Voidhound went to Port Nowhere to meet with Pollaran. Senator Dodonna decided to further enlist the Voidhound's services in taking down Rogun when Darmas got the Senator on holocall, forcing her to pull out of a Senate vote. Pollaran then informed her that the cybernetic beasts that Rogun's assassins used in their attack on her were native to the planet Voss. As the export of Voss fauna had not been legalized, it was obvious that they were smuggled. Dodonna claimed that Voss was only a recent discovery and it would take her time to grant the Voidhound a landing permit. Pollaran added that the only one who knew all of Rogun secrets was his mentor, Ivory, and he disappeared years ago. But Dodonna revealed that Ivory was being kept in a secret Republic prison on Belsavis. The Voidhound proceeded to track down Ivory during a mass-prison breakout orchestrated by the Empire, managing to learn the locations of all of Rogun's safehouses across the galaxy, which Pollaran proceeded to research. After the Voidhound shut down Rogun's smuggling ring on Voss, Pollaran informed the smuggler that Rogun was rallying his remaining lieutenants to his safehouse on Tatooine."}, {"tag": "p", "text": "However, Pollaran soon revealed himself as an agent of the Voidwolf, who had managed to convince Dodonna to turn traitor and support the Empire in exchange for a planet of her own. The Voidwolf showed the Voidhound and Rogun a hologram of the exchange between the two before the smuggler actually knocked off the Butcher. With Rogun's help, the Voidhound survived the betrayal and tracked down Pollaran on Corellia. Pollaran had infiltrated the Corellian Resistance and had duped rebel leader Nevis Kitt into attempting to clear out supply tunnel 26, making him think that it would give the resistance an opening, when in fact it'd be for the Empire."}, {"tag": "p", "text": "When confronted by the Voidhound while hosting a resistance rally, Pollaran quickly attempted to turn the crowd against the former, claiming that the smuggler was an agent of the Voidwolf. However, the Voidhound managed to convince the resistance of Pollaran's true allegiance. With his cover blown, Pollaran called for reinforcements, which showed up in the form of assassin droids, which gave cover for his escape. Pollaran made his way to Councilor Caicos' factory, now a makeshift Imperial medical center, in Labor Valley, to get plastic surgery to change his identity and disappear. However, the Voidhound tracked him down and arrested him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darmas Pollaran is a character in the 2011 Star Wars: The Old Republic video game, voiced by James M. Connor."}, {"tag": "p", "text": "Alternatively, the Smuggler can allow Darmas to go free in exchange for information about senator Dodonna and a key to unlock a locker on Port Nowhere."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}