{"url": "Darth", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Darths", "Category:Sith ranks"], "nodes": [{"tag": "h1", "text": "Darth"}, {"tag": "p", "text": "Darth was a title that preceded the moniker of a Sith Lord. Predating the history of the Rule of Two, it was used by ancient Sith such as Darth Atrius, Darth Caldoth, and Darth Noctyss. The Darth title was preserved through Darth Bane's reforms, spawning a thousand-year lineage that included Darth Zannah and Darth Plagueis. Darth Sidious was the culmination of generations of Sith leading to the rise of the Galactic Empire. As a Sith Master, Sidious bestowed the title of Darth on his three successive Sith apprentices: Darth Maul, Darth Tyranus, and Darth Vader."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "\"Darth\" was a Sith title borne by the Sith Lords who harnessed the dark side of the Force throughout their galaxy-wide conflict with the light-affiliated Jedi Knights. The title, which roughly translated to \"Dark Lord,\" preceded a moniker that replaced the Sith Lord's original name. The Sith names of Sheev Palpatine, Count Dooku, and Anakin Skywalker were Darth Sidious, Darth Tyranus, and Darth Vader, respectively. In at least two cases, the Darth title and the accompanying moniker were bestowed on the Sith apprentice by the Sith Master."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ancient past"}, {"tag": "p", "text": "The Sith were a sect of Force adepts who splintered off from the Jedi Order. There were many Sith who affixed the title \"Darth\" to their name, including legends such as Darth Caldoth, Darth Noctyss, and Darth Sanguis. Darth Atrius bore the title when the Sith were considered plentiful and powerful. Other title bearers included Darth Momin, Darth Shaa, and Darth Tanis."}, {"tag": "p", "text": "Darth Krall was a powerful Sith Lord who was also once a Jedi, known as Jedi Master Radaki, until he turned to the dark side of the Force. The Jedi Code conflicted with Radaki's belief that the Jedi should retain their family ties and wealth, and he eventually became one of the Lost Twenty."}, {"tag": "p", "text": "The Sith were in danger of extinction due to a combination of infighting and their war against the Jedi. Darth Bane, the sole survivor of the ancient Sith, developed the Rule of Two—limiting their ranks to a master and an apprentice—by training Darth Zannah as his only disciple."}, {"tag": "h3", "text": "Modern era"}, {"tag": "p", "text": "Bane's reformation was a resilient legacy that lasted for a millennium, creating a lineage of Sith Lords that culminated in Darth Sidious during the era of the Galactic Republic. In time, the Sith tradition led to Darth Tenebrous, who trained the Sith Lord Darth Plagueis. Carrying on the Rule of Two, Plagueis trained Darth Sidious; after learning the secrets of Plagueis, Sidious killed his master and trained his own apprentice, the Dathomirian warrior Darth Maul. Following the Invasion of Naboo, Maul was replaced by Count Dooku, a Jedi Master who left the Order and served Sidious as \"Darth Tyranus\" during the Separatist Crisis as well as the Clone Wars. Tyranus was killed in the Battle of Coruscant by Jedi Knight Anakin Skywalker, who subsequently took his place as Sidious' apprentice and was renamed \"Darth Vader.\""}, {"tag": "p", "text": "During the reign of the Galactic Empire, Vader confronted his old Jedi Master, Obi-Wan Kenobi, who referred to him as \"Darth\" while they dueled on the DS-1 Death Star Mobile Battle Station. In the aftermath of the Battle of Yavin, Sidious warned his apprentice to not underestimate how much he disappointed his master by losing to Kenobi on Mustafar. Sidious had given the title of \"Darth Vader\" to Anakin Skywalker because at the time he believed that the fallen Jedi was worthy of bearing a Sith name. Having grown more doubtful of his apprentice, Sidious required Vader to prove that he was still worthy of his title by overcoming the obstacles in his path to Sith ascendancy."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The prophesied destruction of the Sith came to pass when Darth Sidious and Darth Vader destroyed each other, ending the thousand-year lineage that began with Darth Bane. During the First Order/Resistance War, Jedi Master Luke Skywalker mentioned his father and Sidious by their Sith names while recounting their history to the scavenger Rey. After Skywalker's death, the reborn Sidious announced his return to the galaxy. Although the First Order and the Resistance referred to him by his family name, Palpatine, this time Sidious made no effort to conceal his Sith identity, declaring that the Final Order would usher in the rise of an eternal Sith Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The title \"Darth\" first appeared in George Lucas' 1977 film, Star Wars: Episode IV A New Hope, as part of the name Darth Vader. Lucas intended the name \"Darth Vader\" to suggest \"dark father.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}