{"url": "Darth_Andru", "categories": ["Category:Legends articles", "Category:Darths", "Category:Force ghosts", "Category:Humans", "Category:Males", "Category:Sith Lords of the reconstituted Sith Empire", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "Darth Andru"}, {"tag": "p", "text": "Darth Andru was a Human male Sith Lord of the reconstituted Sith Empire. He lived on Dromund Kaas long before the Sith returned to the known galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Andru, a Force-sensitive Human, was trained in the ways of the dark side of the Force by the Sith Empire, eventually attaining the title Darth Andru. A practitioner of the Jar'Kai technique, Andru wielded two purple-bladed lightsabers in combat. During his life on Dromund Kaas, Andru sought after ancient writings describing a powerful dark side ritual which would give the user mastery over the Force-walking skill. His two children eventually conspired against him, poisoning and killing him."}, {"tag": "p", "text": "Long after his death, Darth Andru's spirit was locked within his tomb where it seethed with an undying hatred. During the height of the Cold War, Andru's wraith was confronted and subjugated by the Sith Inquisitor known as Kallig who was able to master the Force-walking technique and consume Andru's spirit. Absorbing Andru's energy and adding that to Ergast's, Kallig confronted Dark Councilor Darth Thanaton and was soundly defeated, even with the added strength. However, the bond with the two ghosts kept Kallig from dying. The Sith Lord then decided to find more ghosts and use their power to defeat Thanaton. After adding Kalatosh Zavros and Horak-mul to the collection, Kallig returned to Dromund Kaas to face Thanaton. However, upon drawing on the power of all four ghosts, it became too much for Kallig to handle, causing the power to eat away Kallig's body while the ghosts threatened to drive them insane."}, {"tag": "p", "text": "Kallig managed to overcome this and forcefully rebound the ghosts before defeating Thanaton and ascending to the Dark Council."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}