{"url": "Darth_Bane%27s_holocron", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Sith holocrons"], "nodes": [{"tag": "h1", "text": "Darth Bane's holocron"}, {"tag": "p", "text": "Darth Bane's holocron was a Sith holocron made by the Sith Lord Darth Bane. It was possibly the holocron that, according to Emperor Palpatine, was the only true holocron used by the Sith who adhered to Bane's Rule of Two."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darth Bane attempted to make a holocron on three separate occasions. On his first attempt, he worked diligently day and night on it, only to have its matrix collapse in on itself. In his second attempt, he was more meticulous and cautious; he took his time, and ensured that everything was as it should be. In the end, though, the matrix degraded beyond use. On his third attempt, he allowed the Force to guide his movements, putting faith in the Force alone to allow the matrix to develop as it should. He worked for weeks at it, with similar results to what he had produced in his previous attempt. Upon his failure, his apprentice, Darth Zannah, planted a seed in his head that his infestation of the orbalisk was causing his multiple attempts to end with no avail. With time to consider, Darth Bane sent his loyal apprentice into the Jedi Temple, disguised as the apprentice of a Jedi who lived off world. The story she was to follow, was that her Jedi master had sent her to find any information on similar parasites he had discovered on his home world. While Zannah was in search of this, Bane went to Tython in search of Belia Darzu's holocron. As Bane reviewed the knowledge held within Belia Darzu's holocron, he discovered that his fault was not in his infestation of the orbalisk, but his failure to link the matrix of the holocron to the capstone."}, {"tag": "p", "text": "Though by the time Darth Bane created his holocron he had removed the orbalisks that plagued his body, his holocron's gatekeeper was still clad in the crustacean armor. It made his appearance more visually impressive and intimidating. Bane intended this to be a message to the future Sith who would use his holocron: the power of the dark side required one to make sacrifices. He also saw it as an advantage, should his holocron fall into Jedi hands while he was still alive, the mask he used to keep the orbalisks off of his face and head would conceal his identity."}, {"tag": "p", "text": "By 137 ABY, the holocron as well with Darth Nihilus' holocron and Darth Andeddu's holocron, had fallen into the hands of Darth Krayt, but the holocron's gatekeeper refused to help him because he had abolished the Rule of Two, an act that it felt would cause the destruction of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}