{"url": "Darth_Drear", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Darths", "Category:Individuals of unspecified species", "Category:Males", "Category:Sith alchemists", "Category:Sith Lords of the reconstituted Sith Empire"], "nodes": [{"tag": "h1", "text": "Darth Drear"}, {"tag": "p", "text": "Darth Drear was a male Sith Lord who served the reconstituted Sith Empire around 4645 BBY. He founded a Sith academy on the planet Odacer-Faustin and worked his students to death as they labored in the construction of the academy. Beneath the academy library, Drear built a temple, where he practiced Sith alchemy and searched for a pathway to immortality. He developed an elixir to fulfill his goal, effectively creating a disease that turned all those infected into zombies, knowledge he recorded into a holocron. Before Drear could successfully implement the final stage of his project, however, he succumbed to the effects of the disease and died."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Darth Drear was a male Sith Lord of the Sith Empire. Circa 4645 BBY, he founded a Sith academy on the snow-covered planet Odacer-Faustin. Drear used the initial Sith students at his academy as laborers, tasking them with constructing chambers and corridors using only the Force. Moving tons of ice and snow proved too much of a strain on many of the apprentices, but Drear saw to it that they worked until their exhaustion killed them. When the building efforts were completed, the Sith Lord populated the chambers with his personal collection of \"specimens.\""}, {"tag": "p", "text": "Drear also partook in construction, crafting himself a hidden Sith temple located beneath the academy's library. In this private fortress, its walls engraved with his plans for the destruction of the Jedi Order, he experimented in Sith alchemy. Over time, he searched for a way to achieve immortality and used the rare Murakami orchid to produce a formula that would help him achieve his goal. Drear's efforts produced an elixir that, when consumed, shut down the body before reanimating it as a homicidal zombie. The pathway to eternal life, however, could only be completed once the user ate the still-beating heart of a strong Force-sensitive; the midi-chlorians found in the blood in the heart were enough to halt the decaying process induced by the elixir and prevent the user from devolving into a mindless, undead creature. Drear stored the knowledge of the formula in a Sith holocron before moving to complete his plans and cheat death."}, {"tag": "p", "text": "The Sith Lord dispatched underlings to kidnap a Jedi on a nearby world and prepared to utilize the Force-user in the final stage of the process. Furthermore, Drear had a sword fashioned exclusively for the procedure of cutting out the Jedi's heart. When the time came, Drear ingested the elixir, but his plans for immortality were foiled when it was realized that the captured Jedi possessed an insufficient midi-chlorian count to keep the Sith Lord alive. Deprived of his triumph, Drear perished as a result of the disease he had engineered to grant eternal life."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Although Drear died, the knowledge of his elixir did not die with him. Safely stored away in his holocron, the formula was kept hidden until the Sith Lord Darth Scabrous discovered the holocron and its contents around 3645 BBY, during his tenure as headmaster of Drear's academy. Scabrous sought to succeed where Drear had not, but his experimentation with the elixir ultimately leaked out, turning the entire faculty and student body of the Odacer-Faustin academy into zombies. Despite his perseverance, Scabrous's own bid for immortality ended in failure when he was killed by Jedi Hestizo Trace in the final stage of the process. Thousands of years later, the Galactic Empire replicated Drear's elixir as a bioweapon, which infected the entire crew of the Imperial-class Star Destroyer Vector."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As the founder of the Odacer-Faustin academy, Drear employed his first students as a work crew and forced them to labor in the construction of the academy's buildings. The strain produced from the repeated moving of snow and ice with the Force exhausted the acolytes, but Drear continued to push them until many died from fatigue. Although he relied on student labor for the majority of the construction effort, the Sith Lord single-handedly fashioned a secret temple for himself beneath the academy library, where he practiced the Sith ritual ceremonies of old. It was in the Sith temple that Drear experimented with pathways to immortality, eventually developing a successful formula. His search for eternal life ultimately killed him, however, as he was unable to complete the process before the elixir's effects overtook him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Within his subterranean temple, Drear practiced the rites of Sith alchemy, which were stored within a Sith holocron. His alchemical practices, which he in turn also stored in the holocron, led him to develop an elixir that would enable him to cheat death, had he not perished during the final stage of the experiment. Drear possessed a Sith sword, specially made for use in his quest for immortality."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Drear was first mentioned in author Joe Schreiber's 2010 novel, Red Harvest. In the book, Darth Scabrous, the primary antagonist, provides a brief synopsis of Drear's life in the chapter appropriately entitled \"Drear.\" Scabrous's story reveals Drear to be the origin of the virus that turns a majority of the characters into zombies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}