{"url": "Darth_Desolous%27s_army", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Sith military units"], "nodes": [{"tag": "h1", "text": "Darth Desolous's army"}, {"tag": "p", "text": "At some point after 3522 BBY, an army of Pau'an warriors was assembled by Dark Lord of the Sith Darth Desolous, who had been expelled from the Jedi Order for studying Sith teachings. Vowing to exact revenge on the Jedi, Desolous led his army in a series of ambushes on Jedi Knights across the galaxy, until the Sith Lord and his warriors were crushed on Yaga Minor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point after 3522 BBY, a Pau'an Jedi Master fell to the dark side of the Force and was expelled from the Jedi Order for studying Sith teachings. Determined to exact his revenge, he became the Dark Lord of the Sith Darth Desolous and assembled an army of Pau'ans to fight against the Jedi. Desolous trained the army in his personal style of martial arts, which combined cortosis shields and melee weapons. Desolous and his men attacked the Jedi throughout the galaxy, killing almost two thousand Jedi Knights."}, {"tag": "p", "text": "With each victory, however, Desolous became more reckless and bold, and, when he discovered a small group of Jedi on the planet Yaga Minor, he led his army in a direct assault there. However, those Jedi merely acted as bait meant to draw Desolous into a trap as a Jedi fleet emerged from hyperspace and prevented the Sith Lord's forces from retreating. The entire Pau'an army was destroyed, and Desolous himself was killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Pau'an army assembled by Darth Desolous was mentioned in the in-game databank of the PlayStation 2, Wii, and PlayStation Portable versions of the 2008 video game Star Wars: The Force Unleashed. These versions were developed by Krome Studios."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}