{"url": "Darth_Ekkage", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Assassins", "Category:Dark Councilors", "Category:Females", "Category:Humans", "Category:Members of the Sphere of Mysteries"], "nodes": [{"tag": "h1", "text": "Darth Ekkage"}, {"tag": "p", "text": "Darth Ekkage was a female human Dark Lord of the Sith and Dark Councilor in the times of the Great Galactic War. She was the sister of Darth Baras and one of the greatest Sith assassins to have ever lived."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Great Galactic War between Galactic Republic and Sith Empire, Darth Ekkage and her minions were imprisoned on Belsavis. Ekkage was betrayed and handed over to the Jedi by one of her own—a Sith assassin who renounced the dark side and sought refuge among the Jedi Order. Many believe Darth Ekkage was as powerful a weapon as the Sith have ever had, and that their victory over the Republic would have been completed long ago if Ekkage had not been captured by Jedi Master Nomen Karr, who earned the hatred of Baras. But there were also many within the Sith who feared her - realizing that they could just as easily be her next target."}, {"tag": "p", "text": "After learning about Ekkage's survival during the Galactic War, Darth Baras sent Lord Melicoste to free her, knowing that her return would solidify his claim as the Voice of the Emperor. However, Melicoste was pursued by Baras' former apprentice - now the Emperor's Wrath - who was on a mission from Servant One to stop Ekkage's release. The Wrath managed to learn Ekkage's cell number and killed her assassins before they could be sprung. When Melicoste finally reached Ekkage and severed her bonds, she sensed the loss of her assassins and killed Melicoste for his incompetence, taking his lightsaber."}, {"tag": "p", "text": "As Melicoste fell, Baras' apprentice came out of hiding, remarking that Ekkage was much like Baras, betraying someone so loyal to them. Ekkage claimed it to be family trait and then asked who the Sith was. Just then, Jedi Master Somminick Timmns, whom Ekkage recognized as \"Nomen Karr's sad little whelp\", appeared, claiming that the Sith was with him. Ekkage accused the Sith of being a fool and a traitor for working with a Jedi. In turn, the Sith announced themselves as the Emperor's Wrath, sent by the Emperor's Hand to kill her and stop her brother. Lamenting that the Hand had stooped as low to work with the Jedi, Ekkage engaged the two. Despite being a Dark Councilor, Ekkage was defeated and subsequently executed"}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Darth Ekkage was powerful enough to gain a position on the Dark Council, and many in the Sith Empire believed their victory over the Republic would have been completed long ago if she had not been captured by the Republic. When released from her prison, she was able to sense the loss of her assassins and effortlessly killed Melicoste for his incompetence with Force lightning. However, she was killed by the combined forces of the Emperor's Wrath and Jedi Master Timmns."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Ekkage is a character introduced in the 2011 Star Wars: The Old Republic video game as part of the Sith Warrior class's Chapter III story on Belsavis. Ekkage's fate can be decided in three ways: the Sith Warrior can kill her, force Timmns to do it, or reimprison Ekkage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}