{"url": "Darth_Desolous%27s_martial_art", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Martial arts"], "nodes": [{"tag": "h1", "text": "Darth Desolous's martial art"}, {"tag": "p", "text": "A personalized form of martial arts was developed by the Dark Lord of the Sith Darth Desolous. The style combined the usage of a cortosis shield and a melee weapon. Desolous personally trained an army of Pau'an warriors in his combat style, and they later employed the martial art in Desolous's fight against the Jedi Order. Following Desolous's death, a simulacrum of the Sith Lord was created by the Jedi to serve as an opponent in the Jedi Trials. The simulacrum fought in the same style as the real Desolous."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Developed by the Pau'an Jedi Master-turned-Dark Lord of the Sith Darth Desolous, the style combined cortosis shields and melee weapons. The shield was typically used to block an opponent's attack and leave the enemy open to a swift counterattack. As the shield was made from the lightsaber-resistant cortosis ore, it was effective even against the traditional weapon of the Jedi Knights."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point after 3522 BBY, Darth Desolous developed his own form of martial arts. After he was expelled from the Jedi Order for studying Sith teachings, Desolous trained an army of Pau'ans in his fighting style and employed them in a series of strikes against the Jedi. Desolous and his followers slew almost two thousand Jedi, until they were in turn killed during a battle on the planet Yaga Minor."}, {"tag": "p", "text": "Later, a simulacrum of Darth Desolous was created by the Jedi as part of the Jedi Trials, a series of challenges that Jedi Padawans faced in order to become Jedi Knights. The simulated figure fought in the style developed by the real Desolous, using a cortosis shield in conjunction with a red-bladed lightsaber. In 3 BBY, the simulacrum fought Sith apprentice Starkiller and employed the technique in combat, but was defeated by him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Desolous's martial arts style is mentioned in Desolous's databank entry in the Krome Studios-developed PlayStation 2, Wii, and PlayStation Portable versions of the 2008 video game Star Wars: The Force Unleashed. Its description is consistent with the style employed by the simulacrum of Desolous in the game itself. Star Wars: The Force Unleashed: Prima Official Game Guide also indirectly mentions this style in its warning to players that Desolous is capable of launching a quick counterattack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}