{"url": "Darth_Krayt", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Bounty hunters", "Category:Cyborgs", "Category:Dark Lords of the Sith", "Category:Darths", "Category:Fallen Jedi", "Category:Force ghosts", "Category:Galactic Emperors", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Purge survivors", "Category:Males", "Category:Pilots", "Category:Post-Ruusan Jedi Masters", "Category:Sith healers", "Category:Sith Lords of Darth Krayt's Galactic Empire", "Category:Sith Lords of the Fel Empire", "Category:Sith Masters", "Category:Sith sorcerers", "Category:Torturers and interrogators", "Category:Tusken Raiders"], "nodes": [{"tag": "h1", "text": "Darth Krayt"}, {"tag": "p", "text": "Darth Krayt, born A'Sharad Hett, was a long-lived Human male who served as both a Jedi Master in the waning days of the Galactic Republic and as Dark Lord of the Sith following the fall of Darth Sidious and the Yuuzhan Vong War. The son of legendary Jedi Knight Sharad Hett and his wife K'Sheek, both of whom lived among the Tusken Raiders of Tatooine, he eventually became the Padawan of Jedi Masters Ki-Adi-Mundi, and later, An'ya Kuro. When he was only a teen, Hett's father was murdered by the Ex-Jedi assassin Aurra Sing, who was later defeated in a duel by a young A'Sharad Hett. During the Clone Wars, he served the Republic as a General and established himself as a charismatic leader who often led his troops from the front. He eventually became friends with the young Anakin Skywalker and helped Anakin come to terms with the destruction which had been wrought by the galaxy-wide war. A'Sharad took part in key conflicts during the war such as the Battle of Boz Pity and the Siege of Saleucami. He managed to survive the Clone Wars, and was one of the few Jedi known to have escaped the Great Jedi Purge in 19 BBY."}, {"tag": "p", "text": "A'Sharad Hett eventually made his way back to his homeworld of Tatooine where he vowed to wage a private war against the new Galactic Empire. However, after a confrontation with Jedi Master Obi-Wan Kenobi, he was exiled from Tatooine and later discovered that it was Anakin Skywalker who became the Sith Lord Darth Vader, who he had aided in the annihilation of the Jedi Order. A'Sharad blamed himself for the destruction of the Jedi Order and became a bounty hunter. During one of his missions, he found himself on Korriban, where he trained as a Sith under the tutelage of the Dark Lord XoXaan. Hett eventually fell to the dark side after capture and torture by the Yuuzhan Vong and soon proclaimed himself Dread Lord and Dark Lord of the Sith, taking the name \"Darth Krayt\"."}, {"tag": "p", "text": "As Krayt, he became the founder and leader of the One Sith. He rebuilt the Sith Order and kept its existence hidden from the Jedi by cloaking their presence on Korriban. To survive, the Dark Lord spent many years in stasis before reemerging to form an alliance with Moff Nyna Calixte and to spark the Sith–Imperial War that led to the destruction of the Galactic Federation of Free Alliances. At the climax of the war, he deposed Emperor Roan Fel and brought about the destruction of the New Jedi Order."}, {"tag": "p", "text": "Darth Krayt ruled the galaxy with an iron fist for seven years before the alliance between rightful Emperor Roan Fel and Galactic Alliance admiral Gar Stazi threatened his usurped rule. Furthermore, Krayt discovered the existence and survival of a Skywalker: Cade. Krayt feared that with these deteriorating conditions and his bad health would lead to his demise before his dream was finished, and sent about the hunt for Cade Skywalker. However, during a skirmish on Had Abbadon, Krayt was stabbed and sent hurtling off a cliff. The Sith Lord's powers proved strong, however, when they saved his life. Darth Krayt was then approached by Darth Wyyrlok, his most trusted advisor, who presumably murdered Krayt, believing the Dread Lord would lead to the Sith Order's destruction."}, {"tag": "p", "text": "But, even as he was inactive, Krayt's ideals were being carried out by Wyyrlok in his place. Krayt later healed his body from his near-death experience. Overcoming the taint of his armor, he called out to all those across the galaxy who had touched the dark side, signaling his return. With the aid of loyal Sith and a new breed of Sith troopers, Krayt retook Coruscant, slaying Darth Wyyrlok in the process, and began making preparations to rebirth the galaxy through war. However, in the final battle, he once again attempted to turn Cade Skywalker. He failed to do so, which allowed Cade to permanently kill him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (47 BBY–22 BBY)"}, {"tag": "p", "text": "A'Sharad was born on the desert planet of Tatooine, the son of the famed Ex-Jedi Knight Sharad Hett and a Tusken-raised Human woman named K'Sheek."}, {"tag": "p", "text": "From his earliest days A'Sharad was raised, not only in the ways of the Jedi, but also among the traditions of the nomadic Sand People of his homeworld. He once undertook the ritual of slaying a krayt dragon. While he had grown up informally learning the ways of the Force and lightsaber construction from his father, A'Sharad's formal Jedi training did not begin until shortly after a Hutt-provoked Tusken war designed to increase demand for old weapons, in which the bounty hunter Aurra Sing murdered his father. At this time A'Sharad was fifteen years old, and upon his father's death he gained possession of his father's lightsaber, which A'Sharad continued to use even after constructing his own. He would eventually become a skilled Jar'Kai user."}, {"tag": "h3", "text": "Becoming a Knight"}, {"tag": "p", "text": "Following his father's death, he was initially taken as the Padawan of Ki-Adi-Mundi, and under the Cerean Jedi Master's watchful eye he partook in a mission to the planet of Malastare. On this mission he worked alongside various members of the Jedi Council, which included Adi Gallia, his own master, Yaddle, Mace Windu, and Even Piell. The mission itself was launched in response to the insurgents of the planet Lannik who declared that they were finally willing to begin peace talks to end the civil war on their planet—the location for the peace meeting was none other than Malastare."}, {"tag": "p", "text": "After arriving on Coruscant, the teenage Hett learned that Tusken and Human DNA weren't compatible, so he concluded that his mother was human."}, {"tag": "p", "text": "Two years after the Invasion of Naboo, his father's killer, Aurra Sing, resurfaced and A'Sharad accompanied Ki-Adi Mundi and Adi Gallia to track down the Jedi killer to end the threat. They tracked Sing to an uncharted world which had been claimed by Senator Tikkes and his Quarren underlings. Once there, they met up with the Dark Woman, Aurra Sing's former master, who had taken it upon herself to end the threat that her former Padawan presented. With Ki-Adi, Gallia, and the Dark Woman hunting Aurra Sing, A'Sharad was ordered to watch over Senator Tikkes, who was Sing's most recent target. Sing, though, was able to sneak aboard the Senator's vessel. A'Sharad found himself engaged in a deadly duel with his father's killer. However, during the fight, A'Sharad used his anger to overcome Sing, and was able to knock her unconscious. He was, though, able to regain control over his anger and willed himself not to kill the felled bounty hunter. Instead, he turned his prisoner over to Ki-Adi Mundi and the other Jedi Masters."}, {"tag": "p", "text": "Feeling immense guilt over giving into his anger, A'Sharad begged Ki-Adi-Mundi to release him from his tutelage and to allow him to go into exile, like his father had before him. Instead, the Dark Woman offered to take up A'Sharad's training and, with Ki-Adi-Mundi's blessing, she became the Padawan's new master. Over the course of the next decade, A'Sharad managed to complete his training under the guidance of the Dark Woman, and ascended to the rank of Jedi Knight. Eventually, he also took a Padawan of his own—a young male Nikto by the name of Bhat Jul."}, {"tag": "h3", "text": "The Clone Wars (22 BBY–19 BBY)"}, {"tag": "p", "text": "During the Clone Wars, A'Sharad served as a General for the Galactic Republic, and flew his Jedi starfighter in air support during the Battle of Geonosis. He would also fight during many of the ground campaigns of the war, leading clone troopers on worlds such as Metalorn and Aargonar. After Obi-Wan Kenobi's presumed death during the Battle of Jabiim, Hett befriended the young Jedi Anakin Skywalker who was in desperate need of guidance as well as companionship."}, {"tag": "p", "text": "Following the Battle of Jabiim, Anakin Skywalker and A'Sharad Hett were on New Holstice helping at the Republic military hospital established there. During one traumatic experience in the trauma ward, Anakin used the Force to massage the heart of dying Master Sora Mobari, in an effort to try and keep her alive—however, his efforts only increased the pain that Mobari was suffering. A'Sharad confronted Anakin about this, and realized that Anakin was having a difficult time accepting that death was a natural state of life, and essentially, the Force. To demonstrate his point, he took Anakin to a monument near the hospital which was dedicated to the memory of fallen Jedi. Upon seeing the monument, Anakin could hear a memory moth whispering to him—he reached into the soft glowing light of the monument and grabbed the memory moth, holding it to his ear. He listened to it as it continually whispered a name in his ear—Oss Wilum. A'Sharad showed Anakin how to use the memory moth to remember the names of the fallen, thus allowing Anakin to gain some closure over the many friends he lost in the killing fields of Jabiim."}, {"tag": "p", "text": "Following their much needed break from combat together with Bhat Jul, the three led the Republic defense of Aargonar. During the battle, the three Jedi became marooned behind enemy lines after their gunship was shot down—A'Sharad and Anakin found themselves alone after Bhat died of injuries received during the crash."}, {"tag": "p", "text": "Unaware of Anakin's dark feelings towards Tuskens, A'Sharad pointed out to him that the two of them shared many qualities. He even remarked that, had the chance presented itself, Anakin would have made a good Tusken. A'Sharad intended the comment as a compliment, but Anakin took it as an insult, which was influenced by the death of his mother at the hands of Tusken Raiders."}, {"tag": "p", "text": "The differences in rank prevented Anakin from expressing his prejudice and anger towards Hett, and instead he projected his hatred on a group of enemy soldiers. Imagining them to be the Sand People who had kidnapped and tortured his mother, Anakin slaughtered them without pity. In the heat of his rage, Anakin even tried to attack A'Sharad, but the elder Jedi defended himself, and managed to disarm the younger Jedi. Shamed over his loss of control, Anakin confessed himself to A'Sharad regarding his deeds on Tatooine. In an effort to try and cure the boy of his anger, and knowing it the only way that they would be able to work together, A'Sharad removed his Tusken clothing and revealed himself to be Human—just like Anakin. After sharing the private moment with Anakin, he vowed to keep Anakin's secret, hoping that Anakin would resolve the issue himself. Hett also decided to discard his Tusken mask, and decided to be simply a Jedi, rather than Human or Tusken."}, {"tag": "p", "text": "After fighting in the Battle of Boz Pity, he served as part of the Jedi force dispatched to the planet of Saleucami, alongside Jedi Masters Quinlan Vos and Oppo Rancisis. There, he befriended the Jedi Ausar Auset, who would later die in battle. On Saleucami, A'Sharad worked together with his friend, Xiaan Amersu, to destroy the Separatist's planetary gun, but Xiaan was forced to sacrifice herself to destroy their target. A'Sharad was saddened by her death, though he used it to motivate himself to see the battle through. After a brutal struggle, the Republic was eventually successful in their attempts on Saleucami. A'Sharad was one of several Jedi who managed to survive the campaign."}, {"tag": "p", "text": "At some point by the end of the Clone Wars, A'Sharad attained the rank of Jedi Master."}, {"tag": "h3", "text": "Post-Clone Wars (19 BBY–)"}, {"tag": "p", "text": "As the Clone Wars reached its conclusion, Palpatine gave a secret top-priority command to his clone troops, Order 66, commanding the clones to assassinate their Jedi commanders. Hett was on a scouting mission, away from his troops, when the order was given, though he did see other Jedi die. A'Sharad killed the clones assigned to execute him, keeping one alive just long enough to learn what had happened. Then he fled, attempting to reach other Jedi, hearing from none, sensing none."}, {"tag": "p", "text": "Believing himself the only Jedi to have survived, Hett made his way back to his homeworld of Tatooine, once again taking up his heritage and donning the wrappings of a Tusken Raider, and became a war leader of several Tusken clans. Hett led these clans against human settlements that had encroached on Tusken lands, while at the same time silently preparing for his own private war against the Galactic Empire. Hett's leadership and skills, honed in the Clone Wars, did much to reverse the losses the Tuskens had suffered since the death of his father. The Tuskens became a feared fighting force again, reclaiming land they believed was rightfully theirs."}, {"tag": "p", "text": "Around this time, Hett had discovered the Force in one of his warriors, KkH'Oar'Rrhr. He taught him how to speak Galactic Basic Standard and employ the Force-based martial art of Teräs Käsi. The war leader even presented his protege with a bisected gaderffii stick, the traditional weapon of the Tusken, so as to instruct him in dual-weapon fighting."}, {"tag": "h4", "text": "A'Sharad Hett vs. Obi-Wan Kenobi"}, {"tag": "p", "text": "When Hett's clans reached the boundaries of the small moisture farm of Owen Lars, they were stopped, to Hett's surprise and shock, by his former Jedi comrade, Obi-Wan Kenobi, by then living in exile on the desert world as well. Kenobi had noticed Hett's recent activities, and believed Hett was frighteningly close to the dark side, becoming the very thing he was claiming to fight. He begged Hett to stop his crusade there and then (not mentioning to Hett exactly why he had chosen to defend this small farm), but Hett refused to listen; the settlers and farmers had killed countless Tuskens, and blood called out for blood. With little choice, both Jedi ignited their lightsabers and fought a brutal duel on the desert flat, with the entire Tusken army watching them."}, {"tag": "p", "text": "The duel ended with the loss of Hett's right arm, and the extra humiliation of having his mask removed. To the Tuskens, to expose any part of the flesh was forbidden, and with one hand, Hett could not hope to wield the traditional Tusken weapon, the gaderffii, also known as the gaffi stick. The clans turned on him and they departed without a word spoken. Hett was now an outcast, and asked Kenobi to finish him off. But Kenobi would not kill his old comrade. Instead, he made Hett swear on the honor of his late father that he would leave Tatooine and never return, hoping that one day, Hett would see the error of his ways and again take up the Jedi way. It was not to be; in fact, decades after the fact, Hett learned that the very moisture farm Kenobi had been defending concealed the son of Anakin Skywalker, who was, as he would also learn, the man who had destroyed the Jedi Order. When he realized that Skywalker and Darth Vader were one, Hett bitterly regretted protecting Skywalker's bloody secret on Aargonar; to have turned him in then, or simply killed him, Hett believed, would have spared the galaxy untold suffering."}, {"tag": "p", "text": "Following his departure from Tatooine, Hett became a bounty hunter, masking his Jedi skills. While pursuing a bounty named Resk to the planet Korriban, a storm forced them down, and Hett continued his pursuit of Resk. Hett killed him after Resk threatened to turn him over to the authorities when Hett revealed himself to have been a Jedi. He shortly afterward heard a voice summon him."}, {"tag": "p", "text": "Hett followed the voice that he felt rather than heard, a darkness calling to his darkness. He found and shattered a sealed door and discovered a glowing Sith holocron. The specter of the ancient Sith Lady XoXaan, one of the first of the Sith Lords, stated that she had been waiting for someone like Hett to find her. She offered him the teachings of the Sith, and Hett agreed to learn."}, {"tag": "p", "text": "XoXaan opened Hett's eyes to the dark side, and Hett deluded himself into believing that he was only pretending, that he was really just learning new skills with which to avenge himself on Vader and Palpatine. But when he resurfaced from the tombs, he found that more time had passed than he had thought; the Battle of Endor had already taken place, and the Emperor and Vader had already been defeated by Luke Skywalker. Disillusioned yet again, Hett left Korriban behind and made for the Unknown Regions, determined to lose himself."}, {"tag": "h3", "text": "The rise of Darth Krayt (c. 25 ABY–130 ABY)"}, {"tag": "p", "text": "In the Unknown Regions, Hett was captured by a Yuuzhan Vong advance scout ship. Imprisoned in the Embrace of Pain, Hett was met by Vergere. He was tortured endlessly by the Embrace and was subjected to the experiments of the Shapers; his cybernetic arm was replaced by an organic one and his left eye was replaced by the eye of a Yuuzhan Vong creature. During his imprisonment, Vergere taught him how to use his agony to open himself to the dark side, and that's when Hett received his vision of his new Sith Order. He had conversations with Vergere and he came to believe that the galaxy was fractured and weak, and that a single will was needed to make it whole and strong again. Shortly after Vergere left him to join with the main invasion force, Hett escaped and destroyed the scout ship, and returned to Korriban."}, {"tag": "p", "text": "There, Hett took the name Darth Krayt, after the fearsome krayt dragon of his homeworld, and reestablished the cult under his leadership, pledging to reunify the galaxy according to the will of the Sith. Unlike the previous incarnation, however, Krayt abolished the Rule of Two, Darth Bane's ancient diktat commanding that there could be only two Sith at any one time—a Master and an apprentice. Instead, there would be the Rule of One—that one being the Sith Order itself, under which there would be many minions."}, {"tag": "p", "text": "After the Yuuzhan Vong War, Krayt sought to recruit Lumiya to his Order, but she instead chose to side with Vergere and her \"creation\", Darth Caedus. Although several of his followers resented Caedus and did not consider him a true Sith, Krayt tolerated him as a lightning rod to deflect attention from him. When Caedus went about with the Second Galactic Civil War, the Jedi were distracted away from Krayt's order, which grew in strength, hidden under Korriban's miasma of dark side energy."}, {"tag": "p", "text": "For more than a hundred years, Krayt grew and strengthened, along with his Sith, on Korriban, surreptitiously planning to bring its vision of peace and order to the galaxy. Krayt's body could not have survived the Yuuzhan Vong implants, but he endured by placing himself in extensive periods of stasis, his mind only open to his closest disciples like the first Darth Wyyrlok. Krayt was living well beyond his standard lifespan and his body began to fail him, his condition kept at bay by healing trances. The Yuuzhan Vong implants caused an exoskeleton of bony outgrowths to surround his body like armor. He estimated that they would consume him within a decade or two, and his later interest in Cade Skywalker, motivated by a sense that the young Jedi apprentice in exile had once used the Force to revive his Master from the edge of death, was tied into this fact."}, {"tag": "h4", "text": "Abeloth"}, {"tag": "p", "text": "At some point, Darth Krayt became aware of the being known as Abeloth. He knew of her back history with the family of Force entities known as the Ones and feared that she could pose a great threat to his plans. Desperate to stop Abeloth, he left Korriban and traveled to Coruscant which was secretly under the control of Abeloth and her minions, the Lost Tribe of Sith. He was noticed by Luke Skywalker during a skirmish at a spaceport as the Jedi returned to the capital to destroy the Sith. However, Luke believed him to be merely another member of the Lost Tribe."}, {"tag": "p", "text": "Sometime later, after the battle in the Jedi Temple escalated to the rest of Coruscant, Krayt was seen several times by the Jedi as an observer until he was confronted on Fellowship Plaza by Jedi Knight Yaqeel Saav'etu. When she tried to take him into custody after sensing his dark side aura, he disarmed her before telling her: \"Not yet, Jedi. Abeloth first.\""}, {"tag": "p", "text": "Krayt traveled beyond shadows and met Luke Skywalker. Krayt was identified by Jacen Solo as being the Dark Man of his and Luke's visions. However, Krayt convinced Luke that, with the Ones dead, only the Sith and Jedi together could defeat Abeloth. Krayt attempted to insinuate that he was part of the Lost Tribe of Sith but Skywalker saw through the deception, mentioning the Tribe's penchant for physical beauty. Nevertheless, he agreed, and together they managed to destroy Abeloth beyond shadows. Both Krayt and Skywalker were left gravely injured, but still alive. As Krayt left, Skywalker was now aware of another Sith Order. In addition, when Luke explained that the Sith would not gain the Throne of Balance due to foreseeing a Jedi Queen, Krayt implied that the future of a Sith-dominated Throne of Balance was only delayed and not actually averted."}, {"tag": "p", "text": "Decades after the fight with Abeloth, Krayt slew a Devaronian Jedi and his wife. Krayt kidnapped their daughter, Malincha and trained her as a Sith, teaching her to embrace hate, fear and pain. Malincha eventually became the Sith Lady Darth Maladi, an adept at torture and deception, and the head of the One Sith's intelligence and assassination branch."}, {"tag": "h4", "text": "The Sith–Imperial War"}, {"tag": "p", "text": "At last, in the period of 127–130 ABY, the Sith made their presence known openly under Krayt's leadership, and the result of his machinations was the Sith–Imperial War. Krayt's own holocron contained entries relating how he engineered the fall of the Galactic Alliance and the restoration of the Galactic Empire as the dominant galactic power."}, {"tag": "p", "text": "Krayt harnessed that hatred to sabotage a Jedi project that was established for entirely altruistic reasons. The original intent of the Ossus Project was to use Yuuzhan Vong terraforming techniques to restore a barren section of the once-devastated Jedi fortress world of Ossus. When the test proved successful, the response was tremendous."}, {"tag": "p", "text": "Out of a host of applicants, one hundred worlds were selected for the Yuuzhan Vong terraforming process. Yuuzhan Vong Shapers, overseen by Jedi escorts, produced incredible results. But the Sith tainted the process. Krayt's apprentice Darth Maladi was an expert in Yuuzhan Vong bio-forms and had recruited Zenoc Quah, a rogue Yuuzhan Vong Shaper. Together, they sabotaged the Ossus Project with a Vongspawn virus. On every world on which the Yuuzhan Vong had carried out their work, the vegetation withered, and bony growths—like those once seen on those the Yuuzhan Vong had taken as slaves during their invasion—began forming on the skin of the inhabitants."}, {"tag": "p", "text": "The Jedi immediately suspected sabotage, but could never prove it. It did not matter; the lingering resentment the galaxy felt towards the Yuuzhan Vong, even decades after their defeat and exile, did Krayt's work for him, and soon the Yuuzhan Vong were accused of trying to restart their genocidal crusade against the galaxy by other means."}, {"tag": "p", "text": "The results were everything he could have hoped for. The Jedi, devoted to the truth above all, defended the Yuuzhan Vong and encouraged the Galactic Alliance to support them. The Empire reacted accordingly; members of the Council of Moffs demanded retribution (quite possibly instructed to do so by Krayt himself) and, invoking the Treaty of Anaxes, declared war on the Alliance. Emperor Roan Fel went along, albeit reluctantly, feeling it was the best course for the Empire in a dangerous galaxy, but never entirely supported it, even keeping his Imperial Knights out of the fighting."}, {"tag": "p", "text": "In addition to war with the Empire, the Alliance found itself facing dissension from within its own ranks. Worlds that had suffered the most under the Yuuzhan Vong now aimed their resentment at the Alliance; many of them refused to support the Alliance and actively sided with the Empire, while others just stood by and watched under the banner of neutrality. So divided, the Alliance was easy to conquer."}, {"tag": "p", "text": "In three years, the Galactic Alliance was forced into surrender and the Empire absorbed all its former holdings, even reclaiming Coruscant as the Imperial throneworld. It was a reversal of the galactic order that no one could have foreseen, or believed was possible. But despite the grandeur of this victory, it was but a stepping stone for Krayt. Quite possibly he felt that it would be easier to establish his definition of order over the galaxy under an Empire than under a democratic government, even if that Empire was no longer the absolute tyranny his predecessor Darth Sidious had originally intended."}, {"tag": "h3", "text": "The consolidation of power"}, {"tag": "p", "text": "Now that the Empire was triumphant, it was time to remove the last obstacle to the Sith: their ancient enemies, the Jedi. With the fall of Coruscant, the Empire's ruler, Emperor Roan Fel, had called on the Jedi to surrender and submit to the Empire. But the Jedi were now aware of the Sith's involvement in the war and refused to join them. They withdrew from Coruscant, yielding their Temple to their enemies, and holed themselves in their praxeum on Ossus. Krayt dispatched his Hand, Darth Nihl, on a devastating attack against the praxeum. However, what came to be known as the Massacre at Ossus was not the absolute victory he hoped for. Nihl managed to make several significant kills, especially one of the most prominent members of the Jedi Council, Kol Skywalker, scion of the very bloodline that had proven to be both the greatest boon and, later, the greatest impediment to Sith dominance. But the death of even a good number of Jedi did not make for victory. The Jedi were sent to flight, scattered, but they were not yet defeated."}, {"tag": "p", "text": "Despite this, the Jedi had still been brought low enough to allow him to take the next step; now that the Empire was triumphant, it was time to claim its throne as his own."}, {"tag": "p", "text": "He launched a daring palace revolution, marching with his cohorts straight into the audience chamber of Emperor Roan Fel himself, killing the man who sat on the throne, and seating himself in his place. Noting the confusion and outrage from the members of the Moff Council who were present, he laid out the facts of life for them. Faced with little choice, the Moff Council swore loyalty to him. For the first time in nearly a hundred years, a Sith Lord held the galactic seat of power. At once he set about imposing order on a galaxy that sorely needed it, but this too was an incomplete victory. The \"Emperor\" he had killed had been anything but. It had to be a double; the real Fel was a fully trained Imperial Knight and would surely have defended himself, rather than just stand there and let himself be slain. It was imperative that the real Fel be found, before he recruited allies among the Moffs, the military, or those Jedi who had survived."}, {"tag": "p", "text": "And there was a further concern that he kept to himself and his lieutenant, Wyyrlok. Krayt knew all too well that his health was failing him; he was more than a hundred and seventy years old, and he was ruling on borrowed time. But he had felt a murmur in the Force during the Ossus massacre; someone, a Jedi, had somehow used the Force to heal someone else, bring them back to life from the brink of death. If his reign was to endure, if he was to establish his vision of galactic order, he had to find this Jedi with the power to bring beings back to life, and bend his power to serve the dark side."}, {"tag": "p", "text": "Krayt ruled his new Empire as the leader of both the One Sith and the Council of Moffs. He also was the Sith Lord who held dominion over Coruscant and the commander of the Coruscant Defense Fleet."}, {"tag": "p", "text": "In 132 ABY, Krayt sent the Sith Lord Darth Vurik to the planet Nyriaan to investigate rumors of the Dying Sun, an Interdictor-class cruiser that had crashed on the world during the Jedi Civil War."}, {"tag": "h3", "text": "Downturn (137 ABY)"}, {"tag": "p", "text": "With the passage of seven years, Emperor Krayt's grip on the throne was still uncertain. Roan Fel remained at large, and finding him was of paramount importance. He sent one of his newest and most devoted hands, the vicious Darth Talon, on a mission to lure Fel out into the open by capturing his daughter, Princess Marasiah Fel. But Fel refused to take the bait; he had plans of his own. In fact, though Krayt did not know it yet, Fel had succeeded in reclaiming the historic fortress world of Bastion, making it a staging area for the Imperial forces he had spent the last seven years moving into position. Little by little, the ground was being laid for a reckoning between Emperors, between the man who claimed to have a birthright to the title and the man who had taken it from him."}, {"tag": "p", "text": "It did not help that Krayt was distracted by his own condition. In an attempt to find out how he could survive being consumed by his Yuuzhan Vong implants, Krayt traveled to Korriban in an attempt to learn from past Sith Lords how to avoid this fate. Krayt activated the holocrons of Darth Bane, Darth Andeddu, and Darth Nihilus, and asked how he could overcome the limitations of his armor, or at least keep it at bay."}, {"tag": "p", "text": "The ancient Sith were of no help at all: Bane lambasted Krayt for not adhering to the Rule of Two, Nihilus merely gave a small statement in his peculiar dialect (which neither Bane nor Andeddu deigned to translate), and Andeddu caused Krayt's armor to consume him, transforming him into a creature very much like his namesake. Laughing, the Sith avatars taunted him with what they said was his destiny. The three ancient Sith Lords, declaring Krayt to be nothing but an impostor and his order a mockery of the Sith, taunted and laughed as Krayt's fear nearly overcame him. But Krayt refused to accept it."}, {"tag": "p", "text": "In this outburst, he was able to focus his anger to the point that he was able to reverse the effects of Andeddu's wizardry. He was determined that if he could get no help from the ancient Sith, he would find other teachings, another way. Again he was directed on a path that was likely to lead to Cade Skywalker, the only being in the galaxy able to bring the dead to life."}, {"tag": "h4", "text": "Discovery"}, {"tag": "p", "text": "When Darth Talon returned from her unsuccessful mission to capture Marasiah Fel on Vendaxa, she expected to be executed by Krayt for her failure. Her master, however, forgave her when she informed him that one of the foes she faced there was a Skywalker. Musing that it was perhaps fate that had allowed the Skywalker lineage to continue, Krayt ordered Talon to find this Skywalker and bring him to Coruscant. Krayt hoped that this Skywalker's abilities would prove useful in his quest to prolong his life."}, {"tag": "p", "text": "In the meanwhile, Krayt sent his Sith minions Darth Maleval, and Darth Kruhl to destroy the 908th Stormtrooper Division and eliminate Emperor Fel, respectively. Maleval was shot down by Anson Trask, and Kruhl was shot and killed by Emperor Fel on Bastion. Krayt also sent the Quarren Darth Azard to oversee the Outer Rim Third Fleet, which had been tasked with eliminating Admiral Gar Stazi and the Galactic Alliance Core Fleet."}, {"tag": "h4", "text": "Skywalker found"}, {"tag": "p", "text": "While meditating in the Temple of the Sith, Krayt sensed Cade Skywalker heading in his direction to rescue the Jedi Hosk Trey'lis. Krayt tasked his Hands, Darth Nihl and Darth Talon with capturing him, which they did."}, {"tag": "p", "text": "Darth Krayt later came to oversee Cade's interrogation at the hands of Darth Maladi, and was astonished to see Cade's body had purged itself of the deadly substances Maladi had injected into his body. In order to witness his power, Krayt ordered Maladi to infect the recently captured Jariah Syn and Deliah Blue with deadly Yuuzhan Vong Yorik-Kul coral seeds. Cade saved his friends and made a deal with Krayt: remain with the Sith in exchange for his friends' freedom."}, {"tag": "p", "text": "Krayt then took Cade to his chambers alongside Darth Talon and Darth Wyyrlok, leaving both Lady Maladi and Lord Nihl outside. There, Krayt gave food to Cade and revealed that he had once been a Jedi, A'Sharad Hett. Skywalker was far from impressed, even after Krayt explained his origins, but when Skywalker was provoked to anger by Darth Talon, and nearly killed her, it was clear to Krayt that Skywalker was exactly what he had hoped for. Krayt urged Skywalker to use his anger properly, focus it, let the Sith teachings help him to reach his full potential. At last, Skywalker accepted what Krayt believed to be his destiny, and agreed to learn the ways of the Sith. Krayt commanded him to heal Talon, for she would be his teacher. During Skywalker's training, Talon informed Krayt that he was only pretending to be like them but Krayt was confident that Skywalker would come to embrace the Sith way. He later placed Cade in the Embrace of Pain perhaps to ensure his conversion while telling him more of his own fall."}, {"tag": "p", "text": "Not long after, Cade escaped from the Embrace of Pain and then attempted to escape the temple itself, but was quickly apprehended. Cade was brought before Darth Krayt who, in front of his two \"Hands\", ordered Skywalker to execute the captured Jedi Hosk Trey'lis. Skywalker refused, and so Krayt executed him personally, unintentionally invoking Cade's rage. Cade broke the transparisteel casing around his father's lightsaber and used the weapon to impale Darth Talon. Skywalker then engaged Darth Nihl in a duel, while Darth Krayt stood back and observed; throwing in insults every now and then in an attempt to bring Cade closer to the dark side. When Cade succeeded in cutting off Nihl's right arm, Krayt commanded him to kill the Sith Lord. Skywalker refused and began a duel with the Dark Lord of the Sith. Krayt was almost at the edge of defeating Skywalker when Skywalker's mother, Morrigan Corde, shot him in the back. With Cade successfully rescued, Krayt commanded his Sith servants to find him by any means necessary. He swore that he would break Cade, have him use his healing power, and then kill him."}, {"tag": "p", "text": "As the Sith began to recover, Krayt was angered, desiring to end Nihl's life for his failure. Wyyrlok suggested there was another way that he could serve him; Krayt relented, ordering Maladi to replace Nihl's arm with a Yuuzhan Vong one, he then revoked Nihl's position as a Hand, naming Stryfe in his stead. He also ordered Talon to be taken to a bacta tank. Soon after, Krayt got into stasis as Wyyrlok searched for Andeddu's true tomb on Prakith, finding a number of texts that could help the Dark Lord."}, {"tag": "h3", "text": "Genocide"}, {"tag": "p", "text": "After Admiral Gar Stazi stole the new Imperious-class Star Destroyer Imperious during the battle against the Outer Rim Third Fleet, Emperor Krayt personally came to Dac to confront Gial Gahan, former Triumvir and supporter of the Galactic Alliance Remnant. The capture of the Star Destroyer infuriated Krayt, as did the disastrous failure of his underlings. Therefore, Krayt, before Holonet droid cams, murdered Gial Gahan and the other Mon Calamari present. He issued the extermination of ten percent of the planet's Mon Calamari population and internment of the rest in work camps."}, {"tag": "p", "text": "He ordered his Sith Lords to execute the entire Mon Calamari Council, including those Quarren opposing his edict thus showing the galaxy the cost of betraying the Empire. With so much fear on the planet, through the dark side it strengthened Krayt. But this action triggered a catalyst that resulted in a resistance movement and an alliance between Stazi and Fel."}, {"tag": "h3", "text": "The Muur Talisman and Celeste Morne"}, {"tag": "p", "text": "As the genocide on Mon Calamari continued and the hunt for Cade Skywalker commenced, one of Krayt's minions, a Devaronian Sith known as Darth Reave, encountered Skywalker and his companions on the legendary world of Had Abbadon, which served as a military base for the Empire. During the skirmish, Reave was attacked by a female Jedi, Skywalker, and a group of Imperial Knights and Jedi. The female Jedi used ancient Sith magic and transformed Reave's stormtroopers into vile mutants. Realizing that he was outnumbered, Reave fled and returned to Coruscant, to report on both the Jedi woman and her monsters, as well as on Cade Skywalker's presence on Had Abaddon."}, {"tag": "p", "text": "Before he could finish his report, however, Reave himself transformed into one of the same mutants he had recently encountered, only to be quickly beheaded by Darth Stryfe. Krayt was unfamiliar with the creature, and was informed by Lady Maladi that it was a rakghoul; a form of sithspawn that had been thought extinct in the galaxy for thousands of years."}, {"tag": "p", "text": "Krayt and his advisers were then interrupted by a transmission from one of his officials on Had Abaddon, who had a message for the Dark Lord only. Karness Muur was contacting Krayt under the guise of the Jedi woman that Reave had spoken of, and presented Krayt with none other than Cade Skywalker. When Krayt feigned a lack of interest in the Human, Muur coaxed the Dark Lord's desire for Skywalker out of him by blasting him with torrents of Force lightning, and Krayt immediately dropped the pseudo-lack of interest. Muur then issued an invitation to Krayt—one that he was to answer alone, or both he and Skywalker would die. Krayt accepted the invitation, albeit with three of his Sith Lords accompanying him, and set out for Had Abaddon."}, {"tag": "p", "text": "As they traveled to the Deep Core world, Darth Wyyrlok told Lord Krayt of Karness Muur and his legendary amulet, which had the spirit of Muur trapped within. Wyyrlok further surmised that Muur would not divulge any secrets, and rather sought to control Krayt through his talisman. However, the Dark Lord was in greater desperation to find a cure for himself, as his life was nearing its end."}, {"tag": "h3", "text": "Betrayer of the dream"}, {"tag": "p", "text": "Krayt and the foremost members of his Order traveled to Had Abbadon with intentions of capturing Skywalker. On the surface, Muur offered an alliance and began to modify Krayt's body. Suddenly, everything was revealed to be a trap, as Cade's allies were waiting in secret. Muur, however, truly took control of Celeste and planned to take Krayt's body for his own."}, {"tag": "p", "text": "During the fight, Krayt was stabbed in the right side of his chest by Azlyn Rae, electrocuted and Force-pushed off of the cliff by Morne/Muur, and seemingly fell to his doom. At the bottom of the cliff, Darth Wyyrlok, having landed his shuttle nearby, approached the Emperor's body, declaring that he would be taken to the tomb of the Sith on Korriban. To his surprise, Krayt woke, having cushioned his fall with the Force. He asked Wyyrlok to take him to a bacta tank in order to regain his strength, but the Chagrian Sith Lord electrocuted his master in response, seemingly killing him. He then placed Krayt's body in a stasis chamber within XoXaan's Temple of Korriban, hiding the truth from the other Sith while planning on inducting all beings in the galaxy into the ranks of the One Sith, as Krayt had always intended."}, {"tag": "p", "text": "Darth Maladi, however, suspected Krayt had been killed by Wyyrlok and shared her concerns with Darth Nihl. Maladi also feared Wyyrlok would try to eliminate the two, as they had not been born Sith, and suggested Nihl to go to Korriban and verify whether Krayt was alive or not."}, {"tag": "p", "text": "Once on the Temple, Lord Nihl lied to Darth Talon, telling her that he had felt Lord Krayt's summoning in his mind. The pair entered the Stasis Room and discovered that Krayt's body had vanished, while his armor remained within the chamber."}, {"tag": "h3", "text": "Resurrection"}, {"tag": "p", "text": "Lord Nihl informed Wyyrlok about the disappearance of Krayt's body. Wyyrlok immediately claimed that somebody had killed the recuperating Krayt and then stolen his body, leaving his armor behind. Already facing serious losses in the war with the Alliance and Fel Empire, Wyyrlok ordered that the incident be covered up temporarily and appointed himself as the new Emperor with Nihl serving as his advisor. An enraged Wyyrlok then used Force lightning to destroy Krayt's armor. As advisor, Nihl used his position to move against his rival Talon by implicating the latter in Krayt's disappearance."}, {"tag": "p", "text": "This suspicion was backed by Talon's apparent disappearance following her meeting with Nihl. Wyyrlok expressed his suspicions on Talon's \"loyalty\" and ordered Nihl to apprehend her for interrogation. Nihl pursued Talon into the ancient Valley of the Dark Lords by using the Force to home in on her position. En route, he encountered a tuk'ata but used his powers to tell the beast that he was not a foe. Meanwhile in a deep chamber, Talon had already encountered the resurrected Darth Krayt who had granted her the power to sense any pursuers. He had also healed himself of his Vong implants which he had foreseen as part of his rebirth."}, {"tag": "p", "text": "Eventually Darth Nihl found and dueled Talon until Darth Krayt intervened and revealed to the two Sith his plan to hold the One Sith under his control. For decades he had taken the most powerful, newly-born Force-sensitives, having them enhanced with cybernetic implants and turned into unquestionably loyal Sith troopers that would take their own lives when ordered to do so by their master. It was with these troopers and a new, more powerful class of Sith starfighter that Darth Krayt intended to make himself the unquestioned leader of the Galaxy. Upon revealing this, he then revealed his will and presence to all those in the Galaxy that had ever touched the dark side, Cade Skywalker included. Though this brought pleasure to the One Sith, Darth Wyyrlok stood alone as an enemy of Krayt upon confirming that the Dark Lord was alive."}, {"tag": "p", "text": "Soon after Krayt proceeded to head to Coruscant with Darth Nihl and Talon, along with at least two Sith Troopers. When they arrived, they were confronted by several Sith that Darth Wyyrlok had convinced that this Krayt was an imposter. After a short battle Darth Krayt's forces were successful; an enraged Wyyrlok then confronted the Dark Lord declaring he had already killed him, and that he would not apologize for attempting to kill Krayt."}, {"tag": "p", "text": "After a short, but intense duel, Darth Krayt led Wyyrlok to believe he was victorious, only to then impale the usurper through the chest. With his former ally dead, Darth Krayt declared that for the galaxy to be truly united, he would have to cause it to go through a form of death and rebirth as he had. With that said and done, the Dark Lord of the Sith began to make his preparations for war."}, {"tag": "h3", "text": "War"}, {"tag": "p", "text": "After taking back control of the Empire and the Sith, Darth Krayt led the Empire into the offensive, to teach the Galaxy the meaning of fear, and the recklessness of incurring his wrath. To this end he ordered a number of military strikes across the galaxy, including an attack on Vinsoth, which fell to the Sith Empire, the bombing of Falleen, because they refused to ally with him, and a strike on Borosk, which returned to Sith Imperial control. When Grand Moff Morlish Veed was updating him on the state of the Galaxy, Darth Krayt told him that he sensed that there was a traitor within the Moff Council. Darth Krayt then gave Veed the assignment of finding the traitor and threatened to kill him if he failed."}, {"tag": "p", "text": "Later, Krayt's Sith Inquisitor, Darth Havok, successfully tortured the location of the hidden Jedi temple out of the imprisoned Antares Draco. After being informed to of the Temple's location by Darth Talon, Emperor Krayt ordered her to find Skywalker and make him a gift of the broken Imperial Knight. Afterwards, he viewed a message from Cade Skywalker warning Krayt that no matter what he would kill the Sith Emperor. After watching the message, Krayt decided Skywalker would have to be reborn as Krayt himself had been, for he had a vision of Skywalker serving him."}, {"tag": "h4", "text": "Battle of Taivas"}, {"tag": "p", "text": "After receiving the location of the Hidden Temple, Krayt met with the Moffs and set out his plan for the assault. Despite Admiral Veed's skepticism about Taivas being the location of the Jedi Temple, Krayt maintained his certainty and started to set up plans for the complete destruction of the Jedi, which he believed would destroy the alliance against him. Krayt promoted Moff Fehlaaur'aitel'loro as the new head of Imperial Intelligence. He also placed the Moffs' strike force, which was officially commanded by Veed, Yage and Geist, under the supervision of his Sith Lords, most notably Darth Stryfe. After the meeting however, Krayt contacted Darth Nihl, whom he had made commander of a fleet of his own Dragon ships and Sith troopers, and told him that the Moffs were not to know about the existence of this fleet."}, {"tag": "p", "text": "As the assault unfolded, Darth Krayt remained in contact with Veed. Unbeknownst to the Sith, the Jedi, the Galactic Alliance Remnant and Roan Fel's loyalists had laid a trap for them and, as the Jedi and Imperial Knights defended the Temple against the stormtroopers, the fleets of Gar Stazi and Roan Fel ambushed the Sith-Imperial fleet. Despite the Moffs' disbelief, Krayt remained unfazed and unsurprised."}, {"tag": "p", "text": "Although he let the battle unfold for some time which would apparently see an allied victory, he then ordered Darth Nihl to attack. The intervention of the Sith army turned the tide of the battle due to their willingness to kill both allies and Imperials. Moff Geist was killed in the assault by friendly fire and Moff Yage, along with his daughter and several over ships of the Imperial Navy, defected to Roan Fel. Despite this and the massive losses sustained by Sith and Imperials alike, Krayt had robbed the allies of their victory. It also served as a two pronged fork: now, Krayt's enemies in the Empire, the Moffs, were virtually powerless with only two of them remaining to serve him. The morale in the Alliance had been hit and he now had the troops needed for a full assault on the fortified world of Bastion. The war was reaching its conclusion."}, {"tag": "h3", "text": "Ultimate death"}, {"tag": "p", "text": "Knowing that Krayt could now attack them and likely win, Roan Fel and the other allied leaders opted for another option: to take the fight to Coruscant. Although they were unlikely to win, they had to try and take them on. Fel however was secretly working with Hogrum Chalk and the captured Darth Maladi to create a biologial weapon for use on the Sith: Omega Red. The allies attacked Coruscant and a strike team led by Cade Skywalker sabotaged the orbital defenses, allowing the allied fleet to gain a foothold in the system before being attacked by the full might of the Sith fleet."}, {"tag": "p", "text": "Krayt was speaking to Darth Nihl via holoprojector about the state of the battle when he was interrupted by a severely injured Darth Talon. Uttering Skywalker's name, Talon was then telekinectically lifted into the air and forcefully slammed into a nearby wall. Cade ignited his lightsaber and met Krayt's eyes with his own."}, {"tag": "p", "text": "Krayt began their final confrontation by pushing Skywalker away with the Force before unleashing a barrage of Force lightning and the two engaged in battle. Krayt urged Skywalker to surrender, as he had become much more powerful than their last encounter, and that the battle was lost. Cade retorted that he had learned many things too, and the two clashed blades. Krayt's skill was great, however, and revealed that by experiencing death, Cade had shown him the mechanism of dark transfer."}, {"tag": "p", "text": "Using the power on its creator, Krayt caused Skywalker to fall to the point of death, and there saw Krayt's vision of the future. Skywalker saw Coruscant burning, his friends dead, and his becoming enthralled in a Sith body. Krayt revealed Roan Fel's plan to release Omega Red on Coruscant was of his own doing as well, as the Sith were immune to the toxin. Every living being on the planet would be dead, except the Sith. Reviving Cade, Krayt laughed, confident that he had succeeded in turning the young Skywalker to the dark side of the Force. Returning from the brink of death, Cade announced that he did understand. He saw the vision, had no doubts, and now knew his place in the galaxy. Cade Skywalker then immediately summoned his lightsaber and in a flash, leaped around and pierced his lightsaber into Krayt's heart, killing him, and declaring himself a Jedi."}, {"tag": "p", "text": "Knowing that Krayt's body would simply heal itself again and return from death once more, and feeling Krayt's spirit prying into his mind, Cade asked his mother for her ship, intending to fly it into Coruscant Prime to destroy both himself and Krayt's body. Telling her that it was the only way, Morrigan was grief-stricken but understanding, and gave him a locket that contained a holo of herself, Cade, and his father, while also secretly acting as a tracking device for Cade's friends to find him."}, {"tag": "p", "text": "As Skywalker flew the ship to the sun, Krayt's spirit continued to tempt the newly-declared Jedi, who asked him why he just didn't decapitate him. Cade replied that he wasn't taking any chances. Krayt smirked that if his body was destroyed, he would use Cade's body to return, having learned transfer essence from Darth Andeddu and Karness Muur. However, Cade remained resolute in killing himself too. Suddenly, the spirit of Luke Skywalker appeared to him. Luke urged Cade to accept hope and not to let fear shape his life. Accepting his ancestor's guidance, Cade escaped the ship before it collided with the sun, where the corpse of Krayt, Dark Lord of the Sith, was incinerated. In an ironic twist of fate, Darth Krayt's life had ended the same way it had begun nearly two centuries ago: under the blaze of a raging sun."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "With the death of Darth Krayt and the collapse of his Galactic Empire, the victorious Allies formed the Galactic Federation Triumvirate as the new ruling body of a unified galaxy. The One Sith, however, survived the loss of its founder and planned to continue Krayt's plans to subjugate the galaxy under Sith dominance, but decided on going about it in a different approach. Thus, the Sith intended to infiltrate every planetary government with the main objective of destroying the new galactic regime from within."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite his largely informal training, A'Sharad Hett was highly devoted to Jedi philosophies and values. However, he remained silently vengeful towards Aurra Sing, his father's murderer. During their confrontation, he drew on the dark side of the Force, and while he was successful at subduing her, his guilt left him wishing to go into self-imposed exile. However, the Dark Woman saw the future which was laid out before A'Sharad and convinced him that going into exile would not cure his troubles. The Dark Woman took the young Jedi as her Padawan and finished his training to become a Jedi Knight, teaching him to accept death without anger. However, some of his fellow Jedi even back then sensed a darkness within him."}, {"tag": "p", "text": "Hett was also a firm believer in personal accountability, believing that individuals should own up to their actions. It was his belief in this that caused him to keep Anakin Skywalker's secret when he learned about Skywalker's mass murder of a Tusken Raider tribe on Tatooine, believing that it was Skywalker's responsibility to do so for himself. Despite his valiant attempt, Hett was unable to instill these beliefs into Skywalker. Had he been able to, it is possible he could have stopped Skywalker's fall to the dark side."}, {"tag": "p", "text": "However, with the advent of the Great Jedi Purge, all of Hett's beliefs fell apart, and he turned to the dark side. Seeking revenge against the Empire for the Jedi Purge, Hett returned to Tatooine and reemerged as a Tusken warlord. However, in his rage-blinded state of mind, he never actually took the fight to the Empire, instead ravaging the moisture farmers of Tatooine. His actions ultimately forced Obi-Wan Kenobi into action. Unable to understand why Kenobi didn't simply join his crusade, Hett and Kenobi clashed."}, {"tag": "p", "text": "Defeated by Kenobi and exiled from the Tusken culture, Hett began wandering the galaxy, bereft of purpose or goal. Eventually, he was captured by the Yuuzhan Vong and came into contact with Vegere. Heavily influenced by both the brutal Yuuzhan Vong culture and Vegere's teachings, Hett developed a predatory worldview, believing that the only way to establish lasting peace and order was to shatter the galaxy's current status quo. However, despite being influenced by Vergere, their separate belief systems simply didn't mesh, and she abandoned him to focus on the eventual Darth Caedus. Hett escaped from the Yuuzhan Vong soon after."}, {"tag": "p", "text": "Unlike the majority of Sith Lords, Darth Krayt was not a power-mad schemer, but rather a man devoted to establishing lasting order and peace, at all costs. His beliefs heavily influenced how he crafted his new Sith Order, for he felt that the Sith should devote themselves towards a common goal rather than personal advancement and he gave their search for power purpose. This earned him the ire of the ancient Sith Lords who believed in the Sith belief that power was an end in itself and needed no other purpose. However, in keeping with traditional Sith philosophy, and his own predatory worldview, he determined that only the strongest were able to carry out this goal."}, {"tag": "p", "text": "However, Krayt's beliefs were ultimately twisted by his own fear. Increasingly aware of his own impending death, Krayt devoted himself to finding a way to cheat it, too wrapped up in his own scheming to realize that his Sith Order could survive his death and his vision could continue. Ultimately, the tactical mistakes that he made in his efforts to stave off death spurred Darth Wyyrlok into action. Wyyrlok was effectively a product of Krayt's beliefs, and was loyal to the central goal of the Order rather than himself, or Krayt."}, {"tag": "p", "text": "As pointed out by Darth Wyyrlok, Darth Krayt had a tendency of clinging to the painful memories of his past, becoming defined by his obsessions. Wyyrlok also came to the conclusion that Krayt used his bloodline to hide his physical weakness from the rest of the Sith, ensuring Krayt's undisputed rule as Dark Lord of the Sith. In their fateful duel, Darth Wyyrlok attempted to use these memories against his former master. However, after his rebirth, Darth Krayt appeared to have overcome his past to a certain degree, which was evidenced when Krayt tricked Wyyrlok into believing he was affected by Wyyrlok's mental powers."}, {"tag": "p", "text": "After his resurrection, Darth Krayt no longer feared death, but viewed it as a passageway to something far greater. This gave him the view that the galaxy should experience the pain of death and the rapture of rebirth as he had. He also believed that Cade Skywalker had to die and be reborn in order to serve him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Lightsaber Skills"}, {"tag": "p", "text": "A'Sharad Hett was exceptionally skilled in the Jar'Kai style of fighting. This talent was evident throughout the Clone Wars, in which A'Sharad served as a General, often leading his soldiers from the front through the thickest of the fighting. A'Sharad often wielded two green lightsabers in battle, his own weapon, and that of his father. He was able to defeat Aurra Sing in a lightsaber duel while he was still a Padawan; an impressive feat, considering his own father, a fully trained Jedi Knight, had been unable to defeat Sing. It should be noted, however, that his power was augmented by the hatred he felt towards Sing for murdering his father. This indicates that Hett had discovered a basic understanding of Force rage, allowing him to boost his ferocity and best Sing. Decades later, as Darth Krayt, he was able to fully master and focus his usage of Force rage, such as when he dueled Cade Skywalker and Darth Wyyrlok."}, {"tag": "p", "text": "It was his mastery of Jar'Kai that saved Hett from being killed during Order 66, allowing him to kill the clone troopers who were sent to execute him. After turning to the dark side, but before becoming a Sith Lord, Hett engaged the extremely powerful Jedi Master Obi-Wan Kenobi in a lightsaber duel and proved capable of holding his own against Kenobi, but was eventually defeated."}, {"tag": "p", "text": "As Darth Krayt, he retained his mastery of fighting with two blades. A master practitioner of Niman, his skill with his blades was great enough for him to quickly defeat four Imperial Knights with little difficulty even despite the Vong parasites and being well over 170 years old. He was also able to fight the much younger and fitter Cade Skywalker as a superior, and almost defeated him before being shot in the back by Cade's mother. Darth Krayt claimed that his skills with his blades were such that he killed thousands of opponents since the Clone Wars. It should be noted that after his duel with Skywalker, Krayt was critically weakened by his Vong growths and was forced to spend time in stasis to heal. The Dark Lord was able to hold his own against Karness Muur, who was one of the founding members of the Sith Order and claimed to have easily killed other Sith Lords who were stronger than Krayt. Krayt was also able to slay his former right hand, Darth Wyyrlok, in a lightsaber duel. In his final duel with Cade Skywalker, he proved to be equally proficient with a single lightsaber as he was with two. During this rematch, Krayt proved to be capable of combining his prowess with his lightsaber with his skill with the Force, making him even more formidable in combat."}, {"tag": "h3", "text": "Force Powers"}, {"tag": "p", "text": "In addition to being a formidable lightsaber duelist, Darth Krayt was also talented in the other applications of the Force, notably Force lightning. The raw power of his Force lightning was enough to crumble stone columns in the Sith Temple and kill multiple rakghouls with a single burst. He even had the defensive power of tutaminis. His prowess with Force lightning rivaled that of Darth Wyyrlok, evidenced when the two launched their individual torrents in their duel without gaining an advantage over the other. The Dark Lord also possessed considerable skill in telekinesis, such as when he easily disciplined Darth Nihl in the Valley of the Dark Lords and when he redirected multiple stones thrown at him by Darth Wyyrlok. His strength in telekinesis was such that he could practically vaporize some of the stone pillars of the Sith Temple during his final duel with Cade Skywalker."}, {"tag": "p", "text": "Krayt had a talent for predicting the future as he was able to foresee that he would be reborn and able to heal himself of his Yuuzhan Vong implants and when he predicted the Galactic Alliance's and Fel Empire's tactics during the Battle of Tavias. Additionally Krayt was able to survive falling off a cliff, despite being wounded shortly beforehand, by using the Force to soften his landing. Darth Krayt also mastered ancient Sith techniques that prolong life, allowing him to survive for more than a century despite his failing body and the fact that he was partially sustained through stasis. He also demonstrated a certain degree of resistance towards Mind Tricks, such as when he tricked Darth Wyyrlok into believing he was being affected by his mental powers. Krayt also had a very acute Force sense, demonstrated when he sensed Cade Skywalker healing his Master during the Massacre of Ossus half-way across the galaxy and when he sensed the presence of a spy within the Imperial ranks. Darth Krayt was skilled in the use of Force Illusions, such as when he projected an illusion of Cade's possible future into the young Skywalker's mind, which shook Cade a great deal. The Dark Lord also appeared to have an affinity with the use of telepathy, such as when he communicated with Darth Talon to release him from stasis on Korriban. Darth Krayt was also adept in the use of Mind Walking, allowing him to travel beyond shadows, such as when he helped Luke Skywalker defeat Abeloth. He was also proficient in the use of Force drain, which he used in his battle against Abeloth."}, {"tag": "p", "text": "As the Dark Lord of the One Sith, Darth Krayt was the strongest Sith Lord of his time. His strength in the dark side of the Force was great enough to be felt by every Sith in the galaxy. Darth Krayt claimed that after his resurrection, his power in the Force multiplied, indicating that since his defeat on Had Abbadon, he had grown considerably stronger than before. His strength in the dark side was such that he could fight Cade Skywalker, who was armed with a lightsaber, with mostly his usage of the Force alone. The Dark Lord was powerful enough in the Force to battle a being as powerful as Abeloth, even though he was assisted by Grand Master Luke Skywalker."}, {"tag": "p", "text": "Before turning to the dark side, A'Sharad Hett was trained to use Force healing, though the extent of his healing abilities is unknown. However, after the Battle of Had Abbadon, Darth Krayt was finally able to completely heal himself of his Yuuzhan Vong growths as well as what would normally be severe mortal wounds, demonstrating that his skill in Force Healing had greatly increased. During his final duel with Cade Skywalker, Krayt revealed that when he experienced death on Had Abbadon, he discovered the rare dark side power of dark transfer, allowing him to explosively augment his already considerable healing powers. Darth Krayt could also use Dark Transfer to injure or kill such as when he attempted to kill Cade Skywalker during their final duel, much like how Cade himself used his Dark Transfer. Cade Skywalker claimed that Krayt's proficiency with Dark Transfer advanced to the degree in which he would heal himself even from death itself. In addition to learning Dark Transfer from his near-death experience, Krayt revealed that he could see shatterpoints in the world around him. After his final death, Krayt claimed that he learned the dangerous art of essence transfer."}, {"tag": "h3", "text": "Other skills"}, {"tag": "p", "text": "A'Sharad Hett was also a skilled pilot as proven during the battles of Geonosis and Saleucami. His skills as a pilot were such that he could navigate a Yuuzhan Vong coralskipper even though he had no prior knowledge of how to operate it. As Krayt, he also seemed to have a considerable knowledge of engineering and robotics since he was able to start his Sith Trooper Project, in addition to the construction of the Annihilator starfighters, while keeping it hidden for decades from the other Sith."}, {"tag": "p", "text": "Hett was skilled in a number of languages, such as Galactic Basic Standard, Tusken, and Bocce. While studying the ways of the Sith, he had learned to speak the ancient tongue. He and Darth Wyyrlok III were the only known members of the One Sith to possess the language."}, {"tag": "h3", "text": "Lightsabers"}, {"tag": "p", "text": "Krayt wielded several lightsabers during his lifetime."}, {"tag": "p", "text": "As A'Sharad Hett, his first weapon was constructed during his days as a Tusken Raider, while receiving informal Jedi training from his father. This weapon, like his father's, possessed a crimson blade, though the source of the focusing crystal used in it remains unknown."}, {"tag": "p", "text": "A'Sharad inherited the weapon of his father after Sharad's death. Rather than favoring one weapon or the other, Hett took to wielding both at the same time, becoming an exceptionally talented dual-blade duelist. He later replaced the crimson crystals in both his and his father's weapon with emerald ones."}, {"tag": "p", "text": "When he resurfaced as Darth Krayt, Hett had abandoned the use of his original Jedi sabers, instead he now wielded a pair of Sith lightsabers. While the specifications of the internal mechanism remains unknown, the casings of the twin weapons were composed of a type of coral substance clearly inspired by Yuuzhan Vong biotechnology. The red-bladed weapons were stored in a cross formation on his back when not in use."}, {"tag": "p", "text": "After Krayt's rebirth, he continued to use one of his Sith lightsabers, though he again took up his original Jedi lightsaber, and after killing Wyyrlok had taken out the original green crystal and replaced with a synthetic red crystal, giving it the bloodshine blade of a Sith lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of A'Sharad Hett was developed by author Timothy Truman and debuted in the Outlander Dark Horse Comics comic arc. A'Sharad's face was not seen until Enemy Lines, almost five years after the character's debut."}, {"tag": "p", "text": "In the back of Legacy 9, Randy Stradley made known that Krayt's identity would be revealed in Legacy 15. Furthermore, in the back of Legacy 11, Stradley hinted that it might be someone the fans already know or will soon know before Legacy 15 but encouraged readers to be patient until the issue was released."}, {"tag": "p", "text": "Before Krayt's identity was revealed in Legacy 15, there was already speculation that Krayt and A'Sharad Hett were one and the same. Mostly this is due to their practice of Jar'Kai, their similar facial tattoos, and Krayt being named after the krayt dragon of Tatooine, Hett's homeworld."}, {"tag": "p", "text": "When the revelation was made, editor Randy Stradley commented at the end of the issue, \"I know. You're all excited because you finally know who Darth Krayt really is. Sure, sure, some of you even guessed. Give yourself a pat on the back. Still, you have to admit, it was quite a reveal\". Another common fan theory at that time was that Krayt was going to be revealed as Jacen Solo at some point of the Star Wars: Legacy of the Force book series, but with the announcement of the \"Darth Who Contest\" and the selection of the name Darth Caedus for Solo, this theory was proved wrong."}, {"tag": "p", "text": "The depiction of A'Sharad Hett in Jedi vs. Sith: The Essential Guide to the Force bears a resemblance to an Official Pix promotional image of Anakin Skywalker.In Legacy 50, Krayt is depicted fighting Cade while donning a Vonduun Skerr Kyrric in a vision. This is contradicted by Legacy—War 6 which shows Krayt donning combat armor."}, {"tag": "p", "text": "Darth Krayt was to appear with a new design as the main foe in Red Fly Studio's Battle of the Sith Lords, coming into conflict with Maul's descendant and Darth Talon, who would have pitted against him for violating the Rule of Two."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}