{"url": "Darth_Krayt%27s_Sith_trooper", "categories": ["Category:Legends articles", "Category:Cyborgs", "Category:Force-sensitives", "Category:Sith military units", "Category:Sith trooper variants", "Category:Sithspawn"], "nodes": [{"tag": "h1", "text": "Darth Krayt's Sith trooper"}, {"tag": "p", "text": "Sith troopers were individuals, strong in the Force, who were taken by Darth Krayt shortly after birth and augmented through cybernetic implants. They were programmed into servants of unquestionable loyalty and obedience to Krayt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darth Krayt had begun his Sith trooper project in the decades between the Second Galactic Civil War and Sith–Imperial War, where the One Sith took over the galaxy. Knowing that all his Sith followers would at some point seek his power, Krayt began the Sith trooper project to create an army that was both completely loyal to him, and undefeatable. After Krayt's resurrection in the year 138 ABY, he started implementing his Sith troopers and his Annihilator-class starfighters in his war. They were fused with robotics and cybernetic components from infancy. These components connected the Sith Troopers to their Annihilators. Another Sith Trooper mentioned that they don't tire."}, {"tag": "p", "text": "The troops were housed in a secret location in the Valley of the Dark Lords on Korriban. In a demonstration of their blind obedience to the Dark Lord of the Sith, one Sith trooper guarding the chambers took his own life after being ordered to do so by Lord Krayt."}, {"tag": "p", "text": "Soon afterward, Darth Krayt returned to Coruscant to seek revenge against Darth Wyyrlok. He was accompanied by Darth Talon and Darth Nihl as well as two of these troopers. During their march into the Temple of the Sith, Krayt's Sith troopers killed several renegade Sith supporting Wyyrlok with ease."}, {"tag": "p", "text": "Months later, as the Sith Imperial assault against the Jedi Hidden Temple on Taivas ensued, and it seemed the Imperials would lose, Krayt sprung his trap, releasing his Sith Troopers on the battlefield. They tore through both Imperials and Jedi. Despite their power and ferocity, the Jedi continued their defense against the Sith, culminating in an assault on the council chamber where T'ra Saa, director of the Jedi's side of the battle, resided."}, {"tag": "p", "text": "One of the Annihilator starfighters rammed the building, heedless of Sith Troopers still inside, creating a large chain reaction killing T'ra Saa and Nat Skywalker, but also resulting in them channeling the blast created by the ship's destruction that cleared a path for the Alliance and Imperial fleets to escape. Three Troopers, one already badly damaged from the explosion, tried to prevent Cade Skywalker from escaping on the Mynock, but two were killed and one was taken captive by Cade and Morrigan Corde."}, {"tag": "p", "text": "When the allied forces attacked Coruscant, there were Sith Troopers both on ground and in Annihilators in space. While the strike team made it to the Sith Temple with only one dead and one wounded, the space battle was not working well. The troopers in their Annihilators inflicted heavy casualties on the allied forces, with the Fel-loyal Fist of the Empire destroyed, and Andurgo of Rogue Squadron killed. The progress of the battle pressed Roan Fel to obtain Omega Red from Darth Maladi."}, {"tag": "p", "text": "Darth Krayt died during the battle, and the troopers became mad and many began suicide runs at whatever targets were available, resulting in even Darth Nihl, who had assumed control of the Sith, to order their elimination. All sides of the battle were forced to fight to eliminate the elite Sith Troopers for their own survival."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}