{"url": "Darth_Luft", "categories": ["Category:Legends articles", "Category:Darths", "Category:Males", "Category:Sith Lords of Darth Krayt's Galactic Empire", "Category:Sith Lords of the One Sith", "Category:Slavers", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Darth Luft"}, {"tag": "p", "text": "Darth Luft was a male Twi'lek Sith Lord of the One Sith. He sported the traditional Sith tattoos all over his body and wielded a red-bladed lightsaber. Following the defeat of the One Sith at the end of the Second Imperial Civil War, Luft went underground and became the leader of a pirate syndicate based in the abandoned Mon Calamari Shipyards. Using a scam, he lured many Mon Calamari and Quarrens back to Dac where they forced to work as slaves building ships for the pirates. In 138 ABY, his operation was discovered by the Imperial Knight Jao Assam and the junk dealer Ania Solo who informed the Galactic Federation Triumvirate, the new galactic government. A Triumvirate task force liberated the shipyards, apprehended the pirates, and freed the slaves. During the assault, Darth Luft was killed in a lightsaber duel with Jao Assam."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Darth Luft was a Twi'lek One Sith who lived during the time of Darth Krayt's Galactic Empire. Following the death of Darth Krayt in 138 ABY, Luft became the leader of a pirate syndicate which operated a slave ring over the dead world of Dac. Darth Luft and his pirate associates succeeded in luring a large number of Mon Calamari and Quarrens back to Dac. These were then forcibly coerced into helping the pirates build a fleet of ships in the abandoned Mon Calamari Shipyards."}, {"tag": "p", "text": "As he began operation of a slave ring over Dac, he sent emissaries to the Core, and found that there was no interest in a dead planet. He did not think too highly of Darth Wredd, considering him arrogant and undisciplined, and would have killed him had he come to Dac. After encountering Ania Solo, Jao Assam, and their Mon Calamari and Quarren companions, Luft realized that they were on their own and sent them all to an escape pod that jettisoned into the poisonous waters below. After having being saved by Sauk and AG-37, Jao warned his master Yalta Val of the growing presence of pirates in the Dac system spearheaded by Darth Luft. In response, Admiral Gar Stazi and Yalta Val dispatched a fleet and complement of Imperial Knights to deal with the Sith and his pirate associates."}, {"tag": "p", "text": "While engaged in combat with the Imperial Knight, Luft was carried away by the flood triggered by the arrival of Yalta Val and his cadets. The fight resumed and seemingly ended when Luft threw Jao into the water. Imperial Knight cadets arrived and dueled Luft, but were effortlessly defeated. However, Jao succeeded in sneaking up behind the Sith and killing Luft by impaling him with his lightsaber. Following Darth Luft's death, the Galactic Federation Triumvirate apprehended his pirate associates and liberated the Mon Calamari and Quarren slaves. Darth Luft's death played into the hands of Darth Wredd because it furthered his goal of destroying the One Sith in order to re-institute the Rule of Two. Wredd personally contacted Jao afterwards to thank him for his \"help\"."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Darth Luft was an exceptionally tall red-skinned Twi'lek man who towered over most other sentient beings. Like other members of the One Sith, his face and body was tattooed in red and black Sith markings."}, {"tag": "p", "text": "As a Sith, Darth Luft had little regard for the lives of other sentient beings. This was best exemplified when he ordered the killing of the Mon Calamari and Quarren dependents and elderly following the outbreak of a slave revolt. In addition, Luft had a cruel and sadistic streak as shown when he threw the Quarren Tikin down to his death. Tikin had supplied information on the whereabouts of the intruders aboard the Mon Calamari Shipyards in a desperate attempt to secure the release of his son. As a member of the insurgency One Sith, Luft supported the post-Second Imperial Civil War policy of going underground and rebuilding the Sith's capabilities and resources. He regarded the rogue Sith Darth Wredd as arrogant and undisciplined. He also had a thorough hatred for light side users like the Imperial Knight Jao Assam."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Darth Luft was skilled in lightsaber combat and was capable of using the Force to levitate other sentient beings and objects, as shown when he threw Tikin to his death and tried to submerge Jao Assam under a piece of wreckage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}