{"url": "Darth_Maul:_Shadow_Hunter", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Darth Maul: Shadow Hunter"}, {"tag": "p", "text": "Darth Maul: Shadow Hunter is a Star Wars Legends novel that features the Sith Lord Darth Maul and serves as a precursor to the film Star Wars: Episode I The Phantom Menace. It was written by Michael Reaves and first published by Del Rey in hardcover on January 30, 2001. The first paperback edition was released on November 27 of that year and includes the novella Darth Maul: Saboteur, by author James Luceno."}, {"tag": "p", "text": "To coincide with the 2012 theatrical re-release of The Phantom Menace in 3D, as well as the return of Darth Maul in the Star Wars: The Clone Wars television series, a paperback reissue of Darth Maul: Shadow Hunter was released on December 27, 2011. In addition to Darth Maul: Saboteur, this edition includes the exclusive short story \"Restraint,\" by Luceno."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Darth Maul, merciless apprentice of evil and one of the legendary Sith, a twisted order given over to the dark side of the Force…Darth Maul, champion of the nefarious Sith Lord, Darth Sidious…Darth Maul, a legend sprung to life from the nightmares of history, about to be unleashed…in an all-new tale of intrigue and mystery set just before the events of Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "After years of waiting in the shadows, Darth Sidious is taking the first step in his master plan to bring the Republic to its knees. He meets secretly with his Neimoidian contacts in the Trade Federation to plan the blockade of the planet Naboo. But one member of the delegation is missing, and Sidious does not need his Force-honed instincts to suspect betrayal. He orders his apprentice, Darth Maul, to hunt the traitor down."}, {"tag": "p", "text": "On Coruscant, capital city of the Republic, the Neimoidian moves quickly to sell what he knows to the highest bidder. For Lorn Pavan, an information broker, the deal is too good to pass up. He grabs it, unaware that he has now earned a place on Darth Maul's hit list, right behind the Neimoidian defector himself."}, {"tag": "p", "text": "Meanwhile, a young Jedi Padawan by the name of Darsha Assant stands on the verge of ascension to Jedi Knighthood. A single mission will be her test. But a greater test awaits her. For in the labyrinthine alleyways and sewers of Coruscant's own dark side, she will cross paths with Lorn, who is fleeing from the Sith stalker, carrying with him crucial information that must reach the Jedi Council at all costs."}, {"tag": "p", "text": "The future of the Republic depends on Darsha and Lorn. But how can an untried Jedi and an ordinary man, stranger to the powerful ways of the Force, hope to triumph over one of the deadliest killers in the galaxy?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Aboard the Trade Federation freighter Saak'ak, Nute Gunray finds that his second-in-command Hath Monchar, the Deputy Viceroy of the Federation, has gone missing. Unfortunately, it is too late to do anything about it, because at that moment, Darth Sidious contacts Gunray. The Dark Lord of the Sith questions Gunray about the missing Neimoidian. Gunray panics and tells Sidious that Monchar is sick. However, the Sith Lord sees through the lie, and when the conversation ends, he sends his apprentice Darth Maul after the missing Deputy Viceroy."}, {"tag": "p", "text": "Meanwhile, Jedi Padawan Darsha Assant prepares for her final mission before becoming a Jedi Knight. She will be sent to the Crimson Corridor in the Zi-Kree Sector of Coruscant. There, she must pick up a former Black Sun employee named Oolth the Fondorian who is willing to trade information about the recent reorganization in the upper ranks of the criminal syndicate in exchange for protection by the Jedi Order. Unfortunately, when she does find Oolth, the ship they were supposed to travel in is damaged by raiding thugs who try to kill Darsha and Oolth. Though the Padawan is able to fend them off, the two of them have no choice but to zip-line up to the top of a building to get to the Jedi Temple. Bad luck strikes again when hawk-bats attack the two of them, resulting in Oolth falling off of Darsha just as she arrives at the top of the building. Knowing that she has failed since Oolth died, she neglects to mention this to the Jedi Council and instead only informs her Master Anoon Bondara over her failure. Bondara agrees to keep Oolth's death a secret from the Jedi Order until they find Oolth's body to confirm his death. They travel back to the Crimson Corridor, and even though Oolth's body is not where it was supposed to when he fell, Bondara and Darsha still conclude that he is indeed dead, because at this point, there is no doubt that scavengers would have taken his corpse already."}, {"tag": "p", "text": "Darth Maul eventually finds Hath Monchar and learns from him, while interrogating the helpless Neimoidian, the latter had sold a Sith holocron to a man named Lorn Pavan and his protocol droid partner, I-5YQ. Maul is aware that this holocron happens to contain all of the information regarding Darth Sidious's plans in bringing down the Jedi Order and taking over the Republic. Maul executes Monchar for this treachery against Sidious by decapitating him with his lightsaber, and sets off to find Pavan and I-Five. When he does, he ends up chasing them so that he can kill the two of them before they can reveal the information in the Holocron to the Jedi Order."}, {"tag": "p", "text": "As they travel back to the Jedi Temple to report to the Council regarding Oolth the Fondorian's death, Darsha and Bondara run into Pavan and I-Five just as they are being chased by Darth Maul. Bondara confronts Maul alone while Darsha leads the others to safety. During the battle, Master Bondara sacrifices himself by exploding Maul's speeder with his own lightsaber, giving Darsha, Lorn, and I-Five time to escape."}, {"tag": "p", "text": "After a long chase through the bowels of Coruscant, battling Cthons, a Taozin, and other dangers, the group is once again tracked down by Darth Maul. Assant does battle with Maul while I-Five carbon freezes Pavan in an attempt to hide and protect him. After a large explosion which Darsha enacted, thus sacrificing herself, Darth Maul can sense no life in the warehouse and believes all of his targets are dead. He heads back to his master with news of success."}, {"tag": "p", "text": "Pavan is thawed out and this time, he starts hunting Maul. Although he was able to get the drop on Maul using a taozin nodule, he is duped into giving the Sith Holocron to Senator Palpatine, who is secretly Darth Sidious. Palpatine lies that he will give the Holocron to the Council and sends Pavan to a hospital, since, just as he is taking the Holocron from Maul, Pavan has his arm cut off by the Sith Lord."}, {"tag": "p", "text": "In the end, Maul confronts Pavan in the hospital privately, and the Sith Lord decides to give the man a quick death for managing to present a worthy challenge. Pavan's last thoughts are of his son Jax. With that, Maul leaves, mission accomplished."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The 2012 reference book The Essential Reader's Companion dates the events of Darth Maul: Shadow Hunter to 32 BBY, placing it after the novel Cloak of Deception (2001) and before the Star Wars: Episode I The Phantom Menace novelization (1999)."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}