{"url": "Darth_Maul%E2%80%94Son_of_Dathomir_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Maul—Son of Dathomir"], "nodes": [{"tag": "h1", "text": "Darth Maul—Son of Dathomir 3"}, {"tag": "p", "text": "Darth Maul—Son of Dathomir, Part Three is the third issue of the comic series Star Wars: Darth Maul—Son of Dathomir. Within its pages, the once-Sith Lord Darth Maul has captured Count Dooku and General Grievous. Dooku joins the former Sith apprentice, and the two fight off a Jedi-led Galactic Republic assault that brings the two Sith face-to-face with Obi-Wan Kenobi and Mace Windu. Secrets about Darth Maul's past are also revealed."}, {"tag": "p", "text": "Son of Dathomir, Part Three was written by Jeremy Barlow and pencilled by Juan Frigeri. It was adapted from \"Proxy War,\" an episode that was scripted by Aïda Mashaka Croal and Matt Michnovetz for what would have been the seventh season of the television series Star Wars: The Clone Wars, had the show not been cancelled. Because it is based on a script from the series, which was produced by George Lucas, it is part of the official Star Wars canon. The 40-page issue was published on July 16, 2014 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"Darth Maul has captured Darth Sidious's new apprentice! Mother Talzin and Maul attempt to sway Count Dooku to their cause, revealing surprising facts about Maul's past. But an attack by an elite Jedi strike force throws everyone's plans into chaos!\""}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the aftermath of the battle between the Shadow Collective and the Confederacy of Independent Systems on Ord Mantell, in which Darth Maul and Death Watch captured Count Dooku and General Grievous, the Jedi Order sends a team to Ord Mantell to investigate what happened. Jedi Master Mace Windu contacts Supreme Chancellor Sheev Palpatine, secretly the Sith Lord Darth Sidious, to inform him that Darth Maul was behind the battle. Windu suspects that the Galactic Republic can use this information to capture Maul and Dooku, and use their capture to end the Clone Wars."}, {"tag": "p", "text": "The Jedi continue their investigation in Ord Mantell City. Along with Windu are Obi-Wan Kenobi, Tiplee, and Aayla Secura. They discover a Death Watch helmet, confirming their intelligence that Mandalore had allied with Darth Maul. Fearing that Mandalore could fall to the Separatists, Kenobi and Tiplee launched an investigation of Vizsla Keep 09 where the Jedi suspected Maul was hiding."}, {"tag": "p", "text": "On the outpost, Maul contacts Darth Sidious via hologram and informs him that Dooku and Grievous have been captured. Sidious tells Maul to kill them, for the Dark Lord of the Sith has no use for what he sees as failures. Rather than kill them outright, Maul orders Grievous to be taken to the brig. Meanwhile, the Jedi begin their approach towards the outpost, and Tiplee fears that Kenobi will be unable to keep his emotions under control; Maul killed Satine Kryze, the Duchess of Mandalore and a close personal friend of Kenobi's. Kenobi assures his fellow Jedi that he will not fail."}, {"tag": "p", "text": "As the Republic approaches, Maul offers Dooku a choice: join Maul or die. They were both betrayed by Sidious, so Maul believes they can be allies. Mother Talzin appears in a cloud of magick smoke, and reveals that she too was once betrayed by Darth Sidious—and that Darth Maul is her son. As Talzin explains, Sidious always betrays his allies, and even now is working to find a new apprentice. As they speak, the Republic assault on the outpost begins, and the Republic ships make their way through Gauntlet fighter fire towards the base. Grievous uses the chaos to make it to an escape pod, while Dooku agrees to join Maul and fight against Kenobi's boarding party."}, {"tag": "p", "text": "When Kenobi and his team make it on board, he and Tiplee are quickly confronted by Maul and Dooku. They engage in a lightsaber duel, which is soon joined by Windu and Secura. The duel was fairly long, but it soon ends when Dooku kills Tiplee, and when Gar Saxon shoots a small missile into the lightsaber duel to incapacitate the Jedi. With the Jedi knocked out, Maul and Dooku escape aboard a Gauntlet fighter. In the aftermath of the battle, Windu contacts Palpatine and informs him of the battle's outcome. The Jedi Master also surmises that the battle proves Dooku is the Sith Master, an incorrect assessment that Palpatine, the true Dark Lord, allows the Jedi to believe."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Son of Dathomir, Part Three was adapted from \"Proxy War,\" an episode that Aïda Mashaka Croal and Matt Michnovetz scripted for what would have been the sixth season of Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}