{"url": "Darth_Momin%27s_lightsabers", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Darth Momin's lightsabers"}, {"tag": "p", "text": "A pair of Sith lightsabers were the personal weapons of the Sith Lord Darth Momin. Sometime before the rise of the Galactic Empire, Momin utilized these lightsabers while training under Darth Shaa. Eventually he would use his sabers to cut down his Sith Master."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early use"}, {"tag": "p", "text": "At some point during his apprenticeship to Darth Shaa, Darth Momin constructed a pair of Sith lightsabers which he used to train with Lady Shaa. However, Momin found the role of apprentice disgusting, considering himself second to no one. His master disagreed with him, so during one session, he proved his point by impaling her through the chest with his blades."}, {"tag": "p", "text": "With his lightsabers, Momin embarked on his newest project to become worthy for the Force, which he believed to be his only audience. Enlisting the help of a group of devoted acolytes, Momin built a superweapon and used it to destroy a city, planning to pour the Force into the engine at the moment of ignition and use it to slow down time forever trapping the expressions of pain and horror on the inhabitants. However, two Jedi arrived and slaughtered the acolytes, causing Momin to lose concentration and lose control over the weapon, vaporizing into nothing and leaving only his spirit inside his mask."}, {"tag": "h3", "text": "Return to Momin"}, {"tag": "p", "text": "At some point after the rogue Inquisitor chase, Momin's spirit manifested to Darth Vader, the Sith enforcer of the Galactic Empire, told him his story and offered him his services into constructing a fortress for himself in addition to a portal which would open the gates to the dark side of the Force, which would allow Vader, to reunite with his wife, Padmé Amidala. Vader accepted Momin's offer but warned him to not betray him."}, {"tag": "p", "text": "After eight failed designs, Momin finally achieved what Vader wanted for his fortress with the ninth design. Before he could prove the portal to the dark side Momin constructed in a Sith cave, an army of Mustafarians led by Father Kkkt battled Imperial forces. But Vader hadn't realized Momin's true intentions: alone with the portal, Momin opened the gates and returned his mask to his original body, killing the Imperial construction worker he was using as a host and wielding the pair of lightsabers once again."}, {"tag": "h3", "text": "Final defeat"}, {"tag": "p", "text": "After finishing with Kkkt's clan, Vader returned to the cave only to find Momin waiting for him, who thanked him for protecting the castle from the Mustafarians. Vader drew his lightsaber and they began dueling. Momin used one of his blades to cut a part of Vader's left arm."}, {"tag": "p", "text": "Engaging Vader again, Momin cut off Vader's right arm. Having seemingly beat Vader, Momin prepared to give the final blow, but he was unable to do so as Vader threw a massive stone at Momin, leading Momin to drop the sabers as the stone crushed him against a wall and killed him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}