{"url": "Darth_Paper_Strikes_Back", "categories": ["Category:Real-world articles", "Category:Non-canon Legends articles", "Category:Origami Yoda"], "nodes": [{"tag": "h1", "text": "Darth Paper Strikes Back"}, {"tag": "p", "text": "Darth Paper Strikes Back is the sequel to the bestselling Young Reader book The Strange Case of Origami Yoda. It was released on August 23, 2011 and written by Tom Angleberger. After over 10,000 votes, the character Darth Paper was chosen by fans in a poll on Tom Angleberger's website as the character they would most like to see in a sequel."}, {"tag": "p", "text": "The book follows the events of Origami Yoda's puzzling predictions and sage advice in Dwight's classroom at McQuarrie Middle School, returning to aid Dwight, Tommy, Kellen, Sara, Rhondella and other students. The arrival of Darth Paper signals one thing: the destruction of Origami Yoda. One individual will succumb to Darth Paper's evil powers and do something almost unforgivably bad."}, {"tag": "p", "text": "Included are instructions on how to make Darth Paper out of origami paper, plus several other bonuses."}, {"tag": "p", "text": "The events of the title were followed by The Secret of the Fortune Wookiee."}, {"tag": "h2", "text": "Publisher's Summary"}, {"tag": "p", "text": "It is a dark time at Ralph McQuarrie Middle School. After suffering several Origami Yoda–related humiliations, Harvey manages to get Dwight suspended from school for being a “troublemaker.” Origami Yoda pleads with Tommy and Kellen to save Dwight by making a new case file—one that will show how Dwight's presence benefits McQuarrie. With the help of their friends, Tommy and Kellen record cases such as “Origami Yoda and the Pre-eaten Wiener,” “Origami Yoda and the Exploding Pizza Bagels,” and “Origami Yoda and Wonderland: The Musical.” But Harvey and his Darth Paper puppet have a secret plan that could make Dwight's suspension permanent . . ."}, {"tag": "p", "text": "With his proven knack for humorously exploring the intrigues, fads, and dramas of middle school, Tom Angleberger has crafted a worthy sequel to his breakout bestseller."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}