{"url": "Darth_Nyriss%27s_stronghold", "categories": ["Category:Legends articles", "Category:Dromund Kaas locations", "Category:Fortresses"], "nodes": [{"tag": "h1", "text": "Darth Nyriss's stronghold"}, {"tag": "p", "text": "Darth Nyriss's stronghold was a fortified palace just outside Kaas City on Dromund Kaas where Darth Nyriss retreated for protection from the assassination attempts on her life."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Darth Nyriss's stronghold had a large courtyard. High stone walls stood to the north and south. The east end was open to the street; the west was bordered by what Scourge assumed was Darth Nyriss's stronghold. In many ways the building resembled the Emperor's citadel, though on a significantly smaller scale. The architectural similarities were more than just an homage to the Emperor. The courtyard itself was populated by half a dozen large statues, each several meters wide at the base and easily twice as tall as Scourge. The two largest depicted humanoids in Sith robes—a male and a female. They stood with their arms raised slightly forward, their hands palms up. The man's face was hidden by a hood—the common depiction of the Emperor. The woman had her hood thrown back to reveal fierce Sith features. The other statues were abstract pieces, though each incorporated Nyriss's household emblem—a four-pointed star inside a wide circle. The ground was covered with fine white pebbles. A rare type of lichen that thrived in the gloom of Dromund Kaas had been planted in decorative patterns throughout the stone, the faint purple glow providing a ghostly illumination. A smooth path of finished stone led from the massive double doors that marked the entrance to the stronghold, through the center of the courtyard, and out to the small landing pad for speeders."}, {"tag": "p", "text": "The entrance doors had small holoscreen on the side with a call button. The stronghold had a study or private library that was well-lit. The walls were lined with shelves, their ancient wooden frames warped by the weight of the treasures they bore. Dozens—if not hundreds—of volumes filled the shelves on the left wall. Most of the books were large and thick, their bound pages protected by covers of leather or some similarly cured hide. They had an antiquated look about them, though most appeared to be preserved in good condition, if somewhat worn from use. The shelves on the right wall contained reference material that looked even more ancient and delicate. Loose leaves of yellowed parchment were held in place with delicate wire clips; rolled scrolls were encased in clear protective tubes. A hinged glass cover sheltered several books that looked as if they might crumble into dust should a strong breeze pass through the room. On the rear wall was a large bank of holodisks and datacards, and in the center of the room was a computer workstation."}, {"tag": "h2", "text": "Appearances"}]}