{"url": "Darth_Nyriss", "categories": ["Category:Legends articles", "Category:Dark Councilors", "Category:Females", "Category:Sith species", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Darth Nyriss"}, {"tag": "p", "text": "Darth Nyriss was a female Pureblood Dark Lord of the Sith who sat on the Dark Council for more than twenty years (the third-longest tenure at the time)."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female Sith Pureblood, Nyriss was an exceptionally powerful and ambitious woman. Darth Nyriss was one of the most talented and influential figures of the Sith Empire in her time. Perhaps her most notable accomplishments were the conquest of Drezzi, the destruction of Melldia, and gaining membership of the Empire's Dark Council on the basis of her talents. However, the Dark Council in her time was rife with internal power struggles and plotting. Nyriss, in particular, was subjected to several assassination attempts. Due to these occurrences, the Sith Emperor advised Nyriss to temporarily seclude herself from the Council's politics until the matter was resolved; she resided in a well-protected citadel on the western edge of Kaas City during this time. The Sith Emperor also suggested Nyriss to hire an agent who would be detached from the Council's politics and help her investigate the matter. However, Nyriss had plans of her own, which she put in to motion once a renowned warrior called Lord Scourge arrived in Dromund Kass to assist her."}, {"tag": "p", "text": "By the time Nyriss met Scourge, her physical appearance had degenerated immensely as a result of the powerful dark side rituals that she chose to delve in; she was highly proficient in the arts of Sith sorcery and strong in the dark side of the Force. Nyriss was once very beautiful and could easily afford the procedures required to retain her youthful appearance but she chose not to, possibly to flaunt her strength in the dark side or that she didn't care about superficial appearances."}, {"tag": "p", "text": "Nyriss's plans went beyond the elimination of her enemies who wanted her dead; she was among the co-conspirators on the Dark Council who planned to destroy the Sith Emperor. When Scourge found about this, he confronted Nyriss to ascertain her true motives. However, Nyriss still deemed his usefulness and revealed some terrible secrets of the Sith Emperor to Scourge to buy his allegiance. She even took Scourge to Nathema—former homeworld of the Sith Emperor—to prove her claims."}, {"tag": "p", "text": "Nyriss was responsible for Revan's capture on Nathema and held him captive for several years in her stronghold, until the Jedi Master managed to turn Scourge against her on the basis of his talents and teachings. By this time, Scourge was not just ready to remove Nyriss from the picture but was also willing to help Revan in his plan to assassinate the Sith Emperor. As part of this plan, Scourge revealed Nyriss's treachery to the Sith Emperor, who then decided to eliminate all possible threats to him on urgent basis. Soon after, the Sith Emperor's forces attacked and seized Nyriss's stronghold."}, {"tag": "h3", "text": "Final confrontation and death"}, {"tag": "p", "text": "As the battle ensued, Nyriss headed towards the prison cell where Revan was being held. Upon approaching the stairs which led to the prison cell, she noticed a droid called T3-M4 who raised alarm about her arrival. Nyriss unleashed a blast of power which sent T3-M4 tumbling down the stairs in response. Nyriss then saw two guards approaching her position whom she blasted with a powerful burst of purple lightning. The deadly bolts reduced those unfortunate guards to charred smoking husks in an instant. As Nyriss approached the cell of Revan, she noticed the presence of another powerful Jedi named Meetra Surik in the room along with Scourge. Nyriss questioned Scourge about his motives but upon receiving no response from him, she realized his betrayal, and attacked him and the Jedi simultaneously. Neither Scourge nor Surik could withstand the might of Nyriss. With combination of her impressive speed, skills with the lightsaber, and power of the dark side, Nyriss subdued both of her powerful opponents simultaneously."}, {"tag": "p", "text": "Nyriss then paused to prepare for the killing blow as the air around her began to crackle and grow hot. While she gloated about her past accomplishments, Revan emerged from his cell, with his Jedi robe pulled over his head and his mask on his face. Nyriss unleashed a swirling storm of pure dark side energy to incinerate her opponents. Revan stretched out his hands, and absorbed the deadly power of the dark side. Revan mocked Nyriss and redirected her power back at her. Nyriss was engulfed by her own power and failed to prevent the deadly bolts from ripping her apart, reducing her into a pile of ash."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Darth Nyriss was a master of Force lightning and favored it heavily. She was also an expert in Sith rituals making her an expert in the field. She was also capable of using Telekinesis, Force speed and force shield to protect herself from attacks. Nyriss proved exceptionally capable in combat subduing both Lord Scourge and Meetra Surik. Darth Nyriss used Juyo in lightsaber combat and carried a standard red-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Nyriss was first introduced in the novel The Old Republic: Revan by Drew Karpyshyn. In the 2012 reference guide The Essential Reader's Companion, Darth Nyriss' name is consistently misspelled Darth Nyris."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}