{"url": "Darth_Plagueis", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Dark Lords of the Sith", "Category:Darths", "Category:Males", "Category:Muuns", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "Darth Plagueis"}, {"tag": "p", "text": "Darth Plagueis (pronounced /'pleɪɡ.əs/) was a Force-sensitive Muun male Dark Lord of the Sith and the master of Darth Sidious. Plagueis lusted for immortality, believing the secret laid in science, so worked with his apprentice, conducting research into bioengineering and experimented with his ability to influence the midichlorians to create life. He truly acquired considerable knowledge of the Force, but was ultimately betrayed and murdered by his own apprentice, in accordance with the Rule of Two. Sidious later recounted the tale of his master's demise to lure the Jedi Knight Anakin Skywalker to the dark side of the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Darth Plagueis was a Muun male Dark Lord of the Sith trained by the Sith Master Darth Tenebrous."}, {"tag": "h3", "text": "Master of Darth Sidious"}, {"tag": "p", "text": "At some point prior to the Invasion of Naboo, Plagueis chose Sheev Palpatine, a human from Naboo, as his apprentice. As master and disciple, Plagueis and Palpatine—who took the Sith moniker Darth Sidious—worked together for years, trying to unlock the secrets of immortality as Plagueis lusted for it and to execute their order's long-percolating plan of supplanting the Galactic Republic with a new Sith Empire. At some point, Plagueis acquired the protocol droid 11-4D."}, {"tag": "p", "text": "While training Sidious, Plagueis taught him that two Sith were required for their perilous machinations. So, if they worked together in accordance to the Rule of Two, with one of them serving as a bait for the dark side of the Force and the other as a vessel, they would succeed in acquiring the ability to harness the full power of the dark side and rule immortal for ten thousand years. While apprenticed by Plagueis, Sidious also built his own lightsabers. Plagueis attempted to create a Force dyad with Sidious, a unique Force-bond as strong as life itself and which inspired the Rule of Two. However, Plagueis was unable to form the dyad."}, {"tag": "p", "text": "Plagueis believed the secret to immortality laid in science. He conducted in-depth research into the biological underpinnings of life and unnatural experiments, through his ability to coax the midiclorians, in an attempt to cheat death, that, though incomplete, were encouraging to his apprentice. Eventually, Plagueis ended up discovering a way to achieve his so desired \"immortality\": transferring his consciousness to another body, essentially using bodies as vessels. By the time that Sidious, under his public persona of Sheev Palpatine, was appointed as Naboo's representative in the Galactic Senate, Plagueis was still teaching him."}, {"tag": "h3", "text": "The Tragedy of Darth Plagueis the Wise"}, {"tag": "p", "text": "According to Sidious, Plagueis was powerful enough that he could use the Force to influence the midi-chlorians to create life and keep the ones he cared about from dying, a precious knowledge that awarded him the epithet of \"The Wise.\" However, Plagueis also developed a belief that the Force could \"strike back\" at him for his power. In truth, he became so powerful that the only thing he still dreaded was losing his power. Ultimately, Plagueis' only fear was bound to come true: at some point, Sidious had learned everything he needed from his master, after which he decided that he had no further use for his teacher, Sidious disposed of Plagueis, killing him in his sleep. As noted by Sidious, Plagueis didn't act fast enough to prevent his own demise. At some point after this, Sidious acquired his own pupil in the Nightsister Mother Talzin's son, Darth Maul, a young Dathomirian Zabrak whom Sidious had kidnapped from Talzin when he was only a child."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "With the death of Plagueis, Sidious not only gained the status of Master, but also acquired 11-4D, the late Sith Lord's multi-limbed assistant. In the waning days of the Republic, Sidious recounted the history of his late master to the Jedi Knight Anakin Skywalker, whom he befriended years before the Clone Wars in an effort to gradually turn him to the dark side of the Force. Skywalker, who was unaware at the time that his friend was in fact a Sith Lord, and having developed premonitions of his secret wife's death in childbirth, was intrigued by the story of Plagueis, particularly his ability to prevent death. When the fear of loss drove Skywalker to betray the Jedi Order, turning him into the Sith Lord Darth Vader, Sidious reformed the Republic into the Galactic Empire and declared himself Emperor. At the same time, he had the Jedi wiped out by Order 66, completing the Sith plan that lasted for over a millennium."}, {"tag": "p", "text": "One of the few Jedi to survive was a Padawan named Ferren Barr. Barr began investigating as to why the Jedi fell so quickly and learned of Plagueis' existence, putting his file on him in his list of individuals involved in the crisis. In the years that followed his rise to power, Sidious came to genuinely, if posthumously, appreciate Plagueis for the planner and prophet he had been. Sometimes, Sidious mused about how his late master would have reacted when confronted with the trivial, day-to-day matters of Imperial politics, remarking that Plagueis never foresaw that he would become Emperor."}, {"tag": "p", "text": "Twenty-three years later, during the Battle of Endor, Sidious came to be killed by a redeemed Anakin Skywalker, who turned back to the light side of the Force and threw Sidious down a reactor shaft to save his son Luke. While falling, however, Sidious reflected that he had prepared himself for that scenario unlike Plagueis and called on all the power of the dark side to leave his body and thrust his consciousness far, far away to a cloned body created by the Sith Eternal  on the secret Sith world of Exegol. When Sidious used the secret to immortality stolen from Plagueis to survive, he was able to stave off death for a time, but immortality still eluded the Dark Lord."}, {"tag": "p", "text": "In the years following the Empire's end, during the final stages of the war between the First Order and the Resistance, Sidious' granddaughter Rey tracked him down to Exegol as the Resistance and the Sith Eternal prepared for a final showdown. Before a redeemed Ben Solo came to her rescue, Sidious insisted his granddaughter to strike him down as he did with Plagueis, allowing Rey to read his mind and realize how he came back thanks to Plagueis' teachings. Ultimately, Rey used the voices and power of the past and deceased Jedi to destroy Sidious and the Sith for good."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Darth Plagueis was a wise Dark Lord of the Sith who possessed a vast knowledge of the dark side of the Force. He was a meticulous planner, who tried to accomplish the Sith's goal to replace the Galactic Republic with a Sith Empire. Due to his powers, he also became paranoid, believing that the Force could \"strike back\" against those who sought to meddle with the very fabric of both the physical and cosmic realms."}, {"tag": "p", "text": "Obsessed with achieving immortality, Plagueis strived to discover the path towards becoming an eternal being alongside his apprentice Darth Sidious and rule together for thousands of years, and believed the secret to it laid in science. While Plagueis became afraid of losing his power, he never expected his apprentice to be the reason he would lose power. Ultimately, Plagueis underestimated Sidious, who betrayed and murdered him when he least expected it. Though Plagueis did not live to achieve his goals, Sidious succeeded to survive his death, but given that his transfer was imperfect, he asked himself if maybe Plagueis got the last laugh after all at his failure."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "According to Darth Sidious, Darth Plagueis was a powerful Sith Lord who was able to use the Force to influence the midi-chlorians to create life. His great knowledge of the dark side of the Force could even aid him in keeping the ones he cared about from dying."}, {"tag": "p", "text": "Focused on achieving immortality, Darth Plagueis managed to discover a way to become immortal, which consisted on transferring his consciousness to another body and use it like a vessel. His apprentice Darth Sidious was later able to survive his first death through this method, yet the transfer was imperfect."}, {"tag": "p", "text": "Darth Plagueis may have had the ability to see into the future as his apprentice later mused in appreciation of him for the prophet he had been. However, what Plagueis never saw coming was his apprentice's rise to power."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Plagueis was first mentioned on-screen in the 2005 film Star Wars: Episode III Revenge of the Sith, the third and final installment of the Star Wars prequel trilogy. Although Palpatine was never confirmed to be Plagueis' apprentice in the movie itself, a link to the official encyclopedia on StarWars.com did refer to Sidious as having been \"trained by Darth Plagueis.\""}, {"tag": "p", "text": "The character was created by George Lucas as early as the first draft of Revenge of the Sith—dated April 2003—and possibly earlier. His story was massively expanded upon in the 2012 Star Wars Legends novel Darth Plagueis, written by James Luceno. It notably established Plagueis to be a Muun just as Lucas proposed."}, {"tag": "p", "text": "The Biography gallery of Darth Sidious' Databank entry states that Plagueis was killed by Sidious after he took Darth Maul as his apprentice. However, the 2019 reference book Ultimate Star Wars, New Edition lists Plagueis' murder at Sidious' hands as taking place before Sidious takes Maul under his wing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}