{"url": "Darth_Revan%27s_Sith_Empire", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Sith states and governments"], "nodes": [{"tag": "h1", "text": "Darth Revan's Sith Empire"}, {"tag": "p", "text": "Darth Revan's Sith Empire, simply known as the Sith Empire, was a revived faction of the Sith Order founded by the Dark Lord of the Sith, Darth Revan, and his apprentice, Darth Malak, as a dark side organization in direct opposition to the Galactic Republic and its Jedi defenders."}, {"tag": "p", "text": "Built upon a hardened core of veterans from the Mandalorian Wars, and a host of Jedi converts, this new galactic power very nearly succeeded in conquering the Republic during the Jedi Civil War. After the redemption of Revan and the death of Malak, the Empire splintered into factions before finally dissolving entirely circa 3950 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The founding"}, {"tag": "p", "text": "Towards the end of the Mandalorian Wars, the Republic's Jedi commander Revan visited the ancient Trayus Academy on the Sith world of Malachor V. There, he fell under the influence of the dark side. While unearthing the planet's buried secrets, Revan discovered evidence that an ancient Sith faction known as the Sith Empire still existed beyond the boundaries of known space and continued to pose a threat to the galaxy."}, {"tag": "p", "text": "The beginnings of Revan's Sith Empire could be found in the end of the war. As his forces engaged in battle with the Mandalorians above the planet Malachor V, Revan dueled their leader Mandalore the Ultimate to the death while the two factions' fleets waited above. In Mandalore's final moments, he informed Revan that he had been influenced by a mysterious faction of Sith. After the Mandalorian fleet experienced a crushing defeat above Malachor and surrendered, Revan and his friend Malak traveled to the ice world of Rekkiad to investigate their fallen foe's claims. From there, they followed a trail that led them into the Unknown Regions with almost a third of the Republic fleet—justifying their departure by claiming to be pursuing the remaining Mandalorian forces."}, {"tag": "p", "text": "However, Revan and Malak eventually found their way to Dromund Kaas and discovered that the Sith Empire indeed still lived. Their attempt to eliminate the Sith Emperor went horribly wrong, with the Emperor dominating their minds and finally turning them to the dark side. Programming them to attack the Republic in order to test the enemy's weaknesses, the Emperor named the two Dark Lords of the Sith and bestowing the Darth title on them. The Emperor then tasked them to use their knowledge of the forgotten Rakatan Infinite Empire to find the legendary Star Forge, which would help him create an armada that would crush the Republic. The next year saw them secretly search for ancient Star Maps which would lead them to the Station."}, {"tag": "p", "text": "Revan was to prepare the major offensive against the Republic by the order of the Emperor. However, the Emperor underestimated the two former Jedi's resolve—Revan and Malak broke free of their conditioning almost immediately upon their departure and began to act of their own will. From the deck of the Star Forge, hidden in the unmapped Lehon system, Revan founded a new Sith Empire in direct opposition to the Emperor's Sith Empire, intending to conquer the Republic and remake it into something that could withstand the Emperor's assault. Adapting the teachings of the ancient Sith to his own needs, he then took his friend Malak as his apprentice."}, {"tag": "p", "text": "A year after their apparent disappearance, Revan and Malak returned at the head of a massive invasion fleet made up of Republic vessels such as the Leviathan, as well as strange hybrid technologies built by the Star Forge. They were crewed by experienced ex-Republic veterans, and commanded by some of the finest officers that the Republic had produced including Admiral Saul Karath, General Derred, and Mon Halan. Calling themselves the Sith, they declared war on the Republic."}, {"tag": "h3", "text": "The Jedi Civil War"}, {"tag": "p", "text": "With Darth Revan at the helm, the Sith invasion was all but unstoppable. His Sith assassins secretly flooded into the Republic from their base on Malachor V, killing and/or abducting Jedi throughout Republic space. In Sith outposts on Lehon, Dxun, and Korriban, Revan's most faithful servants broke captured Jedi and led them to the dark side. The Sith conspired with Czerka Corporation, one of the richest and most powerful galaxy-spanning companies of the time, to amass much needed resources. They also secured a place on the ocean planet of Manaan, thanks to the native Selkath neutrality, and so were able to export the healing agent kolto to their forces."}, {"tag": "p", "text": "As the Sith's conquest continued unchecked, worlds began to secede to the Sith invasion fleet voluntarily, either out of fear of what had happened to Telos IV or because they believed that the corrupt and ineffectual Republic was finally about to fall. The Republic, however, still had one last card to play—the Jedi. Time and again, the Republic armadas were saved from certain destruction by the prowess of a young Jedi Padawan named Bastila Shan. During a long string of Republic losses, her skills in battle meditation staved off utter defeat."}, {"tag": "p", "text": "When the Sith were on the brink of victory, Revan's flagship was invaded by a Jedi strike team during an ambush. Led by Bastila, the Jedi were able to corner Revan on the bridge. Ever ambitious, Malak fired upon his master's vessel, hoping to destroy all of his enemies with one swift stroke, but all did not go as he had planned. The ship was destroyed, but the Jedi were able to escape with a critically injured Revan."}, {"tag": "h4", "text": "The betrayal of Darth Malak"}, {"tag": "p", "text": "After the apparent death of Revan, Malak crowned himself as the new Dark Lord of the Sith and continued his former master's war of conquest, but he did not share Revan's vision. Afterwards, he took his own apprentice, Darth Bandon. Whereas Revan had kept key Republic infrastructure intact for the purposes of post-war rebuilding, Malak and Bandon were believers in more brutal methods. Likely ignorant of Revan's original intentions, they preferred an all-out war of destruction and carnage."}, {"tag": "p", "text": "Malak's primary objective quickly became the assassination or capture of Bastila Shan. He almost got his wish when Bandon overwhelmed and boarded her flagship, the Endar Spire, during a Sith ambush over the world of Taris. Bastila managed to flee the battle in an escape pod. She was soon joined by an amnesiac Revan who had escaped the Endar Spire with the aid of Saul Karath's old protégé Captain Carth Onasi. After a fruitless quarantine and search of the planet, Darth Malak ordered Admiral Karath to destroy it. The entire surface of Taris—including all life there—was utterly obliterated during a combined sterilization operation by the Sith fleet, but Bastila, Revan and their party managed to escape and flee to the Jedi Enclave on Dantooine onboard a stolen smuggler vessel named the Ebon Hawk."}, {"tag": "p", "text": "On Dantooine, the unaware Revan was retrained in the ways of the Force before given a quest of vital importance to the Republic—retracing Darth Revan's path to the Star Forge. After obtaining data from three damaged Rakatan Star Maps and with the death of Bandon, the crew of the Ebon Hawk were captured by Saul Karath's command ship, the Leviathan. Fortunately, Bastila and her party managed to escape from their cells and confronted Saul Karath on the bridge, where he was killed. On the verge of escaping the vessel, Darth Malak arrived and faced them. During the confrontation, Revan's true identity was revealed and Bastila sacrificed herself so that he and the others could escape. She was captured by Malak and after being tortured, she fell to the dark side and became his new apprentice."}, {"tag": "h4", "text": "The fall"}, {"tag": "p", "text": "Having discovered the ancient Star Maps on Dantooine, Tatooine, Kashyyyk, Manaan, and Korriban, Revan and his crew were able to piece together the location of the Star Forge. The Republic armadas were summoned to Lehon and a massive space battle took place between the Republic and Sith forces. After a confrontation with Revan, Bastila returned to the light side and betrayed her master by using her battle meditation to aid the Republic forces. The Jedi Civil War ended as Darth Malak died at the hands of his old master. With Malak gone and the Star Forge destroyed, the infrastructure of the Sith Empire collapsed. The remaining Dark Jedi descended into a state of civil war and virtually wiped themselves out."}, {"tag": "p", "text": "Small skirmishes led by ex-Sith forces continued for the next few years, until much of what Revan had built was undone. In time, three new Sith Lords soon arose to take control of a remnant of the Empire, but they were never strong enough to directly challenge the Republic. The fragile alliance between Darth Nihilus, Darth Sion, and Darth Traya which almost completely decimated the Jedi was eventually destroyed by Meetra Surik, bringing an end to the Sith legacy that Revan had begun. Revan, meanwhile, had disappeared from known space, apparently continuing his previous tactics to take on the ancient Sith Empire by himself. Meetra followed him and eventually got herself killed while Revan was imprisoned in stasis for centuries. Nearly three hundred years later, the ancient Sith Empire would return to plague the Republic once more."}, {"tag": "h2", "text": "Government and politics"}, {"tag": "p", "text": "Following the dissolution of the original Sith Empire circa 5000 BBY, the former capital world of Ziost fell by the wayside, and was nearly forgotten. After the defeat of Exar Kun in 3996 BBY, a number of his former Sith disciples fled to the far reaches of the galaxy, including the territory of the former Sith Empire. During the intervening three-and-a-half decades, the mausoleum planet Korriban was occupied by those who ultimately became the true heirs-apparent to Kun's mantle. It was while journeying into Sith space following the Mandalorian Wars that Revan and Malak encountered the Sith Emperor, and were anointed as the next Dark Lords of the Sith, in order to pave the way for a future Sith invasion of the galaxy. Under the ex-Jedi, Korriban thus became the new capital of the Sith Empire, and began to attract ever-growing numbers of students and acolytes to the burgeoning Sith Academy there. The planet's status as Ziost's successor was complete."}, {"tag": "p", "text": "The organization of Darth Revan's Sith Empire was surprisingly similar to that of Darth Sidious' Galactic Empire. The guiding principle of the Empire was natural selection or survival of the fittest. Even the lowliest grunts were encouraged to compete for positions of power through any means necessary. While this means of promotion created a tense and divisive system of governance, it nevertheless ensured a powerful and capable military. Revan, then Malak after him, were the supreme rulers of the Empire and their strength and charisma alone kept their minions in check."}, {"tag": "p", "text": "The Sith had a unique way of managing conquered territories. A single governor, often a Dark Jedi, would be posted on each world and housed within an embassy which would contain a security force large enough to keep the planet under control. The Sith fleet was often on the move which allowed even the Dark Lord of the Sith to command from the front lines. All of these structures were designed to expedite the support and deployment of the Empire's military forces, rather than to provide a sedate governing body such as the Galactic Republic."}, {"tag": "p", "text": "The Sith Academy on Korriban followed similar rules. Prospective students learned to care only for themselves and to be ruthlessly independent. Additionally, the Master of the academy could, at any time, be succeeded by his apprentice."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "Upon their return to known space, the Sith were well equipped for battle. The new Sith Empire's fleets were primarily dominated by stolen Republic vessels during the early stages of the Jedi Civil War, but they were soon supplemented by a host of starships built by the Star Forge. The Star Forge itself served as a primary staging ground and command center."}, {"tag": "h3", "text": "Navy"}, {"tag": "h3", "text": "Army"}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "The objective of the Sith Empire of Darth Revan was to seize territory and ultimately replace the Republic, unlike the Sith of the Great Sith War, whose primary goal was to sow discord and chaos. While the Sith of old devastated half of the settled galaxy, Revan's Sith Empire at its height had seized control of a third of the known galaxy, and, just prior to the defeat at the Battle of Rakata Prime, higher-ranking Sith officials estimated that it would only be a matter of months before the Sith encroached upon the inner Core Worlds themselves, with the Republic's fall projected shortly thereafter."}, {"tag": "p", "text": "During its height, the Empire governed a large swath of the Outer Rim, including much of what was formerly known as Sith Space. Several islands of territory existed beyond the mainstream Sith Empire, including those based upon the Corellian and Tapani Sectors, giving the Sith Empire a strong presence in the Core Worlds."}, {"tag": "h3", "text": "Member worlds"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The canonical outcome of Star Wars: Knights of the Old Republic is that Revan was redeemed to the light side of the Force and aided the Republic in turning the tide against the Sith Empire. However, the game also contains a non-canon dark side ending where he took back the mantle of emperor from his treacherous former apprentice Darth Malak."}, {"tag": "p", "text": "If the player of Knights of the Old Republic II: The Sith Lords selects this ending (during a conversation with Atton Rand shortly after leaving Peragus), recordings found on Korriban, narrated by Darth Bastila, indicate that Darth Revan returned to the Unknown Regions a couple of years after the Battle of Rakata Prime (presumably to confront the Sith Emperor, Darth Vitiate, as in the canonical light-side ending). The power vacuum this created led to Revan's empire collapsing in infighting between lesser Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}