{"url": "Darth_Revan%27s_Sith_Holocron", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Sith holocrons"], "nodes": [{"tag": "h1", "text": "Darth Revan's Sith Holocron"}, {"tag": "p", "text": "Constructed by the Dark Lord of the Sith Darth Revan during the Jedi Civil War, Darth Revan's Sith Holocron, also referred to as the Holocron of Darth Revan, contained the Sith Lord's teachings on the dark side of the Force, and his knowledge of ancient Sith rituals. It included instructions on how to use the Force power known as the thought bomb, and the lessons from the Holocron focused on the user coveting the dark side and the importance of a Sith Master training one apprentice at a time. Following Darth Revan's redemption and the end of the Jedi Civil War, the Sith holocron remained hidden within the Temple of the Ancients on the planet Rakata Prime."}, {"tag": "p", "text": "Three millennia later, the Sith Lord Darth Bane rediscovered Darth Revan's Holocron inside the Rakatan temple and extensively studied the teachings contained inside. Bane copied the Holocron's contents and destroyed the artifact when its power source ceased to work. Bane went on to purge the ruling Sith regime, creating his own Sith Order using the teachings from Darth Revan's Holocron. Bane later transcribed Darth Revan's knowledge into the Telos Holocron, which was eventually studied by the Sith Lord Darth Sidious and later the New Jedi Order."}, {"tag": "h2", "text": "Properties"}, {"tag": "p", "text": "Darth Revan's Sith Holocron, also known as the Holocron of Darth Revan, was created by the Dark Lord of the Sith himself in the shape of a four-sided pyramid. The Holocron resembled the Temple of the Ancients, an ancient Rakatan structure on the planet Rakata Prime. The Sith Lord's Holocron was slightly larger than a Human's hand and, unlike most Sith holocrons, was adorned with only a few Sith symbols. The Holocron's gatekeeper was an avatar of Darth Revan, and the artifact was powered by a crystal that channeled energy from the Force. However, the crystal was unstable, and the more the Holocron was used, the less stable the crystal became."}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "Darth Revan's Holocron contained the Sith Lord's teachings and beliefs on both Sith philosophy and the dark side of the Force. The Holocron also explained the purpose and nature of ancient Sith rituals, some of which were considered dangerous for even a Sith Master to attempt. One of the rituals taught by Darth Revan's Holocron was the thought bomb; the ancient Sith used the Force to create a power sphere, and when the thought bomb was detonated, the bodies of Force-sensitive individuals were destroyed, with their spirits trapped inside a vacuum created at the detonation's focal point. In addition, the Holocron detailed the teachings of the individual Zelashiel the Blasphemer, which related to the use of the power drain life. The Holocron also instructed a student how to counter and nullify poisons with the Force."}, {"tag": "p", "text": "Darth Revan's instructions in the Holocron taught that an individual who used the dark side was also obligated to serve it, and that understanding this principle meant that the person comprehended the inherent philosophy of the Sith. The Holocron stated that the dark side offered a person power for its own sake and encouraged the learner to covet power and seek the dark side's strength with no reservations. It further taught that the Force would transform the user and recommended that the user embrace the change that came with accepting the dark side's power, arguing that the Jedi were limited in their accomplishments due to the fact that they focused on controlling the Force's transformation of the individual. Darth Revan's teachings maintained that true power came only to people who fully accepted the Force's transformation of them, claiming that traits such as loyalty, mercy, and compassion prevented an individual from claiming what was theirs."}, {"tag": "p", "text": "The Holocron taught that an individual who accepted the dark side's power also had to accept the challenge in retaining their hold on that power. It stated that the dark side's nature of rivalry and strife was not only the Sith's strength, but that these traits were also the Order's weakness. Darth Revan's avatar opined that a Sith Master who trained more than one apprentice in the dark side was a fool, stating that multiple students would combine their efforts and overthrow the Master. As such, the teachings advised a Master to instruct only one apprentice at a time, lest the Master become overwhelmed by the weaker students who allied to defeat the Master. Darth Revan taught that the Sith should only have one Dark Lord of the Sith, who embodied the dark side's strength and power, and that when the Dark Lord grew weak a challenger needed to seize the mantle from the reigning Dark Lord. The Holocron theorized that the weak were meant to serve under the rule of stronger individuals. After the Holocron's user went through all of its teachings, Darth Revan informed the learner that the lessons were finished and instructed the individual to take the instructions he had imparted to the student and use them well."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3959 BBY, the former Jedi Knight Revan declared himself the new Dark Lord of the Sith, with his friend and fellow former Jedi Knight Malak becoming Revan's Sith apprentice. The two Sith Lords, who both had taken the \"Darth\" title, returned from the Unknown Regions at the head of a new Sith Empire and declared war on the Jedi Council and the Galactic Republic, initiating the Jedi Civil War. During Darth Revan's reign as the Dark Lord, he constructed a holocron and recorded his views on Sith philosophy and the dark side. Darth Revan hid the Holocron behind a stone in a wall located behind a Rakatan computer in the Temple of the Ancients on Rakata Prime, a world he and Malak discovered during their search for the ancient Rakatan space station called the Star Forge. Two years into the war, Revan was captured by the Jedi Order, and after being retrained in the Jedi ways, redeemed himself by vanquishing Malak and ending the war. After the war's final battle, Jedi and Republic forces went through the temple and removed all of the Sith artifacts except for Darth Revan's Holocron, which remained hidden in the Temple's lower levels."}, {"tag": "p", "text": "Almost three millennia later, near the end of the New Sith Wars, the Sith Lord Darth Bane traveled to Rakata Prime, which had since been renamed Lehon, in search of teachings with which he could destroy the existing Sith regime, the Brotherhood of Darkness. Bane explored the lower levels of the Temple of the Ancients for any dark side artifacts, eventually coming to the room where the Holocron was hidden. While in the room, he sensed the power of the Holocron, which was still hidden behind the stone in the wall behind the computer. After using the Force to remove the stone, Bane retrieved the Holocron and activated it, revealing an avatar of Darth Revan. As Darth Revan's image instructed Bane, the Sith Lord copied the artifact's lessons on sheaves of flimsi so that he could study the teachings at a later time. Eventually the Holocron's power crystal began to fail due to Bane's continued use of the device. After Darth Revan's image imparted the Holocron's final lessons to Bane, the device ceased to work. Bane used the Force to destroy the device, discarding the object as Darth Revan had taught him. Bane then purged the Brotherhood of Darkness and created his own Sith Order using the teachings from Darth Revan's Holocron."}, {"tag": "p", "text": "After establishing the Rule of Two, Darth Bane transferred Darth Revan's teachings that he copied on Lehon into the Telos Holocron. Darth Revan's lessons on the dark side of the Force remained in the Telos Holocron and were eventually studied by the Dark Lord of the Sith Darth Sidious. Both the Telos Holocron and Darth Revan's teachings were later recovered and examined by the New Jedi Order in 40 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Revan's Sith Holocron was introduced in the novel Darth Bane: Path of Destruction, written by Drew Karpyshyn in 2006, and was used as a major plot device for the titular character to destroy the Brotherhood of Darkness and establish the Sith Order's Rule of Two. The device was first identified as Darth Revan's Sith Holocron in Jedi vs. Sith: The Essential Guide to the Force, released in 2007. According to the guide, Darth Bane discovered and studied the Holocron on the Sith tombworld Korriban, which contradicts the information given in Path of Destruction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}