{"url": "Darth_Savik", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Dark Councilors", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Darth Savik"}, {"tag": "p", "text": "Darth Savik was a female Human who served under Darth Hadra and Darth Acharon during the Battle of Corellia, and later as a Dark Councillor of the Sphere of Scientific Advancement in the resurgent Sith Empire during the Third Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Galactic War"}, {"tag": "h4", "text": "Battle of Corellia"}, {"tag": "p", "text": "During 3640 BBY, Lord Savik was among the Sith forces who, under the command of Dark Councilors Darth Hadra and Darth Acharon, was holding off the Republic push on the Legislature Building of Corellia. During the attack she was supposedly killed by a Republic spacer, but was rescued and nursed back to health."}, {"tag": "h3", "text": "Third Galactic War"}, {"tag": "p", "text": "Years later, when the war between the Sith Empire and the Galactic Republic resumed following the defeat of the Eternal Empire, Savik reappeared as a Dark Councilor, taking Darth Malora's seat as head of Scientific Advancement, a newly formed sphere replacing the Spheres of Technology and Biotic Science.. In preparation for the Empire's assault on the Meridian Complex on Corellia, she began operations on Onderon in an attempt to undermine the Republic's ability to refuel their fleets above the planet by seizing Iziz's anti-orbital defense cannons to fire on the unsuspecting enemy ships. To that end, she manipulated King Regalun Petryph into believing that Senator Nebet and his nobles were plotting to seize his throne to stir a civil war, intending to also exploit the king's greed to claim his planet's resources for the Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Since her defeat on Corellia, Savik refrained from open battle, preferring to delegate field work to her droids or manipulating others into doing her bidding."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Gameplay Alternatives"}, {"tag": "h4", "text": "Supporting the Empire"}, {"tag": "p", "text": "During the Imperial storyline for the Onslaught expansion, the player character will work alongside Savik to manipulate and control King Petryph. At the start, she had the player thwart an assassination attempt on the king with Gand assassins she hired; Savik will later send an email regarding whether player spared or executed. Afterwards, she sends the player to eliminate Petryph's cousins, Anosek and Anoser, and frame Nebet for their deaths, though the player can also take them prisoner. Finally, for the assault on Iziz, she has the player seek the support of the Untamed leader, Akoru, giving the player the option of blackmailing him with the knowledge that his elder brother, Brutann, was a Sith and died fighting the Republic on Hoth. During the battle on Iziz, Savik guides the player in reaching the orbital cannon controls to destroy the Republic fleet. At the end of the Onderon storyline, the player can either praise Savik's machinations or humiliate her before Darth Malgus."}, {"tag": "p", "text": "If the player is a saboteur for the Republic and lets the Republic Fleet escape, Darth Malgus will force choke Savik for her failure. In this case, the player can let her die or convince Malgus to spare her."}, {"tag": "h4", "text": "Supporting the Republic"}, {"tag": "p", "text": "During the Republic storyline for the Onslaught expansion, Savik convinces the Untamed to side with Petryph and sends her droids to seize the Iziz cannon controls. With one of her droids holographically projecting her face, she regards the player and attacks. After defeating Savik's remote droid, if the player is a Saboteur secretly working for the Empire, they have the choice of either disabling the cannons or allowing them to destroy the Republic fleet."}, {"tag": "p", "text": "Later, when the player attacks the Royal Hunting Lodge, Savik is communicating with Darth Malgus through one of her droids. Despite Malgus' displeasure at Savik for failing to destroy the Republic fleet, the Dark Councilor desperately argues for the Empire to secure the planet's resources to no avail. She is then ordered to evacuate her remaining forces and was warned to answer his call in person next time. As the player storms the room, Savik sends Petryph away as she arms a neutron emitter in an attempt to kill the player, but the player escapes thanks to C2-D4 remote piloting Jakarro's starship."}, {"tag": "p", "text": "With information from the Untamed's new leader, Bregan, the player later confronts her at the Royal Proving Grounds, where she had just sent Petryph to safety, equipping his shuttle with a sensor jammer to keep it from being tracked. If the player character is Republic, Savik will have specific dialogue concerning her defeat in the base game. Upon her defeat, Savik will express great frustration and announce that the Empire can no longer help her in her quest to become stronger, and she will surrender herself to the player. As Tau Idair and Arn Peralun arrive, Savik freely provides Petryph's sensor jammer's algorithm as well as that the Empire's next intended target was Mek-Sha. Afterwards, the player has the choice to either send her to the Alliance or hand her over to the Republic. Regardless, Savik freely provides the Republic with intelligence on the Empire's offensive capabilities, but sadly lacked information on their attack strategy. In either case, Savik expressed a desire to work more closely with the Commander."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}