{"url": "Darth_Sidious%27_lightsabers", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Darth Sidious' lightsabers"}, {"tag": "p", "text": "Darth Sidious' lightsabers were the pair of nearly identical personal electrum-finish lightsabers of Darth Sidious, built during his apprenticeship under Darth Plagueis. Sidious rarely used his weapons—only doing so when absolutely necessary—as they would have immediately identified him as a Sith Lord. Instead, he preferred to exercise his powers of manipulation and used servants to carry out his hidden agenda."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "Darth Sidious had discerning tastes, which was reflected in his lightsabers. They were constructed from nearly indestructible phrik with a flat aurodium blade emitter, and all finished with electrum. Both weapons utilized a corrupted kyber crystal at their cores."}, {"tag": "p", "text": "While both were originally identical, one of them was later retrofitted with an unknown black material."}, {"tag": "p", "text": "One of the weapons was normally hidden inside a neuranium sculpture that was displayed on the desk of his office within the Senate Office Building on Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darth Sidious' weapons were constructed by Sidious during his apprenticeship under Darth Plagueis."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Mandalore"}, {"tag": "p", "text": "In 19 BBY, Darth Sidious carried both of these lightsabers when he secretly traveled to Mandalore to confront Darth Maul and his apprentice Savage Opress. He wielded both weapons in the ensuing duel, separating the pair and effortlessly dispatching and killing Opress. Maul, using two lightsabers of his own, proved a much tougher opponent and held his own for a while longer. Sidious disarmed Maul and subdued him with a combination of telekinesis and Force lightning."}, {"tag": "h4", "text": "Second Battle of Dathomir"}, {"tag": "p", "text": "Sidious later wielded one of his lightsabers during the Second Battle of Dathomir, and used it to fight Mother Talzin in combat. Ultimately, Talzin was defeated with the help of General Grievous and Sidious' apprentice, Count Dooku."}, {"tag": "h3", "text": "The Galactic Empire's rise"}, {"tag": "h4", "text": "Duel in Palpatine's office"}, {"tag": "p", "text": "Near the end of the Clone Wars, Sidious fought against Jedi Masters Mace Windu, Kit Fisto, Saesee Tiin and Agen Kolar using one of the lightsabers. He slew Kolar, Tinn and Fisto easily, but had an extended confrontation with Windu. The Jedi guided the battle towards the bay window of the Sith Lord's office and out onto the wind-blown ledge outside. Windu disarmed the Sith Lord with a surgically precise kick to the face, throwing Sidious off-balance and causing the Sith Lord to drop his lightsaber as he flailed for purchase. The lightsaber fell out the window into the seemingly bottomless streets and alleyways of Coruscant below just before Skywalker showed up. Consequentially, Sidious was forced to use only one lightsaber from there on out."}, {"tag": "h4", "text": "Showdown in the Senate Building"}, {"tag": "p", "text": "After Obi-Wan Kenobi and Yoda realized what had happened, Yoda went to face the Emperor personally at the Senate Building, while Kenobi headed off to kill Darth Vader. Yoda surprised Sidious, who told him that his arrogance blinded him and that his apprentice would be more powerful than both of them. Yoda answered Sidious that his faith in Vader was a mistake along with his faith in the dark side. Yoda then dueled Sidious, who used his remaining lightsaber to face the Jedi Master. The duel brought them to the Galactic Senate Chamber, the heart of the Senate. Sidious hurled Senate pods at Yoda, and the effort to avoid them exhausted the Jedi Master. Sidious then blasted Yoda with Force lightning, but with the last of his strength, the Jedi Master repelled it enough to send both himself and Sidious over the pod's edge. Sidious was able to hold on to a senate pod, while Yoda fell to the Senate floor, leaving only his cloak. With Bail Organa's help, Yoda fled the Senate Building and would go into exile."}, {"tag": "h3", "text": "Later usage"}, {"tag": "p", "text": "Darth Sidious would once again use his lightsaber and fought alongside Vader against a swarm of lyleks on the planet Ryloth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}