{"url": "Darth_Tanis", "categories": ["Category:Canon articles", "Category:Darths", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Darth Tanis"}, {"tag": "p", "text": "Darth Tanis was an ancient Sith Lord who created the superweapon in the Sith Temple on the planet Malachor. Later, the 17th Legion of the Sith Eternal was named after Darth Tanis."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Darth Tanis was an ancient Sith Lord who created the superweapon within the Sith Temple on the Sith planet of Malachor. Ancient Sith accounts from 3966 BBY described kyber weaponry developed by Darth Tanis on the planet Malachor. This was the Malachor superweapon, a deadly machinery that laid at the heart of the Malachor Sith Temple, a battle station and site of contest with the Jedi which ultimately led to the Great Scourge of Malachor, where all combatants perished at the activation of the superweapon including a Sith witch from the Sith Empire."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Seeking the weapon"}, {"tag": "p", "text": "Tanis' weapon could be activated with a Sith holocron located on Malachor, which was sought by the former Sith Maul, the Eighth Brother of the Inquisitorius, and the Dark Lord of the Sith Darth Vader, during the Imperial Era. The Sith holocron contained the Presence, a female entity who seduced Jedi apprentice Ezra Bridger, to a limited degree, to the dark side of the Force, before this was discovered by Jedi Knight Kanan Jarrus, who gave the holocron to Bendu."}, {"tag": "p", "text": "The Sith artifact was later retrieved by Bridger and Jarrus, the former wanting to partake in a holocron fusion with Maul, both in pursuit of Force visions for their own desires. The connection was severed midway in the event, however, which resulted in the destruction of the holocron."}, {"tag": "h4", "text": "The Sith Eternal"}, {"tag": "p", "text": "The 17th Legion of Darth Sidious' Sith Eternal's army was named Tanis. As with other legions, its namesake was an ancient Sith Lord, the significance of which was known only to the Sith Eternal loyalists."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Tanis was first mentioned in the 2019 reference book Star Wars: The Rise of Skywalker: The Visual Dictionary. In the book, Tanis is named as the creator of the ancient Malachor superweapon. The superweapon was introduced in \"Twilight of the Apprentice,\" the season two finale of Star Wars Rebels, which aired in 2016. \"Twilight of the Apprentice\" also introduced the Presence, the spirit of an ancient Sith Lady contained inside a Sith holocron."}, {"tag": "p", "text": "In an interview with IGN, Star Wars Rebels executive producer Dave Filoni provided some insight into what he saw as the backstory of the Presence. In his mind, the voice of the Presence is the voice of the ancient Sith Lord who built the Malachor temple. Filoni said that he liked the idea of an ancient and powerful woman, who had domination that the audience has not yet heard of, who was creating the weapon when it was attacked by the Jedi Order and everyone is turned to stone. Filoni further said that he has a name for the character, but he could not yet reveal it."}, {"tag": "p", "text": "The 2018 Star Wars Roleplaying sourcebook Dawn of Rebellion further stated that a \"Sith witch\" activated Tanis' superweapon during the Great Scourge of Malachor, thus petrifying all combatants. However, any direct correspondence between Darth Tanis, the Presence and the Sith witch has not been confirmed by any official source."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}