{"url": "Darth_Thanaton", "categories": ["Category:Legends articles", "Category:Dark Councilors", "Category:Humans", "Category:Males", "Category:Members of the Sphere of Ancient Knowledge", "Category:Sith Masters", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Darth Thanaton"}, {"tag": "p", "text": "Darth Thanaton was a Human male Inquisitor and Dark Lord of the reconstituted Sith Empire during the Great Galactic War. Thanaton was born in 3695 BBY as Teneb Kel, a slave of the Empire who was discovered by the Sith Lord Calypho and taken as his apprentice on the Sith holy world of Korriban. There, Kel trained in the art of assassination and the secrets of the dark side of the Force until his Master's heresy and ambition resulted in Calypho's arrest and internment by the Empire's Dark Council. Now forced to carry the burden of his Master's disloyalty, Kel was sent by the Council to serve with the Imperial Military on the front lines of the Great Galactic War against the Galactic Republic and its Jedi Order. There he was joined by his Abyssin slave Maggot and achieved many successes on the battlefield—including a vital victory in the battle for Begeren, wherein Kel's efforts ensured that the ancient Sith world would be reclaimed by the Empire."}, {"tag": "p", "text": "However, even after numerous military triumphs, Kel still carried with him the taint of his Master's failures in the eyes of the Dark Council. To ensure his obedience and put the young Sith to proper use, the Council recalled Kel to the Imperial capital of Dromund Kaas in 3678 BBY. There, they forced him to combat and nearly kill the imprisoned Calypho before giving Kel a mission of the utmost importance: to locate and execute Exal Kressh, former apprentice to the Sith Emperor and traitor to the Empire. After receiving direction from the Emperor himself, Kel took Maggot to the Lenico system where he unsuccessfully attempted to kill the rogue Sith; he was beaten by Kressh and left stranded on the dead world of Lenico IV, where he experienced a Force-induced vision that revealed to him Kressh's history. He learned that the Emperor was planning on turning her and countless others into his \"Children\"—puppets of his will and extensions of his presence—thereby ensuring his immortality and omnipotence. Kel escaped Lenico IV with Maggot's help and tracked Kressh to Korriban, where she had sparked a massive battle to distract from her plans to destroy the Emperor's Children. In the tombs beneath the Valley of the Dark Lords, Kel caught and killed his quarry, but was also forced to murder Maggot to ensure the Emperor's secret plans would not be revealed."}, {"tag": "p", "text": "His victory over Kressh and knowledge of the Emperor's Children allowed for Kel to return to the Dark Council and demand that they promote him from an apprentice to a Sith Lord. He seized the mantle of Darth Thanaton for himself and went about building a formidable power base within the Empire's Sphere of Ancient Knowledge. Throughout the remainder of the Great Galactic War, Thanaton gathered to himself a considerable amount of influence within the Imperial hierarchy and garnered a reputation as a strict Sith traditionalist—one who sought to uphold the historical precedents of Imperial politics and dark side philosophy. This disposition repeatedly brought him into conflict with Lord Zash, a young Sith witch who bucked tradition in favor of pursuing her own paths to power. Thanaton and his ally, Darth Skotia, believed Zash to be a corrupting influence, particularly given her supervisory position at the Korriban academy. Together, they worked to block her ascension until 3643 BBY, when Zash manipulated her apprentice into murdering Skotia so that she could access the Dark Temple on Dromund Kaas."}, {"tag": "p", "text": "Thanaton's attempts to punish Zash for the murder backfired and the Dark Council instead promoted her to Darth Zash, replacing Skotia as Thanaton's immediate subordinate. To Darth Thanaton's chagrin, Zash used her new position to pursue knowledge of immortality and spirit transfer by way of her apprentice, sending the slave-turned-Sith into the Dark Temple and the galaxy beyond to gather ancient artifacts of power. Zash's gambit ended when she was killed by her own apprentice, who then took the title of Lord Kallig. Around this time, Thanaton ascended to the Dark Council and used his place on the Empire's governing body to pursue the death of Kallig, who he believed was equally as corrupt as Zash. Despite his rise to the pinnacle of Sith power, Thanaton failed to kill Kallig on several occasions, motivating him to declare that he and the young Sith would engage in a Kaggath on the contested world of Corellia. The ancient Sith honor battle ended in defeat for Thanaton, who was forced to flee the planet and seek aid from his fellow Councilors on Korriban. Thanaton was followed and again defeated by Kallig in view of the Council; the elder Sith's weakness and violation of Kaggath decorum disappointed the Dark Lords and Darth Mortis snapped Thanaton's neck for his failures. Following his death, his command of the Sphere of Ancient Knowledge was passed to Kallig, who took Thanaton's seat on the Council and the name Darth Nox."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The trials of the Sith"}, {"tag": "h4", "text": "Early life and training"}, {"tag": "p", "text": "The man who would be known as Darth Thanaton was originally Teneb Kel, a Human male born in 3695 BBY within the territory of the Sith Empire. Early in his life, Kel was an Imperial slave but was eventually discovered to be sensitive to the Force by the Sith Lord Calypho. Calypho pulled the young man out of slavery and took him as an apprentice, instructing him in the methods of the Sith Inquisitors and training him in the discipline of assassination. Kel's Master specialized in the art of divination and foresight and taught his pupil that one's power to gain insight into the future was most potent when the recipient was close to death. In addition to training in assassination and visions, Kel enthusiastically studied Sith history and philosophy in preparation for his future roles within the Empire's Sphere of Ancient Knowledge."}, {"tag": "p", "text": "In 3681 BBY the Empire, which had been hidden in the Stygian Caldera since the end of the Great Hyperspace War, revealed itself to the galaxy and launched the Great Galactic War against the Galactic Republic and the Jedi Order. In the first year of the conflict, the Empire reclaimed the ancestral Sith holy world of Korriban and reestablished the Sith Academy on the surface. It was there that Kel trained under Calypho, undergoing many trials in the ancient tombs and caves hidden beneath the Valley of the Dark Lords. During his trials, Kel spent days trapped in these crypts, fighting for his life with a training saber and the dark side of the Force. He ultimately succeeded in escaping the tombs and returned to the academy only to find his trails had been for naught; Lord Calypho had been scheming against the Empire's ruling Dark Council and overstepped his bounds, prompting Councilor Darth Marr and other Sith Lords to condemn and arrest him. Kel walked in on Calypho being taken into custody and was also arrested as per Sith tradition—the students of corrupt Masters usually shared their teacher's fate. However, in consideration of the fact that Kel had not completed his training under Calypho at the time of the arrest, the young Sith was spared internment and was instead sentenced to an extended period of service alongside the Imperial Military in its campaign to crush the Republic and reclaim ancient Sith worlds."}, {"tag": "h4", "text": "The fields of battle"}, {"tag": "p", "text": "Around the beginning of the war, Kel traveled to the forested world of Cholganna in the Outer Rim Territories and participated in a skirmish there. Imperial forces prevailed in the engagement and summarily executed their opponents, but Kel chose to give mercy to an Abyssin warrior named Qawohl. The elderly alien was taken by Kel as a slave and forced to follow and serve the young Sith in his missions and adventures across the galaxy. Kel, unable to speak or understand Qawohl's native language, forced the Abyssin to communicate exclusively in Basic Standard and dubbed him \"Maggot,\" thereby depriving him of both his culture and his true name. Nevertheless, Kel formed a close but formal master-slave relationship with Maggot, who pledged to protect his owner and obey his command."}, {"tag": "p", "text": "In 3678 BBY, Kel and Maggot joined the Imperial Army for their invasion of the planet Begeren in the Esstran sector. The world—a treasured holding of the previous Sith Empire which had been turned into a mining colony by the Republic—was attacked by ten thousand Imperial soldiers in an assault primarily focused on the Republic governor's cliffside palace. Kel and an Imperial commander devised a plan in which the Sith apprentice would infiltrate the palace and execute the Advozse governor while Army forces below engaged the Republic defenders. Although Kel used his assassination skills to sneak into the palace, his presence was detected by the governor's guards who quickly whisked him away to safety in a sealed blast shelter. The young Sith's plan was set back by this development, and he was forced to scale the side of the building to evade the palace security forces. Atop the structure he intercepted the governor as he fled to his shelter with two guards. While his target barricaded himself in the blast-proof command room, Kel quickly used the Force and his double-bladed lightsaber to kill the two guards and break through the barrier."}, {"tag": "p", "text": "The young Sith derided the Advozse governor for his participation in the Republic's desecration and profiteering on Begeren, proclaiming that the world rightfully belonged to the Sith as he drove his lightsaber into the governor's chest. With his objective complete, Kel signaled Imperial High Command to inform them of his success. Although his actions won the battle for the Empire, losses were heavy and the forces fighting outside the palace were largely decimated by Republic bombing runs. Kel surveyed the scene after the battle, where he found a grievously injured Maggot amongst piles of dead Republic and Imperial soldiers. He retrieved his slave and helped the Abyssin back to the Imperial camp, where he permitted the surviving Imperial forces to celebrate their hard-fought victory. His own elation was cut short however, when an Imperial major approached him with news from the Dark Council: Kel's service on the battlefront was at an end and he was to face the Dark Lords once more for further punishment. Kel and Maggot surrendered themselves to the major's soldiers and were ferried back to the Empire's capital world of Dromund Kaas."}, {"tag": "h3", "text": "Hunting for power"}, {"tag": "p", "text": "Kel arrived on Dromund Kaas during a time of celebration, as the Empire lauded its recent military victories in its capital Kaas City with parades and ceremonial observances. The Sith and his slave observed the revelry from their air taxi as it ferried them to the Sith Sanctum in the Imperial Citadel, where Kel would face the Dark Council. Deep within the Citadel, Kel came upon the Council chambers where he found his former Master, Lord Calypho, badly beaten and fully capitulated on the floor before him. Although Calypho greeted his apprentice in trust, the assembled Dark Councilors—including Darth Marr and Vowrawn—ordered that Kel kill his Master. The apprentice complied without hesitation, immediately blasting the elder Sith with Force lightning. Calypho quickly recovered and drew his own lightsaber, engaging in a short duel with his apprentice. Kel quickly overcame the tortured and tired Calypho, but was prevented from killing his Master by the Council, who insisted that the renegade Lord still had some knowledge to offer. While Calypho was dragged off by Honor Guards, Kel was left with the Council to answer for himself and his Master."}, {"tag": "p", "text": "Although one of the Councilors insinuated that he would be given an apprenticeship under a member of their body, Darth Marr quickly quashed the idea and informed Kel that he was summoned to Dromund Kaas to learn of his next assignment for the Empire. Before him emerged a hologram of a Sith woman named Exal Kressh; she had been the apprentice of the Sith Emperor himself until a couple months prior, at which point she abandoned the Empire and fled towards Republic space. Her execution had been ordered as a defector and it was Kel's duty, as determined by the Dark Council, to hunt her down and end her treason. Although he was confused by Kressh's reasons for dereliction, Kel accepted his orders and followed Darth Marr to face a final test before being accepted for the assignment. He trailed the Dark Lord even deeper into the Citadel until he was brought before the Emperor himself. Deep in his sanctum, the Emperor evaluated Kel and informed him that he could still feel Kressh's psychic presence in the Lenico system. Kel eagerly agreed to find her, and when the Emperor touched his head the power of the dark side overcame the young Sith and rendered him unconscious for a full day. Kel's body was brought to a Fury-class interceptor, where he was found and cared for by Maggot. He awoke the next day and immediately began preparations for this departure to the Lenico system, insisting that he and Maggot make the most of their temporary grant of freedom."}, {"tag": "h4", "text": "The sleeping Sith"}, {"tag": "p", "text": "Teneb Kel and Maggot arrived in the Lenico system and immediately began searching for Kressh with little luck. Together the two traveled to each of the six space stations orbiting Lenico IV, repeatedly coming up empty handed. They eventually made their way to Lenico Colony Blue, a medical facility administered by Baron-Surgeon Ybann the Hutt. In the Hutt's chambers, Kel and his slave were confronted by Ybann's two guard droids, which drew their weapons and fired on the young Sith. Although the onlooking crowd of Ybann's alien clientele were certain he would be killed, Kel outmaneuvered the droids and used the Force to make them fire on one another."}, {"tag": "p", "text": "After defeating Ybann's guards, Kel was able to obtain information from the Hutt that Kressh had come to Lenico Colony Blue some weeks before but had long since disappeared. Determined to find his quarry, Kel continued to search the colony while Maggot recreate with other patrons. The young Sith eventually happened upon a chamber of medical stasis pods, where his approach triggered security measures to wake the one patient within: Exal Kressh. The sleeping Sith quickly arose and armed herself, hiding among the chamber's labyrinth before fiercely assaulting Kel. The assassin was barely able to protect himself against Kressh's Force attacks and verbal abuse and was forced to retreat, but his reprieve was short-lived as he was forced to dodge medical droids spewing toxic gas as well."}, {"tag": "p", "text": "Although he sought strength in recitations of the Code of the Sith, Kressh pursued Kel and continued to sow doubt and confusion into the young Sith's mind. He was ultimately overwhelmed by his opponent's use of Force lightning, but Kressh chose not to strike him down; instead, she hinted at her reasons for betraying the Empire and the Emperor's mysterious plans before allowing Kel to flee the scene. Their battle caused heavy damage to both Kel and Lenico Colony Blue, which soon fell out of orbit and began to lose power. Defeated and broken, Kel hurried to his interceptor to escape the system with Maggot, but the ship had been jarred away from the Colony's docks and was connected to the station only by a tether of debris. Because the hangar bay's containment field failed and vented Colony Blue's atmosphere into space, Kel had to call upon the Force to allow a short but deadly space walk along the tether to reach his ship. The effort nearly killed him, but Kel successfully escaped aboard his interceptor, narrowly avoiding death aboard the plummeting satellite."}, {"tag": "p", "text": "Severely injured, Teneb Kel requested Maggot to find shelter. With the ship damaged, Maggot was forced to land upon the surface of Lenico IV. Although still grievously wounded, Kel left the safety of the ship to try and salvage some of the wrecked pieces of Lenico Colony Blue to repair their ship. After defeating a large terentatek, Kel began to weaken from his wounds and made camp to rest. While meditating Kel had a Force vision of Exal Kressh accompanied by Darth Thanaton, a masked Sith who was to guide him in his Force vision. The two led him through an Ortolan colony as Kressh recounted to Kel her history with the Emperor and hinted at the Emperor's plans. Kel saw that Kressh was one of many Children of the Emperor, silent agents mentally linked to their Master's will. After Kressh's image dissolved, Thanaton's vision confronted Kel and destroyed him."}, {"tag": "p", "text": "Kel awoke from his vision only to be confronted by Jedi Master Jerbhen Hulis. After a brief duel, Hulis revealed to Kel that he was also on Lenico Colony Blue to search for Exal Kressh. Hulis convinced Kel to aid him in rescuing the surviving colonists on Lenico IV's surface. After aiding the colonists, Kel traveled back to his ship. Upon ascending the ship's entry ramp, Kel impaled Hulis' Padawan, who had been talking with Maggot. Kel then commenced travel to Korriban as he realized that Kressh had traveled there to disrupt the Emperor's plans."}, {"tag": "h4", "text": "Blood of Korriban"}, {"tag": "p", "text": "Kel arrived in the Horuset system, to find Korriban under attack by Republic forces. After skillfully making his way through the battle, Maggot piloted Kel to the Sith Academy. While Republic drop teams were battling the Academy guard, Kel entered through a secondary entrance into the Academy. In the Academy's tombs, Kel located Exal Kressh who was planning to destroy the Academy. Kressh revealed to Kel the Emperor's plans to develop a number of initiates which the Emperor could use as an extension of his will."}, {"tag": "p", "text": "Kel and Kressh then again crossed lightsabers. Over the course of the duel, Kressh demonstrated her superior dueling skill and outmaneuvered Kel towards the Academy walls. Maggot then appeared and blasted Kressh, distracting and wounding her. Kressh responded by unleashing a burst of Force lightning upon Maggot. Kressh then refocused her attention upon Kel and attacked him with lightning, which destroyed Kel's lightsaber. Now disarmed, Kel was paralyzed by a Force choke from Kressh. Before Kressh could deliver the fatal blow, Kel used his telekinetic powers to summon a fallen Sith's lightsaber, with which he stabbed the unwary Kressh from behind, completing his mission."}, {"tag": "p", "text": "After the duel, Kel found Maggot alive, but killed him when he learned that his slave had overheard Exal Kressh talking of the Emperor's plans during the duel. The young Sith then returned to Dromund Kaas to meet with the Dark Council: at the meeting, he refused to kneel before the Dark Council, demanding instead that they confer on him the title of Dark Lord of the Sith in exchange for information regarding the Emperor's plan: a plan that doubtlessly involved preparing the members of the Dark Council as the Emperor's vessels. He demanded that hereafter he be known as Darth Thanaton; in fact, Teneb Kel now identified himself as the mysterious Sith he had seen in a vision on Lenico IV. In the end, the Dark Council consented to his demands."}, {"tag": "h3", "text": "Sentinel of history"}, {"tag": "h4", "text": "Fighting for tradition"}, {"tag": "p", "text": "Darth Decimus did not like Thanaton. Since the Treaty of Coruscant, Thanaton rose from a lowly apprentice to an intermediary Sith Lord. However, he only used the Sith teachings for his own purposes, and looked down upon disrespectful lower-ranked Sith with contempt."}, {"tag": "p", "text": "As he was set for his ascension to the Dark Council, Thanaton's underling, Darth Skotia, wound up murdered. He accused his other servant, Lord Zash, of the deed, unaware that it was in fact her new apprentice, an aspiring Sith Inquisitor (and, unknown at the time, heir to the legacy of Sith Lord Aloysius Kallig), who was responsible on Zash's orders. Zash denied any involvement, as she was at a party in the Nexus Room Cantina. When she walked into a reprimand, Zash emerged a Darth, though Thanaton confined her to Dromund Kaas­."}, {"tag": "p", "text": "As Zash's apprentice ventured out into the galaxy to acquire the artifacts of Tulak Hord, Thanaton contacted them via holo, warning that Zash was on a crash course and that Kallig should not go down with her. He gave his advice that Kallig must build their own legacy, revealing he was aware of Kallig acquiring the allegiance of the Cult of the Screaming Blade, but warned that a Sith could not survive in the Empire without a power base."}, {"tag": "p", "text": "Sometime later, Zash ended up dead, killed by her own apprentice, but not before becoming a Lord of the Sith. Displeased that a mere slave rose to prominence so quickly, Thanaton invited Kallig to the tomb of Darth Andru to discuss their position in his power base. Upon meeting, Thanaton started preaching the importance of upholding tradition in the Empire. He then sent the Inquisitor to collect some of Andru's writings, expecting his foe to become the deceased Dark Lord's latest victim like all the others he despised. What he didn't count on was Kallig's ancestor Aloysius Kallig intervening and showing his descendant the Force walk, which could enable them to bind a Force ghost and take their power."}, {"tag": "p", "text": "When Kallig returned to Thanaton to take revenge, the latter expressed disappointment that his foe did not die as intended. Kallig refused his false pity and prepared to fight. Rather than fight the Sith Lord himself, Thanaton ordered his apprentices to attack, but they were all slaughtered. Deciding to take matters into his own hands, Thanaton conjured a Force ritual but Kallig withstood it with a Force Shield, forcing him to use a stronger ritual that seemingly killed his foe. He then departed for Malachor III, ordering a servant to dispose of Kallig's body. But as soon as Thanaton was out of sight, Corrin and Kaal, Zash's, now Kallig's apprentices, saved their master. It was then that Kallig revived, the two ghosts bound to the Sith Lord kept them from dying. As Zash in Khem Val's body explained it, Thanaton would have needed to purge the ghosts in order to kill Kallig."}, {"tag": "p", "text": "Later learning of Kallig's survival, Thanaton begin to systematically obliterate Kallig's power base, including Zash's other apprentices, but not before they gave their master the key to Thanaton's private meditation chamber. Eventually, after gaining control of four ghosts, Kallig did come to face Thanaton back on Dromund Kaas."}, {"tag": "p", "text": "In his meditation chamber, Thanaton criticized Kallig's obvious attempt to kill him and take his position. Instead of engaging his nemesis immediately, he meditated and left the task to his apprentice, Rolan, who was killed by Kallig. Unfortunately, the power of four ghosts proved too much to handle. Kallig was surrounded in a Force storm. Thanaton activated his lightsaber and tried to put a stop to this, but an unconscious burst of Force lightning sent him flying across the wall and hitting a wall. He was forced to flee, grasping what happened during the confrontation and had the journals of Darth Vilus and Darth Iratus hidden in his private library and replaced with duplicates, as those Darths too suffered similar problems. Zash realized the switch upon noticing that two entries in Vilus' journal were the same. Kallig stole those journals and left to find a cure on both Belsavis and Voss. By then, Thanaton had taken his superior Darth Arctis's seat on the Dark Council after he died under unknown circumstances."}, {"tag": "p", "text": "Kallig gained allies within the Imperial military after successfully testing the Silencer weapons project, which obliterated an entire Republic fleet, allowing Kallig to build a power base to rival Thanaton's. Thanaton called a Kaggath on Corellia to finally settle things once and for all."}, {"tag": "p", "text": "Thanaton was present in the duel between Darth Baras and his former apprentice, which exposed the former combatant as the false Voice of the Emperor. He rose to acknowledge the Emperor's Wrath. After this, Thanaton had to solve his problems with Kallig."}, {"tag": "h4", "text": "The Kaggath"}, {"tag": "p", "text": "Once the Kaggath began, Thanaton made every effort to decimate Kallig's power base. When Kallig first landed, Thanaton cut off all transportation via rocket trams in and out of Incorporation Islands. However, Kallig managed to restart the trams with the aid of Darth Charnus, as well as forcing Thanaton's apprentice, Lord Skar, to reveal his Master's plans."}, {"tag": "p", "text": "Kallig managed to stop Thanaton from blowing up a fuel refinery in Labor Valley, required for the former's fleet just arriving at Corellia. It was Thanaton's intention to discredit his rival, as a Sith who cannot protect his or her own resources is easily despised. Even though his plan failed, Thanaton mocked Kallig for letting him get away, triggering explosives to cover his escape."}, {"tag": "p", "text": "In retaliation, Kallig prepared to launch an attack on Thanaton's base of operations in Axial Park, based on a former Republic military base. After disabling the shield generators was the base obliterated via orbital bombardment. But while Kallig was preoccupied, Thanaton launched an attack on Kallig's ally, Moff Valion Pyron, which the Moff barely survived. Thanaton called via holo, mocking Kallig for being unable to defend their own allies. He invited his nemesis to come to Capitol Square, where they could settle their dispute once an for all."}, {"tag": "p", "text": "The Kaggath culminated in a final showdown in the government plaza, where Thanaton planned to finally kill Kallig in front of a mixed audience of Sith and Imperials. He announced to all assembled crowd that Kallig was slave to a corrupt Master, who was now dead and all who served Zash had to die as well. Kallig refuted his claims, encouraging the crowd to rise against Thanaton and his kind who expected them to fall in line if the Empire was to conquer the galaxy. With no more to be said, Thanaton first dispatched Darth Kallous and then his two cyborg guards to kill Kallig but they all fell before his rival. With no allies or pawns to throw at Kallig, Thanaton recited the Sith Code before finally engaging Kallig in fair combat. When it would appear that he would lose, Thanaton fled to Korriban to seek the Dark Council's aid in killing Kallig; it had always been his plan, in case he failed."}, {"tag": "p", "text": "Thanaton had Darth Enraj wait outside the Dark Council chamber to kill or at least delay Kallig, but that failed, as Kallig interrupted Thanaton's appeal. The Dark Council refused to aid Thanaton against a mere lord who seemed impossible for him to kill."}, {"tag": "p", "text": "Seeing his status threatened, Thanaton used his full power to subdue his rival. Using the dark side and with the aid of the powerful spirits from the deceased Sith Lords, Kallig overpowered Thanaton and the Dark Lord was left to die. Close to death, he slowly crawled to his fellow Council Members. Seeing that Thanaton lost the Kaggath, Darth Mortis used the Force to break Thanaton's neck, killing him, then apologized to his corpse."}, {"tag": "p", "text": "Moments after Thanaton's death, Kallig took his place on the Dark Council and head of the Sphere of Ancient Knowledge and was granted the title of Darth."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Hungry apprentice"}, {"tag": "p", "text": "Teneb Kel was a loyal servant of the Sith Empire and prideful of his Sith status, as shown with his open disgust for the miners who he felt had desecrated the Sith world Begeren with their quarry. He was very knowledgeable of Sith history, and the politics of the Empire. He despised those who were rich or greedy, and even more so if they tried to make a profit off the Empire."}, {"tag": "p", "text": "He was very loyal to the Sith; when he was arrested for the crimes of Calypho, even though he felt tempted to resist, Kel surrendered himself without defiance. Yet he did have a softer side, displayed when he congratulated and protected his slave, Maggot, from his fellow Sith, even whispering a pained apology when he felt it necessary to kill the faithful Abyssin. The only relationship he ever had, other than his friendship with Maggot, was with his master, Calypho, who he fought without hesitation when ordered to."}, {"tag": "h3", "text": "Staunch traditionalist"}, {"tag": "p", "text": "When Kel became Darth Thanaton, he took it upon himself to keep lower Sith in their place, Darth Zash in particular. He was a staunch traditionalist and anyone who disregarded tradition was beneath his contempt, deserving only of death. Mostly, he relied on his servants and allies to perform his tasks for him, only desiring to take direct action as a last resort. However, just before his battle with Darth Nox on Corellia, he expressed regret that it had come to conflict after Nox showed the same reverence for the Sith Code that he did."}, {"tag": "p", "text": "Thanaton used \"tradition\" as a way to hold onto his power but was in fact afraid of powerful upstarts. He set out to destroy Darth Zash's powerbase, which included Kallig. It turned out that he was a hypocrite when he was defeated by Kallig on Corellia. He continued to argue about tradition to the Council as he tried to avoid facing a superior opponent."}, {"tag": "p", "text": "The fact that Thanaton despised how quickly Kallig and Zash had risen from a lowly apprentice to a Lord and Dark Lord respectively showed some degree of hypocrisy as he himself had blackmailed the Dark Council into making him a Lord, when he himself expressed extreme distaste towards those who threw Sith traditions away in favor of untraditional means, as he had done."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Before becoming a Darth, Teneb Kel was a Sith assassin who many saw great potential in. He acquired fame for single-handedly raiding the fortress of leaders of Begeren and assassinating them. He was proficient in the use of a lightsaber and constructed a double-bladed variant for use in combat. During his tenure as an assassin, he relied on his wits and cunning to gauge opponents and defeat them; he was chosen to assassinate Exal Kressh and succeeded in this mission using these traits."}, {"tag": "p", "text": "Kel was proficient in the use of telekinesis, using such powers to choke, push, levitate, and disarm opponents. He also used the Saber Throw technique to strike at his opponents from afar and kill them. In a confrontation with Exal Kressh, Kel utilized Force Throw technique to hurl countless shards of crystalline permaglass towards Kressh even though this attack was deflected by the renegade Sith apprentice. He ultimately defeated Kressh by using Force Pull to skewer her through the chest with a lightsaber. Furthermore, Kel displayed the ability of Force Flight, which he used to move through the air quickly."}, {"tag": "p", "text": "On Lenico IV, Kel displayed the ability to not only be able to Force Jump his way across the Baron-Surgeon Ybann's suite to avoid the blaster shots of the Hutt's guard droids, but used the Force to render the droids in question hostile towards one another. Kel was also adept in the use of mind tricks and used these talents to gain access to secure areas without violence when necessary."}, {"tag": "p", "text": "Kel was tremendously proficient in the use of Force lightning, utilizing it to destroy structures, overwhelm powerful opponents, jump to higher platforms, and morph it into different forms such as a sphere of dark side energy for protection with the additional effect that the sphere caused pain to anyone who touched it."}, {"tag": "p", "text": "At some point, Kel constructed a body armor for personal use that incorporated life-support devices and combat stimulant injectors to grant him an advantage in combat. He eventually shifted his focus towards the curriculum of Sith sorcery to hone his talents in the dark side and became a powerful Force-user, worthy of acquiring a position in the Dark Council. After ascending to the Dark Council under alias Darth Thanaton, Kel oversaw the ancient knowledge sphere and concentrated on the teachings of legends such as Ajunta Pall, Marka Ragnos, Tulak Hord and Naga Sadow. In spite of his great strength, he met his match in Kallig. During his last stand against Kallig, he unleashed a Force Lightning Storm on the opponent and morphed it into a vortex of destructive energy using sorcery, but Kallig was able to wield the combined might of multiple Force ghosts."}, {"tag": "p", "text": "Kel also experienced Force visions and it is possible that they drew him deeper into the dark side."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In ancient Greek, the word thanaton (θάνατον) means \"death,\" which may be the origin for characters assumed name once he attained the rank of Dark Lord of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}