{"url": "Darth_Vader%27s_TIE_Advanced", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Imperial starfighters", "Category:Starships of the Order of the Sith Lords", "Category:TIE Advanced x1"], "nodes": [{"tag": "h1", "text": "Darth Vader's TIE Advanced"}, {"tag": "p", "text": "Darth Vader's TIE Advanced was a TIE Advanced x1 starfighter used by the Dark Lord of the Sith Darth Vader during the reign of the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Darth Vader's TIE Advanced x1 starfighter was a prototype of the TIE line Advanced series manufactured by Sienar Fleet Systems. It was used by the Dark Lord of the Sith Darth Vader during the reign of the Galactic Empire in many battles throughout the Galactic Civil War."}, {"tag": "p", "text": "The fighter was equipped with a deflector shield generator, a life support system, and a hyperdrive; unlike TIE/LN fighters and other members of the TIE Line. Its armament was limited to a pair of twin fixed-mount laser cannons, and it was capable of firing cluster missiles. The interior of the TIE was modified to Vader's specifications, and was customized to work with Vader's armor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Siege of Lothal, Darth Vader utilized his starfighter during his attack on Phoenix Squadron in 4 BBY, after tracking a stolen shuttle back to the fleet. In the aftermath of his solo attack, Vader managed to destroy much of the fleet, including six A-wing starfighters and the command ship."}, {"tag": "p", "text": "The ship also saw action during the Battle of Yavin in 0 BBY. During the battle, it was escorted by two handpicked Imperial pilots flying standard TIE/ln space superiority starfighters. After destroying many of the Rebel starfighters, it spun out of control when one of Vader's Black Squadron wingmen collided with it in attempting to avoid cannon fire from the Millennium Falcon. The Death Star was destroyed by Luke Skywalker soon afterward."}, {"tag": "p", "text": "After Vader's defeat at Yavin, and his subsequent failure on Cymoon 1, Vader was demoted by his Sith Master, and placed under the command of Grand General Cassio Tagge. Vader submitted to his punishment, and soon, after a layover on Tatooine, Vader met Tagge aboard his Super Star Destroyer Annihilator. Soon thereafter, Vader boarded the fighter and went to the aid of an Imperial shuttle who was under attack from pirates. He arrived in the fray just as the pilot of the shuttle blew up the shuttle to prevent the pirates from stealing their cargo. Vader fired on the pirate ship, a robotic CR90 corvette, destroying a torpedo. He then ordered his two wingman, Black 2 and 3, to follow his lead in destroying the now fleeing corvette. Vader was able to evade the pirate ship's fire long enough to disable the corvette's engines using the twin laser cannons. Vader then returned to the Annihilator, tracked the pirates back to their base of origin and destroyed it."}, {"tag": "p", "text": "Vader soon left Tagge's company, and went in search of a rogue archaeologist, Doctor Aphra. Vader used the TIE Advanced to travel to several different worlds to track the doctor down, before discovering that Aphra was on Quarantine World III in Kallidahin Space. Vader and the TIE then traveled to the quarantined world and touched-down in one of its hangars. However, Utani Xane, Quarantine World III's Curator, was alerted to Vader's presence by one of her B2-series super battle droids who had noticed the Dark Lord's arrival. Vader quickly dispatched Xane and her battle droids, and requested Aphra join him."}, {"tag": "p", "text": "She agreed, and Vader took the fighter, and docked with the doctor's ship: the Ark Angel. The two discussed Vader's plans, and eventually made way to the planet Geonosis in the Arkanis sector to steal a droid factory to build an army of unquestionably loyal battle droids for the Dark Lord's personal use."}, {"tag": "p", "text": "The Ark Angel, with the TIE Advanced still attached, traveled through hyperspace to Geonosis, where Vader, Aphra, and new recruits BT-1 and 0-0-0—a pair of specialized assassin droids—were dropped down to the desert surface of Geonosis. Not long after, the Ark Angel, on Aphra's orders barraged the location of a homing beacon she had placed, blowing a massive hole in the ceiling of a lair where the factory was located so Vader's J-type 327 Nubian could extract the factory. Later, the team returned to the Ark Angel, with the TIE Advanced still docked, and created two platoons of BX-series droid commandos to storm Doctor Cylo's research base; to eliminate Vader's rivals for the Emperor's favor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}