{"url": "Darth_Vader%27s_lightsaber", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Darth Vader's lightsaber"}, {"tag": "p", "text": "Darth Vader's lightsaber was the personal lightsaber of Darth Vader, a Sith Lord who served as Darth Sidious' last apprentice and supreme military commander of the Galactic Empire. He built the weapon after he lost his previous saber during a skirmish on Cabarria."}, {"tag": "p", "text": "The lightsaber would later be used to destroy Obi-Wan Kenobi and cut off the right hand of his son, Luke Skywalker. During their confrontation on the second Death Star, Luke returned the favor, cutting off the right hand of Darth Vader."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The lightsaber was equipped with a dual-phase function, allowing the blade's length to be manually controlled and altered in combat. The weapon featured a black-ridged handgrip, black power cell chamber, beveled emitter shroud, two dual-phase focusing crystals, high-output diatium power cell; and customary power and length adjustment knobs. Darth Vader was constantly fine-tuning and upgrading his lightsaber for maximum blade power and stability."}, {"tag": "p", "text": "Because of the modifications Vader made to his lightsaber over the years, its exterior also changed, somewhat, in appearance (though its design was mostly based on his first Jedi lightsaber). Vader appeared to have experimented with a rounded emitter shroud similar to his second Jedi weapon. As a Dark Lord of the Sith, Vader would often utilize his lightsaber during confrontations with Jedi, but also against other opponents, even though he sometimes preferred to use the Force to dispatch lesser victims."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "A short time after the formation of the Galactic Empire, the Sith Lord Darth Vader was tasked by his master Darth Sidious to kill a Jedi and retrieve their kyber crystal in order to power a new Sith lightsaber. Vader tracked Jedi Master Kirak Infil'a to the river moon of Al'doleem and confronted him. Vader eventually killed the Jedi Master and retrieved his lightsaber. He headed to Mustafar, where he bled the saber's crystal, turning it red."}, {"tag": "p", "text": "Vader used Infil'a's hilt in conjunction with his new red crystal in multiple conflicts, such as when he briefly fought The Grand Inquisitor and Jocasta Nu in the former Jedi Temple. During a mission to Cabarria, Infil'a's hilt was destroyed by mercenaries hired to assassinate Vader. The destruction of Infil'a's hilt provoked Vader to build a hilt of his own design. During his journey back to Coruscant, Vader constructed a new hilt for his crystal while aboard his personal starship. Vader later presented the weapon to Sidious, who was impressed with his apprentice's new saber."}, {"tag": "h3", "text": "Mon Cala Campaign"}, {"tag": "p", "text": "Around one year after the rise of the Empire, Vader was sent to hunt down and execute a Jedi hiding on the Outer Rim ocean planet of Mon Cala. Upon making it to the planet, Vader and the Inquisitorius encountered great resistance from the native Mon Calamari and Quarren in Dac City. Eventually Imperial forces were able to secure the outpost, however, the natives flooded the city in a massive tidal wave which plunged Vader into the depths of the vast ocean. Sinking deep into the Great Ungeness Trench, Vader activated his saber as a light source in the pitch black."}, {"tag": "p", "text": "Eventually Vader was able to escape the trench and return to his Imperial forces. The Ninth Sister of the Inquisitorius informed Vader that they had discovered the location of the Jedi Padawan Ferren Barr and his disciples. While on route to the Jedi's location, Vader was contacted by Moff Wilhuff Tarkin who wanted Vader to capture the King of Mon Cala. Vader entered the King's Royal Command Bunker where he was met by several native soldiers. Vader used his lightsaber to cut a path to the King, who he was able to capture. Barr, who had escaped the Inquisitorius, confronted Vader in the Command Bunker. A duel broke out between the two, eventually Vader was able to cut down the Padawan, ending the invasion of Mon Cala."}, {"tag": "h3", "text": "Duel on Malachor"}, {"tag": "p", "text": "Underneath the surface of Malachor, outside of the Sith Temple located there, Vader confronted Ezra Bridger as he was leaving the temple. After questioning Bridger on how he managed to open the Sith holocron he was in possession of, he engaged Bridger in combat; though the young Jedi briefly held his own, he was no match for the Sith Lord who sliced his saber through Bridger's lightsaber, destroying the weapon. As Vader prepared to finish him off, Ahsoka Tano, his apprentice from the days of the Galactic Republic, intervened."}, {"tag": "p", "text": "Vader told Tano that the Emperor would show her mercy if she agreed to join the Sith in hunting down the remaining Jedi. She refuses and tells him that his Inquisitors had killed all of the Jedi already. Tano let Vader know that her former master could never be as vile as he is. Vader informs her that Anakin Skywalker was weak, and that he destroyed him, to which Tano vows to avenge Anakin's death. When Vader stated that revenge is not the Jedi way, Tano told him that she is no Jedi."}, {"tag": "p", "text": "The two engaged in battle, with Ahsoka pushing Vader back in an initial strike. During this duel, Ezra removed the Sith holocron from the obelisk in the temple with the help of his master Kanan Jarrus, who had just arrived in their ship, causing the temple to start to collapse in on itself. Ahsoka and Vader continued their duel until Vader managed to push Ahsoka over the edge into a chasm below."}, {"tag": "p", "text": "Vader attempted to pull the holocron back from Ezra with the Force, however Ahsoka managed to climb back up and attack him, knocking his lightsaber away and damaging his helmet. With the right side of his helmet destroyed, Vader called out Ahsoka's name, which shocked her. Underneath the torn hole in his helmet, she saw the eyes of her former master, and vowed not to leave him again. Vader hesitated before reigniting his lightsaber and telling her that she will die. Meanwhile, around them, the temple continued to close in. The two continued their lightsaber duel as the temple began to collapse, seemingly killing them. Vader did manage to escape the Sith temple to Malachor's surface, albeit injured."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Battle of Scarif, Vader boarded the rebel command ship Profundity to retrieve the Death Star plans from the fleeing rebels. After boarding into a pitch-black corridor, Vader ignited the blade as he confronted a group of Rebel soldiers attempting to escape with the plans to the Tantive IV. Vader cut his way through them with terrifying ease but efforts ultimately proved unsuccessful, with the Tantive IV jumping to hyperspace before he could take back the plans."}, {"tag": "h4", "text": "Duel on the Death Star"}, {"tag": "p", "text": "Vader's lightsaber was later used  when Vader's old master Obi-Wan Kenobi infiltrated the Death Star along with a smuggler and, unbeknownst to Vader, his son Luke Skywalker. After seeing Kenobi, Vader ignited his lightsaber and the two dueled while his son and the smuggler escaped along with Leia Organa. During their duel Kenobi looked at Luke, and lower his defense and allowed himself to be cut down by Vader's blade."}, {"tag": "h4", "text": "Duel on Cloud City"}, {"tag": "p", "text": "After failing to capture Luke during the Battle of Hoth, Vader set a trap for his son on the Cloud City of Bespin. He\ncaptured Han Solo and Leia Organa to torture them, hoping to bring Skywalker to him. After Skywalker saw a vision of his friends' suffering, he rushed to Cloud City to help them where he encountered Vader. Luke and Vader both ignited their lightsabers to duel. After a long, grueling duel the two ended up in Cloud City's center reactor shaft, where Vader used his saber to cut off Luke's hand. After Luke lost his hand Vader revealed to Luke that he was his father."}, {"tag": "h4", "text": "Battle of Endor"}, {"tag": "p", "text": "During the Battle of Endor, Vader ignited his lightsaber to defend Emperor Palpatine when his son attempted to strike him down. Later on in the battle Vader ignited it again in a duel against his son. After Skywalker hid in the shadows of the throne room, Vader taunted him stating he'd turn his sister Leia to the dark side. After Vader taunted him, Luke attacked Vader, knocking him down and cutting off his hand. Vader's saber, clutched in the severed hand, then fell down into the reactor shaft of the DS-2 Death Star II Mobile Battle Station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}