{"url": "Darth_Vader%27s_green_Eta-2_Actis-class_light_interceptor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Ship stubs", "Category:Eta-2 Actis-class interceptors", "Category:Galactic Republic starships", "Category:Starships of the Order of the Sith Lords", "Category:Unidentified starfighters"], "nodes": [{"tag": "h1", "text": "Darth Vader's green Eta-2 Actis-class light interceptor"}, {"tag": "p", "text": "Darth Vader used this green-painted Eta-2 Actis-class light interceptor during his early days as a Sith apprentice."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After leading the massacre on the Jedi Temple on Coruscant, the newly anointed Darth Vader flew this starfighter from the Temple to Padmé Amidala's apartment. With R2-D2 accompanying him, Vader then traveled to the volcanic planet Mustafar to eliminate the Separatist leaders. The vehicle rested on Mustafar for over a decade, after Vader's battle with Obi-Wan Kenobi left him too wounded to pilot it off of the planet."}, {"tag": "p", "text": "Over 20 years later, Darth Vader, after escaping from the Eye of Webbish Bog with a Sith wayfinder, rested upon his old vehicle to recover. Shortly after, Ochi of Bestoon found the wounded Vader and expressed his surprise at Vader's survival. Fighting and defeating the Droid Crush Pirates of Bestoon before capturing Ochi, Vader repaired the Eta-2 and used the wayfinder to travel to the Red Honeycomb Zone in order to reach the world of Exegol. Once there, he was attacked by forces of the Imperial Navy deployed to stop him, but Vader used his Eta-2 to take out all attacking TIE fighters and encountered a summa-verminoth subspecies. Entering into the Red Zone by flying his Eta-2 into it, Vader experienced Force visions of the past and possible future before making it through, crashing onto Exegol. There, he and Ochi, who had been inside a pod the Sith Lord attached to the bottom of the fighter, exited on to the planet's surface, where Vader took control of the mind of the summa-verminoth using the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}