{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_17", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 17"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 17 is the seventeenth issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on June 13, 2018 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As the remnants of the Mon Cala resistance crumble into the seas, Vader and his Inquisitors finally confront the Jedi survivor at its core. The seas will weep…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "By invoking Order 66, Ferren Barr vocally activates the inhibitor chips inside the Purge Troopers, who turn on the Sixth Brother, Ninth Sister, and Tenth Brother. Verla can't believe that his plan worked, but Barr reassures her that the Clone troopers are little better than droids who are programmed to obey their masters. Since the Inquisitors were once Jedi and the Clone troopers were built to kill Jedi, they would turn on the Inquisitors."}, {"tag": "p", "text": "The Tenth Brother is gunned down by blaster fire. When Verla reminds him that he was once a Jedi and that the Clones will come after them once they have finished off the Inquisitors, Barr reminds Verla that he sought her out. Under Barr's guidance, Verla leaps over the belligerents and the two flee down a corridor. Before parting company, Barr tells Verla to find a new Jedi master. He believes that Obi-Wan Kenobi, Yoda or Quinlan Vos might still be alive."}, {"tag": "p", "text": "Meanwhile, the Sixth Brother suggests jumping over the Purge Troopers but the Ninth Sister proposes using one big push to shove them aside. Working together, they hurl several Purge Troopers blocking their path. Before they can flee down the corridor, the Sixth Brother betrays  the Ninth Sister by cutting of her leg. He tells her to keep the Clones busy while he escapes."}, {"tag": "h3", "text": "Confronting King Lee-Char"}, {"tag": "p", "text": "Meanwhile, Darth Vader uses his lightsaber to fight his way into the Royal Command Bunker, killing the Mon Calamari guards. Inside the bunker, King Lee-Char tries to stop Vader with his blaster but the Sith Lord deflects his blast, wounding the Mon Calamari in the arm."}, {"tag": "p", "text": "Lord Vader contacts Governor Wilhuff Tarkin, informing him that he has Lee-Char in custody. Tarkin tells Vader to transmit his precise location. When Vader asks if Tarkin will send a shuttle, Tarkin replies not yet and tells Vader to take the King to a window. Vader forces Lee-Char to watch as Tarkin's three Imperial Star Destroyers bombard several of Mon Cala's underwater cities, killing several Mon Calamari, Quarren and Seatroopers."}, {"tag": "p", "text": "Despite the orbital bombardment, Lee-Char refuses to surrender to the Empire, whom he reagrds as beasts. He tells Vader that he knows that the Mon Calamari are central to the Empire's destruction. Vader threatens to kill Lee-Char with a twitch of his finger and tells him that he has been lied to. They are interrupted by Ferren Barr, who says that he told the King the truth. Lord Vader says we shall see and the two engage in a lightsaber duel."}, {"tag": "h3", "text": "Imperial might and victory"}, {"tag": "p", "text": "In Mon Cala's South Pole, Commander Ackbar informs Admiral Raddus that they have lost contact with Zeran Town in the northern hemisphere. Ackbar wonders whether the Empire is trying to wipe them out. While the Empire hasn't targeted the southern hemisphere yet, Raddus says that the Empire will get to them eventually. Realizing that their linked shields won't be able to withstand prolonged bombardment, Raddus orders the crews to delink the cruisers and scatter on his mark. Until then, he orders them to keep fighting."}, {"tag": "p", "text": "Meanwhile, Vader duels with Barr, taunting him that his death will achieve nothing. Barr claims that his death is not certain and believes that he might kill Vader since he killed the Inquisitors. Vader says that Barr can't defeat him but senses that he came because of pride. Barr retorts that he should be proud because he believes that he will be the reason that Palpatine's Empire will crumble to ash."}, {"tag": "p", "text": "Barr admits assassinating the Imperial Ambassador Telvar, saying that he couldn't take the risk that negotiations would succeed and that the inevitable conflict would be delayed. On the run, Barr knew that his time was running out so he decided to light a fire. Lee-Char is outraged that a Jedi would cause all this pain and death and orders his commanders to stand down, using Command Code EBB Vortex Nine."}, {"tag": "p", "text": "Admiral Raddus is horrified but complies with his King's orders. Lee-Char contacts Tarkin and tells him that he is ordering a ceasefire and prepared to talk terms. Tarkin accepts Lee-Char's surrender and dispatches a shuttle to take him into custody. However, he orders the bombardment to continue as punishment for his earlier defiance. Barr laughs amidst the orbital bombardment while parrying with Vader."}, {"tag": "p", "text": "In response to Lee-Char's surrender and the unabated bombardment, Admiral Raddus orders his Mon Calamari fleet to launch. Ackbar protests that these are just trading ships but Raddus says that fleeing is better than sitting her and waiting to die. When Lee-Char confronts Barr for lying to him, Barr responds that he foresaw that Mon Calamari ships would be at the forefront of the \"Great Rebellion\" decades from now and that his people's vessels would become a symbol of freedom and defiance across the galaxy."}, {"tag": "p", "text": "When Lee-Char responds that billions of his people are dying, Barr claims that these billions will inspire trillions as was his plan. Vader tells Barr he is no Jedi. Barr says that he may not be a Jedi but he still beats the Sith. Meanwhile, Admiral Raddus' fleet flees into space. Several ships are shot down by Tarkin's Star Destroyers. Three ships escape but Tarkin believes that these meager ships do not pose a threat. He orders the lieutenant to begin powering down the orbital cannons."}, {"tag": "p", "text": "The Ninth Sister manages to kill most of the Purge Troopers but her fate is unknown onscreen. Meanwhile, the Sixth Brother travels on a speeder with several stormtroopers. Verla hides with two Quarren fighters. As he is led by stormtroopers aboard a waiting Lambda-class shuttle, a defiant Lee-Char tells Lord Vader that this is not over and that Mon Cala will rise again. Vader responds that there is no Mon Cala because it is gone, adding that there is only the Empire."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}