{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_13", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 13"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 13 is the thirteenth issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on March 14, 2018 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As the Empire's grip tightens, the stirrings of Rebellion begin in the Mon Cala system. Order must be maintained…a job which falls to Vader, his inquisitors…and a man named Wilhuff Tarkin!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Master and Apprentice"}, {"tag": "p", "text": "Darth Vader fantasizes about defeating Obi-Wan Kenobi during their duel on Mustafar. In his fantasy, the armored Darth Vader levitates his former Master and hurls him onto the lava field, where he is engulfed by the flames. In the present, Vader dons armor and meets with his master Emperor Palpatine at the Imperial Palace."}, {"tag": "p", "text": "Deciding that it is time for the Galactic Empire to evolve, the Emperor decides to dispense with the illusion that the Empire is an extension of the Galactic Republic. He decides to make the planet Mon Cala as an example of the price of defiance by revealing the might of the Imperial Military. While the Death Star is not yet ready, the Empire has many weapons including Star Destroyers and new starfighters."}, {"tag": "p", "text": "With the Imperial ambassador involved in negotiations with the King of Mon Cala Lee-Char, the Emperor tasks Vader with investigating whether a Jedi is secretly advising the King. The Emperor delegates the military aspects of the operation to Governor Wilhuff Tarkin."}, {"tag": "h3", "text": "Planning for war"}, {"tag": "p", "text": "Aboard the Imperial-class Star Destroyer, Governor Tarkin briefs Major Rantu, the Imperial Security Bureau (ISB) Commander Jordo, and Colonel Bergon about the geography of Mon Cala. The planet is covered entirely in deep water with significant settlements and defensive systems based in the undersea regions. Mon Cala's reefs and islands are the site of several large cities, which are use primarily for offworld trade and diplomacy. Tarkin plans to seize the surface cities in the event of hostilities."}, {"tag": "p", "text": "Major Rantu is confident that his forces are up to scratch since they have been running simulations. ISB Commander Jordo proposes a propaganda campaign to divide the Mon Calamari and Quarren. Tarkin disagrees with a disinformation campaign. When Colonel Bergon proposes using the Star Destroyer to orbitally bombard Mon Cala and asks why they are planning a complex, multi-stage assault, Tarkin responds that they are an Empire that seeks to control rather than destroy."}, {"tag": "p", "text": "Tarkin explains that Mon Cala is a valuable world due to its people, technology and civilization, adding that the Emperor enjoys Mon Calamari Aquatic Ballet. He emphasizes that they won't destroy Mon Cala without cause."}, {"tag": "h3", "text": "Hard bargaining"}, {"tag": "p", "text": "In Dac City, the Imperial Ambassador Telvar asks King Lee-Char in the presence of his Mon Calamari and Quarren courtiers to consider whether Mon Cala wishes to remain a part of the \"great\" Galactic Empire. Lee-Char disagrees with the Imperial proposal that Mon Cala sell its kelpite strand beams to Imperial shipyards at a fraction of their market price, which he sees as economically disadvantageous for his people. Telvar responds that the Empire protects him and his people."}, {"tag": "p", "text": "King Lee-Char disagrees, thinking that the need for a military industrial complex is unnecessary since the galaxy is at peace. Telvar offers to relay his concerns to his superiors and suggesting an annual cap on kelpite shipments to the Empire. Despite Telvar's assurances that they are on the same side, Admiral Raddus distrusts the Empire due to the presence of the Star Destroyer orbiting the planet. Telvar takes leave but hopes to resume negotiations."}, {"tag": "p", "text": "Governor Tarkin receives word that Ambassador Telvar will be returning to the Sovereign but that negotiations were unproductive. While Tarkin hopes that a diplomatic solution is preferable, the Imperials soon receive word that the Imperial Sentinel-class landing craft Infernum has exited hyperspace. Tarkin says they are not expecting additional personnel and that the Infernum represents an entirely different form of diplomacy."}, {"tag": "p", "text": "When King Lee-Char asks about how the talks went, Admiral Raddus says that Ambassador Telvar thinks that he has all the cards and opines they should secede from the Empire. He believes that they will get nothing from the Empire who want to take everything from them. Lee-Char thinks this problem s bigger than the Empire. Admiral Raddus is about to ask about Lee-Char's mysterious advisor when they spot the Infernum descending into Dac City."}, {"tag": "h3", "text": "Jedi hunters"}, {"tag": "p", "text": "The Infernum lands on a docking platform. The Sixth Brother, Ninth Sister, and the Tenth Brother disembark the landing craft with a contingent of Purge Troopers. The Imperial assault squad is confronted by several Mon Cala guards led by Commander Gial Ackbar, the King's Chief of Security. The Ninth Sister hands Ackbar a datapad with an Imperial writ stating that \"interference with any agent of the Inquisitorius shall be construed as an act of war against the First Galactic Empire.\""}, {"tag": "p", "text": "Even though it has the Emperor's seal, Ackbar objects to this interference in his homeworld's affairs. The Ninth Sister tells Ackbar to take the issue up with her boss, Darth Vader. Ackbar demands to know what he is planning to do on Mon Cala. Vader tells him to read the write but Ackbar refuses to let them off the landing platform without hearing more answers."}, {"tag": "p", "text": "As the departing Ambassador watches, Vader responds that he is here to hunt an enemy of the Empire. Ackbar responds that the king is engaged in peaceful trade negotiations and that there are no enemies of the Empire on Mon Cala. At that point, Ambassador Telvar's shuttle explodes to the shock of everyone. Vader tells the Commander that he is mistaken."}, {"tag": "h3", "text": "Invasion"}, {"tag": "p", "text": "After receiving word that Ambassador Telvar's shuttle has been destroyed with no survivors. While it is unclear whether it was an attack or sabotage, Tarkin uses the Ambassador's death as a pretext for a military invasion. He orders Major Rantu to deploy landing craft immediately and Commander Jordo and Colonel Bergon to begin their phases of the operation. In the Star Destroyer's hangar, several TIE fighters, Low Altitude Assault Transport carriers, and walkers lie in wait."}, {"tag": "p", "text": "Later, King Lee-Char informs the mysterious Jedi adviser that the Empire has sent ships and landed an army. The Jedi tells the King to stay calm because they always knew this was a possibility. Lee-Char warns the Jedi about the presence of Inquisitors and a tall, armored, masked figure which the Jedi recognizes as Anakin Skywalker."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Upon release, the opening crawl of Darth Vader 13 read that \"three years\" had passed since the proclamation of the New Order, and Darth Sidious later stated that he had been Galactic Emperor for three years. Due to the Sixth Brother's appearance in the issue, these statements contradicted the young adult novel Ahsoka, in which the Sixth Brother dies shortly after the Galactic Empire's first anniversary. Additionally, one panel of the issue referred to Wilhuff Tarkin as a Grand Moff, although the novel Tarkin established that rank was not yet created. These contradictions, along with other minor changes to the opening crawl, were amended in the issue's digital edition."}, {"tag": "p", "text": "In one panel, Commander Jordo, an Imperial Security Bureau officer in white uniform, is depicted with a standard Imperial military uniform, despite being in the same sequence of events where he was depicted in the standard white ISB uniform. In another panel, Tarkin also appears to refer to Colonel Bergon as Commander Jordo."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}