{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_10", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 10"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 10 is the tenth issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on January 10, 2018 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Vader's showdown with Jocasta Nu comes to a startling conclusion! What secret information has the Jedi librarian risked her life to protect? And can she stop Vader from getting it?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Hunting Master Nu"}, {"tag": "p", "text": "At the former Jedi Temple, Darth Vader orders Jedi Master Jocasta Nu to lay down her lightsaber rifle, sensing that she doesn't want to die. Due to the dark side waves flowing off Vader, Master Nu doesn't' trust him and shoots at him. Knowing that Lord Vader is formerly Anakin Skywalker, she chastises the fallen former Jedi for becoming a tool of Emperor Palpatine. Nu defiantly tells Skywalker that the Sith cannot stamp out the light side since the Force is eternal and cannot be stopped as long as life exists. She says that the Force will always find new vessels and that the Jedi will rise again."}, {"tag": "p", "text": "Before Master Nu can fire another volley, she finds that the lightsaber rifle has overheated her lightsaber. Darth Vader calls on her to surrender, promising that she will not be harmed. However, she hurls the rifle at Vader, who deflects it with the Force. The lightsaber rifle crashes into a bookcase and explodes, blowing a hole in the wall. After stealing a green lightsaber, Master Nu descends down the Temple into the path of gunfire."}, {"tag": "p", "text": "Clone Commander Fox orders the squads in Quadrant Four to hold out until reinforcements arrive. Armed with the lightsaber and her Force powers, Master Nu attacks the Clone troopers and throws them off a platform. Lord Vader gives chase but comes under friendly fire from the Clone troopers, who believe him to be another Jedi. Commander Fox arrives in an LAAT/le patrol gunship and sees Nu and Vader under fire. He orders the Clone troopers to cease firing on Vader since he is one of their own. However, Lord Vader is furious that Commander Fox did not alert the Clone troopers to his presence and uses the Force to break his neck, killing him."}, {"tag": "p", "text": "Following a brief engagement, the Clones corner Master Nu near the edge of a platform. After Master Nu loses her lightsaber, the Clone troopers and Lord Vader attempted to apprehend her alive. In response, she throws herself over the edge in an attempt to kill herself and deny the Sith the information they desire. However, Lord Vader uses the Force to levitate her onto the platform. He then orders the Clone troopers to bring her aboard the patrol gunship."}, {"tag": "h3", "text": "Master Nu's last stand"}, {"tag": "p", "text": "Aboard the patrol gunship, a Clone trooper hands Lord Vader Master Nu's memory crystal. After fitting it into his belt, Lord Vader realizes that it contains a database of several Force-sensitive individuals across the galaxy including Darien Whit, Scape Loewig, Devin Hvitur, Alaytia Taverre, Kris Elioup, Annali Bissa, Nik Lowe and Jacque Porte, whom he deduces the Jedi had intended to recruit into the Jedi Order."}, {"tag": "p", "text": "When Darth Vader interrogates Master Nu about the list, she taunts him that he doesn't know why his Sith master has ordered him to bring her alive. Nu tells Lord Vader that the Emperor intends to use her database to recruit more Sith. Trying to drive a wedge between Vader and the Emperor, she asks him what he wants. When a Clone trooper offers to stun the Jedi prisoner, Master Nu reveals that Darth Vader is a Jedi Knight named Anakin Skywalker. Before the Clones can respond, Lord Vader uses the Force to hurl them out of the gunship."}, {"tag": "p", "text": "Darth Vader blames Master Nu for the demise of the Clone troopers but she counters that they chose their own path. With the pilotless patrol ship about to crash, Master Nu accepts her fate. The patrol ship crashes, killing Master Nu but Lord Vader survives. Lord Vader informs the Emperor that Master Nu perished during an escape attempt. When the Sith Lord asks if he learned anything about Master Nu prior to her death, Lord Vader claims he learned nothing but secretly destroys the memory crystal in order to prevent the Emperor from recruiting Sith rivals."}, {"tag": "h3", "text": "Epilogue"}, {"tag": "p", "text": "On Master Nu's secret hideout world, her elderly friend Gar learns about her death. Following her instructions, he detonates an explosion that buries her secret Jedi academy. The comic ends with Master Nu's passage that the Force will always find new vessels and that the Jedi will return when the time is right. Years later, Luke Skywalker discovers Master Nu's secret academy and the holocrons within."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In one instance, Commander CC-1010 is erroneously referred to as a lieutenant."}, {"tag": "p", "text": "When translated, the Aurebesh list displayed in Darth Vader's helmet reads: \"Darien Whit - Alderaan, Scape Loewig - Cathar, Devin Hvitur - Bespin, Alaytia Taverre - Kessel, Kris Elioup - Eadu, Annali Bissa - Corellia, Nik Lowe - Mustafar, Jacque Porte - D'Qar.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}