{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_11", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 11"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 11 is the eleventh issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on February 14, 2018 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "An expensive bounty has been put on Vader's head! Who would dare try to challenge the Dark Lord's place in the Empire?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Sighting on Cabarria"}, {"tag": "p", "text": "On the Colonies location of Cabarria, Darth Vader and the Ninth Sister travel to an bar where there was purportedly reports of an incident involving an individual using the Force and wielding a lightsaber. The Ninth Sister asks Lord Vader why are they visiting the cantina. Lord Vader says that it is a foolish question, prompting her to clarify that she meant him. The Ninth Sister thinks this may be a false report and suggests that it is her job to verify it and that Vader's presence is not needed."}, {"tag": "p", "text": "Vader counters that she should be pleased that he is here since he believes that the Inquisitorius are still not yet reader to hunt Jedi alone. The Ninth Sister quips that he is here to remind her about the loss of her eye or that he is here in case they get lucky. The Ninth Sister suggests that different Jedi may have different strengths such as lightsaber combat and manipulation. She tells Lord Vader that she has always been good at reading emotions, a strength that has grown since she has touched the Dark side of the Force. She senses that Lord Vader wants to fight another Jedi."}, {"tag": "h3", "text": "Walking into a trap"}, {"tag": "p", "text": "Lord Vader orders her to remain outside on their speeder bike and not to enter unless he orders it. After Vader leaves, the Ninth Sister quips that the Sith Lord is dying to fight and dying to die. Inside the cantina, Lord Vader announces his presence to the patrons an queries about the Jedi sighting. Vader is recognized by the bounty hunter Bhada Cha who tells his daughter Chanath Cha to do her part and they will do theirs."}, {"tag": "p", "text": "She uses a tractor rifle to snatch Vader's lightsaber but the Sith apprentice snatches it in mid-air. Under the guidance of her mother Ramat Cha, Chanath uses an ion grenade to destroy the lightsaber, breaking it into several pieces. The kyber crystal however falls out. The ion grenade also fries the other weapons and blasters in the cantina."}, {"tag": "p", "text": "From a balcony, Bhada tells everyone to stay calm because they are just here for Vader, whom he describes as a \"Jedi.\" Ramat adds that all of the other weapons including blasters have been fried, leaving the Cha family as the only ones with working blasters. Bhada adds that their purpose was to avoid a firefight and innocent casualties in order to take out the \"Jedi.\" A Twi'lek and a Mon Calamari disagree, prompting the Chas to activate their personal energy shields."}, {"tag": "p", "text": "As they attack Lord Vader, the Sith calls the Ninth Sister for help, saying that she is attacked by bounty hunters who have triggered an ion pulse and destroyed his lightsaber. He requests that she bring him hers but the Ninth Sister pretends that her comms unit fried, hoping for Vader to be killed in combat in revenge for her maltreatment."}, {"tag": "p", "text": "Meanwhile, Vader uses a table and the bodies of at least one patron to hold out against the blaster attacks of the Cha family. Concerned about the collateral damage and that their shield batteries will run out, Ramat convinces her husband and daughter to pull out. As they flee, Lord Vader retrieves his kyber crystal."}, {"tag": "h3", "text": "Fleeing Vader's wrath"}, {"tag": "p", "text": "The Cha family flee into the parking lot and steal a green speeder bike after holding up the Ninth Sister at gunpoint. When Chanath asks her parents whom they were facing, the Ninth Sister tells them that they will soon find out. A furious Lord Vader emerges from the cantina and accuses the Ninth Sister of fabricating a Jedi sighting and hiring the bounty hunters to kill her."}, {"tag": "p", "text": "The Inquisitor denies hiring assassins to kill Lord Vader, remarking that she is neither a genius or idiot. When Vader suggests it was the other Inquisitors, she reminds him that the Inquisitors used to be Jedi and that they now work for the people who killed Jedi. If he is looking for traitors, the Ninth Sister hints that he doesn't have to look far. When the Sith Lord threatens her with her own lightsaber, the Ninth Sister tells Vader that she did not stage the assassination attempt. Lord Vader orders her to remain behind while he pursues the bounty hunters on pain of death."}, {"tag": "p", "text": "While Ramat drives the green speeder bike, she and Bhada debate on the identity of their \"Jedi\" quarry. The two doubt that their target was a Jedi since he was using the innocents as fodder. Lord Vader catches up with the hunters on a black speeder bike. He deflects Bhada and Chanath's blaster bolts with the Ninth Sister's lightsaber. Bhada considers using ion grenades but Chanath reveals that she left them behind. Vader manages to block their path by damaging a nearby hovertruck, causing it to crash into their speeder bike."}, {"tag": "h3", "text": "Uncovering a conspiracy"}, {"tag": "p", "text": "The Cha family survive the accident due to their personal energy shields. However, they are cornered by a vengeful Lord Vader who uses the Force to levitate Chanath and holds the Ninth Sister's lightsaber to her neck. When he demands to know who hired them, Bhada says that it was an anonymous job that they picked up through the Hunter Net. Ramat adds that they were motivated by much needed money. Vader says that is unfortunate before threatening to kill Chanath."}, {"tag": "p", "text": "Seeking to save her daughter's life, Ramat offers her services as a slicer in tracing the job back. Vader demands that she does it now but Chanath's parents request that he set their daughter free first. They threaten not to cooperate if Vader kills their daughter, with Bhada saying that she is their reason for living and that they are willing to die with their daughter. Moved by their familial bonds, Vader backs down but demands proof that they can fulfil their side of the bargain."}, {"tag": "p", "text": "Ramat says she can access the Hunter Net and track down the location of the system where the kill order originated. She discovers that the contract originated in Coruscant, the galactic capital. Honoring his side of the bargain, Vader releases Chanath from his grip. Bhada tells Chanath that she must leave in order to survive but tells her to swear to Lord Vader that she will take no revenge. He adds that this was just business, part of their family's line of trade. He pleads with Chanath not to give Vader any reason to hunt her down. Ramat pleads with Chanath to make the pledge."}, {"tag": "p", "text": "Chanath swears not to take revenger and says that nothing happened here today. Vader accepts the deal and demands that Ramat continue with her search. While slicing through the encryption, Ramat discovers that the contract originated in the Republic Executive Building in Coruscant's Senate District. She deduces that the kill contract originated at the top of the Galactic Empire's hierarchy."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The print edition of Darth Vader 11 erroneously credits the cover art to Giuseppe Camuncoli and Francesco Mattina, rather than Camuncoli and Elia Bonetti."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}