{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 5"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 5 is the fifth issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on September 6, 2017 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "He began his journey as a Jedi with wonder and hope. Now it is time to put away childish things. Vader's first and most vital test as a Sith concludes."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Return to Mustafar"}, {"tag": "p", "text": "While traveling through hyperspace, Darth Sidious informs Darth Vader via holographic projector that his quest is nearly over. He explains that Darth Vader's droid has been instructed to bring Vader, once he has obtained a Jedi lightsaber to the volcanic world of Mustafar, the site of Vader's recent defeat. The Emperor tasks Vader with finding a dark side locus beneath Mustafar's surface. He intends for Vader to reclaim himself at the site of his greatest defeat."}, {"tag": "p", "text": "Despite defeating Jedi Master Kirak Infil'a, the Emperor explains that Darth Vader doesn't own his lightsaber until he has bended its kyber crystal to the dark side. Under the Emperor's orders, Darth Sidious travels to the dark side locus, which lies inside a cave. He is supposed to corrupt the kyber crystal with his pain and anger in order to make it \"bleed.\" Inside the cave, Vader finds a circular stone table where he proceeds to dismantle the lightsaber. After retrieving the green kyber crystal, he is struck by a powerful wave of energy."}, {"tag": "h3", "text": "Letting the past die"}, {"tag": "p", "text": "Experiencing second thoughts about his journey to the dark side, Vader reassembles the lightsaber. He experiences a vision where her returns to the Emperor on Coruscant with the green lightsaber. Realizing that Vader has not embraced the dark side, he attacks the Sith apprentice. Vader defeats him in a duel and then travels to find his former Master Obi-Wan Kenobi. Seeking to atone for its wrongs, Vader bows before Kenobi who raises his lightsaber to strike him down. However, Kenobi experiences second thoughts and deactivates his lightsaber, calling Vader by his former name Anakin."}, {"tag": "p", "text": "Awakening from the vision, Vader believes there is no turning back from the Sith path and uses the dark side to bend the kyber crystal to his will. As he pours his anger and hatred into the crystal, he experiences visions of the past including Kenobi, his late mother Shmi Skywalker Lars, Padmé Amidala and the Emperor. The dark side also triggers a lava explosion nearby."}, {"tag": "p", "text": "Returning to Coruscant, Darth Vader forces his way into the Emperor's Throne Room, hurling two Imperial Royal Guards against the transparisteel windows. The Emperor is conferring with Wilhuff Tarkin and Grand Vizier Mas Amedda to discuss a new weapon. The Emperor orders a startled Tarkin and Amedda to leave him alone, reassuring them that he is safe. Vader presents his new Sith lightsaber to his Sith master."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}