{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 4"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 4 is the fourth issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on August 2, 2017 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Vader's first mission isn't going well. The dark side is the way of power. But no one said it would be easy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Master Infil'a's home"}, {"tag": "p", "text": "Darth Vader lands on a rock within a forest clearing at the base of Mount Pasvaal. The training droid Arex taunts him that the Dark side of the Force cannot stand against the Light side of the Force. Ignoring the droid's taunts, Vader uses his Force powers to rip the droid apart and integrate his parts into his damaged armor."}, {"tag": "p", "text": "Meanwhile at Am'balaar City, which is built around a dam, Jedi Master Kirak Infil'a reflects on returning to the world. He visits the mechanic Mareena who is repairing an engine with the help of her child Colli. Master Infil'a tells her that he needs his Delta-7B Aethersprite-class light interceptor. Mareena replies that the ship needs some tuning but that it will be ready."}, {"tag": "p", "text": "Master Infil'a confides with Mareena and Colli that he felt a great surge of pain and fear as his fellow Jedi were exterminated across the galaxy. Mareena tells Master Infil'a that she heard reports about the Jedi being traitors. Colli adds that she never believed it. Master Infil'a believes that he destroyed a Sith executioner and vows to destroy his Sith master. When Mareena's husband Jogg asks what is going on, Mareena explains that Master Infil'a is going to depart on a mission. Master Infil'a adds that he is impatient to leave. Mareena asks Infil'a if he is sure that the Sith is not coming here. Infil'a believes Vader, whom he describes as a \"poor, deluded creature\" to be dead."}, {"tag": "h3", "text": "Vader's wrath"}, {"tag": "p", "text": "Having repaired his armor using Arex's parts, Vader sets out to confront Master Infil'a and obtain his lightsaber. Back in the garage, Colli is amazed by Master Infil'a's levitational powers, which he uses to lift engines. Infil'a explains that the Force makes all things light. He promises to teach her about the Force once he has returned from his mission. Infil'a intends to restart the Jedi Order on Mount Pasvaal."}, {"tag": "p", "text": "At that moment, Master Infil'a senses Darth Vader's presence through the Force. Exiting the garage, he finds the Sith apprentice on top of a dam. Lord Vader challenges Master Infil'a to finish the duel. He tells Mareena and her family to stay inside while he ascends up the dam to confront the Sith in a lightsaber duel. Infil'a manages to gain the upper hand by damaging Vader's right arm. Three armed security officers attempt to intervene but Lord Vader uses the Force to hurl them down the dam."}, {"tag": "p", "text": "Horrified at Vader's disregard for sentient lives, Master Infil'a uses the Force to levitate the officers to safety. Confronting Vader, he tells the Sith apprentice that he is a monster. Vader agrees before using his Force powers to breach the dam structures. Master Infil'a attempts to counter Vader's damage through the Force. When Master Infil'a pleads with Vader not to hurt the innocent, Lord Vader dismisses him as a fool and uses the Force to steal his lightsaber. After Force choking Infil'a, Vader hurls him down the ramparts. The Jedi Master is swept away in a flood that destroys Am'balaar City. Vader watches as the city is engulfed in water released from the dam."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}