{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 3"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 3 is the third issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on July 12, 2017 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Vader sets his sights on a Jedi who's avoided Order 66…a Jedi Master who's long lived in seclusion…a Jedi more powerful than any Vader has faced before…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The approaching storm"}, {"tag": "p", "text": "On the River Moon of Al'doleem in the Mid Rim, Jedi Master Kirak Infil'a mediates in the Force while assembling four Padawans' traps. Infil'a then engages in a sparring exercise with the training droid Arex, who tells him that fighting while assembling four traps is ill-advised. Infil'a counters that the easy path rarely leads to a worthwhile ambition. Having spent time with numerous Jedi, Arex opines that Infil'a's philosophy is simplistic. He warns the Jedi Master that he has chosen a difficult path that may lead to his death. Arex suggests that the easy path will allow to live longer but perhaps not as a Jedi."}, {"tag": "p", "text": "Knocking Arex back, Infil'a counters that he is a Jedi and pretending to be otherwise would not be easy. As he assembles the traps, Infil'a adds that this would be impossible. Through the Force, Infil'a senses that something dark is coming and tells Arex to prepare Mount Pasvaal's defenses."}, {"tag": "p", "text": "Aboard Vader's starship, Darth Vader's droid issues a proximity alert and warns Darth Vader that they are approaching objects from Quadrant Two. When Vader asks the droid whether they are missiles, the droid is about to explain when the ship collides with a circular object that breaks in half. Following the collision, the droid reports that they have sustained damaged to the primary and secondary thrusters and that deflector shields are non-optimal. The droid suggests landing but Vader thinks that doing so would give them a chance to flee."}, {"tag": "p", "text": "The droid convinces Lord Vader to land the ship within a canyon in order to avoid losing it. After landing, Lord Vader says that he has lost nothing because he can still senses the Jedi out there. The droid commences repairs immediately, calculating that it would take two standard days. The droid advises Lord Vader to wait but the Sith apprentice is determined to counter the Jedi, who is expecting him."}, {"tag": "h3", "text": "Ascending the Mountain"}, {"tag": "p", "text": "After traveling through the canyon, Lord Vader encounters a wall that suddenly rises out of the ground. Master Infil'a senses that Lord Vader stinks of the dark side. The two try to touch each other with the Force but Master Infil'a suspends hostilities. Having sensed the deaths of numerous Jedi through the Force, he asks if Lord Vader had a hand in it. The Sith confirms this is the case. When Master Infil'a asks if Vader is here to kill him, the Sith apprentice confirms so."}, {"tag": "p", "text": "Master Infil'a explains that he took the Barash Vow for his transgressions, vowing to live alone inside the Force until his truth path as a Jedi became clear. The Barash Vow involves living outside the Jedi Order and taking no action on its behalf despite the circumstances. Infil'a realizes that Vader had known he had taken the Barash Vow. Declaring the Barash Vow complete since his Jedi brethren have died, he vows not to go down without a fight."}, {"tag": "p", "text": "Master Infil'a explains that the mountain is called Mount Passvaal, a sacred site designed to test all Jedi who come here. The higher they go, the more demanding the challenges become. Infil'a challenges Lord Vader to meet him at the summit before instructing Arex to open the sluice gate. The canyon is quickly submerged in water, almost sweeping Lord Vader away. The Sith apprentice uses the Force to part the flood and climbs up a stone bridge."}, {"tag": "p", "text": "Lord Vader is attacked by several raptorans but the Sith apprentice uses the Force to tear the birds apart. Watching the fight via video, Arex asks Master Infil'a if he should blow up the bridge. Master Infil'a ponders as to what kind of monster Darth Vader is. Arex says that his Sith generally wield lightsabers with crimson blades but their opponent doesn't wield such a weapon. Based on Vader's Force abilities, he believes that the intruder is a dark sider who is dangerous and will defeat the raptorans. Master Infil'a declines Arex's offer and decides to let the \"creature\" past."}, {"tag": "p", "text": "As Vader uses the Force to rip the raptorans apart, Arex observes that the Sith Lord will reach the spikewind next and offers to activate the traps. However, Master Infil'a convinces him to turn off all the traps. Arex warns that Lord Vader will reach them soon. Infil'a replies that this was his intention."}, {"tag": "p", "text": "As the Sith apprentice ascends up the final flight of stairs to the summit, Master Infil'a goads him. Lord Vader uses the Force to hurl embedded rocks at Infil'a. The loyal Arex charges at Lord Vader, vowing to destroy him. However the Sith uses the Force to levitate him and then rip his lightsaber arm off before hurling the droid down the mountain."}, {"tag": "p", "text": "Lord Vader parries with Master Infil'a, who realizes that the Sith apprentice is not only here to kill him but also to obtain his lightsaber. Taunting Lord Vader as weak, he drives him near the edge of the summit and slices off the lower half of his prosthetic left leg. With Vader on his knees, Infil'a vows to seek out his master as well and destroy him. He then vows to restore the light of the Jedi to the galaxy. Using the Force, Master Infil'a throws Lord Vader down the mountain."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}