{"url": "Darth_Vader:_Dark_Lord_of_the_Sith_7", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader: Dark Lord of the Sith"], "nodes": [{"tag": "h1", "text": "Darth Vader: Dark Lord of the Sith 7"}, {"tag": "p", "text": "Darth Vader: Dark Lord of the Sith 7 is the seventh issue of the canon comic book series Star Wars: Darth Vader: Dark Lord of the Sith. It was written by Charles Soule, illustrated by Giuseppe Camuncoli, and published on November 1, 2017 by Marvel Comics. The issue features the story \"The Dying Light Part I,\" in which Darth Vader begins the hunt for Jedi Master Jocasta Nu."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "LEGACY'S END BEGINS! As Vader takes his place in command of the Emperor's secret Inquisitorius Program, he sets his sights on one of the most dangerous Jedi remaining alive…and it's not who you'd expect."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Serving the same Master"}, {"tag": "p", "text": "In Coruscant's The Works district, Darth Vader trains the Inquisitorius in lightsaber combat. He uses ruthless training methods which result in the Inquisitors sustaining serious injuries including the loss of limbs and eyes. After slicing off the Sixth Brother's left arm, Vader demands that the wounded Inquisitor continue the fight. The Grand Inquisitor intervenes, expressing concern about Vader's violent training methods. As the Sixth Brother limps away, Vader counter that he will teach him loss, a lesson he and the other Inquisitors will never forget."}, {"tag": "p", "text": "At a medbay, medical droids attended to several wounded Inquisitors including the Ninth Sister, the Fifth Brother, and the Sixth Brother. Vader believes that the Inquisitorius are not ready to hunt down and kill survivors of the Great Jedi Purge. The Grand Inquisitor disagrees, telling Vader that the Inquisitors are former Jedi. Vader disparages the Jedi Order's defensive combat methods which are based around minimizing bloodshed. He blames this error for infecting all of the Inquisitors' tactics."}, {"tag": "p", "text": "As they enter a meeting room with a holomap in the center, the Grand Inquisitor reminds Vader that the Emperor appointed him to his position and believes in his ability. Vader is unmoved and demands that the Grand Inquisitor bring his training methods to the others, warning that any Inquisitors who fail to progress will be eliminated. The Grand Inquisitor recognizes that Vader despises them but reminds Vader that the Emperor tasked them with hunt down the Jedi. Since Vader is in charge of the Inquisitorius, he reminds the Sith apprentice that their failure will reflect badly on him rather than the Grand Inquisitor. Vader admits that he despises the Inquisitorius but believes in change since all things are possible through the Force."}, {"tag": "p", "text": "Studying the map, Vader says that they will begin hunting Jedi Purge survivors. The Grand Inquisitor reminds Vader that the Emperor has already assigned him a list of priority targets including Yoda, Quinlan Vos, the late Kirak Infil'a, Jocasta Nu, and Ahsoka Tano. One of the targets is the Jedi archivist Jedi Master Jocasta Nu, who has been given extra emphasis for yet unclear reasons. The Grand Inquisitor is curious about how she survived but Vader reminds him not to question the will of the Emperor. If the Emperor wishes her to be destroyed, he vows that it will be done."}, {"tag": "h3", "text": "Jedi in hiding"}, {"tag": "p", "text": "In her hiding place, Master Nu uses a holocron to send a message to Jedi fugitives, telling them that it is up to them. A bespectacled dark-skinned human man named Gar enters the cave, expressing concern about her recording of the holocrons tiring her. Nu reassures him that she only needs to record one more before thanking him for fetching her tea. When Gar inquires about a holocron, Nu replies that it includes her last words and thoughts on the purpose of the Jedi Order including the light that it brings to the galaxy."}, {"tag": "p", "text": "She tells Gar to place the holocrons with the others since she has more work to do. When Gar expresses concern that Nu will exhaust herself, Nu responds that her work is not complete since she possesses knowledge of the Jedi Archives' secrets. Before leaving, she asks Gar for some more tea."}, {"tag": "p", "text": "At the former Jedi Temple, the Grand Inquisitor confides in Darth Vader about his hatred for Master Nu, whom he resents for denying him full access to the Jedi Archives. He thinks that Nu believed that education was for the elite and discriminated against the warriors who put their lives on the line for the Jedi Order. The Inquisitor vows to read through everything in the Jedi Archives. Lord Vader reminds him that his task is to search the Archives for clues about the surviving Jedi including personal information and family connections. He warns the Grand Inquisitor not to fail. The Inquisitor tells him not to worry since he has waited his whole life for this."}, {"tag": "p", "text": "After recording her final holocron, Master Nu walks inside a waterfall which conceals a hangar containing a Delta-7 Aethersprite-class light interceptor and her astromech droid Beetoo. Gar invites Master Nu to talk over a meal but he realizes that Nu is planning to depart. Gar pleads with Master Nu not to return to the Jedi Archives and to stay in hiding. Nu explains that she has not built an Archive here but rather a school. She tells him that she has to leave in order to retrieve something. Though the mission will be extremely dangerous, she fears that letting it sit where it is would be worse. When Gar asks what is so important, Master Nu explains that the school she is building needs pupils."}, {"tag": "h3", "text": "Vader's new mission"}, {"tag": "p", "text": "Back on Coruscant, Lord Vader informs the Emperor that he has implemented an aggressive training program for the Inquisitors. Lord Vader asks the Emperor why he is so interested in Master Jocasta Nu. The Emperor explains that the archivist Nu is knowledgeable about every Force-strong site across the galaxy including shrines, energy wells and ancient temples. He tells Lord Vader that Nu is the custodian of a \"great treasure\" hidden within the Jedi Archives that he desires. The Emperor tasks Vader with retrieving this treasure by capturing Master Nu and bringing her alive to him."}, {"tag": "p", "text": "When Lord Vader asks why he did not inform the Inquisitors, the Emperor says he is concerned that Master Nu will fall into the hands of non-Sith who could use it against them. While the Grand Inquisitor and the others should be aware of Master Nu, he believes they should not be informed of her importance since they are not Sith. The Emperor senses that Master Nu is trying to change the destiny of the galaxy and orders Vader to stop her scheme, emphasizing that he must save her life."}, {"tag": "p", "text": "Meanwhile, Master Nu lands at a Coruscant hangar in her Jedi starfighter. She tells her droid Beetoo to stay with the ship. If he is discovered, she tells the droid that it knows what to do. While she hopes that it does not come to that, the situation is dire and Master Nu reasons she has no choice. Before leaving, she attaches lightsaber to her belt. Making her way to the Jedi Temple, Nu uses a Jedi mind trick to convince several Coruscant Guards that they did not see her. She then enters the Temple through a backdoor."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The issue includes an Aurebesh list of presumed Order 66 survivors, although two of the names are obscured by text bubbles. The comic's assistant editor, Heather Antos, posted an unlettered copy of the list to Twitter, revealing the names to be \"Naia Taver\" and \"Kule Xandar.\" In follow-up tweets, Lucasfilm Story Group member Matt Martin stated that the covered names, as well as the name \"Kayce Beradun,\" were simply Easter eggs and not meant to be interpreted literally. The name Kule Xandar was coined as a reference to the planet Xandar from the Marvel Studios film Guardians of the Galaxy."}, {"tag": "p", "text": "In the story, Jocasta Nu records a holocron with a message to restore the Jedi Order. This holocron first appeared in the 2015 comic book Star Wars 9, in which the message is heard by Luke Skywalker."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}