{"url": "Darth_Vader_(2015)_12", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Darth Vader (2015) 12"}, {"tag": "p", "text": "Darth Vader 12 is the twelfth issue of the Marvel comic book series Star Wars: Darth Vader. The comic, written by Kieron Gillen with art by Salvador Larroca was published on November 11, 2015 and is the final issue in the Shadow and Secrets arc of the series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Abandoning the hunt"}, {"tag": "p", "text": "Pursuing Dr Aphra into the storms above Anthan Prime, Darth Vader and Inspector Thanoth's Imperial forces deploy TIE bombers armed with ion torpedoes through the cloud. Inspector Thanoth's plan is to drive out Aphra's ship Ark Angel or disable it. He is confident they will capture her and identify her patron. He thinks that the theft of the Son-tuul Pride's fortune would have required an internal leak."}, {"tag": "p", "text": "Lord Vader, who is her true patron, claims this is waste and that their resources would be better spent eliminating the Plasma Devils. Inspector Thanoth agrees and says that they know where the Plasma Devils are currently but don't know where they will be this evening. Deeming Dr Aphra a lesser threat to the Empire, he agrees with Lord Vader that they should abandon the chase and hunt down the Plasma Devils. Both accept that Grand General Cassio Tagge will be displeased but that disobeying orders is better than failure. Dr Aphra is relieved that the Imperials have called off the chase and says that she will live. Triple Zero replies for now."}, {"tag": "h3", "text": "Hunting the Plasma Devils"}, {"tag": "p", "text": "Approaching the Thanteen Substrata on Anthan 1, Inspector Thanoth informs Darth Vader that their probe droid has confirmed the location of the Plasma Devils' base. Darth Vader convinces Thanoth to order the bombardment of the westernmost tunnels while he attacks the rebels from the eastern routes. In response to the bombardment of the western tunnels, the Plasma Devils flee through the eastern tunnels. However, Lord Vader is waiting for them and slices off a Y-wing starfighter's left engine."}, {"tag": "p", "text": "Later, Lord Vader and Inspector Thanoth deliver three rebel helmets to Grand General Tagge, Tulon Voidgazer, Commander Karbin, Aiolin and Morit Astarte. Morit is angry that Vader and Thanoth have stolen his and Morit's mission. In Vader's defense, Thanoth quips that the two can spend the afternoon decapitating some more \"useful leads.\" When General Tagge chides Vader for letting the thief escaping, Vader claims that chasing a few missing coins is nothing compared to crushing rebels. Tagge accepts Vader's explanation due to the limited time frame and sensitive information."}, {"tag": "p", "text": "Karbin teases the Astarte twins about their blood lust. In response, Grand General Tagge asks Karbin about his progress in locating Skywalker. Voidgazer mocks him for his failure. After Lord Vader dismisses them, Thanoth thanks Lord Vader for giving a good justification for their actions. He says it has been an honor to work with Lord Vader and is delighted about their triumph despite the thief's escape. Lord Vader tells Thanoth not to worry and vows that Dr Aphra will not escape Imperial justice."}, {"tag": "h3", "text": "Darth Vader's secret agents"}, {"tag": "p", "text": "In a cave, Triple Zero warns Dr Aphra that withholding information from Lord Vader constitutes a form of blackmail and that Vader does not take such things likely. While Triple Zero and Beetee chat about how Lord Vader would terminate Dr Aphra, the anxious woman tells them that they are not helping."}, {"tag": "p", "text": "Shortly later, Vader arrives and startles Dr Aphra. She reveals that Luke Skywalker is on Vrogas Vas. Vader is surprised to see her here. Dr Aphra responds that she has sent him a message and ran and thinks that he has come to hunt and kill her. She says that the only chance she had of surviving was showing that she was trustworthy. She tells Lord Vader that she works for him but can't do it when she is dead. She asks him to spare her life in return for her services."}, {"tag": "p", "text": "Lord Vader has come to appreciate her talents over the past few days and decides to spare her life. Aphra tells Vader to get past wanting to kill her on a whim. When the Sith Lord asks about Vrogas Vas, she tells him that the planet hosts a Jedi temple. While Vader is unaware of a Jedi temple being on the planet, he agrees to test her information. Lord Vader then departs alone on his TIE Advanced x1 starfighter, rebuffing Aphra's offer of assistance."}, {"tag": "p", "text": "Unknown to Dr Aphra, her droids, and Vader, they are being monitored by Vader's rival Commander Karbin, who does not want Lord Vader to usurp his mission to capture Skywalker. He vows to capture Skywalker for himself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}