{"url": "Darth_Vader_(2015)_9", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Darth Vader (2015) 9"}, {"tag": "p", "text": "Darth Vader 9 is the ninth issue of the Marvel comic book series Star Wars: Darth Vader and the third of six issues in the series' second story arc, Shadows and Secrets. The comic, written by Kieron Gillen with art by Salvador Larroca, was released on September 9, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Detective work"}, {"tag": "p", "text": "On the moon Anthan 13, a group of Rebel troopers attempt to ambush Darth Vader but find that the Sith Lord is expecting them. At the Anthan Prime Orbital Dockyard, Inspector Thanoth informs Lord Vader that he has a lead on those responsible for the heist. He found no sign of interference with the ship's systems. Thanoth theorizes that a small team manufactured a meteor storm with explosives and used it to cover up the fact that the ship was disabled with an ion charge. The culprits then boarded, located the vault, and manually fired an enhanced meteor to create a breach, ejecting everything into space and then scooped their \"ill-gotten gains.\""}, {"tag": "p", "text": "Since Vader is complicit in the heist, he initially voices skepticism. Thanoth vows to hunt down the thieves before questioning Lord Vader what brought him to Anthan 13. The Sith Lord claims that he pursued a rebel cell there. When Thanoth queries as to why it was not reported, Vader responds that he does not consider eliminating a few rebels noteworthy. He invites the inspector to inspect the remains for himself."}, {"tag": "h3", "text": "Questioning suspects"}, {"tag": "p", "text": "Continuing their investigation in the depths of Anthan Prime, Inspector Thanoth tells Lord Vader that he suspects the thieves obtained their explosives from a figure known as The Dragon. His plan is to meet one of his dealers named Doowan in a droid fighting den. Before Thanoth and Lord Vader can enter a den, they find that it has been cordoned by Imperial stormtroopers in response to an incident. They soon discover that the Astarte twins Aiolin and Morit Astarte are fighting both droids, patrons and stormtroopers."}, {"tag": "p", "text": "Lord Vader remarks that their blade work is rudimentary but effective. When Inspector Thanoth asks if it makes him nostalgic for lightsabers, the Sith Lord says it does not. The two soon spot the Nautolan Doowan, who threatens to shoot them but Lord Vader uses the Force to levitate his blaster. Lord Vader drags Doowan to a corner. While Lord Vader chokes him with his mechanical hand, Thanoth questions the criminal about the whereabouts of the Dragon."}, {"tag": "p", "text": "Doowan tells them that the Dragon is offworld on the mid-moons in Anthan 12. Vader realizes he is lying and tightens the grip. The Nautolan cracks under pressure and tells the Imperial that the Dragon's mansion is in the lower reach of Anthan Prime's eastword core, giving the coordinates 241-86-1872. Thanoth thanks him for his civic-minded generosity. Thanoth speaks to Morit and tells him that Doowan may be useful to his investigations into the Plasma Devils. To Thanoth's horror, Morit strikes him down with his lightsaber."}, {"tag": "p", "text": "When Thanoth demands that the twins explain themselves, Morit justifies his killing as a show of force and that they can't afford to show weakness. Aiolin adds that it was messy but necessary. Thanoth expresses concern that the Astarte twins will kill every living person in the sector and opines that children should not be sent to do an adult's job. When Thanoth queries about Lord Vader's silence, the Sith Lord responds that he is trying to ascertain if Thanoth is dangerous since Tagge's last adjutant Oon-ai was a traitor. Thanoth replies that he is dangerous to the enemies of the Empire."}, {"tag": "h3", "text": "Seeking information"}, {"tag": "p", "text": "Dr Aphra and her droids Triple Zero and Beetee travel to an orbital holiday resort above Anthan Prime. Triple Zero has not played holochess for years and wishes to make up for lost time. Dr Aphra mets with an Information broker named the Ante, who warns that he is very expensive. Dr Aphra passes him the microchip that Darth Vader gave her earlier and asks about someone named Commodex Tahn. He tells Aphra that Tahn was a military clerk in the Galactic Republic era who later entered his family trade upon the death of his father before retiring for 20 years."}, {"tag": "p", "text": "Aphra confirms Tahn is the target. The Ante warns her that she has spent a lot of credits to access publicly accessible information but Aphra doesn't care and says that he is faster. Later, Aphra tells the droids that Tahn's family were morticians and that they are headed to Naboo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}