{"url": "Darth_Vader_(2015)_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Darth Vader (2015) 5"}, {"tag": "p", "text": "Darth Vader 5 is the fifth issue of the Marvel comic book series Star Wars: Darth Vader and the fifth of six issues in the series' first story arc, Vader. The comic, written by Kieron Gillen with art by Salvador Larroca, was released on May 13, 2015."}, {"tag": "p", "text": "The issue continues the arc of the previous four entries in the Darth Vader series, as the Sith Lord Darth Vader leads his battle droid army to the base operated by the Emperor's mysterious agent Cylo. There, Vader discovers the individuals who Cylo-IV was testing and recreating to ultimately replace Vader as the Emperor's enforcer."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Infiltrating Cylo's base"}, {"tag": "p", "text": "Traveling in Darth Vader's repurposed Naboo Royal Starship, Dr Aphra tells Darth Vader that she has found Cylo's secret base. When she jokes, Lord Vader warns her not to humor him. Cylo's research base turns out to be a giant cyborg whale-ship, which Lord Vader describes as an \"abomination.\" Under Vader's orders, Aphra begins the illegal boarding mission by launching a low ion charge. Aphra says \"May the Force be with you\" before quipping that this is the greatest job of her life."}, {"tag": "p", "text": "The ion charge distracts the crew of Cylo's Flagship. This allows Vader's team to land their starship. Armored marines converge around a blast door, which begins to turn red hot from external pressure. Triple Zero enters and pleads with the sentries not to shoot. He identifies himself and BT-1. However, this is a distraction for Darth Vader who uses his lightsaber to cut a hole through the organic hull of the ship, exposing the sentries to zero gravity space. Watching from afar, Aphra mocks the sentries for not wearing magnetic clamps and reseals the vent."}, {"tag": "p", "text": "Lord Vader then enters Cylo's Flagship with Triple Zero, BT-1 and several repurposed BX-series droid commandos. Dr Aphra remains aboard the Naboo royal starship, feeding Vader intelligence about the layout of Cylo's base from the plans that BT-1 lifted from the system and the information that Triple Zero extracted from Cylo IV. Based on Aphra's information, Lord Vader sends the second platoon to the Dojo while the first platoon accompanies him. Triple Zero and BT-1 head back to the ship."}, {"tag": "h3", "text": "Cylo's project"}, {"tag": "p", "text": "Lord Vader and the first platoon slaughter another group of sentries. However, the second platoon encounter two mysterious humans in the dojo area. After Aphra loses contact with the second platoon, Lord Vader and his droids enter the dojo area and encounter a male and female human named Morit and Aiolin Astarte, who are armed with lightsabers. However, they are not able to use the Force and have been fitted with cybernetic implants that allow them to manipulate their surroundings and leap to great heights."}, {"tag": "p", "text": "They duel Lord Vader but are stopped by a man, who resembles Cylo-IV. Lord Vader is amazed to see Cylo-IV alive but Cylo reveals that he transferred his personality into a new body called Cylo-V, making him immortal. When Vader remarks that Cylo's apprentice lack the Force, Cylo explains that those are Vader's \"replacements\". He tells Lord Vader about his plans to make the Force obsolete before introducing his other \"replacements\": Tulon Voidgazer, a Trandoshan warrior, and the Mon Calamari cyborg Commander Karbin."}, {"tag": "p", "text": "Vader is outraged by this \"blasphemy\". Cylo retorts that Vader as a cyborg is a bridge between the old world and his new; claiming that these creatures are his \"children.\" An enraged Vader attempts to strike down Cylo with his lightsaber but is stopped by Emperor Palpatine, who explains that Vader is sensitive about the topic of children. Cylo explained that the death of Cylo-IV led him to deduce that they were expecting a visit."}, {"tag": "p", "text": "Since they are ahead of schedule, Cylo decides to arrange a demonstration to prove that the Emperor only needs one apprentice in a ceremonial role. He claims that his \"creations\" have a tighter hold that him. The Emperor orders Cylo's creations to show him something worthy of his attention as they converge upon Lord Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}