{"url": "Darth_Vader_24", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Darth Vader 24"}, {"tag": "p", "text": "Darth Vader 24 is the twenty-fourth, penultimate issue of the canon comic book series Star Wars: Darth Vader. The issue was written by Kieron Gillen, illustrated by Salvador Larroca, and published on August 10, 2016 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Vader is lost in his inner mindscape, lost in visions of the Force! Is he truly more machine now than man? Or can he fight his way back from the brink?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Force visions"}, {"tag": "p", "text": "With Darth Vader seemingly incapacitated, Dr Cylo contacts his fleet, telling them that the Super Star Destroyer Executor and that Lord Vader is no longer a threat."}, {"tag": "p", "text": "In his mind, Lord Vader experiences a Force vision of his duel with Obi-Wan Kenobi on Mustafar. Kenobi denounces Vader for his betrayal of the Jedi Order, saying that he loved him. An enraged Vader calls him a liar and a coward. Vader responds that if Kenobi had loved him, he would have killed him. A bitter Kenobi throws him into the molten lake."}, {"tag": "p", "text": "Vader emerges from the lake in his armor wielding his Sith lightsaber. Kenobi responds that if he strikes him down, he would become more powerful that he could imagine. Vader cuts Kenobi in half, causing him to become on with the Force. Vader responds that he is more powerful with every step that he takes away from him."}, {"tag": "p", "text": "Vader is then confronted by a lightsaber–wielding Anakin Skywalker, who denounces him for murdering Kenobi. The two engage in a lightsaber battle but Vader cuts off Anakin's legs. The defeated Anakin asks how he could do this but Vader replies that he was a child and that he is accustomed to killing children. He drags Anakin beside the molten lake, where he is burnt to death."}, {"tag": "p", "text": "Vader soon encounters a pregnant Padmé Amidala, who implores him to stay with her. Vader finds himself chained to an operating table. Amidala tells him that he doesn't need to go and pleads with him not to leave her. An enraged Darth Vader Force chokes her as he regains consciousness and stares at Dr Cylo. As Vader breaks his invisible chains, he regains control over his cybernetic body and impales Dr Cylo with his lightsaber. Deactivating the remote, Vader replies that nothing is impossible with the Force."}, {"tag": "h3", "text": "Tuning the tide"}, {"tag": "p", "text": "Aboard Cylo's whale fleet, Cylo VI awakens from his stasis chamber and orders his fleet to flee. Meanwhile, Lord Vader informs Emperor Palpatine that he has freed the Executor from Cylo's control and that the power is returning. With the Emperor's consent, Vader departs in his TIE Advanced x1 starfighter to hunt down and kill Dr Cylo's last remaining clone bodies."}, {"tag": "p", "text": "Palpatine receives an unscheduled visit from Dr Aphra, who tells the Emperor that they have a mutual friend and that that she has information about things that he needs to know."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}