{"url": "Darth_Vader_18", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Darth Vader 18"}, {"tag": "p", "text": "Darth Vader 18 is the eighteenth issue of the Marvel comic book series Star Wars: Darth Vader. It is the third of four issues in the series' third arc. The issue, written by Kieron Gillen with art by Salvador Larroca, was released on March 30, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Sabotage"}, {"tag": "p", "text": "On Shu-Torun, Triple Zero and Beetee throw the corpse of Beebox into a lava pit. Triple Zero sadistically reminisces over Beebox's burning corpse, longing for more action against the ore-dukes. The Shu-Torun Loyalist/Imperial Delving Fleet deploys several combat drills into the earth. Dr Cylo warns the combined Shu-Torun loyalist and Imperial forces that they have to be careful when approaching Baron Rubix's delving citadel since there are entire seams of ores. Queen Trios' palatial drill remains in the second wave. Darth Vader vows that this is the last battle and that the Empire will take out the Rubix stronghold with overwhelming force. He warns that failure is unacceptable."}, {"tag": "p", "text": "However, Lord Vader's combat drill loses control and the machine veers offcourse into the Lithoporoite seam, which leads to the lower mantle. Princess Trios fears that Lord Vader is doomed. In the combat drill's command center, a stormtrooper informs Lord Vader, Triple Zero, Beetee, Aiolin, and Morit Astarte that they have hit solid rock and that gyroscopes have leveled the floors. Though they ares table, they have lost propulsion. The Imperials find themselves surrounded by Rubix's soldiers."}, {"tag": "h3", "text": "Escaping the trap"}, {"tag": "p", "text": "Lord Vader realizes this is a trap and orders his forces to activate the siege defense. The combat drill unleashes its laser cannons on the advancing enemy troops. Vader, the Astarte twins, and stormtroopers then charge out into battle. Triple Zero and Beetee activate several BX-series droid commandos as reinforcements, which pour down laser fire onto Rubix's troops. With Rubix's troops in retreat, Morit thinks they should press their advantage but Aiolin disagrees. Vader recognizes one of the fallen soldiers as one of Baron Rubix's elites and thinks that Rubix has gambled all his forces in the trap."}, {"tag": "p", "text": "When Aiolin asks if the drill was sabotaged, Vader says it was and thinks that Rubix was behind it. Vader thinks that Trios should continue the attack. Meanwhile, Dr Cylo urges Queen Trios to call of the attack but she responds that they must await Vader's orders. Dr Cylo responds that the Queen only commands Shu-Torun forces. Queen Trios resolves to fight alone but Chancellor Jooli vetoes her move on the grounds that she lacks Imperial support."}, {"tag": "p", "text": "Vader learns that the Shu-Torun/Imperial forces have called off the attack and tries to countermand the orders. However, a stormtrooper officer warns him that their outbound communications are being jammed. Vader's plan is to reach the Rubix's lines and use their communications to contact Trios. Triple Zero gives a lecture about the superiority of droids but Vader silences him. Lord Vader orders the stormtrooper officer to hold his position while he and the Astartes deal with the enemy. Triple Zero tells Beetee that they won't carry out his plan."}, {"tag": "h3", "text": "Treason"}, {"tag": "p", "text": "Queen Trios challenges Chancellor Jooli's decision to call of the attack, telling him that they must have faith in their powerful friends. Trios pulls out a blaster pistol and demands that the Chancellor reverse his decision at gunpoint. Chancellor Jooli responds that he has been Chancellor for the last forty years and that she was never meant to be Queen. He tells her to know her place and thinks that she won't shoot him. Trios agrees but then orders one of her soldiers to kill the traitor. Takin control, Trios orders her troops to go to war."}, {"tag": "p", "text": "Meanwhile, Aiolin and Morit ambush Darth Vader while crossing a stone bridge overlooking a molten lake. Aiolin says that they can't believe he trusted them. Vader responds that if he had trusted them, he would have left them at the siege. He reveals that he brought them with him to test their character. Vader taunts them for failing their test."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}