{"url": "Darth_Vader_20", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Darth Vader 20"}, {"tag": "p", "text": "Darth Vader 20 is the twentieth issue of the Marvel comic book series Star Wars: Darth Vader. It is the first issue in the series' fourth arc, End of Games. The issue, written by Kieron Gillen with art by Salvador Larroca, was released on May 11, 2016. In the first edition, the issue was mistakenly presented as fifth part of Star Wars: Darth Vader Book III: The Shu-Torun War, the comic series' third book. The issue also includes the mini-comic The Misadventures of Triple-Zero and Beetee."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "New Story Arc! \"END OF GAMES\" begins this issue!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Master and apprentice"}, {"tag": "p", "text": "Darth Vader's Imperial Star Destroyer arrives above the planet Kuat. Triple Zero and Beetee inform Darth Vader that they have arranged a meeting with Inspector Thanoth. Vader thanks Triple Zero but says that they will deal with Emperor Palpatine first before dealing with Thanoth. Triple Zero gazes out the viewport at Grand General Cassio Tagge's new flagship, the Super Star Destroyer Executor; remarking that he would covet the ship, which is undergoing construction."}, {"tag": "p", "text": "Darth Vader meets with the Emperor in his personal quarters aboard the Executor. The Emperor orders his Imperial Royal Guards to leave while he talks with Vader. The Emperor briefly recounts the history of the Sith, their war with the Jedi, and the Rule of Two. The Emperor says that he restored the Sith to their rightful place in the galaxy by purging the Jedi and ushering a New Order."}, {"tag": "p", "text": "The Emperor also talks about his previous apprentices Maul, whom he regards as a loss, and Darth Tyranus, whom he describes as a proton torpedo. The Emperors speaks of how he recruited Darth Vader as a superior candidate and was deeply disappointed with his failure on Mustafar. Realizing that Vader was important to the survival of the Empire, the Emperor talked about how he turned to several scientists including Doctor Cylo to save Vader's life."}, {"tag": "p", "text": "When Vader points out that it was a mistake for the Emperor to trust Dr Cylo, the Emperor agrees but said that purging him would have risked a schism of the Galactic Empire's great minds while the Death Star was being constructed. The Emperor says that he had to trick Cylo into overplaying his hand and that Cylo had taken the bait by offering to supplant Vader with his \"replacements\". In pride, Cylo had fallen into the Emperor's trap by betraying the Empire."}, {"tag": "p", "text": "Vader understands the Emperor's plan but asks if he would be making the same speech to Cylo's \"replacements\" if they had triumphed. Vader says that the dark side is strength and that he is that strength. The Emperor agrees and tasks Lord Vader with hunting and destroying Dr Cylo."}, {"tag": "h3", "text": "Conversation with Inspector Thanoth"}, {"tag": "p", "text": "Darth Vader travels to Anthan 13 on his TIE Advanced x1 starfighter where he meets with Inspector Thanoth in a cave. After Thanoth greets him, Vader asks where is the girl. Thanoth reminds Lord Vader that the girl has a name—Dr Chelli Lona Aphra—but says there are doubts about her doctorate."}, {"tag": "p", "text": "When Vader reiterates his question, Thanoth says he is not afraid of the Sith Lord. He tells Vader that his investigation found that Dr Aphra had been protected by Vader; citing her escape, numerous loose ends and coincidences, and trips to Tatooine, Naboo, and Vrogas Vas. Thanoth also has figured out that Lord Vader is interested in a boy named \"Skywalker\", whom he hopes to find, train in the dark side, and use to supplant the Emperor."}, {"tag": "p", "text": "Inspector Thanoth tells Lord Vader that Aphra needs to be removed to ensure that the Emperor never discovers Vader's plot. Thanoth offers to help Vader to find Aphra. When Vader asks about his motivations, Thanoth tells him that he thinks that the Emperor is weak and criticizes his plan to spend decades building the Death Star only to have a handful of starfighters bring it down. He thinks that the Emperor's grasp is faltering and that a stronger hand is needed."}, {"tag": "p", "text": "Thanoth says that the Emperor is a man but that he believes in the \"eternal Empire.\" Thanoth believes that Lord Vader is better for the Empire and that his plan must succeed. When Vader reiterates his request for Aphra's whereabouts, Thanoth says that he arranged to meet with Lord Vader since he knows the Sith's tenacity and relentlessness in searching for the source of the information."}, {"tag": "p", "text": "Thanoth accepts that Vader would have to kill him, which he regards as better than spending his entire life running while Vader wastes time and effort that should be spent on rescuing the Empire from itself. Accepting his fate, Thanoth stands firm as Lord Vader draws his lightsaber. Addressing Vader as Anakin, Thanoth says that it has been a pleasure working with him before telling him that Dr Aphra is on the Cosmatanic Steppes."}, {"tag": "p", "text": "Lord Vader strikes down Thanoth, killing him with a single blow. Lord Vader leaves Triple Zero and Beetee to dispose of the late Thanoth's remains. Before leaving to deal with Dr Cylo, Vader orders Triple Zero and Beetee to travel to the Cosmatanic Steppes in the Outer Rim Territories to bring Dr Aphra to the Executor. Failing that, he warns that she must be silenced."}, {"tag": "p", "text": "Triple Zero says that he and Beetee say that dealing with Dr Aphra is tricky due to her resourcefulness. However, he reassures Lord Vader that they managed to acquire a number of friends including Black Krrsantan and a squad of BX-series droid commandos. When Beetee beeps, Triple Zero opines that he doesn't think that Lord Vader is going to bring Dr Cylo back which is a shame because he would have loved to torture him again."}, {"tag": "h3", "text": "The Misadventures of Triple-Zero and Beetee"}, {"tag": "p", "text": "Triple Zero and Beetee visit Ruen, who owns a workshop on Lotho Minor's Wreck Belt. Triple Zero explains that they have come seeking repairs and upgrades including munitions and syringes. A suspicious Ruen removes Triple Zero's arms under the pretext of conducting repairs."}, {"tag": "p", "text": "With Triple Zero disarmed, Ruen questions the droid about his knowledge of the stolen Triple-Zero protocol personality matrix and ascertains that his customer is the wanted droid. However, Triple Zero reveals a trick up his sleeve and has Beetee raze the workshop and surrounding battle droids. Triple Zero convinces Ruen to reattach his arms in return for sparing his life."}, {"tag": "p", "text": "Though Triple Zero and Beetee are programmed not to kill Ruen, they exact a promise from Ruen not to inform the authorities in return for payment. Before leaving, Triple Zero has Beetee hack the control loops and ethical constraints on Ruen's remaining battle droids as insurance Ruen reneges on his promise and contacts the Kallidahin authorities. However, the combat droids turn on him and kill him, also destroying the workshop."}, {"tag": "p", "text": "Walking away, Triple Zero remarks that if people treated their droids with respect, none of this violence and destruction would be necessary. However, he remarks that the explosions are \"very pretty.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "At the end of issue 19, Palpatine asks Vader to come to Coruscant to meet him. The opening text of this issue also mentions Vader travelling to Coruscant. However, in the story proper, their meeting take place on the Executor instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}