{"url": "Darth_Vader_22", "categories": ["Category:Real-world articles", "Category:Star Wars: Darth Vader (Marvel)"], "nodes": [{"tag": "h1", "text": "Darth Vader 22"}, {"tag": "p", "text": "Darth Vader 22 is the twenty-second issue of the Marvel comic book series Star Wars: Darth Vader. The issue was released on June 29, 2016, and it is written by Kieron Gillen, with art by Salvador Larroca."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Delivering Dr Aphra"}, {"tag": "p", "text": "As Black Krrsantan's Auzituck anti-slaver gunship approaches the Super Star Destroyer Executor, Triple Zero taunts Doctor Aphra that she will regret his decision to surrender, quipping that there are far worse fates than death by blaster."}, {"tag": "p", "text": "After landing in the Executor's hangar bay, Dr Aphra tells the stormtroopers that Lord Vader ordered them to bring her here and to keep her safely locked away. As Dr Aphra is lead away, she tries to issue a new priority order to Triple Zero to get her out of here. However, Triple Zero and Beetee reveal that they are independent of her. Dr Aphra can do little as she is dragged away by the stormtroopers."}, {"tag": "h3", "text": "Vader versus the scientist"}, {"tag": "p", "text": "Meanwhile, the scientist Tulon Voidgazer commences Experiment 428 and directs the cyberanimate rancor to attack Darth Vader. The Sith Lord slashes off one of the rancors claws with his lightsaber. However, Voidgazer has installed neural dampeners which counteract the rancor's pain and activate the adrenaline stimulants."}, {"tag": "p", "text": "The rancor hurls Vader into a corner. Lord Vader is unable to Force choke the rancor due to the plate reinforced thorax. The rancor eventually traps Lord Vader near a corner. Though Voidgazer boasts that her cyberanimate system can circumvent weaknesses, Vader is able to use the Force to shove his lightsaber up the rancor's nostrils and through its brain, killing it."}, {"tag": "p", "text": "Voidgazer is horrified that Vader has severed the cyberanimate link. Lord Vader mockingly tells her that she does not understand the Force. Voidgazer responds that she has not interested in his superstition and that she trusts in science. Confronting Vader, she tells him that if she hadn't had the chance to test his work directly against him, she would have been disappointed."}, {"tag": "p", "text": "Meanwhile, Dr Cylo tells Morit Astarte that Tulon is engaging Lord Vader. Morit fears that she will kill Lord Vader but Dr Cylo says that she is only delaying him. He says that Dr Cylo's real work is complete and issues orders for his flagship to drop out of hyperspace. Dr Cylo's ship exits hyperspace above the Executor, which is docked to the shipyards above the planet Kuat. He issues orders to engage Voidgazer's protocols before heading to the escape pods  with Morit."}, {"tag": "p", "text": "Dr Tulon unleashes her blaster droids on Darth Vader, directing them remotely. However, Lord Vader uses the Force to hijack one of the droids, causing it to blast Dr Tulon. As she lies dying, Dr Tulon tells the Sith Lord that she has already won and thanks Grand General Cassio Tagge for placing her in an important position while Lord Vader was preoccupied with letting the criminals who stole the Son-tuul Pride's fortune escape."}, {"tag": "h3", "text": "Hijacking the Executor"}, {"tag": "p", "text": "As Dr Cylo's fleet approaches, General Tagge orders his gunners to prime all batteries. However, their weapons systems, controls, doors, and starship systems are inoperative. Emperor Palpatine contacts General Tagge by holoprojector, saying that he senses a disturbance and hope nothing is wrong. General Tagge and his crew are knocked out by sleeping gas."}, {"tag": "p", "text": "An Emperor's Royal Guard informs the Emperor that they have been cut off from the rest of the ship and are operating on their own life support system. Dr Aphra is also knocked out in her cell by the sleeping gas."}, {"tag": "p", "text": "The dying Tulon tells Vader that she made the requested improvements to the Executor's firing range but added some of her own features. She tells Vader that she is a martyr for science and that she is immortal. Lord Vader heads to the command bridge, which sits above the whale-ship's brain. He finds that Dr Cylo has set his flagship on a collision course with the side of the Executor and the orbital shipyards. Vader is unable to alter the ship's course."}, {"tag": "p", "text": "A triumphant Dr Cylo remarks that it was a shame to lose his ship since she served him well. He says he will remember her fondly as the weapon that ended Darth Vader. Dr Cylo and Morit Astarte then head to their new flagship, the disabled Executor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}