{"url": "Darth_Vectivus", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Banite Sith", "Category:Business owners and executives", "Category:Darths", "Category:Force ghosts", "Category:Humans", "Category:Males", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "Darth Vectivus"}, {"tag": "p", "text": "Darth Vectivus, in the life he enjoyed prior to becoming a Sith, was a male Human who served as the director of the Jonex Mine Eight Eleven B asteroid mining colony in the MZX32905 star system near the planet Bimmiel. A shrewd and principled businessman, he shut down the operation when the reservoir of dark side energy over which the colony was situated began to negatively influence his employees. Because of his own Force sensitivity, he began to study and experiment with the mysterious anomaly himself, where he developed a Force technique which involved the creation of dark side–empowered phantoms. He eventually did away with the entire mining operation and left the habitat for a time in search of the Sith. His quest was ultimately fruitful, and upon completion of his apprenticeship, he ascended to mastery as Darth Vectivus, Dark Lord of the Sith. He participated in the Banite Sith under the Rule of Two: a master and an apprentice. Though a proponent of the dark side, Darth Vectivus' self-discipline and preexisting code of ethics allowed him to remain fair and balanced without succumbing to the lure of power which plagued many of the Sith Lords who preceded him. He eventually returned to the mine and maintained a plentiful existence in the company of friends and loved ones alike."}, {"tag": "p", "text": "Vectivus passed into physical death centuries prior to 40 ABY, but his spirit retained its power and lingered in Jonex's labyrinthine mines underneath the Home, where in life he had once resided. It was also there where his ghost met then–Dark Lady of the Sith Lumiya, who had since taken up residence in his home. Lumiya later raised a phantom of Lord Vectivus that encountered a young female Jedi Knight named Nelani Dinn in the asteroid mines. Vectivus had a conversation with Dinn, during which he attempted to convince her to slay him in order to save the lives of countless others. Dinn declined the offer, which prompted the Dark Lord to transform into the likeness of former Galactic Emperor Palpatine and entice Dinn to strike down the visage of a known villain. Vectivus rebuked her when she again refused him, and declared that she lacked the ability to sacrifice a life other than her own for the sake of many. He then illuminated the exit, mocked Dinn's purported weakness, and allowed her to escape while he disappeared into the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The Human male who later became known as Darth Vectivus lived a normal life into adulthood, complete with family and a host of friends for whom he cared. From them he learned many skills which he incorporated into his business practices as the administrator of the Jonex Mine Eight Eleven B mining facility in the MZX32905 system. Situated within an asteroid belt near the planet Bimmiel, he established his headquarters on a particular asteroid known as the Home, which was also rich in the metal ores that his company harvested."}, {"tag": "p", "text": "Unbeknownst to both him and his employees, the asteroid was suffused with the dark side of the Force, the result of an extinct sentient mynock-like species that had resided in the Home. The sanity of Jonex Mine Eight Eleven B's attendants was slowly eroded over time by the dark side energies of their work environment; the Force-sensitives among them experienced unexplained visions, displayed peculiar abilities, and even began to behave similarly to the mynock-like species that had preceded them. The director—who was Force-sensitive and also began to experience unusual phenomena—discreetly silenced the reports of bizarre happenings, ceasing all of Jonex's mining activities to keep the situation secret in the midst of the asteroid field's other continuing operations. He devoted his time to experiments with the cavern's intense darkness, examining and developing new Force abilities in the process."}, {"tag": "h3", "text": "Sith Master"}, {"tag": "p", "text": "When it was no longer a lucrative endeavor, the director quietly mismanaged the operation and shut it down entirely. He coerced individuals to turn a blind eye through monetary incentives and persuasion, and effectively consigned the mine to obscurity. He then ventured out into the galaxy in active pursuit of the Sith. The director's quest proved successful; he found, and was apprenticed to, a Sith Master who furthered his dark side knowledge and ability to the point of his own mastery. Upon completion of his training in the ways of the Force, he inherited the mantle of Dark Lord of the Sith as Darth Vectivus."}, {"tag": "p", "text": "The established moral code of his former existence as a business executive was not lost to Darth Vectivus during his transformation into a Sith Lord, and adherence to those ethical standards prevented him from succumbing to the stereotypically common shortcomings of his predecessors. Violence, galactic ambition, and the eradication of the Sith's philosophical Jedi rivals were of no consequence to him; his contention was to simply immerse himself in Sith lore and study the galaxy. Upon his return to the mine years later as a fully fledged Sith Lord, Vectivus built a mansion in the heart of the asteroid's dark side potency. He also fashioned a personal Sith holocron which contained his philosophy on business practices, as well as a detailed explanation on the implementation of dark side–empowered projections. An ability developed by Vectivus himself, these phantoms were controlled Force apparitions that required the healthy soul of a living host to serve as the manifestation's anchor into the physical realm. Each was inextricably linked to the other; if one was killed or destroyed, the other would suffer the same fate. Such was Vectivus' ability that summoning hundreds of concurrent phantoms required little effort. Darth Vectivus eventually died at the Home, having lived out the remainder of his days surrounded by friends and family."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Lumiya"}, {"tag": "p", "text": "Millennia after Darth Vectivus' death, his residence served as the domain of Lumiya, Dark Lady of the Sith. The Home became a sanctuary where she studied the Force, the history of the Sith, and Lord Vectivus himself. While living in the Home, Lumiya also discovered the spirit of Darth Vectivus lingering in the bowels of the asteroid. It was there that she learned to master his Force phantom technique to a degree that enabled her to send them across the expanse of the galaxy for whatever ends she desired."}, {"tag": "p", "text": "By 40 ABY, Lumiya came to believe that the galaxy was descending into a state of anarchy and that the current government, the Galactic Federation of Free Alliances, was unable to maintain peace among its citizens. She felt that a Sith Lord with the moral stature of Darth Vectivus was necessary to restore galactic stability; to this end she planned to transform Jedi Knight Jacen Solo into the Sith dictator she had envisioned. Under the guise of \"Brisha Syo,\" Lumiya lured Solo, his cousin Ben Skywalker, and the female Jedi Nelani Dinn to the Home. She separated Solo from his companions and, with Darth Vectivus as her perfect example of a benevolent darksider, began to persuade Solo into accepting what she claimed was his destiny as a Sith. After much contemplation, Solo was eventually convinced by the example of Darth Vectivus' solid moral foundation. In the midst of the chaos that later erupted into the Second Galactic Civil War, Solo ascended to mastery himself as Darth Caedus, Dark Lord of the Sith."}, {"tag": "h4", "text": "Conversations with Nelani Dinn"}, {"tag": "p", "text": "While Lumiya enticed Jacen Solo into accepting dark power without the corruption of evil ambition, she also raised a phantom of Darth Vectivus that encountered one of Solo's comrades, Jedi Knight Nelani Dinn, within the maze of tunnels underneath the Home. The Sith specter attacked Dinn with mynock phantoms, forcing her to fight for her life against them. The creatures suddenly ceased harassing Dinn moments before the shrouded figure of Vectivus appeared. He introduced himself to the Jedi, who recognized him as the cause of all that had befallen her thus far; Vectivus, however, suggested that he was merely a figment of her imagination. When Dinn refuted his claim because she could feel his immense dark side presence, Vectivus corrected her and explained that what she sensed was the Force aura of the being to whom he was connected. He informed her that he, like all the mynocks, was actually a Force phantom. He further stated that for every phantom she eliminated, a person or animal somewhere in the universe died with it. Dinn was skeptical of Vectivus' claim, but the Dark Lord assured her that he spoke the truth. Weary of the phantom's incessant conversation, Dinn wondered how to rid herself of his Sith presence. Vectivus advised that that was only possible by killing him, and if she did so, the mynocks would vanish and Dinn would be able to find both Skywalker and Solo again."}, {"tag": "p", "text": "Vectivus' suggestion was a conundrum, however; if Dinn eliminated him, the life to which he was attached would end as well—an outcome Dinn found unacceptable. The Sith Lord continued to goad her into killing him, but Dinn refused to take the life of an innocent being. Vectivus explained his reason for attempting to press the Jedi into action; countless lives would be saved at his expense and the potential influence of his dark side teachings would be removed. He then assumed the appearance of former Galactic Emperor Palpatine with hopes that the image of a notorious villain would make Dinn's decision simpler, but the Jedi still declined. Returning to his original form, Vectivus rebuked Dinn for her inability to sacrifice one life for the benefit of many. He also found the Jedi's willingness to sacrifice herself in the place of an innocent unacceptable and, through the Force, illuminated the tunnel that Dinn might find her way out. Before she left, Vectivus cautioned Nelani Dinn to avoid interfering in the affairs of others lest she die unnecessarily. He then bid her farewell as he disappeared into the Force. Dinn failed to heed Vectivus' warning and was ultimately killed by Jacen Solo after attempting to prevent Lumiya from seducing him to the dark side of the Force."}, {"tag": "h4", "text": "Later influences"}, {"tag": "p", "text": "Darth Vectivus' residence was left vacant for a short time following the death of Lumiya, who had surrendered herself to death in mortal combat against the Grand Master of the Jedi Order, Luke Skywalker. Vectivus' asteroid domain then became the residence of the Twi'lek Dark Jedi Alema Rar, who had been in collusion with Lumiya prior to her death. Rar later traveled to the Sith homeworld of Korriban, where she met with representatives of a secret Sith order who presented her with Vectivus' holocron to deliver as a gift to Darth Caedus. Rar determined that the information therein would be useless to Caedus and chose not to give the holocron to him. Following the end of the Battle of Kashyyyk, Rar returned to Vectivus' asteroid and began to practice the ancient Dark Lord's Force phantom technique."}, {"tag": "p", "text": "Awareness of Darth Vectivus' asteroid and Alema Rar's possession of it came into the knowledge of the Korriban Sith by way of one of their operatives, a female Sith Lord named Dician. While the mention of Vectivus' name by Dician garnered a considerable amount of scorn from those to whom she reported, the Force phantom power which he had commanded in life was well-known among them and remained uncontested. The Sith ultimately decided to destroy Vectivus' asteroid in an attempt to prevent the Jedi from discovering its significance. Vectivus' asteroid was soon assailed by the Interceptor-class frigate Poison Moon under Dician's command, which arrived at the same time as a team of Jedi and Galactic Alliance agents who had tracked Rar to that location. While Vectivus' Force phantom technique was used by Rar to combat the Alliance task force, the habitat was infiltrated by shuttled crews from the Poison Moon, who planted fission bombs in various locations as they prepared to destroy the asteroid. The bombs' ensuing detonation resulted in the complete obliteration of Vectivus' former home."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The administrator of Jonex Mine Eight Eleven B was a successful business man whose strict moral doctrines saw him rise to a position of power within the galactic mining operation. Skills learned from family, friends, and other acquaintances further assisted him in controlling the lives of tens of thousands of employees. He amassed an excessive fortune and used his resources to construct an opulent estate complete with statues of those who were influential in his life. Vectivus was fond of, among others, architectural styles originating from the planet Naboo, and he used materials from that world and others in the construction of the Home."}, {"tag": "p", "text": "The darkness of the mines under his residence influenced the administrator's interest in Sith lore and things of the dark side, eventually compelling him to seek out the Sith. Upon his own ascension to Dark Lord of the Sith, Darth Vectivus retained the principles and ethical standing of his previous existence. With that foundation he avoided the trappings of the Sith who preceded him; he was never motivated by galactic domination or an all-consuming hatred of the Jedi, and he instead chose to live the remainder of his days luxuriously in the company of his loved ones. However, Vectivus was still a ruthless individual, partly connected to his background as a businessman, and was willing to do whatever it took to succeed, a trait he promoted in others as well. Darth Vectivus valued his skills in business and money management, and recorded his various principles in his own holocron. However, these ideals held no value for the One Sith, nor Alema Rar."}, {"tag": "p", "text": "Upon revealing himself to Nelani Dinn, Darth Vectivus appeared as a tall, dark-haired man of considerable girth, who was loosely clad in garments that suggested he was just as muscular as he was obese. His phantom moved in a graceful manner and spoke in a smooth tone. He repeatedly tested the resolve of Dinn by attempting to force her to strike him down and looked upon her with derision when he finally realized that she lacked the necessary ruthlessness to sacrifice an innocent life in order to save many others. He pitied her weakness and advised her not to meddle in the circumstances of others for her own safety. Despite his ruthlessness, Darth Vectivus possessed a softer side, with regard to the young of animals. He opined that nearly every creature was visually appealing in their youth, particularly baby banthas. He did recognize, however, that such was not true of all species; indeed, Vectivus felt that Kowakian monkey-lizards were the most hideous-looking of all the galaxy's creatures."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "When he learned of the dark energy that resided in the mines of his asteroid, the administrator of Jonex Mine Eight Eleven B began to experiment with and learn various Force powers. As a Sith Lord, he mastered the ability to create phantoms fueled by the dark side of the Force, to such a degree that he could summon hundreds of them at will. His phantom power became something of legend and was coveted by many. Although the members of the One Sith regarded Vectivus with scorn, they recognized and respected the benefit of his Force phantom technique, so much so that they sought to possess its power source and opted to destroy his habitat rather than allow the possibility the Jedi might learn of its existence. After his death, he achieved the skill to become a Force ghost and retained his powers in said state. As a spirit, Vectivus was able to both change his shape at will and levitate above the ground. He also carried a red-bladed lightsaber, the silver hilt of which was decorated with polished black stones that were shaped like diamonds."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Vectivus was created by Aaron Allston for the first novel of the Star Wars: Legacy of the Force series, Legacy of the Force: Betrayal. He appeared as a spirit to Nelani Dinn and served as a platform for Lumiya to convince Jacen Solo to become Darth Caedus by showing him that not all Sith were necessarily evil. He was also mentioned many times later in the series and was pictured—despite the obstruction of his face—in The Complete Star Wars Encyclopedia. According to Leland Chee's blog, Darth Vectivus' name comes from the word \"invective,\" which has a number of definitions, including vehement or violent denunciation, censure, or reproach; a railing accusation; vituperation, an insulting or abusive word or expression, vituperative; denunciatory, or censoriously abusive."}, {"tag": "p", "text": "Several discrepancies concerning Darth Vectivus were uncovered upon the release of The Complete Star Wars Encyclopedia. First, the Encyclopedia states that Vectivus met Jacen Solo and told him that he was something akin to a Force spirit. Solo, however, never met Vectivus throughout the Legacy of the Force series or in any other Star Wars Legends story. The Complete Star Wars Encyclopedia also states that Lumiya met Vectivus' spirit at the Home millennia after his death, a contradiction with the phantom of Vectivus' claim to Nelani Dinn that he died centuries prior to their meeting within the mines under the Home. The final conflict rests with the discovery of Vectivus' holocron, which the Encyclopedia states to have been found by Alema Rar on Korriban. However, in Legacy of the Force: Inferno, the members of the One Sith already possess the holocron and give it to Rar, instead of the Twi'lek finding it on her own."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}