{"url": "Darth_Vich%27s_insurrection", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Great Galactic War", "Category:Civil wars"], "nodes": [{"tag": "h1", "text": "Darth Vich's insurrection"}, {"tag": "p", "text": "Shortly after the onset of the Great Galactic War between the Galactic Republic and the Sith Empire in 3681 BBY, an insurrection occurred within the Empire, spurred on by the designs of the ambitious Sith Lord Darth Vich. The insurrection was a domestic Imperial conflict that began when Vich led his newly acquired army of Force-sensitive Rattataki acolytes and warriors against the Empire's ruling Dark Council. Vich was killed during the attempt and his army was destroyed, with many of the Rattataki being executed or enslaved. The defeat allowed the Dark Council to continue its rule of the Empire and its war against the Republic."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Sith Empire was a totalitarian and xenophobic regime ruled by the reclusive Sith Emperor and run by the twelve Dark Lords of the executive Dark Council. In 3681 BBY, the Empire's rulers led their massive military force and legions of inferior Sith Lords into a war against the Galactic Republic that would last for twenty-eight years. This Great Galactic War began in the Tingel Arm of the Outer Rim Territories and saw many early victories for the Sith, in spite of the Emperor's reluctance to form alliances and the general Imperial proclivity to only trust Humans and their Pureblooded Sith contemporaries."}, {"tag": "p", "text": "Despite the early success, the Empire faced a threat from within in the form of the young and ambitious Sith Lord, Darth Vich. Around 3,681 BBY, Vich took note of the planet Rattatak in the Trilon sector. A new addition to the galactic community, the world's fierce and hardy Rattataki people had only recently begun to leave the perpetual wars of their homeworld to seek violent glory elsewhere. Vich, intending to seize power from the Dark Council, saw the Rattataki as his opportunity to topple the standing Imperial regime."}, {"tag": "h2", "text": "The insurrection"}, {"tag": "p", "text": "Disregarding a millennium of xenophobic Imperial tradition, the young Vich traveled to Rattatak and recruited hundreds of tribes of the aliens into his personal army by promising them glory in battle against the Republic in the Great Galactic War. Vich led them away from their world and identified dozens of them as Force-sensitive; while most of the aliens became dangerous and impressive warriors for his cause, Vich trained the Force-talented few in the dark side of the Force as acolytes and apprentices. Although his resources and ambition were both formidable, Vich's attempt at ascendency was quashed by the Dark Council. Forces under the control of the Dark Lords killed Vich during the insurrection, and the deceased Sith Lord's army was swiftly disbanded. Rumor later held that it was Vich's own Rattataki acolytes who betrayed him to the Dark Council, thus ensuring his downfall."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the insurrection, the Dark Council sentenced many of the Rattataki warriors to death and enslaved the others. The Council again turned its focus to the Great Galactic War, but the insurrection had nevertheless managed to attract the Empire's attention—the strongest of the enslaved Rattataki were soon taken out of the slave labor pools and thrust into lessons at the Sith academy on Korriban to complete the training that Darth Vich had begun. Others resisted the Empire's presence on their homeworld, either by fleeing Rattatak and joining fringe enterprises or by remaining on the planet to fight the occupiers and gain battle glory."}, {"tag": "p", "text": "The Great Galactic War dragged on for nearly three more decades and ultimately culminated in a Sith victory. During the Cold War that immediately followed the Great War, word of Vich's surviving Rattataki Sith acolytes persisted only as rumor. Although the Dark Council would continue to face infrequent challenges from upstart Sith Lords like Darth Vich, these secessionists, revolutionaries, and usurpers like Lord Tytonus and Darths Ikoral and Malgus were all foiled and killed, allowing the Council to continue its rule."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Vich's insurrection was introduced to Star Wars canon as background lore for the online role-playing video game Star Wars: The Old Republic. The event was first mentioned in the Rattataki entry on The Holonet, an online databank containing information about characters and events in The Old Republic. The entry was first posted in 2011 but was deprecated along with several others after the website's update prior to the game's December release later that year. Mention of the insurrection was included in The Old Republic's codex of in-game lore, as well as in Star Wars: The Old Republic Encyclopedia, which was released in October of 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}