{"url": "Darth_Wredd", "categories": ["Category:Legends articles", "Category:Darths", "Category:Humans", "Category:Impersonators", "Category:Males", "Category:Sith Lords of the One Sith"], "nodes": [{"tag": "h1", "text": "Darth Wredd"}, {"tag": "p", "text": "Darth Wredd was a male Human Sith who served the One Sith during the Second Imperial Civil War. The man who became Darth Wredd had once been a good-natured Force-sensitive warrior from the remote, primitive planet Mala. Towards the end of the Second Imperial Civil War, the One Sith had tested a bioweapon which destroyed all life on his homeworld. However, the Sith spared the warrior's life and he was apprenticed to a Sith Lord, who stripped him of his identity and forced him to wear a helmet which enhanced his dark-side powers. Embracing the dark side, Darth Wredd developed a homicidal hatred towards the Sith and sought to bring about their downfall. Following the death of Darth Krayt, which ended his Galactic Empire, Darth Wredd and his master went underground as part of the Sith strategy of infiltrating governments and corporations across the galaxy to restore their \"golden age.\""}, {"tag": "p", "text": "In 138 ABY, Darth Wredd found an opportunity to move against the One Sith during the Carreras Incident. After trapping an Imperial Knight named Yalta Val in the Surd Nebula, Darth Wredd killed his master and stole Master's Val's identity and armor. He then took control of the Carreras G51 communications array and used it to announce his presence to the wider galaxy. Wredd also attempted to kill Master Val before a live galactic audience but was thwarted by Ania Solo, a local junk dealer who was a descendant of the smuggler Han Solo. Despite failing to kill Master Val, Darth Wredd managed to escape the Carreras system in a getaway transport and initiated an insurgency against the One Sith. Darth Wredd began hunting down and killing Sith infiltrators across the galaxy. The rogue Sith was motivated by a desire for vengeance against those who had destroyed his homeworld and also wanted to establish a new Sith Order based on the Rule of Two."}, {"tag": "p", "text": "Following the Carreras Incident, the Imperial Knight Jao Assam experienced a Force vision of Darth Wredd attacking Empress Marasiah Fel, the daughter of Roan Fel and one of three triumvirs of the new Galactic Triumvirate. Jao and his new ally Ania Solo embarked on a quest to hunt down the rogue Sith. Darth Wredd planted a series of false clues which led Jao and Ania to the Calamari system, where another Sith named Darth Luft had established a slaving operation using Mon Calamari and Quarren refugees. Despite liberating the enslaved refugees and killing Darth Luft, Jao and Ania quickly learned from Darth Wredd himself that they had merely helped him to advance his goal of destroying the One Sith. Sensing Jao's potential, Darth Wredd attempted to tempt the Knight with an offer of becoming his apprentice in a reconstituted Sith Order."}, {"tag": "p", "text": "Later, Jao Assam returned to the galactic capital Coruscant to clear Ania's name when she was framed for the murder of the Imperial Knight Teemen Alton. Despite his role in securing Ania's exoneration, Jao was imprisoned for deserting the Imperial Knights, a crime which carried the death penalty. Exploiting Jao's predicament, Darth Wredd visited Jao in prison and offered to help him escape. Jao accepted the offer, not because he wanted to give himself over to the dark side, but instead because he wanted to foil whatever plot Darth Wredd was hatching against the Empress. However, Darth Wredd quickly deduced that Jao was still loyal to the Empress and tricked him into luring the Imperial Knights and the One Sith onto Mala, where he intended to exact his revenge against the One Sith for the wrongs they had inflicted on his homeworld. Darth Wredd's plan worked, and Mala became the site of a climactic battle between the Imperial Knights and the One Sith."}, {"tag": "p", "text": "Having succeeded with his goal of destroying the One Sith, Darth Wredd came to believe that he had delved too far into the dark side to be redeemed. Realizing that he was the only Sith left, he launched a suicidal attack on Empress Fel, nearly succeeding in killing her. However, he was thwarted by Jao Assam who attacked him with his lightsaber and succeeded in slicing off both his hands. In an attempt to draw Jao to the dark side, Darth Wredd tried to goad the Imperial Knight into killing him. However, Jao saw through his trick and refused to strike him down in anger. Ultimately, Darth Wredd was killed by Ania Solo, bringing an apparent end to the Sith presence in the galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Beginnings"}, {"tag": "p", "text": "Darth Wredd started out as a simple and humble man who lived over a century after the Galactic Civil War on the planet of Mala. Due to his Force powers, he developed a reputation among his friends for never missing a target while hunting with an arrow. While he was baffled initially by his unusual skill, he came to realize that he was actually Force-sensitive. He wanted to join the New Jedi Order. But by that time, the Jedi had been driven underground following the Massacre at Ossus and scattered across the galaxy. Not long after that, a horde of barbarians known as the Schor-Goya had launched a campaign of raiding, plundering and killing on the various towns and villages in the area. The man resolved to do what a Jedi would and came to the defense of his people. While he was unable to create a lightsaber, he was able to forge a sword, which he used to defeat the Schor-Goya when they attempted to attack his village. Eventually, he married and had a child. While he was unable to join the Jedi, he still sought to follow their ways and became widely known as the protector of his people."}, {"tag": "h3", "text": "Sith apprenticeship"}, {"tag": "p", "text": "Due to his combat prowess and reputation, the man who became Darth Wredd did not anticipate a threat that he could not handle. During the last years of the Second Imperial Civil War, the One Sith and their Galactic Empire invaded his homeworld. He tried to defend his people but was no match for the Sith. The Sith Lord who commanded the Imperial invasion disarmed him by destroying his sword with his lightsaber. Instead of killing him, the Sith Lord recognized the man's Force potential and decided to make him his apprentice. He started out by forcing the man to watch from his flagship as he took the opportunity to test a new Sith weapon designed by Vul Isen which devastated his homeworld and wiped out the population, leaving him as the only survivor. The planet was knocked off its orbit, becoming a rogue planet which wandered the galaxy. Afterwards, the Lord forced him to wear a mask all the time to ensure his obedience, temper his weakness, and to teach him hatred. Wredd was also stripped of his identity and was forced to adopt the persona of Darth Wredd. While his master's training technique succeeded in bringing him to the dark side, Darth Wredd developed an abiding homicidal hatred of his master and vowed to kill him when the opportunity arose. Darth Wredd spent his apprenticeship traveling on his master's starship."}, {"tag": "h3", "text": "Ambush in the Surd Nebula"}, {"tag": "p", "text": "In 138 ABY, an opportunity to kill his master presented itself when a Galactic Federation Triumvirate starship under the command of the Imperial Knight Yalta Val entered the Surd Nebula. Following the end of the Second Imperial Civil War, the One Sith had been forced underground and a Triumvirate consisting of the Fel Empire, Jedi Order, and the Galactic Alliance Remnant had assumed power over Coruscant, the galactic capital. The new Galactic Empress Marasiah Fel had commissioned the establishment of a galactic-wide G51 communications array system, to improve communications between the Outer Rim Territories and the rest of the galaxy. Yalta Val had been assigned to supervise work on the Carreras G51 communications array in the remote Carreras system."}, {"tag": "p", "text": "Knowing that his Sith Master was aggressive but easily manipulated, Wredd convinced his master to open fire on Yalta Val's ship, causing the vessel to crash-land on the rogue planet of Mala. Along with his master, Wredd ambushed Yalta Val and killed his stormtrooper escorts. Wredd's master also used the Force to push Val's ship down a cliff, killing the crew. After a brief lightsaber duel, Wredd's master overpowered Yalta. Before his master could deliver the killing blow, Darth Wredd killed his master in order to end his apprenticeship, and his ties to the One Sith. He then imprisoned the Imperial Knight on the planet, and took his armor and identity in order to impersonate him. He placed a Nalydian criminal named Dieben in charge of guarding and feeding Master Val while he was away."}, {"tag": "h3", "text": "The Sith impostor"}, {"tag": "p", "text": "Under the disguise of Yalta Val, Darth Wredd commandeered the Imperial Knight's ship's escape pod and waited to be rescued in the Surd Nebula for a week. Wredd's escape pod was picked up by Governor Biala's patrol units, and he was brought to the Carreras communications array. The false \"Yalta Val\" then met with Governor Biala and told her that there was a Sith presence in the system and that the Sith had attacked his ship and murdered his entire crew. He claimed that he had lost his lightsaber during the battle. Without calling the Triumvirate for reinforcements, he decided to put an end to the threat by himself. When Biala suggested contacting Coruscant and the Jedi for reinforcements, he claimed that there was no time to call for reinforcements and threatened to investigate corruption on the Shifala homeworld of Carreras Major."}, {"tag": "p", "text": "Darth Wredd also demanded that Governor Biala give him personal control of all her security forces since he claimed that he was the only one equipped to deal with the Sith threat. Having settled into the governor's palace in Carreras' capital city, Wredd contacted his prisoner via a hologram and presented him with the option of either surrendering to the dark side and becoming his ally, or waiting indefinitely as a prisoner of the mask. Shortly thereafter, Biala and Wredd received word of a skirmish between the Carreras security forces and two individuals who were trying to sell a lightsaber to a dealer. These two hoodlums turned out to be the junk dealer Ania Solo and the Mon Calamari engineer Sauk, refugees fleeing the Second Imperial Civil War who had ended up in the Carreras system."}, {"tag": "p", "text": "Enlisting the help of Biala's security forces, the Sith Lord traveled to Solo's junkyard on Carreras Minor's moon to retrieve the lightsaber. Upon arriving, he had an argument with Ania Solo, who refused to give away the weapon without compensation, and sent SD against him. Wredd then used telekinesis to grab the lightsaber and sliced the droid in half. Then he left, leaving only one order to his men: to kill the Solo girl and Sauk. However, all of them were killed by AG-37, allowing Ania and her associates to escape into space. Once he had returned to Biala's palace, Darth Wredd gave the order to the security forces to prevent any departure or arrival into the Carreras system until the array was completed. The governor was upset by this act but reluctantly allowed Darth Wredd to do things the way he wanted after he emphasized that he was acting under the authority of the new Galactic Triumvirate."}, {"tag": "p", "text": "The disappearance of Yalta Val and the subsequent events in the Carreras system led to delays in the installation of the communications array in Carreras. In response, his friend and fellow Imperial Knight Jao Assam traveled to the system to investigate. Upon arriving, the Carreras security forces, under Darth Wredd's command, attempted to arrest him, but he escaped and landed on Carreras Major, a barren desert world. By that stage, the Carreras security forces had caught up with Ania's ship, but Ania and her associates managed to evade their pursuers and land on Carreras Major. There, Ania's ship was attacked by a giant tentacled monster. During the skirmish, Jao came to the aid of Ania and her associates, and they escaped the monster. After Val's Imperial communications droid played a holo-recording of Yalta Val fighting Wredd's Sith master, Jao, Ania, and her associates quickly realized that Yalta Val had been replaced by an impostor. They decided to trace back the coordinates where the recording was made and rescue Yalta Val."}, {"tag": "h3", "text": "Unexpected obstacles"}, {"tag": "p", "text": "Meanwhile, Darth Wredd, still disguised as Yalta Val, supervised the work on the Carreras communications array. While Governor Biala's engineers were still working on the field generators, Wredd was growing impatient with the delays on the communications array. Following a failed attempt to engage the station's primary power systems, an enraged Darth Wredd choked a Shifala engineer, hurting the man's neck. The \"false\" Yalta Val's erratic behavior disturbed Governor Biala but she was still unwilling to move against the Imperial Knight. Instead, Biala decided to wait until after the operational launch of the Carreras communications array to lodge a formal complaint with the Triumvirate. Meanwhile, Ania's ship was intercepted and captured by a Carreras warship. There, the ship's crew were disarmed and imprisoned in the ships holding cells, pending shipment to the communications array station."}, {"tag": "p", "text": "Upon learning of the capture of Ania's associates and Jao Assam, Darth Wredd ordered the Biala's security forces to bring the Imperial Knight to the station and ordered the immediate execution of Ania and her associates. When Governor Biala objected to executing the prisoners without a trial, Wredd demanded that she put her trust in him. In response, Biala angrily retorted that the Triumvirate had done nothing but create further expense for her people. Using her position, Biala then attempted to retake control of the Carreras communications array project. In retaliation, Wredd Force-choked her and threatened to kill her if she did not cooperate with him."}, {"tag": "p", "text": "Later, Darth Wredd met with the captive Jao Assam, who was held within a stasis field. Upon meeting the Sith impostor, Assam demanded to know who he was and what he had done with Master Val. After taunting his captive, Darth Wredd briefly talked about his Sith apprenticeship with his prisoner; describing his late master as a fool and a thug. He admitted that he had kept the real Yalta Val prisoner within his mask with the hope of turning him to the dark side. When Assam retorted that Wredd would not succeed him, Wredd made vague references to Val merely being a puzzle piece in his plan. When Assam asked the Sith why he had chosen to target the Carreras system, Wredd retorted by asking his prisoner why the Triumvirate had chosen to install a communications array in that system. He deduced that the Triumvirate was weak and was doomed to fall."}, {"tag": "p", "text": "Jao Assam refused to listen to Darth Wredd's remarks and asserted that the Imperial Knights brought peace to the galaxy. Wredd then commented that the Triumvirate's policy of working on construction projects instead of hunting down the Sith made the galaxy more \"peaceful\" for the Sith. In an attempt to undermine Assam's faith that he was on the right side, he revealed that the One Sith were still out there in the galaxy infiltrating remote systems and consolidating power. When Assam asked Wredd why he was acting differently from the other Sith, Wredd argued that he was following a different path from the One Sith because he believed that there should only be two Sith: a master and an apprentice."}, {"tag": "p", "text": "Unknown to Darth Wredd and Assam, their conversation was being monitored via hologram by Governor Biala, who had grown suspicious that Wredd actually a Sith masquerading as an Imperial Knight. With her suspicions finally confirmed, Biala freed Assam from his restraints and returned his lightsaber to him. In exchange for releasing Ania and her associates, Biala instructed Assam to get rid of the Sith impostor. After reuniting with Ania and her associates, Assam went to the communication array's hangar bay to confront Darth Wredd, who was still donning Val's Imperial Knight armor, and was about to leave on a shuttle. By that stage, the communications array was drifting towards Val's base on the dark world of Mala. While Assam had planned to silently follow the Sith and discover his base, Ania decided to blow up his ship while he was taking off."}, {"tag": "p", "text": "Ania fired her blaster at the shuttle's engine, destroying the starship. However, Darth Wredd leapt out of the burning shuttle and used the Force to hurl Ania against the hangar bay's wall. Jao Assam, backed by Sauk and AG-37, then attacked the Sith with their lightsaber and blasters. However, Darth Wredd used the Force to hurl his opponents away and sliced AG-37 in half. While exchanging lightsaber blows with Assam, Wredd taunted and goaded his opponent to do better. Assam then succeeded in blinding Wredd's right eye with his lightsaber. Despite his injuries, Darth Wredd was still strong enough to use the Force to hurl two pieces of shrapnel through Assam's armor, impaling the younger Knight. Wredd then escaped the station in another shuttle. The seriously wounded Assam was caught up in the subsequent drift generated by the shuttle's departure and floated in the space above Mala."}, {"tag": "h3", "text": "Great Ambitions"}, {"tag": "p", "text": "After escaping from the Carreras communications array, Darth Wredd returned to his secret base on Mala. After attending to his eye injury, Wredd changed into a black suit of armor, reminiscent of the long dead Sith Lord Darth Vader's armor, which featured a mask that hid his blinded right eye. He then ordered Dieben to remove the captive Yalta Val's mask. While Val was relieved that he was freed from the excruciating helmet, Wredd reminded his prisoner that he did not have long to live and bound him to a chair. Wredd then brought two communications droids to broadcast a live holo-recording showing himself and his prisoner. This broadcast was witnessed by many individuals across the galaxy including Governor Biala, Empress Marasiah Fel, several Ithorians and a large crowd of people on Carreras Major's capital city."}, {"tag": "p", "text": "Wredd was able to used the Carreras communications array to broadcast his message and had deliberately moved the array towards Mala's orbit. During his broadcast, Wredd mocked his galactic audience for falling into a false state of safety following the defeat of the One Sith. He claimed that the Federation Triumvirate was weak; citing that the Empress had no real power, the Jedi were a former shadow of their former power, and the weakness of the Galactic Alliance Navy. To display the \"impotence\" of the Triumvirate and emphasize his point that the galaxy's inhabitants were unsafe, Darth Wredd announced his identity and revealed his Imperial Knight prisoner, whom he intended to kill during the live-broadcast."}, {"tag": "p", "text": "Before Darth Wredd could carry out his execution, he was attacked by Ania Solo, who fired several blaster bolts at him. However, Wredd used the Force to command pieces of cables to rise up and encircle Ania, trapping the junk dealer. Wredd then attempted to continue his speech and claimed that no power in the galaxy could oppose him. However, Ania had brought Jao Assam's lightsaber in her boot; which the captive Val noticed. Darth Wredd then kicked Val's chair onto the floor and attempted to kill him with his own Sith lightsaber. However, Yalta Val used the Force to levitate Assam's lightsaber towards himself and managed to free himself. Yalta Val then fought back against his Sith captor."}, {"tag": "p", "text": "Meanwhile, Ania returned to the communications array to evacuate her wounded associates. By that time, the communications array was on a collision course with Mala and Governor Biala had ordered a general evacuation of the station. Back on Mala, the two men then exchanged lightsaber blows. During the duel, Darth Wredd taunted his opponent that he had already won because he had succeeded in destroying the Carreras communications array. As the station prepared to collide with the dark planet, Wredd used the Force to hurl rocks at the Imperial Knight, in an attempt to disorientate him. Eventually, Yalta Val gained the upper hand and destroyed Wredd's lightsaber. Before he could defeat the Sith, Wredd escaped on a starship, leaving Val behind, and fleeing for parts unknown. However, Val was rescued by Ania and her associates, who had also managed to rescue the grievously wounded Jao Assam, who subsequently recovered from his wounds due to quick medical intervention."}, {"tag": "h3", "text": "Hunting the Sith"}, {"tag": "p", "text": "After his failure on Carreras, Wredd started to set in motion the next part of his plan: the destruction of the One Sith. He traveled to Cadomai Prime where he tracked an undercover Sith Lord who was working his way towards a position of importance in the Snivvian government by helping to negotiate the development of a new trade route. This was in response to the devastation of the Calamari system and the rise in criminal activity in the area. After an unsuccessful conference with Gran representatives, the Snivvian was attacked by Wredd. Wredd managed to block his Force lightning with his blade but was thrown out of the room by a kick. The two then tackled one another over a ledge where Wredd managed to remove part of the Sith's fur, revealing his Sith tattoos. The Snivvian berated Wredd for jeopardizing their plans of infiltration and denounced him as a false Sith. However, before he could kill him, Wredd impaled him with his lightsaber and threw his body over the ledge where it was found by his fellow politicians and his identity as a Sith was uncovered."}, {"tag": "p", "text": "Later, the Imperial Knight Jao Assam received a Force vision while recovering in a bacta tank. In that vision, Assam saw Darth Wredd attacking Empress Fel with a lightsaber. Assam discussed his vision with his mentor Yalta Val but the latter merely dismissed it as a dream and urged the younger Imperial Knight to follow his orders to report to Coruscant for duty. Undeterred, Assam shared his concerns about the threat posed by Darth Wredd with his new-found friend Ania Solo. They embarked on a mission to stop Darth Wredd which took them to the planet Nalyd. There, Wredd's minion Dieben was facing execution for various felonies he had committed. While on Nalyd, Jao and Ania obtained information that Dieben had planned to rendezvous with his master at Dac, a poisoned ocean planet which had been the homeworld of the Mon Calamari, Quarren, and Whaladon species."}, {"tag": "p", "text": "Unknown to the Imperial Knight and the junk dealer, Wredd had intended to use them to eliminate the local Sith there, Darth Luft, who had colluded with a pirate syndicate to build a fleet of starships in the now abandoned Mon Calamari Shipyards. Darth Luft had also tricked a large number of Mon Calamari and Quarren refugees into returning to Dac under the pretext of renewing the poisoned planet. There, they were enslaved and forced to assist the pirates in building ships. To ensure their compliance, their children and elderly folks were held hostage. Jao subsequently informed the Galactic Federation Triumvirate of the pirate presence in the Dac, and the Triumvirate dispatched a fleet to eliminate the pirates and liberate the prisoners. During the fighting, Jao personally killed Darth Luft following a protracted duel in the flooded space ring. While Jao and Ania succeeded in eliminating Luft and liberating many slaves, they inadvertently played into Wredd's hands by eliminating a member of the One Sith."}, {"tag": "p", "text": "Following the events in the Dac system, Darth Wredd sent a holo transmission to Jao Assam, congratulating the Imperial Knight for following his trail and eliminating Darth Luft. As a result, Wredd's plan was now several steps closer to completion. He expressed his desire to thank Jao in person and offered him a place in his newly reconstituted Sith Order, which would consist of one Master and an Apprentice. While Assam lamented about having inadvertently played into the rogue Sith's hands, Ania urged the Imperial Knight to remember that they had succeeded in liberating and saving the lives of many Mon Calamari and Quarren slaves in the space ring above Dac. She argued that their successful experience on Dac meant that they were able to eliminate an \"arrogant\" Sith."}, {"tag": "h3", "text": "Recruiting an apprentice"}, {"tag": "p", "text": "Wredd later traveled to the galactic capital of Coruscant where he infiltrated the Imperial Knights' dungeons. There, he made contact with Jao Assam, who had been condemned to death for desertion. Earlier, Jao Assam, AG-37, and Sauk had been embroiled in a grueling quest to rescued Ania Solo, who had been kidnapped by bounty hunters and was falsely accused of murdering the Imperial Knight Teemen Alton. While Ania was apprehended by Imperial stormtroopers and brought to Coruscant to face a tribunal for her alleged crimes, Yalta Val and Jao Assam succeeded in clearing Ania's name by presenting evidence that the real killer had been an ex-prison guard from Drash-so, a planet where Ania had been imprisoned in an Imperial labor camp. Assam pointed out that the Imperial Knight's true murderer had an artificial hand and that Ania's hands were both biological. As a result, Ania was acquitted by the tribunal. However, Assam was imprisoned for deserting the Imperial Knights in order to pursue Darth Wredd."}, {"tag": "p", "text": "Darth Wredd sensed Jao's despondency at being unfairly treated by those closest to him, namely his former mentor Val. Leaning into Jao's cell, Wredd presented the Imperial Knight with a Sith lightsaber, offering him a way out of his predicament. While still maintaining his allegiance to Empress Fel, Jao accepted Wredd's offer. Together, the two men escaped the Imperial prison in Coruscant, killed several stormtroopers, and stole a starship. Once aboard, Darth Wredd imprisoned his prospective apprentice in a cell. He then related to Jao the story of how he had used his Force-sensitive powers in the past to become the champion of his people on Mala. Wredd then talked about the destruction of his homeworld at the hands of the One Sith and his harsh apprenticeship under his late Sith Master. Wredd had used Yalta Val's visit to the Carreras system as an opportunity to kill his Sith Master and to seek vengeance against the One Sith. Due to the long-standing animosity between the Sith and the Imperial Knights, Jao initially refused to believe Wredd's story."}, {"tag": "p", "text": "In response, Darth Wredd presented Jao Assam with the shattered hilt of his sword, confirming the authenticity of his account. He then told Jao to choose between joining his new Sith Order or staying imprisoned. Later, Jao used his Force powers to free himself from his cell, by jamming the shattered hilt into the control panel. Jao made his way to the cockpit of Wredd's starship, where he managed to transmit the ship's coordinates to Ania Solo and her companions, who had been sent by Empress Fel on a top-secret mission to rescue Jao. However, Jao Assam had been unknowingly playing into the hands of Darth Wredd. Wredd had flown the starship to Mala, the rogue planet that had started his insurgency against the One Sith. At the opportune moment, Wredd emerged to inform Jao that they were on Mala. Darth Wredd' plan had been to lure the Imperials into a trap on Mala."}, {"tag": "h3", "text": "Battle of the Floating World"}, {"tag": "p", "text": "As planned, Ania Solo and her companions followed Jao Assam's coordinates which led them to Mala. Ania and her companions were escorted by a squad of Trandoshan stormtroopers. Despite Ania's strict orders that her stormtroopers send no outgoing transmissions, one of the stormtroopers, Blue Two, had been ordered by Empress Fel to transmit Ania's coordinates as soon as they had landed at their destination. Unknown to Ania, Fel and her Imperial Knight had planned to track down and eliminate Darth Wredd. Unknown to both Ania and the Imperials, Darth Wredd had already anticipated this development and had planned to lure the Imperials into his trap. However, Wredd was not aware that undercover One Sith operatives on Coruscant had noticed their \"public\" escape from the Imperial prison and had informed their comrades. Seeking to crush Wredd's insurgency so that they could continue with their policy of infiltrating galactic governments and commerce, the One Sith mustered a fleet of civilian starships and traveled to Mala."}, {"tag": "p", "text": "After landing on Mala, Darth Wredd imprisoned Jao in an underground cave; using Force restraints to suspend the captive Imperial Knight. Darth Wredd then disappeared into hiding, relishing the opportune moment to spring his trap on the unsuspecting Imperials. As planned, Ania and her stormtroopers freed the captive Jao. However, the One Sith arrived short later and converged on Ania, her companions, and the stormtroopers. The One Sith were led by the Twi'lek diplomat Fanoste, who had secreted himself into a strategic position. Believing that Ania and the Imperials were harboring the fugitive Wredd, Fanoste demanded that they hand him over. The One Sith then launched a frontal attack on the stormtroopers and Ania's company, who responded by firing on the Sith. At that moment, Wredd reappeared and personally slew Fanoste. He then handed a Sith lightsaber to Jao, and the two Force-users then fought back against the One Sith."}, {"tag": "p", "text": "Outnumbered, Wredd and the Imperials were forced to retreat. While AG-37 favored finding a defensive position and Ania preferred to slow them down, Wredd decided to use the Force to push part of the wrecked Carreras communications array onto the advancing Sith horde. Since he was unable to accomplish this feat alone, he convinced Jao to help him by convincing him that it would save his friends from the Sith. Jao reluctantly agreed and the two Force-users used their combined Force powers to push part of the wrecked communications array on to the One Sith, crushing and killing many. Wredd and Jao's actions succeeded in temporarily slowing the Sith advance and enabled Ania's companions and the Imperials to entrench themselves within the wreckage of the communication array. After rejoining Ania and the Imperials, Darth Wredd clarified to them that the One Sith were after him."}, {"tag": "p", "text": "During a conversation with Jao, Darth Wredd conceded that his capture of Jao had attracted the attention of the One Sith. He confirmed recent reports that the One Sith had been infiltrating all areas of galactic government and commerce with the goal of restoring their \"day of glory.\" Darth Wredd attempted to win Jao over by emphasizing that he had been killing these Sith infiltrators alone while the Galactic Triumvirate was doing nothing. Wredd rationalized that these actions had made him a target of the One Sith. Jao still refused to trust Wredd and claimed that the latter wanted to be the only Sith in the galaxy, alluding to his recent galactic broadcast. Wredd responded that his \"one Sith\" vision had only been a cover for his plans to restore the Rule of Two; implying that he wanted Jao to become his Sith apprentice. In response, Jao ignited his lightsaber. He refused to join Wredd's Sith order, emphasizing that his cooperation with Wredd was only a temporary alliance and that his true loyalty lay with the Empress."}, {"tag": "p", "text": "Sensing Jao's anger and hatred, Wredd retorted by questioning the Imperial Knight whether he was sure that he had not already done so. Realizing his mistake, Jao withdrew his lightsaber and told Wredd that he would not be manipulated by the Sith. Ania interceded between Wredd and the Imperial Knight, urging the latter to say focused if they wanted to get out in \"one piece.\" At that point, several Sith managed to breach Ania and the Imperials' defense perimeter. Despite dogged resistance, Ania's company and Wredd were quickly outnumbered by their attackers. However, the fighting was interrupted by the arrival of an Imperial Navy force, led by Empress Fel herself. The Imperial reinforcements demanded that the One Sith lay down their arms, which they refused. A task force of Imperial Knights then landed on Mala to assault the One Sith."}, {"tag": "h3", "text": "Final stand on Mala"}, {"tag": "p", "text": "During the second stage of the battle, Darth Wredd fought and killed many One Sith combatants. He was motivated by a desire to avenge the genocide of his people at the hands of the One Sith. While the Imperial Knights did not trust him, they did not hinder Wredd because he was helping them destroy the One Sith movement. Despite encountering fierce resistance, the Imperial Knights eventually gained the upper hand over the One Sith and killed all of their opponents. Towards the end of the battle, the Imperial Knights began evacuating their wounded and fallen comrades on the shuttle Neuer."}, {"tag": "p", "text": "While Empress Marasiah Fel was attending to the wounded Knight Antares Draco, Wredd snuck up behind her and stabbed the Empress through the chest with his lightsaber. Jao Assam intervened in time to stop Wredd from finishing his work and pursued Wredd to the edge of a cliff. During the duel, Jao gave in to his anger and succeeded in slicing both of Wredd's hands off. As a final trick up his sleeve, Wredd had intended to bring Jao to the dark side and attempted to goad the Imperial Knight into striking him down in anger, thus completing his journey to the dark side. However, Jao realized Wredd's plan and refused to kill him."}, {"tag": "p", "text": "Rejecting Jao's mercy, Wredd insisted that Jao must destroy the Sith for the sake of the galaxy and the memory of his family. Wredd's wish was granted when he was shot in the chest by Ania Solo and fell off the precipice to his death. Due to immediate medical intervention, Empress Fel survived Wredd's assassination attempt. Following the fighting, Jao reflected that Wredd had purposely lured the Sith to Mala to see them destroyed on his homeworld for what they did to him. In the end, he wanted to die, believing he was too far gone to be redeemed, but Jao speculated that Wredd had intended to make an apprentice out of him. Wredd's death, along with the deaths of the One Sith forces on Mala, marked the apparent destruction of the Sith Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Darth Wredd was a tall, well-built man with white hair. While he normally had grey eyes, Wredd's eyes turned a luminous, sulfuric yellow when he was employing his dark-side powers. Prior to his Sith apprenticeship, the man who became Darth Wredd had been a Force-sensitive warrior who was committed to the well-being of his people on the primitive planet Mala. This man placed the well-being of his people above himself and sought to emulate the Jedi. Despite his combat prowess and renown, this man did not covet any praise or gifts from his people. He was a good husband and father who was committed to protecting his family. However, the man who became Darth Wredd underestimated the Sith and was beaten by them in combat. As a captive of the Sith, he was forced to watch the destruction of his entire homeworld and family at the hands of a Sith bioweapon. He never fully recovered from the loss of everything he held dear and subsequently gave himself over to the dark side and hatred."}, {"tag": "p", "text": "Darth Wredd was then apprenticed to the same Sith Lord that had beaten him in combat. During his Sith apprenticeship, Wredd was forced to wear an uncomfortable helmet which was designed to temper his weakness, teach him hatred, and to ensure his full commitment to the dark side. The helmet succeeded in these objectives but fueled his hatred and ambitions which ultimately drove Wredd to murder his master and to embark on a ruthless insurgency against the One Sith when the opportunity came. As a result of his Sith apprenticeship, Darth Wredd's personality underwent a radical and irreversible transformation. While he had formerly looked out for the welfare of others, Darth Wredd now treated other sentient beings with contempt and disdain. While posing as the Imperial Knight Yalta Val, Wredd used his dark-side powers and vicious personality to intimidate other sentient beings. On one occasion, Wredd even strangled a Shifala communications officer following delays with the construction of the Carreras G51 communications array."}, {"tag": "p", "text": "Darth Wredd's hatred towards the One Sith for destroying his family and homeworld led him to embark on a campaign to kill all of the other One Sith infiltrators who had secreted themselves into key governmental positions across the galaxy. In combat, he displayed little mercy and was capable of killing without hesitation. Wredd had given himself over to the dark side to the extent that he was willing to kill the captive Imperial Knight Yalta Val for the sole purpose of demonstrating the impotence of the Galactic Federation Triumvirate, the new galactic government. As with many other Sith, Wredd exhibited megalomaniac ambitions of wanting to rule the galaxy and to overthrow the established galactic order. Wredd's plan for galactic domination was to destroy the One Sith and to create a new Sith order based on the Rule of Two, which had been first instituted by Darth Bane more than a thousand and one hundred years ago."}, {"tag": "p", "text": "Darth Wredd was willing to manipulate other sentient beings into advancing his goals. He manipulated the Imperial Knight Jao Assam into killing Darth Luft, thus fulfilling his agenda of destroying the One Sith and creating a new Sith order based on the Rule of Two. Despite his malevolent tendencies, Wredd was still capable of helping other people if it benefited him. On one occasion, he and Jao Assam joined forces to save Jao's companions from the Sith by pushing a large piece of space-Station wreckage into the path of a rampaging One Sith host. Despite saving Ania and her companions, this action helped save him from the advancing One Sith horde, who were out to kill him. Wredd was also able to recognize potential and talent in other sentient beings. On one occasion, he was sufficiently impressed by Jao Assam's actions during the liberation of the Mon Calamari Shipyards to offer him a place in his reconstituted Sith Order. Ultimately, Jao rejected this offer due to his loyalty to the light side of the Force and Empress Marasiah Fel."}, {"tag": "p", "text": "While Darth Wredd ultimately fulfilled one of his goals of avenging the destruction of his family and homeworld by destroying the entire One Sith order, he had delved too deeply into the dark side to be redeemed. Upon realizing that he was the only Sith left, he launched a suicide attack on Empress Fel with the intention of provoking a fight with Jao Assam that would lead to his death. Darth Wredd had also intended to goad the young Imperial Knight into striking him down in anger, thus completing Jao's journey to the dark side and creating a new Sith. However, Jao saw through Darth Wredd's trick and refused to kill Darth Wredd, and Ania Solo carried out the deed."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "In his youth, Darth Wredd had developed a reputation as a skilled sniper and a fearsome swordsman. His hunting and sword-fighting skills were greatly augmented by his Force-sensitivity. Prior to his Sith apprenticeship, this man modeled his life and values after the Jedi Order, which had been driven underground following the Massacre at Ossus. While Darth Wredd's powers were not diminished during his Sith apprenticeship, he came to draw on the dark side of the Force as his main source of power and strength. As with many other Sith, Darth Wredd wielded a red-bladed Sith lightsaber. Darth Wredd was skilled with telekinesis as shown when he snagged Yalta Val's lightsaber from Ania Solo's grip."}, {"tag": "p", "text": "In addition, Darth Wredd could use telekinesis to choke his victims, such as when he choked Governor Biala, an unidentified Shifala communications officer, and Ania Solo. Wredd was also a frequent user of Force throw, which he used to impale Jao Assam, entangle Ania Solo with wires, and during his duel with Yalta Val. Darth Wredd also had a keen Force sense as shown when he sensed the presence of Ania Solo during his galactic broadcast. The Sith Lord appeared to be proficient in the use of Force-enhanced movements, such as when he blinded one of his eyes."}, {"tag": "p", "text": "Darth Wredd was also skilled in using stealth to ambush his opponents as shown when he stalked a Snivvian Sith infiltrator on Cadomai Prime and Empress Marasiah Fel. Due to his exposure to the One Sith, Darth Wredd knew how to pilot a starship. He was also tech-savvy enough to manipulate communications technologies like communications arrays. Darth Wredd also once worked with a nominal opponent, the Imperial Knight Jao Assam, to use the Force to throw a large piece of space-station wreckage on an advancing horde of One Sith acolytes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Wredd appeared as the main antagonist of Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2 comic series, a spinoff of Dark Horse Comics' popular Star Wars: Legacy comic series. He was first named \"Darth Wredd\" in the comic's fifth issue, Legacy 5. He was designed by Jimmy Presler, drawn by Gabriel Hardman, and colored by Jordan Boyd."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}