{"url": "Darth_Wredd%27s_insurgency", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Conflicts involving the One Sith", "Category:Conflicts of the Aparo sector"], "nodes": [{"tag": "h1", "text": "Darth Wredd's insurgency"}, {"tag": "p", "text": "In the year 138 ABY, the renegade Sith known as Darth Wredd initiated an insurgency against both the One Sith and the Galactic Federation Triumvirate. The One Sith were in hiding and secretly infiltrating planetary governments throughout the galaxy, but Wredd, laying low on the planet Mala in the Surd Nebula, killed his master and captured Yalta Val, an Imperial Knight of the Galactic Federation Triumvirate. He then began supervising the construction of the Carreras G51 communications array while posing as Val."}, {"tag": "p", "text": "A hydrospanner was thrown into the works when the junk dealer Ania Solo discovered Val's lightsaber inside of an Imperial communications droid. The Carreras Incident—Wredd's attempt to retrieve the weapon, first through attacking Solo at her junkyard and later by setting up a blockade of the Carreras system—finally saw Solo and her companions captured by a Shifalan patrol ship and imprisoned aboard the communications array. When the Shifalan governor Biala realized that Wredd was in fact a Sith, she released the prisoners, who attacked Wredd in one of the array's hangars."}, {"tag": "p", "text": "Wredd gravely injured Solo's companions: the engineer Sauk, the droid AG-37, and the Imperial Knight Jao Assam, who had come to the system to find the missing Val. The relatively unscathed Solo commandeered Jao's starfighter and followed the departing Wredd to the surface of Mala, where Wredd was using the communications array to broadcast a declaration of his insurgency across the galaxy. Solo helped Val escape, and as he dueled Wredd with his recovered lightsaber, Solo noticed that the Sith was remotely causing the communications array to crash into Mala. She returned to the array to retrieve her friends aboard AG-37's freighter, and rescued Val before the crash could occur. Wredd, meanwhile, escaped."}, {"tag": "p", "text": "The makeshift crew of AG-37's freighter were retrieved by the Animus, a Star Destroyer belonging to the Galactic Triumvirate. Although Sauk and AG-37 took their leave, Jao Assam went renegade and left in a shuttle with Solo to hunt for Wredd. Their hunt took them to Nalyd, and later to Dac. Wredd, meanwhile, was seeking out various Sith who had infiltrated planetary governments and systematically killing them, hoping to be the only Sith left. At Dac's shipyards, Solo and Assam discovered that the Sith Lord Darth Luft was building a pirate fleet, information that their communications droid transmitted to Yalta Val. As a space battle raged, Val and Admiral Gar Stazi of the Triumvirate arrived at Dac with a fleet. The combined Imperial and Galactic Alliance force succeeded in liberating the enslaved Mon Calamari and Quarren slaves there and apprehending the pirates. During the fighting, Darth Luft was personally killed by Jao Assam."}, {"tag": "p", "text": "Following the liberation of the Mon Calamari shipyards, Jao Assam and Ania Solo realize that by killing Darth Luft, they had merely played into the hands of Darth Wredd, who was systematically killing members of the One Sith and intended to restore the Rule of Two. Jao, Sauk, and AG-37 were forced to temporarily abandon their hunt for Darth Wredd when Ania Solo was kidnapped by her former love interest Ramid, who was responding to a bounty on Ania's head. Ania had been framed for the murder of the Imperial Knight Teemen Alton by an old enemy, who had adopted the persona of a bounty hunter. The mission to rescue Ania Solo led Jao and her companions to a remote planet, which rained glass and acid. Following a prolonged skirmish, Ania succeeded in killing the bounty hunter. However, she was subsequently arrested by Imperial stormtroopers, who brought her to Coruscant to face trial. In the end, Ania was cleared when Master Yalta Val and Jao Assam presented evidence that Ania was not Teemen Alton's murderer. Despite Ania's release, Jao Assam was arrested and imprisoned on charges of deserting the Imperial Knights order."}, {"tag": "p", "text": "At that point, Darth Wredd resurfaced on Coruscant and freed Jao Assam from his prison, offering the Imperial Knight a place as a Sith apprentice. Determined to foil Wredd's plot to kill Galactic Empress Marasiah Fel, Jao followed Darth Wredd to the floating world of Mala. Jao quickly learnt that Darth Wredd had been forced to join the One Sith, who had destroyed his homeworld and killed his family. As revenge, Darth Wredd wanted to destroy the One Sith. He tricked Jao into luring both the One Sith and the Imperial Knights onto Mala, which became the site of a great battle which saw the apparent destruction of the One Sith. At the end of the battle, Darth Wredd attempted to assassinate Marasiah Fel with the intent of driving Jao Assam to the dark side of the Force. However, Jao remained true and loyal to his Empress. In the end, Darth Wredd was killed with a blaster by Ania. Following the end of Darth Wredd's insurgency, Empress Fel revised the Imperial Knights' rules to allow its members to follow the light side of the Force rather than the Empress. Jao joined Ania and her companions on their travels throughout the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "The genesis of Darth Wredd's insurgency can be traced to one event in the last years of the Second Imperial Civil War. The One Sith Vul Isen tested a bioweapon on a backwater world called Mala. This test succeeded in wiping out all life on Mala and even knocking the planet out of its orbit; turning Mala into a rogue planet which wandered through the galaxy. The sole survivor of this genocide was the man who became Darth Wredd, whose Force-sensitivity was recognized by an unidentified Sith master. This Sith master sense Darth Wredd's Force potential and took on him as a Sith apprentice. While Darth Wredd ultimately embraced the dark side and became a Sith, he harbored a desire for revenge against the people that had destroyed his family and homeworld."}, {"tag": "p", "text": "Darth Wredd's opportunity for revenge came during the aftermath of Darth Krayt's death during the Battle of Coruscant in 138 ABY. Following the defeat of the Sith, the One Sith was once again driven underground and embarked on a strategy of infiltrating governments across the galaxy in order to restore their \"golden age.\" A new galactic government called the Galactic Federation Triumvirate was formed which consisted of an alliance of the Fel Empire, the Jedi Order, and the Galactic Alliance. Under the leadership of Empress Marasiah Fel, the Triumvirate embarked on a program to create a galactic-wide communications network to link the Outer Rim Territories with the wide galaxy. Under this program, the Imperial Knight Yalta Val was dispatched to supervise the final stages of the construction of a communications station in the remote Carreras system."}, {"tag": "h3", "text": "The Carreras Incident"}, {"tag": "p", "text": "In 138 ABY, Darth Wredd and his Sith master ambushed Master Yalta Val's shuttle in the Surd Nebula. Master Val's shuttle crash-landed on the planet Mala, which happened to be in the Carreras system. The Sith master then killed Master Val's crew and attacked the Imperial Knight. During the duel, Darth Wredd took the opportunity to kill the man who had a role in the destruction of his homeworld and family. He then took Master Val prisoner and stole his armor; impersonating the Imperial Knight. A week later, Darth Wredd's escape pod was retrieved by the Carreras authorities. When meeting Governor Biala, Darth Wredd claimed that there was a Sith presence in the Carreras system and that the Sith had murdered his crew. He then forcibly coerced Biala into ceding control of her security forces over to him."}, {"tag": "p", "text": "Since Darth Wredd had been unable to recover the real Master Val's lightsaber, he ordered a system–wide manhunt to recover the weapon. Unknown to Darth Wredd, Master Val's Imperial communications droid had already recovered the object but was hit during a meteor storm. By chance, the droid fell into a hands of a local junk dealer named Ania Solo, a distant descendant of Han Solo who had fallen on hard times. She and her Mon Calamari friend Sauk, an engineer, attempted to sell the lightsaber but caught the attention of the Carreras authorities. Following a skirmish which ended in the deaths of four security guards, Ania and Sauk managed to escape back to Ania's junkyard on Carreras Minor's moon."}, {"tag": "p", "text": "Darth Wredd and his security forces soon followed them there and managed to retrieve the lightsaber. However, Ania and Sauk managed to escape with the help of their friend, the assassin droid AG-37, who owned a freighter. They also managed to bring Val's communications droid with them. Their travels took them to the barren planet of Carreras Minor. There, they were attacked by a large tentacled monster. At that point, they were rescued by another Imperial Knight named Jao Assam, who had traveled to the Carreras system to ascertain the whereabouts of his mentor Val. After the newly-repaired communications droid played a holorecording of the real Master Val fighting a Sith Master, they quickly deduced that the real Master Val had been kidnapped by a Sith impostor."}, {"tag": "p", "text": "Using the coordinates stored in the Imperial communications droid, Ania, Jao, and their companions decided to travel to Mala and rescue Master Val. However, they were captured on the way by the Carreras authorities who brought them to the Carreras communications array. By that point, relations between Darth Wredd and Governor Biala had deteriorated sharply to the point that she came to suspect that he was not actually an Imperial Knight. Governor Biala freed Jao Assam and his companions and sent them to deal with the Sith impostor. They attempted to ambush Darth Wredd in the station's hangar bay but the rogue Sith managed to escape after incapacitating several of Ania's companions including Jao, who was presumed dead after getting impaled and thrown out of the hangar bay."}, {"tag": "p", "text": "Darth Wredd then returned to his base on Mala where he used the Carreras communications array to broadcast his manifesto to the wider galaxy. During their broadcast, he also attempted to execute Master Val but was thwarted by Ania Solo. As the station headed into a collision course with Mala, Governor Biala ordered a general evacuation. In the midst of the fighting, Darth Wredd managed to escape in his starship and fled for parts unknown. Meanwhile, Ania managed to evacuate her companions and rescue Master Val. To their astonishment, they also discovered that Jao Assam had survived his confrontation with Darth Wredd thanks to the efforts of Master Val's Imperial communications droid. Believing that Jao had come to rescue it, the droid believed that it owed the young Imperial Knight a life debt. The Carreras Incident caught the attention of the Triumvirate leadership who took an interest in Ania Solo."}, {"tag": "h3", "text": "Detour at Nalyd"}, {"tag": "p", "text": "Following the Carreras Incident, Darth Wredd embarked on an insurgency against the One Sith. He tracked down a Snivvian infiltrator in Cadomai Prime and killed him following a heated skirmish. In addition, Darth Wredd killed a second infiltrator at the Galactic Triumvirate's legation on Ceitia Five. Despite Darth Wredd's threats to the Galactic Triumvirate, Empress Fel, at the counsel of Admiral Gar Stazi, decided not to hunt down the rogue Sith because he was helping them kill One Sith infiltrators. Meanwhile, AG-37's freighter was picked up by the Pellaeon-class Star Destroyer Animus. Ania and her companions were welcomed as guests by the Imperials who congratulated them for rescuing Master Val and Jao Assam."}, {"tag": "p", "text": "While recovering from his injuries in a bacta tank, Jao Assam received a Force vision of Darth Wredd attacking Empress Marasiah Fel. He raised his concerns about Darth Wredd to Master Val but his superior reminded him that they had orders to follow; their superior Antares Draco, the head of the Imperial Knights had reassigned them both to Coruscant for the next cycle. Val also reasoned that they should allow the Force to guide the Empress on this matter. Believing that the Triumvirate was underestimating the threat posed by Darth Wredd, Jao persuade Ania to join him on a quest to hunt down the rogue Sith. Commandeering a shuttle, they escaped the Animus and fled into hyperspace. Due to his actions, Jao was condemned by the Empress for desertion, a crime that carried the death penalty."}, {"tag": "p", "text": "Jao and Ania's travels took them to the planet Nalyd. Using the few leads they had, they learnt that Darth Wredd's Nalydian accomplice Dieben had been extradited back to his homeworld of Nalyd. They attempted to question him but arrived in time to see his execution. Unable to convince the authorities to delay the execution, Ania and Jao kidnapped Dieben and led the authorities on a pursuit. This pursuit ended with the three individuals falling into a swamp. While Ania and Jao survived the fall, Dieben was impaled on a plant and died without divulging any details to the two companions. Later, Ania and Jao learnt from the Nalydian authorities that Dieben had been planning to travel to the lawless Calamari system where he had several \"powerful friends.\" While Jao was skeptical that they would find Darth Wredd there, they decided to travel there since they had no other leads."}, {"tag": "h3", "text": "Liberation on Dac"}, {"tag": "p", "text": "Following their new lead, Jao Assam and Ania Solo traveled to the lawless Calamari system, which had become the domain for pirates and crime syndicates in the wake of the Sith Genocide on Dac. The One Sith had poisoned the planet's oceans with a bioweapon which was harmful to most lifeforms. Upon arriving at the Mon Calamari Shipyards, Jao and Ania's shuttle was captured by a pirate syndicate and dragged into a hangar bay. However, Jao and Ania managed to overpower two pirates and steal their uniforms. After encountering a Mon Calamari named Luen and a Quarren named Tilin, they discovered that another Sith named Darth Luft and his pirate associates had established a slaving operation in the Mon Calamari shipyards where they were using enslaved Mon Calamari and Quarren refugees to build a pirate fleet. Jao used his adopted Imperial communications droid to transmit a distress signal to Master Val, alerting the Triumvirate authorities to the plight of the Mon Calamari and Quarren."}, {"tag": "p", "text": "Shortly later, Jao, Ania, and their guides were captured by Darth Luft, who revealed that Darth Wredd was not in the Dac system. Luft expressed his disdain for the rogue Sith and vowed to kill him if he ever set food in the shipyards. Darth Luft then had the four companions dumped into an escape pod which was jettisoned into the poisoned oceans of Dac. Jao's Imperial comm droid managed to transmit another distress signal that was picked up by AG-37 and Sauk, who were doing a delivery run on AG-37's freighter. AG-37 and Sauk rushed to Dac and managed to retrieve the escape pod from the oceans of Dac. After regrouping at an abandoned hangar, Jao suggested taking the fight to Darth Luft. His strategy was not shared by Ania, AG-37, and Sauk who preferred to wait for reinforcements to arrive. Meanwhile, the Quarren Tikin feared that Jao's actions would endanger his son Tilin and decided to inform the Sith of the Imperial Knight's presence."}, {"tag": "p", "text": "Tikin managed to secure an audience with Darth Luft and divulged his information. However, Darth Luft callously killed the Quarren by throwing him down onto the shipyard floor. Luft's actions outraged the enslaved Mon Calamari and Quarren who revolted against their pirate captors. The arrival of a lightsaber–wielding Jao only galvanized the slaves. The slave revolt coincided with the arrival of a joint Galactic Alliance and Imperial task force under Master Val and Admiral Stazi, who decided to come to the aid of the Mon Calamari and Quarren. The Alliance freighter Trand Cappa flooded the shipyards, allowing the amphibian slaves to gain the upper hand over their captors. A boarding party of Imperial Knight cadets and seatroopers led by Master Val then boarded the shipyards and arrested the surviving pirates. In the midst of the fighting, Jao dueled Darth Luft and succeeded in killing him."}, {"tag": "p", "text": "Meanwhile, Ania and her companions, with the aid of Jao's Imperial comm droid, managed to seal the blast doors to the civilian detention cells. Their actions saved countless Mon Calamari and Quarren from exposure to zero gravity space. Following the liberation of the shipyards, the liberated Mon Cals and Quarrens were allowed to settle down in the flooded interiors of the shipyard. Jao also had a brief reunion with his master but decided to continue his quest to hunt down Darth Wredd. While traveling on AG-37's freighter, Jao was contacted by Darth Wredd who revealed that they had merely aided his cause by killing another One Sith. The rogue Sith offered the young Knight a place in his new Sith Order which would be based on the Rule of Two."}, {"tag": "h3", "text": "Kidnapping Jao Assam"}, {"tag": "p", "text": "Following the liberation of the Mon Calamari Shipyards, Jao was forced to temporarily suspend his hunt for Darth Wredd after Ania Solo was framed for the murder of the Imperial Knight Teemen Alton. Ania was kidnapped by her estranged loved Ramid who in turn was pursued by a mysterious bounty hunter. Jao, Sauk, and AG-37 followed Ania's kidnappers to the inhospitable fourth world of an uncharted system. After Jao killed the bounty hunter, Ania was arrested by a force of Trandoshan stormtroopers who extradited her back to Coruscant to face trial. However, Master Val and Jao were able to secure Ania's acquittal after discovering evidence which identified the bounty hunter as Alton's real murderer. Despite Jao's efforts in clearing Ania's name, he was imprisoned by the Triumvirate authorities for desertion."}, {"tag": "p", "text": "Later, Darth Wredd visited Jao Assam's cell and offered the young Knight a way out of his predicament: a lightsaber. Jao accepted this offer not because he wanted to join Wredd's Sith Order but because he wanted to sabotage Darth Wredd's plot against Empress Fel. After escaping Coruscant in Darth Wredd's ship, Wredd took his prisoner to Mala. Since he did not fully trust Jao, he had the young Knight imprisoned in a cell aboard his starship. After they had landed on Mala, Darth Wredd shared his life story with the young Knight. He revealed how his grief and anger at the destruction of his homeworld and family had led him to embark on a campaign against the One Sith. When Jao expressed skepticism, the rogue Sith presented a broken shard from his sword; conforming that his story had indeed been true."}, {"tag": "p", "text": "Meanwhile, Empress Fel sent Ania and her companions with a force of Trandoshan stormtroopers to rescue Jao. Back on Mala, Jao managed to break out of his cell and transmit the planet's coordinates to Ania and her companions. As planned, Ania traveled to Mala and managed to rescued Jao. However, Jao revealed that they had merely taken the bait for Darth Wredd's trap. Shortly later, they were attacked by a large One Sith army which had also intercepted Jao's transmission. During the fighting, Darth Wredd resurfaced and helped Jao and Ania to fight off the Sith horde. In a rare act of selfless humanity, Darth Wredd convinced Jao to help him combine their Force powers to levitate a large piece of space wreckage onto the advancing Sith forces. Despite their cooperation, Jao reminded Darth Wredd that they were still enemies. Shortly later, another Star Destroyer carrying a large force of Imperial Knights led by Empress Fel herself; thus beginning the second half of the Battle of the Floating World."}, {"tag": "h3", "text": "Last stand on Mala"}, {"tag": "p", "text": "The Imperial Knight reinforcements launched a fierce attack on the One Sith. Both sides fought fiercely with neither side showing or giving any quarter to their opponents. During the fighting, Antares Draco, the head of the Knights and Empress Fel's lover, was wounded by a One Sith acolyte. Ania and Sauk rushed to his aid and subsequently gained the goodwill of Empress Fel. Later, Ania and Sauk aided the Imperial Knights by destroying a Sith Chadra-Fan Lander and its occupants. Due to his longstanding animosity towards the One Sith, Darth Wredd joined the fray and defeated many followers of the One Sith. While they were temporary allies, Empress Fel and Jao Assam agreed that a Sith was untrustworthy since they were only motivated by hatred. After hours of fighting, the Imperial Knights triumphed over the One Sith. The battlefield was littered with the corpses of innumerable Sith."}, {"tag": "p", "text": "While Empress Fel was tending to wounded Knights, Darth Wredd made his move. He stabbed her through the abdomen with his lightsaber but was prevented by Jao from finishing his work. Jao pursued Darth Wredd to a cliff-edge and succeeded in slicing off both his hands. While Wredd was elated that he had succeeded in his goal of exacting revenge against the One Sith, he realized that he was the only Sith remaining. Believing himself to be beyond redemption, he had staged the attack on Empress Fel in order to goad Jao into killing him. In addition, Wredd also wanted to drive Jao to the dark side. However, the young Knight saw through the Sith's intentions and refused to kill him. In the end, Darth Wredd was executed by Ania, who shot him dead with a blaster rifle; ending the last known Sith in the galaxy."}, {"tag": "p", "text": "Following the Battle of the Floating World, many contemporaries including AG-37 and Yalta Val believed that all the remaining Sith in the galaxy had perished. However, some observers like Empress Fel were skeptical. In the light of the destruction of the One Sith, Empress Fel reformed the Imperial Knights to redirect their loyalty to the light side of the Force rather than the Empress. Jao Assam was also pardoned and allowed to join Ania, Sauk, and AG-37, who resumed their spacefaring career and lifestyle. The remaining Sith were presumably rounded up by the Imperial Knights."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Wredd's insurgency serves as the main conflict of Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2 comic series, the sequel to Dark Horse Comics' popular Star Wars: Legacy comic series. The events and characters of this conflict were drawn by Gabriel Hardman and Brian Albert Thies, and colored by Rachelle Rosenberg and Jordan Boyd."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}