{"url": "Darth_Wredd%27s_master", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unidentified species", "Category:Sith Masters", "Category:Unidentified males", "Category:Unidentified Sith of the One Sith"], "nodes": [{"tag": "h1", "text": "Darth Wredd's master"}, {"tag": "p", "text": "A Sith Master was a male member of the One Sith during the Second Imperial Civil War and the Sith Master of Darth Wredd. In 138 ABY, the duo ambushed Imperial Knight Yalta Val in the Surd Nebula."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The destruction of Mala"}, {"tag": "p", "text": "Darth Wredd's master was a member of Darth Krayt's One Sith order during the time of the Second Imperial Civil War. During the last years of the Civil War, this Sith Master led an Imperial fleet to Mala, a primitive world consisting of village communities. He led the assault on Mala and clashed with the local champion of a village, a man who would later become Darth Wredd. While Wredd was a skilled swordsman who had defeated the barbaric Schor-Goya, he was no match for the Sith Lord, who sliced off the hilt of his sword with his Sith lightsaber. After Wredd surrendered, the Sith master took him as a prisoner aboard the Sith flagship, a Pellaeon-class Star Destroyer."}, {"tag": "p", "text": "Even though Wredd's people had surrendered to the Sith, Vul Isen, a Sith scientist, decided to test his new viral spores bioweapon on Mala. The Sith bioweapon destroyed all life on Mala and turned it into a barren, dead world. The power of the blast that delivered the viral spores was also strong enough to knock the planet from its orbit, turning Mala into a floating world which wandered through the galaxy. The Sith master who defeated Darth Wredd then took him on as a Sith apprentice, admiring the raw talent in him. Darth Wredd's master was a harsh teacher who forced his apprentice to wear a helmet and used harsh methods to bring him over to the dark side of the Force. While these methods succeeded in turning Wredd into a Sith, his apprentice always harbored an abiding hatred towards the One Sith for destroying his family, his homeworld, and stripping him of his identity."}, {"tag": "h3", "text": "Ambush in the Surd Nebula"}, {"tag": "p", "text": "Following the death of Darth Krayt and the defeat of the One Sith in 138 ABY, the Sith master and his apprentice, Darth Wredd, went underground. The One Sith embarked on a policy of infiltrating galactic governments in order to restore their \"golden age.\" By that time, Darth Wredd had come to realize that his master was easy to manipulate. So, Darth Wredd contrived a plan to kill his Master and destroy the One Sith. At Wredd's urging, the Sith master fired a missile which downed the Imperial Knight Yalta Val's shuttle, which was traveling through the Surd Nebula on a mission to the Carreras system. After Val's shuttle crash-landed on Mala, the Sith master and his apprentice ambushed Val and killed his crew. Following a fierce duel, the Sith Master was able to defeat Val; however, when the Imperial Knight was at his mercy, the Master was impaled through the chest by his apprentice."}, {"tag": "p", "text": "Knowing that he could not match his Master's combat prowess, Darth Wredd had deliberately used his master's duel with the Imperial Knight to distract him. The death of his master freed Darth Wredd from his imprisonment within the Sith mask. After removing his mask, Darth Wredd took Val prisoner and stole his armor, impersonating the Imperial Knight. He then embarked on a campaign to destabilize the new Galactic Federation Triumvirate and to destroy the One Sith. After Wredd \"rescued\" the Imperial Knight Jao Assam, Darth Wredd recounted his encounter with the Sith Master. When Jao expressed skepticism, Wredd produced a shard from his sword to verify his story. Ultimately, Wredd succeeded in avenging the murder of his family and homeworld by destroying the One Sith, including himself, during the Battle of the Floating World, thus bringing full circle retribution for his forced subjugation under the Sith master."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Sith Master was capable of defeating the Imperial Knight, Yalta Val, in a one on one duel. During the duel he used the Force to push the wreckage of Yalta Val's ship as well as demonstrate the Force Choke ability against the Knight, before disarming him. Despite his powers, he was ultimately unable to sense his apprentice's betrayal, which led to the Sith Master's death. While the Sith Master was a brutal and ruthless fighter, he had very little cunning and was easy to manipulate. Darth Wredd was able to exploit this flaw to his advantage during an ambush in the Surd Nebula in 138 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Wredd's master appeared as a minor character in Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2 comic series, a spinoff of Dark Horse Comics' popular Star Wars: Legacy comic series, which ran from 2013 to 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}