{"url": "Darth_Wyyrlok_(III)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Chagrians", "Category:Darths", "Category:Imperial heads-of-state", "Category:Males", "Category:Sith alchemists", "Category:Sith healers", "Category:Sith Lords of Darth Krayt's Galactic Empire", "Category:Sith Lords of the Fel Empire", "Category:Sith Lords of the One Sith", "Category:Sith Masters", "Category:Sith sorcerers"], "nodes": [{"tag": "h1", "text": "Darth Wyyrlok  (III)"}, {"tag": "p", "text": "Darth Wyyrlok was a male Chagrian Sith Lord and foremost loremaster of the One Sith. He was afforded a title of hereditary esteem in his capacity as the most trusted servant of the Dark Lord Darth Krayt, only to whom Wyyrlok was second in knowledge and power. When the Dark Lord usurped the Imperial throne and installed himself as Galactic Emperor, Darth Wyyrlok served as steward of the new Sith Empire, when so required, in his Lord's stead."}, {"tag": "p", "text": "Over seven years, Krayt continued to establish his empire with Wyyrlok at his side. Simultaneously, the new Emperor's body continued to deteriorate, due to the presence of Yorik-Kul in his body. Wyyrlok sought remedies to the ailment, but was unable to find a cure for his Master. Krayt attempted to bring Cade Skywalker, who possessed unique healing abilities, into his Sith Order, but failed to do so. Although Krayt remained optimistic about his condition, Wyyrlok was not satisfied, and he set off on a perilous journey into the Deep Core to find a cure for his ailing Master. Unable to find one, Wyyrlok later killed his Master on Had Abbadon, after Krayt had been severely injured in a battle with Imperial Knights and criminals led by Skywalker. However, Wyyrlok was the only member of the One Sith that knew of Krayt's demise; he collected and interred the Dark Lord's body in a stasis chamber within XoXaan's Temple on Korriban. While pretending that Krayt had resumed one of his many periods of regenerative hibernation, Wyyrlok traveled to Coruscant where he assumed the Dark Lord's position as Galactic Emperor, and continued the implementation of Krayt's dream—to initiate every living being of the galaxy into the One Sith Order. However, when Krayt was resurrected, he punished Wyyrlok for his treachery. After Krayt led an attack on the Temple of the Sith on Coruscant, he and Wyyrlok dueled, ending in Wyyrlok's death at the hands of his former master."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Servitude"}, {"tag": "p", "text": "The Chagrian Sith Lord known as Darth Wyyrlok was the third to hold that title. The grandson of the first Darth Wyyrlok, and son of the second, his duty was to attend to Darth Krayt, leader of the One Sith, as a servant. Wyyrlok's grandfather had cared for Krayt around the time of the Second Galactic Civil War. Just prior to the Yuuzhan Vong War, Krayt had been implanted with Yorik-Kul by the Yuuzhan Vong themselves. While the implants allowed him to utilize Vong technology, they continued to grow, and Krayt feared that they would one day consume and envelop his entire body. Over time Krayt had needed to spend years in stasis to allow his body to heal, and to stagnate the growth of the Yorik-Kul. Even by the third Wyyrlok's time, he was not completely healed, and it was the Chagrian's duty to tend to his Master's health."}, {"tag": "p", "text": "At some stage, Wyyrlok sired a daughter, who was sent to Korriban for training in the Sith ways. Wyyrlok was the most trusted lieutenant of Krayt, and was also the closest to the New Sith Order's leader, acting as the Dark Lord's confidant. In time, he came to serve Krayt not only as an attendant and servant, but as a spokesman, and a friend."}, {"tag": "h3", "text": "Krayt's rise to power"}, {"tag": "p", "text": "To begin his bid for galactic dominance, Krayt had his order side with the Fel Empire, which was at war with the Galactic Federation of Free Alliances. The Sith–Imperial War persisted for three years, until the decisive Battle of Caamas, which crippled the Alliance's naval power, and the Massacre at Ossus, during which the ranks of the New Jedi Order were thinned greatly. Shortly after the Massacre at Ossus, Wyyrlok accompanied his Master, as well as Darth Nihl and Darth Maladi, to Coruscant, the new throneworld of the Fel Empire. While Grand Admiral Morlish Veed informed a man who appeared to be Emperor Roan Fel that the Sith-Imperial War was over following Ossus and Caamas, Krayt and his companions entered Fel's throne room."}, {"tag": "p", "text": "Without hesitation, Krayt attacked and killed Fel's Imperial Knight bodyguards, before killing the apparent \"Emperor\" himself while Wyyrlok watched on. Krayt then sat himself on the throne, and cowed the present Moffs, making them swear loyalty to him. He then dismissed the Moffs, before openly stating that the \"Fel\" he had just killed was actually a double. After reprimanding his head of intelligence, Darth Maladi, for failing to detect the ruse, he dismissed everyone else, save for Wyyrlok. When he was alone with his trusted lieutenant, Krayt complained that his body was failing him due to his affliction, but Wyyrlok believed it to be exhaustion. He suggested that Krayt, who was now Emperor, should go into a healing trance, or even back into stasis, but Krayt was reluctant."}, {"tag": "p", "text": "The new Emperor considered the prospect of a healing trance, but thought stasis to be out of the question, since the citizens of the galaxy needed to see him and see that he was strong. Wyyrlok tried once more to reason with his Master, but Krayt persisted, speculating that without treatment, he might succumb to the ailment within no more than two decades. He also told Wyyrlok that during the Massacre at Ossus, he had detected a murmur in the Force, which had drawn life back from death. The source had been a Jedi, and while Krayt confessed to his lieutenant that his vision for the galaxy was not complete, he insisted that it would be, in due course. Shortly after Krayt's ascension to Emperor, Wyyrlok was written about in passing by fugitive Padawan Ellu Viss, who added her knowledge of Krayt's order to histories written by Jedi Tionne Solusar during the Second Galactic Civil War."}, {"tag": "h3", "text": "An alternative"}, {"tag": "p", "text": "Seven years later, with the Temple of the Sith fully established, Emperor Krayt was once again placed in stasis for preservation. Wyyrlok had come to the realization that his Master was dying, and he began to fear for Krayt's life. The servant's knowledge of Sith lore did not help either; even the teachings of ancient Sith Lord XoXaan did not yield any answer to the problem. The captured Jedi healer Hosk Trey'lis proved ineffective in several attempts to cure Krayt, but Darth Talon reported the existence of Cade Skywalker, who, according to Moff Konrad Rus, possessed extraordinary healing skills. Skywalker was in fact the source of the murmur in the Force that Krayt had detected seven years previously, but even so, the thought of the Skywalker bloodline still being alive concerned Wyyrlok."}, {"tag": "p", "text": "In short order, Skywalker came to the temple to rescue the captive Trey'lis, but in doing so he was in turn apprehended by Nihl. After repeated torture, Krayt prepared to bring Skywalker into his personal quarters, in an attempt to break the former Jedi, and bend the captive to the Emperor's will. It was ultimately Krayt's hope that Skywalker's healing powers would be able to cure the Sith Lord's affliction. Skywalker was brought to the quarters by Nihl, Talon and Maladi, but Wyyrlok insisted that only Talon be allowed inside. Nihl took exception, insisting that as one of Krayt's Hands, he should be allowed admittance, and that his presence was necessary. Wyyrlok retorted by claiming that his barring of Nihl's entry was a direct order from Krayt himself, before taking Skywalker into the chambers without them."}, {"tag": "p", "text": "While in Krayt's chambers, Skywalker was treated to a veritable banquet of food, before the Emperor revealed to the captive that in his past life, he had been known as \"A'Sharad Hett,\" a Jedi Knight of the Galactic Republic who had served in the Clone Wars. As he told Skywalker of his survival of Order 66 and his humiliation at the hands of Obi-Wan Kenobi, Krayt inspired a brief confrontation between the young captive and Talon. Wyyrlok watched on as Skywalker wounded Talon, but Skywalker was then forced by Krayt to heal her. Following that, Krayt offered to teach Skywalker the ways of the Sith, and the former Jedi seemed to accept."}, {"tag": "h3", "text": "Indoctrinating Skywalker"}, {"tag": "p", "text": "Within a week Skywalker's training had begun. Wyyrlok did not strictly approve of Krayt's revelations to the newcomer, and talk began to circulate throughout the temple of the Emperor's near-obsession with Skywalker. While watching Talon and Skywalker train, Wyyrlok brought the issue up with his Master, since one of the Chagrian's duties was to question Krayt's actions. The Emperor believed that he would be able to form a bond with Skywalker, and lure him into the order wholesale. Then, with a member of the Skywalker lineage in his order, Krayt would be able to demoralize his enemies. In addition to that, Krayt continued to hold the belief that Skywalker, with his unique talents, would be able to heal him. Wyyrlok was still reluctant, since their order had never before taught to a man who did not fully embrace their ways, but Krayt was unfazed."}, {"tag": "p", "text": "Wyyrlok stood by and watched as Krayt accelerated the newcomer's training by putting Skywalker into an Embrace of Pain, a Yuuzhan Vong torture device. After telling the story of his capture by the Yuuzhan Vong and his subsequent teaching at the hands of former Jedi and apparent Sith Vergere, Krayt revealed his intent to Skywalker by asking his captive to heal him. Wyyrlok helped Krayt remove his armor as he made the request, but Skywalker explained that he would not be able to perform the task properly in his present state. Krayt merely believed that Skywalker lacked focus, and so he left the man in the Embrace of Pain."}, {"tag": "p", "text": "Krayt's plan to lure Skywalker into the Sith Order proved to be a failure when the captive tried to escape the temple. He was caught and brought before Krayt, and an elongated duel ensued. Both Nihl and Talon were wounded in the engagement, and Krayt suffered a blaster shot to the back from Morrigan Corde, who had arrived in Skywalker's ship, the Mynock, to rescue the captive from the clutches of the Sith. Skywalker made it out of the temple alive, and Krayt was livid. By the time Wyyrlok arrived on the scene, Krayt's orders were simply to find Skywalker. The Chagrian protested, claiming that if the Mynock had entered hyperspace, there would be no way of locating the fugitive. Krayt cared little, and began bellowing at his lieutenant, but Wyyrlok did not balk at his Master's anger. The Emperor then demanded that Skywalker be brought to him alive and in chains."}, {"tag": "p", "text": "Krayt then decided to redirect his ire towards the injured Nihl, who had lost an arm to Skywalker's blade. Maladi noted that the cut was clean, making reattachment no problem. The Emperor, however, was furious at the incompetence of Nihl, and was on the verge of striking the beleaguered Nagai down where he lay before Wyyrlok suggested that he may still be of use to Krayt. The Emperor reconsidered, and ordered Maladi to give Nihl a new arm fashioned from Yuuzhan Vong bioforms. Talon, who had been more severely injured, was to be put into healing meditation. Krayt subsequently ordered Wyyrlok to recall Darth Stryfe to serve as his new Hand. As the Emperor strode away from the scene of the duel, however, he recoiled in pain, his duel having taken a great toll on his health."}, {"tag": "h3", "text": "The secret of Lord Andeddu"}, {"tag": "p", "text": "Hurriedly, Wyyrlok put his Master back into a stasis chamber, and began searching for a way to stave off Krayt's inevitable death. Scouring his Sith texts, he found nothing of value, and so turned to one of the few ancient Sith holocrons in existence: that of Darth Andeddu. Andeddu had been able to animate his body and mind even after his death, and so Wyyrlok believed that an answer to the Emperor's problems laid with the ancient Sith. However, the holocron, when activated, did nothing but mock Wyyrlok and Krayt's Sith, and would not impart its knowledge to anyone it did not deem worthy. Wyyrlok then suggested that a being able to resurrect Andeddu once more might be worthy, a prospect that the holocron neither agreed or disagreed with."}, {"tag": "p", "text": "Through his research, the Sith Master had learned that Andeddu's tomb on Korriban was a falsity, but the holocron was able to confirm that the true tomb was located on Prakith, a world within the Deep Core. Flying to Prakith, Wyyrlok was able to locate Andeddu's Keep, a lone structure located at the foot of a mountain. Striding into the tomb confidently, the Sith Master was soon met by a large group of lightsaber wielding Force adepts who labeled themselves the \"Malevolence.\" Wyyrlok, undaunted by the fact that he was vastly outnumbered, used the Force to project images into the minds of his adversaries, making them all appear to be him. As such, the adepts ended up striking each other down, unaware of what they were doing."}, {"tag": "p", "text": "The sole survivor, Gerlun, knelt before Wyyrlok in servitude. The Sith Master, seeing some use in the adept, had Gerlun lead him to the lowest level of the tomb. However, upon reaching that level, the pair found that the room they were presented with was empty. Placing Andeddu's holocron on the ground, Wyyrlok ordered it to reveal what he supposed would be the hidden entrance to the room that held the ancient Sith Lord's body. The holocron's image did so, and as the Sith Master had suspected, hidden gates opened. Entering the hidden room, Wyyrlok instructed Gerlun to light the sconces, while he opened Andeddu's coffin. Inside were the Sith Lord's remains, prompting the holocron to goad Wyyrlok into placing the device on the body's chest. The Sith Master refused, though, and chose to content himself with the multitude of books and scrolls that lay around the tomb."}, {"tag": "p", "text": "Gerlun, however, was still angered at how easily the Malevolence had been trounced by Wyyrlok, and he placed the holocron on Andeddu's chest. As a result, Gerlun's life force was drained into the ancient Sith Lord, who was instantly resurrected. Before he could even intervene, Wyyrlok had Darth Andeddu standing before him. The Sith Master realized that the holocron had not been what it seemed—instead, it was a shell containing Andeddu's spirit, in much the same way that his remains had also been a shell. The pair, when connected, had been able to bring Andeddu back to life, free of hindrance. Even though he had returned from the dead, Andeddu refused to impart his knowledge to Wyyrlok, instead launching bolts of Force lightning at the Sith Master. Wyyrlok, in response, merely deflected the bolts with his open hand."}, {"tag": "p", "text": "Andeddu began goading and taunting his opponent, while attacking him with a Force Push. Continuing his attack, Andeddu pummeled Wyyrlok with shattered rock shards, which he sent flying at the Sith Master with the Force. At that moment, Wyyrlok realized that the shards were not real, and were merely a Force Illusion much like the one he had used to trick the Malevolence. The danger, however, was very real, and if Andeddu could make Wyyrlok believe he was dead in the illusion, he would die in reality. The two Sith Lords matched wits, with their minds serving as the selected field of battle. They began battling with fictional gouts of lava, but neither one of them were able to gain the upper hand. To break the stalemate, Wyyrlok made it appear as though he was destroying all of Andeddu's books and scrolls, as a way of destroying all trace of Andeddu himself. In doing so, Wyyrlok ended the battle; in the end, the books and tomes were complete, but Andeddu himself was once again a lifeless corpse. Recovering several of the ancient Sith's books and documents, Wyyrlok left the tomb and departed Prakith, confident he could find a solution to his Master's problem."}, {"tag": "h3", "text": "Genocide at Dac"}, {"tag": "p", "text": "When the Advanced Star Destroyer Imperious was stolen from the Mon Calamari Shipyards over Dac, Krayt was not pleased. Former Senator Gial Gahan had been implicated in aiding the Galactic Alliance with the theft, and so Krayt had him arrested. Wyyrlok accompanied Krayt and several other Sith Lords, including Darth Azard, to Dac, where the captive Gahan was presented before the Mon Calamari Council. With a Holovid of the events on Dac being recorded for later broadcast, Krayt declared that ten percent of the Mon Calamari population would be executed, starting with the Mon Calamari Council. Krayt's Sith and stormtroopers took their lightsabers and blasters to the councilmen who were present, and did not even distinguish between the Mon Calamari and the Quarren who were there as well."}, {"tag": "p", "text": "To further his demonstration, Krayt declared that all surviving Mon Calamari would be placed into work camps, and those who tried to evade the Sith would be hunted down and destroyed. Gahan protested, prompting the Emperor to strike down the former senator there and then. As a final proclamation, Krayt ordered that all sympathetic to the Galactic Alliance who were taking refuge on Dac were to be killed as well. Wyyrlok was concerned that with the loss of so many Mon Calamari, Dac's shipyards would be rendered useless, but Krayt argued that the loss of a shipyard was easier to endure than the loss of control over a galaxy. Wyyrlok was, as usual, concerned for his Master's health, especially after the loss of Skywalker and the demonstration he had just performed on the Mon Calamari. He suggested another period in stasis, but Krayt was feeding off the fear he had just struck into the hearts and minds of the galaxy's denizens. He then swore that he would find a way to overcome his ailment until his vision for the galaxy was complete. Wyyrlok later suggested to Vul Isen, one of the Sith tasked with carrying out the extermination, to look into ancient Sith lore, and perhaps adapt the ancient Leviathans to underwater use. Isen appreciated the advice, and later implemented such a plan, creating the Sea Leviathan."}, {"tag": "h3", "text": "Treachery"}, {"tag": "p", "text": "Back on Coruscant, Wyyrlok joined Krayt, Maladi, Talon, and Stryfe in hearing a report from a wounded Darth Reave. He reported that he had seen Cade Skywalker at the Sith base on Had Abbadon, and claimed that a Jedi woman helping him had turned his troops into monsters. The monsters had then attacked him, inflicting severe wounds. Reave then transformed into one of the monsters, prompting Stryfe to strike him down immediately. Maladi, inspecting the corpse, suspected that he had been turned into one of the rakghouls of ancient Taris, though she did not know how, as the creatures had been extinct for some time. Wyyrlok then received an urgent message for Krayt from Had Abbadon, which his Master turned his attention to."}, {"tag": "p", "text": "The holographic image was that of the Jedi woman, Celeste Morne, and she was flanked by rakghouls. However, on her neck she wore the Muur Talisman, and as such, she was possessed by the essence of Lord Karness Muur, an ancient Sith Lord. Muur, through Morne, requested that Krayt come to Had Abbadon, as he claimed to have captured Skywalker. Krayt was shown Skywalker in binders, but he was still reluctant, prompting Muur to attack his captive with Sith lightning. The Emperor relented, and Muur claimed he would be able to heal him of his ailment with his arcane powers. On the trip to Had Abbadon, Wyyrlok informed Krayt of what he had learned of Muur from Andeddu's scrolls—namely, that he may have been around to fight in the Hundred-Year Darkness, and that instead of choosing to preserve his body to escape death, he chose to embed his essence in his Talisman, which then afforded him access to the Force powers of the wearer."}, {"tag": "p", "text": "Wyyrlok's Master began to grow concerned that his Sith Order would not survive his death, which Krayt felt was rapidly approaching. Wyyrlok, however, assured Emperor Krayt that his vision would survive. Wyyrlok was also ordered to stay on the ship and continue to gather information about Muur, while Krayt and several other Sith Lords landed on Had Abbadon. Arriving planetside, Krayt met with Muur, but the Dread Lord had entered a trap—Skywalker was merely feigning his captivity, and the Imperial Knights Antares Draco, Azlyn Rae, and Ganner Krieg, as well as Jedi Knight Shado Vao were all waiting in ambush. A duel broke out, as Talon, Maladi and Stryfe battled rakghouls and criminals alike."}, {"tag": "p", "text": "As the battle raged, Wyyrlok sensed that his master would soon have need of him, and he took his shuttle down to Had Abbadon's surface. During the skirmish, Krayt was stabbed in the back by Rae, and then blasted off the cliff edge by Morne. In the aftermath, Wyyrlok discovered his fallen master's body, and retrieved Krayt's mask. To the Chagrian's surprise, Krayt awoke, and revealed that he had discovered a way in which he could heal himself. Wyyrlok, however, had other ideas, and he electrocuted his master with Sith lightning, killing the Emperor. Using the Force, the Chagrian then levitated his late Master's body, bringing it to the shuttle."}, {"tag": "h3", "text": "Galactic Ruler"}, {"tag": "p", "text": "After the battle on Had Abbadon, Wyyrlok carried his defeated comrades to the Sith temple on Korriban. He sent the injured Sith Lords to bacta tanks within the Temple's healing chambers and placed Krayt's body in a stasis chamber, in order to feign the Dark Lord's survival and deceive the rest of the Sith into believing that Krayt had yet again entered a period of hibernation."}, {"tag": "p", "text": "While Wyyrlok finalized his preparations of Krayt's tomb, he commissioned his daughter Saarai with the task of guarding the stasis chamber, and to refuse anyone who should request entry. As Wyyrlok worked inside, Darth Stryfe emerged from his bacta tank and immediately realized that he could no longer feel Darth Krayt in the Force. He confronted Saarai in front of the chamber and engaged her in combat upon her denying his admission inside, a fight which Wyyrlok stopped shortly afterward. The Chagrian Sith then invited Stryfe into the tomb, and explained that the Dark Lord had suffered severe injuries in battle, which required another bout of stasis healing. To further compound his deception, Wyyrlok also told Stryfe that disturbing or awakening Krayt would kill him, for which he erected shields that would conceal Krayt's presence from both his enemies and servants. Convinced by Wyyrlok's lies, Stryfe swore to support the self-appointed Regent of the Sith, who then revealed his plan to secure the Imperial seat of power in Krayt's name, as well as continue the execution of Lord Krayt's vision for a united and peaceful galaxy: by recruiting every living being in the galaxy into the One Sith Order."}, {"tag": "p", "text": "Afterwards, Wyyrlok returned to Coruscant, where he announced to the Moffs that Emperor Krayt had been severely injured and that he would take control of the Empire as Regent."}, {"tag": "p", "text": "Wyyrlok later requested private audience with High Moff Morlish Veed, who was apprehensive about accepting a discreet junction with the Chagrian, as individuals in the past had been known to have not survived such encounters. Wyyrlok was well aware of the speculation amongst the Imperials as to Krayt's survival, and like he had previously done with Darth Stryfe, he lied to Veed regarding the matter. Wyyrlok also acknowledged the fact that many of Veed's peers were unsure of the Chagrian's position within Krayt's order, though Veed assured him that his authority had and would remain unquestioned. He then offered the Grand Admiral the position of Imperial Regent, a placeholder on the throne who would enact Darth Krayt's will as decreed by Wyyrlok—an offer which Veed accepted."}, {"tag": "p", "text": "Later, at his private office, Wyyrlok had another audience, this time with Konrad Rus, leader of the Imperial Mission. Wyyrlok announced that the Mission would be modified and that in order to unify the galaxy according to Krayt's vision of the One Sith, the missionaries would now teach the inhabitants of the galaxy the Sith values and Sith Code, instead of continuing the Victory Without War program. Rus was shocked by the news, since he had an understanding with Darth Krayt to keep the mission unchanged, and tried to ask Wyyrlok for an audience with Krayt, but Wyyrlok abruptly stated that for the foreseeable future that would be impossible. Wyyrlok then promised to personally provide Rus with Sith instructions, before dismissing him."}, {"tag": "p", "text": "Even though Wyyrlok claimed that Darth Krayt had survived the encounter on Had Abbadon, Darth Maladi believed otherwise. She also believed that Wyyrlok was simply consolidating his own power until which time he would eliminate those Sith whom he perceived as threats to his plans. In her eyes, Wyyrlok was a coward who was unfit to rule the One Sith. She returned to Wayland, the place where she originally developed the sabotage of the Ossus Project, and invited Darth Nihl to her laboratory and shared her concerns with him. Initially wary of Maladi's intentions, Nihl was eventually convinced by her to go to Korriban to confirm whether the Dark Lord was truly alive or dead and, once he had discovered the truth, use it as he best saw fit."}, {"tag": "p", "text": "Because Maladi believed that Darth Krayt's successor needed to be an individual with both leadership experience and the power to bend the Sith to their will, she began engineering a new bioweapon that would stabilize the One Sith through fear of the new Dark Lord's power."}, {"tag": "h3", "text": "Final Protocol"}, {"tag": "p", "text": "A short time later, Lord Wyyrlok contacted Darth Azard and Vul Isen on Dac. He informed them that Emperor Krayt no longer wished to divert Sith Imperial resources to the genocide on Dac and ordered Vul Isen to implement the Final Protocol: the extermination of all life on the planet. Lord Azard questioned Wyyrlok about the Quarren, allies of the Empire, as well as other neutral species on the planet. The Chagrian ordered that they would be allowed to leave the planet, but would receive no aid from the Empire. Later, while working at the Temple of the Sith, Wyyrlok was confronted by Regent Veed, who was livid after learning that the Sith Lord had autonomously decided to accelerate the complete and utter devastation of Dac without first consulting him. Wyyrlok merely responded by strangling Veed through the Force, reminding him that since the extermination on Dac was Lord Krayt's will, it did not require the consent of the regent. The Chagrian also reminded Veed that there was another advantage to the genocide on Dac—it would likely lure Admiral Gar Stazi and the Galactic Alliance Remnant out of hiding, and into a Sith Imperial trap. Veed reminded Krayt that, as Regent, he would be assumed to have given the order; a fact Wyyrlok had intended from the beginning."}, {"tag": "p", "text": "Lord Stryfe, who was in charge of the operation, later reported to Wyyrlok that the Remnant, with the aid of the Empire-in-exile, had been able to evacuate a portion of Dac's population. Wyyrlok reminded him that it was only a portion that had survived, and he was satisfied that the Final Protocol would serve as an effective message to the rest of the galaxy. He then ordered Stryfe to return to Coruscant. Immediately afterward, Wyyrlok received a priority signal from Korriban—Darth Nihl had an urgent report for the Chagrian. Wyyrlok was not aware that Nihl was on Korriban, and inquired as to why the Nagai had utilized the priority channel. The response caused a great degree of shock to Wyyrlok—Lord Krayt was missing."}, {"tag": "p", "text": "Returning to Korriban, Wyyrlok inspected the sanctum in which he had kept Krayt's body with Nihl. The armor remained, but the Chagrian was perplexed by the disappearance of his master's body. Masking his confusion, he suggested to Nihl that someone else had killed Krayt, and taken the body. For the good of the One Sith, Wyyrlok told Nihl that they would have to keep the Emperor's death a secret, and the Chagrian would rule in his stead. Nihl would take Wyyrlok's role as advisor. The Nagai then informed Wyyrlok that Talon had been with him when Krayt's disappearance had been discovered—the Twi'lek had mysteriously vanished in the aftermath. Wyyrlok suggested to Nihl that Talon had betrayed Krayt, and that she was in fact the murderer. He instructed his new adviser to hunt down and question Talon, while he would return to Coruscant to oversee the progress of the Empire. Before departing, once Nihl had left the sanctum, Wyyrlok, in a confused rage, obliterated Krayt's armor with Sith lightning. He then ordered Darth Havok to have the newly captured Princess Marasiah Fel, daughter of former Emperor Roan Fel, brought to Korriban. When Krayt revealed his will and presence to all those in the Galaxy that had ever touched the dark side, Darth Wyyrlok knew that the Dark Lord was alive."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "After hearing word of Krayt's imminent return to Coruscant, Wyyrlok decided to tell his fellow Sith that he had, in fact, murdered Lord Krayt. He then attempted to deceive the Sith by stating that the one they felt in their minds was not Krayt, but an imposter, and that he had killed the Dark Lord because his mind had succumbed to his illness and he was no longer fit to lead the One Sith. He then proclaimed himself their leader and vowed to kill the \"pretender.\""}, {"tag": "p", "text": "After the address, he urged Saarai, his daughter and heir apparent to the Wyyrlok title, to leave Coruscant and hide during the battle to come as her power had yet to be fully realized. As she departed his quarters, Wyyrlok conferred with Darth Stryfe, openly discussing Krayt's inevitable arrival. Wyyrlok stated that he had fractured the Order and the upcoming battle would determine its fate. When Wyyrlok asked Stryfe who he would side with, Stryfe remarked that he would side with whomever proved to be the strongest, as was the Sith way."}, {"tag": "p", "text": "Darth Krayt arrived at the Temple of the Sith shortly thereafter, accompanied by his two Hands, Darth Talon and Darth Nihl, as well as two masked Sith troopers. They proceeded to carve their way through Wyyrlok's followers to the throne room, intent on the usurper's death. Wyyrlok, sensing the Dark Lord's cold rage as he approached, confronted his former master unapologetically on the stairs of the throne room, preparing to engage his former mentor in mortal combat. Before the two Sith stood Lord Stryfe, as well as Imperial Regent Veed and Moff Nyna Calixte."}, {"tag": "p", "text": "The duel between the Dark Lord of the Sith and the Sith Regent was an impressive display of Force ability and lightsaber prowess, both combatants unleashing the full fury of the dark side to kill the other. Wyyrlok then attacked Krayt's mind with his powerful Sith sorcery, showing him the torments of his long life. As Wyyrlok forced the Dark Lord to relive his painful past, he chided Krayt for clinging to his pain and let himself be defined by it. He boasted that it was he and his ancestors, the late Wyyrloks, that kept the One Sith functioning while their Master suffered under his own weaknesses. Believing himself victorious, he stood poised to deliver the killing blow to the Dark Lord of the Sith, thus claiming the title for himself. It was at this moment that Krayt revealed that it was indeed he, and not his former second-in-command, that was victorious, and plunged his lightsabers into Wyyrlok's chest. Wyyrlok collapsed to the floor, trying to cling to the arms of Lord Stryfe, who left him to die to take his place by the side of the winner."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Having been both born a Sith and Krayt's personal regent, he was allowed privileges that others were not, such as admittance to Krayt's private chambers. He also upheld his Master's orders to the letter, and would allow no exceptions in that regard. Like the majority of Krayt's minions, Wyyrlok's Sith tattoos etched all over his face were an expression of his total devotion to Darth Krayt's new Order. Being somewhat of a realist, Wyyrlok often questioned his Master's decisions and dictates without directly opposing them, as that was one of his duties as Krayt had defined them."}, {"tag": "p", "text": "Wyyrlok was a cautious man, and seemed to constantly fear for the well-being of his Master. He was quick to suggest methods through which Krayt could prolong his life even further, and he respected his Master's determination. It appeared that Wyyrlok did not care for his own life, and made his Master's health his prime concern. He understood his duty and dedicated himself to it."}, {"tag": "p", "text": "Wyyrlok had high hopes for his daughter, Saarai, and believed that one day she would succeed him and take the title of \"Darth Wyyrlok\" for herself. Despite being a Sith Lord, Wyyrlok appeared to actually care about Saarai and ordered her to flee when Darth Krayt attacked the Temple of the Sith."}, {"tag": "p", "text": "However, Wyyrlok was loyal not to Darth Krayt but his vision and capitalized on his master's moment of weakness on Had Abbadon to eliminate him. He was shown to be cunning and manipulative, evidenced when he created the facade of Krayt's survival to ensure Darth Stryfe's continued loyalty to what Wyyrlok claimed was the will of Darth Krayt. Despite Wyyrlok's appointed position as Regent of the One Sith, Darth Maladi believed that he was unfit to rule the Order in Lord Krayt's stead. She was convinced he was lying about the survival of Krayt following the fallout of Had Abbadon and was only doing so until he had amassed enough power to eliminate his enemies within the Sith ranks."}, {"tag": "p", "text": "Once given complete control of the Sith Empire, Wyyrlok showed his ruthlessness as he soon ordered for the extermination of the population of Dac. When reminded by Lord Azard that the Quarren had aided the Sith cause, the Chagrian cared little for them, refused to offer them aid in return, and merely allowed them to flee of their own accord. When his authority was questioned by Regent Veed, Wyyrlok continued the facade of \"Lord Krayt's will,\" and attacked the regent through the Force. Wyyrlok was a calm, collected individual who constantly adopted a stoic demeanor, losing his composure only on rare occasions."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Though Wyyrlok wielded dual lightsabers, he was also skilled in the use of only a single blade. His mastery of the lightsaber was such that he was able to hold his own against Darth Krayt, the most powerful Sith of the time after he was resurrected and after he was healed from the Vong seeds. In battle, he utilized his lightsabers in conjunction with Force powers, suggesting that he was a practitioner of Niman."}, {"tag": "p", "text": "Lord Wyyrlok was a master in the ways of the dark side of the Force, through which he was able to sense when his Master, Darth Krayt, was in peril. As such, his dark side powers were second only to Krayt. A common skill among many of the known Sith of Krayt's Order, Wyyrlok was adept with projecting torrents of Force lightning. He was also capable of both deflecting and absorbing the lightning attacks of others, and was even able to cause death via electrocution, as witnessed when Wyyrlok murdered Darth Krayt. His proficiency with Force lightning rivaled that of Darth Krayt, evidenced when they launched their individual torrents without gaining an advantage over another. Telekinesis was within the Chagrian Sith's abilities as well, as he utilized a Force choke technique against Regent Veed while disciplining him in the aftermath of his issue of the Final Protocol on Dac. Wyyrlok utilized telekinesis to throw large pieces of stone at Darth Krayt during their duel, even though this tactic was countered. The Sith Lord was also adept in creating a barrier of Force energy, such as when he defended himself from large chunks of rock launched against him by Darth Krayt."}, {"tag": "p", "text": "In addition to that, Wyyrlok was well-learned in Sith rituals, magics, and lore. He displayed his proficiency with Sith sorcery during his mission to Prakith, where he created complex illusions to confound and ultimately defeat the Malevolence cultists, as well as the reanimated husk of Darth Andeddu. While his mindforms were considered powerful manifestations of the dark side by the cultist Gerlun, Wyyrlok himself remarked that their creation was only an iota of his full potential with Sith sorcery. This seemingly minor demonstration of his abilities was enough to compel Gerlun into doing Wyyrlok's bidding. Wyyrlok had also mastered the ability to torture his opponents mentally as he had shown during his duel with Darth Krayt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Wyyrlok was introduced in the Star Wars: Legacy preview issue, Star Wars: Legacy 0. He was then shown as a supporting character in Legacy 1, written by John Ostrander. Wyyrlok's supporting role continued through the next major Legacy arc, Star Wars: Legacy: Claws of the Dragon. Up to the end of Claws of the Dragon, Wyyrlok had been drawn exclusively by Jan Duursema, but for his next appearance, in Legacy 22, he was illustrated by Alan Robinson. Wyyrlok was drawn by Omar Francia for Legacy 27, an issue which revolved around the character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}