{"url": "Darth_Wrend", "categories": ["Category:Canon articles", "Category:Darths", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Darth Wrend"}, {"tag": "p", "text": "Darth Wrend was a legendary Sith Lord who fought against the Jedi and was believed dead, only for Wrend to return and fight once again. Many years later, Jedi Padawan Qui-Gon Jinn believed that a prophecy in the holocron of prophecy of evil returning once the righteous lost the light might have referred to Darth Wrend rather than the potential reincarnation of the Sith Order as some believed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Darth Wrend was a Sith Lord who fought against the Jedi. Eventually, Wrend was believed to be dead, but then returned to wage war against the Jedi once again. Sometime between the years 68 BBY and 66 BBY, when Qui-Gon Jinn was the Padawan of Jedi Master Dooku, Darth Wrend was thought of as legendary by Jinn, who opened the holocron of prophecy, which contained numerous prophecies of which several dated ten thousand years prior. One such prophecy was that evil would disappear yet appear again once the righteous had lost its light, with most notes stating that the Sith were going to be potentially reincarnated."}, {"tag": "p", "text": "Jinn eventually returned the holocron to the Jedi Archives, although after reading the prophecy of the potential Sith reincarnation, Jinn believed that the prophecy might have actually been referring to Wrend and had already passed. After many years, when Obi-Wan Kenobi was the Padawan of Jinn, Kenobi mentioned the prophecy to Jinn, and complained about its vagueness. Eventually, the Sith were exposed to still be active with the discovery of Darth Maul, who killed Jinn in a lightsaber duel during the Battle of Naboo in 32 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Wrend was first mentioned in the 2019 novel Master & Apprentice, written by Claudia Gray."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}