{"url": "Darth_Zash", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Darths", "Category:Females", "Category:Humans", "Category:Members of the Sphere of Ancient Knowledge", "Category:Sith Lords of the reconstituted Sith Empire", "Category:Sith sorcerers"], "nodes": [{"tag": "h1", "text": "Darth Zash"}, {"tag": "p", "text": "Darth Zash, originally known simply as Zash, was a Human female Sith sorcerer who lived during the era of the Great Galactic War and the resulting Cold War. As a Force-strong member of the Sith Order, she was trained in the tradition of the Sith Inquisitors under the auspicies of the reconstituted Sith Empire. After years of study in the arts of the dark side, Zash rose to prominence in the higher echelons of Sith politics and was promoted to the rank of Sith Lord. Under the moniker of Lord Zash, she delved into research of ancient Sith magic and rituals, and her expertise gained her a position as a supervisor of acolyte training at the Sith Academy on the holy world of Korriban. Although she was an enthusiastic seeker of knowledge and power, the dark side took an extreme toll on her body, decaying her skin and robbing her of her youth. She managed to maintain a Force illusion that hid her decrepit appearance, but the physical effects of such intense usage of the dark side proved detrimental to her bodily health. In response, she desperately searched for a cure to her terminal sickness, but faced further challenges from her superiors, Darth Skotia and Darth Thanaton, both of whom detested Zash's apparent lack of deference towards her historical predecessors and the traditions of the Sith Order."}, {"tag": "p", "text": "Zash's studies eventually led her to believe that a ritual developed by the ancient Dark Lord Tulak Hord could save her consciousness by allowing her to transfer it into a new and younger host body. However, before she could complete the process she had to collect artifacts from Hord's reign and select a host body to accept her spirit. She sought to accomplish both tasks by fulfilling a prophetic dream she had experienced in which an apprentice of low birth confronted and overcame the raging spirit of the ancient Lord Aloysius Kallig in the Dark Temple of Dromund Kaas; in doing so, the apprentice would pacify the spirit and be granted the knowledge of Tulak Hord. To ensure that she benefited from the vision, Zash proceeded to order the Sith Academy's Overseer Harkun to gather a group of Sith hopefuls, all of low origin. After a series of trials, one acolyte managed to retrieve a map that once belonged to Hord and free the ancient Sith Lord's slumbering Dashade assassin, Khem Val. Zash accepted the acolyte as her apprentice in the Inquisitor's arts and brought them to the Imperial capital city on Dromund Kaas. There, Zash used her apprentice to engineer the murder of Darth Skotia—a move that enraged Darth Thanaton but ultimately earned Zash the rank of Dark Lord and the title of Darth."}, {"tag": "p", "text": "The apprentice ultimately fulfilled Darth Zash's prophecy within the Dark Temple, proving to the Sith Lord that she had chosen her host body wisely. Zash tasked the young Sith with finding the remainder of Hord's artifacts spread across the galaxy, all while insisting that she was preparing a ritual that was designed to empower her pupil. When the apprentice completed their task, Zash summoned them back to the Dark Temple, where she revealed her true form and moved to possess her student's body. The plan, years in the making, was foiled by the apprentice's companion, Khem Val, who attacked Zash during the transfer. Val killed Zash's body, but the Dark Lord's spirit entered the Dashade and occupied it as a vessel instead. Although Zash indeed managed to live on, to her great ire she did not have full control over the new body and instead was forced to share it with Val's consciousness. Because the Dashade was bound to her apprentice, Darth Zash was also forced to live in servitude of the young Sith. During her intermittent control of the Dashade body, she helped her apprentice defeat Darth Thanaton, who was working to destroy the remnants of Zash's power base. The Dark Lord, imprisoned within her new body, advised her apprentice—now known as the new Lord Kallig—in the accruement and control of the spirits of long-dead Sith Lords. Her work and guidance helped Kallig to kill Thanaton and rise to become the newly-ordained Darth Nox. During her travels with Nox, Zash conducted research into ways she could eliminate Khem Val's consciousness so that she might gain complete control over the Dashade body."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Studying the dark arts"}, {"tag": "p", "text": "The woman known as Zash was a Human Female alive during the era of the Great Galactic War between the Sith Empire and the Galactic Republic. She hailed from the dominion of the Empire and was inducted into the Sith Order due to her impressive Force-sensitivity. Zash trained as an acolyte Inquisitor on the Sith holy world of Korriban, where she explored the planet's tombs and studied the secrets of the dark side of the Force. During her time there, she met and was judged by the elderly Sith Lord Spindrall—a man considered by many to be a crazed hermit, but by Zash to be a prophet. She was eventually granted the rank of apprentice and armed herself with a red-bladed lightsaber that she used throughout her tutelage. Her training ultimately took her to Dromund Kaas, the capital planet of the Sith Empire. There, she met the cyborg Sith Darth Skotia, who found her duplicitous and overly-ambitious. The two developed a bitter rivalry that saw Skotia repeatedly attempt to block Zash's progress and ascension."}, {"tag": "p", "text": "Zash ultimately graduated from her apprenticeship and was granted the title of Sith Lord. As Lord Zash, she served directly under Darth Skotia, who in turn served beneath Darth Thanaton. Much like Skotia, Thanaton despised Zash and detested her apparent lack of respect for the history and traditions of the Sith Empire. Together with their servants, the two Dark Lords worked to confound Zash's plans, but the young Sith managed to stay ahead of their political games by gaining favor with the Empire's ruling Dark Council. Zash's acuity helped her to earn chambers within the Sith Sanctum of the Imperial Citadel—an honor largely reserved only for Dark Lords. Additionally, she was given a role as a supervisor of acolyte training at the Sith Academy on Korriban. In that capacity, she was granted chambers in the academy's pyramid and authority over the institution's overseers. Her ambition and successes continually angered her superiors and peers, including Lord Khreusis, who also held dominion on Korriban. Zash's designs eventually brought her into contact with The Circle, a group of highly-talented Nikto computer slicers. Zash hired the group for a special project and worked out a deal with their leader Bolan that involved the Sith Lord paying for their efforts with a favor. Lord Zash's work in Sith studies also made her familiar with the Imperial Reclamation Service, which was a branch of the Imperial Military that focused on the recovery and study of ancient artifacts and lore."}, {"tag": "p", "text": "While serving as a Lord of the Sith, Zash continued her study of ancient Force rituals and Sith magic. She was renown for her interest in the arcane and mystic and became extremely powerful in the Force as a result of her research. She succeeded in compiling a large library of Sith teachings which included the complete collection of the late Naga Sadow's writings from Yavin 4. She also attempted to retrieve the holocron of the great Marka Ragnos by sacrificing seven tuk'ata hounds and eating their hearts, but was unsuccessful in the endeavor. As Lord Zash eagerly accrued greater Force power, her body became corrupted by the energies of the dark side. Her youthful appearance was taken from her by rapid aging and her health began to fail. She was able to hide her now-gangrenous skin, yellow eyes, and frail body behind a Force mask that presented only a young and vital Zash to the outside world, but her health continued to deteriorate. She discovered that the corruption of the dark side had forced her into a state of terminal illness, and so she set out to find a way to prevent her impending death."}, {"tag": "h3", "text": "Escaping death"}, {"tag": "h4", "text": "Search for a savior"}, {"tag": "p", "text": "Approximately five years after the end of the Great Galactic War with the signing of the Treaty of Coruscant and the onset of the galactic Cold War, Zash began to research the works of the ancient Sith Lord Tulak Hord. Hord, who had been a ruler of the ancient Sith Empire, developed a powerful ritual prior to his death that would apparently allow the Sith sorcerer conducting it to transfer his or her spirit into a new body. Further research revealed to Zash that the ritual required a series of artifacts that had once belonged to Hord himself. The relics were scattered across the galaxy—some in hiding places chosen by Hord himself, others in the possession of thieves and vagabonds. Although she was prepared to hunt them down herself, she chose not to in order to avoid suspicion from Darth Skotia. She did attempt to access one artifact that was sealed within the innermost chamber of the forbidden Dark Temple on Dromund Kaas, but Skotia, who held the key to the Temple, refused to allow Zash entry."}, {"tag": "p", "text": "In spite of the hurdle Skotia represented, a possible solution soon presented itself to Zash. A group of Sith Lords, ambitious for power in light of the Sith Emperor's reclusive behavior during the previous years, defied their Emperor's mandate and breached the Dark Temple, hoping to access the hidden power within. Although the Lords managed to evade the Emperor's notice, they quickly fell victim to the ancient spirits entombed within the Temple's crypts. The most powerful of the spirits—Tulak Hord's old nemesis, Aloysius Kallig—was unaware of his own death, and so used the power of the Force to possess and destroy the minds of the invading Sith. Although this development apparently made the journey into the Temple impossible for Zash, she received a vision from the Force in the form of a dream. In the dream, Zash saw a young Sith apprentice humble him or herself before Kallig's marauding spirit; the action placated the wraith, which then permitted the Sith student to access Hord's relic. Zash couldn't discern the sex, species, or identity of the apprentice, but understood that the individual was of low birth."}, {"tag": "p", "text": "Trusting her vision to be an omen of the future, Zash moved quickly to find an apprentice that could fulfill her prophecy in the Dark Temple and serve as a new host body. She traveled to Korriban and tasked one of the academy's overseers, the human Harkun, with collecting and testing a group of Sith Acolytes. Believing that she would most likely find her prophesied student from the lowest classes of Sith society, she demanded that Harkun only cull potential apprentices from the Empire's slave pens. Although the overseer initially complied by gathering six uninitiated Force-sensitive former slaves, his own prejudices against aliens and the low-born caused him to recruit a seventh potential apprentice—the highly-trained and high-born Sith Pureblood, Ffon Althe, although he hid this seventh acolyte from Lord Zash. Zash, wanting to find only the most qualified student to become her apprentice and eventual vessel, asked that Harkun put the prospects through trials that tested their strength, talent, dedication, and understanding of the Force in relation to the Code of the Sith. To that end, she ordered that their first trial be a visit to Lord Spindrall, followed by treasure-hunting missions into the tombs of Marka Ragnos and Tulak Hord. Like many Sith, Zash used her hopeful apprentices to complete tasks and collect relics that she was either unable or too busy to complete. One such task—the retrieval of Marka Ragnos's holocron—was completed by an acolyte who had drawn particular distaste from Harkun. The acolyte's success in a challenge that Zash herself had failed years before caught her attention, which was further piqued when the same acolyte managed to collect a long-hidden text from within Tulak Hord's tomb."}, {"tag": "p", "text": "Zash decided to introduce herself to the former slave, and so intercepted the young acolyte outside of Harkun's chambers upon their return from Hord's tomb. Zash praised the acolyte's successes and reassured the young learner that, despite Harkun's very obvious bigotry and favoritism, it was she who made the final decision regarding her future apprentice and not the overseer. Zash allowed Harkun to create some of the remaining trials on his own, but commanded that the acolytes' final task be to journey into the Tomb of Naga Sadow, where Tulak Hord had left a map sealed in an inner chamber. For centuries, the map had rested undisturbed, guarded by an ancient Dashade shadow Killer locked in a stasis field. As no Sith in thousands of years had been able to breach the chamber holding the Dashade and the map, the task appeared to be impossible, but the text gathered by the young acolyte from Tulak Hord's tomb indicated otherwise."}, {"tag": "h4", "text": "Dealing with Darths"}, {"tag": "p", "text": "After the Inquisitor arrived on Dromund Kaas, they told Zash that they had encountered Darth Skotia in the spaceport and passed his message that he knew what she was up to. Zash revealed to the Inquisitor that they could not begin their plans unless Skotia was dead, and that she could not be the one to kill him without attracting unwanted attention from the Dark Council. Lord Zash sent the Inquisitor to secure a prototype cyborg disruptor she had ordered to be created, along with a Trandoshan tablet that would turn Skotia's Trandoshan bodyguards against him. When her apprentice succeeded in retrieving the two objects, she told her apprentice to go to Skotia's quarters and kill him, while she went to the local cantina to have an alibi. The Inquisitor defeated Skotia, but his last words foreshadowed Zash's future actions, and warned the Inquisitor that Zash spent years plotting his death and that the inquisitor would face the same."}, {"tag": "p", "text": "When the Inquisitor arrived at the cantina to inform Zash of Skotia's death, she received a holocall from Darth Thanaton, Skotia's former superior. Thanaton knew that Zash was somehow responsible for Skotia's death and asked to meet her. After the meeting, she was promoted to the title of Darth, and thus was now known as Darth Zash. While the Inquisitor was across the galaxy, Zash undertook other apprentices, such as Corrin and Kaal, without the Inquisitor's initial notice."}, {"tag": "h4", "text": "Hord's legacy"}, {"tag": "p", "text": "After all of Tulak Hord's artifacts were secured, Zash asked her apprentice if they could meet in the Dark Temple, where the ritual would be commenced. However, she denied to reveal to the Inquisitor any details about the ritual, other than that her apprentice \"will be more powerful than (her apprentice) can possibly imagine\". When the Inquisitor arrived, Zash gave her apprentice the title of Lord and revealed the truth of her condition, and confirmed their suspicions and those of the ancient Sith Lord Aloysius Kallig. She continued to talk sweetly to the Inquisitor while attempting to do the ritual. However, the ritual was interrupted by Khem Val, who out of loyalty to the Inquisitor, interfered, causing Zash to transfer her spirit to his body instead, much to her chagrin. She ranted to the Inquisitor about how her plans, that took years to plan, were ruined and was furious that she now served her old apprentice, due to her being in the body of their Dashade servant. However, she and Khem shared use of the same body, and neither had full control."}, {"tag": "h3", "text": "Life with Khem Val"}, {"tag": "h4", "text": "Serving Kallig"}, {"tag": "p", "text": "After the ritual and being bound in Khem Val's body, Zash's personality would sometimes emerge to talk to the Inquisitor, now known as Lord Kallig. After hearing that Darth Thanaton wanted to speak to them, Zash warned them to be wary of Thanaton, giving her own experiences as an example. Being bound by a Dashade's oath of loyalty and perhaps her desire to learn, Zash researched about ancient Sith rituals that would help Kallig take control of the powers of the ghosts of Sith Lords. Zash expressed her jealousy at the fact that Kallig had become a Dark Councilor, by the name \"Darth Nox,\" before she did."}, {"tag": "h4", "text": "Plotting escape"}, {"tag": "p", "text": "Zash managed to increase the time she spent in control of the body by sending Khem and Kallig on a wild goose chase for Tulak Hord's remains. What they actually uncovered were artifacts of Hord's that drained some of Khem's willpower so that Zash could rise to the fore more often, although she brushed off the concern of foul play by saying she was simply behind on her reading."}, {"tag": "p", "text": "Zash eventually developed a solution to her predicament: an empty Rakata mind prison could be used to contain Khem Val's mind, leaving her in control of the Dashade's body. Zash devised a ritual for the purpose, but admitted that she would need to borrow power from Lord Kallig. Learning that one such box was in the custody of Republic forces on Taris, Zash convinced Kallig to take her there for the final showdown."}, {"tag": "p", "text": "Her plan back fired when it was revealed Kallig had decided to banish Zash's mind out of Khem's body. Zash furiously reminded her former apprentice of their deal but Khem told her she had underestimated his master for the last time. Afterwards Khem and Kallig threw the artifact out of an airlock and left Taris."}, {"tag": "p", "text": "Some unknown time later, a female human who resembled her found the mind prison and was tricked by Zash into opening it. Zash used the opportunity and exchanged her mind with the her liberator."}, {"tag": "p", "text": "In 3630 BBY, Zash was killed after joining the Order of Zildrog and seeking revenge in the Nathema Conspiracy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Darth Zash was known for being secretive and cunning. She was also very patient; having waited years for the opportunity to have Skotia killed, and waited 5 years to find the perfect apprentice for her ritual. Like all Sith, however, she was all too willing to betray fellow Sith. Appropriately, this trait would be the cause of her downfall."}, {"tag": "p", "text": "Zash had a huge hunger for knowledge regardless of the cost, which angered her superior Darth Thanaton; he found her very reckless. Zash's hunger was so great that she either wasn't concerned or wasn't aware of the damage her research and rituals did to her body. Zash counted reading amongst her personal hobbies; when she managed to gain the upper hand and gain greater control over Khem Val's body, she expressed delight that she would be able to catch up on her reading."}, {"tag": "p", "text": "In rare cases, Zash was known to explode in rage, but the majority of time, she affected a calm and very kind demeanor to people she liked (or wanted to manipulate). Even when faced with someone she didn't like, she dealt with the situation with a smile and her acerbic wit, and when she did kill someone, she usually did so matter-of-factly. Although Harkun warned Kallig that Zash would kill them if she met them, she was actually quite pleasant and even encouraging when she first met her future apprentice."}, {"tag": "p", "text": "It is implied that Zash had aspired to become a member of the Dark Council, as she showed jealousy when Kallig was made a Dark Councilor."}, {"tag": "h3", "text": "Doting Master"}, {"tag": "p", "text": "During Kallig's time as her apprentice, Zash showed a friendly demeanor to them – much friendlier than most Sith would display to their apprentices. She was delighted with Kallig's progress and upon the completion of their training, gifted them with the lightsaber she had used as an apprentice, a gift of surprising sentimentality."}, {"tag": "p", "text": "Despite her betrayal in the Dark Temple, she admitted she genuinely liked Kallig and in fact nearly canceled the ritual, but ultimately went ahead due to the fear of her impending death. Her attitude is corroborated by Zash's other apprentices, as well as Ashara Zavros, who told Kallig that Zash had always spoken highly of them."}, {"tag": "h3", "text": "Scheming prisoner"}, {"tag": "p", "text": "When Zash's five year plan ended in failure, her frustration exploded and she frequently expressed her fury at the situation. As time went on, however, Zash came to appreciate the strengths of Khem Val's body and eventually seemed content to simply become its sole occupant. She soon returned to her old, scheming-yet-polite personality."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Darth Zash mastered many arcane Sith rituals, allowing her to maintain the illusion of youth and extend her natural lifespan. However, this came at a great cost, and Zash's body decayed at an advanced rate, leaving her with a withered, mummified appearance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Zash is a major character during the Sith Inquisitor storyline in Star Wars: The Old Republic. Her overall storyline cannot be changed, but her ultimate fate is decided by the player. After Zash becomes trapped in Khem Val's body, they player can choose dialog options to support her or Khem. It should be noted that Zash doesn't have her own approval rating, so supporting her usually results in disapproval from Khem."}, {"tag": "p", "text": "During the final companion quest \"The Escape\", when Khem and Zash fight against the Rakata Mind prison's pull for control of Khem's body, the player has three options: they can lend their power to either Zash or Khem, or refuse to assist either and let the strongest win. If Zash wins, she will thank the player and swear fealty to her former student; if Khem wins, he will thank his master and reaffirm his loyalty. Khem will win if Kallig refuses to take sides."}, {"tag": "p", "text": "During the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Sith Inquisitor who made the choice to support Khem and trap Zash's spirit, she is revealed to have tricked a similar-looking woman into entering her mind prison, allowing Zash to exchange places with her and escape with a new body. Seeking revenge on her former apprentice, Zash then joins the Order of Zildrog led by Vinn Atrius and meets her apprentice again on Nathema, where she confesses that she still wishes to claim their body for herself, especially now that her former apprentice has become much more powerful since their initial battle. Zash will send a large mechanical creature to slow Kallig down, claiming that she doesn't believe it will defeat them, but will then be sacrificed as fuel to awaken Zildrog by GEMINI 16. If the player made the choice to banish Khem, he will reclaim his old body and appear instead of Zash, while the other classes face antagonists from their own class stories."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}