{"url": "Darts_D%27Nar", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Cleanup", "Category:Character stubs", "Category:Males", "Category:Separatist officers", "Category:Slavers", "Category:Zygerrians"], "nodes": [{"tag": "h1", "text": "Darts D'Nar"}, {"tag": "p", "text": "Darts D'Nar was a male Zygerrian who worked with the Confederacy of Independent Systems and his homeworld's slave Empire during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Darts D'Nar was a male Zygerrian who was a part of the Zygerrian Slave Empire. During the Clone Wars, D'Nar allied with the Confederacy of Independent Systems and accompanied his tactical droid, Count Dooku and their battle droids to Kiros. After Dooku spoke with its governor, Gupat Roshti, D'Nar order his tactical droid to round up all the citizens of a Togruta colony. D'Nar then stayed inside the governor's tower, collecting birds. Ten cycles after his round-up, he and his forces came under attack by the Galactic Republic under Jedi Generals Obi-Wan Kenobi, Anakin Skywalker, and Commander Ahsoka Tano. D'Nar then contacted Clone Commander Cody. D'Nar then invited Kenobi into the tower to negotiate the terms of surrender."}, {"tag": "p", "text": "D'Nar then spoke with Count Dooku and Zygerrian Prime Minister Atai Molec about the last slave shipment. D'Nar then assured them that he would deal with Jedi. As Kenobi arrived, D'Nar was then ordered by Dooku to bring Kenobi to him on his knees. D'Nar then told Kenobi that is him who would surrender. At first, Kenobi refused until D'Nar threatened to blow up the colony's buildings with bombs. Kenobi, knowing that Skywalker and his apprentice were listening, surrendered his lightsaber to D'Nar. D'Nar then told Kenobi that he would punish him for what the Jedi did to his people's slave empire, but Dooku would displeased. Kenobi then offered to fight him in the Zygerrian way, agreeing to surrender if D'Nar were to win. D'Nar fought Kenobi until his tactical droid informed that Skywalker had defused all of his bombs. Refusing to surrender, D'Nar then activated a bomb on his tactical droid's back and made his escape."}, {"tag": "p", "text": "D'Nar then made his escape to to his ship, the Tecora, as he was being pursued by Skywalker and Tano. As he took off, D'Nar's ship was then crippled. When he saw the Jedi, D'Nar unleashed his pet blixus upon them. D'Nar was then confronted by Tano. He fought her using his electro-whip, but was subdued by her. Skywalker then questioned him as to the location of the missing colonists. At first, D'Nar refused, but told Skywalker when he threatened with his lightsaber that his Queen would be auctioning off the colonists to bring back their empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "D'Nar first appeared in the episode \"Kidnapped,\" the eleventh episode of the Star Wars: The Clone Wars television series' fourth season. He was voiced by Nick Jameson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}