{"url": "Darvannis", "categories": ["Category:Legends articles", "Category:Calaron sector planets", "Category:Darvannis locations", "Category:Desert planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Darvannis"}, {"tag": "p", "text": "Darvannis was a desert planet in the galaxy where the Hutt Cartel was building up military forces during the Galactic War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Darvannis was an arid desert world located in the Calaron sector. It was devoid of any valuable natural resources or native sentient species. Furthermore, the planet was surrounded by a dense asteroid field that makes any approach difficult. For those reasons, Darvannis was little visited by offworlders."}, {"tag": "p", "text": "The Hutts had built prosperous market villas on the planet that prospered through the illegal trade of weapons and other black market goods. Darvannis had thus become an appreciated retreat for members of the Hutt Cartel, especially for those looking to avoid attention. One of the major cities of the planet is Oasis City."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darvannis was discovered by spice smugglers about five centuries before the Great Galactic War."}, {"tag": "p", "text": "During the Galactic War between the Galactic Republic and the Sith Empire, the Hutt Cartel assembled an impressive army of mercenaries on Darvannis. Concerned about this army, both the Republic and the Empire dispatched strike teams to eliminate the threat. During the battle, they discovered that the mercenaries were in fact gathered by Dread Masters Styrak in order to convert them into service among the Dread Host. Styrak and all the mercenaries, including the four Cartel warlords Horic, Vilus, Sunder, and Tu'chuk, were eventually defeated."}, {"tag": "p", "text": "Later when the Eternal Empire invaded the galaxy, Darvannis was one of the first worlds to be conquered. Under the rule of Zakuul, Darvannis was host to a Skytrooper droid factory, and home to the droid GEMINI Prime. During the Alliance's war against Zakuul, the Alliance Commander and Mandalorian forces raided the factory and captured GEMINI Prime."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}