{"url": "Darts_D%27Nar/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Males", "Category:Separatist officers", "Category:Slavers", "Category:Zygerrians"], "nodes": [{"tag": "h1", "text": "Darts D'Nar"}, {"tag": "p", "text": "Darts D'Nar was a male Zygerrian commander who served the Confederacy of Independent Systems during the Battle of Kiros around 21 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around 21 BBY, he was in command of the droid occupation of the planet Kiros. He was a slaver at the time, attempting to bring Zygerria back to its former might as a Slave Empire. The Zygyerrian Commander made a deal with Count Dooku and the Confederacy of Independent Systems, to capture the Togruta population of Kiros, in 21 BBY."}, {"tag": "p", "text": "Count Dooku accompanied him to the planet, and they soon started capturing the native Togrutas, and loading them onto their ships, while placing explosive charges around the city. By the time the Republic arrived at Kiros, they soon realized that the whole population of the planet was missing. Jedi Master Obi-Wan Kenobi, at his request, soon met with him in the tower that he was hiding in to negotiate terms of surrender. They agreed to fight each other, hand to hand, with no weapons. D'nar easily beat Kenobi, pummeling him multiple times."}, {"tag": "p", "text": "Meanwhile, Anakin Skywalker and Ahsoka Tano began searching for the recently discovered bombs laid throughout the city. In a series of small clashes, Anakin and Ahsoka disarmed all of the bombs. This led to the eventual Republic victory, if only for a moment, as the slaver made his escape. He was then captured by Anakin and Ahsoka when they boarded his ship, the Tecora, by jumping off their AT-RTs. D'nar then unleashed one of his pets, a Blixus on them. After Ahsoka wounded the creature, she went into the controls and stabilized the ship. D'nar drew his shock whip to fight the young Jedi, but he was subdued by her. After Anakin got rid of the Blixus, he questioned D'nar about the whereabouts of the Togruta colonists. After Anakin had his lightsaber at his throat, D'nar told him how his queen was going to have a grand slave auction to bring back the Zygerrian slave empire. Afterwards, he and his ship were taken into custody by the Republic and he was presumably imprisoned at the Republic Judiciary Central Detention Center on Coruscant while his ship was used by Anakin, Obi-Wan, Ahsoka, and Clone captain Rex to infiltrate Zygerria."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "D'Nar was voiced by Nick Jameson, who also voiced Palpatine in the Star Wars: Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes ans references"}]}