{"url": "Dass_Jennir", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Masters", "Category:Separatist military members"], "nodes": [{"tag": "h1", "text": "Dass Jennir"}, {"tag": "p", "text": "Dass Jennir was a Human male Jedi Master who served as a general during the Clone Wars, and survived Order 66. During the Clone Wars, he was stationed on New Plympto, leading the Galactic Republic's war effort against the Separatist Nosaurians. Several months into the campaign on New Plympto, Jennir's clone troopers executed Order 66—declaring all Jedi enemies of the Republic—and attempted to kill Jennir. He evaded them, eventually finding refuge among the Nosaurians he had been fighting against. Jennir led the Nosaurians into battle against the Republic's successor, Palpatine's Galactic Empire, though they incurred heavy losses; of the New Plympto resistance soldiers, only Jennir and his friend Bomo Greenbark survived the Battle of Half-Axe Pass."}, {"tag": "p", "text": "The two companions left the planet in Captain Schurk-Heren's smuggling ship, the Uhumele, traveling to Orvax IV, where Greenbark's wife and child were being kept as slaves. Greenbark's wife had been killed and his daughter had been sold on, though Jennir managed to procure the identity of Resa Greenbark's seller, Orso Meeto, and broke the Jedi Code when he killed Meeto. The Uhumele ferried Jennir and Bomo to Esseles, where Resa's buyer, Dezono Qua, lived; they attacked his fortress, cornering him, but Qua had already killed Bomo's daughter and eaten her. Jennir murdered the man, but Greenbark and the Uhumele ultimately left Esseles without him. He continued to live his life as a Jedi, however, vowing to stay true to the Jedi Code and find redemption. His travels took him to Cato Neimoidia, but he quickly ran low on funds and had to accept a job that rankled with his Jedi teachings, which quickly saw him facing overwhelming odds."}, {"tag": "p", "text": "He also met Ember Chankeli, and after finishing the job the two left for Vondarc, but crash-landed on Prine. After a two-week trek through the desert, Chankeli was captured by pirates. In the meanwhile, the assassin Falco Sang was hunting Jennir.\nJennir attempted to rescue Chankeli, whom he had begun to develop feelings for, but failed, and Sang took Chankeli, meaning to lure Jennir into a trap. Though Jennir saw through this, Chankeli was shot by Sang's droid. Sang fled, and when Jennir attempted to heal Chankeli with the Force, he passed out from the effort. He later woke on board of the Uhumele, with Bomo Greenbark at his side. The two friends were overjoyed to see each other again, and Jennir learned that Chankeli had survived, being healed by Beyghor Sahdett. Jennir became romantically involved with Chankeli."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Force-sensitive Human male, Dass Jennir was trained in the ways of the Jedi Order, living in the Jedi Temple on Coruscant. He was regarded by his superiors as having a poor connection to the Force, and being \"average\" in every respect, though he did not fail when it came to concentrating. When one Jedi Master reported to Grand Master Yoda that Jennir would never become a \"great Jedi\", the young Padawan sullenly listened nearby, hidden behind a pillar. His master taught him that if he could not walk away from a fight, he should take control of it, forcing his opponent to fight him on his own terms. Jennir never forgot the lesson. At one point, Yoda told him that even with his average abilities, the galaxy still needed him."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Jennir was made a Jedi Master by the time of the Clone Wars, becoming a Jedi General of the Grand Army of the Republic when the galaxy-spanning conflict began. Close to the war's end, he was sent to the planet New Plympto, located within the Core Worlds. Commanding a sizable contingent of clone troopers, Jennir was tasked with dealing with the native Nosaurian population—who had allied themselves with the Confederacy of Independent Systems—as well a large amount of Separatist battle droids, and reclaiming the world. They fought many battles during the Clone Wars, and Jennir found the Nosaurians to be determined fighters."}, {"tag": "p", "text": "In 19 BBY, Jennir's clone troopers—like those in every other unit of the Grand Army of the Republic—were told to execute Order 66, which dictated that all Jedi were enemies of the Republic, and were to be killed immediately. He was able to evade his attackers, however; confused and disoriented, he fled into the forest, hiding from his pursuers in the underbrush. Eventually, the clones left the area to continue their search elsewhere, and Jennir continued his flight into the jungle. Eventually, he encountered Bomo Greenbark, a lone Nosaurian soldier. Greenbark was unarmed, his weapons lying on the ground beside him; fearing that the Nosaurian would alert the clones to his presence, Jennir attacked him. He managed to pin Greenbark down, and made him swear to be extremely cautious and quiet. Eventually, however, Greenbark realized that Jennir was a Jedi, and gathered up his weapons, ready to strike. The Jedi Master was able to calm him down, telling him that changing circumstances meant that the two were on the same side. To Jennir's sadness, Greenbark confirmed to him what he had feared—throughout the galaxy, many Jedi had been slaughtered by the soldiers under their command."}, {"tag": "p", "text": "Greenbark decided he could trust Jennir, as they had a common enemy, and began to lead the Jedi back to the Nosaurian settlements. En route, Greenbark told his companion of his people's recent hardships; their main export, rikknit eggs, had been their key to gaining a place within the Galactic Republic, but the Republic had refused their entry and cracked down on the exportation of these eggs. With few other options, they threw their lot in with the Separatists. This information had never been given to Jennir, who found himself warming up to the Nosaurian people after hearing of their plight. Greenbark's fellow Nosaurians, however, were less easily persuaded that the Jedi, whom they had been fighting against for months, was now a friend; upon meeting a group of the natives in the forest, Jennir was attacked. They ignored Greenbark's pleas, though under the orders of Commander Rootrock, they eventually backed off. Rootrock and Jennir conferred, and the aged commander told Jennir of the supposed grab for power the Jedi Order had made on Coruscant. They both knew such allegations to be false. Rootrock attempted to recruit Jennir into his army; without the Separatist droids, they were susceptible to attack from the newly formed Galactic Empire, and Jennir could provide them with protection and leadership in battle. Jennir, however, wished to visit the Jedi Temple on Coruscant to witness the extent of Order 66 for himself. He promised to join Rootrock's militia when he returned if the commander provided him with a means of transport."}, {"tag": "p", "text": "Rootrock agreed, and Jennir departed for Coruscant—now renamed \"Imperial Center\"—shortly thereafter. Once there, he made his way to the Jedi Temple, which had been closed off to the public. Many had gathered around the building, including several Jedi, though they kept their identities secret. Jennir could do nothing but watch as a young Jedi, calling for the Order to be rebuilt, was cut down by clone trooper blaster fire; if Jennir had revealed himself, he too would have been killed. The crowds dispersed, though Jennir sought out another Jedi Master, a Bothan by the name of Kai Hudorra, who had also witnessed the event. The two spoke briefly, Hudorra encouraging Jennir to dispose of his hidden lightsaber and forget that he had ever been a Jedi. Jennir, though, had made promises to Rootrock, and refused. He attempted to recruit Hudorra to his cause, but the old Bothan was adamant that he would live out his life in anonymity. Jennir left Coruscant, feeling that it had been a complete waste of time to have made the excursion in the first place, though he came away with a renewed belief in the Jedi way."}, {"tag": "h3", "text": "Battle of Half-Axe Pass"}, {"tag": "p", "text": "Jennir returned to New Plympto, upholding his promise to Rootrock, and became a general among the Nosaurians' armed forces. The Imperial forces remained on New Plympto, hoping to purge the world of its Separatist presence; however, under Jennir's leadership and guidance, the Nosaurians fought back. They principally used guerrilla warfare, attacking Imperial forces in valleys and quickly retreating back to their forest dwellings. Jennir found that he still had several allies in the planet's main spaceport, and used them as spies; they told him of any Imperial arrivals on New Plympto. Despite this, however, the Nosaurians incurred heavy losses during their skirmishes with the Empire, and after several weeks of warfare, Jennir knew that the Nosaurian Separatists would eventually be defeated by the Empire."}, {"tag": "p", "text": "Some time after Order 66, the Nosaurians themselves realized they would die fighting, and made arrangements for their loved ones—children, wives, and parents—to be transported offworld. Jennir led what little remained of the Nosaurian forces during the Battle of Half-Axe Pass. The Nosaurians did poorly in the initial stages of the conflict, and Jennir—who had taken to using conventional blasters in place of his lightsaber—knew they would likely perish fighting. Bomo Greenbark was tasked with evacuating the Nosaurian civilians, escorting their single transport toward the planet's spaceport so they could travel to Sullust; Jennir, Rootrock and the others held on to their lives knowing that for every extra minute they occupied the Imperials, the civilians would have that much longer to escape. The Imperials continued their onslaught, killing General Rootrock and Commander Limbfree and bringing in heavy TX-130T fighter tanks, which the Nosaurians were unable to defend against."}, {"tag": "p", "text": "Greenbark eventually returned to the fighting, having ensured the departure of the civilian transport. Jennir told his friend of the situation, and pleaded with him to order a retreat. The Nosaurians refused, knowing that holding the Half-Axe Pass was a key part of their attempt to evacuate their families. Jennir improvised, using his lightsaber to cut down a large tree, which damaged an Imperial tank and blocked the path of further vehicles. He planned to use this tactic to continue distracting the Empire while the other Nosaurians made a retreat. The stormtroopers had realized this, though, and when Jennir moved into position to cut down the next tree, a powerful blaster shot from one of the Imperial tanks sent him and Greenbark sprawling. The tree was upended and the two soldiers, unconscious, fell into a pit created by the tree's movement. As such, they avoided the rout that followed, in which every single Nosaurian was killed by the attacking stormtroopers, even those who had surrendered."}, {"tag": "h3", "text": "The Uhumele"}, {"tag": "p", "text": "After some time, the two awoke and worked together to climb out of their pit, eventually stumbling upon the battlefield where the Nosaurians had been slaughtered. After seeing the bodies of their comrades, which upset the pair, Greenbark wanted to launch a suicide attack against the Imperials there and then. Jennir's counsel prevailed, however, and the two covertly made their way into the planet's main spaceport so that they could find passage offworld. Once they had arrived, however, the Jedi noticed that the port was nearly filled with docked and berthed ships; they had expected it to be deserted, with many spacers ferrying the Nosaurian women and children to various parts of the galaxy. Suspicious, they skulked around the port for a time, eventually entering a smuggling ship called the Uhumele. A woman, Crys Taanzer, was acting as a sentry, though Jennir managed to silence her when she noticed the two in her ship. They walked into the ship's main entertainment area, however, where the entire crew of the Uhumele had gathered—the captain, Schurk-Heren; Mezgraf and Ko Vakier, who acted as gunners and bodyguards; the navigator, Lynaliskar K'ra Snyffulnimatta; and Meekerdin-maa and Janks, the ship's engineers. Once Jennir told them of his and Greenbark's situation—omitting the fact that he was a Jedi—Heren agreed to transport them to whatever destination they wished; he was no friend of the Empire, either. They told him of Greenbark's family, and that the refugees should have arrived earlier in the day. Greenbark's family and all the other civilians, however, were never in the spaceport, as their transport had been intercepted by the Empire. To Greenbark's immense distress, Heren told them that all of those captured had been sold to slavers on Orvax IV."}, {"tag": "p", "text": "The two outlaws were given quarters on Heren's ship and told that they could stay with the Uhumele for as long as they wished. Despite Jennir's attempts to calm him, Greenbark was still distraught at the news of his family's fate. They had little time to settle into their quarters, though; Crys Taanzer reported that Imperial stormtroopers were searching every ship in the starport, and Heren, who had illicit cargo of his own, called a meeting in his lavish living quarters. The Yarkora captain informed the crew of the situation, and asked them what course of action they each wished to take. Several of the crew were eager to attempt to blast their way out of New Plympto, but Jennir, knowing they would be destroyed before they were successful in any such attempt, proposed an alternate plan. If all of the other ships in the port took off simultaneously, the Uhumele would be able to escape in all the commotion, according to the Jedi Master. The plan was shot down by the crew, who had doubts about the trustworthiness of some of the other ships docked on New Plympto. Determined to see himself and his friend offworld, Jennir decided to give the other ships a reason to leave."}, {"tag": "p", "text": "He left the Uhumele and made his way back into the jungle, hiding in the underbrush and lying in wait for an impending Imperial convoy. As the convoy passed, the Jedi Master killed a lone stormtrooper of the 501st Legion, taking his armor. Jennir returned to the city, now disguised as a stormtrooper, and commandeered a V-wing starfighter. After contacting the crew of the Uhumele and telling them to prepare to take off, he began firing on parked vessels, with the intention of scaring the various crews into fleeing. With the Uhumele in front, every ship in the spaceport took off, leaving the Imperials confused and stretched for personnel. ARC-170 starfighters were sent in pursuit of Schurk-Heren and Jennir, though the combined firepower of Jennir's starfighter and the Uhumele held them at bay. When they reached space, Jennir docked with the other ship and they set off into hyperspace."}, {"tag": "h3", "text": "Journey to Orvax IV"}, {"tag": "p", "text": "The Uhumele made inroads towards Orvax IV, and Jennir, exhausted after the day's exploits, was treated to a feast of fine cuisine prepared by the ship's Togorian chef, Mezgraf. A former slave on Orvax IV himself, Mezgraf told Greenbark and Jennir of the planet's horrors. Greenbark was appalled and extremely worried for his daughter's and wife's safety, though Jennir urged him to remain hopeful for the future. Jennir, however, was having difficulty holding on to that hope himself. He was unsure of what path to take in life, and was frightened at the prospect of the Sith wiping out all of the Jedi. Jennir was also becoming suspicious of Heren's hospitality towards the two of them, and began to wonder if the Yarkora had an ulterior motive in aiding them. He voiced his concerns to Greenbark, though the Nosaurian reasoned that their assisting the Uhumele in getting off-planet made Heren indebted to the pair. Jennir's suspicions did not subside, though."}, {"tag": "p", "text": "Eventually, Schurk-Heren announced that they had arrived at Orvax IV. Mezgraf and Heren believed that it was likely that the Resa and Mesa Greenbark had already been separated and sold, though Bomo and Jennir were determined to track them down. They had realized that, should they locate the group of Nosaurians taken from New Plympto, Bomo would have to leave behind many of his friends when rescuing his family; they would be unable to release so many prisoners in secrecy, though Bomo felt that he would be strong enough to leave his fellow Nosaurians. Eventually, after several members of Heren's crew pledged their assistance, Jennir formulated a plan."}, {"tag": "p", "text": "Greenbark, Jennir and three of the Uhumele's crew—Ko Vakier, Mezgraf, and Meekerdin-maa—infiltrated Orvax IV's slave district, their identities and species concealed by large cloaks. Meekerdin-maa, a short Tintinna, and Greenbark, who was also considerably shorter than Jennir and the others, wore Jawa disguises. On the planet, Mezgraf guided them to where the slaves were kept, though en route they inadvertently caused a Vulptereen driving a swoop bike to collide with a huge, lumbering creature walking on Orvax IV's streets. The creature became flustered and began to stampede through the boulevard. Mezgraf managed to climb onto the beast's back, though, and subdued him, moments before he would have trod upon Jennir. In dismounting the creature, however, Mezgraf accidentally revealed the tattoo on his bicep that marked him as a former slave. A nearby being alerted the T'surr guards to his presence, though Jennir was able to use a mind trick of the Force to dissuade them. Not wanting to reveal his Force-sensitivity to the others, he told them that he had bribed the guards."}, {"tag": "p", "text": "Moments after the T'surr left, Greenbark discovered the location of a group of female Nosaurian captives, and rushed off to speak with them. Jennir and the others gave chase, but so did several more T'surr guards. Ko Vakier, Mezgraf, and Jennir arrived just in time to save Greenbark and Meekerdin-maa from the guards' wrath, and managed to incapacitate or kill each of the T'surr. Bomo then spoke with the Nosaurian civilians, though they informed him that his wife Mesa had been killed just hours earlier trying to stop the slavers from taking Resa, who was now in captivity."}, {"tag": "h3", "text": "Straying from the path"}, {"tag": "p", "text": "Jennir told the others to return to the Uhumele, and that they should depart Orvax IV if he did not arrive back at the ship by midnight. The others left, Mezgraf having to physically haul Greenbark away, though before he went to follow the others Meekerdin-maa revealed that he knew Jennir was a Jedi, hoping for the Force to be with him—a phrase often used between Jedi. The rest of the Nosaurian captives, trapped in a large, caged pit, pleaded with him to rescue them, though Jennir ignored their cries and left them. If they were to be freed, his chances of finding Resa Greenbark would have dropped considerably."}, {"tag": "p", "text": "Jennir spent most of his day making subtle and discreet inquiries into the identity of the slaver who sold Resa, eventually finding success. The seller was a wealthy Chagrian by the name of Orso Meeto; after using some more overt methods, Jennir discovered he lived in a penthouse apartment in one of Orvax IV's richer districts, and that he would be staying in his home that evening. Armed with just a single blaster pistol, Jennir ascended the many stories of the building until he reached Meeto's abode. He climbed up onto a balcony, opening a set of doors into a room where Meeto was watching a holographic Chagrian female dancing. Before Meeto could summon his guards, Jennir held him at gunpoint, showing him a tiny holograph of Resa Greenbark, and asked where the girl was currently. Meeto responded that she had been sold to a man from Esseles named Dezono Qua. With all the information he needed, Jennir was left with a difficult decision: kill Meeto and escape without incident, or leave him alive and able to warn Qua. Realizing that he would be departing the path of the Jedi forever, Jennir fired at him from point-blank range, killing him instantly. He initially felt that he had made the right decision, and was exhilarated by the freedom of not having to follow the Jedi Code. The Chagrian's guards, however, entered the room at the sound of the shot. Jennir dodged their blaster bolts and leaped out the balcony window, beginning a lengthy plummet towards a domed building. As he fell, he again began to have doubts about his choices in life, and regretted breaking the Jedi Code."}, {"tag": "p", "text": "Jennir smashed through the dome's roof, landing in a heap on a group of Neimoidians. He fled the building, though Meeto's Chagrian bodyguards pursued him and contacted the planet's other security organizations. Jennir eventually managed to evade them, though, arriving at the Uhumele just minutes before his self-appointed deadline at midnight. He handed over Dezono Qua's coordinates, and Bomo thanked him profusely, but Jennir wished to be left alone. He mulled over what he had said to Kai Hudorra on Coruscant, that he would continue to be a Jedi, but realized that in just a few months, he had already made a great many compromises and had committed foul deeds. He began to wonder how much more of his old self he could give for his friends."}, {"tag": "h3", "text": "Vengeance"}, {"tag": "p", "text": "The Uhumele made the trip to Esseles in several days, arriving at the planet's capital city, Calamar. Once there, Jennir inquired with local officials about Dezono Qua, learning that the Human was the only heir to an affluent family and that he lived alone in a heavily defended mansion atop a steep mountain. Qua was a recluse, and though the local authorities had suspicions about him, his bribes dissuaded them from looking into things. Jennir told the others that Qua's fortress was guarded solely by battle droids, and volunteered himself and Greenbark to carry out the raid on the mansion, since they both knew the capabilities and limitations of battle droids from their time serving in the Clone Wars. Heren and his crew, however, wished to be a part of the attack on Qua and pledged their assistance."}, {"tag": "p", "text": "They flew the Uhumele towards Qua's fortress, landing just outside the perimeter. Qua's IG-series security droids went to investigate; Jennir, Greenbark, and all of the Uhumele's crew burst out of the ship with all guns blazing, and were able to easily destroy the first wave of droids. Greenbark, Meekerdin-maa, and Janks made for where the droids could be deactivated, while Heren, Mezgraf, and Ko Vakier assaulted the mansion's ground floor. Jennir used the Force to leap up onto the higher levels of the fortress, using the abilities afforded to him as a Jedi to destroy any droids he came across as he traveled towards Qua's location. He used the Force without restraint, reasoning that if he rescued Resa Greenbark, his earlier unsavory deeds would be redeemed. Bomo's team eventually powered down the droids, so Jennir was able to reach the landing platform with Qua's ship before Qua himself arrived."}, {"tag": "p", "text": "Jennir held the recluse at gunpoint, demanding to know where Resa was being held. Qua offered to bribe Jennir, though he refused, and Bomo—who had arrived with Meekerdin-maa and Janks, as well as Heren's group—reiterated his friend's demand. Qua simply mocked them, telling them that Resa, like all the other younglings he had purchased, was dead—he had eaten her. Bomo, Ko Vakier, and Mezgraf all prepared to attack the Human, but Jennir reacted the quickest, shooting him three times in the chest. Bomo was furious at Jennir for killing Qua; the Nosaurian wanted to find vengeance himself, and shouted that Jennir had no right to kill the man. Jennir knew that Bomo's killing Resa's killer would not bring her back, and believed that murdering Qua would impact negatively on his friend. Bomo attacked his companion, and in the process inadvertently revealed to the Uhumele's crew that he was a Jedi."}, {"tag": "h3", "text": "Alone"}, {"tag": "p", "text": "Soon after Qua's death, the others left Jennir on Esseles, departing in the Uhumele. Some, like Mezgraf, expressed their desire for Jennir to remain with the crew, but the majority of them were angry at him for killing Qua and not allowing Greenbark to have his revenge. Bomo's anger toward his friend eventually subsided, though Jennir and the Uhumele were on opposite sides of the galaxy by that time. Jennir decided to continue his life alone, and vowed to himself to remember and continue practicing the principles he had been taught as a Jedi Padawan. He drastically changed his appearance, distancing himself from his Jedi past physically; though tempted to dispose of his lightsaber, he eventually decided to keep it. He departed Esseles in Qua's ship determined to allow the Force to guide his future. He took H2, Qua's pilot droid, on his travels, and it followed him whenever he ventured off ship. The two were not on great terms, though, as H2 held a grudge against Jennir for murdering Qua."}, {"tag": "h3", "text": "True balance restored"}, {"tag": "p", "text": "Eventually, Jennir ran extremely low on funds. Reasoning that even a fugitive Jedi had to eat, he began to search for work, eventually finding his way to Cato Neimoidia. The former Trade Federation and Separatist planet was ripe for plundering, making it a haven for hordes of scavengers and grifters from across the galaxy. His search for a job led him to a shady Cato Neimoidian cantina, reputed as a place to find off-the-record jobs without hassle. As each job offer was posted directly by the client, who then chose from its applicants, it was a closed system for hiring mercenaries, smugglers, and their ilk, hidden from the Empire. For a time, though, Jennir was not able to find a job that would allow him to continue following the teachings of the Jedi, and he accepted none. He grew hungrier, more broke, and more desperate."}, {"tag": "p", "text": "One day, while still waiting in the cantina, Jennir's attention was attracted to a woman entering the establishment. Dressed in a large, hooded robe that concealed her appearance, she possessed a distinctive scent, which piqued Jennir's interest. The rest of the cantina's denizens promptly took notice of her, too, sensing that a new job was opening up. As the woman passed Jennir, he felt that her job might be different from the rest, one his Jedi scruples would permit him to carry out. Before long, her description of the job was broadcast on the cantina's holoscreen system. Named Ember Chankeli, she was in need of a warrior or security guard to rid her town of a gang, either “by guile or by force”. Jennir believed that it was a job he could accept, as, according to Chankeli, dealing with the gang would make her town safe again— it didn't hurt that it also paid well. He noted the time and place where he could meet her to apply for the job, but another patron of the cantina stopped him before he could leave."}, {"tag": "p", "text": "A Chistori—strong and belligerent, but not very bright—claimed the job was his. After the Chistori lunged at him, Jennir sent him sprawling onto the floor, but the Chistori was quick to his feet, and launched another charge. This time, Jennir pushed him through the cantina's window, and sending him onto the walkway below. To ensure the Chistori was incapacitated, Jennir kicked him in the head, then turned to leave for his ship. He met up with H2, who mocked him for getting into yet another scuffle. They returned to the ship, and Jennir hoped that the meeting with Chankeli in the morning would see his luck change."}, {"tag": "p", "text": "The next day, Jennir found Chankeli at the arranged meeting place, though another hopeful job applicant was already present. Both Jennir and the other applicant, a young Human male, pressed Chankeli for more details on the job before committing to anything. Hesitantly, she told them that her town's flourishing tourist trade had come to a halt as a result of the gang setting up a base in the area, and she wanted things back to the way they were before the gang's arrival. When she informed them that the gang had over forty members, the other applicant couldn't fathom how two men would triumph over them, but Jennir was confident enough in his abilities. Chankeli suggested they infiltrate the gang, which was recruiting, and take it down from within, sowing discord and dissension between its members, making the gang's leader and his chief enforcer turn on each other."}, {"tag": "p", "text": "Before Chankeli could further elaborate, Jennir's Chistori rival arrived with a gang of cronies, intent on taking the job himself. Jennir goaded the Chistori into attacking him and swiftly tossed the brute aside. One of his companions, a Kilmaulsi, charged at Jennir but again the Jedi Master was able to deal with him, with the help of a subtle application of the Force. With the attackers all incapacitated, Chankeli informed Jennir that the other applicant had fled, and that the job was there for his taking, if he wanted it. She told him more about how he could join the gang; they were holding a recruitment drive and he could join easily. Chankeli offered to provide him with a room at her \"inn\" in the town, but made it explicit that he must not converse with her in public while in the town. When she revealed that the gang was also involved in slavery, Jennir rashly accepted. Chankeli questioned his motives briefly, but then brushed them aside. She then revealed that, in fact, there were more than fifty members in the gang. She provided him with credits and the coordinates to her town, where he would rendezvous with her in two weeks' time."}, {"tag": "p", "text": "Despite knowing that he should have refused the job for a number of reasons, Jennir felt that he was finally on the road to restoring his true balance."}, {"tag": "h4", "text": "Job on Telerath"}, {"tag": "p", "text": "After arriving on Telerath, Jennir Met found water taxi driver named Fish who he hired on as retainer. He soon learned from Fish that there were in fact two gangs, the Slavers and the Spicers, who his employer, Chankeli, did not mention. With Fish's help, Jennir found his way to the Slavers' tryouts. According to the local Sword Law, the Slavers' head enforcer, Mors Demanna, dueled any prospects in one on one combat, to test their abilities for the gang."}, {"tag": "p", "text": "While in the crowd, Jennir met a young teen named Dado, who was about to fight in the ring in an attempt to join the gang. Knowing that Demanna clearly had much more skill than the boy, as soon as Dado entered the ring, Jennir used his blaster to disarm every one of the Slavers from their swords. One of the Slavers, infuriated, took out his own blaster and attempted to shoot Jennir in the back. Demanna stopped the slaver himself, and informed Jennir of the local Sword Law, which none were exempt from. The law stated that all disputes should be settled with a sword, thereby peace would be preserved as well as honor. Demanna admonished Jennir, then turned and killed his fellow slaver. He then sliced off Dado's arm, telling him to learn his place. Jennir was furious at Demanna's cruelty, but knowing he couldn't jeopardize his mission, he stayed his hand. Chankeli, who had been covertly watching the confrontation, summoned Jennir discretely, and told him everything was going as planned. Jennir was not so sure."}, {"tag": "h4", "text": "A new war"}, {"tag": "p", "text": "Jennir met Chankeli again at her hotel, Ember's Fire, where he got a room. She warned him about Demanna's men, who blamed Jennir for the death of their comrade, cautioning him to lay low for a while. When he asked about the Spicers, Chankeli avoided the question, telling him to take care of \"JUST the Slavers.\" She provided him with half his payment, telling him to stay in his room."}, {"tag": "p", "text": "After they parted company, Jennir encountered Nikollane, the mother of Dado, who had lost his hand to Demanna. Because the boy lacked proper medical care, Jennir volunteered his service, saying he had seen many such wounds before. After doing what he could to help, Jennir left on a mission, thanks to useful information that Chankeli had let slip about the Spicers during their chat."}, {"tag": "p", "text": "With help from Fish and H2, Jennir made his way to Telerath's second moon, where the Spicers had their processing plant. After noting that some of the slaves the Spicers used as labor were Nosaurians, H2 went back to the ship, leaving Jennir to wreak havoc on the gang members. Using the \"Sword Law\" against the Spicers, Jennir used his blaster with extreme prejudice. As he took down the guards, Jennir noted how his role had changed; as a Jedi, he had been a peacekeeper, whereas now, without laws or the Republic, he had become a peacemaker, working against those who preyed on the helpless. After breaking a standoff with a guard who threatened a Nosaurian slave (who had recognized Jennir), he told the slaves to take the Spicer's ships and leave for a safer place, saying that he still had work to do. He then returned to Telerath, after leaving a knife from one of the Slavers that would be easily identified."}, {"tag": "p", "text": "Upon his arrival, Jennir met again with Demanna, who brought him into the estate - and presence - of his master, Boss Musori. At Musori's command, Demanna engaged Jennir to test his skill with a sword. Jennir struggled somewhat, being more used to handling a lightsaber, but managed to give a good account of himself nonetheless. After being defeated, Jennir left, sowing a seed of discord between the two Chagrians by making a jab at Demanna's honor, questioning why he took orders from a \"civilian\" like Musori."}, {"tag": "p", "text": "At a sidewalk cantina shortly thereafter, Jennir was approached by four members of the Spicers, sent to bring him to their leader. Bringing the guards to their master after humbling them, he told Ken-Kiba, leader of the Spicers, that the Slavers had destroyed their spice refinery. After receiving no response from the comm, Ken-Kiba mobilized his men. Jennir then left, telling H2 that things would begin to happen - very quickly."}, {"tag": "p", "text": "Returning to Chankeli's hotel, he found out that Dado had left in another attempt to join the Slavers. Jennir immediately departed, and upon finding the young man, reasoned with him, explaining the difference between strength and honor. Just then the Spicers attacked Musori's mansion, having found the Slaver knife Jennir had planted as evidence. As Dado remarked in astonishment that they were breaking the Sword Law, Jennir replied that the erupted war had nothing to do with honor, only destruction."}, {"tag": "p", "text": "Jennir returned with Dado to Ember's Fire and encouraged everyone to escape, but it was too late; Chankeli had figured out Jennir's machinations and reported to Ken-Kiba, who came back to the hotel with her just in time to capture Jennir and commence beating him for the damage he'd caused. With help from Nikollane, he escaped through a trapdoor to the river below, where he was rescued by Fish. He awoke the next morning in Fish's house, where his retainer brought him up to speed on what had happened the night before. The Slavers were all dead (with the notable exception of Demanna), and Ember Chankeli was being held prisoner by Ken-Kiba, who believed that she had manipulated him through Jennir for her own benefit. H2 had been shot while getting information for Fish, although he'd made it back with Jennir's sword before shutting down. Jennir then entered a healing trance in order to speed up the recovery from his injuries."}, {"tag": "p", "text": "Not wanting others to suffer from the consequences of his actions, he planned to stop the Spicers. Unfortunately, the gang figured out where he had been hiding, and came to capture him. While Jennir hid, Fish was taken prisoner, as the guards figured they could use him to find Jennir. Emerging from his hiding place, Jennir retrieved his lightsaber from where he had been hiding it since his parting with Bomo and the Uhumele's crew."}, {"tag": "p", "text": "After liberating the prisoners at Chankeli's hotel, he faced off with Demanna once again, easily defeating him this time. When asked how, Jennir replied that he had played to Demanna's pride and allowed him to win their first encounter. Freeing Chankeli from her bonds, he went to where the Spicers were tormenting Fish for information on Jennir's location. Drawing their attention, Jennir prepared to fight. When Chankeli, who had followed Jennir, asked him why he was doing this, he activated his lightsaber and replied that it was his job."}, {"tag": "p", "text": "Chankeli agreed to join Jennir, and they set off for Vondarc, where Chankeli claimed to have family, on Desono Qua's starship."}, {"tag": "h3", "text": "On the run with Ember Chankeli"}, {"tag": "p", "text": "Jennir repaired H2 during the flight. Before they could reach Vondarc, however, they were discovered by the Imperial cruiser Harvester in the Prine system. Chased by Imperial fighters, Jennir and Chankeli sought refuge on the planet Prine. Having taken damage, their ship crashed on Prine's Wasteland."}, {"tag": "p", "text": "After wandering the wilderness for two weeks, Chankeli confessed to Jennir that she had no family on Vondarc, and hoped to start a new business in the planet's busy port. Soon afterwards, Jennir, Chankeli and H2 encountered a caravan of slave traders. While Jennir climbed on a cliff to survey the area for water, Chankeli ran towards the brigands with loud cries, hoping to be rescued, and was kidnapped. Neither knew that Darth Vader, assassin Falco Sang, and the crew of the Uhumele (together with Beyghor Sahdett, another fugitive Jedi), were on their tracks."}, {"tag": "p", "text": "Needing transportation, Jennir used the Force to tame a native animal, and was able to chase after the caravan. As they stopped to rest for the night, however, Jennir noticed that the creature had its leg injured in the struggle. While H2 went to fetch plants for the creature to eat, Jennir focused on healing his mount. Due to his meager connection to the Force, he passed out from the effort. When he awoke, it was morning and the creature's leg was fully healed. Jennir then proceeded to catch up to the slavers. He attacked the caravan directly, and fought his way through them before reaching Chankeli and her fellow captive, Maddie. Unfortunately, Sang had caught up to him as well and disabled the hover barge, causing Chankeli to fall overboard. Deflecting sniper fire from Sang, Jennir was unable to help her. Chankeli pleaded with Jennir to take Maddie and run, which Jennir was forced to do. Finding refuge in a valley, Jennir instructed his mount to protect Maddie and guide her back to her village. Though Maddie initially refused to leave, Jennir told her that their attacked would shoot to kill, unlike the slavers. He promised her that he and Chankeli would meet with her in her village."}, {"tag": "p", "text": "Returning to the site of the fallen barge to ascertain what trap Sang had planned, Jennir spotted Chankeli gagged and bound to a stake. He guessed that Sang was in hiding, expecting him to just walk up. Therefore, he disguised H2 as himself with his cloak and hat to simply walk up to Chankeli; Sang shot the droid, after which Jennir revealed himself. As he threw the assassin against the barge, Sang revealed that it was H2 who had brought him there. Denozo Qua's family had hired him to hunt down Qua's murderers. Sang had tracked Jennir all across the galaxy through H2, until the incident on Telerath, after which the droid stopped transmitting. Sang had then proceeded to track Qua's ship, which Jennir was still using, by hacking Imperial records, killing Janks as a bonus."}, {"tag": "p", "text": "Sang then gave the signal for his droid Izee, who was in a sniper position, to fire, hitting both Chankeli and H2 in one shot. Jennir ran to Chankeli as Sang ordered Izee to fire again. Jennir effortlessly deflected the shot with his lightsaber without even looking, directly into Izee, destroying the droid, to the bounty hunter's shock. As Sang took off, Jennir called to H2 to help him but the droid, damaged by Sang, shut down. Jennir then desperately tried to heal Chankeli as he had with the creature, but again, he passed out from the effort."}, {"tag": "h3", "text": "Reunion with Uhumele crew"}, {"tag": "p", "text": "When Jennir came to, he saw Greenbark standing over him. Greenbark apologized for being mad at him, as he now understood that Jennir killed Qua to spare him from taking vengeance. Jennir then explained Sang's part in Janks' death, and Greenbark sadly added that Sniffles and Crys Taanzer had died too. Jennir then feared that Chankeli met the same fate, only for Bomo to reveal that she was alive and recovering aboard the Uhumele. Jennir then impulsively ran into her room and kissed her, causing the crew to decide to leave them alone. He then broke off the kiss and stated his regret, as Jedi were supposed to control their feelings. Chankeli became concerned for Maddie's safety; Jennir went to Schurk-Heren to request that they return to Prine, but was refused, as an Imperial battle cruiser was searching the planet for him. Eventually the conversation shifted to Darth Vader as well as Sahdett himself, whom Jennir did not know. Schurk-Heren explained that he was another Jedi, but had assumed Jennir did in fact know him. Jennir explained that there had been thousands of Jedi, and while it was possible that they had met before, he did not remember. Greenbark then told Jennir of how they had met Sahdett and how he had saved them from Imperials, and that the Verpine had Jedi matters to discuss with Jennir, of which Jennir was happy to oblige."}, {"tag": "p", "text": "Jennir soon turned his attention back to Chankeli, now dressed in some of Taanzer's old clothing. As they spent some time alone, she could tell that he too was worried about Maddie. Even if she managed make it back to her home, he feared that he may have destroyed her hope that she may see the two of them again. He then embraced Chankeli, confiding sorrow over how dark the galaxy has become and that trouble may find them once again."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jennir was extremely loyal to the Republic, and even after it was abolished and the Empire formed, he held onto the ideals and principles on which the Republic was built. He also had fierce loyalty and kindness for his friends; he repaid Rootrock's providing him with a transport to Coruscant by leading the Nosaurians in combat, honoring the promise he had made. He genuinely cared about those whom he believed were being wronged and did whatever he could to help them. Jennir felt a need to repay Bomo Greenbark for saving his life in the aftermath of Order 66; he forsake the principles he believed in to try to find and rescue Bomo's family. Ultimately, though they were both very important to him, his friends were more important than his rules of personal conduct."}, {"tag": "p", "text": "Jennir was a man of action, often putting his life at risk where others would not. He could not sit back and do nothing like the crew of the Uhumele while on New Plympto, risking his life to create a diversion. Similarly, he broke into Meeto's home in order to procure Resa's location, and again led the attack on Qua's mansion on Esseles. Jennir was a natural leader; throughout his life, he led teams of clone troopers, the Nosaurian rebels, and the Uhumele's crew, earning respect for his endeavors. According to Bomo Greenbark, Jennir felt that, because he was a Jedi, he was automatically in charge and always knew what was best for everyone."}, {"tag": "p", "text": "Jennir held a deep attachment to the Jedi Order, and he respected and valued everything it preached. During the dark times which followed Order 66, he maintained his faith in the Order and its philosophies, refusing to believe that the Jedi had attempted to overthrow the Senate as had been reported. Although he did occasionally break the Jedi Code during the Great Jedi Purge, Jennir did not forget his Jedi heritage like Kai Hudorra suggested he do, and strove to continue to behave like a Jedi after leaving the Uhumele."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Jennir was very physically fit as a result of his Jedi training. His fitness, coupled with his Force-sensitivity, allowed him to jump, climb and fight with both effectiveness and ease. During his time serving with the Nosaurians alongside Bomo Greenbark and Rootrock, he fought on rugged, mountainous terrain, diving down steep hills to ambush stormtroopers. He also proved himself to be a proficient climber, ascending hundreds of meters up the side of Orso Meeto's apartment building with the aid of little equipment. He did similarly on Esseles, using just the Force to scale Dezono Qua's castle. Additionally, Jennir was adept at unarmed combat, outmatching stormtroopers on New Plympto, hulking security guards on Orvax IV, battle droids on Esseles, and mercenaries on Cato Neimoidia without the aid of a weapon."}, {"tag": "p", "text": "Dass Jennir was proficient at several Force powers and, like most Jedi, could handle himself with his lightsaber, using it on several occasions to create hurdles and obstacles for Imperial forces on New Plympto. Generally, though, Jennir preferred to use blasters during the Great Jedi Purge, utilizing both pistols and rifles, and sometimes both simultaneously. Jennir was also an accomplished pilot, outflying members of the 501st Legion on New Plympto despite flying a starfighter with considerably less armaments.\nHe was also able to perform a powerful Mind trick, using this power to make Bomo Greenbark, forget what he had heard and saw when confronting Jennir about keeping secrets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dass Jennir was created by Randy Stradley, under the pen name Welles Hartley, for the final story arc of Star Wars: Republic, Into the Unknown, where he was illustrated by Doug Wheatley. Jennir and Bomo Greenbark, two of the main characters in Into the Unknown, were again used by Stradley—this time under the alias of Mick Harrison—almost a year later in a new comic series, Star Wars: Dark Times. There were no plans for Jennir and Greenbark to appear again when Into the Unknown was published, though Stradley and Wheatley decided to use them for Dark Times's first story arc, The Path to Nowhere. Jennir featured prominently in The Path to Nowhere, though did not appear in subsequent story arcs. Randy Stradley, the vice-president of Dark Horse Comics, stated that Jennir would reappear in later Dark Times issues, which he confirmed via Darkhorse.com's monthly \"From the Editor\" feature. Jennir will be the main character in the five issue Blue Harvest story-arc starting in April 2009. He appeared in an online preview segment on MySpace Dark Horse Presents in January 2009 and appeared in the second segment in February. Jennir was briefly mentioned in The Force Unleashed Campaign Guide in 2008, and received an entry in The Complete Star Wars Encyclopedia later the same year."}, {"tag": "p", "text": "An early concept for Dark Times saw Dass Jennir with short hair, a decision that artist Doug Wheatley discarded at the last moment. Later, during the Blue Harvest story arc, this design was reused, with Jennir having shorter hair and a beard. Jennir has proved quite popular among fans, with many likening his physical appearance to that of Legolas, a character from The Lord of the Rings, though Doug Wheatley has stated that this resemblance is not intentional."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}