{"url": "Dathnaeya_Loessin", "categories": ["Category:Legends articles", "Category:Corellian Security Force officers", "Category:Females", "Category:Humans", "Category:Talusians"], "nodes": [{"tag": "h1", "text": "Dathnaeya Loessin"}, {"tag": "p", "text": "Dathnaeya Loessin was a Human female who served as a member of the CorSec on Talus during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dathnaeya Loessin was a member of the Corellian Security Force. She was originally trained by Agent Taarna, a distinguished member of the CorSec who became a friend and mentor to Loessin. By the time of the Battle of Yavin, Dathnaeya Loessin was working in the Dearic Capitol and was considered as one of CorSec's most promising officers."}, {"tag": "p", "text": "As the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic grew ever more intense with the Battle of Restuss, Dathnaeya Loessin believed she could no longer stand on the side without involving herself. However, she did not know which side to take. She discussed her trouble with Agent Taarna but the old man was not able to help her without harming his position in the CorSec. Circa 1 ABY, Taarna hired an independent spacer who already assisted him in the past in order to help Dathnaeya. In the meantime, the woman made an appointment to Captain Quellium and Colonel Ekirk, respectively Rebel and Imperial officers, both stationed in Dearic. Loessin then tasked the spacer to work with both officers in order to determine which faction was the most fair and rightful in that conflict."}, {"tag": "p", "text": "Rebel Captain Quellium requested the spacer to work with Trezya Nenei against the Nightstrike Soldier Hegemony, a group of mercenaries affiliated with the Empire. On the other hand, Imperial Colonel Ekirk tasked the spacer to work for Galiir Ac Yandar against the Aggregate Civil Liberties Organization, a medical supply company allied with the Alliance. Finally, the spacer made a detailed report to Dathnaeya Loessin who decided to join one of the factions in the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dathnaeya Loessin appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Dathnaeya Loessin was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}