{"url": "Dathomir_Magic", "categories": ["Category:Legends articles", "Category:Dathomir Magic", "Category:Force philosophies"], "nodes": [{"tag": "h1", "text": "Dathomir Magic"}, {"tag": "p", "text": "Dathomir Magic was the general name given to the use of the Force and Force powers by the Witches of Dathomir."}, {"tag": "p", "text": "Originally, the rogue Jedi Allya, who was exiled to Dathomir, taught the powers of the Force to her children there, giving them an evolutionary advantage over the planet's other inhabitants. After Gethzerion founded the Nightsisters, she developed her own brand of magic that her coven coined Shadow Magic, or more colloquially as magicks. As a result, the other witch clans took to calling their own practices Allyan Magic, believing that the Nightsisters had corrupted the beauty of Allya's original magic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "There were two schools of Dathomir Magic. The first, traditional Allyan Magic, followed rules put forth in the Book of Law, a tome of moral and ethical teachings kept and modified by each clan based on an original created by Allya for her daughters. The other, called \"Shadow Magic\" by its originator, Gethzerion, was the provenance of the Nightsisters that did not require chanting or other primitive rituals. The Nightsisters' book, the Book of Shadows, told of future glories that they would gather in the heavens."}, {"tag": "p", "text": "The practitioners of Dathomir Magic believed themselves to be casting spells rather than making use of the Force, and often were unable to make use of a \"spell\" without speaking its assigned name or performing the ritualized singing, dancing, chanting, and/or writing associated with it. The Nightsisters often attributed the work of the Force to the Spirits instead."}, {"tag": "p", "text": "The skills in the Force that the Witches of Dathomir possessed changed the many generations since Allya's arrival on Dathomir, as knowledge was shaped by traditions and time from what Allya originally taught. It seemed that the Witches were only gifted in certain aspects of Force use, some in healing, others in Force Whirlwind, and so forth."}, {"tag": "p", "text": "According to the Nightsisters, a shaman could channel the Spirits to create green spirit ichor, which—by the time of the Clone Wars—served as the primary basis of their magicks. The Water of Life was one such use of spirit ichor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, Mother Talzin and her Nightsister clan had used their magick to enhance Savage Opress's features: longer horns, taller, and larger physique, turning him into an avatar of primal anger. Talzin later used her magick to cure Darth Maul of his insanity and grant him prosthetic legs."}, {"tag": "p", "text": "Teneniel Djo of the Singing Mountain Clan of Witches was very impressed by Luke Skywalker's strength in the Force, and had never seen such strength before."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}