{"url": "Dathomir_Imperial_Prison", "categories": ["Category:Legends articles", "Category:Dathomir locations", "Category:Galactic Empire prisons"], "nodes": [{"tag": "h1", "text": "Dathomir Imperial Prison"}, {"tag": "p", "text": "Dathomir Imperial Prison was an Imperial prison complex located on the planet Dathomir in the Outer Rim sometime during the Galactic Civil War. The complex was overseen by Warden Vinzel Haylon."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The prison was overseen by the Imperial Inquisitor Olof. Prisoners kept here were thought to be some of the most dangerous to the Empire, and as such were left in this remote facility to be forgotten about. The prison was guarded by a regiment of stormtroopers and several AT-STs were also stationed here."}, {"tag": "p", "text": "Due to the threat posed by the native Dathomir Nightsisters, Emperor Palpatine eventually decided maintaining the Imperial forces at Dathomir was not worth the risk of the Nightsisters possibly escaping the planet. The prison was subsequently destroyed around 0 BBY by Zsinj, then captain of the Victory I-class Star Destroyer Iron Fist. The prison, including Imperial troops who survived the bombardment, were then completely abandoned by the Empire. For his action in destroying the prison and all means of transport off Dathomir, Zsinj was promoted to the rank of Admiral."}, {"tag": "p", "text": "However, within a year of the prison's destruction, the Empire realized the necessity of a maximum security prison on a low population world. The Empire reconstructed most of the prison on top of the remains of the old one."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet Dathomir had a long history of use as a penal colony. The first time it was used in this manner was around 600 BBY when the Jedi Knight Allya was exiled to the planet—her descendants became the Force-sensitive natives known as the Witches of Dathomir."}, {"tag": "p", "text": "Ever since, the Galactic Republic had used the planet as a place to send various criminals and outcasts of society. These people were left on the planet with no possible means of escape to live out the rest of their lives in solitude."}, {"tag": "p", "text": "Dolac Legasi was incarcerated in the Imperial Prison at one time. Smugglers Lucia and Tylar also conducted business from within the confines of the prison walls."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}