{"url": "Dathomir/Legends", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Dathomir locations", "Category:Dathomir system planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Infinite Empire planets", "Category:Low-gravity planets", "Category:New Republic planets", "Category:Sith planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Dathomir"}, {"tag": "p", "text": "Dathomir was an obscure planet in the Outer Rim Territories, located in the Quelii sector. It was somewhat smaller than Coruscant in size and thus a slightly-below-standard gravity. The planetary day was close to standard though the planetary year was 491 days. Dathomir had four moons."}, {"tag": "p", "text": "Dathomir was considered a temperate and beautiful planet by Human standards, with a varied terrain that included coastal lakes and tar-pits, thick forests and snow-capped mountain peaks, powerful rivers and broad savannas, small icecaps and dramatic rift valleys. Even under the New Republic, however, nine-tenths of the planet remained unexplored and uninhabited, with the population limited to a relatively small area along the edge of one of the three main continents, a zone of uplands and river plains bordered on one side by the unsailed ocean and on the other by vast expanses of desert."}, {"tag": "h2", "text": "Native lifeforms"}, {"tag": "p", "text": "Although the two cultures most closely associated with Dathomir were the ancient spacefaring Kwa and the Human group known as the Witches of Dathomir, it should not be overlooked that the semi-sentient species at the apex of Dathomir's native food-chain was in fact the mighty rancor."}, {"tag": "p", "text": "The fact that the rancors were semi-sentient often came as a surprise to unsuspecting offworlders. It is not clear whether they had made any independent progress towards basic tokens of civilization like kindled fire or shaped tools, and their social system and lifestyle were little different from those of many nonsentient animals: matriarchal herds led by herd-mothers roamed the landscape, hunting live prey for food. But they passed on their clan histories from generation to generation, and when they formed a symbiont circle with the planet's Human population in the last centuries of the Galactic Republic, they adopted basic armor and weapons. Under the New Republic, Tosh, herd-mother of the rancor group, associated with the Human Singing Mountain Clan, learned to read and write, and began to pass on this skill to the other rancors of her herd."}, {"tag": "p", "text": "Dathomiri rancors were also larger than off-world specimens, with full-grown adults in the range of eight to ten meters tall. This extreme size can in part be attributed to the planet's low gravity, which allowed native trees to rise up to eighty meters tall, but it may also reflect a more general effect of the sheer vibrancy of the planet's biosphere. The temperate climate and varied terrain had given rise to a dramatically diverse ecosystem, thriving with so much life that the air almost seemed to sparkle in the Force. Other native fauna included the rancor's major prey species, the drebbin and ssurians, as well as the burra fish, the simian pack-hunting purbole and the acid-jawed, insectile shear mite."}, {"tag": "p", "text": "However, several of Dathomir's most important species, notably Humans, had arrived on Dathomir over the millennia as the result of off-world contacts."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Republic History"}, {"tag": "p", "text": "Dathomir was originally the homeworld of a spacefaring species, the reptilian Kwa. By 100,000 BBY, the Kwa had built an Infinity Gate—the Prime Gate in a network of similar devices, used by them as a means of interstellar travel and as superweapons. The Infinity Gate was covered by massive pyramid-shaped structures known as the Star Temples, incorporating defensive systems to protect them from intruders. If the gate was ever activated, the planet housing the equipment could be collapsed into the Gate itself, along with the surrounding planets, moons and even suns."}, {"tag": "p", "text": "For reasons that are unclear, the Kwa species began to degenerate, ultimately losing the ability to speak or use technological tools. Apparently recognizing the path that their civilization was on, they sealed the Infinity Gate and the Star Temples and set guardians to protect the Temples—whuffa worms with thick hides and an impressive turn of speed. The degenerate descendants of the Kwa came to be known as the Kwi or Blue Desert People, and like the rancors they appeared to be simple herd animals living around the planet's arid Great Desert; but on occasion they still showed some surprising hints of intelligence, including a capability to create primitive tools and ornaments, and they possessed a collective memory of their former glory, and the importance of the sanctity of the Star Temples."}, {"tag": "p", "text": "By 36,453 BBY, the planet was already inhabited by a few Humans, whose origin is unknown. They were organized in tribal units with shamanistic beliefs. Some of their seers were brought on Tython in a Tho Yor ship and were among the founders of the Je'daii Order."}, {"tag": "p", "text": "Around 30,000 BBY, Dathomir was ruled by the space-faring Rakata. Using Force-based hyperdrives, they traveled to many worlds around the galaxy that possessed significant signatures in the Force, uniting them to form the Rakatan Infinite Empire. Of Dathomir they noted the rancor, and transferred some of them to their homeworld, Lehon, as curiosities. After five thousand years of galactic dominance, the Rakata retreated to Lehon following the outbreak of a plague."}, {"tag": "h3", "text": "Old Republic era"}, {"tag": "p", "text": "Linguistic evidence shows that the native language of the planet's Humans derives at least in part from that of an Outer Rim hegemony known as the Paecian Empire, dating their presence on the world to about 3000 BBY, being an adjunct of the Empire; after that the planet was then conquered by Drackmarian warlords."}, {"tag": "p", "text": "Dathomir was the site of a battle during the Great Galactic War. Around 1002 BBY, the Brotherhood of Darkness operated a Sith academy on the world that trained Sith Acolytes and apprentices."}, {"tag": "p", "text": "Later Dathomiri tradition would remember the initial Human population as the exiled creators of illegal battle droid armies, but it is not clear whether the settlers arrived in a single event, or whether the planet was in more continuous use as a penal colony over a period of centuries or millennia. It cannot even be said for sure whether the Paecian exiles were leaders or enemies of their Empire. What is certain is that by 600 BBY, the planet's Human population had become little more than the favorite food for the rancors, reduced to hiding in the thick forests where the mighty beasts could not follow them."}, {"tag": "h3", "text": "The Daughters of Allya"}, {"tag": "p", "text": "At that time, however, a rogue Jedi Knight named Allya was banished to Dathomir by the Jedi Council. She took the leadership of the survivors, teaching the ways of the Force to the exiles, and eventually to her own children. In later centuries, Allya was remembered as single-handedly transforming Dathomiri society, credited with enslaving the entire male population under her leadership, turning the rancors from predators to friends, pets, and war mounts, and codifying her teachings in the Book of Law. Some accounts even seem to suppose that she was a lone woman within an otherwise entirely male population. But in reality, these practices may have evolved over several generations, and the parallel with the matriarchal social structure of the rancors may be significant, especially given the symbiosis of the Human warrior-women and their mounts; but Allya's leadership undoubtedly laid the foundations of a unique culture, dominated by Force-using women who regarded themselves collectively as her descendants, known to outsiders as the Witches of Dathomir."}, {"tag": "p", "text": "Over the centuries, the total Human population of Dathomir grew to perhaps just over five thousand, based in a relatively narrow coastal area of one of the planet's continents: even under the New Republic, more than 90% of the planet remained unexplored. The Dathomiri came to be divided into a number of reasonably permanent local clan communities, which took their names from significant geographical features such as Singing Mountain, Frenzied River, and Misty Falls. These clans, each just a few hundred strong, accounted for almost the entire planetary population, but there were also small numbers of exiles who lived outside the clan communities, including the planet's dark-siders, called Nightsisters, who at times existed in sufficient numbers to form a distinct clan. In total, the clans could probably put at least a thousand warrior-women into the field, each of them a trained Force-user and many of them riding rancor mounts."}, {"tag": "p", "text": "The strength of the Dathomiri was discovered by the Jedi Order in around 340 BBY, when the Jedi academy ship Chu'unthor crashed into a tar pit on Dathomir. All attempts to retrieve the wreck were blocked by the natives, although it seems that some contacts were forged across the battle-lines: one young warrior-woman, Rell, who would survive to meet Luke Skywalker in the days of the New Republic, reminisced about Yoda as an \"old flirt\"."}, {"tag": "p", "text": "At some point, Dathomir appears to have been part of the Republic, and was classed as part of Quelii sector, but eventually, it fell into the space under the rule of the Drackmarians—another matriarchal warrior race, but this time methane-breathing aliens, for whom the planet held little real interest."}, {"tag": "p", "text": "Generations prior to the Clone Wars, a small group of Iridonian Zabraks originating from Rattatak, where their ancestors had crashed in a starcruiser, were brought to Dathomir during pirate raids. When the Human Nightsisters discovered that they could interbreed with Zabraks, they isolated them to a small part of the planet where they could draw from them at whim. The Nightsisters also sold some Zabraks and Zabrak-Human hybrids (and even some of their own) to the Rattataki. Prior to the reign of Talzin, Nightsisters were known to utilize various male castaways for slave labor; Talzin restricted the use of males to the Zabrak Nightbrothers."}, {"tag": "h3", "text": "Later History"}, {"tag": "p", "text": "Darth Sidious visited Dathomir in 54 BBY and was approached by the Nightsister Kycina, who begged him to take away her infant son from the life of a Nightbrother. Sidious agreed, taking in the Zabrak who would soon become his apprentice, the fearsome Darth Maul."}, {"tag": "p", "text": "In 31 BBY, the remaining Kwi were decimated by a clan of Nightsisters during their attempt to access the secrets of the Infinity Gate. They intended to use the device to destroy Coruscant, though their plot was thwarted by the Jedi Quinlan Vos, who was able to make contact with the Kwa, and assumed the role of Temple Guardian, to redirect the deadly wave aimed at Coruscant back at the Infinity Gate. Only the scattered ruins of the Infinity Gate and the Star Temple were left, and the Kwi disappeared once more to roam the deserts."}, {"tag": "p", "text": "During the Clone Wars, around 21 BBY, General Grievous led an attack on the Nightsisters, in retaliation for the betrayal of Asajj Ventress and Mother Talzin. This assault led to the extermination of almost every Dathomirian Nightsister and thus resulting in the original Human Nightsisters eventually returning to prominence on Dathomir."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "After the Great Jedi Purge, the fabled village of Aurilia was believed to be located somewhere on Dathomir, and it was rumored that Force-sensitive individuals, perhaps even Jedi, lived here in exile during the reign of the Galactic Empire.\nHowever, the Empire soon sent a fleet into Quelii sector to wrest territory from the Drackmarians, and Dathomir was claimed for the Empire by an officer named Zsinj, then commanding the Victory-class Star Destroyer Iron Fist. Around 2 BBY Emperor Palpatine reestablished a penal colony for important political prisoners, while the Imperial garrison hunted the remaining Kwi to near-extinction."}, {"tag": "p", "text": "One year after the Battle of Yavin, an outbreak of the Blackwing Virus took place and a large area of land was quarantined, including an Undead rancor. A group of spacers where eventually permitted entrance, and did several quest to keep people safe and defeat zombies, killing the Rancor mutant over time."}, {"tag": "p", "text": "Around this time, Tyber Zann and Urai Fen of the Zann Consortium arrived on the planet, seeking one who could unlock a Sith holocron in Tyber's possession. They found an imprisoned Nightsister, Silri, capable of doing so, and freed her from an Imperial prison."}, {"tag": "p", "text": "The Witchblood Clan was a group of mercenaries in Dathomir, who would usually attack both Rebels and Imperials indiscriminately on the planet."}, {"tag": "p", "text": "Shortly after the Imperials arrived, an exile from the Singing Mountain Clan named Gethzerion began to form a new clan of Nightsisters with Imperial encouragement, but when Palpatine realized the threat they posed in the Force, he quickly placed the planet under interdiction. Two Star Destroyers were stationed in the system to prevent further contact with the surface, and Gethzerion and her clan then enslaved the stranded Imperial garrison and their prisoners."}, {"tag": "p", "text": "As the war with the Drackmarians continued, Quelii sector was raised to the level of an Oversector, and Zsinj became the admiral, replacing his old Victory-class SD Iron Fist with a new Super Star Destroyer, which he rechristened Iron Fist, commanding the local Sector Group one of the largest combat fleets in the Empire. After the Battle of Endor in 4 ABY he refused to recognize the authority of the Imperial Ruling Council and declared himself a Warlord, quickly coming to rival the power of both the legitimist Imperial authorities and the rising New Republic. Dathomir became key to his plans with the discovery of vast loads of the key shipbuilding metals of neutronium, lommite, and zersium on the moon Koratas, and Zsinj had Rancor Base built in orbit of the planet to exploit the world's resources."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "Han Solo won the deed to Dathomir from Drackmarian Warlord Omogg in a game of sabacc in 8 ABY. Han's kidnapping of Leia Organa to the planet led to a chain of events that changed Dathomir forever. Luke Skywalker and Isolder followed Solo and Organa to Dathomir and encountered the Kwi and then the Singing Mountain Clan. The following conflict resulted in the destruction of the Nightsisters, Warlord Zsinj and Zsinj's orbital nightcloak. Free from the tyranny of the Nightsisters, the Dathomir entered an alliance with the New Republic, and Han Solo gave over his claim to the planet to Augwynne Djo, matriarch of the Singing Mountain Clan; while Augwynne's new title as Queen of Dathomir was little more than a constitutional formality, it also ennobled her granddaughter Teneniel Djo, and enabled her to marry Isolder, with whom she had fallen in love."}, {"tag": "p", "text": "Several Dathomiri subsequently went on to train with Luke Skywalker at his Jedi Praxeum on Yavin 4, including Kirana Ti and Damaya, but in 12 ABY, the forces of the Imperial Remnant returned to Dathomir, in the form of an expedition searching for the Infinity Gate, led by Sigit Ranth and General Vit."}, {"tag": "p", "text": "The Imperials overpowered the small New Republic enclave on the planet, and struck an alliance with a group of Dathomiri who styled themselves as a reborn clan of Nightsisters. Although Ranth soon departed the world when he discovered that the Infinity Gate was inoperable, General Vit and his garrison remained, tasked with imposing Imperial authority on Dathomir in alliance with the Nightsisters, investigating the Jedi artifacts on the Chu'unthor, and recruiting the planet's Force-sensitive warriors for the service of the Empire."}, {"tag": "p", "text": "Over the next months, Vit and his men reconditioned the old Imperial prison facility, and began rounding up the hostile Dathomiri and incarcerating them. Soon, the Singing Mountain Clan had been imprisoned in the camp, and prison columns from the defeated Dreaming River Clan were being marched under guard to join them. At this point, a miscellaneous group of heroes and rogues arrived on the planet, including renegade special forces officer and Jedi Praxeum trainee Dal Konur, as well as Imperial Royal Guard Kir Kanos. Working together with the Dathomiri resistance, they succeeded in ousting Vit and the Imperials; but neither the Empire nor the Nightsisters had been permanently destroyed."}, {"tag": "p", "text": "In 19 ABY, Brakiss arrived on Dathomir. A Force-sensitive Imperial Intelligence agent working with the faction known as the Second Imperium, he infiltrated the Great Canyon Clan and transformed them into a new group of Nightsisters, to serve as a recruiting pool for the Shadow Academy. Brakiss also engineered a social revolution, so that the new Nightsisters came to treat males as equals—adding escaped slaves from the other clans to their ranks. By 22 ABY, some Great Canyon Clan warriors, like Captain Garowyn, had already undergone thorough training at the Shadow Academy, and received commissions in the Imperial military."}, {"tag": "p", "text": "Later that year, however, Tenel Ka and Luke Skywalker infiltrated the Great Canyon and from there were able to reach the Shadow Academy. The clan's strength would be subsequently slashed by their defeat in the Second Imperium's attack on Yavin 4."}, {"tag": "h3", "text": "Galactic Alliance"}, {"tag": "p", "text": "By the beginning of the Yuuzhan Vong War, Dathomir was once again under New Republic protection, and although the planet fell to the Yuuzhan Vong during their initial attack in 27 ABY, the invaders soon realized that the native \"Jeedai\" were going to be harder to subdue. Dathomir was never fully conquered, and after the war's end, Jedi Master Streen, with the help of Dathomiri Jedi Kirana Ti and Damaya, did a great deal of work on Dathomir in 30 ABY and founded a Praxeum in order to train the local witches as Jedi. In the following years, Jacen Solo came to the planet and trained in the arts of the indigenous witches. Later, Luke Skywalker and his son Ben tracked Vestara Khai to the planet and were rejoined by Han, Leia, and Allana Solo. The Jedi became involved in some affairs on the world, including a resurgent clan of Nightsisters and a proposed Sith-Nightsister alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion places Dathomir in the \"Quelli sector\", a misspelling of the true Quelii Sector."}, {"tag": "p", "text": "According to Cracken's Threat Dossier, Dathomir was admitted to the Hapan worlds, this despite the significant distance separating the two."}, {"tag": "p", "text": "A character in Star Wars Galaxies stated that Dathomir was located in the Quelii system, but with the release of Star Wars Galaxies: Jump to Lightspeed, the system you travel to when traveling to Dathomir is called the Dathomir system. The game still presents these two conflicting pieces of information."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}