{"url": "Daughter/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Articles with elements from unlicensed sources", "Category:Deities", "Category:Females", "Category:Force wielders", "Category:The Ones"], "nodes": [{"tag": "h1", "text": "Daughter"}, {"tag": "p", "text": "The Daughter, also known as the Winged Goddess, was a shapeshifting depiction of the Light side of the Force who was part of The Ones, a family of powerful Force wielders on Mortis during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The beginning"}, {"tag": "p", "text": "Originally, over a million years before the Battle of Yavin, the Celestials, powerful beings with great knowledge, lived in the galaxy. According to Thuruht, the oldest of the Killik hives, the Ones—the Daughter, Son and Father—were what the Celestials became. Thuruht recalled the Ones coalescing out of a geyser on a jungle planet. For a while, the Ones lived in peace in their home close to the geyser. The Father warned his children to never bathe in the Pool of Knowledge, or drink from the Font of Power; however, his children eventually disobeyed him, with the Son drinking from the Font, giving him the power of the dark side, while the Daughter bathed in the Pool, which bestowed on her the power of the light side. The two siblings then proceeded to fight each other, with the Father desperately trying to keep the peace."}, {"tag": "h3", "text": "The arrival of the Mother"}, {"tag": "p", "text": "One day, a young woman somehow came to their world. She initially served as the Servant, catering to the Ones' every needs. Eventually, however, she became the Mother, caring for the Father and mending the relationship between the Daughter and Son. For years, the relationship between the Ones were stable and happy; however, things would not last as the Mother was still mortal, and as a result, she eventually grew old and unable to maintain the peace between the Son and Daughter, resulting in the two siblings once again resuming their war. One day, while the Ones were thus distracted, the Mother, desperate to stay alive, committed the forbidden. She quickly took a drink from the Font, then bathed in the Pool before any of the Ones could stop her. While this was going on, the Son attacked the Father, while the Daughter shielded him from the attack. The Father yanked her out of the Pool with the Force, but it was too late. The Pool and Font restored the Mother's youth, and gave her great power, knowledge and everlasting life, but it also corrupted her. From that moment on, the Mother ceased to exist, and became Abeloth, the Bringer of Chaos. She proceeded to attack both the Daughter and Son, bringing them to their knees; however, the Father saved them. He then took them off the world, leaving Abeloth behind. The Daughter and the Son then sought the aid of the Killiks, especially the Thuruht hive, joining their hive mind and lending them their knowledge and strength in the Force, together constructing Centerpoint Station, Sinkhole Station, and other devices to create the Maw in order to contain Abeloth. Afterwards, the Father took his children and moved to the world of Mortis, so he could control them and ensure the Force remained in balance. Whenever the Current of the Force was altered and the flow of time changed, Abeloth was able to escape, stirring up conflict, war, and disorder throughout the galaxy, thriving on fear, death, and destruction. On those occasions, the Daughter and the Son would return to the Killiks, and together they would reimprison Abeloth. This cycle would periodically repeat over hundreds of thousands of years."}, {"tag": "h3", "text": "The arrival of the Chosen One"}, {"tag": "p", "text": "When the Jedi Obi-Wan Kenobi, Anakin Skywalker, and Ahsoka Tano visited the planet Mortis, Daughter, as a paragon of light, came into conflict with her sibling, Son, a paragon of dark, and Father, a paragon of balance between the two, attempted to stop their confrontation. Eventually, Daughter shapeshifted into her other form, a great four-legged eagle with the same colors as her, and kidnapped Kenobi, and Son shapeshifted into his form, a great flying monster, and kidnapped Ahsoka Tano. Father brought Skywalker to an arena, where Daughter and Son landed with their captives. Skywalker was tasked by Father to save one or the other from death at his children's hands. Refusing to choose, Skywalker used a massive Force wave and disentangled his master and apprentice from the talons of the siblings, ultimately bringing Son and Daughter to their knees. This show of power illustrated to Father that he could trust Skywalker to be the Chosen One and keep his children in balance, as he himself was dying. Skywalker refused however, and boarding his ship with Kenobi and Tano, left Father and his children behind."}, {"tag": "p", "text": "The Daughter was present when the Son attacked and attempted to murder the Father, although she did not witness the assault herself. Convinced of the danger her brother posed by Kenobi, the Daughter left the Father to recover at the Monestary, and took Kenobi to the Altar of Mortis. There, she told him to retrieve the Dagger of Mortis, knowing that the blade could kill the Son. Traveling to the Son's tower, the Daughter pled with him to stop his attempts to escape Mortis, as well as confronting him over trying to kill their father. When the Son refused to stop, the Daughter engaged him in a heated duel, both unleashing their great power against each other. However, the siblings were evenly matched, and forcibly separated by the recovered Father. The Jedi tried to kill the Son with the Dagger, but the attempt was thwarted, and the Son obtained the blade for himself. Using the Dagger, the Son tried to kill the Father again, but at the last second, the Daughter leapt in the way, and was fatally stabbed in the back. As a horrified Son fled, the Daughter asked her father not to hate him, as to be destructive was the Son's nature. Nearing death, the Daughter chose to use her final moments, and last amount of power, to heal Tano, who had been poisoned with the dark side and left for dead by the Son. With Tano saved, the Daughter died, and the balance of the Force on Mortis became undone until both the Son and the Father died not long after."}, {"tag": "h3", "text": "After death"}, {"tag": "p", "text": "After the Daughter sacrificed her life, the Father buried her body within a tomb with the Dagger of Mortis laid upon her breast. She was later visited by the Son, the grave's final visitor, to retrieve the dagger. There, he admitted that he truly loved his sister."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Daughter was a selfless being who cared greatly for her family, particularly her father. She was very concerned for the Father's failing health, and looked after him when he was injured by the Son. In her greatest show of loyalty and love, the Daughter threw herself in front of the Dagger meant to kill the Father, sacrificing herself to save him. Despite their natures as polar opposites, the Daughter also loved her brother, the Son, pleading with him to stop his efforts to unbalance the Force and escape Mortis, and asking her father, even as she died, not to hate the Son."}, {"tag": "p", "text": "The Daughter was also a very compassionate woman, empathizing with the struggles of the stranded Jedi. She tried to help them as soon as they arrived by taking them to her Father, although she later participated in kidnapping Ahsoka Tano and Obi-Wan Kenobi as part of the Father's test. The Daughter's compassion was shown exceptionally in her final moments: she used the last iota of power in her body to heal Ahsoka Tano, and died content that she had saved her."}, {"tag": "p", "text": "It is worth noting that the Daughter was the only member of the Ones who was on good terms with both of her family members: both the Father and the Son were devastated by her death, neither having intended for her to die, despite their attempts to kill each other."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Although she rarely expressed her powers in the Force, the Daughter was a very powerful being. Like the rest of the Ones, she had no fixed material form, and displayed the ability to change her shape at will, particularly by assuming the form of a large griffin. She also possessed telekinetic abilities, being able to throw the Son around the room where they were fighting. She also had healing abilities, which she used to try to heal her injured father. During her fight with the Son, the Daughter showed the ability to deflect and absorb Force lightning, deflecting every blast the Son shot at her, and even redirecting a bolt back at the Son. At the conclusion of their duel, the Daughter was able to match the Son's lightning with an equally powerful Force Push, and, while she never managed to overcome him, the Son also failed to penetrate his sister's defense, proving that they were evenly matched."}, {"tag": "p", "text": "Only four beings were known to be strong enough to challenge the Daughter: the Father, the Son, the Mother (Abeloth), and the Chosen One, Anakin Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Daughter was voiced by Adrienne Wilkinson, the voice of Maris Brood in the Star Wars: The Force Unleashed franchise."}, {"tag": "p", "text": "The Daughter has a role in the apocryphal novella, Supernatural Encounters: The Trial and Transformation of Arhul Hextrophon by Joseph Bongiorno. In this story, the Daughter - whose true name was Niphal - manifested in the mortal realm through the Pool of Knowledge, which she used to sustain herself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}