{"url": "Davaire_Colmar", "categories": ["Category:Legends articles", "Category:Alliance Military officers", "Category:Humans", "Category:Imperial Army enlisted personnel of the Galactic Empire", "Category:Imperial defectors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Davaire Colmar"}, {"tag": "p", "text": "Lieutenant Davaire Colmar was a Human male soldier who deserted from an elite Imperial Army unit during the Galactic Civil War to join the Alliance to Restore the Republic. Colmar was tall and strong, with a chiseled jaw and close-cropped graying brown hair."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lieutenant Davaire Colmar was a promising Imperial officer in the Imperial Special Training Corps, putting him on the fast track to promotion in the Imperial Army. Colmar commanded an assault trooper unit during the Battle of Dalron IV. Colmar's unit was attacked by a mob of almost 2,000 civilians armed with blasters. Outnumbered nearly fifty to one, and with communications cut off by a malfunction caused by orbital bombardment, Colmar's unit was only able to make two calls for help before being overwhelmed."}, {"tag": "p", "text": "Although he suffered a head wound in the battle, Colmar managed to escape with his life. Cut off from friendly units, Colmar wandered aimlessly for two days. During this time, Colmar had a crisis of confidence brought about by the scenes of carnage which he witnessed. It was obvious to Colmar that there had been a number of massacres perpetrated against the citizens of Dalron IV by Imperial personnel. Colmar had joined the Imperial Army to protect the citizens of the Empire against anarchists and other external threats."}, {"tag": "p", "text": "Unable to reconcile the reality of what he has seen with his ideals, Colmar deserted and joined the Rebel Alliance, where he attained the rank of Lieutenant. As an Alliance soldier, Colmar often came face to face with Imperial units in which he had once served. Colmar proved instrumental in eliminating several of these units."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Davaire Colmar had a strong sense of duty, which was what drove him to join the Rebel Alliance. Colmar had an aura of quiet and competence about him."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Davaire Colmar was a skilled, experienced soldier, with extensive knowledge of Imperial Army procedures and tactics. Colmar was also highly skilled with repulsorlift vehicles, and could pilot almost any such craft."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Davaire Comar usually carried a BlasTech Industries DL-18 blaster pistol, a hold-out blaster, and a comlink."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}