{"url": "Dave_Filoni", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Card game artists", "Category:Comic book cover artists", "Category:Concept artists", "Category:Directors", "Category:Producers", "Category:The Mandalorian actors", "Category:Rogue One: A Star Wars Story voice actors", "Category:Star Wars: Episode VII The Force Awakens voice actors", "Category:Star Wars: Forces of Destiny voice actors", "Category:Star Wars: The Bad Batch voice actors", "Category:Star Wars: The Clone Wars voice actors", "Category:Star Wars Rebels voice actors", "Category:Star Wars Resistance voice actors"], "nodes": [{"tag": "h1", "text": "Dave Filoni"}, {"tag": "p", "text": "Dave Filoni is an animation producer who has been involved in various ways with Star Wars: The Clone Wars, Star Wars Rebels, Star Wars: Forces of Destiny, Star Wars Resistance, The Mandalorian, Star Wars: The Bad Batch, and the upcoming series The Book of Boba Fett and Star Wars: Ahsoka."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Filoni made an appearance at Celebration IV on Sunday, May 28, 2007 with producer Catherine Winder in the Celebration Theater (Room 408AB), to discuss the beginnings of the new television series and reveal how The Clone Wars was being created. During San Diego Comic Con 2014, Filoni admitted that he knew about contradicting the Expanded Universe by establishing The Clone Wars as canon. In his defense, he said that they still included the Expanded Universe elements when they could."}, {"tag": "p", "text": "Filoni was one of the executive producers on Star Wars Rebels, and he voiced Chopper in the series, a role which was not revealed until the series finale. Filoni serves as an executive producer of the animated series Star Wars: The Bad Batch."}, {"tag": "p", "text": "After expressing interest in working in live-action, Lucasfilm CEO Kathleen Kennedy had Filoni visit the film sets of the sequel and anthology films to study the work of their directors. He received particular help and encouragement from Rian Johnson. Kennedy then paired Filoni up with Jon Favreau on The Mandalorian, for which he serves as executive producer and has directed several episodes—his first venture outside the realm of animation. Around the debut of Star Wars Rebels Season Four, Filoni had hinted that he'd been exploring other forms of storytelling and learning from live-action directors. (He visited the sets and studied the productions of The Force Awakens and The Last Jedi)."}, {"tag": "h2", "text": "Personal life"}, {"tag": "p", "text": "An avid Plo Koon fan, Filoni dressed up as the Jedi Master for the opening of Revenge of the Sith, giving out candy to children queuing up to watch the film. Dave Filoni's office, as seen in the extra features on the Star Wars: The Clone Wars DVD, is filled with Plo Koon paraphernalia. He has a bust of Plo Koon's head, a model of Plo Koon's ship, an autographed portrait by the actor who played Plo Koon, a replica of Plo Koon's lightsaber on his desk, and his personal Plo Koon costume on display. Filoni also has a notebook-sized planner on his desk with Plo Koon's picture taped to the outside.[source?]"}, {"tag": "h2", "text": "Star Wars works"}, {"tag": "h3", "text": "Acting"}, {"tag": "h3", "text": "Voice acting"}, {"tag": "h3", "text": "Directing"}, {"tag": "h3", "text": "Writing"}, {"tag": "h3", "text": "Cover art"}, {"tag": "h3", "text": "Other artwork"}, {"tag": "h3", "text": "Designer"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}