{"url": "Dave_Dorman", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Artist stubs", "Category:Comic book cover artists", "Category:Cover artists", "Category:Card game artists"], "nodes": [{"tag": "h1", "text": "Dave Dorman"}, {"tag": "p", "text": "Dave Dorman is an artist who has done covers for several Star Wars comics, books, and magazines. His major works include Tales of the Jedi, Star Wars: Dark Empire and Young Jedi Knights. He also illustrated William C. Dietz' novella Dark Forces: Jedi Knight, for which he is credited as co-author. Dave contributed sketch cards for 2007 Topps Star Wars 30th Anniversary. He illustrated covers for the comic series Star Wars: Darth Maul—Death Sentence."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dave Dorman was born in Michigan in 1958 to a military family who lived several places including in the Azores and in Washington, DC. By the time he was in high school, Dave was a fan of the Flash Gordon serials and was intrigued by the thought of a big-budget film in that style. He graduated from a Maryland high school in 1975 and headed to St. Mary's College of Maryland as a Fine Arts major. While he was developing his skills in college, he was influenced by his exposure to Marvel comic books while his attraction to science fiction continued to shape his art."}, {"tag": "p", "text": "As Dorman's exposure to art grew, he soon developed a love for painting while simultaneously keeping tabs on the film industry through magazines. He had heard of an upcoming movie called Star Wars so when he spotted a book by that name by George Lucas he eagerly bought it and read it."}, {"tag": "h2", "text": "Cover Art"}, {"tag": "h3", "text": "Star Wars: Dark Empire"}, {"tag": "h3", "text": "Star Wars: Dark Empire II"}, {"tag": "h3", "text": "Star Wars: Empire's End"}, {"tag": "h3", "text": "Tales of the Jedi: Knights of the Old Republic"}, {"tag": "h3", "text": "Tales of the Jedi: The Freedon Nadd Uprising"}, {"tag": "h3", "text": "Star Wars: X-Wing Rogue Squadron"}, {"tag": "h3", "text": "Young Jedi Knights"}, {"tag": "h3", "text": "Crimson Empire"}, {"tag": "h3", "text": "Crimson Empire II: Council of Blood"}, {"tag": "h3", "text": "Star Wars: Crimson Empire III—Empire Lost"}, {"tag": "h3", "text": "Star Wars: A New Hope - The Special Edition"}, {"tag": "h3", "text": "Star Wars: Episode III — Revenge of the Sith"}, {"tag": "h3", "text": "Star Wars: Darth Maul—Death Sentence"}, {"tag": "h3", "text": "Other"}, {"tag": "h2", "text": "Illustration"}, {"tag": "h2", "text": "Star Wars Art Books"}, {"tag": "h2", "text": "Other"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}