{"url": "Davith_Sconn", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Davith Sconn"}, {"tag": "p", "text": "Davith Sconn was an officer of the Imperial Navy, who rose to be first officer of a Star Destroyer, but was later confined at the Jagg Island Detention Center for his role in the bombardment of Gra Ploven."}, {"tag": "p", "text": "Sconn joined the Navy in around 20 BBY, probably at the end of the Clone Wars. He subsequently served for twenty-four years, spending almost all his time in space. His longest continuous stretch on a planet was a forty-day period of compulsory liberty on Trif."}, {"tag": "p", "text": "While serving as commander of the second watch aboard the Fleet tender Moff Weblin, he once visited the Black Fifteen shipyard at N'zoth, in or before 2 ABY. While there, he heard stories about the bizarre honor culture of the native Yevetha, and in particular the way that low-caste males were required to stop and offer themselves for impromptu execution whenever they encountered a higher-ranking individual. In a rare journey to the surface, he traveled to Giat Nor to see for himself if the stories were true."}, {"tag": "p", "text": "Subsequently, Lieutenant Sconn became executive officer of the Star Destroyer Forger, under Grand Moff Dureya. In around 4 ABY, however, Governor Dureya ordered him to carry out a punitive bombardment of Gra Ploven, in reprisal for the native Ploven's refusal to make their assessed contributions to the Imperial war-effort. The ship's weapons were fired into the planet's oceans, creating boiling clouds that killed two hundred thousand Ploven in three coastal cities."}, {"tag": "p", "text": "In response to this atrocity, the Empire took punitive action, but it was Sconn, rather than Dureya, who was put on trial. His defense was based around the fact he had merely been obeying the Grand Moff's orders, but in spite of this, he was \"forcibly retired\" from the military and confined in the Jagg Island facility on Coruscant."}, {"tag": "p", "text": "He remained there through the planet's liberation by the New Republic, the Imperial reconquest, and the subsequent civil war. In 16 ABY, he made a deposition about his Imperial career to Agent Ralls of New Republic Intelligence, prompting New Republic Chief of State Leia Organa Solo interviewed him personally about his time on N'zoth."}, {"tag": "p", "text": "In return for volunteering information on the Yevetha, Sconn asked to be allowed to take a short trip up into low orbit, to be in space one last time, a condition which Princess Leia managed to grant, and it was here that Sconn told her about his experiences on N'zoth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The length of time Sconn had spent on Jagg Island in Shield of Lies shows that he had been convicted and incarcerated by the Galactic Empire, not the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}