{"url": "Dawn_of_Rebellion", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Era Sourcebooks"], "nodes": [{"tag": "h1", "text": "Dawn of Rebellion"}, {"tag": "p", "text": "Dawn of Rebellion is an era sourcebook for Fantasy Flight Games' Star Wars roleplaying game system, featuring brand-new source material compatible with each of Fantasy Flight Games' three Star Wars roleplaying lines. The book includes content from Star Wars Rebels and Rogue One: A Star Wars Story, and also features a foreword by Rebels creator Dave Filoni. It was released on February 22, 2018."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The dominance of the Empire is absolute. No authority in galactic history has enjoyed such a degree of power. So, what are you going to do about it? Some will take advantage of the system and turn a profit any way they can. Others may quest to find secret truths that could unravel even the most imposing social order. A few will even take up arms against an invincible foe. They may even have a chance to win."}, {"tag": "p", "text": "Dawn of Rebellion is a 144-page sourcebook designed to be a companion to any and all of the Star Wars™ Roleplaying Game lines. Describing the Star Wars universe in the years leading to the original film trilogy, it sets the stage of a dangerous galaxy primed for war. The stories you tell, however, will be on your own terms starting from the perspective of the Edge of the Empire, Age of Rebellion, or Force and Destiny and are then shaped by your own vision. Included in the sourcebook are new talent and species options for players, modular scenarios for gamemasters to include in their campaigns, and a wealth of information about the organizations, characters, and history that make the Star Wars saga so iconic."}, {"tag": "h2", "text": "Content summary"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}