{"url": "Dead_Moon_of_Antar/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with non-canon elements", "Category:Confederacy of Independent Systems moons", "Category:Galactic Empire moons", "Category:Galactic Republic moons", "Category:Moons of Antar", "Category:Rocky moons"], "nodes": [{"tag": "h1", "text": "Dead Moon of Antar"}, {"tag": "p", "text": "The Dead Moon of Antar, also known as the Antar Moon or simply Antar, was one of two uninhabitable moons of Antar, a gas giant located in the Prindaar system of the galaxy's Inner Rim. Colonized by the Gotals of Antar 4 before their discovery by the Galactic Republic, the Subjugator-class heavy cruiser Malevolence collided with the barren moon during the Clone Wars, which resulted in the Separatist starship's destruction."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Dead Moon of Antar was a barren, terrestrial moon. It was one of two uninhabitable moons that orbited Antar, a gas giant located in the Prindaar system, within the Slice region of the galaxy's Inner Rim. Sometimes, the Dead Moon of Antar and its sister moons illuminated Antar 4's nights."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Because of its proximity to the Dead Moon of Antar and its sisters, Antar 4's indigenous Gotal population was relatively proficient in the complexities of space travel, establishing colonies on four of the five planetoids, including the Dead Moon of Antar, and mining Antar 5 even before their discovery by the marauding explorers of the Galactic Republic sometime between the years 25,000 BBY and 22,000 BBY. In the 22 BBY, the first year of the Clone Wars, Jedi General Anakin Skywalker boarded the Malevolence during the Battle of the Kaliida Nebula and sabotaged its navigation computer, destroying the Separatist Subjugator-class heavy cruiser when it activated its hyperdrive while on a collision course with the dead moon."}, {"tag": "p", "text": "The mighty starship lay in scattered pieces on Antar's barren moon. However, some of the Malevolence's crew survived its destruction and searched for a way off the Dead Moon of Antar before the Jedi could finish them off. The panicking droids were able to construct an escape pod and flee Republic forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dead Moon of Antar was first mentioned, albeit indirectly, in Galaxy Guide 4: Alien Races, a Star Wars Legends supplement written by Troy Denning for Star Wars: The Roleplaying Game and released on June 1, 1989. It first appeared, albeit unidentified, in \"Destroy Malevolence,\" the fourth episode of the animated series Star Wars: The Clone Wars' first season, which originally aired on October 17, 2008. The dead moon was first identified as a \"dead moon of Antar\" in The Complete Star Wars Encyclopedia, a three-volume reference book edited by Bob Vitas and released on December 9, 2008."}, {"tag": "p", "text": "The Essential Atlas, a reference book written by Jason Fry and Daniel Wallace and released on August 18, 2009, placed the Antar system, and therefore the Dead Moon of Antar, in grid square N-12."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}