{"url": "Deal_with_a_Demon", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 3"], "nodes": [{"tag": "h1", "text": "Deal with a Demon"}, {"tag": "p", "text": "Deal with a Demon is a 10-page comic featured in Star Wars Tales #3. It was written by John Ostrander, illustrated by Jan Duursema, inked by Rick Magyar, lettered by Vickie Williams, colored by Dan Jackson, and edited by Peet Janes. It takes place in 33 BBY. It was collected in Star Wars Tales Volume 1 and Star Wars Legends Epic Collection: Rise of the Sith Vol. 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Vilmarh Grahrk has been hired by the people of Ootoola (who he fondly refers to as \"fishfaces\") to smuggle Princess Foolookoola off-planet; she is currently being hunted down by the purists of Ootoola, who previously killed the patriarch and his wife, seizing power of the planet. He and Naradan D'ulin, the caretaker of the princess, begin taking her to Villie's ship, when they're suddenly ambushed by a group of Ootoola purists. Villie hands the princess over, telling Naradan that the purists offered more credits than the loyalists did. Naradan and the princess are taken away and put into the purists' prison."}, {"tag": "p", "text": "That night, Villie blows open the prison door and rescues them, only to get a punch in the face from Naradan. Vilmarh explains that before, with the princess running loose, everybody was looking for her, but now that they've assumed she's still locked up, nobody will be trying to find her. Naradan grabs a rifle in case she decides to shoot him, and they head out. They spot a couple of guards, and Villie casually walks up to them, steals one of their blasters, and shoots both of them. Villie, Naradan and the princess quickly escape the palace and head to Vilmarh's ship, the Inferno, where they are vocally greeted by NT 600. They fly off, Villie destroying the palace on his way up. They make their way to the planet Dur Sabon, where Foolookoola is to live her life among the Dur Sabon until she can return to Ootoola."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}