{"url": "Dearic", "categories": ["Category:Legends articles", "Category:Capital cities", "Category:Cities on Talus"], "nodes": [{"tag": "h1", "text": "Dearic"}, {"tag": "p", "text": "Dearic was the capital of the Twin World Talus."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Dearic held the primary starport on Talus, and was one of the most active cities in the Corellian system. New arrivals to Talus were typically processed through this city. The city provided numerous import and export services for locals. Due to its location in the southern portion of Talus, Dearic was also an excellent staging ground for excursions into the planet's wilder regions."}, {"tag": "p", "text": "At first glance, Dearic appeared to be a beautiful, bustling utopia. All three of the world's native, sentient species seemed to coexist peacefully. The city also seemed to lack rampant poverty or crime. Public services operated smoothly, and the residents appeared happy and healthy. In reality, however, Dearic was far from perfect. Its idyllic parks concealed violent thugs, and tensions between the Humans, Drall, and Selonians were on the rise. Likewise, because Dearic served as the capital for the Federation of the Double Worlds, the city had a highly politicized atmosphere. With this, the city was plagued by corruption and scandal, and the populace was largely controlled by wealthy, uncaring and unscrupulous Fed-Dub officials."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Talus remained largely neutral and the Galactic Empire allowed Fed-Dub to operate independently, while still monitoring the planet for Rebel activity. However, around 1 ABY, Dearic had become a hotspot in the conflict and was the site of the Invasion of Dearic."}, {"tag": "p", "text": "Still, the city had a fair share of entertaining events for its citizens. After the Battle of Yavin, it hosted a large Life Day celebration."}, {"tag": "h2", "text": "Residents"}, {"tag": "p", "text": "The following individuals were residents or visitors of the city in the time after the Battle of Yavin: Champhra Biahin, Hagrin Zeed, Haleen Snowline, Kathikiis Ruwahurr, Nurla Slinthiss, Radlee Mathiss, Extok Evin, Mort, Omkoo, Wire, Dathnaeya Loessin, Vayde Quellium, Braedic Ekirk, and Sul Prine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dearic appeared in the 2003 MMORPG Star Wars Galaxies, prior to its closure on December 15, 2011. Dearic was one of only two permanent, non-player built cities on Talus. However, there was a third game-owned settlement which existed in the form of an Imperial Outpost."}, {"tag": "p", "text": "During the Life Day live event from December 16, 2008 to January 12, 2009, players could visit Dearic for a variety of Life Day activities. For the event, Dearic had a blizzard which covered the city in snow."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}