{"url": "Death/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Biology", "Category:The Force", "Category:Society and culture"], "nodes": [{"tag": "h1", "text": "Death"}, {"tag": "p", "text": "Death is the cessation of life functions in a biological organism, permanently rendering it unresponsive to any external factors. The term \"death\" was also sometimes applied to droids damaged beyond repair. Sentient individuals (and perhaps all living beings), were known to enter a different plane of existence losing their consciousness and individuality. Some Jedi Masters such as Qui-Gon Jinn, however, could become one with The Force, and retain their identity after death. Other known practitioners include Obi-Wan Kenobi, Yoda, Vergere, Mara Jade Skywalker, Jacen Solo, Luke Skywalker, and Anakin Skywalker. It was a necessary and inevitable part of existence."}, {"tag": "h2", "text": "Causes of death"}, {"tag": "p", "text": "In most cases, death was caused by the major body parts within an organism simply \"breaking down\" from age and/or constant use. However, it could also be caused by irreparable damage to the major organs, such as them being ruptured, sliced, blasted, or similarly damaged. Death could also be caused by the loss of bodily fluids, such as blood, as they are required to ferry certain nutrients required for life to continue. In most cases this was oxygen, however a number of species breathed alternate substances ranging from methane to cyanogen. Suffocation could also bring about death, as it cut off the source of the required gas. If an organism entered an extremely hot or reactive area, their body could easily burn up and disintegrate, causing instant death."}, {"tag": "p", "text": "Another cause was from cancers and infections, which occurred when dangerous bacteria and microbes took up residence in the host body, killing the flesh in that area, causing necrosis, and providing stable residence for more bacteria. Death was either caused by the bacteria getting into the bloodstream and causing necrosis in vital areas of the body, or the necrosis could simply spread and grow, literally compressing the vital organs until they ceased to function."}, {"tag": "p", "text": "Suicide was the deliberate choice to end one's life. In certain other cases, death might occur if one simply no longer possessed the will to go on living, regardless of physical condition. Padmé Amidala was one such individual. Though droids could detect no organic damage to her physical body, Amidala passed away following her heartbreak at what had become of her husband, Anakin Skywalker, who had started going by the name Darth Vader, a Dark Lord of the Sith."}, {"tag": "p", "text": "Finally, death could be brought by the complete annihilation of the body by forces such as experienced by a being inside an exploding starship or on a planet hit by a superlaser blast."}, {"tag": "h2", "text": "Death and culture"}, {"tag": "p", "text": "Tending to the dead constituted a significant part of culture. In many cultures, the bodies of the dead were buried either under the ground or in tombs, or burned to ashes during a funeral ceremony, attended by friends, relatives, and others who wanted to show their respect for the deceased and mourn their loss. The Jedi Order was known to cremate the bodies of their dead upon funeral pyres."}, {"tag": "p", "text": "The attendance of funerals varied depending on the social status and notoriety of the dead individual. In 22 BBY, the funeral of Shmi Skywalker Lars, a former slave and later a moisture farmer's wife on Tatooine, was attended by a handful of friends and relatives: her premarital son Anakin Skywalker, her later husband Cliegg Lars, his son from a previous marriage Owen Lars, as well as Beru Whitesun, Padmé Amidala, and the droids R2-D2 and C-3PO. On the other hand, when Padmé Amidala, former Queen and Senator of Naboo, died in 19 BBY, her funeral was attended by an enormous procession of mourners, including Queen Apailana of Naboo, Boss Rugor Nass of the Gungans, and Representative Jar Jar Binks, her successor as Senator of Naboo; furthermore, the day of Amidala's death was deemed a national day of mourning in the Galactic Empire by Emperor Palpatine,[source?] himself a Naboo native."}, {"tag": "p", "text": "The Alliance to Restore the Republic honored their deceased officers with a space burial, where the coffin was released from a cruiser into the vacuum of space. These funerals were usually attended by many other Alliance personnel who served with the deceased."}, {"tag": "p", "text": "Some cultures, such as the ancient Sith of Korriban, had a tradition to honor their deceased leaders by putting them to rest in spacious, well-decorated tombs or crypts, along with objects that were dear to them when they were alive, or could potentially aid them in afterlife. The Valley of the Dark Lords was an expansive collection of tombs belonging to numerous Sith Lords."}, {"tag": "p", "text": "In Yuuzhan Vong society, death was accepted. They believed the manner in which you died was the most important. Those who died an honorable death in battle would bring pride to their Domain, but those beings who died shamefully would bring dishonor."}, {"tag": "p", "text": "In Mandalorian culture, burials for the dead were uncommon, due to the inability for nomads to sustain cemeteries and the impracticality of bringing bodies with them on the move. However, the Mand'alor, leader of the Mandalorian clans, would be given a proper marked burial as a sign of respect, unless they chose otherwise. Mass graves and cremation were common when a body could be recovered, with the ashes later scattered, and one of the fallen's possessions—often their armor—kept in memorial; if a full set of armor couldn't be recovered, it was commonplace to retrieve smaller parts such as helmets, gloves, or plates instead. It was also Mandalorian custom to recite the names of loved ones and friends who have passed each night before sleep as a means of keeping their memory alive."}, {"tag": "h3", "text": "Death and law"}, {"tag": "p", "text": "Although death was considered a part of life, there were nonetheless instances where death was not tolerated, namely in the unlawful taking of life such as various forms of murder, including speciecide, the attempted extermination of an entire species. Some sentences given to lawbreakers also included the ending of the criminal's life, which is known as execution. This kind of sentence was usually reserved for very serious charges, such as treason. However, in some cases, particularly the Galactic Empire, executions were often carried out loosely. The Supreme Commander of the Imperial Forces and Dark Lord of the Sith Darth Vader in particular was rather infamous for often executing those under his command for various blunders they made."}, {"tag": "h2", "text": "Death and the Force"}, {"tag": "p", "text": "While all beings possessed, to some degree, a natural fear of death, as an undesirable and inevitable yet permanent condition, the Jedi, guided by the Jedi Code, learned to view death not as a tragedy, but merely as a part of the life cycle. The Jedi, viewing themselves as servants of the Force, were always ready to sacrifice their lives if necessary."}, {"tag": "p", "text": "Some Force users were able to survive in spirit form after their physical body died and interact with living beings, as well as other dead Force-sensitives. This phenomenon mostly manifested itself in the form of Force ghosts, something which applied even to the Sith, like Marka Ragnos and Ajunta Pall whose spiritual forms lingered in the physical world for millennia."}, {"tag": "p", "text": "Several Sith Lords attempted to \"cheat death\" in their own ways: Darth Andeddu, as a spirit, used the Force to retain control over his physically dead and decaying body. Palpatine, also known as Darth Sidious, used a supply of clone bodies, so he could possess a new body after the previous one died. Other Sith have done the same, including Darth Sion, whose decaying body was held together by the dark side and his own hatred,  Darth Nihilus, who transferred his consciousness to his armor, Darth Vitiate, who transferred his consciousness to the bodies of Sith Lords—titled as the Emperor's Voice—in order to rule the Sith Empire forever, and Exar Kun, whose spirit was imprisoned in the Massassi Temple on Yavin 4. Karness Muur tried to cheat death by putting his spirit into a talisman, until it was destroyed by Cade Skywalker. Darth Krayt was able to use dark transfer to revive himself from death as well as pass Cade Skywalker through death and back to life again. Cade himself, though not a Sith, used his dark transfer ability to bring several others back from death. Perhaps the most complete attempt at achieving physical immortality was the creation of the midichlorian manipulation techniques of Darth Plagueis. The ability could be used to revive the dead, regenerate injuries, and could halt the aging of a practitioner, all without the use of any external resources or energy sources."}, {"tag": "h2", "text": "Lifespans"}, {"tag": "p", "text": "The term 'lifespan' was used in regard to rough estimates of the length of time a healthy organism belonging to a particular species would live before dying of natural causes. Various species had varying lifespans, from under ten years to almost a millennium. Some species, such as the Diathim and Talortai, were known to have indefinite lifespans.\nLong-lived species included Yoda's species, Netis, Hutts, Wookiees and Gen'Dai."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}