{"url": "Death_Seed", "categories": ["Category:Legends articles", "Category:Diseases and maladies"], "nodes": [{"tag": "h1", "text": "Death Seed"}, {"tag": "p", "text": "The Death Seed plague was a disease caused by parasitic drochs which caused necrosis of the skin and ultimately led to death."}, {"tag": "h2", "text": "Cause and clinical features"}, {"tag": "p", "text": "The Death Seed was caused by drochs, which could steal life force energy from its host. If allowed to remain attached, the droch burrowed into its host began to mimic the host's electrochemical fields and tissue composition, allowing it to avoid detection by essentially becoming part of the host while drawing life from them. Drochs grew and became more intelligent with each host they killed, and larger drochs could absorb life through smaller ones, without having to take a host directly."}, {"tag": "p", "text": "Victims would display no perceptible ailment – no virus, no bacteria, no poison and no allergy – just the rapid decay of the skin as the plague took hold. With the drochs able to escape detection while in a host, the cause remained unknown. Bacta therapy only accelerated the disease, because the healing provided a renewed source of energy for the droch. Victims could die within half an hour after displaying initial symptoms."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "First pandemic"}, {"tag": "p", "text": "An outbreak of Death Seed happened seven centuries BBY and, proved virtually unstoppable. When it occurred on a spaceship, the whole crew was condemned to death since it moved on so quickly that there was no way to escape it. Details of the pandemic remain sketchy, however it is known that huge sections of the population of dozens of worlds were killed before the plague burned itself out. Supreme Chancellor Anwis Eddicus had a role in ending the outbreak. The final death toll was estimated in the billions."}, {"tag": "p", "text": "In 702 BBY the Grissmath Dynasty founded a penal colony on Nam Chorios in Meridian sector and seeded the world with drochs in the hopes that a Death Seed outbreak would wipe out the prisoners. However, sunlight fragmented through the sentient Spook crystals found on Nam Chorios weakened the electrochemical bonds of the drochs. Smaller ones were killed outright by the light, while larger ones proved unable to harm their hosts and were harmlessly absorbed into the blood. A plague never broke out and drochs were only able to grow in the dark."}, {"tag": "h3", "text": "Minor scare on Tatooine"}, {"tag": "p", "text": "In 1 ABY, the Imperial Department for Epidemic Prevention discovered that some wild creatures were possibly carrying droch eggs. Such creatures were all destroyed to prevent a new epidemic."}, {"tag": "h3", "text": "Second pandemic"}, {"tag": "p", "text": "In 13 ABY, Seti Ashgad, working with a genetically altered droch called Dzym, started a second pandemic in an effort to weaken New Republic forces and enable Moff Getelles to take control of Meridian sector. Dzym could control the other drochs, giving him the ability to coordinate the plague, both infecting and curing victims."}, {"tag": "p", "text": "The plague needed to be carried in living tissue, infected synthdroids provided by Loronar Corporation were used to carry the disease off Nam Chorios and begin infecting personnel at New Republic facilities. Ashgad promised that only New Republic personnel would be affected and persuaded his co-conspirators that the plague was unconnected with the Death Seed of centuries ago. When Dzym commanded the drochs to start, the plague broke out simultaneously across the sector."}, {"tag": "p", "text": "On her way to a diplomatic mission, Leia Organa Solo was taken hostage by Ashgad when the whole crew of her ship died of the Death Seed plague. The infected Leia was taken hostage by Ashgad who made Leia's ship jump into hyperspace blindly. She was later cured of the disease by Dzym, and may be the first known person to recover from the Death Seed."}, {"tag": "p", "text": "The plague quickly spread through New Republic bases eventually spreading across three quarters of the sector. Amongst those affected were the base on Nim Drovis, the orbital base at Durren, most of the population of Cybloc XII and the entire crews of the New Republic ships Borealis and Adamantine. All efforts to control the plague proved futile."}, {"tag": "p", "text": "The plague eventually came to an end when Luke Skywalker persuaded the Spook crystals to be taken to other worlds to help cure the infected. Dzym and Ashgad were killed while attempting to leave Nam Chorios."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}