{"url": "Death_Star/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Capital ship classes", "Category:Death Stars", "Category:Imperial Department of Military Research products"], "nodes": [{"tag": "h1", "text": "Death Star"}, {"tag": "p", "text": "A Death Star was a moon-sized Imperial military battlestation armed with a planet-destroying superlaser."}, {"tag": "p", "text": "The Death Star, whose concept had been explored even before the Clone Wars, was the first in a long series of superweapons developed to execute the Tarkin Doctrine. The Death Star was designed to allow Emperor Palpatine to more directly control the Galactic Empire through fear. In most instances, a Death Star was to be commanded by a Moff."}, {"tag": "p", "text": "One Death Star was completely built by the Empire, with a second and third one never reaching full completion, as well as a prototype being in existence. In addition, a scaled-down version, the Tarkin, and a Hutt knockoff, the Darksaber, would be created by the Empire and Durga the Hutt, respectively."}, {"tag": "p", "text": "Both Death Stars were destroyed by the Rebel Alliance shortly after they became operational. The first Death Star was destroyed by Luke Skywalker, with the help of Han Solo, and the second Death Star was destroyed by Wedge Antilles and Lando Calrissian. Prior to the second Death Star being built, the Galactic Empire tested out a planetary superlaser for protecting its installations on the planet of Dubrillion. At some point after the second's destruction, the Rebel Alliance also attacked and destroyed a third Death Star. Following their destruction, other planet-devastating superweapons followed, including the Galaxy Gun, the Darksaber, the Sun Crusher, and the World Devastators."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Death Stars, the Galactic Empire's ultimate terror weapons, were battle stations several hundred kilometers in diameter and mounting a directed energy superlaser capable of completely destroying a planet with a single shot along with 15000 lasers, ion, turbolasers batteries, and heavy turbolasers in all plus an additional 768 tractor beam emplacements. However, the first Death Star's defenses were not tight enough to stop starfighters from penetrating them."}, {"tag": "p", "text": "The first Death Star was 120 kilometers in diameter, while the second Death Star was 160 kilometers in diameter. Much of its interior space was devoted to systems required to maintain its massive superlaser and power plant. At the heart of each Death Star was a gigantic hypermatter reactor, which possessed an output equal to that of several main-sequence stars. Within this chamber burned a reaction of prodigious proportions, fed by stellar fuel bottles lining its periphery."}, {"tag": "p", "text": "Splitting the station into two equal hemispheres was a huge equatorial trench approximately 503 kilometers in length for the first Death Star and 2,827 kilometers for the second Death Star. This area of the station housed most of the major landing bays, drive thrusters, sensor arrays and tractor beam systems. Halfway between the equator and each pole were two supplementary trenches. The Death Star was divided into 24 zones, 12 per hemisphere, each controlled by a \"bridge\". To further organize the immense amount of activity aboard, there were specific \"sectors\" denoting function. These included the General, Command, Military, Security, Service, and Technical sectors."}, {"tag": "p", "text": "Since service onboard the Death Star was a long-term affair, the station maintained a number of civilian amenities to make the time aboard a deep space station more comfortable. Parks, shopping centers, recreation areas, and taverns such as the Hard Heart Cantina could be found in the general sectors of the station."}, {"tag": "p", "text": "Facilitating the Death Star's realspace propulsion was a network of powerful ion engines that transformed reactor power into needed thrust. In order for the Death Star to be a deadly threat, it needed to be mobile. Using linked banks of 123 hyperdrive field generators tied into a single navigational matrix, the Death Star could travel across the galaxy at superluminal velocities. The incredible energies harnessed by the station combined with its great mass gave the Death Star magnetic and artificial gravitational fields equal to those found on orbital bodies many times greater in size."}, {"tag": "p", "text": "The Death Star's superlaser derived power directly from the hypermatter reactor. Its faceted amplification crystal combined the destructive power of eight separate tributary beams into one single blast with the intensity of a stellar core. After firing a blast, though, the Imperial engineers had to recharge the reactor, which took at least 24 standard hours. Though the energy output of this blast could be scaled to fire at smaller targets such as capital ships, as was the case during the Rebel assault on the second Death Star, the two major instances in which the superlaser was fired were at full power at planetary bodies."}, {"tag": "p", "text": "The Death Star's interior followed two orientations. Those areas closest to the surface were built with concentric decks with artificial gravity oriented towards the Death Star's core. Past this shell of surface \"sprawls\", the Death Star's interior had stacked decks with gravity pointing toward the station's southern pole."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "The Death Star was born in the mind of Raith Sienar, who had conceived of it as an Expeditionary Battle Planetoid, although he believed the design was impractical. He shared his idea with his friend Wilhuff Tarkin, who presented it to Supreme Chancellor Palpatine, having been impressed enough about the design to champion it in spite of Sienar's doubts about its practicality. Palpatine then turned Sienar's idea to Bevel Lemelisk and ordered him to pursue the needed advances in hypermatter science with the Geonosian hives led by Poggle the Lesser, to which he succeeded in doing so with the Twi'lek scientist Tol Sivron, although the plans ended up falling into enemy hands when the Geonosians joined the Separatists. In actuality, Palpatine, as Sith Lord Darth Sidious, arranged for the designs to be supplied to the Separatists, led by his apprentice, Separatist leader Count Dooku, with Lemelisk being unaware of this. Dooku then had Geonosian Industries accomplish further technical modifications to the original plans."}, {"tag": "p", "text": "During the Battle of Geonosis, Archduke Poggle the Lesser, leader of the Geonosians, returned the top-secret designs to Count Dooku to prevent it from falling into the hands of the Jedi. Dooku took the designs back to Coruscant and gave them to Darth Sidious, his dark master. The Separatists then continued to build their superweapon in the Geonosis system."}, {"tag": "p", "text": "The 501st Legion was sent to Mygeeto during the Clone Wars to collect an ancient Mygeetan crystal which was an experimental power source that the Chancellor required for a top-secret tributary laser-stream project codenamed \"Hammertong,\" which would be used on the first Death Star."}, {"tag": "p", "text": "Darth Sidious later ordered the Death Star's construction after the Galactic Empire was formed, in order to secure his new-formed absolute power. Wilhuff Tarkin was appointed to mastermind the secret development project, though other stories have it that Raith Sienar was the superweapon's creator. Tarkin's creative work and thought resulted in the realization of the Death Star as the Empire's ultimate weapon."}, {"tag": "p", "text": "After the beginning of the Great Jedi Purge, an assault was led on the planet Kashyyyk to enslave the native Wookiees for the Death Star's construction. Various prison planets were also known to have their captives unwittingly construct various sections of the station. The Empire also had Mrlssi scientists working on some of the technology that would go into the station."}, {"tag": "p", "text": "Nevertheless, the project nearly ended before it began. Because much of the technology of the Death Star was impressive, actually building it proved to be more difficult than anyone imagined. Efforts were not helped by repeated (and often unsuccessful) attempts to sabotage construction. In addition, spies belonging to Gentis were also planted on the development team in charge of the Death Star since a few weeks after the creation of a New Order, which factored into his military coup against Palpatine a few months afterwards."}, {"tag": "h3", "text": "Implementation"}, {"tag": "p", "text": "Of particular concern was the technology required to create the massive superlaser, the heart of the weapon, which was derived from the long-running Hammertong Project. The Superlaser cannon was initially going to be placed in the equator, but for reasons unspecified was later moved to the dorsal hemisphere. In addition, the tributary lasers required fine-tuning and perfect alignment during development, otherwise, it would result in the central beam misfocusing and dissipate in a flurry of backscatter that ended up being far more dangerous to the superlaser housing than to any target. As the superlaser at that time required a significant amount of power generation to maintain, and it was powered primarily by the station's hypermatter reactor, it also had to disable all other functions of the ship, including shields and life support, were knocked offline when it was in use. Lastly, the firing process also generated magnetic flux and gravitational flux, which also needed to be dissipated in fear of either misaligning the crystals or, in the worst case scenario, tear the station apart. To this end, Tarkin brought together some of the most brilliant minds of the Galaxy, including Tol Sivron, Qwi Xux, and Bevel Lemelisk, and built a proof-of-concept model at the Maw Installation. This model would eventually become known as the Death Star prototype. These scientists also found and corrected several flaws in the Geonosian blueprints, which had been used in that phase of construction. Renowned physicist Rorax Falken worked with the Empire at some point during the construction of the Death Star, though he was not aware that his ideas and knowledge were being used for a battlestation. During this time, the Death Star construction also frequently relocated, from Geonosis to Seswenna to Patriim to Horuz, the latter location being the location when the battle station was starting to become a reality."}, {"tag": "p", "text": "With the concept completed and the plans finalized, Lemelisk took the plans to Despayre, where construction would finally be completed after twenty years of hard work and the death of many individuals. In celebration, the Death Star turned its massive weapon on Despayre itself, completely destroying it. After the completion of the first Death Star, codenamed the DS-1 Orbital Battle Station, Lemelisk and the IDMR have explored two potential concepts for the Death Star's future: Either having various factory worlds switch their output to the production of assembly-line duplicates of the current DS-1 model, or have the Empire build an even larger and more dangerous Death Star reaching 160 km in diameter. The Empire would ultimately opt with the latter concept."}, {"tag": "p", "text": "During its construction, the Death Star was home to countless prisoners of the Empire, from political opponents to pirate gangs to Rebel saboteurs. These prisoners managed to break out and riot in the Death Star, but were put down by the 501st Legion. However, some managed to escape with a partial set of the plans and some Imperial data."}, {"tag": "p", "text": "Galen Marek traveled to the Death Star to free Bail Prestor Organa, Rahm Kota, and rest of the founders of the Rebel Alliance including Mon Mothma. He fought Darth Vader in the corridor leading to Sidious' Observation Chamber. He severely injured the Sith Lord and Palpatine urged Galen to kill Vader. Galen instead attacked Sidious himself. The pair dueled viciously with the force and lightsaber combat. Galen sacrificed his life in an explosion which allowed the Rebels to escape. He was honored by the Alliance when his family crest was used as their symbol."}, {"tag": "p", "text": "Just after construction was completed, the other set of Death Star blueprints was discovered by Rebel spies on a secret signal interceptions asteroid outpost, AX-235; the Rebellion moved on and in the borders of Operation Skyhook, a copy of the plans was stolen by Kyle Katarn from Danuta and finally reached Leia Organa. Later, while attempting to recruit the Jedi Obi-Wan Kenobi to the rebel cause, Leia's vessel Tantive IV was attacked by the Star Destroyer Devastator above Tatooine. Leia, before being captured, stored the plans in R2-D2 and sent them to Kenobi on Tatooine. Upon arriving at Alderaan, which had been destroyed by the Death Star, Han Solo, Luke Skywalker, Kenobi, and Chewbacca mistook the station for a small moon while following a lone TIE/LN starfighter."}, {"tag": "p", "text": "The quartet was soon captured, but after escaping from the Death Star with Leia, the plans to the station were transported by Princess Leia with their help to Rebel leaders on Yavin IV. Soon after, the Death Star arrived to destroy the rebel base, having located it via a transmitter placed on the Millennium Falcon. After softening the defenses by destroying some of the Deflection Towers, Luke Skywalker piloted a T-65 X-wing starfighter through a minor trench on the surface of the Death Star, then Vader followed him in, and during his evasion of Darth Vader, he heard Obi-Wan call to him, telling him to use the Force, not his targeting computer. Luke switched off his computer, to the concern of the Rebels in the base, then fired two proton torpedoes into the thermal exhaust port, which led directly to the main reactor. This caused a chain reaction that destroyed the battle station just before it could fire on the Rebel base. Ironically, shortly before Luke's destruction of the Death Star, Palpatine had ordered for the creation of a second Death Star."}, {"tag": "h2", "text": "Death Star II"}, {"tag": "p", "text": "Nearly four years later, Bothan spies stole the plans of the second Death Star, unaware that their theft was orchestrated by Emperor Palpatine, having agreed to a suggestion personally made to him by Black Sun leader Prince Xizor. General Crix Madine and Admiral Gial Ackbar devised a plan for the destruction of the new Death Star. Han Solo led a team to the forest moon of Endor to destroy the shield generator there. (The shield generator protected the Death Star II from attack.) The plan called for a group of X-wings and the Millennium Falcon, piloted by Lando Calrissian to attack the Death Star upon the destruction of the shield generator. The fighters flew into the center of the station through a narrow maze of pipes to destroy the reactor directly and rushed out in just enough time to escape the ensuing explosion before the station could carry out its final order: destroying the Sanctuary Moon of Endor. A few moments prior to its destruction, an evacuation order for all non-essential personnel was also called."}, {"tag": "p", "text": "At some point after the Battle of Endor, a third Death Star was being constructed in orbit around the forest moon of Endor which was escorted by a fleet of Imperial-class Star Destroyers but was destroyed by the New Republic while still undergoing construction. Its weakness was a hole similar to the thermal exhaust port of the first Death Star."}, {"tag": "p", "text": "Years later, when Han Solo first encountered the Yuuzhan Vong and their colossal worldships, he would comment: \"Why isn't there a Death Star lying around when you need one?\""}, {"tag": "h2", "text": "Additional information"}, {"tag": "p", "text": "Around the same time the Geonosians were designing their Ultimate Weapon, Raith Sienar was designing a battlestation (apparently without a superlaser) of similar size and prestige. The best elements of both were apparently merged together with final detail work taking place in the secret Maw Cluster near Kessel. This laboratory completed a scaled-down prototype that was later destroyed by the New Republic."}, {"tag": "h3", "text": "Additional Defenses"}, {"tag": "p", "text": "Both Death Stars were defended by hundreds of shield projectors (including Deflection towers), and thousands of turbolasers, ion cannons and laser cannons. The first one contained a complement of seven to nine thousand TIE fighters, along with tens of thousands of support craft, bombers, and gunships. Massive docking bays provided several Star Destroyers with dry docks, and more than a million Imperial personnel were on board both battle stations."}, {"tag": "h3", "text": "Design flaws"}, {"tag": "p", "text": "One drawback of the original design was the power systems. Twenty-four hours were required to fully charge the laser. However, even low power shots were capable of massive destruction on a planetary scale. The second Death Star had redesigned systems and was capable of firing the superlaser once every three minutes. It also had improved targeting computers, allowing it to fire the weapon accurately at capital ships."}, {"tag": "p", "text": "There were small gaps in the shields of the first Death Star; the Empire believed that this was harmless since only small ships could wiggle through the gaps. The shields of the second Death Star would have had no such gaps."}, {"tag": "p", "text": "The second Death Star also corrected several other flaws in the original design. The two-meter exhaust vent that doomed the first station was replaced with millions of millimeter wide tubes, each designed to seal if excess energy was detected. The second station also boasted far more turbolaser batteries with redesigned targeting systems, allowing them to target starfighters more easily. The greatest concentration of turbolasers was located near the Emperor's throne tower."}, {"tag": "h3", "text": "Darksaber"}, {"tag": "p", "text": "Durga the Hutt also built a small version with only the central laser core and a small living quarters, which was destroyed in the asteroid field around Hoth. This was known as the Darksaber, but shoddy construction techniques and substandard components meant that this attempt was an abject failure even before its destruction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to the Star Wars: Incredible Cross-Sections fact book, the first Death Star in A New Hope was 160 kilometers in diameter. The Making of Star Wars: The Definitive Story Behind the Original Film reproduces a sketch attributed to Ralph McQuarrie which shows 92 miles (148 kilometers). According to the Inside the Worlds of Star Wars Trilogy fact book and detailed scaling of the station in Return of the Jedi, the second Death Star was 900 kilometers in diameter. Some Expanded Universe sources state much smaller figures—120 kilometers for the first Death Star and 160 kilometers for the second—however, most of the evidence argues for the larger sizes."}, {"tag": "p", "text": "The Dalek Crucible in Doctor Who from series 4 in 2008 is said to be inspired by the Death Star, apart from the 'wings' on the side, the Crucible is very similar, but the eye is covered by a shield whereas on the Death Star it is not."}, {"tag": "p", "text": "Several of the Star Wars games are concerned with the Death Star's destruction, or the theft, protection, and transmission of its plans until reaching Tantive IV. Some games also focus on the immediate aftermath, such as Rogue Squadron III: Rebel Strike."}, {"tag": "p", "text": "The Death Star is available as a cheat in Star Wars: Galactic Battlegrounds: Clone Campaigns. It acts like an air cruiser unit, but is much slower. It more than makes up for its speed with excessive hit points, shielding, armor, and the most powerful attack in the game—any object on the map, even trees and rocks disappear after the Death Star fires. It is virtually impossible to destroy it. There is a limit on the number of Death Stars the player can conjure up at any time."}, {"tag": "p", "text": "A number of Death Star battle stations appear in sources of uncertain canonicity. The Star Tours theme-park ride includes another battlemoon at Endor, clearly different than the one seen in Return of the Jedi, while the French-language RPG Magazine Casus Belli 99 includes another prototype, named the Nocturnô. The former, however, was officially entered into continuity by Leland Chee, the gatekeeper of the LucasFilm Holocron Continuity Database, with it being named the Death Star III."}, {"tag": "p", "text": "The Death Star has also influenced popular culture, a tribute to the Death Star, the \"Death Egg\" making an appearance in the Sonic the Hedgehog series (1992)."}, {"tag": "p", "text": "Besides its role in Star Wars: Rogue Squadron III: Rebel Strike, both in the main campaign and its appearance in the co-op mode for the game (based on Rogue Squadron II: Rogue Leader), the Death Star also had an appearance in the game's opening and arcade mode, as a disco ball."}, {"tag": "p", "text": "In the eleventh issue of Star Wars Adventure Journal, under the Fragments from the Mind's Eye section, the Death star was sold as a discount superweapon at B'hob's Discount Superweapons. Its tagline, \"Only Exploded Twice\", was a humorous reference to how both the original Death Star and the Death Star II were destroyed."}, {"tag": "h3", "text": "Mimas"}, {"tag": "p", "text": "Mimas, the smallest and innermost of seven major moons orbiting the planet Saturn, is notable for a single enormous impact crater called Herschel. The appearance of Mimas and Herschel in pictures taken during the space probe Voyager 1's 1980 flyby of the Saturn system showed a similarity to the first Death Star, with Herschel appearing as the superlaser disc, as remarked upon in the scientific press. This resemblance became one of Mimas's most notable characteristics in astronomy and popular culture."}, {"tag": "p", "text": "During the Cassini orbiter's visit to the Saturn system in 2004, the resemblance was noted again in the official press releases and by the scientific press. However, Cassini's more recent images of Mimas do not all resemble a Death Star orbiting Saturn, as the moon is more egg-shaped than the battlestation."}, {"tag": "h3", "text": "White House petition"}, {"tag": "p", "text": "In late 2012, a petition was submitted to the White House website urging that the United States government build a real Death Star as an economic stimulus and a means to ensure people got back to work again, and wanted its completion by 2016 at the earliest. The petition gained more than 25,000 signatures, ensuring that an official response be supplied. In early 2013, the proposal was rejected (in a tongue-and-cheek manner), citing that the overall cost of the Death Star's construction would amount to a cost exceeding $852 quadrillion, and would take 833,000 years before it could even be ready for construction due to the rate of steel production. Another reason for the rejection was also because the Government \"did not support blowing up planets.\" As such, the Star Wars Blog, in response to it, created a light-hearted, in-universe reply from the Galactic Empire's Public Relations department where the Empire, with official statements from Admiral Conan Antonio Motti and Governor Wilhuff Tarkin, shrugged off the criticisms by the planet Earth's leaders regarding the design of the battlestation. In addition, in the same source, it also denounced the planet for grossly overestimating the cost of designing the Death Star, as well as commenting the overall lack of production methods of the planet in comparison of the Galactic Empire, even implying that the planet's leaders were cowardly in their decision."}, {"tag": "h2", "text": "Translations"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "See also"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}