{"url": "Death_Squadron/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Death Squadron"], "nodes": [{"tag": "h1", "text": "Death Squadron"}, {"tag": "p", "text": "Death Squadron was the codename applied to Darth Vader's personal fleet of Star Destroyers following the Battle of Yavin, led by the Super Star Destroyer Executor. Because of it being led by the Executor, their fleet insignia also bore an image of the Executor on it. The fleet, designed to instill terror in dissidents of the Empire's New Order, was in fact tasked with locating and destroying the Rebel Alliance headquarters. Moreover, Vader used his fleet in a more personal mission to find and capture his son, Luke Skywalker."}, {"tag": "p", "text": "Though Death Squadron initially consisted of only six ships—the Executor and five Star Destroyers—it earned a fearsome reputation as the personal armada of Darth Vader, who also had the authority to assign additional ships from other sectors as he saw fit. By the Battle of Endor, Death Squadron had been reinforced to include the Executor, two battlecruisers, three Tector-class Star Destroyers, and thirty-three Imperial Star Destroyers."}, {"tag": "h2", "text": "Composition"}, {"tag": "p", "text": "About half a dozen or so Imperial-class Star Destroyers comprised Death Squadron at any one time, while Vader or the fleet's admiral could reassign ships from other fleets to Death Squadron whenever needed. Likewise, ships assigned to Death Squadron could be sent off from the main fleet on reconnaissance missions when appropriate."}, {"tag": "p", "text": "The centerpiece of Death Squadron was Vader's flagship, the Super Star Destroyer Executor, while a number of smaller vessels routinely acted as support ships. Together, Death Squadron was the most powerful assemblage of warships in galactic history."}, {"tag": "p", "text": "Famed units attached to the fleet included Baron Soontir Fel's 181st Imperial Fighter Wing, Major General Maximilian Veers' Blizzard Force, the Scimitar TIE/sa bomber squadron, the Obsidian TIE/LN starfighter squadron, and elements of Stormtrooper Commander Bow's 501st Legion."}, {"tag": "h3", "text": "Ships"}, {"tag": "p", "text": "Death Squadron's permanent establishment consisted of the Executor and five Imperial-class Star Destroyers (the Avenger, Stalker, Conquest, Tyrant, and Devastator), though Vader had authority to temporarily attach other fleets' ships when it was necessary. During the Blockade of Yavin, the Accuser had been part of Death Squadron's temporary line of ships. During the Battle of Hoth, Death Squadron included the Imperial II-class Star Destroyers Avarice (which was destroyed by X2 of Grey Squadron) and Corrupter, the Victory-class Star Destroyer Firewind as well as at least one Imperial II-class Star Destroyer that ended up obliterated during Death Squadron's pursuit of the Millennium Falcon in the Hoth asteroid field, and at least one Imperial-class Star Destroyer that ended up damaged during the fighting on Hoth."}, {"tag": "p", "text": "As of the Battle of Endor, the squadron had swelled to include dozens of capital ships, which included the Battlecruisers Ilthmar's Fist and Pride of Tarlandia (the latter of which acted as the Executor's second in command), as well as the Chimaera, the Thunderflare, the Accuser, Imperial I-class Star Destroyer Adjudicator (which had previously served Death Squadron in the Battle of Poln System), the Death's Head, the Stormhawk, the Nemesis, the Inexorable, the Relentless, and at least 20 other Imperial-class Star Destroyers, as well as 3 Tector-class Star Destroyers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Hunting the Alliance"}, {"tag": "p", "text": "Darth Vader formed Death Squadron after the Imperial defeat at the Battle of Yavin. For three years, Death Squadron hunted the Rebel Alliance from system to system under the command of Admiral Kendal Ozzel, mercilessly crushing any Rebel forces it encountered. At some point during this time, it rendevouzed with a fleet of Allegiance-class battlecruisers, Imperial-class Star Destroyers, Procursator-class Star Destroyers, Bellator-class dreadnoughts, and various squadrons of TIE Advanced x1 starfighters, the x1s being present among the fleet due to the fleet in question being a high-mobility fleet. Eventually, a probe droid launched by the Stalker succeeded in locating the Rebel Alliance base of operations on the ice world of Hoth."}, {"tag": "p", "text": "After participating in the space and ground battles at Hoth, Death Squadron pursued the Millennium Falcon, which was lost in the Hoth asteroid belt. The squadron also lost at least two of its Star Destroyers, including one Imperial II-class Star Destroyer, to asteroid collisions during their pursuit of the Millennium Falcon."}, {"tag": "h3", "text": "Battle of Endor and fragmentation"}, {"tag": "p", "text": "One year later, Death Squadron, under the command of Admiral Firmus Piett, served as the core of the Imperial fleet at the Battle of Endor, its ranks having swelled to include dozens of Star Destroyers. It also gained a second-in-command flagship in the form of the battlecruiser/support vessel Pride of Tarlandia. During the battle, the flagship Executor was destroyed by a Rebel starfighter crashing into the bridge which left the ship disabled. Being disabled the Executor then descended and exploded on the Death Star. The battlecruiser Pride of Tarlandia and sixteen Star Destroyers were destroyed as well."}, {"tag": "p", "text": "With the two lead ships of the squadron destroyed, leadership fell to the commanding officer of the Chimaera, Captain Gilad Pellaeon. When the Death Star was destroyed shortly thereafter, and the assumed deaths of both Emperor Palpatine and Darth Vader were apparent, Pellaeon ordered a retreat to the Moddell sector capital Annaj."}, {"tag": "p", "text": "Upon arrival, Pellaeon was relieved of command by superior officer Admiral Adye Prittick and a summit of the surviving Captains and Admirals was convened to determine their next move. Dissension resulted in the fracturing of the unit, with some taking their ships and going their own way, while the Death Squadron title officially remained with Prittick and a mere dozen Star Destroyers. Prittick ordered the remnants of Death Squadron to withdraw once more to Yag'Dhul."}, {"tag": "h3", "text": "The Thrawn campaign"}, {"tag": "p", "text": "The twelve Star Destroyers and their support lines remaining in Death Squadron were among the few naval assets that remained truly loyal to the Empire after it fragmented into various warlord fiefdoms after Palpatine's death. Indeed, despite being appointed Supreme Commander by the Imperial Ruling Council-in-exile after his return to the galaxy in 9 ABY, Death Squadron was the only force truly available to Grand Admiral Thrawn at the onset of his final campaign against the New Republic. Despite being nominally unified by Thrawn, the Ruling Council and the Moffs hoarded military assets as much in fear of each other as the New Republic."}, {"tag": "p", "text": "Of the twelve Star Destroyers remaining in Death Squadron, Thrawn judged only six - the Chimaera, the Judicator, the Death's Head, the Stormhawk, the Nemesis and the Inexorable - fully reliable. Thrawn split the squadron into two fleets: the fleet of six Loyalist Star Destroyers led by the Chimaera under his personal command, and a second force of six ships led by Captain Dorja aboard the Relentless."}, {"tag": "p", "text": "Of the ships remaining in Death Squadron at the start of the Thrawn campaign, only the Chimaera and the Relentless were known to still be active by the signing of the Bastion Accords."}, {"tag": "h2", "text": "Known officers"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}