{"url": "Death_Star_Owner%27s_Technical_Manual", "categories": ["Category:Real-world articles", "Category:Legends Haynes Manuals"], "nodes": [{"tag": "h1", "text": "Death Star Owner's Technical Manual"}, {"tag": "p", "text": "The Death Star Owner's Technical Manual, also referred as Death Star Owner's Workshop Manual and Imperial Death Star: DS-1 Orbital Battle Station, is a reference guide from Del Rey and Haynes Publishing written by Ryder Windham, and illustrated by Chris Reiff and Chris Trevas. The guide is a follow-up to the Millennium Falcon Owner's Workshop Manual. It was released on November 5, 2013, although pre-release versions of the book were issued to winners of a contest included in Star Wars Insider 145."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Using brand-new, full-color cutaways providing a unique view inside the moon-sized marvel, together with other art and photographs, The Death Star Owner's Workshop Manual provides the most thorough technical description of the Death Star available, making it essential reading for all Star Wars fans."}, {"tag": "p", "text": "The Death Star is a spherical space station, the size of a small moon, highly armored and armed to destroy anything from enemy spaceships to whole planets. Using cutaway drawings, exploded diagrams, and photographs, backed by detailed technical specifications and descriptions of the onboard systems, the Death Star Owner's Workshop Manual reveals the technology contained within and lays bare the awesome power (and weaknesses) of the Empire's ultimate weapon."}, {"tag": "h2", "text": "Back cover summary"}, {"tag": "p", "text": "Conceived as the Empire's ultimate weapon, the Death Star battle station with equipped with a planet-shattering superlaser. The station is heavily shielded, defended by TIE starfighters and laser cannons, and invested with firepower greater than half the Imperial fleet. The Empire's diabolical leaders have every reason to believe that their technological terror will induce fear across the galaxy. But the Death Star has one flaw."}, {"tag": "p", "text": "This Haynes Manual traces the origins of the Death Star, from concept to a top-secret project that begins before the foundation of the Empire, which draws design inspiration from the Trade Federation's spherical warships. In this manual, the Death Star's onboard systems and controls are explained in detail, and are illustrated with an astonishing range of computer-generated artwork, floor plans, cutaways and exploded diagrams, all newly created by artists Chris Reiff and Chris Trevas—the same creative team behind the Millennium Falcon Owner's Workshop Manual. Text is by their Falcon colleague Ryder Windham, author of more than fifty Star Wars books."}, {"tag": "p", "text": "Covering history, development and prototyping, superstructure, energy and propulsion, weapons and defensive systems, hangar bays, security, service and technical sectors, crew facilities, and with information about the Death Star II and its planetary shield generation, this is the most thorough technical guide to the Death Star available."}, {"tag": "h2", "text": "Continuity"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media gallery"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}