{"url": "Death_Star_II_plans", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with conflicting sources", "Category:Pages needing citation", "Category:Military reports and documents"], "nodes": [{"tag": "h1", "text": "Death Star II plans"}, {"tag": "p", "text": "The Death Star II plans were the top secret construction data for the Empire's planet-destroying superweapon, the second Death Star. As part of a devious scheme masterminded by Emperor Palpatine to destroy the Rebel Alliance, the plans were delivered into the hands of the Alliance through Black Sun leader Prince Xizor, under the guise of being stolen, providing them with the technical data needed to formulate the assault on the Death Star, culminating in the Battle of Endor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Following the destruction of the first Death Star at the Battle of Yavin, the Emperor immediately ordered the construction of a new battle station that would surpass his first Death Star in both sheer size and destructive power. With the completion of this weapon, he planned to remove the scourge of the Rebellion from the galaxy for good and cement the New Order as the unquestioned galactic power."}, {"tag": "p", "text": "At some point, the Emperor devised a plan that would turn the same process by which the Rebellion destroyed the first Death Star into their ultimate undoing. Whereas Rebel spies stole the plans to the first Death Star, enabling them to formulate the assault that destroyed that battle station, the Emperor would allow the plans to his second battle station to intentionally fall into Rebel hands in order to draw them into a trap that would allow the Empire to finally destroy them."}, {"tag": "p", "text": "In 3 ABY, as construction on the new Death Star neared completion, the Emperor began to put his plan into action. The key to his machinations would be the Falleen Xizor, Dark Prince of the criminal organization Black Sun. Ultimately, Xizor would act as the Emperor's greatest pawn. The criminal leader's infinite wealth and influence, second only to that of the Emperor and Darth Vader, would be used to draw the Alliance into a false sense of security. Although devious and untrustworthy as most criminal organizations were, the Alliance did not necessarily view Black Sun as an enemy. As a criminal organization, it would only be reasonable to assume that Black Sun was a natural enemy of the Empire. It was this assumption that the Emperor foresaw and sought to exploit."}, {"tag": "p", "text": "The Emperor began mutual relations with Xizor sometime before the Battle of Hoth. Xizor would serve a two-pronged service to the Emperor: on one hand, the Dark Prince and Lord Vader were bitter rivals, jockeying for Palpatine's favor. Palpatine deliberately allowed Xizor to become privy to the knowledge that Luke Skywalker was in fact the son of Vader, and that the Emperor and Vader intended to turn him to the dark side of the Force. The Emperor realized that while Vader intended to keep Skywalker alive, Xizor would attempt to kill him in order to permanently discredit Vader in the eyes of the Emperor, in hopes of perhaps replacing him at Palpatine's side. If Xizor did succeed in killing Skywalker, it would mean no difference to the Emperor, for it would prove that the boy was not powerful enough to have been worth the effort to corrupt him in the first place, and his burgeoning abilities in the Force would no longer be a threat. Secondly, the Emperor would use Xizor to deliver the Rebels to him. In an effort to gain greater favor with the Emperor, Xizor introduced a plan to him to allow the plans to the uncompleted Death Star to fall into the hands of the Alliance. Knowing where the Death Star construction site was located and the construction time table, the Rebels were sure to launch an attack, and the Empire would be waiting to intercept and destroy them."}, {"tag": "p", "text": "Darth Vader didn't trust Xizor and warned the Emperor against his plans. Xizor actually wanted to gain the Emperor's favor and have the Alliance defeated. However, his plan B was that, in the unlikely possibility the Rebels would win this war, the eventual new order would not forget Black Sun's \"generous contribution\" to their victory. It is likely, however, that the Emperor first devised this very scheme and only allowed Xizor to believe it was his own idea in order to use him as a pawn."}, {"tag": "h3", "text": "The Alliance is informed"}, {"tag": "p", "text": "The first bits of information linked to the construction of the second Death Star came by way of Imperial defector Commander Zaletta, hoping to prove his integrity to the Alliance. High on the Imperial command structure, Zaletta had a vast knowledge of secret Imperial projects. He informed the Alliance of a secret Imperial research facility in the Kuat system testing a new experimental reactor system, which was likely connected to the Death Star. Next, he informed the Alliance that a massive Imperial convoy was to pass through the Eidoloni system. It was discovered that the convoy, which consisted of XTS cargo freighters and was protected by a very large escort including the Victory II-class Star Destroyers Protector and Vanguard, was carrying construction material. The convoy was, unbeknownst to the Alliance at the time, headed for the Death Star II construction site over the forest moon of Endor."}, {"tag": "p", "text": "Xizor leaked information of a massive construction project being undertaken by the Empire to the Bothan Spynet through a female Black Sun contact, which likely was his own personal aide, Guri. The Bothans first attempted to learn of the details of this project by bribing a high-ranking Imperial officer into allowing them to infiltrate a slicer droid into the Coruscant computer network to locate and copy the plans, though this plan failed. They did, however, learn that that project details were being held in closely guarded special computers, of which one of these was being shipped secretly from Coruscant to Bothawui disguised as a simple freighter carrying fertilizer."}, {"tag": "h3", "text": "Capture of the Suprosa"}, {"tag": "p", "text": "Koth Melan, a leader of the Bothan Spynet, chose to relay this knowledge to the Alliance for free, rather than sell the information as Bothans were known to do, out of disgust for the execution of his father by the Empire. Luke Skywalker and Dash Rendar, along with a group of Bothans with Alliance sympathies, planned to intercept the Imperial freighter Suprosa at Bothawui and steal the secret computer."}, {"tag": "p", "text": "Skywalker, in his personal X-wing, and Rendar, in his YT-2400 light freighter Outrider, were joined by a dozen BTL-S3 Y-wing starfighters piloted by the squad of Bothans and Alliance pilot Ace Azzameen. They successfully intercepted the Suprosa as it exited hyperspace, but quickly learned that the seemingly defenseless freighter was in fact heavily armed and shielded, and instructed not to surrender its cargo without a fight. The freighter managed to launch a single Diamond Boron Missile, which destroyed four of the Y-wings. Before Skywalker and Azzameen managed to subdue the freighter, six Y-wings were destroyed in total, including all twelve Bothan pilots on board. Rendar then boarded the Suprosa with a group of Bothans led by Melan to capture the computer."}, {"tag": "p", "text": "The resistance of the Suprosa was of course artificial, to ensure that the Alliance did not believe they had acquired the information too easily."}, {"tag": "h3", "text": "Battle of Kothlis"}, {"tag": "p", "text": "In order to prevent losing the supercomputer to a self-destruction device, Melan took it to the Bothan colony world of Kothlis to be decrypted by a special team."}, {"tag": "p", "text": "However, while en route to Kothlis, the party was attacked by the Immobilizer 418 cruiser Claw and the Victory I-class Star Destroyer Hunter. However, the Claw was driven off by Blue Squadron, and the Rebels managed to arrive at Kothlis."}, {"tag": "p", "text": "Koth Melan and Skywalker, while decoding the data in a safehouse down on the planet, were attacked by a team of Barabel bounty hunters looking for the bounty on Skywalker, led by Skahtul. Melan was killed and Skywalker captured."}, {"tag": "p", "text": "During the assault a single Bothan managed to escape the safehouse and the planet with the computer along with Borsk Fey'lya aboard his personal shuttle, Fey'lya's Pride, just as Darth Vader and his personal flagship Executor arrived in system along with the Imperial II-class Star Destroyer Avenger."}, {"tag": "h3", "text": "Two Rebel spies"}, {"tag": "p", "text": "Simultaneously, Rebel agents Tay Vanis aka Tiree and Yom Argo were supposed to receive them from the Bothans and pass them to the central command. Unfortunately, Tiree was captured on an unnamed planet. He left a message in his downed X-wing to communicate to any Rebel sent after him that the plans were hidden in the memory banks of droid LE-914. Argo ran away, his goal being to report to the Rebel command and lead a rescue effort for Tiree. He flew on his ship with his personal astromech droid. Unfortunately, as soon as Argo left the Bothans, he crash-landed on Lahsbane, killing himself and a Lashbee."}, {"tag": "h3", "text": "The fate of Razor"}, {"tag": "p", "text": "Meanwhile, the surviving Bothan spies fled from Kothlis on Fey'lya's Pride, with the stolen Imperial computer to Kothlis II, a space station in orbit around Kothlis. Around that time, Darth Vader's Death Squadron, the Executor, supported by the Avenger has arrived and begun its attack on Kothlis II, where the computer is transferred on to the Razor. Under covering fire from Liberty the Razor makes it safely to hyperspace."}, {"tag": "p", "text": "Vader had come to Kothlis to collect Skywalker as well as to make it appear as if the Empire was genuinely concerned with the \"loss\" of the plans."}, {"tag": "p", "text": "While en route to its rendezvous with the Independence, the Razor has come under attack by an Imperial pursuit group. The corvette is eventually captured by the Avenger, but managed to launch an escape pod which is picked up by the civilian Dreadnaught Mercury. She picked up an escape pod carrying a lone Rebel crewman, who had with him the plans for the second Death Star."}, {"tag": "h3", "text": "Reclaim"}, {"tag": "p", "text": "Mercury then took the escape pod to the rendezvous point with Independence and launched the escape pod again to reach the Cruiser. Avenger though showed up again along with the Executor. The crew of Independence, however, managed to protect the pod while moving to the cruiser."}, {"tag": "p", "text": "Meanwhile, Luke Skywalker and Leia Organa searched for Tiree and found his clue, but Darth Vader himself was torturing Tiree and left him behind to die, hoping to lure Skywalker to a trap. However, when LE-914 saw Tiree, she gave the plans to Luke and self-destroyed, buying the Skywalkers time to escape."}, {"tag": "p", "text": "Analysis of the plans helped the Alliance design the assault against the new Death Star. This also led them into a trap, since the station was fully armed and operational. The assault was foreseen by the Emperor and the fleet was surrounded in the Battle of Endor. Ironically, however, the plans proved to be the Emperor and, to a lesser extent, the Empire's doom. The Rebels, though caught off-guard and losing several crucial ships to the Death Star's very much operational superlaser (including the medical frigate Redemption and the command cruiser Liberty), they managed to defeat the Emperor and destroy the mighty battle-station, dealing the Empire a crippling blow."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While the adventure of the first Death Star plans and the Operation Skyhook has been thoroughly explored in the Expanded Universe, the story of how the Alliance acquired the plans for the Death Star II was first told in the post–Return of the Jedi Marvel Star Wars comics, with additional information coming later in Star Wars: Shadows of the Empire."}, {"tag": "p", "text": "Unlike the oft-used phrase \"Death Star plans\" concerning those of the first Death Star, the plans of the second Death Star are only vaguely referred as \"structure data\" or \"blueprints\"; the name \"Death Star II plans\" is therefore conjectural."}, {"tag": "p", "text": "Different sources give different accounts of the fate of the plans around the Battle of Kothlis. While the plans did eventually end up in the Rebels' hands in all cases, this article describes the events as told in X-wing Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}