{"url": "Death_Star_III", "categories": ["Category:Legends articles", "Category:Death Stars", "Category:Starship superweapons", "Category:Starships of the Galactic Empire", "Category:Starships of the Imperial splinter factions", "Category:Worldcraft"], "nodes": [{"tag": "h1", "text": "Death Star III"}, {"tag": "p", "text": "The Death Star III, also known as the third Death Star, was a mock Death Star battle station created from an incomplete worldcraft by the Kaarenth Dissension. In 4.3 ABY, Supreme Commander Ennix Devian of the Kaarenth Dissension used this false Death Star to create a diversion at the temporary Alliance of Free Planets capital of Endor while his forces stealthily hijacked countless warships from neighboring Alliance shipyards. While the Kaarenth Dissension's sophisticated feint was a successful distraction, this so-called Death Star III was ultimately destroyed by Red Squadron when Red Leader made a direct hit to its unprotected thermal exhaust port."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The exact measurements and capabilities of the station are not completely known, except that it was armed with a superlaser similar to the other stations in the series and had a relatively heavier defense network of turbolasers dotting the surface."}, {"tag": "p", "text": "The station was never completed and at the time of its destruction, scaffolding was still present in the trench leading to its weak spot, creating obstacles for would-be attackers. Nonetheless, the station had been nearing finalization, evidenced by its looking more whole compared to the Death Star II."}, {"tag": "p", "text": "Despite it being created either during or after the Death Star II, which had removed various design flaws that doomed the first Death Star, it still shared the same design flaw as the first Death Star: a thermal exhaust port located within one of the trenches."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the reign of Emperor Palpatine, the Galactic Empire manufactured a select number of worldcrafts, a large type of habitation spheres that resembled natural planetoids and could travel through both realspace and hyperspace. Those exceptional starships were all commissioned by the Emperor himself as a gift to his most devoted servants. Two of those worldcrafts, which had been intended to be supplied to Moff Ardus Kaine and the Emperor's personal hitman Ennix Devian, were being built in orbit of Coruscant, the capital world of the Empire."}, {"tag": "p", "text": "Shortly after Palpatine's death at the Battle of Endor, Devian stole both unfinished worldcrafts. After sending them to two separate corners of the galaxy, he reconverted one of them into a Death Star-like battlestation with the intention of creating a feint against the enemy Alliance of Free Planets, whom at that time were based at Endor."}, {"tag": "p", "text": "The battle station underwent construction near Endor and was guarded by a fleet of Imperial-class Star Destroyers. Its exact date of it commencing construction, however, remained a mystery, although it was closer to completion a few months after Endor."}, {"tag": "p", "text": "A few months after the Battle of Endor, a New Republic task force was sent to destroy the station. A similar weakness to the first Death Star had been discovered in the unfinished superstructure, and Republic starfighters made their way past the Imperial escorts, fought TIE squadrons and made a trench run to their designated target, as well as having to defend an inexperienced StarSpeeder 3000 Star Tours pilot that accidentally came into the conflict."}, {"tag": "p", "text": "Firing proton torpedoes into the thermal exhaust port, the fighters withdrew from the battle, leaving the station to be destroyed. Ultimately, however, its destruction acted as a Pyrrhic victory for the Rebels, as Devian used the distraction caused by the battle to steal several vessels from various shipyards owned by the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Death Star III idea was created by Leland Chee to explain why a Death Star is present on the Star Tours ride when both of the stations in the movies were destroyed. It was later confirmed as canon in the blog Convenient Daily Departures: The History of Star Tours on StarWars.com."}, {"tag": "p", "text": "The station being built near the Forest Moon of Endor like the Death Star II before it is similar to an original concept for Return of the Jedi, where two Death Stars would have been built near Had Abbadon (then the Imperial capital world)."}, {"tag": "p", "text": "The Habitation spheres, based on the Imperials' suspicious claims that they were designed strictly for peaceful purposes, were suggested by some fans to have been the origin for the Death Star III. This was later revealed to be the case in Part 2 of the StarWars.com Blog series The Imperial Warlords: Despoilers of an Empire."}, {"tag": "p", "text": "In the non-canon game Tiny Death Star, a random HoloNet entry states that one of the residents of the Death Star is simply staying there until he can afford to stay at the Death Star 3."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}