{"url": "Death_Star_II/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Death Star II locations", "Category:Death Stars", "Category:Imperial Department of Military Research products", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Death Star II"}, {"tag": "p", "text": "The Death Star II was the second Death Star battlestation to be constructed by the Galactic Empire. It was significantly larger than its predecessor, measuring over 160 kilometers in diameter, and was built after the destruction of the first Death Star at the Battle of Yavin. Emperor Palpatine insisted on the reconstruction of the battlestation as it was an integral part in his plan to destroy the Rebel Alliance, leaving the galaxy in the hands of the Empire."}, {"tag": "p", "text": "The Death Star's superlaser was revealed to be operational before the construction of the station was completed, surprising the Alliance attackers during the Battle of Endor. This was Emperor Palpatine's plan all along, and it nearly led to the loss of the Rebels. The Alliance ground forces on the forest moon of Endor managed to deactivate the energy shield surrounding the battlestation, and the Rebel fleet proceeded to destroy the station from within, signifying the beginning of the downfall of the Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Like its predecessor, the Death Star II was made of quadanium steel and equally divided into two hemispheres, which were in turn subdivided into 12 zones. The newest iteration of this dreaded superweapon, however, had a monstrous diameter of over 160 kilometers."}, {"tag": "p", "text": "The second iteration of the battlestation was also designed by engineer Bevel Lemelisk, the original Death Star's designer. Lemelisk was executed for the design flaws in the final version of the destroyed Death Star I, but was cloned by Emperor Palpatine in order to redesign the superweapon, eliminating the flaws of the former battlestation. In the newest version, he added thousands of turbolasers while removing any external weaknesses."}, {"tag": "p", "text": "The most important revisions to the Death Star design made by Lemelisk were made to take into account and eradicate the technical flaws of the original battlestation which had enabled it to be destroyed during the Battle of Yavin. The first major change made in this redesign was the elimination of the two-meter-wide thermal exhaust port that was used to ignite a chain reaction in the main reactor of the first Death Star, destroying it. This was greatly improved, from a defensive standpoint, in the new revision. Instead of venting gases out of a single port, millions of millimeter-wide exhaust ports were scattered over the surface of the station, each of which propelled a small amount of the excess heat and gases into the vacuum. The new system also took advantage of new highly-advanced protections and safe-guards that would seal the small exhaust ports in the event of any unexpected excess of heat or energy."}, {"tag": "p", "text": "The second main advancement in the second Death Star battlestation was the improvement of its superlaser. Still located in the northern hemisphere of the battlestation, the much improved superlaser equipped in the second Death Star was much more powerful than its predecessor, and took only three minutes to recharge, in comparison to the 24 hour recharge required for the first Death Star's superlaser. In addition, while the first Death Star only had the capabilities to fire on very large targets, such as planetary bodies, the improved superweapon was upgraded with additional lower-power weapon fire options and targeting systems that were more suited for fine-tuned accuracy, while still maintaining great destructive power, in order to fire the powerful weapon on enemy capital ships. Unlike the previous Death Star's superlaser that consisted of eight equal sized tributary beams circling the dish, the Second Death Star's superlaser consisted of seven equal sized tributary beams around the dish and one large beam in the center. The increased external surface area of the new station also allowed for larger amounts of conventional armaments, such as turbolasers and other defense batteries, to be placed, further increasing the already impressive Death Star's defenses."}, {"tag": "p", "text": "The third main advancement in the second Death Star battle station was that it now carried three hypermatter reactors, two of which were used solely for the Superlaser Mk. II, making it immensely more powerful than the Superlaser Mk. I used on the first Death Star, which had to share its one hypermatter reactor between all the systems aboard it."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Construction"}, {"tag": "p", "text": "The idea for the second Death Star's development originated as one of two possible scenarios by Bevel Lemelisk and the Imperial Department of Military Research for further development of the Death Star's development, shortly after the completion of the first Death Star. The second Death Star's construction started during the Battle of Yavin, when Emperor Palpatine ordered the construction of new superlasers, to which the resources for its construction, including Hyperspace tugs and threadships, would be sent from their origin near Sullust to Endor via the Silvestri Trace, an obscure hyperspace route. Ironically, he issued this order shortly before the first Death Star's destruction at the hands of Luke Skywalker."}, {"tag": "p", "text": "Different from the Empire's first Death Star, which, as a result of supply and design problems, took twenty-one years to be considered an operational battlestation, this much larger Death Star took far less time to construct. Methods of faster construction had been developed in the years since the original station's conception, added to the fact that Imperial engineers made sure to allocate enough space on the station for the maximum possible amount of self-replicating construction droids."}, {"tag": "p", "text": "The second Death Star's building location remained secret from the Alliance, unlike the first station's construction site at Despayre. After the initial stages of construction, the station was put under the command of Darth Vader during its relocation to a new construction site in the Endor system. Endor was selected due to the massive concentration of strategic metals on the planets Dor, Eloggi, and Megiddo in the system, but the actual construction site was in geosynchronous orbit around the forested Sanctuary Moon, protected by a powerful shield generator on the moon's surface. Its remote status also further reflected the severity of Darth Vader's punishment for his failure at Yavin, due to his being assigned there to oversee the initial construction efforts in the area as well as his being demoted from his position as commander of the primary Imperial fleet."}, {"tag": "p", "text": "During the journey, Vader diverted the Death Star from its path to eliminate a large Rebel Alliance presence on the planet D'rinba IV. A Rebel strike team led by Corwin Shelvay was able to prevent the planet's destruction, but was unable to warn the Fleet of the superlaser's operational status in time."}, {"tag": "p", "text": "At the new location of the battlestation, in the Moddell sector, construction resumed soon after the superweapon's arrival. Recommissioned from his former position of Moff of the Quanta sector, Moff Tiaan Jerjerrod was placed in charge of supervising the final stages of the station's construction."}, {"tag": "p", "text": "Resources that could not be produced locally were secretly ferried to the distant world from all over the galaxy along the Sanctuary Pipeline, with some of the materials shipped to the area on three hundred ships from Prince Xizor's civilian company Xizor Transport Systems. It is unclear what percentage of construction material the XTS haulers carried, or whether the outsourcing was genuinely necessary. Emperor Palpatine not only anticipated Xizor's decision to pass on the location of the Death Star II to the Rebel Alliance, but even leaked his personal schedule so the Rebels would know when he would personally be aboard. This may have been the sole reason for his involvement of the Falleen in the first place."}, {"tag": "p", "text": "IG-88A, a droid bounty hunter, had uploaded his consciousness into a computer core that was in transit to the location of the second Death Star. When the computer core was installed into the battlestation, the entire Death Star effectively became IG-88A's droid body. He took control of the computer systems on board the station, and planned to use the superweapon to further his Droid Revolution. Although many incidents of computer commands being executed autonomously occurred, they were simply documented as technical faults and glitches. Emperor Palpatine was the only one to recognize any strange happenings, as IG-88A played a joke on the Emperor by shutting doors in front of him."}, {"tag": "h3", "text": "Acquiring the Death Star II plans"}, {"tag": "p", "text": "The first bits of information linked to the construction of the second Death Star came by way of Imperial defector Commander Zaletta, hoping to prove his integrity to the Alliance. High on the Imperial command structure, Zaletta had a vast knowledge of secret Imperial projects. He informed the Alliance of a secret Imperial research facility in the Kuat system testing a new experimental reactor system, which was likely connected to the Death Star. Next, he informed the Alliance that a massive Imperial convoy was to pass through the Eidoloni system. It was discovered that the convoy, which consisted of XTS cargo freighters and was protected by a very large escort including the Victory II-class Star Destroyers Protector and Vanguard, was carrying construction material. The convoy was, unknown to the Alliance at the time, headed for the Death Star II construction site over the forest moon of Endor."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, a Mistryl Shadow Guard team led by Manda D'ulin was able to steal a prototype section of the second Death Star's superlaser from an Imperial research facility on Gorno. The model, codenamed Hammertong, was installed on a Strike-class medium cruiser, which Shada D'ukal and Karoly D'ulin crash-landed in the Dune Sea on Tatooine. Their astromech droid, Deefour, containing the technical readouts of Hammertong, was later stolen by a Rebel Alliance member named Riij Winward."}, {"tag": "p", "text": "The actual plans concerning the existence of the Death Star and its location first came into Rebel hands via the devious scheming of Prince Xizor, under authorization of Emperor Palpatine. It is uncertain though, if the Emperor did not first concoct a similar plot, and only allowed Xizor to believe it was his own idea in order to use the criminal leader as a pawn. Xizor leaked information of a massive construction project being undertaken by the Empire to the Bothan Spynet through a female Black Sun contact, which likely was his own personal aide, Guri. The Bothans first attempted to learn of the details of this project by bribing a high-ranking Imperial officer into allowing them to infiltrate a slicer droid into the Coruscant computer network to locate and copy the plans, though this plan failed. They did, however, learn that that project details were being held in closely guarded special computers, of which one of these was being shipped secretly from Coruscant to Bothawui disguised as a simple freighter carrying fertilizer. Koth Melan, a leader of the Bothan Spynet, chose to relay this knowledge to the Alliance for free, rather than sell the information as Bothans were known to do, out of disgust for the execution of his father by the Empire. Luke Skywalker and Dash Rendar, along with a group of Bothans with Alliance sympathies, planned to intercept the Imperial freighter Suprosa at Bothawui and steal the secret computer."}, {"tag": "p", "text": "Skywalker, in his personal X-wing, and Rendar, in his YT-2400 light freighter Outrider, were joined by a dozen BTL-S3 Y-wing starfighters piloted by the squad of Bothans and Alliance pilot Ace Azzameen. They successfully intercepted the Suprosa as it exited hyperspace, but quickly learned that the seemingly defenseless freighter was in fact heavily armed and shielded, and instructed not to surrender its cargo without a fight. The freighter managed to launch a single diamond boron missile, which destroyed four of the Y-wings. Before Skywalker and Azzameen managed to subdue the freighter, six Y-wings were destroyed in total, including all twelve Bothan pilots on board. Rendar then boarded the Suprosa with a group of Bothans led by Melan to capture the computer. The resistance of the Suprosa was to ensure that the Alliance did not believe they had acquired the information too easily, thus suspecting it to be compromised. In order to prevent losing the supercomputer to a self-destruction device, Melan took it to the Bothan colony world of Kothlis to be decrypted by a special team. Inside a safehouse on Kothlis, Bothan technicians working on the computer had just tapped into its data when a group of bounty hunters blasted into the facility looking for Skywalker, unaware of the computer's existence. A single Bothan managed to escape the safehouse and the planet with the computer along with Borsk Fey'lya aboard his personal shuttle, Fey'lya's Pride, just as Darth Vader and his personal flagship Executor arrived in system along with the Imperial II-class Star Destroyer Avenger."}, {"tag": "p", "text": "Vader was sent to Kothlis by the Emperor both to collect Skywalker, who was being held prisoner on the planet by the group of bounty hunters, and also to further make it appear as if the Empire was genuinely concerned with the loss of the stolen computer. The shuttle transferred the lone Bothan and the computer with half of the plans to one of two CR90 corvettes with the name Razor, which was stationed near Kothlis II, a Rebel outpost platform in orbit over the planet. The two Star Destroyers destroyed the Kothlis II facility, but were unable to prevent Razor and the Death Star plans from escaping into hyperspace. However, the Avenger soon caught up with and captured the Razor a short time later, although the Bothan fled desperately with the supercomputer aboard an escape pod. The pod was picked up by the civilian Dreadnaught cruiser Mercury, from which it was transferred to the Mon Calamari Star Cruiser Independence. Meanwhile, the other Razor was entangled in a conflict with the Imperial I Star Destroyer Motivator over Kothlis, of which the latter was eventually shot down over Kothlis by Rogue Squadron. They then entered Kothlis's atmosphere to retrieve the data from the Motivator's wreck. Afterwards, the data was finally secured and decrypted, and the existence of the Death Star realized. Likewise, a mission to Korriban by Renegade Squadron, where they were to trap Emperor Palpatine long enough to steal his datapad to find anything useful, revealed that Palpatine was to personally oversee the construction of the Death Star II."}, {"tag": "p", "text": "In order to confirm the newly acquired information on the second Death Star, a group of Bothans covertly infiltrated the Death Star II construction site in the Endor system aboard three freighters disguised as cargo haulers. There, they determined that construction was indeed taking place over the Forest Moon of Endor, that the battlestation was being protected by an energy shield projecting from the Sanctuary Moon, and that the Death Star's main superlaser was not yet operational, though this final piece of information would turn out to be false. As these Bothans were returning to rendezvous with the Alliance fleet with their reconnaissance data, they were stopped by the Imperial II-class Star Destroyer Accuser and the Immobilizer 418 cruiser Grappler as part of an Imperial Customs patrol searching for the spies. A flight of X-wings and A-wings attached to the Mon Calamari Star Cruiser Liberty arrived and managed to drive off the Interdictor cruiser, allowing one of the Bothan freighters to escape to the Alliance fleet. The remaining two ships were destroyed by the Accuser and all Bothans aboard were killed. Still, the deaths of many Bothans enabled the Alliance to coordinate the attack that destroyed the second Death Star."}, {"tag": "p", "text": "The Empire eventually utilized the Death Star II as bait for a trap against the Rebel Alliance. They also planned on using the battlestation's superlaser on Dac and Chandrila after wiping out the Rebel Alliance at Endor."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "Soon after learning of the secret location of the unfinished second Death Star, the Alliance met secretly at Sullust and formed battle plans for their assault on the station above the forest moon of Endor. There, the orbiting Death Star was protected from any external attacks by a surrounding energy shield projected from the moon's surface. It would have to be disabled before any forces could engage the battlestation itself."}, {"tag": "p", "text": "With that in mind, the Alliance split their forces into two teams, each with separate goals. A small ground squad, consisting of General Han Solo, Chewbacca, Leia Organa, Luke Skywalker, the droids C-3PO and R2-D2, and numerous other Rebel commandos, was dispatched down to the surface of the forest moon of Endor, with the goal of disabling the energy shield. The Alliance fleet, led by General Lando Calrissian piloting the Millennium Falcon, would then arrive to destroy the main reactor of the Death Star from the inside: the Alliance fleet would provide a distraction of sorts, engaging the Imperial fleet, while the Falcon and a small detachment of fighters would fly directly into the station's core and destroy the main hypermatter reactor core."}, {"tag": "p", "text": "Eventually, after several cruisers in the Rebel fleet, including the Liberty, the Urjani, and an unnamed Mon Calamari ship were destroyed, the ground team on Endor succeeded in destroying the shield projector, with the help of the indigenous Ewoks, allowing General Lando Calrissian and several starfighters of the fleet to commence their run on the station's main reactor. The pilots flew through the very tight coolant shaft and the station's capacitators to the center of the massive station, and detonated the core with well placed concussion missiles, launched by the Falcon, and proton torpedoes launched from an X-Wing fighter piloted by Wedge Antilles targeting the reactor's primary control tower. The projectiles all connected with their targets and the resulting explosion created a reaction which destroyed the space station completely. Just prior to the destruction, a large amount of the non-essential crew underwent an evacuation order."}, {"tag": "p", "text": "The explosion of the station's hypermatter core created a minor wormhole at its collapse. Most of the station's wreckage was instantly obliterated, though some would pass through said wormhole, including Darth Vader's right glove. While some debris ended up on Mon Calamari, it is believed that more was dispersed throughout the galaxy. The wreckage that was not destroyed and did not enter the wormhole remained in Endor's orbit or fell to the moon's surface, though most of the wreckage that fell towards the moon was picked up by the Rebels with tractor beams, before it could cause too much damage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are discrepancies regarding the size of the Death Star II, which has generated some controversy. The West End Games RPG initially claimed that the second Death Star had a diameter of 160 kilometers. The majority of Expanded Universe material since then has repeated this number, although the Inside the Worlds of Star Wars Trilogy fact book, via detailed scaling of the station in the film and statements by ILM visual effects designer Richard Edlund show that the second Death Star was actually over 900 kilometers in diameter. The Official Site's Databank updated its article in 2008 to reflect the higher number. Star Wars Insider 105 also included this size. However, the Death Star Owner's Technical Manual changed the dimension to 160 km."}, {"tag": "p", "text": "The specifications above may hold some discrepancy as well; these figures are for the \"incorrect\" undersized version. They would be closer to what would be carried by the first Death Star. The proper figures for the second Death Star may be several orders of magnitude higher."}, {"tag": "p", "text": "If the players do not win the Interactive Video Board Game, Darth Vader destroys D'rinba IV. However, since the in-game objective is to prevent him from doing so, the outcome due to failure results in an apocryphal version of events as regards canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}