{"url": "Death_Trap", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Death Trap"}, {"tag": "p", "text": "\"Death Trap\" is the twentieth episode in Season Two of the Star Wars: The Clone Wars television series. It aired on April 17, 2010 in the UK and on April 23 in the US. It is the first of a three-part storyline."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "A young boy wages war against the Jedi Knights who left him orphaned, bitter, and alone."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A squad of chronologically six year old clones are briefed by a more experienced trooper en route on their journey to the Star Destroyer Endurance. Afterward, several of the clones (each with different haircuts) tease their newest member, a young recruit who calls himself \"Lucky\" (actually Boba Fett), before being reprimanded by another clone who appears to be the group's leader."}, {"tag": "p", "text": "Upon arrival, the young soldiers are greeted by Jedi Generals Mace Windu and Anakin Skywalker. Subsequently, the clones are given opportunities to demonstrate their training through target practice using explosive skeet; the first two cadets miss their target. When admiral Kilian notices the look in Boba's eyes, he orders him onto the turret. The clone gunner deploys one explosive skeet, who Boba destroys with precise accuracy. The clone gunner believes that he got lucky, and sends out three skeets in Separatist attack formation; Boba destroys all three, surprising the gunner. As the cadets leave for the observation deck, Kilian expresses his admiration for Boba's talents to the gunner."}, {"tag": "p", "text": "Resuming their tour of the ship, Boba quickly strays away from his group and manages to bluff his way into Mace Windu's quarters where he stealthily installs a bomb triggered by stepping through a laser in the doorway. As Mace enters his quarters, he is soon called off for another meeting and instead orders a clone to go inside to drop something off for him. The clone sets off the trap, killing him."}, {"tag": "p", "text": "The entire ship is placed under alert and as a result, Boba is instructed via comlink to sabotage the reactor core and thus kill everyone, although he exhibits some hesitation. Boba then once again sneaks away from his group but ends up being caught by an unsuspecting trooper who decides to call for security. After a brief scuffle, Boba stuns the clone with his own blaster and shoots the core command console. Much of the hull is immediately destroyed in an explosion and the Jedi are almost sucked into space before the gaping holes are sealed off. Realizing that Endurance is critically damaged beyond repair, the Jedi and most of the surviving crew then choose to abandon ship. However, Kilian stubbornly refuses and stays onboard along with Ponds. The young clones, including Boba, are then jettisoned in an escape pod. Boba sabotages the pod he is in, causing it to drift off away from the others."}, {"tag": "p", "text": "Eventually the pod is discovered by Slave I, with Aurra Sing and Bossk aboard. Boba is revealed to be responsible for the destruction of the Endurance and is given the choice by Sing to go with the clones or go with them. Boba sides with the bounty hunters, muttering an apology to the cadets; Jax states that he'll regret it. As Boba enters the Slave I, Aurra releases the pod into space. Mere seconds after Slave I leaves, Anakin and Mace arrive to find the cadets unharmed. Meanwhile, Admiral Kilian attempts to land the badly damaged Endurance upon the surface of the nearby planet Vanqor."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the scene where Boba Fett gets caught infiltrating the Endurance's engine room, he asks if the clone trooper is holding a DC-15A, to which the trooper replies in the affirmative. However, the blaster was a DC-15S. This contradiction was removed when the designation DC-15S was put into the Legends continuity in 2014."}, {"tag": "p", "text": "When Commander Ponds tells another trooper that he's staying onboard the Endurance with Admiral Kilian, his kama and blaster pistols are missing."}, {"tag": "p", "text": "When \"Death Trap\" was aired in Australia on June 9, 2011, the scene where a clone trooper is blown up entering Mace Windu's quarters and the scene where Boba hits a clone trooper with a DC-15A blaster carbine were cut out of the episode. This could have been for rating reasons, or because of a technical issue."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}