{"url": "Death_Troopers", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Death Troopers"}, {"tag": "p", "text": "Death Troopers is a novel by Joe Schreiber that was released on October 13, 2009. It takes place about a year before A New Hope. The paperback was released on October 26, 2010."}, {"tag": "p", "text": "A prequel, Red Harvest, was released on December 28, 2010."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h4", "text": "Back cover"}, {"tag": "p", "text": "No fate could be more terrifying than being trapped inside deep space."}, {"tag": "p", "text": "Unless there's something unknown out there with you."}, {"tag": "h4", "text": "Internal flap"}, {"tag": "p", "text": "When the Imperial prison barge Purge—temporary home to five hundred of the galaxy's most ruthless killers, rebels, scoundrels and thieves—breaks down in a distant, uninhabited part of space, its only hope seems to lie with a Star Destroyer found drifting, derelict, and seemingly abandoned. But when a boarding party is sent to scavenge for parts, only half of them come back—bringing with them a horrific disease so lethal that within hours, nearly all aboard the Purge will die in ways too hideous to imagine."}, {"tag": "p", "text": "And death is only the beginning."}, {"tag": "p", "text": "The Purge's half-dozen survivors—two teenage brothers, a sadistic captain of the guards, a couple of rogue smugglers and the chief medical officer, the lone woman on board—will do whatever it takes to stay alive. But nothing can prepare them for what lies waiting on board the Star Destroyer amid its vast creaking emptiness that isn't really empty at all. For the dead are rising, soulless, unstoppable, and unspeakably hungry."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Trig Longo, and his older brother Kale Longo, had just watched their father die at the hands of Jareth Sartoris. The boys were aboard the Imperial prison barge Purge. On this barge, their father had a business; selling weapons to inmates. After their father's death, they attempted to make a sale with Aur Myss, who killed their previous contact. Aur Myss was part of the Delphanian Face Gang, which was a prison gang led by Aur Myss; he and his goons were planning to kill the Longo boys. Kale saw this coming and tried to strike a deal with the Delphanian by simply giving him the weapons free of charge. Myss would not have this due to the fact that he promised his goons that they could kill the boys. Kale reacted by ripping the piercings out of Myss' face and the two boys ran back to their cell in time and were safe for the time being."}, {"tag": "p", "text": "Jareth Sartoris, captain of the guard on the barge, is called into the warden's office to discuss something. When he arrives, Bissley Kloth, the warden of the barge, explains that the engines on the Purge are breaking down. The good news being, there is a derelict Star Destroyer in the vicinity. Sartoris questions why the Empire would leave a Star Destroyer in the middle of space but Kloth tells him that it is none of their concern and that the Captain is ordered to go on the ship and retrieve spare parts in order to fix the prison barge's engines. Before Sartoris leaves, the warden states that his interrogation techniques are ineffective because the subjects keep dying, like Von Longo. Sartoris recommends he cancels his duty on the Purge and then leaves to board the Star Destroyer."}, {"tag": "p", "text": "Zahara Cody is the Chief Medical Officer on the prison barge, aided by her 2-1B surgical droid, Waste. She is an outcast among the Imperial Personnel due to the fact that she interacts with inmates all day. She has attachment to some inmates and would rather be around them than the Empire. When she saw Sartoris kill Von Longo, she handed in her resignation letter. Once the barge landed at their next stop, she was away from the Empire for good. She also had some sort of a connection to the Longo boys since she carried out their father's last request, which was to bring them to him."}, {"tag": "p", "text": "Sartoris takes ten men and boards the Vector. They split up so Sartoris and his men can find the parts while the other group finds the medical bay. In the medical bay are pairs of lungs in tubes, breathing in unison. The men in the med bay realize they are not alone and they are unable to escape. Sartoris and his men get back to the lift to return to the Purge. One of his guards is coughing violently while one of the engineers is vomiting. They get back to the barge and rush to the medical bay. All the guards are coughing and vomiting. Then inmates and guards alike begin coughing and vomiting. Soon the entire medical bay is full. Sartoris, however, is unaffected by this new virus."}, {"tag": "p", "text": "In the medical bay, Cody is trying to deal with the problem when Waste comes to the conclusion that the virus only activates after there are enough of the cells that the body cannot defend against it. Cody realizes at this point that their containment measures are useless and rips her isolation suit off. She knows that everyone is going to die so she tries to make everyone as comfortable as possible before they succumb to their fate. Waste acknowledges the fact that she has yet to be sick and that she must be immune. He takes her blood and they attempt to create an anti-virus to stop people from getting sick. But at this point, it is almost too late."}, {"tag": "p", "text": "The Longo boys are stuck in their cell watching everyone die around them. As the noise starts to come down, they begin screaming to let them out. The cell doors open and they walk out, forgetting Myss is in the cell next to them. Myss attacks Kale and is about to kill him when Trig jumps on his back and tries choking him. Myss flips Trig off of him and is about to kill Trig when a blade comes through Myss' mouth. Kale states that he was attacked with it and they both get up and run out of the cell block. When they reach the end, they realize that their friend, Wembley, let them out but died shortly after. They take note of it and start running for the escape pods. They reach the next cell block but they see a young Wookiee in one of the cells with his dead family around him. Trig insists they help the young one and unlocks the doors. They try to get the youngster to go with them but the little one stays with his family and holds them. The boys leave and when they reach the end of this cell block, they hear the young Wookiee screaming and a noise that sounds like something is eating it."}, {"tag": "p", "text": "Sartoris finds that he too is immune and goes to the warden's office. He picks up two E-11 blaster rifles and kills anyone who seems infected near him. He gets to the wardens office to realize that the warden is infected. Sartoris demands the launch codes for the escape pods. The warden gives them up and asks Sartoris if he wants to know what he scored on the psychological exam. Sartoris says \"I think we both know the answer to that question\" and pulls both triggers on the blasters, disintegrating the warden's head."}, {"tag": "p", "text": "Zahara, now with an anti-virus in hand, decides she is going to get it to anyone alive on the barge. She goes to the bridge and asks to do a bioscan of the ship. The ship states that there are six people alive, two of which are in solitary. She reluctantly goes down to solitary, tripping over bodies while getting there. She finds a note that one of the guards was going to give to his wife. She takes it and pockets it. She reaches the first solitary door and opens it, blaster in hand. But no one is in there. She goes to the next one and as soon as she opens it, a huge Wookiee comes out screaming and getting ready to attack Zahara. She yells at him to stop and he does. Zahara unlocks the next door and a man comes out. He introduces himself as Han Solo and the Wookiee's name is Chewbacca. She insists that they take the anti-virus but they are defiant, until they see the bodies around the corner. Han takes it first, then Chewbacca. But Chewbacca did not get it in time and started showing symptoms of the other victims. He starts screaming and going insane and his throat is swelling up. He begins to pass out and Zahara quickly takes the syringe and empties the blisters starting around his neck. The swelling goes down and Chewbacca returns to normal. They get up to leave but they realize the bodies Zahara had stumbled over before are missing. They go back into the medical bay, which is now completely empty, and look for Waste. They find him on the ground in critical condition. Zahara asks what happened to the bodies and Waste replies that they came back and ate. Soon after, Waste deactivates and Zahara turns around to realize Han and Chewie are gone."}, {"tag": "p", "text": "Kale and Trig get to the escape pod and are trying to figure out how to work it when Sartoris appears. He tells them both to get out, he gets in, activates the launch codes, and launches away. Kale quickly realizes that there is another escape pod opposite of the position they are in. They start running that way because they feel the thing that was eating the baby Wookiee is following them. When they reach the other escape pod, they run into Han and Chewie. The boys hold their blasters at them but Han and Chewie quickly disarm them. Zahara comes around the corner and tells them to stop and that they are all getting out together. They realize the escape pod's hatch has been sealed because of security measures. So Han, Chewie, and Zahara go to the bridge to disable it, while Kale and Trig stay at the escape pod. The Longo brothers hear something outside and Kale leaves to investigate. Trig hears something moving inside the escape pod and scratching at the door. Despite his pleas, Zahara opens the pod."}, {"tag": "p", "text": "When Kale comes back, he sees his brother is gone and the escape pod is opened. He frantically starts searching for him. He finds him in a maintenance tunnel all scratched and scared. Then Kale hears things moving toward him through the tunnel. Kale picks up Trig and runs to the bridge."}, {"tag": "p", "text": "Zahara opens the escape pod but doesn't hear anything back on the comlink. Soon after, the bridge's computer says that there are more life-forms since that last bioscan. They look at the map the computer brings up and realizes all the life-forms are headed for the bridge. Soon after, Kale bursts through with Trig in his arms and yells at them to run. They run to the turbolift, which leads to the Star Destroyer, and activate it. Trig comes to and sees his father. Trig runs for his dad, and Kale grabs him and throws him back. But their dad gets Kale and bites him on the leg."}, {"tag": "p", "text": "When Kale awakes, they are in the hangar bay of the Star Destroyer. Kale realizes he has been bit but when he stands up, blood starts spurting out of the wound. Zahara says that she and Kale would stay there and Han, Chewie, and Trig need to get to the bridge to start the engines. Trig at this point is having some issues since he just saw his dead father bite his brother. Reluctantly, he leaves with Han and Chewie."}, {"tag": "p", "text": "Han, Chewie, and Trig are walking along a corridor when the ceiling explodes and hundreds of the zombies come pouring out of the hole. They take off running and end up running in circles. Zahara and Kale are sitting next to the turbolift when Kale tells her to cut his leg off. She notices that his entire leg is turning grey and after some arguing she goes to cut it off but realizes it has moved into his abdomen. Zahara quickly cuts into his stomach and pulls out a big infection cell. As she holds it in her hand, she sees it moving around and trying to find an opening to get into. She quickly disposes of it and cleans up the wounds on Kale."}, {"tag": "p", "text": "Han, Chewie, and Trig arrive at the top of the main Turbine with a small catwalk to cross. Trig decides to stay behind and Han and Chewie press forward. Trig thinks he sees Kale run into a door and Trig runs after him while Han and Chewie find a baby Wookiee crying in the corner. Chewie insists that they open the door. Han opens it and they see three Wookiees eating human remains. The Wookiees turn around and run toward Han and Chewie, and Han instinctively starts blasting them. The baby Wookiee jumps on Han's back and starts clawing at him when Chewie blasts the young one's head wide open. After a moment of silence, they go back and try to fix the engines."}, {"tag": "p", "text": "Zahara and Kale realize that the zombies are coming up the turbolift. She grabs Kale under the arms and starts dragging him across the hangar. The zombies start coming out of the turbolift, equipped with blasters. They start shooting at them though the shots are wild and inaccurate. Kale keeps screaming at her to drop him but she ignores him and just keeps dragging on. She notices that their shots are getting better. Her adrenaline is pumping and she is moving faster than ever when all of a sudden, a blaster bolt hits Kale in the side of the face. She leaves him after that and goes into the medical bay and is attacked by a zombie. She sticks syringes in its head and for a minute it starts to act human again. It scratches out in the ground \"Blackwing\" but the cure doesn't last long and it attacks Zahara again. Suddenly another 2-1B surgical droid saves her. It reminds her of Waste and she has a moment with the droid. The droid leads her to a console that will tell her whats happening. She continues to call the droid Waste and says thank you. Leaving the droid confused, she leaves to go to the console."}, {"tag": "p", "text": "After sometime, Sartoris awakes inside the escape pod. He realizes that the tractor beam of the Star Destroyer was turned on and sucked in the escape pod. He hears blaster fire outside and jumps outside. Noticing zombies all around him, he jumps into an abandoned X-wing and fires. The ship skids across the hangar floor and crashes into an Imperial shuttle. He quickly climbs into the shuttle and is greeted by four men, one being Commander Gorrister who explains that this zombie outbreak is because of a weapon that the Empire had created. He also explains the zombies can learn. They learn what works and what doesn't and how to make it work. The whole time all the men are licking their lips. Gorrister explains that they have been stuck in the shuttle for ten weeks. Then he explains that he started out with 30 men and is now down to 6. Two men grab Sartoris and Gorrister explains that they did what they did to survive and they started encroaching to kill Sartoris. All of a sudden a blast knocks the shuttle and Sartoris breaks free. He realizes the zombies learned from what he did and were getting into scattered ships around the hangar bay. Sartoris starts grabbing the men and throwing them into a crowd of zombies, but the last man pleads for mercy. Sartoris asks him his name, to which he replys \"White\". Sartoris asks if the shuttle will fly. The man says the tractor beam won't let them out. Sartoris says he is going to disable the tractor beam and he will be back. Sartoris jumps into the crowd and goes running through the zombies. He reaches the other side of the hangar and finds a lifter, but also finds out that he has been bit."}, {"tag": "p", "text": "Zahara finds out that the zombie virus is a weapon as well. She uses the word \"Blackwing\" as a password to access the records. Then when she goes to disable the tractor beam, she realizes that it is already disabled. She stays in the bridge because she gets boxed in by zombies on the other side of the door."}, {"tag": "p", "text": "Trig followed who he thought was Kale into a room full of bodies. He lets out a scream and a zombie comes through the mountain and chases him. Trig climbs the mountain and gets into a ventilation duct. The duct turns out to lead right over where Han and Chewie had crossed. The zombie catches up to him and Trig realizes it is Kale. Trig is motionless and Kale starts to climb over Trig to bite him when Trig comes and pushes Kale down the shaft and into the turbine room. He sees Han, who is telling Trig to climb down to the catwalk. Meanwhile all the zombies at the bottom are shooting up at them and they are getting more accurate. Trig tries to climb but falls. He falls into something and he realizes it was the lifter that Sartoris was piloting. Sartoris flies around and gets Han and Chewie. The lifter is overloaded and slowly going down into the crowd of zombies. In a moment of redemption, Sartoris gives Trig the controls and says \"Your father was a good man. Unlike me\" then jumpes over the edge of the lifter and into the zombies. They then fly to where Zahara was, but the bridge is on fire and they see a hand, assuming her to have been killed."}, {"tag": "p", "text": "They get to the shuttle and climb inside. They ask where White is and find him dead. Han and Chewie get to the controls and fly out of the hangar. Suddenly they hear a noise, and one of the zombies is inside the shuttle with them. The zombie kills the two men that were originally in the shuttle and is staring at Han. Just before it attacks, a blaster bolt comes from the back of the shuttle and kills the zombie. Zahara steps out and explains that since the zombies are away from the source of the infection, the zombies die easier. They all ask what happened to her and she states the hand they saw on the bridge was White's. He came to save her and while he did he said \"A stranger saved me too.\" referring to Sartoris."}, {"tag": "p", "text": "The crew fly off and reach a cantina. Han and Chewie leave Zahara and Trig to go get the Millennium Falcon back. The story ends with Zahara and Trig meeting the wife of the guard who died on the barge. She hands the note to the wife which she picked off the dead body. The wife begins to cry and asks them if they want to come in for tea. They do and Trig states that he wouldn't mind settling down there. Zahara and Trig settle on the planet."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In September 2009, the tie-in Death Troopers: Recovered Messages from Purge was released over various Star Wars fan sites. In October 2009, Star Wars Galaxies released an update in which players could interact with the Death Troopers story:"}, {"tag": "p", "text": "In 2012, Gentle Giant released a Death Troopers mini-bust and a 1/6 scale statue."}, {"tag": "p", "text": "In 2014, Death Troopers were added to the game Star Wars: Commander."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}