{"url": "Death_Watch", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Death Watch"], "nodes": [{"tag": "h1", "text": "Death Watch"}, {"tag": "p", "text": "The Death Watch was a Mandalorian terrorist splinter group of warriors that opposed the pacifist government of Mandalore, led by Duchess Satine Kryze, during the Clone Wars. After failed attempts at taking over Mandalore, they became part of Maul's Shadow Collective, which successfully took control of the planet during the war. However, a struggle in maintaining power formed between the two former allies, Mand'alor Pre Vizsla and Shadow Collective's leader, Maul, ultimately resulting in Vizsla's demise, Maul's rise to power, and the separation of Death Watch into the Mandalore resistance, which was led by Bo-Katan Kryze, and Maul's Mandalorian super commandos."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "Following the end of the Mandalorian Civil War, the remaining Mandalorian martial traditionalists, who believed in the old warrior ways of Mandalore, were exiled to the moon of Concordia, where most of them were thought by the pacifistic New Mandalorians to have died out. However, the survivors eventually regrouped and began calling themselves the Death Watch. Whereas the Old Mandalorians did not seek vengeance on the New Mandalorians, the Death Watch intended to overthrow the pacifist government and restore the traditional warrior ways of their people. They were then led in secret by Concordia's governor, Pre Vizsla of Clan Vizsla, who wielded the Darksaber, and Duchess Satine Kryze's sister, Bo-Katan Kryze."}, {"tag": "h4", "text": "Spreading terror"}, {"tag": "p", "text": "During the Clone Wars, Pre Vizsla and the Death Watch allied with Sith Lord and Separatist leader Count Dooku in order to stage a coup against Duchess Satine Kryze and her New Mandalorian government. As Dooku helped Death Watch grow into a force that could threaten Kryze's government, Vizsla, as governor of Concordia, pretended to support her by supposedly rooting out Death Watch. During this time, one of their saboteurs attacked a Galactic Republic cruiser before taking his own life. Rumors then began spreading around the galaxy, which eventually reached the Republic Senate, claiming that Kryze was building an army to fight for the Separatist cause."}, {"tag": "p", "text": "When the Jedi Council sent Jedi Master Obi-Wan Kenobi to ascertain the truth, Vizsla contacted Dooku about the Jedi. Dooku assured him that if the Republic occupied Mandalore, the people would rebel and rally to Death Watch. Death Watch then sent a terrorist bomber to Sundari's Memorial Shrine to bomb it. The explosion took place right in front of Kenobi and Duchess Kryze. When Kenobi requested that the people nearby were questioned, the bomber ran away, and Kenobi pursued him. However, before Kenobi could capture and question him, the bomber jumped to his death to avoid capture."}, {"tag": "p", "text": "Kenobi and Kryze traveled to Concordia to deliver the bomber's body to his home. On Concordia, the pair met with Governor Vizsla. Whilst Kryze had dinner with Vizsla, Kenobi secretly went to investigate the Concordian mines to see if they were active. When he investigated the inside of one, Kenobi found some Mandalorian helmets. He was then ambushed and captured by two Death Watch soldiers. The two attempted to kill Kenobi by running him through a mineral crushing line but Kryze arrived, distracted them, and then freed Kenobi. The duo dispatched the two soldiers and then attempted to flee the mine, but were confronted by Vizsla, who revealed himself to be Death Watch's leader, and his men. Kenobi fought with Vizsla, and he and Kryze were eventually able to escape."}, {"tag": "h4", "text": "Attack on the Coronet"}, {"tag": "p", "text": "Another Death Watch member, Kalevala Senator Tal Merrik, secretly brought a crate full of assassin probes aboard the Coronet to kill Kryze en route to Coruscant. However, Kenobi, Anakin Skywalker, and their clone troopers discovered Merrik's duplicity. Merrik then took Kryze hostage and contacted Vizsla for reinforcements. Multiple Droch-class boarding ships arrived and deployed B2-series super battle droids onto the Coronet. The droids were thwarted by Skywalker and his troopers. Merrik rigged the Coronets engines to blow and then attempted to board one of the boarding ships with Kryze. However, Kenobi halted Merrik before he could get on board and Skywalker snuck behind Merrik and killed him with his lightsaber."}, {"tag": "h4", "text": "Preparing for War"}, {"tag": "p", "text": "Death Watch then orchestrated a bombing on Kalevala that killed Deputy Minister Jerec. Dooku and his master, Darth Sidious, then altered a recording of Jerec and delivered it to the Republic Senate in order to force them to occupy Mandalore. During this time, Vizsla prepared his men to fight. He also sent an assassin to kill Kryze. The assassin caught her talking with Davu Golec and positioned his sniper to shoot her. However, he hit Golec instead, and Kryze fled. The assassin chased Kryze but she got away. Kryze then contacted Kenobi and they met up in secret. The assassin caught them together and followed them to an alleyway. The assassin threw a thermal detonator at them and Kenobi pushed Kryze away from it. Kenobi then fought the assassin until the Mandalorian was forced to retreat. Kryze gave Kenobi the real message from Jerec and Kenobi took it to the Senate. The real message thwarted any chance of a Republic takeover on Mandalore and Dooku ordered Death Watch to stand down."}, {"tag": "h3", "text": "Exiled to Carlac"}, {"tag": "p", "text": "Death Watch eventually broke its ties with the Separatists following a fight between Vizsla and Dooku in which Dooku scarred Vizsla with his lightsaber. They set up a new camp on Carlac. There, they forced the women of a nearby Ming Po village to work for them. During this time, the Death Watch collaborated with former Separatist Senator Lux Bonteri, who also sought revenge against Dooku for orchestrating his mother's death. Using Bonteri's holotrace device, the Death Watch received information on Dooku's location. Bo-Katan Kryze met Bonteri at his ship. Bonteri had brought the Jedi Padawan Ahsoka Tano with him, pretending that she was his betrothed. Bo-Katan and the others took them back to the camp where Vizsla met with Bonteri who gave him Dooku's location. Meanwhile, the other Mandalorians put Bonteri's subordinates to work, making Tano's droid R2-D2 repair droids for target practice and putting Tano herself with the village girls as a servant."}, {"tag": "p", "text": "However, Vizsla was then confronted by the Ming Po elders, who demanded that the Death Watch return their women. At first, Vizsla and his men complied, but when they came to the village, Vizsla double-crossed the Ming Po, murdering the chieftain's granddaughter right in front of him. He and his men then began burning down their village. Tano defended the villagers and attacked the Mandalorian warriors, revealing herself to be a Jedi. Vizsla and his men captured Tano and took her back to his camp. When Vizsla tried to execute Tano, however, R2-D2 came and launched her lightsabers to her. Tano then broke free and killed four of Vizsla's men on the spot. Vizsla fought against Tano but the droids R2 repaired begin a revolt on them. As the Death Watch were distracted by the droids, Tano, Bonteri and R2 escaped the camp, though they were pursued by Bo-Katan and her men. However, they failed to catch the escapees, and Tano, Bonteri, and R2 returned to their ship and fled Carlac, after which Bonteri left Tano and R2 to pursue his own path."}, {"tag": "h3", "text": "Plot to take over Mandalore"}, {"tag": "h4", "text": "Joining Maul"}, {"tag": "p", "text": "Death Watch eventually stumbled on an escape pod floating in space with two Dathomirian Zabrak Nightbrothers, renegade Sith Lord Darth Maul and his brother and apprentice, Savage Opress. They took the Sith warriors to their base on Zanbar where Vizsla was keen to hear their story. The two Zabraks awoke on medical tables to meet Vizsla. Maul explained to Vizsla his belief that they were the true Sith Lords, and informed him that they didn't follow Dooku. Maul also told him that their ship had been shot down by Kenobi himself. That night, Vizsla and Maul discussed their aims, and their shared goals of taking revenge on Dooku, his master, and Kenobi led them to form an alliance. Maul agreed to help Vizsla and the Death Watch take over Mandalore, which Maul saw as an opportunity to use as a base of power with which to expand his own empire and take revenge. Bo-Katan expressed her distrust of the Sith due to their past experiences with the Sith and the Jedi, who she saw as no different, but Maul choked her by means of the Force to silence her. Vizsla finally asked of their names and the two introduced themselves as Maul and Savage."}, {"tag": "h4", "text": "Gathering forces"}, {"tag": "p", "text": "Maul observed Death Watch soldiers fighting and stated that despite their skill, Vizsla needed an army to take Mandalore. Maul suggested coercing crime syndicates into an underworld alliance in order to take over Mandalore. Vizsla, Maul, Opress, and the Death Watch first traveled to Mustafar, headquarters of the Black Sun, where they met Ziton Moj. Moj took them to the Black Sun ruling council. However, upon demanding their allegiance, the council rebuked them. Vizsla and Opress quickly halted attacking Black Sun gangsters and Opress threw one onto the table of where the council sat. Steadfast in their refusal to yield, the council rose from their seats and their leader, Xomit Grunseit, warned that they were the Black Sun. Opress then hurled his lightsaber across the table, beheading all the crime lords in a matter of seconds. This left Moj in charge of the Black Sun and he swiftly accepted Maul's proposal. The Black Sun then began supplying the Death Watch with their resources, beginning the Shadow Collective."}, {"tag": "p", "text": "Back on Zanbar, Vizsla believed that their army was ready but Maul disagreed. They were then visited by Lom Pyke of the Pyke Syndicate, who agreed to join the criminal alliance after word spread in the underworld of the attack on the Black Sun. To complete their army, Maul and Vizsla sought out the Hutt Clan. The Shadow Collective traveled to Nal Hutta where they met with the Grand Hutt Council. Just like the Black Sun ruling council, the Hutts refused Maul's offer and when he threatened their lives, they had a number of bounty hunters attack them. Maul, Opress, and Vizsla fought off the bounty hunters, during which time the Hutts escaped save for Oruba. Maul and Opress interrogated Oruba into revealing where the Hutts had fled. Oruba gave in and informed them that the Hutts were going to Tatooine. Vizsla deduced that the Hutts would regroup at the palace of Jabba the Hutt. Opress, under orders of Maul, executed Oruba for his insolence."}, {"tag": "p", "text": "The Shadow Collective attacked Jabba's palace soon after but were met with staunch resistance. The Death Watch soldiers were quickly able to cause chaos as they landed and dropped over a dozen armed guards. They soon surrounded Jabba the Hutt, who agreed to join the Shadow Collective. With an army of criminals at their disposal, Maul revealed to Vizsla that he intended to control the criminal underworld after taking over Mandalore. Maul then ordered Vizsla to send scouts to the capital in advance in order to devise targets in Sundari for their plan. Bo-Katan became worried that Maul would take over the Death Watch but Vizsla assured her that he planned on killing Maul and Opress alongside Satine Kryze."}, {"tag": "h4", "text": "Taking Mandalore"}, {"tag": "p", "text": "Vizsla's scouts supplied Maul with targets for the Shadow Collective in Sundari. Maul then revealed his plan: as the united criminal army caused chaos around Mandalore and undermined Duchess Satine Kryze and her pacifist government's ability to protect the Mandalorian people, Death Watch could swoop in and capture the gangsters, making them heroes in the eyes of the Mandalorian people. The Shadow Collective traveled swiftly to Mandalore where Maul and Opress led attacks on the Mandalorian police. As instructed, Vizsla, Bo-Katan, and another soldier led rescue parties for the Mandalorian people. Kryze lost control over her people as they all turned to Vizsla, who proclaimed that Mandalore needed action, not pacifism, to repel the criminal army which he had secretly unleashed. Kryze was then captured and Vizsla declared himself Mand'alor, taking over Mandalore."}, {"tag": "p", "text": "Vizsla then double crossed Maul and Opress and imprisoned them, although they quickly thereafter freed themselves using the Force. Maul then arrived at the palace and challenged Vizsla to single combat for leadership of Death Watch and rule over Mandalore; the two fought in the throne room, and Maul eventually beat Vizsla before the throne. Maul then seized the Darksaber and used it to behead Vizsla in front of the witnessing Death Watch members. However, Bo-Katan Kryze and her Nite Owls refused to accept Maul as their ruler, decrying him as an outsider and the other Death Watch members as traitors. The Mandalorians fought against each other, and Bo-Katan and her Nite Owls fled the palace. Death Watch was then split between those loyal to Maul and his puppet ruler, Prime Minister Almec, who became the Mandalorian super commandos, painting their armor red to resemble Maul's appearance, and the Mandalore resistance led by Bo-Katan Kryze."}, {"tag": "h3", "text": "Under Maul's leadership"}, {"tag": "h4", "text": "Resistance against Maul"}, {"tag": "p", "text": "Bo-Katan Kryze returned to rescue her sister, Satine Kryze, with the help of Korkie Kryze and his classmates Lagos, Soniee, and Amis. However, they were soon pursued by super commandos after one spotted them and although Kryze managed to get a message across to the Jedi Council, she was recaptured. Subsequently, Kenobi returned to Mandalore to rescue Kryze. Upon arrival, Kenobi took out a commando and took his armor before infiltrating the prison where Kryze was held. After freeing Kryze, however, Kenobi's plan was discovered by the guards who pursued him and Kryze. Kenobi and Kryze managed to make it back to the former's ship, but Maul and Opress soon arrived and two of the commandos shot down the ship before it could get away."}, {"tag": "p", "text": "Kenobi and Kryze were captured and Maul took Kenobi to his throne room. There, Maul murdered Kryze before Kenobi and she died in his arms. Kenobi was then taken back to the prison by several commandos but as they got to the entrance, Bo-Katan Kryze and her men attacked the commandos and liberated Kenobi. Bo-Katan took Kenobi to a landing pad where one of her Kom'rk-class fighter/transports was located as a battle of the new civil war ensued. As the fighting continued, Bo-Katan requested to Kenobi that he petition the Republic to invade Mandalore, which she believed would allow them to overthrow Maul and free Mandalore from his rule. Kenobi then escaped the battle on Bo-Katan's starfighter and fled Mandalore."}, {"tag": "p", "text": "Meanwhile, Maul's former master and Dooku's master Darth Sidious arrived at Sundari to deal with him. Two commandos approached Sidious only to be Force choked to death. Sidious arrived at Maul's throne room and confronted him and Opress. Maul attempted to feign loyalty to Sidious but Sidious saw through his deception and threw him and Opress against the palace windows, declaring Maul a rival. A lightsaber duel subsequently broke out between Sidious against the rival Sith brothers. Although Maul and Opress put up a fight, Sidious defeated the pair, killing Opress and capturing Maul, whom Sidious tortured into submission using Force lightning."}, {"tag": "h4", "text": "Freeing Maul"}, {"tag": "p", "text": "Sidious imprisoned Maul in the Spire on Stygeon Prime where he intended to use Maul to locate his mother, the powerful Nightsister Mother Talzin, who had previously restored Maul's strength and sanity after Opress recovered him. Sidious visited Maul and spoke with him before leaving Dooku to interrogate him about his criminal connections and Shadow Collective bases. However, Prime Minister Almec devised a plan to break Maul out in return for Maul freeing him when the Death Watch took over Mandalore. Two Mandalorian super commandos, Gar Saxon and Rook Kast, broke into the Spire and disabled droid reinforcements going towards Maul's cell. They then freed Maul from his cell and took him to the side of the Spire where they blew a hole in the wall. Kast shot a cable making a zipline for Maul to use and they fled out of the Spire just as their Kom'rk-class fighter arrived. Maul and the other two boarded the ship where they were taken the Shadow Collective base on Zanbar."}, {"tag": "h4", "text": "Clash at Zanbar"}, {"tag": "p", "text": "Maul thanked Almec when he arrived at Zanbar and rallied his troops for war. Separatist forces then arrived at Zanbar after tracking Maul's ship there as part of their campaign against the Shadow Collective. Maul ordered the defenses to release the might of the Shadow Collective. Despite the ineffectiveness of the turrets, the Death Watch put up a sturdy fight. General Grievous came down with his MagnaGuards and fought Maul and his men. Whilst Maul dropped the MagnaGuards, Grievous was challenged by a Mandalorian who he slew without hesitation. Maul then sparred with Grievous until the fight became hopeless for him and he withdrew his remaining forces. Both sides took heavy losses with Grievous's droids being all but exhausted."}, {"tag": "h4", "text": "Battle over Ord Mantell"}, {"tag": "p", "text": "Maul rallied the Shadow Collective and took them to Ord Mantell. Separatist spies however informed Grievous of their presence there and he took his fleet to attack the enemy. Maul prepared his forces for the attack and Mother Talzin sent numerous Nightbrothers to assist them. When Grievous's forces arrived, they began to bombard the surface with laser fire. Maul set his armies loose and Saxon rallied the Death Watch soldiers. Grievous landed his droid army and they clash with Maul's soon after landing. At the same time, Dooku landed with two MagnaGuards intending to find Mother Talzin inside the city. The starships of the Shadow Collective began their attack on Grievous's fleet, taking them by surprise shortly after their guns recharged."}, {"tag": "p", "text": "As the battle became more hopeless on the ground, Ziton Moj and the Pyke Fife began to question Maul's plan. Saxon told them it was their job to ensure it worked and Fife was attacked by a melee droid. Up in the air, Maul had his Kom'rk-class fighter land his troops onto Grievous's flagship. There, they went and stormed the bridge and Maul attacked Grievous. Meanwhile on the ground, Saxon, Moj, Fife and the other remaining Shadow Collective soldiers were rounded up by the droids. However the droids powered down as the command cell on Grievous's ship had been deactivated by Maul and his men. Saxon and the other immediately began tearing the motionless droids apart. They then captured Dooku, who had all but wiped out the Nightbrother reinforcements. With Maul capturing Grievous on his ship, the Shadow Collective had ensured a well earned victory."}, {"tag": "h4", "text": "Attack from the Republic"}, {"tag": "p", "text": "Maul took his two prisoners to Vizsla Keep 09 where he attempted to turn Dooku onto his side. However the Republic was now keen to intervene in Maul's feud with the Separatists and Kenobi led an assault on Vizsla Keep 09. Grievous then escaped his cell and began dropping more Death Watch warriors. Kenobi's forces landed on the base and Kenobi and Jedi Master Tiplee pressed forward. However, Maul convinced Dooku to side with him against the Jedi, and as Jedi Masters Mace Windu and Aayla Secura arrived, they attacked them together. Dooku quickly killed Tiplee while Saxon and Kast injured the other Jedi with their rockets. Maul and Dooku then made a quick escape and the Death Watch warriors left behind were taken prisoner."}, {"tag": "h4", "text": "Fall of the Shadow Collective"}, {"tag": "p", "text": "Moj and Fife began questioning the survival of the Shadow Collective after the loss of three of their strongholds. Maul told them they would be paid well once they killed Maul's master Sidious. Maul traveled to Dathomir with Dooku and his remaining warriors. There, Maul met with Mother Talzin where she began draining Dooku for his power. However, they were interrupted by Grievous and Sidious, who had once again tracked Maul and his men. At the same time, the Black Sun and the Pykes were under attack in their sectors. Moj and Fife immediately contacted Kast and the Death Watch, but she was unable to send any reinforcements to them as they were under attack. Consequently, the Pyke Syndicate and Black Sun abandoned the Shadow Collective."}, {"tag": "p", "text": "Back on Dathomir, Talzin took control of Dooku and made him spar with Sidious whilst Maul took on Grievous. Sidious, however, defeated Dooku and forced Talzin to reveal herself. Maul Force pushed Grievous out of the area and helped Talzin as she fought off Sidious and Dooku, who was now in control of himself. Grievous returned and Talzin told Maul to flee as his men came to rescue him. Grievous then killed Talzin in front of Maul and Saxon and Kast were forced to pull him onto their ship. Soon after, Separatist forces landed on Dathomir and slaughtered Maul's people."}, {"tag": "h3", "text": "Rescuing a child"}, {"tag": "p", "text": "At some point in 19 BBY, the settlement of Aq Vetina came under fire from Separatist forces, who were slaughtering the village's residents. Death Watch eventually arrived at the scene and fended off the super battle droids. As a B2 super battle droid prepared to kill a young Din Djarin, he was rescued by one of Death Watch's warriors. Djarin took his hand and the warrior flew away with Djarin as the fighting continued. Djarin was raised as a foundling in the Fighting Corps and sworn to the Mandalorian creed once he came of age, becoming part of the Children of the Watch and eventually joining the Tribe."}, {"tag": "h3", "text": "Siege of Mandalore"}, {"tag": "p", "text": "Eventually, the Pyke Syndicate and Black Sun rejoined the Shadow Collective, and, by the time of the escape from Oba Diah, Crimson Dawn had also joined the syndicate. Maul eventually returned to Mandalore, where he retained the support of Prime Minister Almec and his Mandalorian super commandos, among them Gar Saxon and Rook Kast. The Mandalore resistance led by Bo-Katan Kryze had kept the Republic informed on intelligence regarding their movements and actions, including that Almec maintained ties with the criminal underworld."}, {"tag": "p", "text": "During the final days of the Clone Wars, Bo-Katan Kryze followed Ahsoka Tano to Coruscant after she, Ursa Wren, and the Nite Owls tracked Tano on the Pyke stronghold of Oba Diah, and Tano agreed to help Kryze free her people and Mandalore. Kryze and Tano eventually made contact with Jedi Generals Kenobi and Skywalker, and with Kenobi's approval, Skywalker split the 501st Legion, promoting Clone Captain Rex to Commander and giving him command over the newly created 332nd Division of clone troopers while Ahsoka Tano, who had since left the Grand Army of the Republic after leaving the Jedi Order, was officially signed on as an advisor. The Galactic Republic and Mandalore resistance then launched a joint operation, the Siege of Mandalore, as the Republic and the Jedi sought to capture Maul, a Sith Lord and crime lord."}, {"tag": "p", "text": "During the siege, Tano faced Maul in a lightsaber duel and managed to capture him. Additionally, the Republic clone troopers and Bo-Katan Kryze's Mandalore resistance eventually defeated Maul's Mandalorian super commandos, arresting the survivors, among them Gar Saxon and Rook Kast. Following the siege, Tano and Rex left Mandalore with a captured Maul and a portion of the Republic forces while the rest of the Republic forces remained behind as part of an occupation of Mandalore. Bo-Katan Kryze was made Regent of Mandalore by the Jedi. The Republic's successor state, the Galactic Empire, subsequently inherited the occupation of Mandalore."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During the Imperial Era, some Mandalorian warrior groups like the Protectors considered the Death Watch to be traitors for their actions during the Clone Wars and viewed House Vizsla and its clans as enemies."}, {"tag": "p", "text": "When Bo-Katan Kryze refused to follow Emperor Palpatine and cooperate with the Empire's occupation, she was betrayed by Clan Saxon. Gar Saxon was made the Imperial Viceroy and Governor of Mandalore by the Emperor as an Emperor's Hand, and his rule was enforced by the Imperial Super Commandos, Mandalorian warriors who followed Saxon and the Empire. However, Saxon was opposed by the Mandalorian warrior Sabine Wren, a member of the galaxy-wide early rebellion against the Galactic Empire. Wren obtained the Darksaber during an encounter with Maul on Dathomir and was trained in lightsaber combat by surviving Jedi Kanan Jarrus and Ezra Bridger. When Sabine Wren returned to her family on Krownest with the Darksaber, her mother Countess Ursa Wren informed Gar Saxon of her return along with fellow rebels Jarrus and Bridger, though Ursa requested that Saxon spare her daughter. Saxon subsequently arrived with his Imperial Super Commandos, but he declared Clan Wren traitors and ordered their immediate termination for harboring rebels. However, he was defeated in single combat by Sabine Wren and subsequently killed by Ursa Wren initiating a civil war between Clan Wren and Clan Saxon."}, {"tag": "p", "text": "Gar Saxon's brother Tiber Saxon became the new leader of Clan Saxon and Imperial Governor of Mandalore following Gar Saxon's death. On Mandalore, Clan Wren was joined by Bo-Katan Kryze and the rest of Clan Kryze and the Nite Owls, and together, they defeated Clan Saxon and the occupying Imperial forces reinforcing them, killing Tiber Saxon and destroying the Arc Pulse Generator. They subsequently rallied a number of the Mandalorian warrior clans and united under Bo-Katan Kryze's rule as Mand'alor. Sabine Wren gave Kryze the Darksaber, which she accepted, and the Mandalorian resistance was established."}, {"tag": "p", "text": "During the Galactic Civil War, survivors of the Death Watch could be found on the distant and seedy world of Ankhural, where Umbaran spies would barter their services to them."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Death Watch was a militia whose members believed in returning Mandalore to its former warrior culture. Its soldiers were heavily loyal to the cause and some were willing to follow their leader to the end even when it was an outsider like Maul. Although the Death Watch warriors were skilled, there weren't enough of them to take Mandalore on their own. Pre Vizsla tried to solve this by allying the Death Watch with Dooku and the Separatists but it ended with Dooku abandoning them. When the Zabrak Maul began influencing the Death Watch, he had them ally with crime syndicates instead to bolster numbers. Vizsla wasn't happy with the idea, and when he found out that Maul was trying to build a criminal empire out of it he became furious and keen to get rid of Maul as soon as possible. Once they took Mandalore, the Death Watch became its military force, and Maul reinstated Prime Minister Almec to govern the planet."}, {"tag": "h2", "text": "Operations"}, {"tag": "p", "text": "The Death Watch's original main aim was to take over and govern Mandalore. To do this they allied with Dooku and the Separatists. Their tactics when allied with Dooku was to spread terror in hopes of drawing the attention of the Republic so they could take action. This would give the Separatists the excuse to help Death Watch take Mandalore. Vizsla had an attack made on a Republic cruiser and a bombing on Sundari's Memorial Shrine. Further he organized at least two attempts to kill Duchess Satine Kryze, both of which failed. When the Republic went back on any possible action for Mandalore, Dooku's plan to take it with Vizsla crumbled and the Death Watch was exiled to Carlac."}, {"tag": "p", "text": "When under the influence of Maul, the Death Watch was continued its crusade in taking Mandalore but instead grew their numbers by allying themselves with the underworld. Maul's idea from it was to make himself a powerful person in the criminal underworld. Vizsla devised a plan to take Mandalore by gaining the support of the people. This was achievable by faking attacks from the syndicates to weaken the control of the existing Mandalorian government. Death Watch gained the people's support from this by putting a stop to the false attacks. The alliance of syndicates did its part and the Death Watch took Mandalore without much resistance. Once they ruled Mandalore, Death Watch's only aim was to stay in power and keep the peace on there now that it was theirs."}, {"tag": "h2", "text": "Specialized units"}, {"tag": "h3", "text": "Warrior variants"}, {"tag": "h3", "text": "Death Watch units"}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Death Watch had their own version of Mandalorian armor made from the Beskar which was mined from the mines of Concordia. Their rank insignia was located on the left shoulder armor plate. Most of Death Watch's forces carried GALAAR-15 blaster carbines and WESTAR-35 blaster pistols."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}