{"url": "Death_Watch_bunker", "categories": ["Category:Legends articles", "Category:Endor locations", "Category:Mandalorian military bases"], "nodes": [{"tag": "h1", "text": "Death Watch bunker"}, {"tag": "p", "text": "The Death Watch Bunker was the primary location of the Mandalorian Death Watch during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Death Watch established a bunker on the forest moon of Endor where it would be virtually invisible to the rest of the galaxy. Death Watch Wraiths, Ghosts, and Bloodguards continued operating in secrecy, contracting with Black Sun as assassins in exchange for the crime syndicate helping them further their goals."}, {"tag": "p", "text": "By 1 ABY, the Death Watch had fallen into obscurity, known mostly as an ancient Mandalorian splinter group whose armor had inspired the uniforms of the Emperor's Royal Guard. However, while working for Jabba the Hutt on Tatooine, famed bounty hunter Boba Fett discovered that the group were not merely the stuff of myth and rumor but were in fact operating out of a hidden location. Still under contract to remain with Jabba, Fett hired a group of spacers to investigate for him."}, {"tag": "p", "text": "At the same time, the Death Watch's leader, an unidentified Death Watch Overlord, came to the attention of Imperial Commander D'krn, stationed in Tatooine's capital city of Bestine. Wishing to use the Overlord as the prime clone for a new and improved batch of stormtroopers, D'krn also hired a group of spacers loyal to the Galactic Empire to discover the Mandalorian's whereabouts. These spacers killed the Overlord and his guards and took a sample of his blood to return to D'krn."}, {"tag": "h2", "text": "Contingent"}, {"tag": "p", "text": "Defenses were top priority within the bunker. To eliminate anything that could reveal their secrecy, the Death Watch formed a coalition with Black Sun for added protection. The organic guards were also supplemented by modified B1, B2, and Blastromech battle droids patrolling the corridors. Deep below the bunker, the mines were run by Foreman Japer Witter, who oversaw several miners, scientists, and technicians. Also roaming the mines were several wild mine rats that would attack intruders on sight."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The bunker was divided into three main areas: Section A, Section B, and the alum mines. Access to each of these areas were strictly controlled and the only passkeys were carried by the Overlord's three lieutenants: a Ghost, a Wraith, and Fenri Dalso respectively. Security terminals in each section were equipped with alarm devices that would activate, alerting the Death Watch and Black Sun guards, should any unauthorized access be attempted. Also located in the mines were several workshops, making the bunker one of the only places in the galaxy that had proper equipment to produce the famed Mandalorian armor. In exchange for their protective services, the Black Sun organization used the Mandalorians' superior armor-smithing techniques to develop the Crusader Mark III armor inside the installation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Death Watch Bunker was a location in the 2003 video game Star Wars Galaxies, a massively multiplayer online-role playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Death Watch Bunker was added to the game with an update released on May 25, 2004. In the game, players must descend through the dangerous depths of the bunker to craft their own suit of Mandalorian armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}