{"url": "Death_mark/Legends", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Society and culture"], "nodes": [{"tag": "h1", "text": "Death mark"}, {"tag": "p", "text": "A death mark was a bounty on someone who was wanted dead, usually in a form of physical object given to someone trying to collect the bounty."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Han Solo had a death mark on his head from Jabba the Hutt following his jettison of valuable spice shortly before the Battle of Yavin, although it was lessened to a regular bounty regarding an alive status by the time of the Battle of Hoth. This was not his first death mark, however; his first came from Teroenza after he escaped Ylesia with Bria Tharen."}, {"tag": "p", "text": "\"Doctor\" Evazan was notorious for boasting of the number of systems in which he bore a death mark—a number that seemed to increase every time he mentioned it."}, {"tag": "p", "text": "The Shistavanen Riv Shiel had a death mark placed on him by the Galactic Empire when he slew the stormtroopers sent to apprehend him under the assumption he was Lak Sivrak."}, {"tag": "p", "text": "The mercenary Gallandro had a death mark on over a hundred planets, thanks to his lightning-fast reflexes and quick draw with a blaster."}, {"tag": "p", "text": "Corran Horn earned a death mark on Drall for murdering six smugglers during his days with CorSec, but this turned out to be a ruse planned by Corran and Gil Bastra to throw off the suspicions of Imperial Liaison officer Kirtan Loor to any plans Bastra and Horn were making to defect from the Empire."}, {"tag": "p", "text": "The Empire was known to put death marks on the heads of any pilot who joined the ranks of Rogue Squadron. Bounty hunters Zuckuss and 4-LOM received death marks for their involvement in capturing Imperial Governor Nardix. The postings were overlooked, however, when the pair were contracted to hunt Han Solo."}, {"tag": "p", "text": "Crix Madine was given a death mark by the Empire after his defection."}, {"tag": "p", "text": "Grand Admiral Thrawn placed a death mark on Talon Karrde."}, {"tag": "p", "text": "The Nightsister Charal earned a death mark from the other Witches of Dathomir, who wanted to return her to their homeworld so that she might be fed to the rancors."}, {"tag": "p", "text": "Tribeless Sha had a death mark on her from her own clan."}, {"tag": "p", "text": "Tarfang the Ewok had ten death marks for unknown reasons."}, {"tag": "p", "text": "Death marks imposed by the Empire were meant to be a matter of public record and could be accessed by anyone."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}