{"url": "Death_trooper", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Death troopers", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Death trooper"}, {"tag": "p", "text": "Death troopers were an elite variant of the Galactic Empire's stormtroopers specializing in stealth, espionage and lethality. Operating under Imperial Intelligence, they served as protective detail for significant Imperial officers and members of the Tarkin Initiative, as well as special-assignment commandos. They wore black suits of body armor and specialized helmets with vocal scramblers, micro-motion sensors, and heads-up displays with data on enemy and friendly positions on the battlefield. Death troopers were trained in unarmed combat, heavy weapons, demolitions, improvised weaponry, guerrilla warfare, and marksmanship. Experts at covering their tracks, Death troopers left little to no evidence of their missions."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "Death troopers were named by Emperor Palpatine himself to capitalize on rumors about a legendary Imperial Military Department of Advanced Weapons Research project to revive necrotic tissue, which ultimately resulted in the creation of uncontrollable Undead Troopers sometime between 1 and 3 ABY.[source?]"}, {"tag": "p", "text": "Early during the construction of the Death Star above the planet Geonosis, Governor Wilhuff Tarkin was accompanied by a squad of death troopers to Scarif to confront Darth Vader's breach of security. After Tarkin confronted Vader, Vader was ordered by Emperor Palpatine to uncover who was responsible for several sabotage attempts on the Death Star's construction."}, {"tag": "p", "text": "After arriving on Geonosis, Commander Orson Callan Krennic greeted Vader on a landing pad with a number of death troopers. An assassination attempt was made on Krennic and Vader, as an explosion sent a pile of rocks crashing down on the Imperials, crushing several death troopers. Despite the attempt, Vader investigated and eventually learned that a rogue Geonosian hive led by a Geonosian queen were responsible. Vader and a contingent of death troopers then fought in a skirmish in the Korakanni Mound, killing the saboteurs and the queen."}, {"tag": "p", "text": "In 13 BBY, a squad of death troopers accompanied Director Krennic to Lah'mu. There, they demolished the Erso homestead and took Galen Erso to complete his work on the Death Star. One of the troopers killed Erso's wife, Lyra, and the squad attempted to find his daughter, Jyn Erso, with no success."}, {"tag": "h3", "text": "Growing rebellion"}, {"tag": "p", "text": "During the early days of the Rebel Alliance, another squad of death troopers served under the command of the Seventh Fleet's commander, Grand Admiral Thrawn. They assisted Thrawn in capturing former ISB agent Kallus, following the latter's discovery as a Rebel spy, and held him during the Battle of Atollon. In the later part of the battle, the squad accompanied Thrawn to Chopper Base in an attempt to capture senior Alliance officers such as General Jan Dodonna and Captain Hera Syndulla. However, the Rebels were able to escape when a mystical Force being called the Bendu attacked both the Imperial and Rebel forces. On Thrawn's orders, the death troopers concentrated their fire at Bendu, wounding him and sending him crashing to the ground."}, {"tag": "p", "text": "In 1 BBY,[source?] a squad under Commander DT-F16 accompanied a kyber crystal shipment and several technicians aboard Freighter 2716. After departing from Faos Station, DT-F16 and her squad came under attack by Partisans' leader Saw Gerrera and Spectres Ezra Bridger and Sabine Wren. DT-F16, her squad and other troopers were then left behind by the Spectres and were destroyed, along with Captain Slavin's Star Destroyer when the kyber crystal they were escorting exploded."}, {"tag": "p", "text": "A death trooper, DT-L21, was stationed at Jhothal. There, he commanded stormtroopers when they discovered that the Spectres had returned. He, his Viper probe droids and troopers searched the sewers for the Spectres, to no avail. The death troopers then accompanied Grand Admiral Thrawn and Governor Pryce to the Imperial airfield to watch a test flight of the new TIE/d \"Defender\" Multi-Role Starfighter Elite. When Bridger revealed himself, the death troopers were ordered by Thrawn to secure the TIE/D Defender. However, they lost when Wren stole the fighter."}, {"tag": "p", "text": "Several death troopers then assisted Governor Pryce and Rukh in pursuing Syndulla when Jedi Knight Kanan Jarrus rescued her from the Imperial complex. The death troopers were able to catch to Jarrus and Syndulla."}, {"tag": "p", "text": "Two death troopers then accompanied Minister Veris Hydan as the Empire and Mining Guild were excavating Lothal's Jedi Temple. They assisted Hydan in interrogating Wren, striking her in the head. However, Wren was able to knock one out when Captain Garazeb Orrelios rescued her, stealing his blaster in the process."}, {"tag": "p", "text": "Several death troopers were stationed at the Imperial Complex. With Rukh, the death troopers fought the rebels and attempted to stop them from reactivating the shields. They were taken out by Captain Orrelios. The remaining death troopers of Thrawn's guard were with him aboard the Chimaera and were taken out by Bridger before the ship was taken by the Purrgil to an unknown location."}, {"tag": "h3", "text": "War"}, {"tag": "p", "text": "One year later, death troopers would continue to escort Krennic during the Death Star's initial testing stage at Jedha and during his trip to Eadu. Krennic would later deploy his death trooper squad during the Battle of Scarif when they fought Rebel ground forces that had infiltrated the planet. They managed to annihilate the remnants of the Rebel strike team. However, the entire squad was killed by Baze Malbus and Cassian Andor shortly before Krennic's death."}, {"tag": "p", "text": "In the aftermath of the Battle of Yavin, death troopers served aboard Hivebase-1, a secret space station made by the Tarkin Initiative, serving under Commander Yewl. Yewl's death troopers fought Dr. Aphra's crew and their prisoner, Rebel General Hera Syndulla, until they escaped. They were killed when Hivebase-1 was destroyed."}, {"tag": "p", "text": "Several accompanied Lieutenant-Inspector Magna Tolvan on Coruscant. Following the Battle of Hoth in 3 ABY, a squad of Death troopers accompanied Administrator Sly Moore when she traveled to Mustafar to oversee a mission being undertaken by the Sith assassin Ochi of Bestoon. The squad surrounded Ochi with their blasters trained as Moore commanded him to verify his job, to assassinate Darth Vader, had been completed."}, {"tag": "h3", "text": "After the Empire"}, {"tag": "p", "text": "Approximately nine years after the Battle of Yavin, a squad of death troopers served in an Imperial remnant led by Moff Gideon. The troopers opened fire on a cantina on Nevarro, killing \"the Client\" and several stormtroopers while also trapping \"the Mandalorian,\" Greef Karga and Carasynthia Dune inside."}, {"tag": "p", "text": "The standoff was interrupted shortly after, with IG-11 arriving to assist the Mandalorian and his comrades. As the group fought their way out of the cantina, a fierce battle ensued, with two death troopers resorting to hand-to-hand combat after they were disarmed. With the fight raging outdoors, several death troopers circled around to breach the cantina, and attempted to flush Cara Dune out with saturated blaster fire. The remaining death troopers escorted Moff Gideon, as he gave the order to \"burn them out.\""}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During the Cold War between the Resistance and the First Order, Agent Terex of the First Order Security Bureau had possession of a death trooper helmet aboard the Carrion Spike that was displayed next to the helmets of an Imperial Royal Guard, an AT-AT pilot, a coastal defender stormtrooper, and others, along with a custom set of armor."}, {"tag": "p", "text": "The helmet of Trudgen, one of the Knights of Ren, contained a section of a death trooper helmet, indicating that he'd defeated one at some point in time."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "Death troopers were elite stormtroopers in the Galactic Empire's military. Stormtrooper candidates who excelled at their training were reassigned to the advanced death trooper camp on Scarif. Death troopers were required to meet rigid physical and ideological standards, with height and weight standards that exceeded typical trooper averages. The candidates were also subjected to a battery of physical tests and classified surgical enhancements, making them somewhat \"beyond human.\" Additionally, death troopers had to complete rigorous training in exotic environments to be stronger, faster, and more resilient than the norm. Other specialties included unarmed combat, heavy weapons, demolitions, improvised weaponry, guerrilla warfare, and marksmanship. In the field, death troopers operated in small groups, with each trooper specializing in a specific skill set."}, {"tag": "p", "text": "Shortly before the Battle of Scarif, General Sotorus Ramda requested to be returned two platoons of death troopers, as their training camp on Scarif needed more instructors. Ramda preferred veteran death troopers with body augmentations at v1.01 or earlier."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Death troopers were equipped with advanced armor considered an improvement over the standard stormtrooper kit. The helmet featured a number of advanced sensor and targeting systems to give total situational awareness of combat areas, enemies and allies. These various upgrades to the helmet systems included a Neuro-Saav macromotion monitor, multi-frequency targeting and acquisition sensors, and image-intensifying active pulse emitters, the latter of which was stored within the two green \"dots\" at the bottom front of the helmet. The helmets also included voice scramblers which allowed them to speak in death trooper encryption, which made their communications impossible for anyone except another death trooper to understand, along with adding to their intimidating appearance."}, {"tag": "p", "text": "Death trooper armor was covered by a spray polymer called reflec, which warped electromagnetic signals commonly found in sensor arrays. This made death troopers well suited for stealth operations. Underneath their armor, troopers wore an environmentally sealed bodysuit. Death trooper pauldrons on their right shoulder denoted rank, but appeared black and featureless to individuals if not viewed through a stormtrooper visor."}, {"tag": "p", "text": "Death troopers were equipped with a variety of tools and weapons depending on their specialties. On their chest, death troopers strapped on an IM-40 three-slot ammunition and tool pouch. Weapons commonly used included the SE-14r light repeating blaster, E-11D blaster carbine, DLT-19D heavy blaster rifle, DLT-19 heavy blaster rifle, and Smart Rockets. Grenades included the C-25 fragmentation grenade, baradium thermal detonator, a Sonic Imploder, or a thermal imploder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first footage of the death trooper was shown in the Rogue One: A Star Wars Story teaser trailer on April 7, 2016. According to the Us Magazine Collector's Edition - Star Wars Rogue One article Going Rogue, the death troopers were comparable to and inspired by the United States Navy SEALs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}