{"url": "Death_penalty", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing additional sources", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Law"], "nodes": [{"tag": "h1", "text": "Death penalty"}, {"tag": "p", "text": "Death penalty, or execution, was the practice of imposing the punishment of death for people convicted of certain serious crimes. Worlds with the death penalty usually counted treason as a capital offense."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the early Clone Wars, Jedi Master Prosset Dibs was found guilty of treason for attempting to murder fellow Jedi Master Mace Windu during the operation on Hissrich. Dibs, who had come to regard the Jedi as tyrants, expected his punishment to be death, but he was instead sentenced to rehabilitation at Windu's request."}, {"tag": "p", "text": "Later during the war, Jedi Padawan Ahsoka Tano was expelled from the Jedi Order and tried by a Republic court on charges of murder and treason. Tano had been framed in the bombing of the Jedi Temple hangar, and the prosecutor, Admiral Wilhuff Tarkin vowed to ensure Tano's conviction and advocated to apply the death penalty for the former Jedi, much to the latter's shock. Ultimately, the real traitor, Barriss Offee, was exposed before the court could render its decision on Tano. Tano was released from Republic custody, but chose to reject the Jedi Order's offer to rejoin their ranks because, with the exception of Anakin Skywalker, they had not stood by her."}, {"tag": "p", "text": "The Jedi Master Quinlan Vos fell to the dark side of the Force after being sent to assassinate Separatist leader Count Dooku. Faking reform, he returned to the Jedi Order and committed treasonous acts. As the Jedi High Council discussed his proposed punishment, Mace Windu floated the possibility of execution, which would have been an unprecedented step in the history of the Jedi Order. The possibility was seriously considered, but ultimately rejected, largely because of the arguments of Obi-Wan Kenobi. However, after a second betrayal, execution was considered all but certain, but ultimately events conspired to allow Vos to reform."}, {"tag": "p", "text": "In 4 BBY,[source?] the Imperial cadet Zare Leonis was made to attend a tribunal for suspected treason against the Galactic Empire. He pleaded guilty to all counts against him and was sentenced to be executed, but escaped before the penalty could be carried out and conducted a rescue of his sister."}, {"tag": "p", "text": "By the secret mission to Tatooine, Doctor Cornelius Evazan had the death sentence on twelve star systems, and he told this to Luke Skywalker in Chalmun's Spaceport Cantina."}, {"tag": "p", "text": "After Princess Leia Organa was captured by the Galactic Empire while ferrying stolen Death Star plans to Tatooine, Grand Moff Wilhuff Tarkin signed an order for her execution. Darth Vader, however, kept her alive in order to torture her for information regarding the stolen plans and Rebel Alliance base. After she was discovered to have given false information that the Rebel base was on Dantooine, Tarkin called for her immediate execution, but, after the Millennium Falcon arrived on the Death Star, Vader instead chose to permit her escape because he believed she would lead the Empire to the base."}, {"tag": "p", "text": "In 28 ABY, Senator Ransolm Casterfo lent his support to a campaign to reinstate the death penalty on his homeworld of Riosa. At the time, more Centrist star systems were leaning toward it. Ironically, Casterfo ended up facing capital punishment after he was framed for the assassination of Tai-Lin Garr. Casterfo's execution, however, was never carried out and he was eventually rescued by the Resistance."}, {"tag": "p", "text": "Execution was the prescribed punishment for traitors within the ranks of the Stormtrooper Corps of the First Order. This task was carried out by those within the position of executioner trooper. These specialized stormtroopers were rotated via random duty shifts, rather than being a position held by any single group of individuals. As such, any stormtrooper could be assigned this duty, but it was never known who, as assignments were kept anonymous. Finn, a First Order defector once known as FN-2187, dreaded this task and spent his shifts on it fervently hoping the day would end without him having to perform any executions. His own defection later caused him and fellow Resistance operative Rose Tico to end up facing this fate, but the two were saved when the Resistance flagship Raddus crashed into the Supremacy, instantly killing their executioners."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}