{"url": "Deathraven", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Smuggler and fringer starships", "Category:Uglies"], "nodes": [{"tag": "h1", "text": "Deathraven"}, {"tag": "p", "text": "The Deathraven was the personal starship of a mercenary pilot named Erron Kell, who constructed the ship sometime after the formation of the New Republic from two Slayn & Korpil B-wing/E2 starfighters with the help of engineers at Kuat Drive Yards. The thirty-two meter-long vessel combined the two B-wing hulls, which were obtained from Kell's contacts in the New Republic, around an enlarged central cockpit. Due to the addition of two light ion cannons, the Deathraven was more heavily armed than the two B-wing/E2s combined, and it boasted a Class 1.0 hyperdrive, two months of fuel and consumables, and many other improved systems. Kell flew the ship while working as a pilot-for-hire during the reign of the New Republic and the Yuuzhan Vong invasion, although Kell still preferred to transport the Deathraven as cargo during long trips due to the cramped nature of the vessel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A unique design built from two B-wing/E2 starfighters, the Deathraven boasted a larger, central cockpit with the two B-wing hulls rotating around it. Due to its thirty-two meter length, the modified starship was too big to be considered a starfighter, although its cockpit was still uncomfortable for extended travel. However, the Deathraven did possess two months' worth of fuel and consumables in case a long trip was necessary. The starship design had a Class 1.0 hyperdrive, improved sublight and atmospheric engine performance, improved armor plating, and stronger deflector shields, which was due to upgraded shield generators. Instead of requiring a two-person crew like the original B-wing/E2, the Deathraven only required a single pilot and had room for one passenger along with an increased cargo space of 250 kilograms in its enlarged cockpit area."}, {"tag": "p", "text": "In addition to possessing the armaments of the two B-wing/E2 starfighters, the warship was upgraded with two additional light ion cannons to supplement the four original assault laser cannons, six light ion cannons, and four proton torpedo launchers. All of the assault laser cannons were linked to fire together, as were the proton torpedo launchers and light ion cannons. Due to the expanded magazines possessed by the B-wing/E2, the Deathraven could hold up to forty proton torpedoes when fully loaded. Overall, the design was more powerful than most starfighters, while its speed was more than enough to escape from larger vessels."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The design of the Deathravan was conceived by Erron Kell, a former Rebel and New Republic pilot who resigned his commission and became a mercenary due to his dislike of the increased organization of the New Republic military after the Battle of Endor of 4 ABY. Through his New Republic contacts, Kell was able to obtain two B-wing/E2s that the New Republic believed were too expensive to repair. While Slayn & Korpil manufactured the original fighters, Kell constructed the new design with help from engineers working for the shipbuilding company known as Kuat Drive Yards. After all of the modifications and repairs were complete, the Deathraven was worth around 609,000 credits, which was considerably more than the total 500,000 credits that two B-wing/E2s cost."}, {"tag": "p", "text": "After the construction of the vessel was complete, Kell used the Deathraven as his personal starship while working as a mercenary pilot during the reign of the New Republic and the invasion of the galaxy by the extra-galactic Yuuzhan Vong species. During Kell's career, the starship proved to be powerful enough to defeat most small ships, and fast enough to outrun larger ones. In one instance, the Deathraven destroyed a smaller vessel, which exploded near a stellar object. When traveling over long distances, Kell usually shipped the Deathraven as cargo to avoid being stuck in the small ship for long periods."}, {"tag": "h2", "text": "Owners and operators"}, {"tag": "p", "text": "Although the original B-wing/E2 starfighters used in building the Deathraven belonged to the New Republic, Erron Kell was able to obtain them through his contacts with the New Republic government. After the ship's construction, Kell used his excellent piloting skills to fly the ship during his career as a mercenary pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Deathraven was first featured in Wizards of the Coast's 2001 edition of Starships of the Galaxy, which was written by Owen K.C. Stephens. In the book, the Deathraven was pictured as destroying a small target in an image created by John Gallagher. However, while the sourcebook referred to the ship's design as unique, a slightly different image in Wizards of the Coast's online Starships Art Gallery has the Deathraven leading a pair of ships that share its double-hulled design. This article was written with the assumption that the sourcebook is correct."}, {"tag": "p", "text": "Shortly after the release of Starships of the Galaxy, Stephens spoke about the origins of the Deathraven in an interview that was posted on Wizards.com. He explained that the design for the ship was an idea he had possessed since he saw Star Wars: Episode VI Return of the Jedi, and that he used the book as an opportunity to make the ship official. Stephens also stated in the interview that he could not have been more pleased with the artwork provided for the ship."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}