{"url": "125-Z_treadspeeder_bike", "categories": ["Category:Canon articles", "Category:Vehicle stubs", "Category:First Order vehicles", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "125-Z treadspeeder bike"}, {"tag": "p", "text": "The 125-Z treadspeeder bike was a model of speeder bike which saw service during the war between the First Order and the Resistance."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The First Order Treadspeeders were rugged, shielded patrol speeder bikes which had a design that granted greater traction on unstable terrain. Two of these speeders could be carried aboard an AAL-1971/9.1 Troop Transport. It could also avoid countermeasures that jammed traditional speeders. The treadspeeder bike was designed to catapult First Order jet troopers into the air during First Order operations."}, {"tag": "p", "text": "They were piloted by First Order Treadspeeder Drivers, specialized stormtroopers who, in certain instances, were encased in a variant of the First Order stormtrooper armor. Otherwise, the drivers donned the standard stormtrooper armor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One such speeder was used by a sergeant of the First Order's 709th Legion on the planet Batuu to take down two criminals who had pinned down members of the 709th Legion."}, {"tag": "p", "text": "The First Order deployed them during the Blockade of Kashyyyk, but they were all destroyed singlehandedly by the Wookiee Chewbacca, who was freeing the captives."}, {"tag": "p", "text": "Two pairs of Treadspeeder pilots and jet troopers, on two separate First Order Treadspeeders, pursued Resistance agents Rey, Finn, Poe Dameron, Chewbacca, and droids C-3PO and BB-8 during a mission to Pasaana."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "One of the First Order Treadspeeder props (made by Belgian Prop Builders) was shown to the public during Celebration Chicago."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}