{"url": "Dec_Hansen", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Character stubs", "Category:Humans", "Category:J-Squadron personnel", "Category:LGBTQ+ individuals", "Category:Males", "Category:Scavengers"], "nodes": [{"tag": "h1", "text": "Dec Hansen"}, {"tag": "p", "text": "Dec Hansen was a human male scavenger from Ques, a swamp planet in Hutt Space. Hansen was an only child, so his mother built him a \"brother,\" the droid AG-90. Hansen grew up with AG, and the two eventually joined the Resistance against the First Order, serving as cadets in J-Squadron. At the Resistance base on D'Qar, Hansen became reputed as a troublemaker, and in 34 ABY, he and a few other members of J-Squadron were sent on a scavenging mission to Vodran as a punishment. However, Hansen and fellow cadet Sari Nadle became separated from the group after being attacked by Vodran's fauna, and they were forced to flee the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars: Join the Resistance co-author Ben Blacker confirmed on Twitter that his intention was that Dec was gay, making him the first gay character in a Star Wars children's book. This was implied several times throughout the series, but not explicitly stated. In the second book, Join the Resistance: Escape from Vodran, Dec told Harra the Hutt the story of his fears of rejection after realizing it and how he told his brother and parents, but only referred to it as \"the thing that made me different from everyone else,\" never specifying what that thing was. Dec's sexuality was alluded to again in Join the Resistance: Attack on Starkiller Base when his closest friend Sari admitted to Mattis Banz that she had feelings for Dec. Asked by Mattis if she thought Dec liked her back, Sari responded \"I've never known him to like a girl. It's just not how he is.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}