{"url": "Decca_Besadii_Diori", "categories": ["Category:Legends articles", "Category:Females", "Category:Hutts of the Besadii clan"], "nodes": [{"tag": "h1", "text": "Decca Besadii Diori"}, {"tag": "p", "text": "Decca Besadii Diori, also known as Decca the Hutt, was daughter of Gardulla Besadii the Elder and the sister of Gardulla Besadii the Younger."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After her mother`s supposed death in 32 BBY, Decca inherited Gardulla's fortune. Decca started a fleet made up of pirates, mercenaries, bounty hunters and thugs. For a time, Decca's center of operations was on C-Foroon, near Tatooine, until she was chased offworld. She then relocated her thugs, goons, and cronies, together with her operations, principally in the spice trade, to the planet Mawan."}, {"tag": "p", "text": "Shortly before 25 BBY, a civil war erupted on Mawan. Decca took advantage of the chance to take Mawan for the Hutts, but two rival gangs, one led by Feeana Tala and the other by Striker, were already fighting for the food and water supply on the planet. Decca held a personal grudge against Striker, who hit her operation when she first arrived on the planet, managing to seize the capital city's power grid and a large cache of weapons, while Decca was able to hold on to Naatan's main tunnels and transports. Striker, however, continued to strike, to keep all the fuel away from Decca, making her even more angry. The Jedi led by Master Yaddle, Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker disrupted the civil war."}, {"tag": "p", "text": "But things went from bad to worse when the Jedi arrived. Decca was celebrating a victory against Striker's gang at one of her \"revels\" when Obi-Wan, Anakin, and two of Tala's associates, Swanny Mull and Rorq, infiltrated the Hutt's stronghold. In the thick of the party, after Swanny and the Rooters had played their music and Decca had given a speech, Striker's force ambushed the Hutt compound and attacked her gang."}, {"tag": "p", "text": "Soon after, however, Decca allied herself with Striker, who of all the crimelords was considered the most powerful and dangerous, to stop the Jedi. While Decca distracted Obi-Wan and Anakin, Striker, aka Granta Omega, killed Master Yaddle and was able to escape the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}