{"url": "Decimator_(war_machine)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Confederacy of Independent Systems repulsorcraft", "Category:Galactic Republic repulsorcraft"], "nodes": [{"tag": "h1", "text": "Decimator  (war machine)"}, {"tag": "p", "text": "The Decimator was a war machine developed by the Galactic Republic at the start of the Clone Wars. Equipped with shields and a long-range turbolaser that could target air and ground vehicles, the Decimator could engage and defeat craft as large as the All Terrain Tactical Enforcer. They were also able to ferry infantry around the battlefield, protecting them within the confines of the Decimator, though the vehicle itself was slow."}, {"tag": "p", "text": "Developed at a secret testing facility located on Eredenn Prime and constructed at Alaris Prime by Wookiees, the Decimator was considered one of the most powerful combat vehicles of its era. However, before the Republic could use them, the Decimators were stolen by the Confederate General Sev'rance Tann. Tann used them to capture the energy-producing world Sarapin, striking fear into the inhabitants of the Core Worlds due to the ensuing blackouts. Her campaign provoked the Republic to send Jedi Master Echuu Shen-Jon to hunt down Tann and her Decimators. Shen-Jon ultimately succeeded at the Battle of Krant, and the Decimators saw no further action in the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Decimator's body was roughly rectangular in shape, save for a tower that rose from the rear of the vehicle along its midline. Just in front of the tower, in the center of the vehicle, was a large red orb that served a purpose in the firing mechanism. Even when not firing, energy circulated through the orb in green waves. When the weapon was activated, the energy would coalesce, causing the orb to glow a brilliant green, before launching a single, focused green beam toward its target."}, {"tag": "p", "text": "Decimators were described by historians as having \"giant turbolaser cannons\" as their main weapons. Each Decimator was comparable in size, armor, and firepower to the largest Republic vehicles in service at the start of the Clone Wars, such as the All Terrain Tactical Enforcer. It was also described as possessing tremendous destructive power. Besides their firepower, Decimators also possessed the ability to transport up to ten infantry and were sheathed in thick layers of armor, as well as protective deflector shields. However, for all their firepower and armor, Decimators were restricted to operating from land and could not float over water or lava, nor could they directly cross over cliffs or thick forests, despite possessing repulsorlifts for propulsion."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "With its powerful shields, turbolaser, and thick armor, the Decimator was suited to front-line combat. It could easily defeat comparable vehicles in combat, relying on its shields to absorb damage. The Decimator's weapon was limited to firing at just one target at a time and had to charge before it could fire again, which meant that getting off the first shot against comparable vehicles was not assured. The unique weapon of the Decimator could traverse the beam itself electronically though without need to traverse the emitter to hit aircraft as well, though it still had to charge between discharges."}, {"tag": "p", "text": "The slow speed of the Decimator and low firing rate meant that it was better equipped to combat other front-line assault vehicles rather than greater quantities of swifter adversaries. In particular, opponents that could close inside the firing arc of the Decimator's main weapon, such as Jedi or close-range assault troops, were able to avoid its significant firepower. However, the ability to ferry ten additional infantry inside the Decimator meant that it could augment its defense by deploying these soldiers if the vehicle was threatened."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Decimator began as a weapons project by Wookiees for the Grand Army of the Republic. Testing of the weapons system was conducted in the Erediss system while the vehicles were actually manufactured on the Wookiee colony of Alaris Prime. The first non-Republic-affiliated person to discover the Decimator's existence was Bogeega Bu'Daay, an operative who informed the Hutt Cartel of the weapon's existence after infiltrating the Republic Decimator research center on Eredenn Prime. Bu'Daay passed his discovery on to Boorka the Hutt, who understood that the information would be fruitful if he gave it to someone who would be interested, namely the Confederacy of Independent Systems. However, Bu'Daay was discovered by Wookiee personnel on Eredenn before he could divulge further information."}, {"tag": "p", "text": "In 22 BBY, one month after the First Battle of Geonosis, after constructing a sizable mechanized army on the Kaer Orbital Platform for use by the Confederacy, the Chiss General Sev'rance Tann journeyed to Tatooine, the homeworld of Boorka, where the Hutt was willing to sell information about the Decimator project once Tann destroyed a Republic spaceport."}, {"tag": "p", "text": "Having learned from Boorka that the Republic was testing the Decimators on remote Eredenn, Tann raided the planet. She attacked both Shard Test Site and Facet Test Site, capturing their Decimators and several Decimator Facilities intact. However, she lacked the control codes to make them operational. Informed by Separatist leader Count Dooku that the codes were located in a nearby base, Tann pushed on and seized a data droid possessing the codes from the Decimator Laboratory. Despite this victory, she still needed to unlock the fail-safe mechanism programmed into the Decimators in order to use them. From the Decimator Laboratory, Tann also obtained the location of the Decimator manufacturing center on Alaris Prime and headed there next to decipher the codes necessary to use her new weapons."}, {"tag": "p", "text": "Tann landed on Alaris Prime and attacked a Republic Decimator facility surrounded by Wookiee outposts. Bringing the captured data droid to the facility, she unlocked the Decimators by having the droid interface with the main computer, making the vehicles available to the Confederacy. Tann then destroyed the Decimator facilities on Alaris Prime and departed, ready to use the Decimators for the Confederacy."}, {"tag": "p", "text": "Tann used at least two of the vehicles to help her capture the Republic-controlled energy production world Sarapin. Having defeated the Republic defenders, Tann's Decimators also destroyed the geothermal generators. The loss of Sarapin's energy production facilities caused blackouts on numerous Core Worlds. The Separatists then established a new Decimator facility on Krant to continue production of the Decimators under Tann's supervision. To supply the facilities with raw materials, Tann employed a mining operation on the moon of Aereen that was under Trade Federation purview."}, {"tag": "p", "text": "The facility on Aereen was soon attacked and destroyed by Jedi Master Echuu Shen-Jon just as Tann was inspecting a new contingent of Decimators on Krant. Shen-Jon had been tracking Tann and had already reclaimed Sarapin; now he was intent on stopping her from deploying more Decimators. Shen-Jon took his Republic army to Krant and destroyed the Decimator production facilities and the Decimators themselves, at least one of which was operational. Tann was slain by Shen-Jon in a subsequent engagement, ending the use of the Decimators."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Decimator first appeared in the PC computer game Star Wars: Galactic Battlegrounds: Clone Campaigns as the focus for both the Confederacy and Republic campaigns. Its in-game stats are comparable to a heavy assault mech, with the addition of shielding and the ability to target aircraft. The Decimator and the campaign in which Sev'rance Tann employed them against the Republic were also mentioned in The New Essential Chronology, The Complete Star Wars Encyclopedia, and The Essential Atlas. In the latest of these books, the Decimator is mistakenly referred to as the \"Devastator.\" Essential Atlas co-author Daniel Wallace has stated that the use of the term \"Devastator\" was a mistake; the book should have said \"Decimator.\""}, {"tag": "p", "text": "Another point of confusion regarding the Decimator occurs in The New Essential Chronology, where the Decimators are described as \"tanks with giant turbolaser cannons mounted atop.\" In Clone Campaigns, Decimators only seem to have a single weapon, but it is possible that The New Essential Chronology implies they have multiple weapons, as Clone Campaigns has game mechanics that are rarely consistent with the rest of canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}