{"url": "Decoy_Squad_Five", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Grand Army of the Republic squads"], "nodes": [{"tag": "h1", "text": "Decoy Squad Five"}, {"tag": "p", "text": "Decoy Squad Five was an eight-member detachment of clone troopers from the 501st Legion, led by a sergeant. The squad's mission in the wake of Order 66 and Operation: Knightfall, a planned assault against the Jedi all across the galaxy at the conclusion of the Clone Wars, was to eliminate any Jedi who attempted to return to the Jedi Temple on the planet of Coruscant. To that end, it was one of several squads that had been outfitted with Jedi robe disguises. The squad's clones had been bred to possess very quick reflexes and to be constantly alert. The members of Decoy Squad Five were killed by Jedi Masters Obi-Wan Kenobi and Yoda when the two infiltrated the Temple to terminate a false homing signal that had been activated by the Dark Lord of the Sith Darth Vader."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A detachment of the 501st Legion, Decoy Squad Five was one of several clone trooper squads disguised in Jedi robes and was deployed at the downlevel loading dock of the planet of Coruscant's Jedi Temple. The clones, led by a sergeant, guarded the entrance to the Temple after the enacting of Order 66, a measure trained into the clones that ordered them to kill their Jedi commanders in the event that they were considered to have become a threat to the Galactic Republic. After the subsequent Operation: Knightfall—Dark Lord of the Sith Darth Vader's march on the Temple that resulted in the deaths of almost all of the Jedi inside—a beacon was sent to all surviving Jedi informing them that the war was over and that they were to return to the Temple. Decoy Squad Five was posted at the dock to intercept and kill the returning Jedi."}, {"tag": "p", "text": "The eight clones were approached by a hunchbacked man, who drooled constantly and spoke indistinctly, carrying a bundle in his arms. The troopers drew their weapons and commanded him to identify himself, but he assured them that he was on their side, insisting that he had captured a Jedi baby for them to execute. Curious, the Sergeant took a closer look and judged it the ugliest-looking baby he had ever seen, questioning if it was really a Jedi. The \"baby\", actually Jedi Master Yoda in disguise, chose that moment to speak, suggesting that his lightsaber would prove his identity before holding his green blade to the Sergeant's face. The hunchbacked man, Obi-Wan Kenobi, straightened and started speaking with a standard and dignified Coruscanti accent, telling the group that if none resisted then they would not be harmed. The men of Decoy Squad Five would not comply and were cut down by the Jedi Masters within six seconds."}, {"tag": "p", "text": "Yoda and Kenobi decided not to hide the group's bodies because they had no time to spare while infiltrating the Temple, so they continued inside. They figured that if the clones were perceived as leaving their post, it would be just as odd as finding their bodies in the seedy lower levels of Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A production photo included on the Revenge of the Sith DVD shows Temuera Morrison brandishing a blaster while disguised in Jedi robes. In the 2011 Star Wars: The Complete Saga Blu-ray collection, the first extra features disc contains an early animation test with the disguised clones. All but one of the clones were animated. The Kenobi that appeared with them was not animated. Although they were not included in the film, a group of these clones called Decoy Squad Five appeared in the 2005 novelization, which means they are canon with respect to the Star Wars Legends continuity. Clones disguised as Jedi were also mentioned in the fourth issue of the 2005 Episode III comic."}, {"tag": "p", "text": "These clones were also cut from the 2005 video game adaptation. The game includes concept art of the clones meeting Obi-Wan and Yoda in the Temple courtyard before throwing off their robes and opening fire on the Jedi."}, {"tag": "p", "text": "Clones disguised as Jedi first appeared in LEGO Star Wars: The Video Game, released one month before Episode III. \"Disguised Clone\" is an unlockable character. He wears a brown Jedi-style cloak and hood piece instead of his helmet, but wears the typical clone-armor body piece underneath. He functions like a normal clone trooper. This clone also appears in the LEGO Star Wars compilation game, LEGO Star Wars: The Complete Saga (2007)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}