{"url": "Decon_III", "categories": ["Category:Legends articles", "Category:Agricultural droid models", "Category:Industrial Automaton products"], "nodes": [{"tag": "h1", "text": "Decon III"}, {"tag": "p", "text": "The Decon III  was a variant of Industrial Automaton's Decon series, a type of decon droid. The name was short for decontamination droid."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Decon III droid was a squat, boxy unit and stood at 1.3 meters tall. Such droids were use by the Galactic Republic on colonization attempts to supplement the terraforming process of a colonized world with a harmful ecosystem by filtering out deadly alien bacteria. These droids were equipped with visual, infrared and analytical sensors though its vocabulators could only speak binary. Some variants of the Decon III moved on treads while others traveled on four legs; all were equipped with a single retractable manipulator arm."}, {"tag": "p", "text": "The droids were equipped with a heavy front shovel for scooping up dirt—approximately a quarter cubic meter for a \"bite\". The collected soil falls into the intake hopper and then passed through a four-stage series of cleansing chambers equipped with catalytic processors for removing any deadly contagion, thus making the soil safe for planting. This amount was then removed from the Decon III through a rear discharge chute. The speed of the process differs from the level of pollution, though most units can treat about three kilograms of topsoil an hour."}, {"tag": "p", "text": "A variant of the Decon III was stored aboard most long-range starships in case the entire vessel was flooded with radiation. If that happened, these units would deploy chemical spray hoses and fill the cabins, decks and bulkheads with a rad-absorbing foam. The poisonous froth would then be scooped up by the droids and subjected to the same treatment as contaminated soil."}, {"tag": "h2", "text": "Operational history"}, {"tag": "p", "text": "These droids were originally used by the Galactic Republic during its colonization attempts. Decon III Droids were also used by the Galactic Empire, most notably during the so-called \"purification\" of Honoghr and had been ravaged by the Separatist bioweapon Trihexalophine1138 (which had been accidentally released by a wrecked Lucrehulk-class Core Ship during the Battle of Honoghr in the Clone Wars). Earlier, the Noghri of Honoghr had vowed to serve the Empire as assassins until their homeworld had been purified."}, {"tag": "p", "text": "To keep the Noghri in servitude to the Empire, the Imperials seeded Honoghr with a hybrid grass that killed off the remaining plant life. They then gave the suffering Noghri modified Decon III units that cleared the grass at an extremely slow rate. Following the end of the Thrawn Crisis in 9 ABY, the Noghri joined the New Republic which provided them with proper Decon III Droids. However, the ecological damage to Honoghr was so deep that it forced the remaining Noghri to relocate to other worlds including Wayland. Decon III units would also be used by both sides to salvage moribund planets devastated by the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}