{"url": "Dedication_of_the_Starlight_Beacon", "categories": ["Category:Canon articles", "Category:Battle stubs", "Category:Events during the High Republic Era", "Category:Galactic Republic events"], "nodes": [{"tag": "h1", "text": "Dedication of the Starlight Beacon"}, {"tag": "p", "text": "The dedication of the Starlight Beacon was an event that launched the Starlight Beacon, the culmination of Supreme Chancellor Lina Soh's Great Works. Designed to stand as a symbol of the Galactic Republic's promise of peace and hope in the Outer Rim Territories, the space station heralded everything that Soh wanted her administration to stand for. The dedication was almost postponed after the Great Hyperspace Disaster and its subsequent Emergences, a series of hyperspace catastrophes caused by the Nihil marauders that forced the Chancellor to close travel lanes in the Outer Rim. Starlight Beacon was informally opened to the public at this time in order to treat victims of the tragedies with its medical facilities. After an intervention from a joint task force of Republic Defense Coalition and Jedi forces, however, the formal dedication went on as planned in the year 232 BBY."}, {"tag": "p", "text": "The ceremony was attended by delegates from across the galaxy, including many members of the Jedi Order. Speeches were given by the Supreme Chancellor, Queen Consort Thandeka of the nearby planet Eiram, and Jedi Master Avar Kriss, who had been named marshal of the station by Grand Masters Veter and Yoda. The dedication culminated with every Jedi raising their lightsabers to the stars, symbolically representing the light that the Beacon would spread across the Republic. Following the ceremony, newly elevated Jedi Master Elzar Mann was struck with a haunting Force vision that saw the deaths of himself and his Jedi comrades. Alone, Mann's thoughts on that day went from beauty and hope to that of terror and fear."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}