{"url": "Dee%27ja_Peak/Legends", "categories": ["Category:Legends articles", "Category:Cities on Naboo", "Category:Galactic Empire cities"], "nodes": [{"tag": "h1", "text": "Dee'ja Peak"}, {"tag": "p", "text": "Dee'ja Peak was a scenic city nestled within the Gallo Mountains, on top an eponymous peak on Naboo known as the Dee'ja peak."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Dee'ja Peak was a secluded town nestled deep within a mountain valley. The city catered to those who wanted to get away from it all and many residents of Dee'ja Peak chose to live there because of the independent lifestyle. Its inhabitants were highly welcoming as it used to be a long way to reach the city."}, {"tag": "p", "text": "The city was built close to a great waterfall and was famed for its stunning views. The waterfall of Dee'ja Peak was famous and considered as one of the most beautiful in all of the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Dee'ja Peak was one of the first settlements established on the planet Naboo. It was founded by a nomadic tribe of Humans from Grizmallt who came to colonize the planet many centuries before the Clone Wars. The tribe was venturing the Gallo Mountains when they discovered the location of Dee'ja Peak. They settled a small village there and started to develop a farming community."}, {"tag": "p", "text": "During the reign of the Galactic Empire and during the Galactic Civil War, many people seeking for independence moved to Dee'ja Peak because they disagreed with Queen Kylantha's support of the Empire. However, after the Battle of Yavin, the city eventually became an Imperial stronghold. Dee'ja Peak was controlled by the Empire and had many stormtroopers patrolling the streets."}, {"tag": "p", "text": "Around 1 ABY, Vance Groten recruited RSF agents to eliminate groups of Maulers and Naboo pirates, as well as Blot's pack of aggressive feral shaupauts, near Dee'ja Peak."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The following individuals were residents or visitors of the city in the time after the Battle of Yavin: Arven Wendik, Damalia Korde, Kima Nazith, Uwo Poal, Herman Pate, Zanier Hudmasse, Tanoa Vills, Vance Groten, Walker Luskeske and Ruab."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While the spelling of this city was Deeja Peak in the MMORPG Star Wars Galaxies, an alternate spelling of Dee'ja Peak was used in the following Star Wars Galaxies: The Ruins of Dantooine spin-off novel. Star Wars Galaxies has since adapted to the book's spelling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}