{"url": "Deela_Quellor", "categories": ["Category:Legends articles", "Category:Entertainers", "Category:Females", "Category:Individuals of unspecified species", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Deela Quellor"}, {"tag": "p", "text": "Deela Quellor was a female spy who lived during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Circa 1 ABY, Deela Quellor obtained records from a Mos Eisley repository owned by the crime lord Jabba the Hutt. The records was in fact stolen long ago by Jabba from his rival Gardulla Besadii the Elder. After the theft, Jabba sent henchmen to kill Deela and retrieve the data."}, {"tag": "p", "text": "In the meantime, the man known as Rakir Banai was looking for information about the slaves of Tatooine in order to find his long missing son, Kitster. Rakir tasked the spacer to find Deela Quellor and escort her back to him. The spacer finally find Deela and saved her from Jabba's henchmen. The spacer and the woman returned safely to Wayfar with and Gardulla's records. From the records, Rakir Banai understood that his son was alive and living on Tatooine, an information deliberately concealed by his boss Drik Bandrik."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Deela Quellor was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Due to the nature of many older quests in Star Wars Galaxies, the species of Quellor changed each time a player performed this quest. Under her spawn template, she would either appear as a black haired, brown eyed Human female, a yellow eyed female Twi'lek, or a male Twi'lek. Therefore, from an in-universe perspective, Quellor could have either been a Human or a Twi'lek. The quest dialogue given by Rakir Banai also indicated that Quellor was a female."}, {"tag": "p", "text": "Furthermore, although not mentioned in the quest dialogue, examining her revealed her to be an entertainer. However, it should be noted that this was primarily due to game mechanics, as a result of Quellor being placed under the randomized entertainer spawn template appearance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}