{"url": "Deep_Space_Recovery_Vessel_L-2783", "categories": ["Category:Legends articles", "Category:Bulk cruisers", "Category:Corellian Engineering Corporation products"], "nodes": [{"tag": "h1", "text": "Deep Space Recovery Vessel L-2783"}, {"tag": "p", "text": "The Corellian Engineering Corporation Deep Space Recovery Vessel L-2783, more commonly called the L-2783, was a small Bulk cruiser / Bulk transport designed to travel to remote locations to repair or recover damaged starships."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Essentially a large cargo hold with engines attached, the L-2783 was based off of bulk cargo capital ship design, and sported a main cavernous cargo hold capable of containing and carrying ships up to the size of an old-style cruiser. Envisioned as a mobile repair base and scavenger ship, the L-2783's powerful tractor beam could pull in ships or wreckage as needed into its internal hold, with the hold capable of being partitioned off by enormous force fields."}, {"tag": "p", "text": "Aiding the ship was a small fleet of four cargo shuttles and fifty maintenance / scavenger pods held in an aft facing hangar bay. These small two-person spacecraft were equipped with clamps and plasma cutters, allowing the pods to retrieve smaller objects or work in unison to dismantle larger objects. Debris was then deposited into the L-2783's large dorsal cargo holds where it could be dealt with by a large array of onboard repair shops and supply vaults."}, {"tag": "p", "text": "Coming stock with minimal weaponry, the L-2783 had heavy shields that were more than enough to protect it from pirates and aggressive scavengers. Like any CEC design, however, the ship was vastly upgradable and customizable; as a result these ships were known to be retrofitted into small carriers along with with substantial upgrades to weapons and shielding."}, {"tag": "h2", "text": "Roles"}, {"tag": "p", "text": "The L-2783 was deployed in a myriad of fashions due to its large cargo capacity and heavy shielding. Scavengers made use of the L-2783 as full-time salvage craft, making their livings harvesting wrecks and debris. Other L-2783's were converted into capable military carriers by mercenary groups and crime lords, while pirates occasionally used the L-2783 as a pirate vessel - absconding with entire freighters by simply swallowing them up. A few true entrepreneurs and businessmen used the L-2783 as a massive mobile repair base, using the L-2783's vast cargo capacity to service space stations and outposts - while even carrying out in-flight repairs on smaller vessels."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}