{"url": "Deep_Space_Manufacturing_Facility", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Alliance to Restore the Republic space stations", "Category:Deep Space Manufacturing Facilities", "Category:Galactic Empire space stations", "Category:Industrial facilities", "Category:Shipyards", "Category:Space station classes", "Category:Telgorn Corporation products"], "nodes": [{"tag": "h1", "text": "Deep Space Manufacturing Facility"}, {"tag": "p", "text": "The Deep Space Manufacturing Facility, otherwise known as the X7 Factory or X-7 factory station, was a spaceborne manufacturing plant of standardized design produced by both Kost & Ko Factories and the Telgorn Corporation."}, {"tag": "h2", "text": "Use"}, {"tag": "p", "text": "Because of its versatility, the X7 Factory was used for many different manufacturing processes. It was often used in the production of goods requiring microgravity in order to achieve high purity, such as specialized crystals or biotech products. Other uses included starfighter assembly and weapons fabrication.[source?] Crew quarters and labs topped the station's central spire, from which emanated four modules for storage and additional lab space."}, {"tag": "h2", "text": "Defenses"}, {"tag": "p", "text": "Due to the high value of many of these products, the X7's designers saw fit to equip it with a significant armament in order to deter raiders. A total of eight turbolaser turrets defended the station from almost every direction, plus a warhead launcher typically loaded with eight proton torpedoes or ten concussion missiles was able to discourage starfighter attack."}, {"tag": "p", "text": "X7 Factories were equipped with an anti-warhead defensive system, which launched missiles to take out incoming ordnance. It took a few salvos of enemy missiles to overwhelm such a system. This system was so successful that some crucial XQ Platforms were fitted with it as well, such as Demetrius Zaarin's TIE Defender research facility in the Parmel system."}, {"tag": "p", "text": "When destroyed, the X7's four modules would split up from the central hub, in a similar manner to the XQ Platform's landing pads/docking arms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During Admiral Zaarin's short-lived insurrection, when his coup against Emperor Palpatine failed, his strategy shifted to the destruction of X7 Factories located in the Omar system. These were involved in the manufacture of the TIE Avenger starfighter. The renegade Imperial officer used a mixture of TIE/IN interceptors, TIE/sa bombers, and assault transports, supported by a EF76 Nebulon-B escort frigate (according to the cutscene, though it was a Nebulon-B2 frigate in the mission). Zaarin's strike caught the loyalists off guard, fortunately loyalist Imperials led by Maarek Stele managed to evacuate the personnel and inflicted significant losses to the attackers before the three Avenger facilities were destroyed."}, {"tag": "p", "text": "ZA-13 which manufactured the Avenger's hyperdrive was successfully recaptured from Zaarin's control. With equipment delivered by a supply convoy, it was converted to full Avenger production. However, it was soon afterwards destroyed by a strike from the traitor Admiral. This killed off any hope of widespread adoption of the TIE Avenger."}, {"tag": "p", "text": "Ali Tarrak had her Nami species construct a facility to manufacture TIE Defenders. It was well protected by a minefield of Type Cs and Defender starfighters. From his flagship Grey Wolf, Admiral Thrawn launched a two-pronged assault on Tarrak's facility. A lone Missile Boat piloted by Maarek Stele was instrumental in taking out the mines, Defenders, and the station's anti-warhead launcher, allowing TIE/sa bombers to destroy the factory itself."}, {"tag": "h2", "text": "Known stations"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}