{"url": "126", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:BX-series droid commandos", "Category:Separatist droid officers"], "nodes": [{"tag": "h1", "text": "126"}, {"tag": "p", "text": "126 was a Confederate BX-series droid commando who held the rank of sergeant in the Separatist Droid Army and participated in the Battle of Khorm during the Clone Wars. Serving under Commander Asajj Ventress during the battle, 126 was responsible for activating Confederate stealth units during an assault on a Republic-occupied agrocite processing facility. Although the Confederate attack succeeded, the facility, along with the entire planet, soon fell back into Republic hands."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "126 was a BX-series droid commando manufactured by Baktoid Combat Automata who served the Confederacy of Independent Systems as a sergeant in the Separatist Droid Army during the Clone Wars. Around 22 BBY, the Confederacy engaged the Galactic Republic in a battle for the valuable agrocite mineral on the planet Khorm."}, {"tag": "p", "text": "126 participated in the battle, serving under Confederate Commander Asajj Ventress. After the Republic captured a Confederate agrocite processing facility, Ventress planned an attack to retake it. However, before proceeding with the attack, Ventress hid a number of DSD1 dwarf spider droids in the snow near the site of the upcoming battle."}, {"tag": "p", "text": "126 was placed in charge of those stealth units and was to activate them on Ventress's command. Before long, the battle for the facility erupted. In the midst of the fight, Ventress ordered 126 to reveal the hidden spider droids. 126 complied and carried out the order, and the sudden appearance of the stealth units caught the Republic forces completely off-guard, allowing the Confederacy to recapture the agrocite processing plant. However, the plant, along with the rest of Khorm, was soon lost for the Confederacy when the Republic won the battle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A part of the BX-series droid commando line, 126 stood 1.91 meters tall and weighed 85 kilograms. The droid had beige-colored plating and white sensors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "126 appeared in the 2009 comic book The Clone Wars 7, written by Henry Gilroy and Steven Melching, and illustrated by Scott Hepburn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}