{"url": "Defender-class_assault_carrier", "categories": ["Category:Legends articles", "Category:Carrier classes", "Category:Defender-class assault carriers", "Category:New Class starship classes", "Category:New Republic starship classes"], "nodes": [{"tag": "h1", "text": "Defender-class assault carrier"}, {"tag": "p", "text": "The Defender-class assault carrier was a starfighter carrier first deployed by the New Republic shortly before the Black Fleet Crisis."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "These ships served as starfighter platforms, and were very lightly armed. They lacked heavy guns, and were only armed with 20 light anti-starfighter laser cannons for self-defense. The Defender-class assault carrier was equipped with a Class 1 hyperdrive, and had a crew of 4,050 in addition to 20 gunners."}, {"tag": "p", "text": "In addition to its starfighters, the Defender-class assault carrier also held assault shuttles and various personnel transports for its 700 troops."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The 700-meter-long Defender-class was originally designed as part of the Defender program in the early years of the New Republic. They were eventually folded into the New Class Modernization Program, under which these assault carriers also lent their basic hull-design to the Majestic-class heavy cruiser."}, {"tag": "p", "text": "Each of these ships was home to three New Republic wings, sometimes consisting of a single type of starfighter. The majority of Defender-class carriers in the New Republic Fifth Battle Group carried E-wing starfighter wings, while a few were dedicated to supporting K-wing bomber wings. Only one of these ships actually carried Defender starfighters, the starfighter it was originally designed to host."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The only official image of the Defender-class assault carrier is found in the RPG sourcebook Cracken's Threat Dossier. Like the pictures of other New Class ships, this picture is problematic when set against information from The Black Fleet Crisis novels, on which Cracken's Threat Dossier is based: the Majestic and Defender classes look nothing alike, even though they are supposed to be built on the same hull. Because of this, it is hard to know what these two classes \"really\" look like."}, {"tag": "p", "text": "Cracken's Threat Dossier originally gave the assault carrier one wing of fighters. This equals 36 fighters in the New Republic and was an oddly small number for a dedicated carrier of that size. The newer The Essential Guide to Warfare provided the more suitable fact that three wings were meant to be housed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}