{"url": "Defender_Wing", "categories": ["Category:Legends articles", "Category:New Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Defender Wing"}, {"tag": "p", "text": "Defender Wing was a bomber wing of the New Republic Defense Force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Formed in 6 ABY, Defender Wing was composed of three BTL-S3 Y-wing squadrons under the command of General Horton Salm."}, {"tag": "p", "text": "General Salm trained Champion, Guardian, and Warden Squadrons on Folor alongside the reformed Rogue Squadron, which Salm was charged with overseeing. A rivalry developed between Salm's green pilots and Wedge Antilles's aces after their embarrassing defeat by the Rogues during a training exercise. To add insult to injury, the Rogues arranged for their new squadron crest to be displayed on the Y-wings main display when they were \"shot down.\" This was later made up for when the Rogue Squadron quartermaster, Emtrey, delivered a gross of new flight suits to Defender Wing. Two weeks after the exercise, the wing was made fully operational by Admiral Ackbar."}, {"tag": "p", "text": "The first major operation for the wing was the Battle of Vladet, the Rachuk sector capital. During the operation, the Carrack-class light cruiser Expeditious and the Lancer-class frigate Ravager ambushed the starfighters. Ravager would have destroyed the Y-wings, but quick thinking by Lieutenant Corran Horn and a torpedo volley from Warden Squadron destroyed Ravager."}, {"tag": "p", "text": "The wing also participated in the First Battle of Borleias. During the battle, the wing was assigned to the bulk cruiser Mon Valle. The wing was ordered to pull out by General Laryn Kre'fey, but disobeyed orders and stayed close to the Star Destroyer Emancipator. When the Imperials sprang an ambush, Salm ordered the wing back in, destroying a number of TIE Interceptors and rescuing the Rogues. A second attempt at taking Borleias was more successful, with the arrival of Defender Wing and a second wing of fighters covering Lieutenant Judder Page and his commando unit as they infiltrated the base and captured it."}, {"tag": "p", "text": "Defender Wing also participated in the seizure of one of Warlord Zsinj's station at Yag'Dhul. Beginning with that battle, Guardian Squadron used B-wing starfighters in the place of their older Y-wings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}