{"url": "Defense_Force_Program", "categories": ["Category:Canon articles", "Category:Military stubs", "Category:Galactic Republic military units"], "nodes": [{"tag": "h1", "text": "Defense Force Program"}, {"tag": "p", "text": "The Defense Force Program (DFP) was a proposed military force for the Galactic Republic during the High Republic Era. The DFP was proposed by Senator Tia Toon of the planet Sullust. Prior to the Nihil's attack on the Valo Republic Fair, the DFP was not popular enough to pass in the Galactic Senate, despite multiple votes to establish it. Many officials viewed the DFP as Toon advancing the interests of the SoroSuub Corporation although Toon saw no conflict-of-interest advocating for his system's largest company and the Republic's security. Negative views of the program ranged from overly expensive to \"unaligned with the vision\" of Chancellor Lina Soh's administration."}, {"tag": "p", "text": "Toon, a Sullustan, admired the Jedi Order but believed the Republic should not rely solely on the Order and the Republic Defense Coalition for protection. He worried what might happen if the Jedi were stretched too thin to protect the Republic or if something should happen to them. Toon also believed the RDC was too weak, disparate, and constrained to provide proper protection to the Republic. After the attack on Valo, Toon swore to support rebuilding efforts and praised the Jedi and the Royal Togruta Fleet for their timely aid. He proceeded to cite the attack as an example of why the DFP was necessary, as the Jedi and Togruta forces could have easily not made it in time to prevent much worse destruction. Jedi High Council member Stellan Gios reflected that Toon had been proven right about the need for the program."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The proposed Defense Force Program was described in the 2021 novel The High Republic: The Rising Storm. By the end of that novel, it remained a proposal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}