{"url": "Defense_of_Maridun", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Battles in the Rolion sector", "Category:Battles of the Clone Wars", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Defense of Maridun"}, {"tag": "p", "text": "In 21 BBY during the Clone Wars, a Lurmen village on Maridun was defended from Separatist forces by a group of stranded Jedi and Galactic Republic soldiers. The Separatist battle droids, led by Neimoidian General Lok Durd, had chosen the remote village in order to test Durd's new Defoliator cannon, which could destroy organic life but leave droids unharmed. The Republic group, consisting of Jedi Generals Anakin Skywalker and Aayla Secura, Jedi Commander Ahsoka Tano, Clone Commander Bly and Clone Captain Rex, had crash-landed on Maridun after their cruiser had been knocked into hyperspace during the Battle of Quell. Secura, Tano and Bly had found the village while seeking help as Skywalker had been severely injured during their escape. When Durd and his droids arrived at the village, the group was forced to sneak into the surrounding grasslands while the droids conducted a sweep, with the two clone troopers helping Skywalker walk. After discovering Durd's base and witnessing a test of the Defoliator, the group stormed the base after Durd and the majority of his forces had left, stealing a shuttle and two shield generators. Despite the protests of pacifist village chief Tee Watt Kaa, the Jedi and clones defended the village from Durd's attack before Skywalker was able to destroy the Defoliator cannon and capture Durd."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When Jedi Master Aayla Secura and Clone Commander Bly's fleet came under attack by a Separatist fleet at Quell, she called for help from the nearest Galactic Republic forces. Jedi General Anakin Skywalker's flagship, the Resolute, responded, and while Admiral Wullf Yularen remained aboard the Venator-class Star Destroyer, Skywalker's forces boarded Secura's stricken Jedi Cruiser, along with Skywalker's Padawan Ahsoka Tano and Clone Captain Rex. Skywalker also sent a Consular-class cruiser to dock in the lower hangar of Secura's flagship so they could evacuate. The three Jedi, Bly, Rex and a few other clone troopers made it aboard the cruiser before Secura's flagship broke apart, but Skywalker was severely injured holding back an explosion in the process."}, {"tag": "p", "text": "Secura attempted to have the frigate dock with the Resolute, despite Yularen's concern that it would not be possible to do so mid-battle. However, the starship was damaged by Separatist fire that caused its hyperdrive to activate and knocked out its long-range communications. As Yularen ordered the Resolute to perform evasive maneuvers, the frigate was flung into hyperspace along a random trajectory. Yularen gave orders for his officers to calculate the stray vessel's last known trajectory, so it could be located after the battle was finished. Ultimately, the battle was a Separatist victory."}, {"tag": "p", "text": "The frigate's uncontrolled journey through hyperspace hit a snag when Bly discovered that, due to the damage to the navicomputer, the ship was on a collision course with a star. In order to avoid a crash, the Jedi were forced to cut all power to the ship, forcing it out of hyperspace. However, when Secura attempted to reactivate the power, she lost her grip on the switch when Rex's handhold broke, causing him to slam into her in zero gravity. Secura was able to use the Force to throw the switch, allowing Tano and Bly to slingshot the ship around the star. However, the damage ensured that the starship crash-landed on the nearby planet of Maridun."}, {"tag": "p", "text": "After the crash, everyone onboard quickly evacuated the ship before it exploded, with Secura and Tano carrying Skywalker. Secura decided that she, Tano, Bly and the three troopers would head out in search for help while Rex guarded the injured Skywalker at the crash site, although Tano was reluctant to leave her master. Bly found a piece of carved wood that led Tano to deduce the planet's inhabitants might live near giant trees, and the party set out. Reaching the trees, no signs of life were found, but there were tracks from where the giant pods that regularly fell from the trees had been dragged away. While Secura's group was following the tracks, they were attacked by predatory mastiff phalones, with troopers Cameron, Lucky and Flash dying in the attack. Secura, Tano and Bly continued on. Back at the crash site, Skywalker and Rex were also attacked by a mastiff phalone which Rex managed to drive off."}, {"tag": "p", "text": "Secura, Tano and Bly reached a village inhabited by Lurmen colonists. The village's leader, staunch pacifist Tee Watt Kaa, grudgingly agreed to send his son and village healer Wag Too to help Skywalker, but only if Secura stayed behind as \"insurance\". Tano, Bly and Wag Too returned to the crash site just as more mastiff phalones were attacking, and tied one of the attacking creatures up after the other had been killed by Rex, who received a minor arm injury in the scuffle. Tano and Bly carried Skywalker to the village on a stretcher, accompanied by Rex and Wag Too. Under the healer's care, Skywalker began to recover from his injuries."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Arrival of the Separatists"}, {"tag": "p", "text": "Separatist General Lok Durd, a weapons designer, had invented a new weapon he called the Defoliator, which promised to destroy organic material while leaving machines like the Separatists' battle droids unharmed. In order to test the weapon, Durd required test subjects, and chose Maridun and the Lurmen colonists' village because it was remote and undefended, setting up a small fort some distance from the settlement."}, {"tag": "p", "text": "Some time after the Jedi and clones' arrival, while Skywalker was still recovering from his injuries, Durd's forces descended on the village in a C-9979 landing craft. Keeping watch just outside the village, Captain Rex spotted the approaching vessel and, after using macrobinoculars to confirm it was a Separatist ship, informed Commander Bly, who in turn alerted the Jedi. Tee Watt Kaa suggested the Republic group leave immediately, and Secura concurred, pointing out to Tano that all of the Lurmen would be slaughtered if they were discovered."}, {"tag": "p", "text": "With Rex and Bly helping Skywalker walk, the five slipped out into the tall grass on the far side of the village as the droids ransacked the place. Tee Watt Kaa told Durd the villagers, as pacifists, would offer no resistance, but Durd ordered a sweep for \"weapons and Republic contraband\" anyways, of which the droids found nothing. After their search, Durd informed Tee Watt Kaa that more would be conducted on a periodic basis. Wag Too, meanwhile, sent his friend Tub to track the Jedi and make sure they made it offworld."}, {"tag": "h3", "text": "Test firing"}, {"tag": "p", "text": "In the tall grass, the Jedi and clones stopped for a rest. Tano and Rex both found it hard to believe that the villagers were not willing to fight to defend themselves, and Secura chided the Padawan, reminding her that standing up to one's beliefs was a noble thing. Skywalker reminded everyone that they needed a ship to leave Maridun, and suggested that the only starship around likely belonged to the Separatists. Rex approved of the idea of stealing from the enemy, but no one in the group had any idea where to find the Separatists' base. At that point, Tano noticed that they had been discovered by an enemy probe droid, which prompted a chase through the tall grass, with its signal jammed by Bly. The still-recuperating Skywalker, who could not run quickly, yelled that he was fine and for everyone else to go ahead. Tano and the clones chased after the droid while Secura chose to loop around, eventually cutting the droid off and destroying it with her lightsaber. Secura suggested climbing a nearby tree to see where the droid had come from."}, {"tag": "p", "text": "Skywalker eventually caught up to the others at the top of a tree that offered an excellent vantage point of the Separatist base, where Durd was preparing the Defoliator Deployment Tank for a test firing of his new weapon. Scanning the base with macrobinoculars, Skywalker noted the unusual tank and realized the Separatists had some sort of new toy. He sent Rex and Bly down to try and scout a closer look at the weapon."}, {"tag": "p", "text": "Durd, contacting Count Dooku by hologram, informed him of the imminent test, before ordering two battle droids to go stand a ways away from the base. The two droids came close to where Rex and Bly were sneaking around in the grass, but the two clones managed to avoid being seen. When the Defoliator was fired, Rex and Bly chose to run for it out of the blast zone, and the shell hit near where the two battle droids were standing. Running for the tree where the Jedi were watching, both clones fired ascension cables, but Bly tripped on a stick on the ground just as he fired his line, so Secura swung out of the tree on a vine to rescue him ahead of the advancing wall of flame. Once everyone was back in the tree, they could see the extent of the burned area."}, {"tag": "p", "text": "As Durd had planned, the two droids used in the test were undamaged. The weapons designer informed Dooku of this, before telling him of his plans to use the Lurmen village as the site of his next test firing, to examine whether the Defoliator would also destroy more than just plant life. After the impressed Count signed off, Durd and his forces once again set out for the village, this time on foot. Tub, who had been watching from another tree, sent his carrier butterfly ahead of him to alert Wag Too that the Separatists were on their way back to the village. The Republic group also realized the Separatists' likely destination and purpose. Tano was unsure if they should defend the village as Tee Watt Kaa had refused the Jedi's help earlier, but Skywalker reminded her that there was a difference between letting innocents die and accidentally dragging them into a war."}, {"tag": "p", "text": "After nightfall, the Jedi and clones prepared to raid the Separatist base, which had been left with only a few guards. Outside, Skywalker used telekinesis to move a rock around and lure the guards on foot outside into the tall grass, where he, Rex and Bly quickly took them out. Meanwhile, Secura and Tano ascended the wall, Secura taking out the droids on the wall while Tano went to open the door, allowing Skywalker and the clones to enter. Sneaking into the base's command post, Skywalker, Rex and Bly each took out one of the three droids manning it, with only the last droid to be destroyed even seeing any of the attackers. Taking the base's two deflector shield generators, they departed in a waiting Sheathipede-class transport shuttle."}, {"tag": "h3", "text": "Defending the village"}, {"tag": "p", "text": "In the stolen shuttle, the Jedi and clones reached the village before Durd and his forces. Having been alerted of the Separatists' return the night before, Wag Too had attempted to persuade his father that they had no choice but to defend themselves since there were few reasons why the Separatists would bother returning to their village other than destruction, but Tee Watt Kaa was stubbornly insistent that doing so would destroy their way of life. As a result, he was not pleased to see the Jedi again. In response to his protests, however, Skywalker simply told him that he could stand by his beliefs, but the Jedi would stand by theirs."}, {"tag": "p", "text": "When Durd and his forces got within sight of the village, Tano and Secura were building a makeshift wall of seed pods in front of the village. Rex, noting the approaching droids, told Skywalker he estimated an arrival time of no more than eight minutes for the enemy forces. Durd, deciding to survey the village with his macrobinoculars on approach, saw Tano and Secura using telekinesis and, alarmed, immediately ordered his forces to halt. Unsure as to where the Jedi had come from, Durd decided to order the Defoliator to fire immediately. Skywalker waited until shortly before the cannon's shell impacted in front of the village to have the shield generators activated, which protected the village from the destruction caused by the weapon but alarmed its residents."}, {"tag": "p", "text": "Realizing that the attack had done nothing due to the deflector shield, Durd ordered a first wave of droids to prepare to attack the village. The five defenders exited the shield to meet the approaching droids. The first wave was swiftly routed, prompting Durd to send a larger force of droids. As the second wave was attacking, Skywalker decided to head for the Defoliator and destroy it, while Tano, Secura and the clones continued to defend the village. The droids eventually breached the shield, smashing their way through the wall, and destroyed the first shield generator. As a vicious fight went on in the village's central area, the other shield generator was destroyed, causing many villagers to panic."}, {"tag": "p", "text": "Durd was preparing to fire the Defoliator again when he was informed of Skywalker's approach. The tanks fired at the approaching Jedi, but he easily evaded the shots. Skywalker quickly defeated the droids guarding Durd before cutting the Defoliator's end off, causing the most recently-loaded shell to fall onto the ground. Durd attempted to flee in a panic, but Skywalker raised him from the ground using telekinesis, before comming Rex to tell him that the weapon had been destroyed."}, {"tag": "p", "text": "While Secura, Tano, Rex and Bly fought the remaining droid forces in the village, Wag Too and his friends moved to assist them, despite Tee Watt Kaa's disapproval. Using farming implements and rope, the young Lurmen tied up the droids' feet, before knocking the droids onto the ground. Tano finished the line of droids off with her lightsaber. After the remaining droids had been destroyed, many of the Lurmen cheered."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Lok Durd and his Aqualish engineer Pune Zignat were placed under arrest, and escorted onboard the captured Sheathipede-class shuttle. Skywalker thanked Wag Too for his assistance. Tee Watt Kaa begrudgingly thanked the Jedi, but wondered at what cost, a worry strengthened by the arrival of the Resolute and two other Jedi Cruisers."}, {"tag": "p", "text": "Although Durd's attempt to use the Defoliator on the Lurmen on Maridun was foiled, the weapon would go on to see use during the Battle of Dathomir, when General Grievous was sent to destroy the Nightsisters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}