{"url": "Defense_of_Vladet", "categories": ["Category:Legends articles", "Category:Battles in the Rachuk sector", "Category:Battles of the Coruscant campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Defense of Vladet"}, {"tag": "p", "text": "The defense of Vladet was a battle that occurred in 6 ABY when the New Republic attacked Grand Isle, an Imperial base on the planet Vladet. Grand Isle served as the Imperial headquarters for the Rachuk sector, and the attack was in retaliation for a stormtrooper raid against Rogue Squadron's base on Talasea."}, {"tag": "p", "text": "The primary force in the battle was Defender Wing, whose thirty-six Y-wings were tasked with destroying the Imperial base on Vladet. They were escorted by Rogue Squadron's ten X-wings and the CR90 Corellian Corvette Eridain. Champion and Guardian Squadrons, each escorted by four X-wings, led the attack, while Warden Squadron was held in reserve due to its smaller escort. Only four TIE fighters were on hand to defend the base, and they were quickly shot down. The Y-wings bypassed Grand Isle's shields by blasting through the side of the dead volcano crater in which it was located, then destroyed the base."}, {"tag": "p", "text": "In space, the Carrack-class cruiser Expeditious and Lancer-class frigate Ravager dropped out of hyperspace. While they were too late to save Grand Isle, the Expeditious outgunned the Eridain and the Ravager presented a severe threat to the New Republic starfighters. However, Corran Horn quickly thought of a plan to deal with the Ravager. Over General Horton Salm's objections, Horn had Warden Squadron target his own X-wing with their proton torpedoes, while flying toward the Lancer-class frigate. At the last moment, he dove under the Ravager, and twenty-two torpedoes hit the ship and destroyed it. Two torpedoes, which were fired slightly late, continued to chase Horn's X-wing until his R2 unit Whistler deactivated its targeting beacon."}, {"tag": "p", "text": "Their mission accomplished, the New Republic forces then withdrew from Vladet, forcing the Empire to commit additional forces to rebuild their sector headquarters. Lieutenant Horn was temporarily relieved of duty, as General Salm had never actually authorized him to take command of Warden Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}