{"url": "Defense_of_Ralltiir", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Galactic Civil War", "Category:Battles of Ralltiir", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Defense of Ralltiir"}, {"tag": "p", "text": "The Battle of Ralltiir was one of many conflicts which took place on the planet, from its brutal subjugation in 1 BBY to its liberation following the Battle of Endor. The Rebel Alliance's Red Squadron rescued scientists from an Imperial blockade during the battle."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A battle occurred on Ralltiir in 0.5 ABY, when the Empire received word that scientists affiliated with the Rebel Alliance were hiding on Ralltiir. The Empire sent two Imperial Star Destroyers to blockade and bombard the planet until the scientists surrendered. After rescuing the defector Tycho Celchu, the Rebel pilots of Red Squadron were redeployed to the planet after Celchu informed them of the battle. Although Darth Vader and Palpatine knew that Celchu most likely leaked the information relating to Ralltiir to the Rebels upon defection, the latter felt that their receiving the information was inconsequential. The scientists were trapped under a DSS-02 deflector shield generator they had developed, which was the only thing protecting them from the Imperials sent to capture them. A force of AT-AT walkers was deployed on the surface near the scientists' location, while the Star Destroyers commenced an their orbital bombardment of the capital city, causing much of the destruction. Red Squadron members Wedge Antilles and Lieutenant Sarkli, under the command of Luke Skywalker, were sent to help defend the city with T-47 airspeeders and aid the scientists' escape."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Defense of the city"}, {"tag": "p", "text": "As Red Squadron approached the city, one of the pilots managed to trip up an AT-AT using its tow cable system. Antilles then reported that he received a distress call from the scientists. One of the scientists informed Commander Skywalker that they had set up a shield around the city, and told him they had bombs for the Rebels' use. Skywalker then ordered his craft's gunner to prepare the tow cable."}, {"tag": "p", "text": "Using their tow cables to carry the bombs, Red Squadron engaged the Imperial walkers and transports attacking the shield. Skywalker knew they had to cut off the Imperial advance, and ordered the destruction of the three bridges around the city, of which one of the bridges' destruction also caused an AT-AT crossing it to fall into the river in the process."}, {"tag": "p", "text": "During the battle, some of the AT-AT walkers managed to arrive at the main city and proceeded to fire on the city-wide shield. The shield eventually weakened under the bombardment. Red Squadron, thinking fast, proceeded to use the tow-cable bombs to blow up the \"heads\" of the AT-ATs, ending their attack on the shields. In addition, they also blew up an Imperial transport near the northeast bridge, also recovering an advanced targeting computer for future use."}, {"tag": "p", "text": "Red Squadron then destroyed the remaining Armored Personnel Carriers and All Terrain Personal Transports threatening the shield. Ralltiiri soldiers also participated in the defense of the planet."}, {"tag": "h3", "text": "Extraction"}, {"tag": "p", "text": "After successfully cutting off the main invasion, the Rebel operatives then landed in the city itself to escort five scientists to safety and defeat the remaining Imperial forces. Skywalker commandeered an AT-ST walker, knowing how to operate it due to his earlier participating in the AT-ST Training Program back when he was still a farmhand on Tatooine. As Skywalker did so, Lieutenant Sarkli ran to a nearby Imperial Armored Personnel Carrier, accompanied by a stormtrooper and thereby defecting to the Empire. He and the stormtrooper escort boarded it, and Skywalker realized that they had been led right into the trap."}, {"tag": "p", "text": "Skywalker then used the AT-ST to fight through an Imperial APC, which disgorged stormtroopers. Skywalker then continued through the city, facing additional seven AT-ST's, another APC, Viper probe droids, and stormtroopers on a total of four E-Web heavy repeating blasters."}, {"tag": "p", "text": "During his trek through the cities, Luke managed to pick up homing proton torpedoes from a corner."}, {"tag": "p", "text": "He then came out into a plaza with a statue near the compound's Blockade Runner, which was guarded by five more walkers, probe droids, two more E-Webs, and another APC. Skywalker defeated them all, and then blew a hole in the wall to create an escape route to the corvette. He then dismounted and led the scientists to meet with Captain Derlin. Derlin then informed Skywalker that Imperial stormtroopers had boarded the ship. While Derlin was ordered by Skywalker to set up a perimeter around the scientists, Skywalker and the crew fought off the stormtrooper contingent, with Skywalker taking control of an E-Web at one point. Several of the Rebel troopers were gunned down, though. Derlin reported to Skywalker that the Imperials have returned, causing Skywalker to go to the arrival point and wipe out the stormtrooper reinforcements with various WEB mounted blasters littered near the stern of the ship. Afterwards, he gave permission for Derlin to leave the planet. The corvette took off and flew past the Imperial blockade, with Skywalker remarking that they just barely managed to succeed in their mission."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The scientists were afterward escorted off-world. Following the battle, Darth Vader affirmed to Galactic Emperor Palpatine that their destiny of defeating the Rebellion would be fulfilled."}, {"tag": "p", "text": "Sarkli, meanwhile, would become one of the Empire's most talented spies, gaining personal favor of even Emperor Palpatine, as well as becoming an elite Storm commando. Han Solo, when confronting Sarkli for the last time at Endor, would refer to his defection by stating that he \"chose the wrong side.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Defense of Ralltiir was first showcased in the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike, where it was composed of two missions: Defenders of Ralltiir and Extraction from Ralltiir."}, {"tag": "p", "text": "According to the audio commentary for \"Defenders of Ralltiir\", the level was made to take advantage of light scattering, and was cited as an under-appreciated aspect for the players, especially as it was difficult to animate the environment. In addition, the Defenders of Ralltiir mission was cited to have been inspired by the war in Afghanistan, using images taken from CNN on the war coverage as models for the war-torn and desolate environment. Likewise, the Extraction from Ralltiir level was largely based on World War II, specifically scenes from Band of Brothers or Saving Private Ryan, and were aiming for a more \"bombed-out Berlin\" effect, and was also given more detail due to it being the ground portion of Ralltiir. The Blockade Runner portion was also inspired by the beginning of A New Hope, and used footage from the films as a reference for the details. Both \"Defenders of Ralltiir\" and \"Extraction from Ralltiir\" were originally planned to be sublevels of a single level, but the size of each level, particularly the former, led to them being split up. As a result, a level where Luke Skywalker had to infiltrate an Imperial-class Star Destroyer in the aftermath of those missions also ended up cut. A similar cut was later made for Deception at Destrillion."}, {"tag": "p", "text": "The player could also take out several of the AT-ATs by tripping them up with tow-cables, although because of the mission taking place long before the Battle of Hoth, which was where the strategy was first created chronologically, that can be chalked up to non-canon gameplay elements. However, at least one of those instances was canon, due to it appearing in the beginning cutscene of Defenders of Ralltiir."}, {"tag": "p", "text": "In order to gain a gold medal for the mission \"Defenders of Ralltiir,\" the players will need to use the tow-cable bombs on the AT-AT heads to take them out quickly. The game's official guide recommends that course of action. Similarly, to get the Advanced Targeting Computer upgrade, the player needs to blow up the Imperial Transport at the northeast landing point before picking it up. This article assumes the player did both."}, {"tag": "p", "text": "In \"Defenders of Ralltiir\", the Shield Generator model from the \"Battle of Hoth\" level in \"Rogue Leader\" is recycled as the Shield Generator for the city. The bridges that the players destroy in \"Defenders Of Ralltiir\" are based off of the Golden Gate Bridge in San Francisco, some shots based around those seen in the trailer for Twister."}, {"tag": "p", "text": "In the level \"Extraction from Ralltiir\", the player comes across a Statue of a Jedi Knight with the logo of the \"Jedi Knight\" Game Series at the base of it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}