{"url": "Deflarians", "categories": ["Category:Legends articles", "Category:Corellian organizations", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Deflarians"}, {"tag": "p", "text": "The Deflarians were a group of criminals who operated on Corellia during the Galactic Civil War. Their were named after their leader, Deflaros."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Circa 1 ABY, a traitorous CorSec agent named Jori sold to the criminals known as the Ragtags information concerning a cargo of weapons carried to the local CorSec force in Tyrena. Lacking firepower to perform themselves the thief, the Ragtags hired the Deflarians to hijack Captain Donovan's ship and steal the cargo of weapons. The Deflarians succeeded the operation and captured the ship. Donovan was then imprisoned in the Deflarian bunker. The Deflarians then crashed a ship of the same model than Donovan's to cover the theft of the cargo. After the crash, they also planned to place a modified flight recorder in the wreckage."}, {"tag": "p", "text": "However, Captain Donovan was also carrying medical equipment for the merchant Sinis. Sinis thus recruited a spacer to investigate the ship crash site and retrieve some equipment. Unfortunately for the Deflarians, the spacer spotted them while they were placing the modified flight recorder in the wreckage. The spacer fought the Deflarian scavengers and recovered the flight recorder. One of Sinis' friend, Yorick, was later able to slice the flight recorder and discover that it was modified. The spacer later attacked the Deflarian  Communications Post to find information. This led the spacer to another camp were the spacer defeated a Deflarian lieutenant and his enforcers, and finally retrieved Sinis's medical equipment. Sinis later transmitted all the information gathered about the Deflarians to Inspector Cora of the CorSec."}, {"tag": "p", "text": "Inspector Cora therefore ordered the spacer to return to the Deflarian camp. From a scan of the area, Cora identified a courier who was used by the Deflarians for deliveries between camps. The spacer followed the courier until they arrived to the Deflarian bunker. The spacer infiltrated the bunker and found the imprisoned Captain Donovan. The spacer therefore killed Vinros, several Deflarian henchmen and a Deflarian underboss to liberate Donovan. After Donovan revealed that his ship was hijacked, Cora tasked spacers to assault another Deflarian camp, whose location was provided by Donovan. During the raid, the spacers killed several Deflarian guards and mechanics, as well as Deflaros and his bodyguards, and secured Donovan's ship and its cargo."}, {"tag": "p", "text": "Furthermore, Captain Jark of the CorSec later identified Agent Jori as the traitor who sold Captain Donovan to the Deflarians and the Ragtags. Jark thus sent spacers to raid a meeting between Deflarians and Ragtags, and Jori was killed during the operation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Deflarians appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Deflarians were added to the game with the release of the \"Publish 28\", on April 26, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}