{"url": "Defiant_(Imperial-class)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Imperial-class Star Destroyers", "Category:Starships of the Imperial Remnant"], "nodes": [{"tag": "h1", "text": "Defiant (Imperial-class)"}, {"tag": "p", "text": "Defiant was an Imperial-class Star Destroyer that served in the Imperial Remnant's navy in 28 ABY, at the time of the Yuuzhan Vong War. Commanded by Captain Essenton, Defiant was positioned that year with other warships of the Imperial Navy near the planet Borosk in a defensive effort against an attacking Yuuzhan Vong fleet. During the fighting, a gravitic amplitude modulator was installed upon Defiant, which allowed the Star Destroyer to disrupt the telepathic command signals from the enemy yammosk war coordinators long enough to smash through disrupted Yuuzhan Vong battle lines and help destroy a yammosk. Following a successful defense of Borosk, Defiant was dispatched to the planet Yaga Minor to fend off an imminent Yuuzhan Vong strike."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An Imperial-class Star Destroyer, Defiant measured 1,600 meters in length and was produced by Kuat Drive Yards. Equipped with engines and a hyperdrive, Defiant possessed an armament of torpedoes, concussion missiles, and turbolaser banks, with the latter supported by targeting sensors. The Star Destroyer also had a deflector shield generator. For the Battle of Borosk, a gravitic amplitude modulator—capable of broadcasting gravitic pulses that interfered with the telepathic signals issued by Yuuzhan Vong yammosk creatures—was installed upon Defiant."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Guarding Borosk"}, {"tag": "p", "text": "By 28 ABY, Defiant was serving in the Imperial Remnant's fleet, which oversaw the defense of the Remnant's holdings in the Outer Rim Territories, and was under the command of Captain Essenton. At that time, the galaxy was engulfed in the Yuuzhan Vong War, instigated by the extra-galactic Yuuzhan Vong invaders. Although the Imperial Remnant was spared much of the initial assault, a Yuuzhan Vong fleet led by B'shith Vorrik attacked the Remnant in 28 ABY. The Remnant lost its capital planet of Bastion, forcing Grand Admiral Gilad Pellaeon of the Imperial Navy to regroup at the planet Borosk, with Defiant part of the fleet elements that assembled there."}, {"tag": "p", "text": "As the members of a Galactic Alliance team—who were in the Outer Rim searching for the sentient planet Zonama Sekot—shared intelligence with the Imperials that a modified gravitic amplitude modulator, or GAM, could be used to disrupt the signals of the yammosk war coordinators used by the Yuuzhan Vong, such a device was brought to the Borosk system and reprogrammed by Jedi Knight Jacen Solo and other members of the Galactic Alliance team. Vorrik and his Yuuzhan Vong forces pursued the Imperials, arriving at Borosk to assault the Remnant, and Defiant was positioned in low planetary orbit behind layers of ion mines that guarded Borosk. However, once the GAM was successfully installed upon Defiant, Pellaeon had Lieutenant Arber forgo a test run in order to use the GAM against the Yuuzhan Vong immediately, prompting Essenton to take Defiant away from Borosk and engage the enemy, escorted by blastboats and TIE Series starfighters."}, {"tag": "h3", "text": "Hunting yammosks"}, {"tag": "p", "text": "Striking where the Imperials knew a yammosk to be, Defiant weathered the attacks of the Yuuzhan Vong elements guarding the yammosk and responded in force, with the Star Destroyer's turbolasers eradicating whole squadrons of coralskippers. When the GAM was in range of the yammosk, Arber activated the device, and the resulting jamming of the yammosk's command frequencies caused the coralskippers and other vessels protecting the yammosk to lose a coherent defensive pattern, allowing Defiant and the ships escorting it to close in on the yammosk and its nearest protectors. In response to the GAM's activation, coralskippers resorted to suicide runs on Defiant's bridge, keeping the Star Destroyer's turbolasers committed to stopping the enemy fighters. Imperial blastboats stationed near Defiant also aided in defending the warship, whittling down passing coralskippers that were too disorganized to go after anything but the Star Destroyer."}, {"tag": "p", "text": "With TIE fighters strafing the yammosk's vessel, the yammosk attempted a last-ditch effort that saw it detonate two nearby Yuuzhan Vong ships to create a shock wave that sent TIEs spinning and knocked out Defiant's targeting sensors. A recovering TIE fighter was still able to score a direct hit on the yammosk, killing the creature, and Defiant then turned its attention to destroying the remaining Yuuzhan Vong capital ships in the vicinity. When Essenton located another yammosk, Pellaeon gave her permission to use Defiant to destroy it as well. With Vorrik losing more ships than he intended in the assault, the Yuuzhan Vong commander pulled back his forces from Borosk, and the Imperials harried the retreating vessels while Defiant used its GAM to confuse fleeing Yuuzhan Vong warships."}, {"tag": "p", "text": "When the Imperials discovered that a third of the retreating Yuuzhan Vong fleet had split off and was heading for the Imperial Remnant planet Yaga Minor, Defiant and multiple other Imperial capital ships were dispatched to aid Moff Kurlen Flennic in defense. Defiant and the Imperial forces in that area succeeded in driving off the Yuuzhan Vong once again."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Defiant was commanded by the elderly and irritable Captain Essenton, though Pellaeon admired her skill and resolve when commanding Defiant during the Battle of Borosk. Lieutenant Arber also served on the ship and was responsible for the gravitic amplitude modulator during the fighting at Borosk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Defiant appeared in the 2003 novel Force Heretic I: Remnant, written by Sean Williams and Shane Dix as part of The New Jedi Order series. The Star Destroyer later received an entry in The Complete Star Wars Encyclopedia, published in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}