{"url": "Defiler", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Defiler"}, {"tag": "p", "text": "Defilers were the \"undercover agents\" of Tyber Zann whom he dispatched to various systems to promote piracy and sabotage, moreover known as \"corruption\". They were the primary agents of the Zann Consortium, an underworld consortium and crime syndicate. Defilers would travel to Rebel and Imperial systems during the Galactic Civil War and would sabotage bases, set up connections with the black market, set up slave camps, steal credits, etc. Throughout the war, defilers became a substantial source of stress and frustration due to their constant raids. Essentially, what they were most familiar for was spreading the influence of Tyber Zann."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though the Zann Consortium possessed a surprisingly well-equipped and organized military force, they generally preferred to use guerrilla warfare tactics or criminal activities to gain influence."}, {"tag": "p", "text": "The Defiler's main purpose was to spread Tyber Zann's \"corruption\" throughout the galaxy. Many or all of them were brainwashed to only serve the Consortium. They were essentially the criminal equivalent of the Infiltrators employed by the Rebel Alliance."}, {"tag": "p", "text": "Defilers were made up of many different alien species, trained and conditioned to serve Tyber Zann above all others and concealed under a distinctive uniform of red armor. During the Galactic Civil War, Defilers were sent to numerous planets to achieve Zann's goals, often working alongside such infamous individuals as IG-88, Bossk, and Silri. The Defilers were always housed in the Consortium palace, where they would be trained for their tasks. Many defilers served as Zann's most public representatives, as they committed acts of sabotage, kidnapping, bribery, and other illegal activities. They were capable of setting up illegal casinos as part of racketeering operations. When necessary, they also participated in Zann's more covert military actions."}, {"tag": "h2", "text": "Weapons and equipment"}, {"tag": "p", "text": "Defilers were usually armed with a precise blaster rifle and thermal detonators, and preferred long-range combat. They worked well with the Droideka Mark II in destroying heavier vehicles, and could use their thermal detonators to kill entire squads of infantry. In close combat, they tended to suffer against species such as Wookiees, whose brute strength allowed them to rip off a Defiler's arms."}, {"tag": "p", "text": "The defilers generally worked in secret because of personal security. When most defilers finished their assignment, they would never appear in the Zann Consortium again, taking no risk on being recognized by any security forces. There were, however, a few exceptions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Defilers were voiced by Steve Blum, who also voices the Empire HUD."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}