{"url": "Defoliator_Deployment_Tank/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Baktoid Armor Workshop products", "Category:Confederacy of Independent Systems repulsorcraft", "Category:Hovertanks"], "nodes": [{"tag": "h1", "text": "Defoliator Deployment Tank"}, {"tag": "p", "text": "The Defoliator Deployment Tank, also simply called the DDT, was a medium-sized repulsor tank used by the Confederacy of Independent Systems to transport the weapon known as the Defoliator. These vehicles saw service during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The DDT was designed by the Trade Federation General Lok Durd. A modified version of the AAT, the Defoliator's main weapon was merged with the modified chassis of an AAT, the larger cannon replaced the traditional turret."}, {"tag": "p", "text": "It was a manually loaded single shot cannon, for loading the cannon would tilt back to allow a shell to be loaded into the open breach. The weapon fired large capsules that would spread fire over a great distance when they hit their target, the flames would turn everything in their path to ash, but droids were immune to it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The DDT was first tested on the planet Maridun by its creator, General Lok Durd. After landing on the colony world of the Lurmens, the general claimed the planet in the name of the Separatists. Later that day, the Jedi stranded on the planet observed the enemy testing the weapon."}, {"tag": "p", "text": "After coming to the conclusion that the Lurmen people were not intelligent enough to worry about, Lok Durd gave the order to destroy the village with the new weapon. After a small battle between the Jedi, Lurmen and droids, Anakin Skywalker managed to destroy the weapon."}, {"tag": "p", "text": "The cyborg Supreme Commander of the Droid Armies, General Grievous, made use of the DDT later in the war during the Battle of Dathomir."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Trivia"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}