{"url": "Defoliator/Legends", "categories": ["Category:Legends articles", "Category:Chiss vehicles", "Category:Mobile artillery", "Category:Separatist projects and operations"], "nodes": [{"tag": "h1", "text": "Defoliator"}, {"tag": "p", "text": "A defoliator was a weapon designed to destroy organic matter while leaving machinery intact. The defoliator was mounted on a Defoliator Deployment Tank, also known as a DDT."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The defoliator used by the Confederacy of Independent Systems consisted of an artillery weapon attached to the chassis of a modified Armored Assault Tank. Standard artillery shells which contained the defoliator weapon were placed within the launching mechanism and fired at a target. Upon impact, the warhead detonated, generating a fiery shockwave that engulfed a large area, obliterating all forms of organic matter but leaving machinery intact. The weapon had a weakness in that the shockwave could not breach deflector shields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The first known defoliator, designed by a Neimoidian general named Lok Durd, was created as an experimental weapon during the Clone Wars by the CIS. It was being tested by Durd, who had discovered the isolated world of Maridun. After finding a Lurmen colony on the planet, Lok Durd established an outpost in order to test the Separatists' newest weapon, designed to destroy organic matter. This weapon was used in action during the Battle of Maridun, where it was destroyed by Anakin Skywalker."}, {"tag": "p", "text": "Also, when Count Dooku sent General Grievous to invade Dathomir as revenge for Ventress' betrayal, they deployed a Defoliator tank. The tank helped burn down the forest and lead Grievous to the Nightsister village, but was finally destroyed by a tank which was occupied by Ventress."}, {"tag": "p", "text": "Many years later, a similar weapon was employed by the Chiss forces who sought to starve the Killiks out of their worlds during the Dark Nest Crisis. Special craft were used to destroy any source of food for the Killik Colony. Jaina Solo, after being brought to the Unknown Regions by Raynar Thul, helped drive the Chiss defoliators away from the Killiks' food stocks."}, {"tag": "p", "text": "These defoliator weapons were also used extensively in the Swarm War by the Chiss Ascendancy. The Chiss defoliators were notably different in that they consisted of special craft used to destroy food matter in order to starve the inhabitants of a planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}