{"url": "Dej_Vennor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bounty hunters", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dej Vennor"}, {"tag": "p", "text": "Dej Vennor was a deadly and proficient male humanoid bounty hunter active in the year 0 ABY. Vennor accepted only bounties that targeted pirates. He was rumored to be a former Imperial scout trooper, as he wore a set of modified scout trooper armor. Vennor owned the starship Target Acquired, a Firespray-31-class patrol and attack craft, as well as IT-904, an interrogation droid."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male humanoid, Dej Vennor became a bounty hunter by 0 ABY. Efficient and deadly, Vennor only took bounty assignments on pirates and refused contracts dealing with smugglers or Rebels, unless they had taken part in piracy. Many rumors at that time focused on Vennor's background, with some stating that he was a former Imperial scout trooper, while others said that a pirate king had badly scarred him. Rumors also claimed that Vennor's family had been completely killed by a pirate raid, while some stated that Vennor tracked pirates to their lairs to steal their treasures."}, {"tag": "p", "text": "At one point Vennor purchased IT-904, a former Imperial interrogation droid, from The Most Honourable Guild of Armourers via an auction on the planet Epsi Nadir. Vennor later extensively modified the droid. The bounty hunter also owned the modified Firespray-31-class patrol and attack craft Target Acquired."}, {"tag": "p", "text": "In 0 ABY, Imperial Captain Vocis Kenit, formerly of the EF76 Nebulon-B escort frigate Far Orbit, placed bounties on the heads of his former crew after they mutinied and seized the frigate from him. Vennor attempted to go after those bounties and tracked the Far Orbit."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A skilled bounty hunter, Vennor only took bounties on pirates and refused to go after non-pirates."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Vennor wore a modified version of Imperial scout trooper armor, which had a jetpack and a sealed enviro filter that could block out gases and toxins for up to two hours, as well as protect him from the vacuum of space. The armor also had wrist lasers, an internal-line slinger tipped with a grappling hook or magnetic point, and was coated with a substance called reflec, which prohibited sensors. Vennor owned the starship Target Acquired, and armed himself with a blaster rifle, a heavy blaster pistol, a force pike, and a stun grenade. Vennor additionally owned three pairs of binders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dej Vennor was first mentioned in 1998's The Far Orbit Project, by Timothy S. O'Brien. The book was a supplement to West End Games' Star Wars: The Roleplaying Game and was a sequel of sorts to the previous publication Pirates & Privateers, carrying on that book's theme by following the Far Orbit's adventures. In The Far Orbit Project, Vennor appears in the scenario hook \"The Price of Success,\" which allows players the option to have the bounty hunter appear in their missions as opposition to the crew of the Far Orbit."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}