{"url": "Dejah_Duare", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Coruscanti", "Category:Females", "Category:Personnel of the Galactic Empire", "Category:Whiplash members", "Category:Zeltrons"], "nodes": [{"tag": "h1", "text": "Dejah Duare"}, {"tag": "p", "text": "Dejah Duare was a female Zeltron living on Coruscant and the lover of Ves Volette, a famed Caamasi light sculptor. After the Destruction of Caamas, she feared for Volette's safety and contacted former Jedi Jax Pavan for help in escaping Coruscant. However when the pair arrived at Volette's apartment to meet him, they found him dead. After they found Volette's murderer, however, she turned back on her decision to leave Coruscant and instead joined with Pavan and Whiplash, a resistance group to the Galactic Empire."}, {"tag": "p", "text": "She attempted to form a relationship with Pavan, but he rejected her advance, leading her to betray Pavan and his group to Darth Vader. She desired to experience the Force fully, but Pavan denied her this wish by shutting himself away from her. However, she managed to find the exact opposite in Probus Tesla, a member of the Inquisitorius."}, {"tag": "p", "text": "Before long, Pavan's friend Laranth Tarak and a young Force-sensitive Kajin Savaros were captured by the Empire and taken to the Imperial Security Bureau. Pavan organized a rescue mission, but upon their arrival in the building, Duare revealed that she had betrayed him. Vader then ordered Pavan to hand over a vial of bota—a substance that was recorded to have the ability to strengthen a Force-sensitive's ability to touch the Force—but when he refused, Vader attacked Pavan. Tarak then revealed that she had the bota, and Vader took it and injected it into himself. However, the bota caused Vader to lose all control over his powers, and he began hurling Force energy in all directions. While the other beings present ran for cover, Duare remained in the open, as she greatly enjoyed the feeling of the Force. However, one of Vader's Force-blasts caught her and slammed her against the wall, killing her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dejah's name is spelled \"Deejah\" on the back of Coruscant Nights II: Street of Shadows, but \"Dejah\" throughout the book."}, {"tag": "p", "text": "Dejah Duare was named after two of Edgar Rice Burroughs' heroines in his works; Dejah Thoris of Mars and Duare of Venus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}