{"url": "Dejarik/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with elements from unlicensed sources", "Category:Dejarik"], "nodes": [{"tag": "h1", "text": "Dejarik"}, {"tag": "p", "text": "Dejarik was a popular game which withstood the test of time better than nearly any other game in the galaxy. It originated as a Jedi game, though as it became much more widespread over time, many beings became unaware of its origins."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Dejarik was played on a hologame table, which comprised a hologram generator within a table-sized cylindrical base, with a black-and-white checkerboard pattern on the top surface. When active, holomonsters—full-color, three-dimensional hologram playing pieces measuring between 5 and 30 cm tall—would be projected on the board. The pieces all resembled creatures, real and mythic, from throughout the galaxy, including the Mantellian Savrip, Grimtaash, the Molator, Ghhhk, Houjix, Ng'ok, Kintan strider, K'lor'slug and the M'onnok. These pieces, when moved by the player, acted out the moves as if really specimens of their species. If the pieces were not used for a certain amount of time or the game was abandoned by both players, they would simulate boredom."}, {"tag": "p", "text": "Major dejarik tournaments included the Galactic Core Interzonals."}, {"tag": "p", "text": "The kintan strider death gambit was a notable tactic. Another was the fork, in which a player moved one holomonster to threaten at least two of the opponent's, so that no matter what the opponent did one piece would be lost. It was considered a mistake in play to leave oneself vulnerable to a fork. The word fork came to be used as a generic term for facing a choice between two disasters: \"We are well and truly forked.\""}, {"tag": "p", "text": "The Millennium Falcon had a dejarik table in its lounge, installed at Chewbacca's urging. It was around this table that preliminary peace talks between Gilad Pellaeon of the Imperial Remnant and Leia Organa Solo of the New Republic were held."}, {"tag": "p", "text": "During the Yuuzhan Vong's invasion of the galaxy, Warmaster Tsavong Lah took a liking to the game, and had his shapers create a version of the game with actual living pieces."}, {"tag": "p", "text": "The frog-like newsmonger Sti Groon referred to dejarik as \"Vrax\" as it was known on Dandrian, in the Dandrian system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The game first appeared in the A New Hope novelization, where it is described but not named. Likewise, it is depicted but not named in the corresponding film. The first name given to it was Space Chess, in the instruction leaflet that came with Kenner Products's 1979 Millennium Falcon toy. It was named \"dejarik\" two decades later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}