{"url": "Del_Moomo", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Ithorians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Del Moomo"}, {"tag": "p", "text": "Del Moomo was a male Ithorian who served as one half of a notorious bounty hunting partnership with his brother Dob during the era of the Mandalorian Wars. Del always wore a red scarf where his brother Dob wore green. Del could also be distinguised by the scar running across his right eye. Born with a predilection to violence that caused both him and his brother to be kicked out of their herd, the Moomo Brothers earned a reputation for stupidity and recklessness that made them well-known figures in the Outer Rim underworld. Despite their tendency to fight with each other and their generally poor track record, the Moomos still managed to get high-profile jobs, culminating with their involvement in the hunt for fugitive former Jedi Padawan Zayne Carrick in 3963 BBY. Carrick and Snivvian criminal Marn Hierogryph had been accused of massacring several Jedi trainees on the planet Taris—in truth, he had been framed, and one of the actual perpetrators, Jedi Master Raana Tey, hired the Moomos to keep watch on Carrick's father in an attempt to lure Carrick into the open. The Moomos promptly disregarded Tey's directives and kidnapped Carrick's father on the banking world of Telerath, only for Carrick and Hierogryph to outsmart them and rescue their hostage."}, {"tag": "p", "text": "Although they had been at odds in the Telerath affair, the Moomos and the two fugitives eventually wound up joining forces. Not long after Telerath, Lhosan Industries executive Jervo Thalien hired the Moomos to team up with Hierogryph and find Tarisian Senator Haydel Goravvus, who had dropped out of public view to lead a homegrown resistance against the Mandalorian siege of Taris. In doing so, the Moomos wound up linking up with Carrick and getting involved in Resistance operations, ultimately fleeing the world after an unsuccessful attempt to bomb Mandalorian headquarters. From there, the promise of access to powerful weapons convinced the Moomos to join Carrick's quest to clear his name. That journey took them to the planets Jebble and Odryn, where they helped to expose a secretive Jedi conspiracy that had perpetrated the massacre on Taris and framed Carrick. The Moomos then accompanied Carrick to Coruscant, where he wound up being vindicated after the Jedi Covenant conspiracy made itself publicly known. The Moomos were publicly credited with bringing Carrick and Hierogryph in during the Jedi Order and Galactic Republic's attempt to sweep the incident under the rug, significantly boosting their reputations."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and exile"}, {"tag": "p", "text": "A member of the pacifist Ithorian species, Del Moomo was defying stereotypes from his early childhood. Del was noted from a tender age as quick to violence, and his chief target was usually his brother Dob, with whom he had an intense sibling rivalry. Del and Dob were nearly physically identical, save for a distinguishing scar over Del's right eye that he received as a youth when Dob shoved his head in an operating trash compactor. Del and Dob's antagonism started when the two were very young, when they cycled an airlock they were both inside in an effort to rid the family of one another. Although the two were resuscitated, the incident didn't slow down their violent tendencies, which eventually caused their exile from their herd. Now cast out, the Moomos embarked on careers as muscle-for-hire and occasional bounty bounty hunters, always working together despite their history."}, {"tag": "p", "text": "By 3963 BBY, the Moomo Brothers had accrued a certain notoriety around Outer Rim underworld circles, as well as a reputation for stupidity and recklessness. Del and Dob worked for a number of employers in the era of the Mandalorian Wars, including \"Bubbles\" d'Breen and the Twi'lek pirate Valius Ying, who fired them for gross incompetence. All the while, the brothers constantly fought with each other, including one notably violent scrap on Bogden. To aid in their pursuits, the Moomos rescued an extremely powerful Pelagia Duplex Command Assault Gunship from the scrapyard and turned it into their flagship, adding their considerable personal arsenals to their already ludicrously well-armed craft and naming it the Moomo Williwaw. Although the decision to purchase the Williwaw was a rare show of agreement between the two brothers, the Moomos often used the ship's redundant dual cockpit design to seize control of the shift from one another during their frequent disputes, causing the ship to spin in place for hours until they were resolved."}, {"tag": "h3", "text": "Trouble on Telerath"}, {"tag": "p", "text": "Despite their reputation for incompetence, the Moomo Brothers somehow still managed to continually be recommended for jobs at the highest levels of Republic society, and in 3963 BBY they received another opportunity. The two brothers were contacted by Jedi Master Raana Tey to keep watch on a banker named Arvan Carrick, whose son Zayne had become a target of Tey and a secretive Jedi cabal known as the Jedi Covenant—a former Jedi Padawan, Zayne was the public scapegoat for a massacre that Tey and several fellow Jedi Masters had actually committed, and was one of the most wanted fugitives in the Galactic Republic. Tey was hoping that targeting Zayne's father would eventually flush him out into the open, where he could be captured and executed. At the behest of their mother, Dob brought Del along on the job, and the Moomos managed to track the elder Carrick down on the banking world of Telerath. After watching Carrick for three days, Del grew impatient and proposed kidnapping Carrick, although their directions were only to keep eyes on him—Del thought it more prudent simply to grab him, then watch him. As was custom, this sparked an argument between him and Dob, who thought the idea was one of the stupidest things he had ever heard. After their usual round of insults, they realized they had lost sight of their target, and in a panic, chased Carrick down and tried to seize him. The attempt was not without resistance, as one of Carrick's clients nearly fought them off with a frying pan, but Del managed to stun her long enough with a headbutt for the brothers to take possession of Carrick and carry him off. Although the Moomos were pursued along the way—most notably by the fugitive Zayne Carrick, who had arrived on Telerath at around the same time—Del, carrying Zayne's father over his shoulder, managed to get safely back to the Moomo Williwaw."}, {"tag": "p", "text": "With Carrick in hand, the Moomos contacted Raana Tey via a holo-call, finding the Togruta Jedi Master absolutely furious that they had disobeyed her directives by actually capturing Carrick. Tey ordered the Moomos to stay put while she thought of an alternate plan, making sure to stress that the Ithorians avoid doing anything at all. The exchange prompted another fight between the brothers, as Dob feared that Del's idea to kidnap Carrick could potentially cost them their pay—the scuffle ended with Dob knocking Del out and leaving him behind to watch the banker as he went to get a drink. Once he awoke, Del checked back in with Raana Tey, who ordered him to raise ship once Dob returned, wait in orbit for her arrival and allow her to take care of the \"Arvan Carrick problem.\" However, once again, things didn't go as planned. While drinking in a nearby bar, Dob encountered Zayne's Snivvian \"accomplice,\" Marn Hierogryph, who bluffed him into accepting a lucrative offer to swap Arvan Carrick for his son Zayne without Del's knowledge. When Dob returned, Del insisted they listen to Tey and immediately raise ship, while Dob wanted to take the prisoner out to make the switch. The disagreement led to yet another fistfight between the two brothers, providing a diversion for Arvan to slip away with his son Zayne, who had stolen into the Moomo Williwaw and freed his father from his bonds."}, {"tag": "h3", "text": "Trial on Taris"}, {"tag": "p", "text": "Despite the abject failure of the Carrick contract, the Moomo Brothers were soon hired again by another client: one of the titans of galactic industry, Jervo Thalien of Lhosan Industries. This mission saw Del and Dob venture to Taris, a planet on the front lines of the growing war between the Republic and the Mandalorian Neo-Crusaders, which had been subject to a vicious Mandalorian siege in the preceding months. Thalien tasked the Moomos with tracking down Haydel Goravvus, Taris' Senator and the leader of a local resistance holding out against the Mandalorian invasion. Before becoming a public servant, Goravvus had been a Lhosan executive, and Thalien wanted to eliminate the Senator before he implicated Thalien in the shady, illegal backroom dealings that helped Taris become a Republic member world. As most signals from Taris' surface were being jammed by the Mandalorians, Thalien supplied the Moomos with an extremely powerful transmitter with which to contact him, and at Thalien's behest, the two Ithorians scooped Marn Hierogryph off the streets of Chandrila to join the operation. The Moomos and Hierogryph planned to hook up with the Hidden Beks, a well-known swoop gang that was waging its own fight in Taris' Lower City. There was just one problem: for the Moomos to find Goravvus, the Beks needed to link up with his Resistance, and for that they needed a bargaining chip. The wanted fugitive Zayne Carrick was the perfect fit, and so the group split in two: Del and Hierogryph went to Taris to get in with the Hidden Beks, while Dob and Slyssk—a Trandoshan friend of Hierogryph's—traveled to Omonoth to find Carrick."}, {"tag": "p", "text": "Although the Moomos' missions rarely went as planned, this stage went off without a hitch: Del and Hierogryph managed to make contact with Bek leader Gadon Thek, who welcomed them into the fold. Although the presence of Constable Noana Sowrs, Taris' top law enforcement official, prevented the \"criminal\" Beks from making inroads with the Resistance right away, Dob and Slyssk managed to make contact with Carrick, who arrived on Taris soon afterward. Although Del and Hierogryph planned on making Carrick the bargaining chip, their plans quickly changed. Carrick discovered that Hidden Bek lieutenant Brejik had kidnapped Constable Sowrs' two children, an act strictly against Thek's orders. Brejik attacked Carrick when he realized he had been exposed, but he was swiftly incapacitated by a furious Del, who intended on protecting his investment in Carrick. Having Sowrs' missing children produced a major opportunity, and Del and the Beks mounted up and headed for the Resistance base. The route led through an area of thick Mandalorian infestation, and Del rode side-saddle on a swoop bike piloted by Carrick and took blaster shots at Mandalorian warriors during a heavy firefight along the way. The group managed to make it to the Resistance base, but Carrick's arrival caused a major furor—one Resistance agent, Shel Jelavan, whose brother Shad was one of the Jedi Padawans Carrick supposedly killed, took a shot at him that hit Thalien's transmitter instead. Trying to protect his \"bounty,\" Moomo rushed to the fore and aimed a pair of blasters at Jelavan, only to be surprised by Raana Tey, who was now attached to the Resistance. Del fired several blaster bolts at Tey, who evaded the shots and destroyed both of Moomo's weapons with a single lightsaber swing. The ensuing tense standoff was cooled off by the Goravvus, who stepped in the middle of the fray and proctored a deal between the two sides where they would join forces and work together."}, {"tag": "p", "text": "Thus, Del had succeeded in his mission to track down Goravvus, after Hierogryph revealed to the Senator that they had been sent by Jervo Thalien, the three of them went off to discuss business. Unbeknownst to Hierogryph, Del was under orders to seize and eliminate Goravvus at the first opportunity, and once Hierogryph activated the transmitter and started a holo-call with Thalien, the Ithorian attempted to do just that. Before Moomo could dispatch the Senator, however, Raana Tey arrived on the scene and leapt to intervene. Moomo managed to gain the upper hand by throwing Goravvus into the charging Togruta, and during the ensuing fight, Thalien attempted to clean up matters by activating a massive explosive located within the transmitter. However, the blast never occurred—Moomo, an expert in explosives, recognized the device as an MM-40 thermal charge wrapped in detonite, and surmised that the earlier blaster shot from Jelavan had overloaded the detonator. Moomo hung onto the detonator, however, and after hostilities settled down once again, his knowledge of explosives became a key part of a Resistance battle plan. Goravvus learned that top Mandalorian strategist Cassus Fett had come to Taris to personally supervise operations planetside from the former Jedi Tower in the Upper City. Thalien's detonator made it possible for them to destroy the Tower remotely with Fett inside, and Goravvus tasked Moomo with unraveling the detonite cord and getting the device working again. Moomo also volunteered to press the button to detonate the explosive charges, a job he looked forward to with great excitement."}, {"tag": "p", "text": "When the day of the operation came, Moomo was chosen to be part of a small group of agents that traveled to the Jedi Tower itself. Moomo, Hierogryph, Thek and Brejik wired the base of the structure with the explosives while Carrick, Tey and Jelavan proceeded ahead on a recon effort to confirm that Fett was still on the premises. During the recon mission, however, word came through that the Mandalorians had attacked the Resistance base while they were away. Presented with the opportunity to shoot at someone, Moomo peeled away on his swoop bike to go after the Mandalorians, leaving the detonator with Hierogryph. Although Fett was not on the premises, Hierogryph wound up using Moomo's explosives anyway, destroying the Tower and killing the violent and unstable Raana Tey. Moomo managed to escape Taris after the Mandalorian onslaught and reunited with his brother aboard the Moomo Williwaw, joining a group that included Carrick's friends Jarael, Rohlan Dyre and the Jedi Alek. Carrick and Hierogryph were still unaccounted for, but several weeks after the mission to the Jedi Tower, the Moomos flew the Williwaw to the planet Jebble, where they managed to rescue Carrick and Hierogryph from a band of rampaging rakghoul beasts before the Mandalorians devastated the world."}, {"tag": "h3", "text": "Squabble at the Sanctum; clash at Coruscant"}, {"tag": "p", "text": "While the Moomo brothers did not truly care about Carrick's quest to clear his name, they agreed to keep aiding him on the promise that there were powerful weapons in store for them to find and sell. This was at least somewhat true: their next stop led them to the primitive, isolated world of Odryn, which Carrick had learned that the secretive Jedi Covenant was using as a storehouse for Sith artifacts. The native Feeorin, fiercely independent and hostile towards outsiders, had worked out a deal with the Covenant that allowed one foreigner per visit. However, the group managed to find a way around that. Jarael posed as Covenant agent Celeste Morne, and the Moomo brothers also emerged from the ship carrying Carrick and Hierogryph stuffed inside their laundry hamper—when local Feeorin chief Borjak threatened violence, Jarael beat him into submission. Borjak begrudgingly guided them to the storehouse, the Sanctum of the Exalted, and once inside the group found hundreds of Sith artifacts gathered and catalogued together. Dob and Del were disappointed at what they saw, and announced their intention to take and sell all the artifacts found within, although Carrick managed to convince them to drop the trinkets by telling them that he had seen one of them destroy an entire army on Jebble. Afterwards, the Moomos and Jarael returned to the Moomo Williwaw, leaving Carrick and Hierogryph to document their findings and awaiting their signal. However, on their way out, the Moomos stuffed their hamper full of artifacts. This proved fruitful later, as the Moomo Williwaw returned to find the Sanctum destroyed after a fight between Carrick and Covenant Jedi Master Feln, and all their evidence gone with it. By stashing away the artifacts that they did, the Moomos had unwittingly saved Carrick's hope of clearing his name."}, {"tag": "p", "text": "Having seemingly gathered all the evidence they needed, the group took the Moomo Williwaw to the Republic capital of Coruscant, in the hopes of finding someone to plead their case to. However, their arrival was anticipated, and they found Coruscant surrounded by Republic warships. A Republic starfighter squadron quickly moved to engage, and while the Moomos battled back in the Williwaw's gun turrets, their fun was impeded by Carrick's directive to shoot to disable. Although they seemed trapped, Carrick came up with a plan to make it to Coruscant through misdirection. With the Moomos and Jarael aboard, the Williwaw changed course and headed straight towards the Republic flagship, crash-landing in the ship's hangar while Carrick and Hierogryph slipped past the Republic cordon in a small shuttle. On Coruscant, Carrick and Hierogryph managed to clear their names, which proved to be a lucrative break for the Moomos. The reveal of the secret Jedi Covenant conspiracy embarrassed the Jedi Order, who agreed to pay off the bounties on Carrick and Hierogryph. The Jedi also paid the Moomos, who were officially credited with bringing the two fugitives in, a feat that significantly boosted their reputations."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Del Moomo could be distinguished from his brother by the scar running across his right eye, and he always wore a red scarf, where his brother Dob always wore green. A member of Del Moomo's herd once said that \"the kindest thing that can be said about the Moomo Brothers is that they stand tall as examples of why it is wrong to stereotype beings by their species.\" Indeed, despite the reputation of the Ithorian race as mellow and peace-loving, Del and his brother Dob had an extreme predilection towards violence from an early age, but they historically did more damage to each other than to anyone else. The Moomo brothers fought constantly since they were younglings, defying any effort of rehabilitation and occasionally putting each other's lives in danger. Del believed himself to be the smart one in the pairing, and vice versa—as Marn Hierogryph put it, they were both wrong. Intelligence often proved to be a focal point of Del and Dob's arguments, as they usually fought over whose plans they should follow, denigrating each other's intelligence in the process. Still, they worked together despite their violent tendencies towards each other, something that gave Del a sense of calm even in the most dangerous situations, as he always believed Dob would kill him before anyone else."}, {"tag": "p", "text": "However, like his brother, Del was often rash and impatient, which combined with his stupidity led to the Moomo brothers being one of the laughingstocks of the Outer Rim underworld community. Although they had a well-earned reputation for hostility and recklessness, both of the Moomos were savants with weaponry, and Del was an expert on the topic of explosives. Del loved nothing more than a good bomb, and was not only able to identify different kinds of explosives at a glance, he had the technical skills to modify and repair them as well. Both Moomo brothers were obsessed with weaponry, and the pursuit of powerful arms—and the money with which to purchase said arms—was more important to him than anything, including his relationship with Marn Hierogryph and Zayne Carrick. To that end, Del was extremely protective of his potential bounties, and often put himself in extremely dangerous situations to preserve his interests. Other hobbies of Del's included food—something Del spent too much money on, according to his brother—and pazaak, a card game at which Del often cheated Dob. Moomo was fluent in both Basic and Ithorese."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Del Moomo was first introduced in Star Wars: Knights of the Old Republic: Reunion, a story arc of the Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2006. Over the course of his appearances in the Knights of the Old Republic, Del usually appeared alongside his brother Dob, from whom he looked mostly indistinguishable—the only differences being that Del was drawn with a red scarf and a scar over his eye, while Dob had a blue scarf and no scar. However, the identifiers were accidentally reversed in the Moomo brothers' first appearance, with Del being drawn with a blue scarf and no scar. Miller attributed this to the issues being done simultaneously, with pages coming back from two different artists. During his appearances in Knights of the Old Republic, Moomo was drawn by six different artists: Brian Ching, Harvey Tolibao, Dustin Weaver, Scott Hepburn, Bong Dazo and Alan Robinson"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}