{"url": "Delari_Prime", "categories": ["Category:Legends articles", "Category:Corva sector planets", "Category:Desert planets", "Category:Galactic Empire planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Delari Prime"}, {"tag": "p", "text": "Delari Prime a was planet in the Delari system of Corva sector, orbiting twin stars. It suffered an asteroid collision thousands of years before the Galactic Civil War, pushing the planet to an orbit closer to the stars, making the planet a desert world. An Imperial relay station was established on Delari Prime, which was abandoned after the Battle of Endor and became the home of New Republic archaeologist Dr. Oron."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At one time, Delari Prime was teeming with life. Thousands of years prior to the rise of the Galactic Empire, an asteroid several kilometers long crashed into the lush surface. The impact moved the world closer toward the system's binary stars, thereby shortening the planet's orbital distance. Within a few weeks, the oceans of the world began to evaporate, forming thousands upon thousands of rivers that crisscrossed the planet. This sudden and massive evaporation distorted the normal weather patterns, creating huge discrepancies in pressure between the location and the next. Fierce winds began to whip across the planet, furthering the cycle of erosion."}, {"tag": "p", "text": "Over the next several millennia, the constant battering of the world resulted in deep chasms that account for most of Delari Prime's surface area. The remainder, at the poles, which had been ice caps before the cataclysm, now spawned new forms of planet life that could withstand such an environment. During the Galactic Civil War, the Empire set up a secret communications base on the planet. After the Battle of Endor, however, the base was abandoned and later sold to an elderly archaeologist named Dr. Oron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}