{"url": "Dellalo_Dayson", "categories": ["Category:Canon articles", "Category:Females", "Category:Individuals of unspecified species", "Category:New Republic Special Forces personnel"], "nodes": [{"tag": "h1", "text": "Dellalo Dayson"}, {"tag": "p", "text": "Dellalo Dayson was a female Special Forces sergeant in the New Republic who participated in the Battle of Jakku."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dellalo Dayson was a female who operated as a sergeant in the New Republic Special Forces, and led a commando team that included the Gran Margle. When the New Republic embarked on the Battle of Jakku, Dayson and her team loaded munitions onto their UT-60D U-wing starfighter/support craft. She was approached by former commando Jom Barell, who implored her to let him join the fight. She initially refused the disgraced SpecForces fighter, telling him to speak to General Tyben, but Barell persisted, and Dayson ultimately agreed to look the other way if Jom stowed aboard their ship."}, {"tag": "p", "text": "During the battle, Dayson's U-wing dropped into Jakku's atmosphere, where it was targeted by a missile. Jom leaped from the transport and used his jetpack to intercept the projectile, killing himself but saving Dayson and her crew. The sergeant ultimately survived the battle and returned to collect the late commando's effects. While doing so, she encountered Barell's former lover, Jas Emari, and showed her footage of Jom's last moments, captured by the U-wing's camera. Dayson admitted that Jom saved her entire team, and was thanked by Emari before she departed to process the news."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A female SpecForce officer, Dayson had a brusque, no-nonsense manner, and respected the chain of command despite hating filling out reports. She had a long nose."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dellalo Dayson first appeared in the 2017 novel Aftermath: Empire's End, by Chuck Wendig. She was named after author Delilah S. Dawson, and shares a surname with the Legends character Alta Dayson, who also served the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}