{"url": "Dellis_Tantor", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Enlisted stormtroopers of the Galactic Empire", "Category:Garosians", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Imperial defectors", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Males", "Category:New Republic Army officers", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Dellis Tantor"}, {"tag": "p", "text": "Dellis Tantor was a young stormtrooper recruit whose brother's success helped advance his career until he could bring his considerable talents to Imperial Intelligence. There, he discovered that the Galactic Empire had executed his father, and he was imprisoned after telling his brother Brenn, now an Imperial general, about the betrayal. He was finally freed in the Liberation of Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "Dellis Tantor was born to a middle-class family on Garos IV during a time of civil war. The Galactic Empire intervened to end the civil war, and this imposition of peace impressed his father so much that he enlisted as a military transport pilot and raised his sons to respect the [[stormtroopers who kept order. However, a resistance movement grew against the Empire, and the Tantor family's house was destroyed during an episode of fighting. Stormtroopers rescued Dellis and his older brother Brenn from the rubble, leading the pair to vow that they would become stormtroopers themselves."}, {"tag": "p", "text": "Brenn immediately gained admission to the Academy of Carida and underwent stormtrooper training. Dellis followed him one year later. During their training they were told the tragic news that their father had been killed by Rebels in the course of a mission to deliver medical supplies to Graal'diin. The two were excellent cadets, with Dellis displaying a special aptitude with technology, but were mysteriously prevented from joining a stormtrooper squad—unknown to them, it was because they were not clones. The two began to pester Cattena Squadron, which was stationed at the Academy, until the squad captain, impressed by their dedication, allowed them to join as \"honorary stormtroopers\". However, they were never able to gain acceptance from the rest of the unit, with whom they never socialized. This frustrated Dellis more than it did his patient brother. While Brenn intended to persist with his dream of becoming a stormtrooper, Dellis applied to Imperial Intelligence, the Imperial Security Bureau, and the Commission for the Preservation of the New Order (COMPNOR) in hopes of putting his skills to better use."}, {"tag": "p", "text": "Tantor was nearing acceptance from Imperial Intelligence, but in 0 BBY, Cattena Squadron was sent to Kalaan. In the course of the battle, the squad leader was killed and Brenn took command. During the process of clearing the city, Dellis was shot by a Kalaanite resistance fighter. As Brenn knelt over his wounded brother, Captain Beri Tulon, a training officer who was scouting for prospects for a special project, gave Brenn a battlefield promotion to lieutenant and ordered him to report to the Star Destroyer Inquisitor. Dellis was brought along and put in a bacta tank."}, {"tag": "p", "text": "Tantor was soon fit, and appeared on the ground to take orders from his brother in Brenn's first training mission on Tatooine. The training was abruptly disrupted when the escape pod launched from the Tantive IV was tracked to their vicinity. In the search for the droids, Dellis put his technical skills to good use slicing into records in a Jawa sandcrawler and Ben Kenobi's hut to retrieve data."}, {"tag": "p", "text": "Tantor continued to serve under Brenn when he was sent to Ruul. There, he sliced into the planet's central computer complex, which had been captured by Rebels. When damage to the facility prevented it from transmitting vital data on Rebel movements to the Star Destroyer overhead, Tantor deployed a line of remote relay beacons to a nearby broadcast antenna."}, {"tag": "p", "text": "The information recovered from the Ruul complex led Brenn and his superior, Grand General Malcor Brashin, to Sarapin. Dellis was vital to the Imperial operation when Brenn discovered that the energy collection facilities he had been sent to recapture had been locked down by the Rebels. Dellis was able to slice into each facility and reactivate the vital power stations."}, {"tag": "p", "text": "Tantor became even more important when he determined that the Rebels had captured a drilling station. The Rebels had been unable to maintain control of the drill, and the malfunctioning drill was causing seismic disturbances. Brenn fought to get Dellis to the drilling station, which he promptly shut down."}, {"tag": "h3", "text": "Imperial Intelligence"}, {"tag": "p", "text": "After the Sarapin operation had concluded, Brashin delivered Brenn and Dellis saddening news. The Death Star had been destroyed by Rebel starfighters, with the deaths of almost all Imperials aboard. The deaths left a massive gap in the Imperial officer corps, and Brenn and Dellis were promptly promoted to fill it. Dellis was promoted to colonel by Brashin and transferred to Imperial Intelligence, separating him from Brenn."}, {"tag": "p", "text": "Tantor proved a talented worker and eventually attained the rank of major, as Imperial Intelligence unfortunately seemed not to recognize Brashin's promotion. However, in the brutal world of Imperial Intelligence, Tantor became disillusioned with the Empire. Driven by curiosity and suspicion, he surreptitiously accessed Imperial files on his father. It was there that he found a copy of his father's Imperial Death warrant death warrant. The Empire had had him executed as an example to other pilots after he lost a shipment of grain to pirates, and lied to his family, using their betrayal to fuel the patriotism of his sons. This, then, was what had restricted Brenn and Dellis's acceptance into the stormtrooper corps."}, {"tag": "p", "text": "Disgusted, Tantor lost all faith in his government. He knew that his superiors would be able to tell that he had accessed the file. He received orders from Brashin instructing him to report to Ruul and squelch an uprising. Tantor suspected he wouldn't be making it back. He knew he must get the news to Brenn, now a highly placed general."}, {"tag": "p", "text": "Brenn, elated after his success at the Battle of Hoth, was initially overjoyed to see his brother for the first time in two years. Dellis, anxious and unwilling to be seen with Brenn for fear of dragging his brother down with him, gave Brenn a datadisk with a copy of their father's death warrant, explaining that the pair had been betrayed and used by a brutal, capricious Empire. He then told Brenn of his mission to Ruul. There were no last goodbyes as Dellis rushed out the door."}, {"tag": "h3", "text": "Prisoner"}, {"tag": "p", "text": "Tantor may never have even come near Ruul before he was seized. Though he had expected execution, Tantor was imprisoned in a dungeon full of political prisoners in the basement of the Imperial Palace on Coruscant."}, {"tag": "p", "text": "Meanwhile, Brenn, deeply troubled by his brother's accusations, grew increasingly conflicted. Shortly after their discussion, Brenn refused Brashin's orders to massacre a camp full of innocent refugees on Abridon. Furious, Brashin ordered Brenn to report to Kalaan for disciplinary action. In the same message, he told Brenn the news that he had been dreading: Dellis had been killed on his way to Ruul."}, {"tag": "p", "text": "Brenn managed to defect to the Rebel Alliance, but Dellis's purported death continued to haunt him. More than three years after their last conversation, Brenn received the most pleasant surprise of his life."}, {"tag": "p", "text": "Now a New Republic general, Brenn commanded the final assault on the Imperial Palace. His troopers poured through the Palace, finally coming across a dungeon full of political prisoners. Tantor was freed and brought to the attention of his brother, who, overjoyed, met him in an emotional reunion inside the Palace. Walking onto the steps of the Palace, they met General Tyr Taskeen, who welcomed Tantor to freedom with the words, \"Welcome to the next chapter in the history of the galaxy\"."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dellis Tantor began his Imperial career as an eager and idealistic student. Determined to become a stormtrooper, he remained upbeat in the face of disappointment when he was refused. However, he was not unrealistic, accepting as time wore on that he would not gain admission to the corps. Instead, he was willing to compromise and serve in Imperial Intelligence or the ISB."}, {"tag": "p", "text": "Tantor was temporarily reprieved when his brother was promoted and he was allowed to serve under Brenn. Though the brothers enjoyed working together, the pair were split up with Dellis's transfer to Imperial Intelligence after Sarapin. Tantor was apparently given reason to become suspicious of the Empire, as he felt driven to investigate the circumstances of his father's death."}, {"tag": "p", "text": "With the results of that inquiry, his faith in the Empire, which had begun so strong, was shattered. Now a target of the government he served, he was determined to get the information safely to Brenn. With that done, however, he appeared resigned to his fate, perhaps trying to put as little scrutiny as possible on his brother, in keeping with his intense fraternal loyalty."}, {"tag": "p", "text": "Tantor was extremely skilled with computers and communication equipment, frequently operating as a slicer on his missions, recovering data and breaking codes. Presumably, this remained his specialty in his Intelligence service. However, he was not merely a computer nerd, retaining impressive combat skills, fit for stormtrooper service."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Force Commander, Dellis Tantor was voiced by Raphael Sbarge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}