{"url": "Delphanian", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Delphanians", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Delphanian"}, {"tag": "p", "text": "The Delphanians were a sentient species noted for their scaly, claw-like hands and bellows-shaped noses. They came from the Delphania system, where they noted various tribal identities by piercing their protuberant lips. Delphanians sometimes added extra piercings after defeating a rival; in combat, their hands became dangerous slashing weapons. Delphanians were among the prisoners kept aboard the Imperial prison barge Purge in 1 BBY. Some of these imprisoned Delphanians formed the Delphanian Face Gang, headed at one point by Aur Myss."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "At the front of the Delphanian skull, the species' face featured a nose that resembled a flattened, fuzzy bellows, a chin, and flabby lips around the mouth. The skull lay atop a neck. Delphanians had feet and were quick runners. At the end of their limbs, Delphanians had scaly hands that looked like broad, flat claws. They could use these to grasp objects or make a fist, but these manipulators doubled as deadly slashing weapons in combat. Some Delphanians had a rotund physique."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Delphanians were sentient, dividing themselves into various tribes, membership in which was indicated by metal lip piercings. The Delphanian Aur Myss added new piercings whenever he defeated a rival; the conglomeration jangled when he spoke. Delphanian laughter sounded like a hiss or plash to other species. At least some Delphanians could understand and speak Galactic Basic Standard, although they had their own language, known as Delphanian, which they could read and write. An injured Delphanian screeched in pain, and an amused one giggled. At least some Delphanians wore boots."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Delphanians hailed from the Delphania system in the Esuain sector of the Mid Rim. Their region of space had been reached and explored by outsiders by 4000 BBY. By 3956 BBY, their system fell within territory controlled by Darth Revan as part of his Sith Empire. However, by 1004 BBY, the region was considered part of the Galactic Republic. By 9 ABY, after the fall of the Galactic Empire, the Delphania system had fallen within the Borderland Regions, an area where loyalties were split between the New Republic and the remnants of the Empire. In 137 ABY, the Delphania system fell within territory controlled by Darth Krayt as part of his Galactic Empire."}, {"tag": "h2", "text": "Delphanians in the galaxy"}, {"tag": "p", "text": "By 1 BBY, several Delphanians were incarcerated aboard the Imperial prison barge Purge, where some of them joined the Delphanian Face Gang. That year, Aur Myss had risen to become the leader of the group. Myss's face boasted a perpetual, cockeyed smirk, although other prisoners disagreed as to whether it was a genetic flaw or the result of an accident. Delphanian thugs followed Myss about the ship. Myss eventually came down with a sickness. When he frantically attacked the Human brothers Trig and Kale Longo, the latter killed him with a knife to the back of the skull. Myss's body became reanimated as a zombie sometime later and followed the brothers onto the Star Destroyer Vector. When this undead Delphanian attacked Trig Longo, the Human leapt into a chasm; a hovercraft saved the Human, but the Delphanian zombie fell into the abyss."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Joe Schreiber created the Delphanians for his novel Death Troopers, published by Del Rey in 2009. The species and its associated Delphanian Face Gang act as minor antagonists to the story's two Human leads, Kale and Trig Longo. Death Troopers indicates that an individual named Sixtus Cleft had been the leader of the Delphanian Face Gang until his murder paved the way for Myss to take over. Despite Cleft's participation in the organization, the novel never explicitly identifies his species. Authors Jason Fry and Daniel Wallace later placed the Delphanian home system in the Star Wars: The Essential Atlas Online Companion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}