{"url": "Delphi_Kloda", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Individuals of unspecified species", "Category:Kanjiklub members", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Delphi Kloda"}, {"tag": "p", "text": "Delphi Kloda, also known by the moniker Narglatch, was a male pirate who served as Tasu Leech's right hand man in Kanjiklub until injuries forced him to retire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Opening a combat school on the planet Chaaktil, he taught combat openly in his gym, and espionage in secret below the establishment. While running the gym, he adopted a young girl calling herself Bazine Netal from a Chaako City orphanage and began training her to be the perfect weapon, secretly killing anyone she became attached to so that they could not hold her back. He sent her on several errands and missions, until eventually she began working independently as a mercenary, leaving him to run his school."}, {"tag": "p", "text": "After six years of absence, decades after the Battle of Endor, Netal returned to Kloda in order to borrow his Gauntlet fighter, the Sparrowhawk, for her latest job, which was to recover a steel case from the retired the stormtrooper Jor Tribulus. Kloda knew of the suitcase, however, and had been aiming to retrieve it for some time, as its contents would allow him to claim a large score. Not letting his protégé know this, he agreed to let her take the Sparrowhawk if she took Orri Tenro, one of his trainees who asked too many questions, with her. He then tracked the Sparrowhawk's location to the planet Vashka and followed Netal there, confronting her just as she recovered the case from Tribulus' long-dead corpse."}, {"tag": "p", "text": "Revealing that he had always planned to use her as a patsy, Kloda took the case and sealed Netal inside a wax cell made by insectoid Vashkan apidactyls, so that she could not follow him. The mercenary managed to free herself and catch up to her old mentor as he made his escape on a narglatch. Knocking him from his mount, she strangled him for betraying her and shot the narglatch, taking the case from its corpse."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Delphi Kloda first appeared in the short story \"The Perfect Weapon,\" which was written by Delilah S. Dawson and published as an eBook in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}