{"url": "Delrakkin/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Empire planets", "Category:Kallea sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Delrakkin"}, {"tag": "p", "text": "Delrakkin was the only planet in the Delrakkin system capable of sustaining life. Home to the reptilian Delrakkin, the world was covered with mountain ranges and jungles, as well as a perpetual cloud cover that provided it with incessant storms and rain. Delrakkin City was the only civilized location on the planet and was home to the Delrakkin, until the Galactic Empire invaded."}, {"tag": "p", "text": "The Imperials expelled the Delrakkin from their city and populated it with their own citizens. In 0 ABY, the planet nearly became the subject of an Imperial experiment devised by Grand Moff Wilhuff Tarkin. Tarkin planned to use the planet as a test bed for new interdictor technology, which was to be developed in the utmost secrecy. To that end, he ordered Admiral Termo to eradicate the planet's populace, providing at least two plots, one of which would have the Rebel Alliance framed for the act. This was not to be, however, as the scheme was foiled by the evacuation of the intended targets organized by the Rebellion."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Delrakkin was located within the Delrakkin system, which was at the end of a hyperlane that led to the Outer Rim Territories. It shared the system with two other planets, but was the only one to sustain life."}, {"tag": "p", "text": "Apart from Delrakkin's constant storms, its climate was very similar to that of Thyferra. The tumultuous weather was referred to as Delrakkin's greatest natural resource by some, and it was so dangerous that most of the planet's natives lived underground. The storms caused perpetual, unrelenting rain on the planet. The only place considered civilized was Delrakkin City, which was situated on a high mountain, above the clouds and storms. In addition to the mountain that was home to Delrakkin City, the planet featured several other vast ranges, pockmarked with caves, which were occasionally used for shelter by the natives. Apart from its mountains, Delrakkin was covered with large jungles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Delrakkin was considered a good place to hide by smugglers, until the Galactic Empire invaded, forcing the Delrakkin out of Delrakkin City. The Imperials tolerated the native presence, on the condition that they not enter their city. Instead, Delrakkin City was populated by Imperial citizens. During the Imperial Period, groups of Stenax immigrated to Delrakkin after their homeworld of Stenos was also invaded by the Empire. The purpose of the Stenax on Delrakkin was to survey whether or not the planet was a candidate for conquest, as they were doing simultaneously on worlds such as Kabray, Cilpar, and Keyorin. To make the most out of their reconnaissance, the Stenax also examined the technology of the Delrakkins."}, {"tag": "p", "text": "In 0 BBY, Delrakkin became the target of a scheme initiated by Grand Moff Wilhuff Tarkin. It was Tarkin's plan to use Delrakkin as a testing bed for new interdictor technology, which could be used to pull ships from and prevent them from reentering hyperspace. Delrakkin was chosen due to its location at the end of a hyperlane. Since the development was to be top secret, he ordered his subordinate, Admiral Termo of the Imperial II-class Star Destroyer Liquidator, to maintain a presence in the system, until the Death Star arrived. The battlestation was carrying a shipment of poisoned bacta large enough to facilitate the extermination of the whole populace, which would be supplied to Delrakkin City's medical centers. Within days, the populace would be eradicated, allowing Tarkin to operate in secrecy."}, {"tag": "p", "text": "However, the Death Star did not arrive due to its destruction at Yavin 4, leaving Termo to pursue Tarkin's secondary plan. Captain Skeezer, one of Tarkin's agents, had disguised himself as a Rebel and, with the aid of the natives, had planted alazhi, a vital ingredient in the production of bacta, on the planet, claiming that the Alliance was attempting to create their own bacta supplies on Delrakkin. The natives had believed Skeezer, making Termo's work easier. He ordered his troops to attack Delrakkin City, asserting that the citizens had consorted with the Alliance and had been planting alazhi without authorization. Providing his unwitting troops with Alliance starships, he hoped to have Delrakkin City totally razed, with any survivors pinning the massacre on the Rebels themselves."}, {"tag": "p", "text": "The Millennium Falcon, flown by Alliance sympathizers Captain Han Solo and Chewbacca, arrived in the Delrakkin system during the faux Rebel attack. Its passengers, Luke Skywalker, Leia Organa, C-3PO, R2-D2, and Q-7N, were all members of the Alliance, and together, the group decided to save Delrakkin's inhabitants from disaster, and the Alliance from public shame. Utilizing a BTL Y-wing starfighter and the aid of native Delrakkin Untrilla and Gwann, the Imperial attack was fought off, and the Liquidator driven out of the system, forcing the Imperials to look elsewhere for testing grounds."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Delrakkin was populated by a reptilian, green-skinned species of the same name. Their culture was a violent one, with trust established through tests of one-on-one combat. Following their eviction from Delrakkin City by the Empire, the planet's natives chose to live underground, keeping themselves safe from the planet's constantly violent weather. Immigrants lived in Delrakkin City, far away from the natives atop a high mountain. The Imperials kept a garrison of troops and TIE/LN starfighters on the planet, to maintain the peace and ward off any unwelcome intruders."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Delrakkin City"}, {"tag": "p", "text": "Delrakkin City was situated atop a tall mountain, above the planet's stormy cloud cover. Built by the Delrakkin, the planet was home to Imperial citizens following the Galactic Empire's invasion of the planet. As a line of defense, a large ion cannon was installed in the side of the mountain. A large tower supplied the settlement with power, although its destruction would potentially spell doom for the entire populace. The city was made up of towering skyscrapers which were severely damaged in a faux Alliance attack on the city by the Imperials in 0 ABY. Just south of the city was the Stiegan Jungle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Delrakkin first appeared, briefly, in Ryder Windham's role playing novel Star Wars Missions 1: Assault on Yavin Four. The planet would go on to appear fleetingly in the first arc of Star Wars Missions until Star Wars Missions 3: Attack on Delrakkin, where it served as the primary location for the story. In 2000, it was mentioned in passing in Rich Handley and Joseph Bongiorno's article, The University of Sanbra Guide to Intelligent Life: The Marvel Series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}