{"url": "Delta-12_Skysprite-class", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Republic starfighter classes", "Category:Kuat Systems Engineering products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Delta-12 Skysprite-class"}, {"tag": "p", "text": "The Delta-12 Skysprite was a two-being starfighter/transport developed by Kuat Systems Engineering for civilian use, and use by the Jedi Order."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Designed by Kuat Systems Engineering using the same hull as the Delta-7 Aethersprite-class starfighter, the Delta-12 was a long-range reconnaissance fighter developed with an elongated cockpit to fit two individuals. The Skysprite was a wedge-shaped starfighter like the Delta-7 model. The Delta-12 featured no onboard hyperdrive, though the Skysprite could link up with a Syliure-31 long-range hyperdrive module to reach lightspeed. The model featured no weaponry so that it could be more easily marketed for civilian sales. Because of the storage space and limited amenities, the Jedi Order made use of the model as VIP couriers. With more advanced shield technology, strong armor, and a powerful sensor suite, the starfighter was an upgrade from the original Delta-12. Despite not being equipped with weapons, the internal systems built into the Delta-7 remained in the Delta-12 and could easily be utilized to weaponize the ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Developed in the decade preceding the Clone Wars, one of these starfighters was carried aboard Outbound Flight when the project launched in 27 BBY. It was intended for the use of Obi-Wan Kenobi and Anakin Skywalker, who planned to stay aboard Outbound Flight until its arrival at the Unknown Regions and then use it to return to Coruscant. However, they were forced to leave earlier aboard a shuttle with Supreme Chancellor Palpatine, and in the process left the Delta-12 aboard the doomed vessel. Around ten years after the Clone Wars, Kuat Systems Engineering sold the entire Delta line to Sienar Fleet Systems.[source?]. By the time of the Galactic Civil War, the Delta-12 was exceedingly rare and hard to come by."}, {"tag": "p", "text": "Perhaps the last of its class, the Delta-12 abandoned onboard Outbound Flight was rediscovered forty-nine years after the launch of the project by Luke and Mara Jade Skywalker. The two Jedi Knights used the Delta-12 to breach a Dreadnaught cruiser captured by the deadly Vagaari."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}