{"url": "Delta-7_Aethersprite-class_light_interceptor/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starfighter classes", "Category:Delta-7 Aethersprite-class light interceptors", "Category:Galactic Republic starfighter classes", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Delta-7 Aethersprite-class light interceptor"}, {"tag": "p", "text": "The Delta-7 Aethersprite-class light interceptor, more commonly known as the Delta-7 Aethersprite light interceptor or Jedi starfighter due to its extensive use by Jedi, was an interceptor commissioned just before the outbreak of the Clone Wars in 22 BBY."}, {"tag": "p", "text": "The starfighter was considered highly advanced at the time of its creation and carried sophisticated equipment, but it was expensive to produce. The ship was armed with two twin laser cannons (later models modified by Jedi Master Saesee Tiin would contain four quad-pulse laser cannons hidden behind breakaway panels, in addition to its usual complement of two twin laser cannons), and an advanced communication and sensor array kept the pilot of the ship well-prepared in firefights as well as peacetime."}, {"tag": "p", "text": "The Delta-7 fighter was fairly prominent in the Clone Wars, mainly due to its use by Jedi. One of the most famous encounters and tests of the Delta-7 was the tracking of bounty hunter Jango Fett by Jedi Knight Obi-Wan Kenobi through the asteroid fields of Geonosis."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Due to their visual similarities, the Delta-7 appeared to be an evolutionary descendant from the ancient Aurek-class starfighter: it was a small, sleek interceptor used by the Jedi Knights for reconnaissance missions. However, the starfighter was fitted with two twin-barrel laser cannons allowing the pilot to fight when necessary. As part of the Republic's Judicial Department, the starfighters owned by the Jedi Order were colored in the red and white hues that represented the diplomatic immunity that the Jedi enjoyed, similar to Republic Cruisers. However, some would be painted in other colors as the Clone Wars progressed."}, {"tag": "p", "text": "It was designed by engineer Walex Blissex, who would later design the Alpha-3 Nimbus-class V-wing starfighter and work on the Rebel Alliance's RZ-1 A-wing interceptor with Jan Dodonna. Due to limitations in technology at the time of its creation, the starfighter's size did not allow for a built-in hyperdrive, and instead had to rely on other spacecraft or an external hyperdrive docking ring for faster-than-light travel. (However, at the time of its creation, there were also some prototype Delta-7 Aethersprites constructed that had experimental hyperdrive engines built-in. In addition to this, the standard factory-model Aethersprite could be modified and/or tweaked to have a built-in hyperdrive engine). The Aethersprite also had very powerful sublight engines, driving it to a maximum acceleration of 5,000 G."}, {"tag": "p", "text": "The very first models of Aethersprite  would not allow for a full-size astromech droid navigator, as next-generation starfighters, such as the T-65 X-wing, would commonly use (most likely due to the fact that, because of the Aethersprite's design and its hull's thinness, a full-size astromech socket wouldn't fit). Instead, the astromech droids were integrated directly into the starfighter, with only the truncated droid's head visible. At least two models of these droids were used, the R3-D, which was used primarily for targeting (needed because the starfighter was so fast that most pilots would not be able to fire correctly and/or accurately), and the R4-P, which was used more for navigation than targeting. Later though, a newer model of Aethersprite, the Delta-7B, would allow for a factory-model astromech-droid navigator."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Clone Wars"}, {"tag": "p", "text": "The Delta-series predated the Jedi's use of the Delta-7, which began testing at around 27 BBY, and came into service shortly before the Clone Wars. The Delta-6 Sprite-class starfighter was used around the time of the Invasion of Naboo, and the Delta-12 Skysprite was released on the civilian market following the launch of the Outbound Flight project; it would seem that this starfighter was also tested by the Jedi as Obi-Wan Kenobi flew one himself just before the launch."}, {"tag": "p", "text": "Saesee Tiin, not pleased with the vessel's already impressive performance, modified a pair of the starfighters to better suit his needs. He managed to increase the starfighter's weaponry by adding four quad-pulse laser cannons to its usual complement of two dual cannons, which were fitted behind breakaway panels until the pilot chose to enter \"fight mode\"; this was only done when it was deemed absolutely necessary. In addition to these weapons, Tiin also managed to fit a small Class 3 hyperdrive of his own making, negating the need for a hyperdrive ring unless time was of the essence. He also replaced the regular pilot seat with a more comfortable meditation chair, allowing for a Jedi to enter into their meditations much more easily during long hyperspace journeys."}, {"tag": "p", "text": "Jedi Master Adi Gallia flight-tested one of these Delta-7 prototypes when faced with Captain Cavik Toth and his Trihexalon fleet, taking it to the Karthakk system shortly before the Battle of Geonosis. It was here that she also learned to use several Force powers in conjunction with the starfighter, both offensive and defensive. The resounding success of this mission meant that many of the existing Delta-7s were modified to Tiin's specifications."}, {"tag": "p", "text": "Obi-Wan flew the other of these prototypes on his mission to Albecus, also shortly before the Battle of Geonosis, and was attacked by Jango Fett in his Slave I en route. He managed to fight him off thanks to the hidden weaponry and continued on his journey; it seems that the next time Kenobi faced Fett, he was in a regular Delta-7. It is possible that the result would have been very different if he had been in the same prototype."}, {"tag": "p", "text": "Stationed in the hangar bays of the Jedi Temple on Coruscant and other facilities, Aethersprites were assigned to all field Jedi. General-use starfighters were colored in turquoise, and starfighters coded for use by specific Jedi were colored red.[source?] Other hues emerged due to individual customization during the Clone Wars. Anakin Skywalker extensively modified Azure Angel, adding large turbine engines, an internal hyperdrive, and a paint scheme reminiscent of that used on his podracer on Tatooine. Some Delta-7s even included a bomb chute in the rear or a forward seismic charge launcher, although these were rare."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "More extensive deviations from the standard Delta-7 also existed, and unlike Anakin's personal craft they were available in limited numbers from Kuat Systems Engineering. Jedi wishing to avoid clashes with enemy forces sometimes used a high-speed variant. This version of the fighter featured greatly enhanced acceleration as well as an increase in maximum velocity from 1,150 kilometers per hour to 1,260 kilometers per hour. On the opposite end of the spectrum, Jedi expecting to engage in heavy dog-fights would often employ the Delta-7s high-maneuver variant. Modified using advice collected from various Jedi pilots (including Anakin Skywalker and Plo Koon), the high-maneuver version of the ship was known to aggravate droid starfighters during combat."}, {"tag": "p", "text": "As Delta-7s were lost in battle, they were replaced by Delta-7Bs. The main modification of the 7B series was that the droid socket was centered. This allowed unmodified, detachable astromechs (R2 series and higher) to be used. This move was popular amongst most Jedi, and the trait was carried on to the Eta-2s. Plo Koon also flew a Delta-7B."}, {"tag": "p", "text": "Towards the end of the Clone Wars, manufacturer Kuat Drive Yards developed a more refined starfighter— the Eta-2 Actis-class interceptor— based on experience gained from the Delta-7 Aethersprite. These fighters were used in large numbers during the Clone Wars, including the Battle of Coruscant. A number of Delta-7 starfighters remained in use by the Jedi after the introduction of the Eta-2, including Plo Koon's personal starfighter, as he preferred the Delta-7 to the point that he continued to use it until his death at Cato Neimoidia. Several years after the Clone Wars ended, Kuat sold the entire Delta line to Sienar Fleet Systems. Afterwards, the Delta-7 would be phased out."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Wedge Antilles would later retrieve an abandoned Delta-7 after his X-Wing crash-landed on Geonosis sometime after the Battle of Hoth in the Third Battle of Geonosis during the Galactic Civil War. As he needed a way to escape the planet after being attacked by a Republic gunship piloted by Sarkli, the exterior was relatively undamaged, and his R5 unit repowered it. Afterwards, he utilized its Void-7 seismic charges to destroy two Storm Commando-owned Imperial escort carriers, and also eliminating several squadrons of Tie bombers, Tie Interceptors, and Tie fighters before promptly retreating alongside the Rebels via a hyperspace ring. It was later stored in a starfighter hangar."}, {"tag": "p", "text": "The design of the Delta-7 later evolved into the R-22 Spearhead and the RZ-1 A-wing interceptor of the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Delta-7 Aethersprite-class light interceptors first appeared in 2002 with the release of Star Wars: Episode II Attack of the Clones and its tie-ins."}, {"tag": "p", "text": "The starfighter was originally conceived as a \"Stormtrooper Fighter\", which would have linked both the Prequel and Original trilogies together."}, {"tag": "p", "text": "Jedi starfighters appear in the 2002 video game Star Wars: Galactic Battlegrounds: Clone Campaigns. They are the Galactic Republic special units and are produced at Fortresses."}, {"tag": "p", "text": "In Star Wars: Episode II Attack of the Clones Obi-Wan's starfighter's in-cockpit display screen displays information using the Star Wars '76 script, not Aurebesh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}