{"url": "Delta-class_DX-9_stormtrooper_transport", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Delta-class DX-9 stormtrooper transports", "Category:Galactic Empire starship classes", "Category:Troop transport classes"], "nodes": [{"tag": "h1", "text": "Delta-class DX-9 stormtrooper transport"}, {"tag": "p", "text": "The Delta-class DX-9 stormtrooper transport was an assault vehicle, built by Telgorn Corporation, which was designed to carry Imperial stormtroopers into battle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Delta-class DX-9 was armed with eight KT4 laser cannons, four ion cannons, and two projectile launchers that were usually loaded with proton torpedoes. These weapons allowed the DX-9 to disable and board targets with light to moderate defenses. Very strong shielding, particularly forward of the vessel, allowed the transport to weather considerable resistance from its targets. A universal docking mechanism allowed the DX-9 to attach itself to most ships, and, if necessary, the transport could also bore its own hole into the enemy hull."}, {"tag": "p", "text": "The DX-9 only had weapons on its forward arc, and was not very maneuverable, so it was vulnerable to starfighter attacks. These transports were usually deployed with fighter escorts or as part of a larger assault force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The stormtrooper transport saw a great deal of action during the Galactic Civil War, not only for boarding operations and deploying troops into battle, but also as a personnel transport for use between starships. It also could be used to resupply bombers and repair other craft. Omega and Sigma were notable Imperial teams of DX-9s that participated in many missions."}, {"tag": "p", "text": "Although designed for the Galactic Empire, many DX-9s were also often used by other factions, most notably the Rebel Alliance."}, {"tag": "p", "text": "The Empire eventually developed a successor to the Delta-class, the Gamma-class ATR-6 assault transport. The larger ATR-6 lacked frontal laser cannons, instead having laser turrets to cover firing arcs that were blind spots on the DX-9. The Imperial Navy continued to use the Delta-class for most assault and boarding operations, turning to the Gamma-class if especially heavy opposition was expected. A further development was the Beta-class ETR-3 escort transport, which combined the DX-9's frontal weaponry with the ATR-6's turrets."}, {"tag": "p", "text": "In 6 ABY, one of these transports was deployed by the forces of Admiral Devlia, based on Vladet, against Rogue Squadron's base on Talasea. Following the failure of that surprise covert assault, the transport was captured by New Republic forces. In 10 ABY during the Battle of Altyr V, DX-9s deployed stormtroopers against the New Republic base on Altyr V."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: TIE Fighter, the DX-9 is known as simply the Transport or TRN. However, official strategy guides have referred to it as the Stormtrooper Transport to avoid confusion with other craft with similar functions, and it adopted the latter name for later titles in the series."}, {"tag": "p", "text": "In Star Wars: TIE Fighter (as well as Star Wars: X-Wing vs. TIE Fighter and Star Wars: X-Wing Alliance), the Aurebesh symbols \"NGC\" are found on the backside of the ship."}, {"tag": "p", "text": "An unidentified ship greatly resembling the DX-9 transport appeared in the Star Wars Annual 1, a canon one-shot comic published by Marvel Comics on December 9, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}