{"url": "Delta-class_shuttle", "categories": ["Category:Legends articles", "Category:Assault shuttle classes", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Delta-class shuttle"}, {"tag": "p", "text": "The Delta-class shuttle was a shuttle model used by the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Delta-class shuttle had stubby wings near the end of the fuselage. The ship had three engines. The main engine was located on top of the hull, while the other two engines, used for vertical take-off/landing (VTOL) were located at the bottom, near the cockpit and the wings."}, {"tag": "p", "text": "The shuttle had a crew of at least two, although one person was enough to operate the ship. The Delta-class could carry at least eight passengers, usually stormtroopers. The crew and passengers could disembark via a door at the rear of the ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One such shuttle was used by an Imperial team searching for the Rebel spy Yom Argo who crashed on the Mid Rim planet Lahsbane. The shuttle was later stolen by the Zeltron Dani, who made off with a great haul of Huhk treasure from the Forbidden City."}, {"tag": "p", "text": "Another one of these shuttles was part of an Imperial supply convoy that was involved in a skirmish near Kaellin III and was forced to crash-land on the planet. The stormtrooper complement fought against the natives before they were rescued by the Rebel Alliance."}, {"tag": "p", "text": "In 23 ABY these shuttles were considered old and the New Republic had begun the dismantling of several ex-Imperial Delta-class shuttles on Coruscant. Han Solo acquired one of the shuttles non-functioning hyperdrives and gave it as a present to his daughter Jaina at the Jedi Praxeum on Yavin 4. After Jaina had brought it into a working state, it was later used by marooned Imperial pilot Qorl to escape the planet in his TIE/LN starfighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}