{"url": "Delta-class_JV-7_escort_shuttle", "categories": ["Category:Legends articles", "Category:Assault shuttle classes", "Category:Delta-class JV-7 escort shuttles", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Delta-class JV-7 escort shuttle"}, {"tag": "p", "text": "The Delta-class JV-7 escort shuttle, simply known as the escort shuttle, was an armed personnel transport manufactured by Cygnus Spaceworks."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A derivative of the Lambda-class family, the JV-7 was designed to correct some weaknesses in the original Lambda design. The craft boasted a higher top speed, and maneuverability was also improved. It had 20% more shield power and a significantly stronger hull than the Lambda-class."}, {"tag": "p", "text": "The aft firing arc was covered by a dual turbolaser turret, making it extremely dangerous to pursue this ship. The JV-7 was also equipped with a pair of concussion missile launchers, like the related Sentinel-class landing craft."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The class was first seen in use sometime around the Battle of Hoth."}, {"tag": "p", "text": "Important Imperial officers tended to prefer the JV-7 over the Lambda-class, especially for transport through contested space. In addition to its personnel transport duties, the JV-7 was regularly employed in escort duties, earning it the classification of \"escort shuttle.\""}, {"tag": "p", "text": "As with many craft of the Imperial Navy, the JV-7 eventually fell into the hands of the Rebels and some pirate groups. They were used by the Mugaari, and by both combatants in the Sepan Civil War."}, {"tag": "p", "text": "At least one escort shuttle fell into the hands of the Imperial splinter faction known as the \"hard-liners\" stationed on the planetoid RZ7-6113-23. The shuttle was stolen by the bounty hunter Kir Kanos during his escape from the hard-liners' ship storehouse."}, {"tag": "p", "text": "In 23 ABY, ex-Imperial Delta-class shuttles were being scrapped by the New Republic. Han Solo acquired the hyperdrive from a ship of this class on Coruscant, and gave it as a present to his daughter Jaina at the Jedi Praxeum. It was later used by marooned Imperial pilot Qorl to escape Yavin 4 aboard his TIE/LN starfighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the games that feature the Delta-class, the Lambda-class was toned down. It lacks the potently deadly rear turret, has less armor and shields, and a slower speed than the Delta. The Delta, however, has made few appearances outside of the games."}, {"tag": "p", "text": "Kir Kanos uses a Delta-class JV-7 escort shuttle in Crimson Empire III: Empire Lost 3 but it appears as a Nu-class attack shuttle in Empire Lost 4."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}