{"url": "Demnadi", "categories": ["Category:Legends articles", "Category:Far Xandil sector", "Category:Galactic Empire planets", "Category:Mid Rim planets", "Category:Trailing Sectors planets"], "nodes": [{"tag": "h1", "text": "Demnadi"}, {"tag": "p", "text": "Demnadi was a Mid Rim planet located in the Far Xandil sector. During the Galactic Civil War, a planet-wide riot, believed by the Imperial Governor Cathers to have been instigated by local Rebel Alliance factions, erupted at Demnadi. In response, the Empire dispatched the CompForce Demnadi Relief Operation, which consisted of just one man, Major Fenris Sarhl, to pacify the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Demnadi was a planet located in the Demnadi system, a part of the Far Xandil sector in the Trailing Sectors portion of the Mid Rim."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet was a part of the Galactic Empire, and it was the site of the office of the local Imperial Governor Cathers. During the Galactic Civil War, several factions affiliated with the Rebel Alliance operated at Demnadi, and at some point, a planet-wide riot, believed by Cathers to have been instigated by the Rebels, erupted there. The rioters mounted an attack on Cathers' office, although the governor himself was not present at the time."}, {"tag": "p", "text": "In response to the communication Cathers sent about the riot, the Empire dispatched a regiment to pacify the planet. The force included the CompForce Demnadi Relief Operation, which consisted of just one man, CompForce Major Fenris Sarhl. Sarhl introduced himself to Cathers in the latter's office, whereupon the governor expressed his delight at the Imperial relief efforts assigned to Demnadi. However, when Sarhl revealed that he was the only person dispatched as part of the CompForce Demnadi Relief Operation, Cathers became confused, to which the CompForce major replied that Cathers' communication had mentioned that Demnadi was experiencing \"only\" one riot at the time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Demnadi appeared in \"Just One Planetary Riot!,\" a short companion narrative included in Heroes & Rogues, a 1995 sourcebook written by Paul Sudlow and Rick Stuart for West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Demnadi system, and therefore the planet Demnadi, in grid square P-16."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}