{"url": "Democracy", "categories": ["Category:Canon articles", "Category:Stub", "Category:Incomplete lists", "Category:Systems of government"], "nodes": [{"tag": "h1", "text": "Democracy"}, {"tag": "p", "text": "Democracy was a system of government in which elected officials, such as senators or representatives, represented their constituents as members of the governing body of a state, such as the Galactic Senate. The Galactic Republic was the democratic union that governed the galaxy for a thousand years before the Clone Wars, with senators representing their respective homeworlds and their sectors in the Republic Senate."}, {"tag": "p", "text": "The rise of the fascist Galactic Empire effectively ended the rule of democracy on the galactic level. However, the self-anointed Galactic Emperor Sheev Palpatine tolerated the continued existence of the Senate—reformed as the Imperial Senate—for two decades in order to maintain control over the thousands of star systems that composed the Empire. Following the completion of the first Death Star in 0 BBY, the Emperor formally dissolved the Senate and transferred control of the Empire's territories to the regional governors. As a result, the last remnant of the democratic Republic was removed from the Empire."}, {"tag": "p", "text": "During the Age of the Empire, the Alliance to Restore the Republic was formed as a rebellious movement against the Emperor's rule. The Alliance's primary objective was to achieve the overthrow of the Empire and the restoration of democracy, consequently resulting in the outbreak of the Galactic Civil War. By the war's end in 5 ABY, the Emperor was dead and his Empire shattered into various political and military remnants. The Alliance reorganized itself as the New Republic and revived democracy through the restoration of the Galactic Senate. However, not all inhabitants of the galaxy were swayed back to democracy, as the Galactic Civil War hardened many hearts, something which eventually led to the formation of the First Order, which wanted to revive the Empire's false glories."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}