{"url": "Demonsquid", "categories": ["Category:Legends articles", "Category:Creature stubs", "Category:Aquatic creatures", "Category:Cephalopods", "Category:Creatures of Aquaris", "Category:Creatures of unspecified diet", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Demonsquid"}, {"tag": "p", "text": "The demonsquid was an eight-armed mollusk native to the planet Aquaris, with large jaws beneath its clump of arms. It was a particularly vicious aquatic predator that attacks anything that comes near its den. Its tentacles were powerful enough to slowly crush anyone caught in its grasp as well as easily shatter an aquaskimmer. However, its weak point was its brainsac on the back of its head, with a direct hit from the onboard weaponry from an aquaskimmer being sufficient enough to kill it. In addition, impaling one of its tentacles with either stun blasts or a sufficiently jagged object is enough to force it to release its prey, although the latter ran the risk of having it pursue those who impaled it with rage."}, {"tag": "p", "text": "The treacherous Aquaris Freeholders second-in-command Kraaken had a demonsquid play a role in trying to dispose of a stun-shot Luke Skywalker. Although he claimed the idea was to have Silver Fyre gain the trust of the Rebels to allow them to join the Rebels, and also made it seem as though he'd accompany Luke, in reality it was to act as a distraction while he tried to steal the data stored on R2-D2 (which Han used as bait to draw him out). After Fyre, to prove she had indeed changed, proceeded to blast the demonsquid before it could successfully devour the aquaskimmer, although it nonetheless did enough damage to shatter it, causing Han to escape and rescue Luke. After successfully rescuing Luke, however, the demonsquid proceeded to grab Han and attempt to crush him between its tentacles, although Chewbacca, Han's first mate of the Millennium Falcon, proceeded to save them both by using a jagged portion of the wreckage to impale the squid's tentacle, forcing it to release them, although it proceeded to chase them in fury. Since it was no longer focused on Silver Fyre's aquaskimmer, she then directed a clean shot on the brainsac of the demonsquid, instantly killing it and causing it to sink to the abyss."}, {"tag": "p", "text": "Aside from that particular one, Silver Fyre when explaining her plan to \"save\" Luke to gain his trust implied that demonsquids were one of several prevalent threats to the Aquaris Freeholders' base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The demonsquid, in appearance, is very similar to the real-world octopus. The main difference lies in the lack of a beak, on the demonsquid's part, in favor of a pair of stereotypical predatory jaws.\nIn the novel \"I Jedi\", the Demonsquid is mistakenly claimed to come from the planet Mon Calamari (Dac) instead of Aquaris."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}