{"url": "Denal-zon", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Coruscant Security Force officers", "Category:Males", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Denal-zon"}, {"tag": "p", "text": "Denal-zon was a Zabrak male police officer with the Coruscant Security Force who attained the rank of captain by the time of the Cold War between the Galactic Republic and the reconstituted Sith Empire. Around 3643 BBY, he was the investigating officer of a theft of computer chips belonging to Senator Doli-bur Barc. Denal-zon discovered that the chips were to be used for Rylothian slave collars and that they had been stolen by the Migrant Merchants' Guild crime gang."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Denal-zon, a Zabrak male, served on his homeworld of Coruscant as a police officer with the Coruscant Security Force. By the time of the Cold War between the Galactic Republic and the resurgent Sith Empire, he had achieved the rank of captain in the Coruscant Security Force. In 3643 BBY, Denal-zon was assigned to investigate the theft of several valuable computer chips belonging to Senator Doli-bur Barc. After beginning his investigation, he discovered that the chips were designed to power Rylothian slave collars. He also discovered that the chips had been stolen by members of the Migrant Merchants' Guild criminal gang. With the CSF at war with the Guild in an attempt to push them out of Coruscant's Old Galactic Market sector, Denal-zon was unable to retrieve the collars and the investigation subsequently stalled. However, since slave collars and the chips that powered them were illegal in the Republic according to Republic Law 44-12, Denal-zon felt little sympathy for the Senator's plight."}, {"tag": "p", "text": "After Denal-zon's police investigation stalled, Heerimus, Senator Barc's representative, asked a Republic individual to try to solve the case and relocate the chips. The individual spoke with Denal-zon and was informed of the details of the case. They then managed to fight their way into the Old Galactic Market area controlled by the Guild. There, the individual recovered the chips and later turned them over to Denal-zon, who proceeded to destroy them."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Denal-zon was a Zabrak with green eyes and orange and brown skin. He firmly believed in the importance of regulations and the rule of law, which he would often quote. His belief in the law also added to his strong sense of right and wrong, which he refused to compromise on."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Denal-zon appears in \"The Senator's Stolen Goods\" mission in Star Wars: The Old Republic, a massively multiplayer online roleplaying game (MMORPG) by BioWare released on December 20, 2011. He is voiced by Fred Tatasciore. The player can choose to alternatively turn the chips over to Senator Barc and thereby receive dark side points."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}