{"url": "Denal", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Denal"}, {"tag": "p", "text": "\"Denal\" was the nickname of a clone trooper who served the Galactic Republic as a soldier in the 501st Legion during the Clone Wars. Denal served under Jedi General Anakin Skywalker and Clone Captain CT-7567 \"Rex\" during the war, including the Battle of Mimban and the mission to Skytop Station. At the Battle of Devaron, he was killed by bounty hunter Cad Bane."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The early war"}, {"tag": "p", "text": "In the early months of the Clone Wars, Denal served in the 501st Legion under the command of Jedi General Anakin Skywalker and Clone Captain CT-7567 \"Rex.\" He fought in the Battle of Mimban alongside fellow clones \"Hardcase\" and \"Jesse.\""}, {"tag": "p", "text": "When Skywalker's personal astromech droid, R2-D2, was held captive by the scavenger Gha Nachkt and scheduled to be handed over to General Grievous at Skytop Station, Denal was assigned to be a part of the rescue squad on a mission to save the R2 unit and destroy the Separatist spy station. During this mission, he, Commander Tano, and the rest of the squad were attacked by Grievous. He was one of the only survivors of the General's attack, along with Tano and Rex."}, {"tag": "p", "text": "After planting the bombs, Denal and Rex met up with Skywalker and R2 in the station's landing bay. However, they were then trapped there by R3-S6, who revealed himself to be a Separatist spy. They then came under attack by super battle droids and vulture droids. After setting off the explosions, Denal, Rex, Skywalker, and Tano were able to board the Twilight before the station was destroyed."}, {"tag": "h3", "text": "Battle of Devaron"}, {"tag": "p", "text": "Denal was sent with Skywalker, Tano, and Rex to Devaron to stop bounty hunter Cad Bane from acquiring the kyber memory crystal from Master Bolla Ropal on Devaron. He and the others then boarded Bane's command ship. There, they fought Bane and his battle droids. After fighting the battle droids to acquire a Sheathipede-class transport shuttle, Denal and another trooper, \"Koho,\" were then sent by Rex to find Skywalker and Tano. They then found Bane and held him up, threatening them. However, Bane overpowered them, killing both Koho and Denal."}, {"tag": "p", "text": "Bane switched armor with Denal, and faked his death. At first, the clone troopers were impressed with Denal's apparent killing of Bane. However, Bane's disguise was uncovered by one of the clones who saw the Duros' blood, and Ahsoka, who discovered that \"Denal\" was in fact Bane, after following him from the shuttle. Bane then made his escape in a V-19 torrent starfighter and jumped into hyperspace."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Denal has standard Phase I clone trooper armor with customized blue markings on his helmet that were consistent with the 501st Legion. He used a DC-15 blaster carbine, which sometimes had an ascension cable attachment. He also sometimes had a red visor attached to his helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Denal first appeared in the Star Wars: The Clone Wars episode \"Duel of the Droids.\" Like all clones, he was voiced by Dee Bradley Baker. Although not named in the story itself, a clone wearing Denal's armor also appeared in the comic short \"501 Plus One,\" a story contained within Age of Republic Special 1. Lucasfilm Story Group member Matt Martin later clarified on Twitter that the clone in the comic was indeed Denal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}