{"url": "Dendro", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Jedi Purge victims", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dendro"}, {"tag": "p", "text": "Dendro was a Human male Jedi Padawan apprenticed to Jedi Master Hylon during the final years of the Galactic Republic. In 19 BBY, Dendro and his Master survived the initial stages of the Great Jedi Purge, which was ordered by Supreme Chancellor Palpatine. A few months after Palpatine declared himself Emperor of the Galactic Empire, Dendro and Hylon joined forces with the Ovoni, natives of the planet Otavon XII. After a strike force of Ovoni were defeated while attacking Tremor Base—an Imperial station constructing All Terrain Armored Transports—the Dark Lord of the Sith Darth Vader tracked Dendro and a small group of Ovoni in the forest. The Jedi confronted the Sith Lord in a lightsaber duel, but was ultimately killed by Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dendro, a Human male, served the Jedi Order during the Clone Wars. During this time, he became the Ovoni Jedi Master Hylon's Padawan. In 19 BBY, Supreme Chancellor Palpatine issued Order 66, compelling all clone troopers to kill the Jedi Knights. Shortly after, Palpatine declared himself Emperor of the new Galactic Empire."}, {"tag": "p", "text": "Dendro and Hylon survived the initial stages of the Great Jedi Purge and joined forces with the Ovoni natives on the planet Otavon XII. A few months after Order 66 was issued, the Ovoni staged an assault on the local Imperial station Tremor Base, which constructed All Terrain Armored Transports. The assault team was defeated by the Dark Lord of the Sith Darth Vader and the Imperial forces under his command. Dendro and five Ovoni fled through the forest, planning to go to a river and make their way back to Mount Dijandi, where Hylon was waiting."}, {"tag": "p", "text": "However, Vader located Dendro and the small group of Ovoni. The Dark Lord dispatched the natives and engaged Dendro in a lightsaber duel. During the duel, Vader injured Dendro by slashing the Jedi's left leg. Vader attempted to learn Dendro's identity, but the Jedi refused to tell the Sith his name. After Dendro threw a lantern at Vader, the Dark Lord used the Force to push the Padawan back. Vader grasped Dendro by his neck and removed his hood, recognizing that Dendro was a Padawan due to his distinctive braid. When Dendro was asked where his Master was, he replied that Hylon was on his way to a starship, and that Vader would never find the Jedi Master once he escaped the planet. The Padawan was thrown to the ground and was killed by Vader, who used both his own and Dendro's lightsaber to murder the Jedi. Shortly after Dendro's death, the Dark Lord located Hylon on Mount Dijandi, defeating and slaying the Jedi Master."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "After the initiation of the Great Jedi Purge, the Dendro was willing to aid the Ovoni people against the forces of the Galactic Empire on Otavon XII. When Darth Vader confronted Dendro in the forests of Otavon XII, the Jedi refused to reveal either his identity or the whereabouts of his Jedi Master, Hylon. Before killing Dendro, Vader remarked that the Jedi's will was strong. Dendro wore a set of brown Jedi robes and used a lightsaber containing a blue crystal."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "When the Great Jedi Purge was initiated, Dendro managed to evade the Imperial forces along with his Master, Hylon. He used a lightsaber during combat; however, he was not able to defeat Darth Vader when he engaged the Sith Lord in a duel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dendro first appeared in the standalone 2010 comic Star Wars: Purge: The Hidden Blade, written by W. Haden Blackman and penciled by Chris Scalf. The comic details the events of Dendro's death at the hands of Darth Vader during the Great Jedi Purge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}