{"url": "Denia", "categories": ["Category:Legends articles", "Category:Alderaanian Resistance members", "Category:Females", "Category:Humans", "Category:Jedi Diplomats", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Denia"}, {"tag": "p", "text": "Denia was a female Human Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars, despite her advanced age."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human female, Denia was discovered by the Jedi Order and educated in the ways of the Force within the academy at the Coruscant Jedi Temple. Eventually attaining the rank of Jedi Master after much study and contemplation of the Force as a diplomat, Denia became one of the few Jedi to achieve the rank of Sage Master. Taking the Human male Valin Draco as her Padawan, she taught him all she knew of the Force. Denia, middle-aged for a Jedi, reported to Coruscant when the Clone Wars erupted between the Republic and the Confederacy of Independent Systems. Already at an advanced age for a Human, Denia dutifully took up the rank of General in the Grand Army of the Republic and led clone troopers against the Separatist Droid Army."}, {"tag": "p", "text": "Surviving until the last year of the war, Denia was contacted by Master Ashka Boda who was searching for Jedi to assist in setting up a secret network that would lead Jedi who survived the Separatist attack on Almas back to Coruscant. Denia was assigned to Cato Neimoidia where she would serve under High Council member Plo Koon during the battle for the planet. During the fighting, Denia was rendered unconscious on the battlefield after a Vulture droid crashed in close proximity to her. Her form was discovered by a general in the Separatist Army, who drugged her and had her body carried to a nearby palace. Not long after, the Clone Wars ended suddenly, with the slaughter of the Separatist Council and the reorganization of the Republic into the victorious Galactic Empire. On the losing end of the war, the Separatists fled the palace and Cato Neimoidia, leaving Denia in an artificial coma within its walls."}, {"tag": "p", "text": "Soon after the end of the war, the palace that housed Denia was occupied by Darga the Hutt and his minions. Locating Denia, the Hutt decided to keep the middle-aged woman as a bargaining tool should need ever arise and had her moved to the subbasements where Igren Demos kept her comatose. During the months surrounding Darga's reign in the palace, a band of anti-Imperial freedom fighters infiltrated Darga's palace on assignment for Senator Bail Organa of the Imperial Senate. Reaching out to the rebels through the Force, Denia was able to direct them to her location despite being in a coma. Deactivating the machines keeping her in a coma, the rebels woke Denia, who thanked them for their assistance. Filling her in on the fall of the Republic and the dissolution of the Jedi Order, the group headed upstairs to find that Darga had fled upon news of Denia's escape. Overhearing Demos' conversation with an Imperial Inquisitorius member via the HoloNet, the group escaped the palace and took Denia to the Resurgence to receive medical treatment."}, {"tag": "p", "text": "Aboard the ship, Denia was healed and approached by Senator Organa with the proposition of joining his secret movement known as the Alderaanian Resistance. Accepting the offer, Denia was determined to bring down Darga the Hutt and his devious plot known as the Sarlacc Project. Going into deep meditation, Denia found the Force muddled and her ability to foresee diminished. Deciding that a holocron would boost her abilities, Denia and her allies planned a trek that would take them to the ruins of the Almas Academy in the Cularin system. While Denia believed that many of the artifacts were probably stolen, the Force was drawing her to the world and using the coordinates obtained by Senator Organa, Denia dispatched her comrades to the ruins."}, {"tag": "p", "text": "Upon their return with the Qornah Holocron, Denia was disturbed by reports that Valin Draco was alive, now an Inquisitor of the Empire, and responsible for attacking the group. Going into a deep trance, she set her comrades on another mission regarding the Sarlacc Project. While in meditation, the Resurgence was attacked and destroyed. Denia, surviving the attack, was taken prisoner by her former Padawan, Valin Draco. Imprisoned on the Deep Core world Prakith, Denia was held deep within the Citadel Inquisitorius by Draco, who quickly drew tired of torturing the old Jedi Master. Refusing to give away any information regarding Organa's organization, Denia was nearly comatose when her rebel allies broke into the Citadel and located her chamber. Strapped to the torture rack, Denia appeared helpless to do anything as Draco attempted to destroy her before taking out her allies. However, she managed to deflect Draco's bursts of Force lightning back into him and unleash a powerful Force attack that allowed her companions to escape. Her great strength expended in this encounter cost her life, yet she willingly sacrificed it to save Organa's men and their cause."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}