{"url": "Denjax_Teppler", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Confederation officials", "Category:Corellian nationals", "Category:Corellians", "Category:Humans", "Category:Males", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Denjax Teppler"}, {"tag": "p", "text": "Denjax Teppler was a Human male Corellian who served in various posts in the Corellian system's Five Worlds government throughout his life. He married Aidel Saxan, a fellow politician, before 40 ABY, but the two eventually separated and remained on good terms. In that year, Teppler was the Five World Deputy Prime Minister and Saxan the Prime Minister. She was assassinated during tensions between Corellia and the Galactic Alliance, of which Corellia was a member world; Teppler was afterward thrust into the role of acting Prime Minister. His political opponents immediately plotted and schemed against him, and when he became aware of a secret military meeting that he was not invited to, he recruited the famous Corellian national Han Solo and his wife Leia Organa Solo to spy on the meeting for him. A military operation intended to drive an occupying Alliance force off of Tralus, one of Corellia's neighboring worlds, was planned at the meeting and was later successfully carried out. The Corellian Chief of State Thrackan Sal-Solo seized power in the battle's aftermath and declared himself the President of Five Worlds, a move which ended Teppler's tenure as Prime Minister."}, {"tag": "p", "text": "Teppler became Corellia's Minister of Justice after Sal-Solo was killed, but he found himself disenfranchised with the lengths that the Five Worlds government was going to in order to gain ground in its struggle against the Galactic Alliance. His fellow politicians began to monitor his activities, and he hired a look-alike to pose as him and allow him to move around freely. When Teppler met with the Solos in a cantina in Corellia's Coronet City, he obliged their request for classified information by revealing that Five World Prime Minister Dur Gejjen had ordered an assassination attempt on Queen Mother Tenel Ka Djo of the Hapes Consortium in order to have her replaced with pro-Corellian leadership. Agents of the Corellian Security Force then chased the group out of the cantina. Corellia was soon after joined in its struggle by other renegade Alliance member worlds, and a full-scale war erupted between the Alliance and the newly formed Confederation. When Alliance agents murdered Gejjen, Teppler became the Corellian Minister of Information and a close aide to Gejjen's replacement, Sadras Koyan."}, {"tag": "p", "text": "Teppler and Koyan developed a plan to kill Galactic Alliance Chief of State Jacen Solo by reactivating the disabled Corellian superweapon Centerpoint Station and firing its repulsor weapon at his flagship. The weapon fired but failed to hit its intended target, and Teppler's and Koyan's independent actions prompted a furious Confederation to cut Corellia off from all aid. Teppler acted alone and contacted Turr Phennir, the Supreme Commander of the Confederation military, in order to plead his homeworld's case, but he was told by Phennir that the decision would only be overturned if Koyan was removed from power. During a subsequent Alliance attack on Centerpoint, Teppler again contacted Phennir and told him to place military reinforcements on standby. He then maneuvered Koyan toward an Alliance shuttle and his death; the reinforcements arrived, and Corellia was welcomed back into the Confederate fold. The Confederation surrendered to the Alliance weeks later but remained independent, and Teppler became one of Corellia's co–Chiefs of State. Two years after the conclusion of the war, he represented his homeworld at a Unification Summit held on the Alliance's capital world of Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Thrust into power"}, {"tag": "p", "text": "Denjax Teppler was a Human male from Corellia. Born years before 40 ABY, he eventually entered politics on his homeworld while his brother began a career with the Corellian Security Force. Teppler married fellow Corellian politician Aidel Saxan before 40 ABY, but the two separated after some time. They remained on friendly terms, and in 40 ABY, Saxan was serving as the Prime Minister of the Corellian system's Five Worlds government, with Teppler as her Deputy Prime Minister. One of his responsibilities in that role was to dispense information to the Corellian public. Tensions began to rise in that year between Corellia and the Galactic Alliance, the galaxy's centralized government, as Corellia demanded the benefits of Alliance membership but refused to provide them with starships and personnel. The Alliance launched a military operation against Corellia that saw elements of the Galactic Alliance Second Fleet deployed in Corellian space. Several Jedi commando teams were dispatched onto the planet's surface to kidnap Saxan and Thrackan Sal-Solo, the world's Chief of State, while another team boarded Centerpoint Station, an ancient superweapon that hung in the Corellian system."}, {"tag": "p", "text": "Although the space station was disabled, Saxan and Sal-Solo received advanced knowledge of the strike and avoided capture; the Corellian Defense Force was additionally launched against the Second Fleet and was able to cause the Galactic Alliance a degree of trouble. Alliance Admiral Matric Klauskin ended the skirmish by landing an occupational force on Tralus, another planet in the system. With tensions high, Teppler's brother programmed four YVH-series battle droids to act as security for the Deputy Prime Minister. His brother soon after served as one of Saxan's bodyguards when she traveled to Toryaz Station near the planet Kuat to negotiate a withdrawal from Tralus with Alliance representatives. There, Sal-Solo's assassins killed them both when the Chief of State acted to eliminate one of his primary political rivals. Teppler was appointed the acting Five World Prime Minister, but he knew that he was without any allies save for his four security droids and saw himself as largely a puppet ruler. His political opponents schemed behind his back and stymied him during his first few days of tenure, and Teppler feared an impending prolonged conflict with the Galactic Alliance that would devastate Corellia's economy. He was just as wary of Sal-Solo seizing power and expected to quickly be assassinated."}, {"tag": "p", "text": "Shortly into his tenure, Teppler received an in-case-of-death package from Saxan that detailed dealings she had recently had with Han Solo and his wife Leia Organa Solo. The two were legendary galactic heroes who had strong relations with the Galactic Alliance; Solo was, however, patriotically Corellian, and it had in fact been the two of them who had given Saxan advance warning of the Alliance's attack. Teppler also caught wind of a secret Corellian military meeting where plans would be hatched to oust the Alliance from Tralus, but his political opponents scheduled pressing matters for him at the same time that would prevent him from attending. As such, he sent a coded communication to the Solos and invited them to Corellia, hoping that he could convince them to spy on the meeting for him and confirm his suspicions regarding the loyalties of his fellow politicians. The Solos arrived in Coronet City, the capital of Corellia, and met with Teppler in his viewing chamber above the meeting room. He informed them of his fears of a war and asked them to view the meeting from his chamber. When Organa Solo suggested that they might report on the meeting to the Alliance, Teppler iterated his belief that peace could not occur until the Alliance left Tralus, and that only an act of war could cause them to leave. The Solos considered his words and agreed to spy on the meeting. Teppler then left to attend to his scheduled duties."}, {"tag": "h3", "text": "Enemies within"}, {"tag": "p", "text": "The meeting saw a plan proposed by Wedge Antilles, another legendary Corellian who had fought at the Solos' side throughout several wars, that involved the shields of the Alliance's Tralus base being brought down from the inside, which would in turn allow a military strike that included a minimal loss of civilian lives. The plan was accepted by the military commanders at the meeting, and the operation was able to drive the Alliance off of Tralus. Sal-Solo seized power in the raid's aftermath and created the office of the President of Five Worlds, declaring himself the leader of the entire Corellian system. The Corellian politician Dur Gejjen soon after hired the bounty hunter Boba Fett to assassinate Sal-Solo, and after the President was killed, Gejjen arranged to have himself named both Chief of State of Corellia and the Five World Prime Minister. In the wake of Sal-Solo's death, Teppler assumed the role of Corellia's Minister of Justice and began to serve under Gejjen in the Five Worlds' new coalition government. Other Corellian politicians began to monitor Teppler's activities, and he accordingly hired a look-alike that was often mistaken for him and followed home, which allowed Teppler to move about freely."}, {"tag": "p", "text": "Chafing under a blockade imposed by the Alliance on the entire Corellian system and seeking allies, Gejjen arranged for Tenel Ka Djo, the Queen Mother of the Hapes Consortium, to be assassinated and for leadership that was sympathetic to the Corellians' plight to take her place. Teppler was not made aware of the plans until the attempt was already underway. The assassin was foiled, however, and Corellia found its situation worsening. Shortly thereafter, politicians of the coalition and members of the Corellian Defense Force met in an underground bunker in Coronet to discuss the ongoing blockade, and Teppler played the role of peacekeeper during the heated meeting as he attempted to calm down the various shouting participants. When Antilles suggested that they negotiate a no-fault return to the Galactic Alliance, Gejjen relieved him of his position as Supreme Commander of the Corellian Defense Force and replaced him with Admiral Genna Delpin. Antilles promptly resigned his commission and refused to aid an organization that he saw as becoming increasingly corrupt. Teppler had similar misgivings with the government, but he felt that the political battlefield was where he could best wage war against it."}, {"tag": "p", "text": "Shortly after the meeting, Teppler was contacted by the Solos, who sought another meeting with him. As all of his regular hideouts were being monitored, he arranged to meet them in a Coronet cantina. After dodging his surveillance, he donned a cloak and stealthily made his way to the cantina, where he joined the Solos and their friend Lando Calrissian. After Teppler ordered a whiskey and water from a waiter droid and introduced himself to Calrissian, the Solos informed him that they had become suspects in the Galactic Alliance's investigation of the assassination attempt on Djo due to their presence on the planet Hapes at the time. Hoping to clear their name, they asked Teppler if he knew who had ordered the hit. Teppler bemoaned what he saw as the diminishing line between treason and loyalty, and a concerned Solo offered to quietly transport him off of Corellia. Teppler declined, citing his desire to keep fighting a political battle, even though he suspected that it would cost him his life. He then informed them that Gejjen had planned the assassination and that Antilles had had no part in it. At that point, Organa Solo, an active Jedi Knight, sensed hostile presences outside the cantina through the Force and learned from a waiter droid that there were storage rooms beneath them. When the front door slammed open and two CorSec agents charged in, Calrissian tipped their table over to provide cover."}, {"tag": "p", "text": "Teppler dove beneath the table and began to fire wildly with his hold-out blaster, but only the accurate laser cover provided by Solo and Calrissian kept the agents at bay. When Organa Solo cut out a circle of flooring with her lightsaber, Teppler dropped into the storage rooms after her. Solo and Calrissian soon followed, and the four of them dashed through the storage rooms toward a metal door that led outside. Solo grabbed Teppler's tumbler of alcohol and fired at it so as not to leave any fingerprints, and Teppler caught the door after Organa Solo cut its hinges away. In the alleyway outside, Organa Solo used a mind trick to convince the pilot of a nearby garbage loader to kill the vehicle's engines and block access to the alley from the nearby street. Teppler declined their offer to escape in a speeder and ran away on foot; he hoped that he would be less conspicuous on his own."}, {"tag": "h3", "text": "Acting alone"}, {"tag": "p", "text": "Not long after Teppler's meeting with the Solos and Calrissian, several other planetary governments joined Corellia in its struggle, and the Alliance found itself officially at war with the newly-formed Confederation. Gejjen was soon after assassinated by members of the Galactic Alliance Guard, and Sadras Koyan, the Head of State of Tralus, eventually took the reigns as Five World Prime Minister after he was elected by the coalition government's other planetary Heads of State. Teppler became one of Koyan's closest aides and was appointed as Corellia's Minister of Information, a post often disparagingly referred to by others as the \"Minister of Propaganda.\" Without consulting their Confederate allies, Teppler and Koyan worked together and developed a plan to kill Jacen Solo, former Jedi Knight and current Galactic Alliance Chief of State, by using a reactivated Centerpoint Station to destroy his flagship, the Anakin Solo. Technicians began working to make Centerpoint operational again, and Koyan contacted the Alliance to invite Jacen to a meeting at a deep-space rendezvous point. He claimed that Corellia was considering a defection from the Confederation back to the Alliance."}, {"tag": "p", "text": "Jacen arrived at the rendezvous in his flagship, accompanied by elements of the Second Fleet, and he met a ragtag Corellian fleet of decommissioned and nearly derelict vessels. Meanwhile, Teppler, Koyan, and Delpin traveled to the fire-control chamber of Centerpoint and stood with the technicians who were in the final stages of reactivating the superweapon. When they believed it to be ready, the technicians fired Centerpoint's powerful repulsor weapon, which vaporized the decoy Corellian fleet as well as most of Jacen's fleet, but which failed to destroy the Anakin Solo. The station's systems overloaded in the process, and smoke and flames filled the chamber. Teppler calmed a furious Koyan down, and Delpin reported that they had lost contact with their fleet. Koyan tasked the technicians with repairing the overloaded systems and marched away; Teppler remained behind and thanked the technicians for their efforts before he departed. As Corellia had acted alone in the endeavor, Teppler privately asked Delpin if he could do anything to bear some of the inevitable backlash from Turr Phennir, the Supreme Commander of the Confederation military. Delpin affirmed that she took her orders from the Five Worlds government and not from the Confederation."}, {"tag": "p", "text": "Phennir responded by cutting Corellia off from all Confederate aid, including medicine, supplies, intelligence, and synchronized fleet movements. Teppler went into hiding in Koyan's command bunker on Corellia, where he privately contacted Phennir and personally appealed to him to end the embargo. Phennir compared Corellia to an arm infected with poison that the Confederation needed to amputate before the poison spread through the rest of the body, and he told Teppler that Corellia would not be welcomed back into the Confederate fold unless Koyan, the \"poison,\" were removed from power. After the conversation ended, Teppler destroyed the bypass card he had used to access the holocomm unit and considered Phennir's words as he cleaned his fingerprints from the area. Although he did not crave power himself, he concluded that a partnership between him and Delpin could effectively rule Corellia, with her handling military affairs and him civilian. He invited Delpin into the bunker and proposed the idea to her, which she rejected until he lied and told her that it was a worst-case scenario, only to be implemented if Koyan somehow removed himself from office. As she considered the offer, both of their comlinks chimed, and they were informed that Centerpoint Station, once again operational, was under attack."}, {"tag": "p", "text": "Delpin rushed to the bunker's situation room, and Teppler raced to the Prime Minister's communications chamber in order to contact Phennir. He told the Supreme Commander to put Confederate reinforcements on standby and promised that Koyan would cease to be a problem very soon. Phennir obliged, and Teppler contacted Koyan, who was in Centerpoint's fire-control chamber. He told the Prime Minister that enemy forces aboard Centerpoint were moving in to capture him and urged him to evacuate on a shuttle that was standing by. The shuttle in fact belonged to the Galactic Alliance, but an ignorant Koyan transmitted Centerpoint's firing and command authorization to Teppler and Delpin and made his escape, only to be shot and killed by an Alliance officer. Teppler joined Delpin in the situation room and watched Phennir's Confederate reinforcements arrive to aid the suffering Corellian defense fleet. The two of them hoped to win the battle without having to use Centerpoint, but a technician known as Vibro, who harbored a deep hatred of the Galactic Alliance, acted independently and fired the repulsor. Sabotage conducted by a Jedi strike team caused the weapon to target itself, however, and Centerpoint Station was destroyed along with most of the Confederate and Alliance vessels."}, {"tag": "p", "text": "The war raged for several more weeks, and the Confederation suffered a considerable loss after being trapped by Alliance Admiral Nek Bwua'tu at the Second Battle of Roche in 41 ABY. Jacen Solo was soon after killed in a lightsaber duel, and the Alliance joined forces with the Imperial Remnant and the Jedi Coalition. The Confederation surrendered to the combined strength of its enemies, and the war was brought to a close. The Confederation remained intact, however. Teppler became one of Corellia's co–Chiefs of State, and two years later represented the planet at a Unification Summit held by the Alliance on the galactic capital of Coruscant. The summit aimed to examine the relationship between the Alliance, the Confederation, and the Imperial Remnant, with the ultimate goal of restoring a strong planetary union. During the summit, Teppler's protocol aide Enneth Holkin was attacked by Valin Horn, a Jedi Knight suffering from a mysterious psychosis."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Denjax Teppler was a shrewd politician who was skilled at listening to others and guessing their motivations while simultaneously sorting their truth from their lies. He was calculating and was adept at manipulating, maneuvering, and lying to others, although his experience as the information-dispensing Five World Deputy Prime Minister at times led him to speak very candidly and honestly. His candor won him a measure of respect from Turr Phennir, who normally had a particular distaste for politicians. Teppler was diplomatic and made a point to thank the technicians who worked to restore Centerpoint Station for their efforts after Sadras Koyan, his superior, made a hasty exit from the station's fire control room. Teppler knew that Admiral Genna Delpin would receive blame when the Confederation discovered that the station was operational and hoped to absorb some of it himself in order to lessen her burden."}, {"tag": "p", "text": "Teppler did not crave power. In the years leading up to 40 ABY, he neglected to build a network of political allies and conspirators, and he thus found himself without any political clout or any trustworthy comrades after being thrust into the role of Five World Prime Minister. He knew that his tenure was temporary, and his primary goals while in office were to prevent Corellia from being ruined by war and from being ruled by Thrackan Sal-Solo, whose leadership of the Five Worlds Teppler believed would be a \"wrong\" regime. After Turr Phennir suggested that he remove Sadras Koyan from power, Teppler aspired to replace the Five World Prime Minister, but it was not due to hunger for power or a belief that the war could be won under his leadership. He approached the idea practically and hoped to split the responsibilities with Delpin, which would allow her to lead the Corellian Defense Force and him to handle the planet's civilian chiefs."}, {"tag": "p", "text": "For various reasons, Teppler committed several acts of treason against other members of Corellia's government during the Second Galactic Civil War. During his tenure as Five World Prime Minister, he clandestinely invited Han and Leia Organa Solo, allies of the Galactic Alliance, to spy on a meeting of Corellia's top military commanders so that they could inform him where the loyalties of his fellow politicians lay. His ultimate goal was peace, and he believed that forcibly ousting the Alliance from Tralus was the only way to achieve it. Teppler took a calculated risk that the Solos felt the same way and that they would not report the meeting's agenda to the Alliance. When a dispute between Koyan and Phennir led to Corellia being cut off from Confederate aid, Teppler took it upon himself to privately contact Phennir and plead his homeworld's case. Phennir told him that removing Koyan from power would bring Corellia into the Confederate fold, and during the Alliance's subsequent attack on Centerpoint Station, Teppler did what needed to be done in order to protect his homeworld by maneuvering Koyan toward an Alliance shuttle and his death. These actions prompted Phennir to provide Corellia with naval reinforcements."}, {"tag": "p", "text": "Another meeting with the Solos, this time in a cantina in Coronet City, led to an additional act of treason on Teppler's part. During Dur Gejjen's tenure as Five World Prime Minister, Teppler saw very blurred lines between treason and loyalty and between selfishness and altruism. He accordingly told the Solos that it had been Gejjen who had ordered Tenel Ka Djo to be assassinated; the Galactic Alliance later had Gejjen himself killed. While serving under Gejjen, Teppler fully believed that he would be murdered by his political opponents, but when he was offered transportation off his homeworld, he insisted that he remain on Corellia and fight against a corrupt regime on the political battlefield. Although he valued his life over power, Teppler's ultimate loyalty lay to Corellia, and he refused to abandon his homeworld in order to protect his life. Teppler was loyal to Corellia over the Confederation and conspired with Koyan to secretly reactivate Centerpoint Station; he believed that their defiance would be justified if it resulted in the death of Galactic Alliance Chief of State Jacen Solo. Loyal to a world rather than its leader, he later sent Koyan to his death in order to mend Corellia's ties with the Confederation and to secure Confederate military aid."}, {"tag": "p", "text": "Teppler's hair was dark, and his features were considered by others to be bland, yet also handsome and confidence-inspiring. He was not skilled in lightfights or in unarmed combat, nor was he an able pilot—his strengths lay in the political arena. Teppler was very careful about covering his tracks after he committed treason: he was constantly aware of where he had left fingerprints, and when time allowed, he was very meticulous about removing any traces of his presence from areas where his treason had occurred."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Denjax Teppler was created by author Aaron Allston for use in his 2006 novel Legacy of the Force: Betrayal, the first volume of the nine-book, multi-author Star Wars: Legacy of the Force series. In the novel, Teppler assumes the post of Five World Prime Minister. Karen Traviss, the author of the series' following installment, Legacy of the Force: Bloodlines, submitted her novel's manuscript before Allston submitted Betrayal's, and as such, no mention is made of Teppler in Bloodlines, and Thrackan Sal-Solo is referred to as \"President.\" The series' third volume, Troy Denning's Legacy of the Force: Tempest, reconciles its two predecessors by stating that Sal-Solo seized power and invented the position of \"President of Five Worlds.\" Teppler also appears in Legacy of the Force: Exile and Legacy of the Force: Fury, Allston's other two Legacy of the Force offerings, appearing as a point-of-view character in the latter and playing a large enough role to merit inclusion in the book's Dramatis Personae. He appears exclusively in Allston's novels, however, and is not referenced in any of Traviss's or Denning's works."}, {"tag": "p", "text": "After completing his three entries in Legacy of the Force, Allston was under the impression that Teppler was not a particularly likeable character and that he would not have very many fans. Allston was thus surprised when one of his friends told him that she was the \"world's biggest Denjax Teppler fan.\" Following the conclusion of Legacy of the Force in 2008, Allston indicated that he wished for fans to let him know which characters they would like to see return in future works. Teppler has not made any further appearances, but he is mentioned as being a co–Chief of State of Corellia in Allston's 2009 novel Fate of the Jedi: Outcast. He additionally has an entry in 2008's The Complete Star Wars Encyclopedia and is mentioned in 2012's The Essential Reader's Companion. Although Teppler's age is never given in canon, he is twice referred to as \"kid\" by Han Solo in Exile. During the novel's events, Solo is sixty-nine years old."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}