{"url": "Denno_Yanglan", "categories": ["Category:Legends articles", "Category:Alliance Military members", "Category:Galactic Empire military personnel", "Category:Healers and doctors", "Category:Humans", "Category:Imperial defectors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Denno Yanglan"}, {"tag": "p", "text": "Denno Yanglan was a human male who worked as a medical supervisor in the Imperial Surgical Corps of the Galactic Empire. Defecting to the Rebel Alliance on Bakura, Yanglan uncovered a traitor aboard the Wayfaring Stranger and joined the crew in repelling Imperial boarders."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A human male, Denno Yanglan lived with his family on the planet Cridark II. Lacking the finances to enter higher education, Yanglan joined the Galactic Empire as a medic in the Imperial Surgical Corps, where he realized the easiest way to advance was to take additional training. He rose to the position of medical supervisor after taking extra training in behavior modification, attitude alteration, and interrogation. The Empire found his empathetic and persuasive talents useful, and Yanglan maintained a professional attitude. He deposited most of his salary into an account for his family on Cridark II."}, {"tag": "p", "text": "Yanglan was sent to Bakura and served at the Imperial garrison base's medical center. He made his only real friend on the planet in weather officer Rafe Shahverdian. Yanglan witnessed an old man die resisting his drugs. This incident affected Yanglan, weighing on his conscience and causing him to change his attitude. He came into contact with the Alliance to Restore the Republic and decided to defect, taking up their offer of transport back to settled space. Yanglan hoped to relocate his family to a world sympathetic to the Alliance, in order to protect them from reprisal for his defection from the Empire. He hastily packed up his belongings, including a comlink, medical supplies and a thousand credits, and was met by Shahverdian and Mayr Stillman, supervisor of the medical center. Hoping to get Shahverdian alone, Yanglan walked with him to Salis D'aar's yellow-orange circle, where the Rebels were processing defectors. However, Stillman accompanied them, and Yanglan found himself unable to shake the Imperial loyalist. They boarded the Wayfaring Stranger, a poorly-armed transport, along with other defectors and traders, and departed Bakura."}, {"tag": "p", "text": "En route to a transfer station, the defectors discovered that Stillman used a subspace transmitter to alert Imperial forces ahead. Believing Stillman was defecting only to infiltrate the Alliance, Yanglan used his medical persuasion skills to force a confession from Stillman, learning that he hoped to buy his way into Imperial favor by assisting in the capture of the defectors. Yanglan joined preparations to repel the imminent Imperial attack, but was determined to no longer use his medical persuasion on innocents now that he was free from Imperial service. The Wayfaring Stranger dropped out of hyperspace and was confronted by an Imperial patrol vessel, whereupon the passengers prepared for boarding."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Denno Yanglan was a kindly man who cared and provided for his family. A professional medical supervisor, his empathetic and persuasive talents proved useful to the Galactic Empire, but his conscience weighed heavily on him after witnessing the harm caused by the drugs he sold. He was adept at first aid and other medicine, persuasion, and beast riding."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}