{"url": "Denova", "categories": ["Category:Legends articles", "Category:Denova locations", "Category:Ojoster sector planets"], "nodes": [{"tag": "h1", "text": "Denova"}, {"tag": "p", "text": "Denova was a planet in the Ojoster sector that consisted mostly of woods and high peaked mountains. Ancient ruins were noted to be present on the surface though details on them were largely undocumented. It was discovered during the Cold War by the Galactic Republic, who first scouted the world. This led to the discovery of extensive deposits of the ore known as baradium. In order to control this resource, the Republic hired a mercenary army due to manpower shortages in the Republic Military."}, {"tag": "p", "text": "Thus, a Trandoshan group known as the Warstalkers, led by the veteran Kephess, was hired to prevent the world, and the ores, from falling into the hands of the Sith Empire. However, the mercenaries went rogue and formed an alliance with renegade forces within the Imperial Army."}, {"tag": "h2", "text": "Transfer Of Ownership"}, {"tag": "p", "text": "After the fall of the Eternal Empire, the present Republic forces joined its Alliance replacement. Due to an agreement between Supreme Commander Malcom and the Alliance Commander, Republic personnel who joined the Alliance weren't considered traitors. As such, Denova itself left the Republic for the Eternal Alliance."}, {"tag": "h2", "text": "Assault on Denova"}, {"tag": "p", "text": "Despite the peaceful transfer, General Amos Rike, an extremely loyal Republic soldier, led a full-scale attack on Alliance forces at the baradium mines."}, {"tag": "p", "text": "Using a prototype hover tank, artillery, and plenty of soldiers, Rike forced Alliance forces into a small beachhead. It took a small strike team led by the Alliance Commander to remove Rike, his 2nd, and 3rd in command out of the picture."}, {"tag": "p", "text": "Investigations into how such a large force could ignore Republic orders so smoothly revealed that the Republic Military had multiple anti-Alliance forces at work. This grew thick tensions between the two powers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}