{"url": "Depa_Billaba%27s_second_battalion", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles with conflicting sources", "Category:Articles to be expanded", "Category:Grand Army of the Republic battalions"], "nodes": [{"tag": "h1", "text": "Depa Billaba's second battalion"}, {"tag": "p", "text": "In the final months of the Clone Wars, Jedi Master Depa Billaba led a second battalion after her previous battalion suffered high casualties during a battle on Haruun Kal. With the exception of four survivors of Billaba's previous battalion who elected to return and serve under the Jedi Master, the clone trooper members of the battalion were very young and inexperienced. Depa Billaba's second battalion was deployed to the worlds Kardoa, Mygeeto, and eventually Kaller where the troops would turn on the two leading Jedi, killing Billaba who sacrificed herself to allow Dume to escape."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of Republic"}, {"tag": "p", "text": "Following Master Depa Billaba's recovery from her coma, she, along with her new Padawan, Caleb Dume (later Kanan Jarrus), took command of her new clone trooper battalion. Four of Billaba's officers from her previous battalion, Commander \"Grey,\" Captain \"Styles,\" Sergeant \"Soot,\" and Corporal \"Big-Mouth\" joined the ranks of her newly formed battalion. Aside from these four troopers, the battalion largely consisted of younger and more inexperienced clone troopers who donned plain or green armor, contrasting with the design of the older troops."}, {"tag": "p", "text": "The battalion was sent to recon Kardoa for confirmation of a Separatist presence. As the battalion move through several canyons, Billaba divided it into five squads to do their reconnaissance. The battalion came under attack by battle droids under Colonel Coburn Sear. The battalion was able to force Sear's forces to retreat from Kardoa. A young trooper, CT-1157, was given commendation for valor and the nickname \"Stance.\""}, {"tag": "p", "text": "The battalion was sent to Mygeeto. There, the battalion cleared the southern mesas of battle droids. Billaba, Dume, and several of there officers and troopers were surrounded and pinned by the battle droids. They were saved by the Fang fighters of Commander Fenn Rau's Skull Squadron and were able to evacuate the area. While most of the battalion was away from the base camp, Billaba, Dume and Stance came under attack by the Separatist commander, General Grievous and Colonel Sear. Grey, Styles, and the rest battalion returned. Despite Billaba's wound by Grievous, the battalion was able to force Grievous to retreat from Mygeeto."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "In what would become its final mission, Billaba's second battalion was sent to Kaller. Although the battalion had previously only included four of her previous soldiers, by the time of its final mission, a number of clones who had known Billaba for years had joined the unit. There, it fought against the battle droids under General Kleeve. who would be forced to abandon the planet. However, Kaller was besieged again in the aftermath of the Battle of Coruscant. After Clone Force 99 took out a force of droids attacking the battalion, the clones were issued Order 66 by Supreme Chancellor Palpatine. The entirety of Depa Billaba's battalion immediately obeyed the order, opening fire on Billaba and successfully killing her. Dume would escape, fleeing into the surrounding wilderness with the clones in pursuit. In the following weeks, the battalion would continue their search for Dume as a force of the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The execution of Order 66 differs between \"Aftermath\" and Kanan 2. In the comic, the order occurs at night, with Billaba and Dume cutting down clones Kaylon, Remo, Big-Mouth, Mixx, and Soot. After her death, Grey orders all clones, including the unit Rostu Squad, to search for Dume."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}