{"url": "Deralia", "categories": ["Category:Legends articles", "Category:Tammuz sector planets"], "nodes": [{"tag": "h1", "text": "Deralia"}, {"tag": "p", "text": "Deralia was a planet that was located in the Outer Rim Territories of the galaxy. After the Jedi captured the Sith Lord Darth Revan, the Jedi Council of Dantooine used the Force to heal the severe damage to Revan's mind, which he sustained after being betrayed by his apprentice, Darth Malak. But instead of restoring him, the Council opted to reprogram Revan by inserting an artificial personality into his vulnerable mind. As a result, Revan's memories of his life were buried under his subconsciousness and suppressed by false memories, thus leading him to believe that he was a common recruit in the Republic Military who was from the planet Deralia."}, {"tag": "p", "text": "While still unaware of his true self, Revan was quickly retrained as a Jedi by the same Council that reprogrammed him on Dantooine. Shortly after ascending to the rank of Padawan in record time, the Jedi Knight Bastila Shan asked Revan a series of questions to test the extent of Revan's reconditioned state of mind. Among her questions, she inquired as to what planet he hailed from. Revan stated that he was born on Deralia in a remote system. Though Revan did not understand the true nature of Bastila's personal questions, he effectively demonstrated that the Council's actions worked perfectly; the Dark Lord of the Sith was utterly deceived by artificial memories of a life he never actually lived."}, {"tag": "p", "text": "300 years later, the spaceship Fortitude almost crashed into Deralia with Barsen'thor and several others on board. This catastrophe was narrowly averted by the clever machinations of Nadia Grell, who managed to get the crew to work together to steer the plummeting ship into orbit instead."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Planet Deralia was first introduced as the homeworld of reprogrammed Revan in Star Wars: Knights of the Old Republic, a 2003 roleplaying video game by BioWare. The locational information and coordinates for Deralia system were introduced in Star Wars: The Essential Atlas Online Companion, an online supplement to The Essential Atlas. This article assumes that the planet locates in this system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}