{"url": "Deral_Thul", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:House of Thul", "Category:Humans", "Category:Males", "Category:Sith Lords of the reconstituted Sith Empire"], "nodes": [{"tag": "h1", "text": "Deral Thul"}, {"tag": "p", "text": "Deral Thul was a male Human member of the Alderaanian Great House of Thul who served as a Sith Lord of the resurgent Sith Empire during the Alderaan Civil War, a part of the galactic Cold War between the Sith and the Galactic Republic. During the war he was stationed on his homeworld of Alderaan, and at one point in the year 3643 BBY, he was in the region known as Silvan Hills, along with Imperial forces stationed around a Thul Command Bunker. Whilst in the bunker he submerged himself fully clothed in his purple robes and armor, in a tank of kolto, a medicinal liquid."}, {"tag": "p", "text": "Whilst Thul was submerged, a Republic-aligned individual enter the bunker and destroyed the control console within as part of an attack on the Imperial controlled weather tower nearby. Witnessing the destruction, Thul broke out of the kolto tank and attacked the individual with his red-bladed lightsaber. The individual however proved stronger than Thul, and killed him. They then claimed his cybernetic implant and returned it to Republic forces for a reward."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Thul was a Human male, with brown eyes and fair skin. His hair, which was black, was receding by 3643 BBY leaving the Sith partially bald."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Thul had experimental cybernetic implants installed within his body and in combat used a red-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Deral Thul first appeared in Star Wars: The Old Republic, a MMORPG released by 2011 by BioWare. He was the target of the final stage of the \"Thwarting house Thul\" bonus mission, which Republic players could optionally complete as part of the \"Tower defense\" mission. This article assumes that players killed Thul as part of achieving 100% game completion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}