{"url": "Des%27sein", "categories": ["Category:Legends articles", "Category:Businesspeople", "Category:Galactic Republic senators", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Des'sein"}, {"tag": "p", "text": "Des'sein was a male humanoid with stubby fingers. As a Senator of the Galactic Republic, Des'sein represented a beleaguered world that was somewhere far from the Core. He was also a member of the Republic Group with his fellow Senators Fang Zar and Largetto."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In his life Des'sein was one of the more outspoken Senators in the Delegation of 2000 and strongly opposed the measures taken by Chancellor Palpatine before the Clone Wars. In 19 BBY, as a member of the the Republic Group, Des'sein received a package from Captain Jadak. The package received was said to contain data that was of great value to the Republic Group's cause. After the Battle of Coruscant Des'sein was informed by fellow Senator, Fang Zar, that Palpatine had been rescued from Separatist custody and that martial law on Coruscant had been rescinded. Even with that good news and the report of Count Dooku's death Des'sein believed it was vital for the Republic Group to continue it's work. As a result Des'sein asked Captain Jadak and his co-pilot Reeze to deliver the Stellar Envoy to Antarian Ranger Aren Folee in Salik City on Toprawa. He had told Jadak that the Stellar Envoy would be used to find a treasure that would restore Republic honor the galaxy."}, {"tag": "p", "text": "Unlike many of his compatriots, Des'sein survived Palpatine's proclamation of the Galactic Empire and went on to become a business consultant. During his new career Des'sein had a flourishing friendship with Lestra Oxic. As a friend, Lestra made Des'sein's will and attended Des'sein's daughter's wedding. When Des'sein was dying from a congenital disease, Lestra traveled to Coruscant to be at his bedside. It was on his death bed that Des'sein told Lestra about the Republic Group, its treasure, and the means to find it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}