{"url": "Desert_Son", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Desert Son"}, {"tag": "p", "text": "\"Desert Son\" is a short story in the anthology From a Certain Point of View. The story, written by Pierce Brown, focuses on Rebel pilot Biggs Darklighter."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Before the Battle of Yavin, Biggs Darklighter reflects on the nomadic path that took him to the Imperial Academy, to his first post aboard the Rand Ecliptic, and his subsequent defection to the Rebel Alliance. At Jan Dodonna's briefing, Darklighter hears the voice of his old Tatooinian friend Luke Skywalker, who has also joined the Rebellion. Exiting the briefing, Biggs brushes past Jek Tono Porkins, who playfully teases him."}, {"tag": "p", "text": "In the Great Temple's hangar, Biggs reunites with Skywalker. When Red Squadron leader Garven Dreis asks Luke Skywalker if he can handle the X-wing starfighter, Biggs speaks up for Skywalker and tells him that Luke is the best bush pilot in the Outer Rim Territories. Before climbing into their starfighters, Biggs promises to exchange stories with Luke. Luke responds that he told him that he would make it some day. As he boards his X-wing, Wedge Antilles asks Biggs who the kid is. Biggs tells Wedge that the kid is a friend from who said he would join the Rebellion."}, {"tag": "p", "text": "Biggs and his fellow pilots take-off on their X-wings from Base One. As they approach the Death Star, Biggs finds himself grappling with fear. When Garven asks the pilots to report in, Biggs replies that Red Three is standing by. Under Red Leader's command, Biggs and his fellow pilots lock their S-foils into attack position and switch their deflectors on double front. Descending on the space station, Biggs and his fellow pilots dodge bolts fired by the Death Star's heavy turbolaser emplacements, which are too slow for the nimble rebel fighters."}, {"tag": "p", "text": "Biggs gets Porkins to cover his starfighter from behind. However, Porkins' X-wing is taken out by an Imperial TIE fighter. As another X-wing is destroyed, Luke warns Biggs that there is another TIE fighter closing in on him. Biggs manages to move his X-wing out of harm's way in the nick of time. Luke then takes out the TIE fighter pursuing Bigg's X-wing. Continuing the assault on the Death Star, Biggs strafes the turbolaser towers that are peppering the Y-wing Gold Squadron, which are flying through the Meridian trench to take out the Death Star's thermal exhaust port."}, {"tag": "p", "text": "Biggs, Luke, and Wedge provide covering fire for the slower and older Y-wings in the Meridian Trench. However, they are cut off by TIE fighters. The Gold Squadron Y-wings in the trench are wiped out by TIE fighters. With only six Red Squadron pilots left and the rest of the squadrons wiped out by the Imperial turbolasers, Garven directs Luke to take Biggs and Wedge into the trench in order to take out the thermal exhaust port. The three rebel pilots find themselves pursued by three TIEs including Darth Vader's TIE Advanced x1 starfighter. During the run, Garven's X-wing is clipped in the rear by a laser and crashes into the Death Star's surface."}, {"tag": "p", "text": "With the rebels down to three ships, Biggs realize that he and Luke are the Alliance's last hope. Biggs and Wedge resolve to buy Luke enough time to reach the thermal exhaust port so that he can drop his payload of proton torpedoes. Biggs imagines that they are racing through Beggar's Canyon shooting womp rats. With Wedge's X-wing facing mechanical problems, he is forced to pull out. In order to save Luke and the mission, Biggs decides to sacrifice his own life and diverts power to the X-wing's engines. Bigg's X-wing is hit by laser fire, which ignite his ship. As his ship explodes, Biggs feels the wind of Tatooine sweeping across the desert as he dies; overcoming his fear and making peace with life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}