{"url": "Desevro_fleet", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Imperial Navy fleets"], "nodes": [{"tag": "h1", "text": "Desevro fleet"}, {"tag": "p", "text": "A fleet of the Imperial Navy was active on Desevro and was led by Captain Amos from the Tormentor until he was killed when the Tormentor became his only ship and was destroyed. The fleet consisted of several Star Destroyers that were all eventually lost."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Imperial Navy fleet at Desevro consisted of several Imperial II-class Star Destroyers, including the flagship Tormentor. Additionally, the fleet was composed of TIE/ln space superiority starfighters, which aided in the defense of Desevro."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Battle of Endor, the fleet at Desevro was under the command of Captain Amos aboard the Tormentor, and participated in several fleet battles over Desevro against the New Republic. The actions, considered pointless and reckless by the captain's colleagues, destroyed all of the fleet's vessels except for the Tormentor, which was heavily damaged by the time the ISD Overseer arrived in the region after contacting local Imperial officials that it was undertaking a delicate mission to locate Republic Project Starhawk. When the Overseer arrived, wreckage from the fleet's destroyed ships littered the space around Desevro, and Titan Squadron began tracking a New Republic convoy of engineers en route to Project Starhawk."}, {"tag": "p", "text": "At that time, Captain Amos and the Tormentor emerged from hyperspace and attacked the convoy, forcing the Overseer to defend the Republic convoy until its teams could board a GR-75 medium transport and secure its navigational data as the mission was endangered. By that time during the battle above Desevro, the Tormentor had sustained further damage, and was destroyed by a chain reaction of explosions that decimated the Tormentor after a Republic EF76 Nebulon-B escort frigate exploded near the ship."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The fleet at Desevro was under the command of Captain Amos, who was considered by other Imperials as trigger-happy and reckless."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}