{"url": "Desilijic/Legends", "categories": ["Category:Legends articles", "Category:Desilijic kajidic"], "nodes": [{"tag": "h1", "text": "Desilijic"}, {"tag": "p", "text": "Desilijic was a Hutt clan. It was bitter enemies with the Besadii clan. Members of the Desilijic clan were known for their appreciation of humanoid females, extravagant taste, hedonism and expensive palaces. Some of them also had a mutation that resulted in hair. It can also be said that Desilijic was one of the first of the Hutt clans from Varl, since it could be represented on the Hutt Ruling Council."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Notorious for being slavers, gangsters, and merciless kingpins, the Desilijic were one of the most ruthless Hutt crime clans in the galaxy."}, {"tag": "p", "text": "The Desilijic clan also controlled some of the most important podracing courses during the Old Republic era, including the Boonta Eve Classic and the Ando Overland, which gave them a de facto financial control over Tatooine and Ando Prime respectively. During the Old Republic, the Corporate Sector Authority repeatedly and vainly attempted to take the control of Ando Prime from the Desilijic clan; however, Zorba the Hutt's capture in 27 BBY was a harder blow for the Desilijic podracing interest, particularly as it coincided with a strong opposition to the sport."}, {"tag": "p", "text": "Jabba Desilijic Tiure was one of the most famous of all the Desilijic in the years of the reign of the Galactic Empire, having helped drive the clan from economic obscurity resulting from the days of Zorba's reign, to complete dominance over all other Hutt kajidics during the years 2 BBY to 4 ABY. Members of the clan associated themselves with numerous notorious criminal organizations, and many of the clan were killed in incidents of intra-clan and inter-clan rivalry."}, {"tag": "p", "text": "Jiliac Desilijic Tiron's Winter Palace was the home of the clan shortly before the Battle of Yavin."}, {"tag": "h2", "text": "Members"}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}