{"url": "Desolation_Station_transport", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Starships of the Galactic Empire", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Desolation Station transport"}, {"tag": "p", "text": "The Desolation Station transport was a transport vessel used by Desolation Station to transport components of the Death Star to it's construction site. As the transport was delivering the tributary beam, was infiltrated by the clone X2 during a Rebel raid on the Station. X2 used the attached Tributary Beam to destroy Desolation Station, severely delaying production time for parts to the Death Star."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The craft was similar in shape to certain Imperial star destroyers, matching the same engine configuration and overall shape. It was propelled by 4 engine units, 2 on each side of a small fin at the rear. There was also a hanger positioned near the bow of the ship, big enough to contain at least a few TIE Fighters. The transport also appeared to have a command tower similar in shape to the Victory II-class frigate."}, {"tag": "p", "text": "It was defended by 7 laser cannons, with 6 of them being positioned on towers around the top of the transport. The final cannon was placed on a mount located at the center of the vessel. While the tributary beam was merely being transported by the ship, it could be fired from the transport's weapons control room."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Near the beginning of the Galactic Civil War, this starship was used to transport parts between Desolation Station and the construction site of the Death Star. It was most notable during the Mission to Desolation Station, where it was being used to transport the final component of the Death Star's superlaser, the tributary beam. A force-sensitive clone by the name of X2 was recruited by Rahm Kota to infiltrate the asteroid base and disable the shield corridor protecting the transport, before using the tributary beam to destroy the station. After fighting his way through the base, X2 eventually disabled the shield corridor, and stole a TIE fighter."}, {"tag": "p", "text": "Assisted by Rebel X-wings, X2 eventually reached the transport and destroyed the turrets protecting the ship, before boarding it. The rebel agent then infiltrated the weapons control room and used the tributary beam to destroy Desolation Station, halting production time for Death Star components, at least for a short time. The Station's captain managed to survive the incident, but was executed by it's overseer and X2's brother, X1."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}