{"url": "Desolation_Station%27s_commander", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Articles with conjectural titles", "Category:Imperial Army officers of the Galactic Empire", "Category:Unidentified Galactic Empire personnel", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified military personnel"], "nodes": [{"tag": "h1", "text": "Desolation Station's commander"}, {"tag": "p", "text": "A Human male commander was in charge of Desolation Station, a facility that supplied the Imperial Death Star superweapon project. When the facility was destroyed by the Rebel Alliance, the commander was executed for his failure by the project's overseer, X1."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A light-skinned Human male individual, a captain serving the Galactic Empire during the Galactic Civil War, was the commander of Desolation Station, an asteroid-based facility that produced superlaser components for the Imperial Death Star superweapon. Between 2 BBY and 0 BBY, the last of those components, the tributary beam, was complete and ready to be delivered to the under-construction Death Star. However, the Rebel Alliance performed a raid on Desolation Station. Rebel Force-sensitive clone X2 hijacked the transport carrying the part and destroyed the facility with the help of the tributary beam. The commander managed to survive Desolation Station's destruction and was brought before X1, X2's brother who was serving the Empire. The Captain tried to explain his failure at Desolation Station, but X1 cut him off and ordered for his execution via blaster fire to his accompanying stormtroopers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The man was shown to try to make excuses regarding failures. At the time of his death, he held the rank of captain."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The captain wore the gray uniform of an Imperial Army pilot, complete with a helmet, during his command of Desolation Station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This individual appeared in the Nintendo DS version of the 2009 video game Star Wars Battlefront: Elite Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}