{"url": "Desolation_Station", "categories": ["Category:Canon articles", "Category:Imperial military bases"], "nodes": [{"tag": "h1", "text": "Desolation Station"}, {"tag": "p", "text": "Desolation Station was an Imperial outpost charged with overseeing the research behind the implementation of the Death Star, a massive weapon capable of destroying entire planets. Materiel pivotal in the design of the hyperdrive of the massive superweapon was shipped from the station to the Death Star's construction site over the planet Geonosis. During the weapon's construction, a convoy from Desolation Station was attacked by Berch Teller's rebel cell. Following the failed attack, Teller escaped while the rest of his cell was captured and tortured for information."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Death Star"}, {"tag": "p", "text": "Three years before the rise of the Galactic Empire, the Clone Wars ravaged the galaxy as Separatist systems, persuaded and led by the former Jedi Count Dooku, left the Galactic Republic in droves, leading to galaxy-spanning conflict. Shortly before the official beginning of the war, Geonosian scientists helped design a planet-destroying weapon known as the Death Star. The battle station's plans were given to Dooku, who delivered them in turn to his Sith Master, Darth Sidious. The construction of the superweapon began in secret over the planet Geonosis as the galaxy was mired in the chaos of the Clone Wars. As Sidious became Emperor, and formed the Empire from the ashes of the Galactic Republic, the Death Star's construction continued to progress."}, {"tag": "p", "text": "As construction continued, Desolation Station, together with Sentinel Base, played key roles in overseeing material shipments to the world. Such shipments often stopped at Rampart Station, a marshaling depot, before continuing on to Geonosis. Desolation Station also backed the extensive research behind the project. Scientists from across the galaxy tested hypermatter reactors and debated the positioning of the Death Star turbolaser's massive kyber crystals. Doctor Artoz, a scientist who later rebelled against the Empire, was one such scientist, and was enlisted at Desolation Station after three years of work had already taken place on the hyperdrive components of the Death Star. These scientists took security oaths to ensure that information about the secret weapon would not reach the ears of the Empire's opposition."}, {"tag": "p", "text": "Information about Desolation Station, such as shipping schedules, was considered top-secret even among the highest ranks of the Empire. Grand Vizier Mas Amedda was left largely in the dark, and even Tarkin had limited access to information related to the station."}, {"tag": "h3", "text": "Trouble with rebels"}, {"tag": "p", "text": "A large number of Imperials assigned to Desolation Station deserted their posts, thus making their way onto the most-wanted list of the Commission for the Preservation of the New Order, an Imperial agency also known as COMPNOR that was responsible for maintaining Imperial supremacy. Imperial scientists, including Artoz; officers, such as Captain Berch Teller, the station's head of security; and even mere warehouse workers fled the Empire in horror after Imperial actions such as the Antar Atrocity, a series of massacres which resulted in the deaths of a large number of Imperial loyalists as collateral damage. Many of the deserters joined a rebel cell and fought their own personal war against the Empire, spreading chaos whenever possible. Many of those remaining in the Empire's service believed Teller had been assassinated by COMPNOR, while rumors spread elsewhere that Teller had allowed information concerning the Antar Atrocity to surface, even bringing it to the ears of reporters such as Anora Fair and Hask Taff."}, {"tag": "p", "text": "Berch Teller, while he was Desolation Station's head of security, had access to information pertaining to Wilhuff Tarkin's corvette, the Carrion Spike. This may have led to the theft of the ship later carried out by Berch Teller and his rebel cell. The theft of the Carrion Spike allowed the group to attack key Imperial locations, such as Galidraan Station."}, {"tag": "p", "text": "These rebels kept tabs on the convoys being sent to Sentinel Base from Desolation Station. At one point, a convoy carrying materials and technology was scheduled to travel from Desolation Station to Geonosis, via a moon coreward of the Gulf of Tatooine, the planet Pii, and Sentinel Base. The rebel cell attempted to disrupt this convoy over the Gulf's moon, estimating that the attack would set work at Desolation Station back roughly four years. This endeavor ultimately failed, and Teller's crew was captured and interrogated—though Teller himself escaped—ending the insurrection."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "After Teller's cell was defeated, Tarkin met with the Joint Chiefs of the Imperial Army and Navy, as well as several officers overseeing intelligence agencies. Together, they reconfigured the schedules and personnel of Desolation Station, performing thorough background checks on each scientist and officer stationed there. They dictated that no shipments would travel without ample defense, and restricted the HoloNet to Imperial use only. Many saw the latter action as evidence of an imminent Imperial takeover of the Outer Rim. Tarkin also formed regulations greatly restricting contact between workers on Geonosis and the galaxy, and formed defensive flotillas around Geonosis and Desolation Station. Pirates and smugglers in the surrounding space were hunted down, and the officers in charge of the search were ordered to kill them on sight."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Desolation Station first appeared in the Nintendo DS version of Star Wars Battlefront: Elite Squadron, a Star Wars Legends video game that was released on November 13, 2009, before the Expanded Universe was discontinued on April 25, 2014. The location became canon when it was mentioned in Tarkin, a novel written by James Luceno that was released on November 4, 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}