{"url": "Desolator_crisis", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Desolator crisis", "Category:Proxy wars of the Cold War (Galactic Republic–Sith Empire)"], "nodes": [{"tag": "h1", "text": "Desolator crisis"}, {"tag": "p", "text": "Near the end of the Cold War between the Galactic Republic and the reconstituted Sith Empire, a military crisis erupted in 3643 BBY when the Sith Lord Darth Angral waged a personal war of vengeance upon the Republic and the Jedi Order in order to gain vengeance for the death of his son Tarnis at the hands of a young Jedi Knight. After Tarnis's attempt to use the Republic superweapon known as the Planet Prison against the Republic's capital planet of Coruscant failed, his father put Tarnis's final gift—information on the rest of the Republic superweapon initiative—to use and dispatched his three Sith apprentices, Lords Praven, Sadic, and Nefarid, to take control of the Republic's weapons facilities on Tatooine, Nar Shaddaa, and Alderaan. While the Empire publicly disavowed Angral's actions, they secretly lent him support, supplying his apprentices with support from the Imperial Military and dispatching the Imperial spymaster Watcher One to capture the Republic scientist Nasan Godera on the planet Taris."}, {"tag": "p", "text": "Unable to authorize a military response, General Var Suthra sent the Jedi Knight who killed Tarnis on missions across the galaxy with the astromech droid T7-O1 and the Padawan Kira Carsen to halt Angral's plans. After gathering information on the planet Ord Mantell, the Knight rescued Doctor Godera from Watcher One on Taris, but Agent Galen of the Republic Strategic Information Service—the Republic's intelligence agency—was captured and converted into an unwilling slave by Sadic using the Power Guard supersoldier project on Nar Shaddaa. However, the Knight and Galen were able to defeat Sadic and destroy the Power Guard project, preventing Angral's apprentice from creating an army of mind-controlled supersoldiers from the refugees on the moon. The Sith Emperor himself intervened in the conflict in an attempt to recover Carsen; the Sith ruler sent Valis—a Child of the Emperor, an extension of the Emperor's own will—to lure out and capture Carsen, but the Knight and the former Child defeated the Sith."}, {"tag": "p", "text": "Angral's other apprentices were also successful in capturing their assigned weapons projects, with Praven defeating the Jedi Master Bela Kiwiiks who was sent to guard the Shock Drum on Tatooine and Nefarid trapping Master Orgus Din in a ruined laboratory after stealing the Death Mark laser. However, Praven was disgusted by his own Master's dishonorable actions and was convinced to abandon the Sith by the Knight, and the Jedi was able to rescue Kiwiiks from near-death and destroy the Shock Drum before it tore Tatooine apart. The mission to Alderaan was hampered by the interference of an Imperial spy named Aleyna Hark, but the Knight and crew managed to prevent the assassination of the Alderaanian noble Horis Thul—an action that also saved the budding peace negotiations that were working towards ending Alderaan's brutal civil war. But though the Jedi defeated Angral's apprentice Nefarid and destroyed the Death Mark laser, Orgus Din's attempt to infiltrate Angral's warship Oppressor and confront his old enemy ended in the Jedi Master's death."}, {"tag": "p", "text": "The crisis reached its height when Angral, having constructed a superweapon known as the Desolator by combining the Republic's weapon technologies, tested his new weapon on the Republic agriworld of Uphrades. The attack, which devastated Uphrades's surface and killed millions, was also intended to draw out Tarnis's killer, and Angral set up a confrontation by attacking the Jedi Order's homeworld of Tython. While the Desolator recharged, the Knight and Carsen boarded the Oppressor and disabled the superweapon before confronting Angral on the bridge of his warship. The resultant battle saw the death of Darth Angral and the destruction of the Oppressor, signalling the end of the Desolator weapon and the current crisis, but Angral's war was one of several factors that led to the dissolution of the Treaty of Coruscant and the resumption of war in the months that followed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The crisis involving the Desolator superweapon centered around two powerful Force-users and their apprentices: Jedi Master Orgus Din and the Sith Lord Darth Angral. The two humans were bound by a rivalry that stretched back to the last days of the Great Galactic War between the Galactic Republic and the Sith Empire, where the pair fought before the Senate Building during the Sacking of Coruscant in 3653 BBY. When the Treaty of Coruscant ended the twenty-eight-year conflict and forced the galaxy into a tense Cold War, Angral was furious at the lost advantage over the Republic, and his anger only grew over the next decade. Orgus Din and the Jedi Order, meanwhile, retreated to their recently rediscovered homeworld of Tython in the Deep Core and began to slowly rebuild their strength."}, {"tag": "p", "text": "Over the next ten years, Angral trained two further apprentices, Nefarid and Sadic, to the status of Sith Lord, while his former student Praven trained Angral's own son Tarnis in the ways of the dark side. Din's apprentice Bengel Morr had been present during the destruction of the Jedi Temple on Coruscant during the Sacking, and was presumed dead—however, Morr had in fact survived, going insane and turning to the dark side and would marshal the native Flesh Raiders of Tython against the Jedi Order in the weeks leading up to the Desolator crisis. Morr and his forces were defeated, however, with the help of Din's new apprentice, whom the Jedi Master met after witnessing the learner defeat Morr's own apprentice Callef with only a vibrosword. Feeling that the Force had drawn them together, Din decided to take on the young Jedi as his Padawan, and the two investigated the recent activity on Tython. After the apprentice rescued Din from Morr and defeated the Dark Jedi in a duel, the Padawan was granted the rank of Jedi Knight and sent to the Republic capital of Coruscant to aid Jedi Master Bela Kiwiiks and her Padawan Kira Carsen investigate a dark presence that the Jedi High Council had sensed there."}, {"tag": "p", "text": "That dark presence, which Kiwiiks was able to confirm upon her arrival on Coruscant during the war with the Flesh Raiders, was actually Angral's son Tarnis, deep undercover as a Republic scientist named Eli Tarnis. Under this alias, Tarnis had joined the Republic superweapon initiative, the Republic's weapons division, several years earlier and quickly became the head of the development team for the Planet Prison superweapon. The Planet Prison, a device that ionized a planet's atmosphere in order to blockade enemy worlds without excessive naval force, was one of several weapons projects started by the Mon Calamari general Var Suthra in the aftermath of the Sacking of Coruscant. Suthra, who had witnessed the destruction of the Jedi Temple, founded the projects in honor of the Jedi who had fallen during the defense of their home as a way to end the next war with minimal loss of life."}, {"tag": "h2", "text": "The crisis"}, {"tag": "h3", "text": "Early battles"}, {"tag": "h4", "text": "The Planet Prison"}, {"tag": "p", "text": "The Planet Prison prototype became ready for field tests in 3643 BBY, but Tarnis felt that his position was threatened when Kiwiiks detected traces of his presence in the Force. Worried that further investigation would reveal his true identity, Tarnis contacted the Black Sun criminal syndicate and introduced himself as a Sith Lord. In exchange for advanced Imperial weapons and armor, Black Sun agreed to aid Tarnis in his plans to escape Coruscant. A Rodian thief named Vistis Garn who often worked for Black Sun's rival, the Migrant Merchants' Guild, was hired to use the Guild to steal the design files for the Planet Prison, and he raided a warehouse belonging to the Republic Military with a team of Guild personnel. While stealing a large number of weapons and munitions for the Guild, Garn employed the team's slicer to hack into the warehouse's computer systems and steal the design files for the Planet Prison and the Republic's other superweapon projects."}, {"tag": "p", "text": "However, Garn's face was glimpsed by a security camera, and the Republic Strategic Information Service—the Republic's intelligence agency—was able to identify the Rodian from the security footage almost thirty-two hours later. Around that time, Orgus Din's former apprentice arrived on Coruscant and reported to Conference Room 2-Aurek in the Senate Building, where Masters Kiwiiks and Din were discussing the stolen Planet Prison files with General Suthra, Doctor Tarnis, and Kiwiiks's Padawan Carsen. Not long after the recently-Knighted Jedi arrived at the Senate Building with the astromech droid T7-O1, also known as Teeseven, the SIS Agent Galen—the head of the SIS branch located in the Senate Building—interrupted the meeting to report the break in the case. General Suthra and the Jedi Masters departed for a meeting with Supreme Chancellor Dorian Janarus, leaving Galen to work with the Knight, Carsen, and Teeseven on retrieving the files."}, {"tag": "p", "text": "Galen's subordinates were able to track Garn's team to a warehouse in the Guild-controlled Old Galactic Market region, and Galen dispatched the Knight and Teeseven to retrieve the stolen files and weapons. Making their way to the warehouse, the pair raided the warehouse, but by that time Garn had used the Guild's slicer to decrypt the files and send a copy to Black Sun. At the same time, Tarnis contacted Salarr, the leader of Black Sun, and set the next stage of his escape plan into action: Tarnis transmitted inside information on the security of the Senate Building to Black Sun, allowing a team led by a man named Zeer to infiltrate the building, incapacitate the Republic Military personnel and Coruscant Security officers guarding the doctor, and make it out with Tarnis undetected. Agent Galen and the SIS discovered Tarnis's absence just minutes before the Knight contacted him to report the successful recovery of the stolen weapons and files, and Kira Carsen set off with a CSF team in pursuit of the kidnappers as they fled across the Senate Plaza. Some of the kidnappers, including Tarnis, split off from the others at the Plaza's taxi pad, traveling to Black Sun territory, while Zeer led the rest into the Coruscant Spaceport as a distraction."}, {"tag": "p", "text": "Though Tarnis himself diverted from the Black Sun members to make his way to the sector under the control of his allies in the Imperial-friendly Justicars' Brigade Zeer's men barricaded themselves in Docking Bay 84 and became embroiled in a firefight with Carsen and the CSF officers. Not long afterwards, the Knight and Teeseven returned to the Senate Building and delivered the files to Agent Galen, who handed them off to Krand and his other analysts before sending the Jedi to reinforce Carsen. With Carsen's use of a stealth field generator, the two Jedi and Teeseven were able to break the criminals' lines and capture Zeer, and the Padawan tricked Zeer into revealing where Tarnis had actually been taken by pretending to read his mind. However, during the fight in the spaceport, the SIS discovered that the stolen files had included information on the entire Republic superweapon initiative, putting the offworld weapons facilities at risk of discovery. As a result, Din, Kiwiiks, and Galen each departed Coruscant to secure one of the offworld facilities, traveling to Alderaan, Tatooine, and Nar Shaddaa respectively."}, {"tag": "p", "text": "The Knight and Teeseven, meanwhile, traveled to Black Sun territory in pursuit of the kidnapped doctor, where Sergeant Nidaljo and his CSF Special tactical unit had been driven back into a nearby apartment building after their attempt to gather information on Black Sun's headquarters in expectation of the Jedi's arrival. After breaking the Black Sun siege of Nidaljo's men, the Knight was able to inspire the disheartened sergeant to continue the mission, and the Jedi and Teeseven launched an assault on the Black Sun base's front entrance while the CSF officers attacked the rear entrance. The Knight and Teeseven reached the building's command center before the CSF officers, only to find Salarr communicating with a hologram of a hooded Tarnis. Revealed to be a Sith Lord, Tarnis ordered Salarr to kill the Jedi before terminating the transmission, but the arrival of Nidaljo and his men saved the Knight from one of the criminals' attempt to sneak up on the Jedi. The police officers and the Knight fought Salarr and his men and killed the gang leader, dealing a significant blow to Black Sun, but the Jedi and Teeseven returned to the Senate Building to discuss what to do about Tarnis's betrayal."}, {"tag": "p", "text": "After ending the communication with Salarr, Tarnis contacted the Planet Prison design team in the persona of Eli Tarnis and urged his subordinates to bring him the weapon prototype in the Justicars' Sector, claiming that the Jedi were trying to shut down the project. The team believed their leader and departed with the prototype before General Suthra was alerted to Tarnis's true identity, and the general was furious to discover their apparent treason. Having tracked Tarnis's signal to the Justicars' Tower in the Justicars' Sector, Suthra dispatched the Knight to locate Tarnis, and Carsen accompanied her fellow Jedi instead of Teeseven in case they were forced to battle the Sith. While the two Jedi were fighting their way through the hostile Justicars to reach the center, however, the Planet Prison design team met with Tarnis. Revealing himself as a Sith Lord, he murdered four of the five scientists with Force lightning before departing with the prototype, though the fifth scientist—a man named Jonkan—was only mortally wounded. Jonkan survived long enough to see Carsen and the Knight's arrival, and with his dying breaths he told the two Jedi that they could locate the Planet Prison by its immense heat signature."}, {"tag": "p", "text": "Tarnis had in fact taken the Planet Prison to the ruins of the Jedi Temple, and a thermal scan of the surrounding regions alerted his Jedi pursuers to his location. Making their way through the industrial zone known as The Works and fighting through the Imperial soldiers who were present in the ruins of the Temple, the two Jedi located Tarnis and the Planet Prison, only to interrupt a holocommunication he was making with his father and Angral's three apprentices. Urged on by Darth Angral, Tarnis dueled Carsen and the Knight before a hologram of his father, Praven, Nefarid, and Sadic, and Angral was horrified to see his son struck down by the Knight's blade. Furious, Angral declared undying hatred for the Jedi and promised to use the Republic's own weapons to kill billions. Carsen and the Knight were able to deactivate the Planet Prison before it fired, however, and the two returned to the Senate Building to report success to General Suthra."}, {"tag": "p", "text": "Meanwhile, Angral—making use of the files on the Republic superweapons sent to him as a final gift from his son—dispatched his apprentices to take control of each of the Republic's offworld facilities. Praven was sent to secure the Shock Drum weapon on Tatooine, Sadic to capture the Power Guard supersoldier project on Nar Shaddaa, and Nefarid to seize the Death Mark laser on Alderaan. Angral also secured the aid of the Imperial Military and Imperial Intelligence, despite the Empire's public disavowment of Angral's actions, and sent complements of Imperial soldiers to support his apprentices. Watcher One, an experienced agent of Imperial Intelligence, was sent to the planet Taris in order to locate Doctor Nasan Godera, the scientist responsible for designing the technologies that the Republic superweapon initiative were weaponizing."}, {"tag": "h4", "text": "Ord Mantell"}, {"tag": "p", "text": "Upon returning to the Senate Building, the Knight and Carsen discussed the situation with General Suthra and the Jedi Order's Grand Master Satele Shan, who was in holoconference from Tython. Suthra had already consulted the Galactic Senate on the matter of Angral, who was flooding all available comm channels with threats vowing revenge, but the Senate refused to authorize a military response on account of the Empire's declaration that Angral had gone rogue. However, the SIS had been able to track Angral's transmission as far as Ord Mantell, prompting General Suthra to send the Knight there to uncover the source of the transmission. Agreeing, the Grand Master appointed Carsen as the Knight's own Padawan in the absence of Master Kiwiiks, and Suthra had a Defender-class light corvette delivered to the Coruscant Spaceport for the Knight. Taking their new ship, the two Jedi and Teeseven traveled to Ord Mantell and docked at the Ord Mantell Orbital Station before contacting General Suthra."}, {"tag": "p", "text": "After the Knight's departure, Suthra contacted the SIS agent on Ord Mantell, a man named Ottau, and ordered him to perform reconnaissance of the recently detected Imperial base on a small island to the north of the larger island Avilatan. Ottau was able to determine the base's outer defenses before his probe droids were destroyed, and he returned to the Republic Military's base of Fort Garnik to await the Jedi's arrival. On Suthra's advice, the Knight took Teeseven along so that the droid could slice into the Imperial base's computer systems, and the two left Carsen behind to guard the ship while they rendezvoused with Agent Ottau. Following Ottau's directions, the pair fought through the Imperial defenders and descended into the subterranean complex, and after defeating the final Imperial—a lieutenant named Marcovic—the Knight stood watch while Teeseven sliced into the listening post's systems and retrieved records of the files and transmissions sent to Angral from Tarnis."}, {"tag": "p", "text": "However, while the Knight and Teeseven were on Ord Mantell's surface, Carsen was identified by operatives of Imperial Intelligence aboard the space station, and the Imperials alerted Darth Angral. The Sith Lord and his retainers traveled almost twenty parsecs to capture and interrogate Carsen as to her Master's whereabouts, though Carsen was able to trick Angral into believing that the Knight was on Corellia. Angral departed the station with Admiral Hacklin and his other retainers to follow up on her information, though he left behind the Sith Inquisitor Ferav to keep her hostage in case she was lying with express orders not to kill her. Upon returning to Agent Ottau, who began organizing a team to take control of the now defenseless Imperial base, the Knight and Teeseven returned to their ship, only to find Ferav as well as several Imperial soldiers and Sith acolytes holding Carsen hostage. However, Ferav and his reinforcements were unable to defeat Teeseven and the Jedi, and the pair contacted General Suthra with their success after the fighting."}, {"tag": "h3", "text": "War"}, {"tag": "h4", "text": "The Architect of Annihilation"}, {"tag": "h4", "text": "The Power Guard Project"}, {"tag": "h4", "text": "A surprise encounter"}, {"tag": "h4", "text": "The Shock Drum"}, {"tag": "h4", "text": "The Death Mark laser"}, {"tag": "h3", "text": "Showdown"}, {"tag": "h4", "text": "Collateral damages"}, {"tag": "h4", "text": "Battle above Tython"}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The events of the crisis were highly classified in Republic files—the name of the Hero of Tython was redacted from the personnel files of those involved in the campaign, as were the names of the planets where the Republic's superweapon projects were located."}, {"tag": "h2", "text": "Notable participants"}, {"tag": "h3", "text": "Jedi Order"}, {"tag": "h4", "text": "Hero of Tython"}, {"tag": "p", "text": "The Jedi Knight that would become known as the Hero of Tython was the student of Jedi Master Orgus Din."}, {"tag": "h4", "text": "Kira Carsen"}, {"tag": "p", "text": "The human female apprentice of Jedi Master Bela Kiwiiks, Kira Carsen was originally a Child of the Sith Emperor until she fled Sith Space as a child. Carsen lived among refugees on Nar Shaddaa until she was discovered by Kiwiiks, who took her back to the Order as her student. During the early days of the crisis, she worked closely with the Republic Strategic Information Service to aid the former apprentice of Orgus Din in tracking down the Planet Prison superweapon. After the Jedi Knight and Carsen defeated the Sith Lord Tarnis in the ruins of the Jedi Temple, she became the older Jedi's apprentice and journeyed to Tatooine in an attempt to secure the Shock Drum weapon. Together with the Knight and T7-O1, Carsen fought the forces of Darth Angral on several worlds in order to destroy the captured Republic superweapons, and her past as a Child was revealed to her master when the Emperor sent a fellow Child named Valis to recover her. After his defeat, Carsen agreed to tell the Jedi Council about her past, and the trust her teacher placed in the young Padawan continued to serve in the Order. In the final weeks of the crisis, Carsen helped rescue her former master Kiwiiks on Tatooine, and faced Darth Angral aboard the Oppressor in a final duel. However, she was possessed by the Sith Emperor during the fight, and was forced to fight her own master until she successfully purged herself of the Emperor's mental control. For her actions during the crisis, she was elevated to the rank of Jedi Knight by the Council, and continued to serve alongside the Knight and T7 during the Galactic War."}, {"tag": "h4", "text": "T7-O1"}, {"tag": "p", "text": "A T7-series astromech droid with a long and storied history, T7-O1 served the Jedi Order as a reconnaissance droid on Tython after his former partner, Jedi Master Ven Zallow, was killed by the Sith Lord Darth Malgus during the fall of the Jedi Temple."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Orgus Din"}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "h4", "text": "Var Suthra"}, {"tag": "p", "text": "A male Mon Calamari veteran of the Great Galactic War, Var Suthra served in the Republic Military during the Sacking of Coruscant and witnessed the devastation of the Jedi Temple from afar. In an attempt to honor the Jedi who were killed during the attack, Suthra started a series of superweapon projects in an attempt to end the next war with minimal casualties."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Galen"}, {"tag": "p", "text": "An agent of the Strategic Information Service, Galen was stationed on the capital during the Cold War. By the time of the beginning of the crisis, Galen had risen to head the SIS unit based in the Senate Tower, and he reported directly to General Var Suthra. When the Planet Prison files went missing, Galen's unit handled the investigation, and Galen worked directly with the Knight to recover the stolen data. After the Jedi discovered that the Republic's weapons facilities were no longer secure, Galen agreed to investigate the Power Guard Project on Nar Shaddaa while Jedi Masters Din and Kiwiiks traveled to Alderaan and Tatooine. However, Galen walked into a trap—he was captured by the forces of Lord Sadic and subjected to the Power Guard procedures, placing the now-cybernetically-enhanced SIS agent under Sadic's command. When the Knight arrived to locate Galen, Sadic used the agent in his attempts to stop the young Jedi, but the Knight helped Galen overcome his conditioning when the Jedi refused to kill him. In a vain attempt to end his life with purpose, Galen attacked Sadic's lab alone and was defeated by the Power Guards under the Siths' control. Fortunately, Galen survived and later worked with the SIS to control his implants, going deep undercover in Imperial territory."}, {"tag": "h4", "text": "Nasan Godera"}, {"tag": "p", "text": "A human male scientist who worked for the Galactic Republic during the Great Galactic War, Doctor Nasan Godera was widely considered a genius in the field of advanced military technology. A staunch opponent of the Empire, Godera was furious when the Republic submitted to the Treaty of Coruscant, and resigned in protest before secretly retiring to the ruined world of Taris. There, the scientist built a series of laboratories manned by droid assistants, and continued his work over the next decade until he was swept up in the Desolator crisis. The SIS had long suspected that Godera was present on Taris, and Angral acted upon this information in the files sent to him by his son and sent Imperial Intelligence to capture the scientist."}, {"tag": "h3", "text": "Sith Empire"}, {"tag": "h4", "text": "Darth Angral"}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Tarnis"}, {"tag": "p", "text": "The son of Darth Angral, Tarnis failed at his attempt to complete his father's work of destroying the Republic, but his death served as the catalyst for Angral to declare war on the Republic. Trained by Angral's own apprentice Praven, Tarnis went undercover as a Republic scientist named Eli Tarnis to infiltrate the Republic superweapon initiative and rose to become the head of the Planet Prison project by 3643 BBY."}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Watcher One"}, {"tag": "p", "text": "The man known as Watcher One was a shadowy member of Imperial Intelligence, long at the top of the SIS's most wanted. A master spy with years of experience, Watcher One surprisingly remained a man of principles despite his work with the Sith Empire, and served the Empire out of honor and and a sense of duty more than any true loyalty to the government's ideals. When Darth Angral assigned him to Taris to retrieve Doctor Godera, the operative suspected that the Jedi Knight who had killed Tarnis would also attempt to locate the scientist, and prepared for the eventuality."}, {"tag": "h4", "text": "Sadic"}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Praven"}, {"tag": "p", "text": "A Sith Pureblood member of a long-standing family in the Sith Empire, Lord Praven was one of Darth Angral's three apprentices during the Great Galactic War and the Cold War. One of the fifty Sith who stormed the Jedi Temple under the command of Darth Malgus and Lord Adraas during the Sacking of Coruscant, Praven defeated Jedi Master Usma in combat. He later taught Angral's son Tarnis as a Sith, completing the man's training by the end of the Cold War. During the crisis after Tarnis's death, Angral sent Praven to Tatooine to secure the Shock Drum superweapon. On that desert world, Praven successfully wrested control of the device with minimal casualties, as his staunch values of honor and loyalty caused him to view senseless killing of innocents with disdain. When he encountered the Jedi Master Bela Kiwiiks, who was also in search of the weapon, he subdued her and complied with Angral's orders to leave her to die with the activated Shock Drum, despite his regret. Paven's honor drove him to challenge the Knight to a duel for the Shock Drum's codes, but the Jedi was able to convince the Sith Lord to become a Jedi after defeating Praven in their duel."}, {"tag": "h4", "text": "Nefarid"}, {"tag": "p", "text": "A diminutive, cruel human, the man known as Nefarid was trained as a Sith Lord by Darth Angral during the decade following the Treaty of Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Desolator crisis appears in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare and LucasArts on December 20, 2011. It serves as the in-universe events of the story presented in the Prologue and Act I of the Jedi Knight storyline, and as such is subject to certain elements of game mechanics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}