{"url": "Despot_Army", "categories": ["Category:Legends articles", "Category:Military units", "Category:Pre-Republic"], "nodes": [{"tag": "h1", "text": "Despot Army"}, {"tag": "p", "text": "The Despot Army was the military force loyal to the Shikaakwan Kral Hadiya. Consisting of conscripts and volunteers from across the Settled Worlds of the Tython system, the army was fueled by their fear and hatred of the Je'daii Order on Tython."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "When Kral Hadiya united the Nine Houses of her homeworld Shikaakwa, Hadiya began planning a massive attack on Tython and the Je'daii Order which resided there. Growing an army made up of volunteers from across the Settled Worlds, Hadiya became known as the Despot Queen and armed her loyal soldiers with arms produced on Nox. Outnumbering the Je'daii, the Despot Army moved against Tython in what would be known as the Despot War. Fueled by their hatred and fear of the Je'daii, the army fought fiercely and viciously against the Je'daii despite being unable to defend against the Force."}, {"tag": "p", "text": "Among Hadiya's inner circle were a group of generals who displayed their loyalty to Hadiya and the cause since before the war. Among them was her chief adviser, the Twi'lek Bakko; the Iktotchi Ka'un Damm; Fists Shri-Lan and Gav Vannar; and Je'daii traitor Daegen Lok. While Lok rose to be the Queen's most trusted general and lover, he was secretly an assassin waiting to strike. As the Despot Army launched its greatest strike against the Order at Kaleth, Lok murdered Hadiya in her bedchamber and the army dissolved to in fighting and succession disputes with millions killed. Those who survived were taken off Tython and returned home if they could. Many were banished from their homeworlds as the planetary governments condemned Hadiya's war of aggression. Even a decade after the conflict, many still felt a deep-seated sense of distrust of the Je'daii."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}