{"url": "Desrini_District", "categories": ["Category:Legends articles", "Category:Coruscant districts"], "nodes": [{"tag": "h1", "text": "Desrini District"}, {"tag": "p", "text": "The Desrini District was a civic district in the northern hemisphere of the Republic's capital planet of Coruscant, near the CoCo District. In 22 BBY, the entire district was evacuated after a garbage launcher misfired, spreading toxic waste over the area. Forty-eight individuals were killed, with more than 200 injured. Investigations into the matter led to the discovery of a group of squatters who had been living in the canister's launch tube, resulting in the misfire. The district was quarantined while cleanup was under way, and some Coruscanti politicians used the disaster to argue for more regulations on immigration into Coruscant, saying that the unregulated immigration had caused the Desrini District to become overpopulated, forcing the squatters to live in the launch tube. Due to the large amounts of biological toxins released by the disaster, numerous dianogas—large cephalopod scavengers—infested the district, killing at least 25 more residents."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Desrini District was a civic district in the northern hemisphere of the Galactic Republic's capital world of Coruscant, near the CoCo Town District. The Desrini District was constructed sometime prior to 22 BBY, and had several spaceports that were heavily overcrowded, some said due to illegal immigration into Coruscant. Due to the district's overpopulation, many of its residents were homeless, some of whom lived wherever they could find shelter. Several different species lived in the district, including Humans, Cereans, Trandoshans, and Advozses."}, {"tag": "p", "text": "In 22 BBY, Waste Canister Delivery Port 84-D-21—a garbage launcher situated in the Desrini Disrict—misfired its payload of industrial waste sealed in a shielded container, destroying four city blocks and filling the district's atmosphere with the container's highly toxic payload. As a result, the district was forced to be evacuated while Coruscant Rescue Ops began a district-wide sanitary cleanup. A month after the accident, most of the district's residents were left homeless, and large amounts of garbage began to pile up in the district's lower levels."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Twenty-two years before the Battle of Yavin, the Desrini District suffered disaster when a garbage launcher, Waste Canister Delivery Port 84-D-21, misfired its regularly scheduled payload of industrial refuse due to a previously unknown obstruction in its launch tube. The waste canister shredded into pieces in the launch tube, causing the entire cannon assembly to collapse, destroying four of the district's city blocks in the process. The delivery port's collapse killed at least 48 of the district's residents and injured over 200 more. Rescue crews from the district's local Coruscant Rescue Ops department arrived at the accident site in less than half an hour and immediately began to recover survivors and attend to the injured."}, {"tag": "p", "text": "Rescue Ops later identified the cannon's obstruction as a small shantytown made up of at least four refugee families that were living in the launcher's barrel, between the canon's fourth and fifth accelerator gate. The squatters had tapped into the launcher's energy grid, which disabled its obstruction sensors, which would have warned about the shantytown before the canister's launch."}, {"tag": "p", "text": "The waste canister contained 115 highly toxic metric tons of concentrated industrial waste—including hyperbaride runoff, tricorrinium hexifluorine and destabilized hrucium—which was spread over the disaster site when the canister exploded, and emergency workers were forced to dress in full toxgear to carry out rescue efforts. The Coruscant WeatherNet canceled prevailing winds in the area, but natural air currents caused by undercity convection began to spread a dangerous cloud of industrial toxins across the Desrini District, forcing all nonpressurized structures in the district to be evacuated. Once the evacuation was complete, rescue crews began a district-wide cleanup of the hazardous waste."}, {"tag": "p", "text": "After the catastrophe, the Coruscant Ministry of Ingress—which regulated immigration into Coruscant—issued new restrictions on all inbound interstellar flights into Coruscant, aimed at reducing illegal immigration into the Galactic City. The new regulations were created partially due to the canister misfire in the Desrini District, with Ingress Minister Zelebitha Effhod claiming that the squatter families had been forced to live in the garbage launcher's cannon barrel because they had nowhere else to live, due to Desrini's overpopulation caused by multitudes of unauthorized immigrants moving into the district."}, {"tag": "p", "text": "One month after the canister's misfire, the Desrini District continued to be plagued with problems. Many of the district's residents were left homeless after the accident, and heaps of garbage from the destroyed canister began to pile up in the district's lower levels. Due to the large trash pileup, many dianogas—large cephalopod scavengers—infested the district, attracted to the organic waste. The dianogas attacked the district's homeless, killing at least 25, and social activists on behalf of the destitute warned that the scavengers might spread to nearby districts, including CoCo Town."}, {"tag": "p", "text": "The disastrous events of the Desrini District were reported on by HoloNet News in several small articles that year."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Desrini District first appeared in the in-universe HoloNet News Vol. 531 50 article \"Garbage Launcher Misfire Kills 48; Closes Desrini,\" posted on the HoloNet News website on April 4, 2002. The district later appeared in HoloNet News article's \"Coruscant Restricts Immigration\" and \"Desrini Plagued by Dianogas,\" released in HoloNet News Vol. 531 51 on April 11, 2002, and in HoloNet News Vol. 531 55 on May 9, 2002, respectively. The Desrini district was also mentioned in StarWars.com Databank entry on the Coruscant Rescue Ops, and was given its own entry in The Complete Star Wars Encyclopedia, which was released on December 9, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}