{"url": "Destor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Ukians"], "nodes": [{"tag": "h1", "text": "Destor"}, {"tag": "p", "text": "Destor was a male Ukian from the planet Ukio who served as an assistant to the Liege during the Clone Wars. A downcast individual, Destor was present to welcome a Galactic Republic team led by the Zabrak Padawan Tyzen Xebec to inspect Ukio's defenses. The assistant was able to prevent the Liege from offending the newcomers before the Republican guests began their inspection tour."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Destor was a male Ukian who lived on Ukio during the Clone Wars. He served as an assistant to the planet's ruler, the Liege. The world was subject to an inspection of its considerable defense systems, as agents of the Galactic Republic, the Jedi, suspected that the planet was being targeted by the Confederacy of Independent Systems. Destor accompanied the Liege to a meeting with the inspection team, and made sure the meeting location was secure at his master's bidding. The Ukian noted that there were no disturbances to speak of."}, {"tag": "p", "text": "The Republic team was led by Jedi Padawan Tyzen Xebec. The Liege was taken aback by this, and nearly made a derisive comment before Destor interjected, suggesting that his master was impressed by the young Zabrak. Xebec then decided to meet with the Ukian workers, while his clone troopers, led by Clone Commander Ganch, would inspect the defense facilities. The Republic team would later repel an incursion by the Confederacy, but the resultant chaos led to the ousting of Destor's Liege. Eventually, agents of the Confederacy merely bought a controlling interest in the planet, placing it directly under their control."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Destor was a sullen individual, reporting that the location of the Liege's meeting with the Jedi arrival was as \"dead as a tomb\" and thus earning mockery from his master. The Ukian would also interject, offering appropriate words when his Liege was lost for them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Destor first appeared in the webcomic The Clone Wars: Act on Instinct, written by Pablo Hidalgo and published in 2009. He was introduced in the sixth installment of the webcomic, and was drawn by Thomas Hodges."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}