{"url": "Destroyer_Down", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures: Destroyer Down", "Category:Star Wars Adventures lead stories"], "nodes": [{"tag": "h1", "text": "Destroyer Down"}, {"tag": "p", "text": "\"Destroyer Down\" is a story featuring Rey during her time on Jakku. It was published as the main story of the Loot Crate exclusive comic Star Wars Adventures: Destroyer Down and it was released on December 20, 2017."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet Jakku a storm was in full force, causing strong winds and lightning. In the wrecked Hellhound Two, Rey was preparing to eat her polystarch portion bread when the hatch to the walker blew off, causing sand to flying into her home and get all over her foodstuff."}, {"tag": "p", "text": "After, she arrived to Niima Outpost where she greeted Bobbajo who told her that there was news from Unkar Plutt. Plutt gathered around all the scavengers and told them about the Galactic Empire's last stand against the New Republic on the planet. He then revealed that only one of the Imperial starships had yet to be plundered. One of the scavengers, Teedo didn't believe Plutt's claims but Plutt ordered the large Abednedo, Roodown to throw the scavenger out. Rey convinced constable Zuvio to rescue Teedo by slicing off the cyborg hand of Roodown."}, {"tag": "p", "text": "Plutt revealed the Imperial ship to the scavengers. The Spectral was on the Empire's most feared dreadnaughts. The dreadnaught was rediscovered after the storms had moved the sands over the past few days. Rey and the other scavengers recognized the ship as the \"Ghost Ship.\""}, {"tag": "p", "text": "One of the scavengers explained that the ship was haunted but an active Imperial squadron was stationed there who were awaiting inspection from Emperor Palpatine, who was unbeknownst to them, already killed. But another scavenger told a different story of the Imperial squadron being hunted by ewoks who were previously caged on the ship."}, {"tag": "p", "text": "Rey questioned why Plutt was sending the scavengers on the mission. She told him that there was nothing to stop her and her fellow scavengers from taking the scraps of the ship for themselves. But Plutt reminded her that he controls the market at Niima Outpost and that they work for him. Plutt pulled out a flag to be used to claim the ship for him."}, {"tag": "p", "text": "While he was speaking, Rey stole the flag and took off in her speeder. He order the other scavengers to follow her and take any scraps she finds for Plutt. But Zuvio ordered Roodown to alert his employers to not harm Rey as he believed she was destined to do bigger things."}, {"tag": "p", "text": "Meanwhile, Rey arrived at the wrecked ship and but she began to have a bad feeling about the job. She then drove really fast with her speeder up a steep sand dune as Sarco Plank and the other scavengers watched her. She quickly leaped off the speeder and grabbed on to the side of the ship. The scavengers looked on, unable to tell if she was killed in the process. Rey then detached an escape pod, causing it to fall to the ground a barely miss the other scavengers. Rey climbed into the ship climbed into the ship and began her journey, hoping that the Spectral really was abandoned."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}