{"url": "Destruction_of_Despayre", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Artificial disasters", "Category:Battles in the Atrivis sector", "Category:Battles of Operation Skyhook"], "nodes": [{"tag": "h1", "text": "Destruction of Despayre"}, {"tag": "p", "text": "The Destruction of Despayre was a cataclysmic event that occurred in 0 BBY, following the attack on the first Death Star. The prison planet Despayre was the final construction site of the first Death Star, where assembly of the space station's superlaser took place. After discovery of the site by the Alliance to Restore the Republic, the project's leader, Grand Moff Wilhuff Tarkin, decided to move the station. The interior was near completion and the hyperdrive was functional, but the Grand Moff decided it was necessary to test the superlaser before getting under way. A proper test firing required a terrestrial world, and the penal colony was the only suitable location in sublight range. Tarkin decided without hesitation to sacrifice Despayre, and a few days before the Battle of Yavin, the planet was destroyed."}, {"tag": "p", "text": "The destruction of Despayre was one of only three recorded uses of the Death Star's superlaser. The incident caused a shift in the gravitational configuration of the Horuz system, and was a major wound in the Force, as millions of lives were terminated almost instantly. The shock was felt by Force-sensitives, both trained and untrained."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Preparation"}, {"tag": "p", "text": "For approximately two years, the DS-1 Orbital Battle Station, more commonly known as the Death Star, had undergone construction in orbit of the penal colony world of Despayre, a site chosen for its location in a distant corner of the Outer Rim Territories where the Imperial Senate and HoloNet media would be unlikely to observe. Slaves from all over the galaxy had labored long and hard in order to finish construction on Emperor Palpatine's newest superweapon. Leading up to 0 BBY, the Alliance to Restore the Republic launched progressively grander efforts to stall the project. The Rebels captured the frigate Priam to learn the location of the construction site, and then sent the Lucrehulk-class carrier Fortressa on a mission to destroy the Death Star, which led to the first operational use of the station's superlaser—bringing a swift end to the Rebel assault. Following this, Grand Moff Wilhuff Tarkin, the overall leader of the Death Star project, made the decision to relocate the station. Admiral Conan Antonio Motti, the station's operational commander, concurred. However, Tarkin wished to test the functionality of the superlaser in a more controlled fashion than its first firing."}, {"tag": "p", "text": "Tarkin himself chose the site for the superlaser's first controlled test. The Horuz system had been largely emptied by the construction project's resource-gathering efforts, leaving Despayre itself as the only suitable target within sublight range. The decision stunned personnel across the entire station, from Superlaser Fire Control to Admiral Motti himself. But ultimately, the decision was Tarkin's, and no one sought to challenge it. In fact, Tarkin had long predicted that Despayre was doomed anyway, as a cloud of industrial debris was already benighting the planet and would have remained in orbit long after the construction ended."}, {"tag": "p", "text": "When Tarkin made the decision to move the station, the Death Star's engineering division wasn't quite prepared for a full-power discharge from the superlaser's main capacitors. A 33% charge was the best they were willing or able to manage. They knew 4% power was sufficient to destroy a Lucrehulk-class battleship, but no one could be certain what kind of damage the superlaser could inflict at one-third of its full capacity. What was certain, however, was that even at that strength, the first shot would kill millions of prisoners. The duty of firing the shot fell to Tenn Graneet, the chief of the gunnery crew for that shift. The commanding officer of Superlaser Fire Control was willing to allow alternate shift leaders Beller or Reshias to substitute for Graneet, but ultimately Graneet chose carry out the order himself."}, {"tag": "p", "text": "As Tarkin considered any non-essential personnel a security risk, anyone whose usefulness ended with the termination of construction was shuttled to the planet. Prisoner work crews were returned to their compounds, and construction supervisors and other personnel were transported back to Despayre as well. As they awaited reassignment, they were unaware of their impending demise."}, {"tag": "p", "text": "One of those prisoners was Rianna Saren, a Twi'lek mercenary captured by the Zabrak slaver Zarien Kheev on the planet Tatooine. After being brought to the planet, however, Saren quickly orchestrated her escape. Using her concealed weapon, a spring-knife called the Thorn of Ryloth, she killed the stormtroopers guarding her and tried to find a way off planet. Saren soon found her droid companion, Zeeo, in a trash compactor and met another Twi'lek slave, who informed her about a nearby air duct, which could be used in her escape. After surviving an encounter with a probe droid, Saren and Zeeo reached the surface of Despayre through the air duct and saw the Death Star orbiting the planet."}, {"tag": "p", "text": "After killing some scout troopers stationed on the surface, the Twi'lek stole a speeder bike and flew it to the landing pad used by Lambda-class shuttles, which carried Imperial personnel and supplies to and off planet. On the landing pad, Saren once again encountered Kheev, who shot at Zeeo before escaping on one of the shuttles. Not willing to stop her pursuit of Kheev, Saren, along with her droid, hid in a shipment crate, which was picked up by another shuttle and was then brought to the Death Star itself. After reaching the Death Star, Saren continued her search for Kheev, defeating many stormtroopers and another probe droid along the way."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "The first one-third power shot from the superlaser was a planet-killer in itself. Though it didn't physically destroy Despayre, it did terminate all life on the surface. The atmosphere itself became a massive firestorm, and the planet's ground became unstable from the blast. The tectonic plates shifted, causing massive waves in the planet's oceans and extreme volcanic activity. Tarkin was pleased with the results. When Motti questioned the destruction of one of the Empire's primary prison colonies, Tarkin dismissed it with the expectation that the Empire would employ the death penalty more frequently."}, {"tag": "p", "text": "One hour and fifteen minutes after the first shot, the Death Star fired a second time. This shot further intensified the seismic effects, causing mountains to rise and fall in a matter of minutes and the surface to be covered with oceans of lava. Despayre had gone from a verdant world of deep green, broken by rivers and seas, to a lifeless sphere of red."}, {"tag": "p", "text": "The final shot was fired one hour and nineteen minutes after the second. When the final shot hit, Despayre shattered into billions of fragments ranging from pebble- to mountain-sized. The planet no longer existed as a single entity in terms of the star system's gravitational configuration. The Death Star itself recorded the impact of thousands of fragments against the station's shields, none of which caused damage worth mentioning."}, {"tag": "p", "text": "At the same time, Rianna Saren had at last found Kheev, who had been talking to Darth Vader. Hiding in the shadows, the Twi'lek overheard as Vader ordered Kheev to leave for the planet Danuta with the updated battle station plans, which had been requested by the engineers there. After witnessing the destruction of Despayre first-hand, Saren decided to inform the Rebellion about the Death Star and the threat it presented."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Aboard the Death Star, untrained Force-sensitive Nova Stihl awoke screaming. Darth Vader felt the planet's destruction while the Devastator, his flagship Star Destroyer, was in hyperspace en route to the construction site. He knew only that it was a terrible wound in the Force, until the ship dropped out of hyperspace and saw the expanding debris field on its scopes. The planet had been home to countless plant and animal species, and was the only habitable world in the Horuz system. Any native species that had not been transplanted would have been exterminated. Some personnel aboard the Death Star, civilian contractors especially, were shocked. Others, especially military personnel whose careers were heavily invested in the project, like Admiral Motti, considered the planet's destruction to be vindication of their faith in the project."}, {"tag": "p", "text": "Meanwhile, Rianna Saren managed to reach Death Star's communication center and contacted Princess Leia Organa, one of the major supporters of the Rebellion. Saren informed the Rebel Alliance about the battle station's destructive capabilities and, realizing that the Empire was her true enemy, not Kheev, asked Organa to send her to Danuta along with the other Rebel agents to steal the battle station plans. After that, Saren and Zeeo escaped the Death Star using a stolen Imperial ship. Little did Saren know that near the same time, the Rebel Alliance had sent ships to follow up after the ill-fated Fortressa. However, when Rebel forces comprising the two CR90 corvettes of Ethar group arrived in the region, they found only the planet's remains. The Death Star was absent and the Rebels were captured by the Imperials that remained in the system. It was only thanks to the skills of Rebel pilot Keyan Farlander that those ships were later retrieved by the Alliance."}, {"tag": "p", "text": "The destruction of Despayre provided the operational testing necessary for the engineering division to clear the superlaser for full-power operation, and a short time later a single shot at full capacity would be used to destroy the planet Alderaan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The location of the Death Star's construction around Despayre was first mentioned in the Death Star Technical Companion in 1991, and that mention was followed by the depiction of Despayre's destruction in Star Wars: X-Wing in 1992, where a single blast of the superlaser was shown destroying the planet. The planet itself was mentioned again in several works but no mention was made of the planet's demise. It was not until the Death Star novel that the event was recorded in more detail than the initial depiction in X-wing. The three successive shots detailed in the novel provide an explanation for the planet's transformation from a verdant world as described in the Death Star Technical Companion, Darksaber, and the Star Wars Encyclopedia into a featureless red ball in the visual depiction in X-wing. Conversely, Death Star introduces a contradiction of its own in that Darth Vader was aboard the Death Star when the shot was fired in X-wing, but was aboard a ship en route to the Death Star when the final shot was fired in the novel, seeing the debris field on arrival. The Nintendo DS version of 2006 video game Lethal Alliance also shows Vader aboard the Death Star during the final shot. However, he appears in hologram in the PSP version."}, {"tag": "p", "text": "To further complicate the timeline, Death Star mentions the plans stolen from Danuta and shows Vader's capture of Princess Leia before the destruction, yet in Lethal Alliance Rianna Saren contacts the Princess after the destruction and informs her about the plans being held on Danuta."}, {"tag": "p", "text": "The single moon of Despayre, only visually depicted in X-wing, was not named until the release of Star Wars: The Force Unleashed, which identified it as \"Haroon.\" As no mention is made of the moon in the Death Star novel, the only source to chronicle Despayre's destruction in any significant detail, the fate of Haroon is not certain. As the Death Star was said to be able to \"knock a moon out of orbit,\" it was presumably destroyed or at least severely damaged and displaced by the blast."}, {"tag": "p", "text": "A mention in X-Wing: The Bacta War of \"the shipyard that built the Death Star\" by Booster Terrik, a generally well-connected and well-informed individual, would seem to indicate that the role of Despayre in the station's construction and the planet's destruction were not public knowledge."}, {"tag": "p", "text": "The game Star Wars: Rebellion includes Despayre as an intact planet, despite starting immediately after the Battle of Yavin. The game was published in 1998, well after Star Wars: X-wing, and lists Despayre as the construction site of the Death Star in the in-game encyclopedia, yet omits the planet's destruction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}