{"url": "Destruction_of_Carida", "categories": ["Category:Legends articles", "Category:Artificial disasters", "Category:Battles of Carida", "Category:Battles of the Daala campaign", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Destruction of Carida"}, {"tag": "p", "text": "The Destruction of Carida occurred in 11 ABY, when Kyp Durron used the Sun Crusher to destroy Carida."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "Under the influence of the spirit of the Sith Lord, Exar Kun, the fallen Jedi had just destroyed the Cauldron Nebula with the Sun Crusher, an Imperial superweapon. When he was a child, his brother Zeth had been forcibly recruited as a stormtrooper, so Kyp traveled to the Imperial Academy on Carida to learn his brother's fate."}, {"tag": "h2", "text": "The Destruction of Carida"}, {"tag": "p", "text": "Kyp arrived in the Carida system and contacted Carida, saying that he would destroy it if they didn't let him speak to Ambassador Furgan. Furgan came on the channel and Kyp said that he wanted to know what had happened to his brother, giving Furgan an hour to reply. Furgan wanted the Sun Crusher, so he had Lieutenant Dauren distract Kyp with a false story about how Zeth had died, while about 60 TIE/LN starfighters were dispatched to capture him. Kyp shot down some then let them shoot into his Sun Crusher's impenetrable armor and retaliated by firing a resonance torpedo into the heart of Caridan, the system's sun. After that he told Furgan he has only two hours for evacuation."}, {"tag": "p", "text": "Furgan ordered the evacuation of Carida on priority of rank and he himself left aboard the Vendetta, but there weren't enough ships to save many people and the majority of the population of Carida were unaware of their impending doom.\nDauren had been left behind and was desperate to get off planet. He discovered that Zeth was still on Carida and contacted Kyp, hoping that the young Jedi would rescue them both. However, as the Sun Crusher swooped in to land, Dauren attacked Zeth with a plastisteel fragment and then tried to get in the Sun Crusher, but he burnt himself on its superheated armor. Kyp made another pass to try and save his dying brother, but at that moment, the sun exploded and destroyed the planet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The majority of Carida's population of 25 million people were killed. Kyp was driven further to the dark side by the despair at having killed his own brother."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}