{"url": "Destruction_of_Byss", "categories": ["Category:Legends articles", "Category:Artificial disasters", "Category:Battles of Byss", "Category:Battles of Operation Shadow Hand"], "nodes": [{"tag": "h1", "text": "Destruction of Byss"}, {"tag": "p", "text": "The Destruction of Byss was a cataclysmic event that marked the end of Operation Shadow Hand, along with the final death of Emperor Palpatine."}, {"tag": "h2", "text": "Infiltration of Eclipse II"}, {"tag": "p", "text": "During the Battle of Onderon, a strike team lead by Lando Calrissian and Kam Solusar infiltrated Palpatine's flagship, Eclipse II, by attaching the freighter Millennium Falcon to the Star Dreadnought's lower hull."}, {"tag": "p", "text": "The astromech droid R2-D2 sabotaged the vehicle's automated hyperdrive engines and set the vessel on a course for Byss, exiting hyperspace at the precise location of the dreaded Galaxy Gun cannon. Despite attempts from the Eclipse II's crew to override the command, the Star Dreadnought entered hyperspace."}, {"tag": "p", "text": "The procedure went so fast, the crew of the Millennium Falcon did not have time to detach before the jump, and so went on an involuntary journey towards the Deep Core with the warship."}, {"tag": "h2", "text": "End of Byss"}, {"tag": "p", "text": "While the events on Onderon unfolded and Eclipse II sent out a call for reinforcements, the engineer Umak Leth, architect of the Galaxy Gun, decided to risk arming the Gun to aide his Emperor and gain some of the esteem he had lost following the Nespis VIII blunder."}, {"tag": "p", "text": "As the Galaxy Gun was being prepared, the Eclipse II suddenly came out of hyperspace, ramming the cannon and damaging both vessels. The Millennium Falcon managed to disconnect from the Star Dreadnought before impact and prepared to enter hyperspace. As the Gun was struck by the Eclipse II, the armed missile was fired by the cannon, in a vain attempt at hitting the ship that was on a collision course."}, {"tag": "p", "text": "The missile got caught by Byss's gravity well, exploded upon impact and destroyed the planet, taking some of the (vastly thinned, being in other locations of the galaxy) orbiting fleet along with it, as well as the wrecks of the Galaxy Gun and Eclipse II. The Falcon managed to exit the Beshqek system before being hit by debris from the explosion."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Because of the destruction of both Byss and two of their major superweapons, Captain Sergus Lanox, an Imperial officer, later recounted the event and mentioned that when he received word of this, Lanox, deep down, knew that this was the irrevocable end for the Galactic Empire, and noted that it devastated the other Imperial officers when they learned of it as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}