{"url": "Destruction_of_Tund", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Artificial disasters", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Destruction of Tund"}, {"tag": "p", "text": "In 5 BBY, the Croke Rokur Gepta brought about the destruction of the planet Tund using a biological agent released by an electromagnetic torpedo. Gepta's weapon eradicated all life on Tund, killing upwards of eighteen million pureblooded Sith and Toongs in residence on the planet. Tund's surface was subsequently rendered uninhabitable and its atmosphere poisoned from the resultant radioactive fallout, save for a small section of the planet protected by Gepta's force fields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime prior to 5 BBY, Rokur Gepta, a Force-sensitive member of the snail-like Croke species of Crakull, took up residence on the planet Tund, an isolated Force nexus in the Centrality lost on the north-eastern borders of the Open Sea. In addition to hosting a Toong diaspora that settled the world in 45 BBY after the destruction of Toong'L, Tund was historically home to a colony of pureblooded Sith that had first colonized the planet in the aftermath of the 27,700 BBY invasion of Korriban and subsequently come to host other Sith-blooded outcasts, exiles, and refugees from the Sith Worlds and old Sith Empire."}, {"tag": "p", "text": "Following his arrival, Gepta successfully applied his species's natural powers of illusion and shapeshifting to a furtive infiltration of the Sorcerers of Tund, a monastic sect of pureblooded Sith Force users in residence on the planet. The Croke studied the group's unique interpretations of ancient Sith teachings for some time, co-opting its secrets for his own purposes. Having learned all he could from his unwary teachers, Gepta unleashed an electromagnetic torpedo containing a biological agent upon Tund. The resultant green fire generated by these weapons eradicated all life on Tund and poisoned its atmosphere, transforming the once verdant world from a lush Force nexus to an irradiated wasteland."}, {"tag": "p", "text": "At the time of its destruction, the planet Tund hosted a total population of roughly eighteen million sentients. The species mix primarily consisted of approximately thirteen million, one hundred and forty thousand Toong, who made up seventy-three percent of the population; one million, two hundred and sixty thousand pureblooded Sith, who made up seven percent of the population; and a diverse assortment of other species numbering approximately three million, six hundred thousand beings, forming twenty percent of the population. Apart from Gepta himself, all those in residence on the planet died as a result of the planet's destruction, leaving Gepta as the last Sorcerer of Tund."}, {"tag": "p", "text": "Either in exchange for Tundan secrets or out of respect for the Croke's abilities, Galactic Emperor Palpatine, the Dark Lord of the Banite Sith and an individual who had long sought to possess the ancient Sith secrets of the Sorcerers of Tund, appointed Gepta the presiding Scrivinir of the Centrality and gifted the Croke a decommissioned Imperial cruiser named the Wennis with which to consolidate his hold over the remote region of space. Prior to his death at the hands of Lando Calrissian less than a year later, Gepta returned to Tund on an intermittent basis, meditating in a small enclave protected from the planet's radioactive atmosphere by a system of force fields."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}