{"url": "Destruction_of_Special_Task_Force_One", "categories": ["Category:Legends articles", "Category:Battles in the Unknown Regions"], "nodes": [{"tag": "h1", "text": "Destruction of Special Task Force One"}, {"tag": "p", "text": "The Destruction of Task Force One was a battle between Commander Mitth'raw'nuruodo's Picket Force Two and Special Task Force One. It was one of the earliest battles that showed Thrawn's superior tactical abilities, as Special Task One was completely destroyed, with the exception of the flagship Darkvenge, because it was intentionally left intact."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "When Outbound Flight launched from Yaga Minor with 18 Jedi aboard, Darth Sidious ordered the Trade Federation to destroy it in the Unknown Regions. Kinman Doriana, taking the alias \"Stratis,\" and Vicelord Siv Kav assembled 15 Trade Federation warships—2 Lucrehulk battleshipsps, 6 armed Hardcell-class transports, and 7 Trade Federation escort cruisers—to intercept Outbound Flight. After stopping in the region where Outbound Flight was supposed to make a navigational stop, they were detected by one of Thrawn's patrols. He brought Jorj Car'das with him, who identified the ships as belonging to the Trade Federation. Thrawn decided to communicate with the Darkvenge, in order to discover their intentions. Although Doriana was willing to talk, Vicelord Kav impatiently decided to attack."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "The Keeper launched half of its droid starfighters, and sent three groups to attack Picket Force Two, with the rest forming a defensive screen. After learning that the droids had a limited range due to their reliance on computer control, Thrawn had his ships pull back, while moving the Whirlwind to another edge of the battlezone. The droid starfighters were soon out of range, and retreated. Thrawn then had one of his fighters repeatedly move into range and out again. Although this maneuver appeared simple to Vicelord Kav, it was really designed for the purpose of identifying the signal controlling the droid starfighters. Once this happened, Thrawn's force moved back into range. They broadcast a modified signal to the droids, which caused them to fly aimlessly into deep space. Picket Force Two, having eliminated the first three groups of fighters, began their attack in earnest."}, {"tag": "p", "text": "Once close enough to the main defensive screen, the Chiss ships launched conner nets at the droid starfighters, effectively knocking nine more groups out of action. Vicelord Kav responded by beginning to launch the Keeper's remaining fighters. Before they could launch, however, Thrawn initiated full spectrum jamming, thus disabling communication with the fighters. The Chiss blasted the helpless fighters, not only destroying them, but causing debris to block the laser communications that the Darkvenge was using to restart the fighters. The other capital ships in the task force began to attack at this time."}, {"tag": "p", "text": "The Hardcell-class transports launched their missiles at the Chiss ships, but they simply launched more conner nets to disable the missiles and cause them to hit the other Hardcells. Discovering a weakness, the Chiss quickly eliminated the remaining Hardcells, and moved on to the escort cruisers, destroying them as well. Meanwhile, the Darkvenge tried to retreat, but found itself unable to jump into hyperspace due to the gravity well projector inside the Whirlwind, which remained to the side of the battle. At this time, the Keeper exploded, as the un-launched and disabled droid starfighters self-destructed inside the launch bay. With only the Darkvenge remaining, Doriana and Vicelord Kav surrendered and allowed Thrawn to board the ship."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Special Task Force One was completely destroyed, except for the Darkvenge, which Thrawn wanted to analyze. Kinman Doriana realized that he had to convince Thrawn to destroy Outbound Flight for him, or Darth Sidious would kill him. This led to a communication between Thrawn and Sidious, beginning Thrawn's future service in the Imperial Navy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}