{"url": "Destruction_of_Tah%27Nuhna", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles in the Mid Rim", "Category:Events during the First Order–Resistance war"], "nodes": [{"tag": "h1", "text": "Destruction of Tah'Nuhna"}, {"tag": "p", "text": "After the Battle of Crait, the First Order launched an assault that destroyed the neutral world of Tah'Nuhna for assisting the Resistance."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Tah'Nuhna were a peaceful species that were known for charting the cosmos and finding a cure for the Iridian Plague. They had managed to avoid conflict since the Hundred-Year Darkness and the Galactic Empire had never invaded the planet. They welcomed the Resistance to their planet to take refuge after the Battle of Crait. But General Armitage Hux and the First Order traced a Resistance transmission to the planet and had arrived to punish the Tah'Nuhna."}, {"tag": "h2", "text": "Destruction"}, {"tag": "p", "text": "A fleet of First Order Star Destroyers including a Mandator IV-class Siege Dreadnought arrived at the planet. General Hux informed the Tah'Nuhan leader that they had intercepted a Resistance transmission from the planet. The leader tried to reason with him by telling him that her people welcomed everyone to the planet and that they are neutral. Hux snapped back asking the leader if anyone said invasion and ordered his fleet to open fire on the surface of the planet. Buildings started to get destroyed all around and on the surface of the planet snowtroopers were killing anyone who tried to escape the city. TIE/se Bombers attacked the city from above. The Tah'Nuhna leader sent out a message to anyone who could hear them that they were under attack from the First Order. As she was speaking another Tah'Nuhna told her that a missile was inbound and before she could finish her plea for help she was killed by the missile."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "At the Resistance Camp on Anoat, Kaydel Ko Connix watched as Tah'Nuhna was destroyed. She then ran over to General Leia Skywalker Organa Solo and reported the destruction of the planet to her. Leia was very sad to hear the news noting that the Tah'Nuhna paid the ultimate price for kindness. Knowing that it was now or never, Leia assembled a team to travel to the water planet of Mon Cala in order to plead with the Mon Calamari for ships to rebuild the Resistance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}