{"url": "Destruction_of_the_Cauldron_Nebula", "categories": ["Category:Legends articles", "Category:Battles of the Daala campaign"], "nodes": [{"tag": "h1", "text": "Destruction of the Cauldron Nebula"}, {"tag": "p", "text": "The Destruction of the Cauldron Nebula occurred in 11 ABY, when Kyp Durron used the Sun Crusher to attack Admiral Natasi Daala's forces in the Cauldron Nebula."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "Following her defeat in the attack on Mon Calamari, Daala had her forces retreat to the Cauldron Nebula. She began to plan an attack on Coruscant, where she would move the majority of her personnel to the Gorgon and leave a skeleton crew aboard the Basilisk, who would detonate it above the planet, killing themselves in the process."}, {"tag": "p", "text": "Meanwhile, under the influence of the spirit of the Sith Lord, Exar Kun, the fallen Jedi Kyp Durron pulled the Sun Crusher out of the gas-giant, Yavin Prime, and left with it to destroy the remnants of the Galactic Empire. Kun told him the location of Daala's forces and he set out to destroy them, to signal to the other Imperial warlords the fate that was about to befall them."}, {"tag": "h2", "text": "The destruction of the nebula"}, {"tag": "p", "text": "Kyp arrived in the nebula and used the Force to find the exact location of Daala's ships. He fired off seven resonance torpedos, one for each star in the nebula, and pulled away to wait until the stars exploded a few hours later. However, as he waited, the Star Destroyers began powering up their sublight drives, to leave for Coruscant. Kyp became angry and decided to try and make Daala stay there. As the Star Destroyers prepared to engage their hyperdrives, he opened fire on the Gorgon with the Sun Crusher's laser cannons. Captain Mullinore informed Daala that he had identified the attacker as the Sun Crusher and she ordered two TIE/LN starfighter squadrons to launch to try and capture it."}, {"tag": "p", "text": "The Sun Crusher began to fly away and Daala wondered why it was no longer attacking them, as she ordered her ships to move about, so as to lock their tractor beams onto the Sun Crusher. Commander Kratas told her that this would be difficult, due to the Sun Crusher's high speed, but she ordered him to try anyway. Kyp then commed the Gorgon with a voice-only transmission and revealed to Daala his identity. She told him that, if he surrendered the Sun Crusher to them intact, she would take him to any planet of his choice. He refused and ended the conversation."}, {"tag": "p", "text": "The Gorgons sensor chief then informed Daala that he was getting some unusual readings from the stars and she realized what Kyp had done. She ordered the two Star Destroyers to turn around and leave immediately. The Gorgons navicomputer had lost its lock on Coruscant, so the ship was forced to randomly jump into hyperspace. Seconds later, the stars exploded and destroyed the more slower moving Basilisk and the two TIE Fighter squadrons."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Kyp believed Daala to be dead and left one of the Sun Crusher's message cylinders so that the galaxy would know who caused her death. He then left for the world of Carida, which he destroyed soon after."}, {"tag": "p", "text": "The Gorgon emerged in an uninhabited void in the Outer Rim, where the crew set about repairing the damage caused to it as the inferno surrounded it as it jumped to hyperspace, in preparation for its return to the Maw Installation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}