{"url": "Destruction_of_the_Cathedral_of_Winds", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Glythe sector", "Category:Events of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Destruction of the Cathedral of Winds"}, {"tag": "p", "text": "The destruction of the Cathedral of Winds was an incident of sabotage performed by the Galactic Empire in 11 ABY. With the intent of killing Leia Organa Solo and Gial Ackbar, Imperial Ambassador Furgan ordered Terpfen to sabotage Ackbar's shuttle. While ferrying Organa Solo to Vortex, Ackbar crashed against the local Cathedral of Winds and killed hundreds of native Vors, which was a blow to the morale and reputation of the New Republic. Eventually, Terpfen confessed to Organa Solo and she cleared the good name of the Republic; meanwhile, the Vors built a second Cathedral."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "In 11 ABY, after the death of Palpatine, the New Republic made advances to the Vors, wanting them to join the new, anti-Imperial government. As a token of good will, the Vors invited Leia Organa Solo, a diplomat of the New Republic, to the Concert of the Winds. Organa Solo's friend, Admiral Ackbar decided to ferry her using his personal ship, a B-Wing shuttle customized by himself and by his trusted chief mechanic Terpfen. Unbeknownst to Ackbar, Terpfen was an unwilling agent of the Galactic Empire, being under the control of Imperial Ambassador Furgan. With the intent to kill both Ackbar and Organa Solo, Furgan ordered Terpfen to sabotage the ship. Terpfen had obeyed the order."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "When Ackbar arrived to Vortex, a Vor controller open a channel with him. Any incoming alien ship was to receive specific coordinates to follow, taking the winds in consideration, so the pilot could veer properly. Although Ackbar was an excellent pilot, his ship never veered as he intended her to. Thrice the controller asked Ackbar to correct the approach. Understanding that the ship was to crash land, Ackbar ejected Organa Solo, and then attempted to save the ship, but when he tried other systems, the ship spun out of control, approaching the Cathedral of the Winds while the controller vainly tried to order an abort."}, {"tag": "p", "text": "At that point, thousands of Vor were flying around the Cathedral. One of the flaps of the B-Wing detached itself, and the B-Wing plowed into the floor and the foundations of the Cathedral, and eventually collided against the lower part of the building. The flying Vors tried to escape, but most of them were too slow to escape injury. The Cathedral broke into a rain of sharp glass splinters, killing more than three hundred and fifty-eight Vors. The structure as itself fell soon afterward, leaving only a few standing tubes."}, {"tag": "p", "text": "Organa Solo had survived unhurt and Ackbar had only injured his arm, but Terpfen convinced Furgan that this was a greater blow to the morale of the New Republic than Furgan's original plan. The New Republic now appeared dangerously incompetent. Soon afterward, New Republic Chief of State Mon Mothma contacted Organa Solo's husband to report the situation. The peace talks were cancelled, though the unflappable Vors never filed any complain or made any threat."}, {"tag": "h3", "text": "Reconstruction"}, {"tag": "p", "text": "With their traditional stillness, the Vors began the re-construction of their Cathedral almost immediately and with quasi-religious fervor. Instead of building again the same Cathedral, they were following a new layout apparently existing only in their collective minds. This new Cathedral, although still bright, crystalline and made of cylinders, was sleeker than the original one and had a more organic aspect. The Vors also decided to direct all of their creative energies to this new task, not wanting to sing or perform any music. The species was stunned, and they thought they could not retake any routine until the Cathedral could sing again, but they apparently did not blame either Ackbar or the Republic for the accident."}, {"tag": "p", "text": "Mon Mothma sent a team to help them re-build the Cathedral, while at the same time partially cleaning the stained image of the New Republic, although the Vors had not asked for any help during the reconstruction. The New Republic Council considered other measures to be taken in the face of the tragedy: They opened an investigation, but the records were analyzed by Terpfen, who falsified the results and suggested pilot failure as the only valid option. Senator Hrekin Thorm of the Council considered that Ackbar could lead the repairing team in Vortex, as a punishment for his failure; Senator Garm Bel Iblis opposed, as the Vors would probably not want him on their planet. With this pressure, Ackbar resigned from his post,"}, {"tag": "p", "text": "The Vors did not welcome the relief team, neither did they disturbed their activities. They seemed to not recognize the presence of the glove-wearing Humans. New Republic General Wedge Antilles was assigned to temporarily lead this team, and thus he traveled to Vortex along with Qwi Xux, an Imperial scientist he was to protect. Both of them joined the team. Xux, a former musical performer herself, found a small crystal flute in the floor, a remain of the Cathedral. She picked it up and, eyes closed, improvised a tune. Vors stopped their work, approached her, surrounded her and, blinking, listened intently. The relief team went there too, believing Xux to be in danger. Xux finally stopped the music and opened her eyes, wordlessly watching her audience. A big male clan leader of the Vors walked to Xux, took the flute from her hand, smashed it on his, and ordered to avoid any further music until the Cathedral was ended. All the Vors then flew away."}, {"tag": "p", "text": "Seeing that the aliens had not been understood, the Vors made an official communiqué explaining that music in Vortex could be considered a mockery. The Chief Council of Vortex, Krini-shen, made the release, clarifying that Xux's melody would not be reproved as it had been clearly a misunderstanding. Partly as an apology, Xux provided the Vor with quantum crystalline technology created by her that could be used, and was used, in the new Cathedral."}, {"tag": "p", "text": "Soon afterward, Qwi Xux was attacked by Dark Jedi Kyp Durron in Ithor. Durron erased most of her memories, including those of her stay in Vortex. However, Xux would later recover her important memories of how she played the flute for the Vors."}, {"tag": "p", "text": "Before the Cathedral had been re-built, Terpfen managed to confess his sabotage to Organa Solo. With this information, Organa Solo cleared the names of Ackbar and of the New Republic, and notified Vortex and other planets."}, {"tag": "p", "text": "Only months after the disaster, the Vors had re-built the Cathedral, and again they invited New Republic dignitaries to the new Concert. Many of them attended, including a pleasantly surprised Ackbar, the Solo Organa extended family, General Antilles and Xux, and Duchess Mistal of Dargul with her consort. Then, for the first time in decades, the Cathedral played again, performed by flying Vors and with no machine recording the music. The Vors opened all the windows and doors for the grand finale."}, {"tag": "p", "text": "Although the Vors kept mostly the same rules and laws, they also established a no-fly area of two kilometers around the Cathedral, to avoid a similar disaster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}