{"url": "Destruction_of_the_Invincible", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Operation Strike Fear"], "nodes": [{"tag": "h1", "text": "Destruction of the Invincible"}, {"tag": "p", "text": "The Destruction of the Invincible was the deciding event of Operation Strike Fear during the Galactic Civil War in the year 1 BBY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Imperial-class Star Destroyer Invincible had been tasked with the destruction of the Alliance to Restore the Republic as the flagship of Operation Strike Fear, and during this operation the Invincible and her forces had taken the offensive in laying waste the growing Rebel presence in the Tion Hegemony. The campaign saw the destruction of many Alliance forces and several of their key planetary bases on worlds such as Briggia and Orion IV, forcing the fledgling Alliance on the run. Although the bulk of the Alliance's forces evaded capture or death, the mounting losses necessitated a major strike against the Invincible in the hopes of crippling Operation Strike Fear, and so Rebel leaders and their allies made plans to destroy the Invincible."}, {"tag": "p", "text": "After having captured several senior personnel from the Imperial-aligned Cygnus Corp, the Rebels learned of a BFF-1 bulk freighter known as the Gafra that was transporting a powerful superweapon to the Empire that would possess enough power to destroy the Invincible. Imperial defector Crix Madine aided his newfound Rebel allies in planning the attack on the flagship and in a daring strike the Rebels seized the Gafra and its powerful cargo, and prepared it for transport to the Imperial flagship."}, {"tag": "h2", "text": "Fall of the Invincible"}, {"tag": "p", "text": "After having persuaded the Cygnus staff to modify one of their shuttles to appear as an Imperial craft, a team of Rebel agents transported the captured warhead aboard the Invincible disguised as ordinary cargo. Unbeknownst to the crew, the weapon had been armed and subsequently detonated moments after the Rebels departed aboard their ship. The shuttle fled the scene as the Invincible was ripped apart from the inside out as a result of the blast, completely destroying the vessel along with all hands on board."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The destruction of the Invincible proved a major victory for the Alliance, and the shocking loss of one of their prized Star Destroyers forced the Empire to end Operation Strike Fear, ensuring the survival of the growing Rebellion for some time more."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}