{"url": "Detien_Kaileel", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance to Restore the Republic members", "Category:Detectives", "Category:Guards", "Category:Kabierouns", "Category:Kuari Princess crewmembers", "Category:Males"], "nodes": [{"tag": "h1", "text": "Detien Kaileel"}, {"tag": "p", "text": "Detien Kaileel was a male Kabieroun who served as a Security Chief on board the Kuari Princess during the Galactic Civil War. He left his homeworld after the Galactic Empire began to subjugate it, studying police science and serving as a detective for dozens of years prior to his appointment on the Kuari Princess. The Kabieroun eventually became an ally of the Alliance to Restore the Republic around the time of the destruction of Alderaan in 0 BBY, providing them with blasters stolen from the Kuari Princess."}, {"tag": "p", "text": "Eventually, however, his activities came to the attention of the Imperial Security Bureau, and Lieutenant Adion Lang was sent to investigate. Lang arrested Kaileel, and he was kept in solitary confinement aboard the Kuari Princess for several hours. The Kabieroun was prepared to die, though his close friend Celia Durasha broke him out of the ship's brig and attempted to flee the cruiser with him. Lang was waiting for them in the docking bay, though, and held the two fugitives at gunpoint. Kaileel attempted to shoot the Imperial, but missed, and was fired at in return. Kaileel was killed by the blaster bolts, though Durasha was able to evade Lang and ultimately fled the ship."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Kabieroun native to the planet of the same name, Detien Kaileel was fortunate enough to leave his homeworld before it was subjugated by the Galactic Empire. He went on to study police science at the Balaidas Academy, though he was forced to leave the academy when the Empire closed it down to non-Humans. He then spent over a decade working as a detective for a Sentinel Agency in the Mid Rim, and proved to be talented at his job. During an undercover operation against a prominent crime lord, Kaileel was badly wounded and decided to seek employment in a more safe environment."}, {"tag": "p", "text": "Kaileel eventually earned a position working for Galaxy Tours as the Security Chief of a luxury liner named the Kuari Princess. He proved capable at this role, earning the loyalty of his subordinates and making many friends; among them were Celia Durasha and Dap Nechel, with whom Kaileel often played B'shingh. Kaileel was particularly close to Durasha and acted as a sort of father figure to the young woman."}, {"tag": "h3", "text": "Rebel"}, {"tag": "p", "text": "Eventually, Kaileel became disillusioned with his life and sought to directly oppose the Empire. He began to secretly steal blasters from the ship, supplying them to the fledgling Alliance to Restore the Republic. He continued his criminal activity for several months without being caught, though, in his capacity as head of security, he vouched for each of his men to the Kuari Princess's captain so that they would not be blamed for his actions. The disappearance of these blasters was beginning to threaten his career, but Kaileel did not cease his smuggling. Several days before the destruction of Alderaan, he took another load of blasters to Rebels on Mantooine."}, {"tag": "p", "text": "Things on Mantooine did not go very well, and Kaileel returned a nervous wreck, beginning to suspect that the Empire was onto him. He was allowed to momentarily escape his thoughts when a fight broke out between passengers on the luxury cruiser and later met with Celia Durasha to play a routine game of B'shingh. Kaileel quickly realized something was wrong with Durasha, and comforted her on the loss of her brother, who had been killed fighting Rebels on Ralltiir. Kaileel revealed his growing sympathy for the Rebels and told Durasha of his opinions of the Empire. Although the Human denounced his comments and warned him of speaking that way on an Imperial-aligned ship, Kaileel had managed to sow seeds of doubt in his friend's mind."}, {"tag": "h3", "text": "Apprehension"}, {"tag": "p", "text": "The entire conversation had been overheard by Adion Lang, an Imperial Security Bureau lieutenant who had been sent to monitor Kaileel's activities. Lang placed Kaileel under arrest and had him transported to the Kuari Princess's brig, where he stayed in solitude for several hours; the Kabieroun accepted the charges that were brought up against him. Eventually, Durasha was allowed to visit him, though she was dismayed at his refusal to lie to the interrogators. Kaileel had accepted his fate, though his friend was far more reluctant to do so; she stabbed the stormtrooper standing guard, and used his blaster to slay a second trooper who appeared moments later. Although he appreciated his friend's help, Kaileel was pessimistic about their chances of escaping; he knew that the ship's security officers—the very men and women he had helped train and watched over just days prior—would be waiting to intercept them. Durasha had planned to escape, however, and had persuaded Dap Nechel to create a distraction which would occupy the vessel's security officials. She had also made arrangements with many of Kaileel's most trusted colleagues to leave the turbolifts unmanned so that they could use them to reach the docking bay, where they hoped to commandeer a ship and flee."}, {"tag": "p", "text": "Adion Lang was waiting for them, however, and held the duo at gunpoint in one of the Kuari Princess's hangars. Durasha pleaded with Lang—who had once been her lover—to allow Kaileel to escape, though the Imperial refused. Kaileel attempted to kill him, firing at the Human, though it missed. Lang shot at the Kabieroun in retaliation; the blaster bolt hit him in the chest, and although Kaileel was able to get off another shot—which, like the first, went wide of its target—Lang's shot killed him. Durasha ultimately escaped Lang's clutches and escaped the Kuari Princess to begin her life as a fugitive."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kaileel was a morally upright being who showed sympathy towards the victims of the Empire that he had never met; though he admitted that the Empire had never harmed him personally, he risked and ultimately sacrificed his life to fight what he saw as a corrupt and tyrannical regime. He was also very nervous, though, and found it difficult to keep his anxiety in check at times."}, {"tag": "p", "text": "Kaileel was a kind being, who went out of his way to ensure that his friends and colleagues stayed out of harm's way. During his time smuggling for the Rebellion, he explicitly told the captain of the Kuari Princess that the ship's security officers were all innocent, hoping they would not be punished for his crimes. Additionally, he showed considerable companionship to the lonely Celia Durasha, and acted as a shoulder for her to cry on after the death of her sibling."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Detien Kaileel was created by Star Wars author Charlene Newcomb for a short story named A Certain Point of View, appearing first in Star Wars Adventure Journal 8 and later in Tales from the Empire and Hyperspace. The story was based on an image appearing on the front of Riders of the Maelstrom, a role playing game supplement published by West End Games. The image depicts Kaileel and his friends playing B'shingh on the Kuari Princess, and was later used to illustrate the story on Hyperspace. Although the creature in the image who eventually became Kaileel appears to be a female character, A Certain Point of View establishes him as male."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}