{"url": "Detta_Yao", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Archaeologists", "Category:Females", "Category:Humans", "Category:Members of the Shadow University", "Category:Chelli Lona Aphra's crew"], "nodes": [{"tag": "h1", "text": "Detta Yao"}, {"tag": "p", "text": "Detta Yao was a human female archaeology graduate student at the Shadow University. She wished to write her doctorate thesis on the supposedly cursed artifact known as the Rings of Vaale. Shortly after the Battle of Hoth, Yao met the rogue archaeologist Doctor Chelli Aphra in a cantina and asked her to help her find the rings. When Aphra inquired about why her proposed expedition wasn't being funded by the University, Yao mentioned that the rings were supposedly cursed. Yao hired Aphra to help her find the artifact, working with Aphra's crew, the smuggler Just Lucky and bounty hunter Black Krrsantan, before finally recruiting former Shadow University professor Doctor Eustacia Okka."}, {"tag": "p", "text": "The group traveled to the planet Dianth, where they ventured into the cursed city of Vaale. As they made their way through, Yao was scared by carved faces that were moving, but no one else in the group experienced the phenomenon. As they searched around the sanctum of The Architects of Vaale, Aphra guessed that Yao was under the influence of hallucinations. Meanwhile, Yao instructed Okka's droid TA-418 to scan some of the architecture of the place. As they tried to pass through the door, Yao found a small structure that she thought was the key code to passing through, but when she attempted to use the key, it began to emit a loud sound. To stop the sound, Black Krrsantan and Lucky both fired their weapons at it, causing the noise to stop but also causing the floor to collapse out from under them. Yao watched as Lucky, Black Krrsantan, and Okka fell while she remained with Aphra. However, they were soon surrounded by Tagge's forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}