{"url": "Dev_Sibwarra", "categories": ["Category:Legends articles", "Category:Chandrilans", "Category:Force-sensitives", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dev Sibwarra"}, {"tag": "p", "text": "Dev Sibwarra was a Human boy who was born on Chandrila. His mother, Ydra, was a Padawan who had left the Jedi Order before her training was completed; as such, she survived Order 66 and the early stages of the Great Jedi Purge. Prior to 2 BBY, Dev and his family moved to the Outer Rim colony world of G'rho to escape detection from the Galactic Empire. Shortly afterwards, G'rho was attacked by the Ssi-ruuk—a saurian species who ruled a sizeable interstellar empire in the far reaches of the Unknown Regions."}, {"tag": "p", "text": "Dev survived the invasion though his parents were killed during the fighting. He was found by a Ssi-ruuk scouting party who noted that the boy possessed strange powers. This saved Dev from being consigned to entechment—a means of electronically transferring the life-energy of a person into a power source for a mechanical construct. Such was the fate of the other surviving captives, whom the Ssi-ruuk regarded as inferior and expendable lesser beings."}, {"tag": "p", "text": "Sibwarra was taken to the Ssi-ruuvi capital world of Lwhekk where he was brainwashed and indoctrinated by Elder Sh'tk'ith. Over time, he came to regard Sh'tk'ith and the Entechment Master Firwirrung as \"family\" despite their abuses. Following the death of Emperor Palpatine during the Battle of Endor in 4 ABY, Dev was part of a Ssi-ruuvi expeditionary force which invaded the remote Outer Rim world of Bakura."}, {"tag": "p", "text": "During the invasion, he was put to work calming the Human captives slated for entechment onboard the flagship Shriwirr. When an Alliance task force under the Jedi Knight Luke Skywalker arrived, Dev sensed his presence and power. Following a joint Alliance-Imperial attack which forced the Ssi-ruuvi into a temporary retreat, Sibwarra informed his masters of the Jedi's arrival."}, {"tag": "p", "text": "Hoping to use Skywalker as a means of enteching more sentients from a far distance, the Ssi-ruuvi contacted the Imperial Governor Wilek Nereus who agreed to handover Skywalker in exchange for a full retreat. Later, Sibwarra and a Ssi-ruuvi team succeeded in capturing the Jedi on Bakura but not before Skywalker ministered and healed Dev of his indoctrination through the Force. Having captured Skywalker, the Ssi-ruuk then launched a second attack on Bakura but were fiercely resisted by the Alliance and Imperial starships."}, {"tag": "p", "text": "On the Shriwirr, the Ssi-ruuk attempted to entech Skywalker but were thwarted by Dev who had overcome his indoctrination. With the help of Luke, the two Force-sensitive individuals fought their way through the ship; forcing the Ssi-ruuk into a retreat due to their religious fear of dying on an \"unconsecrated world\". Skywalker sensed Dev's potential as a member of his new Jedi Order. However, this was tragically cut short when Sibwarra was fatally wounded when the Shriwirr was bombarded by the Imperial cruiser Dominant. Despite medical treatment by an Imperial medic onboard the freighter Millennium Falcon, Sibwarra died due to the severe nature of his wounds."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early childhood"}, {"tag": "p", "text": "In 11 BBY, Dev Sibwarra was born on the Core world of Chandrila to Ydra Kilwallen Sibwarra and a man named Sibwarra during the early years of the Imperial era. Ydra was a former Jedi Padawan who had left the Order before her training was complete during the last years of the Galactic Republic. Despite her lack of mastery over the Force, Ydra taught Dev the rudiments of Jedi training when she noticed his abilities, and planned on apprenticing him to a surviving Jedi. One ability she was able to teach him was life web."}, {"tag": "p", "text": "Around 2 BBY, Dev was ten-years old when his family emigrated to G'rho— a small Human colony world in the Outer Rim Territories—to escape detection by the anti-Jedi Galactic Empire. Shortly afterwards, Sibwarra witnessed the invasion of G'rho by the Ssi-ruuk—a saurian species from a distant starcluster in the Unknown Regions.|During the invasion, his parents were killed and he felt his mother's Force sense vanish."}, {"tag": "p", "text": "Earlier, the Ssi-ruuvi's supreme ruler—the Shreeftut—received visions through the Force of a hooded Human who revealed himself to be Emperor Palpatine, ruler of the galaxy. The Ssi-ruuvi Imperium powered their technology through an obscure process called entechment, a means of electronically transferring the life-energy of a person into a power source for a mechanical construct. Thus, Palpatine offered the Ssi-ruuvi dozens of worlds and millions of Humans to entech, in exchange for the use of their technology. Due to their secret agreement with the Ssi-ruuk, the Imperial leadership covered up the incident and blamed the Alliance to Restore the Republic for the attack."}, {"tag": "p", "text": "Dev was found huddled in an eroded ravine by Ssi-ruuvi scouts who took pity on him and gave him refreshments. Since he possessed strange powers to sense others, the Ssi-ruuk spared him from the entechment rig and instead shipped him to their capital world of Lwhekk in the remote Ssi-ruuk Star Cluster. There, he was brainwashed through mind manipulation techniques and hypospray treatments by a blue-scaled Elder named Sh'tk'ith or Bluescale. He was subsequently “adopted” by Bluescale and his colleagues Admiral Ivpikkis and Master Firwirrung; whom he came to regard reluctantly as family."}, {"tag": "p", "text": "It was from this boy that the Ssi-ruuvi Imperium discovered that Humans were the galaxy's dominant species. They also discovered that humanoids had longer containment time when enteched and could last longer as power sources than most other species. Due to Sibwarra's Force abilities and his ability to communicate with his fellow Humans, the Ssi-ruuk used Dev Sibwarra to calm the subjects being enteched rather than enteching him."}, {"tag": "h3", "text": "The Bakura Incident"}, {"tag": "p", "text": "However in 4 ABY, Emperor Palpatine was killed during the Battle of Endor onboard the Second Death Star. Due to his Force powers, Dev sensed this disturbance in the Force and told the Ssi-ruuk. With the Emperor unable to fulfill his promise, the Ssi-ruuvi launched an invasion of the edge of the known Galaxy. An expeditionary fleet including at least one Ssi-ruuvi assault carrier and numerous battle droids under Admiral Ivpikkis conquered Cattamascar and attacked Bakura. As the protege of the Ssi-ruuvi commander Ivpikkis, Dev served aboard the flagship Shriwirr during this campaign."}, {"tag": "p", "text": "By taking Bakura, the Ssi-ruuk would have seized a major Human world and thus enteched its population. Millions of Bakuran citizens would be enteched and used to power more battle droids and ship components. Bakura's raw metals would be utilized to manufacture entechment rigs and starships. With more resources, the Ssi-ruuk planned to \"invade\" the 12,000 terrestrial worlds of the known Galaxy particularly the heavily-populated Core Worlds—the center of galactic civilization and wealth."}, {"tag": "p", "text": "Following a sizeable naval engagement with Imperial elements; the numerically-superior Ssi-ruuvi fleet destroyed half the Imperial fleet. The Ssi-ruuk then quickly captured all outsytem planetary outposts. An outpost in the sixth planet of the Bakuran system was utterly destroyed and a command signal for Ssi-ruuk droids established in its vicinity. The Ssi-ruuvi fleet then blockaded the space around Bakura."}, {"tag": "p", "text": "To fulfill the demands of entechment, all bodies including those wounded or captured alive were taken back onboard to the entechment labs onboard the Ssi-ruuvi capital ships. This practice baffled the local Bakuran and Imperial recovery crew who would later learn to their horror that these unfortunate prisoners had been captured by the reptilian Ssi-ruuk and subjected to entechment. Due to his ability to communicate with the predominantly human prisoners in their native language, Dev was pressed into service at the entechment rig on Deck 16 throughout the night shift."}, {"tag": "p", "text": "Accompanied by Master Firwirrung, Dev played an active role in \"calming\" the entechment subjects while Firwirrung carried out the mechanical process of \"transferring\" life sources. These life sources would be used to power battle droids. Among those enteched was a wounded male Imperial officer who attempted to persuade Dev to not carry out the procedure. Brainwashed into believing the benefits of entechment, he merely brushed aside the man's pleadings. Later, a female prisoner was killed during an escape attempted. Indoctrinated, Dev sighed at the loss."}, {"tag": "p", "text": "An outpost in the sixth planet of the Bakuran system was utterly destroyed and a command signal for Ssi-ruuk droids established in its vicinity. The Ssi-ruuvi fleet then blockaded the space around Bakura.In an attempt to persuade the Bakurans to capitulate, the Ssi-ruuk transmitted a holo-recording from Dev Sibwarra who told them of the fate they would soon experience—that of entechment—and although Sibwarra described it as an eternal release, the Bakurans knew that was a lie."}, {"tag": "p", "text": "In response to heavy casualties, the Imperial governor Wilek Nereus sent an antique Message Droid to the forest moon of Endor after failing to contact Imperial Center and the Death Star II, to contact his Imperial superiors and ask for assistance to fend off the invasion force. Endor was the nearest world with a sizeable Imperial presence to Bakura as the site of the Second Death Star."}, {"tag": "h3", "text": "Enter the Alliance"}, {"tag": "p", "text": "Governor Nereus dispatched an Elegance message drone to the Imperial presence in the Endor system, hoping to alert Palpatine. However, the Imperials had been defeated during the pivotal Battle of Endor which saw the destruction of the Second Death Star and the death of Sith Lord Palpatine. Instead, the message was received by members of the Alliance to Restore the Republic which dispatched a task force to neutralize a hostile threat and to secure a potential ally."}, {"tag": "p", "text": "A small Alliance task force was quickly scrambled under the command of Luke Skywalker. It also included an Alliance delegation led by Leia Organa. Arriving in the Bakura system, the Alliance made contact with the Imperial Commander Pter Thanas, who agreed to cooperate even though a formal truce had not been settled. One of their first joint military actions was to deploy Alliance ships including the Flurry into the gap between the Ssi-ruuvi's three main cruisers to counter the enemy advance. Several Ssi-ruuvi picket ships and fighters were destroyed by Alliance starships."}, {"tag": "p", "text": "Meanwhile, Sibwarra sensed the arrival of a powerful Force-strong Jedi among the new arrivals—later revealed to be Skywalker. Privately, Sibwarra was fascinated with powers and skills of the extinct Jedi Knights and desired to meet one. However, he refrained from telling his superior Bluescale since it meant confessing a guilty \"secret habit\". Publicly, he pretended to lament the loss of human souls onboard the destroyed battle droids which prompted Bluescale to arrange for a \"renewal service\" later."}, {"tag": "p", "text": "Already, the Ssi-ruuk had sustained considerable losses including a cruiser and several drone fighters from attacks by the Alliance ships, which led to a temporarily withdrawal into hyperspace. This was the second time that the Ssi-ruuvi fleet had been on an emergency orient since their conquest of Cattamascar. This unexpected changed forced the Ssi-ruuvi leadership to analyze the newcomers' different tactics, starships and command style."}, {"tag": "p", "text": "Having helped beat off the Ssi-ruu attack on the system, the Alliance ships were holding position near the planet. Following the Ssi-ruuk withdrawal, Leia Organa contacted the planetary government and was able to arrange a meeting between the Rebel Alliance delegation and Governor Nereus, as well as the Bakuran Senate. Arriving at the capital Salis D'aar, Alliance delegates informed their Imperial and Bakuran counterparts of the recent developments on Endor and attended a special session at the Senate."}, {"tag": "p", "text": "There, Imperials, Bakurans and Rebels alike were shown a recording sent by the Ssi-ruuk by Sibwarra and were horrified to see how entechment worked; the individual's life energy was sapped from his body and used to power war machinery. This was received with much outrage and horror from most of the assembled delegates. Some including Commander Thanas denounced Dev as a collaborator with the enemy. This sparked a wave of paranoia among the populace who feared the terror of entechment and had a prejudice against aliens."}, {"tag": "p", "text": "The Alliance party then iterated that they were there to help Bakura and offered an official truce, which Nereus said would be discussed. That evening, Alliance and Imperial delegates settled a formal truce during a dinner organized by the Bakuran Prime Minister Yeorg Captison. However, the Imperial Governor Nereus still bore resentment towards his Alliance counterparts and sort to undermine them by any means necessary including collaborating with the Ssi-ruuk."}, {"tag": "h3", "text": "The \"Outsider\""}, {"tag": "p", "text": "Following the Alliance attack and the brief jump into hyperspace, the flagship Shriwirr had been left in state of chaos with the galley swamped with blobs of spilled food. Dev had voluntarily joined the P'w'eck slave crew in cleaning up the mess with galleyvac units. Following an hour, Dev reported for a \"renewal service\" at Elder Sh'tk'ith's work station on the battle-droid deck."}, {"tag": "p", "text": "Sensing that Sibwarra was hiding something since sharp Ssi-ruuvi nose-tongues were able to notice subtle changes in sweat, Bluescale ordered him into a sealed cage and interrogated him. Dev tried to deflect attention by talking about his translation project but Bluescale brought him to the topic by bluntly reminded him of his inferior place in Ssi-ruuvi society. A tearful Sibwarra then revealed to Sh'tk'ith of the presence of another Force user among the newcomers."}, {"tag": "p", "text": "According to Dev, this \"Outsider\" had introduced new and successful tactics to the planet's defenders. Having extracted the necessary information, Sh'tk'ith subjected Dev to a hypnotic hypospray treatment which induced him into a sleep. Dev awoke to find himself on the command bridge and quickly learnt that Sh'tk'ith had reported the information to other leaders of the expeditionary force including Ivpikkis and Firwirrung."}, {"tag": "p", "text": "Recalling how Dev had sensed Palpatine's death in the Force many light-years away, Sh'tk'ith suggested that the Force powers of the \"Outsider\" could be used to conduct entechment from a far distance. The entechment master Firwirrung suggested modifying the entechment rig to keep this being alive in a fully magnetized state drain the life energies of millions of sentients from light years away. Ivpikkis welcomed the idea and saw it as a means of enteching all sentients within the vicinity of known space."}, {"tag": "p", "text": "They then compelled Sibwarra to tap his mind into the \"unseen universe\" or the Force in order to discover the identity and whereabouts of this Force-strong being. Dev complied with their order provided they promised not to entech him when he was no longer needed. To allow him to tap into the Force, Sibwarra was induced into a trance by a hypospray. Through the Force, Dev discovered that the Outsider was Luke Skywalker and that he was in the Bakuran capital Salis D'aar. The feelings of power from Skywalker were enough to give Dev some remembrance of his past."}, {"tag": "p", "text": "Satisfied, the Ssi-ruuvi leadership openly praised his efforts. However, Dev was personally torn between loving his \"adopted family\" and hating them for the way they had exploited him. The commander Ivpikkis stoked Dev's hatred by derogatorily referring to him as the \"pet\" of Firwirrung. Feeling guilty, Sibwarra initiated some sort of telepathic contact with Skywalker, warning him of the Ssi-ruuvi intent on capturing the Jedi, as well as giving him a vision of how dangerous the Ssi-ruuk could be to the larger galaxy if left unchecked."}, {"tag": "p", "text": "Due to their losses in the recent Alliance-Imperial attack, Admiral Ivpikkis decided to prevent further losses by making a covert deal with Governor Nereus. The Ssi-ruuk agreed to withdraw from Bakura in exchange for the handover of the Force-strong \"Outsider\"—Skywalker. Given that their physiology made them incapable of communicating directly with Nereus, Sibwarra was woken from his bed pit in the night by Firwirrung to initiate contact with Nereus. The Ssi-ruuk's devious scheme led Sibwarra to question the motives of his \"family\"."}, {"tag": "p", "text": "Earlier, the saurians had captured several operational Imperial starships during their campaign which allowed them to access HoloNet. In the early hours of the morning, Wilek Nereus received a HoloNet transmission from the Ssi-ruuk requesting negotiations at the Imperial headquarters. Dev presented the Ssi-ruuvi terms of a full withdrawal in exchange for the handover of Skywalker. Nereus accepted the offer; given his hatred of the Rebels and as part of his secret plan to stab his Rebel colleagues in the back."}, {"tag": "p", "text": "He told them to contact him within a day while he made the sufficient arrangements for Skywalker. However, Nereus had no intentions of allowing the Ssi-ruuk to survive, and decided to double-cross the aliens. He would infect Skywalker with parasitic olabrian trichoid larvae, which would eat into Skywalker's body upon hatching. Nereus's plan was to allow the Ssi-ruuk to capture Skywalker, only to have the trichoids hatch and begin multiplying and killing the Ssi-ruuk. An avid collector of alien dentition, Nereus planned to add the alien's jaw bones to his personal collection of bones."}, {"tag": "h3", "text": "A Willing Pawn"}, {"tag": "p", "text": "However, the Ssi-ruuk had also planned to double-cross the Imperials after obtaining Skywalker by launching a second offensive, targeting the orbital space station first. To supplement this operation, more P'w'eck slaves including immature ones from the other vessels in the fleet were enteched. While they could not last as long as Humans, they were needed to power the drone fighters for the impending attack."}, {"tag": "p", "text": "Meanwhile, Firwirrung set to work on the \"Skywalker operation\" and arranged for a special reclining entechment bed to be built. This was equipped with locking arms, leg bands and twin tubes which would pump both magsol and nutrients into the individual's bloodstream, pacifying his nervous system for the bed's catchment circuits. A nutrient flow allowed the Ssi-ruuk to leave the subject on the entechment bed for several days."}, {"tag": "p", "text": "The reptilian aliens also developed a mind-control drug that would force a human subject to entech subjects many light-years away against their will in an excruciatingly painful process. Three new chairs were also constructed to supplement the increased energy flow. This bed was successfully tested on Dev, who enteched a few human prisoners a few meters away from him."}, {"tag": "p", "text": "For this operation, Sibwarra was bound to the bed and was temporarily paralyzed by having magsol and nutrients injected into his blood. The mind-control drug was also tested on Dev who willingly stabbed both his own palms at the orders of Firwirrung. Due to the influence of the drug and his indoctrination, he obeyed these orders regardless of the harm to his own well-being. Having fulfilled his duty, he was ordered to take a bath to recover from his experience."}, {"tag": "p", "text": "Meanwhile, Nereus put his plans into operation by secretly planting three olabrian trichoid eggs into Skywalker's lunch. However, Skywalker shared the meal with a prominent Bakuran senator Gaeriel Captison. Later, he was lured to a local cantina near the spaceport by Nereus. At the same time, the droids C-3PO and R2-D2 had intercepted Ssi-ruuk communiqués, and learned that not only did the Ssi-ruuk plan on capturing Skywalker, but also intended on attacking Bakura an hour later. They also learned the precise location and time when the Ssi-ruu planned on seizing the Jedi."}, {"tag": "p", "text": "Having made the necessary arrangements, Nereus agreed to provide a Lambda-class shuttle for the Ssi-ruuk party and to lower the orbital net to allow passage through on official business. A Ssi-ruuk party including Firwirrung and Bluescale along with Dev would be allowed to land near the cantina. By the time Captison and R2-D2 arrived to alert Skywalker, the Ssi-ruuk party and a group of Imperial stormtroopers had also arrived."}, {"tag": "p", "text": "Upon meeting him, Dev announced that the Ssi-ruuk commander Ivpikkis had invited Skywalker aboard the flagship Shriwirr for talks, which the Jedi accepted. However, when the Ssi-ruuk tried to take Captison with him, Skywalker drew his lightsaber in defense. In response, Dev ordered the Stormtroopers to stun the pair and a fight erupted in the cantina. The Ssi-ruuk also produced their paddle beamers and took on the Jedi Knight."}, {"tag": "p", "text": "In the ensuing struggle, Skywalker slew one of the saurian aliens and knocked out the rest of the party. Dev tried to shoot him with blaster but was also immobilized. Sensing Sibwarra's plight, Skywalker attempted to heal him of the brainwashing he had undergone. However, this distracted him, and Luke was rendered unconscious by a swift swipe to the head from Bluescale."}, {"tag": "p", "text": "However, Skywalker's efforts were not in vain since his ministrations with the Force on Sibwarra's mind had successfully broken the mental bonds enslaving the other man, who resolved to aid the Jedi however he could. Furthermore, Gaeriel, though stunned, was not taken. Instead, Artoo helped her out of the cantina, and she received medical attention at the Imperial garrison."}, {"tag": "p", "text": "The Ssi-ruuk returned to their shuttle at Pad 12 with Skywalker. The Jedi's ever-loyal astromech droid R2-D2 tried to climb aboard the ramp to rescue his master but was thrown out by the P'w'eck guards. Having achieved their goals, they returned to the Ssi-ruuk flagship Shriwirr to commence their entechment operation. Meanwhile, the Ssi-ruuk commenced a full-scale attack, striking at the orbital station that hovered over Bakura."}, {"tag": "h3", "text": "Redemption"}, {"tag": "p", "text": "The shuttle ascended into space in the midst of a space battle between the Imperium and the combined strength of the Alliance and Empire. After docking at the hangar bay, an unconscious Skywalker was carried by Sibwarra to the designated entechment laboratory. Still unconscious, Skywalker was bound to the modified entechment chair. However now that Sibwarra had outlived his usefulness, his Ssi-ruuvi masters planned to entech him, breaking an earlier promise they had made with him."}, {"tag": "p", "text": "Firwirrung himself promised to lower the catchment arc and inject the solutions. Having put up with much abuse by his Ssi-ruuvi \"family\" for so long, Sibwarra was most outraged and refused to abide. With nothing more to lose, Dev rushed to free Skywalker. At that moment, all lights in the laboratory went out and everything unfolded. Skywalker had actually regained consciousness and used the Force to manipulate a P'w'eck slave into smashing the control board, plunging the room into darkness."}, {"tag": "p", "text": "Amidst the chaos, Skywalker ignited his lightsaber and killed two Ssi-ruuk before destroying three security droids. During a brief conversation, Sibwarra related to Luke of the existence of thirty other entechment labs aboard the vessels. Skywalker noted the strong presence of the dark side due to the numerous sentients murdered and enteched on the vessel. Making their way to the engineering room on the eighteenth deck, the two traversed across the stun trap-littered corridors of the battle cruiser."}, {"tag": "p", "text": "While Firwirrung and his P'w'eck crew worked on a second entechment chair, Elder Sh'tk'ith and three gangs of P'w'ecks confronted Skywalker and Dev at Deck 16. The two Force-strong individuals proved more than a match for Sh'tk'ith's reinforcements. In the ensuing confrontation, Bluescale was killed by Dev with a shot to the head. However, Skywalker began to succumb to the effects on the olabrian parasites in his bronchi."}, {"tag": "p", "text": "They proceeded to the hangars to make an escape but discovered that most of the Ssi-ruuk had fled. Fearful of dying on an unconsecrated world, Ivpikkis and other Ssi-ruuvi officers had fled on lifeboats and were recovered by the other warships. Every ship in the fleet fled for the safety of Ssi-ruuvi home space except the flagship Shriwirr. For a moment, it seemed that victory would be achieved with the vanquishing of the Ssi-ruuvi threat."}, {"tag": "p", "text": "In the engineering deck, the pair were ambushed by Firwirrung and four P'w'ecks. With his lightsaber, Skywalker quickly neutralized these threats but expressed his disapproval when Dev killed a wounded P'w'eck survivor. At that moment, Luke felt a disturbance through the Force. With the vanquishing of the Ssi-ruuvi, Nereus then hatched his secret plan of back-stabbing his enemies by ordering Thanas to turn his flagship Dominant on the Alliance flagship Flurry; destroying it along with several Rebel starfighters; effectively ending the truce."}, {"tag": "p", "text": "The remaining Alliance ships were trapped in a bottleneck between Bakura and the Imperial fleet. It seemed the only way for the Alliance ships to escape was for a suicide run on the Dominant. However, Luke Skywalker had used the Force to persuade the Thanas to come on their side by sending feelings of peace and serenity. Admiring the heroism of his former foes and seeing the underlining flaws in his superior Nereus, Thanas ordered his ship to break formation and open fire on the Shriwirr; as a gesture of cooperation with the Alliance."}, {"tag": "p", "text": "Unfortunately, Dev was mortally wounded during the bombardment of the Shriwirr and sustained severe burns across his body. Sensing the presence of the Olabrian trichoid larvae in his body, Skywalker used the Force to eliminate the parasites by drawing them out into oxygen which was poisonous to them. Luke then contacted Thanas to request a boarding crew to rescue him and the mortally wounded Sibwarra. As a goodwill gesture, the Imperial commander agreed to come in person."}, {"tag": "p", "text": "Thanas also agreed to surrender himself and the Dominant to the Alliance authorities in exchange that his men be sent to a neutral pickup point and allowed to return home, and that Sibwarra be put on trial. When the local Imperial Security Bureau operative among the bridge crew tried to intervene, Thanas quickly stunned the man. Thanas dispatched a two-man evacuation pod with medical equipment and placed Captain Dren Jamer in de-facto command of the vessel."}, {"tag": "p", "text": "Luke and a wounded Dev were rescued from the Shriwirr and taken on board the Millennium Falcon. With Sibwarra in a Jedi healing trance, the Imperial medical corpsman assessed that Sibwarra had little chance of surviving his energy-blast wounds due to severe damage to internal organs. Despite regaining consciousness and a brief exchange of words with Skywalker, Sibwarra's wounds were too severe and he died despite the efforts to resuscitate him."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "A grieving Skywalker was left to contemplate the loss of a potential apprentice who would have played a role in his new Jedi Order. Following the cessation of hostilities between the Imperials and the Alliance, Skywalker ensured that he was given a burial in space. In orbit aboard the Millennium Falcon, Luke Skywalker and other members of the so-called \"Heroes of Yavin\" released his corpse to fall through the atmosphere of Bakura during a solemn ceremony."}, {"tag": "p", "text": "To honor his role in the Bakura Incident, the New Republic renamed the captured Ssi-ruuvi flagship Sibwarra after the late Dev Sibwarra. Following the Incident, Luke Skywalker freed all the captive human energies aboard the cruiser to purge it of the strong dark side presence. This cruiser took part in a brief punitive expedition into the Ssi-ruuk Star Cluster prior to the Liberation of Clak'dor VII."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a child, Dev held the Jedi in high regard due to his mother being a Jedi. Following his adoption and \"indoctrination\" by the Ssi-ruuk, he adopted many of the norms of his masters' culture. He was brainwashed into believing that entechment was a high honor and thus looked forward to undergoing the process himself. Due to his proficiency in Galactic Basic Standard, Sibwarra was used by his saurian masters as an intermediary and also to calm Human entechment subjects."}, {"tag": "p", "text": "He also learned to understand the complicated Ssi-ruuvi tongue which could not be reproduced by Humans due to physiological differences. Other aspects of Ssi-ruuvi culture included a complete ignorance of clothes and their sharp scent of smell which prompted Dev to adopt the practice of bathing several times a day. However, Sibwarra also developed a prejudice against the P'w'ecks, a lowly slave species that had been subjugated earlier by the Ssi-ruuk."}, {"tag": "p", "text": "Due to his impressionable age and the abuses of his Ssi-ruuvi \"family\", Sibwarra was receptive to Skywalker's attempts to minister on his mind and heal him of his indoctrination. This proved essential during a revolt against the Ssi-ruuk in the closing stages of the Bakuran Incident."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dev Sibwarra first appeared as a point-of-view character in Kathy Tyers's 1994 novel The Truce at Bakura; marking his only appearance in the Expanded Universe. When writing the book, Tyers said in an interview with Ilene Rosenberg for Star Wars Adventure Journal 4 that her original intention was for Sibwarra to survive, and stated that his death was one of the unpleasant parts of The Truce at Bakura for her. Tyers also said that her characterization behind Sibwarra was to portray him as an abuse victim."}, {"tag": "p", "text": "Later, he was first referenced and illustrated in the 1995 The Essential Guide to Characters by Andy Mangels and Michael Butkus respectively. Further information on the character was published in West End Games' The Truce at Bakura Sourcebook in 1996. In April 2000, Kevin J. Anderson and Daniel Wallace referenced Sibwarra in their The Essential Chronology and its revised edition The New Essential Chronology, which was published in October 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}