{"url": "Devaronian", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Colonies species", "Category:Devaronians", "Category:Mammalian sentient species"], "nodes": [{"tag": "h1", "text": "Devaronian"}, {"tag": "p", "text": "Devaronians were a sentient species from the planet Devaron. They exhibited great sexual dimorphism, with the males being bald and sporting horns, and the hornless females displaying a full head of hair. Cikatro Vizago, a crime lord on Lothal and the leader of the Broken Horn Syndicate, was a male Devaronian."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Hailing from the planet Devaron, the Devaronians were a species of sentient humanoids, characterized by two legs, a torso, a single head, two arms with hands, fingers, and an opposable thumb. The Devaronian head featured a nose, a mouth filled with pointed teeth, and two forward-facing eyes, which notably came in shades of red, purple, and dark brown. Both sides of the face were flanked by two pointed ears that stuck out slightly."}, {"tag": "p", "text": "The species had two sexes, male and female, which were dimorphic. The males had short horns growing from the top of their heads, while the females were hornless with small vestigial bumps on their foreheads. Females had a full head of hair, but males were bald— however, some of them grew sideburns as well as beards."}, {"tag": "p", "text": "Devaronians had black blood, and were silver-based due to the unique blood filtration and cleansing system of the species. Processed through two livers, their bodies were constantly cleansed of toxins and carcinogens which allowed them to be highly resistant to poison and consume foods toxic to other species. To this end, sulfur was used as a stimulant on Devaron to enhance speed and strength, because inhaling it caused the substance to enter the bloodstream rapidly. Their livers struggled to eliminate sulfur from their system, meaning that long-term use could be dangerous. Their skin was also immune to fire and extremely high temperatures."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Devaronians lived under a matriarchal government on their homeworld; though males weren't prohibited from holding positions of power, few desired to do so. The biological dimorphism of the species carried over into their culture, wherein females tended to be more settled and serious minded, while males longed to wander the stars. Devaronian males were extremely dedicated to their families despite their wanderlust, and were known to send their earnings they accumulated abroad back to their families to support them."}, {"tag": "p", "text": "Force-sensitivity was found in higher frequencies among Devaronians than in other species. Despite this, no strong Force-based tradition emerged on Devaron or among their colonies. The Jedi Order established the Temple of Eedit on Devaron to train the Forceful children there, with females making up the larger percentage of students as males desired to travel more than the Jedi culture permitted."}, {"tag": "h2", "text": "Devaronians in the galaxy"}, {"tag": "p", "text": "Developing hyperdrive technology on Devaron independently from extraterrestrial assistance, the Devaronians had explored and interacted with the galaxy before the Galactic Republic ever made contact with their region of space. To this end, Devaronians were a common sight across the galaxy for tens of millennia before the Clone Wars."}, {"tag": "p", "text": "Under the reign of the Galactic Empire, a Devaronian named Cikatro Vizago led the Broken Horn Syndicate, a Lothal-based criminal organization. The crew of the starship Ghost occasionally relied on Vizago for funding and information. Another Devaronian named Yelkin worked as a miner on the thorilide mines of Cynda. Shortly before the Battle of Yavin, a red-skinned male Devaronian was present in the cantina of Mos Eisley the day Obi-Wan Kenobi and Luke Skywalker met Han Solo and Chewbacca. During 3 ABY, the female Devaronian named Torro Sbazzle worked as the Executive Chef of Cloud City. During the New Republic Era, a Devaronian named Burg operated as a mercenary."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The devil-faced Devaronians first appeared in Star Wars: Episode IV A New Hope, in which one of them was seen in Chalmun's Cantina. The Devaronian patron, whose mask was created by Rick Baker, was added to the scene during the additional photography that filled out the cantina booths with exotic aliens."}, {"tag": "p", "text": "In the now defunct mobile game Star Wars: Uprising, female Devaronians were mistakenly depicted with horns, as exemplified by the acquisition specialist crew member."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}