{"url": "Devastation_of_Da_Soocha", "categories": ["Category:Legends articles", "Category:Battles in Hutt Space", "Category:Battles of the Second Imperial Civil War", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Devastation of Da Soocha"}, {"tag": "p", "text": "The Devastation of Da Soocha occurred during the Second Imperial Civil War in 137 ABY when the Sith Empire's First Sith Imperial Strikeforce unleashed deadly toxins on the watery world of Da Soocha and bombarded the Hutt Temple Maya Armus on its moon Napdu. The Imperial Skull Squadron then decimated all fleeing starships while stormtroopers eliminated all remaining survivors. While this was hailed an Imperial victory by Rulf Yage, the Sith's actions garnered the outrage of the Hutts who made overtures to Cade Skywalker."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Following the Genocide on Dac, several Mon Calamari survivors fled to the watery world of Da Soocha in the remote Cyax system. The Hutt Azzim Anjiliac Atirue ran a spa at the Hutt Temple of Maya Armus on Napdu, the fourth moon orbiting Da Soocha. In response, the Sith Empire dispatched the First Sith Imperial Strikeforce under the two Sith Vul Isen and Darth Azard to punish Azzim by rendering Da Soocha uninhabitable by bombing the world's oceans with deadly toxins. These toxins had been deployed to great effect on Dac, exterminating all living organisms on the planet including billions of Mon Calamari and Quarren."}, {"tag": "h3", "text": "Confrontation"}, {"tag": "p", "text": "Upon arriving above Da Soocha's orbit, the War Hammer established contact with Maya Armus. The Sith confronted Azzim, who tried to offer the service of his spas and denied accusations that he had harbored Mon Calamari refugees. Anticipating the destruction the Sith would inflict, he ordered his Twi'lek secretary Xanif to transmit the recording of the meeting to his uncle Vedo Anjiliac Atirue on the Hutt capital Nal Hutta and to escape or die trying. On the bridge of the War Hammer, Azard ordered the deployment of the Sith–Imperial attack ships of squadron Quad Victor that would deposit the deadly toxin into the oceans of Da Soocha; exterminating all life on that world. These bombers quickly accomplished their mission and returned to the War Hammer."}, {"tag": "p", "text": "Azard also ordered the bombardment of Napdu and the secondary deployment of stormtroopers to eliminate all possible survivors, an act which Moff Yage regarded as \"overkill\". Overruled by Lord Azard, Yage then ordered the Star Destroyer's turbolaser batteries to obliterate Maya Armus, killing most of the inhabitants including the Hutt Azzim who could only contemplate his last moments. Several civilian freighters attempted to escape the Imperial onslaught but Darth Rauder, aboard her Sith Fury, labeled them \"enemy combatants\" and ordered Skull Squadron to take them out. Though Tev Rimon and Jae Akura protested and confirmed that the targets were unarmed, Captain Gunn Yage commanded the Skulls to carry out Lady Rauder's orders."}, {"tag": "p", "text": "On the ground, stormtroopers led by Sergeant Harkas mopped up the remaining survivors. One of his subordinates Corporal Trask expressed disapproval of the ethics behind his Sith masters' actions. However, Harkas reasoned that they were only following orders and shot dead a wounded survivor to support his argument."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "With the elimination of all survivors on Napdu and the infection of Da Soocha completed, Yage was praised for his actions and hailed by a satisfied Vul Isen as the \"Conqueror of Da Soocha\", adding to his zeal of \"Hero of Ossus\". However, Yage was ashamed and tormented by his guilt."}, {"tag": "p", "text": "On the Hutt capital Nal Hutta, Azzim's uncle Vedo received a recording of the events on Da Soocha. He subsequently convened a meeting of the Hutt leadership on the capital Nal Hutta to consider entering the war on the side of the Galactic Alliance Remnant and the Fel Empire in retaliation for the Sith atrocities on Da Soocha. The former Jedi Cade Skywalker received a transmission from Queen Jool who requested the former's presence at this meeting. Cade was already hunting Isen so he agreed to work for the Hutts. This act, combined with Isen's previous Genocide of Mon Calamari, essentially signaled his downfall"}, {"tag": "h2", "text": "Appearances"}]}