{"url": "Devastation_of_Parnassos", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Artificial disasters"], "nodes": [{"tag": "h1", "text": "Devastation of Parnassos"}, {"tag": "p", "text": "At least one hundred years before 24 ABY, the planet Parnassos was devastated by a nuclear calamity. The Con Star Mining Corporation abandoned the planet and its population, who were reduced to a post-apocalyptic existence. Con Star took care to conceal this calamity by listing the planet as uninhabited. During a First Order mission to Parnassos, General Brendol Hux, along with his local guide, Phasma, discovered evidence of this calamity."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 162 BBY, the planet Parnassos was settled by the Con Star Mining Corporation, which wanted to exploit the planet for its metals and minerals. Con Star established several settlements throughout the planet and imported colonists from various species including humans, Dugs, and Gands as employees. Con Star's promotional videos promoted Parnassos as a lush, green world with blue oceans, sandy beaches, and neat settlements."}, {"tag": "p", "text": "Terpsichore Station was Con Star's largest mining operation while Arratu Station produced fabrics and textiles for the company's employees. Other stations including Calliope Station and Cleo Station, the latter of which was used to produced mining equipment. These stations were equipped with various modern amenities including droids, laboratories, factories, houses, and even amusement parks. Con Star also erected an orbital automated defense system around the planet to protect their assets."}, {"tag": "h2", "text": "The catastrophe"}, {"tag": "p", "text": "At least one hundred years before the 24 ABY, the planet Parnassos was devastated when a poorly maintained reactor at an unidentified station caused a nuclear reaction, destroying the structure and its surrounding buildings. Sometime after the nuclear incident, the area surrounding the focal point was fenced off, with signs posted to prevent unwary travelers from entering the area and receiving deadly levels of radiation."}, {"tag": "p", "text": "Although Brendol Hux was certain that Con Star was involved in the nuclear accident in some way, he was unsure whether it was deliberate, a rival company had conducted corporate sabotage, or the entire thing was the result of a meltdown. Similarly, Hux also speculated that nuclear weapons may have been involved, although he wasn't sure if they were deliberately detonated or if it was the result of an accident at a nuclear facility. After examining the ruined reactor, Brendol realized that the devastation had been caused by a nuclear accident and speculated that someone must have cut corners on building materials or made an error."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "This nuclear accident had a devastating impact on Parnassos. Despite efforts to contain the radiation, it soon spread to the rest of the landmass, which became a barren desert. Most of the vegetation and food animals on that landmass perished, leaving the survivors to eke out a harsh existence. Instead of fixing their mistake, Con Star abandoned the planet and listed it as uninhabited on official records."}, {"tag": "p", "text": "Cut off from the galaxy, Con Star's employees and settlers were reduced to a primeval existence. Some survivors banded into clans such as the Scyre and Claws who fought for scarce resources. Other settlements such as Arratu Station developed into cities where a well-fed, wealthy elite maintained a semblance of order over the starving masses through gladiatorial fights. Other continents were not as badly affected by the nuclear devastation and had settlements with agricultural crops like grain such as Cleo Station."}, {"tag": "p", "text": "By the time of the New Republic Era, most of the planet's inhabitants were unaware of the full the details of Parnassos' nuclear devastation as well its history as a Con Star colony. However, relics of the pre-devastation era lingered in the forms of salvaged technologies including droids. At least two stations, Terpsichore and Calliope Station, were manned by medical and probe droids, who were programmed to serve their \"creators.\""}, {"tag": "p", "text": "Around 24 ABY, the First Order General Brendol Hux and his local guides Phasma and Siv discovered evidence of the nuclear calamity while traveling through the \"Dead Lands\" to reach Hux's ship so that he could radio the First Order for help. Studying the wreckage, Hux realized that the devastation was a nuclear accident and vowed to hold Con Star accountable for its malfeasance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The devastation of Parnassos was first referenced in Delilah S. Dawson's 2017 novel Phasma, which was produced as part of the lead-up to Star Wars: Episode VIII The Last Jedi. During an interview with StarWars.com, Dawson described Parnassos as the Earth after a nuclear disaster, where the rain is poison, the food-animals are dead, and the land is barren and rocky, with an angry ocean à la Mad Max: Fury Road, a 2015 film which inspired Dawson during the writing of Phasma."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}