{"url": "Devastator", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Flagships", "Category:Imperial I-class Star Destroyers of the Galactic Empire", "Category:Starships of Death Squadron"], "nodes": [{"tag": "h1", "text": "Devastator"}, {"tag": "p", "text": "The Devastator was an Imperial I-class Star Destroyer of the Imperial Navy famous for its participation in the Battle of Scarif, the capture of the Tantive IV and as Darth Vader's flagship for a time. It later participated in the Imperial victory at Hoth and was destroyed during the decisive battle fought at Endor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Devastator was 1,600 meters long, the standard length for an Imperial I-class Star Destroyer. As such, it was armed with turbolaser batteries, ion cannons, and several tractor beam projectors."}, {"tag": "h3", "text": "Upgrades"}, {"tag": "p", "text": "Several dozens of times in its service life, the Devastator was structurally altered from its original design to include the latest weapons and systems, which kept it more than competitive with the battleships that were commissioned later. Unlike some other Imperial I-class Star Destroyers, such as Lawbringer and Relentless, the hangars within Devastator's ventral docking bay were split into two smaller sections, and the aft side featured a cover, so that the bays behind were not visible. Additionally, its tractor beam targeting array with diagonal support beams (located between its two deflector shield generator domes) was replaced with a communications tower with vertical support beams."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "The Devastator was the last of the Imperial I-class Star Destroyers to lumber out of Kuat Drive Yards before the facility began producing the Imperial II-class. Despite this, it was still considered a state-of-the-art warship, and had undergone numerous retrofits to keep it comparable with newer ships of the line."}, {"tag": "p", "text": "In 5 BBY, fourteen years after the establishment of the Galactic Empire, the Devastator was the flagship of Lord Tion."}, {"tag": "h3", "text": "Under the Sith"}, {"tag": "h4", "text": "Scarif"}, {"tag": "p", "text": "In 0 BBY, it belonged to the Sith Lord Darth Vader, who used it in his struggle against the Rebel Alliance. Appearing over the planet Scarif near the conclusion of the Battle of Scarif, the arrival of the Devastator proceeded to cut off the escape of the Alliance Fleet, immediately destroying a GR-75 medium transport by colliding with it, and disabling several ships, including the Rebel flagship Profundity which had received the plans for the Death Star. After boarding the Profundity, Vader proceeded to cut through Rebel troopers who were delivering the plans. Vader failed, and the plans were delivered to Leia Organa, onboard the Tantive IV, a CR90 corvette that was docked onboard the Profundity. Fleeing at the last second, the Tantive IV escaped from the system and Vader pursued the starship in the Devastator."}, {"tag": "h4", "text": "Tatooine"}, {"tag": "p", "text": "Arriving over Tatooine, a brief skirmish ensued over the planet, resulting in the Star Destroyer successfully capturing the Tantive IV. Imperial troops boarded the enemy ship, and the Devastator also targeted and destroyed any escape pods that were launched in order to ensure none of the Rebels escaped. The sole exception was R2-D2 and C-3PO's pod—which even then was only because Imperial Gunners did not detect any life signs in the pod, and dismissed it as a malfunction."}, {"tag": "h4", "text": "The Cylo incident"}, {"tag": "p", "text": "Vader used the Devastator to track Cylo's fleet of Whale-ships in the Crushank Nebulae, courtesy of information from the doctor's colleague Thlu-Ry. As the Star Destroyer approached the nebulae, many of the abominations fled. This caused Vader to lead the chase in his TIE Advanced, supported by many TIE/ln starfighters. However, Cylo's flagship broke off from the main group, and attacked the Devastator with an ion pulse. With the ship disabled, Vader flew his TIE into Tulon Voidgazer's ship, just before the fleet could jump to hyperspace. They emerged over Kuat, the construction site of the Executor-class Star Dreadnought Executor, which was to be under the command of Grand General Cassio Tagge. Cylo took over the Super Star Destroyer, but was soon killed by Vader, along with all of his abominations and staff. Due to Tagge's trust in Cylo, he was demoted by Emperor Palpatine, then killed by Vader. The Executor was given to Vader for defeating Cylo."}, {"tag": "h3", "text": "New command"}, {"tag": "p", "text": "With the transfer of his flag, Admiral Jhared Montferrat took command of the Devastator. However, the legendary vessel remained a part of Death Squadron, Vader's personal flotilla."}, {"tag": "h4", "text": "C-3PO"}, {"tag": "p", "text": "Task Force 99, an elite Stormtrooper squad, used the Devastator to interrogate C-3PO after he was captured during the siege on Tureen VII. Although Vader wanted the droid destroyed, Kreel felt it would be in the group's best interests to use the droid as bait to lure the Rebellion to rescue him."}, {"tag": "h4", "text": "Hoth"}, {"tag": "p", "text": "Under Montferrat's command, the Devastator notably participated at the Battle of Hoth, a clear Imperial victory, where it destroyed a transport."}, {"tag": "h4", "text": "Endor and destruction"}, {"tag": "p", "text": "The Devastator, the pride of the Death Squadron, met its fate at Endor, during a battle which the Emperor had meant to be the end of the Rebellion. The ship, still commanded by Montferrat, stood between Blade Squadron, a group of Rebel B-wing pilots and the DS-2 Death Star II Mobile Battle Station. Ultimately, the ship was destroyed when two of those pilots, Gina Moonsong and Braylen Stramm, caused a chain reaction of explosions that led to the systematic demolition of the Star Destroyer."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Prior to the destruction of Alderaan, the Devastator was the property of Darth Vader himself. As of the Battle of Hoth, it was commanded by Jhared Monteferrat, who held the title of admiral when the ship was destroyed during the fight over Endor. The senior ISB officer onboard was Captain Ronnadam."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}