{"url": "Devastation_of_Uphrades", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Artificial disasters", "Category:Battles in the Inner Rim", "Category:Battles of the Desolator crisis", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Devastation of Uphrades"}, {"tag": "p", "text": "In 3643 BBY, during the Cold War between the Galactic Republic and the reconstituted Sith Empire, the Sith Lord Darth Angral devastated the planet Uphrades using the Desolator superweapon. The penultimate event of his campaign of vengeance against the Republic and the Jedi Order for the death of his son, Tarnis, Angral's attack on the agriworld of Uphrades was a way to test his newly-constructed weapon before using it to attack Tython, the homeworld of the Jedi. The Desolator weapon ravaged Uphrades' surface and atmosphere, killing millions of civilians, and before departing for the Tython system, Angral dispatched a boarding team to destroy the medical frigate Daybreaker in order to eliminate any witnesses."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3643 BBY, the Sith Lord Tarnis was killed in a duel with a young Jedi Knight during the Cold War between the Galactic Republic and the reconstituted Sith Empire. Tarnis, who had been working undercover as a scientist on the Republic superweapon initiative, had used his access to the Republic's superweapon projects to develop a method of combining the Death Mark laser, Shock Drum, and Planet Prison weapons into a single ship-mounted weapon capable of destroying a planet. Tarnis named the weapon the Desolator, and he sent his father, Darth Angral, copies of the design files during his attempt to use the Planet Prison against the Republic capital of Coruscant. Tarnis's plans were foiled when the Jedi Knight killed him in battle, causing Angral to embark on a campaign of vengeance against the Republic and the Jedi Order in response, and Angral dispatched his three Sith apprentices to capture the Republic's offworld weapon facilities across the galaxy."}, {"tag": "p", "text": "With Tarnis's design files, Angral constructed the Desolator weapon and installed it on his personal Harrower-class dreadnought, the Oppressor. The Jedi Master Orgus Din—a personal enemy of Angral and the former Master of the Knight who had killed Tarnis—attempted to sneak aboard the warship in the Alderaan system and kill Angral, but he was only able to install a tracking device before the Sith Lord captured and executed him. Angral then departed the star system, jettisoning Din's body into space, and traveled to the Uphrades system to test the completed Desolator weapon on the Republic agriworld of Uphrades."}, {"tag": "h2", "text": "The devastation"}, {"tag": "p", "text": "Upon entering the Uphrades system, the Oppressor fired the Desolator at the planet, ionizing Uphrades' atmosphere and trapping all starships on the surface. The Desolator was wreaking havoc on the planet through seismic vibrations when the Republic medical frigate Daybreaker arrived in the system, and the ship's crew watched as the final stages of the Desolator set Uphrades' atmosphere on fire, and the planet tore itself apart. The attack on Uphrades wiped out the planet's 16 million inhabitants, leaving only a few hundred survivors scattered across the ruined surface of the world. Upon sighting the Daybreaker, the Oppressor dispatched boarding pods to capture the vessel and eliminate all witnesses. Satisfied that the weapon was operational, Angral ordered the Oppressor to depart for Tython, the homeworld of the Jedi Order."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Not long after Angral's departure, the Jedi Knight responsible for Tarnis's death arrived in the Uphrades system, having followed the signal from Orgus Din's tracking device. Along with the Jedi's Padawan, Kira Carsen, and the astromech droid T7-O1, the Knight foiled the Imperial attack on the Daybreaker and rescued the ship's crew. The Daybreaker's chief medical officer, Doctor Senessa, detected scattered life signs on Uphrades' surface amid the widespread destruction, and she proposed that the Daybreaker land on the planet to give them aid even though the atmosphere would disable the ship."}, {"tag": "p", "text": "Despite the attempts of Dal, the Daybreaker's captain, to bribe the Knight, the Jedi agreed with Senessa's proposal, and she took command of the vessel in order to aid the survivors. With the help of the Daybreaker's crew, the survivors endured on Uphrades' surface during the months that it took for the ionization of the planet's atmosphere to fade and allow rescue attempts."}, {"tag": "p", "text": "Upon learning of Angral's intent to target Tython, the Jedi and crew pursued the Oppressor to the Tython system and boarded the vessel while the Desolator was undergoing the lengthy charging process necessary to fire. With the Daybreaker's scans of the Oppressor, the Republic scientist Doctor Nasan Godera located a flaw in the Desolator's power systems that allowed the Knight and Carsen to disable the superweapon by deactivating the Oppressor's reactors. When the two Jedi confronted Angral aboard the Oppressor's bridge, the Sith Lord revealed that he had attacked Uphrades to lure his son's killer into a final confrontation—but their battle ended with Angral's death and the destruction of both the Oppressor and the Desolator, ensuring that no other planet would suffer the fate of Uphrades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The superweapon attack on Uphrades first appeared in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011, during the Jedi Knight-class mission \"Uphrades.\" Captain Dal presents a dialogue option in which players can convince Doctor Senessa to abandon the survivors, a choice that rewards the player with medical supplies, or choose to ignore his request and allow Senessa to take the Daybreaker down to Uphrades. This article assumes that the player chooses only the moral light-side options as a Republic Jedi Knight character, and it therefore assumes that Senessa takes command of the Daybreaker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}