{"url": "Devon_Four", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Atrivis sector planets", "Category:Galactic Republic planets", "Category:Relgim Run"], "nodes": [{"tag": "h1", "text": "Devon Four"}, {"tag": "p", "text": "Devon Four was a planet aligned with the Galactic Republic. Several years before the Clone Wars broke out, the government of the planet—members of a religious sect—refused to pay taxes. The planet was subsequently embargoed by the Republic, which even prevented medicine being delivered to the planet during an outbreak of plague. Smugglers organized by Sheeka Tull later broke the embargo."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Devon Four was the fourth planet in its eponymously named star system, located in the Atrivis sector of the Outer Rim Territories. It was part of the Relgim Run, bracketed by the Fest system on its coreward side and the Generis system on its rimward side."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the latter years of the Galactic Republic, Devon Four was inhabited by members of a religious sect, who governed the planet. When the government refused to pay taxes to the Republic, the planet was embargoed, preventing any starship traffic from reaching the planet. Shortly after this, an infectious plague broke out on the planet, threatening the life of the entire populace; unrelenting, the Republic blocked shipments of the appropriate antidote."}, {"tag": "p", "text": "One of the residents of Devon Four was a member of the Tull family. Her sister, Sheeka Tull, then living on Ord Cestus, heard of the plague, and arranged for smugglers to break the Republic embargo, saving the life of her sister and the entire populace. Tull herself was caught and sentenced to ten years of labor on a work planet, although this was substituted for aid given to Republic forces on Ord Cestus during the Clone Wars."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Devon Four was inhabited by members of a religious sect, including Sheeka Tull's sister, a Human originally from Atrivis 7. She left the planet, following the outbreak of the plague."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Devon Four was created by Steven Barnes for his novel The Cestus Deception, published in 2004 by Del Rey. The planet was later mentioned in The Complete Star Wars Encyclopedia and The Essential Atlas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}