{"url": "Dewback", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Carnivorous creatures", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Dewbacks", "Category:Domesticated creatures", "Category:Non-sentient species", "Category:Reptiles"], "nodes": [{"tag": "h1", "text": "Dewback"}, {"tag": "p", "text": "Dewbacks were thick-skinned reptiles native to the desert planet of Tatooine, where they were used as beasts of burden, as well as mounts for specialized sandtroopers known as Dewback troopers."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Rugged reptillian lizards native to the deserts of Tatooine, dewbacks were able to withstand the heat of the world's binary suns, as well as the dust that caused mechanical breakdowns in high-tech conveyances. They had thick hides of scaly green skin, with long, rounded heads and short tails. They plodded through the desert sands on four clawed feet, and while capable of brief bursts of speed, typically became lethargic at night and in colder climates. Female dewbacks laid fifty to eighty-five eggs each standard year. The species was so named because of their habit of licking the morning dew from their backs with their flicking tongues. They made strange, lowing noises, similar to that of a bantha. Due to their strength and hardiness, dewbacks were well suited for use as transportation."}, {"tag": "h2", "text": "Dewbacks in the galaxy"}, {"tag": "p", "text": "Dewbacks were utilized on Tatooine as plodding but reliable mounts, and were ridden by citizens of Mos Eisley along with other creatures such as rontos and jerbas. They were also used as beasts of burden to haul goods for merchants or moisture farmers, and pulled podracer parts to starting grids, as during the Boonta Eve Classic podrace held at the Mos Espa Grand Arena."}, {"tag": "p", "text": "Gozetta kept a dewback corpse among the big-game trophies at the Xirl hunting lodge, which was discovered by Milo and Lina Graf. During the Age of the Empire, dewbacks served stormtrooper patrols assigned to Tatooine's Imperial garrison. These Dewback troopers used jolts of electricity to control their mounts, using them to batter down property of enemies of the Empire. When prodded, a dewback would put on a short burst of speed. A contingent of sandtroopers dispatched on Tatooine to retrieve the Death Star plans stolen during the Battle of Scarif utilized native dewbacks as their mounts. Two sandtroopers rode dewbacks as part of Darth Vader's escort for his meeting with Jabba Desilijic Tiure at the Hutt's palace following the Battle of Yavin. Jabba's beastmaster, Malakili, kept a small water shiv made from dewback bone."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dewback first appeared in Star Wars: Episode IV A New Hope as an animatronic creation. The 1997 Special Edition introduced a new CGI version. Ultimate Star Wars correctly states their average height as six feet, although incorrectly translates the figure into nine meters, rather than two."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}