{"url": "Dex_Tiree", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Aces", "Category:Gold Squadron personnel", "Category:Humans", "Category:Males", "Category:Onderonians"], "nodes": [{"tag": "h1", "text": "Dex Tiree"}, {"tag": "p", "text": "Dex Tiree was a human male ace pilot from the planet Onderon who flew for the Rebel Alliance during the Battle of Yavin. During the battle, Tiree flew a BTL-A4 Y-wing assault starfighter/bomber in Gold Squadron as Gold Two and the wingman of Jon Vander. Tiree's fighter was destroyed after being hit by Darth Vader's TIE Advanced x1."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dex Tiree was born on Onderon, sometime before 19 BBY. He visited Alderaan with his parents as a child, and in 12 BBY, his parents had a daughter. Some time later, prior to 0 BBY, Tiree joined the Rebellion, and flew a Y-Wing Starfighter as a part of Gold Squadron. He also found and took possession of an R5 series astromech droid that he named \"Sparks\", both for a saying he remembered his mother using, and for a fire the droid started on a moon of the planet Utapau."}, {"tag": "p", "text": "In 0 BBY, Tiree participated in the Alliance's counterattack on the Death Star, flying under the callsign Gold Two. Alongside Davish Krail, Tiree provided cover to Captain Jon \"Dutch\" Vander when Gold Squadron began the first bombing run on the Death Star's thermal exhaust port, located at the end of the meridian trench."}, {"tag": "p", "text": "When Vander ordered his squadron to activate their targeting computers, Tiree confirmed that he'd gotten a lock on the exhaust port. Shortly afterwards, the turbolasers stopped firing at them, much to Tiree's confusion. Darth Vader soon caught up to Gold Squadron in his TIE Advanced x1, and both Tiree and Sparks were killed when their starfighters were shot down from behind by Vader."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dex Tiree first appeared in Star Wars: Episode IV A New Hope. He was played by Jeremy Sinden, but was overdubbed by Harry Shearer. He was given the full name of Dex Tiree in the 2015 reference book Ultimate Star Wars."}, {"tag": "p", "text": "Tiree's helmet prop — or one of a matching design — was later worn by an unnamed pilot (named Habeer Zignean in the Star Wars Legends continuity) in The Empire Strikes Back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}