{"url": "Dexter_Jettster/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Bartenders", "Category:Besalisks", "Category:Business owners and executives", "Category:Coruscanti", "Category:Galactic Republic individuals", "Category:Males", "Category:Miners"], "nodes": [{"tag": "h1", "text": "Dexter Jettster"}, {"tag": "p", "text": "Dexter \"Dex\" Jettster was a male Besalisk cook with a diverse past hailing from the Deep Core planet of Ojom. He owned and ran Dex's Donuts and later Dex's Diner. Shortly before the outbreak of the Clone Wars, Jettster was running the diner in CoCo Town. Due to his wide experience, he was known as a reliable informant. Jedi Obi-Wan Kenobi and Quinlan Vos often turned to him when they needed some information."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Little is known of Dex's life before his first meeting with Obi-Wan Kenobi. What is known is that after leaving his homeworld of Ojom, Dex had a colorful life and varied careers, including prospecting, smuggling, running guns, and even a stint as a professional fighter."}, {"tag": "p", "text": "Dex first met Obi-Wan when he was a Padawan, after dropping bottles in an alley. Dex was running a bar on the remote Outer Rim mining world of Ord Sigatt, and he used the bar as a cover for running guns. Shortly thereafter, Dex opened a weapon shop on the Outland Transit Station, where he supplied mercenaries and bounty hunters. With the attack and near destruction of Outland Transit Station, he decided he'd had enough. He sold the last stock to Jango Fett[source?] and used the proceeds to fund his trip to Coruscant.[source?] For many years it had been his dream to open a restaurant in the best part of the city-planet."}, {"tag": "p", "text": "At one point, Dex had been a prospector for a mine on the planet of Subterrel, where he saw a Kaminoan saberdart used by Polis Massans."}, {"tag": "p", "text": "Jettster encountered Obi-Wan Kenobi again when the unidentifiable vercupti of sgazza boleruueé served at the Jedi Temple main house drove the young Jedi to try the diner. To Jettster's delight, Kenobi visited the café again in 27 BBY, looking for information on his new enemy, Granta Omega. Although Jettster knew nothing about Omega, he offered Kenobi his hospitality and beverages, as well as a research on this person. Kenobi took the opportunity to introduce his new Padawan Anakin Skywalker to Jettster."}, {"tag": "p", "text": "Prior to the outbreak of the Clone Wars, Dex identified a Kamino saberdart, similar of those used by the Polis Massans, as a favor for Kenobi. This led the Jedi Knight to discover that Kamino had been deleted from the Jedi Archives and after that went to the planet itself, where he found out about the Grand Army of the Republic Master Sifo-Dyas had ordered from the Kaminoan cloners. The Clone Wars began soon afterwards."}, {"tag": "p", "text": "Despite the rapidly spreading galactic conflict, the Besalisk risked traveling for ingredients for his diner to places such as Dractu for cave slugs as a gift for Kenobi."}, {"tag": "p", "text": "Two months into the Clone Wars, Dexter heard crucial information from a female that owed him a life debt that General Grievous was going to attack Bothawui. Worried, he gave this information to Obi-Wan, resulting in Anakin Skywalker leaving to stop Grievous."}, {"tag": "p", "text": "Near the war's end, Jedi Master Quinlan Vos sought him out for information on an Anzati assassin, Sajé Tasha, and asked the Besalisk to put out the word that his fiancée, Khaleen Hentz, wanted to hire her for a job. This led to Quinlan Vos mistakenly identifying Separatist former Jedi Sora Bulq as a Sith Lord."}, {"tag": "p", "text": "During the early Great Jedi Purge, Dex was sought out by former Jedi Ferus Olin. He was looking for Jedi who survived the Purge. Ferus found that Dex was gone, and his diner was destroyed. Ferus found Dex in the sublevels of Coruscant. Dex had become a member of the Erased, a group of people who had erased all records of their existence. Dex told Ferus that he had talked to a Jedi named Fy-Tor-Ana, and she had told him to find Solace if he needed help. Ferus and the Erased went to find Solace, but Dex stayed behind to help any possible new members of the Erased that sought him out."}, {"tag": "p", "text": "Later, after the attack on Solace's base, the Erased came back to Dex for his help in the rescue of Ferus. He outfitted them with an ARC-170 starfighter and a Jedi starfighter to help them get to Dontamo, the planet on which Ferus was being held."}, {"tag": "p", "text": "He was shot during the attack on his hideout, but he was later noted to have survived and recovering well."}, {"tag": "p", "text": "Later, he was seen saying goodbye to Keets Freely and Curran Caladian when they decided to go down to the deeper levels of Coruscant for safety."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dexter Jettster's voice was performed by Ronald Falk in Attack of the Clones."}, {"tag": "p", "text": "Early drafts had him being the husband of Hermione Bagwa, his waitress."}, {"tag": "p", "text": "He was one of a few characters in the films to swear, the others being Owen Lars and Luke Skywalker in Star Wars Episode IV: A New Hope, and Han Solo in Star Wars Episode V: The Empire Strikes Back. Specifically, Jettster uses the word \"damn\" when describing the Kaminoans' skills in cloning."}, {"tag": "p", "text": "In LEGO Star Wars: The Video Game, Dexter Jettster appears as the sole bartender of his diner, this being the level hub of the game. He is an unplayable character."}, {"tag": "p", "text": "In LEGO Star Wars: The Complete Saga, Dexter Jettster is a playable character with no abilities and no weapons. This lack of armament makes him little more than a novelty."}, {"tag": "p", "text": "Jettster was named after George Lucas' son Jett Lucas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}