{"url": "Dharus", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Mercenaries", "Category:Privateers", "Category:Rebel privateers"], "nodes": [{"tag": "h1", "text": "Dharus"}, {"tag": "p", "text": "Dharus was a privateer associated with the Alliance to Restore the Republic. A member of a little-known species, he was provided with information about Imperial activity and prize starships in the hyperlane called Leisure Corridor, and in exchange he shared his profits with the Alliance and took prisoners for them in a mutually profitable agreement—even if the Alliance observers assigned to Dharus were aghast at the pirate's activities. Dharus' raids were embarrassing to the Galactic Empire, which offered a high bounty for him. A bounty hunter managed to capture Dharus but, as he was a valuable partner of the Alliance, a Rebel team rescued him. Dharus then returned to his pirate activities, increasing his area of influence as well as the fleet under his command."}, {"tag": "p", "text": "He was also known to post in illegal publications Cynabar's Droid Datalog and Gundark's Gear Datalog about his favorite technologies. During the Caamas Document Crisis, Dharus, by then a retired sentient, returned to active duty as a mercenary leader and strategist for the Nhoras, charging a hefty sum for his services."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebel privateer"}, {"tag": "p", "text": "Dharus was a male member of a little-known sentient species. During the Galactic Civil War, he was active as a pirate. Before 0 BBY, he became a privateer for the Alliance to Restore the Republic at a point where the Alliance was ready to ally with independent pirates in a mutually beneficial agreement. Dharus was given a letter of marque specifying the terms of the arrangement, and following Alliance protocol, he was assigned an Alliance observer to be stationed on board his starship serving as his contact. At the same time, the observer ensured that Dharus would not break the settlement. Following the terms of the letter, Dharus was not a member of the Alliance but an independent partner, and as such the observer could not have given orders to Dharus or to any member of his crew."}, {"tag": "p", "text": "Dharus and his crew treated their assigned observer poorly, causing the observer to ask Alliance High Command for a transfer to a different post. A similar situation happened with the replacement observer, and with the third observer assigned to Dharus. Noticing the situation, the Alliance repeatedly investigated Dharus' activities, but they found no reason to revoke his letter of marque. Dharus' fourth observer, Moris Malvarra, also asked for a transfer before one-third of his assigned tour time had passed. Alliance Commander Ral'Rai Muvunc rejected Malvarra's request, explaining that not enough reasons had been provided; Muvunc also assured Malvarra that he would not be considered responsible for Dharus' so-called atrocious actions."}, {"tag": "p", "text": "Dharus performed his raids in Imperial space, particularly in a trade and tourism hyperlane known as the Leisure Corridor, which went from Coruscant in the Core Worlds to Ebiwaan, in the Inner Rim. The area had a strong Imperial presence, including heavy patrol ships. Dharus depended on intelligence provided by the Alliance to choose his targets and avoid traps. In exchange for such a valuable asset, Dharus agreed not only to attack Alliance-approved targets, but also to take prisoners and hostages who were important for the Alliance. Dharus was also known to capture, or to pretend to capture, certain Imperial citizens who wanted to desert. As a Rebel privateer, Dharus shared the profits of his raids with the Alliance, following the terms of the letter of marque."}, {"tag": "h3", "text": "Capture and release"}, {"tag": "p", "text": "Dharus became a well-known privateer, infamous in certain circles. The Empire offered a bounty of 40,000 for his head, accusing him of having performed several raids on their ships. The Alliance also used Dharus for propaganda purposes, embarrassing the Empire with his activities. Circa 0 BBY, the independent bounty hunter Zardra went after Dharus' bounty. Zardra was on board the Culroon Minstrel, a Jesoni-class liner that could easily be a \"prize\" for Dharus. The Alliance failed to detect Zardra because she was not an Imperial agent and looked like an Imperial noble. Dharus and his crew fell into Zardra's trap and boarded the Minstrel, and the bounty hunter defeated the crew and captured Dharus. She then took her prisoner to the Empire in exchange for the reward. The fight between Zardra and Dharus gave the Minstrel some fame, and it became a cruiser of choice for thrill-seeking dilettantes."}, {"tag": "p", "text": "As Dharus was an important asset to the Alliance, a Rebel team conducted a secret operation to rescue the privateer. The Empire was unprepared for their movement, and Dharus was freed six months after his capture, before his own trial was able to even be held. Embarrassed, the Empire increased the bounty for Dharus to 90,000."}, {"tag": "p", "text": "Dharus began operating in the Parmel, Sarin, and Portmoak sectors, without forfeiting his initial mobile headquarters in the Leisure Corridor. Initially, the privateer in Parmel and Sarin was believed not to be Dharus, but a copycat."}, {"tag": "h3", "text": "Dharus' Buccaneers"}, {"tag": "p", "text": "At that point, Dharus organized a group of ninety-six sentients under his command, officially named Dharus' Buccaneers. He led a three-ship fleet formed by two heavily-modified SoroSuub Corsair-class cruisers, the Red Lancer and the Blue Queen; and a CEC DP20 frigate, the Dark Revenge, with several illegal customizations. The Red Lancer and the Blue Queen had increased weaponry, but Dharus was forced to sacrifice cargo space, speed, crew comfort, and security measures in the navigation computer—although he was trying to design custom hyperdrive sleds to solve this last problem."}, {"tag": "p", "text": "Each of the cruisers was operated by a crew of two plus one gunner; the frigate used forty-five crewmen plus forty-six gunners. In a short time, Dharus used his command skills to create a loyal, multi-ship crew that operated as a team. The cruisers generally waited at a hyperspace exit point and threatened any target ship appearing there. If the ship jettisoned its cargo, the privateers picked it up; otherwise, the cruiser used ion cannons to disable the ship, and then the crew of the frigate would break the airlock and board it. Although relentless, Dharus was not unnecessarily aggressive and had a low violence rate for a pirate."}, {"tag": "p", "text": "Dharus was known to pilot his flagship against swarms of Imperial TIE fighters. He also defeated an Imperial Star Galleon-class frigate before 2 ABY. At that point, his cruisers were seen in the Quence sector, near Elshandruu Pica. With this new array of activity, the Empire added to the charges against Dharus and, besides piracy and theft, accused him of treason, conspiracy, escape and flight, aggression, and also of illegal operation of starfighters."}, {"tag": "h3", "text": "Further activities"}, {"tag": "p", "text": "Being an active criminal, Dharus posted in Cynabar's Droid Datalog about his predilection for Medtech FX medical droids. A person named Cormun identified Dharus and replied to his post by specifying that Dharus was a pirate, the sectors where he was active, and the venture smugglers could have by selling him expensive parts for his FX droids."}, {"tag": "p", "text": "At a later date, Cormun' posted about the Cybot Galactica CLL-8 binary load lifter droid on the same datalog, expressing his predilection for the combat modification package for that droid so that it could fight customs security forces. After reading that post at Elshandruu Pica, Dharus replied that a CLL-8 required high-damage weapons to stop the armored Imperial customs troops, but at the same time the droid was unintelligent enough to damage the hull of the ship while firing, killing everyone in the area. The pirate, thus, believed that arming such a droid was a ridiculous idea."}, {"tag": "p", "text": "At some point before 3 ABY, while at Elshandruu Pica, Dharus won the Short Hauler Nova Whisper from a Corellian commodities shipper by the name of Tev Driscull. Dharus then improved the weaponry of the ship and added sensor stealth devices. A few months later, the Nova Whisper was captured by agents of the Corellian Security Force."}, {"tag": "p", "text": "After this event, Dharus eventually retired. In 19 ABY, however, he was asked to return by the species known as the Nhoras. The Nhora had had a centuries-lasting conflict with another species, the Clatears; as of then, the New Republic galactic government was too busy with other priorities to interfere, so the Nhoras and the Clatears had decided to fight again. As the Nhoras were less militaristic than the Clatears at that stage, they decided to hire mercenaries and offered Dharus the high sum of 30,000 per day to lead their army. Dharus accepted and led the Dhashaan Shield mercenary group protecting the Nhora systems; he also took charge of the Nhoras' logistics and strategy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dharus was a member of an anthropomorphic species with no visible ears and a flat nose. He also had a ridge on his brow. He had bright red eyes, orange-brown skin, and long brown hair that he tied in a twin braid behind and in front of his neck; he called this a \"ceremonial braid.\" Dharus favored bright tunics of several different colors, although his pants were always black. He also wore short utility boots."}, {"tag": "p", "text": "A tall sentient in excellent physical shape, Dharus was unruly, clamorous, jolly and a bon-vivant. He had never liked the Empire, and his opinion of them grew worse after his capture. He decided to sell his services to the Alliance so that he then could not only raid Imperial ships but also mock his victims."}, {"tag": "p", "text": "Known as a good fighter either with his own fists or blasters, Dharus was never seen without his weapons of choice: a hold-out blaster, a vibroblade, and a Caliban Model X heavy blaster pistol. He also carried comlinks, datapads, and medpacs. A great fan of the Borallis Metalworking & Materials PCW-880 fusioncutter, he enjoyed using this tool to cut the airlocks of ships he wanted to board. He also liked the FX-series of medical droids, particularly the FX-7 medical assistant droid, even though it had been superseded by more recent and efficient models."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dharus was first mentioned in Galaxy Guide 9: Fragments from the Rim (1993), a supplement to Star Wars: The Roleplaying Game, published by West End Games and written by Simon Smith and Eric Trautmann. The book included an image of Dharus drawn by Mike Vilardi. In 1997, Dharus was mentioned in four more role-playing books by West End Games, and also in Specter of the Past, a novel written by Timothy Zahn. Scum and Villainy, a 2008 sourcebook for the Saga Edition of the Roleplaying Game, lists Dharus among the example characters of the \"master privateer\" class."}, {"tag": "p", "text": "Dharus' species is specifically defined as \"unknown\" in both Galaxy Guide 9: Fragments from the Rim and Pirates & Privateers. Following his RPG stats, Dharus is a great pilot specializing in capital ships. He has a commanding presence over his crew, and can intimidate people not under his command. He is also a good negotiator and gambler, and is knowledgeable about star systems and alien species. Although Dharus tried to design hyperdrive sleds for his crew, his abilities in technology are low."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}