{"url": "Dhidal_Nyz", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bounty hunters", "Category:Males", "Category:Members of Daala's special-missions force", "Category:Quarren"], "nodes": [{"tag": "h1", "text": "Dhidal Nyz"}, {"tag": "p", "text": "Dhidal Nyz was a male Quarren bounty hunter and inventor who specialized in creating imprisonment-related technologies. In 43 ABY, he was hired by Galactic Alliance Security to assist in the arrest of Jedi Grand Master Luke Skywalker. He was later hired by Chief of State Natasi Daala and partnered with a female Human bounty hunter and the cyborg mercenary Vrannin Vaxx to capture Jedi Knight Valin Horn, who had gone on a destructive rampage after suffering a psychotic breakdown. They failed to capture Horn, however, due to the intervention of Skywalker. Nyz was later hired by the Galactic Federation of Free Alliances and partnered with bounty hunter Zilaash Kuh to capture the rogue Jedi Seff Hellin, who suffered from the same disease as Horn. However, Nyz and Kuh lost the bounty to Darkmeld, an organization that Jedi Knight Jaina Solo formed to counter Daala's anti-Jedi policies."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dhidal Nyz was a male Quarren bounty hunter and inventor, best known for creating various capture- and imprisonment-related weaponry. Nyz had made much of his fortune off of his bounties, most of which were high-value fugitives from patents or military contracts. In 43.5 ABY, he was hired by Galactic Alliance Security, alongside Human bounty hunter Zilaash Kuh and Skakoan hunter Hrym Mawarr, to assist in the arrest of Jedi Grand Master Luke Skywalker for failing to prevent Jedi Knight Jacen Solo's fall to the dark side of the Force. The group was led by Security Captain Savar. During the arrest, ex-smuggler Han Solo insulted Savar, who stiffened. Nyz assumed that Skywalker was using the Force on Savar, and exclaimed that Skywalker was resisting. This caused one of Savar's troopers, Bessen, to lose his nerve and open fire on the Grand Master. His shot missed, and the situation was quickly brought back under control. Savar then took Skywalker to the Galactic Alliance Security blockhouse, though the Grand Master would be released soon thereafter."}, {"tag": "p", "text": "Nyz was later among the several bounty hunters hired by Chief of State Natasi Daala as part of her special-missions force to capture Jedi Knight Valin Horn, who had gone on a destructive rampage through the galactic capital of Coruscant after a psychotic breakdown. The psychosis caused the affected being to believe that everyone he knew had been replaced by impostors, except for others who suffered from the disease. To capture Horn, Nyz worked with cyborg mercenary Vrannin Vaxx and a blond female Human bounty hunter. During the hunt, another being piloted Nyz's cargo hauler, and Nyz and his comrades rode in the ship's bed. Meanwhile, as Horn was fleeing from Jedi pursuers, the Knight ejected from the X-wing he had been flying and landed in the bed of the hauler. Jedi Knight Jaina Solo, who was following Horn in a speeder with Master Kyle Katarn, was not far behind him. Horn saw her coming and leaped off the edge of the hauler as Solo landed in the cargo bed. Nyz fired his electronic-pulse net gun at Solo, who was caught by the net and knocked backwards off of the hauler, paralyzed by the net's shocks. Another speeder suddenly dove past the hauler, causing its pilot to veer to starboard. The hauler tipped over, and Nyz fell off of the vehicle, though he would survive the fall. Luke Skywalker captured Horn soon thereafter, ending the hunt."}, {"tag": "p", "text": "Nyz was later hired by the Galactic Federation of Free Alliances and partnered with the female Human bounty hunter Zilaash Kuh in an attempt to capture the rogue Jedi Seff Hellin, who was suffering from the same disease as Horn. Since he believed that Horn was the only being he knew that had not been replaced with an impostor, Hellin attempted to free him from the Armand Isard Correctional Facility, a prison on Coruscant in which a carbonite-encased Horn was being held. Hellin failed to free Horn due to the intervention of Darkmeld, an organization that Jaina Solo had formed to counter Daala's anti-Jedi policies, and Hellin's escape from the prison was cut off by Kuh and Nyz. Kuh piloted Nyz's hauler as Nyz shot Hellin, capturing him in an electric net. However, they were quickly intercepted by more Darkmeld members; Solo captured Hellin and escaped with him in a speeder with Horn's mother, Mirax Terrik Horn. In the ensuing chase, Nyz's hauler was ravaged by the Imperial Remnant Head of State and Darkmeld affiliate Jagged Fel, who was disguised as a Mandalorian, and Kuh and Nyz were forced to forfeit the bounty."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a bounty hunter, Dhidal Nyz was rather blunt and direct in his speech and dealings. To the dismay of his fellow hunters, he was also often hasty in his actions. However, he had a keen edge for hunting down bounties, and excelled when it came to capture and imprisonment technologies. He was very talented in the uses of such weaponry, as exhibited when he managed to ensnare a Jedi twice with his electric-pulse net."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When hunting, Nyz frequently used the weapons that he invented himself. During the hunt for Valin Horn and Seff Hellin's later raid on the prison, Nyz used a very large gun, which was capable of deploying a net that carried an electrical charge. The net would wrap itself around its quarry, sending paralyzing electrical pulses through the victim every few seconds. This was particularly useful in capturing Force-sensitive individuals, as the electrical pulses would also interfere with the being's control over the Force."}, {"tag": "p", "text": "Nyz owned a flatbed cargo hauler, which he used in conjunction with other bounty hunters in both the hunt for Horn and the raid on the Armand Isard Correctional Facility."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Nyz was created by Star Wars author Aaron Allston for his first novel in the nine-part Fate of the Jedi series, Fate of the Jedi: Outcast, released on March 24, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}