{"url": "Dia", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Humans", "Category:Tarisians", "Category:Waiters"], "nodes": [{"tag": "h1", "text": "Dia"}, {"tag": "p", "text": "Dia was a Human female from Taris who served as a waitress at Javyar's Cantina during the Jedi Civil War. During her time working there, a man named Holdan began making unwanted advances on her. In retaliation, she struck him with her vibroblade, injuring and humiliating him. Holdan responded by putting a bounty on Dia's head, and she was forced to hide in an Upper City apartment. Eventually, she met Revan, who agreed to get the bounty removed. He was successful, and she was able to come out of hiding."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3956 BBY, Dia was working as a waitress at Javyar's Cantina in the Lower City. One day, she caught the attention of a man named Holdan, a henchman for the local crime syndicate, the Exchange. When the drunk man attempted to force himself upon her, Dia defended herself with a vibroblade, scarring him. The incident infuriated Holdan as it humiliated him in front of his friends. His wrath materialized itself in a bounty on Dia's head worth 300 credits, and the woman was reduced to hiding in an Upper City apartment amongst illegal aliens. Because of Holdan's connections to Davik Kang, crime lord of the Exchange, the local authorities turned a blind eye to her plight. Too afraid for her life to leave the apartment, Dia soon lost touch with the political affairs of the outside world."}, {"tag": "p", "text": "By chance, Dia met the former Sith Lord Revan, who's memories had been replaced with those of a Galactic Republic soldier. Revan had been hiding out in the apartment next-door, attempting to stay out of sight of the Sith Empire, who controlled the planet. Meeting him turned out to be a twist of fate for her. The former Sith Lord was able to convince Holdan to withdraw the bounty he had placed on Dia's head. When Revan returned to Dia to deliver the good news, the grateful waitress offered her family heirloom, an energy projector for a vibroblade, as a reward but Revan refused, telling her that to help her was thanks enough. She was able to return to her normal life just before the Darth Malak ordered the bombardment of the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When Dia received a bounty on her head, she thought that the most sensible course was to hide away at her apartment indefinitely, refusing to risk even leaving the complex. Though this was motivated by fear, when attacked or faced with unavoidable danger, she believed in—and was capable of—making a brave stand to prove she was not as defenseless as she seemed. She could be defiant and did not shy away from criticizing the misdeeds of others, such as burglary or harassment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dia appears as a non-player character in the video game Star Wars: Knights of the Old Republic. She is found at the apartment right next-door that of the player on Taris."}, {"tag": "p", "text": "There are three ways to convince Holdan to drop the bounty and receive light side points: the player can pay him two hundred credits to cancel the bounty, persuade him to cancel without paying, or, if Bastila Shan is in the party, she will use Force persuasion to have him withdraw the bounty should the player fail to convince Holdan him/herself."}, {"tag": "p", "text": "If the player has Dia's bounty removed, she will offer the player an energy projector upgrade for a vibroblade, telling the player it is a family heirloom. The player can either accept it or either refuse and obtain even more light side points."}, {"tag": "p", "text": "Alternatively in the dark side option, the player can kill Dia and talk to Holdan to claim the bounty. If Carth Onasi is in the party, he objects to the act in which the player can either rethink his/her course of action or proceed with his/her attack anyways. In spite of Carth's disapproval, he will still aid the player in killing Dia due to the particular gameplay mechanics. When the player collects the bounty from Zax, he/she can attempt to persuade the Hutt to raise the reward from 300 to 400 credits, but if this fails and the player insists on pressuring Zax, he/she will be dismissed empty-headed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}