{"url": "Diamond-class_cruiser/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Commerce Guild", "Category:Confederacy of Independent Systems starship classes", "Category:Cruiser classes"], "nodes": [{"tag": "h1", "text": "Diamond-class cruiser"}, {"tag": "p", "text": "The Diamond-class cruiser, also known as Diamond-class courier ship and the Commerce Guild cruiser, was a cruiser used by the Commerce Guild prior to and during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Manufactured by the Commerce Guild, this cruiser served as a rapid deployment carrier for OG-9 homing spider droids and DSD1 dwarf spider droids. Capable of carrying thousands of spider walkers into combat, the Diamond-class cruiser was a valuable asset for the Commerce Guild. The cruiser was armed only with a number of laser cannons, though upon leaving the transport, the cruiser's droids could provide cover fire during takeoff."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "An arc-shaped vessel powered by three sublight drives, the Diamond-class cruiser became part of the Separatist starfleet in the lead-up to the Clone Wars. Over forty Commerce Guild transports were present at the outbreak of the Clone Wars on Geonosis, having transported war machines and Guild officials to the official forming of the Confederacy of Independent Systems."}, {"tag": "p", "text": "When the Grand Army of the Republic invaded the Separatist stronghold, Commerce Guild pilots immediately prepared their vessels for lift off, gathering up as much of their cargo as they could. Of the forty-one transports docked on Geonosis, thirty-six escaped the battle to regroup and rejoin the war."}, {"tag": "p", "text": "Sev'rance Tann would use mainly Diamond-class ships as transports in her successful campaign against the Republic to acquire the Decimator and seize Sarapin."}, {"tag": "p", "text": "Commerce Guild President Shu Mai used a modified Diamond-class cruiser as her personal flagship, using it to travel to and from Separatist strongholds on Castell, Felucia, Utapau, and Mustafar. Several Diamond-class vessels also participated in the First Battle of Tythe.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Commerce Guild starships are briefly seen during the chaos of the Battle of Geonosis, docked behind exploding IG-227 Hailfire-class droid tanks as the conflict rages. These ships are also seen as static objects in Star Wars: Galactic Battlegrounds: Clone Campaigns."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}