{"url": "Diamal", "categories": ["Category:Legends articles", "Category:Core Worlds species", "Category:Diamala"], "nodes": [{"tag": "h1", "text": "Diamal"}, {"tag": "p", "text": "The Diamala (singular Diamal) were a species from the planet Diamal, in the Core Worlds, who, along with their rivals the Ishori, became prominent during the crises over the Caamas Document and the apparent return of Grand Admiral Thrawn. Diamala were recognizable by their leathery skin, white manes, and fan-shaped ears, which they could move independently to gesture with. The Diamala temperament was generally calm and unemotional, with a strong sense of personal pride. They had extensive financial and business holdings, which they attributed to hard work rather than luck."}, {"tag": "p", "text": "In 19 ABY, the Diamala objected when the Ishori refused to allow armed Diamalan vessels to escort Diamalan freighters into Ishori ports. The Iphigini offered to help resolve this dispute. Han Solo, Chewbacca, and Luke Skywalker, who acted as mediators during initial negotiations, were unable to help the two species reach an agreement. The rift between the two species only worsened when they took opposite sides on the dispute over the Caamas Document. While the Ishori were among the loudest voices demanding that the Bothans pay ruinious reparations for complicity in the destruction of Caamas, the Diamala sent Nebula- and Endurance-class ships to defend Bothawui. The Diamalan fleet also included twelve Marauder-class corvettes, a group of which were involved in operations against the Imperial Remnant during the crisis (though they were ostensibly purchased by their Commerce Ministry as freighter escorts)."}, {"tag": "p", "text": "Their representative to the New Republic Senate in 19 ABY, Porolo Miatamia, was accused by politicians on the other side of being as manipulative as the Bothans themselves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}