{"url": "Dianoga/Legends", "categories": ["Category:Legends articles", "Category:Cephalopods", "Category:Creatures of unspecified diet", "Category:Creatures of Coruscant", "Category:Creatures of Vodran", "Category:Dianoga", "Category:Food creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Dianoga"}, {"tag": "p", "text": "Dianoga were large cephalopods, capable of growing up to ten meters in length, though most specimens grew to approximately five or six meters. They had a single eyestalk protruding from their mollusk-like bodies, and seven suckered tentacles surrounding a fanged maw containing a sharp serrated probe."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Dianoga originated on the planet Vodran—discovered by the Hutts prior to the formation of the Galactic Republic—where the creatures evolved a form of natural camouflage to disguise themselves and avoid the planet's large predators. Their bodies would become transparent when unfed, and, conversely, were known to change to reflect the color of the food they had eaten. This was achieved by diverting small portions of digested food into a series of ducts underneath the creature's skin, which would appear to affect the color of the dianoga's flesh."}, {"tag": "p", "text": "Over many millennia, dianoga migrated from Vodran by stowing away aboard garbage ships in their microscopic larval forms, and could be commonly found in trash compactors, garbage pits, and sewers across the galaxy, living off any present organic matter. They were primarily scavengers, and only posed a threat to living creatures when starving or threatened. Because of their penchant for living in and feeding on organic waste, dianoga were sometimes referred to as garbage squids, sewage squids, or trash monsters."}, {"tag": "p", "text": "Dianoga would often prove a nuisance by nesting in bodies of water, sewage systems, and whatever other large concentrations of dirty, appalling liquid that they could locate. Smaller dianoga were even known to crawl out of toilets. Despite this, they could prove useful, since they served to rid waste of biological material, leaving behind salvageable minerals and metals. Only when a dianoga grew too large was it usually considered a threat, especially in urban areas such as Galactic City on Coruscant. Indeed, in 22 BBY, Coruscant's Desrini District experienced a dianoga infestation, following an incident with a misfiring garbage launcher. Up to twenty-five residents were reported to have been attacked by the scavengers, and it was believed the creatures would quickly spread to neighboring districts. The presence of a single dianoga was often cause for alarm, since the creatures were self-fertilizing hermaphrodites, and could quickly multiply to pose a larger problem."}, {"tag": "p", "text": "One dianoga was known to have boarded the first Death Star, and made its home in one of the space station's garbage compactors. When Luke Skywalker, Han Solo, Chewbacca, and Leia Organa, during the rescue of Leia, were forced into the trash compactor, the dianoga attacked Skywalker. It pulled the young farmboy under the murky, polluted water, but was scared away when the compactor walls activated. The dianoga itself had managed to burrow into the wall, and so was relatively safe inside the compactor; that is, until the Death Star was destroyed."}, {"tag": "p", "text": "Another infestation of dianoga was experienced by Dash Rendar in the sewers beneath Prince Xizor's palace. Upon exiting the sewers, Dash was forced to fight a full grown dianoga, which was at least 10 meters long."}, {"tag": "p", "text": "Dianoga were also found on Anoat, where several attacked Rebel mercenary Kyle Katarn as he worked through the sewers in an effort to locate Moff Rebus, in his campaign against the Imperial Dark Trooper Project."}, {"tag": "p", "text": "Dianoga could be found in the sewers of Coruscant and many other locations across the galaxy. Their flesh was used in the making of dianoga pie, and their spleens could be processed to make Dianogan tea, a beverage notably favored by Admiral Pors Tonith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Revised Fourth Draft of Star Wars: Episode IV A New Hope mentions this creature as Dia Nogu."}, {"tag": "p", "text": "The original Kenner toy for the Death Star playset, designed by Tim Effler, included a Dianoga in its trash compactor. The soft rubber form resembled a green, mutant shark with an eye stalk protruding from its nose and its fins ending with tentacles."}, {"tag": "p", "text": "In the final film, director George Lucas was reportedly less than impressed with the delivered dianoga effect, having envisioned something bigger and more ominous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}