{"url": "Dice_Ibegon/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Alliance Army personnel", "Category:Criminals", "Category:Females", "Category:Force ghosts", "Category:Hunters", "Category:Lamproids"], "nodes": [{"tag": "h1", "text": "Dice Ibegon"}, {"tag": "p", "text": "Dice Ibegon was a female Lamproid, a member of the Alliance to Restore the Republic, and the lover of Lak Sivrak. A native of the harsh jungle world of Florn, Ibegon was Force-sensitive and was rumored to have the ability to shift through time. She became a recruiter for the Rebel Alliance during the Galactic Civil War, eventually winding up in Mos Eisley, Tatooine. There, she met a Shistavanen outlaw, Lak Sivrak, and the two fell immediately in love. Ibegon persuaded Sivrak to join the Alliance, and they both served for a year between 2 ABY and 3 ABY."}, {"tag": "p", "text": "Ibegon fought alongside Sivrak in the Battle of Hoth, though they were separated and she was fatally wounded by falling debris. She had time for several last words to Sivrak, telling him to continue his fight against the Empire, before she died. The Force would allow the two lovers to meet each other again as they relived past experiences, until Sivrak was himself killed at the Battle of Endor. Ibegon and Sivrak became Force ghosts, and they stayed on Endor for eternity."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebel"}, {"tag": "p", "text": "Dice Ibegon was a Florn Lamproid native to the planet Florn in Wild Space. Like all Florn Lamproids, Ibegon was a predator, with rows of sharp teeth and a poison stinger; these were put to good use on Florn, a wild jungle world inhabited by a plethora of vicious predators. Ibegon was a talented hunter, and the hunt held great significance for her. A large amount of Florn Lamproids were Force-sensitive; Ibegon was among these, and she was believed to have possessed a peculiar time-shifting attunement with the Force, which allowed her to relive past moments while retaining her memories of the first time the events took place. This ability could also be practiced after Ibegon's death. Florn Lamproids as a species were sympathetic to the Alliance to Restore the Republic, and Ibegon herself eventually joined the Rebellion, acting as a recruiter on remote Outer Rim worlds."}, {"tag": "h3", "text": "Love"}, {"tag": "p", "text": "She eventually found her way to the planet Tatooine in 0 BBY, where she occasionally frequented the Mos Eisley cantina, drinking blood mixes of questionable origin. She eventually met Lak Sivrak—known to most as only Sivrak—a secretive Shistavanen Wolfman fugitive who had slain a group of Imperial troops. Although he and Ibegon had markedly different body structures, Sivrak found the Lamproid extremely attractive, and Ibegon made efforts to seduce him, buying the Shistavanen a drink and inviting him to sit with her. The two found that they had much in common: they were both by nature predators, and they both hated the Empire. Ibegon eventually told Sivrak about the Force—how it bound all life together—and that she was a member of the Rebel Alliance. Sivrak told her of his own Rebel sympathies, though Ibegon knew that this was just a ruse to make him appear a more suitable romantic companion for the Lamproid. She did not care: her role was to recruit suitable candidates to the Rebellion, and Sivrak was certainly a suitable candidate. She also enjoyed his company immensely, and the two eventually shared a \"predator's kiss.\" At some point, the two left each other for a time, with a Pacithhip named Ketwol taking Sivrak's vacant seat."}, {"tag": "p", "text": "During Ibegon and Sivrak's time at the Mos Eisley cantina, an elderly man entered the building, accompanied by a younger man and a golden protocol droid. The younger man, named Luke Skywalker, got into an argument with an Aqualish thug named Ponda Baba; the older Human, Obi-Wan Kenobi, was eventually forced to interject and used his lightsaber to slice off one of the Aqualish's arm. The spectacle grabbed everyone's attention initially, though most went back to their conversations after several moments; Sivrak and Ibegon did not, as they knew that authorities would arrive to investigate, and Sivrak would be executed by the Empire if any stormtroopers recognized him."}, {"tag": "p", "text": "The two left the cantina forever, taking up residence together. They spent many nights discussing the Rebellion, and grew deeply in love. Although he had initially only claimed allegiance to the Rebels to make himself seem more attractive to Ibegon, Sivrak eventually did become loyal to the Rebellion's cause and for which it stood. In 2 ABY, Ibegon and Sivrak formally joined the Alliance, becoming soldiers on the front lines. They were stationed at the Rebels' secret base on Hoth in the Anoat sector, though a year after they became soldiers, the Empire learned of the Rebel presence on Hoth and attacked the ice world. Ibegon and Sivrak acted as infantry, fighting in the trenches against the Imperial ground troops and AT-ATs while Echo Base was evacuated and Rebel transports fled Hoth."}, {"tag": "p", "text": "The two lovers were eventually separated, and Ibegon was grievously wounded when a large piece of shrapnel deeply punctured her thorax, causing Ibegon to lose a large amount of her purple blood. Sivrak located her, though by that point she had bled too much to have any chance of survival. Ibegon told Sivrak to continue his fight against the Empire, and to believe in the Force, before finally passing away. Sivrak had heard stories of how the Empire used body parts of Rebel corpses for research purposes, and, not wanting his lover's memory to be insulted, he used a powerful blaster pistol to disintegrate her snakelike body. Ibegon eventually became a Force ghost."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Sivrak did continue to serve with the Rebels, participating in many battles up until the Battle of Endor in 4 ABY. Sivrak never forgot his deceased lover, and, a year after her death, he still mourned her and found life without her to be pointless and mundane. While piloting an X-wing starfighter against Imperial forces at Endor, Sivrak relived the time he first met Ibegon at Mos Eisley years before. However, he retained his previous recollection of events, and knew what would happen to him and others around him. Ibegon and Sivrak spoke with each other: much of their dialog was the same as had originally occurred, though some of it was different. They each shared their knowledge of what was to transpire to the cantina's other patrons, though Sivrak eventually became extremely confused, and questioned Ibegon on what was actually happening—he was unsure if it was somehow connected to the Force, or if it was merely a hallucination. The reliving of the memory was cut short, as Sivrak's consciousness returned to what was transpiring in real-time at Endor, where he was being pursued by a group of TIE fighters."}, {"tag": "p", "text": "Several minutes later, Sivrak returned to the time Ibegon was killed on Hoth, though events there transpired mostly as they had done originally. The next memory he relived was not one he had ever actually lived through; he and Ibegon were in Chalmun's cantina, a year after her death, speaking about the demise of the Hutt\nlord Jabba Desilijic Tiure. This baffled Sivrak, though he was beginning to understand that the Force was allowing him and Ibegon to wade through time. The memory merged itself with the first memory that had been relived, when Ibegon and Sivrak had first met. Sivrak's consciousness eventually returned to Endor, where his badly-damaged ship crashed into the moon's surface, and he was killed. Ibegon joined her lover as a Force ghost, watching over the Rebels and their Ewok allies as they celebrated their victory over the Empire. The two stayed on Endor as Force ghosts for all eternity."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dice Ibegon believed in the Force, that it would guide her path and that it bound all things. Because of her time-shifting connection to the Force, Ibegon often knew what would happen before it did, giving her an aura of mystery. She was very tough and resilient, though; she had to be in order to survive on her harsh homeworld. Much of her life revolved around hunting, and she saw herself and Sivrak as hunters preying on a corrupt and unhealthy Empire. Ibegon hated that the Empire was mired with corruption, and saw it as her duty to be part of the movement to stop it."}, {"tag": "p", "text": "Ibegon had a mild proficiency for the Force, and many believed she had the ability to travel through time in some form. She was able to haunt the dreams of Lak Sivrak even after her death, taking him to important moments in their lives. After Sivrak's death, the two lovers stayed on Endor as Force ghosts for eternity."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ibegon first appeared was as a background character in Star Wars: Episode IV A New Hope, where she sat next to Lak Sivrak in the cantina scene. After the Original Trilogy Special Edition was released in 1997, Sivrak's on-screen role was replaced by Ketwol, though the wolfman can still be seen briefly in the background. Ibegon's puppet was nicknamed \"Snake Head\" by the production crew of A New Hope because of its appearance, and was eventually given the proper name of \"Nake.\" This name was disregarded by Judith and Garfield Reeves-Stevens in their short story, One Last Night in the Mos Eisley Cantina: The Tale of the Wolfman and the Lamproid, which identified the character as Dice Ibegon. Since One Last Night…, which was printed in Tales from the Mos Eisley Cantina, Ibegon has only been mentioned in the Star Wars Customizable Card Game, the Star Wars Encyclopedia, The Official Star Wars Fact File, and Lak Sivrak's entry in The Essential Guide to Characters, though she also appeared briefly in the non-canon comic, \"The Emperor's Court\"."}, {"tag": "p", "text": "Since the Dice Ibegon prop was a hand puppet, she is only shown from the neck upwards in the movie. Her full anatomy was revealed in a 2009 Hasbro action figure, as part of a pack-in with Trinto Duaba."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}