{"url": "Dieben", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Males", "Category:Nalydians", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Dieben"}, {"tag": "p", "text": "Dieben was a male Nalydian criminal who was wanted for various crimes on his homeworld of Nalyd. He was regarded by Ania Solo as unintelligent and lacking much imagination at lying. By 138 ABY, Dieben had come into the services of the rogue Sith Darth Wredd, who had broken away from the underground One Sith order. During the Carreras Incident in 138 ABY, Dieben was placed in charged of guarding the captured Imperial Knight Yalta Val, who was imprisoned on the floating dead world of Mala. His known duties included providing food to the imprisoned Val and facilitating communications between Wredd and his captive. Meanwhile, his master Darth Wredd impersonated the real Yalta Val and took charge of the assembly of the Carreras G51 communications array."}, {"tag": "p", "text": "Dieben was present when Darth Wredd used the Carreras communications to broadcast his manifesto to the wider galaxy and attempted to kill Yalta Val. Following the collision of the Carreras communications array with the planet Mala, Dieben escaped in an escape pod but was picked up by Carreras security forces in the Surd Nebula. He was then extradited to his homeworld of Nalyd to face justice for his crimes. Due to the severity of his crimes, Dieben was sentenced to death by firing squad. In their quest to hunt down Darth Wredd, the junk dealer Ania Solo and the Imperial Knight Jao Assam rescued Dieben from the arena with the intent of questioning him about Wredd's whereabouts. During the question attempt, Dieben was killed when he was impaled on a sharp plant. Despite his death, Ania and Jao later learnt from his captors that he had planned to rendezvous with some \"powerful friends\" in Dac. This turned out to be a slaving operation run by another rogue Sith named Darth Luft and his pirate associates."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dieben was a Nalydian criminal who lived on the planet Nalyd, a rocky world with tall rocky features. During his time on Nalyd, he was known to have assassinated a minister, assaulted an officer of the law, and sabotaged a public transport which resulted in ten deaths. Due to his crimes, Dieben faced the death penalty. However, he managed to evade justice by escaping offworld. By 138 ABY, Dieben had come into the services of Darth Wredd, a rogue Sith who had killed his master and left the One Sith order. Darth Wredd also kidnapped and impersonated the Imperial Knight Yalta Val, who had been sent on a mission to supervise the final stages of the construction of the Carreras G51 communications array."}, {"tag": "p", "text": "Yalta Val was imprisoned at Darth Wredd's base on the floating planet of Mala. Dieben was placed in charge of guarding and feeding the imprisoned Imperial Knight, who was forced to wear Darth Wredd's former apprenticeship helmet and had his hands bound in restraints. At one point, Dieben served the captive Knight an unappetizing green soup and left the bowl on the floor for the Knight to drink. A week later, Darth Wredd contacted Yalta Val and offered him a place in his new Sith order which would be based on the Rule of Two. Sensing Val's discomfort, Wredd urged his captive to embrace the dark side of the Force as he had. During the conversation, Dieben manned the holographic projector."}, {"tag": "p", "text": "Having taken control of the Carreras communications array, Darth Wredd returned to his base, from where he could now control the station remotely. Under Wredd's orders, Dieben removed Yalta Val's helmet and brought the captive Knight into a chamber where the rogue Sith made a broadcast to the galaxy. In his speech, Darth Wredd mocked the \"weakness\" of the Galactic Federation Triumvirate and attempted to kill the captive Yalta Val. However, he was stopped by the junk dealer Ania Solo who succeeded in freeing Yalta Val. During the ensuing fighting, Dieben managed to escape in an escape pod before the Carreras communications array collided with the planet Mala. He had intended to join up with some \"powerful friends\" on Dac—the rogue Sith Darth Luft and his pirate associates, who had established a slaving operation in the Mon Calamari Shipyards. Luft and his pirates were forcing Mon Calamari and Quarren refugees to assemble a pirate fleet."}, {"tag": "p", "text": "Later, Dieben's escape pod was picked up in the Surd Nebula by unspecified security forces. He was quickly identified as a wanted fugitive and was extradited to hims homeworld of Nalyd to face justice for his crimes. As punishment, Dieben was sentenced to be executed by firing squad in a public arena. While hunting for the rogue Sith Darth Wredd, the Imperial Knight Jao Assam and Ania tracked him down to Nalyd in the vain hope of finding a lead on Wredd. Unable to convince the Nalydian authorities to delay the execution, Ania and Jao \"rescued\" Dieben and dived down a deep cliff. Distrusting his \"rescuers\", Dieben fought back and bit Ania's hand, causing her to drop him to the ground. Dieben was impaled on a sharp spiky plant, leading to injuries which resulted in his death. Ania and Jao questioned him about whether he was planning to rendezvous with Darth Wredd but even in his last moments, he refused to reveal any information to them."}, {"tag": "p", "text": "After returning Dieben's body to the Nalydian authorities, Ania and Jao learnt that Dieben had been planning to rendezvous with unspecified \"powerful friends\" in the Calamari system. Believing that this was their only lead to Darth Wredd, Ania and Jao traveled to Dac only to discover that Darth Luft and his pirate associates had established a slaving operation in the lawless system. Jao succeeded in killing Darth Luft while a Galactic Federation Triumvirate fleet liberated the Mon Calamari and Quarren slaves, and apprehended the pirates. However, Jao and Ania later learnt that their trip to Dac was a diversion engineered by Darth Wredd to fulfil his goal of destroying the One Sith and reinstating the Rule of Two."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a wanted fugitive and murderer, Dieben was known to be unscrupulous and of bad repute. According to Ania Solo, he was unintelligent and incapable of lying. He showed little concern for his prisoner Yalta Val, who was forced to drink a putrid meal while wearing helmet and while his hands were bound in restraints. He distrusted other sentient beings as shown when he attacked and bit Ania Solo during a rescue attempt. Ultimately, this action caused him his life. Even in his final moments, he remained defiant and uncooperative, taking his secrets with him to the grave."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dieben first appeared as a minor antagonist in Corinna Bechko and Gabriel Hardman's comic series Star Wars: Legacy Volume 2, which is part of the Star Wars Legends universe. In the first story arc Star Wars: Legacy: Prisoner of the Floating World, Dieben was drawn by Gabriel Hardman and colored by Rachelle Rosenberg. For the second story arc Star Wars: Legacy: Outcasts of the Broken Ring, he was drawn by Brian Albert Thies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}