{"url": "Din_Djarin", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles in need of updating", "Category:Bounty Hunters' Guild bounty hunters", "Category:Children of the Watch", "Category:Foundlings", "Category:Humans", "Category:Impersonators", "Category:Males", "Category:Pilots", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Din Djarin"}, {"tag": "p", "text": "Din Djarin, also known as \"the Mandalorian\" or simply \"Mando,\" was a human male Mandalorian who worked as a famous bounty hunter during the New Republic Era. With his Mandalorian armor, IB-94 blaster pistol, Amban sniper rifle, and distinctive beskar helmet, Djarin was both well-equipped and enigmatic—a stranger whose past was shrouded in mystery to others. Orphaned during the Republic Era, he was raised as a foundling by the Children of the Watch, a group that had broken off from mainstream Mandalorian society. Djarin was not aware of this and believed that all Mandalorians followed the Children of the Watch's beliefs. He was trained to become a Mandalorian warrior and eventually joined the Tribe, which operated in a secret covert on Nevarro and was affiliated with the Children of the Watch. Djarin became battle-hardened, a man of few words, and a formidable hunter in an increasingly dangerous galaxy."}, {"tag": "p", "text": "After the fall of the Galactic Empire, Djarin made a reputation for himself as a member of the Bounty Hunters' Guild, collecting bounties as he traveled across the galaxy's Outer Rim Territories—far from the authority of the New Republic—in his personal starship, the Razor Crest. Around 9 ABY, Djarin was hired on Nevarro by a client of an Imperial remnant faction, who offered a substantial reward for the acquisition of an asset located on the world Arvala-7. During his mission on Arvala-7, he met an Ugnaught named Kuiil, who guided him to the location of the asset. On his way to the asset, Djarin encountered a bounty hunter droid, IG-11 who first shot Djarin, oblivious to the fact that he was part of the Bounty Hunters' Guild. After Djarin verified his identity, the two entered the building in the encampment guarded by mercenaries where the asset was kept. Upon seeing the asset itself, they discovered that it was in fact a Force-sensitive child. Unbeknownst to Djarin, the child was a former Jedi youngling named Grogu, and belonged to the same species as Jedi Grand Master Yoda. Djarin, who was tasked with bringing Grogu in alive, shot IG-11 in the head, who was about to kill Grogu, and saved the infant, taking him into his custody."}, {"tag": "p", "text": "Discovering Grogu's Force-sensitivity during his time on Arvala-7, Djarin then took Grogu back to the Client and collected his reward. However, the Mandalorian warrior had already begun to form a bond with the infant. Feeling remorseful for subjecting Grogu to a cruel fate, Djarin entered the facility where Grogu was kept and rescued him from the Imperials stationed there, and later fended off Guild hunters with the help of the Mandalorian Tribe. The two would go on to embark on various adventures around the galaxy as they formed a close bond, including an encounter with former rebel shock trooper Carasynthia Dune, a job on Tatooine, and a run-in with a group of mercenaries."}, {"tag": "p", "text": "Djarin was later contacted by the Guild's agent, Greef Karga, who wished to make amends for his actions during Grogu's rescue. The Guild agent offered to work with the Mandalorian to drive away the Imperials, who took control over Nevarro's city, in exchange for dropping the bounty on the Child. Djarin then gathered his allies—Dune, Kuiil, and a re-programmed IG-11—and met with Karga on Nevarro. Djarin and his allies entered the city and fought the Imperials led by Moff Gideon, later retreating to the Tribe's covert after facing heavy opposition. The Mandalorian known as \"the Armorer,\" who had remained in the hideout after the covert's attempted relocation, tasked Djarin with returning Grogu to his people, and declared the creation of his clan. After dealing with Gideon and his remaining Imperials, Djarin departed the planet with the infant and began his search for Grogu's people."}, {"tag": "p", "text": "As Djarin and Grogu wandered the galaxy, they went on many missions together, such as a run-in with the Marshal of Mos Pelgo, Cobb Vanth, a meeting with another group of Mandalorians, and another mission with Cara Dune and Greef Karga on Nevarro. Eventually, the pair made it to Corvus, where they encountered a former Jedi named Ahsoka Tano, who was able to communicate with Grogu through the Force, revealing the child's name and history to the Mandalorian. After Djarin assisted Tano with liberating the city of Calodan from an Imperial magistrate named Morgan Elsbeth, Tano gifted Elsbeth's beskar spear to Djarin and directed him to Tython, a planet where Grogu could reach out to any other Jedi willing to train him. On Tython, as Grogu was attempting to reach a Jedi, Djarin met Boba Fett, the son of another Mandalorian, who wanted his armor back in exchange for not harming the Child. However, before Djarin could give Fett the armor, Gideon's Imperial remnant attacked and captured Grogu."}, {"tag": "p", "text": "After receiving his armor, Fett agreed to help Djarin rescue Grogu, and, with the help of Cara Dune, Migs Mayfeld, and Fennec Shand, locate Gideon's light cruiser. Djarin, alongside the Nite Owls, Dune, and Shand, stormed the cruiser and managed to locate the Child. In the process, though, Djarin unintentionally became a potential heir to the title of Mand'alor after defeating Gideon in combat and claiming the Darksaber. However, as the team attempted to escape, they were cornered by a platoon of dark troopers before being rescued by Luke Skywalker, the Jedi that Grogu had reached out to. When the dark troopers were finally destroyed, Skywalker left the ship with Grogu, but not before Djarin said his goodbyes to the youngling and promised they would see each other again."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "As a child, Din Djarin resided in the settlement of Aq Vetina. The settlement came under attack by Separatist battle droids at some point during the Fall of the Republic, and Djarin was caught in the crossfire. While the droids slaughtered the people of Aq Vetina, his mother and father hid him under a hatch before being killed in an explosion themselves shortly after. The hatch was then opened by a B2-series super battle droid, which attempted to fire on the child. Before it could, however, the battle droid was destroyed by a Mandalorian warrior wearing the symbol of Clan Vizsla."}, {"tag": "p", "text": "As more Mandalorians arrived and fought the remaining battle droids, the warrior flew away using his jetpack while carrying Djarin, rescuing him. He was then taken in as a foundling by the Mandalorians, who trained him in the Fighting Corps and took care of him. By the time following the Great Purge, he was part of the Tribe, which operated on the planet Nevarro, and acquired Mandalorian armor. Unknown to Djarin, the Tribe followed the ways of the Children of the Watch. Due to this, once he had received his helmet, he ceased to remove it in front of anyone else, for if he did, he would not be allowed to put it back on again or be considered a true Mandalorian, which was a tradition practiced by the members of the Children of the Watch."}, {"tag": "p", "text": "When he became an adult, he worked as a bounty hunter in the years following the fall of the Galactic Empire, during which time he became known simply as \"the Mandalorian,\" or \"Mando\" for short, to those outside of the Tribe. The Razor Crest, a military patrol starship that predated the Imperial Era, served as his personal transport. During the rise of the New Republic, Djarin traveled across the galaxy's Outer Rim Territories collecting bounties as a member of the Bounty Hunters' Guild. In that time, he developed a reputation for being an expensive, yet famous and formidable, bounty hunter in an increasingly dangerous galaxy. At some point, Djarin had worked alongside criminal Ranzar Malk, and the Twi'lek mercenaries Xi'an and Qin, who were also siblings. One such mission was on Alzoc III. During his time with the team, actions by Djarin led to a falling out between the group, as well as the capture of Qin."}, {"tag": "h3", "text": "Guild work"}, {"tag": "h4", "text": "Hunting a Mythrol"}, {"tag": "p", "text": "Around 9 ABY, Djarin tracked one of his many bounties, a Mythrol, to a bar on the ice planet Maldo Kreis. The Mythrol was harassed by three trawlers when Djarin entered the bar, drawing the trawlers' attention away from his target. As Djarin made his way to the counter, one of the human trawlers approached him and claimed he had spilled his drink, speaking in Huttese. The bartender translated his statement, but Djarin remained silent. As the bartender proceeded to make another drink, the trawler's Quarren and cyborg human companions made their way to the counter, slowly surrounding Djarin. The trawler then asked if the armor he was wearing was real beskar steel, before the Quarren nicked Djarin's chest plate with a knife."}, {"tag": "p", "text": "When the bartender finally slid the drink across the counter, Djarin surprised the trio by attacking first, incapacitating the cyborg by smashing the drink on his head and knocking him out. The other human trawler attempted to stab Djarin with his knife, but Djarin grabbed his arm and redirected the blade to his back. When the Quarren attempted to escape the bar, Djarin used his whipcord thrower to pull him back towards him and shot the controls for the door, allowing it to close on the Quarren and bisect him. After dealing with the trawlers, Djarin approached the Mythrol, who thanked him for saving his life. However, Djarin displayed the Mythrol's holopuck in front of him. The Mythrol, realizing the Mandalorian's true intentions, claimed there was a misunderstanding, but Djarin threatened him, stating he could either bring him in \"warm\" or \"cold.\""}, {"tag": "h4", "text": "Leaving Maldo Kreis"}, {"tag": "p", "text": "After the Mythrol obliged, Djarin took him back towards the Razor Crest. When approaching a Kubaz ferryman, the Mandalorian requested transportation to his gunship. The Kubaz then played a flute and summoned a landspeeder driven by a droid. Djarin refused to accept a transport driven by a droid and instead accepted a much less luxurious speeder with a human pilot after flipping the ferryman some extra credits. The pilot drove the Mandalorian and the Mythrol to the Razor Crest."}, {"tag": "p", "text": "After he left them, the speeder pilot was attacked by a ravinak, who pulled the speeder under the ice. Djarin pulled the Mythrol out of the way of the beast as they boarded the ship to take off. Although the ravinak attempted to prevent the gunship from taking off by holding on to the landing gear, Djarin stunned the creature using his Amban phase-pulse blaster and allowed his ship to escape. While making their way to Nevarro, Djarin remained silent while the Mythrol attempted to spark a conversation with him. He then allowed the Mythrol to use the Razor Crest's vacc tube in the lower deck. When the Mythrol discovered several of Djarin's bounties frozen in carbonite, he was grabbed by the bounty hunter and was subsequently frozen in carbonite himself."}, {"tag": "h4", "text": "The new job"}, {"tag": "p", "text": "Upon completing the Mythrol job, Djarin returned to the Bounty Hunters' Guild within the cantina on Nevarro to receive his payment from their agent, Greef Karga, who was surprised at how quick he had captured all his bounties. When Djarin refused Karga's initial payment of Imperial credits, Karga offered Calamari Flan instead at half the value, which Djarin accepted. When they discussed Djarin's next job, the bounty hunter attempted to take all of Karga's pucks, but Karga stated that there were other members of the Guild and that those were the only pucks he currently owned."}, {"tag": "p", "text": "Djarin asked why the Guild was slow in acquiring pucks, to which Karga replied that they weren't slow but were in fact busy as people did not wish to pay Guild rates. As they conversed, Djarin was unsatisfied when he learned of the value of Karga's highest paying bounty, stating that the reward would not cover the cost of fuel. Karga then offered him a job which required meeting the client \"face to face,\" stating that no puck was provided. When Karga offered the chit to meet the client, Djarin took it off his hands without hesitation and left the cantina."}, {"tag": "h4", "text": "Meeting the Client"}, {"tag": "p", "text": "Djarin proceeded to the location of the client, arriving at a facility whose entrance was guarded by a TT-8L/Y7 gatekeeper droid. After showing the chit to the droid and entering the facility, he made his way to a room with \"the Client,\" who was part of a remnant faction of the old Empire, and four weathered stormtroopers. The Client told Djarin that Karga had called him \"the best in the parsec.\" While speaking to the bounty hunter, his scientist, Doctor Pershing, entered the room and startled Djarin, prompting him to draw his weapons. The stormtroopers trained their own blasters at him. The Client introduced Pershing to the Mandalorian, before ordering Djarin to lower his blaster. Djarin told the Client to order his stormtroopers to lower their blasters first, before being told that Karga also stated that the bounty hunter's services were expensive. Djarin then lowered his weapons when the Client ended the standoff by signaling the troopers to lower their blasters."}, {"tag": "p", "text": "As the Mandalorian was seated, the Client presented him with an ingot of Imperial-forged beskar as down payment. The Client explained that he wished to acquire an \"asset\" in exchange for a camtono of beskar, and Pershing stated that the asset was to be brought back alive. The Client acknowledged how complicated bounty hunting could be, and stated that the asset's termination was acceptable for a lower reward. When Djarin demanded the puck of the target, the Client forwent the traditional method of bounty pucks and revealed that he could only offer the asset's tracking fob. Pershing provided the fob to Djarin, before the bounty hunter asked for the chain code. The Client stated he could only share the age of the asset, fifty years, and its last known location."}, {"tag": "p", "text": "Before Djarin left the room, the Client stated that the beskar belonged back into Mandalorian hands, adding that it was favorable to restore order following a period of disarray. After leaving the facility, Djarin visited \"The Armorer\" in the Tribe's covert, paying her with the Calamari Flan to forge a pauldron from the beskar ingot. She told him it was gathered during the Great Purge, an event which saw the deaths of most of the Mandalorian people, and added that it was beneficial that it was returned to the Tribe. Djarin was asked if his signet had been revealed, and replied that it hadn't yet. When the Armorer said that the excess would sponsor many foundlings, Djarin recounted that he had been one in the past. As she forged the pauldron, he was reminded of his experience of the Separatist attack from his childhood."}, {"tag": "h4", "text": "Arrival on Arvala-7"}, {"tag": "p", "text": "The Mandalorian traveled to the desert world Arvala-7 to locate the asset. Upon landing and scanning the environment with his sniper rifle, he was attacked by a blurrg. Attempting to use his wrist-mounted flamethrower, the blurrg caught his arm in its jaw. After hitting the blurrg and releasing his arm, the blurrg then caught his other arm and dragged him on the ground, before the Ugnaught vapor farmer Kuiil stunned the creature. As another blurrg charged towards Djarin, Kuiil stunned the other creature and rescued him. After Djarin thanked the Ugnaught, Kuiil agreed to help him and took him back to his moisture farm."}, {"tag": "p", "text": "There, Kuiil informed the bounty hunter that he had assisted many hunters that had come to the world before in search the asset, but were all killed. Djarin then voiced his concerns about taking his help, but was assured that he needed it. Kuiil accepted one of the two blurrgs the bounty hunter had fought in exchange for guidance to the asset's location. He told the Mandalorian he would need the other blurrg to reach the asset, informing him that the way was impossible to navigate without a blurrg. Djarin then stated that he could not ride a blurrg."}, {"tag": "p", "text": "At the blurrg pen, the bounty hunter attempted to tame one of the blurrgs, but gave up after the blurrg repeatedly shook him off his back. He then asked the Ugnaught if he had a speeder he could use to reach the asset. Kuiil stated that Djarin was a Mandalorian whose ancestors once rode the great mythosaur. Djarin then attempted to tame the foal one last time and successfully hopped on its back without startling it. Afterwards, Kuiil guided the bounty hunter to the asset's location in the hope that the ensuing battle would lead to the deaths of the mercenaries whose presence disrupted the peace on Arvala-7. Upon reaching the encampment where the asset was kept, Kuiil explained his reasoning for guiding Djarin, and believed that he could make short work of the mercenaries due to his Mandalorian status."}, {"tag": "h4", "text": "Finding the Child"}, {"tag": "p", "text": "Following Kuiil's departure, Djarin spied on the mercenary encampment from afar using the scope of his Amban sniper rifle, and spotted the assassin droid IG-11, who was also from the Guild, approaching the encampment. He watched as the droid attempted to negotiate with the company of Nikto mercenaries, stating a paragraph from the Bondsman Guild Protocol, and began to dispatch them one by one after they pulled out their blasters, forcing the mercenaries to retreat inside the buildings of the encampment."}, {"tag": "p", "text": "Djarin then arrived at the scene and ordered IG-11 to stand down, but was shot in the shoulder by the droid and knocked down into the ground. Djarin got up and revealed that he was also a member of the Guild, stating that the droid was empty-handed and offered to work with him to acquire the asset and split the reward. After IG-11 agreed however, more mercenaries began storming out the buildings, who soon pinned them down. While taking cover behind a speeder, the bounty hunter found the building where the asset was located using his fob, and the two immediately rushed to take cover the building's pillars. IG-11 then attempted to activate his self-destruct mechanism, as he stated that he could not be captured, but Djarin ordered him to provide covering fire as the Mandalorian attempted to open the building's entrance."}, {"tag": "p", "text": "Realizing there were too many mercenaries firing upon him, Djarin took cover behind a pillar next to IG-11, who once again attempted to initiate his self-destruct sequencing. During this time, the mercenaries brought a E-Web and began firing on their position. Djarin decided to form a new plan, but IG-11 attempted to self-destruct a third time. Djarin then ordered the assassin droid to draw the turret's fire away from the Mandalorian while he hijacked the E-Web, utilizing it to kill the rest of the mercenaries. After the battle ended, Djarin pulled the droid up to his feet and asked he suffered any major damage from the blaster fire he received, and IG-11 confirmed he had avoided it."}, {"tag": "p", "text": "After the Mandalorian and IG-11 used the E-Web to break through the entrance, they entered the building with the asset inside, with Djarin shooting a Nikto as they walked in. Upon finding the asset and opening its hovering pram, the pair discovered that it was in fact an infant and a member of the same species as the former Jedi Grand Master Yoda. Djarin questioned the infant's age, to which the droid replied his species may have aged considerably slower compared to others. As IG-11 raised his blaster to kill the infant, Djarin stopped him and stated that they should bring him in alive. The assassin droid replied that the commission was quite specific and stated that Grogu was to be terminated. However, because of his compassion for Grogu, the Mandalorian destroyed IG-11, shooting the droid in the head before he was able to fulfill his mission, protecting the infant and taking him into his custody."}, {"tag": "h4", "text": "Conflict with Jawas"}, {"tag": "p", "text": "Following the skirmish, Djarin escorted Grogu through a canyon until he was ambushed by a trio of Trandoshan bounty hunters. After knocking a Trandoshan to the ground unconscious, he stunned the second one before disintegrating the third with his sniper rifle as it ran towards Grogu. He noticed that it had been carrying a tracking fob, indicating that the trio was from the Guild as well. During the night, while the Mandalorian sat by a bonfire, Grogu climbed out of his pram and attempted to use the Force to heal the cut on Djarin's arm that he had sustained in the fight with the Trandoshans. The Mandalorian, unaware of Grogu's intentions, picked him up and placed him back into the pram."}, {"tag": "p", "text": "As Djarin approached the Razor Crest the next day, he discovered from afar that a group of Jawas had scavenged his ship for parts. He quickly pulled out his rifle and disintegrated a number of Jawas as the rest fled inside their sandcrawler. He then chased the sandcrawler, scaling the transport and fighting through several Jawas before being stunned by their ion blasters after reaching the top, sending him falling back onto the ground. After returning to his ship and finding it inoperative, he traveled back to Kuiil's farm and requested his assistance. Djarin stated that his ship was destroyed, but Kuiil corrected him stating it was stripped for parts, adding that Jawas only steal and don't intend to destroy. The Ugnaught suggested that they trade with the Jawas for the parts, and Djarin agreed after realizing there was no other option."}, {"tag": "h4", "text": "Brokering a deal"}, {"tag": "p", "text": "Djarin and Kuiil then made their way to the Jawa tribe. When Kuiil asked the Mandalorian to drop his weapons in order to allow negotiations to proceed, Djarin refused and stated that weapons were a part of the Mandalorian religion, but complied when Kuiil revealed he wouldn't receive the ship's parts if he did not drop them. During the negotiations, the Jawas requested his beskar armor, to which the Mandalorian refused in Jawaese. His usage of the language was mocked by the tribe's elder, which angered Djarin, causing him to use his flamethrower to scare the Jawas, before being stopped by Kuiil. He also refused when they requested Grogu for trade."}, {"tag": "p", "text": "After exhausting their options, the Jawas requested the egg of a mudhorn. Djarin was then transported to its cave alongside Grogu and Kuiil. He proceeded to the cave and entered it, using his helmet-mounted flashlight to light up the dark interior. When he alerted the mudhorn inside, he battled the creature and was knocked outside. He immediately pulled out his sniper rifle when the creature exited its lair, only to discover that it had been jammed from the mud clogging the weapon. When the mudhorn then attempted to charge towards Grogu, Djarin managed to move the hover-pram out of harm's way. The Mandalorian proceeded to use his remaining arsenal to battle the mudhorn, but was unable to harm the creature. Djarin became brutally battered as the fight progressed."}, {"tag": "p", "text": "An exhausted Djarin then pulled out his vibroblade in one last attempt to fight the mudhorn. As the mudhorn proceeded to charge towards Djarin, Grogu revealed his Force-sensitivity and lifted the creature with the Force, and the Mandalorian stabbed its neck and killed it before it dropped to the ground. Claiming the mudhorn's egg from the cave, he returned to the Jawas, who began feasting on its inner contents. After successfully trading for the parts, Djarin returned to the Razor Crest with Kuiil, the two struggling to understand the nature of Grogu's Force powers on the way. After returning to the ship, he and Kuiil repaired the ship. Djarin thanked the Ugnaught for his assistance, offering him to join his crew and reward him. Kuiil refused, wishing to live a life away from servitude, and stayed behind, thanking Djarin for bringing peace to his home. With Grogu in hand, the Mandalorian departed Arvala-7 and set off to complete the bounty he was given."}, {"tag": "h4", "text": "The winner's spoils"}, {"tag": "p", "text": "Upon returning to Nevarro to turn in the Child, he was contacted by Karga, who told him to take the quarry directly to the Client. On their way, Grogu detached the knob of one of the levers on the ship and played with it. Djarin took it off his hands before lifting him and placing him back into his hover-pram. The Mandalorian returned to the Imperial remnant facility with Grogu in hand. When he told the stormtroopers to handle Grogu's pram with care while entering the facility, he watched as they forcefully pulled the pram forward. Upon entering the Client's room, Djarin watched as Pershing and the Client inspected the infant, and he asked the latter how many hunters were given fobs to track Grogu. The Client stated that he needed to ensure the asset's delivery as it was of utmost importance to him."}, {"tag": "p", "text": "The Mandalorian was then presented with the camtono of beskar as promised. While inspecting the beskar ingots, the bounty hunter could only watch as Grogu was taken deeper into the facility by Pershing. When Djarin asked what the plans were for the Child, the Client questioned his inquiry and reminded the bounty hunter of the Code of the Guild as more stormtroopers entered the room. Not seeking a confrontation, Djarin quietly left the room with the camtono."}, {"tag": "h4", "text": "Tensions with the Tribe"}, {"tag": "p", "text": "Taking his reward to the Tribe's enclave, the Mandalorian caught the attention of the other members of the Tribe. When requesting the Armorer for a full set of beskar armor, several other Mandalorians slowly entered the room. One of them, Paz Vizsla, inspected one of the ingots and accused Djarin of being a coward for taking a job for Imperials. He then attempted to take the bounty hunter's helmet off, causing him to fight back. The two fought and drew their vibroknives on each other. The Armorer denounced the possibility of Djarin being a coward and asked if he or someone else had removed Djarin's helmet. When the bounty hunter denied, she cited the Way of the Mandalore, and the other Mandalorians echoed their way of life in response."}, {"tag": "p", "text": "The Armorer then asked what had damaged Djarin's armor, and Djarin stated it was a mudhorn. When she offered to create a mudhorn's signet, Djarin refused, stating that he was assisted in battle by Grogu, whom he called \"an enemy.\" He added that he did not kill the creature nobly. Hearing this, she instead offered to forge whistling birds. Accepting the offer, the Mandalorian requested her to reserve some beskar for the foundlings, and she used the rest to create a full set of traditional Mandalorian armor for him. As she crafted them, Djarin was once again reminded of the Separatist attack."}, {"tag": "h4", "text": "Returning to Karga"}, {"tag": "p", "text": "After equipping the armor, Djarin entered the cantina to meet Karga regarding his next job. The rest of the Guild eyed him in jealousy as he approached the Guild agent, who was pleased to have received some beskar of his own from the Client due to the success of Djarin's previous job. Djarin asked Karga how many fobs were handed out, and Karga loudly proclaimed that every member of the Guild had received one, and despised Djarin as he was the only hunter to have successfully completed the bounty. When he asked the Mandalorian how he could show his gratitude, the bounty hunter asked for another job. Karga suggested that he enjoy his success, and offered to show him to the Twi'lek healing baths. Djarin requested for his next mission again, and Karga provided a number of bounty pucks, the most valuable showing the son of a nobleman."}, {"tag": "p", "text": "Right before leaving the cantina, Djarin asked of the fate of Grogu, Karga reminded him that it was against the Guild Code to ask about the bounty and told him to enjoy himself. Djarin revealed that his client had ties to the Galactic Empire of old, but Karga stated that they were vanquished completely with only mercenaries and warlords remaining, and suggested that he travel to the Core Worlds and report their activities to the New Republic, an idea that the bounty hunter believed was a joke. Karga also suggested that the bounty hunter purchase a camtono of spice to ease his worries, before Djarin left the cantina."}, {"tag": "h4", "text": "A change of heart"}, {"tag": "p", "text": "Djarin returned to the Razor Crest to begin hunting his next target. when he attempted to take off however, he was reminded of Grogu when going for the lever with its knob detached. Having begun to develop a parental bond with him, Djarin felt remorseful for leaving Grogu to a cruel fate, and decided to instead take him back from the Imperial facility. Returning to the facility, he found that Grogu's pram had been discarded in garbage. At the roof of a building, Djarin used the thermal vision on his helmet and his Amban sniper rifle to eavesdrop on the Client and Pershing in the facility, learning of their plans for Grogu."}, {"tag": "p", "text": "Reaching the facility's entrance, he ripped off the gatekeeper droid's head and breached the facility by using a detonator on one of the walls to find out what had happened. Entering the building, he proceeded to kill a pair of stormtroopers that patrolled a hallway, and a third that came out to aid them. After using his vibroknife and whipcord thrower to kill an additional trooper, the Mandalorian entered the room with Grogu, killed the guard and destroyed the IT-O Interrogation Unit that loomed above the sedated Grogu. Pershing cowered in fear and pleaded with the bounty hunter to let Grogu live."}, {"tag": "p", "text": "When Djarin confronted the doctor on what he had done to Grogu, Pershing revealed he protected Grogu, claiming that the infant would be dead if it was not for him. Djarin then left him alive and took Grogu away. Making his way out of the facility, the Mandalorian entered a storage room where he incapacitated two stormtroopers that attempted to stop him. He subsequently electrocuted another trooper that entered the room with his phase-pulse blaster and burned another to death with his flamethrower. When four more surrounded him in a room, he utilized the whistling birds to eliminate them."}, {"tag": "h4", "text": "Fighting the Guild"}, {"tag": "p", "text": "After leaving the facility, Djarin began to make his way back to the Razor Crest. The bounty hunters, however, had realized their tracking fobs began tracing Grogu again, and surrounded the Mandalorian in the street leading to the ship. Karga, blocking his way, ordered him to put down the Child on a speeder and offered to negotiate, but the bounty hunter insisted that the infant was coming with him. After approaching the speeder, Djarin shot one of the other bounty hunters and jumped into the speeder with Grogu. The Mandalorian threatened the droid piloting the speeder into driving them away from the bounty hunters, shooting some of them down in the process."}, {"tag": "p", "text": "Karga shot the droid, causing the speeder to stop. Using his Amban sniper rifle, the Mandalorian began disintegrating several bounty hunters. As Karga taunted him, two more hunters attempted to flank Djarin from behind. The Mandalorian stunned the first one with his rifle, before shooting the second one dead with his blaster pistol. However, the bounty hunters overwhelmed him even after the Mandalorian used his flamethrower to drive them away, and he was pinned inside the speeder. As his last action, Djarin shielded Grogu with his body from oncoming fire. To the Guild's surprise, they were suddenly attacked by Mandalorians from the Tribe, who forced them back from the speeder as more of the bounty hunters were killed."}, {"tag": "p", "text": "Paz Vizsla, who landed beside Djarin, told him to retreat to his ship. After Djarin stated that the Tribe will have to relocate their hideout, Vizla cited the Way of the Mandalore, which Djarin iterated back. Retreating to the Razor Crest with Grogu, he was confronted by Karga. Djarin used carbonite gas to blind his adversary and shot him off the entry ramp, although Karga survived. Flying away from the fight, the Mandalorian saw Vizla fly beside the Razor Crest and salute him before returning to the others, with Djarin uttering to himself that he needed to acquire a jetpack."}, {"tag": "h3", "text": "On the run"}, {"tag": "h4", "text": "Searching for sanctuary"}, {"tag": "p", "text": "While in space following his escape from Nevarro, Grogu tinkered with various controls in the Razor Crest, before Djarin seated the infant in his lap. While looking at a map, he deemed the planet Sorgan a suitable place to hide while the search for him and Grogu wore down. After arriving on the planet, he instructed Grogu to stay on the Razor Crest while he searched for lodging. Seemingly unable to understand Djarin, Grogu had followed him regardless and stood by him as the Mandalorian activated the ramp. Djarin then decided to have the infant accompany him instead."}, {"tag": "p", "text": "The duo soon reached a common house where Djarin intended to search for information on where the two could possibly lay low. The common house's proprietor then approached the two while they were seated at a table, taking their order. Having noticed former rebel shock trooper Carasynthia Dune, Djarin began to inquire to the proprietor regarding Dune's past and intentions, passing her some credits. After the proprietor responded with little information, Djarin soon began to trail Dune after she left, flipping more credits to the proprietor on the way and telling her to watch Grogu."}, {"tag": "p", "text": "Outside the common house, Djarin used his thermal vision to track Dune's footprints. He moved around the house until the trail had ended, and was quickly ambushed by Dune. The two brawled until they drew their blasters at each other, and noticed Grogu watching them while sipping a bowl of soup. Following this, the two sat in the common house to speak to each other regarding their respective intentions. Dune revealed her military background and stated she was attempting to find sanctuary from a bounty placed on her after she deserted the New Republic. Shortly before Dune left, she asked the Mandalorian to leave as she had arrived to Sorgan first. The Mandalorian remarked to Grogu that the planet had already been \"taken\" as a result."}, {"tag": "h4", "text": "Hired to protect"}, {"tag": "p", "text": "As Djarin prepared to leave Sorgan, krill farmers Caben and Stoke encountered him while riding their transport. They pleaded that he help defend their village from a group of Klatooinian raiders, offering funds that the entirety of their village had accumulated. Djarin initially refused, though later accepted upon hearing from them that the village was remote and had available lodging. He accepted their credits, and ordered the two farmers to help him unpack his supplies. He later approached Dune, and handed her the credits in return for her aid in protecting the village. Upon arriving at the village, the Mandalorian was shown to farm's barn, which served as his lodging."}, {"tag": "p", "text": "The widowed villager Omera prepared his lodging while the Mandalorian unpacked his supplies. While Omera's daughter Winta entered the room, a startled Djarin pulled out his blaster pistol in response. The villager then introduced her daughter and explained that the village did not receive many visitors, before the two left Djarin's room. Later that same day, Omera provided food to Djarin, who reluctantly allowed Winta to feed and take Grogu with her outside. Omera proceeded to ask the Mandalorian when was the last time he had removed his helmet, he remarked that he removed it yesterday. Omera clarified her question, asking if anyone had ever seen his face. Djarin replied that he hadn't shown his face to anyone since his childhood after the Mandalorians took him in following the Separatist attack on his home, before citing the Way of the Mandalore. After Omera departed, the Mandalorian watched the village's children play with Grogu as he ate with his helmet off."}, {"tag": "h4", "text": "Defending the village"}, {"tag": "p", "text": "Later on, while scouting to find the Klatooinian tribe, Djarin and Dune encountered tracks that revealed the tribe possessed an AT-ST. The two returned to the village soon after, demanding that the villagers leave and find somewhere safer to live, believing the AT-ST was too dangerous to take down. After the villagers refused to leave their home, Djarin and Dune eventually agreed to train the villagers to fight against the tribe. As they helped to train the villagers, they also instructed them to create traps and barricades designed to hinder and destroy the AT-ST. Before leaving the village, Djarin informed Omera that he and Dune would draw the raiders' attention, and she responded saying that the villagers would be ready for the attack."}, {"tag": "p", "text": "Later, at nightfall, Djarin and Dune departed to the Klatooinian wikiup in an attempt to draw the raiders and the AT-ST to the village. Infiltrating a tent while the raiders were unaware, Djarin planted an explosive inside the tent before the raiders entered the tent. Dune and the Mandalorian engaged in hand-to-hand combat with the Klatooinians, rushing out of the tent right before the explosive was detonated. With the AT-ST now alerted, the two escaped back to the village, the walker in pursuit. Shortly afterwards, they arrived to the village and ordered the villagers to prepare their defenses."}, {"tag": "p", "text": "Right as the AT-ST arrived at the village, Djarin, Dune, and the villagers hid under the barricades before the walker began firing its weapons. As the Klatooinian raiders assaulted the village, Djarin helped hold the defenses, later allowing Dune to use his rifle to draw the AT-ST into the intended trap. After the walker's collapse, he destroyed its remains with an explosive. The remaining Klatooinian raiders retreated soon after."}, {"tag": "h4", "text": "Departing Sorgan"}, {"tag": "p", "text": "Having now been at the village for a number of weeks, Djarin and Dune resided by a hut when Omera pointed out to the Mandalorian that Grogu was happy to spend time with the village's children. After the villager left, Dune asked what would happen if Djarin took off his helmet and he stated that he could never wear it again. Dune facetiously expressed that he could abandon his Mandalorian way of life and settle on Sorgan with Omera and raise Grogu. Preparing to depart the village, he expressed to Dune his intent to leave Grogu safe in the village, believing that life with a bounty hunter would be too dangerous for the infant."}, {"tag": "p", "text": "As Djarin was about to leave, he met with Omera, stating his intentions to leave Grogu at the village. Omera asked Djarin to stay at the village, saying that the villagers were grateful for his actions before attempting to remove his helmet. However, a Kubaz bounty hunter had reached the outskirts of the village, and began to aim his weapon at the Mandalorian. Djarin stopped Omera, stating that only Grogu belonged at the village. As this happened, the Kubaz changed his sights to Grogu, before he was killed by Dune, alerting Djarin to his presence. Realizing that the infant was still in danger, he departed Sorgan with Grogu, and parted ways with Dune and Omera."}, {"tag": "h4", "text": "Landing on Tatooine"}, {"tag": "p", "text": "After leaving the village with Grogu, the Razor Crest came under fire from the bounty hunter Riot Mar, who demanded the Mandalorian hand infant over to him while piloting his starfighter. Continuing to evade the fighter, the Crest suffered substantial damage to its engines. After Mar told the Mandalorian he could \"bring him in warm\" or he could \"bring him in cold,\" Djarin slowed down his ship, which caused Mar to overshoot him. With the bounty hunter's craft in his sights, the Mandalorian stated that Mar had used his line, before firing the Crest's guns and destroying Mar's fighter, killing him."}, {"tag": "p", "text": "Needing to repair his ship, Djarin sought out repairs on the desert planet of Tatooine, where he received a transmission from the Mos Eisley spaceport tower telling him to land at bay three-five. After landing, Djarin left the Child to sleep in a compartment of his ship. A trio of pit droids attempted to repair the ship, prompting the Mandalorian fire a warning shot. This action was met with frustration by Peli Motto, the mechanic who managed the bay and owned the droids. The Mandalorian paid a reluctant Motto five hundred Imperial Credits to repair the Razor Crest, without droid assistance, and informed Motto that he would return to the bay pay the rest of the cost as he left to search for work."}, {"tag": "p", "text": "Djarin later entered Chalmun's Spaceport Cantina, where he requested bounty hunting jobs from a bartender maintaining the cantina, EV-9D9. The droid stated that the Bounty Guild no longer operated from Tatooine, and even after Djarin clarified that he wasn't looking for Guild jobs, the droid still replied that no work was available. He was then greeted by rookie bounty hunter Toro Calican, who stated that he had a job he could assist him with. The Mandalorian initially refused due to the bounty's, the assassin Fennec Shand, dangerous reputation. but accepted the job when Calican, who wished to join the Bounty Guild, further pleaded and offered all his credits. Djarin finally accepted, and told the rookie hunter to prepare two speeder bikes outside Hangar three-five in half an hour. When Djarin asked for Shand's tracking fob, Calican destroyed it, claiming he had memorized Shand's last known location, which was beyond the Dune Sea."}, {"tag": "p", "text": "Returning to bay three-five, Djarin entered the Razor Crest to check on Grogu, only to discover that the infant was missing. Motto, who had discovered Grogu's existence and took care of him, scolded the Mandalorian for leaving the infant aboard the ship alone. Djarin briefly thanked Motto for looking after Grogu and repairing his ship before meeting Calican outside the bay, and the two hunters departed to hunt for Shand."}, {"tag": "h4", "text": "The hunt for Fennec Shand"}, {"tag": "p", "text": "As Djarin passed through the Dune Sea with Calican, the trip was halted after the two spotted a group of Tusken Raiders with their banthas. Djarin explained that the Tuskens believed they were the natives of the planet, and viewed everyone else as trespassers. After the two were greeted by a pair of Tuskens, the Mandalorian negotiated with them using sign language, and gave them Calican's binoculars as payment for passage through their land."}, {"tag": "p", "text": "As they continued the hunt, Calican and Djarin came across a stray dewback dragging its dead rider. The Mandalorian then ordered Calican to stay behind while Djarin attempted to inspect the creature closer. Approaching the dewback, he discovered via the tracking fob on the corpse that Shand was nearby. While retreating to cover, he was shot twice by Shand's MK sniper rifle, though he survived due to his beskar armor. Upon returning to Calican's position, Djarin suggested that they wait until nightfall to capture Shand, as he stated that the assassin would wait for the two hunters to make their first move."}, {"tag": "p", "text": "Upon nightfall, Calican attempted to wake Djarin up, but decided to toy with his blaster, aiming at the Mandalorian. Djarin then startled Calican when he asked if he finished his act. The Mandalorian proceeded to detail their plan, which to alternate between flash charges in order to temporarily blind Shand and allow them to reach the assassin's position. The two hunters began making their way towards Shand's position, launching the flash charges to blind her weapon's scope. When Calican accidentally misfired a charge, Shand targeted the nose of the Mandalorian's speeder bike, causing him to be launched forward onto the ground."}, {"tag": "p", "text": "Shand then shot Djarin on the chest and knocked him down. This gave Calican enough time to get behind Shand, and two soon engaged in a fight. When the assassin managed to put Calican in a stranglehold, the Mandalorian interrupted the fight, demanding Shand to put a pair of stuncuffs on herself. As both he and Calican escorted Shand to the remaining speeder, Djarin told Calican to find the dewback they had seen earlier in the day, but the rookie refused, stating that Shand was his bounty. Djarin then left to look for the stray dewback while Calican kept watch over Shand."}, {"tag": "h4", "text": "Calican's betrayal"}, {"tag": "p", "text": "During Djarin's absence, Calican learned from Shand that the Mandalorian had been responsible for betraying the Bounty Hunters' Guild on Nevarro. Calican, out of motivation to gain a substantial reputation with the Guild, then shot Shand in the abdomen and left her for dead as he left to kidnap both Motto and the Child at bay three-five. Upon Djarin's return to Calican's former position with the dewback mount, he discovered Shand's presumed corpse, with Calican and the speeder bike both absent, and subsequently returned to the bay on the dewback to face Calican."}, {"tag": "p", "text": "Upon his return to bay three-five, Calican demanded that Djarin surrender himself. As the Mandalorian feigned concession, holding a flash charge in his hand, Calican ordered Motto to place a pair of stuncuffs on the Mandalorian. Djarin then activated the charge, and in the frenzy, shot and killed Calican. He then paid Motto more credits acquired from the rookie's body to cover the repairs, and left Tatooine with Grogu in tow."}, {"tag": "h4", "text": "Finding work"}, {"tag": "p", "text": "Following the job on Tatooine, Djarin contacted an associate from his past, Ranzar Malk, in search of work, and later landed the Razor Crest in Malk's space station, the Roost. Upon exiting the Razor Crest, he was greeted by Malk, who expressed surprise at the Mandalorian's actions as of late due to hostilities between him and the Bounty Guild. While conversing, Malk explained that Djarin was hired to assist four other crew members in rescuing another of their associates captured by a rival syndicate. Unbeknownst to Djarin at the time, the prisoner was his former ally, the Twi'lek Qin, who was imprisoned due to the Mandalorian's actions while on a mission with the Twi'lek. Djarin protested upon learning he was only hired for use of the Crest, but Malk pointed out that the ship was the only reason he was allowed to enter the space station."}, {"tag": "p", "text": "After the discussion, Djarin was introduced to the human mercenary, Migs Mayfeld, who was in charge of the operation. When Malk explained Mayfeld's past service as an Imperial sharpshooter, Djarin belittled the mercenary, who called the Mandalorian a \"wiseass\" in response. Accompanying Mayfeld, the team leader introduced Djarin to the other team members on the mission, beginning with the Devaronian Burg, who ridiculed the Mandalorian upon seeing him. Mayfeld then introduced the droid Q9-0, whom they nicknamed \"Zero.\" Djarin, who had only been introduced to three members of the team at that point, asked where the fourth member was. Xi'an, another former partner of Djarin's, then introduced herself."}, {"tag": "p", "text": "With the team fully assembled, Mayfeld began briefing them on the mission. Upon seeing a hologram of a New Republic Correctional Transport, the Bothan-Five, Djarin learned that the associate they would be rescuing was actually a New Republic prisoner. He protested that he was lied to by Malk regarding the mission's true nature, and the ship would be under maximum security. Xi'an then revealed that the ship's personnel purely consisted of droids, appealing to his hatred of droids. When Djarin learned that the Razor Crest would be piloted by Zero into a near-impossible maneuver in order to avoid scanners, he asked Malk if he trusted the droid, to which the criminal replied that he \"didn't trust anybody.\""}, {"tag": "h4", "text": "Tensions with mercenaries"}, {"tag": "p", "text": "While traveling to the prison ship, Djarin entered the cockpit and watched as Zero piloted the Crest with a scomp link and jumped to hyperspace, who then told Djarin to join the other members at the back of the ship. Making his way to the lower deck of his ship, Djarin confronted Burg after the latter opened a weapons compartment. During a brief standoff with Burg, the Devaronian questioned why Djarin was chosen for the job. Mayfeld quelled the standoff after explaining they were the \"greatest warriors in the galaxy\" according to hearsay, to which Burg asked why most Mandalorians were deceased, referencing the Great Purge."}, {"tag": "p", "text": "Djarin was made more uncomfortable when Xi'an brought up the mission from Alzoc III, causing tensions to build up between him and the mercenaries. The group speculated what the Mandalorian looked like under his helmet, and Burg attempted to remove it, resulting in a fight between the two. The Mandalorian inadvertently knocked Burg into the compartment where he stored Grogu, opening it and revealing the infant's existence to the entire group. While inspecting the infant, Mayfeld held Grogu, much to the Mandalorian's dismay."}, {"tag": "h4", "text": "Infiltrating the prison ship"}, {"tag": "p", "text": "Soon after Mayfeld held the Child, Zero dropped the Razor Crest out of hyperspace with no prior warning to the crew and maneuvered the ship in order land on the prison ship. This caused the crew members to stumble, as well as cause Mayfeld to drop the Child. Djarin quickly picked up the child and placed him back inside the compartment, closing it. The group entered the prison ship through a hatch on the Razor Crest, and began to search for the prisoner."}, {"tag": "p", "text": "While on the ship, the group slowly made their way to the control room until they encountered a patrol of security droids in a corridor after Burg shot a mouse droid, and were pinned down as a result. Djarin then flanked the security droids from behind, and began to destroy them in a surprise attack, while the mercenaries watched. After successfully destroying the droids, the mercenaries mocked his efforts, with Mayfeld telling him to \"clean up his mess\" and Burg intentionally bumping into Djarin while passing by him."}, {"tag": "p", "text": "Upon reaching the control room, the group encountered a New Republic soldier, Davan, and slowly surrounded him while the soldier drew his blaster. After Mayfeld discovered the cell where the prisoner was kept, Davan took out his homing beacon in an attempt to threaten the mercenaries, and a standoff ensued. The Mandalorian, opposed to the other crew members' intent to kill Davan, holstered his blaster and instructed the others to holster their weapons as well. Djarin then asked for the soldier's name, before telling him he would live if he allowed Djarin and the mercenaries to find their prisoner. Mayfeld, who was opposed to the idea, continued to train his blaster at Davan, causing Djarin to take aim at the mercenary in response."}, {"tag": "p", "text": "The standoff was ultimately cut short by Xi'an when she threw a knife into the soldier's body, killing him. The group were then forced to rush to the prisoner upon learning that the soldier had managed to activate the homing beacon, which alerted a New Republic squadron to their location. They located the prisoner's cell, and Djarin finally discovered that the individual inside was in fact Qin. Qin briefly chastised the Mandalorian for abandoning him, before Burg shoved Djarin into the cell and Mayfeld closed the prison's door and trapped the Mandalorian, followed by the group abandoning him."}, {"tag": "h4", "text": "Taking down mercenaries"}, {"tag": "p", "text": "While trapped in the cell, Djarin captured a patrolling security droid using his whipcord, tearing off its arm with the blaster and using it to destroy the droid. He then used the scomp link built in to the arm to open the cell door, and returned to the control room. Djarin began locking several blast doors in the prison ship, splitting up the mercenaries who had trapped him earlier, and acquired the homing beacon that Davan had activated."}, {"tag": "p", "text": "The Mandalorian soon ambushed Burg from above, who had entered the control room. Using his whipcord, he attempted to strangle the Devaronian, but Burg pulled the cord and Djarin down with it. The two then engaged in a scuffle, with Djarin attempting to use his arsenal, but failed to hit Burg however. He then attempted to use Burg's blasters against him, but was instead tossed around the control room. After Djarin managed to throw Burg into the control room's doors, he shut one of the doors on him. When Burg lifted the door using his strength, Djarin shut the other door, incapacitating the Devaronian and severing his horns."}, {"tag": "p", "text": "Djarin soon left the control room and came across Xi'an. The Twi'lek attempted to use her throwing knives to halt Djarin, but the Mandalorian was unscathed thanks to his beskar armor and defeated Xi'an. Afterwards, he snuck up behind Mayfeld in a corridor and immobilized him. After dealing with the three mercenaries, Djarin locked them up in one of the ship's prison cells. Upon encountering Qin, who was about to enter the Razor Crest, Djarin held Qin at gunpoint, who offered the Mandalorian a larger reward than what Malk offered. Djarin was then reminded by Qin of his code of honor before he captured the Twi'lek."}, {"tag": "p", "text": "Aboard the Razor Crest, the Mandalorian destroyed Zero, who was about to shoot Grogu. He then departed the prison ship and returned to Malk's station with Qin in tow. Unbeknownst to the Twi'lek, Djarin planted the homing beacon on Qin before reaching the station. Upon meeting Ranzar to drop Qin off, the criminal asked where the other crew members were, to which the Djarin responded that no questions were to be asked. After being paid, Djarin left the station, while a trio of New Republic pilots flying X-wings, summoned by the beacon, arrived and attacked Ranzar's station. They destroyed the gunship that Malk attempted to use to shoot down Djarin's ship. While in hyperspace, Djarin detached the knob from one of the ship's levers and gave it to the Child as a toy, before telling the infant that taking on the job was a \"bad idea.\""}, {"tag": "h3", "text": "Liberation of Nevarro"}, {"tag": "h4", "text": "Recruiting old friends"}, {"tag": "p", "text": "While in space, Djarin was contacted by Karga, who wanted his help in taking out the Client and his troops. Karga revealed that Imperial presence in Nevarro increased after Djarin rescued Grogu, and they forced the city's residents out. The Guild agent proposed an alliance with Djarin and eliminate the Client, using Grogu as bait. In exchange, Karga offered to drop Grogu's bounty and clear Djarin's notoriety with the Guild. Hearing this, the Mandalorian decided to accept Karga's offer. However, he also decided to recruit Cara Dune and Kuiil to assist on his mission."}, {"tag": "p", "text": "He first made his way to Sorgan to meet Dune, and found her in the common house where they had encountered each other for the first time. Djarin explained the mission, but Dune initially refused, stating that she would be incarcerated if she was caught by New Republic authorities. He piqued Dune's interest upon revealing that their target was an Imperial. While aboard the Razor Crest, they made their way to the ship's lower deck, where Djarin opened the weapons cabinet and allowed the former shock trooper to equip herself while they discussed Karga's trustworthiness and Djarin's concerns for the Child's safety from bounty hunters. Suddenly, the Crest rocked side to side as Grogu attempted to pilot it, but Djarin rushed back to the cockpit and regained control of the ship. Realizing they required someone to supervise the infant, the two decided to travel to Arvala-7 and recruit Kuiil."}, {"tag": "p", "text": "The Mandalorian landed the Razor Crest in the Ugnaught's farm, and the two sat down in his hut, accompanied by Grogu. While in Kuiil's hut, IG-11, who had been rebuilt by Kuiil, entered the hut carrying a tray of tea, causing Dune and Djarin to draw their blasters at the droid. Kuiil then explained that he had retrieved IG-11's body from the compound where he had been destroyed and reprogrammed him to assist the Ugnaught at his farm, and added that it would also serve to protect should the need arise. At the farm's blurrg pen, Djarin offered to hire Kuiil to protect Grogu. When the Ugnaught suggested that IG-11 take on the duty instead, Djarin voiced his hesitation in allowing IG-11 to accompany them to Nevarro, but conceded after Kuiil stated that trusting him meant trusting his work, and therefore trusting in IG-11. Before leaving, Kuiil also stated that the blurrgs would also be joining him aboard the Razor Crest."}, {"tag": "h4", "text": "Return to Nevarro"}, {"tag": "p", "text": "En route to Nevarro aboard the Razor Crest, Djarin and Dune participated in a friendly match of arm-wrestling in the ship's lower deck before Dune was choked by Grogu, as the infant saw the match as a threat to Djarin's life. The Mandalorian quickly stopped the infant and told him that Dune was a friend. Kuiil, who watched the situation unfold, informed Djarin that the story of his encounter with the mudhorn made much more sense after seeing Grogu use his powers, revealing that he had heard rumors about them before. Following an argument between Kuiil and Dune regarding the Ugnaught's service with the Empire, Djarin asked him to construct a new hover-pram for Grogu."}, {"tag": "p", "text": "Djarin and Dune made their way to the cockpit afterwards and the two discussed their mission, with the former rebel stating that there was more to the Imperials bolstering their presence on Nevarro. IG-11 then entered the cockpit and offered the two a meal, which Djarin plainly declined. After IG-11 left, they discussed the potential danger of having the droid accompany them on the mission, with the Mandalorian being insistent on leaving IG-11 on the ship."}, {"tag": "h4", "text": "Meeting Karga again"}, {"tag": "p", "text": "The group eventually arrived on Nevarro, where they met up with Karga and his three aides while riding the three blurrgs they had taken to the planet. When Karga recommended that Dune stay aboard the Crest, Djarin stated she was coming with the rest of the group. Karga then asked to see the bounty that the Imperials were chasing in the flesh, and Djarin silently obliged by moving the pram towards Karga. As the Guild agent picked up Grogu to inspect him, Djarin kept his hand on his blaster, cautious of Karga's actions. Afterwards, the group made their way across Nevarro's lava fields, and set up camp at the riverbank at nightfall.\nWhile residing at the camp, Djarin and Karga discussed their plan to eliminate the Client. The group suddenly came under an attack by multiple native reptavians, where one of Karga's aides was captured and taken away. During the ambush, Djarin was pinned down to the ground by one of them, but was scared off after he used his flamethrower. After successfully driving off the creatures, the group surrounded Karga, who received a fatal injury during the attack, and watched as Grogu healed Karga's wounds. At sunrise, the group proceeded to make their way to the city."}, {"tag": "p", "text": "At a cliffside, Djarin and Dune were spared by Karga after he killed his two remaining aides, having changed his original plans to kill the Mandalorian and his allies due to Grogu saving his life. Djarin and Dune trained their blasters at the Guild agent, but the Mandalorian listened to Karga's reasoning and formed a new plan."}, {"tag": "p", "text": "The plan was to have Djarin turn himself in in order to get him close to the Client and kill him, while Dune served as the captor. He also told Kuiil to take Grogu back to the Razor Crest and seal themselves inside the ship in order to protect the infant. With the plan in motion, Djarin allowed Karga to cuff him and the trio made their way to the city, keeping a comlink on him in order to keep in touch with the Ugnaught."}, {"tag": "h4", "text": "Entering the city"}, {"tag": "p", "text": "The Mandalorian accompanied Dune and Karga to the city with the Child's empty pram into town to meet with the Client and his forces. At the city's entrance, they encountered two scout troopers, one of whom demanded Karga's chain code. When the trooper offered to purchase Djarin's helmet, Karga refused and stated he would hang it on his wall. When Djarin questioned the statement, Karga told him to play along. Once inside the cantina, they met the Client, who asked Djarin why the people of Mandalore resisted the Empire's expansion into their homeworld as they sat at a table, as well as how systems benefitted from Imperial rule. The Client then excused himself as he proceeded to take a call on his holoprojector."}, {"tag": "p", "text": "While this happened, Djarin freed himself from his binders and was given his blaster. However, the Client's superior had his death troopers fire at the cantina and kill the client. The Mandalorian and his compatriots quickly took cover behind a table. When the firing stopped, the group proceeded to take cover behind the cantina's pillars, and looked outside to see that they were surrounded by the death troopers reinforced by an entire company of stormtroopers. The group then saw an Outland TIE fighter land outside with its pilot, Moff Gideon, exiting the ship. As the situation unfolded, Djarin hailed Kuiil on the comlink and told him to get to the ship as fast as possible. He continued his attempts to contact the Ugnaught, but did not receive a response. Unbeknownst to the Mandalorian, Kuiil was unable to reach the ship in time as he was gunned down by the two scout troopers they had encountered earlier, and they had kidnapped Grogu in order to take him back to the city to Gideon."}, {"tag": "h4", "text": "Pinned down"}, {"tag": "p", "text": "Trapped in the cantina, Djarin, Karga, and Dune discussed their escape route, until Djarin pointed out that the sewers underneath would lead to the Tribe's covert, and the Mandalorians there could help them escape. Using his visor, he discovered a vent which could be cut open to enter the sewers. As Gideon's troops began constructing an E-Web heavy repeating blaster, Dune and Djarin attempted to open the vent to no avail. Gideon utilized the situation to negotiate with the group, revealing the Mandalorian's real name to everyone else, and gave the trio until nightfall to surrender before leaving."}, {"tag": "p", "text": "It was because of this that Djarin was able to recognize Gideon and reveal the Moff's identity to Dune and Karga, while also explaining that no one had used the Mandalorian's name since childhood. Explaining the culture of the Mandalorian people, he revealed his own past to them, and added that he knew Gideon as an Imperial Security Bureau officer during the Great Purge. Djarin also deduced that Grogu was still safe as Gideon wanted the trio alive. When Djarin attempted to hail Kuiil again, the comlink was silent until IG-11 responded, revealing to the group that Kuiil had been killed. Soon afterward, IG-11 arrived at outside cantina aboard a speeder bike with Grogu, and began attacking Gideon's forces."}, {"tag": "p", "text": "Djarin then ordered Dune to provide covering fire, while he and Karga exited the cantina to combat the Imperials. During the fight, the Mandalorian was temporarily incapacitated by two death troopers, until Karga shot them. Seeing IG-11 being overwhelmed by laser fire, Djarin quickly detached the E-Web's cannon and fired at the troopers. However, Gideon returned to the area and shot the E-Web's power supply, knocking Djarin back and injuring him. Dune then carried Djarin while the group retreated to the cantina."}, {"tag": "h4", "text": "Escaping into the sewers"}, {"tag": "p", "text": "While on his back, Djarin instructed Dune to leave him and escape to protect Grogu, much to her protest. He gave her a necklace of a Mythosaur skull that he possessed, telling her to show it to the Tribe in order to have them assist Dune and the others. Djarin then helplessly watched as Grogu later used the Force to reflect the fire created by an Incinerator trooper. When IG-11 managed to remove the grating on the sewer access pipeline, Djarin remained behind, wishing to buy the group time to escape."}, {"tag": "p", "text": "While Dune and Karga escaped to the sewers with Grogu, IG-11 remained behind to tend to Djarin's wounds. The Mandalorian scoffed at the droid, asking him to end his life despite the droid insisting he was reprogrammed to nurse and protect. IG-11 attempted to remove his helmet, which Djarin initially met with hostility. Djarin stated that he could not reveal his face to any living being as part of the Mandalorian Creed. However, due to a loophole identifying IG-11 as lifeless, Djarin allowed IG-11 to remove his helmet and heal him with a bacta spray."}, {"tag": "p", "text": "Djarin and IG-11 later reached the group in the sewers. As they made their way through the tunnels, they reached the covert, where the group discovered a pile of armor removed from deceased members of the Tribe. Initially blaming Karga for the Tribe's genocide, Djarin was informed by the Armorer, who survived the massacre, that Karga was not responsible, with Gideon's forces being responsible. When he asked the Armorer to join them in their escape, she refused, stating she was salvaging the armor left behind in the attack and would not leave the covert."}, {"tag": "p", "text": "When the Armorer was shown Grogu, Djarin explained that the infant was responsible for saving him from the mudhorn at Arvala-7, and that he protected Grogu from harm since. The Mandalorian was then informed by the Armorer that he was tasked with taking care of Grogu in accordance with the Creed, and that Grogu was to be reunited with its own species. Djarin was gifted a mudhorn's signet by the Armorer, who declared the creation of his clan, which consisted of Djarin and Grogu."}, {"tag": "h4", "text": "Confronting Gideon"}, {"tag": "p", "text": "The group then escaped to underground lava river, where Karga and Djarin attempted to push a boat into the stream as it was covered in rocks, which attached it to the ground. Thanks to Dune shooting the rocks and setting the boat free, the group boarded it, unintentionally activating the resident droid to ferry them out. Through his visor, Djarin identified the heat signatures of a group of stormtroopers waiting to ambush the group at the mouth of the tunnel, and he began to create a plan of escape alongside the others. IG-11 announced his intent to sacrifice himself and ensure Grogu's survival, as the droid saw no scenario where he and Grogu would both survive together. Djarin insisted that he stay and help them fight, as the Mandalorian had come to accept the droid as an ally, but conceded."}, {"tag": "p", "text": "Djarin and the group then watched as IG-11 entered the lava river, forcibly crossing it to reach the Imperials at the end of the tunnel. When IG-11 reached the Imperials, the droid activated his self-destruct sequencing to kill them all. Outside the tunnel, the group came under fire from Gideon's TIE fighter. While the Moff circled around for another volley, Djarin equipped his jetpack and immediately flew upwards and used his whipcord to pull himself towards the fighter. Struggling to hold on to the TIE, Djarin successfully placed two detonators on the TIE, which damaged the ship's wing and caused it to crash into the landscape."}, {"tag": "p", "text": "Believing Gideon to be dead, Djarin returned to the group, and declined an offer from Karga to rejoin the Guild, believing his duty lay in caring for Grogu. With the infant in hand, Djarin activated his jetpack and reached his ship. He buried Kuiil before entering the Razor Crest. While activating his ship, he discovered the infant possessed the Mythosaur necklace he had given to Dune earlier. Deciding to leave the necklace in Grogu's possession, Djarin took off and departed Nevarro to begin his mission in reuniting Grogu with his kind, the two no longer wanted by the Guild."}, {"tag": "h3", "text": "In search of a Jedi"}, {"tag": "h4", "text": "Mission to Tatooine"}, {"tag": "p", "text": "At some point after departing from Nevarro, Djarin met with Gor Koresh in an attempt to learn the location of other Mandalorians, believing that they could assist him in returning Grogu to his people. Keresh initially offered Djarin the information in exchange for a bet—if his Gamorrean fighter won the match, he would give the information, whereas if he lost, Djarin would hand over his armor. Djarin refused, prompting Keresh to instead have his grunts attack him. Djarin made quick work of them, and chased Keresh down, stringing him up on a street light. Djarin promised not to let Koresh die by his own hand, for which Keresh informed the hunter that he had been told about someone wearing Mandalorian armor on Tatooine."}, {"tag": "p", "text": "Djarin then departed with the Child for Tatooine, leaving Keresh for dead, albeit still not by his own hand. Djarin arrived on Tatooine, landing once again in Hangar 3-5 and this time allowing Peli Motto's pit droids to repair the Razor Crest. Motto had the astromech droid R5-D4 direct Djarin to Mos Pelgo, where he believed the man with Mandalorian armor to be located. Djarin then departed on Motto's speeder for Mos Pelgo, stopping at a Tusken encampment for the night."}, {"tag": "p", "text": "Upon his arrival in the remote town, Djarin drew stares from many of the citizens, before himself entering the town's tavern. He told the Weequay who was operating the bar that he was visiting to meet the man who looked like him. When the bartender asked if he meant \"The Marshal,\" Djarin was confused until Cobb Vanth promptly entered the tavern, wearing Mandalorian armor. Vanth offered Djarin a drink, taking a seat and removing his helmet, much to Djarin's surprise. Upon the revelation that Vanth was not a Mandalorian, Djarin immediately demanded that Vanth hand the armor over. Vanth refused, and the two prepared to duel each other before a sudden tremor shook the town."}, {"tag": "h4", "text": "Allying with the Marshal"}, {"tag": "p", "text": "This mysterious earthquake had been caused by a greater krayt dragon, which had been terrorizing the town and eating their livestock. Vanth and Djarin decided to make a deal: if they could eliminate the devastating reptile, Vanth would give Djarin his armor. Djarin accepted, and both of them embarked on a mission towards the krayt dragon's lair. They came across Tusken Raiders, who also sought to take down the dragon. The groups allied, but after an unsuccessful attempt, Djarin volunteered the inhabitants of Mos Pelgo to join forces with them."}, {"tag": "p", "text": "Back at the village, the civilians were not at all happy to be working with the Tuskens, whom they regarded as monsters, but Djarin told them that they had agreed to stop attacking the village if they worked together to kill the krayt dragon. The citizens agreed to Djarin's terms and together, the group traveled back to the lair to take down the beast. After numerous losses and hard work, they succeeded in destroying the krayt dragon once and for all. Being a man of his word, Cobb Vanth turned over his armor to Djarin, who told Vanth that he hoped he would see him again. However, as Djarin rode back to his ship, he was not aware that he was being watched by Boba Fett."}, {"tag": "h4", "text": "Mission to Trask"}, {"tag": "p", "text": "On his way back to Mos Eisley, Djarin was ambushed by a group of bounty hunters in pursuit of Grogu. After a brief skirmish, Djarin managed to defeat the hunters. Finally arriving back in Mos Eisley on foot, Djarin walked into Chalmun's Spaceport Cantina. There, he encountered Motto and \"Doctor Mandible\" in the middle of a sabacc game. When Motto inquired if he had killed the Mandalorian he had met, Djarin said he merely acquired his armor. Djarin then forked over 500 credits to Dr. Mandible for information on another group of Mandalorians. Djarin would converse with Motto in the hangar soon after, where Motto said that he could find the Mandalorians with the help of the individual \"Frog Lady,\" whose husband knew where a group of them lived."}, {"tag": "p", "text": "Frog Lady would help him in exchange of passage to the estuary moon of Trask. Djarin agreed until Motto informed him that he had to travel sublight, meaning without using hyperspace. Djarin angrily replied that the deal was off, as traveling quickly was the only thing keeping him safe. However, he eventually relented and plotted the course for Trask with Frog Lady sitting next to him in the Razor Crest. Midway in deep space, Djarin encountered two New Republic X-wing pilots, Trapper Wolf and Carson Teva, informing him that his ship was involved in a prisoner breakout and that he needed to hand in his transponder. In order to get away from this arrest, Djarin blasted off towards an ice planet ahead of them, pursued closely by the X-wings. He eventually succeeded in escaping out of their sight, after crashing into an ice cave. The Razor Crest was left badly fragmented, and its passengers were shaken."}, {"tag": "p", "text": "After regaining consciousness, the Mandalorian raced into the heart of the ship to check how much damage the Crest took, and ensured the Frog Lady's eggs were safe. He found Grogu consuming the unfertilized eggs, and placed the infant in the compartment. Djarin went on to fix his ship while also observing the surroundings. He later took Grogu and marched into the cold caves, only to find the Frog Lady taking a hot bath in a natural spring with her eggs. The place was surrounded by small white eggs, intriguing him. Once again, he thought with his stomach and ate one of them. However, this action awakened a horde of knobby white ice spiders, and the three quickly escaped the area, taking down several of them along the way."}, {"tag": "p", "text": "After getting back to the Razor Crest, Djarin attempted to flee the planet, only to be stopped by one of the creatures. Fortunately the New Republic pilots found the Crest's whereabouts and killed all the spiders. After a quick discussion between them and the Mandalorian, they decided to let Djarin walk as he helped them prevent a prison break and saved Davan. The pilots then blasted away from the cave. Djarin finally escaped as well, eventually reaching Trask in a severely damaged Razor Crest."}, {"tag": "h4", "text": "Arrival at Trask"}, {"tag": "p", "text": "As Djarin approached Trask to make his landing, he realized that the Crest's landing array wasn't responding, forcing him to make a risky manual land. With the Frog Lady holding the ship steady, the Crest entered the atmosphere at a dangerously fast speed, burning up as it descended. They managed to safely reduce speed and arrive at the landing pad, but lost power in one of the engines, toppling over into the sea. The Razor Crest was towed out of the water onto a landing pad where Djarin paid a Mon Calamari dock worker one-thousand credits to fix up the Crest enough to be able to fly again. After being directed by Frog Man, Frog Lady's reunited husband, where he could go to find other Mandalorians, Djarin went to an inn, looking to find information and food for the Child."}, {"tag": "p", "text": "A Quarren sailor informed Djarin that he could find other Mandalorians on a nearby island, and that his crew could take him and Grogu on their trawler. However, Djarin soon discovered that he had been tricked by the aquatic species, who tried to feed the two of them to their Mamacore and steal his beskar armor. Fortunately, three Mandalorians arrived on time and rescued the infant and Djarin, eliminating the traitors in the process. The leader of this small crew was revealed to be Bo-Katan Kryze, rightful heir to the throne of Mandalore. The two other fighters on her side were Axe Woves and Koska Reeves. Djarin was offended as they took off their helmets, declaring they weren't real Mandalorians."}, {"tag": "p", "text": "First surprised by his reaction, Bo-Katan assured him of her heritage, then deduced and revealed to Djarin that he was a Child of the Watch, a cult of religious zealots, according to her, that followed the Way of the Mandalore, which had fallen out of the mainstream Mandalorian society. Djarin, confused by what he had learned, angrily declined their aid, as he did not trust them and thought those who did not follow the Mandalorian Code were not Mandalorians at all. He took off with the Child and returned to shore, leaving the three warriors behind. However, later that night, they arrived again to save him from another group of angry Quarren."}, {"tag": "p", "text": "Djarin then decided to accompany Kryze and her associates to the inn to speak with them. The Mandalorian informed the group that his mission was to deliver Grogu back to his kind with the help of the Jedi. Bo-Katan decided to make a deal: if Djarin helped them take down an Imperial frigate, she would guide him to the way of whom he searched for. The assignment was to steal weapons shipments from an Imperial Gozanti-class cruiser. Djarin agreed, and asked for the Frog Lady and her husband to keep the infant during the mission."}, {"tag": "p", "text": "The four of them swiftly infiltrated the cruiser, much to the Imperial officer's displeasure. Kryze communicated with him on the bridge, stating they were here to hijack the ship. Djarin complained about the deal's change, but Kryze reminded him that if he wanted the information about the Jedi, he had to help them take over the cruiser. The officer received a holographic transmission of Moff Gideon, ordering him to plunge the ship into the ocean to eliminate the Mandalorians. The captain accepted the order, killed the Imperial pilots and led the cruiser directly towards the water."}, {"tag": "p", "text": "After taking down several stormtroopers, the Mandalorian crew made their way into the bridge. They changed the ship's trajectory seconds before crashing, and Kryze demanded the officer tell her the location of Gideon and the Darksaber. The Imperial henchman electrocuted himself before revealing anything, leaving Kryze clueless about the saber's whereabouts. Nevertheless, they successfully took over the cruiser, and Djarin asked for information on the Jedi. Bo-Katan told him to fly to the city of Calodan on the forest planet of Corvus, and to search for Ahsoka Tano. Djarin thanked Kryze and got off the cruiser. He went to the Frog Lady's house to retrieve Grogu and they both left the ocean moon with a semi-repaired Razor Crest."}, {"tag": "h4", "text": "Return to Nevarro"}, {"tag": "p", "text": "After trying and failing to fix the Crest with help from Grogu, Djarin decided they needed to fully repair the ship for their journey to Corvus, and set a course for Nevarro. Upon arrival, Djarin and Grogu were greeted by Greef Karga and Cara Dune, who had since become the town's new marshal. Karga tasked two workers with fixing up the Crest and welcomed back Djarin and Grogu. After reluctantly allowing Karga to drop off Grogu at the former cantina, which was now a school, Djarin was led to a building where the Mythrol he had previously captured was waiting. After an awkward reunion, Karga explained the mission that he wanted Djarin to help them with, as he had time to spare until his ship was fixed. Showing him a map of the planet, Karga said that they must take out the last Imperial base threatening the city."}, {"tag": "h4", "text": "Finding Ahsoka Tano"}, {"tag": "p", "text": "With repairs complete to the Razor Crest, Djarin traveled to Corvus to seek Ahsoka Tano. On the way, the Child used the Force to unscrew the ship's control knob, which Djarin took from him. Once landed, he made his way to the outer wall of Calodan and met the mercenary Lang, who asked if he was a hunter looking for work. Djarin nodded and was allowed to entered the city, but once inside, he was shunned by the villagers, who fled from him when he tried to gather information, save for one who asked him not to talk to them. Djarin was then escorted by some guards to meet Morgan Elsbeth, the magistrate of the town, who told Djarin that she would give him her beskar spear if he killed the Jedi."}, {"tag": "p", "text": "While searching in the woods, Tano suprised Djarin, taking multiple swings with her sabers, which he managed to block with his beskar armor. He then used his flamethrower to make her retreat, then using his whipcord thrower to tie her up. Tano then jumped over  a branch, causing Djarin detach his whipcord, but before the fight can continue, Djarin informed Tano that Bo-Katan sent him, and she noticed the Child behind him and stood down. She then read the thoughts of the Child, sharing his origins as a Jedi youngling who survived The Purge as well as his name: Grogu. She explained that the Jedi Master Yoda was the only other member of his species she knew of, and that the Force was the energy that produced Grogu's powers. Djarin then asked Tano if she could help Grogu."}, {"tag": "p", "text": "The next morning, Tano attempted to have Grogu move a pebble with the Force, but he refused. Noticing his connection with Din, she had him coach Grogu into taking the stone, again failing. Djarin then pulled out the control knob and offered it to him, and Grogu took it from his hand, much to his delight. Tano, however, recognized the fear and attachment to Djarin in Grogu, and refused to train him, citing what those feelings can do to \"The best of us.\" Before she left, Djarin told her he was sent to kill her, and offered instead to take down the magistrate in exchange for the child's training. He then detailed the caged prisoners and military strength of Calodan and was surprised to learn that Elsbeth was a survivor of the Clone Wars, which had turned her into a plunderer for the Empire."}, {"tag": "p", "text": "As Tano attacked the settlement from the front, drawing the magistrate's attention by throwing down Djarin's pauldron to imply that she defeated him, Djarin dropped in from above to handle the guards ordered to kill the citizens, escorting the people to safety. Lang then approached him, learning of their team-up and expressing his amusement. Djarin and Lang entered a standoff. As Lang attempted to close the distance while talking to Djarin, he stopped and agreed to lower his weapon after seeing Tano enter the magistrate's residence. However, as he was putting down his heavy blaster, Lang drew another blaster to kill Djarin, but the Mandalorian fired first and killed him, and soon after eliminated an HK-87 assassin droid on a rooftop attempting a sneak attack."}, {"tag": "p", "text": "While the village celebrated their freedom at Elsbeth's defeat, Tano offered Djarin Elsbeth's spear, believing it belonged with a Mandalorian. Djarin woke Grogu and spent what he believed were their last moments together. Tano arrived at the Razor Crest, noting their paternal bond and standing by her refusal to train him. She then sent him to Tython, telling him to place Grogu on the seeing stone and wait for a Jedi to come if he indeed chose that path."}, {"tag": "h4", "text": "Tragedy on Tython"}, {"tag": "p", "text": "While en route to Tython, Djarin attempted to convince Grogu to practice taking the knob from his hand using his Force abilities, still astounded by his powers. He then reiterated that the \"nice lady\" claimed this planet could be where the duo could locate a Jedi who would be able to further train the young Grogu. Seeing the temple remains, Djarin landed the Razor Crest on a nearby plain, utilizing his jetpack with Grogu in hand."}, {"tag": "p", "text": "Djarin placed Grogu on the seeing stone, scanning it for any machinery. He was startled to see another ship, Slave I, come in for a landing and tried to retrieve Grogu, but he was repelled by the seeing stone's aura. Djarin rushed to meet the potential danger to buy Grogu some time to finish his task and encountered Boba Fett, who had been tracking him since he acquired his armor from Vanth. The bounty hunter asked that his armor to be returned to him. Djarin was skeptical of his claim to it, and asked as to why he shouldn't simply gun down the mysterious hunter. Fett answered by showing his sniper, Fennec Shand, who Djarin had gone after on Tatooine, aiming at Grogu. To avoid a needless fight, Boba ordered Shand to stand down and, after Djarin hesitantly took off his jetpack and set down his own rifle, began to talk peacefully. Shand explained that Fett saved her from certain death, showing the cybernetics in her torso, and she now was in his service. Fett again stated his claim on his father's armor, saying that if it was returned to him, he would ensure Grogu's safety."}, {"tag": "p", "text": "The negotiations were interrupted by the landing of an Imperial ship that deployed a force of stormtroopers. Djarin once again tried to retrieve Grogu, but was knocked out by the seeing stone's field, trying a third time after recovering before deciding to work to protect him from the invading party instead. He supported Shand with a hail of whistling birds and shielded her from blasts with his armor. Once backed into a corner, Fett used a thermal detonator to defeat multiple troopers, now donning his beskar armor which he had retrieved from the Razor Crest. Utilizing its full arsenal, including wrist blasters, knee rockets, and jetpack-mounted missile, the veteran Fett quickly eradicated the remaining stormtroopers, as well as destroying the two Imperial troop dropships which had deployed them as the retreating troops left the surface."}, {"tag": "p", "text": "Suddenly, a turbolaser from a ship in orbit struck the Razor Crest, completely destroying the ship. Four dark troopers then left from the assailing vessel, abducting an exhausted Grogu before Djarin and Shand could reach him. Fett pursued the troopers in Slave I, but Djarin told Shand to use her comlink to tell him not to attack them as to not risk Grogu's safety. He still followed the troopers, recognizing the vessel harboring them as Imperial design before returning to Tython's surface."}, {"tag": "p", "text": "Djarin then scavenged the wreckage of his ship, finding the beskar staff and control knob intact. Fett then showed his armor's chain code to validate his claim as a Mandalorian and son of a Mandalorian Civil War veteran. Standing by his word about Grogu's safety, he offered his help to Djarin to reclaim him. The group traveled to Nevarro, where Djarin met with Cara Dune. He then asked for information on Migs Mayfeld, hoping to break him out to get information on Gideon's vessel. Dune, while hesitant at first, agreed upon learning of Grogu's fate."}, {"tag": "h4", "text": "Mission to Morak"}, {"tag": "p", "text": "With the help of Dune, Djarin located Mayfeld and traveled to the Karthon Chop Fields in Slave I. After Dune, bending New Republic regulations, had custody of Mayfeld transferred to her, the pair returned to the ship. Mayfeld was visibly bothered when Djarin appeared and reluctantly ascended the boarding ramp. On board, Djarin told Mayfeld to help them locate Gideon's cruiser, saying that an ex-Imperial should remember their codes. Mayfeld was initially hesitant to assist, expressing how he'd rather continue to work in the fields than go against Moff Gideon. However, after being told of Grogu's involvement by Dune and offered \"a better view,\" he told them that he would need to access an Imperial terminal and that he knew of one on Morak. Djarin was certain that there was nothing on Morak, let alone an Imperial installation, but Mayfeld assured him he knew of a secret rhydonium refinery on the planet."}, {"tag": "p", "text": "After landing on the planet, the group made a plan to get the information. Mayfeld explained the danger of detection when infiltrating if any of their faces show up on ISB databases. Dune, Shand, and Fett all explained how they would register on their bio-scanner because they were all wanted, so Djarin volunteered to go with Mayfeld. Djarin, Mayfeld, and Dune ambushed an Imperial Combat Assault Transport, taking the armor of neutralized Juggernaut Pilots as both a means of disguise. Djarin reluctantly changed out of his armor and handed a bag containing it to Dune for safekeeping. Dune left to meet up with Shand to support and recon on a vantage point near the refinery as Djarin and Mayfeld headed there with the juggernaut."}, {"tag": "p", "text": "On the way, Mayfeld attempted to make small talk while taking off his helmet, but grew nervous seeing the exploded wreckage of the other transports. He then waxed philosophical about the inconsequential nature of the little people during wars while passing though a village, turning specifically to the battles of Mandalorians, and seeming hypocrisy on the rules regarding his helmet. Djarin sat in silence while pondering his thoughts."}, {"tag": "p", "text": "Partway through their route, pirates attacked and destroyed two rhydonium transports before attacking the transport being operated by Djarin and Mayfeld. Djarin got on top of the vehicle to fend them off as they leaped off of their skiffs and planned to place detonators on the rhydonium canisters. He took out the first skiff with a pirate's own thermal detonator, and shot one more pirate from the next before his blaster failed. He engaged in melee combat with the rest, ordering Mayfeld to speed up until he slowed back down to keep the load stable. Djarin managed to fend off two more skiffs of pirates before they were saved by a pair of TIE fighters and the refinery's stormtrooper garrison. Once safely inside, they received a hero's welcome from the Imperials."}, {"tag": "p", "text": "Making their way to the mess hall, Mayfeld found the terminal inside but refused to go in and use it, as Valin Hess, his former commanding officer, was seated inside. Mayfeld called off the mission, telling Djarin that it required a face scan for access, so none of them could use it. However, Djarin decided to take the data stick and go in anyway, removing his helmet and letting the machine scan him. He quickly retrieved the information on Gideon's vessel, but was stopped by Hess, who asked for his designation. Djarin hesitated, but Mayfeld bailed him out by acting like he was hard of hearing after an incident on Taanab before claiming to have business to attend to. However, Hess called them back over for a drink to celebrate their being the only transport to successfully get their shipment in."}, {"tag": "p", "text": "Hess asked what to toast to, and Mayfeld proposed toasting to Operation: Cinder, a battle he took part in, mentioning the losses in the tens of thousands. When Hess glorified their sacrifice, Mayfeld reacted skeptically and cynically about the honor of their loss. Djarin sat nervously as he watched Mayfeld grow angrier with his former commander. Hess gloated at the New Republic's weakness and the Empire's returning strength, as well as how the refined rhydonium would create horrors surpassing Burnin Konn to establish order in the galaxy. As Hess toasted to the Empire, Mayfeld shot him dead."}, {"tag": "p", "text": "After a moment of shock from the mess hall's occupants, Djarin and Mayfeld were forced to open fire on the witnesses. Mayfeld returned Djarin's helmet, claiming to have never seen his face as Djarin donned it and took cover. They exited the mess hall though the window, fighting the now alerted military of the facility. Shand and Dune provided cover by sniping the pursuing forces. Fett then picked them up from Slave I, and Mayfeld took out the rhydonium transport with Fett's cycler rifle, destroying the refinery's landing platform. As they were pursed by TIE fighters, Fett destroyed them with a seismic charge before meeting up with Dune and Fennec."}, {"tag": "p", "text": "Mayfeld wished Djarin good luck on getting Grogu back, and complied with Dune to be returned to prison. Impressed with his shooting and behavior, she instead claimed that he died in the explosion, to which Djarin agreed and allowed Mayfeld to walk away free. After leaving Morak, Djarin sent a threatening message to Gideon, mirroring the same speech he gave on Nevarro and telling him that he was coming to reclaim Grogu."}, {"tag": "h4", "text": "Rescue of Grogu"}, {"tag": "p", "text": "After finding the coordinates of Gideon's light cruiser, Djarin and his allies tracked down Dr. Pershing. They tracked down his Lambda-class shuttle, leading to a chase through space, only for Boba Fett to disable the shuttle with Slave I's ion cannons. Once they boarded his shuttle, the co-pilot warned Djarin of Pershing's status. Djarin retorted that they had met, then asked Pershing if Grogu was still alive. Pershing confirmed as much, but the co-pilot grabbed him, holding a blaster to his head and shooting the pilot when he attempted to negotiate with Cara Dune for his freedom. The co-pilot explained to Dune and Djarin that Pershing was a top-tier New Republic target, a clone engineer, and if he died because of them, Dune would wish she never left Alderaan. He goaded her, saying he saw the destruction of her planet aboard the Death Star as \"a small price to pay to rid the galaxy of terrorism\". Having had enough, Dune shot the co-pilot in the face, narrowly missing Pershing and striking him in the ear."}, {"tag": "p", "text": "After securing Dr. Pershing, Djarin then traveled to recruit Bo-Katan, as she was interested in hunting Gideon too, in order to reclaim possession of the Darksaber. After a brief clash between Fett and Reeves, Kryze agreed to help them take Gideon's ship, as she wanted to retake the Darksaber from him, which she could then use to retake Mandalore, and asked Djarin to reconsider joining their efforts."}, {"tag": "p", "text": "On Slave I, Bo-Katan briefed the others on Gideon's cruiser, saying that at the height of the Empire, such a ship would have carried hundreds of troopers, but now only held a small fraction of that. Pershing noted, however, that Gideon carried a platoon of dark troopers aboard his vessel. Djarin asked how many troopers were housed in the suits, but Pershing explained that they were an all-droid third-generation model, housed in a cargo bay right next to the brig, where Grogu was being held."}, {"tag": "p", "text": "Bo-Katan outlined her plan to send a distress call from the shuttle and make an emergency landing in the cruiser's launch tube, blocking any potential interceptors. She, Reeves, and Fennec Shand would then attack the bridge, misdirecting Gideon's forces from Djarin, who would head for the brig to rescue Grogu. As both ships jumped into hyperspace, Bo-Katan demanded that Gideon surrender to her."}, {"tag": "p", "text": "Both starships dropped out of hyperspace near Gideon's cruiser, and Slave I fired on the shuttle to stage Kryze's request for emergency docking. The comms officer acknowledged the request, but ordered them to stay clear of the cruiser's launch tube while two TIE fighters launched from the cruiser. Kryze protested, saying that they must dock immediately. The hangar control officer aborted the launch procedure as the incoming shuttle crashed in the bay. Fett destroyed the two TIEs pursuing him and jumped away into hyperspace."}, {"tag": "p", "text": "The boarding party then killed the crewmembers in the bay before splitting up for their assigned tasks. As Djarin reached the dark troopers' cargo bay, the door opened as the droids completed their power-up sequence. He dashed forward, using Pershing's code cylinder to close the door, but one of the droids managed to get through. Despite the droid's resistance to most of Djarin's weapons, Djarin managed to destroy it with his beskar staff and depressurize the storage bay, sucking the remaining droids into space."}, {"tag": "p", "text": "Djarin reached Grogu's cell, dispatching the two troopers guarding it with the beskar staff and facing Gideon holding the Darksaber over the Child. Gideon ordered him to drop his blaster and explained that whoever held the Darksaber held the right to the Mandalorian throne. Djarin dismissed the history lesson and reaffirmed that he only came for the Child. Gideon conceded, saying all he wanted was to study the Child's blood and its potential to bring order back to the galaxy. However, he activated the Darksaber and attacked Djarin before he could reach Grogu. After a brief duel in the corridor, Djarin managed to disarm and capture Gideon for questioning from the New Republic."}, {"tag": "p", "text": "Djarin entered the bridge, holding the Darksaber and Grogu, and pushing a shackled Gideon to face Bo-Katan. Gideon laughed at his obliviousness to the fact that the Darksaber could only be taken by defeating the wielder in battle, much to Kryze's dismay. As Djarin had defeated Gideon, the Darksaber belonged to him, and he could neither give Kryze the Darksaber or yield to her, as its power was not in the weapon itself, but the story around it."}, {"tag": "p", "text": "An alarm sounded aboard the cruiser, and Shand reported that its ray shields had been breached by the dark troopers. Gideon then questioned Djarin's ability to fight the platoon, since he had trouble with just one droid. As the droids marched towards the bridge, Gideon covered a dropped blaster with his cape. Just then, another alarm sounded, and a lone X-wing fighter entered the hangar bay. Bo-Katan asked them to identify themselves, and Grogu sensed something through the Force. The dark troopers stopped their attack on the door and turned around. Bo-Katan watched on the monitor as a hooded figure disembarked from the X-wing and walked through the ship, destroying dark troopers with a green-bladed lightsaber. With his captors distracted, Gideon grabbed the blaster and shot at Bo-Katan, knocking her to the ground. Djarin leapt in front of Grogu, protecting him from the shots, and Dune disarmed Gideon, knocking him unconscious before he could kill himself."}, {"tag": "p", "text": "Grogu reached for the monitor, watching as the figure destroyed the last of the dark troopers outside the blast doors. Djarin opened the blast doors, asking if the man was a Jedi, which the man, Luke Skywalker confirmed. He held out his hand to Grogu, who turned to Djarin. Djarin believed Grogu didn't want to leave, but the Jedi revealed that he just wanted Djarin's permission. The Jedi pledged to give his life to protect Grogu, warning that talent without training was nothing, and he would not be safe until he mastered his abilities."}, {"tag": "p", "text": "Djarin picked up Grogu and told him to go with the Jedi, promising that they would meet again. Grogu reached for his helmet, which Djarin removed, showing his face to him for the first time. He told Grogu not to be afraid and placed him on the ground. The Jedi's astromech droid, R2-D2, entered, and Grogu walked towards the droid. The Jedi nodded and picked him up, then turned to walk away, as Djarin looked on with tears in his eyes."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Mysterious warrior"}, {"tag": "p", "text": "Din Djarin was a lone Mandalorian warrior whose past and identity were a mystery to others, and he remained battle-worn and laconic as a formidable bounty hunter in the galaxy. A human male, he had dark hair, brown eyes, and tan skin. When confronting the Mythrol, Djarin captured his target without hesitation and later froze the Mythrol upon seeing the target tinkering around in the Razor Crest. As a hunter, he was considered one of the best by Karga of the Bounty Hunters' Guild, with his skills making him the galaxy's best hunter during his era. Karga viewed Djarin as his \"most valuable partner\" following the Mandalorian's successful capture of the Child. However, Djarin never celebrated his success, choosing to continue on to the next job."}, {"tag": "p", "text": "Djarin also displayed a shy personality towards other individuals, such as Caben, Stoke, and people he had worked with before, like Xi'an and Malk. Djarin also rejected a life with the widowed Omera as he felt he did not belong at the village. During the standoff with Davan, Djarin was the only individual to holster his blaster, attempting to defuse the situation between the soldier and Mayfeld's team of mercenaries."}, {"tag": "p", "text": "On the contrary, Djarin was close to the Tribe, and had a special interest in the foundlings, as he had been one before. He ensured that they received any of his excess beskar. He took the Creed of his tribe to heart, following its traditions and ways to the letter, most notably his utter refusal of taking off his helmet in front of others regardless of the situation. However, Djarin came to care for Grogu so much that he broke this code once to get coordinates to Moff Gideon's Ship and have a chance to save the child. Djarin was glad to have become a Mandalorian, and was notably angered to see the discarded armor of his fellow Mandalorians, determined to stay behind at the sewers and fight the Imperials as revenge."}, {"tag": "h3", "text": "Caring for Grogu"}, {"tag": "p", "text": "Despite such a demeanor, he did not allow Grogu to be killed—even when the Client allowed his termination for a smaller reward—and instead destroyed IG-11 before the droid could eliminate Grogu. Throughout his time on Arvala-7, he protected Grogu from various threats, and strictly refused to sell him to a tribe of Jawas."}, {"tag": "p", "text": "When he finally delivered Grogu to the Client, Djarin felt remorse upon powering up the Razor Crest to depart Nevarro, and returned to the Imperial facility to rescue him, even going close to death in an encounter with the Bounty Guild by shielding the infant from laser fire. Later on, he showed his care for Grogu in searching for a place where they could happily reside away from bounty hunters, and was willing to leave Grogu behind in a remote village on Sorgan for the infant's sake."}, {"tag": "p", "text": "When dealing with Motto, Djarin specifically requested that her pit droids stay away from his ship, but later thanked the mechanic when he saw her taking care of Grogu. Upon being reminded of the Way of the Mandalore by the Armorer, which dictated that he had to be responsible for Grogu's welfare far more than just the infant's protection, he decided to search the galaxy for Grogu's species."}, {"tag": "p", "text": "A strong emotional bond existed between Djarin and Grogu, which Ahsoka Tano sensed through the Force. She described Djarin as a father figure to Grogu. Djarin went to great lengths to rescue Grogu after the Child was abducted by Moff Gideon, to the point of bending and breaking the rules of the Mandalorian creed that he was raised to uphold. Despite his objection to removing his helmet in public, Djarin did so before giving Grogu to Luke Skywalker, allowing the Child to see his face for the first time. Before parting ways, he promised that they would see each other again."}, {"tag": "h3", "text": "Attitude towards droids"}, {"tag": "p", "text": "Being a survivor of an attack on his home by battle droids during the Clone Wars, Djarin had a hatred of droids for most of his life, which he demonstrated at times such as when he rejected a brand new speeder driven by a droid for a human-operated one. He made this behavior clear to various individuals, such as a Kubaz ferryman, Peli Motto, and Cara Dune. He was also greatly distrustful of IG-11 despite his reprogramming, insisting on keeping the droid away from Grogu at all costs."}, {"tag": "p", "text": "After witnessing IG-11 protect the infant with his life, however, Djarin's outlook on him changed, and he allowed the droid to take off the Mandalorian's helmet and heal his head injury. He was saddened when IG-11 chose to sacrifice himself for Grogu's safety. Following these events, his dislike of droids in general lessened, so he allowed Motto's DUM-series pit droids to conduct repairs on the Razor Crest. Nevertheless, Motto ordered her droids to be careful, believing Djarin only barely trusted automatons."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Djarin was a warrior who initially wore a set of durasteel Mandalorian armor utilizing pieces made from beskar, which included a shoulder pauldron, helmet, and heartplate. The bounty hunter was able to begin replacing some of the damaged armor pieces with his payment of beskar from the Client; eventually, he achieved a full beskar body suit of a helmet, plated vest, two pauldrons (one bearing his signet, the mudhorn), two vambraces, two gauntlets, two greaves, and two boots. He also earned a jetpack made from beskar, which could be controlled remotely when he was not wearing it. Djarin's final suit also included non-beskar components, including bandoliers, a cape, and a belt with a pistol holster."}, {"tag": "p", "text": "The vambraces contained a Whipcord thrower in the right, a whistling bird launcher that could shoot twelve whistling birds in the left, and a flamethrower in each. He usually carried an IB-94 blaster pistol holstered in his belt, a vibro-knife sheathed in his boot, and an Amban phase-pulse blaster, which he carried ammunition for in one of his bandoliers. He also carried flash charges or thermal detonators."}, {"tag": "p", "text": "The Razor Crest had an arsenal of weapons, such as a Relby-v10 micro grenade launcher, an EE-3 carbine rifle, a DL-21 blaster pistol, and a drum blaster."}, {"tag": "p", "text": "His helmet was capable of tracking heat signatures, long-range audio, and could detect recent footprints left on the ground by using his left vambrace. While on Tatooine, Djarin made use of a Zephyr-J speeder bike that had previously belonged to Toro Calican."}, {"tag": "p", "text": "He also collected the weapons and armor of Mandalorian design, although he did not generally carry and use them: a vest, jetpack with single-shot missile launcher, and helmet with aiming device for the missile launcher collected on Tatooine, which was later recovered by Boba Fett on Tython and a beskar staff collected on Corvus. After defeating Moff Gideon in combat, Djarin acquired the Darksaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Din Djarin is the protagonist of the Star Wars television series The Mandalorian, created by Jon Favreau. The first picture of the Mandalorian warrior was revealed on October 4, 2018. On November 13, 2018, Pedro Pascal was reported to be in negotiations to play the lead role in the series, and on December 12, 2018, it was officially announced that Pascal would portray the titular character of the series."}, {"tag": "p", "text": "To prepare for the role, Pascal watched classic Clint Eastwood Westerns and Akira Kurosawa's Samurai films. In an interview with USA Today, he stated \"Any time I had a question or a physical doubt about a moment, I was always like, 'What would Clint do? How would he shrug this off? How would he walk away from this?\" While Pascal served as the voice of the titular character for the majority of the season, Brendan Wayne, Lateef Crowder, and Barry Lowin served as stunt doubles. Aidan Bertola portrayed the character in flashbacks. Stephen Jackson served as a stand-in in \"Chapter 5: The Gunslinger.\""}, {"tag": "p", "text": "The real name of the titular character was revealed by Pascal in an interview conducted by ScreenSlam released on the same day as Chapter 1 of the first season, with the website spelling the name as \"Dyn Jarren.\" He was finally named in the show in the eighth chapter of the first season, with the subtitles spelling \"Din Djarin.\""}, {"tag": "p", "text": "A Mandalorian helmet that heavily resembles the one worn by Djarin is in Dok-Ondar's Den of Antiquities in the Star Wars: Galaxy's Edge theme park. The helmet is hung next to an Amban phase-pulse blaster, the very same blaster model Djarin used. However, after a fan suggested a timeline as to how the Mandalorian's gear ended up at the Den of Antiquities, Matt Martin of the Lucasfilm Story Group stated he did not believe it was Djarin's helmet."}, {"tag": "p", "text": "On December 2, 2020, Djarin was added as a skin in Fortnite's fifth season of its second chapter, alongside cosmetics based on both Grogu and the Razor Crest. The skin features Djarin's beskar armor. Additionally, eliminating an NPC player of Djarin in-game rewards the player with Djarin's amban phase-pulse blaster, as well as his jetpack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}