{"url": "Din_Djarin%27s_blaster_pistol", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Blaster pistols", "Category:Personal weapons"], "nodes": [{"tag": "h1", "text": "Din Djarin's blaster pistol"}, {"tag": "p", "text": "The bounty hunter Din Djarin carried an IB-94 blaster pistol manufactured by BlasTech Industries with him during his bounty hunting career."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 9 ABY, Din Djarin used this blaster in various missions in the Outer Rim. While on the ice planet Maldo Kreis, he used the weapon while fending off a group of trawlers at a bar, shooting the controls to the door that trapped and sliced one of them in half."}, {"tag": "p", "text": "During his mission to retrieve Grogu on Arvala-7, he used the weapon in a shootout with Nikto mercenaries alongside fellow bounty hunter droid IG-11, and later shot the droid when he attempted to kill Grogu."}, {"tag": "p", "text": "Upon returning Grogu in an Imperial remnant facility on Nevarro, the Mandalorian had a change of heart and rescued Grogu from the facility, using the blaster to kill a number of stormtroopers in the process. He later used it against members of the Bounty Hunters' Guild, who had ambushed him as he attempted to escape the planet."}, {"tag": "p", "text": "While infiltrating a Klatooinian tribe's outpost with Carasynthia Dune on Sorgan, the Mandalorian used the blaster to create a makeshift exit within their camp as they escaped. After giving his Amban phase-pulse blaster to Dune, he used the blaster to fend off the Klatooinians while defending a human tribe's village."}, {"tag": "p", "text": "Upon arriving on Tatooine, he used the blaster to scare a group of pit droids when they attempted to repair his starship. He later used the weapon to kill his former partner Toro Calican after the latter had betrayed him following their previous mission."}, {"tag": "p", "text": "While working with a team of mercenaries to rescue a prisoner, the Mandalorian used the blaster to deal with a number of New Republic security droids on a New Republic Correctional Transport. After his team betrayed and tossed him into a prison, he attempted to fire the weapon at them, but the bolt bounced off the door and around the prison, hitting him instead. After the Mandalorian escaped, he used the weapon during a scuffle with Burg, failing to hit him as the Devaronian knocked his arm away. Din later used his pistol on Tython when he tried to protect Grogu."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The blaster pistol first appeared in Chapter 1 of the 2019 Disney+ television series The Mandalorian, which aired on November 12, 2019. Its design is based off the Bergmann 1894 No. 1 semi-automatic pistol, albeit with some modifications."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}