{"url": "Dine%C3%A9_Ellberger/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Females", "Category:Humans", "Category:Pilots", "Category:Royal Naboo Security Force officers", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Dineé Ellberger"}, {"tag": "p", "text": "Dineé Ellberger was a female Human living on the planet Naboo during the waning years of the Galactic Republic. She was a troubleshooter of computer systems for years, which gave her a substantial amount of technical experience. Later, she became a member of the Royal Naboo Security Forces, and served as an officer in the Naboo Royal Space Fighter Corps. During the time of the Trade Federation's invasion of her homeworld Naboo in 32 BBY, Ellberger held the rank of lieutenant and was part of Bravo Squadron as Bravo Five. She flew an N-1 starfighter called Bravo 5, which had excellent maneuvering capabilities."}, {"tag": "p", "text": "Ellberger accompanied the other pilots of Bravo Squadron when Bravo Leader Ric Olié called for all N-1 starfighters to attack the droid control ship that was controlling the Trade Federation's invasion army. During the assault, the weapons on the Naboo pilots' N-1 starfighters weapon systems could not penetrate the control ship's deflector shields, but a young boy named Anakin Skywalker flew an N-1 starfighter into the ship's hangar and fired proton torpedoes into the ship's reactor core. As Skywalker emerged from the ship, Ellberger noticed that the vessel was exploding from the inside. She informed Olié of the event, inducing the surviving pilots to celebrate their victory while they returned to the surface of Naboo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dineé Ellberger was a Human female who lived during the last years of the Galactic Republic. Her homeworld was the planet Naboo, and her first career was as a computer systems troubleshooter. Despite some unpleasant experiences during that period of her life, she gained a large amount of technical experience. Later Ellberger became a part of the Royal Naboo Security Forces as a pilot in the Naboo Royal Space Fighter Corps. By the year 32 BBY, she had enough piloting experience to fly one of the Royal Naboo's N-1 starfighters. That year, Ellberger served as a member of Bravo Squadron, also known as Bravo Flight, under the leadership of Bravo Leader Ric Olié. She flew in the squadron under the call sign Bravo Five and piloted a maneuverable N-1 starfighter of the same name. During her time with Bravo Squadron, Ellberger was an officer, holding the rank of lieutenant. Her fellow pilots did not discuss her unpleasant past."}, {"tag": "p", "text": "In 32 BBY, the galaxy-wide megacorporation known as the Trade Federation blockaded Naboo due to the Republic's taxation of various trade routes and the influence of Darth Sidious, a Dark Lord of the Sith. During the blockade, the Trade Federation dispatched their Droid Army to take control of the world. After Naboo's Queen Amidala returned from the galactic capital planet of Coruscant, where she had failed to receive aid from the Galactic Senate against the invasion, a plan was made to defeat the droid army. A key part of the strategy involved destroying the Trade Federation's droid control ship that was in space over the planet. When Ric Olié ordered Naboo's N-1 starfighters to converge on the control ship, Ellberger joined her fellow pilots as part of the attack force. As she and Bravo Squadron approached the control ship, a large number of droid starfighters poured out of it and attacked the Naboo pilots. During the ensuing battle, Ellberger used her technical knowledge to foresee and counteract the droid starfighters' tactics in order to aid the squadron."}, {"tag": "p", "text": "In the early stages of the attack on the droid control ship, Olié informed the squadron that the deflector shields on the Trade Federation vessel were too strong for their starfighter weapons to penetrate. Nevertheless, Rhys Dallows, who flew as Bravo Ten, destroyed the droid control ship's receiver dish stations needed to launch additional droid starfighters. Meanwhile, Ellberger helped protect him from the control ship's droid starfighters. Unbeknownst to Ellberger and the squadron, an N-1 starfighter flown by a boy named Anakin Skywalker entered the battle and flew into one of the control ship's hangars. Skywalker fired proton torpedoes into the ship's reactor core, which caused the ship to explode from the inside. Ellberger noticed these explosions and reported them to Olié as Skywalker flew his fighter out of the hangar. The Naboo pilots celebrated their victory, and the surviving members of the squadron flew back to Naboo while the droid control ship's destruction deactivated the droid army it controlled. With their army neutralized, the Trade Federation's occupation of Naboo was at an end."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ellberger was a skilled computer systems troubleshooter and pilot who had some experience by 32 BBY. When flying her N-1 starfighter, she was able use the ship's excellent maneuverability to stay a threat to a ship she was targeting. During the battle over Naboo, Ellberger's technical experience allowed her to help Bravo Squadron counteract the battle strategies of the droid starfighters. She had a sour past that her squadmates did not speak about. Ellberger had green eyes, fair skin, and brown hair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ellberger flew Bravo 5, an N-1 starfighter with good evasion capabilities as part of Bravo Squadron. Bravo 5's maneuverability aided Ellberger in tenaciously opposing her targets. She possessed a blaster pistol as her personal weapon. As a pilot in the Royal Naboo Space Fighter Corps, Ellberger wore the standard flight suit of the pilots in Bravo Squadron during the time of the Invasion of Naboo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dineé Ellberger was portrayed by British actress Celia Imrie in Star Wars: Episode I The Phantom Menace, a 1999 film written and directed by George Lucas. In the credits at the end of the film, Imrie is listed as playing the role of \"Fighter Pilot Bravo 5\" who was later named Ellberger. The uniforms created for the Naboo pilots, including Imrie's character, were originally conceived as sketches by artist Iain McCaig, who based them on World War I flying uniforms. Imrie originally auditioned for the role of Shmi Skywalker, but when Pernilla August was chosen for the role, Imrie received the role of Bravo 5 instead."}, {"tag": "p", "text": "In the novelization of The Phantom Menace, there was a female pilot who entered an N-1 starfighter that Anakin Skywalker was hiding behind while the Naboo pilots were boarding the fighters in Theed's hangar. The pilot told Skywalker that he would have to find a new hiding place before she flew her fighter away with the rest of the squadron. However, there was no official confirmation that the character was the same one as Ellberger. Also, in the novel, Ellberger's line about the droid control ship blowing up from the inside was spoken by Bravo Two. Her line about the droid control ship blowing up from the inside was featured in Star Wars: Episode I: Battle for Naboo, a 2000 video game released by LucasArts. In Star Wars: Starfighter, a 2001 video game by LucasArts, she was one of the pilots covering Rhys Dallows, who was controlled by the player, as Dallows attacked the receiver dish stations in a level involving the attack on the droid control ship. A possible line of dialogue from the game had a pilot say \"Bravo Five, you have one on your tail,\" indicating that Ellberger was one of the pilots present in that battle. Also in 2001, Ellberger first received her last name in Theed Palace Limited, the eleventh and final expansion set of the Star Wars Customizable Card Game released by Decipher, Inc. The image used on her card was a reversed version of a shot of her from The Phantom Menace. Ellberger had an entry in the official Databank on StarWars.com before it was taken off the site in 2011. In 2008, she was given an entry in the Del Rey's The Complete Star Wars Encyclopedia. In 2013, Ellberger received the first name of \"Dineé\" in Rogues Gallery: Naboo's Finest!, which was featured in Star Wars Insider 145."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}