{"url": "Dinger", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Dinger"}, {"tag": "p", "text": "Dinger was a male starfighter pilot who was serving in Rogue Squadron, a famed New Republic unit, as of 25 ABY. Assigned the callsign Rogue Eleven, Dinger flew under the command of Rogue Leader, Colonel Gavin Darklighter. In the early months of 25 ABY, Rogue Squadron was assigned to the New Republic First Fleet, led by Admiral Traest Kre'fey, and was tasked with investigating reports of an alien invasion in the Outer Rim Territories. During Rogue Squadron's first encounter with the threat, Dinger was killed, falling prey to the biotechnology of the alien Yuuzhan Vong."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dinger trained as a starfighter pilot in the New Republic Starfighter Corps and by 25 ABY had been inducted into Rogue Squadron, a starfighter unit famed for its role in the Galactic Civil War. Assigned the callsign Rogue Eleven, Dinger flew alongside Major Alinn Varth in the squadron's third flight group, although the unit itself was under the overall command of veteran pilot Colonel Gavin Darklighter."}, {"tag": "p", "text": "In 25 ABY, Dinger and his fellow Rogue Squadron pilots were assigned to the New Republic First Fleet. The fleet's admiral, Traest Kre'fey, wished to investigate rumors of an alien invasion that had purportedly occurred in the Outer Rim Territories and requested Darklighter's aid in responding to the threat. Rogue Squadron was stationed on Kre'fey's flagship, the Bothan Assault Cruiser Ralroost. Upon reports of pirate activity in an Outer Rim star system, Darklighter led the squadron out into space to reconnoiter the situation."}, {"tag": "p", "text": "Major Inyri Forge soon detected unknown signatures in the system's asteroid field, which were soon confirmed to be Uglies, starfighters cobbled together out of various parts. As Dinger and his fellow pilots engaged the Uglies, it soon became clear that the starfighters had already been heavily damaged in an engagement against an unknown foe. Darklighter made contact with a Nebulon-B escort frigate which served as the pirates' base of operations and successfully convinced the captain of the starship to order the pirates to stand down. The pirate captain later revealed that his forces had been attacked by unfamiliar starships, which Admiral Kre'fey concluded to have been the Yuuzhan Vong, members of the alien species that he was investigating."}, {"tag": "p", "text": "As Kre'fey set up a reconnaissance mission of the star system where the pirates claimed to have been ambushed, Dinger and his fellow pilots ran simulations of engagements with Yuuzhan Vong starfighters—termed coralskippers—in order to practice their skills against the hitherto unencountered opponent. With the admiral's first reconnaissance mission inconclusive, Colonel Darklighter led Dinger and the other pilots out to the star system alongside a T-65BR X-wing reconnaissance starfighter in order to take another set of readings. Upon emerging from hyperspace in the system, Dinger fell into position alongside Major Varth and provided cover for the reconnaissance starfighter."}, {"tag": "p", "text": "Soon, six coralskippers, as the organic Yuuzhan Vong starfighters had been termed, emerged from the system's asteroid field and engaged Rogue Squadron. Dinger and his fellow pilots were prepared to combat the organic and unfamiliar starfighters to some extent, due to the simulations they had flown. Nevertheless, as the Yuuzhan Vong coralskippers began deploying miniature black holes to strip the New Republic starfighters' shields and counteract laser blasts and proton torpedo strikes, the Rogue Squadron pilots had to field new tactics to overcome the biotechnology. While closing in upon an elite coralskipper pilot who was pursuing Colonel Darklighter, both Dinger and Rogue Twelve, Tik, failed to evade the coralskipper's black hole defense in time. The gravitic singularity tore Dinger's starfighter apart, instantly killing the Rogue Squadron pilot. Tik was killed after going extravehicular."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dinger flew in Rogue Squadron, a New Republic starfighter squadron with a reputation for piloting excellence. Gavin Darklighter, as Rogue Leader, was proud of all the pilots in his squadron and felt that they were skilful and driven."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dinger was a minor Rogue Squadron character in The New Jedi Order: Dark Tide I: Onslaught, authored by Michael A. Stackpole and published in 2000. The pilot was later given a sentence-long entry in The Complete Star Wars Encyclopedia, which was published in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}