{"url": "Dinko_(creature)", "categories": ["Category:Legends articles", "Category:Creatures of Proxima Dibal", "Category:Non-sentient species", "Category:Reptiles", "Category:Scavenger creatures", "Category:Venomous and poisonous creatures"], "nodes": [{"tag": "h1", "text": "Dinko  (creature)"}, {"tag": "p", "text": "A dinko was a small reptilian scavenger that was extremely vicious and tenacious. It was also notorious for emitting an unbearable stench, and for a mildly toxic bite which could paralyze a Human-sized creature with nausea."}, {"tag": "p", "text": "Dinkos were native to the planet Proxima Dibal I. They had thin bodies about ten centimeters long, with powerful rear legs, two front legs with a single claw, and a pair of smaller single-clawed grasping extremities on their chests. Their scent was not used for defense, but to establish mating dominance. Dinko vision worked by sensing movement—accordingly, they would attack anything that moved."}, {"tag": "p", "text": "Darth Sidious included dinkos in a particularly traumatizing training session with Darth Maul. When the two of them were walking in a field, the young Maul saw a Dinko and flinched in fear before the venomous creature leaped upon his foot and bit it. In rage, Maul crushed the Dinko beneath his foot but Sidious had already witnessed his apprentice flinch in fear, causing the Dinko to bite him. As a penance, Sidious locked Maul in his bedroom, having immersed it full of the clawing, biting creatures, thereby training Maul never to flinch or show fear again. Han Solo once bought a dinko, which he used to distract Ploovo Two-For-One on Etti IV. Han Solo told of this event in a personal log entry,"}, {"tag": "p", "text": "Guri, the second-in-command of Black Sun, once used a dinko to distract the bounty hunter Boushh, enabling her to kill him and take his prisoner. Dinkos were not recommended for use as pets, though some exotic pet stores sold them anyway. Dinkos were also pitted against each other in the sport of dinko fighting. Nuri the Clawdite first morphed into an Arrak snake, and then a dinko to stun Boba with its noxious spray. Nuri also briefly attacked Boba with the dinko's claws, before scuttling away as a Fefze beetle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}