{"url": "Dioxis/Legends", "categories": ["Category:Legends articles", "Category:Security weaponry", "Category:Weaponized gases"], "nodes": [{"tag": "h1", "text": "Dioxis"}, {"tag": "p", "text": "Dioxis was a potent toxic gas used by the Neimoidians of the Trade Federation at the time of and following the Battle of Naboo. The green-white gas was deadly to most carbon-based lifeforms."}, {"tag": "p", "text": "When Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi were sent by Supreme Chancellor Valorum to negotiate the blockade of Naboo, the ambassadors were double-crossed by Nute Gunray. The Neimoidians released dioxis gas via gas emitters into the Saak'ak's conference room where the Jedi waited. However, their command of the Force afforded them a sense of the danger, and were able to survive in the toxic environment until a squad of security battle droids arrived with orders to dispose of their bodies."}, {"tag": "p", "text": "Thirteen years later, on Cato Neimoidia, Obi-Wan Kenobi identified a toxic gas released by Nute Gunray's mechno-chair as dioxis—though this toxin was also identified as swamp gas, the chemical weapon used by the Separatists on Ohma-D'un earlier in the Clone Wars."}, {"tag": "p", "text": "Around 21 BBY, dioxis was used as part of a contest arranged by Count Dooku on his homeworld of Serenno. Within a construct known as The Box, eleven bounty hunters competed in a series of tasks to prove their worthiness to be part of a team that would abduct Supreme Chancellor Palpatine on Naboo. The first task involved the competitors having to escape a room that was filling with dioxis gas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dioxis first appeared in the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy."}, {"tag": "p", "text": "For the Star Wars: The Clone Wars episode \"The Box\", it was originally intended to fill the chamber of the first challenge at the Box with water instead of Dioxis. According to supervising director Dave Filoni, however, when they wrote the story, they had yet to solve water, leading the production crew to drop the water in favor of Dioxis. Though they eventually solved for water, the constrained FX budget for the episode necessitated sticking with Dioxis."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}