{"url": "Dire_Hound", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Z-95 Headhunters"], "nodes": [{"tag": "h1", "text": "Dire Hound"}, {"tag": "p", "text": "The Dire Hound was a nickname of a Z-95 Headhunter that became a stuff of legend in the Corellian system during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before the Galactic Civil War, the Dire Hound was flown by a woman named Evgenia. A privateer, she was hunting down pirates and bringing them to justice. When she retired due to her age, the starfighter was hidden at a secret hangar on Talus. Eventually, around 1 ABY, Evgenia revealed to her nephew the location of the hangar and asked him to recover the starfighter. The young man decided to use it to fight against Galactic Empire, the current legitimate government. However, when he arrived at the hangar, he found several stormtroopers led by an ISB agent Jeffren Brek, who prepared to impound the ship. The young man intended to defend the property of his family and put up a strong resistance. When the firefight went against the Imperials, they choose to withdraw."}, {"tag": "p", "text": "The Imperials, however, were not the only one interested in Dire Hound. Kath Scarlet and several of her Binayre Pirates tried to claim the ship, when after seeing the Imperials running, they decided that whatever they were after might be something valuable. Scarlet mentioned that she liked the ship's bubble canopy and upgraded 2b fission engines and offered the young man to give it up quietly. However, the young man once again put up a short and brutal firefight, convincing Scarlet that the ship was not worth the efforts. She and her pirates escaped and the young man, while wounded and exhausted to give chase, completed the preflight and launched the starfighter, bringing it back to Corellia."}, {"tag": "p", "text": "Evgenia was pleased to see her old starfighter again and introduced her nephew to Lennart, a Rebel officer, who revealed that the Dire Hound was the stuff of legend in the Corellian system and recruited the young man into Alliance to Restore the Republic. In the preparation for the battle of Talus the freshly-recruited Rebel piloted the Dire Hound to the Imperial outpost on Corellia, where he looked for plans of the upcoming Imperial operation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}