{"url": "Directive_417", "categories": ["Category:Legends articles", "Category:Imperial Codes"], "nodes": [{"tag": "h1", "text": "Directive 417"}, {"tag": "p", "text": "Directive 417, also known as Directive Four-Seventeen, was an Imperial code, invoked in the event that any Imperial Governor was assassinated by forces (or suspected forces) of the Rebel Alliance, then that governor's successor was required to immediately transmit a call for aid to any nearby Imperial forces. The Directive also required any forces receiving the signal to immediately converge on the site of the assassination, even if it meant abandoning their current operations."}, {"tag": "p", "text": "The Directive was put into effect approximately six months after the Battle of Yavin, in 0 ABY and two months before the Battle of the Poln system. Mara Jade, the Emperor's Hand, did not learn about it until she was on Poln Major, and cynically regarded it as Darth Vader's latest, unnecessary attempt to ensure that he would be given the first chance at capturing or killing any Rebel forces."}, {"tag": "p", "text": "Nuso Esva, a warlord active in the Unknown Regions, hoped to use Directive 417 to draw Senior Captain Thrawn's forces into a trap over Poln Major. He attempted to arrange the assassination of Governor Bidor Ferrouz at a time when Luke Skywalker - a known Rebel, instantly recognizable by his lightsaber - was nearby. Although Jade, Skywalker, and the renegade Stormtrooper unit \"The Hand of Judgment\" prevented Ferrouz's assassination, his senior security officer, General Ularno, issued the Directive anyway. The nearest available Imperial forces were Captain Thrawn's, under the command of Captain Voss Parck, who, though he was already engaged with Esva's forces, conceded that he had no choice but to break off and jump to the Poln system immediately."}, {"tag": "p", "text": "However, Thrawn was able to turn the ensuing battle into a resounding victory, not least because the Hand of Judgment's actions had delayed the signal for a few crucial hours, during which time significant elements of Esva's forces on Poln Major were re-tasked and their ships eventually destroyed."}, {"tag": "h2", "text": "Appearances"}]}