{"url": "Disciples_of_Harmony", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: Force and Destiny sourcebooks"], "nodes": [{"tag": "h1", "text": "Disciples of Harmony"}, {"tag": "p", "text": "Disciples of Harmony is a sourcebook for Fantasy Flight Games' Star Wars: Force and Destiny roleplaying game. The book focuses primarily on Consulars. It was released on June 1, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The rise of the Empire has caused the Jedi Order to fade even further into obscurity, but the galaxy of Star Wars™ is immense, with new secrets always waiting to be discovered. Not all regard the Jedi as myths or frauds; some seek to continue their traditions. Disciples of Harmony, a sourcebook for Consular characters in the Star Wars™: Force and Destiny™ roleplaying game, expands the options available to Consulars in the core rulebook and gives Game Masters new opportunities to position these arbiters of balance within their campaign."}, {"tag": "p", "text": "Players will find everything necessary to craft a Consular character in this 96-page full-color handbook, including new Consular specializations—the Arbiter, Ascetic, and Teacher—new races, new Force powers, and extensive armor and weapon inventories. Discover new droids, vehicles, starships, and even rules for rare and damaged lightsaber crystals. The path of the Consular is one of balance, a path that may be difficult in a traditional, combat-oriented setting. As such, Disciples of Harmony features a section for Game Masters on including Consular characters and NPCs in your campaigns and how they can contribute when the lightsabers ignite and the blasters start firing."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}