{"url": "Dismemberment/Legends", "categories": ["Category:Legends articles", "Category:Biology"], "nodes": [{"tag": "h1", "text": "Dismemberment"}, {"tag": "p", "text": "Dismemberment involved the loss of one or more limbs, such as the hand, foot, arm, or leg. The loss of the head was sometimes referred to as dismemberment, but was more accurately described as beheading or decapitation. Dismemberment usually occurred in combat, especially when lightsabers were involved. In fact, certain lightsaber combat techniques existed which focused on dismemberment and were used by the Jedi and the Sith. They were called Marks of Contact. Examples included cho mai which was the cutting off of the opponent's weapon hand, and cho sun which was the act of cutting off an opponent's weapon arm. Cho mok was the act of cutting off an opponent's limb, usually the leg. Mou kei was a variant generally forbidden by the Jedi since it involved cutting through several limbs at once. For the Jedi, the use of dismemberment in lightsaber combat was to end a battle without resorting to killing the opponent. Collectively, the Jedi techniques to dismember an opponent rather than killing them was called a severing strike."}, {"tag": "p", "text": "Although it was a grievous injury, dismemberment was not necessarily fatal. A lost limb could be restored with a cybernetic limb. Some cybernetic replacements, such as Luke Skywalker's cybernetic arm, looked identical to the original body parts, while others were immediately recognizable as artificial. In addition, some species were able to regrow lost limbs. Trandoshans and Gands were able to regrow lost limbs in a few days, while Gen'Dai were able to regrow lost limbs in only a few minutes. Dismemberment in droids was less serious, since they could generally be repaired. For example, in Cloud City, C-3PO was dismembered but was eventually put back together, becoming fully functional once again."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first 6 Star Wars movies feature dismemberment, of either organic or artificial limbs. Rob Coleman discusses this in the Attack of the Clones commentary track (\"Yet another in the series of Star Wars severed limbs. I've actually tried to talk to George about the whole reason for the severed limbs in these movies and he always just sort of smiles and chuckles and never gives me the real answer.\") and when asked by Vanity Fair about the dismemberments, George Lucas answered: \"That's what happens when you play with swords.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}