{"url": "Disney%2B", "categories": ["Category:Real-world articles", "Category:Walt Disney companies", "Category:Streaming services"], "nodes": [{"tag": "h1", "text": "Disney+"}, {"tag": "p", "text": "Disney+ is an American streaming service for on-demand televised and cinematic content from Walt Disney Direct-to-Consumer & International, a subsidiary of The Walt Disney Company. It launched on November 12, 2019."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Disney+ was first announced in late 2017, with a plan of producing original film and television material in addition to catalog content. Disney CEO Bob Iger revealed that \"a few\" Star Wars series were among the content that would be produced for the service. Some of these are The Mandalorian, a revival season of Cartoon Network's animated series Star Wars: The Clone Wars, and a second television series centered on Cassian Jeron Andor. In May 2019, Iger said that a third live-action show may premiere on the service sometime prior to the release of the 2023 Star Wars film, which was later revealed to be a Star Wars television series centered on Obi-Wan Kenobi. A year later, it was announced that a fourth animated show focusing on Clone Force 99, named Star Wars: The Bad Batch, will debut on the service sometime in 2021. According to Variety, all of the service's original content will have \"broad family appeal.\""}, {"tag": "p", "text": "All Star Wars films were added to Disney+ within the first year of the service, and The Mandalorian premiered when Disney+ debuted. In December of 2020, Disney announced that roughly ten more Star Wars series would be added to the service in the coming years."}, {"tag": "p", "text": "On April 2, 2021, Disney+ began streaming Caravan of Courage: An Ewok Adventure, Ewoks: The Battle for Endor, the Ewoks animated series, Genndy Tartakovsky's Star Wars: Clone Wars animated series, and the animated The Story of the Faithful Wookiee segment from The Star Wars Holiday Special under the Star Wars Vintage Collection banner. StarWars.com also confirmed that the animated Star Wars: Droids: The Adventures of R2-D2 and C-3PO would  join the Vintage Collection later in 2021, appearing first in the UK and Ireland on June 18."}, {"tag": "h2", "text": "Star Wars content"}, {"tag": "h3", "text": "Originals"}, {"tag": "h3", "text": "Movies"}, {"tag": "h3", "text": "TV Series"}, {"tag": "h3", "text": "LEGO"}, {"tag": "h3", "text": "TV Specials"}, {"tag": "h3", "text": "Documentaries"}, {"tag": "h3", "text": "Other"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}