{"url": "Disruption_of_Comm_4", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Invasion of Naboo"], "nodes": [{"tag": "h1", "text": "Disruption of Comm 4"}, {"tag": "p", "text": "An attack to disrupt Trade Federation Communications Satellite 4 occurred during the Invasion of Naboo in 32 BBY. During the invasion, a group of Naboo resistance fighters, led by Captain Kael of Bravo Squadron, found and saved a criminal smuggler named Borvo the Hutt. After they escorted him to his mountain base, the Hutt gave the resistance pilots new fighters and intelligence about the invading forces. Together they formed a plan to disrupt the Trade Federation comm web and infiltrate the base it controlled. The Naboo and mercenary pilots launched into orbit, where they discovered and destroyed three shield projectors protecting Comm 4. They then assaulted the satellite until it exploded, cutting off control to the Trade Federation base."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After facing overwhelming forces in the early stages of the Invasion of Naboo in the year 32 BBY, the Royal Naboo Security Forces were forced to battle for their planet. The Security Force officers Captain Kael and Lieutenant Gavyn Sykes of Bravo Squadron joined together and engaged Trade Federation forces which were attacking Naboo civilians. They then joined up with police officer Vedd Deviss after protecting his trading village. Acting on intelligence provided by Deviss, the three headed into the northern mountains to search for a smuggler, Borvo the Hutt, who could help them strike back at the Trade Federation Droid Army. After Borvo was escorted to the site of his organization's base, the Hutt gave the pilots new starfighters and vital intelligence with which they used to go back on the offensive against the Trade Federation."}, {"tag": "h2", "text": "Orbital battle"}, {"tag": "p", "text": "The three Naboo pilots and two of Borvo's pilots flew into orbit where Comm 4 was located. Once they were near, their sensors noticed Comm 4 had heavy shields, but the pilots took pot shots at the satellite regardless. One of Borvo's pilots, Kol Kotha, suggested the shields were created by three nearby slave satellites, and Kael ordered them to find and destroy the projectors. Sykes flew toward the first one and discovered the minefield protecting it. Sykes and the other pilots fought through many droid starfighters and mines to knock out the generators one-by-one and expose Comm 4. After the second projector was destroyed, another of Borvo's pilots, Adela Tyché, who had stayed by the satellite, radioed to say that her shots were starting to affect the shields. Once the shields were down, the pilots moved to attack Comm 4, which still had six missile defense turrets. A squadron of droid starfighters also arrived to defend the satellite. Avoiding the missiles and starfighters, the resistance pilots pressed the attack against the satellite and destroyed it, shutting down the control signal to a Federation base down on the planet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the satellite blew, Kael congratulated them, and the pilots rejoined formation and flew back down to the surface. The base controlled by the comm satellite became their next target. They assaulted the base and stole a gunboat, which Sykes took on the Andrevea River to liberate slave camps full of Naboo prisoners. The loss of the station concerned the Trade Federation, and the incident was later mentioned in a report given to the Sith Lord Darth Maul by the leader of the invasion, Viceroy Nute Gunray."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle appears in the 2000 video game Star Wars: Episode I: Battle for Naboo. Unlike the game's predecessor, Star Wars: Rogue Squadron, this game features several orbital battles such as this, not just on the surface of a moon. If the player is shot down, a short FMV is shown with the fighter plummeting toward the planet. The battle was also mentioned in the 2011 magazine Star Wars: The Official Starships & Vehicles Collection 62. The event was also mentioned in the 2012 short story \"End Game,\" written by James Luceno and included in the re-release of the novelization of Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}