{"url": "Disruptor/Legends", "categories": ["Category:Legends articles", "Category:Disruptor weaponry", "Category:Weapon types"], "nodes": [{"tag": "h1", "text": "Disruptor"}, {"tag": "p", "text": "A disruptor was a particularly powerful type of energy weapon often preferred by assassins and bounty hunters. Disruptor weapons were similar to their blasters counterparts in many ways, such as the use of blaster gas and energy cell. Popular forms of this weapon included the disruptor pistol and the disruptor rifle. Disruptors were illegal on many planets, and in many places merely possessing one would earn an instant death sentence. Even under the Galactic Empire, only a select few Imperial Intelligence Officers were permitted to utilize them. Examples included the Galactic Solutions Industries GSI-21D, Merr-Sonn Model MSD-32 Disruptor Pistol and the Tenloss Syndicate DX-2 and DXR-6."}, {"tag": "h2", "text": "Disruptor mechanics"}, {"tag": "p", "text": "On a basic level, a disruptor worked by using large quantities of blaster gas, such as Tibanna gas, many times more than a standard blaster. The energy beam fired by a disruptor was generated in almost the same manner as the particle beam fired by a blaster, though the beam used much more blaster gas. A disruptor's internal components were quite different than that of a blaster's, though. The blaster gas used to generate the beam underwent a considerably different transformation that formed the disruptor beam. The resultant blast was short-ranged, unstable, less cohesive, and extraordinarily powerful. Disruptor beams generated by these weapons differed from that of a standard blaster. They created an energy wave consisting of disruptive, nonharmonic energy pulses that excited a target's molecules to the point that it destroyed the bonds that held their constituent atoms together, painfully. In simpler terms, disruptor weapons used extremely high amounts of unstable blaster energy, enough to obliterate matter on a higher scale than normal blasters. A shot from a disruptor rifle could do this in less than a full second, vaporizing a being almost instantly. A disruptor was capable of disintegrating a humanoid target, turning it to a pile of ash, and was quite effective against other solid targets, even capable of damaging starship hulls, though the massive amount of blaster gas used by disruptors made them inefficient and impractical for starship use."}, {"tag": "p", "text": "As a drawback, in addition to being illegal and short-ranged, other than the Tenloss DXR-6 disruptor rifle, disruptors generally only had enough ammunition for a few shots, and were incapable of firing rapidly or being set to stun. However, some disruptor pistols were capable of being set to overload, a setting which greatly increased the pistol's power for a single shot. Unfortunately this usually resulted in the firearm being rendered useless, due to the weapon's internals suffering damage from focusing even more energy into what was already an unstable form of tibanna gas particles."}, {"tag": "p", "text": "Bounty hunters like Boba Fett used disruptors on assassination missions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}