{"url": "Dissolution_of_the_Imperial_Senate/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Events of the Galactic Civil War", "Category:Galactic Empire"], "nodes": [{"tag": "h1", "text": "Dissolution of the Imperial Senate"}, {"tag": "p", "text": "The dissolution of the Imperial Senate was the suspension of the Imperial Senate by direct order of Emperor Palpatine in 0 BBY (35:3:5 GrS)."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "From the beginning of the Galactic Empire, Palpatine sought to remove the Senate. The first reason was symbolic: he could not leave a reminder of the Galactic Republic. Despite the Imperial Senate being very different from the Galactic Senate, it came to be known as the \"last remnant of the Old Republic.\" The second was political: some senators still opposed him. His obedient majority tried keeping them in check; they understood they were only there to prop up the illusion of democracy. Some, however, didn't understand the sham; they actually tried passing laws against the Emperor's wishes. He dealt with the outspoken ones when they appeared, but like weeds, others sprouted in their place. Some of them, as Palpatine suspected, were providing the Rebels with funds, information, and resources. In addition, the Imperial Military via its field manual explained that the Imperial Senate was only intended to serve as a transitional piece between the Old Republic and the New Order, and claimed its removal would ensure that the Imperial Military would do its duties much more efficiently."}, {"tag": "h2", "text": "Dissolution"}, {"tag": "p", "text": "In 0 BBY, after learning that Senator Leia Organa of the Alderaan Sector was a member of the Rebel Alliance, the Emperor issued the dissolution of the Senate, via the Grand Convocation Chamber of the Senate Building on Coruscant. He claimed that the Rebellion had penetrated the highest organs of the Imperial Government and used the Declaration of Rebellion as his proof from two years earlier. The Senate's dissolution would be temporary until the Rebellion was put down. Until that time, Moffs and Regional Governors would have total control of their systems and sectors."}, {"tag": "p", "text": "Warrants were issued for the arrest of all suspected Rebels. Stormtroopers burst into the Senate, and hundreds were detained. Some—those learned to have had Rebel affiliations—were never seen again. The following morning, the remaining senators, unaware of what had happened, came to work only to find themselves locked out of their offices and chambers. Some tried to appeal to Palpatine directly, but were told that their diplomatic access to the Imperial Palace had been suspended \"for the duration of the emergency.\""}, {"tag": "p", "text": "Many who were released left Coruscant for their homeworlds, and a peaceful—and isolated—retirement. The small number of senators that remained, the ones who had most voraciously upheld the party line, were generously rewarded with their lives and new positions. Many of them donned ornate jeweled robes and joined the swelling ranks of Imperial advisors."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though it was claimed via the public communications that the dissolution was temporary, only the most deluded of people actually believed the Emperor's statement. A new pyramidal structure was imposed, with himself at its summit, then the Grand Moffs who ruled Oversectors, then the Moffs who ruled sectors, then the governors of individual systems. All of them owed their careers to the Emperor and gave him their allegiance. The dissolution of the Imperial Senate also gave one of the Grand Moffs, Wilhuff Tarkin, the opportunity to test the Death Star without fear of reprisal, and informed Tagge as much when he expressed fear that the Imperial Senate would react with anger if they found out about the Death Star's development. The Imperial Handbook: A Commander's Guide, the official field manual for officers in the Imperial Military, also made clear that the Imperial Senate's dissolution was in fact planned from the start, and that the Emperor's decision was made final."}, {"tag": "p", "text": "The end of the Senate left the field wide open for COMPNOR to step in. For all the power of the Moffs, COMPNOR stood behind them, more powerful still. In the absence of the Senate, Palpatine had established an environment where even his subordinates were capable of terrible atrocities against sentient beings. Behind them all was the Death Star, a weapon that was used to incite fear and terrorize those unfaithful to the New Order."}, {"tag": "p", "text": "Organizations such as the Trade Federation that had been puppet governments to the Empire since the Clone Wars had ended were dissolved along with the Imperial Senate. This event had ultimately not only resulted in the disbandment of the Senate, but also the Alliance officially became a separate galactic government from the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dissolution of the Imperial Senate was an event covered in dialogue from Star Wars Episode IV: A New Hope. Although it is maintained to be permanent during the Empire's lifetime, there were a couple of sources that implied otherwise, including the film's novelization where Tarkin implied that he'll have to be subject to an inquiry by the Imperial senate for his actions with the Death Star."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}