{"url": "Distress_signal/Legends", "categories": ["Category:Legends articles", "Category:Communications"], "nodes": [{"tag": "h1", "text": "Distress signal"}, {"tag": "p", "text": "Distress signals were signals sent by starships in emergency situations calling for help. The signal could be sent for a multitude of reasons, including ion storm damage, asteroid damage, incapacitation of the crew, or in times of armed conflict, damage as a result of enemy action. Distress signals were also emitted by escape pods after they were launched."}, {"tag": "h2", "text": "Known Uses"}, {"tag": "p", "text": "During the Clone Wars, the Republic Assault ship Prosecutor was boarded by Delta Squad in the Corbantis system. When a Lucrehulk-class battleship entered the area in an attempt to take the ship for the Confederacy of Independent Systems in an exchange with Trandoshan Slavers, Advisor sent out an urgent distress signal for aid in combating the confederacy. The RAS Arrestor responded and in coordination with the squad, defeated the enemy ship, and returned the ship into Republic custody."}, {"tag": "p", "text": "After Order 66 was issued, Obi-Wan Kenobi sent out a distress signal stating that he had no contact on any frequency. He was then contacted, and rescued by Senator Bail Prestor Organa."}, {"tag": "p", "text": "During the Skirmish at Kuat Drive Yards led by Raymus Antilles, the facility sent a distress call to the Star Destroyer Tyranny which was stationed at Fresia on a security assignment at the directive of Darth Vader. The distress call led to the Star Destroyer leaving its post to assist, leaving Fresia vulnerable to a Rebel attack."}, {"tag": "p", "text": "When the Devastator captured the Tantive IV, Darth Vader ordered a fake distress signal to be sent claiming the Alderaanian ship had collided with a meteorite storm."}, {"tag": "h2", "text": "Types of distress signal"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}