{"url": "Diva_Funquita", "categories": ["Category:Canon articles", "Category:Clerical workers and assistants", "Category:Females", "Category:Theelins"], "nodes": [{"tag": "h1", "text": "Diva Funquita"}, {"tag": "p", "text": "Diva Funquita was a Theelin female who worked as an assistant to the Hutt criminal Gardulla Besadii the Elder. She accompanied Gardulla to view the Boonta Eve Classic podrace on the planet Tatooine in 32 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Theelin female Diva Funquita served the Hutt criminal Gardulla Besadii the Elder as an assistant during the reign of the Galactic Republic after being gifted to her by the crime lord Jabba Desilijic Tiure. She often accompanied Gardulla to events, and in 32 BBY she attended the Boonta Eve Classic podrace on the planet Tatooine with the Hutt."}, {"tag": "p", "text": "The pair viewed the event from Jabba's private viewing box in the Mos Espa Grand Arena along with the crime lord and various members of his entourage. When the race finished she left the box with Gardulla, leaving behind Jabba who had fallen asleep."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Funquita had spiky scarlet hair, brown eyes, and light skin with red spots covering the left half of her face as well as her left shoulder and upper arm."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While at the podrace she wore a black dress with a jeweled belt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Diva Funquita first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace, in which she was portrayed by director George Lucas' daughter Amanda Lucas. In the current canon, Funquita's name was first revealed in the 2018 reference book Star Wars: Geektionary: The Galaxy from A - Z. The name originated in the Star Wars Legends continuity, where it was first used in the 1999 reference book Star Wars: Episode I The Visual Dictionary, which was written by David West Reynolds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}