{"url": "Division", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Division"}, {"tag": "p", "text": "A division was a type of military unit of varying size and type that was active throughout different factions in galactic history. Divisions ranged from naval to army divisions, and were different military unit types. The term division could also be used generically to mention a contingent of military units."}, {"tag": "h2", "text": "Land forces"}, {"tag": "p", "text": "A land military division was part of an army, and varied in size and type."}, {"tag": "h3", "text": "Trade Federation"}, {"tag": "p", "text": "While it was active in the Republic Era, the Trade Federation Droid Army deployed Armored Assault Tanks which formed the frontline of the Trade Federation's armored infantry divisions. The Droid Army subsequently participated in the Invasion of Naboo, deploying its vast military, including Armored Assault Tanks."}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "h4", "text": "Judicial Forces"}, {"tag": "p", "text": "The Judicial Forces of the Galactic Republic served as the Republic's premier peacekeeping force towards the end of the Republic Era. When the Ontothon government joined the Republic, a division of Republic soldiers was meant to arrive on the planet at the request of the local constabulary. The division was waylaid when a star collapsed in the Bunka system and they were needed to aid with evacuations."}, {"tag": "h4", "text": "Grand Army of the Republic"}, {"tag": "p", "text": "Ground divisions in the Grand Army of the Republic varied greatly in size and operations. Divisions could be small formations, such as the 212th Recon Division which was organized under the 212th Attack Battalion of the 7th Sky Corps. The 332nd Division was created after the 501st Legion was split into two forces. The 332nd Division participated in the Siege of Mandalore, and consisted of the 332nd Company and other units who were equipped with standard 501st colors and the standard white. The division utilized All Terrain Tactical Enforcers and was supported by LAAT/i gunships and LAAT carriers. The 332nd Division was led by Clone Commander CT-7567, and consisted of other clone trooper officers, clone medics, and an Advanced Recon Commando."}, {"tag": "p", "text": "Additionally, the Grand Army of the Republic deployed the 181st Armor Division, which consisted of clone troopers with green markings and vehicles. As an armor division, it utilized all-terrain vehicles and HAVw A6 Juggernauts, and its infantry was composed of clone sharpshooters, clone trooper officers, heavy weapons clone troopers, and standard clone troopers. Another division, the 224th Clone division, participated in the Battle of Mimban and consisted of the Mud Jumpers. Clone tank divisions participated in the Second Battle of Felucia, and were supported by the 104th Battalion and the 501st Legion. A Republic tank squadron was part of one of these clone tank divisions. A division undertook a mission to Aleen after a series of groundquakes rocked the planet alongside the 104th Battalion. Secret agents of Republic Supreme Chancellor Sheev Palpatine were among the medical staff."}, {"tag": "h3", "text": "Confederacy of Independent Systems"}, {"tag": "p", "text": "In the Separatist Droid Army of the Confederacy of Independent Systems, Separatist ground forces deployed tank divisions against the Jedi and Galactic Republic during the Clone Wars. Several armored divisions of Armored Assault Tank Mk Is participated in the Battle of Christophsis when the Separatists invaded. The Umbaran Militia, which allied itself with the Confederacy during the Clone Wars, also deployed tank divisions against the Galactic Republic. During the Battle of Umbara, three Umbaran tank divisions protected the Umbaran airbase near the Umbaran capital city, but were ultimately defeated when Republic forces conquered the base."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "h4", "text": "Imperial Army"}, {"tag": "p", "text": "In the Imperial Army, divisions were large military formations that could contain artillery, infantry, ground vehicles, and have aerial support. They were composed of between 5,000 to 10,000 soldiers, and could be led by a general, a colonel, or a major. One division was the division led by Colonel Barokki, which had poor performance early in the Imperial Era which resulted in the officer being reprimanded directly by Emperor Palpatine."}, {"tag": "p", "text": "The 224th Imperial Armored Division under the command of Major Staz, was a division of the Galactic Empire that participated in the Mimban campaign. It consisted of All Terrain Defense Turrets, and was supported by TIE fighters and Y-45 armored transport haulers. It's infantry forces consisted of Imperial officers, swamp troopers, wet-weather gear stormtroopers, Imperial medics, and Imperial ground crew. Around the same time, the Vandor division, located on the Imperial planet Vandor, was active and consisted of range troopers that defended Imperial 20-T Railcrawler conveyex transports that traveled between the mountains and the frontier."}, {"tag": "p", "text": "During the Galactic Civil War, an armored division was deployed by the Imperial 7th Fleet and consisted of several heavy battalions. These heavy battalions consisted of All Terrain Armored Transports that were bolstered by All Terrain Defense Pods. Darth Vader alerted all nearby divisions shortly prior to a skirmish on Hradreek in an attempt to secure the second crossguard lightsaber belonging to the ancient Sith Lord Darth Atrius. A division under the command of General Valin Hess maintained between 5,000 to 10,000 soldiers, which included field operatives. Hess's division participated in the attack on Burnin Konn, leading to the division's destruction. After the Battle of Endor, defected pilot Yrica Quell believed that an ex-Imperial who arrived with another group at Traitor's Remorse was from one of the elite stormtrooper divisions, perhaps a death trooper."}, {"tag": "h4", "text": "COMPNOR"}, {"tag": "p", "text": "The Commission for the Preservation of the New Order's sub-bureaus were also referred to as divisions. The Coalition for Progress, led by Minister Pitina Mar-Mas Voor, was considered one such division of COMPNOR and served as the propaganda arm of the Galactic Empire."}, {"tag": "h3", "text": "Alliance to Restore the Republic"}, {"tag": "p", "text": "The Alliance to Restore the Republic utilized divisions within their Alliance Army structure, with Alliance officers commanding the units of ground-based troops."}, {"tag": "h3", "text": "Mandalorians"}, {"tag": "p", "text": "By the time after the fall of the Galactic Empire and its remnants were active, Mandalorians maintained the formation of a division as part of their warrior organizational hierarchy. When Mandalorian Lady Bo-Katan Kryze participated in a mission to steal weapons from the Imperial remnant led by Moff Gideon, she stated for the captain of the Imperial Gozanti-class cruiser they were stealing if they could imagine what a division of Mandalorians could do."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "During the Galactic Civil War between the New Republic and the Empire, during the hunt for Shadow Wing, the New Republic Intelligence Agent Caern Adan eventually had an entire division of personnel under his control."}, {"tag": "h3", "text": "First Order"}, {"tag": "p", "text": "Like its predecessor, the First Order also utilized infantry divisions in the First Order army's organizational structure. During the Battle of Takodana, Kylo Ren ordered his stormtrooper division to withdraw upon the capture of Rey and the arrival of the Resistance."}, {"tag": "h2", "text": "Naval forces"}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "Naval divisions were part of the Galactic Empire's Imperial Navy Order of Battle. Dark Lord of the Sith Darth Vader ordered Admiral Mummert with assembling divisions and stationing them at the Hortolo system before the deadline. Admiral Mummert was unable to deploy the starships by the deadline, since gathering the proper divisions had taken longer than believed since the ships were scattered."}, {"tag": "h3", "text": "Alliance to Restore the Republic"}, {"tag": "p", "text": "During the Galactic Civil War, the Rebel Alliance Navy's structure included numbered naval divisions after the main force splintered after the Battle of Hoth. The divisions acted as rebel cells, and were different in their composition. The Fourth Division consisted of at least three EF76 Nebulon-B escort frigates, at least four CR90 corvettes, at least two GR-75 medium transports, and other support ships. The Fourth Division was led by Alliance officers, as well as General Leia Organa and Commander Grek. Additionally, it was supported by Green Squadron of the Rebel Alliance Starfighter Corps. The Eighth Division was also active, but was destroyed at Malastare."}, {"tag": "p", "text": "Additionally, the Seventh Division, led by Admiral Gial Ackbar, consisted of the MC80A Home One Type Heavy Star Cruiser Home One, at least one EF76 Nebulon-B escort frigate, at least one CR90 corvette, and a number of starfighters. The Sixth Division was destroyed by Imperial forces, and consisted of at least one CR90 corvette, a GR-75 medium transport, and starfighters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}