{"url": "Division/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic military units", "Category:Imperial military units", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Division"}, {"tag": "p", "text": "A Division was an important tactical level of military command and organization, widespread throughout the galaxy. However, the term was not a standard designation in the Grand Army of the Republic or the Imperial Army, where comparable formations were normally designated as Legions and battle groups."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The use of large military units analogous to divisions is probably as old as the existence of large armies, and it is not clear when the precise term \"division\" was first used."}, {"tag": "p", "text": "During the New Sith Wars, it is known that infantry divisions served in the Sith military led by the Brotherhood of Darkness—two additional divisions reinforced Lord Kaan's army on Ruusan during the campaign against the Army of Light, but an individual Sith Lord was considered more than the equal of an entire division of non-Force-sensitive troops. The Army of Light, in contrast, used the term Legion for its main field formations."}, {"tag": "p", "text": "In the centuries after the Ruusan Reformation, sectors and important member worlds of the Galactic Republic typically retained defense forces at Division strength. It seems that the Republic usually supplied half the funding for these units, and Imperial sources later portrayed them as forming the devolved and debased field units of a theoretically unified army, but in practice, they were autonomous local militias. Often limited to ceremonial and police duties, lacking effective heavy equipment or interplanetary deployment capabilities, they were normally under the operational command of the planetary governor or sector Senator, and their loyalties were entirely to their homeworld or home sector—or, worse, to the individual grandee who was their paymaster and commander."}, {"tag": "p", "text": "During the Clone Wars, local forces came ever more under executive control, but the Imperial Army subsequently reformed the existing Division structure radically, in order to undermine the local loyalties entrenched in many formations: units of the Army, it was felt, should be components of a galaxy-wide machine, unquestioningly loyal to the Imperial command, and capable of fighting with equal determination wherever they were required."}, {"tag": "p", "text": "To this end, Divisions were reorganized as Battle groups, and amalgamated into Corps based on deep-space depot ships. Only a few Divisions retained their old identities, units where the divisional esprit de corps was particularly strong, or where continuity was useful for propaganda purposes. For instance, the Assault Armor Division was typically the first unit to receive new armored vehicles such as the AT-AT."}, {"tag": "p", "text": "During the Galactic Civil War, the ideologues of the Rebel Alliance laid a marked stress on the ideals of the Old Republic and local autonomy, so it was perhaps inevitable that they would continue to use Divisions as their primary large-scale military formations."}, {"tag": "p", "text": "Although Alliance Special Forces, the troops answering directly to Alliance High Command, were typically deployed in small, flexible mission-specific teams, their large-scale organization was based around the Division; the total number of SpecForces divisions is said to have been somewhere around ten. Other Rebel divisions were attached to local Sector Forces, and fought as combat formations in the field: for example, in Atrivis sector, where the Rebel army on the planet Mantooine was organized into several small Divisions."}, {"tag": "p", "text": "Rebel Divisions were designated by numbers, apparently irrespective of whether they were SpecForces or Sector Force troops: the 132nd Forward Division in Atrivis sector was probably part of the army on Mantooine, while the 117th Light Infantry Division seems to have been a SpecForces unit, serving as a pool from which commando strike teams could be formed."}, {"tag": "p", "text": "Under the New Republic, Divisions continued to serve as important army formations, and then—if not beforehand—specific Divisions were assigned to support naval task forces, such as the 42nd Republican Guard Assault Division, which served with the Fleet's 32nd Cruiser Squadron. In 36 ABY, a \"full division\" appeared to consist of at least 40,000 troops."}, {"tag": "h2", "text": "Alternative usage"}, {"tag": "p", "text": "It appears that within the Imperial military, and perhaps specifically with regard to clone troops, the term \"division\" could also indicate much smaller groups of soldiers. The \"division\" of clone stormtroopers subverted by Grand Moff Trachta as part of a coup attempt in 0 BBY was as a batch of a hundred troopers, but it is not clear whether the term in this context indicated a fixed number, or a detail of varying size. Either way, this usage may have influenced the use of alternative Legion and Battlegroup terminology within the Grand Army of the Republic, Stormtrooper Corps and Imperial Army."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although Divisions were absent from the standard Imperial Army command structure, this page nevertheless depends heavily on the Imperial order-of-battle section in the Imperial Sourcebook, where Divisions are discussed in the section on the Battlegroups that replaced them."}, {"tag": "p", "text": "Inside the Worlds of Star Wars: Attack of the Clones uses the term \"divisions\" to denote the first groups of clone troopers sent into battle from Kamino, and says that \"millions more\" were to follow; this may have been intended by Simon Beecroft and Curtis Saxton to mean that the Grand Army of the Republic consisted of millions of divisions, but the official interpretation, as presented by Leland Chee at StarWars.com, is that \"millions more\" refers to numbers of individual clone troopers: \"millions of clones, not millions of divisions.\" Quite apart from this, the term \"division\" may be used here for small units, as it is in Star Wars: Empire: Betrayal. It should also be noted that Riders of the Maelstrom gives an average of one million Imperial Army troops per sector at the height of the New Order, which would suggest a total of a billion troops across the galaxy at that time."}, {"tag": "p", "text": "On page 97 of the novel Dark Nest III: The Swarm War, Leia Organa Solo makes mention that forty thousand troops equates to a \"full division.\" The reference is made concerning Killik troops, however; it is unlikely that she is aware of the exact structure of Killik military units, implying that 40,000 indicates either an average amount or the numbers for an equivalent New Republic/Galactic Alliance unit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}