{"url": "Do_Clones_dream_of_Electric_Mynocks%3F", "categories": ["Category:Real-world articles", "Category:LEGO comics"], "nodes": [{"tag": "h1", "text": "Do Clones dream of Electric Mynocks?"}, {"tag": "p", "text": "\"Do Clones dream of Electric Mynocks?\" is the thirteenth in a series of comics on the LEGO Star Wars website. It is a continuation of the story-arc started with \"A droid in the hand is worth\". It was placed on the website June 11, 2009."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "\"Do clone troopers dream of electric mynocks?\""}, {"tag": "p", "text": "The story begins with a TIE Advanced x1 flying through space. This confuses the narrator since it is off track from the ending of the last story. The flight turns out to be a dream of the clone trooper 1137, who is woken up by his buddy. The two are in a crater along with the remains of their hijacked tank. Outside the crater, the group's commander is shown berating their pilot for leaving them after taking off and then bombing their tank when the pilot mistook it as an enemy. Meanwhile, the team's gunner asks for help to assemble a walker. 1139 eagerly volunteers, but 1137 decides to do some wandering. As the two build the walker, two V-19 Torrent starfighters land nearby. The pilots had heard that there were some droid tanks to blow up. This news upsets the commander, who furiously shouts that no tanks are to be blown up. This brings relief to several battle droids that just arrived in Armored Assault Tanks. The commander pulls outs his blasters and a fight breaks out. Elsewhere, 1137 continues to wander, unaware of the skirmish and the Torrent starfighters taking off behind him. As he remembers his dream, Ahsoka Tano lands her Jedi starfighter in front of 1137 and ask him if he's seen R2-D2."}, {"tag": "p", "text": "\"TO BE CONTINUED!\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The title of the comic is presumably based on the title of the novel Do Androids Dream of Electric Sheep? by Philip K. Dick."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}