{"url": "Doallyn/Legends", "categories": ["Category:Legends articles", "Category:Desilijic servants", "Category:Geranites", "Category:Hunters", "Category:Males", "Category:Merchants", "Category:Slaves", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Doallyn"}, {"tag": "p", "text": "Doallyn was a hunter from Geran who served under Jabba Desilijic Tiure."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A hunter by trade, Doallyn had two reasons to wear a mask: the first being that he needed to breathe hydron-three to stay alive on planets with an oxygen-rich atmosphere, the second being that his face was once hideously scarred by the poisoned claws of a Corellian sand panther. He eventually came to Mos Eisley to hunt a krayt dragon for Jabba the Hutt to pit against his rancor in a head-to-head fight. However, he ended up getting drunk in the cantina, and gambled to his detriment. He awoke from his drinking binge to discover that he had lost the game and now owed Jabba a year's service."}, {"tag": "p", "text": "During one memorable time in Jabba's Palace, immediately following the feeding of Oola to the rancor, an Ubese bounty hunter named Boushh, actually Princess Leia Organa in disguise, silenced the crowd with a blaster shot. As Doallyn hurried over to inspect the situation, he found himself thrown painfully against the wall by \"Boushh's\" quarry, the powerful Wookiee Chewbacca. Both Leia and Chewbacca were only posing as a bounty hunter and captive respectively to attempt to rescue their friend, Han Solo."}, {"tag": "p", "text": "When Jabba died, Doallyn escaped with the dancer Yarna d'al' Gargan, who knew about Dannik Jerriko killing people, and so he promised to guard her if she led him to Jabba's supply of cartridges of hydron-three that would keep him alive. Doallyn saved her from an attempted rape by Tornik and Warlug. Later, when Jerriko appeared in front of them, Doallyn shot him, which forced the Anzat to retreat into the shadows."}, {"tag": "p", "text": "With the supplies, the two fled towards Mos Eisley in a speeder. During their conversations, Doallyn confessed to Yarna about his face being hideously scarred behind his mask and how it had happened."}, {"tag": "p", "text": "Later, near to Mos Eisley, their speeder crashed into a sand pit, right next to a krayt dragon. Doallyn managed to kill it with one shot directly in its sinus cavity. Although after he had taken the pearls from its stomach, he was cutting off part of the tail as a trophy when it twitched reflexively, knocking him out. By now Doallyn had run out of hydron-three, the canisters of gas he needed to breathe to stay alive. Yarna carried him to Mos Eisley, and used some of the jewels she had been saving in order to buy back her children to buy him some more hydron-three, which saved his life. He repaid her with the dragon pearls, and together they bought back her children (Luka and Leia d'al' Gargan, named after Luke Skywalker and Leia Organa, and Nautag d'al' Gargan named after the cubs' father), bought a spaceship and left Tatooine."}, {"tag": "p", "text": "The two became free traders, specializing in textiles and gems. Yarna often danced to earn extra credits—in fact she even danced at the wedding of Han Solo and Leia Organa—and Doallyn sometimes hunted creatures to sell to zoos. Yarna's children became a jizz swing band, and together they toured the galaxy. When Yarna became a model for jeweled brassieres, Doallyn managed her career."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are actually two Doallyns in Return of the Jedi. The first is seen more closely when Chewbacca pushes him down the steps of the entrance to Jabba's Audience Chamber. This Doallyn wears a black mask and black body suit. Some believe that it is Bane Malar who is pushed down the stairs, but the two characters have different helmets and suits."}, {"tag": "p", "text": "The second Doallyn appears aboard the second skiff at the Battle of the Great Pit of Carkoon. He wears a black helmet and a white body suit. This Doallyn is killed by Luke Skywalker, yet Doallyn is supposed to have survived the battle of Carkoon and returned to Jabba's Palace to rescue Yarna d'al' Gargan. There were probably two actors wearing similar outfits and the same helmet during filming. It is assumed that the black-outfit Doallyn in Jabba's Palace is the actual Doallyn, while the white-outfit skiff guard is a completely different character that has been identified as Brock Starsher."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}