{"url": "Dobbu_Scay", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Gamblers", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dobbu Scay"}, {"tag": "p", "text": "Dobbu Scay was a diminutive amphibian gambler who was present in the Canto Casino on the planet Cantonica in 34 ABY. While inebriated at the casino, he mistook the Resistance astromech droid BB-8 for a lugjack machine and began inserting cantocoins into various slots on the droid. BB-8 encouraged Scay to insert more coins until the droid dashed off to rejoin his companions, Finn and Rose Tico. When a herd of fathiers later stampeded through the casino, Scay laughed gleefully as coins cascaded onto the floor around him in the chaos."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Drunk at the casino"}, {"tag": "p", "text": "Shortly after the outbreak of the war between the First Order and the Resistance in 34 ABY, Dobbu Scay was on the planet Cantonica in the city of Canto Bight. While gambling in the Canto Casino, he became inebriated and approached the Resistance astromech droid BB-8 on the casino's floor."}, {"tag": "p", "text": "Mistaking the droid for a lugjack machine, Scay inserted one of his stack of cantocoins into a diagnostic slot in BB-8's tool bay. This caused the droid to squawk in shock, but when nothing else happened, Scay squinted and leaned against the droid to belch angrily before inserting another coin. BB-8 remained stock still and began beeping encouragingly for Scay to insert more coins. When the gambler did so, the droid warbled happily and flashed the diagnostic light on his head in order to imitate a slot machine before making a sad, droopy coo. Scay then inserted a coin into the droid's dataport."}, {"tag": "h3", "text": "Riches from chaos"}, {"tag": "p", "text": "BB-8 eventually left to find his companions, Finn and Rose Tico, after spotting the Master Codebreaker, for whom they were searching. The droid later used Scay's coins as projectiles in order to subdue a member of the Canto Bight Police Department during the group's escape from Cantonica with the criminal DJ."}, {"tag": "p", "text": "Scay remained in the casino and was still present when Finn and Tico rode through the building on a herd of fathiers that they had freed. During the ensuing chaos, a large amount of cantocoins cascaded from one of the casino's tables onto Scay and the floor around him, causing him to laugh with glee and begin gathering them up."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dobbu Scay was a member of a diminutive, gray-skinned, bipedal species of amphibian with a flat crest extending from the back of the head. He had a studded tail that was long enough to reach the ground when he stood. His hair ran down either side of his face and was brown in color, as were his two eyes. He spoke in the Khamarese language."}, {"tag": "p", "text": "Scay was inebriated enough at the Canto Bight casino to mistake a BB-series astromech droid for a slot machine and became frustrated when he did not win any coins from BB-8. However, he was greatly pleased when he later found himself surrounded by coins while chaos reigned around him in the casino."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While in the casino, Scay wore a monocle and a black suit with black shoes, a gray shirt, and a brown sash around his waist."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dobbu Scay was a computer-generated character created for the 2017 sequel trilogy film, Star Wars: Episode VIII The Last Jedi, in which he was voiced by Mark Hamill, whose main role in the film was that of Luke Skywalker. Hamill also filmed the Dobbu Scay scene, using a full-motion capture suit with a giant-sized medicine ball to reduce his height to that of BB-8, though he did not expect to be credited for the role of Scay and assumed that it was just a simple Easter egg. The character's name is an anagram of Bob Ducsay, who worked as the film editor on The Last Jedi. On the May 17, 2021, Dobbu Scay's name was misspelt as \"Dabbu Scay\" in an episode of the Youtube series Star Wars Full Circle titled \"Clone Force 99,\" which was produced by StarWarsKids.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}