{"url": "Doc", "categories": ["Category:Canon articles", "Category:Junk droids"], "nodes": [{"tag": "h1", "text": "Doc"}, {"tag": "p", "text": "Doc was a junk droid, consisting of the head of an OOM command battle droid and the body of a KX-series security droid. Built by Akar Duel on Lotho Minor, Doc and several other droids gained their freedom and were inadvertently liberated by the arrival of the Millennium Falcon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Doc was one of many droids constructed on the junk-covered planet of Lotho Minor by Akar Duel, who tore apart other droids for the parts. Unlike many of the junk droids Duel had created, Doc was unaffected by his restraining bolt, and did not see him as \"the Maker\" or follow his orders."}, {"tag": "p", "text": "Along with Teetee and a third junk droid, Doc witnessed the Millennium Falcon land on Lotho Minor. Knowing that Akar Duel would attempt to claim the ship as his own, Doc and the two other droids went to investigate. They were met by Leia Organa and her team of rebels, who had come to examine whether the planet was suitable for a new Rebel Alliance base. The rebels drew their weapons, assuming the droids were dangerous, but Teetee urged them to remain calm, attempting to warn them of Akar Duel. Before they could, however, Duel himself arrived, surrounding the rebels with his droids and claiming the Falcon for himself."}, {"tag": "p", "text": "Doc and Teetee tried to convince Duel's other droids to break free from their programming, but one junk droid silenced them. Duel was about to take the ship when C-3PO exited it. C-3PO's lack of restraining bolt and freedom to act for himself made Duel's droids realize that they didn't have to follow their creator's orders, turning their blasters on him instead. The rebels took their chance to escape Lotho Minor in the Falcon, leaving the droids and Duel behind."}, {"tag": "p", "text": "During the time of the New Republic, Doc and Teetee resided elsewhere, having left Lotho Minor. They were approached by Bazine Netal, who wished to know of their encounter with the Millennium Falcon. Doc began to tell an exaggerated version of the story, but was stopped by Teetee. Annoyed, Netal threatened the droids with her blaster, and Doc asked Teetee to tell her the details. Upon hearing the tale, Netal was irritated, having only wanted to know where the Falcon was, and not the entire story. Teetee suggested that she speak to the bounty hunter Embo, who had previously encountered the ship. Netal left to find him, letting the droids live."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A junk droid created from spare parts, Doc had the head of an OOM command battle droid and the body of a KX-series security droid. The restraining bolt that Akar Duel placed on Doc had no effect, giving the droid the freedom to stand up to Duel. Doc had an aversion to lightsabers, and assumed anyone who carried it would be hostile. The droid also tended to elaborate the details of events, believing it was necessary to telling a story."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Doc first appeared in the comic story \"Flight of the Falcon, Part 2: The Planet of Misfit Droids\", written by Michael Moreci, illustrated by Arianna Florean and published by IDW Publishing in Star Wars Adventures 15 on October 31, 2018. Prior to the release of Star Wars Adventures 15, Moreci revealed the junk droids Doc and Teetee in artwork from the then-upcoming comic on Twitter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}