{"url": "Docking_Bay_327/Legends", "categories": ["Category:Legends articles", "Category:Docking bays", "Category:DS-1 Orbital Battle Station locations"], "nodes": [{"tag": "h1", "text": "Docking Bay 327"}, {"tag": "p", "text": "As one of many docking bays on the Death Star I, Bay 327 served as an empty hangar to check ships which had been \"sucked in\" by a tractor beam."}, {"tag": "p", "text": "Outside access to the docking bay was granted via the tractor beam. A nearby ship would be caught in the beam and dragged into the docking bay. If a ship tried to depart with the tractor beams active, the beam would again drag it back into the hangar."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Docking Bay 327, like most hangars in the Death Star, had tractor beam projectors and interior emergency repulsor fields to deal with damaged vessels. The tractor beams were used to guide craft that had either lost their engines or directional thrusters, with the emergency generators flooding a bay with repulsorfield cushion landings for a safe landing. The walls and decks, likewise, were lined with various power cell charger sockets where the parked craft could obtain fuel for their next mission. The deck also had directional markings etched into it that were illuminated by the tower to guide ships toward a safe resting place. There was also at least one large lift that transported troops, vehicles, cargo, and maintenance equipment to and from the barracks, workshops, and supply rooms that were located beneath the hangar."}, {"tag": "h3", "text": "Control room"}, {"tag": "p", "text": "Like all hangars and docking bays on the Death Star, Docking Bay 327 had a control room, or sometimes control towers, that overlooked the hangar bay, staffed by a team that monitored the approach and departure of all craft into and out of the hangars, of which it included a complete staff of maintenance personnel, emergency medical teams, flight support personnel, and droids. The control team also supplied reports to their commanding officers, and in turn issued orders to those in the hangar. The main control tower contained sensor relays, flight-tracking screens, ship-to-ship communication capabilities, tractor beam and repulsorlift controls, and consoles for regulating the magnetic fields in each of the hangars and docking bays within the respective zone. It also housed computer consoles that could access data and monitor other areas of the death star, like other docking bays, while a rack of blaster rifles were positioned close to a room's doorway so as to ensure the crew would have a quick access to weapons in the event that an enemy infiltrated the hangar. As such, it also held various security supplies, which included binders to secure prisoners during their escort to the detention levels. Aside from this, it also had a short-term cargo storage area right next to the entry doorway, which included pilot supply canisters, and the power unit was located right next to the entry doorway. The circuitry bay was located next to the power unit. The console itself had half of its station dedicated to station-wide monitoring, while the other half was focused more on local monitoring. The control room's consoles included monitors for displaying data regarding various vehicles, personnel and the general status inside the adjoining hangar, as well as schematics for almost every area inside the Death Star, as well as a built-in comlink that allowed the control room officers to communicate with Imperial stormtroopers and other personnel stationed aboard the Death Star."}, {"tag": "h2", "text": "Encounters"}, {"tag": "p", "text": "Docking Bay 327 was the location that the Millennium Falcon docked with the first Death Star. After Imperial troops searched the ship finding no one inside, a scanning crew was sent in. The scanning crew never completed their search of the ship for they were stunned, along with two stormtroopers, by the Millennium Falcon's crew. During this time, the officer in charge of the docking bay's control team was Lieutenant Pol Treidum, a gantry officer."}, {"tag": "p", "text": "From this Docking Bay, Luke Skywalker, Han Solo, the Wookiee Chewbacca, and Obi-Wan Kenobi departed to rescue Princess Leia Organa and disable the Death Star's tractor beam."}, {"tag": "p", "text": "It was in this hangar where Skywalker witnessed Kenobi's death. From this Docking Bay (after Kenobi disabled the tractor beam) Skywalker, Solo, Chewbacca, and Princess Organa left to Yavin 4. Before the Millennium Falcon's departure, however, a tracking device was secured aboard their ship, eventually leading the Death Star to the Rebel base on Yavin 4."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The set of Bay 327 was originally Docking Bay 94 as the set of the Millennium Falcon did not fit out the stage doors. It is incorrectly referred to as \"Docking Bay 3207\" and as \"hangar 3207\" in the junior novelization of The Empire Strikes Back, in Death Star novel and in Star Wars: Incredible Cross-Sections."}, {"tag": "p", "text": "The number 327 also appears in The Empire Strikes Back as the number of the platform at which the Millennium Falcon lands on at Cloud City; and in The Phantom Menace, Queen Amidala's ship is a \"J-type 327 Nubian.\""}, {"tag": "p", "text": "Besides its role in the bonus mission \"Death Star Rescue\" for Star Wars: Rogue Squadron III: Rebel Strike, Bay 327 was also used non-canonically for the Endurance bonus mission, where Luke Skywalker has to fend off in a ground melee against various Imperial soldiers and Boba Fett as well as survive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}