{"url": "Docking_Bay_7_Food_and_Cargo", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Batuu dining establishments"], "nodes": [{"tag": "h1", "text": "Docking Bay 7 Food and Cargo"}, {"tag": "p", "text": "Docking Bay 7 Food and Cargo was a restaurant operating out of Black Spire Outpost's Docking Bay 7. Food and cargo delivery shuttles landed atop the building to supply the restaurant. Rotating guest chefs, such as Strono \"Cookie\" Tuggs, worked out of the location while visiting Batuu."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Docking Bay 7 Food and Cargo was located within Docking Bay 7, an old hangar bay and landing platform on Merchant Row in Black Spire Outpost on the Outer Rim planet Batuu. Food and cargo delivery shuttles landed atop the building and lowered supplies to the businesses below. Rather than having a permanent restaurant, guest chefs visiting the planet would set up temporary kitchens to cook and serve out of the location. Local Batuuans worked as serving staff and assistant cooks for the rotating roster of restaurants. Visitors could eat within the hangar or outdoors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the destruction of Takodana Castle in 34 ABY, chef Strono \"Cookie\" Tuggs docked his modified Sienar-Chall Utilipede Transport there and began operating his traveling diner, Tuggs' Grub, out of the building."}, {"tag": "p", "text": "When Tuggs' Grub was docked there in 34 ABY, Tuggs served a variety of dishes, including A Taste of Takodana, Braised Shaak Roast, Bright Suns Morning, Bright Suns Youngling Breakfast, Felucian Garden Spread, Fried Endorian Tip-Yip, Ithorian Garden Loaf, Mustafarian Lava Roll, Roasted Endorian Tip-Yip Salad, Smoked Kaadu Ribs, and Yobshrimp Noodle Salad."}, {"tag": "p", "text": "They also served a selection of beverages, including Batuubucha Tea, Black Spire Hot Chocolate, Coca-Cola, Diet Coke, Moof Juice, Phattro, Sprite, Surly Sarlacc, Takodana Quencher, Tarine tea, and bottled water. For dessert, Batuu-bon and Oi-oi Puff were available."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Docking Bay 7 Food and Cargo is one of the restaurants in Star Wars: Galaxy's Edge, a themed attraction that opened at Disneyland Park on May 31, 2019. It has menus for breakfast, lunch, and dinner, along with children's menu items. Unlike the Disneyland location, the Disney's Hollywood Studios location serves alcohol."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}