{"url": "Doctor_Aphra_(2016)_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Doctor Aphra (2016) 1"}, {"tag": "p", "text": "Doctor Aphra 1 is the first issue of the Marvel comic book series Star Wars: Doctor Aphra. The comic, written by Kieron Gillen with art by Kev Walker and Salvador Larroca, is set after the events of Star Wars: Darth Vader, and was released on December 7, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "BECAUSE YOU DEMANDED IT!"}, {"tag": "p", "text": "Following the blockbuster finale of Darth Vader #25, the fan-favorite character begins a new journey in STAR WARS: DOCTOR APHRA #1 – the new ongoing series coming this December! From superstar writer Kieron Gillen (Darth Vader) and fan-favorite artist Kev Walker (Marvel Zombies) comes Marvel's first ongoing series starring an original character created in the comics!"}, {"tag": "p", "text": "Following her time in the clutches of Darth Vader, Doctor Aphra has barely escaped with her life. If he ever learns of her survival, he'll hunt her to the ends of the galaxy. But for now, it's time for a return to what she does best. With the droids 0-0-0 and BT-1 in tow, she's off in search of rare artifacts from the galactic center to the Outer Rim and everywhere in between. Aphra's got debts to pay after all. Just as long as she can stay one step ahead of the Empire, some Bounty Hunters and just about everyone else in the galaxy!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The first issue opens beneath the Cosmatanic Steppes, somewhere in the Outer Rim. A masked and armored explorer, Ulbik Tan, is attempting to retrieve an ancient artifact from a droid carcass deep within a cave. When he inadvertently reactivates the droid after extracting the artifact from its mechanical body, he is forced to flee, tossing a grenade behind him as he races for the cave exit on a speeder bike. As the mouth of the cave explodes, disabling his droid pursuer, he is tossed from his speeder but lands safely in a bed of grass. He removes his mask and helmet, breathing a sigh of relief, before being shot through the chest and killed by Doctor Aphra, who takes the artifact for herself."}, {"tag": "p", "text": "Victorious, Aphra pilots her own speeder, prize in hand, into a nearby settlement, Fulan Ro, where final preparations on the Ark Angel II are nearing completion. There, she is greeted by her 'murderbots,' the Tarkin Initiative droids, Triple Zero and BT-One – who inform her that the third companion of her crew, Wookiee bounty hunter Black Krrsantan is inside, working on the ship. She is then cornered by Soo-Tath, flanked by two Gigoran bodyguards. Soo-Tath, a local gangster, demands payment from Aphra. Aphra explains that the artifact she just recovered, once sold, will more than cover the substantial debt she owes Soo-Tath's organization. Eager to settle the account, Soo-Tath simply demands the artifact, so he can sell it himself. Aphra explains that without archaeological accreditation, he'd only get 0.2% of its value. Soo-Tath again demands she hand over the artifact, saying they will find another archaeologist to sell it. Realizing she can't talk her way out of this, Aphra attempts to distract the gangster and his guards and flee, but, anticipating Aphra's trick, one of Soo-Tath's bodyguards violently knocks her to the floor."}, {"tag": "p", "text": "Enter Black Krrsantan, bowcaster in hand, who growls threateningly at Aphra's assailants as he descends the Ark Angel II's exit ramp. Triple Zero translates, that as Aphra owes Black Krrsantan a similar debt, he will not allow her to be physically damaged. Aphra then proposes a bet, her Wookiee against Soo-Tath's Gigorans, double or nothing. Soo-Tath agrees. Krrsantan dispatches Soo-Tath's flank with ease, after which Aphra assures Soo-Tath that she will return and settle their account once she has sold the artifact. Having a few hours to kill before the Ark Angel II will be ready for its maiden voyage, Triple Zero and BT-One head into town \"to pick up some supplies.\" They ambush Soo-Tath in a quiet cantina and Triple Zero stabs him in the throat with a luxury-range neurotoxin, which causes Soo-Tath to collapse, dead, from what will look like a cardiac arrest."}, {"tag": "p", "text": "Later, aboard the Ark Angel II, Aphra and her crew head to Archaeo-Prime, a marketplace for the sale and purchase of archaeological relics, maintained by the Archaeological Association. Their droid representative informs Aphra, however, that she cannot sell the artifact she recovered as her doctorate has been suspended. Enraged, Aphra makes to depart, but is stopped by her father, who claims he had discovered that she lied about having discovered Abersyn symbiotes on Boothi XII, and that now she must look to her \"spiritual salvation,\" if she wants her doctorate returned."}, {"tag": "h3", "text": "University of Bar'leth, Years Ago..."}, {"tag": "p", "text": "Aphra, a student at the University of Bar'leth, is sitting in on a class of undergrads taught by Sava Toob-Nix, despite being a doctoral candidate. She manipulates the holograph he is playing for the class, angering Toob-Nix, who kicks her from the classroom. After class, her friend Susina expresses concern over Aphra's behaviour. Aphra remains confident that her final project will be so ground-breaking that Toob-Nix will have no choice but to award her a doctorate, despite her disagreeable behaviour."}, {"tag": "p", "text": "Aphra has located a vault on Boothi XII, which she believes will hold evidence of a previous civilization. To her disappointment, upon exploring the vault Aphra discovers nothing."}, {"tag": "p", "text": "Later, Toob-Nix confronts Aphra about her failure to produce a preliminary report on her findings. Mocking her for her failures, he beckons her to follow him. He leads her to a private chamber housing Abersyn symbiotes. Aphra is horrified. The symbiotes are classified beyond quarantine, destined to be fed into plasma furnaces and destroyed. If they are reactivated, they can wipe out entire civilizations. The Sava scolds her for her \"cowardice,\" then criticizes her misunderstanding archeology. Archeology, the Sava explains, is not about \"flash,\" but about determination. The Sava tells Aphra that he only chose her for doctoral supervision to withhold it from her. Leaving the Sava in his elation at having finally revealed this to her, Aphra contacts an old friend, Sana Starros, and requests her help."}, {"tag": "p", "text": "With Sana's help, Aphra has the Absersyn symbiotes stolen from the Sava's private chamber and deposited in the vault on Boothi XII. She then \"discovers\" them, and they are thereafter disintegrated by Imperial decree. She is thereby granted her doctorate."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}