{"url": "Doctor_Aphra_(2016)_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Doctor Aphra (2016) 3"}, {"tag": "p", "text": "Doctor Aphra 3 is the third issue of the Marvel comic book series Star Wars: Doctor Aphra. The comic, written by Kieron Gillen with art by Kev Walker, was released on January 18, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Arriving on Yavin 4"}, {"tag": "p", "text": "After arriving on Yavin 4, Aphra and her archaeologist father Korin Aphra find that their plan to enter the Great Temple is complicated by the presence of Imperial patrols. Aphra deduces that the Empire is still cleaning up after the Rebel Alliance. Korin, who has not kept up with current affairs, is perplexed that the rebels once had a based on Yavin."}, {"tag": "p", "text": "Aphra briefly recounts the Battle of Yavin to her father. Korin is perplexed that the Empire had a planet-destroying superweapon. Aphra confirms that the Death Star also destroyed Alderaan. Not sharing her father's \"obsession\" with the Jedi, she questions whether he believed the official story about Jedha. Korin regards the deliberate destruction of the Temple of the Kyber as an outrage. He admits that he was too distracted by his research into the Ordu Aspectu to realize that millions had died."}, {"tag": "p", "text": "Triple Zero, who was overhearing their conversation, asks Aphra if she supports tight Imperial control as the best way to protect people. Aphra responds that if she was interested in moral instruction from an emotionless killer, she would have kept working for Darth Vader. Korin is surprised to learn that his daughter worked for Darth Vader."}, {"tag": "h3", "text": "Diversions and infiltrations"}, {"tag": "p", "text": "Meanwhile, an Imperial officer informs the Imperial Captain Magna Tolvan that they have picked up a coded low-level pulse transmission, which he believes to be a rebel code. He traces the signal to a temple structure five klicks away. Tolvan orders her troops to send a speeder patrol on a standard route and then to change course when approaching the signal. She wants to spot the intruders without alerting them to the Empire's presence. Tolvan also issues orders for everyone else to be put on standby."}, {"tag": "p", "text": "An Imperial scout trooper patrol approaches the source of the signals. However, the Wookiee Black Krrsantan is lying in wait and shoots down the scout troopers' 74-Z speeder bikes with his bowcaster. Black Krrsantan kills the surviving scout trooper. Seeing the explosion, Captain Tolvan orders her troops to assume full combat engagement. However, Aphra has sent out Black Krrsantan as a decoy to drawn the Empire's attention affair. Aphra's father thinks this is not fair, which his daughter agrees."}, {"tag": "p", "text": "Captain Tolvan leads a stormtrooper patrol, ordering them to loop around the northside and to prepare for combat. Meanwhile, Krrsantan ambushes a scout trooper, hiding within the forest undergrowth. Aware of Krrsantan's fierceness is combat, she remarks that the Empire can alwaus recruit more people. Krrsantan then sends Triple Zero and his astromech droid companion BT-1 to infiltrate the Imperial base."}, {"tag": "p", "text": "The psychopathic Triple Zero grumbles about not being able to kill. Using Aphra's father's instructions, Triple Zero and BT-1 find their way to the hangar where they encounter an Imperial RA-7 protocol droid inspecting an abandoned Y-wing starfighter. Not wanting to make small talk, Triple Zero tells BT-1 to open the ventilation hatches."}, {"tag": "p", "text": "This allows Aphra and Korin to abseil up the hatches. While climbing, a Massassi piece drops out of Aphra's father's pocket. Aphra catches it and asks her father how long he had been planning the expedition. Her father responds that it's his life work since the universe needed saving."}, {"tag": "p", "text": "Meanwhile, Black Krrsantan ambushes the scout troopers, pinning them down with fire. Captain Tolvan dispatches an AT-ST walker to the scene. Krrsantan lures the walker into a swamp where the walker is attacked by an giant worm."}, {"tag": "h3", "text": "Finding the crystal chamber"}, {"tag": "p", "text": "The Aphras rejoin Triple Zero and Beetee in the abandoned rebel command room. Triple Zero greets an IT-O Interrogation Unit, saying that he is big fan of his work. Korin says that the destination they are looking for is situated above the main hall. He is shocked that the rebels established their base in an important historical site and is relieved that it was not destroyed by the Death Star."}, {"tag": "p", "text": "Aphra is dismissive of her father's research. Korin thinks this place was important and raises the topic of the Massassi. Aphra says she studied the Massassi and knows they have been extinct for millennia. Korin believes there is a connection between the ancient Aspectu and the Massassi. He finds the place they were looking for, a large room with celestial symbols etched onto the floor. Korin tells Aphra to place the crystals into the matching indents."}, {"tag": "p", "text": "Korin remarks that these symbols were identical in shape to the temple structures here and recognizes them as Ordu artifacts. He believes this will give them the location of the Ordu Aspectu's Citadel of Rur. When Korin asks how much time they have left, Aphra reassures her father that Krrsantan has a \"knack for this kind of thing.\""}, {"tag": "p", "text": "Meanwhile, the scout troopers stumble upon the site of the fallen AT-ST walker. However, Krrsantan has removed the walker's 88i twin light blaster cannon and ambushes the troopers. Back at the Great Temple, Korin inserts the crystals into the grooves. Triple Zero observes that the archaeological adventure had proved anti-climatic."}, {"tag": "p", "text": "Korin realizes that he is missing a piece. However, Aphra takes the opportunity to criticize her estranged father for causing her mother Lona Aphra to leave for the Outer Rim. She criticizes her father for prioritizing \"dead things\" over her family. Korin disagrees but Aphra responds that this archaeological expedition was another thing that miss. At that point, sunlight enters the chamber, startling Triple Zero and Aphra. Korin is pleased but Aphra remarks that he has five more seconds of smug time before they have to run for their lives."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}