{"url": "Doctor_Aphra_(2016)_9", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Doctor Aphra (2016) 9"}, {"tag": "p", "text": "Doctor Aphra 9 is the ninth issue of the Marvel comic book series Star Wars: Doctor Aphra. The comic was written by Kieron Gillen with art by Kev Walker and released on July 12, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Bargaining with Eternal Rur"}, {"tag": "p", "text": "At the Isolate-4 Lab in an Outer Rim asteroid, Dr Chelli Lona Aphra tells Black Krrsantan, Triple Zero, and BT-1 to light the fuse if something goes wrong. Dr Aphra dons her helmet over her spacesuit as she enters a sealed chamber housing the Rur crystal. Eternal Rur asks where he is and what time he is in. Dr Aphra responds that about two months have passed since the Citadel of Rur was destroyed and a few weeks since their encounter with the Queen of Ktath'atn. Aphra tells Rur that she has given him back his technopathy. The artificial intelligence vows revenge."}, {"tag": "p", "text": "After checking that the droids are safe, Dr Aphra continues. Triple Zero thinks that it is not a good idea to engage Eternal Rur due to the risk of losing control of his own body. With Rur unable to possess the droids due to the containment field, he asks Dr Aphra what she desires from him."}, {"tag": "h3", "text": "The Sotra Retreat auction"}, {"tag": "p", "text": "Several weeks later, Yonak of the Son-tuul Pride arrives with several other Rodian criminals. They are greeted by Triple Zero, who asks if he can store their weapons for safekeeping. Yonak refuses and Triple Zero acquiesces to his guest. As Triple Zero leads them down the corridor for the presentation, Yonak asks the reason for the glitz and recalls that that the last time that he met Dr Aphra was when he was a buy a droid for a waste–filled alleyway. Triple Zero tells Yonak that this is a glamorous event of considerable importance as he ushers them into a banquet room full of alien guests."}, {"tag": "p", "text": "Triple Zero then heads to the control room where Dr Aphra and Black Krrsantan are lounging. Dr Aphra has been scrutinizing the guests via surveillance cameras. The guests attending the auction include the Cyban Front, the Shadow University, the Ezaraa, the elderly Thomas Toov, and Papa Toren; leading Dr Aphra to remark that there has not been as many personages in the same room since Jabba's first wedding. Dr Aphra and her followers decide to head out before someone \"stains the furnishings.\""}, {"tag": "p", "text": "Outside, Yonak is arguing with the Hutt Sutha, a lackey of Jabba. Sutha mocks the Son-tuul Pride for their recent losses and goads Yonak by telling him that his father's bones are now fine ornament for Jabba. Yonak draws his dagger but Dr Aphra tells him to back down. She compliments Slutha for adhering to the dress code. Having prevented an outbreak of hostilities between Yonak and Sutha, Dr Aphra unveils the Rur crystal, which is stored behind a glass cylinder."}, {"tag": "p", "text": "She tells her guests that the crystal is a functioning artificial intelligence copy of a long-dead Jedi Knight. Playing to the elderly Tomas Toov, she claims that the Rur crystal is a model for those who desire immortality and that the technology predates the start of the Galactic Republic. Appealing to the scholars from Shadow University, Aphra claims that the Jedi knows things that everyone has long forgotten and contains priceless data. Dr Aphra also claims that the Rur crystal is a technopath and can control any technological body in the area. She claims that she has used bespoke technology to control the Rur crystal."}, {"tag": "p", "text": "The red Cyban Front droid leader claims that technopathy is impossible but a blue droid disagrees. The red droid claims that their circuits are sealed. Dr Aphra asks the blue droid if he wants to test her bespoke systems and opens up a narrowcast channel. Despite the blue droid's boasts, he is quickly possessed by Eternal Rur and tries to choke Dr Aphra. However, Black Krrsantan shoots him with a bowcaster."}, {"tag": "p", "text": "Yonak is satisfied but asks what would prevent any of them from taking the Rur crystal. He claims to respect Black Krrsantan but points out that he is outnumbered. Dr Aphra warns them to consider the damage to their reputation before flicking her finger, which unsheathes several hidden automated guns. Yonak thinks that it is irresponsible that she has automatic guns in a palace with a technopath. Dr Aphra flicks a remote and reassures them that she is control of everything. Before withdrawing, Dr Aphra tells her guests to work out how much they are willing to bid for the crystal and that she will speak to them personally."}, {"tag": "h3", "text": "Time alone"}, {"tag": "p", "text": "Exiting the auction hall, Triple Zero thinks that the auction went well. When Triple Zero asks Dr Aphra if anyone needs murdering, she responds that this is not the time. Triple Zero grumbles that their recent adventures have \"leaned towards the cerebral rather than the draining of cerebral fluid.\" Dr Aphra reminds the protocol droid that he \"sawed\" off the top of Krrsantan's head. Triple Zero responds that was some time ago and that he is getting bored."}, {"tag": "p", "text": "Dr Aphra promises to sort something out including getting Triple Zero upgrades if he does not murder anyone on her orders. Triple Zero then departs with BT-1 to leave their master to spend some time alone. In secret, Triple Zero contacts Darth Vader using Code-Beta-Four-V-Seven-Forty-Niner. He confides with BT-1 that he is acting in self-defense and he senses that Dr Aphra is lying. He fears that she intends to deactivate them once the auction is over."}, {"tag": "p", "text": "A holographic projection of Lord Vader appears. Triple Zero is pleased to see his master. Lord Vader says that the droids is annoyed the droids have disturbed him and says that he hopes it warrants his attention."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}