{"url": "Doctor_Aphra_(2016)_7", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra", "Category:Star Wars: The Screaming Citadel"], "nodes": [{"tag": "h1", "text": "Doctor Aphra (2016) 7"}, {"tag": "p", "text": "Doctor Aphra 7 is the seventh issue of Star Wars: Doctor Aphra and the third issue of Star Wars: The Screaming Citadel, a crossover event between Marvel Comics' Star Wars and Doctor Aphra series. Doctor Aphra 7 was written by Kieron Gillen and illustrated by Andrea Broccardo. The issue was released on May 31, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A tense reunion"}, {"tag": "p", "text": "On the run from the Queen of Ktath'atn's \"menagerie\", Dr. Aphra tells Triple Zero to bring the Ark Angel II to them. Luke Skywalker wants to hold back the menagerie but the Ark Angel flies through the wall, crushing the Abersyn symbiote–infected creatures under rubble. Dr Aphra is upset that her ship is damaged."}, {"tag": "p", "text": "Triple Zero and Beetee soon disembark from the Ark Angel II with Han Solo. Triple Zero apologizes that the \"unkempt one\" insisted that he should fly. Solo tells Dr Aphra that her ship's aft thruster was not properly aligned. Sana Starros tries to shoot Dr Aphra with her blaster but Skywalker deflects the blaster bolts with his lightsaber. Skywalker tells his rebel comrades that he and Dr. Aphra have a plan."}, {"tag": "p", "text": "While displeased with Skywalker's actions, Princess Leia Organa warns Starros that she can't shoot Dr Aphra. Starros is unrepentant and does not rule out killing Dr. Aphra if Skywalker does not stop her. Skywalker defends his actions and say that he went voluntarily with Dr Aphra. Princess Leia chides Skywalker for his \"stupidity\". Skywalker responds that Dr Aphra is an ex-Imperial agent and is \"dangerous as she is unhinged.\" When Leia asks how Dr Aphra found them, she responds that it was a lucky guess."}, {"tag": "p", "text": "Triple Zero proposes executing Dr Aphra on the grounds that she is untrustworthy. Dr Aphra demands to know the droid's loyalty but Triple Zero responds that he is loyal to himself just as she is loyal to herself. While recognizing her flaws, Skywalker speaks up for Dr Aphra because she is trying to help him find a Jedi tutor; reasoning that \"not all rogues are bad people.\""}, {"tag": "h3", "text": "Taking shelter"}, {"tag": "p", "text": "Leia agrees with Luke but chastises Luke for going AWOL. Resting his hand on Dr Aphra, Skywalker responds that she is his friend, which strikes a chord with Aphra. Since Aphra's ship is damaged, Leia asks what is the best way from the Citadel of Ktath'atn. Solo alerts them to the Queen's acolytes Varroa and Vespinax, and guards. At Dr Aphra's advice, they retreat into a laboratory that is sheltered by blast doors."}, {"tag": "p", "text": "Beetee seals the doors with an arc welder. Princess Leia asks about sealing the other doors but Sana Starros and Dr Aphra notice that the laboratory is storing abersyn symbiotes. Dr Aphra explains that the abersyn symbiotes are a noxious hive control system that infects living organisms like a virus; opining that they are so dangerous that even the Galactic Empire doesn't risk weaponizing them. Dr Aphra believes that the Queen has been breeding abersyn symbiotes for a hundred years."}, {"tag": "p", "text": "Dr Aphra proposes checking the multiple exits, anti-chambers, and blast doors. Luke agrees to help Dr Aphra secure the exits but disagrees with her support for the Empire. Dr Aphra explains that her mother Lona Aphra was killed during the Clone Wars and that the Empire is not perfect but keeps people safe. Luke responds that the Empire is evil. Dr Aphra counters that while the Empire is not for \"people\" like them, she responds that it brings peace for normal people. Skywalker remarks that Aphra's attitude reminds him of Han Solo's sarcasm."}, {"tag": "p", "text": "When Dr Aphra insinuates that Skywalker had a carefree upbringing, Skywalker reveals that his adoptive parents were murdered by the Empire. Realizing the loss that Skywalker went through, Dr Aphra apologizes for her remarks. Luke forgives her, saying that they all make mistakes."}, {"tag": "h3", "text": "Evading the Queen"}, {"tag": "p", "text": "At that point, the Queen of Ktath'atn enters the laboratory with her guards. She forces Luke to kneel but Dr Aphra is able to resist her hypnotic influence through her polarized goggles. Dr Aphra threatens to blow Skywalker up if she double-crosses her again. The Queen agrees to show Dr Aphra how to reactivate the Rur crystal. Princess Leia spots Dr Aphra, Luke and the Queen but are forced to hide when the Queen orders her guards to destroy the intruders."}, {"tag": "p", "text": "Princess Leia tries to warn Han Solo that the Queen has got some kind of hypnotic powers. However, Solo dismisses the threat and attempts to confront the Queen with a blaster. However, the Queen hypnotizes Solo. Sana angrily warns Dr Aphra that someone will one day make her pay. Dr Aphra tells Starros that the back wall is thin enough for Beetee to blow and convinces her estranged friend to retreat behind the blast doors."}, {"tag": "p", "text": "Inside the laboratory, Princess Leia vows not to leave Han and Luke behind despite their incompetence. Sana Starros thinks Han is opportunistic but Leia disagrees. Princess Leia asks Beetee if the droid has enough explosives to blow the back wall. The astromech droid sports his explosives. Leia tells everyone to take cover."}, {"tag": "p", "text": "Triple Zero convinces Essfour to recover an abersyn symbiote from one of the tanks, telling the droid to turn off its pain receptions. After blowing the back wall, Leia, Starros, Triple Zero, Beetee, and Essfour retreat out of the laboratory. They save the unconscious Wookiee Black Krrsantan from being killed by Bombinax. After fighting off Bombinax, the group evacuate Black Krrsantan into the laboratory."}, {"tag": "p", "text": "Triple Zero then implants an abersyn symbiote into Black Krrsantan. When Leia asks Triple Zero if the Wookiee is his friend, the protocol droid responds that Black Krrsantan is merely a tool. When Leia calls Triple Zero a monster, the droid responds that he and Beetee have proven themselves as 100 percent efficient assets to fulfill her ends. Given the shortcomings in her friends, Triple Zero suggests that they would be a lot more happy if they were like them.\nTriple Zero manages to complete the operation just in time as Bombinax break through the blast door."}, {"tag": "p", "text": "Bombinax attempts to take them prisoner for the Queen but the rejuvenated Wookiee attacks the Queen's lieutenant. Triple Zero warns Leia and Starros to stay back since this \"tool\" will be particularly messy."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}