{"url": "Doctor_Aphra_(2016)_8", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra", "Category:Star Wars: The Screaming Citadel"], "nodes": [{"tag": "h1", "text": "Doctor Aphra (2016) 8"}, {"tag": "p", "text": "Doctor Aphra 8 is the eighth issue of Star Wars: Doctor Aphra and the fifth and final issue of Star Wars: The Screaming Citadel, a crossover event between Marvel Comics' Star Wars and Doctor Aphra series. Doctor Aphra 8 was written by Kieron Gillen and illustrated by Andrea Broccardo. The issue was released on June 28, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A hive divided"}, {"tag": "p", "text": "After being infected with an Abersyn symbiote, Luke Skywalker proclaims himself King of the hive and names the Queen of Ktath'atan as his queen. The Queen refuses to surrender her dominion to anyone, claiming that she is in charge. The infected Skywalker demands that she submit and parries at her with his lightsaber."}, {"tag": "p", "text": "With their Queen distracted, her lieutenants Varroa and Vespinax decide to take over the hive with Han Solo at their side. After the minions leave the throne room, Dr Aphra slips Skywalker the Rur crystal in order to give him an edge in the psychic match. Meanwhile, Solo orders the Queen's guards to kill the rebels, droids, and the Wookiee Black Krrsantan. Princess Leia Organa convinces Han to fight against the infection and he snaps out of the trance. Varroa and Vespinax order the guards to kill Han and his comrades. Han tells his rebel comrades Leia and Sana Starros to fire back and unleashes Black Krrsantan on the guards."}, {"tag": "h3", "text": "A psychic duel"}, {"tag": "p", "text": "Back in the throne room, Skywalker and the Queen engage in a psychic struggle through the Force. Eternal Rur speaks to Skywalker through the Rur crystal and tries to possess him, claiming to be an ally against the Queen. However, Skywalker does not trust the artificial intelligence. Eternal Rur introduces himself and adds that Dr Aphra had him project himself into Luke's consciousness."}, {"tag": "p", "text": "He offers to assist Luke in the psychic duel, telling him that he has been compromised by an alien parasite. Eternal Rur proposes that Skywalker take control of his symbiote and use it to slay the Queen and take over the hive. However, Skywalker rejects Eternal Rur's offer of alliance on the grounds that the entity is not a Jedi and rejects Rur's help. At that point, the Queen's symbiote kills Luke's symbiote."}, {"tag": "p", "text": "The Queen thinks she has won but realizes that Skywalker has separated himself from the symbiote through the Force. Skywalker then cuts down the Queen with his lightsaber, killing her and eliminating her threat. Dr Aphra watches in shock at the fallen Queen."}, {"tag": "h3", "text": "Breaking the Queen's spell"}, {"tag": "p", "text": "Meanwhile, Solo's guards are outmatched by Varroa and Vespinax, who are fighting for control of the hive. Just then, Solo, Varroa, Vespinax, and the guards sense the Queen's death trough the symbiote hive mind. Leia realizes that Skywalker has defeated the Queen and shoots Varoa dead. Before Vespinax can escape, Black Krrsantan finishes her off."}, {"tag": "p", "text": "The guards proclaim Han Solo as their new king but Han declines after learning the responsibility that it entails. He instead orders the hive mind to leave the guards and the former Queen's subjects, freeing them. As the guards and Black Krrsantan celebrate, Starros sarcastically ponders how they are going to live with this. When Solo proposes doing the Kessel Run again, Leia has Triple Zero sedate him."}, {"tag": "p", "text": "Skywalker then reappears with Dr Aphra and apologizes for the trouble he has caused. Leia instead hugs him. When Triple Zero asks if he can be of service, Leia tells him to remove the parasite from Solo. Dr Aphra then sends Beetee to destroy the symbiote laboratory in order to eliminate the threat of the parasites. Dr Aphra, who is an expert on the symbiotes, tells them they should alert the Galactic Empire because the symbiotes is something they would take seriously."}, {"tag": "p", "text": "Solo is annoyed that Triple Zero injected him with a fast acting neurotoxin. Triple Zero responds that Leia should have specified a painkiller. Princess Leia is relieved that Solo is alive while Solo regrets his overconfidence. Leia says she is grateful to her friends. Meanwhile, Dr Aphra and Sana Starros reconcile with Starros thanking Aphra for coming back for her and her friends."}, {"tag": "p", "text": "However, Skywalker is upset with Dr Aphra's betrayal. Dr Aphra tries to make amends by offering him access to the Rur crystal. However, Skywalker rejects her offer because the Rur crystal is not a Jedi artifact. Skywalker accepts that it will be hard to find information about the Jedi. Dr Aphra is apologetic but Skywalker refuses to trust her because he dislikes people who use \"shortcuts to get what they want.\" He tells Aphra to stay away from him and his friends."}, {"tag": "h3", "text": "Separate paths"}, {"tag": "p", "text": "Dr Aphra departs Ktath'atn aboard the Ark Angel II with Triple Zero, Beetee, and Black Krrsantan. Spurned by Skywalker, she dismisses him as a \"judgmental piece of blond Tatooine bantha dung.\" Triple Zero observes that Skywalker went through a traumatic experience but remains a positive, delightful person devoted to a better existence for all sentient life. He chides Dr Aphra for underestimating Skywalker's importance and tells Aphra that Luke reminds her of her personal failings. Taking offense, Dr Aphra exits the cockpit and tells Krrsantan to take over the controls. Triple Zero does not realize that he has offended Dr Aphra."}, {"tag": "p", "text": "Meanwhile, aboard the Millennium Falcon, Skywalker is upset that Dr Aphra's droids lobotomized Essfour and asks how the two could have been friends. Starros admits she does not have a good answer to that. Princess Leia tries to be optimistic and reminds the rebels that they saved the day and freed people and that they should be grateful. Solo asks if he could have another medal as a souvenir."}, {"tag": "h3", "text": "Evil escapes"}, {"tag": "p", "text": "Back at the Screaming Citadel, two humans visit the ruined tower. The male human thinks that they should leave but the female thinks that they could find something valuable to sell among the ruins. The female finds the corpse of the fallen Queen and a still living Abersyn symbiote, which infects her. The girl calls out Skywalker's name."}, {"tag": "p", "text": "The male human finds that his female's companion now has a scar across her face, red markings on her cheeks, and that her eyes have turned white. The female merely responds that she made an error of judgement and that they need to leave quickly because their future is elsewhere."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}