{"url": "Doctor_Aphra_(2016)_6", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Doctor Aphra (2016) 6"}, {"tag": "p", "text": "Doctor Aphra 6 is the sixth issue of the Marvel comic book series Star Wars: Doctor Aphra. The comic is written by Kieron Gillen with art by Kev Walker. It was released on April 12, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "In the presence of the \"Eternal Rur\""}, {"tag": "p", "text": "At the Citadel of Rur, a snowtrooper tells Captain Magna Tolvan that the \"prisoners\" have taken cover in the levitating core. Since they are unable to enter it, the snowtrooper proposes bringing an astromech droid to try and slice the system in order to re-initiate the bridge. Tolvan sees his points but says that the area below the bridge opens directly into space. She tells them to signal the Lambda-class shuttle to bombard their target."}, {"tag": "p", "text": "Meanwhile, Chelli Lona Aphra strikes a deal with Eternal Rur, who is speaking through droids, to tell him the time in return for Rur telling them what happened to the Citadel. The Eternal Rur explains that the orthodox Jedi Order and Ordu Aspectu had signed a peace treaty following the Entruvia Conflict which allowed the Jedi ton inspect the Ordu's work for signs of \"dangerous heresy.\" Claiming to be Rur, the Eternal Rur tells them that he had conducted research to create a copy of his intellect."}, {"tag": "p", "text": "However, Rur claims that research had gone awry and he claims to have moved his sentience into the computer core, leaving an evil ghost inhabiting his fleshly body. When the Jedi inspected the Citadel of Rur, the Eternal Rur had taken over the machines and attacked both the Ordu Aspectu and Jedi, killing many. Amon and \"Fake Rur\" survived and attempted to deactivate \"Eternal Rur\"."}, {"tag": "p", "text": "\"Eternal Rur\" claims that he sent the Citadel of Rur hurtling into space to prevent reinforcements from locating them. Since the Jedi lacked Ordu crystals, they were unable to track them down. Amon managed to stop the Citadel's power generator before he could kill him. He claims that \"Fake Rur\" managed to dislodge the crystals, deactivating him for a long time. \"Eternal Rur\" believes that the droids purged the organics until their power ran out."}, {"tag": "h3", "text": "The wrath of Eternal Rur"}, {"tag": "p", "text": "\"Eternal Rur\" now demands that they uphold their side of the bargain. Based on the Domancion Accord's calendar, Korin Aphra estimates that Eternal Rur predates the Galactic Republic, which had stood for a thousand years. Eternal Rur is enraged to learn that everyone that he knew is dead and that his dreams of building an empire are gone. Unable to punish the dead, he decides to punish the living and activates his droids. Aphra fights them off."}, {"tag": "p", "text": "Since Black Krrsantan has abandoned them, Aphra tells her father they should steal the Imperial's Lambda-class shuttle. To activate the bridge, they need a crystal. However, Korin tells her to destroy the console and take the crystals from there. Aphra wraps her father's broken right arm. She then ascends on the lift into the computer core and proceeds to hack the machine with her blue lightsaber."}, {"tag": "p", "text": "In the process, Aphra also steals a cylindrical green crystal. She then places an Ordu crystal into the bridge control panel, activating the bridge. Returning to the bridge, she finds Captain Tolvan and her snowtroopers under attack from Rur's droids. Aphra tries to usher them to safety but changes her mind and removes the crystal, causing the snowtroopers to fall into the abyss with the droids. Only Captain Tolvan survives the fall."}, {"tag": "p", "text": "Captain Tolvan demands to know what Aphra did to cause the place to self-destruct. Aphra claims she did nothing and tells Tolvan to signal her ship and bring it around. When Tolvan asks what happened to Aphra's ship Ark Angel II, Aphra replies that is complicated. Aphra, Korin, and Tolvan flee aboard Tolvan's shuttle."}, {"tag": "h3", "text": "Twilight of the Ordu Aspectu"}, {"tag": "p", "text": "Inside the cockpit, the Aphras and Tolvan discovered that Eternal Rur had taken over the RA-7 protocol droid, which killed the pilots. The possessed droid knocks Tolvan to the ground and attempts to strangle Aphra. However, the Citadel of Rur explodes, seemingly destroying Eternal Rur. The protocol droid resumes its normal programming. Korin remarks that this is the twilight of the Ordu Aspectu."}, {"tag": "p", "text": "An enraged Tolvan brandishes a blaster and demands to know who Aphra is. However, Korin wounds Tolvan in the right arm with the salvaged lightsaber. Later in the Outer Rim Territories, Aphra drops Tolvan and the RA-7 droid on an unknown world. She remarks that killing her is the only smart move but that she is cute. Korin quips that his daughter has a \"bad taste\" in women. Aphra responds that it runs in the Aphra family."}, {"tag": "p", "text": "Aphra shows her father the cylindrical crystal core she salvaged from the Citadel of Rur. Regarding the object as pure evil, Korin doesn't want to reactivate it. However, Aphra convinces her father to store the crystal on Quarantine World III in Kallidahin Space. The Crystal core is stored in a secure vault."}, {"tag": "p", "text": "After departing Quarantine World III, Aphra reassures her father that the planet is the safest place in the galaxy to store something as dangerous as Rur's crystal core. Korin admits that he was wrong to look to the past for deliverance. He prays that this hope will lie in the future and strives to find it. He thanks Aphra, who convinces her father to sort out her doctorate problem. With father and daughter on better terms, Korin agrees to get rid of the incriminating evidence."}, {"tag": "h3", "text": "Back to business"}, {"tag": "p", "text": "Returning to the Cosmatanic Steppes, Aphra convinces the droid Ergo to sell several lightsaber artifacts. Though the droid accepts her goods, the money that he pays her is not what she had hoped for. At a Cosmatanic Steppes bar, Aphra meets Soo-Tath's brother who tells her that her debt has been settled. When he asks where is her ship, Aphra replies that is a good question."}, {"tag": "p", "text": "Just then, Black Krrsantan turns up and greets Aphra. She holds him no hard feelings since she understood that he was only looking after his own skin. Aphra says that she has not forgotten that she owes him as well. Aphra reveals that the green cylindrical crystal core she handed her father Korin was a fake and that she had kept the real one all this time. She tells Krrsantan that the crystal presents them with an opportunity to get rich."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}