{"url": "Doctor_Aphra_(2016)_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Doctor Aphra (2016) 4"}, {"tag": "p", "text": "Doctor Aphra 4 is the fourth issue of the Marvel comic book series Star Wars: Doctor Aphra. The comic was written by Kieron Gillen with art by Kev Walker. It was released on February 8, 2017."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "On Yavin 4, Captain Magna Tolvan notices the bright activity emanating from the top of the Great Temple and realizes that the Wookiee Black Krrsantan was a distraction. She orders her troops to converge on the Great Temple and to capture the intruders."}, {"tag": "p", "text": "At the top of the temple, Chelli Lona Aphra impatiently tells her father Korin Aphra that they have to leave. Korin responds that he is gathering readings on his device. Aphra tells BT-1 to inform Krrsantan that they are leaving on the Ark Angel II and to ready the ship for departure. Before they can flee, Aphra encounters an Imperial officer and several stormtroopers."}, {"tag": "p", "text": "Korin wants to retrieve the kyber crystals but Aphra tells them they have to free. BT-1 manages to delay the Imperial pursuers by hurling bombs, killing them. Triple Zero praises his astromech droid counterpart for eliminating the enemy. Aphra and her team flee through the main hall but encounter more stormtroopers. Aphra exchanges while her father and the others retreat."}, {"tag": "p", "text": "Beetee activates some retractable ramps which allows Triple Zero to ride him. They manage to exit the main hall only to run into the path of an AT-AT walker. Captain Tolvan orders Aphra and her companions to lower their weapons and demands to know what they are doing in an area under strict Imperial control. Aphra and her father drop their weapons but Captain Tolvan orders her stormtroopers to open fire on them."}, {"tag": "h3", "text": "Escaping Yavin 4"}, {"tag": "p", "text": "However, Krrsantan arrives on the Ark Angel II and opens fire on the stormtroopers, allowing Aphra and her companions to flee aboard the ship's ramp. Aphra herself is the last to flee and clings on to the ship's ramp. Her father helps her aboard the ship and tells her that she had stayed away from the fieldwork, she would on the tenure track by now. Krrsantan flies them out of Yavin, leaving a frustrated Captain Tolvan behind."}, {"tag": "p", "text": "After escaping Yavin 4, Aphra and Korin put aside their differences. Aphra tells her father that she is willing to jump through any hoops to reach his Ordu Aspectu. Korin reassures her that he may has the direct coordinates to the Citadel of Rur. Krrsantan takes the ship into hyperspace."}, {"tag": "h3", "text": "Captain Tolvan's report"}, {"tag": "p", "text": "Back on Yavin 4, Captain Tolvan delivers a hologram report about the \"rebel\" raid to Admiral Ozzel. Tolvan thinks that the rebel activities to disrupt their operations suggests that the Rebel Alliance left something behind at their base. She opines that the Imperial mission may not have been a complete waste of time."}, {"tag": "p", "text": "Ozzel opines that finding something would have been a sore disappointment to the departed Grand General Cassio Tagge. She reminds Tolvan that her assignment to Yavin 4 was a punishment duty for her failure with security on Eadu. When Ozzel asks about the rebels, she claims that she only has preliminary data not worth sharing."}, {"tag": "p", "text": "Ozzel reminds Tolvan that she was once a successful candidate for greatness and that she should be grateful that her commanding officer was Tagge. Ozzel adds that Lord Vader is less forgiving of failure. He warns Tolvan that her efforts still fall short of Imperial standards. Captain Tolvan and her troops then depart on a Lambda-class shuttle."}, {"tag": "h3", "text": "Onwards to the Citadel"}, {"tag": "p", "text": "Exiting hyperspace aboard the Ark Angel II, Korin is taken by surprise upon realizing that the Citadel of Rur is real. The city is built on a floating asteroid. After landing in the ruined city, Aphra, Korin, Krrsantan, Triple Zero, and BT-1 stumble upon the skeletal remains of fallen Jedi."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}