{"url": "Doctor_Aphra_20", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Doctor Aphra 20"}, {"tag": "p", "text": "Doctor Aphra 20 is the twentieth issue of the Marvel comic book series Star Wars: Doctor Aphra. The comic was written by Simon Spurrier with art by Kev Walker and was released on May 23, 2018. The issue contains the story \"The Catastrophe Con Part I,\" in which Doctor Aphra is a prisoner aboard the Galactic Empire's Accresker Jail."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "BROKEN, INSIDE BEGINS NOW! Aphra is behind bars. Again. But this time, she finds herself in Imperial custody, strapped to an explosive transmitter synced to a single hub-droid. Take one step too far? KABLOOEY! Normally, this wouldn't be an issue to sit still for Aphra – but what happens when her Imperial captors send her hub-droid to the middle of a war zone? And, uh, what's this rumor about the prison being haunted?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A week after her capture during a Galactic Empire attack on the Son-tuul Pride criminal syndicate, the rogue archaeologist Doctor Chelli Aphra is a prisoner aboard the mobile Imperial wreckage-prison Accresker Jail, which consists of a mass of starship wreckage pulled by a cruiser. As a prisoner, Aphra is forced to serve in the Accresker Penal Legion, an expendable force deployed into battle by the Empire. While being interrogated by an Imperial officer, Aphra recounts the events of the previous battle, an attack on a Rebel Alliance frigate."}, {"tag": "p", "text": "During the battle, Aphra sabotages the hubdroid supervising her squad, causing it to explode. The explosion kills all the prisoners in the squad, aside from the fearful electrician Lopset Yas. With the destruction of their hubdroid, the proximity bombs implanted in Aphra and Yas' necks threaten to detonate, but the two prisoners are rescued by another hubdroid—Dek-Nil, a droideka modified by Aphra who had also been collected by the Empire. Meanwhile, on the planet Son-tuul, the assassin droid 0-0-0, whose status at the front of the Son-tuul Pride was lost in the recent attack, stands within the wreckage of the Son-tuul Spaceport with fellow assassin droid BT-1. The droids intend to hunt down Aphra, who had previously placed an encryption on the memories of the Triple-Zero protocol personality matrix, which Triple-Zero had forced the archaeologist to retrieve for him."}, {"tag": "p", "text": "Aboard Accresker Jail, Aphra leads Dek-Nil and Yas away from the battle in an attempt to escape the prison. They encounter an intact escape pod, trapped at the edge of Accresker Jail's airshield. Before the prisoners can escape, however, an unseen force pushes Dek-Nil's restraining bolt through the beskar casing that protects his control circuit, allowing the Imperial programming to overtake him. Dek-Nil destroys the escape pod, foiling Aphra's escape plan. As the escape pod explodes, Aphra notices a ghostly figure nearby, who speaks of justice. The battle comes to an end, and the prisoners are ordered to return to Accresker Jail. Aphra loses sight of the figure, and is forced to give up, retreating back to the prison."}, {"tag": "p", "text": "The officer terminates the interrogation, and his lieutenant concludes that Aphra is hiding something from the interrogator droid. Aphra, with no plan and no hope of escape, is escorted back to the prison by Dek-Nil, who is still under the control of the Imperial restraining bolt. When Aphra returns to her quarters, she meets Yas, who offers her a transmitter that he built from scrap. With the Empire able to track and jam any unwanted signals, Yas gives Aphra one chance to contact anyone in the galaxy. At the same time, the smuggler Sana Starros receives a communication via a holocomm."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}