{"url": "Doctor_Aphra_40", "categories": ["Category:Real-world articles", "Category:Star Wars: Doctor Aphra"], "nodes": [{"tag": "h1", "text": "Doctor Aphra 40"}, {"tag": "p", "text": "Doctor Aphra 40 is the fortieth and final issue of the canon comic book series Star Wars: Doctor Aphra. It was written by Simon Spurrier, illustrated by Caspar Wijngaard, and published on December 11, 2019 by Marvel Comics. The issue features the story \"A Rogue's End Part IV,\" in which Doctor Aphra faces off against Darth Vader."}, {"tag": "p", "text": "The series is concluded in the related comic story titled \"Epilogue,\" by Spurrier, and it will continue in the second Doctor Aphra volume."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A ROGUE'S END! All good things must come to an end. Unfortunately, so must all evil things. And probably also all things somewhere-in-the-middleit's-complicated. Renegade archaeologist DOCTOR APHRA has been outrunning fate far longer than anyone dared hope. But her time is finally up. DARTH VADER stalks her through the shadows of an ancient temple, and this time? Only one of them will be leaving in one piece."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Separate paths"}, {"tag": "p", "text": "The story opens with Dr Aphra making a recording following the events of the story. Dr Aphra tells her father Korin Aphra and former companion Vulaada Klam that she is sorry that she left them. She says that since she can't change, the best thing she can do is shield those that you love from your defect. Aphra believes that she is a lost cause who cannot be help but tells Korin and Vulaada to watch each other's backs. She believes that the two are safer without her."}, {"tag": "p", "text": "Meanwhile on Ash Moon 1, Dr Korin Aphra comforts Vulaada Klam as the two face down several approaching monsters. Before the monsters can finish them off, they are rescued by Captain Magna Tolvan, who has arrived on a U-wing."}, {"tag": "h3", "text": "Leading Lord Vader astray"}, {"tag": "p", "text": "As Dr Aphra narates her recording, she reasons that she ended up the way that she had always expected. She believes that she is staring at her own death with noting but her own treachery for company. Dr Aphra tells Darth Vader that she has intelligence on a rebel base in Tython's Meridional Ice Cap but claims they will have their defenses up in two weeks."}, {"tag": "p", "text": "Colonel Bryce says that the Imperial fleet cannot detect a single trace from the rebel base, leading him to believe that the rebels have dug themselves deep. He thinks that Lord Vader would like to scout the area. Internally, Dr Aphra braces herself for certain death in her mission to lead the Empire away from the true location of the rebel base."}, {"tag": "p", "text": "Dr Aphra leads Lord Vader and a unit of Snowtroopers through the Martyrium of Frozen Tears. Vader orders the lead snowtrooper to have the droid Triple Zero watch Dr Aphra closely. Lord Vader senses that Dr Aphra is being deceitful and warns that she will die if the rebels are not here."}, {"tag": "p", "text": "The snowtrooper reports that the scanning machine cannot pick up any energy, heat or movement. Lord Vader orders Triple Zero to kill her but BT-1 activates an enclosure that separates them from the Imperials. Dr Aphra thanks Beetee before removing the restraining bolts from Triple Zero and BT-1. The sadistic Triple Zero toys about celebrating his freedom by killing Dr Aphra but she convinces the droids to help her hold off the vengeful Vader and his snowtroopers."}, {"tag": "h3", "text": "Facing down Lord Vader"}, {"tag": "p", "text": "Lord Vader uses his Force powers to force his way into the Martyrium of Frozen Tears. He orders the First Squad to proceed eastward but to leave the woman to him. Reflecting on these events, Dr Aphra confides that she had preferred a galaxy under the jackboot but always made an exception for herself. Realizing the structure is rigged, Lord Vader orders Colonel Bryce to withdraw his men to their ships."}, {"tag": "p", "text": "Meanwhile, Triple Zero slaughters several snowtroopers. In her monologue, Dr Aphra opines that she prefers chaos, which she defines as \"doing what you want and ignoring the consequences.\" As Darth Vader closes in on her with his lightsaber, Aphra admits that being a \"one-woman trail of destruction\" has not brought her health or happiness. At Aphra's prompting, BT-1 knocks over the Icon of Blessed Balance."}, {"tag": "p", "text": "While Dr Aphra reflects on the meaning of life and relativism, BT-1 unleashes his fire power on several approaching snowtroopers. Reflecting on her adventures, Dr Aphra quips that having friends and family makes great company but that in her case it never seems to turn out too well for the company in question. Lord Vader cuts down several stone pillars with his lightsaber. Starring Lord Vader down, she tells him that they need to talk. The Sith Lord orders her to kneel but he is attacked by Triple Zero."}, {"tag": "p", "text": "However, the Sith Lord uses his lightsaber to cut Triple Zero to pieces. Before being disemboweled,  Triple Zero manages to fire tracers which cause Vader's armor to explode and short-circuit. This causes Vader to experience flashbacks of his fall to the dark side, his duel with Obi-Wan Kenobi and learning about the death of Padmé Amidala."}, {"tag": "p", "text": "Aphra realizes that she has cornered Lord Vader inside a confessional made of solid kyberite, which weakens his Force powers. She taunts Lord Vader about his regrets, prompting him to hurl his lightsaber at her. It misses but slices off a pillar. BT-1 attacks the Sith Lord with his arsenal. However, the rejuvenated Sith Lord uses his Force powers to rip the droid apart. However, Lord Vader is weakened by his exertion and falls to the groud."}, {"tag": "p", "text": "While Lord Vader struggles with his internal battles and emotions, Dr Aphra observes Vader's difficulty with burying his pain. When she remarks that she knows a guilty \"freaking disaster\" when she sees want, Vader vows that Dr Aphra will not be the hand that will kill him. Dr Aphra disagrees, saying she is his biggest fan and adds that she is not stupid enough to think \"down equals beaten.\" Dr Aphra taunts Lord Vader about being a \"lost little boy\" before using her blaster to stun him. She tells him not to pick a fight with an archaeologist and tech criminal if he is half machine."}, {"tag": "h3", "text": "Aphra's victory and escape"}, {"tag": "p", "text": "Aboard the Super Star Destroyer Executor, Colonel Bryce receives a transmission from Lord Vader and asks if they should begin troop deployment. However, Lord Vader demands access to the data registry for Project Swarm. Bryce wants to check with Admiral Ozzel but Lord Vader countermands him. Bryce obliges after Lord Vader provides him with the daily command code \"Theta-Six-Six-Delta-Indigo-Four.\""}, {"tag": "p", "text": "Bryce is alarmed when Lord Vader appears to be deleting the records of several probe droids. In truth, Dr Aphra had coerced Lord Vader into deleting the records from the probe droids in order to help her friends in the Rebel Alliance. Lord Vader is furious but Aphra counters that he should be grateful that she did not tell Bryce to order the probe droids to self-destruct."}, {"tag": "p", "text": "Dr Aphra thinks that should give the rebels a few weeks to evacuate Echo Base. In a flashback, Dr Aphra tells Captain Tolvan to prepare to evacuate in a few weeks. While Dr Aphra believes that she is beyond the hopes of forgiveness and a happy ending, she believes time is precious and focuses on staying ahead of her execution. Meanwhile on Hoth, Captain Tolvan, Korin, and Vulaada ride tauntauns outside Echo Base."}, {"tag": "p", "text": "A vengeful Lord Vader vows to find her but Aphra is not afraid and says that she hopes that one day the Sith Lord will get to know how it feels to do something good. After wishing the Sith Lord goodbye, she tells him that he is the best thing that happened to her. Dr Aphra escapes Tython aboard a stolen Imperial ship with the damaged BT-1 and Triple Zero."}, {"tag": "p", "text": "In the present, Dr Aphra continues her recording, telling Tolvan, Vulaada and her father that she is glad they are together. She tells them not to be sad for her, stuck out her alone. She tells them that love is letting go before ending the recording. Dr Aphra instructs Beetee, who has been reduced to a processing unit, to transmit the encrypted recording to Hoth."}, {"tag": "p", "text": "When Triple Zero reminds Dr Aphra that he and Beetee are still in pieces and asks where they will begin their eternity of terrified pursuit, Dr Aphra replies that she was thinking about that. She tells Triple Zero that she wants to see everything."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}