{"url": "Dodson_Makraven/Legends", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Articles with gameplay alternatives", "Category:Individuals of unspecified species", "Category:Males", "Category:Obsidian Squadron members"], "nodes": [{"tag": "h1", "text": "Dodson Makraven"}, {"tag": "p", "text": "Dodson Makraven was an Imperial TIE pilot who attained many kills in atmospheric combat, and would later join the Imperial Obsidian Squadron flying as the wingman of the squadron's lead pilot, Civé Rashon. At some point during the Galactic Civil War, Makraven attempted to destroy an Alliance to Restore the Republic starship that had fled to an asteroid belt after being disabled in the Outer Rim Territories, although Makraven's attempt failed, with the Alliance starship being repaired and escaping the Imperial ambush."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dodson Makraven was a TIE pilot in the Imperial Navy during the Galactic Civil War fought between the Galactic Empire and the Alliance to Restore the Republic. At some point during the conflict, Makraven had attained many kills in atmospheric combat. He would also earn the nickname of \"Night Beast\" for many curfew violations. Makraven joined the Imperial Obsidian Squadron, flying under the call sign of Obsidian 2, with the further designation of OS-72-2. In his Obsidian Squadron service, Makraven flew as the wingman of Civé Rashon, the squadron's lead pilot, who flew under the call sign of Obsidian 1. At some point after he obtained the nickname of \"Night Beast,\" Makraven and at least one other TIE/LN starfighter pilot attacked an Alliance starship that had fled into an asteroid belt after being disabled by an Imperial outpost in the Outer Rim Territories, with Rebel pilot Luke Skywalker flying a T-65 X-wing starfighter in defense of the ship."}, {"tag": "p", "text": "Ultimately, the Alliance starship was repaired and managed to flee from the TIE pilots."}, {"tag": "p", "text": "At another point during the Galactic Civil War, Makraven flew his TIE/LN starfighter through Cloud City on the planet Bespin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Makraven wore the standard helmet for TIE pilots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dodson Makraven was created for a card in the 1998 Special Edition Limited expansion set of Decipher's Star Wars Customizable Card Game. In 2012, he was also included in Mission 2: Asteroid Run, a starfighter combat scenario written for the Star Wars: X-Wing Miniatures Game and published as a rules supplement in the Star Wars: X-Wing Miniatures Game Core Set. In that scenario, Makraven is described as flying alongside Mithel, a TIE pilot whose death in the Battle of Yavin is clearly depicted in the 1977 film Star Wars: Episode IV A New Hope. As the scenario described in Mission 2: Asteroid Run is clearly chronologically after the events of A New Hope, given Luke Skywalker's involvement—while A New Hope shows the Battle of Yavin was Skywalker's first time in starfighter combat—this article treats a second TIE pilot participating with Makraven in the attack on the Alliance starship as canon, without mentioning the identity of the individual."}, {"tag": "p", "text": "Mission 2: Asteroid Run has more than one possible ending as well. Other possible outcomes involve the TIE pilots destroying the Alliance starship, or the starship being destroyed if it flees while its communications relay and hyperdrive engine have not yet been fully repaired. Alternatively, the Alliance ship will also be destroyed if it flees off of a non-Imperial or Alliance edge of the play area. This article assumes the outcome depicted in the in-universe portion, where the Alliance starship manages to successfully flee from the TIE pilots after undergoing repairs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}