{"url": "Dogfight_over_Concord_Dawn", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles in the Mandalore sector", "Category:Events during the Imperial Era"], "nodes": [{"tag": "h1", "text": "Dogfight over Concord Dawn"}, {"tag": "p", "text": "During the early rebellion against the Galactic Empire, the rebels of Phoenix Cell were engaged by the Protectors of Concord Dawn in a dogfight over Concord Dawn. The skirmish arose after the rebels tried to secure the right to pass through the Concord Dawn system as part of a new hyperspace route to the planet Lothal. Fenn Rau, leader of the Protectors and an ally of the Empire, attacked Phoenix Squadron with his fellow Mandalorian starfighter pilots. Multiple Phoenix pilots were killed and Captain Hera Syndulla was seriously injured in their retreat. After the battle, the rebels Kanan Jarrus and Sabine Wren traveled to the Protectors Camp on the third moon of Concord Dawn and, after some hostilities, were able to secure the help of Fenn Rau."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the Imperial assault on Garel, the Phoenix Cell was compelled to travel through the Outer Rim Territories in order to evade the Galactic Empire. In response to this situation, the rebel Commander Jun Sato convened a meeting with Rex and the Spectres to discuss their options for opening a new route through the Lothal sector. The Mandalorian Sabine Wren suggested the Concord Dawn system, which was home to a Mandalorian community known as the Mandalorian Protectors."}, {"tag": "p", "text": "The Concord Dawn system was not yet part of the Empire. The Protectors were fierce Mandalorian warriors who had helped the Old Republic to train clone troopers during the Clone Wars. Believing that reasoning with the Mandalorians was impossible, Commander Sato recommended sending a military force to the system. However, Phoenix Leader Hera Syndulla and and the Jedi Kanan Jarrus counseled that the rebels use diplomacy to secure safe passage through the Concord Dawn system. Hera and Kanan also suggested recruiting the Protectors to the rebellion. Sato reluctantly authorized Hera's mission and Sabine volunteered to come along."}, {"tag": "h2", "text": "The dogfight"}, {"tag": "p", "text": "Phoenix Leader Syndulla led Phoenix Squadron to the Concord Dawn system. Upon arriving, their RZ-1 A-wing interceptors were met by three Mandalorian Fang fighters led by Fenn Rau, the leader of the Protectors and the \"Protector of Concord Dawn.\" When Fenn demanded to know what the rebels were doing in the system, Hera explained that the rebellion was seeking safe passage through the Concord Dawn system. When Rau asked who were they were, Syndulla responded that they were those who would stand with Concord Dawn against the Empire."}, {"tag": "p", "text": "Since Rau had aligned the Protectors with the Empire, he promptly identified Phoenix Squadron as a threat and ordered his fighters to destroy the rebels. Ignoring Hera's pleas, the Fang fighters launched a devastating attack on Phoenix Squadron. During the dogfight, two pilots, Phoenix Three and Phoenix Four, were killed when their fighters were hit by enemy fire. With diplomacy no longer an option, Captain Syndulla ordered a retreat and led Rau on a chase in order to give enough time for Sabine and the surviving Phoenix pilot to jump into hyperspace."}, {"tag": "p", "text": "Before leaving, Hera promised Sabine that she would be behind her. Despite Hera's best efforts, she was unable to outrun Fenn's Fang fighter and her A-wing was badly hit by enemy fire. Hera managed to jump into hyperspace but was badly wounded by Fenn's attack. She was picked up by Sabine, Kanan, and the crew of Commander Sato's CR90 corvette Liberator. Due to timely medical intervention, Hera survived her injuries and continued her leadership role in the rebellion."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "While the dogfight above Concord Dawn was a victory for the Protectors, it earned them the enmity of the rebellion. With negotiations no longer an option, the Phoenix and Lothal rebel cells considered retaliatory measures against the Protectors. Outraged by the Protectors' unprovoked assault on her comrades, Sabine advocated destroying the Protectors' starfighters so that they could not longer pose a threat to the rebellion. She had managed to track the Fang fighters to a base on the third moon of Concord Dawn."}, {"tag": "p", "text": "Unwilling to draw the Empire's attention to Concord Dawn, Kanan recommended infiltrating the base and destroying the Fang fighters. Since he was reluctant to risk the lives of more crew members, he only took the astromech droid Chopper along for the mission. Despite Kanan's orders, Sabine secretly stowed aboard the Phantom. After further negotiations with Fenn failed, the rebels destroyed the Protectors' starfighters and kidnapped Rau."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dogfight over Concord Dawn first appeared in the Star Wars Rebels episode \"The Protector of Concord Dawn\", which premiered on January 27, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}