{"url": "Dogma", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Dogma"}, {"tag": "p", "text": "\"Dogma\" was the nickname of a rookie clone trooper who served in the Grand Army of the Republic during the Clone Wars. One of millions of clones engineered from the genetic template of the bounty hunter Jango Fett, Dogma was bred to become a soldier of the Galactic Republic, living only for combat and duty. In the later period of the war, he served with the 501st Legion during the Battle of Umbara. As a result, he was placed under the command of Jedi General Pong Krell, whom he would later kill after Krell betrayed the clone troopers and the Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By 21 BBY, the clone trooper known as \"Dogma\" was brought into the ranks of the 501st Legion, an elite division of clone soldiers in the Grand Army of the Republic. Around this time, the planet Umbara seceded from the Galactic Republic and joined the Confederacy of Independent Systems. In order to prevent the Separatists from gaining a tactical advantage through Umbaran technology, the Republic launched a full scale invasion to restore the planet under Republic control. The initial foray saw the deployment of the 501st onto Umbara's surface, with Dogma serving under the command of Jedi General Anakin Skywalker and Clone Captain CT-7567, nicknamed \"Rex.\" Other troopers in Dogma's unit included ARC trooper ARC-5555, nicknamed \"Fives,\" Hardcase, Jesse, Tup, Kix, and CC-1119."}, {"tag": "p", "text": "The battle began with the 501st engaging heavy resistance from the soldiers of the Umbaran militia. After overcoming the initial wave of enemy combatants, General Skywalker permitted the clones some time to rest before resuming their course toward the planet's capital city. Although Dogma was only interested in completing the mission, thus discarding the notion of rest, he obediently complied with the order of his superior officer."}, {"tag": "p", "text": "Before the 501st were able to proceed with their assignment, Jedi Master Pong Krell arrived on Umbara and temporarily relieved Anakin Skywalker of his command. At the request of Supreme Chancellor Palpatine, the Jedi High Council recalled Skywalker back to Coruscant. Like most other clone troopers, Dogma was absolutely obedient and willing to accept any order without question. Hence, he was as loyal to Krell's command as he was to Skywalker."}, {"tag": "p", "text": "A few of the clones in the 501st, such as Captain Rex and ARC trooper Fives, were skeptical of Pong Krell's decision to conquer the heavily defended capital city with a forward assault. Dogma, on the other hand, remained loyal to his general and briefly stood up in his defense against Rex and Fives. By then, however, a group of Umbaran soldiers ambushed the unsuspecting clones, causing Rex to order a withdrawal. Though frustrated by this setback, Krell sent in additional troopers and AT-RT drivers to repel the Umbarans, thus ensuring the survival of Rex and his fellow clones, including Dogma."}, {"tag": "p", "text": "After the operation to take the capital was compromised, Dogma and the 501st Legion continued to engage the Umbaran soldiers in a brutal firefight under the command of Pong Krell. General Obi-Wan Kenobi soon contacted Krell and updated him on the status of the overall situation—the defense grid of the capital city was virtually impregnable due to the supplies that were routinely sent in from a nearby airbase. Therefore, the entire campaign depended on Krell and the 501st Legion's ability to destroy the airbase, which would then deprive the capital of its resources."}, {"tag": "p", "text": "Upon reaching their destination, General Krell ordered Captain Rex to prepare his platoons for a frontal assault on the airbase. Rex complied, but some of the other clones—particularly Fives, Jesse and Kix—did not believe that Krell's plan would succeed. Dogma once again stood up for his general and declared his faith in Krell's strategy, rationalizing that the Grand Army did not have time to wait for the 501st to discover a safer route into the airbase. Due to the time constraint and the fact that the whole operation was depending on the 501st, Dogma insisted that a forward assault was the best way to achieve their objectives in the shortest amount of time."}, {"tag": "p", "text": "The operation ultimately succeeded after Fives and Hardcase stole a pair of Umbaran starfighters in order to destroy the enemy's defenses, thereby enabling the rest of the 501st to complete their mission with the forward assault on the airbase. In the aftermath of the operation, Dogma stood amongst Rex, Fives and several other clones as the Captain delivered his report on their success to General Krell."}, {"tag": "p", "text": "That night, when Fives, Jesse, and Hardcase sneaked out in Umbaran starfighters, Dogma woke up and realized they were gone. He woke fellow clone trooper Tup and convinced him that the two decided to report it to the general. However they were stopped by Rex when he suspected that the two were going to rat on Fives, Jesse and Hardcase. Although Dogma tried to get past him by telling that they had some 'important' matters to discuss, it was a futile attempt and giving up, turned back towards the barracks. When the clones came back without Hardcase, they were sentenced to be executed for treason against the Republic."}, {"tag": "h3", "text": "Treason of Krell"}, {"tag": "p", "text": "Dogma was in charge of the squad ordered to execute Fives and Jesse. Before the clones fired, Fives explained that they were men, not programmed droids. The clones intentionally missed, then dropped their DC-15A blaster rifles and walked away, much to Dogma's dismay. His eagerness to carry out the execution was not due to malice, however, but simply absolute loyalty to whomever led the clones. Dogma was genuinely shocked that the other clones in the firing squad did not share his view."}, {"tag": "p", "text": "The execution was delayed when Krell received a transmission stating Umbarans had stolen clone trooper armor and gear. During the incident when a unit from Ghost Company, under the command of Waxer attacked CT-7567 and his men, Dogma was surprised to learn that they were fighting clones instead of Umbarans. After Waxer informed Rex that Krell ordered them to attack, Rex led the clones to capture and arrest Krell, while Dogma did not follow. Later, when Pong Krell was escaping from custody, Dogma tried to prevent CT-7567 from chasing Krell by raising a blaster at him and accusing him of betrayal."}, {"tag": "p", "text": "Although several other clones, including Tup aimed their blasters at him, Dogma refused to lower his. Rex attempted to reason with him, trying to open his eyes to the real situation at hand. Dogma then aimed his blaster at Tup but slowly lowered it, after which two clones tackled him to the ground, handcuffed him, and locked him in the brig. Krell was captured and placed in the cell next to Dogma's. When Rex came to ask Krell why he did this, he explained that Dogma's blind loyalty was a key pawn in his plan. Afterward, when Rex came to kill Krell due to the risk of him letting out vital Republic secrets to the enemy if he were freed, Dogma was released by Fives and watched as Rex ordered Krell against the wall and on his knees. Krell taunted Rex, laughing at his attempt and confident that he wouldn't be able to do it. While Fives was busy watching, Dogma secretly took the trooper's blaster out of the holster and fired at Krell, killing the Besalisk Jedi. Panting, he stated that he had to because Krell betrayed them. He was put into Republic custody after the battle."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A clone trooper in the Grand Army of the Republic, Dogma was a loyal soldier who never questioned or disobeyed the order of a superior officer. Captain CT-7567 considered Dogma to be a rigid, by-the-book type of trooper, but his allegiance to the Galactic Republic was without question. On Umbara, Dogma's only concern was the Republic's successful reconquest of the planet. As a result, he adapted very quickly to the command style of Pong Krell, who adhered to protocol far more than Skywalker, who prized innovation, flexibility on the battlefield, and creative strategy, both on his part and on the parts of his men. Dogma agreed with Krell's strategies on Umbara. The success of the operation depended on the 501st Legion and, according to Dogma, Krell's tactics were the fastest and most efficient courses of action. Dogma refused to listen to the other clones who attempted to convince him that strategies other than direct frontal assault would accomplish the same mission with far less loss of life."}, {"tag": "p", "text": "Like his clone brothers, Dogma was stunned and horrorstruck upon the discovery that the clones of the 501st Legion and 212th Attack battalion had mistakenly engaged each other, after both units had been manipulated by Krell."}, {"tag": "p", "text": "General Krell believed that Dogma was a fool because of his blind loyalty. Dogma was so devoted to the Jedi General that he threatened his brothers with a blaster, believing that every single one of them was a traitor. After discovering that Krell had been manipulating the clones the whole time Dogma was devastated and enraged with the former Jedi for turning him against his brothers. Ironically Dogma, once Krell's most loyal soldier, killed the former Jedi by shooting him in the back."}, {"tag": "p", "text": "Like all clones of Jango Fett, Dogma stood 1.83 meters tall. Dogma shaved his head and sported a V shaped tattoo across his left eye. Dogma's helmet had a triangle on it similar to his tattoo. That covered a good portion of the front of his helmet, and matched the blue color scheme of the 501st."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Battle of Umbara, Dogma was equipped with the Phase II battle armor, an advanced version of the clone troopers' original armor that became the standard uniform for clones in the Grand Army of the Republic. Dogma used a DC-15S during the battle on Umbara. As a soldier of the 501st Legion, Dogma's armor sported blue 501st markings. Just like many of his brothers within the legion, Dogma added his own personal touch to his armor, he added a large blue triangle on his breastplate, and on his helmet a blue triangle on his face plate, with another smaller, red one above it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dogma first appeared in the episode \"Darkness on Umbara\" of Star Wars: The Clone Wars. He is voiced by actor Dee Bradley Baker, who voices all of the clone troopers in the TV series. The original script for the episode \"Carnage of Krell\" called for Rex to pull the trigger and kill Pong Krell, but when the writers decided that it was contrary to his character, they realized that Dogma would fill the role perfectly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}