{"url": "Dogfight_over_Geonosis", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battles of Geonosis", "Category:Battles of the Separatist Crisis"], "nodes": [{"tag": "h1", "text": "Dogfight over Geonosis"}, {"tag": "p", "text": "A dogfight over Geonosis took place between Jango Fett and Obi-Wan Kenobi inside the dangerous asteroid ring around the planet which was the then-Separatist capital."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After a duel with Jango Fett on Kamino, Obi-Wan Kenobi threw a homing beacon on the departing Slave I's hull. He tracked the ship to the planet Geonosis. After Boba Fett saw they were being tracked, Jango flew the Slave I into the asteroid field around the planet."}, {"tag": "h2", "text": "The dogfight"}, {"tag": "p", "text": "Kenobi followed in close pursuit of Jango, dodging asteroids and incoming seismic charges. Jango flew through tunnels in asteroids, but Kenobi didn't give up. Once out of Kenobi's view, Jango turned the tide and was now himself in pursuit; who fired until the Jedi interceptor was hit. After this, Fett fired a homing missile hoping to finish him off."}, {"tag": "p", "text": "Kenobi however told his astromech droid R4-P17 to release his ships spare parts so the missile could not dodge the tiny objects and explode, leading Jango to believe he had killed him, however Kenobi landed in an asteroid and powered down until Jango had entered Geonosis's atmosphere. He followed the him to the surface."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the skirmish, Kenobi landed on the surface of Geonosis after following Fett to a droid foundry and observing the high levels of Trade Federation activity while landing, where he learned more of the assassination attempt on Padmé Amidala as he secretly entered the foundry in search of the bounty hunter. He overheard the Confederacy Head of State and fallen Jedi Master Count Dooku and the various delegates who were discussing it new droid army, that would force the Galactic Republic to bow to any of Confederacy demands, which several interstellar conglomerates including the Commerce Guild and Corporate Alliance pledged their support to Dooku and the alliance. But the Trade Federation, who Viceroy; Nute Gunray refused and outlining his conditions to joining it and would only sign the treaty if Amidala was killed but would still pledged his battle droids nevertheless. During the meeting, Dooku explained that 10,000 more star systems would join the Separatists. Foreman Wat Tambor told Dooku that the droid army of the Techno Union was at his disposal and Chairman San Hill told him that the InterGalactic Banking Clan would sign his treaty. He was pleased and told them that when the Trade Federation Droid Army combined with the others, the Jedi will be overwhelmed. After the meeting had ended, Kenobi returned to his starfighter and tried to contact his padawan, Anakin Skywalker, about his discovery. He told Skywalker to redirect his message to Coruscant. Kenobi told Mace Windu and Yoda about how he tracked Fett to a droid foundry on Geonosis, that Dooku and the Council were forming a droid army, that Gunray was behind the assassination attempt on Amidala. Kenobi was then arrested by the Geonosians and was held captive until the arrival of Skywalker and Amidala, whom attempted to rescue him, though they were themselves were arrested as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}