{"url": "Dol_Donar_II", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Governors of the Galactic Empire", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dol Donar II"}, {"tag": "p", "text": "Dol Donar II was a Human male who served as the Imperial governor of Derra IV during the Galactic Civil War. His wife was Rissa Donar, and his youngest son, Nathan Donar III, was a graduate of the Academy of Carida. He had a strong dislike of the Rebel Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dol Donar II was the Governor of the planet Derra IV during the year 1 BBY. By this point, Donar was married to a woman named Rissa, and they had a son who was named Nathan Donar III. Donar was a strong supporter of the Galactic Empire, and his son was a student at the Imperial Academy on the planet Carida. A extremely fat man, he attempted to hide his indulgences by wearing flowing, expensive clothing. In addition, he was an avid card player, and greatly enjoyed the game sabacc. At some point he took a trip on the luxury starship Star of Empire. Nathan invited fellow student Kyle Katarn to have dinner with the family during this trip, during which Donar was greeted by Lando Calrissian, another sabacc player. After dinner the two had a card game which resulted in Donar placing several hefty bets, which he all lost. Eventually, a Rodian bounty hunter named Slyder contacted Donar, informing the Governor of agents working for the Rebel Alliance. Donar agreed to let Slyder hunt the agents, and the Rodian came back with their droid, A-Cee. Aboard, Donar's yacht while leaving the Star of Empire, the deactivated droid was reactivated. A-Cee spotted Nathan's Imperial uniform, and began to self-destruct. Slyder, who felt that the Imperials were incompetent for not taking any precautions with the droid, executed the Donars and patiently awaited for A-Cee to destroy itself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the audio adaptation of Dark Forces: Soldier for the Empire, he was voiced by Gary Groomes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}