{"url": "Domino_Squad", "categories": ["Category:Canon articles", "Category:Military stubs", "Category:Grand Army of the Republic squads"], "nodes": [{"tag": "h1", "text": "Domino Squad"}, {"tag": "p", "text": "Domino Squad was a military unit of clone trooper cadets stationed on the planet Kamino during the Clone Wars. The members of the squad, at first, proved unable to effectively work together as a team, but they ultimately passed their tests on Kamino and became full members of the Grand Army of the Republic."}, {"tag": "p", "text": "After graduation, they were stationed at Rishi Station on the Rishi Moon, a strategic point on route to Kamino. The majority of Domino Squad died during a Separatist attack on the base. The survivors CT-1409 and CT-5555 were subsequently absorbed into the 501st Legion."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone cadets"}, {"tag": "p", "text": "Members of Domino Squad were clones of the bounty hunter Jango Fett and born on Kamino. During the Clone Wars, the members of Domino Squad started their last practice tests in the Citadel Challenge under Master Chief Bric and the bounty hunter El-Les. During their tests, the squad was not able to work together as a team and their lack of cohesion resulted in numerous failures. During their final test, the squad failed when they left CT-00-2010 and were chastised by the ARC trooper, Clone Commander Colt, for their actions. Despite the setback, El-Les was able to convince Jedi General Shaak Ti to let the squad retake the final test. CT-782 tried to go AWOL, but was convinced to stay by malformed maintenance clone 99. Despite's Bric's attempt to sabotage the test by stealing their ascension cables, the squad was able to work together and win the Citadel Challenge. The squad graduated, and amidst their celebrations, CT-782, whom 99 had nicknamed \"Hevy,\" gifted the old clone his medal, saying that he deserved it and he could get it back from him at another time. The squad shipped out to fight the Confederacy of Independent Systems Droid Army."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "After graduating"}, {"tag": "p", "text": "The members of the squad were assigned to the Rishi Moon's outpost under the command of Sergeant O'Niner. Following a meteor shower, the listening post was taken over by a group of commando droids that had arrived to the surface in droch-class boarding ship believed to be meteorites. Several members of Domino Squad, CT-5555 \"Fives,\" CT-1409 \"Echo,\" CT-4040 \"Cutup,\" and Hevy, escaped onto the surface. Although Cutup was soon killed by a Rishi eel, the remaining trio were able to warn Clone Commander Cody and Clone Captain Rex about the commando droids by using a droid attack flare. The squad met up with the two officers and were able to retake the base from the commando droids. Unfortunately, the droids had hot-wired the all clear signal and General Grievous dispatched reinforcements to secure the base. The squad and the two officers decided to destroy the base in order to warn the Republic about the planned attack on Kamino. The group used liquid tibanna as explosive to destroy the base. The officers and squad fought the droids before abandoning the base. Unfortunately for them the detonator would not link, and so Hevy chose to stay behind and sacrifice himself by detonating the gas to destroy the base to warn the Republic."}, {"tag": "p", "text": "Echo and Fives, now the only remaining squad members, and Rex and Cody were picked up by the Republic after Grievous' fleet fell back. Echo and Fives were decorated by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker and joined Rex's 501st Legion. During their service, the pair eventually fell back to defend Kamino from Separatist attack. The group was reunited with 99, and had to pass on the unfortunate news of Hevy's death, in turn learning about Hevy's graduation medal. Later, Echo, Fives, 99, Cody, and Rex helped a group of clone cadets aid in the battle against a large group of battle droids, but as they exchanged fire in the barracks, 99 was tragically shot and killed. The clone who had been an inspiration to the entire squad died in Echo's arms defending his homeworld."}, {"tag": "p", "text": "During the second year of the Clone Wars, Echo and Fives were sent on a mission to Lola Sayu with Generals Kenobi and Skywalker, along with Rex and Cody, to rescue Master Even Piell who had been captured by Separatist forces. As they were commencing their escape from the planet with Master Piell, Echo was presumed killed while trying to board their ship when it was destroyed, leaving Fives as the apparent sole survivor of the old Domino Squad."}, {"tag": "h4", "text": "Fives and Order 66"}, {"tag": "p", "text": "Whilst fighting alongside Tup in the Battle of Ringo Vinda on the planet of Ringo Vinda, Fives witnessed Tup suddenly murder Jedi General Tiplar in the midst of heated combat. In the course of an investigation into Tup's sudden illness, Fives discovered the existence of the Inhibitor chips designed to keep the clones docile, but also intended to make them execute an unknown but sinister purpose. Medical droid AZI-345211896246498721347 removed Tup's chip in an attempt to save him, but Tup was too weakened from both the surgery and the degradation of his chip and died. Believing that the chips were part of a sinister conspiracy, Fives was sent to Coruscant to talk to Chancellor Sheev Palpatine only to discover that Palpatine was not only aware of it but the mastermind of the plan: Order 66. Palaptine framed Fives for trying to kill him and set the Coruscant Guard on his tail. Fives managed to escape and contact fellow 501st trooper CT-6116 \"Kix\" who he tells to contact Anakin and Rex and to meet him in the Warehouse district. Once they had arrived, Fives attempted to convince them of the truth behind the conspiracy and the Chancellor's involvement in it. Before he could make any genuine progress towards this, Fives was confronted by troopers of the Coruscant Guard and drew a blaster on them in a panic, only to be fatally shot by CC-1010 \"Fox.\" As Fives was believed to be the sole survivor, Domino Squad came to an apparent end with his death."}, {"tag": "h4", "text": "Echo and the Bad Batch"}, {"tag": "p", "text": "However, during the Outer Rim Sieges, in the third and final year of the Clone Wars, Echo was discovered to be alive on the planet Skako Minor by Captain Rex, General Skywalker, and Clone Force 99, a group whose name honored 99. Echo was rendered a cyborg after being experimented on and altered by Emir Wat Tambor and the Techno Union, who hoped to use his memories of Republic strategies, specifically Rex's battle strategy algorithm, to help the Separatists win the Battle of Anaxes. After being rescued from Skako Minor by Skywalker, Rex, and the \"Bad Batch,\" Echo was vital to the victory of the Republic forces on Anaxes, and was named Clone Corporal for his heroics. Now that he was a cyborg, and feeling at home with the irregular clones, Echo decided to join the Bad Batch and left Anaxes with them. Echo continued to accompany Clone Force 99 all the way until the end of the war, where they witnessed the execution of Order 66, the transition from the Galactic Republic to the Galactic Empire, and fled the new regime and went on the run."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}