{"url": "Domino_Squad/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Grand Army of the Republic squads"], "nodes": [{"tag": "h1", "text": "Domino Squad"}, {"tag": "p", "text": "Domino Squad was a clone trooper cadet squad of the Galactic Republic on Kamino during the Clone Wars. After its members passed their test, the Citadel Challenge, members of the Domino squad were transferred to an outpost in the Rishi maze, where they were attacked by commando droids. The clones were able to alert Galactic Republic forces, and the intruders were repelled."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Members of Domino Squad were clones of Mandalorian bounty hunter Jango Fett. Created on the planet Kamino, their sole purpose was to fight in the Grand Army of the Republic. Around 21 BBY, during the Clone Wars, the members of Domino Squad began their last set of practice tests, under the command of Bounty Hunters Siniteen drill sergeant Bric and El-Les. As their tests began, the members of Domino Squad could not function as a team, causing them to fail and costing them the chance of becoming ARC troopers when Commander Colt came to select potential ARC trooper Candidates. After failing their test once again, they were granted a retest by the Jedi General in charge of training, Jedi Master Shaak Ti. The morning of the training battle, CT-782 \"Hevy\" attempted to go AWOL, but was talked out of it by 99, a reject clone and maintenance worker. Despite the bounty hunter Bric deliberately sabotaging them during their retest they were able to work together as a team and pass their final test, the Citadel Challenge."}, {"tag": "h3", "text": "After Kamino days"}, {"tag": "p", "text": "After becoming battle-ready clone troopers, the clones of the former Domino Squad were sent to Rishi Station, which was located on the moon of Rishi, where an attack there took the lives of Hevy, CT-00-2010 \"Droidbait\" and CT-4040 \"Cutup\", leaving only CT-21-0408 \"Echo\" and CT-5555 \"Fives\". Several months after the destruction of the Rishi Station, Echo and Fives became ARC troopers after showing courage and skill during a Confederate invasion of Kamino. However, during the rescue of Jedi Master Even Piell, who was held captive in a Confederate prison, their escape became complicated after alerting the prison's warden Osi Sobeck. After a commando droid commandeered a plasma turret and began opening fire on the group, Echo valiantly drew its fire away from Fives in an attempt to prevent the turret from destroying their escape craft; however, this attempt was in vain, as the turret successfully destroyed the shuttle in a fiery explosion, presumably killing Echo in the process. This event left Fives to be the only surviving member of Domino Squad. Fives then continued to participate in the Battle of Umbara under temporary Jedi General Pong Krell, and aided in exposing his true intentions. However, Fives would later go rogue after the Republic's handling of clone trooper CT-5385 \"Tup\", and in turn would be killed by CC-1010 \"Fox\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}