{"url": "Don_Bies", "categories": ["Category:Real-world articles", "Category:Puppeteers", "Category:Star Wars prequel trilogy actors"], "nodes": [{"tag": "h1", "text": "Don Bies"}, {"tag": "p", "text": "Donald \"Don\" Bies (born April 7, 1961 in Chicago, Illinois) is a special effects artist and occasional actor who worked in the Star Wars special edition and prequels. He began working in the film industry for Chris Walas and Chris Walas Inc. in David Cronenberg's The Fly (1986) when he was 24 years old. There, he first worked with Jon Berg and Howie Weed, who he later collaborated with on the prequels. Bies would continue his work in creature effects for Pen Densham's horror film The Kiss (1988)."}, {"tag": "p", "text": "Bies worked with Walas for only one more film, The Fly II (1989), which was Walas's debut as a director. He worked as a mechanical engineer who handled the film's \"creature effects,\" as they would be known. Bies was hired by Industrial Light & Magic after that and has been with ILM ever since."}, {"tag": "p", "text": "After joining ILM, he worked on Steven Spielberg's Indiana Jones and the Last Crusade (1989), his first work with the company before moving on to a number of different science-fiction and fantasy movies in need of ILM's experienced special effects technicians. He did operating room effects for Robert Lieberman's sci-fi Fire in the Sky (1993) and served as a model maker for both Mel Smith's comedy Radioland Murders (1994) and Frank Marshall's Congo (1995)."}, {"tag": "p", "text": "1997 marked the release of Bies's first collaboration with Star Wars, as well as that of two of his other movie credits, Paul Verhoeven's Starship Troopers and Disney's Flubber. In Star Wars, specifically, we can admire Bies's work as creature and model maker in the special editions of both Star Wars: Episode V The Empire Strikes Back and Star Wars: Episode VI Return of the Jedi. Bies also makes a cameo as one of the aliens in Return of the Jedi, playing a Bith named Barquin D'an, the Kloo horn player from Figrin D'an and the Modal Nodes. He also replaced Jeremy Bulloch as the charismatic Boba Fett for some new scenes. He also constructed the props used in Star Wars: Jedi Knight: Dark Forces II released the same year. His wife Anna Bies also worked at Lucasfilm; She was a model builder for Episode I and Galaxy Quest, as well as the costume designer for Dark Forces II."}, {"tag": "p", "text": "Don continued working in science-fiction with Dean Parisot's parody Galaxy Quest (1999), the same year he also began work on Star Wars: Episode I The Phantom Menace, not only as one of the model makers, but also as the puppeteer for R2-D2. He also makes a small cameo appearance as a mechanic in one of the pod race boxes."}, {"tag": "p", "text": "As part of ILM's staff, Bies was a model maker for other blockbusters, such as Spielberg's A.I. and Michael Bay's Pearl Harbor, as well as working on Gore Verbinski's Pirates of the Caribbean in the interim between the releases of Episodes II and III. He also co-directed, co-wrote and co-starred in R2-D2: Beneath the Dome, a mockumentary narrating the career of \"actor\" R2-D2, which is included on the Special Features disc included with the DVD release of Star Wars: Episode II Attack of the Clones."}, {"tag": "p", "text": "In Episode II, Don served as the supervisor of the droid unit, and also returned as the puppeteer for R2-D2. He also makes a small cameo appearance in the nightclub where Obi-Wan Kenobi and Anakin Skywalker follow Zam Wesell during their chase through Coruscant. He returned to the Star Wars saga for Star Wars: Episode III Revenge of the Sith, again as droid unit supervisor and R2-D2 puppetteer. He was also the R2-D2 operator, and C-3PO's wardrobe manager, for the 2005 mini-series Science of Star Wars."}, {"tag": "p", "text": "Currently, Don Bies lives in Petaluma, California, with his wife Anna and their son Ben."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}