{"url": "Doneer", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Colonies species", "Category:Insectoid sentient species"], "nodes": [{"tag": "h1", "text": "Doneer"}, {"tag": "p", "text": "The Doneers were a sentient insectoid species from the planet Doneer'so, located in the Fakir sector. Their renown for building excellent starships gave them a reputation across the sector. The Galactic Empire selected Doneer'so as its sector capital, choosing clan-city Sotak'vik as its headquarters. While that pleased the Sotak city-clan, it made the other clans jealous. Some of those rivals sympathized instead with the Rebel Alliance in the Galactic Civil War."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Doneers were a sentient insectoid species."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Doneer social organization was clan-based, and individuals showed fierce loyalty to their clan. That produced rivalry between clan-cities, creating animosity that often broke out into violent conflict."}, {"tag": "p", "text": "The Doneers were technologically adept. They were known as excellent technicians and builders, gaining a reputation as the superior shipwrights and mechanics of the Fakir sector. Nevertheless, the Doneers were not particularly adept at designing new starships or undertaking original research. The Doneers were extremely hard-working and were both quick and meticulous."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Doneers evolved on Doneer'so, a jungle planet located in the Fakir sector of the Colonies region. Their society developed around clan-cities, a system that evoked a strong sense of loyalty; rivalry between clan-cities sometimes erupted into conflict and among the numerous cities on the planet were several radiation-scarred ruins. During the Imperial era, the Galactic Empire established Doneer'so as its sector capital and selected the city of Sotak'vik as its headquarters. The Empire protected it with shields and a nuclear-dampening system. The city's selection greatly increased the stature and power of the Sotak city-clan. While that made the Sotaks loyal to the Empire, many other clans became jealous; the Empire ruthlessly suppressed any overt expression of such attitudes. Several other cities, including the main shipyard of Tokks'vik, were thus heavily pro-Rebellion during the Galactic Civil War"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Doneers were created by Paul Murphy for the roleplaying game sourcebook Star Wars Campaign Pack, published by West End Games in 1988. The section featuring the Doneers was later republished in Classic Campaigns in 1994."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}