{"url": "Doo", "categories": ["Category:Canon articles", "Category:Creatures of Naboo", "Category:Non-sentient species", "Category:Scalefish", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Doo"}, {"tag": "p", "text": "Doo were a species of scalefish native to the planet Naboo. They lived alongside six other scalefish species in the waters around the city Otoh Gunga in Lake Paonga, and could also be found in the Abyss, where they were preyed upon indiscriminately by the large Colo claw fish and Opee sea killers that lived there. Doo themselves ate tiny yobshrimp."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Doo were a species of scalefish that possessed pectoral fins behind their head, small dorsal fins along their back, and a large caudal fin at their rear to propel them through the water. They had small organs on the underside of their bodies, and a large set of jaws which contained rows of sharp teeth. Doo had skin ranging from pale yellow to pink and gray, and they had blue stripes down their sides from the top of their bodies. Their eyes were black. They could be found in the waters around the city Otoh Gunga in Lake Paonga, and in the Abyss, a set of natural tunnels running from Naboo's surface to its core. Their prey was tiny yobshrimp."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Invasion of Naboo, while escaping invading forces of the Trade Federation, Jedi Master Qui-Gon Jinn, his Padawan Obi-Wan Kenobi, and the Gungan Jar Jar Binks swam by a number of doo on their way to Lake Paonga's underwater Gungan city of Otoh Gunga, to talk with Gungan representatives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Doo first appeared in the film Star Wars: Episode I The Phantom Menace. Though not named in the film, they were first identified\nin the Star Wars Legends reference book Star Wars Chronicles: The Prequels, and were confirmed to be canon in the reference book Star Wars: Absolutely Everything You Need to Know."}, {"tag": "p", "text": "Doo, along with fellow scalefish ray, mee, faa, see, laa, and tee, appear to reference the real-world musical scale; i.e, \"Do, Re, Me, Fa, So, La, Ti, Do.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}