{"url": "Doo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Creatures of Naboo", "Category:Creatures of unspecified diet", "Category:Food creatures", "Category:Scalefish", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Doo"}, {"tag": "p", "text": "The doo was a species of scalefish on the Mid Rim planet Naboo. Common in Lake Paonga near the underwater city of Otoh Gunga, home to the Gungan species, doo were a dietary staple both of Gungan recipes and Humans known as the Naboo. The doo ranged in color from a dull yellow to a tan or gray hue."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Doo were large, broad-sided scalefish that possessed pectoral fins behind the head, small dorsal fins along the back, and a large caudal fin at the rear to propel them through the water, as well as small feelers or sense organs along the bottom of the body. They also displayed sharp teeth set within a formidable set of jaws, and black eyes recessed from their outer cartilage. Skin color ranged from dull yellow to tan and gray. As the doo was very common to Lake Paonga on the Mid Rim planet Naboo, it was a dietary staple of both Humans, known as the Naboo, and the aquatic Gungans. The fish was attracted by the lights of the underwater Gungan city of Otoh Gunga but knew by experience to stay away from the gelatinous substance that led to the city's air-filled chambers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The doo evolved in the deep waters of the planet Naboo. During the Invasion of Naboo in 32 BBY, while escaping invading forces of a megacorporation called the Trade Federation, Jedi Knight Qui-Gon Jinn; his Padawan, Obi-Wan Kenobi; and the Gungan Jar Jar Binks swam by a number of doo on their way to Lake Paonga's underwater Gungan city of Otoh Gunga to talk with Gungan representatives."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The doo, along with fellow scalefish ray, mee, faa, see, laa, and tee, appear to reference the real-world musical scale; i.e, \"Do, Re, Me, Fa, So, La, Ti, Do.\" The fish made its first appearance in the 1999 prequel trilogy film Star Wars: Episode I The Phantom Menace, and was described in the reference guide Star Wars Chronicles: The Prequels, where it received its name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}