{"url": "Dooku:_Jedi_Lost", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Canon audio dramas"], "nodes": [{"tag": "h1", "text": "Dooku: Jedi Lost"}, {"tag": "p", "text": "Dooku: Jedi Lost is a canon audiobook written by Cavan Scott and narrated by a full cast. It follows Asajj Ventress as she delves deep into the past of Count Dooku and discovers why he chose to leave the Jedi Order. The audiobook was published on April 30, 2019 by Random House Audio. The script of the audiobook was released on October 1, 2019."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Delve into the history of the sinister Count Dooku in this audio original set in a galaxy far far away...."}, {"tag": "p", "text": "Darth Tyranus. Count of Serenno. Leader of the Separatists. A red saber, unsheathed in the dark. But who was he, before he became the right hand of the Sith? As Dooku courts a new apprentice, the hidden truth of the Sith Lord's past begins to come to light."}, {"tag": "p", "text": "Dooku's life began as one privilege-born within the stony walls of his family's estate, orbited by the Funeral Moon where the bones of his ancestors lie interred. But soon his Jedi abilities are recognized and he is taken from home to be trained in the ways of the Force by the legendary Master Yoda. As he hones his power, Dooku rises through the ranks, befriending fellow Jedi Sifo-Dyas and taking a Padawan of his own, the promising Qui-Gon Jinn—and tries to forget the life that he once led. But he finds himself drawn by a strange fascination with the Jedi Master Lene Kostana, and the mission she undertakes for the Order: finding and studying ancient relics of the Sith, in preparation for the eventual return of the deadliest enemies the Jedi have ever faced."}, {"tag": "p", "text": "Caught between the world of the Jedi, the ancient responsibilities of his lost home, and the alluring power of the relics, Dooku struggles to stay in the light-even as the darkness begins to fall."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "We follow Dooku's dark side apprentice, Asajj Ventress, before the the onset of the Clone Wars. Dooku sends her on a mission to find and retrieve his estranged sister, Jenza. Throughout this journey, Ventress uncovers all sorts of details regarding Dooku's past, all the while dealing with the ghostly voice of her former Jedi Master, Ky Narec, repeatedly attempting to pull her back to the light."}, {"tag": "p", "text": "Through holo-messages, journals, and first hand accounts from Dooku, Ventress learn that he was born on the Outer Rim planet Serenno, home to his parents Count Gora and Countess Anya and their children, Ramil and Jenza. Count Gora ruled over the planet that had been named after his ancestors who had led a charge to drive the ancient Sith Empire off world, restoring control to its original inhabitants."}, {"tag": "p", "text": "After Dooku's birth, his family soon discovered his Force sensitivity, causing his father to be extremely fearful of his son, giving his family and homeworld's history with force sensitive beings. In an effort to cover up the boy's existence, Count Gora contacted the Jedi Order instructing them to take him away, while leaving the boy for dead in the wilderness of Serenno. Jedi discovered Dooku and brought him back to their Temple on Coruscant, where he would be trained as a Jedi."}, {"tag": "p", "text": "Years later, in 90 BBY, Dooku returned to Serenno, along with best friend and fellow Jedi Sifo-Dyas, while accompanying a group of Jedi, including Grand Master Yoda. The planet was hosting a “showcase for the galaxy” which gave Outer Rim worlds the ability to show off what they had to offer for the “ever growing Republic.” At the event, Dooku, spots a young girl who he feels an immediate spiritual connection with. He rescues her from a confrontation with a few thefts and the pair soon realize they are brother and sister. His newly found sister Jenza excitingly gives Dooku and Sifo-Dyas as tour of the surrounding area, including the Great Assembly, a building that housed Serenno's Planetary Council. Here, Dooku learns of “The Tirra'Taka,” an old legend of a dragon that holds the world together. Captivated, Dooku reached out to touch a carving of the creature. Just then, a sudden “groundquake” struck, causing the building to collapse and trapping the children below its remains. After the children had been rescued by the Jedi Masters, Count Gora became enraged by his Force-sensitive son's return. Confused, Dooku then learns of his past and we begin to see anger creep into the young Jedi initiate."}, {"tag": "p", "text": "Soon after, Jenza and Dooku would begin communicating in secret through holo-messages, something strictly forbidden by the ways of the Jedi. Dooku's rebellious nature wouldn't stop there, as he and Sifo Dyas broke into a secret collection of Sith and Darkside Artifacts know as “The Bogan Collection” after learning about it from the journal of a disgraced Padawan during the High Republic era, named Klias Teradine. The pair would get caught, after Dooku encountered what he believed to be the “Tirra'Taka,” the creature from Serenno. Dooku explained what he had seen to the Jedi, only to mostly be dismissed. However, an Altiri Jedi, Lene Kostana, was concerned with what Dooku had saw. During this time and the years to come, Kostana had done extensive research into the dark side and ancient Sith Warbeasts. She would continually urge the Jedi Counsel to take Sith and Dark Side threats far more seriously than they had, hoping to prepare younglings if they should even encounter it, heading the warns of ancient Jedi prophecies."}, {"tag": "p", "text": "Wishing to become Kostana's Padawan, Dooku would instead go on to become the Padawan learner of Grand Master Yoda, in 86 BBY. Kostana however would choose his bestfriend, Sifo Dyas, as her Padawan learner instead. Yoda and Dooku's relationship would get off to a rocky start as Yoda had deliberately ignored the boy for quite some time, causing him to finally explode with frustration attempting to impress the Grand Master with saber technique as well as attempting to use the force lift objects around him, including “The Great Tree,” an ancient Force-sensitive tree, Yoda had been particularly fond of. Dooku had failed to lift the tree, causing Yoda to finally pay attention to the boy, saying “Ready, are you, my Padawan? Ready to learn what you do not know?”"}, {"tag": "p", "text": "Dooku and his master would then leave to go on missions to Matooine, Lahsbane, and Kashyyyk, even liberating an entire solar system from a “Necrotic Queen,” all chronicled by Dooku in a journal he had kept."}, {"tag": "p", "text": "Meanwhile in, 85 BBY, Sifo Dyas began to become plagued by visions of great destruction, that the Jedi Counsel would determine to be the agricultural world “Protobranch.” Dooku, Sifo, and Kostana would travel to Protobranch to warn and provide aid if these visions were indeed to come true, against the counsel's wishes. The visions did become a reality, effectively destroying Dooku's confidence in the Council and Republic to provide its citizens the protection he felt they deserved."}, {"tag": "p", "text": "Three years later in, in 82 BBY, Dooku was contacted by his sister, to inform him of their mother's death and asked him to attend the funeral. Dooku then reveal his contact with Jenza to the Jedi Counsel and asked if he could attend the funeral. Kostana agreed to accompany him there, along with Sifo Dyas. During the funeral, a protest against the Serenno family broke out. In an effort to protect Jenza from the protestor,  Dooku revealed his presence and used his force abilities, which accidentally disturbed his mother's dead body. Count Gora was enraged by the incident, and Dooku cut his communication with his birth Sister."}, {"tag": "p", "text": "Before their return home, Kostana sought out a relic on the planet Asusto. Here the group was ambushed and captured as apart of a dark side ritual, causing Dooku to see visions of his possible future. To kill his captors, Dooku would then use force lightning for the first time. Kostana had Dooku and Sifo use a “cleansing ritual” to rid them of the dark energy they encountered."}, {"tag": "p", "text": "Years later, Dooku would obtain the rank of Jedi Master, and gained a seat on the Jedi Council. During his time as a Jedi Master, Dooku would train two Padawan learners. First Rael Averross and finally Qui-Gon Jinn. During his time training Qui-Gon, the pair would attend the 48th Annual Dragonfire Air Rally, an airspeeder race on Coruscant, that unbeknownst to Dooku, his brother Ramil was a contestant. During the race, Ramil's speeder was sabotaged, causing him to loss the race and obtain injuries. Dooku and Qui-Gon would then investigate the incident, leading them to a plot led by a member of the Jedi Council."}, {"tag": "p", "text": "In 42 BBY, Dooku would return to Serenno, after being contacted by Jenza asking for the Jedi's assistance. Their father had died and Ramil had taken his place, continuing in his fathers footsteps of making selfish choices while ruling the planet. Serenno had been invaded by the Abyssin, a species of cycloptic humanoids. The Republic, and Jedi Order following their lead, refused assistance to Serenno because of Ramil's refusal to honor their financial responsibilities to the Republic. Upset by the ruling, Kostana and Sifo Dyas would join Dooku in providing assistance to his home world."}, {"tag": "p", "text": "On Sereno, The trio meet up with Jenza and discover that recent groundquakes had been caused by the Tirra'Taka, which was indeed a real being. Dooku realized his presence on the planet many years before had awoken the beast, who wished to be left alone after suffering abuse by dark side force users for years."}, {"tag": "p", "text": "Soon after, Dooku learned of Ramil's corruption, replacing Serenno's military with droids and allowing the Abyssin to invade their world. During a confrontation with Ramil, Dooku, connected with the Tirra'Taka, summoned the beast to aid in destroying Ramil's forces. Enraged, Dooku killed Ramil, cutting him in two and soon realized, he had inadvertently abused the Tirra'Taka, as the other dark side users had before him. Dooku had no choice but to driving his lightsaber into its head, killing the beast."}, {"tag": "p", "text": "After the death of his brother and the treating of the Abyssin forces, Dooku claimed his title as Count of Serenno and informed Yoda and the Jedi counsel of his departure from the Jedi order in hopes to rebuild his home world and because of his frustrations with the current Jedi Order."}, {"tag": "p", "text": "While tracking the Count's sister, Ventress argues back and forth with what she believes to be the fictional voice of her former Jedi Master, Ky Narec. Ky's voice pleads with Ventress to see the true nature of Dooku, and urges her to abandon her new master and the dark side to once again pursue the light.  Ventress was eventually able to locate Jenza after she had been kidnapped and she is reunited with Dooku."}, {"tag": "p", "text": "Jenza pleads with Dooku that he has lost his way and that a “hooded man” has corrupted him. Simultaneously in a vision, the ghostly voice of Ventress's former master Ky Narec, pleads with her again to turn away from Dooku, telling her this is her final opportunity to avoid having the dark side fully consume her.  A vision of Dooku also appears antagonizing both Narec and Ventress. The visions pull her in opposite directions."}, {"tag": "p", "text": "Ventress, now cleared of the visions, looks upon a crazed and paranoid Dooku who then commands her to kill his sister. The voice of Ky Narec, pleads one last time, but it is too late. Ventress has succumbed to the will of her new master Darth Tyranus."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}