{"url": "Doom/Legends", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone trooper commanders"], "nodes": [{"tag": "h1", "text": "Doom"}, {"tag": "p", "text": "\"Doom\" was the nickname of a clone trooper commander during the Clone Wars. He wore a unique set of Phase II clone trooper armor composed of a green, yellow, and gray color scheme. He was involved in the Battle of Ringo Vinda along with his men."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on the home world planet of Kamino, Doom was bred from bounty hunter Jango Fett as a commander of the Grand Army of the Republic. He served under Jedi Twin Masters Tiplar and Tiplee, and the battles he participated in heavily scored and scuffed his armor. Doom participated in the Battle of Ringo Vinda along with the 501st Legion. After many rotations, neither the Separatist forces nor the Republic's had gained any ground. When debriefing during the next attack, Doom said that he would need backup, for he was low on manpower. General Skywalker assigned ten troopers of the 501st, led by Fives and Tup, to assist him for the next wave. When very near victory in the following battle, Tup began acting strangely, as if in a trance, and unexpectedly shot Master Tiplar. The loss of the Jedi was a strong blow and the momentum the Republic had built up was very quickly reversed; a last formation of Droidekas and rocket droids was deployed and the clones were forced to retreat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Doom wore standard Phase II clone trooper armor with the additions of an antenna and light on his helmet. He also sported a kama and visor. Like many clone commanders, Doom wielded twin DC-17 hand blasters. Unlike most armor patterns, Doom's was almost entirely green with yellow highlights, leaving only his arms and lower legs white. He sported the yellow triangular markings of his unit on his visor and chest.\nDoom's armor was heavily worn, bearing scuff marks and smears on every exposed surface. Despite this, the visor on his helmet was kept in optimal condition."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Doom's uniform pattern and his name are references to the Marvel Comics villain Doctor Doom. Coincidentally, Doctor Doom also partly acted as the inspiration for Darth Vader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}