{"url": "Dopak", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Character stubs", "Category:Exchange members", "Category:Humans", "Category:Khoonda Militiamen", "Category:Males", "Category:Mercenaries", "Category:Republic Army personnel"], "nodes": [{"tag": "h1", "text": "Dopak"}, {"tag": "p", "text": "Dopak was a veteran of the Mandalorian Wars and Jedi Civil War who ended up as a mercenary on Dantooine under the leadership of former elite Sith commando Azkul."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Like many veterans of the recent war, Dopak found himself unemployed as the fighting ended. He turned to soldiering for pay, and initially found work for the Republic in the Outer Rim. But the Republic, short on credits post-war, scaled back on expenses and Dopak and his compatriots were some of the casualties. Dopak subsequently joined the unnamed group of mercenaries on Dantooine."}, {"tag": "p", "text": "By the time Meetra Surik meets him, Dopak is Sith veteran Azkul's de-facto second-in-command. In conversation he displays a hardened worldview and an annoyance with the settlers in general, but stops short of being hostile toward them. He said of the settlers: \"So the galaxy has dealt them a bad hand. They should ante up and get back in the game.\" Dopak had a grudging respect for Administrator Terena Adare, but said she needed to learn the mercenaries would not leave Dantooine just because Adare did not want them around."}, {"tag": "p", "text": "However, Dopak was not as hard-hearted as some of his comments suggested him to be. He did not agree with Azkul on his methods and actions against the settlers of Dantooine. Eventually, Dopak secretly entered an alliance with Khoonda militia leader Zherron."}, {"tag": "p", "text": "When Meetra Surik arrived on Dantooine, she earned Zherron's trust and delivered a coded message to Dopak. The message gave Dopak confirmation of Azkul's plans to attack Khoonda. Accompanying this were two words, spoken by Zherron to Meetra Surik, and then by Surik to Dopak: \"Go ahead.\""}, {"tag": "p", "text": "During the Battle of Khoonda, Azkul attempted to kill its leader, Administrator Terena Adare. Dopak stood with Administrator Terena Adare once the mercenaries under Azkul got inside Khoonda's main building. He defected to the side of the militia, taking a small number of other mercenaries with him."}, {"tag": "p", "text": "After the battle, Dopak expressed a desire to continue mercenary work, saying, \"I plan to leave with as many of my men as will come with me, and look for some work that is more honorable than the wholesale slaughter of civilians.\" It is unknown if he fought in the Battle of Telos IV."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The player has the option to talk to Dopak after the battle, as he remains inside the Khoonda building. If the player commends Dopak for his change in sides, and claims that it was he that made victory possible, then the player will gain light side points."}, {"tag": "p", "text": "Dopak's survival once he defects to the side of the Khoonda Militia is not guaranteed; he can die in the fighting if the enemy characters are able to focus enough of their efforts on him. The same goes for the mercenary NPCs who side with Dopak against those still following Azkul."}, {"tag": "p", "text": "Alternatively, if the player does not give Dopak his message from Zherron before the attack on Khoonda, then Dopak is forced to fight alongside the mercenaries in the battle, where he dies if the player sides with the militia, or survives if the player sides with the mercenaries. In the latter instance, wherein Khoonda is conquered by Azkul's forces, Dopak will appear in the Khoonda building, but will not enter dialogue with Meetra Surik."}, {"tag": "p", "text": "It is never explicitly stated what side Dopak was on in either of the two wars he was in. Given that he does not have the distinctive views of Mandalorians, he was more likely with the Republic in his first war. But being as principled as he is, however rough-edged, Dopak may well have served with the Republic a second time against Darth Revan, and later Darth Malak. Given that most of the mercenaries on Dantooine are Sith veterans, Dopak may have made a point of not mentioning precisely what military service he was in to avoid giving them a reason to watch and suspect him."}, {"tag": "h2", "text": "Appearances"}]}