{"url": "Dopheld_Mitaka", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Humans", "Category:Males", "Category:Officers of the First Order"], "nodes": [{"tag": "h1", "text": "Dopheld Mitaka"}, {"tag": "p", "text": "Dopheld Mitaka was a human male officer who served the First Order as a lieutenant on board the Resurgent-class Star Destroyer Finalizer, the flagship of the Force-user Kylo Ren. He took part in an operation above the planet Jakku to prevent the Resistance from obtaining information about the location of Jedi Master Luke Skywalker."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dopheld Mitaka was a human male who was a member of the First Order. He graduated at the top of his Academy class and earned a prestigious placement aboard the Resurgent-class Star Destroyer Finalizer about thirty years after the Battle of Endor. Mitaka took part in an operation to capture a BB-series astromech droid called BB-8, who was carrying the fragment of a map containing the location of the Jedi Master Luke Skywalker. After BB-8 escaped Jakku with the former stormtrooper FN-2187 and the scavenger Rey aboard the Millennium Falcon, Mitaka informed Kylo Ren about FN-2187's role in the droid's escape."}, {"tag": "p", "text": "In a fit of rage, Kylo Ren destroyed a nearby computer terminal with his lightsaber, with Mitaka bracing himself beforehand, initially thinking Ren was going to lash out at him. When he had calmed down enough to inquire if there was anything else in the report, Mitaka then informed him about Rey's involvement. Ren then used the Force to pull Mitaka towards him and grabbed him around the neck. He then demanded to know more information about the girl."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mitaka first appeared in the film Star Wars: Episode VII The Force Awakens, which was released in North America on December 18, 2015. Mitaka was portrayed by actor Sebastian Armesto. He was not identified in the film, but received a name in the reference book Star Wars: The Force Awakens: The Visual Dictionary, which was written by Pablo Hidalgo and released in conjunction to the film. The cuff-title on his left sleeve reads \"Power\" in Aurebesh, to commemorate Clyss Power, a notable Admiral in the Galactic Empire's Navy who fought in the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}