{"url": "Dorande_(species)", "categories": ["Category:Legends articles", "Category:Dorandes", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Dorande  (species)"}, {"tag": "p", "text": "Dorande were a species of pointed-eared humanoids indigenous to the planet of Dorande. At the start of the Dark Times, they attempted to seize the world of R-Duba, conspiring with the planet's royal advisors to murder Prince Jagoda. While the Dorandes intended to raid Jagoda's palace, their plans were foiled by C-3PO and Kirk Windjammer."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Dorande were a sentient species of humanoid configuration: like the Humans, they had a single head, a torso and walked on two legs. Two arms extended from their shoulders and ended in five-fingered hands that included an opposable thumb. Their faces sported two forward-facing eyes, a single nose, and a mouth filled with white, blunt teeth. What truly distinguished Dorandes from Humans were their egg-shaped cranium, their pink skin and their tapered ears with long, dangling lobes. While entirely bald, the Dorandes were not completely hairless, as several individuals displayed black brows above their yellow eyes."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "In the early years of the Dark Times, the Dorandes commonly spoke Galactic Basic Standard, the most prominent language in the galaxy, although they still had a tongue of their own. In addition to speaking Basic, they also used the High Galactic alphabet. They were a bellicose people who maintained a fleet of convertible gunships and would not hesitate to capture a planet for the glory of their own culture."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Dorandes evolved on the planet of the same name, a world that was located in the Outer Rim region of the galaxy. At the start of the Dark Times, Ambassador Fez Kawakal represented Dorande at the court of Jagoda, the reigning prince of the planet R-Duba. Under the pretense of bringing a diplomatic proposal to the prince, Kawakal had come to conspire with one of his advisors, Baron Gavern Starlock. The two planned to have the assassin droid BX-00 murder the prince so Dorande could invade R-Duba. The protocol droid C-3PO, who had overheard the conversation, managed to save the prince's life and tell him the truth. As a consequence, Jagoda banished Starlock and Kawakal from his planet, appointing C-3PO his chief advisor. But the Dorandes' invasion plans were not completely foiled. Meanwhile, the young Kirk Windjammer, captain of an anti-grav loader christened Seaskimmer, accepted a strange job from a mysterious figure he met agt the Red Asteroid Bar. He would have to load is craft with cargo, and then drop it out in the middle of the sea. When he reached the arranged drop-off point, Windjammer encountered a fleet of ships. When it appeared that the cargo crates contained illegal blasters, Windjammer tried to escape his clients, who removed their Human masks and reveal their Dorande origins. The Dorandes, whose vessel was in fact a gunship, started to pursue the young man, and ended up destroying the Seaskimmer. Unbeknownst to them, Windjammer and his droid had escaped in an underwater escape pod. The two then reached Jagoda's palace, where they could warn the prince Jagoda of the impending invasion. Prince Jagoda then charged Winjammer with leading a defense force of forty heavily-armed R-Duba gunships against the enemy. Since his fleet was unprepared for a coordinated attack, the Dorande commander ordered a retreat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "When clarification on the pointy-eared Valenthyne Farfalla was sought from Leland Chee, keeper of the Holocron continuity database, he shared his personal theory that \"all pointy-eared species are either Sephi or closely related to Sephi,\" a reference to a pointy-eared species from Jedi: Yoda, published in 2004."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}