{"url": "Dorumaa", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems moons", "Category:Dorumaa locations", "Category:Galactic Empire moons", "Category:Galactic Republic moons", "Category:Oceanic moons", "Category:Thaere sector moons"], "nodes": [{"tag": "h1", "text": "Dorumaa"}, {"tag": "p", "text": "Dorumaa was the resort moon of Almas. It was once an inner planet of the Cularin system. Its orbit at that time crossed that of Oblis. Dorumaa was at its closest when Oblis was destroyed, and the force of that destruction thrust Dorumaa farther out in the system. It was eventually captured by the gravitation pull of Almas. Having moved far away from its suns, Dorumaa froze."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 47 BBY, the Dorumaa Investment Group began terraforming Dorumaa to turn it into a resort world. Power generators were installed near the moon's core to warm it and recycle the atmosphere. Gravity generators were also installed."}, {"tag": "p", "text": "Some of the creatures were caught when the frozen planet was thawed out. The creatures themselves were dead, but some eggs of many species managed to survive the thaw, and the seas were soon teeming with life—although the local fauna, adapting to the newer conditions, had a shorter lifespan. Special attention was paid to a pair of baby leviathans, whose mother had apparently survived the freezing and thawing process, at least long enough to give birth to the pair."}, {"tag": "p", "text": "Despite the revived water life making the moon a bit more dangerous than most resorts, Dorumaa was one of the most popular tourist destinations in the Expansion Region and was terraformed to become the Dorumaa Resort. The Head Manager was young Human Mar Daghreb, who controlled five property managers, each of them with five managers under their command. Dorumaa's facilities included family-oriented islands, staffed by young people so perpetually smiling that they were known as the Neo-Caarites."}, {"tag": "p", "text": "Unfortunately, unexpected local fauna still surprised even the investors (although sometimes, such as with the human-friendly, ridable giant sea turtles, it was a pleasurable surprise). Local boat renter Rena Laut, who considered herself an expert in local aquatic fauna, was sometimes hired as a guide to avoid \"unfortunate encounters.\" Should any vacationers disappear, the investors solved the legal problem with a generous donation to their surviving relatives."}, {"tag": "p", "text": "Circa 47 BBY, a research team discovered a cave, the Dorumaa Excavation, with supposed writings on the wall and other evidence of an ancient, yet-unknown species living in the Cularin system. Before any further research could be performed, the Dorumaa Investment Group built a floating land platform over the site and refused to allow access. The researchers' reports ended in Rorkee, a floating city in the nearby gas giant Genarius. Rorkee built a reproduction of the dig site to attract the tourism wanting to believe in old alien species."}, {"tag": "p", "text": "In 32 BBY, the Cularin system joined the Galactic Republic, and the first senator asked for military presence in the system to deter the frequent pirate attacks. The commanding officer of the Thaereian military forces that were sent, a Colonel Jir Tramsig, built his first post on Dorumaa to analyze the situation, and attacked some of the pirate bases in the system's asteroid belt from the moon. Later, he built a new base on the planet Cularin. This did not affect the tourism industry; a week of vacation on Dorumaa was still an appreciated award, as shown when the Jedi Knight Alec paid one to his permitor Delan in 31 BBY."}, {"tag": "p", "text": "There was also a fishing industry in Dorumaa, including fisherman Drac Gerrat. The Thaereian military used this fact to build a base on Dorumaa: At the direction of an anonymous member, Identification #43641, which was suspected to be the Thaereians, the Dorumaa Investment Group built a deep-sea landing platform, officially intended as a drop-off point for deep-sea fishing. Identification #43641 also announced that the evidence of native intelligent life in Dorumaa Excavation was false; however, access to the site was still forbidden."}, {"tag": "p", "text": "During the Clone Wars, the Thaereians were driven out of Dorumaa in the Battle of Dorumaa."}, {"tag": "p", "text": "After the Cularin system reappeared from its near-decade-long disappearance, Kaminoan scientist Ko Sai hid on Dorumaa from the various organizations pursuing her. She was found in 21 BBY by Kal Skirata and his allies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}