{"url": "Dorv%27Tilsta", "categories": ["Category:Legends articles", "Category:The Enclave residents", "Category:Jedi Purge victims", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Dorv'Tilsta"}, {"tag": "p", "text": "Dorv'Tilsta, or Dorv Tilsta, was a young male Lethan Twi'lek Jedi Initiate who was brought into the Jedi Order in the years prior to the outbreak of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Twi'lek, Dorv Tilsta was five standard years old when wandering Jedi Master Vhiin Thorla discovered they young boy's proclivity to the Force. Explaining his mission to end slavery of their shared race, Master Thorla convinced the boy's parents to allow young Tilsta to enter into the Jedi Order as his personal Padawan. Taking Tilsta under his wing, Master Thorla took the young apprentice to The Enclave, a refuge built for former slaves, and studiously began his studies in the ways of the Jedi. Throughout his first days at The Enclave, Tilsta met many of its residents, including other Twi'lek children, namely Tror, Dath, and Meeva. It was within this time that a group of slavers discovered and attacked The Enclave. During the ensuing fight, Tilsta disobeyed his Master's orders to stay hidden, and attempted to help the Enclave's defenders. In the fighting, Tilsta was captured and stunned by an attacking slaver, but in the end was rescued by two Jedi agents who were at the Enclave meeting with Master Thorla."}, {"tag": "p", "text": "Not long after, the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, though Tilsta and his master remained out of the conflict. To this end, the occupants of the Enclave were not uncovered at the end of the war when the Galactic Empire rose to power and the Jedi Order was disbanded. As the Empire initiated the Great Jedi Purge and Jedi across the galaxy were hunted down and destroyed, Tilsta and his master remained secluded on Ryloth without contact from any of their peers in the Order. After two long years of isolation, the pair set out to look for survivors, heading for the Cularin system and the Order's academy on Almas. Touching down on the planet, the Jedi pair were shocked to find the academy a smoldering ruin, leveled after an attack two years prior. While probing through the debris, their presence was discovered by Inquisitor Valin Draco and his Dark Jedi apprentice, Raik Muun. Muun used a t'salak beast to overwhelm the ten year old Tilsta's senses, throwing him into an uncontrolled rage. A slave to the t'salak's dark side influence, Tilsta began to attack his own master. Although Master Thorla did not want to fight against his own Padawan, Draco promised that he would turn the young Twi'lek to the dark side if he refused to fight. Believing that he had no other choice, Thorla reluctantly struck down his own apprentice, killing him."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}