{"url": "Dorvin_Eltrom", "categories": ["Category:Legends articles", "Category:Cereans", "Category:Jedi of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dorvin Eltrom"}, {"tag": "p", "text": "Dorvin Eltrom was a male Cerean Jedi who fought against the remnants of the New Sith Empire during the New Sith Wars and was a member of Jedi Master Vannar Treece's strike team during Operation Influx. In 1032 BBY, he and his comrades infiltrated the planet Oranessan. Dorvin subsequently took part in a raid on Chelloa, a producer of baradium. He was subsequently killed in an explosion caused by baradium ignited by Sith Lord Odion's kinetic corruptor. He was known to have wielded a green lightsaber, which signified his aspiration to become a Jedi Consular."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Dorvin Eltrom lived during the Republic Dark Age, the last century of the New Sith Wars. During that period, the New Sith Empire had collapsed and various Sith warlords controlled large areas of the galaxy. The Galactic Republic had shrunk to a rump state centered around the Core Worlds and was defended from Sith invasion by a security cordon around the Colonies. Dorvin grew up in the Republic capital of Coruscant and was a member of an expatriate colony of Cereans, who were descended from slaves kidnapped by corporate slave raiders that had raided their homeworld of Cerea centuries earlier. Dorvin's ancestors had remained on Coruscant since their Cerean kin had barred their repatriation back to Cerea, fearing technological contamination. Throughout his life, Dorvin and his kin on Coruscant experienced significant alienation. Thus, he came to value helping other sentient beings return to their homes."}, {"tag": "h3", "text": "Operation Influx"}, {"tag": "p", "text": "At some point, Dorvin was discovered to be Force-sensitive and joined the Jedi Order, which had taken over the leadership of the Galactic Republic in response to the protracted war effort against the Sith. He also became acquainted with the Jedi Master Vannar Treece, a Jedi activist who led independent \"knight errant\" operation against Sith warlords in the Grumani sector. In 1032 BBY, Treece learnt that the Sith Lord Daiman had begun mining baradium—a volatile compound used in the manufacture of explosives including thermal detonators—on the planet Chelloa and was exporting large quantities of the compound to munitions factories near the front line. Treece feared that Daiman's baradium advantage would end the stalemated conflict in the Grumani sector by give him a distinct advantage over his Sith competitors and thus pose a greater threat to the Republic in the future."}, {"tag": "p", "text": "Treece subsequently gained authorization from Supreme Chancellor Genarra to launch Operation Influx. This was a three-stage operation that involved infiltrating the Daimanate by landing at Oranessan, a key transport hub; disrupting export operations on Bardium; and extraction to the Republic via a direct hyperspace route leading to neutral space. Treece had learnt about the baradium operations from his old friend and undercover Jedi operative Gorlan Palladane, the leader of the Chelloan resistance. Palladane and his Rodian mechanic friend Skodo had used a stolen transmitter to reactivate a hyperspace relay and communicate with Treece. However, the Sith Lord Odion had been monitoring the transmission and made preparations to invade Chelloa. The nihilistic Sith Lord believed that the planet's high concentration of baradium created an imbalance in the Force and thus had to be destroyed."}, {"tag": "p", "text": "Treece assembled a motley volunteer force of Jedi that included friends who had worked in earlier \"knight errant\" operations with him, Jedi who distinguished themselves in other combat operations, and other acquintances who owed him personal favors. These included the Trandoshan Mrssk and the Quarren Jedi Master Berluk. Treece was also taking advantage of a loophole in Genarra's edict that allowed Jedi Knights sixteen days of free travel anywhere in the galaxy between their regular routine of serving three months in law enforcement patrols and nine months of active service on the Republic's contracting frontiers. Another member of the strike team was Treece's former apprentice Kerra Holt, a young Human woman who had been orphaned during the Chagras Hegemony's conquest of her homeworld of Aquilaris Minor in 1042 BBY. This marked Kerra's first return to her home sector after spending much of her adolescence with the Jedi on Coruscant."}, {"tag": "h3", "text": "Insertion at Oranessan"}, {"tag": "p", "text": "The first stage of Operation Influx went smoothly with the Jedi team safely arriving on a starship at Oranessan. While descending into the planet's atmosphere, they intercepted and shot down a personnel shuttle carrying flight crew to a spaceport where a fleet of Daimanate Heavy-Lift Starcrossers was awaiting departure for a delivery run to Chelloa. The shuttle crashed on top of a hillcrest in the mud flats and the Jedi quickly retrieved the fallen crew's cloaks and identification badges. Dorvin was part of a four-member advance team which also included Master Treece and Kerra that approached the spaceport disguised as flight crew. There, they encountered several Daimanate sentries led by a female ground crew chief who attempted to execute them for being late to a flight preparation meeting. However, the Jedi killed them with their lightsabers with Dorvin personally slaying two Daimanate Sith troopers. The Jedi then commandeered an empty Starcrosser transport and Dorvin was designated as the pilot for the mission. Due to his large pointed skull, Dorvin found the control console to be too small and narrow for his comfort."}, {"tag": "p", "text": "Prior to their departure, Dorvin asked Kerra whether her decision to wield a green lightsaber reflected her aspiration to become a Jedi Consular like the current Chancellor Genarra. Dorvin himself wielded a green lightsaber and aspired to become a Jedi Consular, a senior position within the Order. Kerra explained that she had only grabbed a lightsaber crystal from the top of a pile which turned out to be green in color. Dorvin was disappointed with Kerra's decision not to become a Jedi Consular. However, Kerra did not believe in adhering to tradition since she was more interested in learning enough Jedi skills as quickly as possible to fight the Sith in combat and avenge the invasion of her homeworld. Dorvin then attempted to prepare the transport for a take-off only to discover that its navigation computer was missing its activation cylinder. While the Starcrosser was still able to fly, it was unable to make a hyperspace jump which meant that the mission would have to be aborted."}, {"tag": "p", "text": "The Jedi were unable to travel to Chelloa on their own ship since the planet was tightly guarded by Daiman's forces. Time was running out since they had only one hour to infiltrate Chelloa and sabotage the baradium shipping before departing for neutral space. Vannar considered activating the fallback plan which involved flying the transport back to their hidden Jedi vessel and using it to shoot down the Daimanite transports before returning to the Republic. However, this plan had a serious drawback since Daiman could respond by rerouting other vessels to Chelloa. Kerra opposed this idea and suggested hijacking an ore transport but Vannar ruled it out since the ore transports were heavily armed. Finally, Kerra suggested returning to the wrecked shuttle and retrieving the dispatch case. However, Vannar was uncomfortable about this plan since he did not want to risk the lives of the Jedi Knights involved."}, {"tag": "p", "text": "However, Kerra was still determined to carry out Operation Influx due to the considerable amount of energy, time, and resources they had already committed to the mission. At that point, they were interrupted by an announcement from the Sith control tower on Oranessan ordering them to hasten their departure or they would be punished. Vannar then ordered the team to opt for their fallback plan. He ruled out walking back several kilometers back to their hidden Jedi ship due to the wet conditions outside. Vannar also ordered Dolvin to secure all the vessel's hatchways. However, Kerra disagreed with her master's orders and used her stolen remote control to open the transport's maincargo hatchway as it was lifting off. Donning the fallen ground crew chief's overalls, Holt stole a replacement cylinder from a nearby hangar, and after fitting the device, the Jedi departed Oranessan for Chelloa."}, {"tag": "h3", "text": "Death of Chelloa"}, {"tag": "p", "text": "During the second part of the operation, the Jedi strike team landed at the spaceport town of Jenith where they overwhelmed a small Daimanate security force with the assistance of the Chelloan resistance. Their attack was interrupted by the arrival of Sith Lord Odion's forces which had deployed a kinetic corruptor that ignited a large area of the surface. The ensuing explosion killed many Jedi, Daimanate guards and miners within the vicinity. Dorvin himself was killed during the explosion while Treece was slain by Odion during a lightsaber duel. The sole survivor was Kerra Holt who was sheltered by Palladane. She would go on to evacuate the planet's 63,000 inhabitants to the safety of Republic space after Daiman ignited the planet's surface with his own kinetic corruptors at the end of the Chelloan affair. Despite Dorvin's death on Chelloa, the Jedi and the Republic continued with their effort against the Sith who were finally defeated at the Seventh Battle of Ruusan in 1000 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dorvin Eltrom was first introduced as a supporting character in the new comic Knight Errant comic series which debuted in August 2010 with the release of Knight Errant 0 during Celebration V. His story background was developed by John Jackson Miller, drawn by artist Federico Dallocchio and colored by Michael Atiyeh. He also appeared in the short story Star Wars: Knight Errant: Influx which was also written by Miller and explored the prelude on Oranessan prior to the events in the Aflame story arc. This short story debuted on October 19, 2010 and also briefly explored his biographical background. Dorvin was killed off in Knight Errant: Aflame 1, the first issue of the Star Wars: Knight Errant: Aflame story arc which was first released on October 13, 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}