{"url": "Dosmit_R%C3%A6h", "categories": ["Category:Canon articles", "Category:Alliance Fleet captains", "Category:Females", "Category:Individuals of unspecified species", "Category:Tierfon Yellow Aces personnel"], "nodes": [{"tag": "h1", "text": "Dosmit Ræh"}, {"tag": "p", "text": "Dosmit Ræh was a female starfighter pilot who served as a captain in the Alliance to Restore the Republic. She flew an X-wing starfighter with the Tierfon Yellow Aces."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dosmit Ræh served as a captain in the Alliance to Restore the Republic, a rebel group that opposed the reign of Sheev Palpatine's Galactic Empire. A member of the Rebel Alliance Starfighter Corps, she flew a T-65B X-wing starfighter. Prior to the outbreak of the Galactic Civil War, she served with the Tierfon Yellow Aces, a Rebel starfighter squadron."}, {"tag": "p", "text": "Several years after the war, Ræh's flight helmet was recovered by a young desert scavenger on Jakku named Rey. When Rey was a girl, Ræh became an important figure in Rey's life, with the young scavenger dreaming up stories about what Ræh was like and where she might have come from. Rey created a fighter pilot doll using a flight suit she recovered from a cargo container, and she often wore Ræh's flight helmet. Together, Rey and \"Ræh\" went on adventures by exploring Rey's home, the downed All Terrain Armored Transport called Hellhound Two, as well as the sands outside of the AT-AT. Rey eventually grew out of playing with the doll, but she kept the memory of Ræh alive by keeping the doll and her helmet in her possession throughout her years on Jakku."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although Ræh herself did not make an appearance in Star Wars: Episode VII The Force Awakens, her flight helmet did."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}