{"url": "Double-bladed_spinning_lightsaber", "categories": ["Category:Canon articles", "Category:Weapon stubs", "Category:Lightsaber variations"], "nodes": [{"tag": "h1", "text": "Double-bladed spinning lightsaber"}, {"tag": "p", "text": "The double-bladed spinning lightsaber, also known as the Inquisitorius lightsaber, or simply as the Inquisitor lightsaber, was a specially-designed lightsaber model used by the Inquisitorius, a group of dark side adepts who enforced the will of the Galactic Empire. It was capable of both single and double blades, and was capable of spinning in a circular motion when both blades were emitted. Known wielders of this model included the Grand Inquisitor, the Second Sister, the Fifth Brother, the Sixth Brother, the Seventh Sister, the Eighth Brother, the Ninth Sister, and Jerserra. As was custom with the Jedi and Sith, the lightsabers used by the Inquisitorius thus far have shown variation in the weapon's design while maintaining core features."}, {"tag": "p", "text": "The lightsaber's overall design hardly made it any bigger than a single-emitter lightsaber, a stark contrast to the design of dual-bladed weapons previously used by warriors such as Darth Maul. Another unique feature of this weapon is that the blade emitters would spin along tracks in the disc while the hilt would remain stationary in relation, allowing for more emphasis on the attack whilst maintaining a better degree of control over the weapon."}, {"tag": "p", "text": "Some versions of the lightsaber also contained a rotating wheel of sharp razor blades which could intimidate an enemy or be used as an alternative way of slicing through opponents. Ezra Bridger's hand was almost sliced off when the Eighth Brother used this feature."}, {"tag": "p", "text": "The weapon suffered from a number of design flaws: if given the opening, an opponent could cut through the disc from the inside or outside of the ring, causing the weapon to fly apart if spinning. The ringed emitter also presented a larger target for a disarming move, and should the emitter be damaged it affected the lightsaber's ability to function properly. This was demonstrated by the Fifth and Eighth Brothers when facing Ahsoka Tano, Kanan Jarrus, and Maul in a confrontation on Malachor; both times, their opponents targeted the emitter and damaged it, which led to both their deaths shortly afterwards."}, {"tag": "p", "text": "It could also be used to fly, but only by Force-sensitives, combining micro-repulsor lifts with the blades' spinning in a propeller-like motion to lift the wielder off the ground. This was often used as a method of escape, particularly from combat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}