{"url": "Double-bladed_lightsaber", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Lightsaber variations"], "nodes": [{"tag": "h1", "text": "Double-bladed lightsaber"}, {"tag": "p", "text": "The double-bladed lightsaber, also called a saberstaff or lightstaff, was a lightsaber variant that featured a blade emitted from both ends. Several variants on the type existed, including the hinged double-bladed lightsaber, the split saber, the lightsaber pike, and the double-bladed spinning lightsaber. According to the mythical Qel-Droma Epics, double-bladed ligthsabers dated back to a Sith Lord named Exar Kun."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The double-bladed lightsaber was, simply, a lightsaber with blade emitters on both ends. Such a weapon could be wielded like a typical single-bladed lightsaber if only one blade was ignited. This lightsaber style had several variants: Hinged double-bladed lightsabers effectively consisted of two single-bladed lightsabers joined with a hinge at the ends. Notable wielders of this saber style included Pong Krell and the Jedi Temple Guard. Temple Guards also used lightsaber pikes, which had a much longer handle and shorter blades compared to typical double-bladed lightsabers."}, {"tag": "p", "text": "Split sabers had handles that detached, allowing their owners to fight with either one double-bladed weapon or two single-bladed weapons as they pleased."}, {"tag": "p", "text": "The Imperial Inquisitorius used distinctive double-bladed spinning lightsabers, which had relatively short handles and a ring around which the active blades could spin, allowing their wielders to even fly in certain locations. However, the ring was also a weakness, as cutting it would instantly destroy the weapon. This weakness was used against the Grand Inquisitor on two occasions, the second leading to his death."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The existence of double-bladed lightsabers dated back to the mythical Sith Lord Exar Kun of the Qel-Droma Epics."}, {"tag": "p", "text": "The Dathomirian Zabrak Sith Lord Darth Maul wielded a red double-bladed lightsaber he created himself. Maul's lightsaber was damaged when he was defeated by Obi-Wan Kenobi during the Battle of Naboo. Savage Opress, Maul's brother, also wielded a red double-bladed lightsaber he received from Count Dooku during his brief stint as the Sith Lord's apprentice. When Opress recovered Maul from the junk planet Lotho Minor, Maul only had one half of his old lightsaber. He wielded it as a single-bladed lightsaber for a time, but by the time of the Siege of Mandalore, he had rebuilt it into a double-bladed weapon. However, he lost the saber for good when he was captured by Ahsoka Tano during the Siege."}, {"tag": "p", "text": "Count Dooku's personal assassin and apprentice Asajj Ventress had a pair of curved-hilt lightsabers that could be joined together at the hilt into a single weapon by a locking mechanism, becoming a double-bladed lightsaber. However, she rarely wielded her sabers in that fashion. This was a configuration known as a split saber, one that was also fielded by Jedi such as Cal Kestis."}, {"tag": "p", "text": "During the Clone Wars, Besalisk Jedi Master Pong Krell wielded dual hinged double-bladed lightsabers, one blue-bladed and one green-bladed, which could fold at the middle. Jedi Master Jaro Tapal also utilized a saberstaff in battle. The Jedi Temple Guard wielded a similar weapon, the yellow double-bladed lightsaber pike."}, {"tag": "p", "text": "The Imperial Inquisitors, dark side adepts tasked at identifying and hunting down Jedi following Order 66, fought using their unique version of the weapon. Their red double-bladed spinning lightsabers could also be used as regular single-bladed lightsabers."}, {"tag": "p", "text": "During the Imperial Era, Maul used another double-bladed lightsaber, which could be disguised as a cane and bore strong visual similarities to the lightsabers wielded by members of the Inquisitorius. Maul wielded this lightsaber until his death on Tatooine at the hands of his old enemy Kenobi a few years before the Battle of Yavin."}, {"tag": "p", "text": "While searching for the wayfinder on Kef Bir in 35 ABY, Rey fought a vision of herself as a Sith. In the vision, her dark side counterpart wielded a hinged double-bladed lightsaber with red blades."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The double-bladed lightsaber first appeared in the Star Wars canon in the 1999 film Star Wars: Episode I The Phantom Menace. It was originally conceived by writer Tom Veitch and artist Christian Gossett for the Star Wars Legends comic book series Star Wars: Tales of the Jedi. Gossett has said he thought of lightsabers as the personal \"honor weapons\" of the Jedi, and would be more customized to suit personal preference rather than standardized for all."}, {"tag": "p", "text": "During the development of Star Wars: Episode VII The Force Awakens, screenwriter Michael Arndt became really interested in the motif of \"fire and ice\" and wanted to have one character wielding a double-bladed lightsaber, with one side red and the other blue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}