{"url": "Double-bladed_lightsaber/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Lightsaber variations"], "nodes": [{"tag": "h1", "text": "Double-bladed lightsaber"}, {"tag": "p", "text": "The double-bladed lightsaber—also called a Saberstaff, Lightsaber Lance, Doublesaber, Dualsaber, or Lightstaff, was a specialized type of lightsaber that consisted of a single hilt with a beam emitter at both ends, resulting in a weapon that was wielded in a similar manner to a traditional quarterstaff. Indeed, the design was likely influenced by the Zabrak quarterstaff, or zhaboka."}, {"tag": "p", "text": "The double-bladed lightsaber was first invented by Dark Lords of the Old Sith Empire. However, many weapons of its design later came into the possession of the Sith's ancient adversary, the Jedi."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The original double-bladed lightsabers devised by the original Dark Lords of the Sith Empire were of a sophisticated design, consisting of a single lightsaber mechanism with two sets of emitters, one on either end of the hilt. One of the finest examples of such a weapon was the lightsaber of Exar Kun, which was converted from a standard lightsaber after Kun procured the schematics from a Sith holocron. The doublesaber design was simplified in later years, retaining a single mechanism, but featuring an enlarged hilt. Whether this was an intentional design change or simply the result of contemporary manufacturers being incapable of replicating the original mechanism is unknown. However, most saberstaff designs were extremely simplistic, consisting of two separate lightsabers with connected pommels, rather than a single mechanism. This design, while less elaborate, also resulted in a considerably lengthened handle, though it otherwise remained the same."}, {"tag": "p", "text": "The primary purpose of the double-bladed lightsaber was to allow for a faster rate of attack, unleashing a rapid assault with only a minimum of movement, \"more slaughter per swing\" as some put it. Saberstaffs were also excellent defensive weapons, as the doubled length of the weapon provided more surface area for deflecting and parrying. In addition to the practical benefits of the weapon, it also possessed a great psychological impact. The dual-blades increased the visual impact of the weapon, and in combat, opponents would intuitively try to track the blades separately rather than as a single weapon, overwhelming them. The extra blade also served to surprise opponents or counter them, as demonstrated by Darth Maul during the Battle of Naboo. While keeping his eyes on Qui-Gon Jinn, Maul used the extra blade to block an attack from behind by Obi-Wan Kenobi. Another example included Savage Opress during his and Maul's duel with Darth Sidious on Mandalore. Opress struck out at Sidious with only one blade activated, but when Sidious attempted to attack Opress, he merely activated the second blade to deflect the blow. The two blades even made the Saber Throw technique more deadly as the extra blade allowed for twice as many kills, especially if thrown into a crowd of people, again demonstrated by Opress on Mustafar, where he decapitated five Black Sun leaders with one throw by hurling it down the conference table they were seated at."}, {"tag": "p", "text": "However, despite all of the advantages offered by the weapon, its weaknesses were equally obvious. Special training was required to wield the weapon effectively, with those attempting to use it without such discipline likely to bisect or impale themselves. Attacking and parrying with the double-bladed lightsaber was limited by the fact that, unlike a normal lightsaber, one could not simply readjust their posture, as the saberstaff required them to hold it either horizontally or diagonally while fighting."}, {"tag": "p", "text": "The techniques employable with a double-bladed lightsaber were extremely limited, as the second blade rendered many positions and movements impossible to execute, or required the wielder to twist oneself awkwardly around the weapon to do so. Many techniques required the user to perform elaborate flourishes in order to move the staff around their body, leaving them open, and any sort of fighting method that focused on power or penetration was difficult to apply. Also, the enlarged hilt common to most double-bladed lightsabers presented a large target, difficult to defend. Opponents would often attempt to employ the sun djem contact mark, with even experienced saberstaff wielders being vulnerable to this tactic. However, a duelist who used the more contemporary saberstaff design had a fallback option in case of this; with a separate lightsaber mechanism for each emitter, at least one half of the weapon was very likely to continue functioning if it was sundered. Others may have constructed two single-bladed lightsabers that could be attached to each other, and both could continue to function. For a Jar'Kai user like Asajj Ventress, this afforded several advantages."}, {"tag": "p", "text": "Due to these many drawbacks, most duelists opted for the standard, single-bladed lightsaber as opposed to this specialized weapon. However, this provided most double-bladed lightsaber wielders with an additional edge as their opponents lacked any experience against such a weapon, though even this edge could be countered by something as simple as quarterstaff training, preparing a duelist to engage someone wielding a saberstaff."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Use during the Sith Wars"}, {"tag": "p", "text": "The original double-bladed lightsabers were created by the Old Sith Empire, hence the name \"Sith lightsaber,\" who also apparently designed the modern standard lightsaber. However, the weapon didn't appear until the Great Sith War against Exar Kun's Brotherhood of the Sith. Kun converted his original Jedi lightsaber into a saberstaff, basing the design on schematics obtained from a Sith holocron. He first brandished the weapon on Coruscant while rescuing his captured apprentice Ulic Qel-Droma, confronting his former Jedi master, Vodo-Siosk Baas, who was slain by his former apprentice after Kun unsheathed the second blade. The Jedi were utterly unprepared for this weapon, having never seen anything like it."}, {"tag": "p", "text": "Kun's lightsaber remained forgotten on Yavin IV until it was retrieved by the Jedi Shadow Celeste Morne, who was searching for Sith artifacts to be stored by the extremist Jedi Covenant. The lightsaber remained in Odryn repository for several years before being stolen by the Moomo Brothers. The weapon changed hands several times before falling into the hands of Antos Wyrick, who later donated it to Jarael. Jarael wielded it against her old enemy and rival, as well as Wyrick's daughter, Chantique, and would have killed her had she not been stopped by Zayne Carrick. Unfortunately, the lightsaber fell into Chantique's hand and it amplified her Force powers. When Wyrick attempted to procure a lightsaber to wield against the later disarmed Chantique, he accidentally took up Kun's, impaling both himself and his daughter on the twin blades. Carrick then gave the weapon to the Jedi Council for safekeeping."}, {"tag": "p", "text": "During the Jedi Civil War, double-bladed lightsabers became very popular among the Sith forces, with even some Jedi wielding the weapon. However, the Jedi Council traditionally frowned on the use of saberstaffs, believing a traditional lightsaber was enough, and considering the double-bladed lightsaber little more than a weapon designed to kill more effectively, while the Jedi developed the lightsaber to defend. Though there was no rule forbidding its use, the Jedi discouraged their students from attempting to create or use this weapon. Despite this, even some Jedi Masters, such as Zez-Kai Ell, took up the weapon."}, {"tag": "p", "text": "During the resurgence of the old Sith Empire, saberstaffs were a favored weapon of both the Sith inquisitor caste and the Jedi Consular, though they were wielded by numerous individuals. Notable wielders included the Sith Darth Thanaton, Vindican, Barel Ovair, Jaesa Willsaam, and Jedi Grand Master Satele Shan."}, {"tag": "p", "text": "However, despite their popularity among these groups, double-bladed lightsabers remained relatively obscure weapons, most duelists preferring the standard single-blade. During the reign of Lord Skere Kaan and his Brotherhood of Darkness, saberstaff training was made readily available, the Korriban academy swordmaster, Kas'im favored such a weapon. When Darth Bane set about establishing his Rule of Two, he provided his apprentice, Darth Zannah, with saberstaff training. Few Jedi took up the weapon, a notable being Sarro Xaj, as the Order continued to frown on the use of it."}, {"tag": "h3", "text": "Usage during the Rise of the Empire"}, {"tag": "p", "text": "Over the course of the following millennia, double-bladed lightsabers faded into obscurity. While the Jedi occasionally used them for training purposes, their use in actual combat became virtually unheard of. For this reason, the emergence of the saberstaff-wielding Darth Maul was a massive shock."}, {"tag": "p", "text": "Darth Maul originally crafted his unique weapon in a display of tactical skill; dispatched by his master to assassinate the Jedi Master Siolo Ur Manka, Maul proved unable to bring down the Jedi through martial prowess, so he fabricated his saberstaff so as to surprise the Jedi. In the ensuing melee, Maul ignited the second blade of his weapon through Manka's chest. Maul's skill and familiarity with the weapon was thanks to his knowledge of the Iridonian Zhaboka, which his original weapon was created in imitation of. His master, Darth Sidious, would provide Maul with Sith schematics, allowing him to refine the design. Maul would go on to wield his weapon against such noted Jedi duelists as Anoon Bondara and Qui-Gon Jinn, defeating both. Maul was ultimately brought down by Jinn's Padawan, Obi-Wan Kenobi, who managed to slash Maul's weapon in half. Despite acknowledging the efficiency of the saberstaff, Darth Sidious considered it as only a weapon for barbarians amongst the Sith."}, {"tag": "p", "text": "During the Clone Wars, double-bladed lightsabers continued to be rare weapons. A notable wielder of the lightsaber was Asajj Ventress, Dark Acolyte and Sith aspirant. Ventress was provided with the Paired lightsabers of the fallen Jedi Komari Vosa, the former student of her current master, Dooku. Ventress trained with the weapon, becoming an adept saberstaff wielder. However, her skills with the weapon proved inadequate to combat such skilled duelists as Mace Windu, Anakin Skywalker, or Obi-Wan Kenobi. Skywalker himself provided his Padawan, Ahsoka Tano, with quarterstaff training in order to prepare her for a saberstaff wielding opponent. Savage Opress, Dark Acolyte and brother to Darth Maul, also wielded a double-bladed lightsaber. Although his skill with the weapon was little more than brutish hack and slash, he was still good enough to not injure himself or his allies. Besalisk Jedi General Pong Krell was unique in that he dual-wielded double-bladed lightsabers, taking advantage of his extra set of arms. Jedi Temple Guards and Jedi Brutes also wielded double-bladed lightsabers, with the former having ones that produced yellow blades."}, {"tag": "p", "text": "The notorious cyborg Jedi hunter General Grievous also possessed a double-bladed lightsaber; specifically the weapon carried by Darth Zannah. He kept the lightsaber in the cockpit of his personal fighter, the Soulless One, though it remains unknown whether or not he trained with it. The weapon was later given to N-K Necrosis, an advanced droid construct created from Grievous' cyborg exoskeleton. Saberstaffs were also heavily favored by the Jedi brutes. The brutes were Jedi chosen for their imposing physical build and talent in lightsaber combat. Trained to specialize in lightsaber combat forms III through V, they were devoted towards guarding the Jedi Temple. Though light and dark side users did use these types of lightsabers, the Jedi of old traditionally only permitted those skilled enough in their training to use them, citing how deadly they could be when not used correctly."}, {"tag": "h3", "text": "Usage during the Great Jedi Purge"}, {"tag": "p", "text": "With the Great Jedi Purge, saberstaffs again fell into obscurity. Already a rare weapon beforehand, the Purge reduced the number of wielders to almost zero. Most of the doublesaber wielding Jedi Brutes were killed during the sacking of the Jedi Temple by Darth Vader."}, {"tag": "p", "text": "One of the few surviving wielders was Jastus Farr, who attended the Conclave on Kessel to determine what was to be done. Vader stormed the gathering, attacking the Jedi. In the ensuing duel, Farr managed to score a hit on the Sith Lord with his double-ended weapon, though Vader in turn managed to procure a cortosis sword from one of the other Jedi, disabling Farr's weapon. Unarmed, Farr was gunned down by the newly arrived 501st Legion."}, {"tag": "p", "text": "Galen Marek's training droid, PROXY, also wielded a double-bladed lightsaber. The weapon was one of many provided to the droid by Darth Vader, which he kept stored in his chassis when not in use. PROXY brandished the weapon against Marek on Raxus Prime, activating his Darth Maul combat module in an attempt to execute his primary programming; randomly attack Marek with lethal force to keep the Force adept sharp. PROXY was defeated, his weapon slashed in two, with both ends being used to pin him against a wall."}, {"tag": "p", "text": "When Darth Maul was resurrected on Kalakar Six by a Sith splinter cult, he fabricated a new weapon, wielding it against Darth Vader, whom he intended to replace. Both duelists held their own against one another, until Vader slashed Maul's weapon in two. Maul used the two halves against Vader in a vicious dual-blade assault, forcing Vader to resort to desperate tactics to survive."}, {"tag": "h3", "text": "Usage during the Jedi reestablishment"}, {"tag": "p", "text": "When Luke Skywalker reestablished the Jedi Order, he eventually included double-bladed lightsabers among the weapons his students were given access to, making training with them standard. However, beyond the Jedi, only a few groups took up doublesabers during this period."}, {"tag": "p", "text": "One of the groups to do so was the New Reborn, a reformation of the old group and Sith cult that emerged in 14 ABY, led by Tavion Axmis. Along with dual-blade wielding, saberstaffs was popular within the group, with numerous duelists wielding them."}, {"tag": "p", "text": "Double-bladed lightsabers continued to be rarely seen weapons for decades. By the time of the Third Jedi Purge in 137 ABY, one of the few Jedi wielders was the Twi'lek Shado Vao. His weapon was similar to Exar Kun's weapon, being only slightly longer than a standard lightsaber so as to pass off as one. However, when fully activated, it appeared to extend outwards to double the length. Saberstaffs were equally rare among the Sith forces, one of the few wielders being Darth Azard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The double-bladed lightsaber was originally conceived by Tales of the Jedi writer Tom Veitch and artist Christian Gossett. Gossett has said he thought of lightsabers as the personal \"honor weapons\" of the Jedi, and as such would be more customized to suit personal preference rather than standardized for all. The lightsaber made its first appearance in Tales of the Jedi – The Sith War 3, though it wouldn't be made famous until the release of Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "In the video game Ratchet And Clank: Up Your Arsenal there is a cheat code that replaces the melee weapon (wrench) with a double-bladed lightsaber, called 'Dual Laser Saber'."}, {"tag": "p", "text": "Jedi Knight: Jedi Academy mistakenly identifies the double-bladed lightsaber as a two-handed lightsaber."}, {"tag": "p", "text": "In the video game Star Wars: The Old Republic, the double-bladed lightsaber is wielded by the Sith assassin of the advanced Inquisitor class and its light side counterpart, the Jedi Shadow in the advanced Consular class."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}