{"url": "Dowager_Queen/Legends", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Colony ships", "Category:Crash sites", "Category:Hotels", "Category:Mos Eisley locations"], "nodes": [{"tag": "h1", "text": "Dowager Queen"}, {"tag": "p", "text": "The Dowager Queen, or \"Jah Dowahga Kwee-Kunee\" in Huttese, was a colony ship from Bestine IV that crash-landed on the planet of Tatooine in 100 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the time of the Dowager Queen's arrival at Tatooine, Mos Espa was small enough that the crew didn't notice it, and assuming that the planet was uninhabited they attempted to land, where a sandstorm wreaked havoc on the power, display, and guidance systems on the Queen, causing it to crash."}, {"tag": "p", "text": "Captain Lis Kaslan and the other survivors—the original \"colonists\"—built their first city, Eisley, out of the wreckage, while others who left went to found Bestine Settlement. The original inhabitants of Tatooine later renamed the city \"Mos Eisley\" to coincide with Mos Espa."}, {"tag": "p", "text": "The city of Mos Eisley grew up around the wreck. As buildings were constructed, the ship remained in its place, standing nearly vertically in the sand. It was later made into a first-class hotel, because of both its novelty and location at the intersection of Dune Street and Inner Curved Street. The hotel became popular during conventions and trade shows that came to Tatooine."}, {"tag": "p", "text": "Many Jawas, Ranats, and other rodent-like species (as well as homeless, beggars, and junkies) lived in the wreckage prior to the conversion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dowager Queen made an appearance in the special edition release of Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}