{"url": "Dr%27uun_Unnh/Legends", "categories": ["Category:Legends articles", "Category:Alliance Starfighter Corps personnel", "Category:Males", "Category:Naturalists", "Category:Pilots", "Category:Scouts", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Dr'uun Unnh"}, {"tag": "p", "text": "Dr'uun Unnh was a male Sullustan naturalist who served with the Rebel Alliance and was little recognized during his life, yet proved to be very thorough and exacting in his job. His work would continue to be utilized after his death, by the New Republic and the New Jedi Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Not much is known about Dr'uun Unnh's early life, but he was born and grew up on the Sullustan home world of Sullust. From an early age, he developed a fascination with gathering information and hoped during his life to contribute a small dollop to the knowledge bank of society. He made a point of studying all the major archaeological artifacts in the galaxy and gaining a broad working knowledge of natural history and alien ecosystems, so that he would be better equipped for a life of information gathering."}, {"tag": "h3", "text": "Tatooine"}, {"tag": "p", "text": "In 0 BBY, Dr'uun Unnh traveled to Tatooine for unknown reasons. During his visit, he stopped at Chalmun's Spaceport Cantina. While at the bar, the Ariwook Rff Huff began shooting with the Ganimed bounty hunter Purong. Unnh pulled out his own blaster pistol to defend his own life if needed."}, {"tag": "h3", "text": "Working for the Rebel Alliance"}, {"tag": "p", "text": "He joined the Rebel Alliance early on in the Galactic Civil War and was present at the Dantooine base, where he was fascinated by the early, tense struggles of the war. Like many Rebels, he always considered Dantooine only to be a temporary home for the Rebels, however as time went by, it began to become a more permanent base. However, an Imperial observation device was discovered in cargo of equipment brought to the base and they were forced to evacuate and search for a different location for a base. After the Alliance rejected the ideas of bases on Akuria II, Boz Pity, and Tynna, Unnh was the one to suggest the Great Temple on Yavin 4, a moon he had scouted. The Alliance agreed and Unnh accompanied the teams of Rebel soldiers and the Alliance Corps of Engineers that were sent to Yavin 4 to reinforce and make habitable the crumbling temple."}, {"tag": "p", "text": "On his arrival on Yavin 4, Unnh was fascinated by what he found and it seemed to him as if the ruins and jungles were calling to him. He wanted straight away to start studying everything, but priority for the Rebels was on making the temple habitable, so he put his investigations on hold while he assisted with them. Despite this, he still took every opportunity he had to study details of the jungle at every place it intersected his work. His amazement at all the wonderful archaeological finds around him made him chitter, and he found it hard to concentrate on the task at hand. He kept his datapad with him at all times, to record his impressions, photographs of strange inscriptions, and keep precise before-and-after notations of the modifications made by the Rebel engineers. The engineers frequently needed his services, to crawl through tight tunnels where cave-ins had occurred, dragging power conduits behind him, and mounting illumination devices to assist in the repair activities. Occasionally, they would have to call to him, startling him out of a close inspection of a nest or fungus that he had discovered."}, {"tag": "h3", "text": "Studying Yavin 4"}, {"tag": "p", "text": "When two levels of the temple were cleared for occupancy, Unnh was able to begin further exploration and he began to compile an enormous database of everything. He realized that it would take a dedicated team of scientists years to catalog everything on the small moon, so he hoped to be able to record the main features and species, so as to establish a framework which, in the future, when the war was over, scientists could use to finish the work in his name. He soon found clear indications of a deep and widespread destruction that had taken place thousands of years ago. He believed that this was also connected to the extinction of the temple-building Massassi and an ancient and devastating galactic conflict and he also hoped that future archaeological work could confirm this hypothesis."}, {"tag": "p", "text": "One of the first things he investigated was the climate of Yavin 4. He noticed that, because it was moon orbiting gas giant, had two types of nightfall: when the moon rotated on its axis, facing away from sun but still staring at Yavin Prime, a \"twilight night\" would occur, and when the moon went behind the planet, eclipsing the sun and causing what he called “dark night”. During their first few months on the jungle moon, several unexpected storm periods forced the Rebels to barricade themselves inside the ruins to protect themselves and during one of these, Unnh was studying the ruins of a small, isolated Massassi temple. He sat in the cold, damp temple listening to the howling wind and feeling the chill right through to his bones, as he wrote with great emotion on how he considered it to be the longest night of his life. He also discovered another amazing atmospheric phenomena, which he called \"rainbow storm\". He saw his first rainbow storm on the morning following a dark night. As the sun emerged from the side of the gas-giant, its ice crystals high up in the air combined with the polarized rays coming through the upper atmosphere, to create whirling, scintillating showers of rainbows. He captured images of this on his personal datapad and chattered excitedly about this to some of his friends. From that point on, some Rebels would climb the newly constructed observation towers to watch the rainbows pour down for the few minutes before the sunlight separated itself from the atmospheric fringe to shine full daylight on the moon."}, {"tag": "p", "text": "Dr'uun Unnh considered the jungles of Yavin 4 to be his greatest love there and he devoted much of his time studying them and identifying the various creatures there. Many sections of the Yavin jungles were so dense that they were impenetrable, even to a small Sullustan like Unnh. In some places, vines and trees interlocked and grew together to wall off isolated clearings. He discovered that the clearings were like microhabitats and were sealed off from the rest of the jungle, so that the trapped animals and plants eventually inbred so much that they died out. He studied the flora of Yavin 4 and recorded such species as the Massassi tree, the blueleaf, nebula orchids, and the touch-not, a highly dangerous plant that he learned first hand could cause the skin to blister and burn with he slightest touch. The sluggish rivers particularly intrigued him and he described them as \"watered down primordial soup\", with strange creatures within, like anglers, armored eels, swimming crabs, and mucous salamanders. He also devoted time to studying the behavior of land animals, like stintarils, runyips, and tree ticks. He was not too keen on woolamanders, after some of them pelted him with fruit and broken branches, while he was also not overly fond of piranha beetles, after watching them in a feeding frenzy, something he hoped never to have to see again."}, {"tag": "h3", "text": "The Massassi temples"}, {"tag": "p", "text": "While many of the Rebels complained about their dim quarters in the damp temple, they reminded Unnh of the tunnel warrens on Sullust and he always slept comfortably and woke refreshed and eager to go out and investigate further. He studied the Great Temple and recorded the strange tile patterns in the Grand Audience Chamber. He liked to come into the vast chamber and listen to his own words as he dictated into his datapad and collected his thoughts in the peaceful solitude. As he heard his own whispers echo around the room, it seemed to him almost as if the Massassi were somehow spilling their lost and forgotten secrets."}, {"tag": "p", "text": "On foot, Unnh explored other Massassi temples in the surrounding area. Across the forks of a river close to the main base was a smaller temple, which he named the Temple of the Blueleaf Cluster, after the ornate carvings of blueleaves on its exterior. In the center of its main chamber, he discovered a strange, elongated crystal pyramid that filled the whole temple with strange, cold, blue light. Its surface felt to him to be cool and tingly, as if it was charged with static electricity and was a giant battery containing an enormous amount of power. As he gazed into it, he became convinced that he could see the withered faces of strange alien souls trapped within the crystal, gazing back at him. This scared him, and as no one knew what had happened to the Massassi, he advised caution to the other Rebels. General Dodonna agreed with him, and as soon as the initial exploration and mapping expeditions were complete, Dodonna had the temple sealed off and forbade the Rebels to go there. Across the other fork in the river, he found another temple, the Palace of the Woolamander. This was larger than the Temple of the Blueleaf cluster, but was in a much worse condition and was a crumbling ruin with a lot of structural damage. Unnh named it after a group of woolamanders that he found living in it that threw rock shards and rotting fruit at him. Because of this, he didn't get to have much of a look around it, but he was not that bothered by this as he didn't consider it to be of much interest anyway."}, {"tag": "p", "text": "As the Rebels began to settle down in their new base and into a tense, but well-ordered routine, Dr'uun Unnh began to travel further and further from the Great Temple during the course of his investigations. On maps taken from orbit above the moon, he could see there were many other temples poking through the forest canopy. So that he could go on wide-ranging trips to explore these temples and study wildlife elsewhere on the moon, he commandeered a smaller speeder bike, which he had to adjust to fit his compact stature. He fitted a tracking device to it and always made sure that he let someone at the Rebel base know where he was going and how long he was going to be, so that in an emergency, he could be found. He even got himself a blaster, although this was not much use as he had poor eyesight and a bad aim. Now that he was equipped, he was ready for expeditions further afield and it was during last one of these that he made what he considered to be his greatest discovery. On an island in the middle of a small lake, he found another temple, but this one was different from all the others, in that it appeared to have withstood the ravages of time. It was carved out of black obsidian and its runes and hieroglyphics were as fresh as the day they were made thousands of years before. No animals or plants had made their home in it, as if some unknown dark force prevented them from doing so. At the apex of the temple stood a statue of a dark man, who Unnh believed to be a Sith Lord. Unnh tried to read the runes for further information that might shed light on the identity of the man and he translated them with his datapad. He translated some as Sith magic and curses of defilers of the temple, but others told the story of the context in which the temple was constructed. He was astonished by this story and the runes gave compelling evidence to a theory that he had been developing in the back of his mind, that the extinction of the Massassi was the result of an ancient struggled between the Jedi Knights and the Sith, possibly connected to the legendary \"Sith War\"."}, {"tag": "p", "text": "Unnh was very excited by his discovery and he climbed on his speeder bike and headed back towards the Great Temple, so that he could tell the other Rebels about what he had found. At that moment, the Battle of Yavin was beginning, but in his excitement, he failed to notice the Death Star approaching above the moon, or the squadrons of Y-wings and X-wings that flew up to confront it. An Imperial TIE/LN starfighter was damaged during the battle and the pilot unsuccessfully tried make an emergency landing, crashing on top of Unnh's speeder bike as he passed through a small clearing. The small Sullustan had been incredibly unlucky and was simply in the wrong place at the wrong time. He died instantly."}, {"tag": "p", "text": "It wasn't until several days later that the Rebels found the body of Dr'uun Unnh. They had been preoccupied with counting the pilots and ships lost during the battle, and as a result did not realize he was missing. Rebel troops tracked him using the device that he had attached to his speeder bike and dragged his body out from beneath the wreck of the TIE Fighter. They buried him next to it and left him to become one with the moon that had been the subject of so much of his fascination and enthusiasm."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Dr'uun Unnh's personal datapad was relatively undamaged and the search team took it from his body and gave it to the Rebel scientists back at the Great Temple, who carefully copied all the information that he had gathered. Although many of their computer records were damaged during the subsequent Imperial attacks, most of Unnh's work survived and the Rebels took it with them when they left Yavin 4 ."}, {"tag": "p", "text": "Even during the days of the New Republic, most of the information known about Yavin 4 came from what he had recorded, with the New Jedi Order using the information Unnh had gathered to understand the moon, when Luke Skywalker established the Jedi Praxeum there in 11 ABY. After the death of Gantoris, Corran Horn used Unnh's data to try and find the location of the temple in which the spirit of Exar Kun was anchored. He used it to learn more about the Temple of the Blueleaf Cluster when he went there to survey it, along with Brakiss and Kam Solusar. When Horn later found the location of the temple, from Dorsk 81's datapad, he used Unnh's data again to find out more about that particular temple."}, {"tag": "p", "text": "The Unnh River on Yavin 4 was presumably named after him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dr'uun Unnh had a very inquisitive mind and was constantly trying to understand the order of the galaxy and how things fitted in to it. He was very enthusiastic about gathering information and was not daunted by the immense task he faced in cataloging all the lifeforms on Yavin 4; instead, that attracted him even more. However, his enthusiasm meant that he sometimes found it hard to keep his mind focused, such as when he was helping to make the Great Temple habitable, as he thought over new theories in his mind, or saw something interesting to study. He was a broad-based naturalist and this exerted itself well over his personality, as he viewed things with fascination, rather than the caution that they sometimes deserved. As a result, he sometimes got into situations that he only escaped through sheer luck, like when large, dangerous animals proved to be more interested in eating him than providing him with zoological data."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dr'uun Unnh was created by Kevin J. Anderson in The Illustrated Star Wars Universe and the Yavin 4 chapter in that was written from the in-universe perspective of him and was supposedly a fictionalized version of parts of his life compiled from his voluminous electronic journals...on the jungle of Yavin. His picture in The Illustrated Star Wars Universe depicts him as wearing a Rebel pilot flight suit, suggesting that he may have at one point been a starfighter pilot, although this has not been confirmed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}