{"url": "Draag", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Draag", "Category:Mid Rim species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Draag"}, {"tag": "p", "text": "Draags were a species of stocky, reptilian humanoids from the planet Ninzam VI. Due to their cold-blooded nature, they often wore temperature-regulating suits while away from their homeworld. The species's aggression, intelligence, and pushiness made them natural supervisors, and some Draags also used their adeptness with blasters to work as security forces. In 32 BBY, several Draags worked for Haugg Nerf Industries in the Industrial District of the planet Coruscant. Among them were two Draag fugitives, Regg Kuuga and Slaag Lado. Both Draags were captured by the bounty hunter Jango Fett as he made his way through the plant to capture its boss, Groff Haugg."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Draags were a species of sentient reptilian humanoids, each of whom was covered in pale, yellow skin and had a stout, bulky frame. Each Draag had a wide, rounded cranium that sat atop a burly neck. The face consisted of a wide, lipless mouth, a small puggish nose with four nostrils, and a pair of squinty eyes under heavy brows. A small ear hole perforated each side of the head, and several bony protrusions grew from the top and back of the skull. Draags had four-fingered hands. The species was cold-blooded and divided into both male and female sexes."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Draags had a reputation for ferocity and intelligence, and they were known for their inherent knack at using blaster weapons. They had a tendency to boss others around, a trait that made them naturals at supervisory roles, especially on security details. The species had access to galactic-standard technology, and some Draags became experts in demolitions. The species employed specialized environment suits to regulate their body temperatures in extreme climates; a typical suit consisted of a full-body jumpsuit, a pair of gloves and boots, a chestplate, and a helmet. A strap stretched across the upper lip just below the nostrils."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet of Ninzam VI gave rise to the Draag species, and after their introduction to the galaxy beyond—an event that occurred at some point between 3000 and 1004 BBY—the Ninzam system became integrated into the Ryndellian sector of the Mid Rim. From 1004 to 1000 BBY, the Draag homeworld lay within unaligned or contested space as the New Sith Wars raged. By the end of the Clone Wars, it fell within Galactic Republic-controlled space. The Draag's home region had an average of 10 to 100 million inhabitants per star system c. 25 ABY. By 137 ABY, the species's territory was within the area claimed by the Sith Lord Darth Krayt as part of his Galactic Empire."}, {"tag": "h2", "text": "Draags in the galaxy"}, {"tag": "p", "text": "Draags who left Ninzam VI were often hired to work in supervisory roles at large factories; they were especially valued as heads of security details. Leaving their homeworld often subjected Draags to cool temperatures with which their natural metabolisms could not cope, so off-world members of the species often relied on temperature-controlling body suits."}, {"tag": "p", "text": "In 32 BBY, a nerf-meat-processing plant known as Haugg Nerf Industries, located within the Industrial District of Coruscant, employed several Draags, all of whom wore orange jumpsuits to contend with the cool temperatures inside the factory and carried blasters. One such Draag worked in the hangar where the plant received shipments from incoming speeders. Although other employees were kept ignorant of such dealings, including a Guineo guard under the Draag's supervision, the hangar chief knew that the plant was actually a cover for the illicit processing and transshipment of potent narcotics known as death sticks. When a pilotless speeder arrived one day, the Draag left to inform Groff Haugg, the plant's owner. He was stopped by the bounty hunter Jango Fett, who had infiltrated the plant to claim the bounty on Haugg's head."}, {"tag": "p", "text": "In his pursuit of Haugg, Fett encountered two wanted Draag criminals in the factory. The first of these, Regg Kuuga, was wanted by the Coruscant police for stealing high-value medical frigates, stripping them for parts, and building attack cruisers to harass tourists to the planet. The Draag was attacked by the bounty hunter on an elevated walkway."}, {"tag": "p", "text": "Kuuga was then captured alive."}, {"tag": "p", "text": "Slaag Lado, another plant employee, also had a bounty on his head; with ties to the Calamasthon Defiance and known Draag demolitionists, Lado was a terrorist in the view of the Mon Calamari Civil Authority, who held him responsible for initiating a seismic catastrophe in the Salinrerian Sea that resulted in untold harm to the environment and a state of constant rain. When Fett found Lado at the end of a corridor, the bounty hunter captured him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The April 2002 preview for the LucasArts video game Star Wars: Bounty Hunter, published in Star Wars Gamer 10 magazine, includes an illustration of a Draag in an enviro-suit, drawn by Cory Allemeier, and represents the species's introduction to Star Wars canon. In the second level of the video game itself, released in December 2002, the bounty hunter Jango Fett must fight through Draags and their associates in his quest to apprehend the criminal Groff Haugg. On the way, Fett may capture or kill two Draags who have bounties on their heads. Such a course is not necessary to progress in the game, but The Complete Star Wars Encyclopedia, published in December 2008, establishes that Fett does in fact capture the fugitive Slaag Lado in its entry on Lado. The narrative above assumes Fett also captures Regg Kuuga, as doing so provides the bounty hunter with the maximum reward for the level."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}