{"url": "Draay_Estate", "categories": ["Category:Legends articles", "Category:Coruscant residential buildings", "Category:Estates"], "nodes": [{"tag": "h1", "text": "Draay Estate"}, {"tag": "p", "text": "The Draay Estate was located on Coruscant, serving the residence of the Draay family. Krynda Draay lived here with her household droid 9BD, as did her son Lucien until he joined the Jedi Order. The estate was greatly damaged in 3963 BBY after being fired upon by the Republic fleet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the end of the Great Sith War, Krynda Draay retired from active service within the Jedi Order. Every time the Jedi came with potencial candidates for Jedi training, she refused to see them. When the little Mirulukan girl Q'Anilia was brought to the estate, Krynda knew that she was special and agreed to train her. Krynda would later begin to train three other potential seers and form the First WatchCircle. Through them, Krynda created a secret Covenant of Jedi. Along with her husband's retainer, Haazen, she gathered Force-sensitive children and unsatisfied Jedi to make up her Jedi Covenant."}, {"tag": "p", "text": "Although not an official Jedi training center, many Jedi brought students to her for training; though she only accepted the most gifted. Having a special interest in the Miraluka, Krynda would train several at a time."}, {"tag": "p", "text": "When the First WatchCircle graduated, Krynda continued to train many seers at the Estate. After the Padawan Massacre of Taris she refused visitors, only interacting with others through Haazen."}, {"tag": "p", "text": "In 3963 BBY, Master Xamar brought fugitive Padawan Zayne Carrick and his companion Marn Hierogryph to the Draay Estate in order for Carrick to be properly examined by Krynda to determine his threat of his possession of the Muur Talisman. This proved to be a hoax. In reality, Xamar and Carrick planned to retrieve Krynda before the Jedi Order stormed the Estate to end the Covenant. Lucien wished to slay his \"fallen\" Padawan but Xamar warned him the \"Talisman\" (which was actually a fake) may claim another, and that only Krynda could assess the threat. Unfortunately, Haazen wanted to personally examine Zayne, forcing them to improvise, as Zayne put on a \"Sith act\" so that Xamar could open the doors for the Order's Knights to enter. Haazen then issued command word Vindication, which alerted all Covenant members to the threat. Haazan then gained control of the orbiting Republic fleet and forced it to fire on the skybridge, greatly scarring the Estate."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "An expansive complex of red stone, the Estate could be seen clearly from surrounding areas. With stained glass domes and windows, the walled mansion housed several hundred rooms and included rooftop gardens. Krynda grew many tall trees and bushes between the towers."}, {"tag": "p", "text": "Over the years more and more towers and rotundas were erected using funds from the Draay Trust. Accessed through a bronzium gate, the Estate had a spiraling design and one of the largest privately owned residences on the planet."}, {"tag": "p", "text": "After Raana Tey's death on Taris, the remaining members of the First WatchCircle erected a monument to their fallen comrade and held a memorial in her honor."}, {"tag": "p", "text": "The First WatchCircle had a computer room in the Estate where a large databank held records and profiles on all of their agents, including Covenant Shadows."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}