{"url": "Draba", "categories": ["Category:Legends articles", "Category:Crime lords", "Category:Females", "Category:Hutts"], "nodes": [{"tag": "h1", "text": "Draba"}, {"tag": "p", "text": "Draba was a Hutt crime lord who lived during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the time of the Galactic Civil War, Draba invested a lot of money in resources in getting Zerex, the governor of the planet Ord Adinorr, into her debt. Draba also once had a falling out with the bounty hunter Solvek and tried to feed him to a nexu. Solvek later tried to take a job from Zerex, but when the governor learned of Draba's grudge against the hunter, he had Solvek arrested and sent to the Spice Mines of Kessel. However, when Zerex gained a promotion to become the Moff of the Meridian sector, he broke off all of his ties to Draba, as he believed that it would be inappropriate for him to be seen socializing with a known criminal. However, Draba was angered by his betrayal, so hired a group of agents to blackmail Zerex into honoring his commitments to her."}, {"tag": "p", "text": "A short time afterward, the Imperial bureaucrat Narp Pilyev offered to sell Draba some valuable Imperial Navy documents that he had stolen. However, he wanted to sell them at a high price and told the Hutt that he would offer the documents to another buyer if she did not meet his price within five days. Draba responded by hiring a group of agents to infiltrate Pilyev's apartment on Coruscant, and steal the documents."}, {"tag": "p", "text": "Within months of his promotion to Moff, Zerex secured another promotion, to the position of Grand Moff. Draba believed that the promotion put Zerex in a position where he could threaten her and possibly even have arrested. As a result, she didn't want to allow the promotion to take place, so she hired some agents to assassinate Zerex before his inauguration could occur."}, {"tag": "p", "text": "At some point, the Clawdite thief Pol Virten stole a broken double-bladed lightsaber and a fragment of a Sith holocron from Draba. In response, the Hutt hired some agents to capture the thief."}, {"tag": "h2", "text": "Sources"}]}