{"url": "Dragon_Lords", "categories": ["Category:Legends articles", "Category:Outer Rim Territories organizations"], "nodes": [{"tag": "h1", "text": "Dragon Lords"}, {"tag": "p", "text": "The Dragon Lords were a group of people on the planet Drexel who lived together with the massive native species of aquatic lizards known as the sea-dragons. The Dragon Lords originated with a band of ship-wreckers who fled to the Drexel system after running afoul of Galactic Republic law. The wreckers thrived on Drexel's watery surface, but a group of technicians eventually rebelled against the leadership of the wreckers' Governor, sympathizing with the sea-dragons that constantly waged war against the newcomers."}, {"tag": "p", "text": "Although the uprising was put down and the ringleaders exiled, the castoffs found safe haven with the dragons, devising a way to communicate with them through sound waves and joining forces against the wreckers. The ensuing war lasted a generation, coming to a head in 0 ABY. With the dragons' existence threatened by the wreckers' sonic jammer, the Dragon Lords and their sea-dragon allies launched their biggest ever attack on their enemies. With the help of Rebel hero Han Solo, the ruthless Governor Quarg was cast down and the wreckers were defeated, paving the way for the Dragon Lords to take control of Drexel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Dragon Lords was the name taken by a group of natives on the watery Outer Rim world of Drexel, who made their living in symbiosis with the massive, sentient aquatic lizard species known as the sea-dragons. Descended from technicians who were exiled from a group of ship-wreckers on Drexel, the primarily Human Dragon Lords possessed great technological capability. The most crucial of the Dragon Lords' innovations was the sonic-staff, a device that allowed them to communicate with the sea-dragons through sound waves. To the other inhabitants and visitors of Drexel, the Dragon Lords were most often seen wielding these staffs as they rode on the back of the imposing sea-dragons, wearing aquatic gear and striking a fearsome and commanding figure."}, {"tag": "p", "text": "To outsiders, it appeared that the Dragon Lords used sonic-staffs to control the sea-dragons. However, that could not be further from the truth: the two groups lived peacefully as equals, comprising their own hidden society in a series of underwater caverns. The two groups fought together as allies in the battle against the wreckers who exiled them, using juvenile dragons as their spy system—as they were small enough to appear to be simple lizards, they went unnoticed on the wreckers' home ship. Much like the ship-wreckers with whom they shared a common origin, the Dragon Lords and their sea-dragon fellows made a living salvaging wayward ships for their valuable metal, which they used to build homes in their underwater world. In this, they were in direct competition with the ship-dwellers, with whom they often battled for the most valuable claims. A favored tactic of the Dragon Lords in these scrapes was to dive below the waves before suddenly resurfacing below their enemies' hydra craft, damaging them with violent headbutts from their sea-dragons."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Survival on the waves"}, {"tag": "p", "text": "The Dragon Lords traced their origins to the era of the Galactic Republic, and a group of outlaws who ran a ship-wrecking scheme out of the Korteen asteroid belt. The wreckers used sonic jammers to send passing ships hurtling into the asteroids, where they could be stripped of their cargo—protected by the system's Governor, the racket flourished, driving the development of more powerful and advanced jammers. However, this pursuit brought the attention of the Republic and the Jedi Order, who forced the remaining wreckers to flee in a damaged starship to the remote Drexel system. The group managed to make a life on the waves of the watery planet Drexel, building up a floating settlement around the remains of their starship."}, {"tag": "p", "text": "However, they still had to contend with one major predator: the sea-dragons, a fearsome native race of aquatic lizards who constantly attacked the ship-wreckers' settlement. Eventually, a group of the ship's technicians revolted against the rule of the ship's Governor, claiming that the wreckers were somehow responsible for the sea-dragons' near-ceaseless attacks. Although the Governor—the same man who had previously served as Governor of the Korteen system, and had fled to Drexel with the wreckers—squashed the uprising, he allowed the survivors to live, setting them adrift in a small lifeboat and assuming they'd die slowly upon the sea. Instead, they managed to survive, finding a safe haven in a series of caverns in an underwater mountain, and developing a device called a sonic-staff that allowed them to communicate with the dragons through sound waves."}, {"tag": "p", "text": "Taking the name \"Dragon Lords,\" they became the bitterest enemies of the wreckers. From the sea-dragons, the Humans learned the value of banding together in the face of a common enemy, and the two groups joined their societies together. In doing so, they learned that their belief that the wreckers were responsible for the sea-dragons' attacks were correct: the wreckers' sonic jammer emitted sound waves that drove some dragons mad. Aiming to protect the dragons and for revenge, the Dragon Lords and the sea-dragons resurfaced together and began to wage war on the wreckers, a conflict that would last a generation. This enmity lasted long after the death of the man who exiled them, as his son Quarg ascended to the role of Governor and continued his father's war. Quarg also furthered their ship-wrecking business, and the ships his sonic jammer ensnared often became flashpoints for battles between the Dragon Lords and the wreckers."}, {"tag": "h3", "text": "Battle for supremacy"}, {"tag": "p", "text": "These conflicts reached a fever pitch by 0 ABY. That year, Governor Quarg's sonic jammer brought down an unusual number of outsiders, starting with young Rebel hero Luke Skywalker, whose scout ship was ensnared while evaluating Drexel as a potential target for a new Rebel base. A Dragon Lord rider was the first on the scene, but his efforts to salvage the crashed ship were halted by the sudden arrival of a flight of Quarg's hydra skimmers. Although the Dragon Lord managed to destroy two of the craft, both of the sea-dragons at his side were wounded in the fighting, and they retreated before the third skimmer could finish the job."}, {"tag": "p", "text": "Soon afterward, a massive battlecruiser arrived in the skies over Drexel, flown by a pirate gang who was searching for a treasure they had been told was on the planet. Enamored by the massive prize that had just appeared overhead, Governor Quarg pushed his sonic jammer to full power, struggling to bring down the enormous Star Destroyer. Sensing that a desperate hour was at hand, the Dragon Lords and the sea-dragons formed up a massive army and launched their greatest attack ever on the wreckers' ship. The sonic jammer had driven many of the dragons into a frenzy, including ones that were carrying Dragon Lords, lending the ensuing battle an unhinged ferocity. In the thickest of the fighting, however, another foreign ship arrived: the Millennium Falcon, personal freighter of notorious smuggler and Rebel hero Han Solo, which had escaped captivity aboard the orbiting cruiser."}, {"tag": "p", "text": "Severely affected by the sonic jammer, the Falcon crashed into midst of the battle and was subsequently blasted by an onrushing hydra skimmer. The attack scattered the ship's passengers, including Solo, who was sent beneath the ocean waves. Solo was rescued by a passing Dragon Lord, who brought the smuggler to safety to the Dragon Lords' underwater settlement. The Dragon Lords had received intelligence that Quarg aimed to use the captured Falcon's engines to augment the jammer's power—although the Dragon Lords and the sea-dragons were winning the battle, any additional boost to the jammer could drive every dragon on the planet mad. Their existence at stake, Solo joined the Dragon Lords in one final push at the wreckers' ship, hoping to disable the jammer. Although they managed to break through the wreckers' inner defenses, Solo was unable to keep a captive, blackmailed Skywalker from activating the Falcon's engines and boosting the jammer, causing many dragons to collapse on the spot. However, at the critical moment, Skywalker saw an opportunity to break free and turn on Quarg, kicking the Governor overboard and freeing Solo to destroy the jammer with the Falcon's guns. Although the fighting continued well into the night, Quarg's death and the jammer's disabling ultimately decided the battle in the Dragon Lords' favor, clearing the way for a new order on Drexel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dragon Lords first appeared in Star Wars 11, written by Archie Goodwin and released in 1978. The group's backstory was given in the issue Star Wars 13, and the Dragon Lords continued to appear until the end of the story arc in Star Wars 15. In their appearances, the Dragon Lords were illustrated by Carmine Infantino."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}