{"url": "Dragonsnake", "categories": ["Category:Canon articles", "Category:Carnivorous creatures", "Category:Creatures of Dagobah", "Category:Creatures of Nal Hutta", "Category:Reptiles", "Category:Semi-sentient species", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Dragonsnake"}, {"tag": "p", "text": "The dragonsnake (also spelled dragon snake) was a large, predatory reptile that dwelled in the muddy waters of certain planets, including Dagobah and Nal Hutta. During the Clone Wars, the Jedi Master Obi-Wan Kenobi had a run-in with a dragonsnake while searching for Ziro the Hutt on Nal Hutta. Years later, Luke Skywalker crash-landed on Dagobah, where his astromech droid R2-D2 was saved by a friendly dragonsnake."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Living in the murky waters of swamp-covered planets such as Dagobah and Nal Hutta, the dragonsnakes were large serpentlike beasts with sharp fangs. Although voracious, they were incapable of digesting metal."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Dragonsnakes were believed to be predatory animals, living off the flesh of other creatures, but were in fact intelligent creatures and some were even friendly who enjoyed helping others. They hid under the muddy water and amongst gnarltree roots, waiting for their next meal to come close enough. After snatching its prey, a dragonsnake would then dive back under the water. They were amongst the most fearsome reptiles and were considered untameable."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point during the pan-galactic conflict known as the Clone Wars, the Jedi Masters Obi-Wan Kenobi and Quinlan Vos attempted to track down Ziro the Hutt on Nal Hutta. During the mission, Kenobi was attacked by a local dragonsnake. The creature was killed when the Jedi Master thrust his ignited lightsaber in the dragonsnake's head."}, {"tag": "p", "text": "In the year 20 BBY, a dragonsnake head was kept as a trophy on a Ubrikkian Floating Fortess by Trandoshan hunters on the moon of Wasskah."}, {"tag": "p", "text": "In 3 ABY, the aspiring Jedi Luke Skywalker accidentally landed in the middle of watery peat bog on Dagobah. A friendly dragonsnake that hid there snatched Skywalker's astromech droid R2-D2, believing that he was drowning. The friendly dragonsnake then spat out R2 back on dry land and went on its way."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}