{"url": "Draigon", "categories": ["Category:Legends articles", "Category:Races and species stubs", "Category:Flying creatures", "Category:Predatory creatures", "Category:Reptavians", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Draigon"}, {"tag": "p", "text": "Draigons were an avian species native to an unknown watery planet between Bandomeer and Coruscant. They ate fish from the oceans of their world, although this did not make up their diet entirely. Draigons were covered in silver scales and had strong legs and large, single-clawed wings, along with yellow eyes and dagger-like teeth. Draigons were said to resemble flying Ithorian razor sharks."}, {"tag": "p", "text": "In 44 BBY, Obi-Wan Kenobi, along with many Offworld Mining workers, were aboard the ship Monument when the craft crash-landed on the draigon home planet. At first, Obi-Wan and Jedi Master Qui-Gon Jinn believed the draigons to be harmless; however, they later realized this was not the case. Whiphid thugs, under orders from their Offworld Mining Corporation superior Grelb (who himself was following orders from his own boss, Jemba), tried to shoot Qui-Gon down from a cliff he was scaling in an attempted recovery of stolen dactyl hidden inside a cave in the cliffside. Qui-Gon Jinn, after recovering a cache of dactyl, jumped off the cliffside and landed on a draigon, persuading it to fly him down to ground level. The blaster bolts began driving the draigons to the point of hysteria, but in their concentration and glee the Whiphids failed to notice."}, {"tag": "p", "text": "Eventually, Grelb noticed that his underlings were being eaten by the now-frenzied draigons. Although he tried to escape the avian predators by squeezing into a small crevice, the Hutt was subdued and devoured. Other draigons then attacked the Arcona who were taking shelter in the caves, though with the help of Obi-Wan and Qui-Gon they were beaten off, the two Jedi killing so many of them that their piled bodies nearly blocked the cave mouth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}