{"url": "Drakka_Judarrl", "categories": ["Category:Legends articles", "Category:Dantooinians", "Category:Females", "Category:Jedi affiliated with the Alliance to Restore the Republic", "Category:Jedi Purge survivors", "Category:Jedi trainees of the Jedi Order", "Category:Resistance fighters", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Drakka Judarrl"}, {"tag": "p", "text": "Drakka Judarrl was a female Zabrak Jedi Padawan who served the Jedi Order until she escaped with her Master from the ravages of the Great Jedi Purge. Later, she hid out on Dantooine during the Galactic Civil War, directing the resistance among the local Dantari tribes."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "It is unknown who Judarrl's Jedi Master was—all she ever said was that \"he became one with the Force long ago,\" that she was only a Padawan at the time, and that he saved her from the murder of the other Jedi during the Great Purge. Presumably her ordeal during her escape and her subsequent survival served as her de facto Jedi Trials, because she claimed to be a Jedi Knight, and indeed feared that she was the only one of her kind, though she claimed that she \"sensed the presence of a few others.\" However, her master had told her never to use her Force powers, for fear that Emperor Palpatine's agents would discover her hiding place."}, {"tag": "p", "text": "Unfortunately for Judarrl, Darth Vader himself caught up with her Master and slew him. Judarrl managed to escape, however, with the help of a smuggler who had been aiding her Master. She came to Dantooine when the Rebel base was first established, and hid in the ruins of the Jedi Enclave, making her home in a deep cave behind the falls close to the ruin. Her hope in coming to Dantooine was to make contact with the Rebel base hidden there, to discover the state of the resistance, and aid the rebellion in any way she could. She took charge of guerrilla activities among the native Dantari tribes, disrupting the Empire's activities on Dantooine as best she could."}, {"tag": "p", "text": "While there, she did meet with a Rebel operative, informing them of her past before tasking them with intercepting a squad of stormtroopers to stop them from slaughtering dozens of natives. The individual managed to perform the task and, upon returning to Judarrl, was given another; to rescue the daughter of the Dantari chieftain, Aroho Preni, who had been assisting Judarrl from the Imperials. The individual accepted this challenge and, after defeating the chieftain's Imperial guards, brought him to Judarrl where they were once again informed of another task."}, {"tag": "p", "text": "Judarrl had been informed that an Imperial by the name of Luthik Uwyr had arrived on the planet and was organizing some of the natives into a deadly strike force by teaching them to use the dark side of the Force. She decided that he had to be stopped before such agents of evil could spread their practices offworld. The individual accepted this task also, and managed to slay a group of darksiders (though Hydra himself remained unharmed), and so was rewarded by Judarrl with a blue holocron."}, {"tag": "p", "text": "At some point she also helped a Rebel agent to escape from captain Adrick and his troopers by clouding their minds. The Rebel had previously found the Codex of Tython, an ancient Jedi Holocron, for which Judarrl's father had looked for many years. The Holocron, however, was missing several fragments. Judarrl herself had one, which she gave to the agent, before sending him on a mission to complete the Holocron. After completing the mission, the Rebels returned the Holocron to Drakka for study. After studying the ancient artifact, several Alliance agents stayed with her to protect it from enemy hands. However, she was killed when the Imperial Security Bureau organized an attack on the cave and the holocron was reclaimed by an Imperial agent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drakka appears at the Jedi Temple Ruins in Star Wars Galaxies and gives a series of quests to Rebel-aligned players who seek her out. There is an agent of the Empire camped outside of the ruins as well, who gives Jedi-related quests to Imperial-aligned players. Drakka refers to the agent, Luthik Uwyr, in her dialogue, but he never mentions her, instead asking the players to kill an untrained Padawan he has discovered some distance from the ruins. Drakka is non-combat character in the game, as is Luthik. She is one of at least four Jedi NPCs in Star Wars Galaxies to have survived the Purge, the other three being Urootar, who lost his mind on Kashyyyk, Rune and Nos'lyn, who hid out on Tansarii Point Station among the Car'das."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}