{"url": "Drall/Legends", "categories": ["Category:Legends articles", "Category:Core Worlds species", "Category:Drall", "Category:Mammalian sentient species"], "nodes": [{"tag": "h1", "text": "Drall"}, {"tag": "p", "text": "The Drall were a small, furry, and highly intelligent species found on Drall in the Corellian system. They were descended from burrowing mammals and they were extremely diligent record-keepers, and it was said that they had recorded every trivial event since the dawn of intelligence. Libraries were among their greatest forms of entertainment, as were story-telling sessions called Ta'sharr."}, {"tag": "p", "text": "The planet from which they originated was unknown; thousands of years before the Galactic Civil War, the Celestials transported the species to Drall in the Corellian system. Drall was usually hot and members of the species were covered with thick fur. Drall rarely wore any clothes except a belt to carry personal belongings. They were very fond of jewelry composed of ores and gems, which they made into beautiful works of art. Some Drall also believe that they originally hibernated before becoming civilized and build rooms in their houses that remind them of caves. These rooms help the Drall relax and think clearly."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Their notable traits were being small bipeds with furry features who were stated to be descended from burrowing animals. Their faces held a pair of black eyes. They had short muzzles and almond shaped black eyes. Their bodies were covered with fur which ranged from brown and black to reddish-gray. Drall had short limbs with clawed hands and feet. Adult members of the species stood between 0.9 to 1.5 meters tall with females being taller as well as more solidly built when compared to males."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They were noted for being natives of the Corellian system and claimed their descent from burrowing animals.\nAround 35,000 years prior to the Clone Wars, a Drall scientist by the name of Tiran created the Theory of Universal Reference and postulated that the speed-of-light was a boundary that was incapable of being crossed. This was 10,000 years prior to the discovery of hyperdrive technology."}, {"tag": "p", "text": "During the Corellian Crisis, Duchess Marcha and Ebrihim worked with Chief of State Leia Organa Solo and put their Drallish minds to uncovering a subterranean planetary repulsor that was used in ancient times to move their world to its current orbit. The Drall repulsor was used to later disable Centerpoint Station when it was being used against the New Republic."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "They were known for a gentle contenance and being a highly dignified species despite their small stature. Drall were known for being a very practical and orderly people. The Drall were a methodical and levelheaded race that made most excellent scholars as well as scientists. By nature, they were abstract thinkers though preferred to develop new scientific theories rather than put them into practice. Thus, despite their advanced scholarly pursuits, they often trail behind the rest of the galaxy in terms of technological achievements. Instead, they usually simply implement technologies that had been developed elsewhere. Most Drall tend to hold positions in processing medicinal agriculture which was their homeworld's primary industry. The species was rarely encountered elsewhere in the galaxy though offworld corporations tended to hire Drall as scientific researchers. Their meticulous note and record keeping was known to record every trivial event since the dawn of their intelligence to the point that they say it was claimed that there was no prehistory on their homeworld."}, {"tag": "p", "text": "In terms of society, they were notable for being clan-based and hierarchical with no elected head of state. Instead, powerful family groups were responsible for running the government. Within each family, the head was generally the eldest female who held the title of Duchess. Upon the death of this title holder, all her holdings and even her title passed to the female of the next generation that had demonstrated both levelheadedness along with leadership skills necessary for their new role. The Duchess worked with all family matters and held a daily Ta'sharr with the children of the clan. Drall family members supported tourism in areas like the Boiling Sea, they also worked as scholars and trinketsmiths. When a member of a Drall clan reached 18, the members of the clan gathered together and the Duchess awarded the Scepter of Drall to the person."}, {"tag": "p", "text": "Drall rarely carried weapons and were usually peaceful and quiet. Drall police officers wore medallions around their necks and carried flashsticks to disable criminals. The Wingriders were a division of police that rode ibbot mounts. Other notable groups amongst their society included the Drallists and Drallish Front who wanted to rid their homeworld of Humans and Selonians."}, {"tag": "p", "text": "As a people, the Drall loved to gossip that became something of a cultural tradition amongst their race. They were noted for being cautious creatures that seldom ventured from their home system. Despite this being the case, they were known to be seen on other worlds and corporations were known to hire them for their skills."}, {"tag": "h2", "text": "Common Drall names"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars: The Corellian Trilogy referred to the Drall species as Drallan. In most other sources they are simply called Drall."}, {"tag": "p", "text": "Although previous sources might state that the Drall are native to the planet Drall, The New Essential Chronology indicates that they were actually transported to the planet by the Celestials thousands of years earlier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}