{"url": "Drawd_Munbrin", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Drawd Munbrin"}, {"tag": "p", "text": "Drawd Munbrin was a human male recruitment officer that served as a chief in the Galactic Empire. By 13 BBY, Munbrin was stationed in Coronet Spaceport, where he encountered the future smuggler Han Solo. Munbrin gave Han the surname Solo."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Encounter with Han"}, {"tag": "p", "text": "Drawd Munbrin served as a chief recruitment officer in the Galactic Empire. His work consisted of enrolling recruits who desired to join the Imperial Armed Forces into the Imperial Academies."}, {"tag": "p", "text": "In 13 BBY, Munbrin was stationed in Coronet Spaceport enrolling the potential recruits for the Empire. One day, a young man named Han appeared and was interested in joining the Empire and becoming the best pilot in the galaxy. When Munbrin asked Han his surname, Han stated that he didn't have one and indicated to the officer that he was alone. Munbrin decided to assign Han the surname \"Solo\" and sent him on his way to academy on Carida."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The story of how Munbrin gave Solo his surname was made known. A Snivvian bounty hunter, however, believed the story of Munbrin's encounter with Solo to be deliberate disinformation and believed instead that Solo was a direct descendant of the Prince-Admiral Jonashe Solo, a member of the ancient Corellian royalty. A Crimson Dawn enforcer, on the other hand, believed that Solo was the grandson of the Corellian pirate Dalla Suul and that Munbrin misheard his surname when recruiting him."}, {"tag": "p", "text": "At some point, Han's son Ben Solo discovered how his father acquired his surname. However, while speaking with Snoke after the destruction of Luke Skywalker's Jedi temple, Ben stated that he disliked his surname and that his father was a lie."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drawd Munbrin first appeared on the 2018 Star Wars Anthology film Solo: A Star Wars Story, played by Andrew Woodall. In Star Wars Legends, \"Solo\" wasn't a nickname but the real surname of Han."}, {"tag": "p", "text": "Munbrin's line when he gives Han his surname was the first line written for the film's script back in 2012 when Lawrence Kasdan pitched the film to Disney CEO Bob Iger some weeks before The Walt Disney Company acquired Lucasfilm Ltd. While he was talking with Simon Kinberg and Michael Arndt, Kasdan told the pair about the moment when Han gets his name and how it happens."}, {"tag": "p", "text": "Going by the Imperial rank chart created by Dave Crossman for use in both Rogue One: A Star Wars Story and Solo: A Star Wars Story, Munbrin would be a captain of the Imperial Navy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}