{"url": "Drawing_the_Maps_of_Peace:_The_Moisture_Farmer%27s_Tale", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Tales from the Mos Eisley Cantina"], "nodes": [{"tag": "h1", "text": "Drawing the Maps of Peace: The Moisture Farmer's Tale"}, {"tag": "p", "text": "Drawing the Maps of Peace: The Moisture Farmer's Tale is a short story written by M. Shayne Bell for Tales from the Mos Eisley Cantina which was published by Bantam Spectra in August 1995 and is a short story about Ariq Joanson. It takes place in 0 BBY."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Ariq Joanson is a moisture farmer on Tatooine, living closer to the edge of the Dune Sea than any farmer has previously dared to live, in an attempt to draw water from the air in the area. As the tale opens, he fears for his life from a wandering band of Sand People congregating around one of his moisture vaporators, attempting to break it open for a reason he can't think of. He drives up in his landspeeder, and they are startled off by the sound of human machinery, but he is certain they'll be back once they get over their fear. While waiting for them, he comes up with the assumption that they might be after the water. The territory was their's previously, they likely were collecting the water themselves before he came to take it. He opens up the vaporator and takes out the water it has collected in a pouch, and leaves it in the sand before returning to his speeder. The Sand People return, find the water, and give some to their youngest member before transferring the rest into an animal skin pouch, being careful not to spill a drop. They turn towards Joanson, and neither party speaks. Suddenly, one of the Sand People raises his fist in the air. After a bit of hesitation, Joanson does likewise. They stay like that for a moment, then the Sand People turned and vanished into the desert. Joanson pledged to leave the water from that vaporator to them from then on, and buy two last-generation vaporators from his friend Eyvind to return his production levels to normal."}, {"tag": "p", "text": "After that, he orders his computer to draw a map dividing the area surrounding his farm in three parts: one for the farmers, one for the Jawas, and one for the Sand People. He visits the Jawas in a nearby fortress and discusses the map with Wimateeka, an elder Jawa. He thinks dividing the area so the three parties can live in peace is a good idea. Later, Joanson visits farmer Eyvind, who introduces him to his would-be-wife Ariela. Eyvind is against Joanson's plan, as are most of the farmers, but Ariela is on Joanson's side. Joanson invites the Jawas to the wedding as a token of good will. They come and the wedding starts of good, but then young Sand People arrive and start shooting. They kill Eyvind and take Ariela. Joanson quickly sets out to rescue her, with Wimateeka by his side to translate."}, {"tag": "p", "text": "They go the vaporator where Joanson always leaves water and find them. He trades for Ariela and sees this as an opportunity to explain his plans for peace to the Sand People. He does so, and it is received well. It just seems that his plan might work until the Imperials arrive and start slaying the Sand People. The other farmers explain that they called them in, because if there would be peace out there with them, the Imperials would start making extra trouble. They need conflicts on every occupied planets so that the inhabitants will always welcome their way of creating order. If Joanson was to make peace, the real enemy would reveal itself, and it would be one they could not fight against.\nJoanson leaves his farm temporarily, because the Sand People think he has betrayed them, and visits the Mos Eisley Cantina for a drink. He decides to join the Rebel Alliance, knowing that Ariela would follow him there, to try drawing the maps of peace in another way."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}