{"url": "Dread_Masters", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Dread Masters", "Category:Sith Empire organizations"], "nodes": [{"tag": "h1", "text": "Dread Masters"}, {"tag": "p", "text": "The Dread Masters were six powerful Human Sith Lords who served the Sith Emperor for centuries as prophets, generals, and advisers. Their names were earned when they studied the power of the Phobis devices, artifacts that had driven even the most depraved Sith mad with terror. This power allowed the Dread Masters to destroy entire Galactic Republic fleets during the Great Galactic War; they had mastered the art of battle meditation to the point that they would inflict an awful, mysterious terror upon members of any given Republic cruiser. In order to avoid being compromised, they kept in constant motion in an Imperial dreadnaught that roamed the galaxy. With the help of an elite Republic Special Forces Division team, Jedi Knight Jaric Kaedan infiltrated the dreadnaught and captured the Dread Masters. The Jedi Order publicly announced that the Dread Masters were killed, but secretly they were imprisoned on Belsavis."}, {"tag": "p", "text": "Released by servants of the Sith Empire, the Dread Masters went rogue following the defeat of the Emperor on Dromund Kaas, forming an empire led by their own Dread Council. After one of their members was slain on Darvannis, the remainder relocated to their Dread Fortress on Oricon, where they were defeated in 3638 BBY. Dread Master Calphayus was the only one who survived the downfall of the others, and was taken once more into Republic custody."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "This group of Sith Lords gained their reputation following their study into the Phobis devices. The power of this artifact had caused the most depraved of Sith to go mad with terror. Their mastery over their new power made them powerful allies to the Sith Emperor whom they served in the span of centuries as advisers, generals, and even as prophets. During this time, they were noted to have spent many years in secluded meditation on the world of Dromund Kaas. These periods were only interrupted when they needed to bring some crucial wisdom to the Emperor or to accept a gift in the form of supplicants. These Sith kept in such close company that they became inseparable, and their great power reached full strength when they worked in union with one another. During the Great Galactic War, they served in the front lines against the Galactic Republic, where they used their power to project terror into their enemies. Such power allowed this group of Sith to destroy entire fleets of the Republic. In order to keep their position from being compromised, the Dread Masters were stationed aboard an Imperial dreadnaught, which allowed them to remain mobile by traveling throughout the galaxy."}, {"tag": "p", "text": "Despite the secrecy of their location, their dreadnaught was eventually discovered by Jedi Knight Jaric Kaedan. Armed with this knowledge, he led a team from the Republic Special Forces Division to infiltrate the Sith vessel with the objective of capturing the Dread Masters. As a result, the six Sith were captured by the Republic yet resisted all attempts at being interrogated. Despite this, the Jedi managed to learn that the Dread Masters were centuries old. Following the success of the mission, the Sith dreadnaught was destroyed, and the Republic leaked false information that the Dread Masters had been killed in the skirmish. It was believed this was because the Jedi Council had hoped that such news would prevent the Emperor from launching any plan to rescue them. However, another reason the Sith were kept alive was that it was believed that they were too valuable to eliminate. Thus, imprisonment was seen as the only alternative with the ancient prison on the world of Belsavis seen as the only place to confine the power of the Dread Masters. This was because it was believed it had safety measures strong enough to prevent them from escaping. As a result, the Dread Masters were imprisoned on Belsavis, where they remained until long after the Great Galactic War. It was feared that if the Sith Empire ever freed the Dread Masters from their prison, then the galaxy would tremble before their might once again."}, {"tag": "h3", "text": "Freedom from imprisonment"}, {"tag": "p", "text": "On Belsavis, the Dread Masters were imprisoned in the main levels of the facility in separate cells, but all other prisoners within a quarter mile of them died almost immediately after the Sith arrived. This forced the Republic to move them deeper in the facility, into The Tomb. By 3641 BBY, when Belsavis was discovered by the Empire, the Imperials set out to free the imprisoned Sith. However, their activities accidentally unleashed the Esh-kha, an ancient race that was originally imprisoned by the Rakata, who stole the imprisoned Dread Masters and took them to Cave-Under-Tree, where their High Savants began to draw on their power to allow them to break free of Belsavis. However, they were later freed by an Imperial Rescue Team, and after they regained freedom, they exacted revenge on those who held them prisoner. The Empire gave them a shuttle, and they returned to Imperial space."}, {"tag": "h3", "text": "Sowing fear"}, {"tag": "p", "text": "Shortly afterwards, they betrayed the Empire and planned to conquer the galaxy for themselves. They recruited on Denova the Trandoshan warlord Kephess to act as their proxy; Kephess and his mercenary army tried to conquer the planet but were defeated by task forces from both Republic and Sith Empire. However, the Dread Masters healed Kephess and traveled to Asation, where they planned to use the technology of the hypergate to unleash the Terror From Beyond, but were again defeated."}, {"tag": "p", "text": "Around the time of the Asation incident, the Dread Host, servants of the Dread Masters, attempted to recover a Rakatan weapon known as the Aurora Cannon from Section X on Belsavis. Once again, their plans were foiled, and the cannon destroyed. By 3639 BBY the Dread Masters continued to remain a third party in the war. They dispatched Sith Lord Tagriss to steal several Sith Artifacts from Arcanum. Tagriss managed to steal the Seeds of Rage and the Darkstaff. Both the Empire and the Republic sent strike teams to recover the artifacts, and ultimately Tagriss was defeated on Ilum."}, {"tag": "p", "text": "After three consecutive failures, Dread Master Styrak chose to act independently from the other Masters and went to Darvannis. There, he gathered various mercenary and Hutt Cartel groups to create a force strong enough to oppose both the Empire and the Republic. Enforcing his will on some of the mercenaries' minds, Styrak drove some of them insane. Unfortunately for Styrak, the Empire and Republic noticed his actions and sent strike teams to stop it. After the mercenaries were wiped out, Styrak sent his Dread Guards and pet kell dragon to fight the strike team before entering combat himself. Although he proved to be a formidable opponent, he was eventually killed. Upon Styrak's death, projections of the remaining Dread Masters appeared and absorbed his power from his corpse."}, {"tag": "p", "text": "The Empire and the Republic tracked the Dread Masters to the planet of Oricon, where they had set up their base of operations. Both factions dispatched teams to destroy the Masters for good. After fighting through the Dread Fortress, the strike teams encountered Dread Master Brontes, and after a difficult fight, prevailed over the powerful Sith sorceress. The strike team then traveled to the Dread Palace, the seat of the Dread Masters' power. Each of the remaining Masters individually attempted to rid themselves of the strike team, but failed. The strike team then reached the throne room, where all four Dread Masters fought the team simultaneously in a climactic battle. During the fight, the Masters were confounded by the strength of the strike team, and brought back the spirits of Styrak and Brontes in an attempt to even the odds. This did little to even the fight, however, and the spirits were defeated. In a last-ditch attempt for victory, the remaining four Masters attempted to suck the life out of the strike team's members. The strike team then killed each Master one by one; they still could not believe that they had been defeated."}, {"tag": "p", "text": "Calphayus survived and wandered Oricon after the death of his fellow Masters, soon arriving at the Republic Strike team camp. There he sought to reason with the team, telling them of his rather human past. He was once married, and felt no fear or pain towards his wife or life in general. However, once he and his friends, now Dread Masters, studied the Phobis devices, they became linked mentally and physically in a weave of Terror and Madness, distorting and changing him into a living entity of Madness. Calphayus was weak, scared, alone and looking for hope. The strike team decided to show mercy, and let him be cared for and evaluated by the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dread Masters were first introduced in the 2011 video game Star Wars: The Old Republic. Their original character models featured helmets and robes that were also attainable by player characters as wearable armor. In 2012, their appearance was updated to feature new helmets that were not available to players, though, by 2014, a variation known as the Crest of the Dread Master became available."}, {"tag": "p", "text": "Freeing the Dread Masters is the ultimate goal of the Belsavis story arc for Imperial characters. They go on to serve as major antagonists in the post-story content of Star Wars: The Old Republic. Chronologically, their uprising occurred in an interlude between the character story lines and the Rise of the Hutt Cartel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}