{"url": "Dread_Masters_crisis", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic War"], "nodes": [{"tag": "h1", "text": "Dread Masters crisis"}, {"tag": "p", "text": "The Dread Masters crisis sparked due to the Dread Masters' escape from their imprisonment on Belsavis and their ambition to achieve total dominance. The Dread Masters' were freed around 3641 BBY and returned to Imperial service; the Sith Emperor's death in the battle on Dromund Kaas prompted them to enact their own plans separate from the Sith Empire. This resulted in several battles that pitted both the Empire and the Galactic Republic and the Jedi Order against them; the Dread Masters' forces were thwarted on several occasions and forced them to settle on Oricon for a final offensive."}, {"tag": "p", "text": "The Republic and the Empire formed a brief truce in order to confront the Dread Masters' after the latter used the Force to influence both sides' minds to drive them insane. But ultimately an offensive on Oricon resulted in the Dread Masters' deaths save one that the Republic captured for treatment with the Jedi."}, {"tag": "p", "text": "The end to this conflict meant that both sides could focus their resources on the war since the Dread Masters' threat forced a brief stop to both sides' offensives."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Dread Masters were six powerful Sith Lords that answered to the Sith Emperor alone. These Sith earned their titles after harnessing the power contained in the Phobis devices. But the Jedi Knight Jaric Kaedan captured them in 3668 BBY and the Galactic Republic oversaw their imprisonment on Belsavis. But the Jedi Order were quick to announce that the Dread Masters had been killed to soothe concerns that the Dread Masters could escape or use their abilities to cause greater destruction."}, {"tag": "p", "text": "Around 3641 BBY an Imperial strike team infiltrated \"the Tomb\" located deep inside the prison on Belsavis to free the Dread Masters; this enabled the six to return to Imperial service. But the Sith Emperor's death in the battle on Dromund Kaas caused them to put into motion their own plans that would put them at odds with the Empire."}, {"tag": "p", "text": "Their plans to achieve domination over their enemies first started on Belsavis itself when the Dread Host tried and failed to take control of an ancient Rakatan weapon in Section X known as the Aurora Cannon. But a strike team dispatched to Belsavis thwarted their efforts. Their second plan was to hire mercenaries on Denova to assist them and to act as their proxies. Their third plan was to activate on Asation a Gree hypergate to summon a creature known as the \"Terror from Beyond\". But this effort failed since a strike team managed to push back the beast into the hypergate."}, {"tag": "h2", "text": "The crisis"}, {"tag": "h3", "text": "Arcanum raid"}, {"tag": "p", "text": "The Sith Lord Tagriss (who decided to join the Dread Masters) was assigned to attack the Arcanum space station in the Meram sector to steal dangerous Sith artifacts. Darth Acina (who just joined the Dark Council following the death of Darth Karrid) sent a small Imperial task force to defend the space station while the Jedi Master Cedral Gend sent a Republic team to prevent the theft of the artifacts which both sides wanted recovered."}, {"tag": "p", "text": "Tagriss managed to evade his pursuers in the ensuing commotion and recovered the Seeds of Rage and the Darkstaff before he fled. He fled to an old Jedi temple on Ilum where he attempted to unlock their power but was killed when a strike force located and engaged him in combat. This robbed the Dread Masters' of their search for important Sith artifacts and enabled the strike force to recover the stolen relics."}, {"tag": "h3", "text": "Darvannis"}, {"tag": "p", "text": "The Dread Master Styrak soon grew frustrated that his fellows were failing in their attempts to achieve their plans and was displeased that their efforts thus far had been stymied. Styrak went rogue and tried to assemble a team of mercenaries to pose as the Hutt Cartel in order to fulfill his own objectives. Styrak hoped this would remain unnoticed but a Sith and Republic task force discovered this and killed Styrak and his people."}, {"tag": "h3", "text": "Oricon showdown"}, {"tag": "p", "text": "The tide started to turn and the Republic soon discovered that the Dread Masters retreated to their base on Oricon (a planet located on the edge of Imperial space). The Republic sent a task force six hours later to bombard the planet from orbit to end the threat as soon as possible. But the Dread Masters were prepared and used the dark side to project images into their opponents' minds to sow fear and terror. The Supreme Chancellor Leontyne Saresh was forced to call upon other vital Republic forces to link up with the surviving task force members in order to confront the threat together."}, {"tag": "p", "text": "The Empire not long after discovered that Oricon was the Dread Masters' base and also discovered what had happened to the Republic's task force. Darth Rictus formed a team that Lord Hargrev would lead to Oricon to find and defeat the Dread Masters'; this team too were dealt with in the same manner as the Republic's people forcing Darth Marr to send his own important Imperial forces to locate and aid them."}, {"tag": "p", "text": "But both sides formed a brief truce in order to defeat their common foe and crippled the Dread Host in order to weaken the Dread Masters and attack them in their fortress. The team first confronted the Dread Master Brontes and her two creations; her death allowed for the team to find a portal that led them to the Dread Masters' lair. The strike force located them in a throne room and confronted the four surviving members. The Dread Masters' summoned the spirits of their deceased members to aid them in the struggle but the resolve and strength of the task force surprised the Dread Masters' whose desperation in the struggle increased. Each Dread Master was killed in the encounter and their hold on the minds of the Imperial and Republic soldiers on the planet was broken."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the aftermath the Dread Master Calphayus (revealed to have survived the attack on his former sanctum) stumbled across the Imperial and Republic team after having sustained injuries in the battle. But the Jedi Master Ogan-Dei deemed that the former Dread Master was broken and no longer a threat; the Republic took him in their custody as Ogan-Dei hoped that the Jedi could treat him on Tython."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}