{"url": "Dreadnaught-class_heavy_cruiser", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Chiss starship classes", "Category:Confederacy of Independent Systems starship classes", "Category:CSA starship classes", "Category:Dreadnaught-class heavy cruisers", "Category:Galactic Alliance starship classes", "Category:Galactic Empire starship classes", "Category:Galactic Republic starship classes", "Category:Heavy cruiser classes", "Category:Hutt starship classes", "Category:New Republic starship classes"], "nodes": [{"tag": "h1", "text": "Dreadnaught-class heavy cruiser"}, {"tag": "p", "text": "The Dreadnaught-class heavy cruiser, or simply the Dreadnaught, was a type of capital ship built for planetary occupation and space combat used by the Galactic Republic, Galactic Empire, New Republic, local governments, and various other organizations. It was one of the most ubiquitous ship designs in all of the galaxy."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The keel of the Dreadnaught-class ran nearly 600 meters with the bow overlapping to produce a clamshell-like appearance. Each vessel had a cluster of weapons blisters spread across the hull. The ship was designated a heavy cruiser in standard classification and was considered a downscaled warship when compared to the ship-designs from the Core."}, {"tag": "p", "text": "The forward ventral portion of the Dreadnaught-class was used as a massive cargo hold, with a docking port located at the bow of the ship. Additional cargo holds were situated towards the center of the ship, in front of the areas housing the main reactor and secondary power generators. Docking ports were also located on either side of the ship."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "Weapon systems included twenty quad laser cannons (six bow, seven port, seven starboard), ten turbolaser cannons (five port, five starboard and mounted in blisters), and ten laser cannons (five bow, five stern). Some ships were later customized to feature a warhead launcher for anti-starfighter defense."}, {"tag": "p", "text": "Deflector shield projectors were also located inside some of the blisters flanking the hull, and the primary and secondary sensor transceivers were located towards the stern of the vessel, on the dorsal and ventral sides, similar to those on CR90 corvettes."}, {"tag": "p", "text": "While technologically advanced at the time of its construction, the Dreadnaught-class lacked in sublight and hyperspace speeds (a Class 4 rating), suffered computer failures, and could not compete with comparable designs in terms of firepower and shielding. Between three and five Dreadnaught-class cruisers could outgun one Imperial I-class Star Destroyer."}, {"tag": "h3", "text": "Crew complement"}, {"tag": "p", "text": "In addition to the technical drawbacks, Dreadnaught-class ships also required over 16,000 crewmembers to run at optimal performance—perhaps the highest crew per kilometer ratio of any modern starship. This high crew requirement put strains on recruitment efforts and turned supplying a Dreadnaught into a logistical nightmare. In comparison, slave-rigged Dreadnaughts reduced the complement requirements down to 2,200 crewmembers."}, {"tag": "h3", "text": "Hangar complement"}, {"tag": "p", "text": "The initial design was not focused towards carrier duty, but as the ships were upgraded and refitted, the center cargo holds were converted to hangar space, and a common complement of 12 TIE starfighters was added to the vessel."}, {"tag": "h3", "text": "Main bridge"}, {"tag": "p", "text": "Unlike many contemporary warship designs, the Dreadnaught-class did not have an easily visible bridge section, opting to shelter the command decks and crew stations inside the main armored superstructure. These areas were located on the dorsal side of the bow."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Dreadnaught-class heavy cruiser was designed and developed by Rendili StarDrive for the Republic Judicial Forces and as flagship for Planetary Security Forces at least 80 years prior to the Clone Wars and was based on the larger Mandalorian Kandosii-type dreadnaught from the time of the Mandalorian Wars."}, {"tag": "h3", "text": "Early service"}, {"tag": "p", "text": "After being commissioned, the Dreadnaughts saw use in ending major conflicts, but its shortcomings were quickly apparent. To counter the most glaring flaw of the Dreadnaught fleet, the Galactic Republic military developed a technology to reduce the crew requirements. By installing a full-rig slave circuitry system, the crew requirements could be reduced from 16,000 per ship to a more manageable 2,200."}, {"tag": "p", "text": "Two hundred of the heavy cruisers were outfitted with this new technology and dubbed the Katana fleet. The project failed when the crew were driven insane by a hive virus, slaved the fleet together, and made a random jump into hyperspace before the virus killed off every crew member. A similar system was also fitted to the Dreadnaughts of the Rendili Home Defense Fleet.\nAnother famous project that saw the use of Dreadnaughts, was the ill-fated Outbound Flight Project, aimed at extragalactic exploration. The ship-design used six Dreadnaughts to fill out the hull."}, {"tag": "p", "text": "In addition to galactic governments and organizations, local forces also used these ships, as they constituted a cheaper and more easily accessible alternative to the large warships exclusive to the rich and heavily industrialized sectors. Due to trade restrictions imposed by the Trade Federation, Outer Rim worlds had to rely on homemade fighters and downscaled warships for their own defense, sometimes gaining access to older design plans and leading to localized Dreadnaught-class variations. For example, the Utapauan Security Force built and used several as anti-piracy vessels, with their largest Rendili cruiser being one-fifth the size of a Trade Federation battleship. Dreadnaught-class cruisers also composed the Rendili Home Defense Fleet."}, {"tag": "p", "text": "During the Clone Wars, the Dreadnaughts saw heavy use in many battles, including the Battle of Duro, the Battle of Rendili, and the Battle of Coruscant.\nBecause the more advanced assault ships and Star Destroyers were reserved for clone crews and highly dedicated Republic officers, the planetary security forces and volunteer militaries of the Republic made heavy use of the Dreadnaught-class."}, {"tag": "p", "text": "Some of the vessels would receive the newer T.I.E. Starfighters during the war, to provide a starfighter that could make use of available space on the vessel."}, {"tag": "h3", "text": "Imperial refitting"}, {"tag": "p", "text": "Dreadnaughts saw extensive use in the Imperial Navy due to their abundance. Battle squadrons assigned to unimportant systems were often assigned a Dreadnaught-class cruiser in place of a more modern cruiser. To increase its field potential, the Imperial Starfleet upgraded the ships' hyperdrive to Class 2 and converted cargo space into a hangar. With the hangar modification, a Dreadnaught could carry a squadron of TIE/LN starfighters. These upgraded cruisers now saw use as patrol ships, which maintained Imperial dominance over primitive worlds."}, {"tag": "p", "text": "Fifty years after the Katana fleet was lost, Grand Admiral Thrawn recovered 178 ships of the lost fleet. They proved critical in his assault against the New Republic, since he had an abundance of cloned navy crewmen."}, {"tag": "p", "text": "Garm Bel Iblis maintained a personal fleet of six Katana fleet Dreadnaughts, which he used to capture 15 of the Katana ships, including Katana herself; the final ship of the fleet was destroyed in the battle for the Katana fleet. Some of Bel Iblis's Dreadnaughts were observed to use ion cannons, but it is unknown whether this was a modification his forces implemented or a standard feature of the Katana fleet."}, {"tag": "h3", "text": "Later use"}, {"tag": "p", "text": "The still fledgling fleet of the New Republic used donated, captured, or recovered Dreadnaught-class cruisers until the New Republic Defense Fleet formally decommissioned them after the New Class project. During the Yuuzhan Vong War, Dreadnaughts would continue to be used by the New Republic and its successor government, the Galactic Federation of Free Alliances."}, {"tag": "p", "text": "Many Dreadnaught-class cruisers were converted by the Alliance and later the New Republic into assault frigates, which were much less manpower-intensive than standard Dreadnaughts and carried a heavier armament."}, {"tag": "p", "text": "Some Dreadnaughts ended up as building material for the Hidden Temple during the Sith–Imperial War in 127 ABY."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Rendili's practice of letting local shipyards produce their own Dreadnaught-variants on a license lead to many different models being built and fielded. For instance, the Utapauns produced Rendili Dreadnaughts in several different sizes for their own defensive fleet. The Quarren of the Mon Calamari Shipyards designed some of the most extreme models while working on the Rendili license. These engineers later defected during the Clone Wars, bringing their ideas to the Confederacy of Independent Systems. As a result, their refined version of the Rendili Dreadnaught, the Providence-class carrier/destroyer and its upscaled variant, the Separatist Dreadnaught, served the Confederate cause throughout the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Due to the variety of sources used and the common use of modified Dreadnaught-class vessels, the statistics listed in the infobox may not accurately represent a stock Galactic Republic Dreadnaught. The original Imperial Sourcebook listed a lighter armament than most later sources. Both sets of specifications are listed here."}, {"tag": "p", "text": "Different WEG materials provide a different account of the vessel's fighter complement. The Imperial Sourcebook makes note that the Imperial Navy modified the cargo bays to allow a fighter squadron, while Adventure Journal 10 has the existing republic naval vessels in the game (Carrack and Dreadnaught) receiving T.I.E. Starfighters as part of their republic complement. It's possible but unclarified it was a standard upgrade with the imperial fleet and a per-ship modification on the republic models due to the nature of the vessel's often modified state, and other republic Dreadnaughts being seen with fighters, as this would allow both to be correct."}, {"tag": "p", "text": "Dreadnaught-class starships are seen in many of Timothy Zahn's novels. They were first shown in action in Dark Force Rising, in the struggle for control of the Katana fleet. These vessels were mentioned earlier in Heir to the Empire, providing the main hull of Nomad City, and in the Battle of Sluis Van where the New Republic modified variant (an assault frigate) is snared by Chimaera's tractor beam. The Dreadnaughts would also form part of Outbound Flight. Like many of the ships and vehicles in The Thrawn Trilogy, the Dreadnaught originated in the Imperial Sourcebook."}, {"tag": "p", "text": "The Dreadnaught-class cruiser seen in Star Wars: TIE Fighter and Star Wars: X-Wing vs. TIE Fighter is noticeably different in physical appearance from other depictions of the vessel, including the model used in that game's sequel, Star Wars: X-Wing Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}