{"url": "Dream/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Science"], "nodes": [{"tag": "h1", "text": "Dream"}, {"tag": "p", "text": "Dreams were images, thoughts, and feelings experienced while sleeping. Force users sometimes had visions of the future during dreams, but the content and purpose of these were often poorly understood."}, {"tag": "p", "text": "Dreaming typically took place during a type of sleep known as REM sleep."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Two such important Force dreams were Anakin Skywalker's nightmares portraying the death of his mother on Tatooine, and his wife, Padmé Amidala, dying during childbirth. These dreams served as turning points in Skywalker's fall to the dark side as they drove him into an obsessive desire to grow powerful enough to prevent those he loved from dying."}, {"tag": "p", "text": "As Darth Vader, he had a dream of his now-deceased wife struggling over him with manifestations of the dark side."}, {"tag": "p", "text": "General Grievous sometimes dreamed about the past, of the time before he became a cyborg and Supreme Commander of the Droid Armies of the Confederacy of Independent Systems. In his dreams he would relive old victories and battles from when he was a Kaleesh warlord."}, {"tag": "p", "text": "Anakin Skywalker remembered that his mother, Shmi, \"had many waking dreams, disturbing and strange ... that had scared him a little\" as a child on Tatooine. The boy Anakin often had dreams himself; while some were more like nightmares, the boy also experienced dreams of being a Jedi."}, {"tag": "p", "text": "Anakin's own waking dreams included one in which he envisioned himself somehow trapped in a strange ancient cube that he'd purchased (in his dealings for Watto) from an old Jawa on Tatooine. The cube's sides had images of what appeared to be two Jedi Knights dueling with lightsabers, a volcano, a starmap to a certain moon, and a lamp with a knife-blade through it (a symbol of forbidden knowledge); the remaining sides seemed to have had ancient writing in an unknown language, long since worn away. The cube had no openings, locks or hinges, but Anakin had sensed something \"evil\" inside, and that somehow it could open."}, {"tag": "p", "text": "In his dream, Anakin found himself inexplicably inside the cube itself, as if it were a huge room from which he could not escape. He banged on its walls and cried for help, to no avail: \"Help me get free!\" Then he heard a mysterious voice rise from the cube: an \"evil voice\" inside of it whispered that no one could help him, that he alone must open it. When the boy asked how, the mysterious voice answered: From the inside. As he woke from the dream, Anakin heard the same ominous voice still ringing in his ears and was certain that it had not been a dream, for it had been too real: the voice seemed to come from above his bed, from his cubbyhole, where he'd stored the cube. \"Did you talk to me?\" he asked the cube in the dark. Yes. I called to you. \"Are you trapped in there? ... How can I let you out?\" The voice came again: From the inside."}, {"tag": "p", "text": "Anakin eventually came to realize that it was himself who was caught and trapped, that it was he who had been unable to free himself. But also that if ever there was to be a liberation, it would have to come somehow \"from the inside.\" But Anakin also realized that this particular cube was \"warmer than the night air,\" and that live creatures gave off heat."}, {"tag": "p", "text": "Only days later, Anakin had another waking dream—once again, an extremely vivid one, but also grand and \"full of hope\"—in which \"a tall man with intense eyes, wearing a poncho\" and a lightsaber, had come to take him from Tatooine."}, {"tag": "p", "text": "Coincidentally, right before Anakin met Qui-Gon Jinn and party, he had a grandiose dream of a shining white glowing figure (presumably an angel) wielding a lightsaber against a backdrop of space and encircled by shadowy humanoid figures fitted for battle, engaged in galactic war; also in this same dream, he saw himself brandishing a blue lightsaber that looked very similar to the one he would eventually build."}, {"tag": "p", "text": "Once he'd met Qui-Gon and his companions, Anakin experienced yet another permutation of the same dream, on the night before Boonta Eve. This time, however, he recognized the angel: he again envisioned the planetary wars, the armies of droids, \"the rumble of transports and tanks, the hum of laser weapons.\" But at the head of it all, \"a mighty queen\"—the angel of his recurring dream. This Anakin recognized to be, oddly enough, the same girl who accompanied the Jedi to his home."}, {"tag": "p", "text": "Upon entering the Jedi Order to begin his path to Knighthood, Anakin continued to have dreams, but they were of an increasingly dark nature. By the time Skywalker was 18, the dreams he was vexed with were of a greater intensity than ever before, mainly manifested as disturbing visions of darkness and distorted memories of his time as a slave. He wished he could wipe from his mind his experience as a slave, and he grew increasingly worried about the safety of his mother, Shmi. It had been nine years—and many intervening interstellar missions—since Anakin had promised her that he would become a Jedi Knight and return to Tatooine to free her, and he remained determined to keep that promise. On one of his last missions before the Clone Wars, Padawan Skywalker experienced one of his most intense dreams yet. He dreamed he was once again back on Tatooine, but this time as a fully grown Jedi apprentice: he encountered the protocol droid he fashioned, C-3PO, and returned to Watto's junkshop, where he found his mother abandoned, huddling in weariness and fear in a low cage. His desperate efforts to free her were in vain, and he awoke in a fevered sweat, to hear his own belabored breathing, as if through a respirator. Fate would tragically lead the 19-year-old Jedi back to his homeworld in 22 BBY to find Shmi brutally held captive by Tusken Raiders. After Shmi died in his arms, young Skywalker suddenly found himself in the midst of his dark visions as he took revenge on those who had taken his mother's life."}, {"tag": "p", "text": "Zuckuss, a Gand bounty hunter, would sometimes experience what he recognized as being visionary possibilities in his dreams. Shortly after the Battle of Hoth, Zuckuss had suffered a respiratory attack on the Mist Hunter, and had fallen asleep afterward. He dreamed that the mists that shrouded his futures had lifted enough for him to see the possibilities branching out before him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}