{"url": "Drearia/Legends", "categories": ["Category:Legends articles", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Hydian Way", "Category:Inner Rim planets", "Category:New Republic planets", "Category:Northern Dependencies planets"], "nodes": [{"tag": "h1", "text": "Drearia"}, {"tag": "p", "text": "Drearia was an Inner Rim world situated on the Hydian Way hyperlane. Sharing its name with the Drearian Defense Conglomerate, Drearia was a member of the Galactic Republic and later the Galactic Empire, for which it served as a fortress world. The world saw two clashes between Imperial and New Republic forces during the Galactic Civil War, and in 10 ABY, the Mandator III-class dreadnought Aculeus was lost at Drearia due to Imperial in-fighting."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Drearia was a world located in the Drearia system, a part of the Northern Dependencies portion of the Inner Rim. By 3705 BBY, Drearia was situated between the Chagri and Per Lupelo systems on the hyperspace route known as the Corsin Run. At some point following 3694 BBY, that hyperlane was integrated into the galaxy-spanning Hydian Way super-hyperroute. In addition, a smaller route linked Drearia to the Gyrica system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Space surrounding Drearia was explored between 25,000 BBY and 20,000 BBY. The world was a part of the Galactic Republic during the Clone Wars of 22 BBY–19 BBY, with both the Third and the Seventh Sector Army of the Republic being charged with engaging the military forces of the Confederacy of Independent Systems in Drearia's vicinity. Drearia shared its name with the company Drearian Defense Conglomerate, which had been established at some point by the time of that conflict."}, {"tag": "p", "text": "By 17 BBY, Drearia fell within the territory controlled by the Galactic Empire. Shortly after the Battle of Endor was fought in 4 ABY, Drearia served as an Imperial fortress world. In 6 ABY, the New Republic Third Fleet prevailed in a battle at Drearia against Imperial forces as part of an advance northward along the Hydian Way. The reverse situation occurred four years later, when Imperial forces at Drearia were victorious over the New Republic as part of a Coreward push."}, {"tag": "p", "text": "Following the Imperial capture of the galactic capital world, Coruscant, during that campaign, the forces of the Empire engaged in highly-destructive in-fighting, and squadrons of TIE/D automated starfighters caused the destruction of the Mandator III-class dreadnought Aculeus. By 12 ABY, Drearia was situated within the borders of the New Republic. Around 25 ABY, the world's population numbered between one and ten billion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drearia was first mentioned in the 2009 reference book The Essential Atlas, authored by Daniel Wallace and Jason Fry, which placed it in grid square L-8."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}