{"url": "Drebble", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Drebble"}, {"tag": "p", "text": "Drebble was a pirate who associated with the bounty hunter Tirog, Tirog's protocol droid GT-9R, and a child calling himself \"Ace\"."}, {"tag": "p", "text": "Drebble once visited an open-air marketplace on a world with a bright blue sun with Tirog, Ace, and GT-9R. During this visit, they were accosted by a gambler accompanied by two armed thugs, who had been pursuing the group for some time. As the gambler and his cronies fired on the foursome, Drebble hesitated, and neither returned fire nor sought cover."}, {"tag": "p", "text": "Drebble frequently found himself trying to repair starships or droids, sometimes in emergencies. At one time, he had to repair a power coupling on Tirog's ship at double speed in order to hurry them offworld. He ran into the same problem at another time when trying to repair a ship belonging to another bounty hunter named Thannik."}, {"tag": "p", "text": "At some point, Drebble learned a special greeting which Sullustans used when meeting with friends."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drebble is one of the characters appearing in \"Tirog's Story\", a series of gameplay examples in Star Wars: The Roleplaying Game, Second Edition. His player in \"Tirog's Story\" is identified as \"Steve.\" Drebble's curious inaction during the firefight in the marketplace is due to Steve's indecision when the Gamemaster (Bill) asks what Drebble is doing."}, {"tag": "p", "text": "Drebble also appears in a handful of additional examples of skill use in the rulebook. His reappearance in Star Wars: The Roleplaying Game, Second Edition, Revised and Expanded, where he tries to fix Thannik's ship, is almost identical to a passage in the previous rulebook where Drebble works on Tirog's ship."}, {"tag": "p", "text": "If Drebble's statistics are based on the \"Cyborged Pirate\" character template in the second edition rulebook, Drebble is a Human with a cybernetic left arm. He dresses in flashy clothes, wears an assortment of gaudy jewelry, and is armed with a blaster pistol. He also owns a comlink, a vacuum suit, and may have up to 2000 credits in cash and other equipment."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}