{"url": "Dreed", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Dreed"}, {"tag": "p", "text": "Dreed was a human male who served the Galactic Empire as a commander during the Galactic Civil War. Shortly after the Battle of Yavin, Dreed was tasked with hunting down Alderaanians who had survived the destruction of their homeworld of Alderaan. He learned from Tula, an Alderaanian member of his Star Destroyer crew, that Princess Leia Organa of the Rebel Alliance was on a mission to rescue Alderaanians before he could reach them."}, {"tag": "p", "text": "Dreed caught up with Organa on the planet Sullust, where she and her allies bested Dreed's stormtroopers and escaped. However, using Tula as a hostage, Dreed forced Organa to meet with him on the planet Skaradosh. Organa exchanged herself for Tula at the meeting, but with the aid of the Sullustan smuggler Nien Nunb, the princess's allies then attacked the Imperials, killing Dreed and rescuing Organa and Tula."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Chasing Leia Organa"}, {"tag": "p", "text": "Dreed served the Galactic Empire during its war against the Alliance to Restore the Republic. Shortly after the destruction of the Empire's Death Star battle station at the Battle of Yavin, he held the rank of commander and controlled an Imperial-class Star Destroyer. In 0 ABY, Dreed was tasked with tracking down the natives of the planet Alderaan who had survived their homeworld's destruction by the Death Star."}, {"tag": "p", "text": "During Dreed's mission, an Alderaanian member of his crew named Tula was contacted by her sister, Tace, who informed her that the Alderaanian Princess Leia Organa was on a mission to rescue the surviving Alderaanians from Imperial persecution. Tace was unaware of Tula's Imperial loyalty, and so Dreed used her as a source of information on Organa, with Tula contacting Tace every night for updates on the princess's location and plans. Through the sisters, he learned that Organa was planning on traveling to the planet Sullust to make contact with an Alderaan Enclave built there."}, {"tag": "p", "text": "Organa made planetfall on Sullust and reached the enclave, but as she tried to persuade its inhabitants to join with her, they discovered the communication between Tace and Tula and accused Organa of working with the Imperials. As Organa and her pilot companion, Evaan Verlaine, were forced to flee from their kinsmen, Dreed dispatched a Sentinel-class landing craft carrying a platoon of stormtroopers to attack the enclave. The troopers dropped down on the underground enclave from its ceiling but were defeated when Organa and Verlaine led a herd of rockrenders back into the enclave to fight them. When Dreed learned that his men were dead, he decided to let the Alderaanians escape to lead him to another world, instead of deploying more troops."}, {"tag": "h3", "text": "A trade for Tula"}, {"tag": "p", "text": "However, Organa and her allies were now aware of Tula's deception, and the next time she contacted Tace via video transmission, Dreed realized that the charade was up. He ordered Tula to be taken away and processed for detention, as she was no longer of use to him. In order to try and save Tace's sister, Organa pleaded with him for an exchange. The commander demanded that the princess hand over herself, to which Organa agreed, arranging an exchange on the desert world of Skaradosh. Dreed traveled from his Star Destroyer to the planet's surface in a Lambda-class T-4a shuttle, arriving shortly before the Alderaanian party's T-1 shuttle."}, {"tag": "p", "text": "The prisoners were peacefully exchanged, but before Organa could be loaded onto the Imperial shuttle, the starship Mellcrawler swooped down and opened fire on the Imperials. The Sullustan smuggler Nien Nunb, who was aiding the Alliance as a friend of Verlaine, had sneaked the ship into the planet's atmosphere. To protect himself, Dreed grabbed Organa to use as a shield, but she escaped by stamping on his foot. With a clear shot, Verlaine opened fire from aboard the starship and killed Dreed. The rebels then launched a decoy vessel from Skaradosh's surface, which Dreed's Star Destroyer crew, now under the command of Captain Venk, destroyed, assuming it carried their foes. Believing they had killed Organa, the Star Destroyer's crew then traveled to the planet Espirion, where Organa and her assembled Alderaanian survivors joined forces to destroy the Imperial ship."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As an Imperial officer tasked with hunting down the survivors of Alderaan's destruction, Dreed held some respect for Leia Organa. He believed that she could possibly teach the Empire a thing or two about combat after she defeated his men on Sullust, but he repeatedly disregarded her sentiment that all Alderaanians were worth saving."}, {"tag": "p", "text": "He was impressed with how quickly Tula, his Alderaanian crewman, could so easily betray her sister but was nevertheless fully prepared for her to betray him at some point. Once he realized that the surviving Alderaanians had seen through his ploy, Dreed ordered for Tula to be taken away to detention, no longer having any use for her. During the prisoner exchange, Dreed kept his Star Destroyer in Skaradosh's orbit to make sure that the Alderaanians did not betray him, claiming to be more willing to honor his agreement and let the others go free if he got Organa."}, {"tag": "p", "text": "A human male, Dreed had fair skin, gray eyes, and black hair with a gray streak."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Dreed commanded an Imperial-class Star Destroyer while on his mission to hunt down the surviving Alderaanians. He wore a standard gray Imperial officer's uniform and did not carry a weapon while at the prisoner exchange on Skaradosh."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dreed first appeared in the third issue of the Star Wars: Princess Leia comic book mini-series, which was written by Mark Waid, illustrated by Terry Dodson, and released on April 29, 2015. He subsequently appeared in the following two issues of the series, being killed off in the final issue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}