{"url": "Drek_Drednar", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Drek Drednar"}, {"tag": "p", "text": "Drek Drednar was a pirate roaming the space lanes during the Galactic Civil War, especially the Carto Asteroid Belt. His base of operations was based on Taraloon, and his flagship was the Sable III."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Drednar originally served aboard a merchant ship called the Eclipse. Although he learned many vital things about starships and the handling thereof, he found life aboard a merchant vessel incredibly boring, and eventually he started considering jumping ship."}, {"tag": "p", "text": "When the Eclipse was attacked by the pirate Karn Granzor and his Corellian gunship Sable II, Drednar decided to join Granzor's crew of pirates. Enjoying the life of a pirate immensely, Drednar learned how to fire a blaster and the art of melee combat, among other things, from Graznor."}, {"tag": "p", "text": "However, Drednar was secretly aspiring to become a pirate captain himself, and started observing the way Granzor was running his pirate business. To Drednar, Granzor had no style, and he also preferred to keep most of the loot to himself, sharing only a small portion with his crewmembers."}, {"tag": "p", "text": "Drednar picked up resentment towards Granzor among many of the crewmembers and used this to his own advantage as he and many of his fellow crewmen started conspiring against Granzor. When the Sable II made a short stop at a backwater starport, Drednar and his co-conspirators jumped ship and stole a Corellian corvette, which they modified. Once the new ship was ready, Drednar, now captain of the stolen ship, set out after Sable II and defeated Granzor and those who remained loyal to him in combat. The Sable II being damaged beyond repair, Drednar and his men managed to salvage the loot that Granzor had kept to himself. Perhaps to mock Granzor, Drednar named his new ship the Sable III, and he and his crew went into the pirate business themselves."}, {"tag": "p", "text": "Drednar was a flamboyant character with a passion for dueling, though he preferred not to duel to the death, but rather till first blood. He lost his left eye in battle with a bounty hunter, but refused to have a cybernetic replacement. Instead he wore a simple black eye-patch for \"the piratical effect\". He did have a sense of mercy and preferred to avoid bloodshed and the killing of innocents. Remembering the ill fate of Granzor, he shared loots fairly with his crew."}, {"tag": "p", "text": "He was skilled in fencing, using vibro-knives, ranged combat with blasters, and also a very charismatic leader."}, {"tag": "h2", "text": "Ships"}, {"tag": "p", "text": "Drek's flagship was the Corellian corvette Sable III, and in addition to this ship he commanded a small wing of snub starfighters which were used to assault targets and prevent them from escaping. His starfighter wing included:"}, {"tag": "h2", "text": "Crew"}, {"tag": "p", "text": "Drednar's crew consisted of around two hundred men, including Humans, Sullustans, Gotals, Quarren, Duros, and even Ithorians, having various functions such as pilots, gunners, technicians, mechanics, brawlers, and starship thieves. In addition, he kept several informants all over the galaxy in his employ."}, {"tag": "p", "text": "Some of the more well-known members of his crew were:"}, {"tag": "h2", "text": "Prey and methods"}, {"tag": "p", "text": "To Drednar all ships were fair game, Rebel, Imperial and neutral ships alike, not having any preference for prey. However, Drednik was smart enough to avoid large Imperial warships."}, {"tag": "p", "text": "While using an array of different method, Drednar had a preference for prowling space lanes. What Drednar would do was, with the help of his navigator Tron Nixx, typically to select an asteroid field not too far from a hyperspace shipping lane. Drednar would then pull back and wait, having his starfighters patrol the area. Hyperspace travel close to asteroid fields often forced starships back into realspace due to gravity shadows created by the asteroids. When this would happen, Drednar's starfighters would swarm the prey vessel, and Drednar would hail them, delivering his motto \"Stand and deliver!\". Should it be necessary, Drednar's fighters would pinpoint the sub-light drives and weapons, while the Sable III would fire its ion cannon at the vessel, rendering it helpless."}, {"tag": "p", "text": "Following the disabling of the vessel, a boarding team would enter the vessel through a universal airlock tube attached to the Sable III. The boarding team was lead by Virtrol Devin and consisted of highly trained people. Once the vessel had been secured, Drednar himself would make a grandiose entrance and terrify its crew with his flamboyant, but rather harmless, antics."}, {"tag": "p", "text": "In the later stage of his career, Drednar adopted a bolder variant of his prowling method. Roaming less remote locations, he would fill the cargo holds of his ship with water and release it in space, which created huge ice asteroids so as to pull ships out of hyperspace without having to locate a nearby asteroid field first."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}