{"url": "Drew_Karpyshyn", "categories": ["Category:Real-world articles", "Category:Game screenwriters", "Category:Novel authors", "Category:Reference work authors"], "nodes": [{"tag": "h1", "text": "Drew Karpyshyn"}, {"tag": "p", "text": "Drew Karpyshyn is a Canadian video game designer, video game writer, and author. After working at a credit union for some time, he eventually became a game developer. He joined BioWare and became the senior writer and one of the core game designers on the critically acclaimed game Star Wars: Knights of the Old Republic."}, {"tag": "p", "text": "This Star Wars connection gave him the opportunity to write the novels Darth Bane: Path of Destruction, Darth Bane: Rule of Two, and Darth Bane: Dynasty of Evil, his first hardcovers."}, {"tag": "p", "text": "He worked as a writer on the game Star Wars: The Old Republic and wrote two novels set in the same era, The Old Republic: Revan and The Old Republic: Annihilation. Karpyshyn left BioWare in February, 2012 to work on other projects. He returned to the company in September, 2015 only to leave again in March, 2018."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "As a child, he was a big fan of Star Wars. Between the ages of 8 and 12, Karpyshyn dressed up as a Jawa for Halloween. When his friend told him Darth Vader was Luke Skywalker's father, he was wholly unconvinced."}, {"tag": "h3", "text": "Career"}, {"tag": "p", "text": "On July 15, 2003, Star Wars: Knights of the Old Republic was released on the Xbox. Karpyshyn was the lead writer and one of seven members of the core design team. Development of the game began around December of 2000, and it was first unveiled at the 2001 Electronic Entertainment Expo. Knights of the Old Republic received a great deal of praise and awards. According to Karpyshyn, the game \"let me get my foot in the door with LucasArts,\" eventually leading to his career as a Star Wars novelist."}, {"tag": "p", "text": "More significantly, he published his first Star Wars novel, Darth Bane: Path of Destruction. It was also his first hardcover book. In 2007, he quickly wrote a sequel, Darth Bane: Rule of Two, and recently published the third book in the series, Darth Bane: Dynasty of Evil. He also saw the release of the acclaimed Mass Effect game."}, {"tag": "h2", "text": "Works"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}