{"url": "Drexl-class_starfighter", "categories": ["Category:Legends articles", "Category:SoroSuub Corporation products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Drexl-class starfighter"}, {"tag": "p", "text": "Manufactured by SoroSuub Corporation, the Drexl-class starfighter was a short-ranged, two-person starfighter named after the Drexl bird from the moon Dxun. Originally a prototype of the Preybird-class starfighter, the Drexl was armed with dual laser cannons and a concussion missile launcher."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Drexl-class starfighter was a short-range starfighter manufactured by SoroSuub Corporation. The Drexl had a spacious 2 person cockpit, but could be flown by just one pilot, although it required an astromech droid or copilot for optimal combat effectiveness. When it was flown by a single pilot, there was room for up to 50 kilograms of cargo, which included 2 days of consumables."}, {"tag": "p", "text": "The Drexl-class starfighter was armed with dual laser cannons and a concussion missile launcher that held 12 concussion missiles and cost 165,000 credits new. A used model of the starfighter cost 100,000 credits. It was not equipped with a hyperdrive, so the starfighter was mainly used for short-range combat or planetary defense. The starfighter was not available to civilians, and was primarily used by customs forces."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Drexl-class starfighter started out as a prototype for the Preybird-class starfighter. As the developers from the SoroSuub Corporation moved to new ideas for the Preybird-class, the initial designs for the starfighter were shelved. Later, SoroSuub engineers revisited their earlier plans and put them into production as the Drexl-class starfighter."}, {"tag": "p", "text": "The starfighter was popular with custom agencies, although it was rarely used by military forces. It was named for the predatory Drexl bird native to the moon Dxun."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars Gamer 4 had an image in the article Ships of the Smuggler's Alliance, as shown on the left here. It was identified as a Preybird-class starfighter, but did not look like other images of the Preybird-class from The Last Command Sourcebook."}, {"tag": "p", "text": "The Unknown Regions sourcebook introduced the Drexl-class starfighter and depicted it very similar to the Star Wars Gamer picture. It also indicated a link between the two starfighter classes by stating the Drexl was an early prototype that was later developed into the Preybird. It is unclear if this was an attempt at retconning the difference in appearances."}, {"tag": "h2", "text": "Sources"}]}