{"url": "Drez_Unlin", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems individuals", "Category:Felucia residents", "Category:Males", "Category:Podracers"], "nodes": [{"tag": "h1", "text": "Drez Unlin"}, {"tag": "p", "text": "Drez Unlin was a male Felucian Podracer who lived during the last decades of the Galactic Republic. At some point during the Clone Wars, he captured the Jedi Master Plo Koon and made him his hostage, until Anakin Skywalker and his Padawan Ahsoka Tano came to their colleague's rescue. Unlin promised to release Koon if one of the two Jedi could beat him on a race, but he broke his promise after Tano did so. Unlin was ultimately neutralized by his own electroshock net during a fight with the Jedi. Once Plo Koon was freed, Unlin got transferred to the planet Coruscant, where he would spend the rest of the war in prison."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Felucian, Drez Unlin lived during the waning decades of the Galactic Republic. Around 20 BBY, he was a professional Podracer in the Dustig sector and resided on Malastare. At some point after the Battle of Teth, Unlin had business with the Confederacy of Independent Systems. One day, the Jedi Master Plo Koon stopped on Malastare to refuel while on his way back to the galactic capital of Coruscant, and he spotted Unlin talking to a well-known Separatist general. When the Jedi tried to enter Unlin's tent, the Podracer dropped an electroshock net, rendering the intruder unconscious. Unlin was now in the possession of a precious hostage, and he soon received the visit of the Jedi General Anakin Skywalker and his Padawan Ahsoka Tano. Suspecting the Podracer was holding his colleague hostage, Skywalker challenged Unlin to a race: if the Jedi won, Koon would be released, while if Unlin won, both Skywalker and Tano would become his prisoners. Unlin, however, deemed Skywalker too tall to fit in a Podracer, which is why the Tano was chosen to race in her master's stead. During the race, which consisted of a single lap, Unlin tried to sabotage Tano's Podracer, but the Padawan countered his treachery by using the Force. Despite the young woman's victory, Unlin refused to hand over Koon, and he sicced a group of four B1-Series battle droids on the Jedi. The two warriors disposed of the droids quickly, and Unlin approached Tano behind her back, disarming her and placing her in the threat of his blaster. However, the Jedi acted quickly: while Tano pushed her opponent under the tent's electroshock net, Skywalker pushed the button that made it fall, thus neutralizing Unlin. Master Plo Koon was freed and the Podracer was subsequently brought to Coruscant and put in jail. While Unlin claimed that Count Dooku, leader of the Confederacy, would come and free him eventually, Skywalker pointed out how unlikely that was given the Podracer's failure."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Unlin was an orange-skinned Felucian. He stood somewhere between 1.61 and 1.88 meters. According to Anakin Skywalker, Unlin's main weakness was his overconfidence. He was also notedly materialistic, as he immediately inquired about his possessions upon being arrested. He had a hypocritical view of cheating, as he considered his own deceptions as fair game but would not tolerate a Jedi using the Force to counter them."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Despite being a capable pilot, Unlin routinely cheated during the Podraces he participated in. His racing vehicle was notably equipped with a circular saw that was designed to dismantle his opponents' engines."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drez Unlin only appeared in The Masked Racer, an eight-page comic story published on March 6, 2014, in the third issue of the magazine Star Wars Comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}