{"url": "Drikl_Lecersen", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Gamblers", "Category:Heads of state of the Imperial Remnant", "Category:Humans", "Category:Males", "Category:Moff Council members", "Category:Moffs of the Imperial Remnant", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Drikl Lecersen"}, {"tag": "p", "text": "Drikl Lecersen was a male Human who served on the Council of Moffs of the Imperial Remnant from 41 ABY and onward. A supporter of Imperial leader Gilad Pellaeon, Lecersen was an old-school Moff who believed strongly in doing one's duty and keeping combat-ready at all times. During the Second Galactic Civil War, Lecersen backed a mutual alliance between the Remnant and the Galactic Alliance under Chief of State Darth Caedus in combating the Confederation, a rebellion revolting against Caedus's government. After agreeing to supply warships and soldiers to aid in an Alliance war effort, the Remnant was granted control of the Bilbringi and Borleias star systems—something the Moffs saw as the beginning of a renewed Galactic Empire. Following Pellaeon's assassination during the Second Battle of Fondor, the Remnant further aligned itself with the Galactic Alliance under Caedus."}, {"tag": "p", "text": "As the war progressed, Lecersen oversaw the Imperial conquest of the Roche asteroid field and narrowly survived the Mandalorian slaughter of Moffs during a subsequent raid on the asteroid Nickel One. In the aftermath of the fray, Lecersen, now the de facto leader of the Moff Council, accompanied Chief of State Caedus into battle during an attack on a Jedi Coalition base on Shedu Maad in the Hapes Cluster. Against Caedus's orders, the Moff authorized the creation and deployment of a nanovirus designed to target the bloodline of Hapan Queen Mother Tenel Ka Djo. The move ultimately proved fruitless, and, with Caedus's death, the battle ended in defeat for the combined Alliance and Remnant fleet. Cornered by Jedi forces, Lecersen and the remaining Moffs were given the choice between imprisonment or helping to rebuild the Alliance as punishment for their part in the war. The Moff Council opted for the latter, and, to ensure their cooperation, Jagged Fel, son of Imperial starfighter pilot Soontir Fel, was installed as Imperial Head of State—a move to which Lecersen agreed, given the elder Fel's reputation as an Imperial pilot."}, {"tag": "p", "text": "By 43 ABY, Lecersen was still serving as a Moff under Fel, who was gradually transforming the Remnant into a new Empire. The Moff, however, saw Fel's growing relationship with Jedi Knight Jaina Solo as a weakness for both the Head of State and the Empire as a whole. Lecersen hoped to exploit Fel's romance and other factors in the tumultuous post-war galaxy to his own advantage, with the aim of restoring the Moffs to glory as leaders of the Empire. Lecersen's dealing expanded considerably during the year, as he entered into a conspiracy headed by Alliance Senator Haydnat Treen that plotted to seize control of both the Imperial and the Alliance governments in an effort to bring about a renewed Galactic Empire. While simultaneously plotting against Alliance Chief of State Natasi Daala, Lecersen sought to supplant Fel as Imperial Head of State. By 44 ABY, the conspiracy had only attained marginal success, and Lecersen was forced to ally with recently deposed Chief of State Daala in her bid for Empress to save his own life. After a prolonged standoff against Fel's forces, both sides agreed to cease hostilities in favor of a general election to select the Empire's new Head of State."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "h4", "text": "The offer of an Empire"}, {"tag": "p", "text": "Drikl Lecersen was a Human male Moff of the Imperial Remnant who, from as early as 41 ABY, held a position on the Council of Moffs, the Remnant's governing body. A strong supporter of Imperial Supreme Commander Gilad Pellaeon, Lecersen was opposed to Grand Moff Quille's anti-Pellaeon faction within the council. Lecersen was an old-school Moff who believed strongly in duty, so much that he kept himself combat-ready at all times."}, {"tag": "p", "text": "In 41 ABY, as the Second Galactic Civil War between the Galactic Alliance and the Confederation was raging throughout the galaxy, Alliance Joint-Chief of State Darth Caedus—the former Jedi Knight Jacen Solo, who had been turned to the dark side of the Force—sent an offer to Supreme Commander Pellaeon for a mutual aid treaty between the two governments, so Caedus could gain access to the Remnant's warships for use in the war. However, Pellaeon had no desire to ally with Caedus's government. Nonetheless, word of the offer leaked out to members of the Moff Council. Before the weekly meeting of the council commenced in Ravelin on the Remnant capital of Bastion, Lecersen and Pellaeon briefly discussed Caedus's offer, with Pellaeon stating that Grand Moff Quille's faction was most likely aware of the proposal. Lecersen could not help but grin when this proved to be true; he jokingly asked for Pellaeon's \"psychic abilities\" when placing future bets on odupiendo races."}, {"tag": "p", "text": "Sure enough, as the meeting began, Quille spoke of the offer they had been given. When Pellaeon remained silent, Lecersen urged the Grand Moff to continue, going so far as to interrupt the man's speech with a well-placed joke. The discussion continued, and it was Lecersen who asked if the council wanted to expand Imperial territory. When Moff Rosset inquired if they would vote on the matter, Lecersen responded for Pellaeon, stating that the motion was not on the table—and that the council should watch the situation unfold before Pellaeon would make a decision. The meeting concluded, and the Moffs filed out of the chamber."}, {"tag": "p", "text": "Caedus sent Tahiri Veila, his aspiring apprentice, to speak to Pellaeon about the terms of his proposal. Veila told the Remnant's leader that Caedus was fully prepared to hand over control of the Bilbringi shipyards and Borleias to the Remnant, in exchange for Imperial aid in an Alliance attack on Fondor, a Confederation-aligned world. When Veila left, Pellaeon had his aide Vitor Reige assemble the Moff Council for a discussion of this new proposal. The Moffs realized that the Alliance would not be able to hold Fondor on their own, and their presence on the world—combined with the additions of Bilbringi and Borleias—would aid in the transition from the Imperial Remnant to a new Empire. The Council, Lecersen included, unanimously approved Caedus's offer with thunderous applause."}, {"tag": "p", "text": "Imperial warships, including Turbulent-class Star Destroyers, were sent to support the Alliance Third and Fourth Fleets in the attack on Fondor. As the battle progressed, Pellaeon was assassinated by Veila aboard his flagship, the Bloodfin. Grand Moff Quille's allies, who had accompanied Pellaeon on the Bloodfin, assumed command of the Star Destroyer, but a mutiny led by Vitor Reige forced the Moffs to barricade themselves in the command center of the warship—making it easy for Mandalorian soldiers led by Mandalore Boba Fett to wipe out the trapped Quille and his Moffs. In the aftermath of the battle, the remaining Moffs and forces of the Imperial Remnant became allied with Caedus's government, with Lecersen as a high-ranking member of the Council."}, {"tag": "h4", "text": "Battle on Nickel One"}, {"tag": "p", "text": "Later in 41 ABY, the Remnant attacked the neutral Roche asteroid field in an effort to secure the native Verpines' technology for use in the war effort. Lecersen and his Moffs, accompanied by the Elite Guard of stormtroopers, oversaw the conquest. Though the Super Star Destroyer Dominion was destroyed by Nickel One's entire force of starfighters—a move that killed two Moffs—the Remnant emerged victorious. The Moffs set up their headquarters in Nickel One's command center, where they engaged in negotiations with the Verpine hive mother. Accompanied by an Alliance fleet, Caedus arrived at the Roche asteroids and landed on Nickel One shortly thereafter, intending to reprimand Lecersen and the other Moffs for their unauthorized attack. The hive mother was initially relieved by Cadeus's presence and hoped to be rid of the Imperials, but the Sith Lord made it clear that the Alliance fleet was there to hold the star system. Lecersen, who had already drawn comparisons between Caedus and his grandfather Darth Vader, emphasized that the Verpine were not neutral, having sold weapons to both sides of the ongoing civil war. Caedus agreed with the senior Moff but nonetheless found it necessary to scold the Moffs for not consulting him prior to launching their attack. Moffs Voryam Bhao and Krom Rethway were quick to voice their disagreement and disapproval with Caedus, and Lecersen even felt the need to remind the Chief of State that the Imperial Remnant was an ally—not a territory—of the Alliance."}, {"tag": "p", "text": "The Jedi Coalition—yet another organization opposed to Caedus's Alliance—soon launched a raid on the Roche asteroids, with the fleets of Admirals Natasi Daala and Cha Niathal engaging the Remnant and Alliance warships while a strike force of Mandalorians, accompanied by Caedus's sister Jaina Solo, landed on Nickel One and proceeded to move towards the Moffs' command center. Lecersen was trapped inside the command center as the Mandalorians poured in, wiping out the Imperial Elite Guard and killing several of the Moffs present. When Solo began to fire on her brother, Caedus urged Lecersen and the remaining Moffs to wait in the command center's anteroom while he dealt with the threat. Both Caedus and his sister ultimately survived the encounter, as did Lecersen and a small percentage of Moffs. With the senior Moffs dead, Lecersen became the de facto leader of the Council of Moffs."}, {"tag": "h4", "text": "End of the war"}, {"tag": "p", "text": "Caedus was able to track his sister to a Jedi Coalition base on Shedu Maad within the Hapes Cluster. In an effort to wipe out one group of his opposition, the Sith Lord dispatched a fleet of Alliance and Imperial warships—including the Imperial II-class Star Destroyer Anakin Solo and the Super Star Destroyer Megador—to destroy the base. Lecersen and the Moff Council accompanied Caedus aboard the Anakin Solo. As the battle raged, the Moffs entered into a discussion with Tahiri Veila regarding Caedus's sanity. Veila revealed this to her Master, but Lecersen was the only Moff who was not shocked by her betrayal of their confidence. Believing the battle to be going poorly, Lecersen suggested to Caedus that they launch an attack on the Dragon Queen, the flagship of Hapes Consortium Queen Mother Tenel Ka Djo—the mother of Caedus's daughter, Allana, a fact unknown to the Moffs."}, {"tag": "p", "text": "Caedus was unable to read Lecersen's mind clearly, but he knew that the Queen Mother was the Moff's intended target. Lecersen explained that the Remnant's scientists had developed a nanovirus that could be tailored to a specific bloodline, once a sample of the target's DNA had been acquired. One batch, designed to kill anyone belonging to Clan Fett, had already been air-dispersed on Mandalore. Lecersen was particularly proud of the accomplishment, seeing it as revenge for the Mandalorian attack on Nickel One. Using a blood sample from the captive Hapan Prince Isolder, Tenel Ka's father, the Remnant would have been able to manufacture a specific strain directed against the Hapan Royal Family within an hour or two. Caedus, fearing for his daughter's life, tried to convince the Moffs and Veila not to develop the virus. Lecersen was skeptical of a victory without the nanovirus, but he nonetheless agreed to follow the Sith Lord's orders. The two then briefly traded jabs before Caedus prepared to confront his sister, who had boarded the Anakin Solo in preparation for a second conflict. Lecersen decided that the Moffs would transfer the flag to the Megador, but Caedus told them that there would be no need—both warships would be moving into battle. Caedus noted that it was time for them to risk their lives to win the war. Later in the Anakin Solo's Biodisposal Pit, after Caedus confronted Isolder and killed him, the Sith Lord discovered that Lecersen had betrayed him: The Moff had had tissue samples collected from Isolder, developed the nanovirus, and sent a missile boat to deliver it to the Dragon Queen. Before Caedus could do anything about it, Jaina forced her brother into a duel and ultimately killed him."}, {"tag": "p", "text": "The nanovirus ultimately proved to be useless, as both Tenel Ka and Allana survived, though the Queen Mother chose to hide the fact that Allana had survived. The battle fell in favor of the Jedi Coalition; Jedi Grand Master Luke Skywalker led a strike force of Jedi Masters and Jedi Knights as they stormed the Anakin Solo. The Jedi forces found the Moffs seated around a tactical display in the Auxiliary Command Center following a brief firefight, during which one Moff was killed. The surviving Moffs all displayed varied degrees of shock on their faces at the outcome of the battle. Skywalker informed them that Caedus was dead, and he offered the Council an ultimatum: They would either become Hapan prisoners-of-war and face trial for their nanovirus attack, or they could aid in rebuilding the shattered Galactic Alliance. Lecersen, as leader of the Council, found the former to be an unattractive option and the latter to be unusually generous. Skywalker announced that the Moffs would have to accept Jagged Fel, son of Imperial starfighter pilot Baron Soontir Fel, as the Remnant's new leader. Lecersen was accepting of the proposal, as were several other Moffs. Han Solo, Caedus's father, then suggested that the Remnant set up a mission to aid worlds affected by recent galactic wars. Though he initially doubted if the Remnant had the resources for such an endeavor, Lecersen was persuaded by another Moff to provide support for the project. When the Hapan Queen Mother arrived, Lecersen bowed and personally apologized for the Council's actions. Ka replied by threatening the Moff with death should there ever be another nanovirus attack. In the days that followed, with the devastating war finally over, the galaxy began on the path to recovery under new Alliance Chief of State Daala."}, {"tag": "h3", "text": "A new empire"}, {"tag": "p", "text": "By 43 ABY, Lecersen was still serving as a Moff, and he maintained a private residence in the Senate District on the Alliance capital world of Coruscant. Though Jagged Fel had managed to transform the Remnant into a new Empire, the Moffs had become dissatisfied with his handling of the government—specifically when he entered into a relationship with Jedi Knight Jaina Solo. The Moffs had managed to retain much of their independence following the Second Galactic Civil War, despite Luke Skywalker's plan to have Fel bring them into line."}, {"tag": "p", "text": "Lecersen and fellow Moff Porrak Vansyn discussed Fel's relationship one evening over dinner, a conversation that continued over the comm when Vansyn had to retire for the night. Lecersen decided to slip into a bath of warm, pleasantly-scented water before he told his comrade that he was keeping an eye on Fel; Vansyn suggested that they keep an eye on Solo, as she appeared to be leading Fel into more of a governmental relationship rather than just a personal one. Lecersen believed that the Moffs could use that to their advantage, as a distracted Fel thought he had succeeded in bringing the Moffs into line. The two Moffs agreed to wait for the moment when Fel's judgment was cloudiest to take advantage of the relationship for their own benefit. With the conversation over, Lecersen thought about how other factors, such as the current state of the galaxy, could aid the Moffs in their quest to be rid of Fel."}, {"tag": "p", "text": "The Jedi Order, for example, had been weakened when Grand Master Skywalker had been exiled for preventing Jacen Solo from turning to the dark side, and Lecersen planned to use the Order as one of many pawns in the Moffs' plans. The Jedi did not prove a threat to the Moffs again, as they were too busy dealing with the oppressive policies that Chief of State Daala was implementing. Lecersen likened all the pieces as threads which could be weaved into a tapestry that would display the Moffs restored to power and glory—without Jagged Fel as their leader. Lecersen later contacted Vansyn again to ask if the latter was watching HoloNet News and Entertainment's broadcast of reporter Javis Tyrr's exclusive interview with Acting Jedi Grand Master Kenth Hamner, the Mon Calamari healer Cilghal, the Chadra-Fan Jedi Tekli, and the two remaining Jedi Solos—Leia Organa and Jaina. Lecersen thought that Tyrr, who had earlier covered stories of \"insane Jedi\" running amok, could prove to be a useful agent in the Moffs' plans."}, {"tag": "p", "text": "After Tyrr was contacted and agreed to aid the Moff in his quest, Lecersen supplied the journalist with a tiny parasite droid installed within a Lovolol cleaning droid. Tyrr planted the cleaning droid in the New Jedi Temple, where it was able to captured footage of Jedi Yaqeel Saav'etu and Bazel Warv succumbing to the effects of Force psychosis. The reporter was also able to plant a spy droid within Jagged Fel's limousine, where it recorded Fel telling Jaina Solo of Chief of State Daala's plan to hire Mandalorians to deal with the Jedi. Later, after successfully recovering the droid from the limo, Tyrr got an exclusive interview from former Jedi apprentices Melari Ruxon and Reeqo Swen on why they had suddenly resigned from the Order."}, {"tag": "p", "text": "Tyrr later went to Lecersen's Coruscant apartment to show him the footage from the day's events. As the two drank Ryborean gax, Lecersen couldn't help but cringe as Tyrr downed glasses of the expensive liquid. When they began watching the video, the Moff was initially unimpressed by what he saw—after all, he had already seen the events at the Jedi Temple unfold live three hours earlier. But Tyrr urged him to keep watching as he fast-forwarded to the spy droid's recording of Fel and Solo's conversation within the limousine. Lecersen, much like Solo had been, was shocked to learn of Daala's plan to hire Mandalorians, but he was also amazed that Fel would so easily reveal an Alliance secret to a Jedi. The recording stopped as Tyrr approached the limo to download the data from the spy droid, which worried Lecersen that there was a potential that the droid would be traced back to the Empire. He warned the journalist that, should he be caught with Imperial technology, there would no longer be any use for him."}, {"tag": "p", "text": "The journalist calmed Lecersen's fears and proceeded to show him the exclusive shots of the former Jedi apprentices Ruxon and Swen surrendering to the Galactic Alliance Security forces outside the Temple. Tyrr explained the situation to the Moff; the apprentices had resigned because they had no intention of breaking the law and were not happy with Daala's moves to take over the Order. When he told Lecersen that he had gotten an interview with the two, the Moff proposed that they watch the video before he told the journalist how he would be rewarded for his work."}, {"tag": "p", "text": "Unknown to either Lecersen or Tyrr, Jaina Solo later dissected the cleaning droid and uncovered the parasite droid. Given that the model cost millions of credits, she concluded that Tyrr must have had help in obtaining the device. After comparing the device with a similar eavesdropping model uncovered from Moff Lecersen's chamber aboard the Anakin Solo after the Battle of Shedu Maad, she realized that Lecersen had supplied Tyrr with the parasite droid. Realizing that the Moff most likely wasn't content with Fel's leadership of the Empire, Solo contacted Fel and informed him of her findings. Additionally, Fel relayed this information to Chief of State Daala, who suggested that Fel do something about Lecersen's group of Moffs."}, {"tag": "h3", "text": "Conspiracy"}, {"tag": "h4", "text": "Recruitment"}, {"tag": "p", "text": "While the Empire was beginning the process of reunification with the Alliance, Alliance Senator Haydnat Treen of Kuat conspired to remove Head of State Fel as the first step in replacing the Alliance with a Galactic Empire modeled off Palpatine's Empire in its early years. The initial kidnap attempt failed when Fel was able to sound the alarm and defeat the attacking stormtroopers. Fel told Jaina Solo that the Moffs were probably behind the attack, but he doubted that Lecersen had been involved, noting that the attempt had been crude by the Moff's standards and would have probably been a last-ditch effort for him. Lecersen conducted his own investigation into the incident and found nothing that implemented any of the Moffs in the attack; rather, he had traced transactions through a Borleias bank all the way to Senator Treen. The Moff revealed this information to the Kuati senator in a temporary office within the Galactic Empire Embassy on Coruscant, and promptly asked her why she had wanted to kidnap Fel. Her response caught him off-guard—she declared that she wanted him to become Emperor."}, {"tag": "p", "text": "At the Kuat Embassy, Treen revealed that she wanted a return to the benevolent form of Palpatine's Empire and that Lecersen was the man who could accomplish the task. Treen explained that Lecersen would first need to replace Fel as Head of State, even temporarily, in time to preside over Imperial reunification with the Alliance, thus giving Lecersen all the credit and making him the second most powerful being in the galaxy, next to the Alliance Chief of State. Through a series of political maneuverings, Treen planned to manipulate a crisis that would dispose Daala, leaving the Kuati Senator to become the new Chief of State. To ensure everything went flawlessly, Treen had already secured the support of Senator Fost Bramsin of Coruscant, who would give her a tactical advantage in the Senate and the Armed Forces. In return, Treen merely wanted to become Grand Moff of the Corusca sector and have four dinners with Lecersen—hopefully enough for her to convince the Moff to make her his Empress. Lecersen approved of the plan, realizing that it could work if properly executed."}, {"tag": "p", "text": "By this time, Lecersen had played a substantial, yet behind-the-scenes role in organizing the Freedom Flight, a movement dedicated to ending slavery. The Moff managed to connect several isolated slave rebellions into a galactic revolution of sorts before letting it grow on its own, but his involvement in the organization's formation was strictly selfish—Lecersen viewed it as a metaphorical nest of fire wasps for any politician who tried to support the status quo by opposing the Freedom Flight. As such, when Treen suggested that Lecersen develop a crisis to unleash upon Daala, he already had one prepared."}, {"tag": "h4", "text": "Hidden agenda"}, {"tag": "p", "text": "Lecersen met with Treen, Bramsin, and General Merratt Jaxton of Galactic Alliance Starfighter Command at the Gleaming Fortunes Casino on Coruscant, each wearing an outfit for the casino's costume night—something Treen had established in the event that she would need to host a clandestine meeting at the casino. Lecersen arrived dressed as Emperor Palpatine, going so far as to perform a decent impersonation of Palpatine's voice. While the four of them played a high-stakes game of Chambers, they discussed what to do with the Bothan Admiral Nek Bwua'tu, whose loyalty to Daala would interfere with their plans. Jaxton, who won the game despite the Moff's best efforts, simply proposed to kill him if he would not bend to their will. Bwua'tu was later ambushed by two lightsaber-wielding assassins masquerading as psychotic Jedi; the attack, orchestrated by the conspiracy, left the Bothan admiral in a coma. Although Lecersen had been disappointed that Bwua'tu hadn't been killed, the resulting coverage of the Bothan's condition proved beneficial, as it served to distract Daala from her duties as Chief of State."}, {"tag": "p", "text": "After learning that Fel and the Solo family would be dining at the Pangalactus restaurant, Lecersen sought to use the opportunity for an assassination attempt on Fel. The Moff had Kester Tolann, a Chiss-hating disgruntled grandson of an Imperial Navy commander relegated to waste management by the Chiss Grand Admiral Thrawn, enlisted to attempt to kill Fel. Lecersen realized that Tolann's chances at success were very slim, so he hoped to use the failure as a means of pushing Fel into resigning as Head of State and hurting Daala's public image. The plot was codenamed \"Operation Duusha,\" named so for a type of cheese that was blue on the inside but possessed a different exterior color. Fel had been nicknamed \"Duusha\" because many saw him as being \"blue\"—a Chiss, for he was raised in their culture—on the inside."}, {"tag": "p", "text": "Lecersen revealed the details of the plot to Treen, explaining that the attempt on Fel's life would appear more like a diversion for a separate attack on the Solos. The two watched on a monitor as Fel's party arrived at the restaurant and were diverted to the room next to the chamber in which Tolann was present. Lecersen explained to Treen that when a cue—a recreation of the destruction of Alderaan on one of the restaurant's walls—was given, Tolann would knock down the wall dividing the two rooms with a micro-thermal-detonator, grab the Imperial leader, and then kill himself and Fel by triggering another detonator attached to his body. When the time came, Tolann breached the wall only to be killed in a salvo of blaster fire; the presence of two YVH droids was not enough to salvage the attempt. The Moff, however, having watched the scene unfold through Tolann's goggles and the optic feeds of the YVH droids, counted the mission as a success. Lecersen knew that key evidence left at the scene of the crime, such as the goggles's feed, would aid in the building up of a case against Fel, while manufactured documents and communications would lead the Jedi Order to assume that Daala was the mastermind behind the attack."}, {"tag": "p", "text": "Following the incident, Fel and Jaina Solo concluded that Daala may have entered into an arrangement with Lecersen or another Moff. As a test, Fel had Lecersen summoned to his temporary office in the Imperial embassy and asked the Moff whom he thought should succeed him as Head of State. While Lecersen wanted to volunteer himself, the Moff knew better and attempted to circumvent the question. After some pressing on Fel's part, Lecersen responded that he would give some thought to the matter and come up with a list of candidates. The two then briefly discussed the assassination attempt, with Fel noting that Tolann's conspiracy was doomed to destruction. After Lecersen departed, Fel remarked to Solo that the Moff was not ready to secure power but could not be excluded from the list of potential conspirators."}, {"tag": "h4", "text": "Adapting the plot"}, {"tag": "p", "text": "Lecersen was among one hundred members of Coruscant's elite who participated in a three-day, high-stakes sabacc tournament held aboard the Star Destroyer-turned-casino Errant Venture. The tournament was held as part of a ruse intended to distract Chief of State Daala and the Galactic Alliance military from the launch of the Jedi Order's StealthX wing. When the time came for the launch of the StealthX fighters, the Errant Venture's owner, Booster Terrik, had the Star Destroyer fire upon several of Coruscant's orbital mirrors, prompting the Galactic Alliance Sixth Fleet to intercept the threat and allowing the Jedi's fighters to safely leave Coruscant. The Errant Venture escaped into hyperspace; after assisting the Jedi in an engagement above the Almanian moon Pydyr, the Venture deposited Lecersen and the other passengers on Borleias. From Borleias, the sabacc players were returned to Coruscant via the transport Dust Dancer."}, {"tag": "p", "text": "Back on the capital world, the conspirators met again, this time in costume at Obridagar's Simulator Palace. While dressed as an Imperial TIE pilot, Lecersen did not partake in the flight simulators that Obridagar's had to offer. Instead, in a private chamber, he and the others involved in the plot met with Admiral Sallinor Parova, Nek Bwua'tu's replacement as Alliance Chief of Naval Operations and the newest member of the conspiracy. Lecersen was disgusted by Parova's choice of costume, a cheap Bothan admiral outfit intended as a mockery of Bwua'tu, but the Moff approved of her involvement in their cabal. At Obridagar's, the conspirators engineered a poison scare to implement their coup, with Lecersen and General Jaxton allowing themselves to be temporarily poisoned to add to the veracity of the situation. Jedi Knight Seha Dorvald, who had masqueraded as the pilot of the Dust Dancer, was implicated as the individual responsible; the extent of her \"plot\" was not revealed until agents of Fleet Intelligence uncovered a canister filled with the same poison used against Lecersen and Jaxton spliced into the Senate Building's water supply. Daala, displeased with Galactic Alliance Security's inability to discover the breach, accepted a new security detail from Fleet Intelligence on Parova's advice, inadvertently playing into the conspiracy's hands—the new detail was ultimately loyal to the plot against the Chief of State."}, {"tag": "p", "text": "However, before the conspirators could depose Daala, the Jedi enacted their own coup, seizing the Senate Building and arresting Daala. Not willing to let her plot's efforts go to waste, Senator Treen spoke with members of the Jedi Order and proposed that a Triumvirate be formed to ensure a peaceful transition with the Senate's cooperation. Treen maneuvered herself and General Jaxton onto the new Triumvirate, joining acting Jedi Grand Master Saba Sebatyne in assuming the duties of the Chief of State's office. Jaxton would later step down from the governing body, to be replaced by Daala's former Chief of Staff, Wynn Dorvan. After the Jedi takeover, however, doubts began to surface over whether Lecersen's and Jaxton's poisonings had been a part of the Order's operation or some unknown, second plot, a suspicion voiced by former GAS Lieutenant Javon Thewles to Jedi Leia Organa Solo."}, {"tag": "p", "text": "In the aftermath of the Jedi takeover, Jagged Fel attended a funeral held for recently deceased Jedi Master Kenth Hamner at the Jedi Temple and later publicly announced his approval of the overthrow of Daala's regime. Lecersen took to the HoloNet to condemn Fel's actions, calling the Imperial leader's backing of the Jedi coup an \"outrage\" that would end any hope of reunification between the Alliance and the Empire. Fel watched the broadcast from his residence on Coruscant and found the Moff's choice of words and refusal to refer to him as Head of State an obvious attempt at influencing public opinion. The remainder of the broadcast showed that a majority of the Moff Council shared Lecersen's sentiments."}, {"tag": "p", "text": "Shortly thereafter, Lecersen announced his plans to depart Coruscant for Imperial Space, where he would continue his aspirations for the Imperial throne. The Moff invited several members of the conspiracy, including recent addition General Stavin Thaal, to his lavish estate for a late-evening, going away dinner, after which they discussed the recent influx of new Alliance member worlds and whether any of their Senate representatives would make decent co-conspirators. From the prospects, only one—Senator Kameron Suldar of B'nish, who unbeknownst to them was a member of a Sith organization plotting to rule the galaxy—intrigued the plotters. As the conversation turned to the abolition of slavery on the new member worlds, Lecersen chose the opportunity to reveal that he had been responsible for organizing the Freedom Flight. Although its actions were beyond Lecersen's control, Senator Treen suggested that the organization's success may have given the conspiracy some fresh opportunities."}, {"tag": "h4", "text": "Change of plans"}, {"tag": "p", "text": "Lecersen was later visited by the Minyavish Tiyuu'cha Mahlor, whose species had been exiled from their homeworld, Qaras, by the rebelling Jessar slave population. Escorted into the Moff's sitting room by an E-3PO protocol droid, Mahlor revealed that he had uncovered evidence of Lecersen's involvement in the Freedom Flight and demanded that the Moff grant justice to the Minyavish by finding them a new planet on which to live. Lecersen was originally skeptical that Mahlor had uncovered any evidence to support his claim, however truthful it was, and was ready to dismiss the Minyavish until Mahlor identified Senators Bramsin and Treen as cohorts of Lecersen's. Realizing that the being might be in possession of sensitive information, the Moff had Mahlor stunned and subsequently tortured until the latter revealed everything he knew, at which point Lecersen had the Minyavish painlessly killed. When Treen reported to Lecersen about her and Bramsin's dinner with Suldar, which saw the new Senator's inclusion in their conspiracy, the Moff relayed the events of the evening to her before dispatching an operative to Qaras to retrieve the evidence linking him to the Freedom Flight."}, {"tag": "p", "text": "Despite Mahlor's claims to the contrary, others were aware of Lecersen's involvement in the Freedom Flight, specifically the Mandalorians under Boba Fett. After rescuing Daala from Alliance captivity, Fett informed her of the Moff's involvement in the organization and his reasons behind it. As she embarked on her own bid for Empress, her agents intercepted Lecersen's operative on Qaras and retrieved the evidence of which Mahlor had spoken. Daala next contacted Moff Vansyn, Lecersen's old friend who had been feeling left out of his compatriot's dealings, and entered into an alliance with him. As Lecersen sat down with Vansyn at the latter's estate, Vansyn subtly baited his fellow Moff into revealing details of the conspiracy. Feeling a pang of regret for keeping Vansyn out of the loop for so long, and hoping to use his territory as a base, Lecersen made a calculated decision to reveal his plans to become Emperor. However, as the conversation continued, Lecersen realized that he had been drawn into a trap, one orchestrated by Daala. Daala revealed that she had full knowledge of Lecersen's activities and offered him a choice—join her in her plot against Fel, or die."}, {"tag": "p", "text": "Forced to ally with Daala, Lecersen severed all ties with Treen's conspiracy, which immediately began to unravel as various factors turned against it. As Nek Bwua'tu emerged from his coma and began investigating the members of the conspiracy with help from others, General Thaal received word that Lecersen had allied with Daala. This revelation, combined with the fact that their recent alliance with Senator Suldar had failed to bear fruit, prompted Thaal and Treen to dissolve their cabal. In short time, Bramsin, Parova, and Jaxton were dead, and Treen had retired to Kuat."}, {"tag": "p", "text": "The Moff, meanwhile, gathered approximately three-quarters of his personal fleet and rendezvoused with Daala in the Exodo system in preparation for her coup. Hoping to use the opportunity to personally kill Fel, Lecersen had several baradium missiles loaded aboard his flagship, the Imperial-class Star Destroyer Empire Maker. Above Exodo II, Daala revealed that Fel had been assassinated by Moff Tol Getelles, much to Lecersen's surprise; however, unbeknownst to Daala and her group of rebellious Moffs, the \"assassination\" was merely a ruse, and Getelles had secretly allied with Fel. Shortly after Moffs Vansyn, Trevin, and Getelles arrived at the rendezvous with their warships, Daala's forces were attacked by a flotilla loyal to Fel, including a vanguard from the Empire of the Hand, a Remnant armada, and the turncoat Getelles's fleet."}, {"tag": "p", "text": "As the battle progressed, Fel's flagship, the Gilad Pellaeon, emerged from its hiding place in the hollowed-out tunnels of Exodo II's moon, Boreleo. Lecersen destroyed the Pellaeon using several of the Empire Maker's baradium missiles, but Fel escaped to the Bloodfin to continue the battle. It was at this point that Lecersen launched a salvo of baradium missiles at Boreleo itself, destroying the satellite and sending debris directly into the enemy fleet. Daala had initially thought the move to be a crazy one, but it proved successful, causing enough chaos to give her forces a temporary advantage. However, with reports of casualties flooding in, Daala devised a new plan, one which had an Interdictor from Lecersen's fleet—the Kagcatcher—use its gravity well projectors to gather the remnants of Boreleo into a protective shell around her warships. While the makeshift barrier protected them from any further attack, Daala and her allies were also effectively trapped, with nowhere to go."}, {"tag": "p", "text": "After a month of hiding within the remnants of Boreleo, Lecersen had grown tired of the standoff. The arrival of Imperial Lieutenant Lydea Pagorski—in reality an avatar of the female entity known as Abeloth, who planned to use the Empire as part of her machinations to take over the galaxy—had provided the Moff with the motivation to break out of his and Daala's self-imprisonment in order to renew the fight with Fel. Daala rejected Lecersen's idea, as she knew that such a move would prove chaotic and end her plans of ruling an intact Empire. Though the Moff threatened to take his chances in battle, preferring to fight rather than surrender, Daala suggested a third option. With the input of Abeloth's Pagorski avatar, the admiral proposed a general election for Head of State, convinced that such a contest could easily oust Fel from power and place Daala in charge of the Empire. Though Lecersen scoffed at the idea, Abeloth/Pagorski displayed her powers by forcing the Moff to prostrate himself at Daala's feet, proof that the entity could deliver the election to Daala. The proposal essentially ended the battle, as both Fel and Daala instead worked to deny each other victory in the political arena. In the end, however, neither Daala nor Fel won the election, and the position went to Admiral Vitor Reige when Fel dropped out of the race to ensure Daala could not win."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An old-school Moff admired by Gilad Pellaeon, Lecersen always kept himself combat-ready should the need for battle arise. He was considered part of the \"new breed\" of Moffs, who, according to Pellaeon, were more enlightened than their predecessors. Lecersen was a firm believer in duty, putting it before personal gain. As the result of his many addresses and news broadcasts, the Moff and his appearance and manners were well-known to his constituents in Imperial space. Following the Mandalorian slaughter of Moffs on Nickel One, Lecersen assumed command of the Moff Council as its ranking member. Lecersen possessed an analytical mind; he considered himself capable of finding numerous opportunities which could be exploited for personal gain, like searching for credcoins on the ground. Lecersen was also skilled at reading body language, using it to excel in politics."}, {"tag": "p", "text": "Much like the rest of the Moffs, Lecersen desired to see the Imperial Remnant transformed into a second Galactic Empire. To see this dream come true, Lecersen was willing to ally the Remnant with the Galactic Alliance under Darth Caedus. However, the Moff was not willing to see the Remnant submit to the will of the Alliance; thus, he had Remnant forces perform independent attacks such as the assault on the Roche asteroids. Though Caedus disapproved of the Moffs' decision to attack without first consulting him, Lecersen showed no fear in telling the Sith Lord that he had no place in the decision-making of the Remnant. Gradually, however, Lecersen became somewhat subservient to the Alliance Chief of State; by the time of the Battle of Shedu Maad, the Moff was addressing him as \"Lord Caedus\" and advising him during the engagement. In the aftermath of the war, he disapproved of Alliance Chief of State Daala's decree to add more females into the ranks of the Empire."}, {"tag": "p", "text": "Following the civil war, Lecersen gradually became more ambitious. As a result of his desire to remove Fel as leader of the Empire, Lecersen had begun to seek out numerous opportunities which he could use to restore the Moffs to glory as leaders of the Empire. He believed that ambition and intelligence without morality were the keys to being a great leader. As such, he occasionally employed torture—despite his dislike for it—to extract information from unwilling beings, keeping an IT-O Interrogator handy for such needs. When the subject caved in and revealed what the Moff was looking for, Lecersen had the being's life ended quickly and without pain. He had no qualms about using people like the journalist Javis Tyrr to further his own goals when he was unable to do so by himself. The Moff planned to use Tyrr's information to remove the Jedi Order and the Solo family as threats to the Moff Council, which would put Lecersen and his Moffs in the perfect position to drive their metaphorical vibroblades into Jagged Fel's back when the time came to remove the Head of State."}, {"tag": "p", "text": "Lecersen's ambitions were used to great effect by Kuati Senator Treen, who convinced the Moff to join her conspiracy when she offered him the position of Emperor in a renewed Empire. Although the idea for the plot had been Treen's, Lecersen became its titular leader. While involved in the plot, the Moff frequently manipulated events to further the group's plans, including developing the Freedom Flight into a galactic movement merely to distract Chief of State Daala. Lecersen believed that honorable individuals who stood between him and a goal deserved to be respected; as such, when Admiral Parova mocked the comatose Nek Bwua'tu, who had been an obstacle to the conspiracy's aims, the Moff wondered if he had judged Parova correctly. When confronted by Daala, the Moff was forced to abandon the conspiracy to save his life; without him, Treen's plot rapidly disintegrated. As a backer of Daala's bid for Empress, Lecersen continued to despise the woman, but he found that an alliance with her against Fel was, in some ways, more beneficial than an alliance against both her and Fel."}, {"tag": "p", "text": "Lecersen owned a lavish estate on Coruscant, an expensive private residence situated on multiple acres and decorated with luxurious furnishings from across the galaxy. In addition to drinking only the best caf available, Lecersen enjoyed several fine alcoholic beverages. He savored the taste of Hapan gold wine—something he saw as a bittersweet irony, given his dealings with the Hapes Consortium during the Battle of Shedu Maad. He also valued the flavor of expensive Ryborean gax; because of its cost, Lecersen was annoyed when Javis Tyrr drank glasses of the liquor during their one meeting. An occasional gambler, the Moff participated in several high-stake card games, including a Tendrando Arms-sponsored celebrity sabacc challenge with an entrance fee of 1,000,000. Lecersen accepted his loss in the challenge as an unavoidable risk made in gambling with such a large amount of credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Moff Lecersen was created by Karen Traviss as a character in her 2008 novel Legacy of the Force: Revelation, the eighth book in the Star Wars: Legacy of the Force series. The Moff played a relatively minor role as a supporter of Imperial leader Gilad Pellaeon on the Moff Council. Troy Denning later used the Moff, albeit in a more prominent role, in 2008's Legacy of the Force: Invincible, the ninth and final book in the same series. Denning transformed the Moff from a background character into one of the novel's protagonists. Lecersen has also appeared in various books of the Fate of the Jedi series, playing a sizable role in a conspiracy subplot that spans most of the novels. His first name, \"Drikl,\" was revealed in 2009's Fate of the Jedi: Abyss, written by Troy Denning."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}