{"url": "Driller_MarDapp", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Driller MarDapp"}, {"tag": "p", "text": "Driller MarDapp was a human male who lived on the planet Coruscant during the era of the Galactic Empire. During that time, MarDapp and Juahir Madras befriended Arihnda Pryce of Lothal. As the head of Higher Skies Advocacy Group, MarDapp personally recruited Pryce into his organization which—unknown to the Lothal native—was in league with a spy ring that worked for an insurgent leader known as Nightswan. After Pryce betrayed their spy ring to Grand Moff Wilhuff Tarkin, Driller, Juahir, and their associates were arrested by the Imperial Security Bureau."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Driller MarDapp lived on Coruscant during the Imperial Era. He ran an advocacy group called Higher Skies Advocacy Group, which was actually an intelligence-gathering front for the shadowy insurgent known as Nightswan, who was interested in the Empire's mining operations."}, {"tag": "h3", "text": "Meeting Pryce"}, {"tag": "p", "text": "Driller MarDapp had an uncle who worked as a senior staff officer at the Royal Imperial Academy on Coruscant. As his \"favorite\" nephew, Driller was allowed to \"house sit\" in his uncle's apartment at the luxurious Sestra Towers in Coruscant's exclusive Core Square for three months. Driller was a friend of Juahir Madras, a waitress and martial arts practitioner who befriended Arihnda Pryce, who worked as an aide to Lothal's Senator Domus Renking."}, {"tag": "p", "text": "Driller allowed Juahir and Pryce to stay at his uncle's Sestra apartment in return for Pryce gaining them access to several exclusive parties in Coruscant's Federal District. During a function at the Alisandre Hotel's grand ballroom, Driller and the ladies noticed the presence of the blue-skinned Chiss Imperial Navy officer Senior Lieutenant Thrawn. When Driller asked if Thrawn was a Pantoran with an \"eye condition\", Juahir chided him for his rudeness. Pryce went up to speak with Thrawn and his party which included the Imperial Security Bureau Colonel Wullf Yularen and Ensign Eli Vanto but did not managed to introduce her friends to the newcomers."}, {"tag": "p", "text": "Before leaving to deliver a datacard to Moff Ghadi, Pryce told Driller and Juahir to enjoy themselves but to avoid indulging too much in swirlydips. In their absence, Pryce was blackmailed by Moff Ghadi into returning the data card to Senator Renking. This triggered an investigation which caused Renking to lose funding. In retaliation, Renking sacked Pryce from her job as a citizen assistance officer. After Pryce was evicted from her apartment, both Driller and Juahir came to her aid. Pryce accepted Driller's offer to stay at his uncle's apartment for a week until she found a new job at the Proam Avenue Citizen Assistance."}, {"tag": "h3", "text": "New recruits"}, {"tag": "p", "text": "Following Renking's unfair sacking of Pryce, Driller recruited Juahir into Nightswan's spy operation, exploiting her disillusionment with the Galactic Empire. Juahir abandoned her waitressing job and became a martial arts instructor at the Togorian dojo H'sishi's Yinchom Dojo, which supplied and trained bodyguards for Imperial officials and senators. With Driller's knowledge, Juahir used her position to convince and blackmail bodyguards into stealing confidential files and information on Imperial mining operations for Higher Skies. Unknown to everyone, the Empire excavating metals and raw materials to build its top secret Death Star superweapon."}, {"tag": "p", "text": "Working together with Juahir, Driller invited Pryce to the fancy Pinnacle restaurant in a plush part of Coruscant. Knowing of Pryce's expertise with mines, mining, and refining, Driller offered Pryce a job at his Higher Skies Advocacy Group. Pryce accepted the offer, viewing it as an opportunity to get out of a dead-end job and to re-enter the corridors of power. To sweeten the offer, Juahir offered Pryce lodging at her apartment near the Senate Building in return for Pryce doing the cooking. Driller and Juahir hoped to recruit Pryce into their rebel cause."}, {"tag": "p", "text": "Driller was a reliable employer who paid Pryce on time and had enough funds to purchase outfits for the elite officials whom she interacted with. One evening, Driller instructed Pryce to investigate an unusual spate of Imperial takeovers of mines and sometimes entire planets. Recalling the Empire's takeover of her family mine, Pryce decided to stay behind and investigate further. She discovered that the Empire had since nationalized 28 mines with the most recent being Umbara, where the now Captain Thrawn had seen action against Nightswan's operatives."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "Driller's espionage activities eventually drew the attention of the Imperial authorities. Following a visit to Yinchom Dojo, Thrawn and Colonel Yularen learned about Higher Skies from Arihnda Pryce. Higher Skies also drew the wrath of Moff Ghadi after smugglers gained access to his financial records and raiders attacked one of his mines. Moff Ghadi demanded that Pryce spy on Higher Skies. However, Pryce turned to her ally Captain Thrawn, who convinced her to spy on both Higher Skies and Moff Ghadi in order to secure Colonel Yularen's protection and favor. Pryce managed to bait Ghadi by offering to provide him with information on his rival Grand Moff Wilhuff Tarkin."}, {"tag": "p", "text": "Before meeting with Tarkin, Pryce told Driller about her plan to gain access to the Phindian senator Lady Teeyr Hem by purchasing a bottle worth 2,000 Credits. Driller was unhappy at this exorbitant expense and expressed concern that public funds were being diverted away from schools and hospitals. Driller then told Pryce that he had secured her an audience with Grand Moff Tarkin, whom he described as a \"big fish.\""}, {"tag": "p", "text": "During the meeting with Tarkin, Pryce instead betrayed Driller, Juahir, and the rest of Higher Skies by exposing their espionage activities against the Empire. Pryce also revealed Moff Ghadi's opportunism of wanting to use Higher Skies' files on Tarkin to gain an advantage over his rival. Besides security immunity, Pryce also convinced Tarkin to appoint her as the new Imperial Governor of Lothal and to give Thrawn's friend Eli Vanto a long overdue promotion."}, {"tag": "p", "text": "After one of Juahir's students Kaniki tried to assassinate his employer Senator Evidorn, ISB Colonel Yularen ordered a crackdown on Driller, his Higher Skies associates, and Juahir."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Driller MarDapp was a human man with tan skin, black hair, and dark eyes. Driller disagreed with the Galactic Empire's policies particularly taking money away from schools and hospitals. He believed in making the Empire a better place for the many. His dissent with the Empire led him to create a spy ring centered around the Higher Skies Advocacy Group. Driller supplied information to the shadowy insurgent leader Nightswan; using his status as the nephew of a Royal Imperial Academy official to gain access to Imperial elite circles."}, {"tag": "p", "text": "After Pryce was mistreated by Senator Renking, Driller viewed her as a potential rebel sympathizer. With the help of fellow sympathizer Juahir, he recruited Pryce into Higher Skies, hoping to use her expertise in mines, mining, and refining. Driller hoped to win Juahir over to his cause. However, Pryce was only concerned with advancing her own political ambitions and seeking revenge against Senator Renking and Governor Ryder Azadi, who had cost her family their mine. When Driller and Juahir came into conflict with her goals, Pryce was willing to cast them aside."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Driller MarDapp first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted canonical origin story of the eponymous character. His lines are told through the point of view of Arihnda Pryce."}, {"tag": "p", "text": "He was first illustrated in the Marvel Comics Thrawn 3, a comic adaptation of the novel which debuted on April 11, 2018. He was drawn by Luke Ross and colored by Nolan Woodard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}