{"url": "Droch", "categories": ["Category:Legends articles", "Category:Creatures of Nam Chorios", "Category:Drochs", "Category:Insectoid sentient species", "Category:Insects", "Category:Outer Rim Territories species", "Category:Oviparous species", "Category:Parasitic creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Droch"}, {"tag": "p", "text": "Drochs were parasitic insects that burrowed under beings' skin and drank their life energies and intelligence. Their feeding was the source of Death Seed plague."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Though they began life as non-sentient creatures, a droch could gain true sentience after draining enough intelligence from a host. Drochs could mimic the host's electrochemical fields and tissue composition, allowing them to avoid detection by essentially becoming part of the host while drawing life from them. Drochs grew and became more intelligent with each host they killed and larger drochs could absorb life through smaller ones, without having to take a host directly. When exposed to light on Nam Chorios, they were sluggish and infertile due to the light being altered by the native tsil crystals. However, once in darkness, they moved quickly and reproduced at an alarming rate. The sun did not affect them on any other planet due to the absence of the tsils. As they gained intelligence with each host they killed, if they were to either kill a large crowd of people, or a few Jedi, they would achieve the rank of sentient. It is unknown if once they achieved this they would be disgusted at what they had done, and attempted to stop, because no one was willing to be part of the experiment."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 702 BBY, the Grissmath Dynasty founded a penal colony on Nam Chorios in the Meridian sector and seeded the world with drochs in the hopes that a Death Seed outbreak would wipe out the prisoners. However, sunlight fragmented through the sentient Spook crystals found on Nam Chorios, weakening the electrochemical bonds of the drochs. Smaller ones were killed outright by the light, but larger ones proved unable to harm their hosts and were harmlessly absorbed by the body as nutrients. A plague never broke out, as drochs were only able to grow in the dark."}, {"tag": "p", "text": "In 1 ABY, research conducted by the Imperial Department for Epidemic Prevention revealed that vermin on Tatooine were possibly carrying droch eggs. These suspected creatures were all destroyed."}, {"tag": "p", "text": "By 13 ABY, one droch, Dzym, grew to the size and shape of a Human and prepared the drochs for invasion. Dzym could control the other drochs allowing him to start and stop a plague at will. He conspired with Seti Ashgad to start a plague throughout Meridian Sector. Drochs even appeared in the arthropod exhibit of the Coruscant Livestock Exchange and Exhibition following the New Republic's founding, along with spice-producing Energy spiders and toxin/adrenaline-producing orbalisks."}, {"tag": "p", "text": "The life energy in drochs could be released by eating them, and if eaten in large quantities, this could help prolong the eater's life. Hutts ate droch as appetizers. Zubindi Ebsuk was a notable provider of droch foods, which eventually resulted in the creation of Dzym."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}