{"url": "Droch-class_boarding_ship/Legends", "categories": ["Category:Legends articles", "Category:Boarding craft classes", "Category:Colicoid Creation Nest products", "Category:Confederacy of Independent Systems starship classes"], "nodes": [{"tag": "h1", "text": "Droch-class boarding ship"}, {"tag": "p", "text": "The Droch-class boarding ship, also known as the pod hunter and the Separatist boarding craft and nicknamed \"juicers\" by the Galactic Republic's clone troopers, was a model of boarding craft used by the Confederacy of Independent Systems and built by the Colicoid Creation Nest."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Colicoid makers of the Droch-class based its design on the toothspike raptor of Colla IV."}, {"tag": "p", "text": "The Droch-class was armed with a large set of four spikes arranged around the cockpit, that were used to crush an object trapped inside the array, which led the Galactic Republic's clone troopers to name the ships \"juicers.\" These four spikes also could be used to pierce the hull of a ship and deploy a boarding party. It usually carried a few rocket battle droids. The pilot sat on top of the vehicle, and it could be used as a local transport for several troops, which entered and exited from a central passenger compartment. The boarding craft was lightly armed, with a number of light laser cannons."}, {"tag": "p", "text": "The versatile troop transport could be used to capture enemy starships relatively intact, to be later used in covert missions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Pod hunters were used at the Battle of Abregado, where they hunted down escape pods from Plo Koon's Triumphant, crushing them and killing their passengers. There, the pod hunter transported rocket battle droids. However the pod hunter and the droids were destroyed in an encounter with Jedi Master Plo Koon and several clone troopers. One of these pods was Pod 1977."}, {"tag": "p", "text": "Not long after, a squad of BX-series droid commandos used one to land on the Rishi moon under the cover of a meteor shower, attacking the Republic listening post there in preparation to invade Kamino. Later, Asajj Ventress and a squad of B2 super battle droids used three ships to board the Tranquility, carrying Luminara Unduli, Ahsoka Tano, and their captive Viceroy Nute Gunray, in an attempt to free the captive Gunray."}, {"tag": "p", "text": "Later in the war, the pod hunters boarded Juma 9 in aiding Kul Teska. Despite their deliveries of droidekas, B1-Series battle droids, chameleon droids, B2 super battle droids and DSD1 dwarf spider droids, they were unable to secure the station when reinforcements under Jedi Generals Mace Windu and Kit Fisto arrived."}, {"tag": "p", "text": "Additionally, three boarded the New Mandalorian vessel Coronet, deploying super battle droids to aid Tal Merrik in transporting the Duchess Satine Kryze off ship. The droids were destroyed by the clone troopers and the Mandalorian Royal Guard, however, and Merrik was killed by Anakin Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}