{"url": "Drogen_Hosh", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Humans", "Category:Males", "Category:Separatist officers"], "nodes": [{"tag": "h1", "text": "Drogen Hosh"}, {"tag": "p", "text": "Drogen Hosh was a male Human who served the Confederacy of Independent Systems as a commander in the Separatist Droid Army during the waning years of the Galactic Republic. He participated in the Clone Wars and commanded Separatist forces in an attack on the Republic-allied planet Argul, in the Mid Rim. During the battle, Hosh's forces surrounded a mesa on which the world's last Republic-controlled starship docking tower was located, and shot down the one remaining Republic transport on the planet. Hosh watched the aftermath of the crash through a pair of electrobinoculars and noticed a group of Jedi aiding the crash survivors via a stairwell built into the side of the mesa. He developed a plan to use the stairwell as a route to attack the mesa, and launched an assault on the landform when nightfall hit. The following morning, Hosh contacted a group of Jedi Padawans who were leading Republic forces on the mesa, and attempted to broker a ceasefire with them, because he believed that an all-out strike on the position would cost civilian lives."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Drogen Hosh was a male Human, who lived during the waning years of the Galactic Republic and served the Confederacy of Independent Systems as a commander in the Separatist Droid Army. During the Clone Wars, a conflict that was fought between the Confederacy and the Republic, Hosh commanded Confederacy forces during their attack on the Mid Rim planet Argul."}, {"tag": "p", "text": "The fighting on Argul was fierce, and the Republic began to evacuate Argullian citizens from the world's war-torn cites. However, Hosh sent some battle droids to advance into Lumica—the world's capital city—and surround a mesa on which the world's last remaining Republic-controlled starship docking tower on Argul was sited. There, the commander's droid artillery shot down the only Republic transport left on the planet, an Acclamator-class assault ship that was attempting to take refugees off of Argul. Hosh watched the aftermath of the crash using a pair of electrobinoculars, and witnessed a number of Jedi cut through the wall of a stairwell built into the side of the mesa, so that they could reach the crash site and rescue survivors. Equipped with the knowledge that there were stairwells leading up to the top of the mesa, Hosh began to develop a plan to take the mesa and the docking tower by sending troops up the stairs. He correctly assumed that the stairwells were blocked at ground-level and also believed that the Jedi would just block the stairwells further up if they saw his forces excavating them. He therefore sent a platoon of battle droids to excavate a stairwell under the cover provided by the smoke billowing out of the wrecked Acclamator, allowing them to work while unseen by the Republic forces."}, {"tag": "p", "text": "At nightfall, Hosh implemented the next stage of his plan, sending a dropship to the mesa to land 12 Single Trooper Aerial Platforms, while 36 battle droids ascended the landform via the unblocked stairwell. He ordered the droids to seize the docking facility's control tower and capture everyone inside it, because he suspected that important Argullian officials had taken shelter there. However, the Republic forces and a group of Jedi Padawans mobilized to combat the droids."}, {"tag": "p", "text": "The next morning, at dawn, Hosh sent a holographic message to the Padawans atop the mesa, proposing a ceasefire. Hosh believed that an all-out assault on the position would cost civilian lives, so he offered to halt the Separatist attack and let the Republic forces and the Argullians leave the world when Republic transports returned there. In return for this, he asked that the Jedi hand over all ranking Argullian officials to the Separatist forces, and allow the world to secede to the Confederacy. In an attempt to convince the Jedi that he was not trying to deceive them, Hosh offered himself to them as a hostage, claiming that he would fly to the docking tower in his personal shuttle and sign a treaty with the Argullians, then hand himself over to the Jedi and remain with them until the return of the Republic transports. He even offered to deliver food and medical supplies to the Argullian refugees on the mesa, if the Jedi accepted his proposal."}, {"tag": "p", "text": "The Jedi declined Hosh's offer, which disappointed him. Nevertheless, he admired their tenacity and told them that he would have done the same thing if he had been in their position. Shortly afterward, he launched an all-out attack on the mesa, sending battle droids to attack it from all sides. The Jedi Grand Master Yoda arrived on Argul with Republic reinforcements, however, turning the tide of the battle in the favor of the Republic and eventually leading to the defeat of the Confederacy forces on the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Drogen Hosh was a reasonably sincere and pleasant man, who did not like to hurt innocent people or cause unnecessary deaths. Nonetheless, he was a ruthless tactician and was prepared to take the lives of innocents during the final stages of the battle on Argul, if doing so was the only way to achieve victory for the Confederacy."}, {"tag": "p", "text": "Hosh thought that the Jedi were brave and honorable people, and he also appreciated how important lightsabers were to members of their order. Yet, he considered the Republic to be corrupt and believed that by following the commands of Supreme Chancellor Palpatine, the leader of the Republic, the Jedi Order had forgotten that its true purpose was to maintain peace."}, {"tag": "p", "text": "During the campaign on Argul, Hosh wore a military uniform. Bilingual, he had the ability to speak both Basic and Pak Pak, the language spoken by the Neimoidians."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drogen Hosh was created by J.D. Wiker and appeared in the 2004 role-playing supplement Only the Force. In the supplement, the players role-play as the group of Jedi Padawans to which Hosh offers a cease fire. If Administrator Mozim, the highest-ranking Argullian official left on Argul, is present with the Jedi when they receive Hosh's message, the Argullian urges the players not to accept the commander's offer. If the Jedi do choose to accept Hosh's offer, they can then force Mozim to agree to surrender to the commander."}, {"tag": "p", "text": "If the players surrender to Hosh, the commander fulfills his promises. He travels to the docking tower and handles Argul's formal surrender, then presents his blaster to the Jedi and enters into their custody. Afterward, Hosh orders the Separatist forces to bring medical supplies, medical droids, and food to the mesa, and asks the Jedi and their clone troopers to disarm themselves in return. He then takes personal charge of the Jedi's lightsabers and promises to keep the weapons safe until the Jedi depart Argul. Hosh also tries to persuade the Jedi to join the Confederacy and, if any of the player characters agree to his suggestion, the commander arranges for them to be transported off of Argul before the arrival of the Republic transports and Master Yoda. Any of the Jedi who choose to join the Separatist cause are later introduced by Hosh to Count Dooku, the leader of the Confederacy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}