{"url": "Droid_control_program", "categories": ["Category:Legends articles", "Category:Droid programming"], "nodes": [{"tag": "h1", "text": "Droid control program"}, {"tag": "p", "text": "The droid control program was a piece of technology used to keep the Trade Federation Droid Army activated, kept in a brown crate. Five programs were sent to the planet Naboo during the Trade Federation's invasion, where one was stolen from the B1-Series battle droid OOM-14. It was later recovered by the droid OOM-9"}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The droid control program was a technological device that kept the Trade Federation Droid Army online. It was contained inside a brown cubed crate on top of a round base. The cube had indented sections on its faces that had white patterns of a plus sign overlayed on a circle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Trade Federation's invasion of the planet Naboo in 32 BBY, five droid control programs were sent with their invading army. One program was placed in the protection of the B1-Series battle droid Commander OOM-14, which was stolen from him by the Royal Naboo Security Forces team Force Command Two. The loss of the program rendered OOM-14's forces motionless at a Deactivated Camp, while the program was taken to a Research Center south of the Naboo city Harte Secur for analysis. Trade Federation Viceroy Nute Gunray was concerned that the Naboo would be able to duplicate the program and turn the army against the Trade Federation."}, {"tag": "p", "text": "The Federation also jammed Naboo communications around Harte Secur to prevent hackers from spreading a rogue program. Gunray charged his most trusted battle droid, OOM-9, with retrieving the program, providing a Neimoidian technician and a small task force of droids to complete the objective. The droids stormed the research center and killed the royal troopers there, afterwards collecting the program inside OOM-9's personal Armored Assault Tank, which the technician had occupied. Afterwards, the droids returned to the camp and reactivated OOM-14's army, and they went on to destroy Harte Secur."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The droid control program was first mentioned in Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide, released on November 7, 2001. It appeared and was identified in the LucasArts video game Star Wars: Galactic Battlegrounds, released on November 11, 2001. The program is the central focus of the second level of the Trade Federation campaign, \"Behind the Lines.\" The droid control program functions similarly to a holocron, in that only a specific unit can carry it, that being the Neimoidian technician instead of a Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}