{"url": "Droid_grenadier", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:B1 battle droid models", "Category:Trade Federation battle droid models"], "nodes": [{"tag": "h1", "text": "Droid grenadier"}, {"tag": "p", "text": "The droid grenadier was a Trade Federation B1-Series battle droid model that used thermal detonators for light anti-armor roles. They were used throughout the Invasion of Naboo in 32 BBY. Droid grenadiers were constructed at Trade Federation troop centers. Droid grenadiers were also used during the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Droid grenadiers were B1-Series battle droid units which carried mortar-like grenade launchers which fired thermal detonators. These units were effective against mechanical and shielded targets and were not as effective against buildings and non-mechanical targets. Droid grenadiers carried their mortars while walking and deployed it while still. Like the regular B1 they had black sensors. They were used by the Trade Federation during the Invasion of Naboo in the year 32 BBY. One unit was used in the opening stages of the invasion. 10 more accompanied the OOM command battle droid OOM-9 during the attack on the city of Spinnaker."}, {"tag": "p", "text": "More were built at Trade Federation Troop centers at the order of OOM-9."}, {"tag": "p", "text": "They continued to be used throughout the invasion until the Trade Federation Droid Army was shut down with the destruction of the Droid Control Ship."}, {"tag": "p", "text": "Later, in the Clone Wars, these units were used by the Confederacy of Independent Systems in conjunction with assault droids for light armor demolition. Following the execution of the Separatist Council by Darth Vader, these units were deactivated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "These droids appear in the 2001 video game Star Wars: Galactic Battlegrounds and its 2002 expansion pack. They were provided to the player (in the role of OOM-9) in two missions and more could be built in single- or multiplayer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}