{"url": "Droid_tri-fighter", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems starfighter classes", "Category:Droid starfighter classes", "Category:Droid tri-fighters"], "nodes": [{"tag": "h1", "text": "Droid tri-fighter"}, {"tag": "p", "text": "The droid tri-fighter was a model of droid starfighter utilized by the Confederacy of Independent Systems during the Clone Wars. It was specifically designed to engage and excel in heavy dogfighting. Despite being the smallest starship in both the Republic Navy and Confederacy navy, the tri-fighter was heavily armed, and possessed an advanced droid brain, which gave it an advantage when dealing with organic pilots. These droid brains were more advanced than those intergrated in various other droid starfighters manufactured for the Confederacy. Conceived for the total destruction of an enemy, it possessed an array of missiles and other armaments."}, {"tag": "p", "text": "A formidable opponent for clone pilots during the galactic-spanning conflict, the tri-fighter saw use at major engagements, including the Battle of Sullust, Battle of Dathomir, and Battle of Coruscant. At the end of the war, the tri-fighters were disabled when Darth Vader initiated a shutdown command, deactiavting all operational Separatist units. Five years after the conclusion of the Clone Wars, tri-fighters could still be seen harassing the nascent Galactic Empire under the command of dissidents, with one such cell being led by former Republic Intelligence official Berch Teller."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A standard tri-fighter measured 5.4 meters in length, making it the smallest starship in both the Separatist and Republic navies. A space-faring relative of the Trade Federation's dreaded droideka, the tri-fighter was designed with a sole purpose in mind: total destruction of their adversary. Developed for intense dogfighting and close-range space battles, the tri-fighter, unlike Vulture-class starfighters, featured more advanced brains than standard Separatist droid fighters, which made it harder for an enemy to second-guess the fighter's movements and tactics. These brains were engineered with basic heuristic processors. A unit was able to analyze, anticipate, and mimic an opponent's attack. The tri-fighter's predatory programming came from the Colicoids."}, {"tag": "p", "text": "Compact and heavily armed, the tri-fighter possessed four laser canons and discord missiles, which were located on its bottom. Support clamps were connected to its wing cannons, and one of the tri-fighter's weapons, the nose-tip laser cannon, was at the front of the fighter near its photoreceptors and port sensors. The droid starfighter also had a payload of proton torpedos, pistoeka sabotage droids, or concussion missiles. A radiation vent and cooling radiator were on its repulsorlift wings, and these wings were for flying in a planet's atmosphere. The droid also had three drive thrusters and a gyroscopic reactor core. To intimidate organic enemies, the fighter's three-armed design mimicked the skull of a ferocious and terrifying prehistoric predator native to Colla IV."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Early deployment"}, {"tag": "p", "text": "Manufactured by Phlac-Arphocc Automata Industries, tri-fighters served as part of the Separatist navy during the Clone Wars, a three year long conflict fought between the Separatists and Galactic Republic. The tri-fighter was deployed by the Confederacy military during the later period of the Clone Wars, seeing use by 20 BBY. At one point during the war, the tri-fighter designated DIS-347 critically damaged a Republic BTL-B Y-wing starfighter/bomber."}, {"tag": "p", "text": "In 20 BBY, during the Battle of Sullust, droid tri-fighters of Trident group one and group two served under Dark Acolyte Asajj Ventress in her fleet. During the fighting, Ventress, flying in her Ginivex-class fanblade starfighter, ordered the first team of tri-fighters to attack the starboard engines of the Venator-class Star Destroyer Resolute and had the second team to attack the port deflector shield generators. Ventress herself made a run for the Resolute's bridge. After a clone navigation officer aboard the Resolute reported the loss of the port deflectors, Ventress fired on the flagship, and this assault on the Resolute was able to cripple the vessel. Afterwards, Ventress, who was followed by several tri-fighters, moved to attack Jedi Generals Obi-Wan Kenobi and Anakin Skywalker."}, {"tag": "p", "text": "After Ventress hit Kenobi's Delta-7B Aethersprite-class light interceptor, the two Jedi split up, resulting in Ventress following Kenobi's starfighter, while the tri-fighters pursed Skywalker's fighter, which the Jedi General joked about. As three of the droid starfighters chased him alongside a Recusant-class Commerce Guild destroyer, Skywalker spotted three other tri-fighters at the other side of the warship. Skywalker used this to trick the three fighters behind him to crash into the other three. Skywalker then moved to help Kenobi, allowing Skywalker to blast Ventress's starfighter. Ventress and Kenobi then both had a crash landing in the Separatist command ship's hangar. Unfortunately for those on-board, Count Dooku, the Separatist Head of State, had been ordered by his Sith Master, Darth Sidious, to kill Ventress, so he ordered that TJ-912 fire on the command ship. After it was destroyed, Dooku ordered the Separatist fleet to withdraw. However, Ventress survived the attempt on her life and went to the planet of Dathomir, where she planned her revenge with the Nightsisters."}, {"tag": "h4", "text": "Further action"}, {"tag": "p", "text": "Tri-fighters later took part in the Battle of Lola Sayu as part of the Lola Sayu defense fleet. However, the Republic forces were able to escape the planet. They were also involved in the Battle of Umbara and fought alongside the Umbaran Militia. Despite the betrayal of Jedi General Pong Krell, the Republic managed to win the battle."}, {"tag": "p", "text": "Sometime after her plot to use Savage Opress against her former master failed, Ventress returned to Dathomir once again. Unbeknownst to her, Dooku learned this and ordered General Grievous, the ruthless Supreme Commander of the Droid Army, to annihilate the all of the Nightsisters. After the battle droids under Grievous's command had landed on planet, two tri-fighters and two Hyena-class Droid Bombers approached the Nightsister lair and fired. Eventually, the Separatists prevailed and wiped out Mother Talzin's clan, although Ventress, Mother Talzin, Merrin, and Shelish survived."}, {"tag": "p", "text": "Before General Kenobi could deploy Clone Commander CC-2224 \"Cody\" to pick up a group of Jedi younglings on the Crucible, a Separatist fleet under the command of General Grievous came out of lightspeed and attacked the Jedi's fleet. Republic forces began to be overrun, and tri-fighters flew alongside Grievous's Sheathipede-class transport shuttle during the battle. Grievous and a force of battle droids soon boarded Kenobi's flagship, the Negotiator, which ultimately made the Jedi General activate the Venator-class Star Destroyer's self-destruct."}, {"tag": "p", "text": "Later, the Separatists invaded the planet of Cato Neimoidia, prompting the Republic to launch a defense, with General Skywalker and his Padawan, Jedi Commander Ahsoka Tano, leading a starfighter squadron and bringing a group of Republic gunships. However, once they were into the planet's atmosphere, several tri-fighters were launched from a Providence-class Dreadnought, and three of the droids moved to attack the Republic starfighters. After taking out at least two Z-95 Headhunters, one of the tri-fighters launched buzz droid missiles, resulting in a number of the sabotage droids to land on Skywalker's Eta-2 Actis-class light interceptor. The droids forced his astromech droid, R2-D2, to crash land the ship on a cliff."}, {"tag": "h4", "text": "Ringo Vinda and Utapau"}, {"tag": "p", "text": "During the Battle of Ringo Vinda, droid tri-fighters were present in the Confederate held part of the Ringo Vinda space station, along with vulture droids and other combat droids, just as General Skywalker, Clone Captain CT-7567 \"Rex,\" and ARC trooper CT-5555 \"Fives\" launched a rescue mission to free clone trooper CT-5385 \"Tup,\" who was being transported on a Maxillipede shuttle to be taken for examination by the Sith. The three were able to successfully rescue the captured trooper."}, {"tag": "p", "text": "Later in the war, General Grievous and Count Dooku attempted an arms deal for a massive kyber crystal with Sugi arms dealers on Utapau. Eventually, Jedi Generals Kenobi and Skywalker arrived on Utapau and tried to stop Grievous, although the Separatists eventually took the crystal aboard a Maxillipede shuttle to bring it to a supply ship. The Jedi pursued the crystal using a freighter, but Grievous, using his personal starfighter Soulless One, and three tri-fighters chased after their ship. As they flew through a Separatist fleet, three vulture droids also began to pursue the Jedi. Kenobi took control of the weapons systems, however, and he managed to take out all three of the tri-fighters and one of the vultures."}, {"tag": "p", "text": "After the Maxillipede boarded the supply ship, Kenobi and Skywalker entered the ship using escape pods, and Skywalker had their freighter crash into the supply craft's hyperdrive to prevent a Separatist escape. Eventually, the two learned the crystal could refract and intensify energy sent into. Knowing this, when they brought the crystal to the ship's hangar, Kenobi made several Armored Assault Tanks fire at it. While they and Grievous escaped the doomed ship, the crystal overheated, ultimately sending out an energy wave that began to destroy other Separatist ships. After the wave started, three tri-fighters were flying near a Recusant-class destroyer, and at least two of the fighters were destroyed."}, {"tag": "h4", "text": "The final days"}, {"tag": "p", "text": "Tri-fighters were part of the battle on Lokori. Tri-fighters also participated in battles of the Outer Rim Sieges campaign, including a skirmish between a Republic and Separatist fleet that was led by General Grievous. The tri-fighters were being engaged by Z-95 Headhunters in dogfights over the Providence-class Dreadnoughts. Tri-fighters also participated during the Battle of Cato Neimoidia, during which they took on Jedi General Plo Koon and his wingmen. Tri-fighters were also present during the Battle of Yerbana, where they engaged Z-95 Headhunters and Republic gunships trying to provide support to Clone Commander CC-2224 \"Cody\" and the 212th Attack Battalion, who were under fire by Separatist ground forces. In the air, the tri-fighters launched surprise attacks over the Headhunters and gunships, weakening them. Nevertheless, the battle on Yerbana was still won by the Republic."}, {"tag": "p", "text": "They were also deployed during the Battle of Coruscant, a major Separatist strike against the Republic capital world under the command of Grievous. During the surprise attack, Grievous was able to land in the Executive District, capture the Republic's Supreme Chancellor, Sheev Palpatine, and take the chancellor to his flagship, the Invisible Hand. To rescue Palpatine, Jedi Generals Skywalker and Kenobi went to infiltrate the Invisible Hand. The elite Clone Flight Squad Seven was to escort them, and their V-19 Torrent starfighters were able to make a hole through the tri-fighters that attempted to stop their advance, although the squad lost two pilots. As the Jedi and clone trooper pilots were making their way to Grievous's warship, a tri-fighter took out a Aggressive ReConnaissance-170 starfighter. Several tri-fighters also chased after another ARC-170, making the clone pilot ask for help. While Skywalker wished to go back to help the pilot, Kenobi did not let him and insisted that they had a mission to do."}, {"tag": "p", "text": "After a tri-fighter managed to blast an ARC-170, one tri-fighter flew near the vulture droid that fired buzz droid missiles at the Jedi. Skywalker and Kenobi ultimately defeated the buzz droids and boarded the Invisible Hand. During their time aboard, Skywalker killed Count Dooku, Palpatine was rescued, Grievous abandoned the craft, and the starship crashed to Coruscant's surface. Grievous ordered all Separatist ships to retreat, but some vessels, including some droid starfighters, remained. Clone trooper pilots spent hours taking out leftover tri-fighters, vulture droids, and Hyena bombers. The battle also proved to be the Separatist's last grasp, as their fleet had been annihilated and Dooku was dead. Clone pilot CC-2237 \"Oddball\" later have a postmission summary, and he mentioned that Squad Seven's V-19s punched through the tri-fighters."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "A short time after the Battle of Coruscant, Chancellor Palpatine, secretly the Sith Lord Darth Sidious, transformed the Republic into the First Galactic Empire. Anakin Skywalker, now newly christened to be the Sith Darth Vader, had all Separatist droid units, and therefore their droid tri-fighters, shut down."}, {"tag": "p", "text": "During the ensuing Imperial Era, some tri-fighters continued to see use as part of the Free Ryloth Movement and Berch Teller's rebel cell."}, {"tag": "h3", "text": "Age of the New Republic"}, {"tag": "p", "text": "By the time of the skirmish aboard a cruiser stolen from the Pyke Syndicate by the mercenary Ledesmar, there was a collection of droid tri-fighters onboard the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars Battlefront II, the droid tri-fighter is in the \"Interceptor\" class for the Confederacy of Independent Systems faction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}