{"url": "Droid_tri-fighter/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Colicoid Creation Nest products", "Category:Confederacy of Independent Systems starfighter classes", "Category:Droid starfighter classes", "Category:Droid tri-fighters"], "nodes": [{"tag": "h1", "text": "Droid tri-fighter"}, {"tag": "p", "text": "The droid tri-fighter, also known as the tri-droid fighter or simply tri-fighter, was a deadly Confederacy droid starfighter designed as a fast, agile and powerful space-superiority starfighter, built to excel in dogfighting. It would be used in large numbers throughout the Clone Wars."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "The droid tri-fighter was designed by the Colicoid Creation Nest—makers of the deadly droideka—and manufactured by Colla Designs and Phlac-Arphocc Automata Industries. The droid's ridged, three-armed design was based on the skull features of a fearsome predator native to the planet Colla IV."}, {"tag": "p", "text": "The bracing arms surrounded the fighter's droid pilot housed in a rotating, gyroscopic core. The droid tri-fighter had three independent thrusters, providing it with great agility, and a powerful reactor and control/communications transceiver that gave the craft unusual range for a fighter drone."}, {"tag": "p", "text": "It was armed with one heavy laser cannon protruding from the central ball, and a light laser cannon for each of the three arms. They could fire independently or together and could slightly tilt on rails to improve its deadly aim. Two to six missiles of variable payloads were housed within each arm. The nose-like cannon made the droid tri-fighter similar in appearance to the DSD1 dwarf spider droid also used by the Confederacy."}, {"tag": "p", "text": "The droid tri-fighter was capable of deploying buzz droids via discord missiles fixed to the underside, and quickly became rival to the ARC-170 starfighter and the Alpha-3 Nimbus-class V-wing starfighter. Although it could not outrun the Eta-2 Actis-class interceptor favored by the Jedi, it was bulkier and more heavily armed, making it a challenge for even the best living starpilots to overcome."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The droid tri-fighter was introduced into the Confederate Navy relatively late in the conflict, and its usage would further deplete Trade Federation coffers. One of its first recorded uses was on Praesitlyn, where they fought against the T-19 starfighters of the Praesitlyn Defense Force. Tri-fighters were also deployed at Sullust, Saleucami, Dathomir and Belderone. It would prove troublesome for even Jedi pilots, as evidenced when three tri-fighters came close to overcoming Jedi ace Saesee Tiin before being taken out by Anakin Skywalker."}, {"tag": "p", "text": "Many tri-fighters fought during the Battle of Coruscant, where they destroyed ARC-170 squadrons. Swarms of them also fought in the battle within the city, harassing Jedi and clone pilots. Following the execution of the Separatist Council by Darth Sidious's new apprentice, Darth Vader, these units were de-activated. A few years after the Clone Wars, a Geonosian engineer by the name of Gizor Dellso discovered an old droid factory on Mustafar, and he re-activated the droids and created his own personal navy. When the empire discovered his plans, the sent the 501st Legion to stop his plans. Many tri-fighters fought with the 501st in space. Dellso was later killed and the factory was blown up. At least one derelict tri-fighter was located in an Imperial junkyard during the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The tri-fighter concept at one point included snap-on booster rockets that increased the ship's speed and range for a limited time. With the boosters, the tri-fighter were essentially fired from a capital ship like missiles. Once within closing distance of enemy starfighters, the tri-fighter would jettison its booster and continue with an accelerated attack. Given the visual chaos inherent in designing the opening space battle, George Lucas ultimately nixed the booster concept, as it contributed unnecessary clutter and confusion on the screen. In the Star Wars: Clone Wars animated series, a sleeker, more numerous variant of droid tri-fighters appear, armed only with a central cannon. These fighters swarmed the skies of Coruscant during the battle leading up to the third film. There is still discussion amongst fans as to whether this is a different variant of the droid tri-fighter or simply a design error in the cartoon, which has come into conflict with canon in some other areas. It may also simply be a stylistic interpretation of the movie design."}, {"tag": "p", "text": "In Star Wars: Battlefront II, the laser cannon is replaced with a chaingun and is depicted as requiring a pilot to operate. The latter is most likely for gameplay reasons."}, {"tag": "p", "text": "LEGO has also produced three models of the Droid Tri-Fighter, the first of which was released in early 2005, which held a Buzz droid in the core, where the droid brain should be, and the second was released in early 2010, with a Rocket Battle Droid in the core, the ball was used as a cockpit. In the instruction manuals and the commercial of the second model it is usually together with the 8088 ARC-170 Starfighter. In late 2014, the third model of this starfighter was released with a Buzz droid and battle droid for the core/cockpit. The set also included a security battle droid and Chancellor Palpatine. Unlike the 2010 version, which was based on its appearance in Star Wars: The Clone Wars, the 2014 version was based on its version from Revenge of the Sith.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}