{"url": "Drolen_Antig", "categories": ["Category:Legends articles", "Category:Wookieepedia Good article nominations", "Category:Males", "Category:Nalroni", "Category:Smugglers", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Drolen Antig"}, {"tag": "p", "text": "Drolen Antig was a Nalroni male smuggler and thief. Following the Galactic Empire's defeat at Endor in 4 ABY, he was involved in the theft and sale of stolen starship and weapons technology to Kuat Drive Yards. Antig stole that technology from Slayn & Korpil's facility in the Roche asteroid field and murdered his accomplices, dumping their bodies and thereby receiving the whole payout for the job. Antig's crimes put him on the radar of the New Republic General Airen Cracken, who was concerned that Kuat Drive Yards would use the technology to benefit the Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and smuggling career"}, {"tag": "p", "text": "A Nalroni male, Drolen Antig was born on the Outer Rim world of Celanon. He became a smuggler and con artist in his adult life, and worked—and survived—smuggling routes such as the Kessel Run, the Sisar Run, and the Sanrafsix Corridor. By the age of thirty-two, Antig had smuggled a diverse variety of goods including spice and jellied canron, as well as ferried weapons to a Rebel Alliance cell in Corint City on the Outer Rim planet of Pirik. Antig also worked with a group of Advosze thieves during a job on the Core World of Fresia. He ran with a crew of thirty lowlifes and criminals, who were loud and crude but worked well together—however, none of them entirely trusted the Nalroni. At one point, Antig stole a pair of trousers from a Corellian."}, {"tag": "h3", "text": "A lucrative contract"}, {"tag": "p", "text": "Following the Galactic Empire's defeat at Endor in 4 ABY, Antig returned to his homeworld of Celanon, where he relaxed for a while before returning to smuggling. Before long, Antig was contracted by starship and walker manufacturer Kuat Drive Yards. The corporation needed new technology to optimize much of its output as the Galactic Empire lost—and therefore needed—more ships. Antig was recruited to obtain that valuable resource, so he set out on a recruitment drive of his own."}, {"tag": "p", "text": "According to rumors circulating around the bar scene, the group of Advosze thieves with whom Antig had collaborated with on Fresia was planning a heist on the Mid Rim Roche asteroid field, which had allied itself with the ascendant New Republic. The criminals needed a transport, so Antig offered them passage on his own ship, the Etti Lighter Trustworthy."}, {"tag": "p", "text": "Antig arranged a deal with his old accomplices; they would infiltrate the hives of the manufacturer Slayn & Korpil, steal valuable items, and sell them to Kuat Drive Yards on the Core World of Kuat for a substantial remuneration. The heist was a success, with the Advosze acquiring valuable items—namely, various weapons systems and a set of gyroscopic stabilizers used in the B-wing starfighter, the latter of which were a highly-guarded technological secret—but Antig and some of his crew killed the Advoszec shortly before landing on Kuat, and later jettisoned their bodies in the nearby Relarr system in the Core. Having done away with the thieves, Antig stood to receive the full payment from Kuat Drive Yards for delivering the technology."}, {"tag": "h3", "text": "Wanted by Cracken"}, {"tag": "p", "text": "New Republic forces were quick to act and attempted to locate and detain Antig, who had been spotted operating alone in the Ethav Regions in Wild Space after the heist. Furthermore, the New Republic resolved to retrieve the stolen components before Kuat Drive Yards could use the technology in designs for the Empire; efforts were made to organize a SpecForce infiltration mission into Kuat Drive Yards to recover the equipment, but such a dangerous endeavor would take time to prepare."}, {"tag": "p", "text": "The situation was fueled by the New Republic's fears that Kuat Drive Yards would use the technology to develop a new Imperial assault starfighter using the materials sold to them by Antig. Antig and his actions—as well as the threat they posed—were detailed by New Republic General Airen Cracken within the datafile Wanted by Cracken in an entry dedicated to Antig. The entry also detailed Antig's crimes, which included smuggling, being an accessory to smuggling stolen goods, murder, treason, theft of New Republic military property, and aiding Imperial forces. Cracken also offered a reward of twenty thousand credits for Antig's capture, describing his actions as despicable."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Streetwise and sneaky, Antig was a highly dangerous and self-interested being. Not above the act of murder to get what he wanted, he killed all of his accomplices so as to receive the entire reward amount from the heist at Roche. A middle-aged Nalroni male standing at 1.6 meters, Antig had gray fur—mistakenly referred to as orange-red by Cracken's dossier—and was missing several teeth by the time he was spotted in the Ethav Regions some time after the Roche operation; those were believed by Cracken to have been lost in a struggle with one of the Advoszec he murdered."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Antig was a cunning haggler and a seasoned gambler. In addition, he possessed reasonable engineering and piloting skills—his main specialty was the Etti Lighter—as well as knowledge of languages and star systems. Brawling and slicing were also in his skillset."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Antig carried a blaster carbine and pistol, as well as a comlink and datapad. He also carried seven hundred credits on him, and wore a green jacket over a webbed string vest. Completing Antig's ensemble was a pair of trousers stolen from a Corellian; the trousers featured the broken gold streak of the Second Class Corellian Bloodstripe. Several rings adorned the fingers of his right paw."}, {"tag": "p", "text": "Antig also piloted the Etti Lighter Trustworthy, which was believed by Cracken to have been stolen from the Corporate Sector Authority some time before Antig came to the New Republic's attention. The ship served Antig well during his ownership of it due to its large cargo capacity and ample weaponry."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drolen Antig was introduced in the \"Wanted by Cracken\" segment—an expansion of the original Wanted by Cracken reference book—in the tenth issue of the Star Wars Adventure Journal magazine published by West End Games and released in May 1996; the segment was written by Craig Robert Carey and illustrated by Kathy Burdette."}, {"tag": "p", "text": "Originally pictured in monochrome, Antig was fully colored in the featurette \"Featured Artist: Kathy Burdette\" in Star Wars Adventure Journal 11 released in November 1996. In the featurette, however, he was depicted with gray fur, contradicting the \"orange-red\" color described alongside his first mention. This article assumes that the illustration in Adventure Journal 11 depicts Antig's correct fur color."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}