{"url": "Drom_Guldi", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Baron Administrators", "Category:Humans", "Category:Hunters", "Category:Males"], "nodes": [{"tag": "h1", "text": "Drom Guldi"}, {"tag": "p", "text": "Drom Guldi, a Human male, was the Baron-Administrator of the Kelrodo-Ai gelatin mines, and a big-game hunter. In 12 ABY, Guldi went on a hunting expedition run by the former stormtrooper Burrk in search of wampas on Hoth. However, things turned disastrous when the wampas killed several members of the group and destroyed their starship. Guldi, his aide Sinidic, and Burrk and his assistants Nodon and Nonak were able to escape to Echo Base, a former base used by the Alliance to Restore the Republic. After four days of hiding in the base, Jedi Master Luke Skywalker and his partner Callista Ming arrived on Hoth. They discovered the survivors in Echo Base and promised to help them. However, the wampas damaged Skywalker's ship and attacked again, chasing all of them into Echo Base. The wampas were then able to break into the base and kill most of the group, including Guldi."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Drom Guldi was the Baron-Administrator of the Kelrodo-Ai gelatin mines, a planet known for its water sculptures. Guldi enjoyed hunting, and in 12 ABY, he decided to join an expedition run by the former Imperial stormtrooper Burrk to hunt wampas on Hoth. Along with Burrk, his assistants, and three other clients, Guldi and his aide Sinidic headed to Hoth, where they expected to kill many of the beasts. Guldi enjoyed success early in the hunt, killing ten wampas before disaster struck: the creatures banded together and attacked the group, killing two guides and the other three clients, and chasing them into the abandoned Echo Base, a former Rebel base."}, {"tag": "p", "text": "The survivors—Burrk, Guldi, Sinidic, and the Cathar brothers Nonak and Nodon, who were assistants to Burrk—were able to lock themselves in the base. The prospect of long-term survival appeared unlikely, though, as the wampas had destroyed their ship and continued to try to force their way into the base. However, the group was able to rig the old laser cannons to fire at anything that moved, scaring the wampas off."}, {"tag": "p", "text": "Four days later, the Jedi Luke Skywalker and his lover Callista Ming arrived on the planet as part of their mission to help Ming touch the Force. After noticing a ruined starship, they made their way to Echo Base, where the automatic laser cannons began firing on the two. Skywalker destroyed the cannons with his lightsaber before Guldi and the group could shut the turrets off. The group then came outside, telling the duo to come inside before the wampas returned. Once they made it inside the base and the doors were sealed, Guldi and Burrk explained what had happened to Skywalker and Ming. Wanting to help, Ming and Skywalker offered to send a distress signal from their ship. Armed with depleted blaster rifles, the group headed to the ship, only to find that the wampas had forced their way inside and damaged it, preventing them from transmitting a message or lifting off."}, {"tag": "p", "text": "As they examined the wreckage, the group was attacked by several wampas, who were led by a one armed wampa. Though Nonak was killed, the rest of the group managed to make it back to Echo Base with the wampas right on their heels. Once inside the base, they sealed the doors, keeping the wampas locked out. Though the beasts attempted to force their way in by breaking down the doors, Guldi was confident that they would be unable to enter. After their near-death experience, they took time to rest and checked their weapons. Both Burrk's and Nodon's blasters were out of power, and Guldi's held only ten shots."}, {"tag": "p", "text": "Skywalker and Burrk sorted through the wreckage left in the base after the Imperial attack nine years earlier, attempting to build a useful weapon. Guldi instructed Sinidic to sort through a nearby supply room in hopes of finding food to calm their nerves. However, shortly after Sinidic entered the room, he let out a scream, and a wampa burst through the supply room door. Guldi quickly shot it dead, although it had already killed Sinidic. Guldi then took one of its tusks as a prize, claiming that he had avenged Sinidic."}, {"tag": "p", "text": "Shortly after this, the wampas were able to destroy the power generator, causing the lights to dim. Several minutes later, a side wall collapsed suddenly, and a group of wampas came bounding into the room. They quickly killed Nodon and Burrk, and then turned on Guldi, who had just seven shots remaining in his blaster. Once he had fired all of his shots, he threw the blaster aside, and, armed with only a makeshift spear, let the wampas attack him. He died laughing. Ming and Skywalker managed to escape Echo base, were the only survivors of the attack."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Skywalker considered Drom Guldi a natural leader, noting that, though Burrk had been in charge of the hunting trip, the group deferred to Guldi. He was able to calmly issue orders, and avoid panicking despite the fact that it was very likely that the group would not survive. He was realistic, and unlike the other survivors of the hunting party, was able to accept the possibility of death. Though Guldi fought hard to survive, he knew when he was beaten, and was able to acknowledge that it was likely he would die. The Human was also courageous and, unlike Sinidic, remained relatively composed when under attack. He was able to rationally think about the situation and what could be done to help improve it, although ultimately he was killed. Once his weapon ran out of power, Guldi was willing to die, having accepted that he would not escape. He died taunting the creatures."}, {"tag": "p", "text": "Guldi greatly enjoyed hunting and was an able hunter, as he killed more than twelve wampas. He signed up for the hunt, despite its risks, because he desired to hunt wampas, a species considered very dangerous."}, {"tag": "p", "text": "Skywalker considered Guldi to be tall and muscular, with broad shoulders, and hardened eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Drom Guldi was created for Kevin J. Anderson's 1995 novel Darksaber. He was later given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}