{"url": "Dromboid", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Amorphiians", "Category:Educators", "Category:Males", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Dromboid"}, {"tag": "p", "text": "Dromboid was an Amorphiian male who worked for an Amorphiian company that distributed technologies around the galaxy. He hosted an instruction cassette video that accompanied a brand of mini-transmitter sold outside the company's base in the Amorphiia system."}, {"tag": "p", "text": "On Life Day in 1 ABY, Lumpawarrump, a young Wookiee on the planet Kashyyyk, attempted to assemble a mini-transmitter by viewing its instruction cassette. However, because Dromboid suffered from the power fluctuations typical of his species, the methodical and often-interrupted instructions frustrated the Wookiee as much as they helped him."}, {"tag": "p", "text": "A fastidious representative of his species, Dromboid spoke with an even and emotionless keel, yet purported to appreciate beauty. Although his malfunctions often impaired his motor abilities, the Amorphiian taught with efficiency and never acknowledged his failures."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Amorphiian representative"}, {"tag": "p", "text": "Dromboid was a male citizen of the Eidoloni sector planet Amorphiia who represented a company based in the Amorphiia system. The company sold various technologies throughout the galaxy, one such product being a model of mini-transmitter."}, {"tag": "p", "text": "On Life Day in 1 ABY, the young Wookiee Lumpawarrump from the planet Kashyyyk acquired an unassembled mini-transmitter from the Amorphiian company. The package included an instruction cassette video hosted by Dromboid."}, {"tag": "h3", "text": "Assembling the mini-transmitter"}, {"tag": "h4", "text": "Unconventional instructor"}, {"tag": "p", "text": "In the video, Dromboid—holding a mini-transmitter—thanked the viewers for selecting the Amorphiian brand, assuring that the mini-transmitter would provide many years of fun and valuable service, given that the product was assembled properly. As the Amorphiian finished his introduction, the forefinger of his right hand went limp due to a power loss, and he nudged it back to life with his nose before continuing. Flipping switches on the mini-transmitter and preparing to begin, Dromboid lost power to his left leg, so, twitching, he patted it back into motion."}, {"tag": "p", "text": "Setting the mini-transmitter on a table, he began searching for the tools necessary for the assembly. As he reached for the small, clear plastic bag containing the instruments, the Amorphiian's elbows locked at a closed angle, so, embarrassed, he began to flap his bent arms to unlock the joints. Arms again working, Dromboid picked up the sealed bag, which he suggested not to rip, as it would be useful for storage."}, {"tag": "p", "text": "Removing a screwdriver-like tool, the Amorphiian warned the viewers about its sharp edges, demonstrating the danger by pretending to prick his finger, saying \"ouch,\" and smiling. However, Dromboid's mouth became stuck in the smiling position, so he twisted the tool underneath his chin, readjusting his smile and producing a popping sound when done."}, {"tag": "h4", "text": "Technical difficulties"}, {"tag": "p", "text": "Next, Dromboid picked up a circuit-breaker module, insisting the use of its proper name. While emphasizing the word \"module,\" his mouth froze, so Dromboid rapidly clicked his tongue and rubbed his forehead to reactivate his speech. Operational once again, the Amorphiian reminded the viewers that all ten thousand of the circuit-breaker module's terminals must be paired with wires of corresponding colors. As he began to demonstrate the build, Dromboid's eyes temporarily crossed and drifted upwards, and the instructor then recommended that the assembly be done slowly and methodically."}, {"tag": "p", "text": "Running out of time left in the video, Dromboid began the complicated assembly of the impulse-to-voice translator, a component he described to be the heart of the mini-transmitter, as it was responsible for converting the electronic energy into a recognizable language. Noting that viewers should stay alert for the procedure, the Amorphiian expressed the importance of endurance and concentration to utilize the full capacity of their brains. As Dromboid finished speaking, he suffered another power fluctuation, making him collapse down to the table, place a finger to his nose, and fall to the floor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male member of the humanoid Amorphiian species, Dromboid had light-colored skin, blue eyes, and gray hair. Due to his Amorphiian physiology, Dromboid often suffered from power losses that impaired his motor abilities. The malfunctions had a variety of consequences, including the freezing of joints and muscles, voice alterations, and whirring noises."}, {"tag": "p", "text": "Although they would spontaneously interrupt his speech or actions, Dromboid corrected his impairments by various means, such as cranking his arms, nudging his nose, clicking his tongue, and rubbing his forehead. Throughout the instruction cassette owned by Lumpawarrump, Dromboid was halted by numerous power fluctuations, which frustrated the young, anxious Wookiee."}, {"tag": "p", "text": "Despite his breakdowns, Dromboid was a smart and efficient instructor. Whenever power failures occurred, he would make no mention of them, simply correcting the problem and resuming his speech or action. The Amorphiian also practiced a methodical work ethic, believing that doing a job well was worth the extra time."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As the host of the mini-transmitter instruction cassette, Dromboid guided viewers through the different tools and components—most notably the circuit-breaker module and the impulse-to-voice translator. In the cassette, the Amorphiian wore a white, collared shirt under a tan, dark-trimmed jacket. Over the jacket was a large-buckled belt, which was matched with a pair of black pants."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Dromboid was created for The Star Wars Holiday Special, a television film that aired on CBS in the United States on November 17, 1978, for the first and only time. In the Holiday Special, Dromboid appears in a four-minute-long comedy sketch preceding a commercial break. In the scene, Dromboid is portrayed by comedic guest star Harvey Korman of The Carol Burnett Show, who also played the character Gormaanda in a prior sketch and the character Krelman in the following one."}, {"tag": "p", "text": "The purposed humor of Dromboid's scene, referred to in the script as the \"Harvey Korman 'Dromboid' segment,\" is that his constant malfunctions prevent him from giving timely instructions to Lumpawarrump, which angers the young, eager Wookiee. To accomplish the filming of these malfunctions, clips of Korman were edited to create stutters, spasms, and vocal changes. The Holiday Special's fourth draft compares Dromboid's demeanor to those of Milton Cross and Bergen Evans, a radio announcer and educational television host, respectively. However, in the time since the film aired, Dromboid's quirky behavior has been likened to that of Max Headroom, the erratic titular character of The Max Headroom Show, a comedy talk show that aired nearly a decade later."}, {"tag": "p", "text": "Although Dromboid is not identified by name in the film, the name is used throughout the Holiday Special's fourth-draft script. The name Dromboid was later confirmed as canon within the Star Wars Legends continuity by Alex Newborn's 2008 article, \"I Have a Bad Feeling About This!,\" published in the 106th issue of Star Wars Insider magazine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}