{"url": "Dromund_Fels", "categories": ["Category:Legends articles", "Category:Desert planets", "Category:Sith Empire planets", "Category:Sith Worlds"], "nodes": [{"tag": "h1", "text": "Dromund Fels"}, {"tag": "p", "text": "Dromund Fels was an arid planet that occupied the fourth orbit around the star Dromund in the Dromund system, a star system in the Sith Worlds within the Outer Rim Territories's Esstran sector. Orbited by one moon, the planet was under the control of the Old Sith Empire before its collapse, and the reconstituted Empire carried out a number of archaeological excavations on Dromund Fels thousands of years later."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Dromund Fels was the fourth planet in the Dromund system, a star system within the Sith Worlds—the region of the Outer Rim Territories's Esstran sector that lay within the Stygian Caldera nebula. An arid world that could sustain life, Dromund Fels was orbited by a single moon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Dromund Fels was controlled by the Old Sith Empire before its collapse, and sometime during the Empire's history, a number of slaves rebelled against their masters. The reconstituted Empire reclaimed the planet sometime before 3954 BBY, and by that year, Darth Igrol—a member of the Empire's ruling Dark Council—resided on Dromund Fels. The Sith Lord Darth Marr uncovered the lightsaber of the ancient Sith Tulak Hord on Dromund Fels sometime before 3678 BBY, and the planet was the site of several excavations by the archaeologists of the Imperial Reclamation Service over the following decades. One of the Reclamation Service's discoveries was a oubliette, a tomb of a Sith prisoner that had been imprisoned with a large number of Sith artifacts and treasures. Another excavation uncovered the remains of rebellious slaves who lived during the time of the old Empire. The planet also hosted a significant criminal presence by the time of the Cold War between the Galactic Republic and the Empire, Anti-Imperial rebels were active on Dromund Fels during the Cold War, operating with the aid of the Exchange crime syndicate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First introduced in the online article \"The Dark Forces Saga\" in 2005, Dromund Fels was not mentioned again until 2011-2012, when it received several mentions in various material within the metaseries surrounding the BioWare-LucasArts video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}