{"url": "Dromund_Kaas_wilderness_campaign", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of Dromund Kaas", "Category:Conflicts involving the Sith Empire"], "nodes": [{"tag": "h1", "text": "Dromund Kaas wilderness campaign"}, {"tag": "p", "text": "Shortly after their arrival on Dromund Kaas, the people of the reborn Sith Empire launched a campaign to clear a wilderness region on the planet. The effort was conceived and organized by the founder and first leader of the Imperial Military, Odile Vaiken. Vaiken led a newly-formed army of Imperial revivalists into the jungle wilds of the untamed Dromund Kaas, carving into the habitats of native animal species and clearing the way for the Sith to gain a secure foothold on the world. When the project reached completion, the Imperials had cleared enough of the wilderness to allow for their leaders to begin building a new capital that would later come to be known as Kaas City."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 5000 BBY, the Galactic Republic defeated the Dark Lord of the Sith Naga Sadow and his great Sith Empire at the close of the Great Hyperspace War. Although the war had broken the backbone of the Empire and its people, the Republic's Supreme Chancellor Pultimo insisted that his forces continue their assault against the Sith in order to fully eliminate any vestigial threat posed to the safety of the Republic. Fearing persecution, a group of Imperials fled from their homeworld of Korriban and the rest of Sith space to seek asylum with the surviving Sith Lord known as Vitiate elsewhere in the galaxy. Under the leadership of Vitiate, who quickly declared himself the undying Sith Emperor, these survivors traveled hyperspace for twenty years before discovering the lost planet Dromund Kaas in 4980 BBY. The jungle world had once played host to a Sith colonization effort, but had long since been forgotten. The Sith Emperor accepted Dromund Kaas as the capital for a new Empire that could one day challenge the Republic, but simultaneously retreated into the shadows while his Dark Council of Sith Lords managed the building of the new government."}, {"tag": "p", "text": "One of the first priorities set out for the Great Hyperspace War survivors was the taming of Dromund Kaas. The planet was a jungle wilderness teeming with aggressive wildlife that would need to be cleared before building could begin. To accomplish the task, the Dark Council looked to Odile Vaiken, a Force-deaf Human male who had accepted the responsibility of forging a new Imperial Military for use by his Sith overlords. After drafting every able-bodied adult into a fledgling army, Vaiken created an intense training regimen to bring his forces up to fighting conditions. Once his army was organized and trained, Vaiken began to execute his masters' plans to secure Dromund Kaas."}, {"tag": "h2", "text": "The campaign"}, {"tag": "p", "text": "With his newly-trained army of Imperial soldiers, Vaiken marched into the jungles of Dromund Kaas and began poaching the native animals and clearing the forests. Clad in black armor and wielding blaster rifles, the troops engaged and killed many yozusks and other creatures. Vaiken himself participated in the combat and personally fought a large, rabid terentatek beast. Although the animal nearly got the upper hand, Vaiken managed to slay the terentatek and claim the region on behalf of the Empire."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With a vast swath of the jungle cleared, Imperial builders were able to move in and begin construction on a new capital for a revived Sith Empire. The metropolis that sprang up in the area was named Kaas City and was centered around a massive building dubbed the Imperial Citadel, which was built over the site of Vaiken's clash with the terentatek. While the Emperor and Dark Council ruled their new dominion from the city, Vaiken went about the business of enhancing their military."}, {"tag": "p", "text": "The Human helped to design a new class of Star Destroyer and harnessed the strength of the Imperial people to build a new naval armada from scratch. Vaiken's work was hugely successful, and his new army and navy were tasked with expanding the boundaries of the Emperor's reign by conquering the worlds surrounding Dromund Kaas. Vaiken's work in building military strength for the Sith earned him the favor of the Dark Council and the Emperor himself, who proclaimed Vaiken to be the first Grand Moff of the new Empire. Over a millennium later, in the aftermath of the Imperial Military's victory in the Great Galactic War, the Jedi Master Gnost-Dural recorded a holovid that traced the beginning of the reconstituted Sith Empire and Vaiken's efforts on Dromund Kaas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Sith Empire's campaign to clear the wilderness of Dromund Kaas had its first and only appearance in the eleventh entry of the Galactic Timeline. The Timeline, an online video feature, was created to provide information on background lore in the BioWare/LucasArts video game, Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}