{"url": "Dron", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Republic Navy admirals"], "nodes": [{"tag": "h1", "text": "Dron"}, {"tag": "p", "text": "Dron was a Human male admiral in the Republic Navy during the Clone Wars. In the early stages of the conflict, he served with Jedi Generals Keelyvine Reus and Kit Fisto during an expedition to the vital agriworld of Ukio. The world was of major importance to the Galactic Republic, as it supplied food to the Grand Army of the Republic as well as to the entire Abrion sector, and the expedition was tasked with securing the planet's allegiance in order to aid the war effort. Dron and his fleet held station over Ukio at General Reus's behest, and watched for any suspected Confederate activity. Soon, Dron's men detected a lone enemy battleship approaching the planet."}, {"tag": "p", "text": "The Jedi investigated and discovered that the enemy was deploying a dark, cloudy substance that adhered to Ukio's planetary shield. Fisto was able to collect data, which he transmitted to Dron, and the admiral subsequently had his men analyze the material. Captain Pharl McQuarrie determined that it was Moorjan soil, which was electromagnetic and photo-sensitive. Essentially, the cloud would leave Ukio's crops in perpetual night. The admiral then worked with General Reus to avert the disaster, and although Ukio was successfully defended by the Republic, it was later purchased by Magistrate Passel Argente of the Confederacy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Onward to Ukio"}, {"tag": "p", "text": "Dron was a Human male who served in the Grand Army of the Republic. During the Clone Wars, a galaxy-wide conflict between the Galactic Republic and the Confederacy of Independent Systems, Dron served as an admiral, and was assigned to work with Jedi Generals Keelyvine Reus and Kit Fisto. Reus's Padawan learner, Tyzen Xebec, also served in the task force. In the early stages of the Clone Wars, a fleet commanded by Reus, consisting of a Venator-class Star Destroyer and two Consular-class frigates, was dispatched to Ukio—a vital agriworld that supplied the Republic with victuals for its clone trooper units."}, {"tag": "p", "text": "Dron informed Reus when the fleet entered the system, and Reus in turn instructed the admiral to have the frigates form a sentry line, before initiating a yellow alert. Later, Dron joined Reus, Fisto, and Xebec for a briefing from the Jedi Temple on Coruscant. Jedi Masters Obi-Wan Kenobi and Mace Windu provided those gathered with the background of their mission. In addition to being vital to the Republic effort, Ukio also supplied the entire Abrion sector, as well as the worlds along the Triellus Trade Route, making it a holding of great significance. Prior to the war, Ukio had seceded from the Republic, but Jedi Master Yoda had been able to keep the act from being completed by calling in a personal entreaty."}, {"tag": "p", "text": "However, the citizenry of Ukio remained divided, and Kenobi warned that the situation was ripe for interference from the Confederacy. Though the planet was defended by a powerful planetary shield, Kenobi aired his concerns to Dron and the others: he was puzzled by the fact that no Confederate fleets had been detected within the vicinity, as Clone Intelligence was sure Ukio was attracting enemy attention. Windu ordered the Generals to perform reconnaissance on the planet itself, while Dron and the fleet were to hold station above Ukio."}, {"tag": "h3", "text": "A disturbance"}, {"tag": "p", "text": "Dron summoned Reus and Fisto when the Ukian satellite network detected a disturbance on the other side of the planet. The Ukian data was quickly resolved, leading to the discovery of a Confederate Lucrehulk-class battleship over the horizon. Dron quickly identified the ship as a lightly armed carrier, and Reus found the presence of a single ship to be suspect. The Jedi determined that it might be a Confederate ploy to lure the Republic fleet to the other side of the planet, as the lone battleship could not hope to damage Ukio's planetary shield. Reus ordered Dron to continue to hold station at his current position while she and Fisto performed reconnaissance duties in their Delta-7B Aethersprite-class light interceptors."}, {"tag": "p", "text": "The Jedi discovered that the battleship was deploying modified seismic tanks, which were in turn unleashing a black, cloudy substance onto Ukio's planetary shield. Fisto was able to run a diagnostic of the material and send the data back to Dron. The admiral then forwarded the material to the other ships of the fleet, while the Confederate craft began to jam most frequencies, making it difficult for Reus to communicate with Dron. However, Captain Pharl McQuarrie, who served under Dron, had made a discovery as the Jedi made their way back to the flagship. By the time Reus and Fisto had made it back to the Star Destroyer, Dron was able to set up a conference with McQuarrie, who had discovered that the substance was in fact the electromagnetic soil of Moorja which clung to the Ukian planetary shield. Although the soil did not damage the shield, it was photo-reactive, meaning that it moved in tandem as the planet orbited its sun—essentially, it would continually cause an eclipse on Ukio, perpetually blocking out all sunlight and preventing the survival of the crops."}, {"tag": "p", "text": "Dron and the two Jedi opened communications with the most senior official on Ukio, the Ukian liege, and Reus informed him of the situation. He was furious, and urged the Jedi to find a solution, as the loss of any more sunlight could potentially ruin the crops. The liege came to the conclusion that they could lower the shields, but Reus strongly cautioned against such an action, as it was likely precisely what the Confederacy wanted. Captain McQuarrie informed Dron and the others that opening the shield briefly would scatter the substance to the Ukian winds, and Reus relented, advising the liege to create an opening in his shields within fifteen minutes, for as short a time as possible, to dissipate the cloud of soil. Dron was ordered by Reus to move the fleet to engage the Confederate battleship, in synchronicity with the scheduled lowering of the shield. It was Reus's hope that they would be able to prevent any Confederates from breaching the shield while it was disabled. He was also reminded by the Jedi that they would not be able to communicate due to the level of jamming taking place, so their timing would be critical."}, {"tag": "p", "text": "The ploy worked, although the Confederate forces led by the enemy mastermind \"Doctor\" managed to land on Ukio and cause a considerable amount of havoc. The enemy battleship was eventually destroyed by Dron's forces, allowing Reus to land on the planet and assist Xebec in eliminating the enemy threat. The Republic won a tactical victory, repelling the Confederate efforts to render Ukio useless. However, the continual turmoil surrounding the planet brought Ukian stocks down severely, allowing Magistrate Passel Argente to buy a controlling interest, bringing the planet under Confederate control and forcing the Republic to depart."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When faced with an incoming hostile such as the Lucrehulk-class battleship that approached Ukio by itself shortly before the battle at Ukio, Dron was able to quickly identify the ship's type and its level of armament. He also had little understanding of complex scientific terms, and was baffled when Captain McQuarrie provided a detail description of the properties of Moorjan soil. Dron had black hair, although his temples were graying, and also possessed brown eyes and dark skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dron first appeared in the webcomic The Clone Wars: Act on Instinct, which was written by Pablo Hidalgo and published in 2009. The comic's art was done by Tom Hodges, Grant Gould, Jeffery Carlisle, and Daniel Falconer. Dron was introduced in the fifth installment of the comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}