{"url": "Dromund_system", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Esstran sector star systems"], "nodes": [{"tag": "h1", "text": "Dromund system"}, {"tag": "p", "text": "The Dromund system, also known as the Dromund Kaas system, was a star system in the Outer Rim Territories's Esstran sector that lay within the region of space known as the Sith Worlds. A five-planet system that contained a single star, Dromund, the Dromund system was historically associated with various Sith organizations. While two of the system's planets, Dromund Ixin and Dromund Tyne, were barren and a third, Dromund Kalakar, was a gas giant, the two other worlds—the arid Dromund Fels and the terrestrial Dromund Kaas—could support life, and Dromund Kaas served as the capital of the reconstituted Sith Empire for over a thousand years. However, the Dromund system was largely unknown to the galaxy at large throughout most of history."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Dromund system was a star system located in the Sith Worlds, a region of the Esstran sector in the Outer Rim Territories. The system contained one star, a yellow sun named Dromund, and five planets: Dromund Ixin, Dromund Kalakar, Dromund Kaas, Dromund Fels, and Dromund Tyne. Located within the Stygian Caldera nebula, the Dromund system was connected to Bosthirda and Jaguada by the Kamat Krote hyperlane. The Sith Emperor of the reconstituted Sith Empire maintained a personal space station in orbit over Dromund Kaas for much of his reign, though the Sith Lord Darth Malgus stole the space station after the Emperor's supposed death and moved it to the Ilum system. The Stygian Caldera nebula was visible from within the star system, painting the fabric of space a reddish-brown color."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Dromund system was discovered by the Sith Empire, the civilization of the Sith species from the planet Korriban, sometime before the year 6900 BBY. Dromund Kaas was colonized by the Empire early in its history, and the Sith Lord Tulak Hord conquered the Dromund system with his Dashade servant Khem Val during his lifetime before he performed a ritual of Sith magic in the system.[source?] However, the colony and the entire system were eventually lost to history along with the Kamat Kroke route by the time of the Great Hyperspace War with the Galactic Republic in 5000 BBY. The system was rediscovered by researchers on the planet Nathema under the orders of the Sith Lord Vitiate in 4999 BBY, and he led the remains of the shattered Sith civilization on a exodus from Korriban that lasted nearly twenty years before ending in the Dromund system. On Dromund Kaas, Vitiate—now the immortal Sith Emperor—reconstituted the Empire, and the star system became the epicenter of the new civilization."}, {"tag": "p", "text": "In 3642 BBY, the Jedi Knight Jomar Chul scouted the Dromund system in order to determine the defense of the Emperor's space station, and though he was forced to flee the system to escape Imperial starfighters, his data was used by a Jedi strike team to infiltrate the system and confront the Emperor aboard his space station. In 3640 BBY, during the Galactic War between the Republic and the Empire, the Dromund system was the site of a battle between the Republic Navy and the Empire's First Defense Fleet. The Republic Navy's attack was a distraction so that the Jedi Knight known as the Hero of Tython could infiltrate Dromund Kaas and eliminate the Emperor, and the Republic fleet withdrew to the Core Worlds after the Jedi succeeded in the operation."}, {"tag": "p", "text": "By the year 2000 BBY, the Dromund system was once more abandoned, and though Dromund Kaas was the site of a battle in 1004 BBY between the Jedi Order and the Sith Brotherhood of Darkness, the system remained uninhabited until sometime after 990 BBY, when the rogue Sith Lord Darth Millennial fled to Dromund Kaas and established the Dark Force religion there. The Dark Force's followers, the Prophets of the Dark Side, ruled the few inhabitants of Dromund Kaas and remained unknown to the galaxy at large until 22 BBY, when the Sith Lord Darth Sidious discovered the Prophets on Dromund Kaas. Shortly before that time, a Human attempted to start a revolt against the Prophets, though he was killed. As a result, his son Roly Melusar developed a strong hatred of Force-sensitives, and he told anyone who asked him that the Dromund system was a myth. The system and its planets were believed to be mythical by the galaxy at large, but the Jedi Grand Master Yoda confirmed the system's existence during the Clone Wars between the Republic and the Confederacy of Independent Systems, and the Republic's 327th Star Corps fought a battle on Dromund Kaas during the conflict."}, {"tag": "p", "text": "In the decades that followed, the system was visited at least twice by members of the New Jedi Order—first in\n9 ABY, when the Mara Jade rescued her teacher Kyle Katarn from Dromund Kaas after the Jedi Knight was driven to the dark side by the planet; and in 44 ABY, when Grand Master Luke Skywalker, his son Ben Skywalker, Jaina Solo, and Vestara Khai were ambushed by a group of Sith Sabers under the leadership of Vestara's father Gavar Khai on Dromund Kaas."}, {"tag": "h2", "text": "Orbital bodies"}, {"tag": "h3", "text": "Dromund Ixin"}, {"tag": "p", "text": "Dromund Ixin was a barren world without satellites, the closest to the star Dromund."}, {"tag": "h3", "text": "Dromund Kalakar"}, {"tag": "p", "text": "Dromund Kalakar was the second planet in the Dromund system, a gas giant orbited by six moons. One of these moons, the volcanic Kalakar Six, was a mining colony of the reconstituted Empire, though an eruption buried the settlement in ash. Thousands of years later, the Prophets of the Dark Side lured the Sith Lord Darth Vader to the moon and its powerful dark side nexus, where they pitted a doppelgänger of the Sith Lord Darth Maul against Vader."}, {"tag": "h3", "text": "Dromund Kaas"}, {"tag": "p", "text": "The third planet in the Dromund system, Dromund Kaas had two moons and was a world of jungles and swamps that hosted significant Sith presences throughout much of galactic history. As a result of Sith magic performed by the Emperor of the reconstituted Sith Empire, the planet's atmosphere was warped so that Dromund Kaas was constantly shrouded in storms, and it was the site of a powerful dark side nexus. Originally a colony of the first Sith Empire, Dromund Kaas was rediscovered by the reconstituted Empire and served as its capital for over a thousand years, though it was largely abandoned and only featured scattered populations of Sith and dark side users."}, {"tag": "h3", "text": "Dromund Fels"}, {"tag": "p", "text": "Dromund Fels was an arid planet that occupied the fourth orbit around Dromund, and it was orbited by two moons. Darth Igrol, a member of the reconstituted Empire's Dark Council, maintained a residence on Dromund Fels during his lifetime, and the archaeologists of the Imperial Reclamation Service conducted numerous excavations on the world throughout the Empire's history."}, {"tag": "h3", "text": "Dromund Tyne"}, {"tag": "p", "text": "The fifth planet in the Dromund system, Dromund Tyne was a barren planet like Dromund Ixin that possessed no moons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}