{"url": "Droxine", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Esstran sector planets"], "nodes": [{"tag": "h1", "text": "Droxine"}, {"tag": "p", "text": "Droxine was a planet located in the Esstran sector of the Outer Rim Territories. It was home to the carchar and nightmare demon species, although the latter—intelligent, telepathic killers—were believed to have been eradicated by the time of the Clone Wars. However, some survived, and one such demon, Reist, was forced to work for the Galactic Empire during the Galactic Civil War. He was sent to Lapez 3 to kill the Rebel Luke Skywalker but was defeated by the pilot."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Droxine was a planet in the Droxine system and part of the Esstran sector, located in the north-east of the Outer Rim Territories. The planet had a number of oceans, which were home to the carchar species. These poriferal creatures had a distinctive water-vascular system, similar to that of the aiwha of Kamino."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 3643 BBY, the reconstituted Sith Empire tracked a group of Republic-aligned mercenaries known as the Fist of Justice to Droxine, and the resulting Imperial attack ended with the destruction of their base and the capture of the movement's leaders. Sometime prior to the Clone Wars, the nightmare demons of Droxine were believed to have been eradicated. However, some of the demons survived into the Imperial Period, when they were used by several of Emperor Palpatine's specialist assassins. One demon, Reist, was used by the Galactic Empire as an assassin. The Human replica droid Altin Wuho controlled Reist, and sent it to attack Rebel pilot Luke Skywalker on the neighboring planet Lapez 3; Skywalker, however, attacked and killed the demon with his lightsaber."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Droxine was inhabited by nightmare demons, a small, bipedal species covered in fur, except for their twin tails and their head, which resembled a Human skull. The nightmare demons were intelligent, telepathic killers; the demons caused individuals to hallucinate, seeing a variety of morbid images. When an individual was enthralled by a demon, they were unable to move. The demons were generally thought to have been wiped out prior to the Clone Wars."}, {"tag": "p", "text": "Other inhabitants of Droxine worked as freight haulers. Two such freight haulers claimed to have seen the infamous bounty hunter Boba Fett disable a significantly larger starship using a concealed ion cannon on his Firespray-31-class craft Slave I."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Droxine was created by Steve Moore and first mentioned in his comic the Empire Strikes Back Monthly 149: Death Masque, published in 1981. It next received a mention in the first edition of Galaxy Guide 3: The Empire Strikes Back, published in 1989, although this mention was not repeated in the sourcebook's second edition. The planet received further mentions in Geonosis and the Outer Rim Worlds, the Star Wars Insider 91 article Comic Marvels, The Essential Atlas, and its online appendix."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}