{"url": "Duchess_of_Mandalore", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Duchess of Mandalore"}, {"tag": "p", "text": "\"Duchess of Mandalore\" is the fourteenth episode in Season Two of the Star Wars: The Clone Wars television series. It aired on February 12, 2010 and concludes a three-part storyline."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "On Coruscant, word reaches Duchess Satine that Death Watch is mobilizing, sparking a pre-emptive Republic invasion. On the run from Republic authorities, Satine and Obi-Wan set off to discover the group's true motives."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Count Dooku, aboard a Munificent-class star frigate, discusses the final plans via hologram with Death Watch leader Pre Vizsla regarding Death Watch's plan to take over the neutral, peace loving world of Mandalore. He is on Concordia at the Deathwatch hideout and his men are assembling themselves to prepare for the planetary invasion. Dooku instructs Vizsla to send a Death Watch assassin to Coruscant to kill the Duchess Satine Kryze. A New Mandalorian scout is hiding in the hills, spying on the operation down below with a pair of electrobinoculars, and hurries back to report his findings to Almec in Sundari. He reports to have found the Death Watch army, which is preparing for battle. He claims the Death Watch will never have the strength required to conquer Mandalore without the people's support. To this, Almec states that if Mandalore is under the Republic's occupation, it will \"turn the Death Watch from terrorists to liberators in the eyes of the people.\" The scout asks how to keep the Republic forces offworld, to which the Prime Minister claims that their fate rests with Satine."}, {"tag": "p", "text": "The Galactic Senate is in session in the Galactic Senate Chamber. Supreme Chancellor Palpatine addresses rising concern about Death Watch, declaring it a \"significant, deadly threat.\" Satine intervenes, saying that Mandalore is putting great effort into finding the leaders of the group, who are unable to gain control of the planet, and it will be achieved without the use of violence. She stresses further violence will ensue in the event of Republic military involvement with these affairs. To back his argument for occupation, the Chancellor presents a hologram message from Deputy Minister Jerec; Jerec states a civil war is amidst the Mandalorians. Satine is shocked by his words, as he was a close friend of hers. Knowing something is not right with the recording she just witnessed, she requests to see Jerec at once, only to learn he was killed in a Death Watch bombing on Kalevala that morning. Palpatine states this as an even greater reason to defend Mandalore, yet Satine refutes the idea of a Republic occupation, fearing it will bring the war to them. Announcing the vote will take place next session, he dismisses the senate."}, {"tag": "p", "text": "As the Duchess exits the building, Obi-Wan Kenobi hurries to catch up with her to express his concern for her well being. He says she shouldn't be making any decisions while in hysteria, as he believes anyone would be after what she has been through. She exclaims more people should be hysterical so they stand up when the Republic intrudes on their rights. After the two bicker some more, her ride arrives and she and her guard depart. While midflight, a Death Watch assassin triggers an explosive hidden aboard the vehicle causing her pilot to lose control. Satine and her guards manage to jump onto a nearby landing platform, only to see the pilot and speeder smash into a building only moments later in a fiery explosion."}, {"tag": "p", "text": "At night, in Palpatine's office, Satine attempts to convince Palpatine that the malfunction was not an accident but her speeder had been tampered with. He dismisses it as simply an accident, despite the fact that it occurred the same day she openly defended her planet. Mas Amedda agrees with Satine, but only to further justify the need to handle Death Watch whereas her government couldn't. Upon exiting the office, Obi-Wan approaches her to inquire about the recent accident. She expresses disgust with the political structure of the Republic, the Chancellor and Mas Amedda in particular, but tells her Jedi friend that she is all right. In the middle of the discussion, Senator Padmé Amidala informs them that the Senate, eager to vote after hearing the news of Satine's assassination attempt, had just voted in favor of Mandalore's occupation and that the ships are planned to leave at sunrise."}, {"tag": "p", "text": "In Sector GL5 of the Coruscant Underworld, Satine, now in a red hooded cloak to conceal her identity, meets with Davu Golec, a fellow Mandalorian and her contact who obtained important information from the Republic Ministry of Intelligence. He hands her a card with the full recording of Jerec's message, telling her the one shown to the Senate earlier was botched. A Death Watch assassin who had been following Golec, the same one responsible for her speeder crash, snipes him clear in the chest, killing him. The Duchess quickly pulls out her deactivator in defense, only to be mistook for a blaster by a police probes who assumes she shot Golec and mark her as a criminal. Lucky for Satine, had the probe not intervened, the assassin would have had a clear shot at her too. She flees from a pair of police droids and the probe who are soon joined by two Coruscant Guards, this whole time she is still being pursued by an assassin. After some time, she pulls out her deactivator and fires it at the probe, causing it to crash to the ground and the other law enforcers to trip over it, taking out both droids; she uses this opportunity to melt away into the crowd. Not long after, she manages to make them lose her trail."}, {"tag": "p", "text": "At the Death Watch hideout on Concordia, the assassin informs Pre Vizsla that he has killed a contact of Satine's and had witnessed a handoff between the two, but the ruler of Mandalore still lives. An angered Vizsla demands her to be found. Aboard a Munificent-class star frigate Dooku informs his master that Death Watch is ready to fight off the Republic forces when they arrive, and the splinter group will be viewed as saviors by the people. Darth Sidious expresses concern about possible interference by the Duchess Satine, but is assured by Dooku that a Death Watch assassin will take care of her."}, {"tag": "p", "text": "Hiding in the alleys of Coruscant, Satine contacts Obi-Wan via comlink. The two meet up, and she hands the card with the original recording to the Jedi Master. They depart together but are followed by the assassin. In an alleyway the assassin tosses a thermal detonator at them, but Obi-Wan notices in time to push Satine out of the way and jump to his own safety. The determined Death Watch assassin jumps down to finish Satine, but Obi-Wan starts to fight him. Finally, Obi-Wan manages to use the Force to toss the assassin over the edge of the walkway, but the attacker activates his jetpack in time before smashing into the ground and makes an escape."}, {"tag": "p", "text": "At the Galactic Senate Building, Satine approaches the Senate Commandos guarding the entrance to turn herself in to buy time for Kenobi to walk in unnoticed. As Chancellor Palpatine is scanning the Great Convocation Chamber for any objections to Mandalore's occupation, Senator Amidala speaks up, displaying the full recording that Satine had handed to Kenobi, who is present in her repulsorpod, and in turn to the senator. Palpatine quickly grimaces as he watches the recording, then returns his expression to a smile. The recording explains that Mandalorian government has been preparing for any possible confrontation with Death Watch and the reason why they cannot ask for Republic support with the situation being so fragile."}, {"tag": "p", "text": "At the Death Watch base, a siren is blaring and a voice repeatedly orders all troops to stand down. Infuriated, Pre Vizsla complains to Dooku that his promise of Death Watch's rise to power on Mandalore failed. He opts to invade the planet alone, only for Dooku to state that he'd only be able to hold Mandalore for only a day if he proceeds without backing from either the planet or the Separatists. He dismisses the matter, stating the Separatists can achieve its goals by other means. Vizsla continues to angrily stare at the Dark Lord of the Sith through the hologram."}, {"tag": "p", "text": "Back in the Chancellor's office, Palpatine thanks Padmé for the new information that eliminates the current need for Mandalore's occupation. She gives all the credit to Satine, who enters at that moment. She is informed by the senator from Naboo that the senate held an emergency session and voted to revoke the previously agreed upon occupation of Mandalore. Palpatine apologizes to her for the recent series of events and praises her for her loyalty to the Republic. Padmé asks for the Chancellor and Vice Chair Mas Amedda to join her in carrying out the senate's recent decision. Satine holds Obi-Wan behind to thank him for his assistance, but expresses her remaining confusion regarding the recent events. The Jedi lacks an answer, but assures her that, as she said to him before, \"things are changing.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Temple Archives feature on The Complete Season Two Blu-ray includes the deleted scenes \"Anakin Speaks with Mas Amedda,\" \"Padmé Challenges Mas Amedda\" and \"Republic Fleet Ordered to Stand Down.\""}, {"tag": "h3", "text": "Comparison of the two recordings"}, {"tag": "p", "text": "The party who doctored the recording spliced together bits of Jerec's full speech, but left them in sequence. Below is a portion of the original, followed by a portion of the doctored version with ellipses signifying omissions."}, {"tag": "p", "text": "\"Death Watch is far stronger than we once thought. But we have been training for this. We can stop them. But if we are to combat them effectively, we must have the temerity to stand strong in the name of peace. And if we are to do so, we must reject any Republic assistance. Instead, this government will act. It acts not out of pride, but for safety. Intervention by the Republic will inflame the opposition and this is why our government rejects the help of the Jedi. We must listen to the Duchess Satine. If we do not, we will ultimately cause our defeat.\""}, {"tag": "p", "text": "\"Death Watch is far stronger than we once thought...if we are to combat them effectively, we must have...Republic assistance. Instead, this government...acts...out of pride...and...rejects the help of the Jedi...Duchess Satine...will ultimately cause our defeat.\""}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}