{"url": "Duel_at_Pelek_Baw", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Haruun Kal", "Category:Battles of the Clone Wars", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel at Pelek Baw"}, {"tag": "p", "text": "The Duel at Pelek Baw was a duel between Jedi Master Mace Windu and his former Padawan, Depa Billaba, which happened towards the end of the Battle of Haruun Kal. Originally, Mace had gone to his home planet of Haruun Kal to retrieve Depa, who had committed questionable acts in association with Kar Vastor's Korunnai terrorist group. After an altercation with Kar Vastor, Mace worked with the Korunnai to fend off an attack by combined Balawai militia and Separatist forces. Mace was, however betrayed again by Depa and Kar, which led to a lightsaber duel in the main command bunker in the City of Pelek Baw."}, {"tag": "p", "text": "After clone troopers breached the door with explosives, Mace found Depa lying seemingly unconscious. Kar Vastor was using the Force to remain undetectable somewhere in the shadows. Depa, who had been faking, surprised Mace and impaled him in the gut with her lightsaber. Mace was able to grab hold of the lightsaber and make it turn off so that the wound was not mortal. They both then separated and began the weaving pattern that constituted the Vaapad ready stance."}, {"tag": "p", "text": "While they dueled, Nick Rostu and clone troopers battled Kar Vastor and his Akk Guards."}, {"tag": "p", "text": "After a furious volley of strikes that could have only been the result of two Vaapad masters dueling each other, Depa landed another shallow strike to Mace's chest. Due to his injuries and the emotional strain of fighting someone who was like a daughter to him, Mace gave up and deactivated his lightsaber. Just before Depa struck the killing blow, she came to her senses. She apologized to Mace and put her deactivated lightsaber's emitter against her temple. Just before she could kill herself, Nick Rostu shot the lightsaber pommel out of her hand. Instead of a lightsaber blade through her brain, she was left in a coma."}, {"tag": "p", "text": "At this time, Kar Vastor goaded Mace. Mace tried to convince him that the battle was over, but Vastor attacked anyways. Mace dodged Vastor's attack and used the Force to impale him with a dead Akk Guard's vibroshield. He placed the injured Vastor under arrest."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}