{"url": "Duel_at_the_Forge", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles in the Tython system", "Category:Battles of the Cold War (Galactic Republic–Sith Empire)", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel at the Forge"}, {"tag": "p", "text": "During the Search for the Fount of Rajivari on the planet of Tython, a duel occurred at the ruins of the Forge, between the apprentice of Jedi Master Yuon Par and the insane Force-sensitive Twi'lek Nalen Raloch."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Festival of Awakening, Nalen Raloch found an ancient Jedi holocron of the fallen Jedi Rajivari and whom he received a rudimentary education in the Force. He found a reference to Rajivari's great knowledge, and went on a quest to find the source. Through his obsession in protecting the village and his love ones that he cared for, he was pulled towards the dark side under Rajivari's influence. His mind was suffering from the dark side, and became increasingly aggressive through his obsession and paranoia to become powerful. He overcame the pitfalls that Rajivari established during his time, in order to protect the source, but not because he broke out, he was greatly disturbed by them. In the main chamber, he met Rajivari's spirit and use the machinery of the source in order to take advantage on the knowledge. Unfortunately, this procedure did not mind standing Raloch's and Rajivari's horror, Raloch decided to destroy the Jedi on Tython in revenge for leaving the Pilgrims to die at the hands of the Flesh Raiders. His first goal was the Forge, where the Order's lightsabers produced. Shortly after, Raloch began to search for the Forge, when Rajivari met with Yuon Par's Padawan. The student was asked to stop Raloch and preventing the dark-sider from destroying the Jedi Order."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "After obtaining a crystal, The young Jedi reached the forge ahead and mounted the First Blade's hilt into a lightsaber. Upon creating the lightsaber, the Consular barely had time to test it when Raloch appeared, escorted by 2 Twi'leks. Raloch's companions hesitated to follow their leader's plan of destroying the Forge, although Raloch tried to convince them that what he was doing was right. Ultimately, Allia and Keth decided to stay out of the fight as Raloch attacked the Consular.Raloch began to take the upper hand, but the Padawan disarmed the Dark Jedi, and defeated him. Kneeling down in agony, Nalen taunted the Padawan to kill him in front of the people who held honor for their hero. The Padawan spared him, and took the wounded Twi'lek to the temple where he could be healed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Impressed by the Padawan's ability to empathize about his shame in his capture and lost points, the Trandoshan hunter Qyzen Fess came under the impression that the small hunter was the Scorekeeper's Herald, a physical avatar of the Scorekeeper herself. Fess pledged his loyalty to the newly-dubbed Herald and decided to accompany the Herald in order to start the process of regaining his lost points. The Padawan returned to the Jedi Temple to report on the mission's progress to the Jedi Council and Master Par. There, Grand Master of the Order, Satele Shan, informed them that Raloch had been undergoing kolto treatment after their battle. Believing the Consular ready to become a fully-fledged Jedi Knight, Master Shan asked the latter to decide Raloch's fate as a final test. Believing in the possibility of the man's redemption, the individual instructed Raloch to be trained as a Jedi so that he could learn to control his burgeoning Force abilities. Following that decision, Par proclaimed her apprentice a Jedi Knight. However, in the midst of the ceremony, she suddenly fell ill. When Par was taken for treatment, Fess revealed that the woman had been suffering from her illness for a long time, but she had chosen to keep it in secret that only the Trandoshan knew about. It was decided to send Master Par to the galactic capital of Coruscant, in hopes that Jedi researchers—who were working on excavating the old Jedi Temple that had been ravaged during the Sacking of Coruscant—might find something to cure her. In the meantime, the Jedi on Tython would study the discoveries the Consular had made pertaining to the Fount of Rajivari. The newly appointed Jedi Knight was then instructed to travel to Coruscant as well, in order to oversee Par's treatment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}