{"url": "Duel_at_the_Font_of_Power", "categories": ["Category:Legends articles", "Category:Duels", "Category:Lost Tribe of Sith emergence"], "nodes": [{"tag": "h1", "text": "Duel at the Font of Power"}, {"tag": "p", "text": "The duel at the Font of Power was a duel between the dark side entity Abeloth, Ben Skywalker, and Vestara Khai that occurred in the year 44 ABY. Abeloth had brought the two to her planet, where she tried to force them to drink from the Font of Power so that she could recreate the Family of the Ones. Ben was to be the Prince of Light, while Vestara would become the Daughter of the Night, and Abeloth would fill the role previously filled by the Father."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "While Vestara believed the only way to combat Abeloth was to use the Font of Power, Ben believed that together they could fight against her. Abeloth appeared and used her tentacles to restrict Ben. Ben attempted to fight back but without using the Force his blows were useless, until he was freed when Vestara used Force lightning against Abeloth. Ben felt the Darkness of the Font of Power and stopped Vestara's lightning assault."}, {"tag": "p", "text": "Ben carried Vestara until they were no longer within range of the Font of Power, then Abeloth appeared again as her avatar, Lady Korelei, and ignited her lightsaber. Ben completely opened himself to the Force, shielding himself from the Font's power, instead drawing on the power of his loved ones throughout the galaxy, in the hope of the Jedi teachings, the promise of the future and that Vestara would embrace the light, and blasted Abeloth with Force Light, however she still kept coming. Vestara again expressed the need for the Font's power but Ben still believed that together they could defeat Abeloth. Ben used the Force to lift a nearby broken pillar and and sent it spinning at Abeloth, while Vestara fired more Force lightning as a diversion. The Keshiri avatar caught the lightning with her palm and dissipated it, but was struck in the back of the head by Ben's pillar, spraying blood across the courtyard. Despite the grievous injury Abeloth still stood and continued forward. Ben attempted to attack again but Abeloth sent him crashing against a pillar. As Ben faded into unconsciousness the last thing he saw was Vestara retreating to the Font of Power."}, {"tag": "p", "text": "Ben awoke to Vestara screaming for him, and he immediately sprang up to save her. Ben found Vestara locked in hand to hand combat with Abeloth within a cage of Force lightning. Vestara tried to use Force lightning to keep her opponent at bay but Abeloth used her tentacles to keep Vestara bound. Ben noticed a shikkar on the Korelei avatar's belt and without hesitating used the Force to plunge it through Abeloth's back, into her heart. Abeloth fell to her knees and freed Vestara as she tried to reach for the dagger in her back, but Ben used the Force to break off the handle as Vestara shot Abeloth with another barrage of Force lightning. Ben used the Force to drag Abeloth away from the Font of Power, and grabbed the pillar from earlier and dropped it onto the writhing avatar. Vestara summoned more of the Font's power and intended to blast Abeloth again but she was stopped by Ben, who told her that Abeloth was dead."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As the two defeated Abeloth, Saba Sebatyne killed the avatar of Abeloth that was inhabiting the Jedi Temple's computer core. With the loss of her two bodies, Ben's father Luke Skywalker was able to kill Abeloth in the realm of beyond shadows with the help of Darth Krayt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}