{"url": "Duel_at_the_Czerka_mining_facility", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Unknown Regions", "Category:Battles of the Desolator crisis", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel at the Czerka mining facility"}, {"tag": "p", "text": "During the Desolator crisis of 3643 BBY, the Sith Valis lured the Jedi Padawan Kira Carsen and her master to an abandoned mining facility in the Outer Rim, forcing a duel between them. Valis was a Child of the Emperor—an agent of the Sith Emperor's will—and, on the orders of his \"father,\" sought to bring the former Child Carsen back into the fold. Believing that they were meeting Admiral Hacklin of the Sith Empire to negotiate his defection, Carsen and her Jedi Knight teacher traveled to the station, but instead found Valis, and he was killed in the fight that followed. As a result of the duel, Carsen revealed her past to both her master and the Jedi Council, giving the Jedi Order concrete evidence about the existence of the Children."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Kira Carsen was born on the planet Dromund Kaas, the capital of the Sith Empire, and given as an infant to the Sith Academy on the planet Korriban. As a child, she was selected by the Sith Emperor to become one of his Children—agents of his will who unknowingly served as his eyes and ears throughout the galaxy. However, Carsen fled the Empire before the process could be completed, leaving behind her fellow Children such as Valis and Suri. She made her way to the moon of Nar Shaddaa and lived on the streets before becoming a member of the Jedi Order, though she hid her past and her Imperial heritage out of fear of being kicked out."}, {"tag": "p", "text": "In 3643 BBY, the Sith Lord Darth Angral declared war on the Galactic Republic and the Jedi Order in response to his son Tarnis's death at the hands of Carsen and a young Jedi Knight. Angral seized control of several Republic superweapons, prompting the Jedi Knight and Carsen to pursue Angral's agents across the galaxy, and the Knight took on Carsen as a Padawan, as Carsen's previous Master Bela Kiwiiks was on her own assignment. While the Knight was on a mission to the surface of Ord Mantell, Carsen remained behind on the Ord Mantell Orbital Station, where an Imperial operative identified her as the Knight's apprentice and contacted Darth Angral. Angral and his retainers, including Admiral Hacklin of the Imperial Navy, arrived and interrogated Carsen as to the Knight's whereabouts, though Carsen tricked the Sith Lord into heading to the planet Corellia. Though Carsen escaped Angral's servants with the help of her teacher, Angral recognized her as a former Child, and the knowledge of her survival reached the Emperor."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Determined to recapture Carsen, the Emperor dispatched his Child Valis to bring her back to him. Posing as Admiral Hacklin, Valis contacted the Republic and claimed that he wanted to defect—but would only do so to Carsen and her master. General Var Suthra arranged for a meeting between \"Hacklin\" and the two Jedi at an abandoned mining facility formerly operated by Czerka Corporation in the Unknown Regions. Valis arrived before the Jedi, and he departed his ship and hid among the cargo crates within the facility's hangar. When the two Jedi arrived, he watched them approach his ship before stepping out into the light and speaking to them. After introducing himself and thanking the pair for coming, Valis apologized for the deception, but Carsen immediately recognized him and warned her Master to attack. Amused, Valis explained that Carsen was of the Empire and a Child of the Emperor like him, and that their father desired his wayward Child returned to him."}, {"tag": "p", "text": "The Knight refused Valis's request that the Jedi allow him to take Carsen home, and the Padawan charged the Sith and brought her double-bladed lightsaber down upon his head—only for Valis to summon his own lightsaber to his hands and block the attack before telekinetically blasting her backwards. The Knight rushed to Carsen's defense, and battle was joined between the three combatants. Despite Valis's combat prowess and skill with both telekinesis and Force lightning, the Child was ultimately no match for the combined strength of Carsen and the Jedi Knight, and he was slain."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Once the two Jedi returned to their ship, Carsen revealed her past to her teacher, and the Knight and Carsen revealed her past to the Jedi High Council as well. Despite Master Jaric Kaedan's desire to banish her from the Jedi Order, Grand Master Satele Shan gave her blessing for Carsen to continue as the Knight's apprentice, though General Suthra was wary of her involvement in further operations. When the conflict with Angral came to a head in a battle over the planet Tython, Angral was slain by the Knight, but the Emperor reached out to his former Child and took complete possession of her. However, with her teacher's help, Carsen was able to drive out the Emperor and sever the link between them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel with Valis first appeared in the Jedi Knight class mission \"The Defector\" in Star Wars: The Old Republic, a video game released in 2011. The mission serves as the intermission of the Act I story, bridging the class storylines on the moon Nar Shaddaa and the planet Tatooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}