{"url": "Duel_at_the_Jedi_Praxeum", "categories": ["Category:Legends articles", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel at the Jedi Praxeum"}, {"tag": "p", "text": "The Duel at the Praxeum was a training duel between the Praxeum's leading student, Gantoris, and the Jedi Master Luke Skywalker. Gantoris believed himself to be a true Jedi since he had been able to construct a lightsaber, and promptly challenged his teacher to face him in combat."}, {"tag": "p", "text": "Gantoris often attacked out of anger, and Skywalker believed he could sense the Dark Side in his student. The duel ended when one of Yavin 4's creatures ran out of the bushes,\ndistracting Gantoris and allowing Skywalker to take Gantoris' lightsaber from him using the Force."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Gantoris, the Human former leader of a colony on the world of Eol Sha, had become frustrated at the seeming lack of direction from his Jedi training under Master Skywalker. Following guidance through the Force from the Sith Lord Exar Kun, Gantoris had fashioned a dual-phase lightsaber using equipment from the abandoned Rebel Alliance base and three corusca gems he had found near one of the Massassi Temples. Gantoris eventually challenged Skywalker to a duel, wishing to prove himself a true Jedi and wanting his teacher to truly acknowledge his strength."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "The revelation that one of his students had already learned how to construct a lightsaber unsettled Skywalker, but he nonetheless prepared to duel his student. Gantoris took the offensive, striking aggressively, while Skywalker remained defensive, protecting himself but never pressing an assault of his own. Skywalker saw the anger within Gantoris, and attempted to use the reverse variant of Dun Möch he had employed while dueling his father, Darth Vader, using words of peace to placate his student."}, {"tag": "p", "text": "Skywalker was stunned when Gantoris used his surprise advantage—activating his lightsaber's dual-phase ability, extending the blade to almost double its original length. Slashing with broad strokes, the student sliced through all the obstacles of the undergrowth to continue his assault, and Skywalker was pressed to use the Force to jump into a nearby tree."}, {"tag": "p", "text": "Leaping from the tree, Skywalker retreated into the undergrowth, sensing the distraction that would give him an advantage. As Gantoris followed in a charge, he was distracted by a runyip fleeing the brush at his feet, and in that second of losing his concentration, Skywalker pulled the lightsaber from Gantoris' hand with the Force, ending the duel."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "To the astonishment of Corran Horn, Streen and the other trainees who watched the duel, Skywalker returned Gantoris' lightsaber to him, stating he should be wary of his anger. Horn found this particularly unnerving, fearing his fellow trainee may turn on others or attempt to fight Skywalker again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}