{"url": "Duel_at_the_Jedi_Temple/Legends", "categories": ["Category:Legends articles", "Category:Battles of the Clone Wars", "Category:Battles of the Jedi Temple", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel at the Jedi Temple"}, {"tag": "p", "text": "A duel took place at the Jedi Temple in 19.1 BBY during the Clone Wars, when Jedi Knight Anakin Skywalker confronted Dark Jedi Barriss Offee as to her role in the bombing of the Jedi Temple Hangar."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Jedi Padawan Ahsoka Tano was framed for and charged with the bombing of the Jedi Temple Hangar and the death of Letta Turmond, Tano decided to hide in the underworld and prove innocence on her own but was recaptured by Anakin Skywalker and Plo Koon and Tano was taken back to the surface where she would await trial. During the Trial of Ahsoka Tano, Skywalker went into the underworld and found Asajj Ventress, assuming her to be the mastermind behind the recent events. Ventress pleaded innocence and revealed that someone had attacked her and stole her lightsabers after she parted ways with Ahsoka after the young Togruta entered the warehouse containing the nano-droids used in the bombing. The only other person to have known that she and Ahsoka went to the warehouse was Barriss Offee, the one who sent them there. Skywalker returned to the Jedi Temple and found the Jedi in her quarters. He questioned her and though Offee denied being in contact with Tano, Skywalker attempted to strike at her with her own lightsaber to prove his suspicions. Offee summoned Ventress' lightsabers, which she had kept instead of disposing, hidden in a pot to defend herself, proving that she was behind the bombing and framed Tano for her crimes. Skywalker then engaged Offee in a duel."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "When it was revealed that Offee had framed her friend Ahsoka Tano for her crimes, Skywalker engaged Offee in lightsaber combat in her room. Then, Skywalker kicked her out of her room and Offee escaped into the Temple hallways and Skywalker followed. The duel continued and when Offee broke off in an attempt to escape, four Jedi Temple Guards arrived, boxing Offee from the two ends of the corridor. Seeking an alternative escape route, Offee broke the Temple's windows and jumped off from the Temple. After Offee knocked Skywalker off a balcony, the duel spilled onto the training grounds where Tera Sinube was instructing Jedi Initiates. Sinube ignited his sabercane to defend the younglings and assist Skywalker. As the Temple Guards closed in, Skywalker disarmed Offee of one lightsaber by squeezing his prosthetic hand around her right arm. After another round of clashing blades, Anakin used telekinesis to slam and pin her to a tree, defeating her."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Offee was then taken to the Republic military base and was forced to confess at Tano's trial, claiming that the Jedi Order had lost its way, and the charges against Tano were dropped."}, {"tag": "p", "text": "Although Tano was relieved, it was clear the whole ordeal had scarred her. The Council apologized for their actions and asked Ahsoka to rejoin the Order, but to everyone's shock, particularly Anakin's, she refused and left both the Temple and the Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}