{"url": "Duel_at_the_Jedi_Temple", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Jedi Temple", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel at the Jedi Temple"}, {"tag": "p", "text": "During the Clone Wars, Jedi Knight Anakin Skywalker fought fallen Padawan Barriss Offee in a lightsaber duel in the Jedi Temple on Coruscant. The duel occurred after Skywalker learned that Offee framed his Padawan, Ahsoka Tano, for the bombing of the Jedi Temple hangar that occurred several days earlier. After speaking with Asajj Ventress, and learning about the ambush that occurred during the attempted capture, Skywalker felt that Offee was the only other person capable of bombing the Jedi Temple. This proved to be true and she engaged Skywalker with Ventress' Sith lightsabers. Offee was ultimately defeated and brought to Tano's trial, where she confessed to bombing the Jedi Temple, believing that the Jedi had become an army fighting for the dark side and it was only a matter of time before the Republic failed."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Jedi Padawan Ahsoka Tano was both framed for and charged with the bombing of the Jedi Temple hangar and the murder of Letta Turmond, Tano decided to hide in the underworld and prove her innocence on her own, but was eventually recaptured by Anakin Skywalker and Plo Koon. Tano was taken back to the Jedi Temple, where she was expelled by the Council and turned over to the Republic Military. During her military tribunal before the Galactic Senate, Skywalker went into the underworld and found Asajj Ventress, assuming she was the mastermind behind the recent events. Ventress pleaded innocence and revealed that someone else had attacked her and stole her lightsabers, after she parted ways with Tano at the warehouse which contained the nano-droids used in the bombing."}, {"tag": "p", "text": "The only other person to have known that she and Tano went to the warehouse was Barriss Offee, the one who sent them there. Skywalker returned to the Jedi Temple and found the Jedi in her quarters. When he questioned her, Offee admitted to have been in contact with Tano, but claimed that she was only trying to help her. To prove his suspicions, Skywalker attempted to strike at Offee with her own lightsaber. Offee summoned Ventress' lightsabers, which she had kept hidden in a pot instead of disposing, to defend herself, proving that she was behind the bombing and framed Tano for her crimes. Skywalker then engaged Offee in a duel."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "After engaging Offee in lightsaber combat, Skywalker kicked her out of her room and Offee escaped into the Temple hallways. Skywalker quickly followed her and the duel continued. When she broke off in an attempt to escape, four Jedi Temple Guards arrived, boxing Offee from the two ends of the corridor. Seeking an alternative escape route, Offee broke the Temple's windows and jumped off from the Temple. After Offee knocked Skywalker off a balcony, the duel spilled onto the training grounds where Tera Sinube was instructing a group of Jedi younglings. Sinube ignited his sabercane to defend the younglings and assist Skywalker. As the Temple Guards closed in, Skywalker was able to disarm Offee of one lightsaber by squeezing her right wrist. After another round of clashing blades, Skywalker used telekinesis to slam and pin her to a tree. Offee was then taken before the court of Tano's trial and was forced to confess her crimes. As she confessed, Offee denounced the Jedi, claiming they had lost their way and were the real villains of the Clone Wars."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Offee's confession, the charges against Tano were dropped and she was released from Republic custody. The Council personally apologized to her for their actions and asked Tano to rejoin the Order, but to everyone's shock, she refused and left the Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}