{"url": "Duel_at_the_Pool_of_Knowledge", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Duels", "Category:Lost Tribe of Sith emergence"], "nodes": [{"tag": "h1", "text": "Duel at the Pool of Knowledge"}, {"tag": "p", "text": "In 44 ABY, a duel took place at the Pool of Knowledge, a Force nexus on Abeloth's planet. After they fought and apparently killed the dark side entity Abeloth, the Sith Sarasu Taalon, Gavar Khai, and Vestara Khai, along with their Jedi allies Luke and Ben Skywalker, discovered that Abeloth had actually survived. In the ensuing search for her, they were led by the Meditation Sphere Ship to the Pool of Knowledge. There, Ben glimpsed the Sith homeworld, and Gavar, suspecting betrayal, moved to attack. Luke Force-pushed Gavar as Taalon glimpsed a Jedi queen on a throne in the Pool and, fearing that she would prevent the Sith's rise to power, dove in."}, {"tag": "p", "text": "Gavar fired Force lightning at Luke, but Ben drove him back with blasterfire before Vestara engaged the younger Jedi in combat. Luke attacked Taalon and Vestara after Taalon reemerged from the Pool, and Gavar threw his parang at Ben, using the Force to guide the blade in between the Jedi's ribs. Gavar then moved to attack Luke, but the Jedi threw him into Taalon and Vestara, and cut off Gavar's weapon-arm. After being repelled with Force lightning, Luke fled the grotto with Ben and collapsed the entrance behind them. The Sith then beat Vestara and sent her to the Jedi—making it appear as though she had fled their punishment—to find out more about the Jedi queen. Meanwhile, Taalon began to transform into the same type of being as Abeloth, and the Jedi tracked Abeloth to the moon Pydyr, where the Sith again joined them in confronting her."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 44 ABY, Jedi Grand Master Luke Skywalker and his son, Ben Skywalker, embarked on a mission with the Lost Tribe of Sith to confront Abeloth, a dark side entity who had been causing a Force psychosis among the Knights of the Jedi Order. Although the Sith betrayed the Jedi and attempted to capture Abeloth, Luke defeated and apparently killed her. The Sith and Jedi repaired their alliance in order to investigate further into Abeloth's nature, under the condition that only High Lord Sarasu Taalon, Sith Saber Gavar Khai, and Khai's daughter, apprentice Vestara Khai, remained on Abeloth's planet with the Skywalkers."}, {"tag": "p", "text": "The allies soon discovered that Abeloth had actually survived and began to hunt for her once more. The Sith Meditation Sphere Ship—which had originally been called to the planet by Abeloth herself, although the Sith claimed responsibility for the act—suggested that they look for her at the Pool of Knowledge, a Force nexus that Luke had seen while beyond shadows at a nearby space station. Ship flew them to a location near the Pool and left them to find it themselves. The allies broke up into two groups to search, and Vestara and Ben found the Pool housed in a grotto. Ben realized that Ship had been trying to pit the Jedi and Sith against each other, and he attempted to convince Vestara to leave the grotto, but she had already called the other Sith through the Force."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "In the Pool, Ben saw an image of Abeloth running toward the allies' vessels, and he realized that she had used Ship to distract them so that she could escape. Ben insisted that they leave quickly, but Gavar wanted to wait until they were certain. When Vestara and Ben again looked into the Pool, it morphed to show the Tribe's homeworld, Kesh, and its capital city, Tahv. Suspecting that the Jedi were trying to betray the Sith and learn of their homeworld, Gavar used the Force to disperse the image and began to threaten Ben. Luke quickly cut him off and Force-pushed the Sith Saber away."}, {"tag": "p", "text": "Taalon, however, was unconcerned with the outbreak of violence; as he looked into the Pool he saw the Throne of Balance, on which was seated a Jedi queen. He feared the queen might prevent the Sith Tribe's planned takeover of the galaxy and thus demanded to know who she was. The Skywalkers recognized the queen as their own relative, Allana Solo, and chose that moment to attack, knowing that a fight was going to break out regardless. Luke activated his lightsaber, while Ben did the same and turned quickly to push past Vestara and attack Taalon. Vestara was shocked at his sudden attack on her and neglected for a moment to counter. Meanwhile, Gavar threw a shikkar—a glass dagger—at Luke, but the Grand Master dodged the throw and the blade smashed against the stone floor."}, {"tag": "p", "text": "Ben was able to bypass Vestara, but Taalon had already dived into the Pool. Vestara moved to attack Ben, but he briefly incapacitated her with a kick to her shoulder, which had been injured during the previous fight with Abeloth. Ben prepared to dive in after Taalon, but Luke warned his son off and Force-pushed him away from the Pool. Gavar then blasted Luke with Force lightning, and Ben retaliated with three shots at the Sith; the bolts were absorbed by Gavar's armor, but they knocked him back against the wall. Vestara returned to the fight and attacked Ben, but he was able to draw an opening with his blaster and knock her away. She collided with Taalon as he jumped out of the Pool, and the infuriated High Lord punched the apprentice in retaliation."}, {"tag": "p", "text": "Luke quickly attacked Taalon and Vestara, and Ben moved to help, but Gavar threw a parang at the Jedi Knight. Ben sliced the weapon in two, but the Sith Saber used the Force to jam a shard of the blade straight into Ben's ribs. Gavar then rushed to help Taalon, countering Ben's attempt to shove him away with the Force. Luke, however, grabbed Gavar's ankle and slammed him into the other two Sith before he cut off the Sith Saber's weapon-arm. The Sith responded with a torrent of Force lightning that drove the Grand Master back into the grotto wall, until Ben intercepted it with his lightsaber. Luke quickly pushed Ben to the exit and fled the grotto, cutting down one of the outer columns, which resulted in the entire collapse of the entryway."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Sith escaped the grotto, and Taalon and Gavar decided to use Vestara as a spy in order to learn as much as possible about the Jedi queen. Taalon beat her and then ordered her to find the Skywalkers and claim that she had been attacked by the two Sith in punishment but had escaped. While Ben recovered from his injuries, the Jedi returned to the beach and found that their ship, the Jade Shadow, was gone—Abeloth had already fled in it. Ben went to break into Taalon's shuttle, the Emiax, but Vestara suddenly arrived on the scene. Taalon and Gavar were not far behind, and Taalon attacked her with Force lightning. Luke laid in hiding and ambushed the Sith with blasterfire, then readied a thermal detonator. After laying down more covering fire, he rushed to Vestara's aid. He was not fooled by her ploy but decided to allow her to come anyway. Luke's thermal detonator stalled the two Sith and allowed the Jedi to leave with Vestara aboard the Emiax."}, {"tag": "p", "text": "Gavar and Taalon left the planet in Ship, and the High Lord began to transform into the same kind of being as Abeloth due to his swim in the Pool. Meanwhile, Vestara and the Skywalkers tracked Abeloth to the home of the pacifist Force-sensitive Fallanassi on the moon Pydyr, where Vestara sent a message to a Sith post on Boonta. The Sith sent reinforcements, including Taalon and Gavar, and again joined the Jedi in confronting Abeloth."}, {"tag": "p", "text": "Further research done by the Sith showed that Hapan Queen Mother Tenel Ka Djo had many features in common with the Jedi queen seen on the Throne of Balance. The Sith learned that Djo's daughter had died during the Second Galactic Civil War—although that was in fact a lie spread by Djo to protect the identity of Allana Solo, the daughter of Djo and Jedi Knight Jacen Solo—and Gavar, determined to prevent the ascension of the Jedi queen to the throne, decided to plot the assassination of Djo before she could give birth to another child. However, Khai's plan was unsuccessful."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel at the Pool of Knowledge was written by author Troy Denning for inclusion in his 2010 novel, Fate of the Jedi: Vortex, the sixth installment in the Fate of the Jedi series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}