{"url": "Duel_in_Hammertown", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Great Jedi Purge", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel in Hammertown"}, {"tag": "p", "text": "Around 3 BBY, during the early rebellion against the Galactic Empire, the Jedi Kanan Jarrus and his Padawan Ezra Bridger engaged in a lightsaber duel with two Inquisitors, the Fifth Brother and the Seventh Sister, in Hammertown, an area of Takobo City on the planet Takobo. The two Jedi, along with fellow rebels Garazeb Orrelios and C1-10P, were attempting to rescue two Force-sensitive children, Alora and Pypey, from the Inquisitors. The Jedi were cornered by the two Inquisitors but were rescued by the arrival of Commander Ahsoka Tano, who engaged both Inquisitors in a lightsaber duel before she and the other rebels retreated from Takobo."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Around 3 BBY, the former Jedi Padawan and rebel commander Ahsoka Tano intercepted two sets of coordinates originating from the planet Mustafar to the Inquisitors. This led her to realize that the Inquisitors had a secondary mission besides hunting Great Jedi Purge survivors. Unsure as to the nature of this secondary mission, she enlisted the help of the undercover Jedi Kanan Jarrus and his apprentice Ezra Bridger. While she checked the first set of coordinates on the planet Chandel, she dispatched her rebel allies to investigate the second set leading to Hammertown on the planet Takobo."}, {"tag": "h2", "text": "Tracking the Inquisitors"}, {"tag": "h3", "text": "Rescuing babies"}, {"tag": "p", "text": "On a derelict starship above Chandel, Ahsoka encountered a woman named Darja, whose granddaughter Alora had been kidnapped by two Inquisitors known as the Seventh Sister and the Fifth Brother. Tano promised Darja that she would return her grand-daughter. Meanwhile Kanan, Ezra, along with Garazeb Orrelios and Chopper traveled on the Phantom to Hammertown. There, they discovered that the coordinates were residential units. Shortly later, they encountered an Ithorian mother, Oora, who told them that the Inquisitors had come to take her son Pypey. However, Oora had sent her child away with a droid before they could get to him."}, {"tag": "p", "text": "Meanwhile, Zeb and Chopper discovered the two Inquisitors' TIE Advanced v1 starfighters in a hidden hangar in Takobo's spaceport. Inside one of the TIEs, they found the infant Alora. After rescuing her, the two rebels destroyed the TIE fighters. While Chopper babysat Alora, Zeb received orders from Kanan to pick up Pypey. Zeb managed to find the droid and pick up the Ithorian infant. Shortly later, he was spotted and pursued by the Inquisitors. Zeb managed to hide in an apartment building and contacted Kanan and Ezra via comlink to rendezvous with them."}, {"tag": "p", "text": "Sensing Zeb's fear, the two Inquisitors prowled the apartment complex for the Lasat rebel. Meanwhile, Kanan and Ezra managed to find the apartment and rendezvous with Zeb and Pypey in an apartment room. Ezra's presence caused Pypey to cry, which alerted the Inquisitors to their presence. The Fifth Brother and Seventh Sister attempted to spike the rebels out of the room with their lightsabers. However, the rebels managed to escape by slicing a hole through the ceiling into the apartment above them. At that point, Kanan realized that the Inquisitors were abducting the two babies because they were Force-sensitive."}, {"tag": "h3", "text": "Fighting the Inquisitors"}, {"tag": "p", "text": "To protect Pypey, the rebels decided to split up. While Ezra took Pypey into a ventilation shaft, Kanan and Zeb decided to hold off the Inquisitors. Kanan also managed to temporarily delay the Inquisitors by using his comlink to record Pypey's wails and planting it in another room. While the Inquisitors were distracted temporarily, the Fifth Inquisitor was able to use the Force to pick out Ezra and Pypey's location in the ventilation shaft. Ezra managed to calm the baby through the Force before the Inquisitor could spike them out with his lightsaber."}, {"tag": "p", "text": "Shortly later, Kanan and Zeb arrived to confront the Inquisitors. This gave Ezra enough time to smuggle Pypey out of the building and to head back to the spaceport. While leaving the building, Ezra accidentally revealed that Phoenix Cell had a presence on Garel to a hidden ID9 seeker droid while chatting to the baby. Meanwhile, Kanan engaged the Seventh Sister in a lightsaber duel, but was unable to match the Inquisitor's agility. Zeb attempted to charge at the Fifth Brother, but the Inquisitor sent him flying backwards him backwards with the Force. Outmatched by the dark siders, the two rebels jumped out a window and managed to land on a passing speeder."}, {"tag": "p", "text": "The two Inquisitors followed the rebels out of the window and managed to commandeer a second speeder by throwing out the Ithorian driver. During the pursuit, Kanan managed to slow down the Inquisitors by shooting their vehicle. The Fifth Brother retaliated by throwing his lightsaber in a boomerang swing that sliced off one of Kanan and Zeb's speeder's jets. Stranded, the two rebels were forced to flee on foot to the spaceport. There, they rejoined Ezra and Pypey. However, the rebels were unable to enter the spaceport since the gates were sealed."}, {"tag": "p", "text": "The Inquisitors quickly caught up with them. Kanan and Zeb attempted to resist them but the two Inquisitors hurled them to the ground with the Force. The Seventh Sister then demanded that Ezra hand over Pypey. When the boy refused, she hurled him to the ground with the Force; causing Pypey to land on Ezra's torso. At that point, the gates of the spaceport opened. Ahsoka stepped out and confronted the Inquisitors. She was aware that the Inquisitors were hunting Force-sensitive babies. After telling Ezra and the rebels to evacuate the youngling, she engaged the two darksiders in a lightsaber duel."}, {"tag": "h3", "text": "Final showdown"}, {"tag": "p", "text": "During the duel, Tano knocked the Fifth Brother out cold while sparring with the Seventh Sister. After a brief, but intense bout of swordplay, Tano deactivated her white-bladed lightsabers and appeared to be surrendering. In turn, the Seventh Sister pounced at the Rebel commander, but Tano deftly grabbed, deactivated, and tossed away the Inquisitor's lightsaber. Tano then Force-pushed the shocked Inquisitor into a column. The former Jedi then raised one of her blades at the Seventh Sister and declared that she had been beaten. The latter then laughed as Imperial reinforcements arrived in the form of Imperial troop transports. With the Fifth Brother conscious once more after his failed attack, they attempted to capture Ahsoka, with the Sister informing Tano that her capture would please Darth Vader."}, {"tag": "p", "text": "Meanwhile, the rebels decided to leave with the rescued Alora and Pypey on the Phantom and pick up Ahsoka on the way. Watching the Phantom leave the spaceport, Tano told the Inquisitors to inform Vader that he would have to wait. In response, the Brother hurled his weapon at Tano, who managed to dodge it before leaping into the Phantom. Imperial stormtroopers attempted to shoot down the auxiliary ship, but the rebels and Ahsoka managed to flee. Seeing Tano, the Rebels, and the children escape only angered the two Inquisitors since they had failed in their mission to capture the Force-Sensitive children."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After escaping from the Inquisitors, the rebels were able to reunite Pypey with his mother Oora. While traveling through hyperspace, Ahsoka deduced that the Inquisitors were kidnapping the babies because they were Force-sensitive. She informed her fellow rebels Kanan and Ezra that a Sith Lord had made a similar attempt during the Clone Wars, but had been foiled by the Jedi. Now, that the Jedi Order was gone, Kanan reasoned that the rebellion was the only ones left to protect the children. Despite losing the babies and failing to capture the rebels, the Inquisitors were mollified to learn that the rebels were hiding on Garel. In response, the Empire launched an attack on the planet in an attempt to destroy the rebels."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel in Hammertown first appeared as the climax of the Star Wars Rebels episode \"The Future of the Force,\" which debuted on Disney XD on December 2, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}