{"url": "Duel_in_Hrakert_Station", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Articles with conjectural titles", "Category:Battles of the Jedi Civil War", "Category:Battles of Manaan", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel in Hrakert Station"}, {"tag": "p", "text": "The Duel in Hrakert Station was a confrontation during the Jedi Civil War between the former Dark Lord of the Sith and redeemed Jedi Padawan Revan, and reigning Dark Lord Darth Malak's Shadow Hand, Darth Bandon. It took place in a Republic kolto harvesting base called Hrakert Station, located on the Selkath homeworld Manaan. The lightsaber duel resulted in Bandon and his two Dark Jedi comrades' deaths."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3956 BBY, the final year of the Jedi Civil War, the former Dark Lord of the Sith and amnesiac Republic soldier Revan assisted in the Jedi Knight Bastila Shan's escape from the destruction of the ecumenopolis Taris. After traveling to the planet Dantooine, Revan was retrained as a Padawan by the local Jedi Council. When Revan completed his training, he was tasked by the Council to find an ancient Rakatan space station called the Star Forge, which was under Revan's former Sith apprentice and reigning Dark Lord Darth Malak's control."}, {"tag": "p", "text": "After locating a fourth Rakatan Star Map which was needed to determine the Star Forge's location, Malak's apprentice and Shadow Hand, Darth Bandon, and two Dark Jedi found Revan and his companions in the Hrakert Station, a Republic kolto harvesting base, on the Selkath homeworld Manaan."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Darth Bandon expressed to Revan his fear that someone else had killed the Jedi, thereby depriving the Sith Lord the pleasure of killing Revan himself. Bandon told his adversary that he would be no match for him, even though the Jedi had previously killed the bounty hunter Calo Nord on Tatooine. The former Dark Lord asked Bandon how he ended up at the station, and Bandon replied that he had used the same route underwater that Darth Revan and Darth Malak used during their search for the Star Forge. Revan assured Bandon that he would pay for the Republic ensign Trask Ulgo's death, since Bandon killed Ulgo when the Sith Lord led an attack on Bastila Shan's Republic warship Endar Spire over Taris. However, Bandon stated that Revan's words meant nothing to him, asking Revan if he wanted to beg for his life. Bandon and his two Dark Jedi accompanying the Shadow Hand engaged Revan and his companions in a lightsaber duel, but were ultimately defeated by the former Sith Lord and his allies."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Shortly after his death, Bandon's head was sliced off his body by Sith Acolytes. They had preserved the head, feeling that there was power inside. It had remained that way for over 300 years, which at that time it was placed in the House Alde Royal Museum on Alderaan during the Cold War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel in Hrakert Station first appeared in the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, developed by BioWare."}, {"tag": "p", "text": "The planet on which Revan battles Bandon is determined by the order in which the fourth of the five Star Maps that lead to the Star Forge's location is obtained. Bandon could confront Revan on the desert world Tatooine, the Wookiee homeworld Kashyyyk, Manaan, or the Sith tombworld Korriban. Bandon could also confront Revan if he returned to the location of the second and third Star Maps."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}