{"url": "Duel_in_the_Coruscant_Underlevels", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Articles with conjectural titles", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel in the Coruscant Underlevels"}, {"tag": "p", "text": "A duel took place in the year 20 BBY, between renowned Jedi Knight Anakin Skywalker and the Sith Acolyte Asajj Ventress, in the Underlevels of the galactic capital, Coruscant."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the Battle of Rendili, where the renegade Jedi Quinlan Vos turned himself in, he was taken to Coruscant for judgment before the Jedi Council. Anakin Skywalker, who had participated in the battle, delivered a testimony regarding Vos' actions during the battle. Having done this, Skywalker was excused."}, {"tag": "p", "text": "Immediately afterwards, Skywalker journeyed to the Senate Office Building to meet with his secret wife Padmé Amidala. He was instead greeted by one of her handmaidens who told him that Senator Amidala was tied up with Senate business, while giving him a holodisc from her. As Skywalker traveled to the Coruscant Underlevels to listen to the hologram, he was unaware that he was being tailed by Dark Jedi Asajj Ventress."}, {"tag": "p", "text": "Ventress revealed herself, catching Skywalker on his speeder in a decrepit building, listening to the hologram. She took it from him with the Force, and listened to it with disgust before destroying it. Ventress told Skywalker that she was on Coruscant hunting down Quinlan Vos and Obi-Wan Kenobi, before she decided to settle for him. She then proceeded to threaten Senator Amidala's life; Skywalker, who thus became enraged, viciously attacked."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Easily fending off Skywalker's strikes, Ventress commented on how pitiful his attack was. Overleaping a slash at her legs, she asked herself why she was wasting time with Skywalker when she could be looking for Senator Amidala. With that, Ventress retreated further into the building, with an enraged Anakin Skywalker in hot pursuit. Ambushing the Jedi, Ventress managed to slash Skywalker across the face, leaving him with a scar on his jaw. As they leapt apart, Ventress quickly pressed the attack. As they fought, Ventress managed to again slash Skywalker across the face, leaving him with his distinctive vertical scar next to his eye. Skywalker returned the favor, slashing her across the left cheek."}, {"tag": "p", "text": "Scarcely noticing the injury, Ventress taunted that she could have decapitated Skywalker with that stroke, and stated that in their last contest, Skywalker got lucky. She went so far as to say that she would teach Skywalker a last lesson regarding the superiority of the Dark Side before she killed him. Unfortunately for her, she pushed Skywalker too far, causing him to snap completely."}, {"tag": "p", "text": "Unleashing a flurry of destructive blows, Skywalker drove Ventress to the edge of the building, before blasting her off the edge and telekinetically entangling her in a number of live electrical wires. He then tortured her by holding her in the wires with the Force as she was electrocuted, before he finally dropped her. The wires snapped, unable to take Ventress' weight, and she became further entangled as she fell into a pit below. Skywalker stared at the pit for a few seconds, before turning his back on his defeated enemy, and leaving."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The fight left Anakin looking delectable thanks to the new scar. However, by submitting to his rage during that fight, Anakin Skywalker had pushed himself closer to the dark side of the Force and his own eventual fall. Despite her extreme injuries, Asajj Ventress survived."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}