{"url": "Duel_in_the_Gnarls_cave", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Flesh Raider uprising", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel in the Gnarls cave"}, {"tag": "p", "text": "In 3643 BBY, during the Flesh Raider uprising on the planet Tython, a duel occurred in a cave in the Tythonian Gnarls between the Dark Jedi apprentice Callef and a Jedi apprentice. In an attempt to stop the Flesh Raider invasion of the Gnarls, the apprentice found Callef about to kill the Bith apprentice Unaw Aharo, and dueled the Dark Jedi in an attempt to stop him. Despite the apprentice's disadvantage of wielding a vibrosword against Callef's lightsaber, the Jedi's remarkable combat skill resulted in Callef's death."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the Sith Empire, the native Flesh Raiders of the planet Tython began to attack the Jedi Order and the Twi'lek Pilgrims of Kalikori village. It would later be revealed that the Flesh Raiders were acting under the orders of the Dark Jedi Bengel Morr, the former Padawan of Jedi Master Orgus Din, who wished to destroy the Order and rebuild it into something that could destroy the Sith. Early in the uprising, in 3643 BBY, the Flesh Raiders attacked the Order's base in the Tythonian Gnarls, near the Masters' Retreat."}, {"tag": "p", "text": "The Jedi, led by Jedi Master Derrin Weller, fought off the Flesh Raider attacks, but Master Weller was injured in the fight. Weller had already sent a newly-arrived apprentice out into the Gnarls to investigate reports of the Flesh Raiders using blaster technology, and Weller contacted the Padawan after he was injured. Having learned from a Bith apprentice by the name of Unaw Aharo that the Flesh Raiders were entering the Gnarls through a cave network nearby, the Jedi Master ordered the Padawan—who was known to be exceptionally skilled in combat—to find Aharo and seal off the cavern at all costs."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Entering the cave, the apprentice was forced to fight through over a dozen Flesh Raiders, and finally reached the end of one section of the cave. There, the apprentice found a wounded Aharo being threatened by a Human Dark Jedi named Callef—in actuality, the apprentice of Bengel Morr, though Callef did not mention his master to the two Jedi apprentices. The man, who wielded a lightsaber and called himself a \"true Jedi,\" attacked the second apprentice when the Jedi stopped him from killing Aharo. Despite only wielding a vibrosword, the Padawan was able to defeat Callef, and the Dark Jedi was killed during the battle."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "It was at that point that Jedi Master Orgus Din arrived and witnessed Callef's defeat. Din thanked the apprentice for helping Aharo, and used the Force to bring down the cave's ceiling, blocking the path and stopping any more Flesh Raiders from entering the Gnarls. Din then took the wounded Aharo to safety, telling the other apprentice to come to the Jedi Temple."}, {"tag": "p", "text": "When the apprentice met with the Jedi High Council at the Temple, Master Din took on the Jedi as his Padawan—the first one he had taken since Padawan Bengel Morr, who had vanished after the Sacking of Coruscant. The discovery that Callef and his \"master\" were marshaling the Flesh Raiders sparked the Jedi Order to begin investigating, and the uprising finally ended when Din's new Padawan defeated their leader—who was revealed to be an insane Morr—and rescued Din at the Forge."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel in the Gnarls cave was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. The duel is one of the earliest quests in the storyline of the Jedi Knight character, and the event sets off the main storyline for the Knight on Tython. Within the cave itself, there a minimum of thirteen Flesh Raiders that may be defeated before reaching Callef, and the Dark Jedi has two Flesh Raider guards, making a total of fifteen. While there are dialogue choices with Callef that can gain alignment points, the duel will end with the Dark Jedi's death regardless of the player's choices. The duel is also mentioned in the 2012 reference guide Star Wars: The Old Republic Encyclopedia, during a summary of the Jedi Knight class' story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}