{"url": "Duel_in_the_Korriban_Academy", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Duels", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Duel in the Korriban Academy"}, {"tag": "p", "text": "In 1000 BBY, a lightsaber duel occurred between the rival Sith apprentices Bane and Sirak, alongside their allies amongst the students of the Sith Academy on Korriban. Inside the school's library, the two sides engaged in lightsaber combat—Sirak, flanked by a pair of fellow Zabrak, the twins, Yevra and Llokay, against the Humans Bane and Githany."}, {"tag": "p", "text": "Seeking revenge for being defeated by Bane during a training duel, Sirak had accepted help from Githany, who claimed she could lure an unsuspecting Bane into the Academy's library. Upon doing so, Githany betrayed Sirak by arming Bane with his lightsaber, and instead, sided with him to engage Sirak in battle. Despite their superior numbers, the Zabrak twins were both killed by Githany, as Bane dueled Sirak. Bane bested him yet again, leaving Sirak begging for mercy before Bane decapitated him."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Human male, Bane, and Sirak—a yellow-skinned Zabrak—had encountered each other in previous training duels during their time as Sith apprentices of the Brotherhood of Darkness, at the Academy on the Sith graveyard world of Korriban. A portion of their lightsaber training under the Academy's Blademaster Kas'im involved the students challenging each other in a dueling ring to both prove their strength and earn prestige with the Masters that trained them. In using their training sabers, both students would always survive, thus allowing the ranks of the Brotherhood of Darkness to increase. During their first confrontation, Bane—whose own powers had regressed as a result of his subconscious withdrawal from the dark side of the Force—had challenged Sirak, the premier student in the Academy, in a bid to regain his standing with the Academy Masters. However, Bane was unable to call on the Force to aid him in battle, and was toyed with before Sirak finally defeated him."}, {"tag": "p", "text": "When the former Jedi Githany helped Bane to touch the Force once more, she also offered to train him in whatever lessons of the dark side she received from the Masters. Githany secretly believed she could manipulate Bane, and planned to use his own strength in the Force to dispatch Sirak for her. He agreed, but also sought out private training from Kas'im in lightsaber combat, to evenly balance his skills. After several months, Githany told Bane she was prepared to challenge Sirak. However, as the pair had grown romantically close, Bane insisted on challenging Sirak in her stead, believing that Githany would fail."}, {"tag": "p", "text": "The next day, Bane defeated Sirak in the dueling ring, but hesitated before delivering the final blow as Kas'im promptly called for a halt. This display of mercy caused Githany, who had been watching amongst the other students, to believe that Bane was weak; thus, she plotted to betray him herself. Meanwhile, as a reward for his victory, Kas'im gifted the curved-hilt lightsaber of his former Master, Na'daz, to Bane."}, {"tag": "p", "text": "When Bane had a dispute with the Academy Headmaster, Qordis, over the philosophies of the dark side, he left for the Valley of the Dark Lords without speaking to anyone, seeking the knowledge of the ancient Dark Lords of the Sith buried there. Githany, who was both angry with Bane for leaving, and disgusted that he did not kill Sirak in the duel, found the Zabrak and offered him assistance in killing Bane for vengeance. Sirak cautiously agreed, and they then devised a plot where Githany would lure Bane to the Academy's library as Sirak lay in wait to finish him once and for all. Also during Bane's absence, Lord Kaan—founder of the Brotherhood—called for all the students to go to Ruusan to fight against Lord Hoth's Jedi Army of Light. Sirak and Githany were each bestowed with the rank of Dark Lord, as well as each receiving their own lightsabers, with Sirak's being of the double-bladed variant. When Bane eventually returned, Githany successfully lured him to the library, where Sirak, with his fellow Zabrak students Yevra and Llokay, waited in ambush."}, {"tag": "h2", "text": "The duel"}, {"tag": "h3", "text": "Githany's treachery"}, {"tag": "p", "text": "With Githany standing behind him and armed with her lightwhip, Bane faced the exit that was now blocked by his Zabrak nemesis and his twin companions. He then questioned Githany's motives, but Sirak ignited his lightsaber and explained that she valued the Sith principles of the strong over the weak. Bane knew he was stronger than Sirak, but turned to face Githany, knowing she was undecided by the habitual chewing of her lower lip. Realizing Bane sought to turn Githany against him, Sirak struck out, but Bane evaded the attack so that Sirak struck nothing but air. Unexpectedly, Githany chose Bane over Sirak, throwing him his own lightsaber that she had taken from his quarters. Bane summoned the weapon to his hand and activated it in time to defend himself against Sirak's strikes. The Zabrak twins followed suit, also readying their sabers to attack. In turn, Githany produced her lightwhip in her own defense."}, {"tag": "p", "text": "Launching a fast series of attacks, Bane forced Sirak away, but feigned an advance by suddenly stepping back. This provided an ample opportunity for him to use the Force and hurl Yevra into nearby book shelves, stunning her and splintering the wood. Githany seized the opportunity and lashed out at the female Zabrak with her whip, killing Yevra instantly."}, {"tag": "p", "text": "Seeing the death of his sister filled Llokay with rage. Despite being weaker in the Force than Bane, his emotions fueled the dark side enough within him that he was able to force the sizable Human back under an onslaught of desperate slashes, foregoing all technique for raw emotional power. Warding off the unexpected attack, Bane noticed only just in time the Force lightning Sirak had unleashed towards him. He blocked it with his lightsaber, but inadvertently left himself open to a strike from Llokay. Githany, however, was attacking the grief-stricken twin, who required all his focus to ward off the strikes of the lightwhip, as he found her style of combat unpredictable. Bane then turned to face Sirak, and the pair waited, hesitating as a scream pierced the air. Llokay had lost an eye to Githany's whip just before another lash tore out the Zabrak's throat."}, {"tag": "h3", "text": "Rival's end"}, {"tag": "p", "text": "Comprehending the turning of the duel and his imminent defeat, Sirak deactivated his lightsaber and fell to his knees, staring up at the pair that stood over him. Looking at the Zabrak, Bane saw every being he'd killed—his father, Hurst, Fohargh, the Galactic Republic soldiers he'd killed while with the Gloom Walkers, a Sith military unit. In the pause, Sirak begged and pleaded for his life, but Bane, realizing that the way of the dark side was to break through the bonds of guilt, decapitated his rival. Sirak's death proved to be the solidification of Bane's transition into the dark side's power."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In killing Sirak, Bane overcame his fears of the dark side. Previously, when he realized he had killed his father shortly after he had killed Fohargh, Bane had pulled away from the Force and lost the ability to control it. In killing his bitter rival, Bane knew he would never again doubt the dark side's power, and at that moment, he had become a Sith. However, this also fulfilled his belief in the failings of the Brotherhood of Darkness, and that he would have to leave them completely. This event would lead to his conclusion that he would have to destroy the Brotherhood, and revolutionize the Sith by instigating the Order of the Sith Lords under the Rule of Two."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel in the Korriban Academy was written and conceived by author Drew Karpyshyn for his 2006 novel, Darth Bane: Path of Destruction. Karpyshyn used this duel to end the lives of three characters: Sirak, Llokay, and Yevra. Karpyshyn also used this event to reunite the characters of Bane and Githany, who had been previously separated earlier in the novel. It is here that the author shows Bane fully and consciously embracing the dark side of the Force, on a path that leads to the eventual destruction of Kaan's Brotherhood at Bane's hands."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}