{"url": "Duel_of_the_Fates", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Duel of the Fates"}, {"tag": "p", "text": "\"Duel of the Fates\" is a musical theme composed by John Williams between October 1998 and February 1999 for the 1999 film Star Wars: Episode I The Phantom Menace and its respective score. It was written to represent the duel in Theed between the Sith Darth Maul and the Jedi Master Qui-Gon Jinn with his Padawan Obi-Wan Kenobi in the \"Duel of the Fates\" scene at the end of the movie. The composition was recorded by the London Symphony Orchestra (LSO) and the London Voices choir in February 1999 in EMI's Abbey Road Studios in London, England. The piece was used in all three of the prequel trilogy movies and included on the soundtracks of The Phantom Menace and Attack of the Clones. The theme also briefly appeared in the spinoff film Solo: A Star Wars Story, though it was not used in said film's soundtrack album. The motif is used many times throughout video games, trailers, and numerous other pieces of Star Wars Legends media, as well as in the music video trailer for The Phantom Menace, which includes footage of the theme's recording sessions."}, {"tag": "p", "text": "The theme is mainly polyphonic, is in the keys of E and G minor, and has a minor mode, a tempo of 152 bpm, and a duple meter with a time signature of 4/4. The composition, which lasts four minutes and fourteen seconds, contains lyrical Sanskrit chants translated from the Celtic epic Cad Goddeu. The composition was made available for purchase on May 4, 1999, with the release of the soundtrack for The Phantom Menace, and the sheet music was released in the music books Music from Star Wars Episode I: The Phantom Menace, Star Wars: Episode II Attack of the Clones: Selections from the Original Motion Picture Soundtrack, Star Wars: A Musical Journey: Episodes I-VI, Selections from Star Wars, Star Wars Episodes I, II & III Instrumental Solos, and Star Wars for Beginning Piano Solo."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "John Williams wrote the score for the 1999 film Star Wars: Episode I The Phantom Menace and the respective soundtrack, as he had for the previous three Star Wars films of the original trilogy. He began work on the project in mid-October of 1998. \"Duel of the Fates\" was written as the main theatrical motif for the film and was utilized in various forms throughout the scenes depicting the climax of the film during the Battle of Naboo where the Trade Federation forces battle the Royal Naboo Security Forces. The piece is used mainly to represent the duel between Darth Maul, a dark Lord of the Sith, and the Jedi Master Qui-Gon Jinn and his apprentice, Obi-Wan Kenobi."}, {"tag": "p", "text": "When composing the theme, Williams felt something ritualistic and pagan would be very effective in evoking the proper emotions, so he took a stanza of text from the Celtic epic Cad Goddeu. He had friends from Harvard University translate the English version back to Celtic, then to Greek, and finally Sanskrit, which he chose for its \"beautiful sounds.\" Williams then reduced the stanza to phrases consisting of a single word when translated to English and repeated their Sanskrit counterparts. Williams composed the music for the motif on a piano. The piece, along with the entire score, was performed by the London Symphony Orchestra and London Voices in EMI's Abbey Road Studios in London, England in February 1999, both recording live at the same time. The motif was written for The Phantom Menace's end credits and then cut to fit in the picture."}, {"tag": "h3", "text": "Release"}, {"tag": "p", "text": "The music video for \"Duel of the Fates\" was premiered at the opening ceremony of Celebration in Denver, Colorado on April 30, 1999. In May 1999, Sony Signatures released \"Duel of the Fates\" as a CD single available only to radio stations, television stations, and MTV. The original soundtrack, which includes the song, was released by Sony Classical on May 4, 1999, and the Ultimate Edition on November 14, 2000. Also in 1999, the soundtrack was available for purchase as a special limited edition double vinyl album exclusively at towerrecords.com. The original soundtrack was re-released on February 6, 2012 to coincide with the 3-D release of the film in theaters. The album was also released on vinyl by \"IAmShark\" in 2013. On September 25, 2015, it was announced that Sony Classical would be releasing the soundtrack of The Phantom Menace along with those of the other five films in three new sets: the Star Wars: The Ultimate Vinyl Collection, the Star Wars: The Ultimate Soundtrack Edition, and the Star Wars: The Ultimate Digital Collection on January 8, 2016."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "\"Duel of the Fates\" is mainly polyphonic and has a minor mode, a tempo of 152 bpm for most of the piece, and a duple meter with a time signature of 4/4. The composition is four minutes fourteen seconds long and is in the keys of E and G minor. The theme commences in an E minor as homophonic, maestoso in style, with the London Voices singing a chant in Sanskrit. The tempo, marked as \"allegro,\" then speeds up to 152 bpm as the strings enter with the violins playing a repeating phrase consisting of two eighth notes followed by two sixteenth notes and another eighth note. The low strings play sets of one, two, and five eighth notes with a measure of rest between each set's measure excluding the last, which has a pickup note, making the previous measure only seven eights rest. This continues for twenty measures with slight variations in the low string part."}, {"tag": "p", "text": "After the phrase has repeated for six measures, the theme's main melody comes in, played by the clarinets. This melody consists of two eighth notes followed by four quarter notes, two more eighth notes, and a final quarter note. It repeats four times, with the first two occurrences being identical and the last two varying. The end quarter note in the last repeat of the melody is tied to two whole notes and crescendos as the strings continue to play their repeating phrases. After another three measures, the harp plays a rising phrase. In the next bar, the French horns play the melody, and the trombones echo it in the background. Then the strings repeat their phrases for a few more bars, this time accompanied by the flutes, and then the London Voices return with their Sanskrit chant. Meanwhile, the trombones play the otif's main melody. This is followed by more repetition of the string phrases intermingled with accented notes and phrases from the tubas and trumpets. Then the London Voices return with the chant, and the French horns and trumpets trade out on the primary melody. The trumpets join the strings as they continue to repeat their phrases, crescendoing into a chorus chant of two eighth notes followed by a quarter rest, which repeats eight times as the trumpets play between every other phrase. As the pitch increases to a G minor, the chant switches back to its original form, and the trumpets continue to play accented notes between phrases. The brass and strings then join in playing the strings' repeating phrases in unison."}, {"tag": "p", "text": "The piece becomes quiet with only the strings continuing as the pitch returns to E minor. Woodwinds come in with the theme's primary melody followed by the French horns and trumpets. The strings then start playing phrases composed of triplets. The main melody is traded between the flutes and French horns, and the orchestra grows into an instrumental version of the piece's second chant (played in a G minor). The chorus then returns singing the first chant. Between each pair of notes in the chant are the trumpets playing the string phrases and the French horns playing the theme's melody, with the trumpets playing between the first and third pairs and the French horns between the second and fourth. The second chant is then repeated, followed by the first quarter of the first chant, as the brass and strings once again join in playing the string phrases. The chant is repeated with a timpani roll in the middle. Next the entire orchestra plays the string phrases while crescendoing, followed by an upbeat trumpet part and a bongo part. The orchestra returns with the string phrases, and then the piece quiets as the strings continue their phrases and the woodwinds once again perform the melody. The Voices return with the first and second chants. The trumpets play the string phrases, the timpani plays a solo, the trumpets return with six eighth notes, the bongos roll, and the piece ends with one hit of the string phrase."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the soundtracks"}, {"tag": "p", "text": "The theme makes its only pure occurrence in a Star Wars soundtrack in the second track titled \"Duel of the Fates\" on the Star Wars Episode I: The Phantom Menace soundtrack, but it is also briefly featured in the fifteenth track titled \"Qui-Gon's Noble End.\" These are the only uses that are made of the theme in the original soundtrack; however, it is used several times throughout most of the last fourteen tracks of the Ultimate Edition soundtrack. The dialogue version, which is featured in the last track of the Ultimate Edition soundtrack and contains the audio from the \"Duel of the Fates\" music video, was added to the end of the re-release of the original soundtrack, which became available in 2012 to coincide with the 3-D release of the film in theaters."}, {"tag": "p", "text": "In the Star Wars Episode II: Attack of the Clones soundtrack, the motif makes one appearance three minutes and thirty-five seconds into the tenth track, titled \"Return to Tatooine.\" The soundtrack for Star Wars Rebels Season Two includes references to the theme fifty-five seconds into the track \"Blinded.\""}, {"tag": "h3", "text": "In the movies"}, {"tag": "p", "text": "\"Duel of the Fates\" is first played in Star Wars Episode I: The Phantom Menace. The \"Duel of the Fates\" scene, so named in the menus for the DVD version of the film, is the scene where the Jedi characters Qui-Gon Jinn and Obi-Wan Kenobi duel the Sith Lord Darth Maul in the Theed power generator on the planet Naboo. It is played in instrumental form as another major character, Queen Amidala, is ambushed along with her guards by battle droids with rolling capabilities and shields called droidekas in the Theed Hangar, and as Darth Maul and the Jedi activate their lightsabers at the commence of their duel. It is used again as the duel moves from the hangar to a generator complex. The cue comes to an end as plasma shields separate the three combatants for the first time; however, the theme appears shortly after as the youngling Anakin Skywalker destroys the droid control ship above the planet. The original recording is used during the film's end credits."}, {"tag": "p", "text": "In Star Wars: Episode II Attack of the Clones, the piece is played when now-Jedi Knight Anakin Skywalker travels across the surface of the planet Tatooine to search for his mother, Shmi Skywalker Lars, and rescue her from her captors, a tribe of a species called Tusken Raiders."}, {"tag": "p", "text": "In Star Wars: Episode III Revenge of the Sith, the theme is used as Anakin Skywalker crash-lands the Invisible Hand on Coruscant, where an excerpt from the music used when Skywalker destroys the control ship in The Phantom Menace is utilized. \"Duel of the Fates\" is played for the final time during the middle of the film's climax as Darth Vader duels against his former master Obi-Wan Kenobi on Mustafar, as well as during Yoda's attempt to kill Darth Sidious in the Galactic Senate Chamber in an effort to bring his reign to an end and save the Galactic Republic. The piece concludes as Yoda falls from the Chancellor's podium."}, {"tag": "p", "text": "In Solo: A Star Wars Story, the theme briefly recurs as Maul, revealed as the secret leader of Crimson Dawn, instructs Qi'ra to begin dealing with him more personally. While the theme appears briefly in the film, a longer statement is played in the soundtrack."}, {"tag": "h3", "text": "In other canon media"}, {"tag": "p", "text": "Parts of \"Duel of the Fates\" appears in \"Out of Darkness,\" the seventh episode of Season One of Star Wars Rebels, when the Spectres are attacked by fyrnocks. The theme also appears in \"Twilight of the Apprentice\", the finale episode of the TV series' Season Two, during the lightsaber duel between Ahsoka Tano and Darth Maul. The theme is also used extensively in the gameplay trailer for the 2017 DICE video game Star Wars Battlefront II, as well as in the game itself."}, {"tag": "h3", "text": "In Legends"}, {"tag": "h4", "text": "Video games"}, {"tag": "p", "text": "The piece made its first video game appearance in the Star Wars: Episode I The Phantom Menace video game during the game's last mission, titled \"The Final Battle,\" detailing the duel between Maul, Kenobi, and Jinn. A completely electronic version of the theme is used in the main menu for the 1999 Game Boy Color game Star Wars Episode I: Racer, though the original recording is used in other versions of the game with the vocals cut. It also appears in the opening cinematic for Star Wars: Episode I Jedi Power Battles (2000), as well as that game's tenth mission, The Final Battle. The theme makes an appearance in the main menu of the game Star Wars: Episode I: Battle for Naboo (2000) and during the game's second bonus mission. The composition is utilized in Star Wars: Starfighter (2001) during \"The Final Assault\" as rookie pilot Rhys Dallows dogfights a mercenary leader in the space battle above Naboo. The motif is also used in the 2001 real-time strategy video game Star Wars: Galactic Battlegrounds and its expansion pack Clone Campaigns, released in 2002. The composition is included in the level \"Darth Maul\" on the game Star Wars: Obi-Wan (2001). Star Wars: Jedi Starfighter (2002) uses different variations on the theme from various The Phantom Menace tracks in \"Training Mission 5: Force Powers,\" \"Mission 5: Poisoned Skies,\" \"Mission 7:Hammer and Anvil,\" \"Mission 8: Demolition Squad,\" \"Mission 13: Attack of the Clones,\" and \"Mission 15: The Jedi Master.\" The 2003 video game Star Wars: The Clone Wars uses the piece in \"Mission 3: The Battle of Geonosis\" as you assist in bringing down the second core ship, in \"Mission 7: The Conquest of Raxus Prime\" as you escort reinforcements, and in \"Mission 16: Fate of the Republic\" as you fight the Dark Reaper. It can also be heard during the climactic battle between a spacer and Lord Vartonis in Trials of Obi-Wan (2005), the third expansion of the massively multiplayer online role-playing game (MMORPG) Star Wars Galaxies. Also in Galaxies, players can choose to play \"Duel of the Fates\" from a jukebox playlist. The theme is utilized in the sixth level of \"Episode I\"—titled \"Darth Maul\"—in the non-canon video game LEGO Star Wars: The Video Game (2005), and in the sixth level of the same name in the non-canon LEGO Star Wars: The Complete Saga (2007). It appears twice in the Star Wars Episode III: Revenge of the Sith video game (2005), once in an introductory cinematic sequence featuring Obi-Wan Kenobi and Anakin Skywalker fighting in numerous story levels and again as the first piece that plays during the game's version of the Duel on Mustafar. It also appears in the GBA and DS versions for the same game, specifically during the Duel on Mustafar level, although its exact version varied: The former had a synthesized version of the theme being played as depicted from the film, and the latter had the vocals, although based on the version from Attack of the Clones."}, {"tag": "p", "text": "It plays as Galen Marek fights PROXY, who is disguised as Darth Maul on Raxus Prime in the game Star Wars: The Force Unleashed (2008).  In the online game Ace Assault II (2011), the theme plays in levels four, ten, and sixteen, which pits Anakin Skywalker against Separatist commanders Grievous and Asajj Ventress and Jedi Master Mace Windu against the Sith Lord Darth Sidious. A few sections from the composition were included in the Return trailer for the MMORPG Star Wars: The Old Republic (2011) during a lightsaber duel between the Jedi Satele Shan and Kao Cen Darach and the Sith Darth Malgus and Vindican. The MMORPG utilizes a cut from the track \"Qui-Gon's Noble End\" that contains the theme whenever a gamer playing as a Sith Warrior takes off in his or her starship. A brief motif is also used when the Sith Inquisitor character kills Darth Zash and takes control of her Sith apprentices. The game Kinect Star Wars (2012) contains a game mode called \"Duel of Fates.\" In the mode, players combat Sith or other sword-wielding opponents with a lightsaber The game also features a dance move in the song \"Hologram Girl\" in the game's \"Galactic Dance Off\" mode titled \"Duel of Fates.\" The move consists of arching one's left hand over their head while extending their right hand away from their body and facing their right palm out and perpendicular to their arm. The dancer then nods their head as it faces right on beats two and three. Next, the dancer hops to the right and switches arm positions so that the left hand is now extended and the right is arched. The head turns and faces left before nodding on beats two and three again. An edited version is played on the boss battle levels of Angry Birds Star Wars II and on the main menu of \"The Pork Side,\" the half of the game where the player plays for the dark side."}, {"tag": "h4", "text": "Television"}, {"tag": "p", "text": "The theme is played in Star Wars: Clone Wars Chapters 18 and 19 (2004) during the battle between Anakin Skywalker and Asajj Ventress and concludes with Ventress's defeat. In the non-canon special LEGO Star Wars: The Empire Strikes Out, it is featured when Darth Maul first appears."}, {"tag": "h4", "text": "Audio books"}, {"tag": "p", "text": "The motif is also used as background music in the audio books for Attack of the Clones and Revenge of the Sith, published in 2002 and 2005 respectively. In the Revenge of the Sith audio book, the piece is played during the duel between Yoda and Palpatine in the Senate Retunda."}, {"tag": "h4", "text": "In-universe reference"}, {"tag": "p", "text": "According to the roleplaying game sourcebook Coruscant and the Core Worlds (2003) written by Craig Robert Carey, Chris Doyle, Jason Fry, Paul Sudlow, John Terra, and Daniel Wallace, curators of the Coruscant Ice Crypts claim to have heard faint hums of \"korah matah\" emanating from the halls of the underground tombs. Some believe this indicates that the tune may be of Zhell origin in-universe, as this is a phonetic excerpt of lyrics from \"Duel of the Fates\" and it was believed that remains in the Ice Crypts were those of the chiefs of the thirteen nations of the Zhell."}, {"tag": "p", "text": "In the non-canon LEGO Star Wars: The Yoda Chronicles feature Menace of the Sith, it is used in-universe as a theme played while the Sith clone Jek-14 demonstrates his skills, leading Maul to complain that Jek stole his theme song."}, {"tag": "h3", "text": "In other media and merchandise"}, {"tag": "p", "text": "The theme's sheet music appears in the sheet music books Music from Star Wars Episode I: The Phantom Menace (1999) and Star Wars: Episode II Attack of the Clones: Selections from the Original Motion Picture Soundtrack (2002) from Bantha Music. The books are available for the following instruments: trumpet, piano, easy piano, clarinet, flute, tenor sax, and alto sax, and the Attack of the Clones book is also available for trombone. The piece also appears in the music books Star Wars Episodes I, II & III Instrumental Solos and Star Wars: A Musical Journey: Episodes I-VI published by Alfred Publishing Co. in 2006 and 2007 respectively. These two are available for trumpet, piano, easy piano, clarinet, flute, French horn, tenor sax, alto sax, trombone, violin, cello, and viola. The book Selections from Star Wars, also from Alfred Publishing Co. and released July 1, 1999, features sheet music for the theme. The book is available for both treble clef and bass clef. The treble clef version was the original, but the bass clef version, a piano accompaniment version, and versions in the keys of C and B-flat were all released on September 1, 1999. A version in the key of E-flat was released on January 1, 2000. Each version contains arrangements for solos, duets, and trios. Arrangements in the treble clef version were done by Robert Shultz. All other versions have arrangements by Tony Esposito. All the books from Alfred Publishing Co. also come with CDs with tracks playing the parts for each song."}, {"tag": "p", "text": "Part of the piece is used in the first theatrical trailer for the 2008 animated film Star Wars: The Clone Wars. A music video for the theme consists of clips from The Phantom Menace alongside video of the recording sessions for \"Duel of the Fates\" and was used as a trailer for the film. This music video can also be played as a feature on the video game for The Phantom Menace. An article by Andy Collins in the Star Wars Gamer 1 magazine and an expansion set for the Young Jedi Collectible Card Game both share the name \"Duel of the Fates.\" The composition was utilized in the special features DVD of the 2004 original trilogy DVD box set in a featurette titled \"Episode III,\" which gave a sneak peak of the then-upcoming Revenge of the Sith video game. The theme was used in the first two official trailers for the animated series Star Wars Rebels, released on May 4, 2014, as well as an extended trailer released on July 21, 2014."}, {"tag": "h3", "text": "In Disney Parks"}, {"tag": "p", "text": "\"Duel of the Fates\" was previously used in the Jedi Training Academy show at the Tomorrowland Terrace restaurant in Disneyland Park in Anaheim, California when Darth Maul appeared from underneath the stage. The updated version of the show, called Jedi Training - Trials of the Temple, uses the theme if Darth Maul appears instead of Kylo Ren in both the Disneyland version and the version shown at Disney's Hollywood Studios at Walt Disney World. The theme also begins playing during the first shots of Takodana during the nighttime show Star Wars: A Galactic Spectacular, also at Disney's Hollywood Studios."}, {"tag": "h3", "text": "In popular culture"}, {"tag": "p", "text": "The composition has been featured on The Simpsons in the episode \"Please Homer, Don't Hammer 'Em...\" in which the characters Bart Simpson and Principal Skinner battle on top of a bus with sticks that have peanuts and shrimp attached to them. The theme also plays during Soulcalibur IV whenever a player chooses Starkiller and fights within either of the game's two Star Wars-themed stages, as well as during Starkiller's extended ending. The piece is also included at the end of a Verizon Wireless commercial that features R2-D2 as a promotion for the release of The Phantom Menace in 3-D. The Piano Guys did a medley of Star Wars themes called \"Cellowars,\" in which \"Duel of the Fates\" was the most utilized motif."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Christopher Coleman from Tracksounds.com, a soundtrack review website, stated that he felt the early release of the \"Duel of the Fates\" single \"set a high bar of expectation for the rest of the score.\" He felt that Williams had managed to create something different, yet still evocative.\nThe single lasted 11 days in the eighth position on Total Request Live's video debut countdown starting May 5, 1999."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}