{"url": "Duel_in_the_Tahv_aqueduct", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Kesh", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel in the Tahv aqueduct"}, {"tag": "p", "text": "A duel took place between the former Jedi Shadow Jelph Marrian and the former Sith Saber Orielle Kitai in 3960 BBY in the aqueduct system in Tahv, the Sith Tribe's capital city on Kesh. After discovering Marrian's Aurek-class tactical strikefighter hidden in his barn, the Sith-turned-slave Kitai journeyed to Tahv, hoping to use the ship to her advantage. Through the architect Gadin Badolfa, Kitai invited four High Lords to Marrian's farm. She then went to the city's aqueduct system, which she knew from memory, hoping to lure an aerial sentry to her to steal an uvak to return to the farm. There, she spotted Marrian, who had gone to the aqueduct to look for her and ambushed the former Jedi. However, they both lost their footing in the water, and Kitai lost her lightsaber. Marrian then convinced Kitai to trust him, and the two journeyed back to his farm together. There, they encountered Grand Lord Lillia Venn, who had been told of the starship by Kitai's mother, Candra."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "In 3963 BBY, the former Jedi Shadow Jelph Marrian had become stranded on the planet Kesh after his Aurek-class tactical strikefighter was caught in a meteor storm. For the next three years, he secretly repaired the starfighter while working as a local horticulturalist. He eventually developed a romantic relationship with a local Sith Saber Orielle Kitai, the daughter of High Lord Candra Kitai. In 3960 BBY, Kitai and her mother were wrongfully implicated in an attempted assassination attempt on the ruling Grand Lord Lillia Venn who had them reduced to the status of slaves. Fleeing retribution, Orielle took refuge at Jelph's farm, which was situated along the Marisota River."}, {"tag": "p", "text": "While Marrian was out hunting in the nearby jungle, Orielle was visited by the two Luzo brothers Flen and Sawj Luzo, who were the Grand Lord's enforcers. After killing her uvak steed, they informed her that her mother Candra had confessed to plotting with the Red and Gold Factions to murder the Grand Lord. To add insult injury, they confiscated her Sith lightsaber and gave her a spade to signify her status as a slave. Orielle was humiliated and greatly upset by the incident. She descended into a fit of rage and destroyed several of Marrian's plants and belongings."}, {"tag": "p", "text": "While rummaging through Marrian's barn, she discovered his starfighter under a pile of manure. Kitai then returned to the Sith capital Tahv where she alerted her mother to its existence in an attempt to regain her family's former status. Her mother advised her to inform four other High Lords through the architect Gadin Badolfa, a close family friend. While visiting her mother, Orielle also took the opportunity to steal another lightsaber from a Sith sentry she had knocked unconscious. However, Candra secretly informed Lillia about the existence of the starship in exchange for improved working conditions. Unaware of her mother's secret deal, Kitai carried out her mother's advice and went to Tahv's aqueduct, where she had planned to ambush an uvak rider and steal his uvak so that she could fly back to Marrian's farm."}, {"tag": "p", "text": "Meanwhile, Jelph returned to his farm and quickly discovered that Orielle had found his secret and had fled. Fearing that the Sith Tribe would pose a threat to the wider galaxy if they rediscovered interstellar travel, he travelled to Tahv in an attempt to stop her. By the time Jelph arrived, Orielle had already informed her mother and Badolfa. While walking through the streets of Tahv, the former Jedi Shadow was disturbed by the strong dark side presence and psychic energies emanating from its Sith inhabitants. After recalling that Kitai had told him that the city's aqueducts had been her favorite haunt, he made his way there."}, {"tag": "h3", "text": "The Duel"}, {"tag": "p", "text": "Jelph and Orielle encountered each other in the aqueducts. While Jelph was scanning the streets below with his macrobinoculars, he was pushed into the canal by Orielle. However, the Jedi fought back with his Force powers and lightsaber. After finding Orielle in the aqueduct's flume, he acknowledged that he was the owner of the starship and that he was also a Jedi. Ori was initially angry to see him and blamed him for all the misfortunes that had befallen her. She was angry with him for withholding his offworld origins from her. Marrian admitted that the starship belonged to him and that he come from the wider galaxy. When Jelph asked Orielle what she was doing in Tahv, she told him that she had already informed her mother about the existence of Jelph's starship."}, {"tag": "p", "text": "Marrian attempted to reason with Orielle by telling her that she was not power-hungry by nature unlike the other Sith. Orielle angrily retorted that she had not been herself and had succumbed to defeat. In response, Jelph replied that he had been attracted to her by her positive attributes. Orielle attempted to deny these attributes by stressing her Sith identity and her Tribe's ambitions of returning to the stars. Jelph countered by claiming that there were no more Sith in the wider galaxy. When Kitai counter-argued that Marrian's ship was a military starfighter, he acknowledged that a Sith known as Exar Kun had triggered the Great Sith War but that he and his followers had been eradicated by the Jedi. Jelph reiterated that the Tribe was the only remaining Sith community in the entire galaxy. He asked her to feel his thoughts and to sense that he was telling the truth."}, {"tag": "p", "text": "When Orielle vowed that her people would fight against the Jedi, Jelph responded that the Jedi were out looking for him and that they would also eventually discover the Tribe. Marrian reasoned that as long as his former colleague Jedi Master Lucien Draay was still alive, someone in the Jedi Order would be looking for the Sith. Unable to counter Marrian's arguments, Kitai asked what she could do if she could not save her family or her people. Marrian replied that Orielle should decide to choose her own course. Kitai also commented that the two of them would never be able to trust each other after that night."}, {"tag": "p", "text": "Orielle also sensed that Jelph had feelings for her. She sensed that he thought she was beautiful, desirable and trustworthy. However, she also sensed that Marrian was scrutinizing her every word in an attempt to trap her because she was as Sith. When Jelph acknowledged his feelings for her, Kitai expressed her discomfort and claimed that she was not able to live up to his expectations since she did not want to be weak and live a simple life. Jelph consoled Orielle by telling her that she could be strong but that she did not need to rule the galaxy. When Orielle replied that it was part of the Tribe's identity, Jelph countered that the Tribe was built on a lie since everyone was fighting for power, something that only one person could have. He reasoned that this was the primary reason why Sith philosophy was flawed and was doomed to failure."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "In the end, Orielle made peace with Jelph. She then admitted she had contacted several rival High Lords and told them that she had discovered something that would interest them. She had told them to meet her at Jelph's farm but conceded that she did not reveal the existence of the starship to them. These High Lords were supposed to meet Orielle at Jelph's farm tomorrow at sunset. Having reached an agreement that they had to hide the existence of the starship from the other Sith, Kitai and Marrian lured an uvak rider into the aqueduct with Marrian's blue lightsaber. After overpowering the Sith rider, they flew the uvak back to Jelph's farm. During their journey, Jelph and Orielle concocted a story to tell the High Lords in order to hide the starship. As part of their plan, Orielle would claim that she had found a sack of blasters, a technology unknown to the Sith. This would hopefully satisfy the visitors and possibly allow the Kitai family to regain their former status"}, {"tag": "p", "text": "Orielle and Jelph were pursued by several uvak riders but managed to arrive back at the farm. However, the visitors turned out to be the Grand Lord Lillia Venn herself. She had already been informed by Orielle's mother Kitai and wanted the starship for herself. However, she was stopped by Jelph who succeeded in killing the intruders by blowing up both the farm and the starfighter, destroying all evidence of his offworld existence and depriving the Tribe of a means of offworld travel. These events would be remembered as the Night of the Upside-Down Meteor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel in the Tahv aqueduct appeared as the climax of John Jackson Miller's EBook Lost Tribe of the Sith: Sentinel, which was released on February 21, 2011. It was told from the point-of-view of Jelph Marrian, one of the main protagonists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}