{"url": "Duel_near_the_Omen", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles of Kesh", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel near the Omen"}, {"tag": "p", "text": "A duel occurred in 5000 BBY, in the wreckage of the Omen, a Sith dreadnaught that crash-landed on the uncharted planet of Kesh during the Great Hyperspace War. The battle was waged between the half-brothers Yaru and Devore Korsin, over who would command the rest of the Omen's surviving crew. After a tense argument in the remains of their ship, Devore, who desired his brother's post as captain of the Omen, attacked Yaru while under the influence of Red Rage spice. The lightsaber duel continued outside the teetering dreadnaught, and, although Devore briefly gained the upper hand, Yaru regained the advantage after using the ship itself as a weapon. After being hit squarely in the shoulder by one of the Omen's torpedo tube doors, Devore ended up covered in rubble just meters from the edge of a steep cliff—although Devore was incapacitated, Yaru decided to drop his brother off the ledge to his death."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 5000 BBY, at the height of the Great Hyperspace War, Dark Lord of the Sith Naga Sadow sent the Sith dreadnaught Omen on a Lignan mining and delivery mission to the planet Phaegon III's largest moon. Among the Omen's crew were Yaru and Devore Korsin, half-brothers with a contentious relationship—Yaru was mission leader, while Devore headed the mining team. As the Omen prepared to transport their Lignan crystals from Phaegon III to their destination on the planet Kirrek, a Jedi attack resulted in the ship being knocked off course as it jumped to hyperspace."}, {"tag": "p", "text": "The severely-damaged Omen crash-landed on an uncharted planet known as Kesh. Although the Korsin brothers both survived the crash along with many of the crew, tensions soon arose over which Korsin would command the rest of the castaways, and the remaining Sith on Kesh were in dire straits. Desperate to find a way off Kesh, Devore unsuccessfully searched the Omen's wreckage in the Cetajan Mountains. Defeated, Devore collapsed in the captain's chair and took a dose of Red Rage spice. Yaru soon entered the ship as well, similarly trying to discover a means to facilitate their escape. An argument ensued between the two brothers, regarding whether there was any hope for their survival—eventually, Yaru broached the subject of a meeting that Devore had with Naga Sadow shortly before the mission started, where Devore unsuccessfully petitioned for command. Things grew more tense between the Korsins, and Devore, under the influence of spice, reacted in an outburst of rage and attacked."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "His natural rage and strength enhanced by the Red Rage spice, Devore used his connection to the Force to create a whirlwind, which turned nearby debris, including jagged pieces of transparisteel, into weapons that caused superficial wounds to Yaru's face. Yaru was able to shield himself before he took too much damage, and he flung his brother out of the teetering Omen. However, as Yaru stepped out of the ruined starship, he was distracted by a large winged creature that seemed to be observing the battle. That diverted Yaru's attention long enough for Devore to gain the upper hand, throwing Yaru against the Omen's wreckage."}, {"tag": "p", "text": "Emboldened by his advantage, Devore proclaimed himself to be the true \"Commander Korsin.\" From there, the fighting turned into an all-out lightsaber duel, although Devore found his furious attacks repeatedly parried. Thinking on his feet, Yaru attempted to fire a torpedo from the Omen's exterior tubes by manipulating the control box from the outside—however, the doors were partially stuck in the ground, and, although the torpedo did not emerge, the doors hit Devore in the shoulder and sent him flying. Devore came to a stop at the edge of a sheer cliff overlooking a nearby ocean, and, partially covered with rubble, he was gravely wounded and unable to see. Although Yaru considered helping his brother, he decided against it, allowing Devore to drop off the ledge to his death."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By chance, the battle was witnessed by native Keshiri female Adari Vaal, who was riding the winged uvak that had distracted Yaru during the duel. With her help, the surviving Sith convinced the rest of the Keshiri that they were their gods, the Skyborn, with Yaru proclaimed as Grand Lord of Kesh. The crew of the Omen and their descendants formed a Sith tribe that survived for thousands of years. Devore Korsin was not forgotten by his family—although his wife, Seelah, married Yaru and had a daughter, Nida, with him, she secretly plotted to avenge her husband's death. Her plot was carried out in 4975 BBY, when Seelah arranged for her and Devore's son, Jariad, to attack Grand Lord Korsin with a group of Sith warriors. Although Yaru died during the skirmish, Jariad was also killed and Seelah incapacitated. Nida, who fought along with her father, became the new Grand Lord."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel first appeared in Lost Tribe of the Sith: Precipice, a 2009 eBook written by John Jackson Miller. It was also briefly featured during the eBook's follow-up, Lost Tribe of the Sith: Skyborn, along with mentions in two other sequels. An image of Adari Vaal observing the duel was included in the 2012 reference book The Essential Reader's Companion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}