{"url": "Duel_on_Cophrigin_V", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles in the Ash Worlds", "Category:Battles of the Great Jedi Purge", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Cophrigin V"}, {"tag": "p", "text": "Shortly before the Battle of Yavin, a lightsaber duel was fought on the fifth planet of the Cophrigin system between exiled Jedi Master An'ya Kuro and Darth Vader, Dark Lord of the Sith. After Kuro, known only to her pursuers as \"the Dark Woman,\" was tracked to her hiding place on Cophrigin V by the Emperor's Hand Mara Jade, Darth Vader was dispatched by his Sith Master, Darth Sidious, to the Outer Rim Territories to find and eliminate the rogue Jedi. In doing so, Vader hoped to complete his Master's plan for the eradication of all Jedi, as ordered and initiated by Sidious himself nearly two decades prior."}, {"tag": "p", "text": "Darth Vader's arrival on Cophrigin V was sensed by Kuro, and the Jedi Master prepared herself for an encounter with the Dark Lord. Vader found Kuro in her sanctuary and quickly attacked with expectations of cutting her down swiftly, but he was surprised by the skill with which his opponent dueled. Kuro overcame Vader on several occasions, once through use of the Force to subdue him with the surrounding flora and again when she knocked his lightsaber from his grasp. However, the Dark Woman's own strength began to wane before the increasing dark side power of Darth Vader, and she was defeated when the Dark Lord used his lightsaber and the Force to fell a massive tree, which pinned the Dark Woman beneath it. He then moved in for the kill, and An'ya Kuro's body vanished into the Force. Her demise on Cophrigin V resulted in a victory for Darth Vader and one of the final Jedi deaths of Lord Sidious' Great Jedi Purge."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Almost two decades had passed since the Galactic Republic had been overthrown by the Order of the Sith Lords and replaced with the establishment of a Sith-governed Galactic Empire. The Jedi Order, stewards of the Republic since its inception, had been all but exterminated in a purge initiated by the Sith's Dark Lord, a man known as Darth Sidious. On the same day that the Republic fell and was reorganized into the Galactic Empire, Sidious, in his guise as Supreme Chancellor Palpatine, issued an order to the clone troopers of the Grand Army of the Republic to execute all Jedi without question, thus enacting the Great Jedi Purge. Nearly all were killed, and most of the survivors were hunted down by agents of Sidious' Empire in the years that followed. One such individual was a Human female Jedi Master named An'ya Kuro, known only to Imperial spies as the \"Dark Woman.\""}, {"tag": "p", "text": "Reports of Kuro's whereabouts in the Outer Rim Territories eventually reached Sidious through one of his operatives, Emperor's Hand Mara Jade. Jade was ready and willing to dispatch the Jedi fugitive and even vied with the Emperor's Sith apprentice, Darth Vader, for the mission, but Sidious assigned the task of hunting Kuro down to Vader, given his reputation for being able to find and eliminate Jedi Knights—wherever they hid. Vader promptly left for the fifth planet in the Cophrigin system with a contingent of Imperial stormtroopers in search of the Dark Woman."}, {"tag": "p", "text": "When Vader's Lambda-class shuttle touched down on Cophrigin V, he advised his accompanying stormtroopers to maintain their position with the craft, as his mission did not require their support. The Dark Lord's arrival was sensed through the Force by Kuro, who, in an acceptance of fate, ceased her meditation and readied herself to face Darth Vader in battle. It was not long before Vader appeared at the threshold of a lush sanctuary and was greeted by the mysterious Dark Woman."}, {"tag": "h2", "text": "The duel"}, {"tag": "h3", "text": "Formidable opponents"}, {"tag": "p", "text": "An'ya Kuro engaged in a conversation with her executioner that eventually led to a philosophical debate that concerned both the dark and light sides of the Force. Vader's position was that the power of the dark side was greater than that of the light—something that he believed would be obvious to a being who referred to herself as the Dark Woman. Kuro, however, claimed that while the dark path was one easily undertaken, it was one only embarked upon by the faint-of-heart. Her words enraged Darth Vader, who ignited his lightsaber and struck at Kuro. The Dark Woman parried his blow, and an intense duel ensued."}, {"tag": "p", "text": "Darth Vader had fully expected to defeat the Jedi Master with relative ease, but he was amazed to be faced with an opponent of advanced age and sufficient skill to contend with a Sith Lord. Kuro noted Vader's exceptional dueling talent as well before lunging at him, performing a series of acrobatic maneuvers in an attempt to overwhelm her adversary. The Dark Lord was unrelenting in his defense, and when ample distance had been placed between them, Vader reiterated his belief in the superiority of the dark side as he hurled boulders at Kuro with the Force, only to have them cut to pieces by her purple blade. She then used the Force to manipulate the surrounding plant life and subdue Vader with thorn-covered vines, which rendered the Dark Lord temporarily immobile. Vader was able to block the attack that followed, however, and was also able to repel the Jedi Master as he escaped the plant-restraints under her command."}, {"tag": "h3", "text": "The Dark Woman's defeat"}, {"tag": "p", "text": "This time Vader advanced with powerful blows, but these were checked as the Dark Woman retaliated and disappeared into the cover of a nearby waterfall. She emerged behind Darth Vader and caught him unawares, giving her the opportunity to knock his lightsaber from his grasp. Her advantage was short-lived, however, as Vader seized her arm and forced her own lightsaber from her hand. Realizing that the Dark Woman's strength was diminishing, the Sith Lord cast her aside and recalled his own weapon as he prepared to finish her. Kuro recovered her lightsaber but was backed up against an enormous tree. With nowhere to run, Vader sliced the trunk with his lightsaber and used the Force to bring it down upon the Dark Woman. Pinned beneath the tree, Kuro laid helplessly as Vader brought his blade down for the killing stroke. Her body then disappeared into the Force in the manner of Jedi Masters, leaving only her robes and a victorious Darth Vader."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Immediately after her death, An'ya Kuro appeared to Darth Vader as a Force ghost. Addressing him as Anakin Skywalker, the man he was before he embraced the dark side of the Force, Kuro stated that in death, she proved that the light side of the Force possessed greater power and that she saw within him the potential to become free of the dark side's influence. Vader, however, did not seek emancipation and struck at the apparition with his lightsaber in defiance of his former identity. Kuro's ghost then vanished, and Darth Vader departed, having successfully executed yet another victim in accordance with the Great Jedi Purge."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel on Cophrigin V first appeared in author Ron Marz's two-part comic series titled \"Extinction\", which was featured in Star Wars Tales 1 and Star Wars Tales 2. It was later compiled into a trade paperback version, Star Wars Tales Volume 1. Plausible stories in Star Wars Tales 1–20 were initially considered S-canon until referenced in a non-Tales source, at which point the subject matter was elevated to C-canon. An'ya Kuro's death at the hands of Darth Vader was later mentioned in both The New Essential Guide to Characters and The Complete Star Wars Encyclopedia, thus raising the event to C-canon."}, {"tag": "p", "text": "The duel resulted in one of the final deaths of Sidious' Great Jedi Purge, an event which began officially with the Showdown on Coruscant in Star Wars: Episode III Revenge of the Sith. The contest between Kuro and Vader also saw the first use of \"Plant Surge\", a light-side Force power that was later explained with great detail in Wizards of the Coast's Power of the Jedi Sourcebook, a guide for the Star Wars Roleplaying Game."}, {"tag": "p", "text": "At the end of the duel, the dialogue between An'ya Kuro and Darth Vader was altered between the original two-part version found in Star Wars Tales 1 and Star Wars Tales 2 and the trade paperback version in Star Wars Tales Volume 1, which combined the two. The changed dialogue is found when the Dark Woman's Force ghost appears before Vader. In the original version, the Dark Woman speaks to Darth Vader and calls him by his original name, thus eliciting a response from him; in the trade paperback version, only the Dark Woman speaks as Vader listens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}