{"url": "Duel_on_Chelloa", "categories": ["Category:Legends articles", "Category:Battles of Chelloa", "Category:Battles of the New Sith Wars"], "nodes": [{"tag": "h1", "text": "Duel on Chelloa"}, {"tag": "p", "text": "The Duel on Chelloa was a duel between the Sith Lord Daiman and the Jedi Knight Kerra Holt at Daiman's compound on Chelloa during the Chelloa campaign of the Republic Dark Age."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "During Operation Influx, the Jedi Master Vannar Treece and a team of Jedi disrupted the shipment of baradium ores within the Daimanate by raiding Oranessan and Chelloa. However, Operation: Influx came to an untimely end on Chelloa when the entire strike team with the exception of Jedi Knight Kerra Holt were wiped out during a confrontation with Sith Lord Odion, the leader of the Odionate principality and the estranged elder brother of Daiman. Holt was the sole Jedi survivor and was sheltered by Gorlan Palladane, a former Jedi Knight and undercover Jedi agent who had supplied intelligence on Chelloa to Treece. Gorlan also led the Chelloan resistance, an underground resistance dedicated to covertly assisting the Republic and Jedi in their war effort against the Sith."}, {"tag": "p", "text": "Since the baradium operations on Chelloa were secret, Daiman sought to investigate how intelligence was leaked to his rival Odion. He apprehended the Rodian mechanic Skodo, a member of the Chelloan resistance, and had him tortured to death with Force lightning at his alpine compound above the mining colony of Jenith."}, {"tag": "h3", "text": "The duel"}, {"tag": "p", "text": "Hijacking the shuttle used to deliver one of Daiman's statues, Kerra Holt flew to Daiman's compound and landed in the hangar bay. Preoccupied with tormenting Skodo, Daiman did not sense Holt infiltrating the compound, quietly eliminating the guards outside the chamber. She sneaked a room and hid on top of one of Daiman's statues. After Daiman had finished with the deceased Skodo, he ordered his guards to remove the deceased Rodian from his chamber. However, he noticed that one of his statues had been beheaded. While Daiman was taken by surprised, Holt launched her attack, destroying the statue and pushing Daiman to the ground."}, {"tag": "p", "text": "Amidst the scuffle, Holt trapped Daiman in a suspension field. She attended to Skodo but sensing no pulse, realized he was dead. She confronted Daiman verbally, attacking his destruction of Chelloa's environment and the use of slaves to operate his mobile munitions complexes. Daiman defended his actions by affirming his belief in the Sith tenet of self-glorification and reiterating his philosophy that reality was an illusion. While using his Force abilities to free himself from the suspension field, he distracted Holt by revealing that Odion was planning a second attack and had a mobile space station—The Spike—capable of producing more of the deadly world-destroying kinetic corruptors."}, {"tag": "p", "text": "Breaking free, he managed to reactivate his lightsaber and turned to confront Holt. However, Holt had fled and hijacked one of Daiman's starfighters, knocking out the pilot. Daiman had dispatched a flight of starfighters to attack Odion's space station. Rather than aborting the mission, Daiman viewed Holt as a tool against his main rival Odion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel on Chelloa first appeared in Knight Errant: Aflame 2 as a plot device leading to the climax. It also sought to provide readers with more insight into the motives and nature of two major characters important to the plot: Jedi Knight Kerra Holt and her opponent Sith Lord Daiman"}, {"tag": "h2", "text": "Appearances"}]}