{"url": "Duel_on_Byss", "categories": ["Category:Legends articles", "Category:Articles with unconfirmed titles", "Category:Battles of Byss", "Category:Battles of Operation Shadow Hand", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Byss"}, {"tag": "p", "text": "The Duel on Byss was a battle between Luke Skywalker and Palpatine in the latter's clone labs on Byss."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "After Luke Skywalker made a partial turn to the dark side of the Force and became apprentice to Palpatine, his sister, Leia Organa Solo, traveled to Byss in an attempt to rescue him. Unfortunately, she only succeeded in getting herself, Han Solo, Chewbacca and C-3PO captured. Palpatine was quick to take advantage of this and attempted to turn Leia to the dark side as well. Tempting her with a Jedi holocron he had in his possession, and stirring her anger by revealing his twisted intentions for her unborn child, his attempt backfired and she fled in anger."}, {"tag": "p", "text": "Aided by Luke, who had been secretly sabotaging the Emperor's schemes, she fled along with Han, Chewbacca, C-3PO and R2-D2. Furnished with the master control codes for the World Devastators attacking Mon Calamari, she allowed the New Republic forces to win the battle. Meanwhile, Luke finally engaged in open rebellion against Palpatine."}, {"tag": "h3", "text": "The Duel"}, {"tag": "h4", "text": "Palpatine's Clones"}, {"tag": "p", "text": "As the Emperor's current clone body lay dying in the lab, Luke Skywalker stormed in and confronted Palpatine, lightsaber drawn. When Palpatine threatened to transfer his consciousness into Skywalker himself, Luke called his bluff. Sitting back, Palpatine allowed his current body to die in a flash of Force energy. Realizing that Palpatine could only enter a living body, Luke went on a destructive spree through the clone lab, shattering one tank after another, sending the Sith Lord's genetic offspring to mindless, babbling deaths."}, {"tag": "p", "text": "Unfortunately for Luke, one of the bodies was not quite dead. Rising to his feet in his new body, the Dark Lord of the Sith faced the Jedi Master. Stating his belief in Luke's inferiority, Palpatine was then smashed against one of the walls of the lab by a Force Push."}, {"tag": "h4", "text": "Turning the Tables"}, {"tag": "p", "text": "Seizing one of the lightsabers mounted on the wall next to him, a relic of the Jedi Purge, Palpatine ignited it and charged Luke. Gathering strength moment by moment, the young Emperor lashed out with the Jedi weapon, pushing Skywalker to his limits. Despite his mastery of Form V lightsaber combat, Luke was forced to draw on all his resources simply to parry the Emperor's blows. Locking blades, they had a brief exchange, Luke stating his belief in the dark side's ultimate failure, Palpatine reaffirming his belief in the dark side, and thusly his own, superior strength."}, {"tag": "p", "text": "In a sudden display of incredible strength, Palpatine pushed forward, breaking the blade-lock and swung his saber downwards, pivoting to the side as he did so. His sudden move flicked Luke's lightsaber aside and caused the Jedi to lose balance. As Luke fell, Palpatine advanced, his saber at Luke's throat. Holding the Jedi at bladepoint, Palpatine completed Luke's turn to the dark side, reducing him to a subservient watchdog."}, {"tag": "p", "text": "In addition, to further ensure that Luke had turned to the Dark Side, he also inserted himself into Luke's mind and proceeded to break Luke's spirit until Luke was left significantly broken to the extent that he even disavowed his own name."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Palpatine immediately afterwards journeyed to the Pinnacle moon in his flagship; Eclipse; with a subservient Luke Skywalker in tow. Contacting the New Republic leaders, he demanded the presence of Leia and the return of his Jedi holocron, and promised to discuss a truce with the Republic. Leia complied to the Emperor's demand for her presence, but left the holocron behind. Thanks to her, Luke managed to shake off the shroud of the dark side completely and turned on Palpatine."}, {"tag": "p", "text": "After a swift rematch, Luke won but Palpatine, in a display of defiance, summoned a Force storm and began to destroy the Republic fleet. Luke and Leia banded together and temporarily cut off Palpatine's connection to the Force, and thusly control of the Force storm. While the wayward storm destroyed Eclipse and killed the Emperor, Luke and Leia fled, and Luke announced his plans to rebuild the Jedi Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel on Byss first appeared in the issue Dark Empire 5 of the Star Wars: Dark Empire series of comics. The battle was conceived and written by authors Tom Veitch, was drawn by artist Dave Dorman and colored by colorist Cam Kennedy. Veitch used this as one of the conflicts leading up to the final climax between Palpatine and the Skywalker twins during the Battle of Pinnacle Base."}, {"tag": "p", "text": "The Duel on Byss would eventually be featured in the Dark Empire audio drama, which witnessed the intensity of the duel take on a whole new personality through the voice acting of John Cygan (Luke Skywalker) and Nick Jameson (Emperor Palpatine). This duel is one of the shortest lightsaber duels illustrated in a comic, only taking up a total of three panels over the course of two pages."}, {"tag": "p", "text": "In real-world chronological order of publishing, this is the first lightsaber duel to feature both the Jedi and Sith Lord involved wielding blue lightsabers. The act of Palpatine taking his lightsaber off of a wall in the room could possibly be seen as a metaphor for the Chekhov's gun literary technique, which states that if a loaded gun (represented in this case as a lightsaber) is placed on a wall, then it should either be used or otherwise not exist in the story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}