{"url": "Duel_on_Coruscant_(Inter%E2%80%93Sith_Wars_Period)", "categories": ["Category:Cite web with invalid archivedate format", "Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Duels", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Duel on Coruscant  (Inter–Sith Wars Period)"}, {"tag": "p", "text": "Around seventy-five years before the beginning of the Great Galactic War, a lightsaber duel occurred on the Galactic Republic's capital world of Coruscant. The duel was fought between Jedi Master Barel Ovair and his former apprentice, the Nautolan Eison Gynt. After being abandoned by Ovair years before on Yavin 4, Gynt had become possessed by the spirit of the long-dead Dark Lord of the Sith Naga Sadow. Sadow sought to kill Ovair, who was in fact an agent of the reformed Sith Empire and was operating within the Republic as a spy in preparation for the Sith's future invasion of the Republic. The possessed Gynt attacked Ovair on Coruscant but was defeated in the ensuing duel. In killing his former apprentice, Ovair also fulfilled a directive handed down to him by the Sith Emperor—to neutralize the spirits of past Sith in order to avoid complications when the Empire's invasion commenced."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following the end of the Jedi Civil War and the resulting Dark Wars, the Galactic Republic enjoyed a period of peace and expansion. The Republic, however, was unaware of a growing threat in the Unknown Regions—the reformed Sith Empire, which was preparing itself for war. As part of his preparations for the war, the Sith Emperor dispatched agents of the Empire to infiltrate the Republic and begin destabilizing the government prior to the arrival of the Sith military."}, {"tag": "p", "text": "Among these agents was the Ovair family, which had been tasked with infiltrating the Jedi Order. As Jedi, the Ovairs traveled the galaxy, ostensibly to research locations strong in the dark side of the Force. In truth, they were working to neutralize the spirits of dead Sith Lords who might attempt to challenge the rule of the Sith Emperor upon his return to known space. In 3756 BBY, Jedi Master Barel Ovair and his Padawan, Eison Gynt, undertook a mission to Yavin 4—the jungle moon that served as the final resting place of the ancient Dark Lord of the Sith Naga Sadow. Although Ovair intended to destroy Sadow's lingering spirit, his plan was side-railed when the Jedi were attacked by Sadow's surviving Massassi warriors and were forced to flee deep into Sadow's tomb. Ovair abandoned Gynt there and fled back to Coruscant, where he claimed that his apprentice had been killed."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Several years after the events on Yavin 4, Gynt returned to Coruscant. The young Jedi had been possessed by the dark spirit of Sadow and was committed to finding and killing his former Master. Garbed in the apparel of a Massassi warrior, the Nautolan attacked Ovair in broad daylight. A crowd formed around the two as they dueled, with Gynt attacking with his single green blade and Ovair defending himself with his purple double-bladed lightsaber."}, {"tag": "p", "text": "Despite the dark powers granted to Gynt by Sadow, Ovair was able to strike down his apprentice by cutting him across his torso. Gynt's death also resulted in the neutralization of Sadow's spirit."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Ovair's victory was lauded by the Jedi, and the Jedi High Council assumed that despite the tragedy that had befallen young Gynt, the situation had passed, and that there was no reason for further concern. Ovair continued in his capacity as a Jedi Master, and around seventy-five years later, the Sith invaded the Republic. It wasn't until after the conclusion of the resulting Great Galactic War that inquiries were made into the events surrounding the duel. It was then that Jedi historian Gnost-Dural discovered the Ovair family heritage and their role in the preparation for the invasion by the Sith Empire. Satele Shan, the Jedi Grand Master of the era, concurred with Gnost-Dural's research and included notes on the duel on Coruscant in a wartime journal submitted to the Jedi Archives on Tython."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel on Coruscant was first seen in the seventh entry of the Galactic Timeline, a series of online video entries created to provide background story to the LucasArts/BioWare video game, Star Wars: The Old Republic. The entry, titled Peace for the Republic?, is available on The Old Republic's official website. It is narrated by Jedi Master Gnost-Dural, whose voice is provided by actor Lance Henriksen. The duel was again mentioned and pictured in The Journal of Master Gnost-Dural, a book released within collector's editions of Star Wars: The Old Republic."}, {"tag": "p", "text": "Peace for the Republic presents a continuity disparity regarding the destruction of Naga Sadow's spirit. While The Complete Star Wars Encyclopedia claims that the Dark Lord Freedon Nadd destroyed Sadow's spirit in 4400 BBY, the Timeline states that the destruction instead took place during this duel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}