{"url": "Duel_on_Hutta", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Battles of the Cold War (Galactic Republic–Sith Empire)", "Category:Battles of Nal Hutta", "Category:Duels", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Duel on Hutta"}, {"tag": "p", "text": "The search for Jaesa Willsaam, the Jedi padawan of Nomen Karr, one of Darth Baras' most hated enemies, came to its conclusion on Hutta after Nomen Karr challenged Baras to come and face him directly. Instead Baras, who considered himself above such a face off, sent his powerful apprentice to kill Karr."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the missions on Tatooine and Alderaan were completed, the Sith apprentice of Darth Baras was forcibly given a transmission by Jaesa Willsaam's ship, with Jaesa seemingly eager to resolve the conflict between her and him. With mixed responses from Malavai Quinn and Vette, the Sith Warrior traveled to the coordinates of Jaesa's ship and boarded it, only to find two Jedi Knights instead: Ulldin and Zylixx."}, {"tag": "p", "text": "According to the two, Nomen Karr discovered his Padawan's attempt at negotiation and stopped it, having it replaced by a ruse of the Jedi Master. The two Jedi fought the Warrior, only to die by the Sith Warrior's hands."}, {"tag": "p", "text": "After the future Emperor's Wrath left the ship, he reported to Darth Baras, who then informed his apprentice that Karr even asked Baras to fight him in person. The Sith Warrior volunteered to fight the Jedi Master, which Baras agreed to."}, {"tag": "p", "text": "The Sith Warrior then traveled to Hutta, traversing the treacherous swamps and marshes until he reached Nomen Karr's safe house; he then found the Jedi Master meditating. Nomen Karr deduced that his two apprentices were dead and accused Baras of being a coward and the Warrior of being a disciple of the dark side. The Warrior noted that the Jedi Master seemed upset, to which Karr admitted that the Sith's crusade had affected him. But he proclaimed that he evaded falling to the dark side before and will defeat the Warrior. The Sith taunted that his connection to the light was sputtering. The Jedi Master and dark side student then pulled out their respective blades. Karr swore to have Jaesa provide to the Jedi Council the information of Baras's spy network and expose it. The Sith Warrior then fought the Jedi Master."}, {"tag": "h2", "text": "Duel with Nomen Karr"}, {"tag": "p", "text": "The duel between the future Emperor's Wrath and Nomen Karr was deadly and violent. Karr fought initially in a defensive form, holding off the Sith Warrior's lightsaber and Force attacks for a while, until he was Force Pushed and knocked down to the ground. Seeing the Sith's strength, Karr desperately gave in to his frustration and anger to augment his strength."}, {"tag": "p", "text": "Karr fought more aggressively against the Sith Warrior, pushing the disciple back, but the Warrior counterattacked the Jedi Master until Karr was exhausted. Desperate and weakened, Karr fully embraced his rage and hatred, even displaying quick signs of dark side corruption, and screamed he won't fall. He attacked the Warrior, but he pushed the Jedi Master back. The Warrior then declared himself invincible. After another intense round of dueling, the Warrior finished the duel with the Jedi Master by cutting his arm. Nomen Karr finally gave up and succumbed to his mortal wound, but knew that if he died, Jaesa will be safe."}, {"tag": "h2", "text": "The Padawan exposed"}, {"tag": "p", "text": "After Nomen Karr gave up and lost to Baras's apprentice, a squad of Imperial troops arrived under orders from Baras to preserve the last of Nomen Karr's strength. Nomen Karr refused obstinately to continue to live, willing to die to protect Jaesa. But the Warrior wasn't finished: he was going to torture him. Karr then passed out. The Imperial troopers revived Karr then left the safe house. Karr was distraught by the fact that he was allowed to live; he yelled and goaded at the Sith Warrior to continue torturing him and that he would defeat him and Baras."}, {"tag": "p", "text": "Reports subsequently came to the Warrior that Jaesa had arrived, commanding the Warrior to let Karr go. Karr, horrified at seeing Jaesa, berated her for arriving to protect him. Jaesa, seeing the signs of dark side corruption on her Master's face, accused the Warrior of making Nomen Karr insane. The Sith denied this by saying he only exposed what was lurking inside of him; he even asked Willsaam to use her powers on Karr for the proof. Jaesa complied, sensing anger, hate, pride and vengeance in her master. Jaesa was horrified by this and began to doubt what Karr said about being a Jedi was true. Karr desperately yelled at Jaesa to look into the Sith. The Sith agreed; once Jaesa complied, she sensed the same darkness inside of him. Karr again berated her for not knowing the immediate truth about the Warrior, and not seeing the death of her parents and Master Yonlach as proof. Jaesa, feeling guilty, vowed to protect Karr and defeat the Warrior."}, {"tag": "p", "text": "The Warrior then goaded her to strike him down. The confused Padawan refused to be baited and dueled the Sith. Nomen Karr couldn't bear to sit there and watch his apprentice duel the Sith Warrior. The two dueled violently and intensely, but only for the Sith to win the duel. Before he could deal the final blow, he held back, believing Jaesa Willsaam could be useful."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Jaesa was frustrated that she couldn't beat the Warrior, doubting the Jedi, her use of her powers and the credibility of Karr's claims of the light side capable of beating the dark side. The Warrior arrogantly remarked that even though Karr was a light side Master, he couldn't beat Baras's apprentice."}, {"tag": "p", "text": "Jaesa openly expressed how her whole life she was deceived and useless to the people around her, feeling like she belonged nowhere. The Sith Warrior offered to teach her the ways of the dark side on one condition: to kill Karr. The Jedi apprentice grew confused of whether or not she should. The Warrior wouldn't be dissuaded, so Jaesa, with growing emotions, complied. Karr desperately begged Jaesa to avoid the Sith for turning her into a killer. Jaesa twisted his words around by saying the Jedi used that as justification for their deceitful acts. She then beheaded him. Jaesa then pledged allegiance to the Sith Warrior with her newfound emotions and a bloodlust rising."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}