{"url": "Duel_on_Mimban", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War", "Category:Battles of Mimban", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Mimban"}, {"tag": "p", "text": "This duel was fought between the Sith Lord Darth Vader and the Jedi Apprentice Luke Skywalker with Princess Leia Organa in the Temple of Pomojema on the planet Mimban in 2 ABY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After fighting off Imperial forces in the Mimban jungles with the aid of the natives, Luke Skywalker, Leia Organa, the Yuzzem Hin and Kee, and Halla arrived at the Temple of Pomojema to find and retrieve the Kaiburr crystal. While they located the crystal in the ceremonial statue of Pomojema fairly quickly, they were suddenly assailed by a massive Hssiss that apparently nested below the statue."}, {"tag": "p", "text": "Sending the Yuzzem back to their vehicle to get rifles, Luke confronted the beast with his lightsaber. After a lengthy battle, during which the Yuzzem did not arrive, Luke attempted the insane and sliced one of the temple's support columns. While the Hssiss was vanquished, Luke himself was pinned under a large boulder. As one of them prepared to go out to the vehicle to get the Yuzzem to help move the rock, Darth Vader arrived, intending to obtain the Force-enhancing Kaiburr crystal and capture Luke and Leia."}, {"tag": "p", "text": "Pleasantly informing the rebels that he had killed the Yuzzem and shut off the droids, Vader began a casual rant about the difficultly he had in finding Luke and discerning his identity, before drawing his lightsaber. Quietly threatening Luke, Vader playfully swung his saber, slashing at the stone walls. Turning his attention to Leia, he taunted her about the \"interview\" with governor Tarkin, aboard the Death Star. This proved too much for Leia, who took up Luke's lightsaber and stood against Vader."}, {"tag": "h2", "text": "The Duel"}, {"tag": "p", "text": "Vader approved of her courage, but considered her attempt foolish. Willing to humor her, Vader let his weapon arm drop to his side in a feint. A daunted Luke then called out Leia, asking her to use the weapon to kill the both of them, as he saw the situation as hopeless. However, Leia had been too spun up by Vader's taunts to back down now, and she attacked. Vader easily parried the blow, but suddenly Leia spun around and cut at Vader's head. Her blade actually grazed Vader's helmet, and only the Sith Lord's superhuman reflexes enabled him to block the blow in time."}, {"tag": "p", "text": "Seeing this, Luke thought there might be some hope after all, and fought to free his leg. Vader complemented Leia while admitting his own overconfidence, and adjusted his stance. Stating that he would not be guilty of such overconfidence again, he attacked. Leia, backpeddling, managed to block the first attack and the follow-up blow, but she was now forced onto the defensive. She was unable to mount her own offense against Vader's furious attack."}, {"tag": "p", "text": "While the duel wound on, Halla, unnoticed by all, had been climbing the statue of Pomojema towards the crystal. Finally reaching it, she removed it from its housing before climbing back down the statue with it."}, {"tag": "p", "text": "As Halla took the crystal, Vader cut down at Leia before feinting and slashing her across her midsection. As Leia's free hand went to the wound, Vader stayed on her, allowing her no respite, and slashed her across the cheek. As Leia slowed from the pain and fatigue, Vader taunted again, prompting her to attack. Vader easily blocked the blow and countered, the force of his blow sending her tumbling. He quickly slashed her across the back of her left leg as Leia attempted to rise."}, {"tag": "p", "text": "Screaming, Leia rolled away from Vader and somehow regained her feet, but it was clear she had nothing left. As Leia backed away from Vader, Luke suddenly noticed the rock pinning him was moving. Looking over it, he saw that a horribly wounded Hin was moving it. As the fatally injured Hin managed to start moving the stone, Vader continued to taunt Leia with a number of false cuts and jabs, before slashing her across the chest."}, {"tag": "p", "text": "At that moment, Hin managed to free Luke."}, {"tag": "h3", "text": "Luke's intervention"}, {"tag": "p", "text": "Luke promptly charged towards the duelists, calling out to Leia. Leia managed to toss the lightsaber to Luke, despite Vader's attempt to intercept it. As Luke rolled across the floor and retrieved the saber, he somehow managed to end up behind Vader, standing between the Sith Lord and the fallen Leia. When he attempted to ascertain Leia's condition, Vader stated that he shouldn't be worried about her, but about himself instead."}, {"tag": "p", "text": "Surprisingly, Luke replied that he wasn't worried at all, before stating his intention to kill Vader. As Vader taunted, Luke stated that he was Obi-Wan Kenobi. Initially shaken, Vader countered with the fact of Kenobi's death. Claiming that he had Kenobi and the Force on his side, Luke prompted Vader to attack."}, {"tag": "p", "text": "Vader lunged at Luke, and as Luke dodged, Vader telekinetically hurled a chunk of debris at him. Luke managed to intercept the rock with his own, considerably smaller rock. When the two collided, Vader's rock was deflected just enough by Luke's that it missed him. Complementing Luke's skill, Vader continued to state his belief in his own superior strength, claiming that \"my stone was heavier. My powers are stronger.\""}, {"tag": "p", "text": "Luke quietly retorted, before pressing the attack. Thanks to assistance from the spirit of Obi-Wan Kenobi, he proved able to drive the Sith Lord back. In desperation, Vader telekinetically toppled one off the walls on Luke, who leapt back just in time."}, {"tag": "p", "text": "Vader again complemented Luke's skill, before charging over the broken wall, pushing Luke back with his relentless assault of lightsaber and telekinetic attacks. As the two circled in the center of the temple, Leia finally succumbed to her wounds and passed out. During a brief pause in their combat, Vader declared that Kenobi had trained Luke well, well enough to be a challenge for Vader. But Vader quickly stated that he enjoyed a challenge. As Luke retorted, Vader suddenly leapt into the air and threw his lightsaber at Luke."}, {"tag": "p", "text": "Luke managed to block the lightsaber, but the kinetic energy of the throw proved enough to disarm him, sending both of their lightsabers skittering over to a sacrificial well in the temple."}, {"tag": "p", "text": "As the duel had progressed, Vader had realized that the Kaiburr crystal was not only increasing both his and Luke's connection to the Force, but causing him to lose control of his anger. Vader had come to Mimban wanting only to capture Luke and Leia, but had ended up nearly torturing Leia to death and was now actively trying to kill Luke. His proximity to the crystal affecting both his emotional control and his powers, Vader launched a sphere of \"Force energized lightning\" at Luke."}, {"tag": "p", "text": "Luke, operating on pure instinct, was able to deflect the lightning back at Vader, who was thrown off his feet. As a shocked Vader rolled onto his side, Luke crawled towards his lightsaber. As the two retrieved their lightsabers, Luke attacked, bashing aside the Sith Lord's block and cutting off his right arm. Luke dropped the lightsaber and collapsed, totally exhausted, both his power and Kenobi's power pushed to the limit."}, {"tag": "p", "text": "Vader, also incredibly fatigued, managed to remain on his feet. Tottering towards his severed arm, the Sith Lord calmly removed his saber from its dead, mechanical grip. As Vader raised his weapon in his left hand for the kill, the inconceivable happened. Darth Vader, in his exhausted and disoriented state, lost his balance and tripped over his arm, falling into the sacrificial well of the temple, his fall marked by his inhuman howl."}, {"tag": "p", "text": "However, Vader had survived the fall; he regained consciousness over an hour after hitting the hard bottom of the well."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As Luke dragged himself over to Leia, he was met by Halla. Admitting herself a charlatan with no true knowledge of the Force, Halla gave the Kaiburr crystal to Luke. As Halla turned away, cursing herself, she noticed that the crystal was glowing. Luke was unconsciously using the crystal to heal both himself and Leia. As he was refreshed and her wounds healed, Halla looked on. Now in possession of the crystal, the group left the temple, reactivating the droids and leaving."}, {"tag": "p", "text": "Unfortunately, the Kaiburr crystal's ability to amplify the Force was dependent upon its proximity to the Temple of Pomojema. The further away from the temple, the less powerful it got. Ultimately, the crystal became nothing more than an oddity in Luke Skywalker's possession, though he did experiment with it, using a fragment of it as a lightsaber crystal. The resulting blade was remarkably strong and energy efficient."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}