{"url": "Duel_on_Jwlio", "categories": ["Category:Legends articles", "Category:Battles in the Unknown Regions", "Category:Battles of the Dark Nest Crisis", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Jwlio"}, {"tag": "p", "text": "The Duel on Jwlio was a lightsaber duel that occurred in the year 35 ABY at the onset of the Dark Nest Crisis. On the planet Jwlio, Jedi Master Saba Sebatyne confronted the Dark Jedi Welk, and in the depths far beneath the surface of that world, the Barabel Jedi engaged the Night Herald of the Gorog in vicious lightsaber combat."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After Jedi Knight Jaina Solo disregarded her orders during the attempted rescue of Jedi Knight Lowbacca, Jedi Master Saba Sebatyne traveled deep within the caverns of the moon Jwlio to clear her mind while hunting. During her hunt, Master Sebatyne encountered a precise cut into the center of a stone; indicating a lightsaber had been used. Feeling that her prey had become more interesting than she had first suspected, Saba examined the cleft it had cut; within were several empty cells. While she examined the empty cells, Master Sebatyne sensed bitterness nearby and her danger sense grew."}, {"tag": "h2", "text": "The duel"}, {"tag": "h3", "text": "The hunt is on"}, {"tag": "p", "text": "Sebatyne surprised her attacker by spinning around quickly, taking his feet from under him with a quick swipe of her Barabel tail, eliminating his chance to kill the her while her back was turned. Completing her spin, Sebatyne ignited her lightsaber as the crimson colored blade of her opponent ignited in time to block her attack. A Force Wave then blasted her across the cavern, slamming her head hard into the stone wall, the concussion of which began to blur her vision."}, {"tag": "p", "text": "Additionally, Sebatyne could not sense her opponent within the Force. Thus, while she examined her opponent with compromised vision, he lifted himself off the ground, and arrogantly waited for the Jedi Master to ask his name, or composed himself to continue the duel. Sebatyne leaped at her opponent and attacked with a vicious overhand slash, forcing him back several steps to block her blade. The Barabel brought her knee around to slam into the chest of her attacker, but was met with a harder surface than expected, leaving her to feel as if she had struck a statue."}, {"tag": "p", "text": "The attacker capitalized on the Barabel's shock and slipped his palm-heel under her guard, hitting her under the chin, and sending her staggering backwards. The Jedi Master then kicked a fist-sized stone off the floor and used the Force to hurl it at her opponents head, before following through with a cut attack to his knees. The mysterious attacker pivoted out of the way of the Force-hurled stone, before meeting the Barabel's blade, and sweeping it up into a disarming counter-arc."}, {"tag": "p", "text": "At the top of the maneuver, Sebatyne released her grip on her weapon and raked her claws down in a one-two slash; the first strike opening up her opponent's face from temple to jaw, the second completely severing his eye. The attacker whirled away silently, yet screamed his agony into the Force, landing a stop kick into the Jedi Master's belly. Saba went with the attack, rolling into a quick back-flip and lost a section of her tail to her attackers blade."}, {"tag": "h3", "text": "Herald of the Gorog"}, {"tag": "p", "text": "Knowing better than to allow the Barabel a chance to recover, the attacker unleashed a barrage of Force lightning at her, catching her full in the chest and bringing her to her knees in agony. As her attacker limped forward, Sebatyne saw him clearly for the first time; it was the Dark Jedi, Welk. Stopping a meter and a half away from the Barabel, Welk brought his blade down in a decapitating strike; however, Saba let loose a Force shove that sent the Dark Jedi tumbling backwards. As Welk staggered backwards his lightsaber scraped Sebatyne's skull, though she fought past the blinding pain to leap at him; slamming into his chest and biting his throat."}, {"tag": "p", "text": "She had lost much strength due to her two head injuries and failed to sink her fangs deep enough into Welk's throat. In retaliation, Welk slammed Sebatyne backwards with the Force, but she recalled her lightsaber to her grasp as she soared towards the cavern wall. She fought off unconsciousness as she landed, she leapt at her attacker. Welk leveled another blast of lightning at the Jedi Master, however, she absorbed the barrage with her lightsaber, before pivoting past the sizzling arcs to rush her opponent."}, {"tag": "p", "text": "Welk brought his blade to a middle guard, while Master Sebatyne attacked high. The Dark Jedi blocked the Barabel's attack; her reflexes fading. However, Welk was forced to retreat another step, while Saba launched a spinning attack, bringing her blade around in a shoulder slash and simultaneously swiped her bloodied tail at his legs. Due to her fading reflexes, Welk successfully blocked the shoulder slash and jumped the tail swipe; however Saba brought her trailing foot around. Her foot taking the Dark Jedi's feet out from under him, Sebatyne executed a second spin that severed his Killik-arm, before adding a neck wound to his growing toll of injuries."}, {"tag": "p", "text": "However, Saba's compromised vision cost her as Welk sent a rock towards her; hitting her in her head wound. This damaged the Barabel's sight further; Welk took this advantage to retreat, blood gushing from his neck wound. Despite her opponent retreating, Saba sensed more danger than before. Dark-Nest Killik assassins attacked the Barabel, injecting poison into her. While Saba defeated the Killik's they exploded upon contact with her lightsaber blade, damaging her hand. Though Saba wished to pursue Welk, she realized that the Killik's had come from the empty cells she had encountered earlier; however, one appeared to be missing and she feared it would attack the Jade Shadow."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "A Killik did indeed stow aboard the Jade Shadow, befriending the young Ben Skywalker in an attempt to undermine his relationship with his mother, Mara Jade Skywalker. Jade Skywalker, would later battle the assassin bug, knocking it unconscious to allow Jedi Master Cilghal to analyze it."}, {"tag": "p", "text": "Both Saba and Welk recovered from their injuries; Welk would later be killed in a duel with Luke Skywalker, while Saba would continue to take part in the Dark Nest Crisis and ultimately survive the war."}, {"tag": "h2", "text": "Appearances"}]}