{"url": "Duel_on_Lehon", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Battles of Lehon", "Category:Duels", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Duel on Lehon"}, {"tag": "p", "text": "In 1000 BBY, a lightsaber duel was fought on the planet Lehon between two Dark Lords of the Sith: the Twi'lek Blademaster Kas'im and his former apprentice, Darth Bane. Kas'im followed Bane to Lehon and found him in the Rakatan Temple of the Ancients, where he presented the Human with the choice of either rejoining the Brotherhood of Darkness to which Bane had once belonged, or making Lehon his final resting place. When Bane refused, an intense lightsaber duel ensued."}, {"tag": "p", "text": "Bane, who was considerably stronger in the Force, maintained the offensive in the beginning of the duel. The tide turned when Kas'im split his double-bladed lightsaber into two separate weapons and attacked his opponent with a previously unrealized degree of ferocity. Bane was forced onto the defensive, and was just barely able to maneuver his way out of the temple before Kas'im blasted him with a wave of Force energy. Bane reciprocated the attack, and Kas'im absorbed its brunt by shielding himself with the Force. The temple entrance in which Kas'im stood, however, was obliterated by Bane's exertion, and the Twi'lek was unable to avoid being crushed to death under the tons of rubble that fell upon him."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 1000 BBY, recently promoted Dark Lord of the Sith Darth Bane abandoned the Brotherhood of Darkness in the midst of a war with the Jedi Order and the Galactic Republic. Convinced that the Brotherhood was nothing more than a flawed collection of individuals whose affirmation of the Force's dark side had diluted its potency, Bane left them to embark on his own search for Sith enlightenment. His quest led him to Lehon, or the \"Unknown World,\" the planet where the Jedi Civil War of nearly three thousand years prior had ended. Once there, he located an ancient Rakatan temple, wherein he discovered and began tedious exploration into the Sith holocron of Darth Revan."}, {"tag": "p", "text": "Meanwhile, the rest of the Brotherhood of Darkness had gathered on the planet Ruusan to engage in a final campaign against the Jedi's Army of Light. Githany, Bane's former mentor, experienced a Force premonition that involved Bane coming to Ruusan to destroy the entire Brotherhood. She informed the leader of the Sith, Kaan, of this, and together they conspired to bring Bane back into the fold, lest the events of her vision become reality. Githany knew through her Force bond with Bane that he had gone to Lehon; to this end, Kaan enlisted the Twi'lek Blademaster Kas'im to find Bane and speak with his former apprentice on Kaan's behalf. Kaan's instructions were clear; if Bane could not be swayed, then Kas'im was to kill him. The Twi'lek departed in a Sith Buzzard starfighter and made his way to the Unknown World."}, {"tag": "h2", "text": "The duel"}, {"tag": "h3", "text": "Part one"}, {"tag": "p", "text": "Kas'im homed in on the beacon from Darth Bane's stolen starship, Valcyn, and landed his starfighter nearby. He also sensed Bane's presence, which he followed to the Temple of the Ancients, battling and killing a rancor in the process. Kas'im found Darth Bane in the Temple's innermost chamber when he arrived, startling the man and causing him to activate his lightsaber. The two of them entered into a debate over the Brotherhood's ability to actually destroy the Jedi, and the Twi'lek ignited his double-bladed lightsaber as he attempted to convince Bane to partake in the war effort on Ruusan. Bane refused to be discouraged, and when he declined Kas'im's final offer to either rejoin the Brotherhood or die on Lehon, the Blademaster leaped in to engage Bane in lightsaber combat."}, {"tag": "p", "text": "Darth Bane realized immediately from their initial exchange of blows that his former teacher had withheld his true ability from him during their training sessions. He was still able to just barely defend himself, which surprised Kas'im, who had advanced with the intention of bringing a quick end to the contest. The two men openly took notice of how the other's skills had improved since their last duel, and both reevaluated their tactics before resuming the battle. Kas'im engaged in a relentless offensive, but Bane surrendered completely to the dark side and with his lightsaber erected an impregnable defense. He then became the aggressor, driving Kas'im back and forcing him to retreat from the chamber. Bane leaped forward after him, and missed by less than a centimeter a blow that would have crippled his opponent. Kas'im switched several times between different strategies and dueling styles, but Bane anticipated each change and pressed his advantage. He had seen and developed counters for every technique the Twi'lek could implement with his saberstaff; that—combined with his superior knowledge of the Temple's interior layout—saw the duel rapidly progressing in Bane's favor."}, {"tag": "p", "text": "Kas'im, who had become desperate in the face of impending defeat, performed a series of acrobatic maneuvers as he attempted to escape Bane's assault. When he realized that his opponent was forcing him into a dead-end hallway, Kas'im used the Force to blast open the door of an adjacent room, into which he dived. Noticing that the Twi'lek had effectively trapped himself, Bane stood in the doorway and relished in his apparent victory. Kas'im, exhausted though he was, admonished Darth Bane for not taking the opportunity to finish him. The Blademaster then twisted the hilt of his double-bladed weapon, which separated into two individual lightsabers, and attacked his adversary."}, {"tag": "h3", "text": "Duel's end"}, {"tag": "p", "text": "Bane was completely unfamiliar with Kas'im's two single-saber variant of Ataru and was almost instantly outmatched. Despite his superior Force ability, what had once seemed like a certain victory for Bane turned into a fight for his life. Kas'im struck from all angles in his relentless onslaught, forcing Bane to concede more and more ground in a battle he believed he could no longer win. His only recourse was to work his way toward the Temple's only entrance in an effort to escape. Kas'im realized Bane's intent when the opening came into view, but he was momentarily unbalanced by a Force push from Bane as he back-flipped through the entrance onto the landing outside. Bane's flip had carried him too far, however, and he landed shakily on the edge of the landing's declining staircase. Kas'im followed with a telekinetic blast that knocked Bane down the stairs, but by shielding himself with the Force, Bane was able to avoid sustaining serious injury."}, {"tag": "p", "text": "Kas'im stood under the Temple's archway and stared down at Darth Bane as he recovered. He told Bane that attempting to flee was futile, because Kas'im planned to pursue him wherever he went until which time the Twi'lek was able to kill him. He suggested that Bane end the duel then instead of prolonging the inevitable, and Bane, who had been gathering Force energy while Kas'im spoke, agreed as he unleashed it in a devastating Force wave against his foe. Kas'im shielded himself with the Force at the last moment, but he had not accounted for the destructive impact Bane's attack would have on the Temple's structure. The sheer power of the energies Bane released annihilated the Temple entrance, which collapsed and fell, crushing Kas'im below. Indifferent to the death of his former mentor, Bane left the Twi'lek under the rubble and set out for Ruusan."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "News of Kas'im's death preceded Darth Bane's own arrival on Ruusan and reached Lord Kaan via a message drone dispatched by Bane himself. Also included in the message were the details for creating the thought bomb, an ancient Sith weapon that unleashed the pure destructive energy of the dark side. Disguised as a peace offering, Bane hoped that Kaan would detonate the thought bomb and in doing so obliterate every Force-sensitive being on Ruusan. When he finally arrived, Bane was able to convince Kaan to use the thought bomb, which he employed during the final battle for dominion over Ruusan. As Bane had anticipated, the thought bomb wiped out Kaan and the entire Brotherhood of Darkness, as well as most of the planet-side Jedi; Bane had indeed destroyed the Brotherhood just as Githany had foreseen. The elimination of his rivals paved the way for Darth Bane to create a new Sith Order of his own design—one that, instead of dispersing the strength of the dark side throughout numerous Dark Lords, focused the power of the Force in two individuals: one Sith Master to embody that power, and a single Sith apprentice to crave it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel on Lehon appeared in the first novel of author Drew Karpyshyn's Darth Bane Trilogy, titled Path of Destruction. The event was later alluded to in The Complete Star Wars Encyclopedia, wherein Kas'im's entry notes his death at the hands of Darth Bane."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}