{"url": "Duel_on_Kalakar_Six", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Sith Worlds", "Category:Battles of Operation Skyhook", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Kalakar Six"}, {"tag": "p", "text": "A duel between the Sith Lords Darth Vader and Darth Maul, the latter resurrected through Sith alchemy, took place on the moon Kalakar Six in the year 0 BBY. The fight was orchestrated by a darksider cult called the Prophets of the Dark Side, who wanted Vader killed and replaced with Maul as Darth Sidious' only true apprentice, because they felt the former was \"tainted\" by his Jedi past and not worthy of being a Sith."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the Rebel Alliance managed to obtain the schematics of the Death Star, the Sith Lord Darth Vader was commanded by his master, Darth Sidious, to retrieve the stolen information. Vader received word of a possible Rebel courier en route to Kalakar Six, a volcanic moon once controlled by the Sith. Upon arrival, however, Vader found that there was no Rebel presence on the moon, as his stormtrooper escorts were quickly killed by a mysterious assassin wielding a red lightsaber."}, {"tag": "p", "text": "Vader soon entered a hollowed out volcano, where he was confronted by a cult of darksiders, who revealed their name to be the Prophets of the Dark Side and that they lured him to the moon. They claimed that his past as a Jedi had left him \"tainted\" and he was unworthy of being Darth Sidious' apprentice. The cultists then revealed that they had resurrected Sidious's first apprentice, Darth Maul, in order to replace Vader."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "The two Sith Lords engaged in a lightsaber duel, going through the volcano and onto a bridge situated over a river of lava, which collapsed, though they both survived and continued their battle."}, {"tag": "p", "text": "Vader soon managed to slice Maul's double-bladed lightsaber in two, but both sides remained intact. Maul then slashed Vader's mask, causing him to fall to the ground, but as he was preparing to deliver the killing blow, Vader used the Force to grab his lightsaber and impaled both himself and Maul through the stomach, with Vader surviving thanks to his cybernetics. With his dying words, Maul questioned what Vader could hate enough to destroy him, to which he replied \"Myself.\""}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Soon after, Vader returned to confront the Prophets, only for them to be suddenly killed by Darth Sidious using Force lightning. Sidious didn't seem surprised by Vader's encounter with Maul, and claimed that he had come to see his progress in finding the stolen Death Star plans, denying any involvement with the Prophets. When Vader asked how it was possible for Maul to have been brought back, Sidious merely replied that it was possible, though it didn't matter at the moment, as Maul had been brought back only to be destroyed once again. He then told Vader that the cultists were heretics, and that they should resume their search of the stolen plans."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel was selected as one of Star Wars Insider 83's 20 Most Memorable Moments of the Expanded Universe, with Leland Chee confirming its canonicity on his blog."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}