{"url": "Duel_on_Odryn", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles in the Noonian sector", "Category:Duels", "Category:Jedi Covenant Conflicts"], "nodes": [{"tag": "h1", "text": "Duel on Odryn"}, {"tag": "p", "text": "The Duel on Odryn was a fight on the planet Odryn between the Feeorin Jedi Master Feln and fugitive Padawan Zayne Carrick."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Shadow Celeste Morne was reported to have arrived on Odryn, carrying the Muur Talisman for storage in the Sanctum of the Exalted. However, Celeste supposedly died on Jebble and Jarael posed as her, with the Moomo Brothers as hired muscles to carry a crate holding the Muur Talisman that was actually their laundry hamper - with Zayne Carrick and Marn Hierogryph inside. After getting inside the Sanctum, they began to take as many pictures as possible to expose the Jedi Covenant. Zayne and Gryph continued to take photos for the next few days while the others waited on the Moomo Williwaw till them. Afterwards, they tried to sneak to their rendezvous point, only to be ambushed by Borjak, Feln's steward. Though Zayne outclass the Feeorin, others come and snatch Gryph, forcing Zayne to surrender. Just then, Master Feln himself arrived."}, {"tag": "p", "text": "As daybreak arrives, Feln contacted Lucien Draay, who suspected that Zayne killed Celeste and has been further corrupted by the Talisman. He ordered the execution of Option Ossus, to which Borjak objected, but was barely heard by Lucien. Haazen also appeared via holo, demanding that Feln did not destroy the Sanctum and argued with Lucien."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Feln threw Zayne's lightsaber up into the air, mirroring how he Force threw the First WatchCircle's lightsabers before, on Taris. He then proceeded to kill Zayne with his lightsaber only for Borjak to interject, reminding him of the Rime Feeorin: those who had been in the Sanctum can only be harmed by fists only; Feln conceded to the law and as he put away his lightsaber, lecturing his people about when to shut up, Zayne cut him off, kicked him and began hopping like a Dug around the village. Feln tried to go after him only to fall into one of the rotten roofs. Zayne reminded him that the Sith testing grounds he put was destroying the village. In anger, Feln had an outburst, knocking Zayne out. The Feeorin Jedi declared class over, \"once and for all\" when Borjak informed him that the Williwaw was coming back. Feln took this as another raid on the Sanctum and pulled the trigger, destroying the Sanctum, but also destroying the village down below. He blamed Zayne for forcing him to destroy it, reaching for his lightsaber but found only a wooden stick. He was then stabbed in the back by Borjak, headed by a mob of angry Feeorins. Feln stated his position as Exalted but Borjak replied that he destroyed it and the mob butchered him to death. Gryph then revealed that he took Feln's lightsaber when no one was looking."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Thanks to the rain, the Feeorins rescued everyone from the fire. Borjak found Zayne's lightsaber and elected to move their people away from the site. Later Jarael revealed that the Moomo Brothers stole a number of Sith artifacts from the Sanctum, which allowed Zayne to continue his quest to expose Jedi Covenant."}, {"tag": "p", "text": "On Coruscant, at the Draay Estate, Xamar and Q'Anilia reported to Lucien on Feln's death. Lucien feared that the prophecy they've predicted was almost coming to fruition and assigned Xamar to the orbital fleet to stop Carrick from reaching Coruscant. Lucien inputted to Admiral Saul Karath that Zayne was making a raid for the Mandalorians. But Xamar knew that his part in the prophecy was near: to be killed by friendly fire."}, {"tag": "h2", "text": "Appearances"}]}