{"url": "Duel_on_Mustafar", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Battles of the Great Jedi Purge", "Category:Battles of Mustafar", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Mustafar"}, {"tag": "p", "text": "The Duel on Mustafar was a confrontation where Anakin Skywalker, now the recently apprenticed Sith Lord, Darth Vader, fought his former Jedi Master and best friend, Obi-Wan Kenobi, on the planet Mustafar in the Outer Rim. After learning of Skywalker's downfall with Grand Master Yoda at the Jedi Temple, Kenobi arrived on Mustafar, where he attempted to reason with the fallen Jedi, not believing the Sith Master known as Darth Sidious, revealed to be Emperor Palpatine, had taken control of Skywalker's mind. However, Vader no longer cared for their friendship, and quickly claimed that Kenobi was his enemy; the pair then ignited their lightsabers and locked blades, fighting through the murder scene in the Klegger Corp Mining Facility, where Vader had recently slaughtered the members of the Separatist Council, the legislative branch of the Confederacy of Independent Systems."}, {"tag": "p", "text": "The fight progressed on the structures of the massive facility that hovered over the deadly lava of Mustafar. Kenobi and Vader soon found themselves trapped on a structure collection arm connected on the facility when it was separated from the facility by the lava and descended onto a hot stream. Kenobi managed to fall onto a lava skiff that was heading in the opposite direction of the fallen collection arm in the stream. Vader soon followed Kenobi and jumped onto a droid collector where the two continued to fight. The Jedi managed to jump onto a high lava bend slope, and claimed that the duel was over due to his advantage. The Sith Lord attempted to follow, but in his hubris, Vader failed to block Kenobi's final attack, a powerful maneuver which Kenobi severed Vader's remaining organic limbs, and Vader rolled down to the edge of the lava bend, bringing the duel to an end."}, {"tag": "p", "text": "Then, Kenobi—overcome with disgust and remorse over his friend's transformation—cried out that he had believed that the fallen Jedi was the Chosen One and his destiny was to destroy the Sith, but instead he joined them. Unable, but most likely unwilling, to connect with his former best friend, Vader was consumed by the fires of the lava that leaked onto the lava bend; leaving the Sith Lord to die, Kenobi retreated and took his fallen apprentice's lightsaber. Afterwards, Vader's new master, Darth Sidious, found his injured apprentice and took him back to the galactic capital of Coruscant, now known as Imperial Center, to be rebuilt; the suit that Vader donned there was one that the Dark Lord of the Sith would wear for the rest of his life."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "Skywalker's vision"}, {"tag": "p", "text": "During the Clone Wars, a trio of Jedi—Obi-Wan Kenobi, Anakin Skywalker, and Ahsoka Tano—were brought to the realm of Mortis by a group of Force wielders who dwelled there. These beings believed that Skywalker was the Chosen One who would one day bring balance to the Force and destroy the Sith. One of the beings, the Son—a representation of the dark side of the Force—showed Skywalker a vision. In the vision, Skywalker witnessed events of his future, including the Jedi Knight's future as Darth Vader, a Dark Lord of the Sith, where he helped destroy the Jedi and the Sith rule the galaxy. Skywalker briefly turned to the dark side as a result of the vision, but he gave up the dark side and his memory of his future was erased by the Father."}, {"tag": "h3", "text": "Mission to Mustafar"}, {"tag": "p", "text": "The duel began after the Sith Master known as Darth Sidious, as the newly appointed Galactic Emperor Sheev Palpatine, tasked Skywalker, now a fallen Jedi serving as his new apprentice Darth Vader, with the assassination of the leaders of the Confederacy of Independent Systems on the volcanic Outer Rim planet Mustafar, in order to bring an end to the Clone Wars. Vader was followed to Mustafar by Skywalker's wife, Senator Padmé Amidala, where he implied to her his designs to take over the Empire, saying he could overthrow Emperor Palpatine, and that he and she could rule the galaxy together, but the senator rejected this offer. He Force-choked her after seeing Obi-Wan Kenobi, his former Jedi Master, whom Vader wrongly believed that Amidala had led to Mustafar in order to kill him after she discovered that Obi-Wan was right about Vader. Obi-Wan himself convinced Vader to release Amidala and, not wanting to have to kill his former Padawan, briefly tried to bring him to his senses. When it became clear that Vader was unwilling to listen to reason, Obi-Wan reluctantly raised his lightsaber, prompting Vader to respond in kind."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "The lightsaber duel between Kenobi and Vader was lengthy and brutal with neither of the combatants gaining the edge as their abilities countered each other's. The duel took place across the Klegger Corp Mining Facility, with the two combatants making their way through hallways, conference rooms, and command centers, the last of which led to their inadvertently triggering a meltdown of the facility when their misdirected weapons cut across a control panel. As a result, the facility's shielding deactivated, and the large stalks overhanging the lava river collapsed when covered with erupting lava, one of the stalks taking the two Jedi with it. The fight moved onto the lava river—where Mustafarian workers witnessed it, unaware that the Confederacy was defeated as the facility collapsed—before ending on an embankment where Obi-Wan leaped, gaining the high ground. He begged Vader not to attack, but Vader, in his anger, refused to listen and attacked, to no avail as his left arm and both legs were severed upon attack."}, {"tag": "p", "text": "Following an impassioned indictment by Kenobi of how Vader, believed to have been the Chosen One and meant to destroy the Sith instead of joining them, Vader's body burst into flames from the intense heat from the lava river, and he was burned alive. Unwilling to finish his defenseless enemy, Kenobi took Vader's lightsaber and remorsefully left him on the embankment for dead, before leaving the planet with the dying Amidala."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Sidious sensed his apprentice's initial struggle from across the galaxy and personally traveled to Mustafar to retrieve him. Vader barely survived his ordeal, dragging himself away, before Sidious found him. The newly christened Emperor then brought Vader back to Coruscant, where he placed his badly wounded apprentice into a cybernetic suit of armor that would keep him alive for the rest of his life before Vader learned that he killed his wife in anger. Kenobi, meanwhile, brought Amidala to Polis Massa, where she died shortly after giving birth to her and Anakin's twin children, Luke and Leia. To protect them from the Sith sensing their presence, it was decided the twins be separated. Bail Organa adopted Leia while Kenobi delivered Luke to his former apprentice's stepbrother, Owen Lars, and his wife, Beru, on Tatooine and went into exile on the same planet, where he kept watch over him and took on a new name: Ben Kenobi. The final encounter between Kenobi and Vader took place many years later on the Death Star, where Vader killed his former master. During the Battle of Endor, Anakin found redemption, inspired by his son Luke, sacrificing himself by killing Sidious and rejoining Kenobi in the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "The duel on Mustafar was first indirectly mentioned in the 1977 original Star Wars film Star Wars: Episode IV A New Hope. The origins of the duel traced from the original trilogy, such as the conversation between Obi-Wan Kenobi and Darth Vader aboard the Death Star or Vader's numerous visible scars. The duel itself first appeared on-screen in the 2005 film Star Wars: Episode III Revenge of the Sith as the final battle. By then, it had already become a highly anticipated event in Star Wars fandom."}, {"tag": "p", "text": "The duel took George Lucas nearly two weeks to complete, and only took up half of a page. During the animatics stage, Steven Spielberg, Lucas' friend and a renowned Hollywood filmmaker, participated in the duel's production. Ewan McGregor and Hayden Christensen, who played Obi-Wan and Anakin, practiced the duel constantly for several months. As a result, the speed in which Vader and Kenobi engage the duel in the completed film is the speed in which it was filmed, without being digitally accelerated. Lucas named the duel during an interview in the documentary Within a Minute: The Making of Episode III."}, {"tag": "p", "text": "In the DVD commentary of Episode III, George Lucas pointed out that during the scene in which Vader chokes Obi-Wan, the latter is holding the former's lightsaber, because Obi-Wan was at one point going to take Vader's blade, and shots for this were filmed but edited out of the final cut for pacing reasons."}, {"tag": "p", "text": "As seen in The Making of Star Wars Revenge of the Sith, concept art by Sang Jun Lee shows that Kenobi and Skywalker were originally intended to fight a being known as the Mustafar Monster while having the duel. This idea was scrapped by the finished version of the film. Additionally, Vader was meant to beg Kenobi for help, reaching out for him, but Kenobi, while acknowledging he loved him and initially thinking he should help him, refuses to help, with Anakin's eyes turning from blue to the trademark yellow of the Sith."}, {"tag": "h3", "text": "Real world parallel"}, {"tag": "p", "text": "Before the duel, Vader tells Kenobi, \"If you are not with me, then you are my enemy!\" Kenobi responds with \"Only a Sith deals in absolutes.\" George Lucas intended for this line to reflect what he believed to be the viewers' views on then President of the United States George W. Bush's War on Terror, particularly Bush's black-and-white views of the world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}