{"url": "Duel_on_Socorro", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Battles in the Outer Rim", "Category:Battles of the Second Imperial Civil War", "Category:Duels", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "Duel on Socorro"}, {"tag": "p", "text": "In 137 ABY, a duel between the Sith Hand Darth Talon and the Imperial Knight Elke Vetter took place in a courtyard of the planet Socorro's Imperial Mission temple. Vetter had been traveling with Princess Marasiah Fel of the Empire-in-exile on a quest to see who among Darth Krayt's Galactic Empire were still loyal to Marasiah's father, exiled Emperor Roan Fel, and they were welcomed into the temple by Imperial Missionary Astraal Vao."}, {"tag": "p", "text": "When that news reached the Sith Lord Darth Krayt, he dispatched Talon to Socorro in order to send Marasiah fleeing, which he hoped would in turn lead his One Sith to her father. After setting the temple on fire, Talon dueled Vetter as Marasiah and Vao escaped, and she defeated her opponent by cutting off the Imperial Knight's left hand and stabbing her in the thigh with her lightsaber. Talon then used the Force to extract Marasiah's destination from Vetter's mind and killed her foe with Force lightning."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After usurping the Imperial throne from Emperor Roan Fel in 130 ABY and sending him into exile, the Sith Lord Darth Krayt spent seven years sending forces of his new Galactic Empire to hunt down both Fel and Fel's daughter, Princess Marasiah. The Princess often evaded Krayt's agents with the help of Imperial Missionary Astraal Vao—although the Imperial Mission was attached to Krayt's Empire, Vao was a trusted friend of Marasiah and frequently defied the Empire in order to help her."}, {"tag": "p", "text": "In 137 ABY, as the Second Imperial Civil War raged between Krayt's forces and Fel's Empire-in-exile, Marasiah traveled to the planet Socorro with her bodyguard, the Imperial Knight Elke Vetter. They were on a quest to discern who among Krayt's Empire were still loyal to Marasiah's father, and Vao welcomed them into Socorro's Imperial Mission temple. When Krayt learned of the Princess's whereabouts, he dispatched Darth Talon, his newest Sith Hand, to chase Marasiah from the temple in the hope that she would lead Krayt's One Sith to her father."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Talon arrived on Socorro and set the Imperial Mission Temple on fire, which prompted Marasiah and Vao to flee while Vetter engaged the Sith Hand in lightsaber combat. The two dueled in a courtyard of the burning temple until Talon severed her opponent's left hand from the wrist, which was followed by a stab to Vetter's right thigh and a kick to her chest. Vetter dropped her lightsaber and collapsed to the ground, but she was content in the knowledge that Marasiah had escaped. However, Talon informed her conquered foe that such had been her intention, and she used the Force to drain knowledge of the Princess's destination from Vetter's mind. She then killed the Imperial Knight with a blast of Force lightning."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Marasiah felt Vetter's death in the Force and was ready to turn around to avenge her bodyguard, but Vao convinced her to honor Vetter's sacrifice and keep running. Vao soon afterward contacted her brother, the Jedi Knight Shado Vao, and arranged to meet him on the planet Vendaxa. The two arranged passage offworld on the pirate vessel Mynock, but Talon was already aware of their destination and followed them there. When the Sith Hand attacked the group, Marasiah fought furiously in order to prevent Talon from again killing someone who had risen to the Princess's defense. News of Vetter's death and Marasiah's escape reached Roan Fel's ears on his new fortress world of Bastion, but he resisted the urge to mount a rescue attempt in order to keep his recent capture of Bastion a secret. The Imperial Knight Antares Draco, who was in love with the Princess, defied Fel's orders and set out for Vendaxa with his friend and fellow Knight Ganner Krieg."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel between Darth Talon and Elke Vetter is featured in the second issue of the comic series Star Wars: Legacy; written by John Ostrander and penciled by Jan Duursema, the issue was released in July 2006. The duel sees Talon sever Vetter's hand from her arm, but Legacy's thirteenth issue later revealed that every Imperial Knight wears lightsaber-resistant cortosis gauntlets on their wrists. In 2010, Duursema confirmed that Vetter's hand is sliced off at a point outside of the gauntlet's protection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}