{"url": "Duel_on_Stygeon_Prime", "categories": ["Category:Canon articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Battles in the Nuiri sector", "Category:Battles of the Great Jedi Purge", "Category:Duels", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Duel on Stygeon Prime"}, {"tag": "p", "text": "The Duel on Stygeon Prime, also known as the Encounter at Stygeon Prime or the rescue on Stygeon Prime, was a confrontation in the Spire, a prison on the planet Stygeon Prime, between the Galactic Empire and a group of Lothal-based rebels who carried out an insurgency against the Empire's rule. The duel, primarily fought between former Padawan Kanan Jarrus and the Jedi hunter known as the Grand Inquisitor, took place in the fifth year before the Battle of Yavin, as part of a mission to rescue Jedi Master Luminara Unduli from Imperial captivity. The rebels learned that Unduli, a former member of the Jedi Council, had survived the Clone Wars and the ensuing Great Jedi Purge, and was being held prisoner by the Empire. However, Unduli had in reality been executed by the Empire years earlier and the residual Force essence within her bones was being used to lure surviving Jedi to their deaths. The Grand Inquisitor, the Imperial Jedi hunter who killed Unduli, intended to trap the rebels in the Spire and kill former Padawan Kanan Jarrus and his apprentice, Ezra Bridger."}, {"tag": "p", "text": "The rebels infiltrated the Spire after arriving on Stygeon Prime and made their way through the facility. Jarrus and Bridger located Unduli's cell, where they learned she was dead and that the Inquisitor was waiting for them. Jarrus and the Inquisitor engaged in a lightsaber duel, during which the Inquisitor attempted to turn Bridger to the dark side of the Force. When the boy refused, the Inquisitor aimed to kill them both, but they were able to flee and, ultimately, escape the facility with the other rebels. The Inquisitor would nonetheless continue hunting them, intending to destroy them and all remaining Jedi."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the years following the rise of the Galactic Empire, the Jedi who survived Order 66—the event in which Darth Sidious, who was then-known in public as Supreme Chancellor Palpatine, ordered the clone troopers of the Grand Army of the Republic to destroy the Jedi Order before declaring himself Emperor—were hunted down and eliminated as part of the Great Jedi Purge. One of the individuals responsible was the Grand Inquisitor, who was tasked by Darth Vader, Sidious' apprentice and Dark Lord of the Sith, with killing all remaining Jedi. One such Jedi was Jedi Master Luminara Unduli, a veteran of the Clone Wars and a former member of the Jedi Council. The Inquisitor executed Unduli in the Spire, a prison on the planet Stygeon Prime. After her death, Unduli's bones were kept in her prison cell, and the residual Force essence within them was used to lure other surviving Jedi to their deaths."}, {"tag": "p", "text": "Later in the Empire's reign, Sidious sensed that a new threat, which he called the \"children of the Force,\" could rise against him. Vader ordered the Inquisitor to find these individuals and either turn them to the dark side of the Force or kill them. Sometime later, Agent Kallus of the Imperial Security Bureau encountered a group of rebels who operated on and around the Outer Rim planet of Lothal. These rebels mounted a mission to rescue Wookiees who had been enslaved by the Empire in the spice mines of Kessel, where Kallus followed them in an attempt to destroy them. During the rescue, the leader of the rebels, Kanan Jarrus, revealed himself as a Jedi survivor, while Ezra Bridger—a Lothal street orphan who had just become part of the rebel crew—displayed his untrained ability to use the Force. Kallus believed them to be master and apprentice and reported what he saw to the Inquisitor, who prepared a trap for them on Stygeon Prime in an attempt to kill them."}, {"tag": "p", "text": "Unaware of the threat posed by the Inquisitor, Jarrus took Bridger as his Padawan and began training him in the ways of the Jedi. Jarrus, a Padawan at the time of Order 66 whose training was incomplete, was unsure of his ability to train the boy, while Bridger remained undisciplined and full of doubt. After a failed training session aboard the rebels' ship, the Ghost, the crew watched as a HoloNet News transmission was interrupted by Gall Trayvis, a former member of the Imperial Senate who secretly posed as a rebel sympathizer in order to lure rebel forces into traps. Trayvis claimed that Unduli was alive and that she was being held prisoner in the Stygeon system. Jarrus believed the claim, as he had heard rumors that Master Unduli had survived the Clone Wars. The rebels jumped at the chance to rescue the Jedi Master, and Jarrus believed she could be a new teacher for his apprentice. The rebels were unaware that the Inquisitor would be waiting for them, as the information about Unduli's survival was a trap."}, {"tag": "p", "text": "The rebels soon deduced that Unduli was being held in the Spire, which was the only Imperial prison in the Stygeon system. The crew gathered in the cockpit of the Ghost, where Sabine Wren, a Mandalorian explosives expert, projected a holographic image of the prison. She explained that the facility was impregnable, that it was blast proof, and that it was defended by ray shields, anti-ship weapons, and TIE/ln space superiority starfighters, and that the main landing platform would be impossible to break into. Despite what they perceived as long odds, they decided to mount the rescue and trick the facility's scanners into not detecting their approach. Once on Stygeon Prime, they planned to sneak onto a small entrance guarded by a few stormtroopers, break into the prison, and then make their way into the isolation cells in the upper levels of the facility, where they would free Unduli before escaping the same way they came in."}, {"tag": "h2", "text": "The mission"}, {"tag": "h3", "text": "Searching for Unduli"}, {"tag": "p", "text": "With their plan in place, the rebels made their way to Stygeon Prime and descended into the atmosphere aboard the Phantom, an attack shuttle that was part of the Ghost; their astromech droid, C1-10P, remained with the Ghost while the rebels went on their mission. The strike team for the infiltration consisted of Jarrus, Bridger, Wren, and the Lasat rebel Garazeb Orrelios. Hera Syndulla, the owner and pilot of the Ghost, would remain with the Phantom. Wren also brought along a few detonators, which she called \"miracles,\" that could be used if needed. The shuttle quietly approached the Spire, where Jarrus leaped out of the ship and landed on the small platform in front of the entrance. Once there, he began fighting the stormtroopers who guarded the entrance. Prior to receiving the order to join him, Bridger jumped out of the shuttle and landed on the platform, where he stumbled into the door and, as a result of the noise, alerted more soldiers to the rebels' presence. Wren and Orrelios arrived to help Jarrus fight off the remaining stormtroopers, while Bridger used a lockpick to open the door. The rebels entered the Spire once the door was open, while Syndulla attached the Phantom to the side of the prison, powered down and using a jamming signal to avoid Imperial detection."}, {"tag": "p", "text": "Once inside the prison, Jarrus reached out through the Force and could sense Unduli's presence; though he felt it was clouded, he still believed that she was alive. Wren, meanwhile, learned from a computer terminal that Unduli was being held in isolation on the lower levels. This necessitated a change in their plans, as they had believed that Unduli was being held in upper-level isolation cells. Jarrus began formulating a new plan as they took a turbolift to the lower levels. As they traveled to the lower levels, Syndulla continued to remain on the Phantom where the sensors detected an object approaching the shuttle. Though she initially believed it to be a TIE fighter, she soon found it was a group of creatures known as tibidees, who believed that the jamming signal was a mating call and were attracted to it. Knowing that the tibidees could draw unwanted attention, Syndulla detached the Phantom from the side of the complex and flew it away from the prison, leading the tibidees away so as to avoid Imperial detection."}, {"tag": "p", "text": "The strike team soon arrived in the lower levels of the prison. Once the lift stopped, Jarrus attacked the stormtroopers guarding the lift; Bridger was surprised at how intensely Jarrus was fighting, and Jarrus explained that he knew that there was a great deal at stake in the potential rescue of a Jedi Master, particularly if she could teach Bridger. Knowing that they would have to escape up the same elevator, Jarrus left Wren and Orrelios to guard the lift, while he and Bridger continued on towards the isolation cells. Once they reached the cell, Jarrus used a Jedi mind trick to manipulate the stormtroopers guarding the cell into believing that they were supposed to be guarding the next level. The stormtroopers left, and Jarrus and Bridger entered the cell, where they saw what they believed was Master Unduli; in actuality, it was a holographic recording of the moments before she was executed by the Inquisitor. The two approached her, but Jarrus could sense that something was wrong. The holographic Unduli stood up and walked over to the wall, where she phased through the wall and entered a small chamber—revealing that it was a sarcophagus, and her visible, decomposing corpse was inside of it."}, {"tag": "h3", "text": "The Duel on Stygeon Prime"}, {"tag": "p", "text": "The Inquisitor entered the cell once Jarrus and Bridger saw the corpse, igniting his lightsaber and explaining that Unduli had died long ago but that her bones continued to help the Empire in killing the remaining Jedi. Bridger attempted to contact the others, but the Imperial forces in the prison were jamming their communications. With no reinforcements available, Jarrus attacked the Inquisitor and the two engaged in lightsaber combat. The Inquisitor proved to be a superior opponent, quickly gaining the upper-hand over the former Padawan, and was able to deduce that Jarrus was trained by Jedi Master Depa Billaba based on his fighting style; the Inquisitor explained that he had studied the records of the Jedi Temple, where he learned that Billaba was a master of Form III, the lightsaber combat style that Jarrus heavily favored. The duel continued within the cell until Bridger set off one of Wren's \"miracles\" to blow open the door. Jarrus and Bridger fled from the cell, though the Inquisitor followed close behind. Meanwhile, at the turbolift, Wren realized that the Imperial forces were jamming their signal and that the entire mission was a trap, forcing her and Orrelios to begin thinking of a new escape plan."}, {"tag": "p", "text": "Jarrus and the Inquisitor continued their duel in the detention area, where the Inquisitor attempted to use his superior combat skills to convince Bridger that he should turn to the dark side of the Force. Bridger, who had never heard of the dark side before, instead attempted to attack the Inquisitor with his energy slingshot, but the Inquisitor used the Force to push him down the cell block. Back in the lift, Wren and Orrelios sent an empty elevator to the upper levels, tricking the stormtroopers waiting for them into believing that the rebels were returning. The stormtroopers opened fire into the empty lift before realizing there was no one there, at which point they entered the elevator. When they did, one of the detonators exploded, taking out the lift and the stormtroopers. Wren disabled the other lifts into the detonation area, which would buy the rebels some time but would also force them to find a new escape route."}, {"tag": "p", "text": "The Inquisitor, attempting to taunt his opponents, encouraged Jarrus to surrender for Bridger's sake. Jarrus refused, and the Inquisitor threw him down the cell block with the Force. The Inquisitor tried once more to turn Bridger, but the boy refused and the Inquisitor lashed out towards him. As the Jedi hunter prepared to strike the Padawan down, Jarrus used the Force to pin the Inquisitor to the ceiling, giving Bridger an opportunity to escape. The Inquisitor landed back on the floor once Jarrus let go of his telepathic hold and, as the rebels began to flee, the hunter ignited a setting on his double-bladed lightsaber that allowed it to spin on a disc, adding an additional element of danger to the fight. Once he did so, the rebels fled, making their way through the halls of the prison before they met up with Wren and Orrelios."}, {"tag": "p", "text": "As they made their escape, the Inquisitor followed the rebels throughout the prison. Wren told Jarrus that their new exit was the landing platform, which they had previously rejected, but it became their only option. As the Inquisitor pursued the rebels, he ordered a full lockdown of the prison, causing the doors within the halls to begin closing. The rebels were able to evade him, and Orrelios held one of the doors open long enough for the rebels to slip through, trapping the Inquisitor on the other side. The Inquisitor used his lightsaber to begin slicing through the door while the rebels entered the interior of the landing pad, closing another door behind them and shooting the controls to prevent the Inquisitor from opening it from a console. Wren attempted to open the main landing bay door but was unable to, prompting Bridger to try and pick the lock, though it caused an electrical surge that shocked him and prevented him from opening the door. At Jarrus' command, he and Bridger used the Force together in order to lift the landing bay door."}, {"tag": "p", "text": "The door was successfully opened, revealing numerous stormtroopers on the other side. The stormtroopers immediately began firing, and Orrelios threw one final \"miracle,\" which exploded and eliminated a number of the Imperial soldiers. The rebels made their way onto the landing platform and fought the stormtroopers there, as Wren contacted Syndulla to alert her that they were ready to be picked up. The Phantom quickly arrived, along with a \"fleet\" of tibidees who attacked the firing stormtroopers. The rebels ran towards the Phantom as the Inquisitor broke through the doors. As the rebels were nearly at the shuttle, the Inquisitor threw his lightsaber towards them, which Jarrus deflected with his own. The rebels finally boarded the Phantom and flew away from the prison, having successfully escaped despite their mission to rescue Master Unduli being a failure."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the mission was over, HoloNet News sent out a broadcast stating that Master Unduli had been killed by the rebels while traveling to testify before the Imperial Senate. The transmission was interrupted, however, with another transmission from Gall Trayvis, who claimed to urge Imperial citizens not to believe the Empire's version of events and to keep Unduli's memory alive. The Phantom, meanwhile, left Stygeon Prime and reunited with the Ghost, which soon returned to and landed on Lothal. Once on Lothal, Jarrus explained that he did not want to abandon Bridger as a student, but simply doubted his own abilities to teach the boy. Nonetheless, they both agreed to be less doubtful of their training together in the future."}, {"tag": "p", "text": "Sometime later, Bridger infiltrated the Academy for Young Imperials on Lothal in order to discover the location of a large Imperial kyber crystal of great power, which the rebels wanted to destroy. He was able to locate the information, but also learned that the Inquisitor was taking students who were deemed to be Force-sensitive; the students were later known only to have disappeared from the Academy. He and one of the Force-sensitive students, Jai Kell, were able to escape, and the Inquisitor recognized Bridger—who had been posing as a cadet—as the Padawan he encountered on Stygeon Prime, and questioned another cadet, Zare Leonis, about what he knew of the rebels. The rebels encountered the Inquisitor again on the fifteenth anniversary of the rise of the Empire, and he confronted Jarrus and Bridger on Fort Anaxes, where Bridger tapped into the dark side to help them escape. As a result of these encounters and the danger posed by the Inquisitor, the Jedi hunter became a source of fear for Bridger, who saw him as someone who could kill his friends and leave him abandoned and alone again, just as he had been as an orphan on Lothal. In order to take the next step in his Jedi training, Bridger had to overcome that fear. Once he did, he was able to acquire a kyber crystal and build his own lightsaber."}, {"tag": "p", "text": "The rebels also later learned that Trayvis was an Imperial agent. He sent out another message claiming he wanted to meet the rebels at the Lothal City Capitol Building on Lothal, but the meeting was a trap set by Agent Kallus. The rebels were able to escape, and Trayvis—his cover having been blown—appeared on HoloNet News denouncing the so-called violence of the rebels."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The mission to rescue Luminara Unduli was the main plot of \"Rise of the Old Masters,\" the third episode of the first season of the animated television series Star Wars Rebels. The mission, which was first revealed in the reference book Star Wars Rebels: The Visual Guide by Adam Bray, was also adapted into the chapter book Droids in Distress by Michael Kogge and The Inquisitor's Trap by Meredith Rusu. The mission allowed the creative team to make use of the Spire on-screen; the prison had originally been created for an arc in the animated television series Star Wars: The Clone Wars, but the episodes were never completed as a result of the show's cancellation. The episodes were adapted into the comic book series Star Wars: Darth Maul—Son of Dathomir, in which the Spire appeared in the first issue, but the mission in \"Rise of the Old Masters\" was its first on-screen appearance. Some concept art for the mission, including the Phantom attached to the side of the prison, was submitted on October 10, 2013."}, {"tag": "p", "text": "Dave Filoni, executive producer of Star Wars Rebels, explained that the mission was a way to tell a story about what happened to some of the Jedi who did not die in the initial execution of Order 66. It also allowed the show, which is heavily influenced by the original trilogy, to offer a connection to the prequel trilogy and to The Clone Wars; the team picked Luminara Unduli as the Jedi the rebels wanted to rescue because she was known to the audience of The Clone Wars. By using an established character for the mission, the show was, according to Filoni, able to show what the Empire destroyed and how \"it destroyed a lot of these characters\" that audiences knew."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}