{"url": "Duel_on_Rhen_Var", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Rhen Var"}, {"tag": "p", "text": "The Duel on Rhen Var was a lightsaber battle that took place in the year 3986 BBY between the former Sith Lord Ulic Qel-Droma and the Cathar Jedi Knight Sylvar. After tracking the self-exiled Qel-Droma to the ice planet Rhen Var with the help of a spacer named Hoggon, Sylvar confronted him and was determined to make him pay for all the lives lost in the Great Sith War, of which Qel-Droma was a chief instigator during his tenure with Dark Lord Exar Kun's Sith Brotherhood some ten years prior. Qel-Droma—who, while on Rhen Var, had since completed the Jedi training of Vima Sunrider, daughter of his former lover, Nomi—answered the challenge of his accuser, and the two engaged in lightsaber combat. However, Qel-Droma quickly realized that Sylvar was allowing her anger to drive her dangerously close to accepting the dark side of the Force, like he had once done. Unwilling to be the instrument of Sylvar's downfall, Qel-Droma deactivated his weapon and refused to fight any longer; Sylvar, a devout Jedi, was unable to attack an unarmed opponent, thus forcing her to disengage him and accept the truth of where her emotions had led her. Ulic Qel-Droma, the object of Sylvar's rage, was the same individual to redeem her and free her of the hatred she held on to for so long."}, {"tag": "p", "text": "Though Sylvar's inner peace was finally restored, it was immediately put to the test. Hoggon, who had been watching nearby, became embittered by the Cathar Jedi's sudden change of heart and mortally wounded Qel-Droma with a shot from his blaster pistol in an attempt to solidify a place for himself in the annals of galactic history. The spacer then promptly departed, after having been spared the wrath of Sylvar, whose recent redemption had kept her from killing him only moments before. Meanwhile, as Ulic Qel-Droma lay dying on a cliff, he declared Nomi's daughter Vima a fully vested Jedi. Then, much to their surprise, he faded into the Force, in the way of newly deceased Jedi Masters."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Ten years after the culmination of the Great Sith War, the galaxy remained in a prolonged state of recovery, a direct result of the devastation wrought by the chief instigator of the war—Dark Lord Exar Kun and his Sith Brotherhood. While the Sith were defeated and their Dark Lord ultimately destroyed on the jungle moon of Yavin 4, Ulic Qel-Droma—Kun's protégé and co-conspirator of the conflict—survived, though at great personal cost. He had been rendered Force-blind by the Jedi Knight Nomi Sunrider. Furthermore, the fallen Jedi had never been held accountable for his role in the events, and was instead allowed to roam the galaxy a free man. Despite having renounced his position as a Sith Lord, Qel-Droma was still haunted by his transgressions and wished to retreat entirely from galactic notice in perpetual exile. Keeping his identity secret, he hired a fervent Jedi-enthusiastic spacer named Hoggon to take him somewhere far-removed where he could spend the rest of his days in solitude. After visiting several planets he deemed unsuitable for one reason or another, Qel-Droma finally settled for the ice world of Rhen Var."}, {"tag": "p", "text": "During that same time, a Jedi Convocation was called—the first one to be held since the gathering on the planet Deneba some ten years prior. It had been organized by Head of the Order Nomi Sunrider on the Exis mining station in the Teedio system. Of all those present, one of the most vocal was the female Cathar Jedi Sylvar, who had lost her mate, Crado, during the war. Though it was not his fault, Qel-Droma was held responsible by Sylvar for Crado's demise, as well as for the deaths of countless others who perished during Qel-Droma's time as a Sith."}, {"tag": "p", "text": "Outraged by the Republic's failure to bring Qel-Droma to justice, Sylvar's anger festered within her, and she became consumed with notions of exacting personal revenge against the former Knight. Several attempts were made by her comrade, Twi'lek Jedi Tott Doneeta, to help Sylvar release her hate, but to no avail. The negativity of Sylvar's emotions was leading her perilously close to the dark side of the Force, and upon recognition of this, Doneeta left Sylvar to sort out her own issues. When she received word that the daughter of her close friend Nomi Sunrider was missing, however, Sylvar sidelined her quest for vengeance to go and assist her fellow Jedi Knight."}, {"tag": "p", "text": "Sylvar met with Sunrider on Exis Station, only to learn that her daughter, Vima, had willingly left Nomi to become the student of Qel-Droma. Outraged by what she perceived as Sunrider's weakness in character, Sylvar stalked off, only to be chanced upon by Hoggon, who himself had come to the station with intentions of reporting Qel-Droma's place of exile to the Jedi. He had been eavesdropping on the conversation between the two women and offered Sylvar passage to Qel-Droma's location with hopes that, in doing so, he would bear witness to a climactic battle between two famed Jedi Knights. With retribution in mind, Sylvar accepted his offer and allowed Hoggon to take her to Rhen Var."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "The Cathar Jedi's arrival on Rhen Var was preceded by Master Sunrider, who herself had come to the ice world to collect her wayward child. While she briefly united with her daughter and Qel-Droma, who had recently completed Vima's Jedi training, Hoggon's ship touched down toward the rear of the fortress in which Qel-Droma had chosen to spend the rest of his days. Hoggon offered to assist Sylvar with taking Qel-Droma down but was sharply refused, as she immediately exited and set out for her quarry. Lightsaber in hand, Sylvar found Qel-Droma alone in the fortress and issued her challenge, naming him a Republic war criminal and blaming him for Crado's destruction. Qel-Droma, however, was reluctant to fight her and refused to accept responsibility for the decisions made by Sylvar's mate. He believed that Sylvar's self-proclaimed role as an administrator of justice was only a façade she used to mask her own guilt at failing to save Crado. Nevertheless, he ignited his yellow-bladed lightsaber in his defense, moments before the Cathar Jedi attacked him in a fit of rage."}, {"tag": "p", "text": "Sylvar unleashed her hatred as she rained down blows upon Qel-Droma. He blocked each attack without retaliating, unwilling to fight and reciprocate the aggression that she demonstrated. When the opportunity presented itself, Qel-Droma disengaged from Sylvar and ran while also attempting to talk her into abandoning her convoluted need to avenge her losses. Sylvar was unmoved by his words and gave chase, eventually catching her foe on a steep cliff wall, where she initiated combat with him yet again. Qel-Droma, who was determined to make Sylvar realize the error of her hatred, allowed the Cathar Jedi to release her negative emotions with each blow as she steadily drove him backward. When he had finally been pushed to the edge of the precipice, Qel-Droma deactivated his lightsaber and refused to fight Sylvar any longer. Unable to strike an unarmed and unwilling opponent, Sylvar too retracted her energy blade and cursed Qel-Droma for the irony of him—the reason for her anger—being also the instrument of her redemption."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Sensing the struggle between Sylvar and Qel-Droma through the Force, Nomi and Vima Sunrider rushed to the scene of combat and arrived to find Sylvar finally at peace with Qel-Droma, as well as with herself. Hoggon, who had been watching the contest nearby, was disappointed with Sylvar for her inability to strike down her adversary. Before he could be stopped, the spacer shot Qel-Droma at point-blank range through the chest with his personal blaster pistol. Believing himself to be a hero for having just killed the man that so many considered a war criminal, Hoggon reveled in the enormity of his act and planned to boast about it to all whom he knew. He was quickly seized by Sylvar, however, who held him in contempt for his ignorance and would have surely killed him had her own repentance not taken place mere moments before. Confused, Hoggon then scurried away from the Jedi and left them on Rhen Var, wondering why his action was not met with gratitude."}, {"tag": "p", "text": "Meanwhile, as Nomi cradled the dying Ulic Qel-Droma on the edge of his fortress of solitude, Qel-Droma asked forgiveness of his former love, while also christening her daughter a full-fledged Knight of the Republic. He then died, and to the surprise of those present, his body faded into the Force, as was only the way of Jedi Masters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel on Rhen Var was the final scene in the fifth installment of Tales of the Jedi's Redemption story arc, simply titled Master. The duel depicts the second time in which one of the bystanding characters—Nomi Sunrider—witnesses the death of a lover or former lover, the first being the murder of her husband Andur thirteen \"in-universe\" years prior. Coincidentally, Sunrider's daughter Vima also bore witness to the same two events."}, {"tag": "p", "text": "The scene, as with the entire Redemption story line, was the culmination of months of close collaboration between writer Kevin J. Anderson and artist Christian Gossett, who worked hand-in-hand with the intention of producing a very emotional climax to the entire Tales of the Jedi series. In an interview with Gossett, the artist remarked how the death of Ulic Qel-Droma, the first professionally drawn character of his Star Wars career, was especially important to him. Knowing that Qel-Droma's death was scheduled to occur in Redemption, Gossett was invited to Kevin J. Anderson's Colorado home, where they spent much time laying out each scene frame-by-frame."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}