{"url": "Duel_on_Terephon", "categories": ["Category:Legends articles", "Category:Battles in the Hapes Cluster", "Category:Battles of the Second Galactic Civil War", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Terephon"}, {"tag": "p", "text": "A duel between two Force users occurred on the planet Terephon in the year 40 ABY, being the fifth and final confrontation between Jedi Grand Master Luke Skywalker and Lumiya, Dark Lady of the Sith. It occurred during the Second Galactic Civil War, when Skywalker blamed Lumiya for the death of his wife and wanted revenge, and resulted in Lumiya's death."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Having ensured that her pupil, Jacen Solo, had fulfilled his destiny in becoming a Sith Lord with the murder of his aunt, Mara Jade Skywalker, Lumiya accepted that her life's work was complete, and after a short discussion with Solo on the Sith world of Ziost, set off to Terephon, near Kavan, where Jade Skywalker had met her end. Luke Skywalker, following a call in the Force urging him to Terephon, traveled grief-stricken to the Transitory Mists and awaited his quarry. He had no doubt that Lumiya had killed his wife, unaware as he was of the facts surrounding Mara's death. As the remainder of the Skywalker and Solo clan, minus Jacen, grieved on Hapes, Lumiya emerged in the Terephon system."}, {"tag": "h2", "text": "Dogfight over Terephon"}, {"tag": "p", "text": "Demonstrating his superior piloting skills in his StealthX, Skywalker soon forced Lumiya down onto the surface of Terephon. The old lovers landed their respective ships on a mesa overlooking a grand Terephonian city. Skywalker leapt from his vessel, clutching his lightsaber in a two-handed grip, forgoing the shoto he had previously used to combat Lumiya's signature weapon, the lightwhip."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "As the two opponents met in battle, it soon became apparent that the duel was in Skywalker's favor. Although the Dark Lady fought as best she could, there were no distractions to deter the inexorable might of the Grand Master; unlike Roqoo or the resort station at Gilatter VIII, Lumiya was not surrounded by objects or hostages. Atop the cliff, Skywalker ducked inside her defenses and their weapons clashed. Slowly, the Jedi forced Lumiya to the edge of the mesa by continually beating down her guard, each step eroding her strength and sending her feet sliding towards the sheer drop. The ground began to crumble, and Lumiya slipped, her lightwhip tumbling off the precipice. As the Dark Lady fell, Skywalker grabbed her by the wrist and raised her back onto firm ground, meeting her intense gaze. With a long arc of his lightsaber, he brought the blade around to decapitate his opponent of so many years."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When Ben revealed it could not have been Lumiya who murdered his wife, Luke sank into deep despair, unable to live with the fact that he had killed the wrong person. He grew to believe that it had been the rogue Dark Jedi Alema Rar, and organized a task force to hunt the deranged Twi'lek down. It would be time before he learned that Jacen Solo, now the new Dark Lord, was the true culprit."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}