{"url": "Duel_on_Tatooine_(Imperial_Period)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles of Tatooine", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Tatooine  (Imperial Period)"}, {"tag": "p", "text": "A duel occurred on the planet Tatooine in the year 17 BBY between two Jedi who had escaped the Jedi Order's extinction in Order 66—A'Sharad Hett and Obi-Wan Kenobi. In the aftermath of Order 66, Hett returned to his homeworld of Tatooine and became warlord of a number of Tusken Raider clans, as his father had done decades before. Leading the Tuskens in an aggressive campaign against the settlers of Tatooine, Hett and his war band eventually came across the Lars homestead on the outskirts of the Jundland Wastes. Little did he know, however, that the Lars moisture farm was under the covert protection of Jedi Master Kenobi, who had also survived Palpatine's Order 66. After a brief discussion between the two Jedi, during which Hett refused to put an end to his campaign of aggression, Kenobi and Hett found themselves involved in a fierce duel. Despite Hett's skill with wielding two lightsabers, Kenobi was able to defeat the fallen Jedi. Kenobi then made Hett swear on his father's honor not to return to Tatooine again, thus ensuring the continued protection of the Lars Homestead. Hett complied with Kenobi's demands, and agreed to never return to the backwater desert world."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the final moments of the Clone Wars, Palpatine issued a top-secret command, better known as Order 66, to a number of clone commanders. The order commanded the clones to assassinate their Jedi commanders, and the Jedi Order was virtually annihilated as a result—the Great Jedi Purge had begun. Meanwhile, A'Sharad Hett, a Tusken Jedi, had been on a scouting mission near enemy lines, away from his clone troopers, when the order was given. After witnessing the deaths of numerous Jedi comrades, Hett made his way back to his clones and killed those assigned to execute him. After killing most of the clones, he kept one trooper alive just long enough to learn what had transpired, and why the clones had turned on the Jedi. Following his survival of Order 66, Hett fled the field of battle and attempted to reach out to other Jedi through the Force. However, he was unable to sense any other Jedi and, fearing the worst, set out to plan his own private war against the forces of Palpatine."}, {"tag": "p", "text": "Believing himself to be the only Jedi to have survived Order 66, Hett made his way back to his birth world of Tatooine, and once again donned the wrappings of a Tusken Raider. Just as his father had done before him, A'Sharad Hett united several Tusken clans and proclaimed himself their warlord. In response to the age-old war against the Tusken people by the settlers of Tatooine, Hett led his new war bands in retaliation against the Human settlements that had encroached on Tusken land. Honed through years of fighting in the Clone Wars, Hett's leadership and skills as a warrior did much to gain back Tusken land that had been lost since the death of his father. Under the leadership of A'Sharad Hett, the Tusken Raiders again became a feared fighting unit, taking by force the land that they believed was theirs by right."}, {"tag": "p", "text": "Through fragmented reports from other colonists, Obi-Wan Kenobi, who had settled on Tatooine to protect the infant son of Darth Vader, learned that the Tuskens had attacked at least three large moisture farms and had even killed seven farmers in a single day. Unaware that his former comrade had come back to his homeworld following Order 66, Kenobi was unsettled by the strong Force presence that he sensed on the desert world; thinking it might be the Sith, Kenobi determined to stay close to the Lars moisture farm, where young Luke Skywalker was living, in case his help was needed. Setting out to travel to the Lars homestead, Kenobi came across the Valley of the Spirits where he was approached by the spirit of his dead master, Qui-Gon Jinn. His spirit told Kenobi about the slaughter that Anakin Skywalker had precipitated in the valley, and how he had only shared the information with the Tusken-turned-Jedi A'Sharad Hett. Slowly putting the pieces together, Kenobi asked Jinn if the tribe that Anakin had destroyed was that of Hett and his father; however, Jinn would not answer if Kenobi's assumptions were true or not. With this knowledge, Kenobi continued on his route to the Lars homestead, intent on being between Hett and his Tusken army and the Lars family."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Eventually Hett and his Tusken warriors came across a small moisture farm on the edge of the Jundland Wastes, which belonged to the Lars family. To Hett's mild surprise, his war band was halted by none other than his old Jedi acquaintance, Obi-Wan Kenobi, who had also chosen Tatooine to hide from Palpatine. While living in the desert, Kenobi had noticed the Tuskens and their aggressive campaign that Hett had been leading, and had decided that he was slowly falling to the dark side. Confronting Hett at the Lars homestead, Kenobi shared with the Tusken warlord his fears that Hett was becoming the very thing that the Jedi had sworn to fight against. Kenobi continued by asking him to stop his crusade against the settlers of Tatooine, but Hett refused to listen to Kenobi. Hett argued that it was the Jedi's job, indeed his job, to defend those who were oppressed, and that that was why he fought for the Tuskens. Refusing to forgive the settlers, whom he had witnessed killing countless Tuskens, Hett advised Kenobi that he would continue his war."}, {"tag": "p", "text": "With the whole of the Tusken army watching, the two Jedi ignited their lightsabers and fought a vicious duel in the sands surrounding the Lars moisture farm. The fight lasted for several minutes, and both men demonstrated the skills they had earned throughout their careers as Jedi. The duel, however, ended when Kenobi sliced off Hett's right arm, and tore off his Tusken wrappings—in the culture of the Tuskens, to expose any part of the flesh was forbidden and seen as a disgrace. Also, with only the use of one hand, Hett could not hope to wield the gaderffii, the traditional weapon of the Tuskens, and therefore could no longer be their warlord. Having witnessed their leader defeated and defaced at the hands of a stranger, the Tusken army left Hett to fend for himself in the desert."}, {"tag": "p", "text": "Now an outcast unable to return to his home, Hett asked Kenobi to kill him, thus giving him an honorable death in the traditions of the Tuskens. Even though Hett would not have hesitated to kill Kenobi, given the chance, Kenobi could not kill his old friend. Instead, Kenobi made Hett swear on the honor of his father that he would leave Tatooine and never return, hoping that Hett would see the error of his ways and again take up the Jedi way."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Decades after his duel with Kenobi, Hett learned that the moisture farm Kenobi had stopped him at concealed the son of Anakin Skywalker; he would also learn that Skywalker had become Darth Vader, the being responsible for so many Jedi deaths. Upon the realization that Skywalker and Vader were in fact the same person, Hett regretted protecting Skywalker's secret of massacring a tribe of Tuskens, which the young Jedi had confided to him during the Clone Wars. Hett felt that if he had turned young Skywalker over to the Jedi Council, he would have spared the galaxy untold amounts of suffering and grief."}, {"tag": "p", "text": "Hett had been training a Force-sensitive Tusken Raider named KkH'Oar'Rrhr before the duel, and Hoar continued to revere his mentor even after Hett was unmasked. Hoar decided to depart Tatooine with a number of other Tusken Raiders in search of Hett, but they ultimately were unable to locate their missing chieftain. More than one hundred years after the event, A'Sharad Hett, now the Sith Lord Darth Krayt, would retell the details of the duel to his prisoner, the former Jedi Cade Skywalker. The direct descendant of Anakin Skywalker, Cade would choose to follow his ancestor's footsteps and accept the offer to be trained in the ways of the Sith, before eventually returning to the light and killing Krayt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The duel between A'Sharad Hett and Obi-Wan Kenobi was written by author John Ostrander and illustrated by artist Jan Duursema for the sixteenth issue of the Star Wars: Legacy series of comics. After the publication of Claws of the Dragon, Part 3 there was some confusion over whether Kenobi used the Force or his lightsaber to sever Hett's right arm from his body. The confusion surrounds a series of comic-panels, drawn by Jan Duursema, which seems to suggest that Kenobi might have used the Force to amputate Hett's arm. Nevertheless, Jan Duursema replied via her official message board that, \"…the arm was not Force pulled off. Certainly would be a lot messier than the surgical precision of a lightsaber. Probably bleed to death though…\", thus clarifying the initial confusion among readers."}, {"tag": "p", "text": "Before the release of Claws of the Dragon, Part 3 there was much fan speculation regarding what type of role Obi-Wan Kenobi would have with regards to the Legacy storyline. These ranged from theories claiming that Darth Krayt was actually the lovechild of Siri Tachi and Kenobi, to stating that Kenobi's role would be a confrontation with A'Sharad Hett on Tatooine, thus causing Hett to start down the road of the dark side. Likewise, upon learning that Kenobi would have some type of role to play in the Legacy comics, fans expressed a wide range of emotions ranging from happiness, to surprise, to apathy to displeasure. Similarly, following the release of Claws of the Dragon, Part 3 in September 2007, some fans were quick to condemn Kenobi for not killing the defeated A'Sharad Hett. These claims revolved around the idea that had Kenobi killed Hett following their duel, he could have saved the galaxy from Hett's eventual fall to the dark side—this criticism relates back to Kenobi's unwillingness to kill Anakin Skywalker after defeating him on Mustafar, thus theoretically allowing Darth Vader to terrorize the galaxy. In response to these various critiques, Claws of the Dragon artist Jan Duursema retorted with, \"Would Obi-Wan be a better Jedi if he killed every misguided fool that he ever met?\" Along these same lines, writer John Ostrander commented that Kenobi suffered from what he referred to as the \"Spider-man syndrome.\" In Ostrander's own words, \"Peter Parker didn't stop the Thief when he had a chance; Thief later kills gentle Uncle Ben. Uncle Ben's death is all Peter's fault for not stopping him when he could. In this case, Hett wasn't yet a Sith or even a Dark Jedi. A'Sharad really hasn't done anything that his father, Sharad, hadn't done earlier. Killing him would not have been an appropriate response for a Jedi.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}