{"url": "Duel_on_Yavin_4", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Battles of the Clone Wars", "Category:Battles of Yavin", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Duel on Yavin 4"}, {"tag": "p", "text": "This Duel on Yavin 4 was a lightsaber battle between Jedi Padawan Anakin Skywalker and Dark Jedi Asajj Ventress that took place in 22 BBY on the jungle moon of Yavin 4, during the Clone Wars. Ventress had been dispatched by her Master, the Sith Lord Count Dooku, to prove herself by assassinating Skywalker, who was at the time leading his clone forces during the Battle of Muunilinst. Skywalker was piloting his Jedi starfighter in space over Muunilinst when he sensed the presence of Ventress, who flew her own starfighter, through the Force."}, {"tag": "p", "text": "Skywalker pursued the Dark Acolyte to Yavin 4 against the orders of his Master, Obi-Wan Kenobi and, in response, Kenobi sent a squad of clone troopers to provide support for his apprentice. Soon after landing, the squad was wiped out by Ventress, who also destroyed Skywalker's starfighter and astromech droid. The assassin revealed herself to Skywalker and the two engaged in combat. Dueling through the forest, Ventress goaded Skywalker as they approached an ancient Massassi Temple, where they continued their fight. After losing his lightsaber and confiscating one of his opponent's, Skywalker drew on his hatred of Ventress and attacked her with great force. His blows caused the cliff she stood upon to break and she fell into the ravine below."}, {"tag": "p", "text": "Seemingly victorious, the Padawan assumed she had died and acquired her ship as a means of getting off the planet. However, Ventress had survived and went on to fight in future Confederate campaigns."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Immediately upon arrival, Jedi Padawan Anakin Skywalker briefly explored his surroundings, and, after the arrival of a platoon of clones that had arrived via a CR-20 troop carrier on the orders of his Jedi Master, Obi-Wan Kenobi, began to seek out his mysterious challenger. Ventress, however, was able to ambush and kill off all of the clone troopers, destroying their transport and Skywalker's starfighter, the Azure Angel, along with R4-P22 before revealing herself, approaching the young Jedi as she emerged from within the flaming wreckage and igniting her weapons."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "As the duel began, however, Skywalker proved that he was able to hold his own against Ventress despite her command of the dark side of the Force. As Skywalker was about to strike, Ventress Force pushed him, avoiding the attack. Skywalker returned the favor with another Force Push, Ventress then answered by throwing a tree at him. Skywalker performed sun djem and managed to knock both lightsabers that Ventress had drawn out of her hands. However, when he went to finish her off, she leaped into the treetops and pulled both swords back to her. Skywalker swiftly followed, but then he lost sight of her. Ventress used the Force to snap the branch Skywalker was on, but as he fell he managed to hang onto a vine, which was then also cut by Ventress. The two duelists leapt through the jungle, going deeper and deeper into the forests of that moon and using the Force to hurl entire trees at each other as they fought, jumping from tree to tree and cutting vines they swung on. Eventually they landed on a raised walkway and Ventress attempted to use Dun Möch to knock Skywalker from the walkway."}, {"tag": "p", "text": "Skywalker attacked, forcing Ventress to back off in the face of his assault. Soon he forced her into a Massassi Temple; once inside their battle became even more violent as they made their way to the higher levels. Viciously utilizing the Force against Ventress, Skywalker hurled her backwards; she attempted to retaliate in kind by hurling loose boulders at the Padawan, but he deflected them, Force pushing her against a wall so hard that it shattered. The battle, which had degenerated into an all-out brawl, moved outside onto the rain-slicked ledges and stairways of the temple. Both combatants, their robes tattered and soaked from the rain, paused and regarded each other."}, {"tag": "p", "text": "The lightsaber duel soon resumed its violent tattoo. Ventress was able to knock Skywalker's lightsaber out of his hand, but before she could capitalize on this opportunity for a killing blow, he responded by catching her by the wrists. Drawing upon his anger, he crushed her left wrist with his mechanical hand, causing her to drop the saber she held much to her own abject shock. Taking up her lightsaber, Skywalker continued to strike at her with vicious slashing attacks and power lunges, driving her back to the edge of the temple peak. He struck harder and harder until the force from the attacks made the stone she was standing on crumble, causing her to fall off of the edge of the temple and into the jungle depths. Skywalker then roared in rage. As a result of giving into his anger once again, Anakin took yet another step closer to the dark side of the Force."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Assuming that she was dead, Skywalker tossed the lightsaber that he had seized over the precipice; he then commandeered Ventress's Ginivex-class starfighter and returned to Muunilinst where, following the battle, Obi-Wan berated him for ignoring orders and running off on his own and expressed his concern about the Sith's interest in Skywalker. In actuality, Ventress survived the fall, and left the planet. She returned to her Confederate allies and continued to fight against the Republic. Some time later, Palpatine sent Mas Amedda to the moon to acquire piranha beetles and a Massassi frieze."}, {"tag": "p", "text": "Almost 22 years later, when Palpatine's new battle station arrived near Yavin 4 to destroy the Rebel Alliance, Skywalker, as the Sith Lord Darth Vader, would recall the duel with Ventress on this moon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This duel was created for the Star Wars: Clone Wars television show that aired from 2003 to 2005. It appeared in three episodes from the second season, 17, 18, and 19; all from 2004. In episode 21, Obi-Wan Kenobi used this duel as an example of how Skywalker had passed the Trial of Skill and was ready to become a Jedi Knight. The duel was depicted in Jedi vs. Sith: The Essential Guide to the Force by Chris Trevas"}, {"tag": "p", "text": "This duel was recounted as number four on the list of the 20 Most Memorable Moments of the Expanded Universe in Star Wars Insider 83. It was billed as the meeting of the \"Heirs of the Sith.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}