{"url": "Duel_on_the_Wheel", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Articles with conjectural titles", "Category:Duels", "Category:Search for the Kyber Saber"], "nodes": [{"tag": "h1", "text": "Duel on the Wheel"}, {"tag": "p", "text": "During the Search for the Kyber Saber, the Sith agent Naare and the Force-sensitive Rowan Freemaker engaged in a duel aboard the Wheel. Naare had tortured Rowan's older siblings Zander and Kordi Freemaker in an attempt to force Rowan out of hiding. Using his improved lightsaber skills and Jedi training, Rowan managed to fight Naare to a stand still. However, Naare learned the location of the seventh Kyber Saber crystal from Roger and left the garage with the B1-series battle droid's head."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Despite capturing six of the seven Kyber Saber crystals, Naare was unable to reforge the ancient lightsaber since Rowan Freemaker and his family had escaped into space with the seventh crystal. Her Sith master Emperor Palpatine demanded that she deliver the weapon to him by Empire Day. While waiting aboard her ally the Hutt crime lord Graballa's flagship Rancor's Fist, Naare and Graballa received word from the Kubaz spy Garindan that Rowan's older brother Zander and sister Kordi Freemaker had been sighted on Tatooine."}, {"tag": "p", "text": "After Rowan and the B1-series battle droid Roger had fled with the seventh crystal to an uncharted world, Zander and Kordi had traveled across several worlds in an attempt to find their little brother. Unsuccessful, they returned to their garage on the Wheel space station. Upon arriving, they were greeted by their Aqualish landlord Furlac, who reminded them that their rent was overdue and demanded compensation for damages to their door."}, {"tag": "p", "text": "Shortly later, Naare, Graballa, and his henchmen arrived in the Freemaker Garage and took Kordi and Zander prisoner. In an attempt to force Rowan out of hiding, Naare emotionally tortured Zander and Kordi by destroying several of their prized possessions including his Z-wing ships: including the Blazemaker and the StarScavenger and Kordi's Credits. While Rowan was training with his lightsaber offworld, he sensed his siblings' pain. Despite Roger's advice that Naare was setting a trap, Rowan returned to save his family."}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "Rowan and Roger arrived back on the Wheel in the Mini Scavenger just before Naare could torture Kordi and Zander with her lightsaber. The two then leapt onto a platform with Rowan challenging Naare to a duel. The bounty hunter Dengar fired at Rowan but the boy deflected his blasts at Zander and Kordi's chains, freeing them. A skirmish broke out in the Freemaker Garage with Kordi and Zander shooting at Graballa's henchmen."}, {"tag": "p", "text": "Refusing to surrender the last Kyber Saber crystal, Rowan engaged Naare in a lightsaber duel. At Rowan's command, Roger released several pieces of debris from the StarScavenger on top of the Sith. However, Naare swept them away with the Force. Meanwhile, Zander trapped the Iktotchi bounty hunters Baash and Raam under a magnetizer. Kordi then trapped Dengar's bandages in a turbofan but the bounty hunter managed to break free by firing at the machine."}, {"tag": "p", "text": "As the fighting continued, Rowan told Naare that he had hidden the seventh Kyber Saber on an uncharted world. Graballa tried to implore Baash and Raam to let go but the two Iktotchi were unwilling to part with their blasters. Zander then fired a gas canister at the Hutt, causing him to crash into the two Iktotchi. Using his lightsaber skills, Rowan deflected Naare's attacks. When Naare demanded to know who had trained the boy, Roger revealed that he had taught the boy everything."}, {"tag": "p", "text": "Naare then realized that Roger knew the location of the seventh Kyber Saber crystal and stole the droid's head. She then used debris to pin down Rowan and his siblings. Believing they had won, Graballa then demanded that Naare honor her earlier agreement and share half the Kyber Saber crystals with them. However, Naare revealed that she had been deceiving them and used her Force powers to drive them out of the garage. Naare then depart with Roger's head aboard the Eclipse Fighter to find the seventh Kyber Saber crystal."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Duel on the Wheel caused extensive damage to the Freemaker Garage and the Freemaker's starships including the StarScavenger. The Freemakers survived the duel but had to deal with the kidnapping Roger's head and the fact that Naare now knew the location of the seventh Kyber Saber crystal. While despondent, Rowan refused to give up. After repairing the Garage and their starships, Rowan embarked on a plan to steal the Kyber Saber from Naare. This set the stage for a skirmish on Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duel on the Wheel serves as the main conflict of the LEGO Star Wars: The Freemaker Adventures Season One episode \"Duel of Destiny\", which premiered on August 22, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}