{"url": "Duelist_Elite", "categories": ["Category:Legends articles", "Category:Training droid models", "Category:Trang Robotics products"], "nodes": [{"tag": "h1", "text": "Duelist Elite"}, {"tag": "p", "text": "The Duelist Elite was a droid model built by Trang Robotics. These droids were considered \"top-of-the-line\" during the time of the Galactic Empire. Darths Sidious, Tyranus, and Maul used them in the Works to train for lightsaber combat. A new one cost 275,000 credits."}, {"tag": "p", "text": "The droids were masters of the three classical fencing styles of foil, épée, and saber. They could be equipped with a variety of melee weapons, including vibroblades; were built with blaster-resistant durasteel chassis; programmed with the knowledge of a dozen martial arts masters; and had reflexes just a hair faster than Human optimum."}, {"tag": "p", "text": "Factory-equipped Duelist Elites were equipped with inhibitors that would prevent them from dealing a death blow to a beaten opponent, which the Sith disabled for their sparring and training. Darth Vader owned several of these droids, but since they were no match for him, he tended to use modified ASP droids instead."}, {"tag": "p", "text": "Darth Maul was known to have sparred against Rapier, Hachete, Cudgel, and Chain."}, {"tag": "p", "text": "State-of-the-art Duelist Elite combat droids with flexisteel sabers and vocabulators were employed to guard the Sun Runner counterfeit ship fabricated in 23 BBY by Groodo the Hutt for his Jedi-foiled attempt to destroy the orbital Fondor Shipyards. The droids were reduced to smoldering scrap, however, by 18-year-old lightsaber-wielding Jedi Padawan Anakin Skywalker before he destroyed the false Sun Runner itself with a hypermatter reactor-planted proton grenade."}, {"tag": "p", "text": "The pirate Raskar utilized a Duelist Elite as a sparring droid. He also modified it to act as a security guard in the event of a breakin, as Han Solo discovered when breaking into his villa to retrieve Raskar's power gem. However, Solo tricked the droid into charging into destruct beams surrounding the power gem and destroyed it, consequently also causing Raskar to believe Solo died until he returned to the Villa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}