{"url": "Dug", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Dugs", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Dug"}, {"tag": "p", "text": "The Dugs were a sentient species from the planet Malastare. They were easily identified by their long snouts and the fact that they walked using their arms. On Malastare, the Dugs were ruled by the Dug Council, which during the Clone Wars was headed by Nakha Urus, who held the title of Doge. Some Dugs were known to travel off-world in order to seek lives off of Malastare. The pilot Sebulba became a well known and feared Podracer pilot, while a Dug named Preigo headed a popular circus. Dugs could also be found on the worlds of Coruscant and Tatooine."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Dugs were a sentient species who were recognizable for their unique gait. As opposed to walking on their feet, Dugs moved about on their hands, while their feet, which also acted like a second pair of hands, hung in the air, giving Dugs an inverted appearance. Dugs had elongated snouts, which sometimes grew fleshy tendrils that gave off the appearance of having facial hair. Dugs could often be found with dark purple skin that dominated their bodies. Their front sides were often lighter in color, and their faces could contain reddish hues. At least one Dug, who resided on the planet of Coruscant, displayed green-tinted skin.[source?] Dugs were a sentient species. Their native habitat was desert or wastelands. Loose skin on the necks of Dugs inflated to make mating calls."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Dugs hailed from the planet of Malastare, where early tribes were harassed by a monster known as the Zillo Beast. As the Dugs expanded across their world and began drilling operations to look for fuel, they drove the creatures close to extinction, while recording every weakness that the animals had. Eventually, it was believed that the creatures were extinct, save for one which had gone into hiding. As such, generation after generation of Dug prepared the next generation for what would be an eventual encounter with the remaining Zillo Beast."}, {"tag": "p", "text": "During the Clone Wars, which took place during the reign of the Galactic Republic, the forces of the Confederacy of Independent Systems arrived on Malastare in order to tap their fuel reserves. The Republic intervened, and during the ensuing conflict the final Zillo Beast revealed itself. Although the Dugs, led by their leader Doge Nakha Urus, attempted to kill it, the Republic forces managed to knock it out and take it back to Coruscant. The Dugs eventually signed a treaty with the Republic."}, {"tag": "h2", "text": "Dugs in the galaxy"}, {"tag": "p", "text": "During the reign of the Galactic Republic, Dugs could be found off of their homeworld and taking part in the activities of the outside galaxy. One of the best known Dugs was Sebulba, a menacing podracer pilot who was known to employ cheap tactics and illegal weapons to win races. Sebulba was the routine crowd favorite of the Boonta Eve Classic race, located on the planet Tatooine. Dugs could also be found on Coruscant shortly before the start of the Clone Wars. Preigo was a Dug circus ringmaster who would perform shows for a modest fee, in hopes of entertaining those who needed some fun during the darkness of the Clone Wars. Preigo was known to entertain the pirate gang of Hondo Ohnaka, although, ever since a performance where one of Preigo's artists was killed by one of Ohnaka's pirates, the Dug has been hesitant when entertaining for Ohnaka afterwards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dugs first appeared in the 1999 film Star Wars: Episode I The Phantom Menace. The species was created as part of the development process as George Lucas had the idea of a creature that would use his hands as feet and his feet as his arms like an arachnid but with a arrogant camel-like face."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}