{"url": "Duinuogwuin_Contention", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Conflicts of the Core Worlds"], "nodes": [{"tag": "h1", "text": "Duinuogwuin Contention"}, {"tag": "p", "text": "The Duinuogwuin Contention took place in 15,500 BBY and was a major conflict between the Galactic Republic and the Duinuogwuin people. Exploration scouts from the Republic made first contact with the Duinuogwuin, or \"Star Dragons\" as they were known. Having been frightened by their appearance, the scouts beat a hasty retreat to the Republic capital, Coruscant. Hundreds of Duinuogwuin followed through space and attacked the capital, until peace was brokered by Supreme Chancellor Fillorean."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Indecta Era, the Galactic Republic sought to explore the galaxy and seek out new lifeforms. In 15,500 BBY, Republic scouts exploring the Outer Rim made first contact with the Duinuogwuin, or \"Star Dragons,\" as they were commonly known, near the planet Murkhana. The Duinuogwuin were fifty-meter long sentients that could fly through space and breathe atomic fire—the scouts responded with fear. The first meeting between the two parties was a disaster, and gave rise to conflict between the entire Duinuogwuin species and the Galactic Republic."}, {"tag": "p", "text": "The scouts beat a hasty retreat back to the Republic's capital, Coruscant. Hundreds of Duinuogwuin, responding to the first contact, followed the scout ships through space, and upon reaching the capital, attacked it. The Duinuogwuin laid waste to Galactic City, breathing their atomic fire and bringing devastation, causing concern among the Core Worlds as a result. Supreme Chancellor Fillorean was able to broker peace, and bring an end to the Duinuogwuin Contention by negotiating with the Duinuogwuin philosopher Borz'Mat'oh."}, {"tag": "p", "text": "In the wake of the mutual peace, Fillorean and Borz'Mat'oh founded the University of Coruscant, an academic institution which endured for thousands upon thousands of years. Within the main campus, statues of both Fillorean and Borz'Mat'oh were erected. Coruscant itself later came to be seen as the focal point for the Duinuogwuin Contention."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duinuogwuin Contention was first mentioned in the sourcebook Coruscant and the Core Worlds, published in 2003."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}