{"url": "Dunan_Par%27Ell", "categories": ["Category:Legends articles", "Category:Business owners and executives", "Category:Galactic Empire military personnel", "Category:Humans", "Category:Males", "Category:Martial artists"], "nodes": [{"tag": "h1", "text": "Dunan Par'Ell"}, {"tag": "p", "text": "Dunan Par'Ell was a male Human and owner of a security firm named Universal Guardians, Incorporated and head of security at the Ace of Sabres gambling resort."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Security Analyst"}, {"tag": "p", "text": "Dunan Par'Ell spent a decade in the Imperial Military before entering civilian life. Par'Ell began hiring himself out as a security analyst and bodyguard charged extremely high fees due to his background and reputation. He used this money to start up his own private security firm: Universal Guardians, Incorporated."}, {"tag": "h3", "text": "Ace of Sabers"}, {"tag": "p", "text": "After starting up his own firm Dunan delegated the daily operations to his lieutenants and was hired full-time as the head of security at popular casinos the Ace of Sabres. In addition to his casino work he remained on personal retainer for a variety of elite individuals."}, {"tag": "p", "text": "While he was at the casino he foiled an assassination attempt on Ambassador Kollrin. The assassin Tovric was at the Liar's Cut table next to Kollrin as the ambassador proceeded to lose several hands. When Kollrin had decided that he had lost enough money for the day he motioned for his guard to escort him back to his room. The guard, however, was across the crowded casino floor and had to approach the table."}, {"tag": "p", "text": "Tovric saw his opportunity and pulled out what appeared to be a standard stylus but was actually held a concealed monomolecular blade that sprung out of the end. He stabbed the blade at Kollrin's neck but Dunan appeared out of nowhere and grabbed his wrist and stopped the strike."}, {"tag": "p", "text": "Dunan quickly forced Tovric to his knees as he easily overpowered the would-be assassin. Dunan locked his other hand around Tovric's neck and choked the assassin into unconsciousness."}, {"tag": "p", "text": "Some like Cohden K'Reye believed that Dunan never really left Imperial service and that he took his job at the Ace of Sabers as a way to monitor the rich and powerful that frequented the casino."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Always calm and collected, even in the middle of a fight, Dunan proved to be a very intimidating opponent. He was not egotistical or flashy, instead finishing fights quickly and efficiently. He had a soft but commanding voice that rarely rose above a whisper, and most beings quieted down to listen when he spoke."}, {"tag": "p", "text": "Dunan was a lean, taut, and wiry like a coiled duraspring. Although he wasn't bulky, he had incredible strength for his size; when he grabbed someone's wrist they first thought he was a droid due to the strength of his grip."}, {"tag": "p", "text": "Although he is Human, his eyes have reflective surfaces instead of pupils causing those to look into his eyes to see themselves reflected back."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Dunan was a highly skilled combatant in ranged, melee and hand-to-hand combat. He mastered the ancient martial art of the k'Jtari species."}, {"tag": "p", "text": "He was far from useless outside of combat with tremendous skill and training in stealth, espionage, and knowledge of Imperial Intelligence operations and the Imperial royal court. In addition he spoke two dozen languages, including Huttese."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Dunan wore a scarlet cloak over his black body armor. Although he was highly proficient in hand-to-hand combat, he was a combat pragmatist and would carry a Renegade heavy blaster pistol, a Merr-Sonn stun baton, smoke grenades, a backup hold-out blaster and throwing knives. He was deadly with every weapon he carried."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dunan Par'Ell was designed by Paul Danner and Bill Smith for Wretched Hives of Scum & Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and appearances"}]}