{"url": "Dune_Sea/Legends", "categories": ["Category:Legends articles", "Category:Deserts", "Category:Dune Sea locations", "Category:Tatooine locations"], "nodes": [{"tag": "h1", "text": "Dune Sea"}, {"tag": "p", "text": "The Dune Sea was a vast, sandy desert that stretched across the surface of Tatooine. In the Tatooine navigation system, it was located in the planet's first quadrant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Dune Sea on Tatooine was once the bed of an inland sea. In the Tatooine navigation system, it was located in the planet's first quadrant."}, {"tag": "p", "text": "Extreme temperatures and lack of water made the area inhospitable to most lifeforms. A Human could dehydrate after about thirty minutes from overexposure."}, {"tag": "p", "text": "During the time of the Infinite Empire, a Rakatan star temple was built in a cave in the Eastern Dune Sea. Revan and his companions found the map being guarded by a krayt dragon and used its information to discover Lehon."}, {"tag": "p", "text": "Jabba's Palace was located just beyond the southwestern border of this desert. During his time on Tatooine, Obi-Wan Kenobi lived in a hut in the Jundland Wastes that was also located near the southwestern edge of the sea. The Dune Sea was home to the sarlacc that lived in the Great Pit of Carkoon."}, {"tag": "p", "text": "Following the escape of the droids R2-D2 and C-3PO from their clutches, the Galactic Empire conducted a search of the entire planet. During their search in the Dune Sea, they discovered a small cell of Alliance to Restore the Republic soldiers and wiped them out, as well as a Tusken Raider camp nearby."}, {"tag": "p", "text": "In 22 ABY, Tahiri Veila and Anakin Solo survived its harshest deserts, a krayt dragon, and a sarlacc, and exercised their growing Force powers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The real-world locations for the Dune Sea are the Grand Dune in Tunisia and Yuma Desert in California."}, {"tag": "p", "text": "It is believed to be inspired by Frank Herbert's planet Arrakis from the Dune series."}, {"tag": "p", "text": "The Dune Sea appears in a map in the 2004 video game Star Wars: Battlefront. During the Historical Campaign, the battle on the map appears as an Imperial mission, although the game's story was secondary continuity, according to Leland Chee, the keeper of Lucasfilm Ltd.'s Holocron continuity database."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}