{"url": "Durgolosk", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Creatures of Barab I", "Category:Creatures of unspecified biology", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Durgolosk"}, {"tag": "p", "text": "Durgolosks were a non-sentient, six-legged species of fearsome predators native to the swamps of the planet Barab I. Members of the species were huge and white and brown in color. They also possessed tentacles that were tipped with venom. Durgolosks spent more time sleeping than hunting but ate any creature they met when they did hunt. The Barabel species, which was also native to Barab I, considered the slaying of a durgolosk to be an impressive achievement."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The durgolosk was a non-sentient, predatory species native to the swamp world Barab I. Huge in size, the creatures had six three-clawed legs located beneath their body and a pair of arms attached above the legs. A durgolosk had short, clawed arms with thin tentacles protruding from the ends, and the tentacles had paralyzing venom at the tips. Durgolosks could rotate their torsos almost a full 360 degrees, and their bodies were covered in pale-white hide with brown stripes. Their heads featured a large, brown crest on the back above six black eyes, which were spaced radially, and jaws full of teeth ten to fifteen centimeters long. Durgolosks possessed good vision in both light and dark environments and had a keen sense of smell."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Durgolosks spent most of their time sleeping, but while hunting, a durgolosk attempted to consume any animal it came across. Durgolosks were not territorial, roaming across their homeworld during the nighttime, and they hid in crevasses during the intense heat of Barab I's daylight hours."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Barabels, a sentient species also native to Barab I, considered the killing of a durgolosk during a hunt to be an extremely impressive feat; doing so increased an individual's status within their society."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Durgolosks were first mentioned and pictured in Geonosis and the Outer Rim Worlds, a sourcebook released in 2004 as part of Wizards of the Coast's Star Wars Roleplaying Game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}