{"url": "Durge", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Bounty hunters", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Durge"}, {"tag": "p", "text": "Durge was a fearsome male bounty hunter who encountered Doctor Chelli Lona Aphra and Sana Starros aboard the abandoned luxury starship Opal Empress during the Imperial Era. At the time, Durge wore silver armor with blue and red markings and was armed with a quad-barreled rifle and a bola. He was also taller than Aphra's height of 1.56 meters."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Durge was a notorious bounty hunter who was known for being hard to kill. During the reign of the Galactic Empire, he was hired to capture Ebann Drake, who was wanted in two different systems for weapons smuggling and murder. Durge tracked Drake to the Opal Empress. However, the ship was filled with dead corpses, including Drake's. He also met Doctor Chelli Aphra and Sana Starros. When Durge threatened them both, Aphra explained that she and Starros had not killed any of the people aboard. The three of them were then attacked by a swarm of cymotes, which chased them throughout the ship. As Durge fought the parasites, Aphra remembered that cymotes were sensitive to atmospheric pressure changes, which gave them the idea to lure the creatures to an airlock and jettison them from the ship. Durge aided in their plan by leading the cymotes to one of the ship's airlocks. Once he entered the airlock with the parasites, Aphra closed the airlock on him and jettisoned him into space along with the cymotes, which exploded in the vacuum of space. Though Durge did not pursue Aphra or Starros, he remained alive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Conception and development"}, {"tag": "p", "text": "Durge first canonically debuted in Doctor Aphra 10, an issue of the 2020 Star Wars: Doctor Aphra comic book series written by Alyssa Wong and pencilled by Ray-Anthony Height."}, {"tag": "p", "text": "Durge was originally introduced in the Star Wars Legends continuity in the fifty-first issue of the comic series Star Wars: Republic, written by W. Haden Blackman, illustrated by Tomás Giorello, and published by Dark Horse Comics on March 19, 2003. He was created by Lucasfilm Ltd. as part of the Clone Wars multimedia project to be a new and memorable bounty hunter antagonist who could challenge the Jedi, designed by the Skywalker Ranch Art Department and named by Lucasfilm employees, whereas Blackman wrote his backstory and personality."}, {"tag": "h3", "text": "The Clone Wars concept"}, {"tag": "p", "text": "Early in the development of the Star Wars: The Clone Wars animated series, Star Wars creator George Lucas mandated that there would be no bounty hunters, as the series was to focus solely on the conflict and those swept up in it. However, as work on the first season progressed, there came a role that needed to be filled by a bounty hunter. Initially, Supervising Director Dave Filoni and writer Henry Gilroy explored incorporating Durge into the series. He was reimagined as a Human with elaborate body armor and gadgets, with his more outlandish alien features being excised due to budget constraints."}, {"tag": "p", "text": "This was short-lived, however, as Filoni preferred creating new characters for the series and believed that the bounty hunter character should not be called Durge if they were unable to replicate the shapeshifting abilities he had displayed in the earlier Clone Wars multimedia project. The next iteration of the bounty hunter character, named Nom Kahbah by Gilroy, retained Durge's all-concealing armor. However, the lines were smoothed out to resemble something from World War II-era Germany."}, {"tag": "p", "text": "After seeing concept art of Kahbah, George Lucas suggested the character instead draw from iconic characters from the Spaghetti Westerns that inspired the original Star Wars films, which ultimately led to the creation of the Duros bounty hunter Cad Bane."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}