{"url": "Duron_Qel-Droma", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Humans", "Category:Jedi Knights of the Jedi Order", "Category:Males", "Category:Qel-Droma family"], "nodes": [{"tag": "h1", "text": "Duron Qel-Droma"}, {"tag": "p", "text": "Duron Qel-Droma was a Human male Jedi Knight from Alderaan, most well-known for his exploits during the Great Hunt in 3993 BBY. A member of the Qel-Droma family of Jedi, Qel-Droma was the cousin of Jedi Knight Ulic Qel-Droma, who famously fell to the dark side and became a Sith Lord, battling the Jedi Order and the Galactic Republic in the Great Sith War. In the years immediately after the conflict, it fell to Duron to restore his family name. In the aftermath of the war, Sith-created monstrosities were spread out throughout the galaxy and still posed a threat. In response, the Jedi Order initiated the Great Hunt, intending to wipe out the beasts for good. Qel-Droma took up arms with a group of fellow Jedi, including fellow Human Shaela Nuur and the Twi'lek Guun Han Saresh. Qel-Droma and his compatriots battled creatures such as Sith wyrms and silan, but their greatest enemy would be the terentatek—a massive, vicious beast that fed on Force-sensitive blood. Qel-Droma and company trekked the galaxy in search of these monsters, clearing them off of worlds such as Tatooine and earning a reputation as the Jedi Order's greatest hunters."}, {"tag": "p", "text": "During the Great Hunt, Qel-Droma and Nuur developed romantic feelings for each other that stretched the limits of the Jedi Code. Although this threatened to cause a rift in the group, as Saresh deeply disapproved, by 3993 BBY the Hunt was called to an end. However, Qel-Droma, Nuur and Saresh were sent on a secret mission to clear the Sith homeworld of Korriban, a planet deeply steeped in the dark side. As they were the Order's best hunters, the Jedi High Council believed that the three could be successful, and would be able to rely on each other to resist the dark side's lure. However, once on Korriban, Qel-Droma and the others ran into severe difficulties. In order to obtain necessary information, Qel-Droma and Nuur were forced to perform illegal actions that went against Qel-Droma's moral code, and Qel-Droma began to be afflicted with a series of debilitating, prophetic visions. On Korriban, Qel-Droma and Nuur gave into their passion, leading to a disgusted Saresh leaving the group. Without Saresh, Qel-Droma and Nuur set off together to the Valley of the Dark Lords, eventually coming across a terentatek in a remote cave. However, the beast proved too much—Qel-Droma was mortally wounded while desperately trying to defend Nuur. Before he died, Qel-Droma foresaw that sometime in the future a great Jedi named Revan would find his body, and use Qel-Droma's robe in a battle with the dark side. Nearly forty years later, this would come to pass, as Revan found Qel-Droma's remains before defeating Dark Lord of the Sith Darth Malak."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Shouldering the burden"}, {"tag": "p", "text": "A Human male, Duron Qel-Droma grew up on the planet Alderaan. In his youth, Qel-Droma was close to his two cousins, brothers Ulic and Cay Qel-Droma. Following in the footsteps of Ulic and Cay's mother, Jedi Master Lien-Tsai Qel-Droma, all three were eventually discovered to be Force-sensitive and joined the Jedi Order. In 3996 BBY, tragedy struck the Qel-Droma family, as Ulic Qel-Droma fell to the dark side of the Force. Leading a Sith force against the Jedi and the Galactic Republic in what was known as the Great Sith War, Ulic slew his brother Cay in single combat on the Jedi library world of Ossus. Although Ulic repented and abandoned his cause, he was stripped of his connection to the Force and put into self-imposed exile. As such, it became Duron Qel-Droma's responsibility to clear the family name, and over the ensuing years, he committed himself to doing this. Shouldering the burden, Qel-Droma battled Sith remnants in the Cleansing of the Nine Houses, but the endeavors that Qel-Droma was most remembered for came in a Jedi campaign known as the Great Hunt. Qel-Droma was one of a number of Jedi Knights who traveled the galaxy eradicating Sith monstrosities such as Sith wyrms, silan, and terentateks."}, {"tag": "p", "text": "The terentatek was an alchemical creation of Dark Lord of the Sith Exar Kun, and would prove to be Qel-Droma's greatest foe. Half the size of a rancor beast, terentateks fed on Force-sensitive blood, making them a serious threat to Jedi. After the end of the war, the Jedi Order began the Great Hunt, which intended to wipe out the terentateks across the galaxy. Qel-Droma joined a Jedi party including the Humans Shaela Nuur and Cale Berkona, and the Twi'lek Guun Han Saresh, and went headlong into the Hunt. Qel-Droma and Nuur went on to develop romantic feelings for each other that stretched the limits of the Jedi Code. Qel-Droma proved to be an indispensable member of the group, using his mental Force powers to confuse the beasts while the other Jedi attacked. During the Hunt, Qel-Droma wore a garment known as the Qel-Droma robe, a family heirloom which originally belonged to his cousin Cay. The Great Hunt was quite successful, clearing the dark side monsters from worlds such as Onderon, Yavin 4, and Tython. In 3993 BBY, with the Hunt winding down, Qel-Droma and his compatriots traveled to Tatooine, hoping to cleanse that world of terentateks. After putting down several terentateks, the group tracked the last such beast on Tatooine to a cave, only to watch as the terentatek killed one of their number. After Qel-Droma made contact with the terentatek's mind and distracted it, the terentatek was finally slain. Uninjured by the fighting, Qel-Droma put the dead monster on a burning pyre with the others, and used the Force to carry his dead teammate back to their ship."}, {"tag": "h3", "text": "Heart of darkness"}, {"tag": "p", "text": "Five days later, the Great Hunt was officially called to an end. However, the Jedi High Council on Coruscant had different plans—the Sith homeworld of Korriban, a planet deeply steeped in the dark side, still needed to be cleansed. Needing someone to get the task done quickly and quietly, the High Council selected Qel-Droma, Nuur and Saresh for the job. Their rationale was twofold—firstly, the Council believed that Qel-Droma, Nuur and Saresh could slay any terentatek they encountered, and secondly, the Council thought that those three would be able to support each other and together avoid Korriban's dark temptations. The Jedi High Council delegated the responsibility of informing the group to the lesser Jedi Council at the Jedi Enclave on Dantooine, who called the three before them two days after the supposed end of the Great Hunt. Although the group, especially Qel-Droma, was surprised by the announcement, they resolved to move forward. They shipped out to Korriban the next day, making their way to the well-populated Dreshdae settlement. Once there, they began their search for information. Their investigation led them to a cantina, where Qel-Droma and Nuur met with an Ithorian and a Quarren who claimed that they would introduce them to a half breed Massassi with knowledge of the planet's terentateks in exchange for a kilo of spice. These kinds of endeavors did not sit well with the idealistic Qel-Droma—after only a week, he was concerned that Korriban was changing the three Jedi for the worse. Qel-Droma had grown tired of killing terentateks, especially after his mental links with the creatures during his battles with them revealed to him that they had spirits and thoughts of their own."}, {"tag": "p", "text": "In a discussion with Nuur in their safehouse one night, he expressed these concerns, only to be interrupted by a strange and traumatic vision—he had had several such experiences recently, and they were growing progressively worse. Qel-Droma saw visions of a war yet to come, with the fiery destruction of a large cityscape, a captured Jedi and a disfigured Sith. After Nuur attempted to comfort him, the two succumbed to their feelings for each other and passionately kissed. At that moment, Saresh, who disapproved of their relationship, walked into the room and took the opportunity to lecture them on the Jedi Code. A heated argument ensued between Nuur and Saresh, although Qel-Droma intervened. Saresh posed one final question to Qel-Droma and Nuur, about whether the two would be able to control their feelings for each other, and Qel-Droma answered that if it meant renouncing their love, they could not. Disappointed in his teammates, Saresh quit the group, telling them that their relationship put the mission in jeopardy. Before he left, Saresh gave Qel-Droma and Nuur a keycard taken from a Sith apprentice he seduced, that would grant them passage to the Valley of the Dark Lords where the terentateks would be found. Before Qel-Droma and Nuur departed for the Valley, Qel-Droma wrote an entry in his datapad which detailed his feelings for Nuur and his disappointment with Saresh."}, {"tag": "p", "text": "Three days later, as they entered the Valley of the Dark Lords, Qel-Droma and Nuur felt through the Force that Saresh had died—he had gone to the Wookiee world of Kashyyyk in order to slay a terentatek he had learned was there, only to fall prey to the beast. Qel-Droma met the knowledge of his friend's death with sadness, despite their previous disputes. Nevertheless, they trudged onward. Their search led them to a cave filled with many lesser beasts including shyracks, and after exploring deeper they found their terentatek. As Nuur jumped into battle, Qel-Droma realized to his horror that he could not make contact with the terentatek's mind as he usually did. At that moment, the terentatek tossed Nuur aside. Desperately trying to defend his love, Qel-Droma sprinted forward and attacked the terentatek with his lightsaber, wounding the beast. However, the terentatek soon grabbed Qel-Droma with one of its enormous claws, mortally injuring him. As Qel-Droma lay dying with Nuur by his side, he had one final vision—sometime in the future, a Jedi named Revan would happen upon his remains and take the Qel-Droma robe for himself. This Jedi would wear the robe as he defeated the disfigured Sith from Qel-Droma's previous vision. In his last moments, this gave Qel-Droma peace, knowing that the light would prevail in the end. As such, Qel-Droma instructed Nuur to leave his body where it lay, so that Revan might find it as he had seen. With his last breaths, Qel-Droma pledged his love to Nuur, before dying."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Shattered by her love's death, Shaela Nuur resolved to continue the fight in the name of vengeance for Qel-Droma. Nuur tracked the wounded beast to the ancient tomb of former Dark Lord of the Sith Naga Sadow. There, she was set upon by a larger, healthy terentatek, and Nuur fell in combat. For many years, the exact fate of Qel-Droma, Nuur and Saresh was not known, although it seemed quite certain the three were dead. The Jedi Council figured it too dangerous to send anyone in search of their remains, so the bones of Duron Qel-Droma lay undisturbed for nearly forty years. However, their stories were not forgotten. Around 3956 BBY, Revan, the Jedi whom Qel-Droma had seen in his dying vision, was told of the saga of Qel-Droma, Nuur and Saresh by a Knight named Deesra Luur Jada on Dantooine. Revan soon embarked on a journey across the galaxy to find the ancient Rakatan Star Maps, and his search eventually led to Korriban. As Qel-Droma had foreseen decades earlier, Revan happened upon his skeletal remains, finding the Qel-Droma robe and Qel-Droma's datapad. The final part of Qel-Droma's vision came true not long after, as Revan defeated the disfigured Sith, Dark Lord of the Sith Darth Malak."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Duron Qel-Droma was an idealistic young Jedi Knight, committed to the light. As such, Qel-Droma was constantly nervous while on the Sith world of Korriban of falling to the dark side, and was more conscious of the effect of the planet than his compatriots Nuur and Saresh. Although willing to do what it took to destroy the terentateks, his ethical code made it difficult for him to perform illegal acts such as running spice, which he was forced to do on Korriban. Qel-Droma's morals extended even to his prey, the terentateks. Although connecting to their minds reaffirmed Qel-Droma's belief in their evil nature, the fact that they thought at all gave him pause, and by the time of the mission to Korriban he was reluctant to kill the beasts. After Qel-Droma's cousin Ulic fell to the dark side, Qel-Droma was determined to restore the integrity of his family name, driving him to accomplish much of what he did."}, {"tag": "p", "text": "Qel-Droma was a light-skinned man with brown hair and brown eyes. By 3993 BBY, Qel-Droma had fallen in love with fellow Jedi Shaela Nuur, feelings that were reciprocated, although not overtly expressed until their time on Korriban. Towards the end of the Great Hunt, Qel-Droma began to have debilitating, prophetic visions, which greatly frightened him—the Jedi found that Nuur was able to soothe his pain. On Korriban, Qel-Droma and Nuur finally gave into their feelings, leading to the fracturing of their group. Qel-Droma was ready to do anything to defend Nuur, including a reckless and foolhardy charge against a terentatek on Korriban, an action that led to his death. Although Qel-Droma and Guun Han Saresh were close friends, Qel-Droma refused to heed the Twi'lek's advice and stayed committed to his love for Nuur. However, Qel-Droma did not hold a grudge against Saresh, although he privately was frustrated with Saresh's disapproval of his relationship with Nuur and thought that Saresh's departure may have been for the best. Qel-Droma was still quite confident that he and Nuur would be able to slay a terentatek without Saresh's help. Unlike Nuur, Qel-Droma greeted the knowledge of Saresh's death with sadness, acknowledging that he and Nuur were as much responsible for the downfall of their group as Saresh. Although Qel-Droma's visions were originally traumatic, his final one conveyed to him a message of hope that allowed him to die in peace, happy that the future held a victory for the light."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "By 3993 BBY, Duron Qel-Droma was considered one of the best hunters in the Jedi Order. However, unlike the other members of his group, Qel-Droma did not usually employ a lightsaber while fighting a terentatek, though he did employ a green-colored one while fighting other, lesser creatures, such as shyrack. Instead, Qel-Droma used his mental Force abilities to reach into the minds of his prey, confusing the beasts and making them vulnerable to attacks from the other Jedi accompanying him—this also allowed Qel-Droma to read the thoughts of the terentateks, giving him a greater understanding of the beasts. In his final battle on Korriban, however, Qel-Droma failed to make mental contact with the beast, forcing him to fight the terentatek with his lightsaber. Qel-Droma was also adept in using telekinesis, levitating the body of one fallen Jedi some distance after a battle with a terentatek, and at one point using a Force burst to shatter the windows of a room."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Duron Qel-Droma was first introduced in the 2003 video game Star Wars: Knights of the Old Republic. In the game, Qel-Droma appears only as a skeleton in the Shyrack cave of Korriban, which can be found by the player character, Revan. On Qel-Droma's body the player can find the Qel-Droma robe and Qel-Droma's datapad. Qel-Droma's backstory was greatly expanded upon in the comic \"Shadows and Light\", one of the stories featured in 2005's Star Wars Tales 23. The story serves as a sort of prequel to Knights of the Old Republic, telling the story of how Qel-Droma ended up as a corpse on Korriban. In the comic, Qel-Droma was illustrated by Dustin Weaver. Several other mentions of Qel-Droma have been made in the Star Wars canon. Qel-Droma was mentioned in a Codex entry in the MMORPG Star Wars: The Old Republic, to go along with mentions in the reference book The New Essential Chronology and the Knights of the Old Republic Campaign Guide."}, {"tag": "p", "text": "Knights of the Old Republic also features the datapads of Shaela Nuur and Guun Han Saresh, and on several occasions they misspell Qel-Droma's first name as \"Duran\". In Shadows and Light, Qel-Droma's vision depicts Revan as wearing the Qel-Droma robe when he defeats the game's villain, Darth Malak—however, the robe does not need to be worn by the player, or taken at all."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}