{"url": "Duros/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Core Worlds species", "Category:Duros", "Category:Enslaved species", "Category:Reptilian sentient species", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Duros"}, {"tag": "p", "text": "The Duros (occasionally Durosians) were a humanoid reptilian species native to the planet Duro who were among the galaxy's first space faring civilizations."}, {"tag": "p", "text": "Their homeworld was located on the Corellian Trade Spine, a major hyperspace route that linked Duro with other important commercial centers."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Duros ((pronounced /Dǒǒ'-rōs/)) were humanoids with smooth blue-green skin, red eyes, lipless mouths, long thin noseless faces and green blood. Olfactory organs beneath their eyes were responsible for their sense of smell. Both females and males were bald, though both genders were easily distinguished. Their large red goggle-like eyes also had slit pupils. Duros females laid eggs as they were descended from ancient reptiles, and like the Neimoidians, they were born in a larval grub stage, but unlike their cousins who left the raising of their young mainly to the state, the Duros took care of their offspring from birth."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "While usually taciturn, Duros enjoyed telling stories about their travels. It was said Duros had a photographic memory when it came to the telling of tales and stories. Many Duros were pilots and explorers, and were adventurous, though sometimes rash. As one of the first cultures to develop hyperdrive spacecraft (some even believe the first), Duros-charted trade routes were among the oldest hyperspace routes still in use during the Imperial era. Even in the later periods of galactic history, Duros were still known for their superior astro-navigational skills. Their affinity for traveling led many Duros to prefer the honorific title of \"Traveler\" despite their occupation or craft of choice, and addressing them as such was considered good etiquette. The Duros language was Durese, which was a lingua franca of sorts amongst spacers."}, {"tag": "p", "text": "Their home planet Duro was primarily uninhabited due to massive pollution on the world over time. Instead, it was covered with automated farms for food production. The Duros lived in twenty orbital space cities above the planet.[source?]"}, {"tag": "p", "text": "The Duros also established a vast, grand starship construction industry in the Duro system that rivaled the one in the Corellian system. The Duros set up their government around a consortium of starship construction corporations, with all important political decisions made by the stockholders of the corporations. This meant that any Duros that held stock in a company could participate in the administration of the system."}, {"tag": "p", "text": "The Duros were also one of the founding races of the Galactic Republic. Years before the formation of the Republic, the Duros colonized the planet Neimoidia, giving rise to a genetically distinct \"newer version\" of Duros, the Neimoidians. The Neimoidians retained many similarities to their Duros cousins including basic form, noseless faces, and green skin (though Neimoidians tended to be grayer). However, in contrast to their ancestors, Neimoidians possessed pupils that split horizontally, lumpy foreheads, and perpetually frowning mouths. In addition, Neimoidians tended to be cowardly, greedy and fearful of death, whereas the average Duro was adventurous, gregarious and peaceful. Not surprisingly, one of the most powerful insults among the Duros was to be called a Neimoidian. By the time of the rise of the New Republic, however, the Duros were friendlier towards the Neimoidians, and respected their business skills."}, {"tag": "p", "text": "After a young Duros was born, they were cared for and raised by their family members. This was another thing that set them apart from the Neimoidians, who did not really care for their young actively."}, {"tag": "p", "text": "The Duros lending tradition was followed by the Duros when asking for loans to Duros lending institutions. Failing to comply with its terms supposed a severe social stigma for them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Duros originated on the planet Duro long before the dawn of the Galactic Republic. In 100,000 BBY, Duro was surveyed by the Columi, who were not impressed. Later, Duro was conquered by the Rakata of the Infinite Empire and the native Duros were enslaved. Duros slaves were used to create the Star Forge in 30,000 BBY. However, they tolerated their cruel overlords, since it was an occasion for the ever-curious Duros to learn about their inter-stellar technology."}, {"tag": "p", "text": "Following a plague in 25,200 BBY that killed only Rakata, the Duros rebelled and overthrew their Rakatan masters. The Duros then formed a hereditary monarchy. After the fall of the Empire, they quickly reverse-engineered the engines left by the Rakata, and thus invented the hyperspace cannon independently of the Corellians."}, {"tag": "p", "text": "At an early age, the Duros became interested in exploration and ventured off their homeworld to explore the galaxy and their interstellar technology linked Duro with Coruscant, Corellia, and other Core Worlds; with the Corellians they built the first arm of the Corellian Trade Spine and with the invention of the hyperdrive, the planet entered a Golden Age as a Core Founder in 25,053 BBY under Queen Rana Mas Trehalt. The Duros also constructed large shipyards and spacedocks in their planet's orbit. The monarchy was eventually abolished in favor of a collection of ruling corporations."}, {"tag": "p", "text": "The Duros colonized Neimoidia during their earliest wave of expansion, though the Neimoidians were considered a separate culture by 15,000 BBY. The Duros also discovered Sneeve in the Kymoodon Era, Adner in 5000 BBY, and Koboth prior to 219 BBY."}, {"tag": "p", "text": "In 3962 BBY, the planet itself was laid to near-total waste during the Mandalorian Wars, when the Mandalorian invasion fleet advancing on the Colonies and Core regions destroyed much of the world using thousands of Basilisk war droids. Years of misery and rebuilding were ahead of the Duros people, merely the latest phase in the long series of Old Sith Wars. In 1003 BBY, during the New Sith Wars, the Duros colony on Harpori was wiped out by Kaox Krul."}, {"tag": "p", "text": "In 220 BBY, during Duro's Industrial Age, the mining city of Tayana reached its height. In 200 BBY, the Tiercam Dam was built. The Duros also set up large food processing plants that polluted Duro's atmosphere, forcing the them to relocate to 20 orbiting cities throughout their home system."}, {"tag": "p", "text": "In 20 BBY, during the Clone Wars, the Confederacy of Independent Systems launched Operation Durge's Lance, a coordinated major campaign that led to the capture of Duro. The swift success of the campaign sent shockwaves throughout the Galactic Republic, and even neutral Corellia began to tighten its defenses."}, {"tag": "p", "text": "After the Clone Wars, the Galactic Empire collected what was left of Duro's natural resources, and forced many Duros to move off the planet. In an attempt to stir up conflict between Duro and Corellia, the Empire declared Duro to be part of the Corellian sector."}, {"tag": "p", "text": "In 5 ABY, the prisoner Triclops was moved to Duro by Grand Moff Bertroff Hissa. However, Triclops escaped and saved his son Ken from Hissa. Although the New Republic managed to save Duros archaeologists from the Valley of Royalty, the Valley itself was flooded with toxic waste when the Tiercam Dam burst."}, {"tag": "p", "text": "The New Republic eventually liberated the planet, and put the system back in the Duro Sector. Ecosystem purification teams cleaned up the planet's atmosphere as best they could. In 10 ABY, Duro was retaken by the Empire during Operation Shadow Hand. However, it was eventually liberated by the New Republic."}, {"tag": "p", "text": "In 13 ABY, CorDuro Shipping took control of the Pri-Andylan shipyards. In 25 ABY, Jedi Tresina Lobi and Thrynni Vae discovered CorDuro Shipping's ties to the Peace Brigade, resulting in the Brigade murdering Thrynni."}, {"tag": "p", "text": "In 26 ABY, the New Republic attempted to make Duro habitable and settle refugees there, though their efforts were sabotaged by the Yuuzhan Vong agent Nom Anor. The Yuuzhan Vong conquered Duro and managed to reverse centuries of pollution in just two years. Later, the planet was liberated by the Galactic Federation of Free Alliances and it is likely that the Duros returned to the now lush Duro after the war's end."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Mission from Mount Yoda, female Duros are depicted with long ponytails, despite other sources claiming both males and females are bald."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}