{"url": "Duros_uprising_on_Zilior", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles in the Sertar sector", "Category:Sith Empire rebellions"], "nodes": [{"tag": "h1", "text": "Duros uprising on Zilior"}, {"tag": "p", "text": "The Duros uprising on Zilior was a revolt that involved members of the Duros species rebelling against the reconstituted Sith Empire on the planet Zilior at some point before or during 3643 BBY. Around that year, Lord Drowl of the Empire had knowledge about the uprising and compared it to a similarly-sized rebellion on Dromund Kaas, the Imperial capital planet."}, {"tag": "h2", "text": "The uprising"}, {"tag": "p", "text": "Occurring at some point prior to or during the year 3643 BBY, the Duros uprising on Zilior was a rebellion comprising members of the Duros species, who were revolting against the Sith Empire on the planet Zilior."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Around 3643 BBY, during the Cold War between the Galactic Republic and the Sith Empire, Drowl, a Sith Lord affiliated with the Empire, was familiar with the population size of the Duros uprising on Zilior. While working on suppressing a degree-six slave rebellion in the jungle outside of Kaas City on the Empire's capital world of Dromund Kaas, Drowl noted that the two revolts had equivalent populations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Duros uprising on Zilior is mentioned in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare and LucasArts. The event is briefly spoken of in a comparison made by Lord Drowl at the start of the quest \"Testing Grounds,\" which is available to all four Imperial classes on Dromund Kaas, the second planet for Imperial players in the game. Although the uprising on Zilior is mentioned by the Sith Lord, it is not made clear exactly when it occurred or what the outcome was. Additionally, while Drowl states that the Empire frequently assigned him to put an end to rebellions on Imperial planets, the game does not make it clear whether Drowl was involved with the uprising on Zilior."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}