{"url": "Dust_Dancer", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Kuat Drive Yards products", "Category:New Jedi Order starships", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Dust Dancer"}, {"tag": "p", "text": "The Dust Dancer was a Kuat Drive Yards cargo transport arranged by former smuggler Booster Terrik to be loaned to the Jedi Order. The Jedi Order used it in 44 ABY to transport well-known individuals off the planet Borleias in the Pyria system to Coruscant, capital of the Galactic Alliance. Shuttles attached to the Dust Dancer were then used to take the individuals to the Senate Building on Coruscant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Kuat Drive Yards-manufactured Dust Dancer was an eighty-meter-long cargo transport. It was capable of holding two shuttles, one of which was the DeepRay. The Dust Dancer had a ball for its command center at one end and many engines at the other. A long connecting spar joined the bow and the stern together; this spar was thickly covered with cargo pods and shuttle attachment points."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A legitimate cargo transport, the Dust Dancer was arranged by former smuggler Booster Terrik to be loaned to the Jedi Order. In 44 ABY, Terrik invited some very well-known individuals to his personal starship, the Imperial Star Destroyer Errant Venture, for a large sabacc tournament. In actuality, he had brought the sabacc players onto his ship as hostages to prevent the Galactic Alliance from moving to control the Jedi Order, which planned to deploy its forces off the galactic capital planet Coruscant against the wishes of Chief of State Natasi Daala. Terrik used the hostages to force Daala to let the Jedi leave. After the Jedi completed their mission, he loaned the Dust Dancer to the Jedi so they could use it to transport the celebrities back to Coruscant."}, {"tag": "p", "text": "Jedi Master Octa Ramis, along with Jedi Knight Seha Dorvald, piloted the Dust Dancer to the planet Borleias in the Pyria system just before Terrik left his hostages there. The Jedi brought the Dust Dancer into orbit above Borleias, and Dorvald took a shuttle down to the planet's surface. On Borleias, she met with Dolo Karenzi, the night-shift quartermaster of the Borleias outpost, and told him that the Dust Dancer was carrying a load of consumable luxury items—expensive wines, exotic foods, fresh sabacc decks, entertainment datapads, candies, and pastries—with the outpost as the items' listed destination. Karenzi realized that there had to have been a mistake, but he decided to sign for the items in the Dust Dancer and keep them himself, hidden in a storage pod. After the Dust Dancer landed, Karenzi attempted to unload the cargo fast. Right in the middle of the off-loading process, however, the Errant Venture entered the system to drop off the celebrities. Karenzi quickly hid the cargo and made a false manifest for the Dust Dancer so no one would know about the real cargo."}, {"tag": "p", "text": "The Jedi had planned for the Dust Dancer to be the only transport available to send the celebrities back to Coruscant once the Errant Venture left the sabacc players on Borleias, and Ramis and Dorvald piloted the celebrities to the capital aboard the Dust Dancer. Once on Coruscant, the players were ferried by the Dust Dancer's shuttles into the Senate Building. Unbeknownst to the players, however, several Jedi had hidden in the shuttles' smuggling compartments, providing them easy access to the building so they could prepare for a coup against Chief of State Daala."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Former smuggler Booster Terrik received the transport Dust Dancer from a contact and then loaned the ship to the Jedi Order to pick up the celebrities whom Terrik had held hostage after dropping them off on Borleias. Jedi Octa Ramis and Seha Dorvald piloted the Dust Dancer when they picked up the celebrities and took them to Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dust Dancer made its first appearance in the seventh novel of the Fate of the Jedi series, Fate of the Jedi: Conviction, written by Aaron Allston and published on May 24, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}