{"url": "Duty_Roster", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Duty Roster"}, {"tag": "p", "text": "\"Duty Roster\" is a short story in the anthology From a Certain Point of View. The story was written by Jason Fry and is told from the point of view of Col Takbright, a hot-tempered pilot who is known as \"fake\" Wedge."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The hot-tempered Rebel Alliance starfighter pilot Col Takbright is taking part in an X-wing simulator exercise inside the Massassi Temple on Yavin 4. He repeats the mistake of letting the older pilot and instructor Puck Naeco maneuver him into position for a kill shot. In a bad mood, Col remarks that he hates the name \"Fake Wedge\". Puck reminds the younger pilot not to take the bait. After Col leaves, another pilot John D. Branon asks Puck what set Col off. Puck says that the younger pilot was set off by his remark that it's impossible to hit a two-meter target with a proton torpedo, even with a computer. Shorty later, several pilots enter the room including Biggs Darklighter, Elyhek Rue, Bren Quersey, Wenton Chan, and Wedge Antilles himself. Col is annoyed when Rue mistakes him for Fake Wedge."}, {"tag": "p", "text": "In private, Col reflects on his anger issues including his tendency to damage helmets and furniture in fits of rage. Red Squadron's Commander Garven Dreis, General Antoc Merrick, Puck, and John D. had lectured Col about his eruptions. Col aspires to be like pilots with placid interiors such as Chan and Antilles. Col had left his homeworld of Uquine and joined the Rebellion after witnessing the Empire ravage worlds for ore and fuel and murdering those who opposed it. Col realizes that his anger is rooted in Imperial atrocities and thinks that people like Antilles were not angry enough."}, {"tag": "p", "text": "Later, Col and the rest of Red Squadron gather at the briefing room as the rebel pilots assemble for their strike against the Death Star. Col overhears John D. and Biggs talking about the latter learning to fly starships by practicing with a T-16 skyhopper and shooting womp rats. Despite his hopes, Col is not assigned a slot on Red Squadron for the strike mission since all the places are full. While alone in the briefing room, Col throws a tantrum and begins hurling chairs and tables. Before he can throw his flight helmet, Wedge enters the room to collect his helmet. While Antilles expresses sympathy with Col's frustration, Col complains that Antilles gets to fly against the Empire while good pilots like him sit down and do nothing. Wedge tells Col that he is flying for a lot of people in the galaxy and reassures him he is not alone in this fight unless Col insists on pushing everybody away."}, {"tag": "p", "text": "After righting the tables and chairs, Col enters the war room where he spots Princess Leia Organa, General Jan Dodonna, and other rebel commanders overseeing the rebel attack. He also finds his fellow pilots Rue, Chan, Quersey, and the Mon Calamari Kelemah. When Col asks when they are planning to call Kay-One-Zero, Quersey doubts that they are planning to evacuate since most of the essential equipment left with the fleet. When Kelemah mentions that the port stabilizer on Wedge's fighter is misaligned, Col remarks that Wedge is taking a big risk. Kelemah responds that the Rebel Alliance is taking the biggest risk in the galaxy by attacking the Death Star. On the tactical display, Col watches Gold and Red Squadrons launching their attack on the Death Star's turbolaser defenses. The rebels watch as Imperial TIE fighters launch a counter-attack, shooting down John D.'s starfighter. Luke Skywalker's X-wing also briefly disappears before reappearing."}, {"tag": "p", "text": "Studying the telemetry from Gold Squadron's Y-wing starfighter's sensors, Col opines that the starfighters have no room to manuever in the Death Star's Meridian trench. He adds that their forwards shields are taking a beating from the Imperial turbolaser. The Imperials cease firing only to deploy TIE fighters against the Y-wings. With the rebel strike team sustaining losses, Col and his comrades cheer for Wedge. Skywalker, Darklighter, and Antilles' X-wings make a dash for the Death Star's trench. Antilles' starfighter is damaged and he is forced to pull out of the trench. Shortly later, Darklighter's starfighter is hit, leaving Skywalker's fighter as the only rebel ship in the trench. Col then watches as Skywalker shuts down his targeting computer and the Millennium Falcon appears out of nowhere and ambushes Skywalker's TIE pursuers. This allows Wedge to retreat back to Yavin 4 and Skywalker to fire a proton torpedo into the Death Star's thermal exhaust port, destroying the superweapon."}, {"tag": "p", "text": "Col and his fellow pilots celebrate their victory. Col and his fellow pilots greet the survivors of the Yavin strike team. Reconciling with Antilles, Col hugs him and credits the ace pilot for taking out six TIE fighters. When Wedge replies that he hopes everyone sees it the way he does, Col jokes that if they don't, Wedge can tell the others that it was \"Fake Wedge\" up there. He adds that he'll be honored to be mistaken for Wedge and tells Wedge that they have been invited to the celebration."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}