{"url": "Dybrinthe", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Deep Core species", "Category:Dybrinthe"], "nodes": [{"tag": "h1", "text": "Dybrinthe"}, {"tag": "p", "text": "Dybrinthe were a humanoid sentient species native to the Deep Core moon of Dybrin 12. Due to the moon's poisonous and highly pressurized atmosphere, Dybrinthe out of Dybrin 12 had to wear large helmets and breathing gear when they left their homeworld."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Dybrinthe were a bipedal humanoid species with bright skin, wide eyes, and a gill-like respiratory system. They had hands with five digits. Outside Dybrin 12, Dybrinthe were required to wear large breathing apparatus that supplied them with processed atmosphere via hoses. They also had to wear suits that simulated the higher pressure and temperature that they were use to."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The species lived in clans, with each clan controlling its own territory. Fuel, bubbling up from Dybrin 12's vast underground oceans, was collected by mobile refinery-cities, which would then process the fuel. It was commonplace for Dybrinthe clans to raid other clans, though this became less prevalent. However, rival clans would still tunnel underground and attempt to divert fuel to their own clans. Within clans, Dybrinthe society was ordered into castes, such as engineering castes."}, {"tag": "h2", "text": "Dybrinthe in the galaxy"}, {"tag": "p", "text": "Few Dybrinthe left their homeworld, though most of those who did were scientists drawn from the engineering castes of their clans."}, {"tag": "p", "text": "A notable exception was Athgar Heece, a Dybrinthe bounty hunter. During the Cold War, Heece was one of few visitors to the planet Jakku who found the planet cool and pleasant, because Heece was used to operating in higher atmospheric conditions. Another Dybrinthe was also present with Heece at the same time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dybrinthe first featured in the 2015 film Star Wars: Episode VII The Force Awakens through Athgar Heece and another unnamed Dybrinthe. For the film, Heece was portrayed by British artist Mel Pickup. Though not identified on-screen, Dybrinthe were first mentioned in Star Wars: The Force Awakens: The Visual Dictionary, written by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}