{"url": "Dying_ceremony", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Ceremonies"], "nodes": [{"tag": "h1", "text": "Dying ceremony"}, {"tag": "p", "text": "The dying ceremony, also called a farewell ceremony, was a brief ritual in which a Sage of the Baran Do—a Force-based organization located on Dorin—pretended to die. The Sage then joined the Hidden Ones, a secret sect of the Baran Do dedicated to preserving the Order's knowledge so that, should the Order ever be destroyed, it could be reinstated. The ceremony was established because the Hidden Ones required its members to accept that they were dead to the outside galaxy, ensuring that they had no desire to leave the Hidden Ones once they had joined in order for the sect to remain secret."}, {"tag": "p", "text": "In 43.5 ABY, Luke Skywalker and his son, Ben, traveled to Dorin to find out more about the Sith Lord Darth Caedus' fall to the dark side. They trained briefly with the Baran Do before attending the dying ceremony of instructor Charsae Saal. The Skywalkers discovered that he had not actually died, however, and traveled with him to find the Hidden Ones, whom they persuaded to rebel against their corrupt leader, Koro Ziil. The Hidden Ones then returned to the Baran Do, forsaking their sect, and thus putting an end to the dying ceremony."}, {"tag": "h2", "text": "The ceremony"}, {"tag": "p", "text": "Dying ceremonies took place behind the temple of the Baran Do—a Force-based order of Kel Dor—in the capital city of Dor'shan, on the planet Dorin. The ceremonies were held in a large paved area with a raised hearth rimmed in a bronze metal. On the hearth was a pyre, in front of which was a platform; both made from planks that contained a fuel enriched with oxygen, since normal wood didn't burn in Dorin's helium-rich atmosphere."}, {"tag": "p", "text": "As the ceremony began, a Sage who had decided to join the Hidden Ones—a secret sect of the Baran Do dedicated to preserving the order's knowledge—greeted guests and spoke with friends as small portions of food and drink were served. The Sage then made a farewell speech to those present, before lying down upon the platform and hiding their presence in the Force, appearing to simply die. Then other members of the Baran Do put a casket over the body of the Sage, and another Sage opened the platform's base with the Force, allowing the \"dead\" Sage to drop down into an underground storage chamber. Meanwhile, none of the guests could see the body missing since it had been covered with the casket, which was then placed upon the pyre. The leader of the Baran Do, the Master of the Order, then lit the pyre with a small bolt of Force lightning, and after the pyre burned, the ceremony was concluded."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Clone Wars came to an end in 19 BBY, one of the Baran Do Masters, Tokra Hazz, feared that the Baran Do would suffer the same fate as the Jedi Order, which had been wiped out by the Galactic Empire. As such, he founded a secret sect called the Hidden Ones as a way of ensuring that the knowledge of the Baran Do would live on, even if the order itself was eradicated. The dying ceremony was then created as a way for Baran Do Sages to accept that they were dead to the outside galaxy before traveling to join the Hidden Ones, because, in order to ensure the sect's secrecy, once a Sage had joined the Hidden Ones they were never allowed to leave or make contact with anyone outside of the sect's caverns."}, {"tag": "p", "text": "Because the Hidden Ones were to remain secret, no beings outside of the Baran Do order were allowed to know that the Sage didn't actually die in the ceremony. As such, the Baran Do created a lie about the ceremony's purpose; they told other beings that when a Sage decided that they had accomplished everything in life that they wished to accomplish and they believed that their time had come, they simply willed themselves to become one with the Force and died. The tradition was held for many Baran Do Sages over the next several decades, including Burra, Ithia, and Master of the Order Koro Ziil."}, {"tag": "h3", "text": "Discovery"}, {"tag": "p", "text": "In 43.5 ABY, when Jedi Grand Master Luke Skywalker and his son, Jedi Knight Ben Skywalker, traveled to Dorin to find out more about Jedi Knight-turned-Sith Lord Jacen Solo's fall to the dark side of the Force, they attended senior combat instructor Charsae Saal's dying ceremony. Luke, however, wasn't convinced by Saal's apparent death, and after searching the area the Skywalkers discovered the trapdoor in the platform. They found Saal alive and well in the underground chamber with Mistress of the Order Tila Mong and several other Sages."}, {"tag": "p", "text": "The Skywalkers then traveled with Saal to the caverns that were home to the Hidden Ones, where they caused unrest among the sect's members. This led to a confrontation between Luke and Ziil, who had become the Hidden Ones' leader. Ziil was defeated and the Hidden Ones rebelled against their corrupt leader. The sect was dissolved and its members returned to the Baran Do on the surface, effectively putting an end to the tradition of the dying ceremony."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dying ceremony was created by Star Wars author Aaron Allston for his first novel in the nine-part Fate of the Jedi series, Fate of the Jedi: Outcast, released on March 24, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}