{"url": "Dylanto_Daa", "categories": ["Category:Canon articles", "Category:Business owners and executives", "Category:Historians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Dylanto Daa"}, {"tag": "p", "text": "Dylanto Daa was a human male historian and the founder of the Daa Corporation. When the planet Ontotho joined the Galactic Republic under a united government, Daa and his corporation entered into an agreement to explore a recently discovered temple within the land of the independent Fylari. Both the Fylari and the Ontothons wished to initiate war to settle long-lived disputes, and Fylari that Daa had hired as security attacked his own forces, including the Jedi Eno Cordova and Cere Junda. Daa led his forces in a battle to defeat the Fylari, who he and his corporation saw as terrorists. While initially claiming to be defending their land, the Fylari revealed themselves to be behind the conflict, and Daa was killed by the Fylari leader, Neralli, in an attack on the Daa Corporation's forces."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Historical study"}, {"tag": "p", "text": "Studying ancient cultures, Dylanto Daa became a businessman and historian, founding the Daa Corporation in pursuit of knowledge. During the time of the Galactic Republic, Chairman Daa and his corporation wished to explore a temple that had been discovered on the planet Ontotho. Despite being in an agreement with the Ontothon government, Daa was unable to enter the temple, as it was located within the independent nation of Fylar. Daa attempted to speak with the Fylari about exploration of the temple, but no agreement was made. The corporation requested a Republic presence on Ontotho, but the division of troops was waylaid, and the Jedi High Council instead sent the Jedi Master Eno Cordova and his Padawan Cere Junda to assist with the negotiations."}, {"tag": "p", "text": "Daa met with the two Jedi when they arrived at the Ontotho Spaceport, and offered to send them into the Fylar nation with a group of Daa Corporation forces, in an attempt to speak with the Fylari about studying the temple. However, local Fylari that Daa had hired to work as security in the area, wishing to set off a war to settle their local disputes, attacked the Daa Corporation caravan. The two Jedi were separated in the attack, but Cordova was recovered by the Daa Corporation, who both assumed that Junda was dead. Cordova was brought back to the Daa Corporation camp to recover in their bacta tanks, and Daa allowed the Jedi Master to contact the Jedi Council regarding the issue. However, Junda had survived the attack, having been rescued by the Fylari, who led her to believe that Daa had caused the attack in hopes of framing the Fylari into being seen as terrorists."}, {"tag": "h3", "text": "Escalating hostility"}, {"tag": "p", "text": "Following the attack, Daa visited the parliament building in Ontotho City, requesting permission to complete the exploration from the Ontothon government. The government allowed Daa to carry out his mission, but the meeting was interrupted by the arrival of Junda, who attempted to convince the government of what the Fylari had told her. Daa was skeptical of Junda's claims, and his security forces were sent to take the Jedi Padawan into custody. Junda escaped, returning to the Fylari, while Daa sent his forces to the temple."}, {"tag": "p", "text": "Junda helped the Fylari defend the temple from the Daa Corporation forces, destroying his droids but leaving the human officers alive. Daa visited his corporation's camp on the Fylar border after hearing that his forces had retreated, and was surprised to hear that none of his men had been killed. Junda entered the camp, and Daa attempted to defend himself with a blaster. The Jedi disarmed Daa with her lightsaber, and the chairman called for assistance from his security droids. When Junda defeated the droids, Daa allowed Cordova to enter the room. Cordova, who had learned of the situation from Daa, requested that Junda work with them to solve the problem, but Junda informed her master that she was fighting on the side of the Fylari."}, {"tag": "h3", "text": "Initiating war"}, {"tag": "p", "text": "The two Jedi organized a meeting between the Daa Corporation and the Fylari. Both Daa and Neralli, the Fylari leader, accused the other side of initiating the attack, and Cordova intervened, silencing them. Cordova suggested that both parties settle on a truce for two days so the situation could be solved, while he and Junda secretly entered the temple in search of the cause of the conflict. However, Daa's forces also entered the temple, but were killed by an ancient guardian that had been reactivated. After hearing from his forces in the temple, who claimed that they had been attacked by the two Jedi, Daa decided to lead an assault on Fylar."}, {"tag": "p", "text": "Leading his forces, Daa encountered Junda and the Fylari. Junda accused Daa of wanting the war, but Daa was confident that he could win. Daa ordered his forces to open fire on the Fylari, who likewise attacked Daa's forces. During the ensuing skirmish, Neralli left to enter the temple, incapacitating Master Cordova. Daa returned to his command center, speaking with his lieutenants and learning that the Ontothon government ceased to recognize Fylar as a nation, making their land part of the Republic and his expedition legal. Daa's lieutenants, having investigated the situation, informed him that the local Fylari security he had hired were behind the initial attack on his caravan. While Daa was meeting with his lieutenants, Junda learned of his location and entered the command center, claiming that she had an offer for him. Daa was hesitant to negotiate with Junda pointing her lightsaber at him, but Junda deactivated the weapon, offering Daa her trust. Junda requested that Daa cease the attack and remove his forces from Fylar in return for being allowed access to information from the Jedi Archives."}, {"tag": "h3", "text": "Ceasefire and death"}, {"tag": "p", "text": "Daa initially did not wish to retreat and render the work he and his corporation had done pointless, but ordered his commanders to cease fire regardless. Daa informed Junda that a Republic force was headed for Ontotho, and hoped that Junda could convince the Fylari to leave the temple unharmed. Stepping outside the command center, Daa told Junda of the results of his lieutenants' investigation. Before he and Junda could meet with the Fylari, Daa was shot and fatally wounded by Neralli. Junda attempted to call for a medic, but the command center fell under attack from the Fylari, and Daa's forces were forced to retreat."}, {"tag": "p", "text": "During the attack, the Republic force arrived, including the Jedi Masters Mace Windu, Luminara Unduli, Maslo-Skaff, and Odu. The Jedi assisted the Daa Corporation forces in retreating from the area, while Junda entered the temple to rescue Cordova. Within the temple, they were trapped by Neralli, and Junda questioned the point of killing Daa. Ultimately, neither side managed to win the war, and the Republic evacuated the Daa Corporation forces and most Fylari citizens from the area, which had become unstable due to the fighting. The Daa Corporation collapsed following the death of its founder, and the corrupt Ontothon government was dealt with in Republic courts."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A human male, Dylanto Daa had light skin, brown hair, and brown eyes. As a student of history, Daa wished to learn, knowing that understanding would lead to peace, and having incorrectly believed that he understood how the galaxy worked when he was young. While he intended to use force to get into the temple on Ontotho, Daa did not wish to excavate or damage it, merely to explore and discover why the Fylari were protective of the site."}, {"tag": "p", "text": "Daa was not worried about the loss of equipment and vehicles, having the money to replace them, but was deeply concerned by the loss of his peoples' lives. Despite this, Daa was willing to attack the Fylari, who he saw as terrorists. Daa was confident that he and his forces could defeat the Fylari, even though he claimed that he did not wish to start a war. However, after learning that the war was initiated by the Fylari that his security forces had hired, Daa agreed to cease fire."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As the chairman of the Daa Corporation, Dylanto Daa had an army of private security forces, including security droids. He also had control over a number of vehicles, including caravans, excavators, and aerial tanks. Daa possessed a blaster, though it was cut in two and destroyed by Cere Junda. While on Ontotho, Daa wore a long brown coat over a dark tunic and pants, as well as gloves. When Daa led an attack on the Fylari, he wore armor over his chest and legs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dylanto Daa first appeared in the comic Jedi Fallen Order - Dark Temple 1, written by Matthew Rosenberg, illustrated by Paolo Villanelli, and published by Marvel Comics on September 4, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}