{"url": "Dyyz_Nataz", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Individuals of unidentified species", "Category:Males", "Category:Police", "Category:Sector Rangers"], "nodes": [{"tag": "h1", "text": "Dyyz Nataz"}, {"tag": "p", "text": "Dyyz \"Megadeath\" Nataz was once a Sector Ranger officer who worked alongside a Diollan named Spurch Goa. He served with the Sector Rangers for several years, but his missions eventually led him into conflicts with the Hutt crime lords of Nal Hutta."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Before joining the Sector Rangers, Nataz was a ranking police officer on his homeworld."}, {"tag": "p", "text": "The gangster Jabba Desilijic Tiure set into motion a chain of events that resulted in Dyzz being expelled from the Sector Rangers. In turn, he decided to lay low and relocated to the Corellian Sector of the nearby moon, Nar Shaddaa. There, Spurch and he turned their military talents towards bounty hunting."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, a high-ranking officer of the Galactic Empire enlisted the bounty hunters' services to assassinate a corrupt Imperial spice inspector on Nar Shaddaa. They knew the target in question personally, and have brokered deals with him in the past. However, a contract was a contract. They cornered the inspector on Level 88 and dropped him with several quick blaster shots."}, {"tag": "p", "text": "Another bounty hunter known as Gorm the Dissolver arrived in the Corellian Sector looking for Dyyz and Spurch. Jabba the Hutt had put out a contract on the two and wanted them eliminated. Gorm caught the bounty hunters dead in his sights, but as luck would have it, an eager young Rodian named Greedo fired a blaster shot into Gorm's back disabling him. Dyyz and Spurch were grateful to the enthusiastic mercenary and Spurch offered to train him in the art of bounty hunting."}, {"tag": "p", "text": "Dyyz later accompanied Spurch and Greedo to Tatooine to settle accounts with Jabba the Hutt. Shortly afterward, Dyyz left Tatooine on his own accord, hitching a ride with fellow hunters Zuckuss and 4-LOM, however, his activities since that time had not yet been revealed."}, {"tag": "h2", "text": "Physical appearance"}, {"tag": "p", "text": "Presumably Human, Dyyz Nataz' true physical appearance is unknown. He wore an ancient set of brown, corroded, Ithullan armor, likely stolen from a museum, as the Ithullans were all but extinct by Dyyz' time. Accompanying the armor, was a large bell-shaped durasteel helmet, coated with rust. The red photoreceptors placed within the helmet's visor gave Dyyz a fearsome countenance that intimidated anyone unlucky enough to fall before his path."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Dyyz Nataz was created by comic book writer Tom Veitch."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}