{"url": "D%C3%A6lar_vuv_Tertarrnek", "categories": ["Category:Legends articles", "Category:Alliance Intelligence members", "Category:Covallon", "Category:Males", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Dælar vuv Tertarrnek"}, {"tag": "p", "text": "Dælar vuv Tertarrnek was a male Covallon who worked as a mole for the Rebel Alliance. Due to his species bestial appearance the Rebels were able to pass him off as a pet and gift him to Moff Harlov Jarnek."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dælar vuv Tertarrnek was a Covallon, a quadrupedal species of bestial appearance. He joined the Rebel Alliance and served as a deep cover mole for General Airen Cracken. As the Covallon rarely ventured into the galaxy, the Alliance was able to pass Dælar off as a non-sentient animal and had him given to Moff Harlov Jarnek as a pet."}, {"tag": "p", "text": "Moff Jarnek took Dælar vuv Tertarrnek to his Palace on Spirador, where he ruled the Tandon sector. Janrek grew very fond of his loyal \"pet\" who seemed to instinctively know what Janrek wanted. Dælar achieved this responsiveness through his natural empathetic ability, common to all Covallon. The Moff brought Dælar everywhere with him, including to numerous high-security meetings. This allowed vuv Tertarrnek to gain information about fleet and troop movements, as well as learning top-priority access codes. Dælar related this information back to the Alliance via a tight-beam comlink hidden in his pen. This was relayed through a stealth probot stationed in the Spirador system. With this data, Alliance convoys were able to avoid Imperial entanglements in the sector."}, {"tag": "p", "text": "While vuv Tertarrnek was extremely successful in extracting information from the Moff, there was one drawback from his position: as the Moff kept him so close by, his opportunities to relay information were infrequent. However, despite this, General Cracken still considered him an important asset to Alliance Intelligence."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dælar was a male Covallon that had four legs and a bestial looking body partially covered in fur. He had human-like eyes though. For Moff Jarnek he played the part of a loyal and intelligent pet, never revealing that he had sentience and significantly more intelligence then the Galactic Empire gave him credit."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As a Covallon, Dælar had natural empathic abilities that allowed him to sense the emotions of others. He was very perceptive and played the part of a simple pet very well. Despite his bestial appearance he could use modern technology as well as any other species and was moderately skilled with blasters."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Dælar did not carry anything on him in order to keep up the guise of being a simple household pet however hidden in his pen he had a Sporting blaster and a long-range tight-beam comlink."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dælar vuv Tertarrnek was designed by Stephen Crane for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Vilardi."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}