{"url": "140_ABY", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Years in the Post-Imperial Period"], "nodes": [{"tag": "h1", "text": "140 ABY"}, {"tag": "p", "text": "The following events took place in 140 ABY."}, {"tag": "h2", "text": "Proem"}, {"tag": "p", "text": "In 138 ABY, the Second Imperial Civil War ended with the defeat of the One Sith order and the death of the organization's leader, Darth Krayt. The surviving members of the Sith cult went into hiding, operating from the shadows while the newly organized Galactic Federation Triumvirate consolidated power on Coruscant. In 138 ABY, however, the Sith Darth Wredd started an open insurgency against both the Galactic Alliance and his Sith brethren alike. The resulting two-year long conflict culminated with the Battle of the Floating World, a battle fought on the planet Mala fought between the One Sith and the Galactic Alliance, with an unlikely assistance by Wredd. The battle ended with a complete eradication of the One Sith and the death of Wredd. An unlikely crew consisting of junk dealer Ania Solo, her partner Sauk, the droid AG-37, and the Imperial Knight Jao Assam played a crucial role in the victory. For her efforts, Solo was offered a place as the captain of the personal guard of Empress Marasiah Fel, but she declined the offer in favor of traveling the galaxy with her friends."}, {"tag": "h2", "text": "The galaxy in 140 ABY"}, {"tag": "p", "text": "With the final defeat of the One Sith, an era of peace started for the Galactic Alliance. One year after the Battle of the Floating World, Solo, Sauk, Assam and AG-37 were traveling together aboard AG-37's freighter when the vessel's stabilizing coil went out of commission. Making a stop at a location, the crew sent Sauk to find a new spare part, while they waited at the hangar. The Mon Calamari bought a used stabilizing coil from the heroes of the Second Imperial Civil War, Cade Skywalker, Deliah Blue, and Jariah Syn. Meanwhile, Solo, Assam and AG-37 fell under fire from another group. As Sauk was returning to his friends, he heard their cries for help and joined the firefight."}, {"tag": "h2", "text": "Notable events"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}