{"url": "E-10", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "E-10"}, {"tag": "p", "text": "E-10 was a protocol droid owned by the wealthy Human heir Dezono Qua, with whom the droid lived on the planet Esseles. Under orders from Qua, E-10 prepared and cooked a number of young slaves that its master had purchased and wished to eat. After E-10 cooked the Nosaurian child Resa Greenbark, the droid's master congratulated it on the quality of the dish. The meal proved to be the last the droid prepared, however. Shortly after the dish was created, Resa's father, Bomo Greenbark, arrived at Qua's home and destroyed E-10 after it refused to tell him of Resa's fate."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the year 19 BBY, the protocol droid E-10 belonged to the Human male Dezono Qua, the sole heir to the fortune of a wealthy family on his homeworld of Esseles. E-10 lived on Esseles with its master in his family's large villa, a remote fortress-like structure located on top of a mountain and guarded by a small army of droids. Whilst E-10 served Qua, the Human regularly purchased enslaved children from a Chagrian slaver named Orso Meeto on the slave world of Orvax IV. Qua then had these children killed and ate them, ordering E-10 to cook them into dishes for him, something at which the droid was fairly proficient."}, {"tag": "p", "text": "In 19 BBY, about a month after the inauguration of the Galactic Empire, Qua purchased a female Nosaurian child from Meeto named Resa Greenbark. As per usual, Qua had E-10 create a meal from the child and, after eating her, declared that the meal had been one of E-10's finest. As the droid thanked its master for the compliment and offered him dessert, a rumbling distracted the pair. Realizing they were under attack, Qua fled, pushing the droid over in his haste to escape."}, {"tag": "p", "text": "The villa suffered an attack from the crew of the Maka-Eekai L4000 transport Uhumele, which included the Nosaurian Bomo Greenbark, who had come searching for his daughter, the main ingredient in E-10's latest dish. E-10 remained in the dining room whilst the crew fought their way through the villa's security droids, which they managed to remotely disable after a short period of time. With the villa clear, several members of the crew, including Greenbark, reached the dining room, where they found the droid. The Nosaurian questioned E-10 as to his daughter's location, but when the droid claimed Qua would not wish such information to be shared, Greenbark shot E-10 in the head with a blaster, destroying the droid. When they discovered the fate of Resa, the crew also killed Qua."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "E-10 was a bipedal protocol droid with golden-colored plating across much of its body, although the back of its head and part of its waist had no plating, which revealed the machinery and wires within. The droid's head housed its internal machinery at the back with a transparent covering. E-10 served Dezono Qua loyally, willingly obliging his requests to cook sentient children and, in the case of Resa Greenbark, refusing to give up information regarding the dead child's location when question. The droid was reasonably able in terms of cooking and produced dishes to its master's satisfaction. When the pair's home was attacked, E-10's greatest concern was that its master got to safety, although the droid did not attempt to flee with him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "E-10 first appeared in the fifth and final issue of the The Path to Nowhere story arc of the Star Wars: Dark Times comic book series. The issue was illustrated by Douglas Wheatley, written by \"Mick Harrison,\" a pen name of author Randy Stradley, and released October 10, 2007."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}