{"url": "E-11_blaster_rifle/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:BlasTech Industries products", "Category:Blaster rifles", "Category:Merr-Sonn Munitions, Inc. products", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "E-11 blaster rifle"}, {"tag": "p", "text": "The BlasTech Industries E-11 blaster rifle, also referred to as the E-11 BlasTech Standard Imperial Sidearm, the Stormtrooper Armament Blaster Rifle (BlasTech E-11), and the E-11 Military Issue Blaster Rifle, was a blaster rifle used during the time of the Galactic Empire. It was the standard-issue blaster rifle of the Imperial Stormtroopers. A powerful, light and compact weapon, the E-11 was used widely through the galaxy."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Based on the DC-15 series of rifles, carbines, and pistols, that were used by the Galactic Republic's clone troopers, the E-11 was the standard issue weapon for Imperial stormtroopers after the Declaration of a New Order, and would be carried by them throughout the Galactic Civil War."}, {"tag": "p", "text": "The basic E-11 was 438 mm long when folded and weighed 2.6 kilograms. The power cell housing opened on the left side of the action housing, above the trigger, giving the E-11 a very low profile (useful when shooting prone or from a barricade). The E-11's plasma gas cartridges allowed for over 500 shots, while the power cells lasted for about 100 shots, depending on the setting."}, {"tag": "p", "text": "It had a long barrel that produced a tightly focused and very powerful particle beam with a maximum range of three hundred meters and an optimum range of one hundred meters. Because of this, it was considered best suited for close-quarters firefights, in particular the narrow confines of enemy installations and starship corridors."}, {"tag": "p", "text": "The E-11 possessed select-fire capability allowing a user to choose between semiautomatic and pulse-fire settings, as well as a rapid-fire setting that exchanged accuracy for an expanded firing area. Some stormtroopers preferred to use the carbine model instead of the original E-11, complaining that the latter had excessive recoil that diminished its accuracy in firefights."}, {"tag": "p", "text": "It also had a stun mode that could be set to varying levels depending on the target, with humanoid being one of these settings. The blaster's stun bolts were blue rings of energy with a larger aperture than standard explosive bolts, a product of the stun setting's wasted photonic energy byproducts."}, {"tag": "p", "text": "The basic three-piece folding stock rode along the left side, under the power cell. When collapsed, the stock could be used as a foregrip to increase accuracy while also allowing the wielder to fire the weapon one-handed if they chose. It could also be clipped onto the utility belt of a stormtrooper's armor for ease of carrying."}, {"tag": "p", "text": "All moving and/or metal parts were fitted with a corrosion-proof, vacuum-rated dry lubricant, and required regular cleaning. The top of the receiver had a factory-standard universal quick-detach sight rail, typically mounted with a ring reticle 2x optical scope that could interface with the tactical head-up display within a stormtrooper's helmet. The scope was computer-enhanced, allowing it to compensate for dark, hazy, or smoky conditions, with a supplementary computer enabling it to display data specific to the weapon's current operating mode."}, {"tag": "p", "text": "The E-11 could also be fitted with multiple attachments such as an additional scope with about 8x maximum zoom that allowed it to serve as a small-scale sniper rifle - though it was not as effective in this role as the E-11s sniper rifle - and an electroscope that apparently linked with the weapon's systems to over-energize the bolts fired for additional range and damage. It could also mount a projectile launcher capable of firing various special-purpose ammunition such as grenades, flares, darts, and grappling hooks."}, {"tag": "p", "text": "The weapon was so popular that BlasTech authorized SoroSuub and Merr-Sonn to manufacture them under license in order to meet demand, and stocks across the Empire would often possess E-11s that had been manufactured by all three manufacturers mixed indiscriminately among their inventory."}, {"tag": "h2", "text": "Variants"}, {"tag": "p", "text": "The E-11 rifle proved to be a highly versatile design, spawning a wide number of variants over the course of its production history."}, {"tag": "p", "text": "The E-11 carbine was a variant that exchanged range and stopping power for reduced weight and a higher rate of fire, while the E-11s sniper rifle was a modified version produced by BlasTech for the Empire's Scout Troopers."}, {"tag": "p", "text": "Two more exotic descendants of the E-11 originating from the same period were the blast cannon, which fired a spray of energy bolts with each pull of the trigger, and the ARC caster, which fired a blast of electrical energy that could arc between targets."}, {"tag": "p", "text": "The E-11/S blaster rifle (not to be confused with the E-11s sniper rifle) was a rare, custom made weapon that combined blaster and slugthrower technology and was typically used for assassinations. The E-11b was an expensive modification to the standard E-11 that added additional cooling units to counter heat buildup and was used by the Alliance to Restore the Republic. The EZ Strike E-11 rifle was another variant favored by novice commandos."}, {"tag": "p", "text": "The E-11A blaster rifle was a heavy blaster version of the original weapon produced during the early years of the New Republic, while the E-11A1 blaster rifle removed the folding stock and compacted the design, making it small enough to fit in a pistol holster and be effectively fired with one hand."}, {"tag": "p", "text": "By 14 ABY they had been succeeded by the E-15 and E-19 blaster rifles in some Imperial Remnant forces."}, {"tag": "p", "text": "By 40 ABY the Imperial Elite Guard had adopted the E-18 blaster rifle as a successor to the E-11."}, {"tag": "p", "text": "Around 130 ABY the rifle was still in use by a small number of Imperial stormtroopers, it had been superseded as their standard-issue weapon by the ARC-9965 blaster rifle, another product of BlasTech and advertised as an upgrade over the E-11."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The E-11 blaster rifle props used in A New Hope and The Empire Strikes Back were built from a British-made Sterling Mark 4 L2A3 sub-machine gun. The Sterlings used in both productions were provided by British film armorers Bapty & Co. For the filming of Return of the Jedi, ILM used mostly Canadian C1 Sterling copies manufactured by MGC (Model Gun Corporation from Japan), but also a few resin E-11 Stunt blasters also seen in Empire Strikes Back in the hands of Stormtroopers and Snowtroopers."}, {"tag": "p", "text": "The scopes used on A New Hope E-11 props were World War II Sherman tank scopes, most notably the M38 (but also M40, M19 and M32). Next, a Hengstler Corporation industrial mechanical counter was added to the side of the gun close behind the magazine receiver. There are at least two variations of the Hengstler boxes known to have been used on the props. The only visual difference between the two boxes is in the logos on their sides: one actually says Hengstler with a small Eagle, where others merely have the \"Eagle\" logo. The counters were crudely glued on the body of the blaster and on the scope, and thus some of them fell off during filming, residual glue remaining in place. On the magazine of the E-11 blasters there were added a pair of cylinders containing genuine Metalmite capacitors - these cylinders can be seen on top of the MSE-6 Mouse Droid, as well as on other props."}, {"tag": "p", "text": "To give the actors something to react to and to give rotoscoping artists timing reference when animating blaster bolts, the E-11 rifle props in the original trilogy—which were still fully operational firearms—were loaded with blank cartridges that were then fired to provide a practical effect. Because of this, expended 9mm casings can be seen ejecting from the props in several scenes in A New Hope, particularly during the assault on the Death Star's detention level. This can also be seen briefly in a closeup of Lando firing one in The Empire Strikes Back."}, {"tag": "p", "text": "Kenner produced a full-size toy version of this rifle as part of its first Star Wars toy line in 1977. The toy was called a \"3 position laser rifle.\" Kenner (and later, Hasbro) re-released this blaster rifle (without the folding stock on the original 1977 toy and in different colors due to changing laws in the United States dealing with toy and imitation firearms) on numerous occasions throughout the Star Wars toy line's history."}, {"tag": "p", "text": "The game Star Wars: Battlefront II has several classes and at least one character who use the E-11. The four Imperial classes that use the E-11 as their primary weapon are the stormtrooper, the Imperial Marine, the Imperial Engineer, and the Dark trooper, but the Imperial Engineer's model serves as a shotgun-type weapon, and the Dark Trooper's model is the Arc Caster, which fires bolts of electricity. The other character in the game to use this weapon is Boba Fett, but like the Imperial Engineer and the Dark Trooper, the E-11 is not used as a standard blaster rifle (the game refers to the blaster as the EE-3 Blaster Rifle, but uses the E-11 model to save disk space)."}, {"tag": "p", "text": "In Star Wars: Dark Forces and its subsequent sequels, the E-11 is presented as having two firing modes: a slower, more accurate mode and a faster, inaccurate mode for use in close quarters. It is also typically depicted as being somewhat inefficient in terms of energy consumption, burning two to three times the energy per shot of other weapons."}, {"tag": "p", "text": "In Star Wars: Jedi Knight II: Jedi Outcast, while sneaking through a ceiling, the player can overhear two stormtroopers discussing the E-11. One complains of its excessive recoil seriously hampering accuracy. This dialog may have been included in the game to explain the stormtroopers' general failure to hit primary characters in the films."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}