{"url": "E-22_double_barrel_blaster_rifle", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:BlasTech Industries products", "Category:Blaster rifles"], "nodes": [{"tag": "h1", "text": "E-22 double barrel blaster rifle"}, {"tag": "p", "text": "The E-22 double barrel blaster rifle, also known as the E-22 blaster rifle, was a reciprocating, double-barreled blaster that was bigger and more powerful than the standard E-11 blaster rifle used by the Galactic Empire's stormtroopers. The E-22 saw use during the Age of the Empire. It was commonly used by coastal defender stormtroopers stationed at the top secret Imperial security complex on the tropical planet Scarif and mudtroopers stationed on the planet Mimban."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Battle of Scarif in 0 BBY, the E-22 saw use against Alliance to Restore the Republic forces in the hands of a number of shoretroopers. Ultimately, however, the Galactic Empire's efforts proved ineffective in stopping the Rebel squad \"Rogue One\" from stealing the Death Star plans from the Scarif vault, and the facility, along with any shoretroopers on the surface, was destroyed by a single reactor blast from the Death Star ordered by Grand Moff Wilhuff Tarkin in an unsuccessful attempt at stopping the plans from being transmitted to Princess Leia Organa aboard the Tantive IV, which proceeded to flee the battle by jumping to hyperspace."}, {"tag": "p", "text": "The E-22 was also used by many of the Imperial swamp troopers stationed on the planet Mimban with the 224th Imperial Armored Division. Swamp troopers learned to keep the blaster's recoil sleeve free of mud, due to the possibility of the mud causing a weapon malfunction."}, {"tag": "p", "text": "Years after the fall of the Empire, the E-22 was used by Imperial remnant forces. Mandalorian bounty hunter Din Djarin encountered a stormtrooper, armed with an E-22, whilst retrieving Grogu from an Imperial compound. Later, Djarin and his allies were trapped in the cantina on Nevarro by a force of stormtroopers, some of which were carrying E-22 blaster rifles."}, {"tag": "p", "text": "E-22 rifles were further used by the coastal defender stormtroopers in the Morak Imperial remnant around 9 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}