{"url": "E-Web_heavy_repeating_blaster", "categories": ["Category:Legends articles", "Category:BlasTech Industries products", "Category:Heavy repeating blasters", "Category:Merr-Sonn Munitions, Inc. products"], "nodes": [{"tag": "h1", "text": "E-Web heavy repeating blaster"}, {"tag": "p", "text": "The E-Web was a heavy repeating blaster manufactured by BlasTech Industries. It was one of the most powerful repeating blasters in the Imperial arsenal, and had an optimum range of one-hundred and fifty meters with a maximum range of seven-hundred and fifty meters. The full name is Emplacement Weapon, Heavy Blaster, but many users shortened this to E-Web. The original weapon was designed in a joint effort with Merr-Sonn Munitions, which produced the predecessor to the modern E-Web, the EWHB-10. Members of the Stormtrooper Corps are trained to utilize the weapon, although its mass makes it being carried by a single stormtrooper impossible, mandating that it be operated by two stormtroopers: one for firing the E-Web, and another monitoring and adjusting the generator's power feed to prevent overheating."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The weapon was able to be broken down into parts and carried by a small crew of troopers making it fairly mobile, but had to be rigidly mounted in order to counteract the effects of its incredible firepower. It took a relatively long amount of time to set up, and required two crew members for optimal effectiveness. One crewer manned the gun, and the other monitored and adjusted the Eksoan Class-4T3 power generator. Like many high-yield generators, the 4T3 was prone to overheating and potentially explosive overload, despite its advanced Gk3 Cryocooler cooling unit. Power was fed into the E-Web via a conduit that connects to the base of the TR-62 Autocushion Tripod. The built-in comlink with automatic encryption allowed for secured communication with other units. The computerized fire control and targeting system included infrared and StarVision low-light enhancement for use in night combat. Overall, the E-Web can be transported and assembled for firing within a minute or less, although it will take up to ten minutes for its generator to reach full power."}, {"tag": "p", "text": "The long set-up time was the E-Web's primary limitation. If the 4T3 generator was \"cold,\" it could take nearly fifteen minutes for the crew to deploy the weapon, calibrate the generator and configure the targeting software. Some Imperial crews pre-charged the generator before use for faster set-up, but this made it prone to power surges. Thus, the second crew member had to carefully adjust power flow to prevent an overload. Imperial Snowtroopers on Hoth were able to set up and fire an E-Web in a matter of seconds in this fashion."}, {"tag": "p", "text": "A single soldier could operate the E-Web, but at greatly reduced efficiency. In such cases, the gunner chose a power generator preset mode, which greatly reduced the rate of fire, but kept the E-Web and its generator operating at safe temperatures. Its retail price was 8,000 credits, a small price to pay from the Empire's infinite coffers."}, {"tag": "p", "text": "Maintenance of the weapon required monthly disassembly, inspection, repair, and reassembly."}, {"tag": "h3", "text": "E-Web upgrades"}, {"tag": "p", "text": "There were several upgrades to the E-Web on the market, including the F-Web and the EWeb(15)."}, {"tag": "p", "text": "The F-Web added a small shield generator that was powerful enough to block fire from small sidearms such as blaster pistols. The shield offered good protection, but it required a third crew member to operate. This model was used primarily in the Corporate Sector."}, {"tag": "p", "text": "The EWeb(15) was released the year after Emperor Palpatine's death. It offered improved fire control and targeting software. With the generator's auto configure setting, the weapon could be set up in less than five minutes. The cooling system was also upgraded to the advanced Gk7 Cryocooler offering increased power flow into the weapon without the risk of overheating. This allowed continuous fire for up to one hour. Many EWeb(15) units were equipped with a shield generator."}, {"tag": "p", "text": "The E-Web rifle was a portable version of the E-Web heavy repeating blaster."}, {"tag": "p", "text": "The E-Web itself had some modifications of its own, including a high-fire repeater setting and automated sentry turret modification kit."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Clone Wars"}, {"tag": "p", "text": "The E-Web was used by Granta Omega in an attempt to murder Jedi Knight Obi-Wan Kenobi. The weapon overheated and exploded, severely wounding Omega."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The EWHB-12 heavy repeating blaster was used by clone commandos as a distraction to infiltrate a Separatist nanovirus facility on Qiilura that was producing a nanovirus capable of killing all clones. It was also used in the Battle of Praesitlyn."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Stormtroopers set up E-Webs to defend backwater worlds."}, {"tag": "p", "text": "During the Galactic Civil War, Rebel Commander Luke Skywalker took control of an E-Web to shoot down an Armored Personnel Carrier carrying the captured defector, Tycho Celchu. Soon after, he took control of one on a CR90 corvette to eliminate boarding stormtroopers."}, {"tag": "p", "text": "The E-Webs also saw use at the Battle of Hoth in 3 ABY, in a battle on Geonosis, and the Mission to Cilpar."}, {"tag": "p", "text": "It was used on Tatooine in 8 ABY by stormtroopers trying to prevent the Millennium Falcon from escaping. Chewbacca blasted the troopers with an on-board laser cannon before they could set up the E-Web."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The E-Web's first appearance in Star Wars canon was in Star Wars: Episode V The Empire Strikes Back. The E-Webs have appeared in LEGO form, both in real life and in LEGO Star Wars: The Video Game."}, {"tag": "p", "text": "There are slight differences in this weapon's range presented in the Star Wars Roleplaying Game Saga Edition Core Rulebook that differ from the range as listed in the The New Essential Guide to Weapons and Technology. According to the Saga Edition, the optimum range is up to 75 meters and the maximum range is up to 750 meters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}