{"url": "E522_assassin_droid/Legends", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Assassin droid models", "Category:Sienar Intelligence Systems products"], "nodes": [{"tag": "h1", "text": "E522 assassin droid"}, {"tag": "p", "text": "The E522Q assassin droid was a droid series created by the Techno Union during the Clone Wars and, later, Sienar Intelligence Systems for the Galactic Empire around the time of the Galactic Civil War. The Empire had outlawed assassin droids after the massacre on Caprioril, but continued to use various models, including the E522 series, in secret for its own ends."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The E522 was loaded with weapons and extremely adept at tracking targets. It was fairly compact and moved about on well-oiled treads. It came equipped with a pair of gripper claws and an infrared heat-signature tracking system, making it a decidedly difficult opponent to escape."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One unit was acquired by Jabba Desilijic Tiure of Tatooine. Once on the sail barge known as the Khetanna, one of Jabba's servants accused a Bith musician named Doikk Na'ts of snacking on Jabba's stash of feckled toads. E522 was present and presented Jabba with an alibi for Doikk's whereabouts. Jabba could not logically hold Doikk accountable for the crime. Disappointed at having no one to truly blame, Jabba decided to take his frustration out on E522. He had him liberally coated with meat juices and thrown into the rancor dungeon at Jabba's Palace. Smelling the juices, the Rancor proceeded to eat E522. He spat out the indigestible mechanical parts."}, {"tag": "p", "text": "Some time after this event, two Jawas, Het Nkik and Jek Nkik found E5's discarded remains. After months of rebuilding the droid, they successfully sold the unit, stripped of its weapons systems, to the Whiphid gangster known as Lady Valarian who put him to use as her personal messenger."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Valarian sent E5 to Jabba's Palace to recruit the Bith musicians known as Figrin D'an and the Modal Nodes to perform at her wedding to the Whiphid hunter known as D'Wopp. E5 tendered an offer of 3,000 credits to the band for one night's work."}, {"tag": "p", "text": "The gunrunner Praaelon Di kept an old E522 for protection aboard his ship, the Tri-Sun."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There is some conflict over who created the E522 assassin droid. In Labyrinth of Evil, the E522 is said to have been produced by the Techno Union during the Clone Wars. However, various Star Wars Roleplaying Game products state that it was created by Sienar Intelligence Systems around the time of the Galactic Civil War. Both accounts have been used in this article."}, {"tag": "p", "text": "The quote that appears on the E522's miniature stat card (and which is featured above) is a parody of Clint Eastwood's famous line \"Go ahead, make my day\" from the Dirty Harry film Sudden Impact."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}