{"url": "E3-standard_starship_lifeboat/Legends", "categories": ["Category:Legends articles", "Category:Escape pod classes"], "nodes": [{"tag": "h1", "text": "E3-standard starship lifeboat"}, {"tag": "p", "text": "The E3-standard starship lifeboat was an escape pod designed by His Grace the Duke Gadal-Herm's Safety Inspectorate. Jedi Master Yoda used one such lifeboat to reach the world of Dagobah to begin his self-imposed exile after the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The E3-standard was a durable, sophisticated lifeboat capable of seating three passengers for four weeks of travel. The hull was flanked by four reinforced legs, that deployed fully-extended upon landing. Advanced landing and telemetry processors ensured the lifeboat remained upright during takeoff, descent and even through the turbulence of re-entry. The pod carried no onboard hyperdrive, meaning the E3-standard was useful for one-way trips only."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the funeral of Padmé Amidala, Yoda returned to the Subterrel sector, where he stowed away aboard a Polis Massa-registered super freighter carrying grain to Sluis Van. The vessel briefly dropped out of hyperspace in the remote Dagobah system, where Yoda launched his lifeboat. Undetected and unrecorded, the E3 lifeboat landed near the Dragonsnake Bog."}, {"tag": "p", "text": "Within a year, the lifeboat's sensitive electronic systems were ruined by the natural elements of the swamp world, grounding Yoda on Dagobah forever. Yoda salvaged what he could from the pod, using parts to fashion a simple hut in the swamps."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This pod is one of two used by Yoda in Revenge of the Sith, and the art department ensured the two were visually different from one another. One concept for the 'Dagobah pod' was a rounded pod dragged, Podracer-style, by a rocket. Ultimately, the shots of Yoda's landing on Dagobah were cut from the movie, but were completed for inclusion in the Deleted Scenes section of the DVD release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}