{"url": "EE-4_carbine_rifle", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:BlasTech Industries products", "Category:Blaster carbines"], "nodes": [{"tag": "h1", "text": "EE-4 carbine rifle"}, {"tag": "p", "text": "The EE-4 carbine rifle, also known as the EE-4 blaster rifle, was a powerful medium-ranged blaster carbine model that was manufactured by BlasTech Industries during the reign of the Galactic Empire. Successor to the EE-3 carbine rifle, the EE-4's shorter and stubbier barrel allowed the blaster rifle to fire more effectively at close range with spread shots but at the cost of a reduced accuracy at range compared to its predecessor."}, {"tag": "p", "text": "The two-handed EE-4 carbine rifle was favored by Sana Starros, a bounty hunter and smuggler who later joined the Rebel Alliance. Starros wielded the blaster on multiple occasions, including selling the lightsabers of Darth Atrius on Hradreek, confronting fellow smuggler Han Solo in the Monsua Nebula, and rescuing the Jedi Luke Skywalker on Nar Shaddaa."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Manufactured by BlasTech Industries, the EE-4 carbine rifle, or the EE-4 blaster rifle, was a powerful type of blaster that was capable of discharging red-colored bolts with a medium range. Distinguished for its two-round spread burst fire, the weapon was the successor to the EE-3 carbine rifle. While the EE-3 focused on precision and range, the EE-4 was built to be more effective at close range and had a superior rate of fire with its shorter and stubbier barrel, which was designed as a hybrid between a rifle and a pistol. On the other hand, these alterations caused a reduction in the blaster's accuracy at range and cooling power in comparison to its predecessor."}, {"tag": "p", "text": "The black-colored EE-4 consisted of a short barrel that contained cooling vents, along with two vertical grips attached beneath it, which allowed the wielder to hold the weapon with two hands. One of the grips was located in the middle of the rifle, with the other being at the backside, as the blaster lacked a long stock, unlike its predecessor. In addition to the rifle's main scope, which was visually identical to the EE-3's electronic scope, the EE-4 was equipped with four smaller scopes, two positioned on either side of the weapon's frame. The rifle also contained a guard that surrounded the trigger."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Masse Goskey's weapons business"}, {"tag": "p", "text": "Sometime between 19 BBY and 10 BBY, Masse Goskey, the proprietor of Masse Goskey's Arms Emporium and Explosives Mart in Mos Eisley spaceport on the planet Tatooine, and his associate Ephant Mon bought some weaponry on the moon of Nar Shaddaa, including an EE-4 carbine rifle that came at a price of 850 credits. A complete inventory of the merchandise was recorded in a book that would eventually be known as the Smuggler's Guide. According to Goskey's note in the book, all the weapons they picked up on Nar Shaddaa were illegal in sixty-six sectors, compelling them to sell the arms to crime syndicates such as the Crymorah syndicate and the Black Sun."}, {"tag": "h3", "text": "Skirmish on Hradreek"}, {"tag": "p", "text": "The EE-4 carbine rifle was used by Sana Starros, a human female bounty hunter and smuggler active during the reign of the Galactic Empire. Sometime after the Battle of Yavin, Starros carried her EE-4 in a holster when she traveled to Hradreek to sell a pair of ancient lightsabers that were once wielded by the Sith Darth Atrius. Although she had promised them both to the Empire and an alien crime boss at the same time, Starros only delivered one of the lightsabers to each of her buyers."}, {"tag": "p", "text": "When the Dark Lord of the Sith Darth Vader realized the smuggler's deception, he ordered stormtroopers to locate her and the other lightsaber. Soon after, Vader himself found Starros, who fired on the Sith Lord with her EE-4 carbine rifle. However, Vader deflected the blaster bolts with his hand by using the Force. Starros eventually escaped the Sith Lord by activating a bomb hidden next to him."}, {"tag": "p", "text": "Due to the same explosion, the Jedi trainee Luke Skywalker, who was also coincidentally on Hradreek to retrieve funds for the Rebel Alliance, dropped his cred stick and was separated from his astromech droid, R2-D2. Shortly after, Starros came across the credit chip lying on the ground and picked it up. The droid thereupon attacked Starros, caused her to fall to the ground, and took the credits back. She then fired upon R2-D2 with the EE-4 in anger, but the astromech escaped."}, {"tag": "h3", "text": "Hunting Han Solo"}, {"tag": "p", "text": "Later, Sana Starros began searching for Han Solo, a fellow smuggler who had taken her cut after the two pulled off a robbery disguised as their \"wedding.\" Starros's quest came to an end on an unnamed planet near the Monsua Nebula, where Solo was on a mission for the Rebellion along with Princess Leia Organa. By using her EE-4, Starros initially drew a bead on both rebels, alerted Imperials to claim the bounty issued for Organa, and forced Solo to come with her."}, {"tag": "p", "text": "However, she had a change of heart upon learning that Solo had become a rebel and that the Empire would arrest him as well. With Starros's starship, the Volt Cobra, the trio escaped from the Imperial forces."}, {"tag": "h3", "text": "Rescue of Luke Skywalker"}, {"tag": "p", "text": "After losing the Imperials, Organa made a deal with Starros to transport their group to Nar Shaddaa to rescue Luke Skywalker, who had been abducted by the Hutt crime lord Grakkus. By the time the trio reached Grakkus's palace, Skywalker was forced to fight an arena match against a roggwart creature known as Kongo the Disemboweler."}, {"tag": "p", "text": "Confronted by the rescue party, Grakkus activated a local electromagnetic pulse that disabled Kongo's shock collar as well as all nearby blasters, including Starros's EE-4 carbine rifle, rendering her unable to fire upon the ravenous beast when it charged the rebels. Nonetheless, the rebels successfully rescued Skywalker, and Starros later allied herself with the Rebel Alliance."}, {"tag": "p", "text": "Some time after, Starros kept her EE-4 by her side when she traveled to the planet Corellia during the rogue archaeologist Doctor Chelli Lona Aphra's search for an ancient device known as the Path engine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The EE-4 carbine rifle first appeared, albeit unnamed, in the 2015 Marvel comic book Star Wars 6, written by Jason Aaron with art by John Cassaday. It was initially identified as the EE-4 blaster rifle in the video game Star Wars Battlefront, as part of the Bespin expansion pack released in 2016, while the 2018 reference book Star Wars: Smuggler's Guide, written by Daniel Wallace, later introduced the name EE-4 carbine rifle. In Star Wars Battlefront, the rifle was unlockable via an in-game challenge called \"Sana's Legacy,\" referring to Sana Starros, who wields the weapon in Marvel's Star Wars comic-book series."}, {"tag": "p", "text": "The EE-4 also appeared in the game's 2017 sequel, Star Wars Battlefront II, as part of the \"infiltration\" ability for the specialist trooper class—such as security battle droids, clone sharpshooters, and Imperial scout troopers—rather than a full-fledged blaster option. In both games, the rifle can be used by troopers from all factions, including the Galactic Republic, the Separatist Alliance, the Galactic Empire, the Rebel Alliance, the New Republic, the First Order, and the Resistance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}