{"url": "EG-127", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:Alliance to Restore the Republic droids", "Category:GNK power droids", "Category:Resistance droids"], "nodes": [{"tag": "h1", "text": "EG-127"}, {"tag": "p", "text": "EG-127 was a green-plated GNK-series power droid manufactured by Industrial Automaton. During the Galactic Civil War, it served in the Alliance to Restore the Republic and was stationed in Echo Base, the Alliance's headquarters on the planet Hoth. When the Galactic Empire attacked Echo Base in 3 ABY, it was the first battle EG-127 had participated in. The droid tried to power as much equipment as possible, as it believed the Alliance was depending on it. It saved an internal data record of the event, including an image of the base's interior."}, {"tag": "p", "text": "EG-127 survived the battle and ultimately joined the Resistance. In 34 ABY, during the First Order occupation of the planet Batuu, EG-127 was amongst the Resistance forces stationed on the world. It worked at Resistance Supply in Black Spire Outpost where it stood next to a Resistance T-70 X-wing starfighter with fellow power droid EG-30 storing power for the Resistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "EG-127 first appeared as a prop within the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019. The prop is capable of emitting various sound effects. The droid simultaneously appeared in the Star Wars: Datapad application launched alongside the themed land, where it was initially identified as EG-16, but later renamed to EG-127, while Galaxy's Edge staff were originally told to refer to it as 16-SK. Only the Hollywood Studios Datapad entry clarifies that EG-127 is the green GNK-series droid. Hollywood Studios also has a third unnamed GNK-series power droid stands with EG-127 and EG-30."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}