{"url": "EG-07", "categories": ["Category:Legends articles", "Category:Battle droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "EG-07"}, {"tag": "p", "text": "EG-07 was an EG droid purchased by General Grievous in order to be used for covert operations during the Clone Wars. On Mustafar, he was in battle with Jedi Knight Anakin Skywalker. Skywalker and his Padawan, Ahsoka Tano, ensured that EG-07 was destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "General Grievous purchased an expensive EG droid, EG-07, which he used for secret operations beyond the knowledge of the Separatist Army during the Clone Wars. Grievous had learned about a powerful ancient superweapon capable of releasing a deadly virus, which was located somewhere on Mustafar. With EG-07's help, Grievous planned to rebel against Count Dooku and conquer the galaxy himself. To this end, he dispatched EG-07 to find the weapon, and the latter located it beneath an ocean of lava, where it was hidden by the Jedi of the Old Republic. EG-07 reported to Grievous on the progress of his mission, but their transmission was intercepted by R2-D2 on Skytop Station, however this transmission did not reveal the name of the planet Grievous and his droid talked about. After R2-D2 was rescued, the Jedi learned of Grievous's plans, while the General was forced to use his own spare parts to repair EG-07, which had suffered serious damage during its mission on Mustafar."}, {"tag": "p", "text": "As Grievous drilled to the core of the planet to uncover the superweapon and placed a battlesphere similar to Skytop Station above Mustafar, the Jedi started their investigation. They first dispatched Jedi Master Luminara Unduli and Commander Gree to steal Separatist recognition codes from an archive in Grievous's castle on Vassek's third moon, which Grievous left after his encounter with Kit Fisto. Using the stolen codes, the Jedi infiltrated the Separatist-controlled space station Juma 9 and used the station's scanners to locate the superweapon on Mustafar. Meanwhile, Grievous had found the weapon and prepared to use the battlestation's superlasers to charge the weapon, so that it could fire and spread the deadly virus which would have destroyed all life in the system. Having learned of Grievous's intentions, the Jedi dispatched Anakin Skywalker, Ahsoka Tano, Fisto and Commander Cody to prevent the battlestation's lasers from charging the weapon. However, the strike team was delayed by EG-07 long enough for Grievous's plans to come to fruition."}, {"tag": "h2", "text": "Appearances"}]}