{"url": "EGL-21", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Masculine programming", "Category:Power droids"], "nodes": [{"tag": "h1", "text": "EGL-21"}, {"tag": "p", "text": "EGL-21, also known as \"AMPS\" or \"Amps,\" was a manumitted EGL power droid based in Niima Outpost on the desert planet Jakku. He welded objects for scavengers in exchange for power, spare gas canisters, interesting metals, or a good joke. The droid and his mechanical colleague GTAW-74 could sometimes be spotted in the shade trading jokes that their customers had brought them. The scavenger Rey often spent time thinking up jokes to trade with EGL-21 for his services."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "EGL-21 was the designation of an EGL power droid manufactured by Veril Line Systems who was also known by the nicknames \"AMPS\" or \"Amps.\" By the year 34 ABY, he was manumitted and based on the desert planet Jakku in Niima Outpost, a trading center controlled by the junk dealer Unkar Plutt. There, the droid would offer his services as a welder to scavengers in exchange for a recharge, spare gas canisters, interesting metals, or a good joke, as the ration portions that most of the scavengers traded in were useless to him."}, {"tag": "p", "text": "The welding droid GTAW-74 was a colleague of EGL-21, and the pair could sometimes be spotted together in the shade trading jokes that their customers had brought to them. The scavenger Rey sometimes traded with EGL-21 and would try and think of jokes he might like while she was traveling across the Goazon Badlands. Whenever she did think of a new joke she would seek EGL-21 and GTAW-74 out, as the pair's services could greatly improved the value of pieces of scrap. At some point, she wrote about the power droid in a survival guide she was compiling and included a drawing of him."}, {"tag": "p", "text": "In 34 ABY, EGL-21 walked through one of the tents in Niima Outpost and passed by Rey and the astromech droid BB-8 arguing with the former First Order stormtrooper Finn. Soon after, the First Order attacked Niima Outpost."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "EGL-21 was a power droid with masculine programming who enjoyed a good joke. He became so quirky with age and lack of memory wipes that he formed a genuine friendship with the equally eccentric GTAW-74. Simple survival and the company of others was enough for the pair. He had gray plating and the capability to weld objects."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "EGL-21 was created for the 2015 sequel trilogy film, Star Wars: Episode VII The Force Awakens. He was not identified in the film but was simultaneously named through the books Rey's Survival Guide and Star Wars: The Force Awakens: The Visual Dictionary, which were released in conjunction with the film and written by Jason Fry and Pablo Hidalgo, respectively."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}