{"url": "ELG-3A_blaster_pistol", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Weapon stubs", "Category:Blaster pistols", "Category:Hold-out blasters", "Category:Merr-Sonn Munitions, Inc. products", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "ELG-3A blaster pistol"}, {"tag": "p", "text": "The ELG-3A blaster pistol, also known as the Naboo royal pistol or the royal blaster pistol was a model of diplomatic hold-out blaster pistol manufactured by Merr-Sonn Munitions, Inc., and also attributed to SoroSuub Corporation. The Queen of Naboo, Padmé Amidala, used an ELG-3A blaster pistol during the Battle of Naboo, as did several of her Handmaidens. At least two of these blasters, with shortened barrels, were kept in a secret compartment of the Queen's throne in the Theed Royal Palace, which came in useful as last resort weapons."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The ELG-3A was a lightweight, elegant, and functional hold-out blaster pistol designed for practical use and easy concealment. It was a small, sleek weapon with a polished chrome finish and a wooden grip, and fired green or blue bolts, as well as a stun setting.[source?] The slim blaster was fired using a snap trigger, which required a firm squeeze to prevent misfires."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The ELG-3A became practically a standard accessory for diplomats and nobles in need of a personal sidearm. Padmé Amidala and her Naboo Royal Handmaidens carried these blasters, and utilized the weapons during the Battle of Naboo. Despite its small size, the ELG-3A packed a punch, and was able to destroy a BX-series droid commando with one shot to the head despite the droid's heavy armor.[source?]"}, {"tag": "p", "text": "As Senator of Naboo, Amidala carried this blaster during the period leading up to and during the Clone Wars. Amidala wielded an ELG-3A during missions to Rodia, Naboo, the Coruscant Underworld and when she was under threat of assassination on Alderaan, getting the jump on bounty hunter Aurra Sing and stunning her with a single shot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ultimate Star Wars cites the weapon's manufacturer as Merr-Sonn Munitions, Inc., although also credits it as a SoroSuub ELG-3A. In Legends material, the blaster was a SoroSuub spin-off of a Merr-Sonn product, although no such explanation has appeared in canon so far."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}