{"url": "ES-04", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles that are known by a nickname", "Category:Elite Squad Troopers", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "ES-04"}, {"tag": "p", "text": "ES-04 was the designation of a human female Elite Squad Trooper who served the Galactic Empire during the early days of the Imperial Era. She was recruited through Project War-Mantle along with her squadmates, and was described by Vice Admiral Rampart as one of the best soldiers in the galaxy. As a member of Clone Commander CT-9904's Elite Squad, ES-04 participated in the execution of civilians after ES-01 was killed for refusing to comply with the commander's orders."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Recruit of the Empire"}, {"tag": "p", "text": "After the dissolution of the Galactic Republic and the formation of a new Galactic Empire in 19 BBY, the burgeoning Imperial Military sought to reorder its ranks. Under an initiative known as Project War-Mantle, Vice Admiral Rampart began enlisting conscripted human recruits to potentially replace clone troopers, the standard infantry of the Grand Army of the Republic. The individual who would take on the designation ES-04 was one of these recruits, becoming one of the first Elite Squad Troopers of the Empire. She was regarded as one of the top soldiers in the galaxy by the Vice Admiral, who took great pride in his troops."}, {"tag": "p", "text": "Along with fellow recruits ES-01, ES-02, and ES-03, ES-04 was brought by Rampart to the Tipoca City Military Complex on Kamino, where the squad was assigned to the clone commando CT-9904 \"Crosshair,\" a modified clone regarded for his skills as a sharpshooter. After undergoing a medical examination by Kaminoan droids, the group was tasked by Governor Wilhuff Tarkin to eliminate Saw Gerrera, an insurgent located on the planet Onderon. Hoping to test the squad's effectiveness, Tarkin ordered the unit to destroy Gerrera's camp and wipe out any resistance."}, {"tag": "h3", "text": "A tangible test"}, {"tag": "p", "text": "Arriving at Onderon aboard a Nu-class attack/transport shuttle, ES-04 and her squadmates entered the planets jungles and located the camp of fighters, though Gerrera himself was absent. As Crosshair led the main unit in a frontal assault on the insurgents, ES-04 flanked the enemy with a flamethrower and took out several fighters as they retreated towards an LAAT/le patrol gunship. Her next target, the occupants of the gunship's cabin, were spared from her stream of fire when the ship's pilot sealed the vessel's hatch doors. A well placed shot from an Elite, however, took the pilot out and left the ship defenseless."}, {"tag": "p", "text": "With only refugees left aboard, ES-01 encouraged his team to take them as prisoners, but Crosshair disagreed, shooting the trooper for refusing to wipe out all members of the camp. Under orders from their clone commander, ES-04 and the rest of her squad turned their weapons on the huddled refugees, killing them all. Upon returning to Kamino, Tarkin and Rampart commended ES-04 and the rest of the squad for their diligence, anticipating the victories they would accomplish in the name of the Empire. The squad then took their leave to their barracks, where Crosshair's old team, Clone Force 99, had previously resided."}, {"tag": "h3", "text": "Searching for Clone Force 99"}, {"tag": "p", "text": "After being notified by scavengers on Bracca that Clone Force 99 had been spotted on the planet, they were taken to search for them along with the rest of their squad and three Empire ships worth of stormtroopers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "ES-04 was a human female with dark skin, brown eyes, and auburn hair. She lamented the fact that the end of the Clone Wars signified that there were fewer enemies in the galaxy to fight, and so willingly enlisted in the Imperial Military. She displayed levels of loyalty to the Empire that Vice Admiral Rampart deeply appreciated, and she was willing to follow her orders despite any moral underpinnings to the contrary."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Vice Admiral Rampart considered ES-04 and her squad to be among the greatest soldiers in the galaxy and spoke highly of their skills to others within the Empire. Although the Kaminoan Prime Minister Lama Su, who oversaw the creation of clone troopers for the Republic, believed that conscripted soldiers could never reach the same levels of proficiency as fighters bred for war, Rampart saw otherwise; he was of the opinion that troops like ES-04 would learn any necessary skills over time."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like the other Elites, ES-04 wore modified clone trooper armor, specially fitted to match her individual body type. The black armor sported a helmet with green lenses. ES-04 carried a flamethrower into combat, a unique weapon among the others found in her Elite Squad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "ES-04 made her first appearance in \"Replacements,\" the third episode of the first season of the television series Star Wars: The Bad Batch, released on May 14, 2021. Her designation is given in the episode's credits, which also point out that the character is voiced by actress Dahéli Hall. The descriptive audio for the episode available on Disney+ incorrectly identifies the trooper wielding a flamethrower on Onderon as Crosshair, when it is in fact ES-04."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}