{"url": "EV-A4-D", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:EV-series medical droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "EV-A4-D"}, {"tag": "p", "text": "EV-A4-D, also known simply as A4-D, was an EV-series medical droid and mechanic owned by General Grievous. He provided the Kaleesh cyborg with repairs following battles with the Republic, and resided in his master's lair on the third moon of Vassek. EV-A4-D was partially destroyed by Jedi Master Kit Fisto during a Republic operation to recapture Trade Federation Viceroy Nute Gunray. The droid doctor was later rebuilt on the General's orders, and EV-A4-D served Grievous until the end of the Clone Wars."}, {"tag": "p", "text": "EV-A4-D possessed a sarcastic and sadistic personality, and he appeared to take as much joy in the potential defeat of Jedi and clone troopers as Grievous himself did."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Enemy of the Jedi"}, {"tag": "p", "text": "EV-A4-D served as the personal medical droid of Separatist General Grievous during the Clone Wars, and provided critical repairs to the cyborg's body following battles with the Republic."}, {"tag": "p", "text": "In 21 BBY, EV-A4-D performed repairs on Grievous after the General was ambushed by Jedi Master Kit Fisto and Jedi Knight Nahdar Vebb upon returning to his fortress on the third moon of Vassek. Fisto and Vebb had entered Grievous's lair after following the signal of a ship stolen by Trade Federation Viceroy Nute Gunray following his escape from Republic captivity. However, this turned out to be a trap devised by Separatist leader Count Dooku that would see them faced with General Grievous."}, {"tag": "p", "text": "After escaping from the Jedi, Grievous called on EV-A4-D to provide repairs, having had his legs hacked off by Fisto's lightsaber and sustaining blaster damage to his faceplate. EV-A4-D scolded Grievous for the damage he'd taken, bemoaning how long it would take to get the cyborg back into decent shape, before leaving to prepare Grievous's spare parts. The medical droid also relayed to Grievous that his personal bodyguards had been remotely deactivated for recharge, much to Grievous's bemusement."}, {"tag": "p", "text": "After Grievous sent his pet roggwart Gor to deal with the Jedi intruders, EV-A4-D proceeded with Grievous's repairs. The medical droid removed and replaced the cyborg's legs, before doing the same with his faceplate - causing some discomfort for Grievous. Meanwhile, EV-A4-D pondered why Grievous submitted to the cybernetic changes that saw the Kalee-born warrior become more mechanical than organic, but Grievous retorted by stressing they were improvements and that he submitted to no-one."}, {"tag": "p", "text": "Following the repairs, Grievous found that Gor had been slain by the Jedi, before being contacted by Dooku. Dooku informed Grievous that he had arranged the Jedi intruders in order to re-test his effectiveness, and demanded greater results from the Separatist general - in the form of more dead Jedi. Grievous angrily agreed to play Dooku's game and rushed to meet the Jedi, despite EV-A4-D's insistence that he needed rest. Grievous stressed that he would rest only when the Jedi were dead."}, {"tag": "p", "text": "As Grievous left the control room of his lair, he was spied upon by Fisto and Vebb, who memorized the pattern that Grievous used to enter and exit the control room. The Jedi sneaked in behind Grievous, intending to enter the control room; but as Fisto opened the door, EV-A4-D alerted the general of the Jedi's movements. Vebb stayed behind to duel the cyborg and his MagnaGuard companions, while Fisto was separated from his former padawan as the control room door slammed shut. EV-A4-D watched on excitedly as Grievous dueled Vebb, but failed to notice Fisto entering the control room until he noticed that there was no sign of the other Jedi - whom he had just locked himself inside with. EV-A4-D had just enough time to realize and bemoan his fate before being bisected by the Jedi Master's lightsaber."}, {"tag": "h3", "text": "Rebuilt"}, {"tag": "p", "text": "Soon after, Vebb was killed by Grievous, but Fisto managed to escape the cyborg's lair after a brief lightsaber duel with Grievous. Despite his partial destruction, EV-A4-D was recovered and rebuilt on Grievous's orders. Accordingly, he continued to serve the General until the end of the war. During the final days of the war, Grievous was killed by Jedi Master Obi-Wan Kenobi during the Battle of Utapau, and the Separatists were defeated when Sith apprentice Darth Vader ordered the Droid Army to shut down."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "EV-A4-D possessed a high level of wit, which he often deployed in the form of sarcastic remarks. Despite sometimes bordering on insolence with his attitude, Grievous was seemingly quite tolerant of the EV-A4-D's antics, and the medical droid certainly didn't receive the same treatment that Grievous's battle droids sometimes did. In reverse, EV-A4-D was diligent and speedy in his repairs on his master's body, and was keen to ensure that Grievous rested following repairs for maximum effectiveness."}, {"tag": "p", "text": "EV-A4-D appeared to share his master's sadism and lust for battle - albeit from afar. The entry of Fisto and Vebb into the fortress on Vassek 3 provided much excitement for the medical droid, who urged his master to kill the Jedi. His interest in battle perhaps contributed to his downfall, however, as it distracted him from realizing that in sealing off the control room, he had also just locked himself in with one of the Jedi - who promptly destroyed EV-A4-D."}, {"tag": "p", "text": "EV-A4-D stood at 1.74 meters tall, and was covered in bronze plating with a number of white photoreceptors. He was outfitted with a range of medical and surgical tools, while he also possessed a power welder for use in repairing the body of his master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "EV-A4-D first appeared in the Star Wars: The Clone Wars episode \"Lair of Grievous\", where he was voiced by David Acord. Acord's vocal performance as EV-A4-D was inspired by the distinctive speaking pattern of comedian and actor Paul Lynde."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}