{"url": "EV-A4-D/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:A4 laboratory assistant droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "EV-A4-D"}, {"tag": "p", "text": "EV-A4-D, also known as A4-D or Ay-Four-Dee, was an A4 laboratory assistant droid who served the cyborg General Grievous of the Confederacy of Independent Systems as a medical/repair droid during the Clone Wars. As with many EV-model droids, a programming defect caused EV-A4-D to have a sadistic personality. Prior to his work with Grievous, EV-A4-D served as a supervisor in a hospital on the world of Tauber, but he was relieved from duty after ordering the medical droids under his command to operate on patients without administering painkillers. He was later purchased by the InterGalactic Banking Clan and absorbed into the Confederacy of Independent Systems."}, {"tag": "p", "text": "EV-A4-D was eventually assigned to work as the personal doctor of Grievous. Stationed in Grievous's castle on the third moon of Vassek, EV-A4-D became the facility's caretaker, managing the general's residence and working to repair any damage he sustained to his cyborg body over the course of the war. In 22 BBY, Confederate Head of State Count Dooku lured Republic forces to Grievous's castle in order to assess the general's abilities as the Supreme Commander of the Separatist Droid Army. During the confrontation with the Republic, Grievous was heavily damaged and was repaired by EV-A4-D to be able to confront the intruders once more. EV-A4-D later separated Nahdar Vebb and Kit Fisto, the two Jedi who were leading the Republic forces, allowing Grievous to defeat Vebb. However, as EV-A4-D monitored the castle's security cameras from the control room, he was decapitated and destroyed by Fisto."}, {"tag": "p", "text": "The droid's body was later recovered by Grievous and reassembled. EV-A4-D then left Vassek, traveling with his master during his military campaigns serving as both doctor and advisor. EV-A4-D was present alongside Grievous during the siege of Dorin, during which he informed the general of a communication from Count Dooku's assassin, Asajj Ventress."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hospital service"}, {"tag": "p", "text": "EV-A4-D was manufactured by MerenData as part of the first-degree EV-series supervisor droid line. Like most of the EV-series, A4-D, or Ay-Four-Dee, was affected by a programming defect during production that caused him to have a sadistic and malicious personality. Regardless of the defect, MerenData sold the EV-series droids, and EV-A4-D became a supervisor to the droids serving as the staff in a hospital on the planet Tauber. EV-A4-D's work in the hospital yielded dramatically higher productivity from the droids; however, the supervisor droid's methods disturbed the Human doctors. After serving in the hospital for a time, EV-A4-D ordered the droids to operate on the patients without the use of painkillers. As a result, EV-A4-D was returned to MerenData, only to be later purchased by the InterGalactic Banking Clan."}, {"tag": "h3", "text": "The general's doctor"}, {"tag": "p", "text": "During the Clone Wars, the InterGalactic Banking Clan allied itself with the Confederacy of Independent Systems, a separatist government opposing the Galactic Republic. EV-A4-D, modified with medical and repair attachments, was assigned to work in the castle of cyborg Confederate General Grievous, Supreme Commander of the Separatist Droid Army, on the third moon of the planet Vassek. There, EV-A4-D served as a repair droid and doctor to Grievous. Aside from his duties as Grievous's personal physician, EV-A4-D also acted as the caretaker of the Vassek facility, overseeing its day-to-day maintenance, managing the general's IG-100 MagnaGuard bodyguards, and feeding Gor, Grievous's pet roggwart. The general was fond of Gor, but believed his abilities as the castle guardian could be improved. As such, Grievous enlisted the aid of EV-A4-D in attaching cybernetic limbs, exoskeletal plates, and armor to the roggwart. Over the course of the war, EV-A4-D grew used to his master returning from the battlefront in need of repair, and at one point he was aware of the reasons behind Grievous's transformation from a proud Kalee warrior into a cyborg subordinate of Confederate Head of State Count Dooku. This information was eventually erased from his memory."}, {"tag": "p", "text": "In 22 BBY, Separatist Council member Nute Gunray was captured by Republic forces after a failed attempt to bring Rodia into the Confederacy. Shortly after his capture, Gunray escaped from captivity aboard the Republic Star Destroyer Tranquility and fled in a stolen Republic frigate. Gunray's escape presented Dooku with an opportunity to reassess Grievous's abilities to lead the Droid Army, which had been called into doubt after a recent string of defeats. While Grievous was away from his castle, Dooku planted the homing beacon of Gunray's frigate within the general's lair, and also remotely deactivated Grievous's IG-100 MagnaGuards, leaving EV-A4-D to believe that Grievous himself had deactivated them."}, {"tag": "h4", "text": "Intruders"}, {"tag": "p", "text": "Following the placement of the tracking beacon, High Jedi General Kit Fisto and Jedi Knight Nahdar Vebb arrived on the third moon of Vassek with a small force of Republic clone troopers, having tracked down the Republic frigate in the hopes of recapturing Gunray. Dooku and Gunray revealed their manipulations to the Republic forces via hologram, leaving the Jedi to plan the capture of Grievous instead of Gunray. The group resolved to take Grievous into custody upon his arrival at his castle. When he returned to his lair, Grievous was ambushed by the Republic forces. In the following duel, Fisto severed the general's legs with his lightsaber, and Grievous's faceplate was damaged by blaster fire."}, {"tag": "p", "text": "The general escaped into the castle's control room, where he was met by EV-A4-D, who reprimanded him for allowing the Jedi to damage him, and informed Grievous of his guards' deactivation. EV-A4-D left and began preparations for repairing the cyborg, while Grievous remained in the control room to release Gor, whom he hoped would be able to kill the intruders. However, Grievous was pulled away from watching Gor's efforts by EV-A4-D, who was ready to take Grievous in for repairs. In the castle's operating theater, EV-A4-D began removing Grievous's damaged parts, replacing his severed legs with new limbs and painfully lifting away the general's faceplate in order to place a new one on."}, {"tag": "p", "text": "After completing Grievous's repairs, EV-A4-D followed the general back to the control room, informed Grievous of an incoming transmission from Dooku, at which point Grievous learned of Dooku's deception. This, coupled with the Jedi's defeat of Gor, spurned Grievous into hunting down the Jedi himself, despite EV-A4-D's insistence that he take time to rest. While Grievous left to combat Vebb and Fisto, EV-A4-D remained within the control room to monitor the castle's security cameras. Upon catching sight of the Jedi attempting to enter the control room, EV-A4-D alerted Grievous via the stronghold's speaker system."}, {"tag": "p", "text": "Fisto opened the entrance to the control room, but Vebb insisted upon remaining outside to confront Grievous. While the two Jedi argued about their course of action, EV-A4-D resealed the entry to the control room, locking Fisto within and leaving Vebb outside to engage Grievous on his own. EV-A4-D gleefully watched Grievous gain the upper hand in his duel with Vebb and encouraged the general to kill the Jedi. However, the droid forgot about Fisto, realizing too late that he was now locked in the control room with the Jedi. Fisto approached EV-A4-D from behind and destroyed the droid by decapitating him through the control room chair with his lightsaber. Shortly after EV-A4-D's destruction, Grievous killed Vebb, but Fisto was able to escape."}, {"tag": "h4", "text": "Rebuilt"}, {"tag": "p", "text": "Following the Jedi's escape, Grievous found EV-A4-D's destroyed body and had the droid reconstructed. Once repaired, EV-A4-D left Vassek's moon with his master, no longer relegated solely to housekeeping and repair work. In addition to his position as Grievous's doctor, the droid became an advisor to the cyborg, and accompanied him during his time away from the Vassek castle. EV-A4-D was present during Grievous's attack on the Kel Dor homeworld of Dorin in the Expansion Region, during which the cyborg general attempted to exterminate the native population. In the latter stage of Grievous's initial assault, EV-A4-D informed the general of an incoming transmission from Asajj Ventress, a Confederate commander and Dark Acolyte apprentice of Count Dooku's. Although Grievous was unwilling to accept the communication, EV-A4-D convinced him to listen to Ventress, who was relaying a message from Dooku himself. Ventress warned the general of a Republic fleet that had departed Coruscant and was headed to reinforce the natives of Dorin and explained that the fleet was under the command of Jedi General Anakin Skywalker, who could easily turn the tide of battle. Grievous was undeterred by the information, and ordered EV-A4-D to begin preparations for the arrival of the Republic fleet."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Similar to other EV-series supervisor droids from MerenData, EV-A4-D displayed a cruel personality. While successful in increasing the productivity and efficiency of the medical droids working on Tauber, EV-A4-D's practices concerned the organic doctors he worked with. His methods eventually led to his dismissal when he ordered the medical droids to refuse painkillers to the hospital's patients, causing needless pain for the individuals that the hospital meant to help."}, {"tag": "p", "text": "With the transfer to Grievous's Vassek castle, EV-A4-D's high-level abilities as a supervisor and taskmaster went unused, as his responsibilities were limited to housekeeping and the management of a small force of MagnaGuards. EV-A4-D grew bored with his work and wished for excitement—a wish that was granted with the arrival of Fisto and Vebb. Although normally highly attentive, EV-A4-D became careless during the intrusion, losing track of Fisto and realizing only too late that the Jedi was directly behind him, prepared to strike."}, {"tag": "p", "text": "During his service to Grievous as the cyborg general's personal doctor, EV-A4-D developed an uncommon relationship with his patient. Although normally unwilling to tolerate insolence or disrespect, Grievous endured the droid's criticism of his abilities and demands during repairs. Although A4-D worked diligently to ensure quality repairs, the droid enjoyed the opportunity to inflict pain upon the Kaleesh during his reconstructive surgeries. EV-A4-D was curious of the reasons behind Grievous's physical transformation and took care in ensuring his work on the mechanical body would not go to waste, insisting that Grievous take time to rest after his repairs. The droid was delighted at Grievous's prowess during his duel with Vebb, cheering him on moments before he was bisected by Fisto's attack."}, {"tag": "p", "text": "While most of EV-A4-D's bronze-colored body resembled that of other EV-series droids, EV-A4-D possessed modifications that allowed him to serve as Grievous's doctor. A small attachment that hung over one of EV-A4-D's white photoreceptors housed his logic center. Several arms that were attached to his torso and back had medical instruments affixed to the ends, while one of EV-A4-D's primary upper limbs was affixed with a \"carousel arm\" that allowed for rotation at the wrist between a surgical laser and a precision gripper. Circulatory fluid used during surgical operations hung from a limb extending from the droid's back. EV-A4-D also had a supply palette attached to his waist and magnetized feet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "EV-A4-D was created for the Star Wars: The Clone Wars television series. To date, the droid's only appearance was in the episode \"Lair of Grievous;\" however, at the time of the episode's original air date, EV-A4-D was known simply as \"A4-D.\" The droid's full name was not revealed until the episode's Decoded re-airing, which also introduced EV-A4-D's backstory as a hospital supervisor. His backstory was later expanded in his StarWars.com Databank entry."}, {"tag": "p", "text": "The droid was created when Series Director Dave Filoni expressed his interest in having Matthew Wood, the voice of General Grievous, and sound designer David Acord perform in a scene together. The episode's writers decided to have Acord play Grievous's mouthy doctor droid. Wood, Filoni, and Acord brainstormed together on what the droid would sound like, hoping to find a speech pattern as far from Grievous's as possible. Acord eventually settled on the distinctive speaking style of the late Paul Lynde."}, {"tag": "p", "text": "In the Star Wars: The Clone Wars The Complete Season One DVD featurette for \"Lair of Grievous\", Filoni expresses his regret for killing off EV-A4-D at the end of the episode. The director indicates that he would be interested in bringing back the droid as a disembodied head carried around by Grievous in future episodes of the series. EV-A4-D did eventually make a return to the series, albeit not in an episode, but rather a script presented at the Star Wars Fan Days III convention that served as a prelude to the second season episode, \"Landing at Point Rain\"."}, {"tag": "h3", "text": "Inconsistencies and non-canon material"}, {"tag": "p", "text": "In the Season One Episode Guide included in Star Wars Insider 106, EV-A4-D is incorrectly labeled as astromech droid R6-H5. The Galaxy at War sourcebook from Wizards of the Coast contradicts the \"Lair of Grievous\" decoded episode by stating that the droid is named A-4D and is an A-Series medical droid. The Star Wars: The Clone Wars Character Encyclopedia refers to the droid by his abbreviated name used in the original episode, A4-D."}, {"tag": "p", "text": "EV-A4-D is featured in The Clone Wars Animated Comics, a series of short, non-canon videos based on LEGO products. In Episode 4: A Grievous situation, A4-D accompanies General Grievous to Tatooine, where the cyborg was shot down during a dogfight over the planet by Jedi Master Plo Koon. While the general sunbathed in the desert's twin suns, EV-A4-D worked to reattach the limbs his master lost in the crash. The droid was unable to do so before the arrival of Republic forces, resulting in Grievous's arms falling off his body when he attempted to duel Nahdar Vebb. Grievous carries EV-A4-D off-screen, where the droid quickly finishes his repairs so that the general can return to his duel. Grievous is forced to retreat when Koon arrives to provide support to Vebb, but leaves EV-A4-D behind with the Republic forces. This video is available on the LEGO Star Wars website, and features the option to view the story from either the Republic or Confederate perspective."}, {"tag": "p", "text": "EV-A4-D also appears in the non-canon video game LEGO Star Wars III: The Clone Wars, released on March 22, 2011. A4-D appears in the game's adaptation of \"Lair of Grievous,\" wherein his role as Grievous' repair droid is humorously portrayed, as A4-D forces the droid General to take a spoonful of medicine. After the completion of this mission in the Nintendo DS version, A4-D is also unlocked for use in the Free Play mode of the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}