{"url": "EV-series_supervisor_droid/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:EV-series supervisor droids", "Category:Supervisor droid models", "Category:Torture droid models"], "nodes": [{"tag": "h1", "text": "EV-series supervisor droid"}, {"tag": "p", "text": "The EV-series supervisor droid was a model of supervisor droid manufactured by MerenData. Originally designed to be an efficient taskmaster for automated labor pools, the series suffered from a number of unfortunate \"glitches\" and was one of the largest corporate disasters in history."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The EV-series was a model of supervisor droid with a rod-thin build and a grating mechanical voice. Bronze-colored droids with polished plastron plating, they were equipped with a heuristic processor and an advanced personality matrix. In addition to Basic and binary, a new EV could speak 3 unassigned languages. Their heads featured an auditory receptor, a broadband broadcast antenna/receiver system, its logic center, a pair of golden Human-range photoreceptors, and a speech mimic flap synchronized with its vocabulator. An EV also had an internal high-frequency binary comlink and its cervical servomotor was located in its chest. Their power axis contained a recharge coupling access port and was attached to the droid's pelvic mount, which could lock into legs or a motorized cart. When equipped with legs, they stood 1.9 meters tall. They also had a pair of manipulator arms tipped with hand appendages."}, {"tag": "p", "text": "During production, the standard EV motivator originally planned for the EV was accidentally swapped with the MDF motivator, a contraband piece of hardware designed for use in torture droids. While the droids with the swapped motivators actually outperformed the unaltered droids when it came to managing the droids under their care and worker motivation, they used sadistic methods to accomplish their tasks."}, {"tag": "p", "text": "EV-series supervisor droids could be modified to perform different functions. Many military units swore by the use of an EV unit as a quartermaster for supplies thanks to its meticulous skill at keeping supplies protected and in good working condition. This relativity simple modification process was started by installing a video recorder the droid could use to keep a visual catalog of supplies and to track missing items. A power charger was then installed in the droid's torso so it could keep power packs fully charged. Finally, the EV was given a datapad with access to the military unit's inventory."}, {"tag": "p", "text": "They could also be used as technicians. Although this modification may have seemed unlikely for a supervisor droid, EV units had a working knowledge of how machines functioned and could be quite adept at fixing them. This modification emphasized the droid's ability to make repairs and adjustments to machines and other droids or cybernetic beings. It included removing the EV unit's internal comlink and, in its place, installing a diagnostics package to help it find and fix problems. It also entailed equipping the droid with a tool kit and a roll of mesh tape for emergency repairs. Optionally, one of the EV unit's hand appendages could be swapped out for a tool appendage with a multifunction apparatus, giving it the ability to connect up to three tools needed to perform a particular job. Finally, a targeting scope was added to the droid's head and calibrated, which required 15 minutes of work."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Whether through negligence or sabotage, an employee substituted a case of MDF motivators intended for use in torture droids for the standard EV motivator during the production of the EV-series supervisor droid. Only noticing the error after several shipments of the faulty droids, hundreds of individual units, had already gone out, MerenData chose not to take immediate action, as torture droids were highly illegal and the company was not supposed to have access to MDF motivators in the first place."}, {"tag": "p", "text": "For the first few months following the EV's release to market, MerenData instead adopted a wait-and-see approach to see how the droids performed. Various industry surveys indicated that MDF-equipped EV units were actually outperforming those equipped with the intended motivators when it came to worker motivation. However, when complaints began arriving at the company's offices regarding the sadistic methods they used to accomplish their tasks, it was exposed that MerenData was building illegal droids for the House of Tagge. Despite blaming the mix-up on industrial sabotage, MerenData had a public relations nightmare on its hands. Faced with a massive lawsuit, MerenData was forced to recall the model to exchange motivators. While most of the droids were returned to the company and repaired, some customers preferred the flawed model, leading MerenData to begin offering incentives for returns and reports on the whereabouts of other EV units."}, {"tag": "p", "text": "Following the recall, MerenData introduced several replacement models, including the second-generation EV-II, which compensated for the personality flaws of its predecessor, and the V-series droid supervisor, a relaunch of the EV-series marketed towards the Imperial Military. Ironically, without the infamous MDF motivators of the first-generation EVs, both models were considered unimpressive performers. Both lines were financial failures, forcing MerenData to close thousands of branch offices from the the galaxy's Core Worlds to the Outer Rim Territories."}, {"tag": "p", "text": "Ploovo Two-For-One employed an original EV series droid, as did crime lord Jabba the Hutt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Unlike most sources, which identify the EV-series supervisor/interrogator droid as a third-degree droid, the Arms & Equipment Guide labels it a fourth-degree droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}