{"url": "EXD-9", "categories": ["Category:Canon articles", "Category:Droids of the Galactic Empire", "Category:Masculine programming", "Category:Probe droids"], "nodes": [{"tag": "h1", "text": "EXD-9"}, {"tag": "p", "text": "EXD-9 was an E-XD-series infiltrator droid with masculine programming, who served the Galactic Empire as a recon droid. Disguised as an RQ protocol droid, EXD-9 was capable of morphing for combat and was armed with built-in blasters. Around two years before the Battle of Yavin, the droid was assigned to probe the planet Atollon—location of the Phoenix Cell's Chopper Base—for any rebel activity. Lasat rebel soldier Garazeb Orrelios and C1-series astromech droid Chopper found EXD-9 damaged by the krykna spiders in the Atollon wilderness and brought him to their base. Initially forgetting his mission, the recon droid eventually attacked them and RA-7 protocol droid AP-5. The rebels managed to deactivate the droid and sent him back to the Empire after reprogramming him to self-destruct."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mission to Chopper Base"}, {"tag": "p", "text": "EXD-9 was an E-XD-series infiltrator droid that was commissioned by Grand Admiral Thrawn as part of a campaign in 2 BBY to hunt down rebel bases in the Outer Rim Territories. Against Imperial mandate, the Infiltrator Droids were fitted with a proton warhead that would self-destruct in the event that the unit was captured. After being deployed by an Imperial Star Destroyer, EXD-9 traveled in a pod which ended up on the planet Atollon. He landed near the Atollon Coral Mesa, which hosted the Phoenix Cell's Chopper Base."}, {"tag": "p", "text": "Shortly after landing, EXD-9 observed a rebel ship taking off from the coral mesa. Before he could investigate, he was attacked by two spidery krykna. EXD-9 managed to kill the spiders but was knocked out. Later that evening, EXD-9 was discovered by the rebels Garazeb Orrelios and the astromech droid Chopper. Taking pity on the stray \"protocol droid,\" Zeb carried him back to the base. He then got the RA-7 protocol droid AP-5 to charge EXD-9 up. EXD-9 quickly revived and proceeded to scan the surrounding munitions depot, Zeb, and even Chopper. Believing that EXD-9 would be useful, AP-5 hired him as his assistant inventory keeper."}, {"tag": "p", "text": "Meanwhile, Zeb received a warning from the rebel agent Fulcrum that the Empire had dispatched Imperial Infiltrator Droids to search for rebel bases. Fulcrum also warned Zeb that one of the droids had lost contact with the Empire and that they would come looking for the droid after the next cycle. Zeb quickly realized that EXD-9 was an Imperial infiltrator. Zeb returned to the depot to warn EXD-9 just as the Infiltrator Droid heard AP-5 mention the word \"rebel base.\" Remembering his programming, EXD-9 identified the three rebels as threats and assumed his attack mode."}, {"tag": "h3", "text": "Reprogramming and demise"}, {"tag": "p", "text": "Leaping onto a raised platform, EXD-9 used it to jump onto Zeb and proceeded to pound the Lasat. Chopper tried to electrocute him, but EXD-9 hurled him against several crates. Following a struggle, Zeb managed to shoot off his left hand, causing EXD-9 to leak a fluid. Damaged, EXD-9 fled into the depot to recuperate. He stumbled upon another astromech droid and proceeded to disable and cannibalize it, draining its fuel and stealing its parts to rebuild his left hand. Still low on power, EXD-9 then cannibalized a GNK-series power droid."}, {"tag": "p", "text": "Meanwhile, the rebels devised a plan to lure EXD-9 out of hiding so that they could disable him. Chopper managed to lure EXD-9 out of hiding. Zeb jumped onto the Infiltrator Droid from the raised platform and fought with him. EXD-9 managed to use his mechanized body and reflexes to assault Zeb. However, the Lasat managed to pin him down long enough for AP-5 to deactivate him. Though EXD-9 was disabled, this activated his countdown continuum. Chopper managed to freeze EXD-9's countdown circuits before the droid could detonate his proton warhead. Following some discussion, the rebels decided to reprogram EXD-9 as a rigged bomb to destroy his Imperial base."}, {"tag": "p", "text": "AP-5 managed to reset EXD-9 to his protocol mode and reprogrammed his countdown mechanism to detonate upon logging into the Imperial network. After being revived, EXD-9 returned to his pod with the rebels trailing him. EXD-9 tried to contact his Imperial masters with a long-range transmitter but Zeb shot it out with his bo-rifle. Following his programming, EXD-9 returned to his Star Destroyer, where he was examined by two Imperial Navy technicians. The droid then activated his proton warhead and destroyed the Star Destroyer and several other Infiltrator units."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "EXD-9's destruction led to the destruction of one Star Destroyer and several other E-XD units. The rebels' ingenious plan earned the praise of Fulcrum, who was actually the disillusioned Imperial Security Bureau Agent Kallus. However, Thrawn was able to narrow down the search for the Phoenix rebel base to 94 systems."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As an Imperial droid, EXD-9 was programmed without any personality. His Imperial masters regarded him and his fellow Imperial Infiltrator Droids as tools used to achieve the Galactic Empire's goals and aims. EXD-9 was built into the chassis of a protocol droid but was fitted with numerous weapons including concealed blasters in his hands. EXD-9 was also capable of elevating his height when in attack mode. In protocol mode, EXD-9 had white sensors. When in attack mode, his sensors turned red."}, {"tag": "p", "text": "EXD-9's sensors could scan and categorize various objects and beings. He was able to decipher words and phrases which he could use to identify the presence of rebels and their bases. EXD-9 was capable of leaping to great heights, and his metallic body was capable of deflecting blaster bolts and electric blasts. EXD-9 could withstand considerable damage in combat and was resourceful enough to cannibalize other droids. EXD-9 could also fly a pod and knew how to operate a transmitter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "EXD-9, who was voiced by David Acord, first appeared in \"Warhead,\" the twelfth episode of the third season of Star Wars Rebels, which aired on January 14 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}