{"url": "EXP-7(a)_Predator", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Blaster rifles"], "nodes": [{"tag": "h1", "text": "EXP-7(a) Predator"}, {"tag": "p", "text": "The EXP-7(a) Predator was an experimental but powerful hunting blaster rifle manufactured by Exotac Arms during the Galactic Civil War. A large and bulky rifle, the hunter Kaori Batta owned one of the three existing EXP-7(a) models, and later used it to kill a modrol, a large predatory creature, on the planet Neftali."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The EXP-7(a) Predator hunting blaster rifle was large and cumbersome, but it was also extremely powerful and accurate. The blaster rifle had a dual-laser targeting system and had to be carried strapped to the owner's back when not in use. The EXP-7(a) had a maximum firing range of 350 meters, was very loud when fired, and had a significant recoil. The rifle used a power pack that gave it a capacity of eight shots and cost 7,000 new. Its ownership was highly restricted by law to specially authorized individuals."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The EXP-7(a) Predator was a prototype blaster rifle created by Exotac Arms during the Galactic Civil War. Only three were ever made, one of which was given to the Human big game hunter Kaori Batta to field test on the planet Neftali. The other two models were kept at the Exotac labs."}, {"tag": "p", "text": "During a hunting expedition that started at Exovar's Emporium on Neftali, Batta used the rifle to bring down an ice modrol, a large predatory creature that had killed the nobleman Ghecharo and had nearly killed Ghecharo's adjutant, Kleck."}, {"tag": "p", "text": "Batta gave a demonstration of the rifle's power to some tourists on Neftali. The blast went through the target, a tree behind the target, and damaged a rock behind the tree. A smuggler named Dykara witnessed the demonstration and asked Batta if they could acquire a copy of the blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The EXP-7(a) Predator was first mentioned in the sourcebook Wretched Hives of Scum & Villainy, published by West End Games in January 1997."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}