{"url": "Ebab", "categories": ["Category:Legends articles", "Category:Ewoks", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ebab"}, {"tag": "p", "text": "Ebab was an Ewok male who lived on the Forest Moon of Endor. In 3 ABY, he was tasked with guarding an Ewok artifact known as the bridge crystal, but he fell asleep on the job, and the crystal was stolen. The next day, we ran over to Chief Chirpa in order to inform him of the proceedings and apologize for his allowing the crystal to be unguarded."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ebab was an old Ewok male member of an Ewok tribe in Bright Tree Village on the Forest Moon of Endor. In 3 ABY, Ebab was tasked with guarding the bridge crystal, a powerful artifact that could be used to produce the Rainbow Bridge that was stored in the Council Hut. One night, the young Ewok scouts Wicket Warrick and Teebo attempted to steal the crystal in order to use it to find a cure for their ailing friend, Kneesaa a Jari Kintaka. The pair entered the hut through a trapdoor in the roof to find Ebab snoring in his sleep, mumbling about how no one was permitted to enter during his guarding. Warrick and Teebo successfully retrieved the crystal and left the hut, with Teebo taking a piece of fruit for their upcoming journey."}, {"tag": "p", "text": "The next morning, Ebab rushed to the home of Chief Chirpa in order to alert him about the theft of the crystal. He prefaced the warning by asking Chirpa for forgiveness for his blunder, explaining that he had dozed off. Chirpa asked him to speak up, and Ebab stammered that the rainbow crystal had been stolen, which shocked the chief Ewok."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ebab was old by 3 ABY and fell asleep when he was required to guard the bridge crystal. Once he realized what h had done, he asked for Chirpa's forgiveness. Ebab had gray fur and black eyes. He also sported a white mustache."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ebab wore green clothing and utilized a spear."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ebab appeared in the first issue of the Ewoks comic series, which was written by David Manak, illustrated by Warren Kremer, and published on January 29, 1985. In one frame of the comic, Ebab is mistakenly drawn with brown fur."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}