{"url": "Ebenn_Q3_Baobab", "categories": ["Category:Canon articles", "Category:Ambassadors", "Category:Authors", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ebenn Q3 Baobab"}, {"tag": "p", "text": "Ebenn Q3 Baobab was a human male author and linguist who wrote the Easy Ubese Phrase Book. He served as a dignitary for the Royal House of Naboo. In 32 BBY, he was part of a group who stood with Queen Padmé Amidala of the planet Naboo to greet the passengers of the CSS-1 Corellian Star Shuttle Perpetuus when it landed in the city of Theed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ebenn Q3 Baobab was a human male dignitary of the Royal House of Naboo. He worked as a linguist and studied the languages of living and long-extinct species, authoring the Easy Ubese Phrase Book. Following the defeat of the Trade Federation during the Battle of Naboo in 32 BBY Baobab was amongst a group who stood with Queen Padmé Amidala of the planet Naboo in the world's capital city, Theed, in order to greet the passengers of the CSS-1 Corellian Star Shuttle Perpetuus. Once the shuttle landed, Amidala gave some parting words to the captured leaders of the Federation, Viceroy Nute Gunray and Settlement Officer Rune Haako, before they were escorted away to the shuttle."}, {"tag": "p", "text": "The queen then greeted Supreme Chancellor Sheev Palpatine, who had traveled from Coruscant with the Jedi High Council. Amidala's daughter, Princess Leia Organa, later requested a copy of Baobab's book from Alliance Intelligence as part of her preparation for a mission to rescue the smuggler Han Solo while disguised as the Ubese bounty hunter Boushh in 4 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Baobab had light skin, brown eyes, and graying brown hair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "He wore a black and gold outfit and a crimson and gold hat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ebenn Q3 Baobab was portrayed in a cameo appearance by sound designer Ben Burtt in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. The scene was filmed during planned pickup shots at Leavesden Studios in 1998. In the new Star Wars canon, the character's name was used in the 2017 reference book Star Wars: The Rebel Files, which was written by Daniel Wallace, but it originated in the Star Wars Legends continuity, where Burtt created it himself for his 2001 reference book Galactic Phrase Book & Travel Guide. Burtt used the name Baobab to link his cameo to the character Mungo Baobab from the Star Wars: Droids: The Adventures of R2-D2 and C-3PO television show."}, {"tag": "p", "text": "In Ultimate Star Wars, New Edition, author Adam Bray named the model of airbrushes used by Sabine Wren in the Star Wars Rebels television show as the Baobab EZ3 Airbrush after Ebenn Q3 Baobab, intending to suggest that \"EZ3\" was a descendant of \"EQ3\" Baobab."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}