{"url": "Ebrihim", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Drall", "Category:Educators", "Category:Males", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Ebrihim"}, {"tag": "p", "text": "Ebrihim was a male Drall just entering middle age, the nephew of Duchess Marcha. He was somewhat tall for his species and had deep gray fur with hints of light gray around his face and throat, signifying his age."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ebrihim was direct and plainspoken, even undiplomatic at times. Although dour and serious by Human standards, Ebrihim was considered adventurous and flighty by his fellow Drall. He preferred a life of planet-hopping and scholarship. His interests, however, spanned the sciences, history, mysticism, and literature. He was something of a dilettante."}, {"tag": "p", "text": "When the Solo family arrived on Corellia for a New Republic trade summit, Ebrihim was hired as a tutor for the Solo children. Leia Organa Solo sought a non-Human tutor who could expose them to an alien viewpoint, and, as Ebrihim himself noted, he was the same height as the children and not likely to intimidate them unless he wished to. Ebrihim also served as guide to the Solo family and Chewbacca and took them on an archaeological tour."}, {"tag": "p", "text": "At the onset of the First Corellian Insurrection, Ebrihim was looking after the Solo children at Corona House when the building was targeted by agents of the Human League. Bombs rocked the structure, destroying many of the lower floors. Han Solo escaped with NRI agent Belindi Kalenda, while Leia was trapped with Governor-General Micamberlecto. The children were on the upper floors and were forced to retreat to the Millennium Falcon with Ebrihim and Chewbacca, leaving their parents behind. On Ebrihim's advice, the Falcon fled to his aunt's home on Drall. There the children remained for their safety."}, {"tag": "p", "text": "Ebrihim's life of study and adventure precluded settling down and raising a family, which was very unusual for a Drall. His Aunt Marcha theorized that his affection for the children he tutored was a kind of substitute for the children he would never have. When Marcha became governor-general of the Corellian sector, he became her aide."}, {"tag": "p", "text": "He owned the eccentric droid Q9-X2, who was obsessed with making modifications and enhancements to himself. Ebrihim tried his best to teach Q9 manners and etiquette, but the droid still tended to butt into conversations and make carelessly blunt comments."}, {"tag": "p", "text": "Ebrihim had a somewhat practical view of the Force for a non-Force sensitive, regarding it as actually there and expressing a belief in it, but not troubling himself over it. To him, the Force was something that was inaccessible and as a result made him view it as something to simply not take seriously."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}