{"url": "Ebranite", "categories": ["Category:Legends articles", "Category:Ebranites", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Ebranite"}, {"tag": "p", "text": "Ebranites were the native people of the planet Ebra in the Dousc system. They were adapted to life in Ebra's systems of caves and canyons. Ebranites had six arms, with two opposable thumbs on each six-digit hand. Their feet were also adapted for climbing, with three large clawed toes and a thumb-like appendage on their heels. Their arms and legs allowed them to climb quickly, but they walked slowly on level ground. Their thick reddish-brown skin was mottled with red, white or black patches as camouflage against rocks. They also had excellent vision, and could see in infrared."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Ebranite social structures were based on family and clan units. Males were generally dominant, though mothers were respected more than any other Ebranites. Children had very little freedom. Clans, or thildas, were made up of twenty to thirty nuclear families living in the same area. Every Ebranite had their clan insignia tattooed on their uppermost left shoulder at birth. Every four local seasons (about three and a half standard years), a clan leadership council, or ghantar would be elected. The ghantar would elect a leader, or fyaban, from their own number. In early Ebranite history, clans often warred with one another, though only a few thildas continued their feuding ways by the Imperial era. The Rull was among these feuding clans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Galactic Empire, desiring Ebra's lu-ramin supplies, supplanted the traditional Ebranite leadership. Governor Evitch Jenton banished any Ebranites suspected of anti-Imperial beliefs to the lu-ramin mines of Grythsorin. In addition to political repression, their traditional trade with the Carosites was cut off. In response, many Ebranites joined the Alliance to Restore the Republic, including renowned Rebel operative Rith Tar'ak."}, {"tag": "p", "text": "While fighting the Empire, Ebranites were hampered by their comparatively primitive weaponry, limited to bows, slings, and melee weapons. (Before the Imperial takeover, their only sophisticated technology was their hydrothermal works.) Most Ebranites distrusted sophisticated technology, which they associated with the Empire. Ebranites made up for this shortcoming with their fierceness. When Ebranites felt endangered, they went into a \"combat rage\" similar to that of the Wookiees, but not as uncontrollable."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}