{"url": "Ebra", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Galactic Empire planets", "Category:Kesh sector", "Category:Mid Rim planets", "Category:New Republic planets", "Category:New Territories planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Ebra"}, {"tag": "p", "text": "Ebra, also referred to as Ebran, was a planet located in the Mid Rim's Kesh sector. Its surface was mountainous and featured caverns and large canyons such as the Grythsorin. Ebra was the homeworld of the Ebranites, six-armed humanoids who were well adapted for their environment. A relatively primitive, clan-based species, the Ebranites exported the valuable oil lu-ramin off-world."}, {"tag": "p", "text": "The Galactic Empire subjugated Ebra, enslaving the Ebranites and forcing them to harvest lu-ramin. After the Ebranite sisters Rith Tar'ak, Nyik, and Tor'ara escaped Ebra and joined the Rebel Alliance, hundreds of Ebranites became members of the Alliance in order to fight the Empire on Ebra. By 12 ABY, Ebra was a part of the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ebra, also known as Ebran, was a rocky planet in the Dousc system, a part of the Kesh sector in the New Territories portion of the Mid Rim. The planet occupied the second orbital position in its star system. Four of the local seasons on Ebra were equivalent to three and a half standard years."}, {"tag": "p", "text": "Ebra's surface was covered in harsh and towering—and seemingly endless—mountains which were separated by very large canyons. Networks of caverns were also located on Ebra. In the caves, supplies of pure water supported an abundant population of fungi and casanvines. The hag'thyyr was a reptilian predator native to Ebra."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ebra and the Republic"}, {"tag": "p", "text": "In 3638 BBY, a local stimulant merchant was charging high prices for medicine to veterans located on Ebra. An individual affiliated with one of the sides in the ongoing struggle between the Galactic Republic and the reconstituted Sith Empire sent a companion to Ebra, where the trader was subsequently persuaded to slightly lower his prices."}, {"tag": "p", "text": "Millennia before the Galactic Civil War, the society of the native Ebranites was plagued with clan warfare. Over time, however, the Ebranite clans adopted a peaceful and cooperative outlook, except for several clans, such as the Rull and the Jih-tan, which retained their warrior way of life. The Galactic Republic mostly did not interact with the Ebranites. However, the natives did trade with the Carosites, a species from the Carosus system in the Outer Rim Territories, and exported the valuable lu-ramin oil, which was the primary component of the beverage known as Ebran Lu-ramin Oilmead."}, {"tag": "h3", "text": "Ebra and the Empire"}, {"tag": "p", "text": "During its early reign, the Galactic Empire subjugated Ebra. The Imperial governor Evitch Jenton assumed control over the planet and quickly instituted martial law. The Imperial government outlawed the Ebranite trade with the Carosites and restricted the lu-ramin export to numerous agricultural companies and cultures affiliated with the Empire. Jenton also approved the enslavement of Ebranites, and elements of the populace suspected of sedition or rebellious intentions were exiled to work in lu-ramin mines."}, {"tag": "p", "text": "At some point during the occupation of Ebra, the Rull clan of Ebranites carried out an assault on an Imperial facility on the planet. The superior Imperial forces slaughtered the attackers. The handful of Ebranite survivors of the raid, including Rith Tar'ak and her sisters Nyik and Tor'ara, were taken prisoner and forced to harvest lu-ramin in the nearby caves."}, {"tag": "h3", "text": "Ebra and the Rebellion"}, {"tag": "p", "text": "Soon after their enslavement, Tar'ak led her sisters in a daring escape. The Ebranites captured an Imperial pilot and forced him to transport them off Ebra. In a nearby system, the group was captured by a Rebel Alliance starship. The Ebranite sisters joined the Alliance, eventually becoming a part of the elite Rebel unit known as the Scandium Team. At some point, Ebra was mentioned in a personal addendum by Rebel General Airen Cracken on a datapage of the Cracken's Rebel Field Guide detailing the repulsorlift-augmented R-444 Imperial Sky Swooper para-wing glider."}, {"tag": "p", "text": "In 2 ABY, a group of individuals affiliated with the Rebel Alliance visited Ebra. While in the planet's canyons, the group was engaged in a high-speed repulsorcraft chase with Imperial scout troopers."}, {"tag": "p", "text": "Following her sisters' deaths in the line of duty, Rith Tar'ak eventually became one of the two Rebel agents tasked with recruiting and training the natives of Ebra. Eventually, hundreds of Ebranites joined the Rebellion in order to remove the Imperial presence from Ebra. A small percentage of the Ebranite population began to explore the wider galaxy between 0 BBY and 5 ABY. By 12 ABY, Ebra fell within the borders of the New Republic."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "h3", "text": "Ebranites and Imperials"}, {"tag": "p", "text": "Ebra was the homeworld of the Ebranites, a species of sentient, six-armed omnivorous humanoids. Adapted to their rocky home planet, the Ebranites were skilled climbers and hunted for food using clubs, bows, and slings. The primitive Ebranites organized themselves in clans named \"thildas\" and spoke the Ebranese language, and they were confined to their homeworld in the time leading up to 0 BBY. An exception to the technologically simplistic nature of the Ebranites was the hydro-thermal technology they utilized on Ebra."}, {"tag": "p", "text": "The Imperial outpost on Ebra imported food and water in large quantities, and in return, the profitable planet exported lu-ramin as well as low-grade ores. The Imperial forces used R-444 Imperial Sky Swooper para-wing gliders for carrying out patrols in Ebra's canyons."}, {"tag": "h3", "text": "A droid for Ebra"}, {"tag": "p", "text": "In order to facilitate the relations between the Empire and the Ebranites, the tech units that constituted a part of the Imperial occupation force on Ebra designed the 5DS Ebranite Relations Droid by modifying the Cybot Galactica 3PO-series protocol droid. However, the Empire did not realize that the creation of the new droid actually served to further deepen the divide between the occupation forces and the Ebranites."}, {"tag": "p", "text": "The Ebranite Rebel agent Rith Tar'ak captured and re-programmed the first 5DS droid produced, A-5DS. She proceeded to use the droid as a contact among the Ebranite settlements among the Grythsorin canyon. As a result of her species' distrust of high technology, Tar'ak was not fully confident in A-5DS and only used it when she was unable to visit Ebra in person."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Ebranite settlements, known as clan warrens, were formed around small wells deep in the caves of Ebra's canyons, including the largest canyon, the Grythsorin. During its occupation of Ebra, the Galactic Empire established an outpost on the planet and operated lu-ramin mines in Grythsorin. In addition, an Imperial facility was located near a set of Ebra caverns where a local strain of lu-ramin was grown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ebra was first mentioned in the 1991 sourcebook Cracken's Rebel Field Guide, which was written by Christopher Kubasik for West End Games' Star Wars: The Roleplaying Game. In the 1995 sourcebook Alliance Intelligence Reports, an adventure seed partially set on Ebra was included for use with the West End Games' roleplaying game system. This article assumes the scenario plays out as described. The 2009 reference book The Essential Atlas placed the Dousc system, and therefore Ebra, in grid square L-6."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}