{"url": "Ecclessis_Figg/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Businesspeople", "Category:Corellians", "Category:Humans", "Category:Males", "Category:Nobility", "Category:Space explorers"], "nodes": [{"tag": "h1", "text": "Ecclessis Figg"}, {"tag": "p", "text": "Ecclessis Figg was an eccentric Human explorer and entrepreneur who founded Cloud City and propelled himself into vast fortune with the creation of a business empire. After leaving his homeworld of Corellia at eighteen, Figg spent his next years taking jobs and participating in adventures along the Corellian Trade Spine. After he saved the life of a woman named Yarith, a lesser noble of the Royal House of Alderaan, Figg courted and married her. Yarith opened her fortunes to him, giving him the capital he needed to found the Outer Javin Company."}, {"tag": "p", "text": "Figg's company sponsored a number of expeditions along the Trade Spine, the businessman and his wife participating in many of them, and Figg's eventual charting of new hyperspace routes through the Twin Nebulae made him an extremely wealthy man.[source?] He was the first to successfully map a safe route to the Anoat system. Eventually, he turned to the seemingly unremarkable gas giant Bespin, on which years ago he had discovered vast amounts of easily accessible Tibanna gas, a hyperdrive coolant. When Figg found that Bespin's Tibanna was naturally suited for the ammunition of blasters, he expanded his operation into the airborne colony Floating Home. With the help of Ugnaughts, who he freed from slavery in exchange for constructing the colony, Figg had his new facility built. He saw the potential in Bespin's natural scenery for tourism and expanded the colony even further, turning it into the floating metropolis of Cloud City, a site of luxury, entertainment, and gambling."}, {"tag": "p", "text": "Figg lived long enough to preside over the formation of the Anoat sector, and after making pronouncements on the future of Cloud City's government from his deathbed, the entrepreneur died. His children survived him, continuing the Figg name and propagating the fortune and influence the man had built up. Figg himself remained a legendary figure in the region, especially among the Ugnaughts."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The entrepreneur"}, {"tag": "p", "text": "Ecclessis Figg was born to a pair of commoners of Corellia around the fifth century BBY. Artistic in nature, Figg's parents raised him in an environment that encouraged creativity. Figg picked up the personal flair of his parents, causing him to be perceived by the upper classes of Corellia as impertinent, but he also developed a keen business sense that topped any in his family. At eighteen, Figg smuggled himself aboard a freighter to participate in adventures that would earn him money. Over the next few years, the young man made contacts all along the Corellian Trade Spine, impressing many with his charisma and daring. Figg dreamed of founding a surveying and trading company to open up systems along the Trade Spine. It was in the course of his travels that Figg inspected the seemingly unremarkable gas giant of Bespin and discovered an abundance of Tibanna gas, a common hyperdrive coolant, and easily accessible on this world.[source?]"}, {"tag": "p", "text": "Further investigations, conducted in secret, revealed a number of other useful gaseous compounds in Bespin's atmosphere. However, Figg knew he needed capital to take advantage of this opportunity. He eventually took a position as steward on a luxury liner, and it was in this job that he saved the life of Yarith, a lesser noble of the Royal House of Alderaan. Figg courted Yarith for a brief period before they were married, and his new wife, understanding Figg's ambitions, opened her private fortune to him to start his new Outer Javin Company. Lord Figg had now also become part of the Alderaanian Royal Family."}, {"tag": "p", "text": "Figg took up residence on Gerrenthum, basing his missions from that world. His initial goal was to scout the systems off the Trade Spine and discover what potential they had in the way of resources, commerce, and colonization. He and Yarith accompanied a number of his expeditions to these worlds, and eventually he began to invest in several small colonies to collect resources on worlds thought inaccessible. On worlds with dangers ranging from poisonous atmospheres to hostile native life, Figg built numerous operations that not only proved themselves to be safe, but turned a profit. He was the first to map a safe hyperspace route into the Anoat system. When missions into the area known as the Twin Nebulae opened up hyperspace shortcuts to the worlds of Lutrillia and Nothoiin, the economic boom it triggered made Figg quite wealthy and turned the Twin Nebulae into an economic powerhouse. Not wanting to attract undue attention from the Galactic Republic and knowing that conflicts between native species would damage his trade, Figg made sure both the Lutrillians and Nothoiin reaped the rewards of the new routes. Figg established himself as a familiar sight on Coruscant as well, becoming a major benefactor of several powerful senators."}, {"tag": "h3", "text": "City in the clouds"}, {"tag": "p", "text": "Within the next decade, Figg set his eyes again on Bespin. Despite the record of failures of previous companies in mining the gases of that world, Figg earned a charter for his company Figg & Associates to attempt it again. His first operation consisted of automated vessels that descended into Bespin's clouds, collected the gases, and returned to orbiting processing ships—an inefficient process, as much of the gas collected was useless. Bespin's rosy clouds intrigued Figg with the possibility of building a floating pleasure palace, and when survey teams discovered that the Tibanna gas in Bespin's lower atmosphere was naturally \"spin-sealed\"—a property that made it invaluable in blaster ammunition—he ordered the construction of the mining colony Floating Home, the first permanent settlement on that world. Figg contracted an Alderaanian architect named Nyrconnel to design the upper levels of the Floating Home colony, though some believed he did so only to please his Alderaanian wife. One of the first attractions commissioned by Ecclessis Figg was the Figg & Associates Art Museum, an upscale art museum located on the colony's twenty-second level; the museum's reception area featured a massive dolomite statue of Figg as a middle-aged man in a well-tailored flight suit."}, {"tag": "p", "text": "Figg knew that Floating Home could not be built without a source of cheap manual labor, and he found it in the Ugnaughts of Gentes. Their species were long-time victims of slavers, and so Figg bought three entire Ugnaught tribes—the Irden, Botrut, and Isced—and brought them together on a space station in the Velsor's Ring asteroid field. There he promised them that if they built his city in the clouds, he would give them their freedom, a home and workplace in the colony they built, and a share in his company's profits. In the mines of the planet Miser, where resources for Figg's city were gathered, and in the clouds of Bespin the Ugnaughts worked to complete Floating Home. Figg designed an idea to help mine the hot Miser, a rolling mining center that could move to stay on the planet's dark side; however, the planet's terrain proved too difficult for a wheeled vehicle, and he abandoned the idea, leaving notes in his personal logs. While planning the colony, he also contacted Incom Corporation to see about contracting design and engineering personnel; Incom's employees later worked to build the repulsorlifts needed to support the colony. When construction at last finished, less than a decade after Figg had first discovered the bounty of Bespin's resources, the businessman honored his word and granted the Ugnaughts their freedom."}, {"tag": "p", "text": "Figg's mining venture paid his wife back ten times more than the capital she had invested, and he saw even further potential in the colony as a site for tourism. He had other reasons for this, though; knowing that anyone could see that the size of his operation was out of proportion with the usual mining of Tibanna as a coolant, he decided to hide his other operation in plain sight by expanding the city, turning Floating Home into the airborne metropolis of Cloud City. The mining of weaponized gas was illegal under the Empire, and the tourism side of Cloud City worked as a front to distract outsiders from the unauthorized mining operation. Figg remodeled, giving the city an Alderaanian-inspired architecture in honor of his wife—and transporting thrantas from Alderaan to Bespin as a gift to her— and promoted it as a site for vacationing, luxury dining, entertainment, and gambling. To prevent the workers from squandering their wages with the latter, Figg laid down laws banning citizens from gambling, and only allowing it for visitors. He also encouraged the spread of information brokers, wanting to know who knew what. A decade after Floating Home was first built, it had become known as Cloud City and a tremendous source of income from tourism alone. It was the first permanent settlement on a gas giant to last more than a decade. Within a few years, Ugnaught leader Boss Ugnor met with Figg to form the Ugnaught Mechanics Union. Figg granted Ugnor the leftover materials from the construction of Cloud City to build a \"Surface\" for Bespin, a floating platform beneath Cloud City and home for the Ugnaughts."}, {"tag": "p", "text": "Decades after his major hyperspace route discoveries, Figg brought his legacy full circle with two others: a new route between Lutrillia and Darlyn Boda, and another between the Corellian Trade Spine and Nothoiin Corridor that opened up the backwaters of the Javin sector. In his last year, Figg presided over a ceremony on Gerrenthum commemorating the creation of a new sector from the outer reaches of the Javin sector. Though Figg pushed for it to be named \"Ecclessis,\" officials in the Core Worlds named it the Anoat sector after an old surveying note. On his deathbed, Figg made a decree regarding the succession of Cloud City's ruling post, the Baron Administrator, that it would be passed down by appointment of the incumbent Administrator."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Figg was survived by his children, who inherited his vast fortune. Figg & Associates remained highly influential on Cloud City, expanding into numerous other ventures, and the Figg family retained a great deal of influence in the region, particularly on Figg's adopted world of Gerrenthum. Figg himself, though a historical footnote in the Core, remained legendary in the Rimward portion of the Corellian Trade Spine. Besides his family's companies of Figg & Associates and Figg Excavations, the businessman was memorialized in a number of names, from the Ecclessis Figg Room of Cloud City where Lando Calrissian later won control of the city, to the Figg Power Station of the Ugnaught Surface, to even a variation of sabacc. Figg and his wife were also memorialized in Figg Hall, a public space for visitors and residents to speak with representatives of Cloud City's government. The upper facade of Figg Hall featured bas-relief sculptures of Figg, his wife, and the construction of Cloud City, though the sculptures' accuracy was highly questionable. An annual gala was held in the Figg & Associates Art Museum to celebrate an obscure milestone in Figg's life."}, {"tag": "p", "text": "By the time that Calrissian had become administrator of the station, the tourism business of Cloud City started as a front by Figg had become a legitimate operation and a major industry on Bespin. Figg was never forgotten by the Ugnaughts, who remembered how he had freed them, and he remained respected and admired by many of them. Centuries after his death, Figg was commemorated in a special report of the Ugnaught news program Action Tidings that related the species' history. Calrissian also found Figg's plans for the rolling mining center in Figg's personal logs, and developed an altered version of the idea using legs instead of wheels; the invention helped him design the mobile platform of Nomad City that traveled the surface of the planet Nkllon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ecclessis Figg was raised by parents of an artistic bent to encourage his creativity, and the young man developed a business acumen and personal flair that those of the classes above him saw as impertinence. Figg would willingly risk danger to help a friend, and this loyalty and his personal charisma impressed others and earned him numerous connections. Figg was charitable and a man of his word. He always emphasized the means over the end. He was not adverse to purchasing Ugnaught slaves, however, though the Ugnaughts did not hold this against him, as he freed them later."}, {"tag": "p", "text": "Figg was considered to be eccentric and a colorful character, with a flamboyant personality. Bold and visionary, he eagerly took great risks that often paid off, from his early decision to smuggle himself off-planet to his investments in later life. With a string of successes to his credit, he styled himself the \"Master Trader of the Outer Javin\". Figg had a need to know who knew what, encouraging the spread of information brokers in Cloud City. He could be secretive as well, hiding business opportunities to prevent others from leaping upon them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Created for Jonatha Ariadne Caspian's Galaxy Guide 2: Yavin and Bespin, Ecclessis Figg has never made a direct appearance in a Star Wars story, relegated to reference and roleplaying game books and assorted mentions in stories. The bulk of the character's biography was presented in a pair of sidebars about him in Galaxy Guide 2 and, later, Galactic Gazetteer: Hoth and the Greater Javin. The Jewel of Yavin, an adventure supplement for Star Wars: Edge of the Empire, expanded on Figg and the history of Cloud City, and also featured the first image of Figg, albeit a statue of the man."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}