{"url": "Echani_(martial_art)/Legends", "categories": ["Category:Legends articles", "Category:Martial arts"], "nodes": [{"tag": "h1", "text": "Echani  (martial art)"}, {"tag": "p", "text": "The Echani art was an unarmed combat discipline developed by the Echani. Tradition dictated that combatants (usually) made no use of armor, weapons or Force techniques, as the art was focused on mastering the body itself as a weapon. Echani culture held the belief that combat was the only means to truly know someone, a pure form of expression where words were swept away, allowing for action to reveal the true nature of the people involved. Their duels were rituals, and it was important to follow etiquette, for that would allow them to read each others' stance and fight accordingly. In this manner, battle was seen as a form of communication similar to art. Exposing emotions in combat, however, made the duel a personal thing; engaging in repeated sessions was a courtship of sorts, in which one's favors were won through superior fighting prowess."}, {"tag": "p", "text": "The Echani art had three tiers, each relying on foundations, and featuring higher forms than the previous one. Echani children began by learning the foundations, progressing over time from one tier to the next as the instructor saw fit."}, {"tag": "h2", "text": "Practitioners"}, {"tag": "p", "text": "During her visit to the Telosian Jedi Academy, Meetra Surik may have sparred with some of the Handmaiden Sisters, the daughters of Yusanis, a famed and powerful Echani warrior. They had mastered the Echani forms both in single combat and in group."}, {"tag": "p", "text": "Echani fighting techniques were frequently taught to special forces units across the galaxy during the Old Republic era. After the formation of the Galactic Empire, the Emperor's Royal Guard and Imperial Intelligence trained in the Echani arts. The Imperial sympathizer Mahd Windcaller was also skilled in the art of Echani and was the head of a group of women bodyguards who were similarly trained."}, {"tag": "h3", "text": "Users"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}