{"url": "Echo_Base", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic military bases", "Category:Echo Base locations"], "nodes": [{"tag": "h1", "text": "Echo Base"}, {"tag": "p", "text": "Echo Base was the settlement established by the Rebel Alliance on the frigid planet of Hoth in the wake of the Battle of Yavin, so named due to its strange acoustics. Within a month of its establishment, the base was discovered by the Galactic Empire who then invaded Hoth, forcing the Rebels to evacuate."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The den of a wampa clan before the arrival of the Rebel Alliance, Echo Base was carved out of a glacier and connected by artificial corridors linked together with structural supports, while natural caverns were expanded to suit the Alliance's needs. It took the Alliance Engineering Corps eighteen months to build, with two full months to install the equipment needed to make the base functional and survivable. It was protected from orbital bombardments by a massive shield generator and a v-150 ion cannon, which would help the Alliance evacuate the base in case of an attack. Designed to be evacuated at a moment's notice, the base was hastily constructed, and often as not, wampa ice creatures would sneak into the base at night, forcing the closures of various corridors. Additionally, a specially reinforced chamber was constructed to hold multiple wampas. Owing to slap-dash construction methods, a single faulty element in the base's electrical system could deny heat to half the base. Nevertheless, soldiers of the outpost were better equipped and displayed better discipline than those stationed elsewhere. In its cavernous ice hangars, the base hosted a contingent of speeders, which were specially modified to operate in the harsh conditions and which the Rebels used for patrol and defense of the outpost. As the technicians had trouble adapting their airspeeders to the subzero temperatures of Hoth, the base also held a herd of native tauntaun creatures for the patrols and recon missions."}, {"tag": "p", "text": "Several sentry posts were stationed around the base, including Echo Station 3-T-8, Echo Station 5-7, Perimeter Outpost Delta, and Outpost Beta. Outpost Delta stood far to the northwest of Echo Base, while it was a mere hundred meters outside the base's energy shield."}, {"tag": "p", "text": "The interior of Echo Base extended seven levels below the surface, with the lower levels for barracks, rec rooms, maintenance hangars and fuel stores. The mid-level housed the command rooms, med center, and two large hangars — north and south. The huge south hangar held the transports, squadrons of X-wings and Y-wings, and a flight of snowspeeders. The smaller north hangar housed starfighters, snowspeeders and the Millennium Falcon.\nThis was where Rebel technicians maintained the numerous speeders that the Alliance had at its disposal. The hangar was open to the outside with a large door, which could be closed to protect the base from the frigid wastes. Most of the troops present slept in enormous bunkers with several hundred others, and often had scant rations."}, {"tag": "p", "text": "The medical bay contained a bacta tank used for healing wounded Rebels, which was overseen by a medical droid; the bacta was used to heal Luke Skywalker after he was wounded in a wampa attack, and—according to Captain Han Solo—made him look strong enough to pull the ears off of a gundark. Additional medical facilities in the base included a morgue, which took advantage of the planet's natural temperature to preserve bodies, and an insulated room in which vaccines were stored."}, {"tag": "p", "text": "The base was occupied by 7,500 personnel and contained a command center where the Rebel leadership coordinated Rebel activities, including the eventual evacuation from Hoth."}, {"tag": "p", "text": "Owing to the base's top secret nature, many soldiers fighting across the galaxy were withheld information regarding its location, while rumors of it being on an asteroid or an underwater city spread like wildfire among the Alliance Fleet. Ships en route to the base were sent on a random path through hyperspace in which they would be transmitted new jump coordinates in an effort to shake any possible Imperial pursuers."}, {"tag": "p", "text": "The base held thirty Gallofree Yards GR-75 medium transports and at least sixty starfighters, which allowed two fighters to be assigned to each transport during the evacuation.< There were many hangars in the base, including North Hangar 7. The base also held at least ten snowspeeders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Early in the Galactic Civil War, the Rebel Alliance base made its home in the Great Temple on Yavin 4, the fourth moon of the planet Yavin. The Galactic Empire tracked the Rebels to Yavin 4 and attempted to destroy the moon with the Death Star, a deep-space mobile battle station capable of destroying entire planets, in 0 BBY. The Rebels launched the Battle of Yavin in a successful attempt to destroy the Death Star, an event that was carried out by Rebel pilot Luke Skywalker. Though the Death Star was destroyed, the Rebels evacuated the Great Temple as the Empire still knew where the Alliance was housed. The initial search for a new base was conducted by General Jan Dodonna during the evacuation from Yavin 4. The Rebels eventually decided to establish their new base of operations on the ice planet Hoth, where they carved and expanded ice caverns and built Echo Base, inhabiting it for less than a month before the Empire discovered it. The base's South Corridor and many others were built by Major Kem Monnon's engineers."}, {"tag": "p", "text": "After the Battle of Yavin, the Dark Lord of the Sith, Darth Vader, searched for Skywalker—whom he had learned was his son—across the galaxy. In 3 ABY, Vader's fleet sent Viper probe droids to all corners of the galaxy, one of which was sent to Hoth. Vader believed that Hoth was the location of the Rebel base and that Skywalker was there, so he ordered his fleet to the snowy planet. Once the Rebel Alliance realized that the Empire had discovered their location, General Carlist Rieekan ordered plan kay one zero be taken into immediate effect, calling for Echo Base be evacuated, despite only having inhabited it for less than a month. With a strategy conference having been held on the planet not too long before, several key members such as Princess Leia Organa and General Carlist Rieekan were still stationed on the world, while the Rebels soon set about to pack up their base and escape on transports, hoping that they would have enough time before the Empire arrived."}, {"tag": "p", "text": "The Empire's arrival led to the Battle of Hoth. Imperial forces landed All Terrain Armored Transports at the Moorsh Moraine to begin the ground assault on the base's shield generator. The Imperials were first spotted on the ground by Outpost Beta, with it being the first destroyed, while the walkers were spotted by Rebel scouts at Echo Station 3-T-8, who relayed the message to the rest of Echo Base. While Rogue Squadron fought the AT-ATs, the Rebels launched their X-wing-protected transports to carry personnel off-world. The transports escaped and the shield generator was destroyed, allowing Vader and his stormtroopers to enter Echo Base and destroy it. Although Skywalker was on Hoth, he escaped before Vader could capture him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}