{"url": "Echo_Base/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Alliance to Restore the Republic military bases", "Category:Echo Base locations"], "nodes": [{"tag": "h1", "text": "Echo Base"}, {"tag": "p", "text": "Echo Base was the Rebel Alliance facility established on Hoth after the Battle of Yavin. The Rebellion abandoned the base following the Battle of Hoth."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Internal layout"}, {"tag": "p", "text": "After two standard years, Echo Base was completed. Two large bay doors provided main entrances at the north and south ends of the mountain range. The hangar was one of the first segments built to allow for the steady inflow of resources. The facility included perimeter defense trenches, static anti-infantry, vehicle emplacements, a v-150 Planet Defender ion cannon, an OrC-19 planetary com-scan unit, a planetary shield, a medical facility and a command center. At its height, the base housed 7,500 combat and command personnel, 350 medical personnel and 120 droids. The hangar was large enough to simultaneously house at least thirty GR-75 medium transports, sixty Rebel starfighters, twelve snowspeeders, the Millennium Falcon and the Outrider. At one location inside the base, several bridges were over a deep chasm. The medical lab consisted of several rooms and featured at least two medical droids, 2-1B and FX-7, as well as a bacta tank."}, {"tag": "h3", "text": "Defenses"}, {"tag": "p", "text": "The Alliance patrolled the terrain surrounding Echo Base with mounted tauntaun riders and snowspeeders, and regularly warded off wampa attacks.[source?] The perimeter of the base was dotted with scout posts labeled \"Echo Stations\", such as Echo Station 3-8, Echo Station 3-T-8 and Echo Station 5-7. The ion cannon control bunker was connected to its own hangar."}, {"tag": "p", "text": "The outside of the base was protected by a Rebel Alliance Fortress and other military buildings, and a defense bunker was connected to the base. The ion cannon was protected by trenches and anti-material laser cannons, and a tunnel connected the control bunker to Echo Base."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After their success against the Galactic Empire at Yavin 4, Alliance High Command sent many expedition teams across the galaxy to scout locations for a new base, realizing that Imperial retribution would come swiftly against their base on Yavin 4. A number of factors converged in making Hoth the primary choice. First, shortly before the evacuation of Yavin (six months after the destruction of the first Death Star), Luke Skywalker, while fleeing from an Imperial pursuit squadron, crash-landed on the icy world of Hoth. The planet was currently the refuge for a family of fugitives from the Empire; its remote location, protective asteroid belt and low likelihood of Imperial presence made it an ideal candidate for the new Alliance headquarters. Skywalker recommended the world to Alliance High Command. After further recommendation by their Habassa allies, the High Command began to consider Hoth as a suitable location for its next important base. High Command dispatched a commando team to gather further information on potential bases, and eight months after the Battle of Yavin, Leia Organa, Luke Skywalker and Han Solo infiltrated an Imperial data station to compile a list of planets that met the desired criteria: worlds that were currently uninhabited, but that contained existing facilities such as abandoned mining complexes. Soon after, Airen Cracken's mission to Poln Major resulted in the Alliance acquiring a wealth of cold-weather material, shield generator equipment, and a dozen combat-modified airspeeders. However, the distinctiveness of this equipment allowed Senior Captain Thrawn to identify the rebel base's planetary characteristics, enabling Darth Vader to narrow down the possible locations for his search and thus, in conjunction with General Veers's discovery that the base was located somewhere near the Elrood System, greatly accelerate his discovery of Echo Base."}, {"tag": "p", "text": "To better examine the planet, the Alliance Special Forces had established a small outpost there, evaluating the potential of building a larger base. Even though the outpost came under attack by a small Imperial force, the SpecForce successfully defended it, and no Imperials remained alive to report about it. Later escaping simultaneous attacks by the bounty hunter Raskar and the smuggler Salmakk, Major Kem Monnon, head of the Alliance Corps of Engineers, was sold the location of a series of caves by an old smuggler. Monnon was then dispatched to Hoth to plan and oversee the construction of what would become Echo Base. Geothermal analysis indicated that the best location for the base was on the northern edge on the only livable temperate band near the equator. Monnon's engineers built the base under the mountains of the Clabburn Range south of the Nev Ice Flow and reinforced the natural ice caverns beneath the surface of Hoth to serve as pathways, using LC-10bWs."}, {"tag": "p", "text": "At some point, an incident occurred where C-3PO and R2-D2, due to a misunderstanding between the two, ended up activating the thermal heaters inside Princess Leia's chambers, causing the room to partially melt due to the base's ice-based construction, ruining Princess Leia's wardrobe in the process. A day later, Echo Base was the site of the Battle of Hoth fought between the Empire and the Alliance in 3 ABY. The Empire sent powerful assault units to Hoth to crush the Alliance base. The Rebels fought a delaying action to allow time for Code 1-5—the evacuation of the base. Rogue Squadron was launched and was able to bring down several of the advancing All Terrain Armored Transports. Assisting them in this operation was Dash Rendar, a mercenary who was stuck at the base, and was exceptional at fighting on the ground and in a snowspeeder. The Imperials deployed additional forces via Sentinel-class landing craft at a landing craft near a Rebel defense bunker. During the battle, the Rebel operative X2 secured the main hangar, and then escorted an R2 droid to the ion cannon control bunker. The Imperial Blizzard Force eventually destroyed the base's power generator and deployed 501st Legion snowtroopers into the base. The 501st fought their way through the base and emerged back outside, where a GR75 transport was loading. One of the troopers placed a beacon, and a Star Destroyer conducted an orbital bombardment at the spot, destroying the transport and its defenders. In the brutal room-to-room fighting that ensued, many remaining personnel were killed. As the last Alliance transports lifted off, the ion cannon was set to self-destruct to collapse Echo Base.[source?] While for reasons as yet unknown, the cannon failed to self-destruct, the rest of the base was destroyed by the Rebel special operations group Renegade Squadron, who set explosive charges around the base. During the battle, Blizzard Force advanced to the front of the base and destroyed the Fortress and other defenses protecting the base. The base itself survived, however, and nearly a year and several months later, it was made a tour destination for one of the travel packages for the travel agency Star Tours."}, {"tag": "p", "text": "When Skywalker and Callista Ming returned to Hoth in 12 ABY they encountered a band of desperate wampa-pelt hunters holed up in the deserted base while their hungry quarry waited outside. Though the two Jedi tried to rescue the group, the wampas demonstrated their uncanny ability to work together as a killing team. Luke and Callista barely escaped from Hoth with their lives."}, {"tag": "p", "text": "In 14 ABY, an Imperial Remnant force occupied the ruins of Echo Base. Hoping to discover the location of Dagobah in the working segments of the Alliance computer core, the Sith devotees of the Disciples of Ragnos and their Imperial subordinates dug an entrance to the base underneath the hulk of a fallen AT-AT. However, their activities were discovered by Jaden Korr, and the young Jedi destroyed the force of snowtroopers and AT-ST walkers, and chased off the Sith acolytes. He dueled Dark Jedi Alora and defeated her, but she fled, promising to encounter him again in the future. It was during Jaden's exploration of the frozen ruins of Echo base that he discovered the firing control room of the ion cannon from which the still-intact cannon itself could be seen. Although no longer capable of tracking a target, the cannon still drew power from its reactors and was capable of firing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Echo Base first appeared with the release of Star Wars: Episode V The Empire Strikes Back and its tie-ins. The 2001 video game Star Wars: Galactic Battlegrounds shows two different versions of Echo Base, one in the Darth Vader (Imperial) campaign and the other in the Leia Organa campaign (Rebel/New Republic). This article includes information from both missions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}