{"url": "Echo_Squadron", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Echo Squadron personnel"], "nodes": [{"tag": "h1", "text": "Echo Squadron"}, {"tag": "p", "text": "Echo Squadron was a squadron that was operational during the Galactic Civil War, where it was part of the Rebel Alliance in a division of the Alliance Fleet, and then later on as part of the New Republic. Shortly after the destruction of Alderaan, the Squadron participated in a battle at Fostar Haven."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Echo Squadron was part of the Alliance to Restore the Republic and was made up starfighter pilots and astromech droids, and was under the command of an individual with the callsign Echo Leader. The squadron received their orders from Admiral Gial Ackbar."}, {"tag": "p", "text": "Echo Squadron was attached to a fleet that consisted of the MC80 Liberty Type Heavy Star Cruiser Aurora, seven EF76 Nebulon-B escort frigate, nine CR90 corvettes, and five GR-75 medium transports. The squadron utilized T-65B X-wing starfighters, and had support from BTL-A4 Y-wing starfighters, RZ-1 A-wing interceptors and UT-60D U-wing starfighter/support craft. Their starfighters were painted blue with light gray markings/stripes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Some time after the destruction of Alderaan, the Alliance received a distress call originating from an Alderaanian refugee convoy under attack from Imperial forces at Fostar Haven. Admiral Gial Ackbar gave the order for Echo Squadron to deploy to Fostar Haven to assist. Upon arrival, they confronted the Star Destroyer Vigilance, which was attempting to destroy the Alderaanian refugee convoy. Echo Squadron was contacted by Lindon Javes, an Imperial defector, and worked with him to protect the convoy from harm. Echo Squadron encountered heavy resistance from the Star Destroyer as it attempted to halt the convoy's escape, until Javes came up with a plan to disable the Vigilance's targetting system, requiring the help of Echo Four. With the success of the plan, both the convoy and the Alliance fleet were able to jump to lightspeed."}, {"tag": "p", "text": "During the fighting, Echo Squadron lost two members, Echo Two and Echo Five, but destroyed a number of TIEs along with a Raider-class corvette."}, {"tag": "h2", "text": "Squadron livery"}, {"tag": "p", "text": "At the time of the Battle at Fostar Haven, ships of Echo Squadron were painted a base cobalt blue with metal highlights. This color scheme appeared on all ships flown under the Squadron's banner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Echo Squadron first appeared in the prologue mission of the 2020 video game Star Wars: Squadrons."}, {"tag": "p", "text": "Echo Squadron shares its name with a clone trooper from the 501st Legion, and Echo Base, the rebel sanctuary on Hoth."}, {"tag": "p", "text": "In Star Wars: Squadrons, the player flies with Echo Squadron under the Echo Four callsign in the first mission, later transferring to Vanguard Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}