{"url": "Eclipse-class_dreadnought", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Eclipse-class dreadnoughts", "Category:Galactic Empire starship classes", "Category:Interdictor starship classes", "Category:Super Star Destroyer variants"], "nodes": [{"tag": "h1", "text": "Eclipse-class dreadnought"}, {"tag": "p", "text": "The Eclipse-class dreadnought, also known as the Eclipse-class Super Star Destroyer, was a class of Imperial Super Star Destroyer manufactured by Kuat Drive Yards and mainly used around six years after the Battle of Endor. Like the Sovereign-class, they were regarded as a new generation of Super Star Destroyer."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Size"}, {"tag": "p", "text": "The Eclipse-class vessels were among the largest dreadnought-scale ships/Super Star Destroyers ever to be fielded within Galactic history. Although technically dwarfed in length by both the Executor-class Star Dreadnought and the Vengeance-class dreadnought by 1.5 kilometers, the Eclipse-class nonetheless exceeded even the Executor-class in terms of overall mass and volume. Its size was large enough for it to be classified as a space station."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The most deadly weapon carried by Eclipse-class ships was an axial superlaser, similar to but significantly less powerful than one of the component beams used in the Death Star's superlaser. This superlaser was the pinnacle of Imperial destruction in their fleets."}, {"tag": "p", "text": "An Eclipse's superlaser easily had the power to destroy other Super Star Destroyers, as the Annihilator found out when Tyber Zann seized the Eclipse's incredible power above Kuat."}, {"tag": "p", "text": "The axial superlasers were capable of slashing through any planetary shield to crack open a planet's crust and sear entire continental landmasses. The massive superlaser was more widely used to destroy enemy capital ships and space stations during combat. According to Admiral Conan Antonio Motti in the Imperial Handbook: A Commander's Guide, the superlaser's intended use was to penetrate planetary shields as well as vaporize cities with a single blast."}, {"tag": "p", "text": "The class benefited from the most significant weaponry-improvements of the last few decades. This included gravity well projectors and improved ion cannons, the former of which were the same types included on the Interdictor-class Star Destroyers. Additionally, these behemoths were armed with hundreds of heavy laser and turbolaser mountings."}, {"tag": "p", "text": "In addition to its firepower, the Eclipse-class's hull armor and shields were so strong that it could ram enemy ships without hesitation."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The Eclipse-class was more mobile than the Death Star, being equipped with both an enhanced hyperdrive and fast sublight engines."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "An Eclipse-class vessel carried 600 TIE/IN interceptors and 96 TIE Bombers, divided into 58 squadrons; for ground assault, they carried 150,000 Imperial soldiers, 100 AT-ATs, and five prefabricated bases. The hangars were located at the sides of the vessel, with the fore and aft launch bays closely spaced underneath this area, towards the middle of the ship."}, {"tag": "p", "text": "Each ship of the class was crewed by over 700,000 personnel, and Eclipse II also carried a complement of Shadow Droid starfighters. Troop quarters were located on the lower frontal section of the vessel, in front of the hangar areas."}, {"tag": "h3", "text": "Bridge tower"}, {"tag": "p", "text": "The bridge tower contained the main communications array and sensor array, located on the port and starboard sides, respectively. In addition to containing the main command station for the ship on the lower portion of the tower, it also housed the deflector shield command center, on the top area. The bridge tower was closer to the hull than that of traditional Star Destroyers of the Imperial-I and Imperial-II class."}, {"tag": "h3", "text": "Variances"}, {"tag": "p", "text": "There were several variances between the two known vessels of this class, the Eclipse I and the Eclipse II: The Eclipse I possessed six engines on the back, whereas the Eclipse II possessed eight. In addition, the Eclipse I had the engines separate from each other and to the sides, whereas the Eclipse II engines were grouped together in a manner similar to other Star Destroyers. Lastly, the Eclipse II had a command bridge tower directly over the superlaser weapon that the Eclipse I lacked."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While the lead ship, the Eclipse, was being built, the Empire also constructed an Eclipse-class prototype to use as a weapons testbed. This craft was later converted to become the battlestation Tarkin. The Tarkin was eventually destroyed by a Rebel sabotage team in 3 ABY."}, {"tag": "p", "text": "The Eclipse, alongside its sister ship, the Eclipse II, began construction early in the Galactic Civil War, around 0 ABY. The ship class, alongside that of a similar Star Dreadnought class called the Sovereign-class, were planned to revolutionize naval combat as well as ensure the dominance of the Imperial Navy up to the next century of its existence. Details of the planned design were included in the Imperial Handbook, an official aide-memoire for Imperial commanders. The Eclipse was built above Kuat, whereas the Eclipse II was built over Byss. The appearance of both ships' hulls was derived from ancient nautical warships."}, {"tag": "p", "text": "By 4 ABY, both the Eclipse and the Eclipse II had its superlaser main weapon installed and in functional condition. However, both ships ended up significantly delayed in terms of completion thanks to Palpatine's demise and the power vacuum that ensued. The then-fledgling New Republic remained unaware of the Eclipse-class' construction: through the New Republic Intelligence Service acquired a copy of the Imperial Handbook just after the Battle of Endor, this was the only information they received on the class and General Carlist Rieekan believed that the Empire had not made progress on the design. In addition, the crime lord Tyber Zann wanted to access records on the ship, and if possible steal the ship, so he attacked Kuat and took control of the ship, and used to it to damage an Imperial and rebel fleet (with his manipulating the latter group into granting him access). Afterwards, Zann had no further use for the vessel, finding its size to be more cumbersome for laying low to even the Rebel Alliance, and left it adrift, until the New Republic attacked and destroyed the Eclipse"}, {"tag": "p", "text": "Later on, this ship was completed and became the reborn Emperor Palpatine's flagship, with its sister ship Eclipse II assuming the same role after the original's destruction."}, {"tag": "p", "text": "Approximately 17.5 kilometers long on the keel, these jet-black battleships were among the largest Super Star Destroyers ever built, and among the most heavily armed warships of all time. In terms of scale, they were the successors to dreadnoughts like Eye of Palpatine and the Kuati Star Dreadnoughts that preceded the New Republic era."}, {"tag": "p", "text": "Eclipse took almost as long to construct as either of the Empire's Death Star battlemoons, and for most of her career, she served as an orbital battlestation at Byss. At some point later, the Eclipse came out of hyperspace, to which its black hull caused some New Republic forces to initially believe that it was a ghost ship, although they quickly realized that the ship was in fact real when it opened fire to which only the information officer, Nara Dun, survived and managed to inform New Republic forces about the devastating surprise attack."}, {"tag": "p", "text": "She was destroyed along with the reborn Emperor in 10 ABY, during an Imperial attack on Pinnacle Moon in the Da Soocha system, when Luke Skywalker and his sister, Princess Leia Organa Solo, managed to disrupt the Emperor's control of a titanic Force storm, a massive conflagration of dark side energy that the Emperor had summoned in order to wipe out the massed New Republic fleet."}, {"tag": "p", "text": "After this catastrophe, the Eclipse II replaced the original. It was slightly different than its predecessor, with different thrusters. Above the planet Onderon, Lando Calrissian and Wedge Antilles led a small boarding party against the mighty battleship, and R2-D2 was able to override Eclipse II's computer banks. The astromech droid then sent Eclipse II hurtling through hyperspace on a collision course with the superweapon Galaxy Gun. Eclipse II rammed the Galaxy Gun, destroying both. One last projectile was pulled by Byss' gravity and impacted the planet, the resulting explosion annihilating Byss and the clones of Emperor Palpatine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Dark Empire Sourcebook states that Eclipse was 17.5 kilometers long; this contradicts the description given in Star Wars: Dark Empire, where the ship is said to reach \"ten miles from stem to stern\", or 16 kilometers. The author of the Dark Empire Sourcebook has apparently suggested that an additional 1.5 kilometers was added to the first ship of this class. This is supposed to indicate that particular ship's customization and personalization, with the standard design being only 16 kilometers long. Alternatively, \"ten miles from stem to stern\" might be merely a vague, rhetorical figure, or the discrepancy may be the result of the long and spasmodic construction period, or it may represent a difference between Eclipse and Eclipse II. To add to the confusion, the Eclipse entry in The Complete Star Wars Encyclopedia states a length of 17.5 kilometers, where the Star Destroyer entry has the length at 16 kilometers, which could be a typo since the Star Destroyer is 1,600 meters long."}, {"tag": "p", "text": "Regardless of size, considering the initial statements of the size of Executor-class Star Dreadnoughts, it's clear that the Eclipse was intended to be much larger than them. With later statements about the size of Executor ships, the Eclipse is actually shorter, though still likely more massive and more destructive."}, {"tag": "p", "text": "There is also an apparent contradiction in the information on for Eclipse's construction. According to the Dark Empire Sourcebook, design work on Eclipse was begun after the Battle of Hoth, while Byss and the Deep Core claims that she was under construction for as long as either Death Star, hinting a timeframe of decades (it should be noted that, at the time Byss and the Deep Core was written, the timescale of Death Star construction was believed to be much shorter, on the order of years)."}, {"tag": "p", "text": "Byss and the Deep Core further hints that Eclipse was parked in orbit at Byss before the Battle of Endor, as it is only in this timeframe that she could have served as a rendezvous point for meetings of the Grand Admirals as claimed in the text (although the Grand Admirals referred to may be a new group that postdates the original 12); but The Essential Chronology says that she was built at Kuat and only moved to Byss four and a half years after the Battle of Endor, when she was stolen in a partially-completed state by Lira Wessex and her design team shortly before the shipyards surrendered to the New Republic."}, {"tag": "p", "text": "There are several ways of explaining these perceived discrepancies, but it is possible that, as with Executor and her sister-ship Lusankya (also originally named Executor), Eclipse and Eclipse II were constructed simultaneously in two different shipyards, with the existence of each being kept secret from the people working on the other. The potential discrepancies in timeframe may be a matter of in-universe error, with the fictional authors who serve as the real-world writers' proxies being unaware of the true length of construction."}, {"tag": "p", "text": "Some fans regard the stated power of Eclipse's superlaser as paradoxical. It is described as not powerful enough to destroy a planet, but as capable of overpowering planetary shields and as 2/3rds the power of the Death Star's prime weapon; but some fan calculations suggest that a weapon of such power would be more than sufficient to destroy a planet, and some fans believe that planetary shields are actually harder to destroy than planets. Those who wish to reconcile these beliefs with the canon statements suggest that the \"2/3rds\" figure refers instead to the magnitude of the energy release as opposed to the total value; this would put the main weapon below the threshold necessary to destroy a planet."}, {"tag": "p", "text": "Another possibility, as the Death Star's superlaser consisted of eight individual beams which combined into a single larger beam after firing, is that the Eclipse-class' superlaser had 2/3rds the power of one of the Death Star superlaser's component beams. Alternatively, it may be that the fan-calculations are in error; the exact destructive mechanism of a hypermatter-fueled superlaser isn't fully understood other than it being a direct energy transfer weapon. With The New Essential Guide to Vehicles and Vessels mentioning it as being made to penetrate a planet's crust, this is still far less than what either Death Star was capable of, which was pulverizing an entire planet."}, {"tag": "p", "text": "Another suggestion is that perhaps Eclipse could destroy a planet, but not if the shot's power is depleted by having to travel through a planetary shield."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}