{"url": "Eclipse_Fighter", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Jedi starships"], "nodes": [{"tag": "h1", "text": "Eclipse Fighter"}, {"tag": "p", "text": "The Eclipse Fighter was a starship owned by Naare, a female Sith agent who worked for the Galactic Empire. The vessel consisted of a centralized cockpit built around a part of retractable wings. The Eclipse Fighter could take considerable punishment and served Naare well during her quest to find the Kyber Saber crystals and to hunt down the Freemakers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Eclipse Fighter was a starfighter that featured a centralized cockpit design built around two swing wings. had a red canopy and was painted in black and red colors. The Eclipse Fighter was equipped with a hyperdrive, intercom system, and laser cannons. The ship had at least one pilot but could also transport four passengers. The starfighter was also fast, highly manueuverable and could take considerable damage."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Cloak of deception"}, {"tag": "p", "text": "Following the Battle of Hoth, the Imperial Sith agent Naare used the Eclipse Fighter to travel from the planet Nal Kapok to the Freemakers' garage at the Wheel space station in the Abrion system. Earlier, she had posed as a Jedi and convinced the Force-sensitive Rowan Freemaker to embark on a quest to collect the pieces of the Kyber Saber, the first lightsaber. Naare managed to gain the trust of the Freemakers by saving them from Imperial troops."}, {"tag": "p", "text": "Naare later used the Eclipse Fighter to travel to the Belgaroth asteroid field to find Rowan and his B1-series battle droid Roger, who had gone there to find the second Kyber Saber crystal. Naare was accompanied by Rowan's older brother Zander and Kordi Freemaker, who traveled on the freighter StarScavenger. After parking their ships at the Hutt crime lord Graballa's ore mine, the three traveled up to Graballa's starship Rancor's Fist. After escaping Graballa, Naare returned to the Eclipse Fighter and almost destroyed the StarScavenger in a fit of rage. However, she relented when Rowan found the second Kyber crystal in space."}, {"tag": "p", "text": "Later, Naare used the Eclipse Fighter to travel to the Imperial Star Destroyer Vendetta to help Rowan and Kordi rescue Zander, who had been captured while taking his N-1 starfighter on a joyride. She managed to gain permission to land aboard the Star Destroyer after giving her clearance code. She also used the Fighter to return to the Freemaker Garage after rescuing Zander. Later, Naare flew the Eclipse Fighter to Cloud City on the planet Bespin after suspecting that Rowan was searching for the third Kyber Saber crystal. However, the \"lost treasure\" turned out to be the rebel Lando Calrissian's cape."}, {"tag": "p", "text": "Naare later secretly traveled to the Imperial Palace on Coruscant for a performance review with her masters Emperor Palpatine and Darth Vader. After the review, she returned to the Wheel. After receiving a distress call from the Freemakers on Tatooine, Naare flew the Eclipse Fighter there and rescued the Freemakers from Graballa and his henchmen. While hiding inside Naare's starfighter, Rowan discovered Naare's Sith lightsaber and a hologram message from Palpatine telling her to use more force against the Freemakers. This confirmed his suspicions that she was indeed a Sith."}, {"tag": "h3", "text": "Race for the Kyber Saber"}, {"tag": "p", "text": "After the Freemakers fled their garage on the StarScavenger, Naare gave chase in her Eclipse Fighter. She managed to follow them through the traffic and inflict damage on their ship's deflector shields and quantum regulator. However, Zander managed to clip the wings off her damaged starfighter. Naare returned to the Freemaker Garage in her damaged ship only to be confronted by Graballa. When Graballa revealed that he wanted to use the Kyber Saber crystals to bankroll his beachside resort and buffet, Naare agreed to share the crystals if his men agreed to repair her ship."}, {"tag": "p", "text": "Using Roger's transmission pack as a homing beacon, Naare and Graballa managed to steal the fourth, fifth, and sixth Kyber Saber crystals from Rowan on the planets Takodana, Ningoth, and Naboo. Naare flew the Eclipse Fighter on both Takodana and Ningoth. On both occasions, she was propped up by the massive firepower of Graballa's ship Rancor's Fist. On Ningoth, the Freemakers used their submarine Bubbly Snubbly to drag Naare's fighter underwater in an attempt to loose her. However, she managed to steal the fifth crystal before the StarScavenger could close its cargo door. The ship's engines were damaged by seawater and Graballa reluctantly agreed to foot the bill."}, {"tag": "p", "text": "Later on the planet Zoh, Naare's Eclipse Fighter and Graballa's Rancor's Fist raced the Freemaker's StarScavenger to the planet Hoth, where the seventh and last Kyber Saber crystal was hidden. Upon entering Hoth's atmosphere, the Eclipse Fighter was caught up in a snow storm. Using the Force, Naare managed to see through the storm and pursue the Freemakers' ship. However, she, the Rancor's Fist, and the bounty hunter Dengar's starfighter collided with the mountain. Despite the damage, the Eclipse Fighter was still operational and later took part in assault on the Freemakers at Echo Base. Naare managed to shoot down Zander and Rowan's snowspeeder only to be downed by Kordi and Roger's AT-AT walker."}, {"tag": "h3", "text": "Delusions of grandeur"}, {"tag": "p", "text": "Despite the damage inflicted to it on Hoth, Naare was able to use the Eclipse Fighter to travel to the Wheel with Graballa's forces. She used the starfighter to cut off Kordi and Zander's escape after Graballa and his henchmen entered through the front door. After learning that the battle droid Roger knew the location of the last Kyber Saber crystal, she stole his head and left the Freemaker Garage on her starfighter. Using the Eclipse Fighter, Naare traveled to the uncharted world and reforged the Kyber Saber. After the Emperor insulted her, Naare decided to rebel against her Sith master and to set herself up as Empress."}, {"tag": "p", "text": "Flying the Eclipse Fighter to Coruscant, Naare cut a swath of destruction through several TIE fighters and Imperial assault cruisers. Naare used her starfighter's cannons to destroy the starfighters before leaping out of the cockpit and destroying more starships with the Kyber Saber. Naare then destroyed two Imperial Star Destroyers single-handedly with her Force powers. Naare then flew the Eclipse Fighter down to the Imperial Palace. After parking it, she discarded Roger's head and went to confront the Emperor. Ultimately, Naare was defeated, Roger was rescued, and the Kyber Saber was destroyed by Rowan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eclipse Fighter appears in the 2016 Disney XD animated television series LEGO Star Wars: The Freemaker Adventures. LEGO also released a promotional LEGO box set of the starfighter to coincide with the television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}