{"url": "Eclipse_Squad", "categories": ["Category:Legends articles", "Category:Republic Special Forces units"], "nodes": [{"tag": "h1", "text": "Eclipse Squad"}, {"tag": "p", "text": "Eclipse Squad was a formation of the Republic Special Forces Division created during the Galactic War."}, {"tag": "p", "text": "Following the highly-publicized success of Havoc Squad in the campaign against General Arkos Rakton during the Battle of Corellia, Supreme Commander Jace Malcom gave standing orders for Havoc to be placed on top-priority duties on the front lines, as Havoc and its commander had become too valuable (and too recognizable) to continue working covert operations for SpecForce. General Elin Garza, commander of SpecForce, worked for over a year after Corellia to form a new covert ops squad to replace Havoc, attempting multiple combinations of species and technologies, to no avail."}, {"tag": "p", "text": "General Garza learned of Havoc's involvement in an incident on Manaan and sent a salvage team to recover any technology from the wreckage of Genetics Laboratory G-1, used by the Order of Revan to create an \"Infinite Army\" using Rakata cybernetics. Using what technology could be repaired, and patching together with blueprints from the mercenary scientist Krel (killed in one of Havoc's first missions under its soon-to-be-renowned commander) what couldn't, Garza had the cybernetics implanted into six volunteers. The initial results were promising, but soon after, the members of Eclipse Squad became mentally unstable. A fight broke out at Fort Klemark on Altair 9, resulting in the facility's destruction and the deaths of two hundred Republic soldiers. Eclipse disappeared soon afterwards."}, {"tag": "p", "text": "Garza tracked Havoc Squad down to Rishi, and met with their commander on the surface to explain the situation. Eclipse Squad was believed to also be on Rishi hunting for the Revanites; however, the psychological damage caused by the Rakata implants made them paranoid, seeing themselves as working for the Republic, and all comers - even other Republic soldiers - as enemies. Garza saw Havoc as the superior unit, and tasked them with hunting down and destroying Eclipse Squad in the jungles outside Raider's Cove, while she gave intel on the squad members. Jamming their signal relays, hidden in the tough Rishi palm trees, Havoc lured the Eclipse squad members out one by one and destroyed them. The other members of Eclipse Squad identified Havoc as Revanite traitors; only its commander, Major Nol Corovani, was aware of what he had done, as he asked Havoc to free him from the \"nightmare\" as they had his squadmates."}, {"tag": "p", "text": "The disaster of Eclipse Squad, particularly the massacre at Fort Klemark, would bring about an end to General Garza's career."}, {"tag": "h2", "text": "Appearances"}]}