{"url": "Agricultural_Corps/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic organizations", "Category:Jedi Order organizations"], "nodes": [{"tag": "h1", "text": "Agricultural Corps"}, {"tag": "p", "text": "The Agricultural Corps, or AgriCorps, was one of the four branches of the Service Corps of the Jedi Order. The largest part of the Service Corps, this organization was formed so that those Jedi Initiates who had failed to pass their Trials could use their connection to the Force for the betterment of galactic society."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Made up largely of Jedi who had failed to complete their training at the Jedi academy, as well as those Jedi who had not been chosen as an apprentice by the age of thirteen, membership in the AgriCorps was completely voluntary, though assignment to the Corps was handled by the Council of Reassignment. Working in conjunction with the Republic Agricultural Administration to provide healthy crops to those under-privileged star systems suffering from natural disasters or blight, the AgriCorps also attracted ranking members of the Order who wished to take a more hands on approach to helping the common people of the galaxy. While working under the Reassignment Council, internal affairs were handled by the Council of AgriCorps Masters."}, {"tag": "p", "text": "While many within the lower ranks of the Order saw assignment to the Corps as a demotion, the Corps provided a great many necessities and was indeed just another facet of the Order. Maintaining research labs throughout the Republic, the Salliche Ag Circuit was one of the main hubs of activity within the Core Worlds. Additionally the research labs within the Coruscant Jedi Temple provided great amounts of research to be filed into the Jedi Archives and served as a reservoir for information collected from all over the Republic. Facilities were also erected on Ukio, Taanab, Marfa, Bandomeer, and Dilonexa XXIII."}, {"tag": "p", "text": "Members of the Corps focused on the Living Force and cultivating skills that aided in plant growth such as consitor sato. While many Jedi served in the AgriCorps at some point in their service to the Order, the majority of this branch was made up of lifetime members. The AgriCorps had a branch of its own working within it consisting of geologists who would discover the secrets hidden in alien soil. At any given point, up to 1,500 students were a part of the AgriCorps, with their ages ranging from 6 to 40 years old, although most were not older than 16. A small percentage of these students ended up not becoming Padawans later in life due to not showing enough talent or focus, and an even smaller percentage of these ended up preferring agriculture over sword-fighting."}, {"tag": "p", "text": "After the formation of the Galactic Empire and the Great Jedi Purge, Dark Lord of the Sith Darth Sidious rounded up all of the AgriCorps members that weren't killed during Order 66. Transported to Byss for indoctrination in the dark side, those who fell to the Sith joined the ranks of the Dark Jedi active within the Empire. After the Galactic Civil War ended and the Dark Jedi along with the Sith were routed, the reformed Jedi Order did not rebuild the AgriCorps. While Grand Master Luke Skywalker knew of students that would have made great members of the Corps, such as Tahiri Veila, he decided to join the AgriCorps philosophy with the main Order's doctrine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}