{"url": "Edcel_Bar_Gane/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic senators", "Category:Males", "Category:Roonan"], "nodes": [{"tag": "h1", "text": "Edcel Bar Gane"}, {"tag": "p", "text": "Edcel Bar Gane was a Roonan male who represented his homeworld of Roona in the Senate of the Galactic Republic, leading up to and during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Opponent of Valorum"}, {"tag": "p", "text": "Edcel Bar Gane was the Senator of the planet Roona during the last years of the Galactic Republic. He was assisted by an aide of the same species."}, {"tag": "p", "text": "Bar Gane had voiced concerns about Supreme Chancellor Finis Valorum's actions and their impact on the stability of the Republic as early as 33 BBY, thinking that Valorum's ineffectiveness would further divide the politicians in extremes. During this time, Bar Gane allied himself with the influential yet corrupt Senators Orn Free Taa, Passel Argente and Toonbuck Toora, and was a supporter of Palpatine."}, {"tag": "p", "text": "Bar Gane seconded the motion for a Vote of No Confidence in the leadership of Supreme Chancellor Finis Valorum prior to the Battle of Naboo."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "Bar Gane would later continue to serve as senator to Roona during the Clone Wars. Around 21 BBY the second year of the war, the Separatist Parliament proposed a peace negotiation with the Galactic Senate, However, Senators Gume Saam and Lott Dod along with InterGalactic Banking Clan Representative Nix Card conspired with former Jedi Count Dooku, the public leader of the Confederacy of Independent Systems, to have Coruscant attacked, which was successfully carried out by General Grievous's demolition droids. They attacked the Coruscant power generator, which caused a planet-wide blackout. During a session following the attack, Bar Gane expressed anger with the Separatists' move, which fellow Senator Zinn Pauless agreed with."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bar Gane was a Roonan, a green-skinned humanoid species similar in appearance to a Neimoidian save for his large, blue-silver oval eyes. He spoke with a sibilant voice. Bar Gane was surprisingly intolerant of other species, especially in his private business sector on Coruscant."}, {"tag": "p", "text": "During his time on Coruscant, Bar Gane visited the Coruscant Opera House, like many other politicians of the time. Bar Gane was known to have assisted to a representation of The Brief Reign of Future Wraiths, performed by a Bith company, and shared balcony with his political allies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The name \"Edcel Bar Gane\" comes from Nick Dudman, the Live Action Animatronics Effects Supervisor on The Phantom Menace. He remarked that \"an Edsel was a bargain at some point\", knowing that George Lucas, having a passion towards old cars, would understand what it meant."}, {"tag": "p", "text": "The character was voiced by Stephen Stanton in Star Wars: The Clone Wars."}, {"tag": "p", "text": "Bar Gane has been erroneously referred to as \"Edcel Bar Gan\" in some sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}