{"url": "Eddel", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Enslaved species", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Eddel"}, {"tag": "p", "text": "The Eddelians (singular: Eddel) were a quick-witted species from the planet Fehern. Having been prominent traders throughout the Trax sector under the Galactic Republic, they were decimated in a war against its successor, the Galactic Empire. By the time the conflict had ended, their number had been reduced to a few thousand sentients; the survivors were then forced into slavery."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Eddelians were a sentient species known for their quick wit."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Eddelians were native to Fehern, a hospitable planet in the eastern Mid Rim's Trax sector. Under the Galactic Republic, this region of space was explored between 15,000 and 8000 BBY, and was part of the turbulent Kashyyyk Region, an unstable arena of competing species and power blocs. The Eddelians traveled throughout the Trax sector, and their distinctively styled Eddelian starships, carrying Eddelian traders, were a common sight in neighboring star systems."}, {"tag": "p", "text": "The Eddelians were targeted by the Republic's successor state, the Galactic Empire, as part of its pro-Human, anti-alien rhetoric. The Empire declared war on the Eddelians and decimated the species. Only a few thousand Eddel survived the conflict, subjugated by the Empire. The Empire took over their homeworld, and many Humans immigrated there. The remaining Eddelians were forced to serve those colonists as slaves. Most Eddelian technology was also destroyed by the Empire during the conflict."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eddelians were created by Bill Smith for the roleplaying game sourcebook Star Wars Gamemaster Kit, published by West End Games in 1991. This information was later republished in the compilation Classic Campaigns in 1994. Del Rey's The Complete Star Wars Encyclopedia, published in 2008, also made mention of the Eddel."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}