{"url": "Edly_Fasalk", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:FarStar crewmembers and personnel", "Category:Gunners", "Category:Humans", "Category:Males", "Category:Privateers"], "nodes": [{"tag": "h1", "text": "Edly Fasalk"}, {"tag": "p", "text": "Edly \"Pot-Shot\" Fasalk was a male Human gunner who claimed to have had a major role in several of the Alliance to Restore the Republic's most historical events, including the capture of the Tantive IV, and the battles of Hoth and Endor. In reality, Fasalk was a fast-talking fantasist who delighted in telling tall tales and wild stories about himself. During the early years of the New Republic, he served with a privateer group."}, {"tag": "p", "text": "In 8 ABY, Fasalk was on Kal'Shebbol in the Kathol sector of the Outer Rim Territories when the New Republic liberated the planet from the Imperial warlord Moff Kentor Sarne. However, Sarne managed to escape from New Republic forces, and the CR90 corvette FarStar was tasked with the mission to track him down. The New Republic was forced to recruit from Kal'Shebbol's civilian population to crew the vessel due to a lack of available manpower; Fasalk volunteered and accompanied the ship as part of its gunnery crew."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Edly Fasalk was a male Human who claimed to have been part of the Alliance to Restore the Republic and a member of the CR90 corvette Tantive IV's gunnery crew. The corvette was captured over the Outer Rim world of Tatooine in 0 BBY by the Imperial-class Star Destroyer Devastator under the command of Darth Vader in an effort to recover the stolen Death Star plans. Incarcerated by the Empire, Fasalk claimed he was sent to an Imperial prison planet, but managed to escape captivity. After somehow rejoining the Alliance, he then affirmed that he commanded the Alderaanian gunnery crew that operated the v-150 Planet Defender ion cannon at Echo Base during the Battle of Hoth in 3 ABY. Then, after evacuating Hoth, he claimed to have served as a gunner with the Alliance Fleet that engaged Imperial forces during the Battle of Endor, and his actions helped to destroy half the enemy fleet. During his time as a member of the Alliance, Fasalk claimed that he was awarded two medals for meritorious service, and a sash that was presented to him personally by Princess Leia Organa for his \"exceptional bravery in the face of insurmountable odds at the Battle of Hoth.\""}, {"tag": "p", "text": "In reality, Fasalk was little more than a fantasist who told wild stories and colorful tales. His medals and sash were really trinkets that the gunner had purchased on a backwater planet. During the early years of the New Republic, Fasalk was operating with a privateer group in the Outer Rim Territories as a gunner, and had acquired the nickname \"Pot-Shot.\" During a stopover on the planet Kal'Shebbol in the Kathol sector of the Outer Rim Territories, the group left him behind because they had gotten tired of listening to his outlandish stories and tales. Several months later, in 8 ABY, the New Republic launched an assault on Kal'Shebbol to free the planet and topple the local Imperial warlord, Moff Kentor Sarne. Although the attack succeeded, Sarne was able to flee into the Kathol sector with the bulk of his fleet. The New Republic authorized the CR90 corvette FarStar to follow him and neutralize any threat he may have posed. However, since the New Republic was short on manpower, they put out a call for civilians to assist in crewing the ship. Seeing a chance for riches, fame, and more stories, Fasalk immediately petitioned to join the crew. He neglected to tell them about the reason he was on Kal'Shebbol in the first place, and was taken on because of his skill with a turbolaser. Aside from crewing one of the FarStar's weapons during the months-long mission, Fasalk also often accompanied ground parties, manning the weapons console on the landing shuttles."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Edly Fasalk had black hair and light skin. He loved to talk, and would relay his stories to anyone who would listen. His continual recitation of his stories would inevitably annoy those who worked with him, and he often bragged about his prowess with a weapon, and how his skills had earned him medals and commendations. Considered to be annoying by his shipmates, his tall tales and constant talking were tolerated because he was accurate with this weapon. Although he was a good gunner, he was not as skilled as he claimed to be; he would often fire before attaining an accurate range reading, and did not always take into account any friendly ships that were between him and his target. He also had a penchant for opening fire even when ordered to hold, and for shooting at retreating targets that were clearly out of range. Fasalk was trained to operate weapons and shield systems on both capital and smaller ships. He had some experience with unarmed combat, and was a capable bargainer and gambler. Fasalk wore a blast vest over his coveralls, and displayed his sash and medals across his chest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Edly Fasalk was created for The DarkStryder Campaign, a multi-book adventure for Star Wars: The Roleplaying Game by West End Games, published in 1995. A member of the support crew of the FarStar, the gamemaster and players were given free reign to develop Fasalk's character during the adventure if they so wished since the designers did not include him in the future supplements. His entry was written by Peter M. Schweighofer, and his illustration was provided by Mike Vilardi."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}