{"url": "Edric_Ordo", "categories": ["Category:Legends articles", "Category:Clan Ordo", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Edric Ordo"}, {"tag": "p", "text": "Edric Ordo was a male Human Mandalorian, and a member of Clan Ordo. A close friend of clan mate and cousin Canderous Ordo, following the end of the Mandalorian Wars and the death of Clan Ordo's leader, Tegris Ordo, Edric and Canderous were separated as Clan Ordo became scattered. Though Canderous set out on his own as a mercenary, Edric kept to what remained of his clan. Following Clan Ordo's newest leader, Veela Ordo, Edric took part in the Mandalorian clans' search for the lost mask of Mandalore, taken by the Jedi Knight Revan when he defeated Mandalore the Ultimate. The search led to the planet Rekkiad, where Edric was reunited with his old friend Canderous, who was also searching for Mandalore's Mask with the help of an undercover Revan. Soon after, Revan led Clan Ordo to where he had hidden Mandalore's Mask, allowing Canderous to claim it and become Mandalore the Preserver."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Edric Ordo was a Mandalorian warrior from the Ordo clan. A year older than his clan mate and cousin, Canderous Ordo, Edric and Canderous became longtime friends. However, their close ties were severed following the end of the Mandalorian Wars and the death of Clan Ordo's chieftain, Tegris Ordo, and the two drifted apart as Clan Ordo grew divided and scattered."}, {"tag": "p", "text": "By the year 3954 BBY, Edric had joined a more cohesive gathering of Clan Ordo as part of the Mandalorians' search for the lost mask of Mandalore. The armored helmet had been taken by the Jedi Knight Revan following his defeat of the Mandalorian leader, Mandalore the Ultimate, at Malachor V six years earlier, and hidden by Revan so that the Mandalorians would be unable to choose a new Mandalore. Edric and the clans searched world after world along the estimated trajectory of Revan's departure from Malachor V, until finally they came to the planet Rekkiad in the galaxy's Outer Rim. Edric and Clan Ordo established a base camp on the snow-covered world and, led by clan chief Veela Ordo, began to search their surrounding territory for the mask. Acting as a sentry for the encampment, Edric was reunited with his old friend Canderous when the former Mandalorian mercenary arrived on Rekkiad with an undercover Revan to seek the Mandalore's Mask. He warmly greeted Canderous, and rushed both Canderous and Revan into a large supply building to get the two out of Rekkiad's cold weather. Inside, Edric joined several other Mandalorians in welcoming Canderous back to his clan until the arrival of Veela Ordo, Canderous' estranged wife. When she angrily accused Canderous of abandoning both her and his clan, it was Edric who came to his friend's defense by proposing cin vhetin, a Mandalorian tradition of forgiving an individual's past and offering them a clean slate; Veela agreed, and Canderous was allowed to remain with Clan Ordo. That night, Edric and numerous other members of the Ordo clan drank and celebrated the return of Canderous."}, {"tag": "p", "text": "The early hours of the following morning, Canderous and Revan spoke before a gathering of clan members, Edric among them, asking that Clan Ordo's camp be moved. Edric was resistant to talk of a relocation, stating that their current site was shielded from both the weather and any potential attack, though he relented when Revan explained that he knew where Mandalore's Mask had been hidden. Careful not to expose his true identity to the Mandalorians, Revan described the mask's location from a fragmented memory, which Edric recognized as the Twin Spears mountain. Satisfied that the potential benefits of finding the mask outweighed the hastle of moving the camp, Veela agreed to relocate. Once the encampment had been deconstructed and packed away for transit, Edric led a team of six scouts ahead of the clan to search for the best path; at nightfall, it was Edric's team who discovered a small ice valley suitable for Clan Ordo to spend the night. That evening, Edric again made an effort to catch up with Canderous, and include his old friend in the clan's festivities."}, {"tag": "p", "text": "Having moved into the territory occupied by the rival Clan Jendri, Clan Ordo came under attack early the next morning, but managed to repel the assault with the help of Revan and their six Basilisk war droids. When the Ordo clan reached the base of the Twin Spears, Edric was left in charge of watching over the camp while Veela led a team comprised of Canderous, Revan, the Basilisk pilot Grizzer, and four others up to the summit of the mountain. There, they found Mandalore's Mask, but Veela had determined Revan's identity during the earlier battle with Clan Jendri and turned on him, ordering her clan mates to attack the Jedi. Canderous defended his friend against the other Mandalorians' betrayal, and in the resulting firefight, Veela and the others were killed. Canderous claimed the mask of Mandalore, taking the title of Mandalore the Preserver, before returning to Edric and the rest of Clan Ordo."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Edric Ordo was a loyal and understanding friend, forgiving of a being's mistakes and supportive of their strengths. He believed in the Mandalorian concept of cin vhetin, the idea of allowing an individual to have a fresh start. An able scout and a competent tactician, Edric knew how to utilize the terrain to the benefit of himself and his clan."}, {"tag": "p", "text": "Edric enjoyed the Mandalorian ale known as kri'gee, despite its potency and bitter taste. He could speak the languages of Galactic Basic Standard and Mando'a."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Edric Ordo first appeared in Star Wars canon in the 2011 novel, The Old Republic: Revan by author Drew Karpyshyn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}