{"url": "Educational_Corps", "categories": ["Category:Legends articles", "Category:Jedi Order organizations"], "nodes": [{"tag": "h1", "text": "Educational Corps"}, {"tag": "p", "text": "The Educational Corps, also known as the EduCorps, was a branch of the Jedi Service Corps that was made up of teachers, scholars, and archivists. Made up of ranking and non-ranking members of the Jedi Order, it was the smallest branch of the Service Corps next to the Medical Corps."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Members of the EduCorps were assigned this work by the Council of Reassignment if they had failed to pass the Trials at the Jedi academy. Additionally, ranking members of the Order could also join the EduCorps; Lore Keepers who wished to remain in the Jedi Archives would sometimes join this group of scholars."}, {"tag": "p", "text": "The Educational Corps instructed its recruits in the ways of imparting knowledge, taught them not only to be effective instructors but also to show patience and compassion for their pupils. Above all, they needed to understand that one could not always rely on the Force to reach one's goal. The idea of forcing somebody to learn something through the Force violated the basic doctrines of the Jedi Order. The EduCorps provided instruction to the disadvantaged on countless worlds across the galaxy. Armed with the philosophy that knowledge of the universe and those who dwell in it increases one's understanding of life in the galaxy, these EduCorps scholars strove to learn all they could within the first few years of membership to prepare themselves to teach that knowledge to their future students."}, {"tag": "p", "text": "After the execution of Order 66 and the rise of the Galactic Empire, the EduCorps was dissolved and all its members were executed, or went into hiding. Decades later when the Order was rebuilt, Grand Master Luke Skywalker opted not to reform the EduCorps in favor of incorporating the ideas of both groups into the mainstream Jedi Order."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}