{"url": "Eero_Iridian%27s_species", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Unidentified sentient species"], "nodes": [{"tag": "h1", "text": "Eero Iridian's species"}, {"tag": "p", "text": "Flexible antennae distinguished members of a tall, spindly sentient species. The species also had feet, bright-yellow eyes, and shrill voices when concerned. They were members of the Galactic Republic during its final decades and were represented in the Galactic Senate by a senator. Eero Iridian, the senator's son, wished to replicate his father's success but twice failed to win the necessary election. Iridian later worked as an aide to Senator Blix Annon and arranged for his employer's kidnapping. The ploy was one of several abductions that Iridian organized in partnership with the pirate Lorian Nod to raise funds for another election campaign."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A sentient species had a tall, spindly physique. It was distinguished by bright-yellow eyes and flexible antennae. Nervous members of the species twirled these antennae around their fingers, and publicly embarrassed ones visibly bristled. The species had feet. Their skin became pale when injured, and they had a shrill voice when scared."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The species recognized father–son ties. At least some members of the species wore clothes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The species was part of the Galactic Republic in the decades prior to the government's transformation into the Galactic Empire. During that time, a member of the species attained the post of senator in the Galactic Senate. During the Senator's tenure, his son, Eero Iridian, became a senatorial aide with the goal of following in his father's footsteps. Around 90 BBY, Iridian presented a paper on the political history of the Corellian system but was publicly corrected by the Jedi Initiate Dooku. The pair became friends, trading favors during their careers. The Senator eventually retired from politics, having depleted his family's wealth."}, {"tag": "p", "text": "Iridian twice ran unsuccessfully for election as his homeworld's senator but became stymied by a lack of funds. He dropped out of public life, eventually taking a position as aide for Blix Annon, an important senator with strong support within the Jedi Order. Frustrated at his lackluster career, Iridian collaborated with the pirate Lorian Nod, arranging the kidnappings of numerous senators. The funds from the ransoms were to be used to fund another election campaign. Iridian ultimately arranged for the capture of Annon, and a successful kidnapping attempt was made while Iridian accompanied the Senator on a cruise to Annon's homeworld. Iridian feigned injury to his Jedi escorts—Dooku and his Padawan apprentice, Qui-Gon Jinn. He later set them up on the planet Von-Alai, leading to their capture by Nod. The kidnapping attempt went awry when Annon died of a heart attack. Iridian panicked, providing an opportunity for Dooku to turn the tables on Nod. Iridian was eventually handed over to the Coruscant Security Force to stand trial for murder and conspiracy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Eero Iridian's species was created by Jude Watson, author of the novel Legacy of the Jedi, which was published in 2003. The species was later mentioned in The Complete Star Wars Encyclopedia, published in 2008. Neither source gave the species a name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}