{"url": "Eeth_Koth%27s_daughter", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Unidentified daughters", "Category:Unidentified Force-users", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Eeth Koth's daughter"}, {"tag": "p", "text": "After the fall of the Galactic Republic, the former Jedi Master Eeth Koth fathered a daughter during the Imperial Era. The Zabrak female was born to Koth and his wife, Mira. Immediately following the girl's birth, Koth was discovered by the Sith Lord Darth Vader and killed in a duel. With her father dead, the child was taken by Vader to the planet Coruscant and placed into the care of Sith nursemaids."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This infant was born to Eeth Koth and his wife, Mira, on an unidentified planet. As soon as the baby was born, Koth asked Mira if he can hold his daughter. Mira said yes, as he was the father. This never happened, as Darth Vader appeared and confronted Koth, as he was a former Jedi. Koth ordered Mira to carry the baby and run. Mira almost made it to her father's transport when a red-skinned Inquisitor appeared. Mira begged her not to take her baby saying that they were both women. The Inquisitor pretended to let them go. Mira and her child boarded her father's ship, but as they ascended the Inquisitor used the Force to take the baby out of Mira's hands."}, {"tag": "p", "text": "The red-skinned Inquisitor brought the baby to Vader, who was in a lightsaber duel with her father. Koth saw the baby in the Inquisitor's hands and was killed from a slash in the back as Vader used the window of opportunity to force his advantage. The baby was given to Vader and continued crying in his hands before he used the Force to silence it. The group then took their Zeta-class shuttle back to Coruscant and the baby was given to two nursemaids to be put into Project Harvester. As the nursemaids took her, they exclaimed its prettiness in a manner that The Grand Inquisitor found worrying."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "She had black eyes and light skin."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Like her father, Eeth Koth's daughter was Force-sensitive and had the potential to connect to the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Eeth Koth's daughter first appeared in Darth Vader: Dark Lord of the Sith 19, a 2018 canon comic written by Charles Soule and illustrated by Giuseppe Camuncoli."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}