{"url": "Efrem_LX", "categories": ["Category:Canon articles", "Category:Articles with an excess of redlinks", "Category:Droids of unspecified degree"], "nodes": [{"tag": "h1", "text": "Efrem LX"}, {"tag": "p", "text": "Efrem LX was a droid who was active during the time of the war between the First Order and the Resistance. In 35 ABY, Efrem LX was present in Kijimi City on the planet Kijimi at the same time as several Resistance operatives undertook a mission on the planet. Shortly afterward, Kijimi was destroyed as a show of force by the newly-established Final Order regime."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 35 ABY, during the war between the First Order and the Resistance, Efrem LX was present in Kijimi City, a city on the frigid planet of Kijimi. The city was under occupation by the First Order regime, whose patrols displeased many of its citizens. During the time that Efrem LX was on Kijimi, the Resistance members Poe Dameron, Finn, and Rey visited the planet in search of the droidsmith Babu Frik. As Efrem LX stood in the streets of Kijimi City, watching a passing group of First Order stormtroopers, the Resistance operatives were led past the droid's location by Zorii Bliss, leader of the criminal gang known as the Spice Runners of Kijimi."}, {"tag": "p", "text": "Shortly afterward, Efrem LX was present inside the den of the Spice Runners, watching as Bliss walked by with the Resistance members. Some time later, once the Resistance operatives had escaped Kijimi, the planet was targeted by the Final Order, the empire built by the reborn Emperor Palpatine, in a show of force against the galaxy. The Xyston-class Star Destroyer Derriphan was dispatched to destroy Kijimi, obliterating the planet with its axial superlaser."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Efrem LX was a droid with a humanoid figure. The droid had a singular blue photoreceptor on the right side of its face, and had plating colored dark gray and bronze."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the time of the war between the First Order and the Resistance, Efrem LX possessed a blaster pistol and carried various pieces of equipment strapped to its torso and legs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Efrem LX appeared in the 2019 film Star Wars: Episode IX The Rise of Skywalker. The character was first identified on a card in the 2019 Topps Star Wars: The Rise of Skywalker Series 1 trading card set, released by The Topps Company, Inc. on the same day as the film. Efrem LX's card in Star Wars: Card Trader capitalizes the droid's name as \"Efrem Lx.\""}, {"tag": "p", "text": "Concept art for Efrem LX was created by Jake Lunt Davies, who described the character as a SWAT military combat version of a protocol droid. Mohsen Nouri portrayed the droid in The Rise of Skywalker, wearing a full-body suit. Various pieces of the suit, including the head, were modeled and sculpted by Andre Gilbert and Scott Riley, who used digital assets for C-3PO as a starting point, adding details from Lunt Davies' original design. Olivia Whitaker was responsible for molding and casting in fiberglass, while Fiona Pollard created the body suit containing various pieces of technology. The final suit was assembled and painted by Sean Schofield."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}