{"url": "Egot_Pai-4-Yem", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Business owners and executives", "Category:Crime lords", "Category:Humanoids", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Egot Pai-4-Yem"}, {"tag": "p", "text": "Egot Pai-4-Yem, or The Boneman as he was often referred to as on Harridan, was a tall, almost skeletal humanoid with large, staring eyes and saggy, corpse-colored skin. He had a lisping voice which echoed deeply from his large, bony chest. However, behind this mournful appearance lurked a quick, cruel mind that had ordered the death of thousands. He could not stand to admit defeat, and as a consequence has taken many incredible risks to gain the upper hand in situations which his numerous scars could attest to. Shortly before the start of the Galactic Civil War, Egot began to set up his criminal empire in the very heart of Harridan's capital, Spaceport City. He quickly came into conflict with the city's various ruling powers, but managed to display a real talent for elusiveness, always managing to remain outside of the authorities reach. Due in part to his cadaverous appearance, and also partially to his deadliness, he earned the nickname of The Boneman on Harridan; a title he gladly accepted, and even named his cantina, The Boneman's Rest, after."}, {"tag": "p", "text": "During the Galactic Civil War, a Rebel smuggler, also from the planet Harridan, asked a group of his fellow rebels to accompany him to his home planet to pay off a debt of 25,000 credits to Egot. Egot led them through a series of events, starting with booking themselves in the Lullaby Motel as a honeymooning couple, and leading to the eventual confrontation with Egot in his warehouse. Before the smuggler managed to pay Egot his money back, however, the local police force entered the warehouse in force; they had previously placed a tracer in the smugglers bag which contained the money. Assuming the rebels had led the police to him purposefully, Egot ordered his guards to eliminate them. However, thanks in part to the help from the local police, the group managed to survive as Egot fled the warehouse in his personal ship, the Razorshark."}, {"tag": "p", "text": "Egot fled to the moon of Harridan in the Razorshark and, upon discovering that the rebels had managed to survive, he took to lurking on the surface of the moon until he discovered the rebels ship passing. As soon as he noticed the ship, he launched into an insane attack. Though he had no chance of winning, he had been driven nearly insane by his anger at them. Unfortunately for him, the appearance of the Victory-class Star Destroyer Titan soon ended the battle, and his ship was captured in its tractor beam. This allowed the rebel ship to jump to hyperspace. Egot's fate is unknown, though it is thought that the Imperials would have turned him over to the local police force."}, {"tag": "h2", "text": "Sources"}]}