{"url": "Eighth_Brother%27s_lightsaber", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Eighth Brother's lightsaber"}, {"tag": "p", "text": "The Eighth Brother's lightsaber was a double-bladed spinning lightsaber wielded by the Jedi hunter known as the Eighth Brother, similar to other double-bladed spinning lightsabers wielded by Imperial Inquisitors."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The weapon featured a ringed emitter, allowing the twin blades to rotate rapidly without effort from the wielder. For a Jedi hunter like an Inquisitor, this function likely served as a way to intimidate opponents, as well as deflect any form of frontal attack. However, this was also the weapon's primary weakness, as a lightsaber-wielding opponent could simply destroy the emitter itself and cut the weapon in half, as was demonstrated by Kanan Jarrus during his final duel with the Grand Inquisitor aboard the Sovereign."}, {"tag": "p", "text": "It could also be used to fly, spinning in a helicopter-like motion strong enough to lift the wielder off the ground."}, {"tag": "p", "text": "Additionally, the Eighth Brother's lightsaber was distinct among other double-bladed spinning lightsabers used by his fellow members of the Inquisitorius in that it had the unique ability to convert into a buzz-saw-like weapon that employed the handle while the blades were deactivated. This mechanism appears in place of the hinges on the emitter rails of other Inquisitors' lightsabers, disallowing the Eight Brother from folding the guard into a crescent shape."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Eighth Brother was trained in the use of this lightsaber alongside his fellow Inquisitors in The Works on Coruscant under the tutelage of the Grand Inquisitor."}, {"tag": "p", "text": "The Eighth Brother carried his lightsaber while on his assignment tracking Maul, whom he referred to as \"the Shadow\" on Malachor. He used it in combat against the three rebel Jedi: Kanan Jarrus, Ezra Bridger, and Ahsoka Tano, when they arrived on their mission to Malachor. Ultimately, following the deaths of the Seventh Sister and the Fifth Brother at the hands of Maul, the outnumbered Eighth Brother attempted to flee from the enemy Force-wielders using his lightsaber's spinning blades to slow his descent as he leaped from the Sith temple. However, the lightsaber had been damaged by Jarrus immediately prior to this and it malfunctioned and broke apart mid-air, causing the Eighth Brother to fall to his death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}