{"url": "Eighty-sixth_Infantry", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Republic Infantry divisions"], "nodes": [{"tag": "h1", "text": "Eighty-sixth Infantry"}, {"tag": "p", "text": "The Eighty-sixth Infantry was a division in the Republic Army during the Cold War and the Republic's Galactic War with the Sith Empire. In 3642 BBY, a detachment assigned to the planet Quesh's Adrenal Research Base under Lieutenant Gundo and the Jedi Sajar were forced to defend the compound when it came under attack by Imperial forces during the Empire's invasion of the world."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A division in the Republic Army during the Cold War between the Galactic Republic and the Sith Empire, the Eighty-sixth Infantry was one of many units stationed at Republic military bases across the galaxy. By the year 3642 BBY, when the Galactic War broke out between the two galactic powers, a detachment under the command of the Mirialan Lieutenant Gundo had been assigned to guard the Adrenal Research Base on the planet Quesh. The Jedi Padawan Sajar, a former Sith Lord and the apprentice of Jedi Master Tol Braga, was also assigned to the base so that he could meditate on the light side of the Force while still serving the Republic. Gundo's detachment included several engineers who worked with the facility's staff, and the soldiers were forced into battle when the Empire invaded the planet to force the Republic fully into open war."}, {"tag": "p", "text": "When Gundo's men captured Imperial scouts, Sajar accidentally succumbed to the dark side and killed them in interrogation, and his subsequent rage-fueled taunting of the Imperial forces drew the ire of the attackers. Once he came to his senses, Sajar was horrified and refused to fight in fear of slipping further towards the dark side, leaving Gundo and his men significantly outnumbered. However, with the help of the Jedi Knight known as the Hero of Tython, who had been sent by Braga to learn why his apprentice was not responding, the Eighty-sixth Infantry was able to push back the Imperial attackers and set up several jury-rigged ray shields to protect the facility until reinforcements arrived."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As an infantry division in the Republic Army, the Eighty-sixth was outfitted with standard trooper armor. The division's armor featured white, gray, and gold coloring, and many soldiers carried standard-issue blaster rifles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eighty-sixth Infantry first appeared in the Jedi Knight class mission \"The Emperor's Wrath\" in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}