{"url": "Agrular", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Criminals", "Category:Force-sensitives", "Category:Gen'Dai", "Category:Males"], "nodes": [{"tag": "h1", "text": "Agrular"}, {"tag": "p", "text": "Agrular, also known as Agrular the Mad, was a dangerous male Force-sensitive Gen'Dai who lived during the time of Galactic War between the Galactic Republic and the reconstituted Sith Empire. He was imprisoned on the planet Belsavis for numerous crimes. During the fighting between Republic and Sith, the Crime Lord Ivory attempted to free multiple people, including Argular despite having no known connection, but the henchmen he sent were all defeated by a smuggler affiliated with Ivory's protégé Rogun Matt'rik."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Following the Great Galactic War, Agrular the Mad was known to be a dangerous war criminal who spread fear across the galaxy, not just because of his species-trait of near immortality, but for being a spice addict and a force-user, a dangerous combination. When the Republic made the move to apprehend him, Agrular struck down numerous Jedi before eventually being taken prisoner."}, {"tag": "p", "text": "After numerous years of being locked in stasis in Belsavis, where most staff knew his name, he was sought out by Ivory; a crime lord seeking aid in escaping his own prison sentence. He sent two of his henchmen to free the Gen'Dai, Squarg and Buzz, but they were soon interrupted by a smuggler who was on his own mission to capture Ivory himself."}, {"tag": "p", "text": "Initially, Ivory and the Smuggler spoke, but soon the Smuggler killed the henchmen while they argued and released Agrular anyway, to prevent Ivory sending backup. Lamenting being locked in stasis, away from killing, for so long, Agrular drew his blade and declared that the Smuggler would be his 'welcome back' present into the underworld. Unfortunately for him, he was no match for his target who struck him down moments later."}, {"tag": "h2", "text": "Appearances"}]}