{"url": "Ela_b%27Yentarr", "categories": ["Category:Legends articles", "Category:Stub", "Category:Bosph culture", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "Ela b'Yentarr"}, {"tag": "p", "text": "Ela b'Yentarr was the name given by Bosph society to members of their species who were Force-sensitive. Bosph believed that the Force was a manifestation of the power of the Yentarr, meaning unknown spirits, which were an deity-like entity the Bosph believed in and attributed all unexplainable phenomena to."}, {"tag": "p", "text": "When young Bosph were found to show signs of being Force-sensitive they were inducted as apprentices into one of the various factions that made up the planet Bosph's government. Each faction was made up entirely of ela b'Yentarr and focused on different aspects of the Force. The faction known as the gamefinders taught their members techniques to help them in hunting such as Force sense and precognition and the sickhealers learned how to use the Force to heal with techniques like Force healing, Control Pain and Control Disease. A faction known as the farseers also existed who were given access to the teachings of Bosph philosophers. The conduct of each faction also differed, with some having moral codes similar to the Jedi Order's code and others utilising the Dark side of the Force, although all ela b'Yentarr were aware of the moral implications of using such power. To use the force, Bosphs also believed certain rituals and ceremonies must be performed to summon the unknown spirits, which lead to them not using some longer lasting Force powers."}, {"tag": "p", "text": "Ela b'Yentarr were also the only members of Bosph society allowed the right of ownership. They could claim ownership of any object using a rune-encrusted glyph pendant. If a conflict of ownership arose, then a duel would be fought between the two ela b'Yentarr, sometimes to the death. All unclaimed items were considered equally owned by all individuals in Bosph society."}, {"tag": "p", "text": "When the galactic Emperor Palpatine discovered that the ela b'Yentarr were Force-sensitive, he had Bosph bombarded, killing the many Bosph including large numbers of ela b'Yentarr. One of the few ela b'Yentarr left alive was the farseer Bora Boru who went on to become a smuggler."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}