{"url": "Elassar_Targon", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Devaronians", "Category:Galactic Alliance individuals", "Category:Healers and doctors", "Category:Males", "Category:New Republic Intelligence personnel", "Category:Pilots", "Category:Wraith Squadron personnel"], "nodes": [{"tag": "h1", "text": "Elassar Targon"}, {"tag": "p", "text": "Elassar Targon was a superstitious male Devaronian from Devaron. He joined the New Republic Defense Force and eventually served in Wraith Squadron as the unit medic in the campaign against Warlord Zsinj. As one of the newer members of the squadron, Targon suffered some bantering from his fellow pilots, but he took the kidding in good stead. In their mission planning, Targon advocated a more aggressive approach to combating Zsinj, but he was rebutted by fellow squadmate Shalla Nelprin. He participated in several missions against Zsinj, including the Battle of Vahaba and the Battle of Selaggis. After Wraith Squadron was shifted over to become an Intelligence unit, Targon stayed in the unit and participated in an operation to eliminate Imperial admiral Kosh Teradoc. He was still in active service as of the Yuuzhan Vong War. He was present for part of the Battle of Borleias, but was later assigned to accompany several other members of the Wraiths, the scientist Danni Quee, and three Jedi to occupied Coruscant. On Coruscant, he helped investigate the former galactic capital's condition and eventually returned to Borleias once the mission was completed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A male Devaronian, Elassar Targon grew up on the planet Devaron in the Duluur sector of the Colonies and had at least one brother. At one point before he entered New Republic service, Targon captured the attentions of a female, an event he attributed to his lucky gilding set."}, {"tag": "h3", "text": "Transfer to the Wraiths"}, {"tag": "p", "text": "In 7 ABY, Targon completed his training at the New Republic's Fleet Command Academy and transferred to Wraith Squadron with the call sign of Wraith Eleven, while the unit was stationed aboard the Mon Calamari Star Cruiser Mon Remonda. At the time of his arrival, Mon Remonda was in spacedock at Coruscant, completing repairs to damage it had sustained earlier in the battles against Warlord Zsinj. As the flagship of General Han Solo's fleet in a protracted campaign against Zsinj, Mon Remonda, and by extension Wraith Squadron and Targon, were soon to be deployed again. The squadron's commanding officer, Wedge Antilles, introduced Targon to the other Wraiths at a briefing, where he also informed them that they had one day of leave remaining. As Targon met the others, Wes Janson, executive officer of Wraith Squadron, jokingly took exception to Targon's clean record—the original roster for Wraith Squadron had been largely filled with misfit and washout pilots. In response, Targon adopted a swashbuckling pose and attitude; his actions were effective in convincing Janson and other pilots that he belonged in the unit. This also served to surprise Antilles, who wondered if Targon was a lunatic or had merely heard of the unit's unusual reputation and had decided to play along."}, {"tag": "p", "text": "Targon was assigned as the squadron medic, as he was trained as a corpsman at the Academy. In addition, as with all members of Wraith Squadron, he was placed on active flying duty as a starfighter pilot. On his first day in the unit, some of the other pilots took him to see the new exhibit on Imperial Intelligence at the Galactic Museum. While at the museum, they learned from Targon of his penchant for superstition, as the Devaronian pilot had several good luck charms that he kept in his quarters or on his person."}, {"tag": "p", "text": "The next day, Targon departed with the rest of the squadron on Mon Remonda. On his first mission, Targon and the Wraiths were deployed, along with the other starfighters on Mon Remonda, to conduct search and rescue missions on Levian Two, a New Republic world Zsinj's forces had recently attacked. However, before the starfighters reached the surface, a large number of Zsinj's warships reverted from hyperspace and engaged Solo's fleet. As Zsinj's starfighters had all moved to engage Solo's capital ships, the New Republic squadrons were able to damage the engines of Zsinj's flagship, the Super Star Destroyer Iron Fist. The Wraiths then crippled a hostile Carrack-class cruiser, and their efforts, combined with that of other New Republic vessels, weakened Zsinj's fleet enough for the New Republic forces to safely withdraw. During the battle, Targon's wingman, Janson, was hit by ion cannon fire, but he was recovered and Targon emerged unscathed."}, {"tag": "p", "text": "Later, in an impromptu discussion with other members from Wraith and Rogue Squadrons following the battle, Targon voiced his opinion that all possible leads to Zsinj's fleet should be followed up, a viewpoint that Wraith Shalla Nelprin disagreed with, saying that some of them were undoubtedly traps. Targon insinuated that to not take an aggressive course in the campaign against Zsinj was cowardly, but Nelprin disavowed that notion, saying that prudence was needed in order to prevent unnecessary deaths. Ultimately, the session resulted in the Wraiths coming up with an idea to use a fake Millennium Falcon as bait for Zsinj, since the warlord had a vendetta against Han Solo. However, to Targon's chagrin, Solo had been present in the room when he had referred to Solo's actions as cowardly. Targon saw his offhanded reference as unlucky and facetiously asked several other pilots to kill him to ease his alleged shame."}, {"tag": "h3", "text": "Saffalore"}, {"tag": "p", "text": "The next mission assigned to Wraith Squadron was a commando strike on a Binring Biomedical Product facility on the world of Saffalore. A member of Wraith Squadron, Gamorrean Voort saBinring, had been raised and biologically modified there and previous Wraith Squadron missions had established a link between Zsinj and the Binring Biomedical laboratory. However, as the unit anticipated resistance, Antilles arranged for Rogue Squadron to provide backup firepower in their starfighters, on standby in case the Wraiths needed them."}, {"tag": "p", "text": "The two squadrons flew their fighters to Saffalore under the cover of an artificial meteor shower created by New Republic forces and landed outside the city of Lurark without being detected. The Wraiths then appropriated a civilian skimmer and entered the city, identifying and reconnoitering the Binring Biomedical facility discreetly. Their efforts yielded them an entry point and under cover of darkness they scaled the roof of a building they believed contained a special project of Zsinj's. While most of the squadron entered the building, Targon was left on the roof with Lara Notsil and the two were assigned the task of placing infrared markers at various points on the roof that would be used as reference points by Rogue Squadron in case the Wraiths needed to call in air strikes."}, {"tag": "p", "text": "While planting markers, Targon discovered an extra layer of security in the form of rooftop pressure sensors. Though the Wraiths had yet to trip any alarms, the presence of redundant anti-intruder measures meant they were expected. Notsil used her comlink to warn the intrusion party of the danger. However, Zsinj's forces were already aware of their approach. While they sprang a trap for the intrusion party, a squad of stormtroopers was sent to the roof to attack Notsil and Targon. The two Wraiths tried to hold them off with blaster pistol fire, but they were prevented from calling for Rogue Squadron backup by comlink jamming activated by the Empire. The unit sniper, Myn Donos, was able to kill one of the stormtroopers with his laser rifle, allowing Targon to take down several other troopers as they scrambled to avoid Donos's fire. In response, the remaining stormtroopers charged the two Wraiths, who returned fire. However, when a pair of TIE Fighters arrived, Notsil, Donos, and Targon were forced to surrender."}, {"tag": "p", "text": "Meanwhile, the intrusion team was able to patch through the jamming and signal Rogue Squadron. The arrival of the X-wings destroyed both the TIE Fighters and Targon, Donos, and Notsil quickly seized their weapons and blasted the few remaining stormtroopers. Notsil and Targon boarded a vehicle Donos had acquired and, apprised of the intrusion party's status by Rogue Squadron pilot Tal'dira, moved into position to extract them once the Rogues destroyed part of a building to provide an escape route. The squadron, with several members injured, then withdrew back to their starfighters. Targon provided the injured with medical treatment and they returned to Mon Remonda."}, {"tag": "h3", "text": "Jussafet and Kidriff"}, {"tag": "p", "text": "As one of the few Wraiths fit to fly for their next mission, a strike against Zsinj's elite forces on Jussafet Four, Targon flew with the squadron, acting as an escort for New Republic assault shuttles. He then provided air support, allowing the New Republic ground troops to seize the main hostile camp. Following the battle, Antilles called in Targon along with the rest of the squadron for another impromptu strategy meeting to discern Zsinj's link to recent terrorism incidents across the New Republic, all perpetrated by Twi'leks or Gotals. Antilles also hoped to predict what Zsinj's next phase of this plan was, as the incidents were causing divisions in the New Republic. The Wraiths were ultimately successful in identifying the Imperial brainwashing technique used to turn certain alien species into mindless terrorists and anticipating Zsinj's plans, allowing New Republic Intelligence to stop further terrorist attacks from happening."}, {"tag": "p", "text": "For Targon and the rest of Wraith Squadron, their next mission was to Kidriff 5, the first stop for their Millennium Falcon facsimile, dubbed the Millennium Falsehood. Prior to the mission, Targon felt that a sneeze by Thakwaash Wraith Squadron member Hohass Ekwesh was unlucky and therefore did his best to apply good luck charms to Ekwesh's fighter, to the consternation of the other pilot. Targon, along with Janson, Nelprin, and Kell Tainer, was assigned to fly a TIE Interceptor to the surface, posing as a group of Imperial fighter pilots on leave until the crew of the Falsehood called for aid. They landed without incident, and Tainer ordered Targon and Nelprin to remain behind and guard the ships that evening while he and Janson explored. When Targon protested, Tainer reminded him of the paucity of Devaronian pilots in Zsinj's forces or the Empire."}, {"tag": "p", "text": "When the Millennium Falsehood was flushed from its landing site by local security forces, Targon and the other three Wraiths took off in their TIEs to provide assistance if needed. The Kidriff defenders ordered them to stand down and the four Wraith Squadron interceptors found themselves in a dogfight against the local defense. Targon destroyed at least one hostile craft in the engagement, but at one point left his wingman, Tainer, unprotected, to his chagrin. They both emerged from the engagement without damage and the squadrons withdrew, but the surprising revelation that Lara Notsil had once been a member of Imperial Intelligence, coupled with Donos firing on her and her subsequent departure from the unit as she jumped to hyperspace, brought squadron morale down. The theory that Notsil had turned to Zsinj's employ did little to improve their spirits, though Antilles rejected it outright."}, {"tag": "p", "text": "Over the next few weeks, Mon Remonda's starfighter complement was kept busy launching numerous raids against Zsinj's military and industrial facilities. Wraith Squadron launched both air and commando raids on them and inflicted significant damage to Zsinj's financial empire, though the pilots, including Targon, had hectic schedules due to the number of missions. However, he and the rest of the unit were observers of a prank by Wedge Antilles that ended up with Wes Janson appearing naked in front of the entire squadron."}, {"tag": "h3", "text": "The final stages"}, {"tag": "p", "text": "Targon participated in the inconclusive Raid on Comkin V, another Millennium Falsehood escort run that saw the Wraiths again fly cover for the light freighter, fending off Zsinj's forces. During the engagement, one of Zsinj's fighters, flown by Notsil, discreetly pulsed a transmission to the Millennium Falsehood via its laser cannons, providing an opportunity for Solo's fleet to attack Zsinj at the Vahaba asteroids."}, {"tag": "p", "text": "Targon also flew in the Battle of Vahaba, attacking Iron Fist as part of a twenty-two-squadron task force. However, though Zsinj's flagship was damaged, it managed to escape to hyperspace. Thanks to sabotage by Notsil, it nevertheless reverted at nearby Selaggis and Solo, tipped off by Notsil, followed Zsinj. Once again, Targon and the other members of Wraith Squadron flew into battle against Zsinj's fleet. Rogue and Wraith Squadrons engaged Zsinj's TIEs, but when starfighters marked as belonging to the elite 181st Imperial Fighter Group—actually a Zsinj-created replica of the famous unit—began flying down to attack a ruined settlement on the sixth moon of Selaggis, the Rogues and Wraiths pursued. Flying a TIE Interceptor, Targon reached the hostile fighters ahead of the other New Republic starfighters due to the slower maximum atmospheric velocities of their X-wings. A prolonged duel between the two groups of starfighters occurred, until Rogue pilot Corran Horn realized that the some fighters they were facing were droids instead of living pilots. Implementing communications jamming ruined the coordination between the droid and Human pilots and the enemy starfighters soon fell before them. In the larger scale of the battle, Iron Fist was believed destroyed—it had actually withdrawn after taking heavy damage—and the New Republic emerged victorious. In the aftermath of the battle, Targon learned that Wraith Squadron had been transferred to New Republic Intelligence, and while others left he decided to stay with the unit, under the command of Wraith Leader Garik Loran."}, {"tag": "p", "text": "During a mission to eliminate Imperial admiral Kosh Teradoc on Ryvester in 13 ABY, Targon served as the driver of the getaway airspeeder while several other members of the Wraiths set up a meeting with Teradoc and then induced a fake raid to persuade Teradoc to flee with an explosive disguised as a valuable gem-laden artifact. Their ruse was successful and Teradoc took the artifact back to his base where the explosive inside was triggered when he reached his vault. The Wraiths were also able to rescue Mulus Cheems, a gemologist whom Teradoc had brought to authenticate the piece. Once the Wraiths and Cheems were aboard the speeder, Targon drove them to a nearby marina, where they stole Teradoc's yacht and departed onto the open waters. With the danger passed, Targon grilled several bantha steaks for his fellow Wraiths as they appropriated Teradoc's food and drinks for an impromptu celebration."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "Targon was still in the Wraiths during the Yuuzhan Vong War and made his way to Borleias after the Battle of Coruscant. He and the rest of the unit served under Wedge Antilles, the garrison commander at Borleias during the Yuuzhan Vong siege, but he and several others were selected to accompany a group of Jedi, including Luke and Mara Jade Skywalker and the scientist Danni Quee, on a mission to Coruscant."}, {"tag": "p", "text": "The group of Wraiths and Jedi were inserted into Coruscant by dropping from the freighter Record Time in repulsorlift insertion pods, which Targon had used on three earlier missions successfully. They plunged from orbit to the surface, clad in Yuuzhan Vong disguises and set about exploring the fallen galactic capital."}, {"tag": "p", "text": "Targon and the scouting party eventually encountered a party of Yuuzhan Vong warriors, but the Yuuzhan Vong were fooled by their disguises until they were close to each other. A fight broke out between the New Republic group and the Yuuzhan Vong, and Targon helped pick off warriors while the Jedi did most of the fighting. An explosive planted by Kell Tainer finished off the rest of their opponents and the New Republic infiltrators moved on, continuing to explore the ruined capital. At one point, Targon was with several of the others during a series of scouting missions when Jedi Tahiri Veila uncovered a hidden laboratory and a source of dark side Force energy."}, {"tag": "p", "text": "The Jedi located the laboratory and found it abandoned and supplied with fresh air, so the party made it their headquarters. Working with Tainer, Targon helped seal off most of the entrances to prevent a renegade Dark Jedi named Lord Nyax, who had once lived in the laboratory, from returning unnoticed. Over the next several weeks, the Wraiths and Jedi continued to explore the ruined capital, while Danni Quee and Wraith biologist Baljos Arnjak took scientific readings of the planet's changing ecology. Eventually, the Jedi clashed with Lord Nyax and, during the process, Kell Tainer obtained a beckon call that led to an escape craft, the Ugly Truth. While the Jedi chased down Nyax, Luke Skywalker ordered the rest of the Wraiths, including Targon, to prepare for imminent departure. En route to the Ugly Truth, the Force-sensitive Quee experienced a disturbance in the Force, which sent her falling to her knees. Targon was concerned for her physical condition, but she shrugged off the fall, saying she wasn't hurt, and they continued to the escape craft. They boarded it and picked up the three Jedi, who had finished off Nyax, and the Ugly Truth returned to Borleias."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Targon was a highly strung being who had a superstitious belief in the importance of luck and its influence in everyday life. He persisted in his beliefs in good luck charms throughout much of his life, to the point where he made motions to ward off bad luck habitually. He was also a trained medic and a skilled pilot, capable enough for inclusion into the ranks of Wraith Squadron, and he was assigned a TIE Interceptor during the campaign against Zsinj. As a recent graduate from the Fleet Command Academy upon his entrance into military service, Targon had a spotless record, a rarity for pilots in Wraith Squadron. Early in his career, he was also excitable in combat, at one point inadvertently leaving his wingmate unprotected. Targon also advocated a more straightforward means of engaging Zsinj, but in the process of making his case, seemingly insulted the courage of General Han Solo, which he viewed as an incredibly unlucky deed. It was at such moments that Targon grew melodramatic, jokingly asking various members of the squadron to kill him to ease his shame. He was also known to proclaim himself as the master of the universe. Elassar's relaxed approach helped him fit in well with Wraith Squadron and his sense of humor earned him the friendship of Garik Loran, who took a liking to the amicable Devaronian pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Targon's first appearance was in the novel X-Wing: Solo Command, written by Aaron Allston. He would also have appearances in the Enemy Lines duology, which Allston wrote for The New Jedi Order series of books, as well as a mention in an article on Wraith Squadron in Star Wars Gamer 9, written by Joshua J. Radke. That article also provided the sole canonical image of Targon, courtesy of artist Joe Corroney. Several years later, Targon had a fleeting appearance in another one of Allston's novels, X-Wing: Mercy Kill. Elassar received an entry in the 2008 reference book The Complete Star Wars Encyclopedia. The entry erroneously states that Targon joined Wraith Squadron after the loss of Lara Notsil, who did not leave the squadron until the end of Solo Command. It also states that Targon addressed the Wraiths as \"masters of the universe\" during their first meeting, while in Solo Command he actually introduced himself as \"master of the universe.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}