{"url": "Eldo_Davip", "categories": ["Category:Legends articles", "Category:Galactic Alliance Defense Fleet admirals", "Category:Humans", "Category:Males", "Category:New Republic Defense Fleet officers"], "nodes": [{"tag": "h1", "text": "Eldo Davip"}, {"tag": "p", "text": "Eldo Davip was a male Human who served as a commander of the New Republic Defense Force at the time of the Yuuzhan Vong War and general of the Galactic Alliance during the Second Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Yuuzhan Vong War"}, {"tag": "p", "text": "Long known for a history of indecisiveness, Commander Davip was placed in charge of the Lusankya during the Battle of Borleias. In a somewhat embarrassing incident, Davip managed to accidentally land the Lusankya right in the middle of Commander Wyrpuuk Cha's fleet as it arrived within the Pyria system. As New Republic warships rushed to Lusankya's aid, the Super Star Destroyer luckily was able to blast its way out and annihilate the enemy fleet with its sheer firepower alone."}, {"tag": "p", "text": "Davip would go on to support the defense of Borleias from the Yuuzhan Vong for the next several months. During Operation Emperor's Hammer, he personally took command of a turbolaser station—seeing a perverse pleasure in baffling his subordinates in the process. While Lusankya and its supporting vessels were able to hold the line against enemy forces for several months, she gradually began to succumb to battle damage and attrition. Sensing this, Wedge Antilles devised a plan in which Lusankya's weapons were transferred off to supporting vessels, while a massive needle-like structure was constructed within the hull of the Super Star Destroyer and loaded with explosives."}, {"tag": "p", "text": "When the time came for the New Republic to abandon Borleias, Davip alone would pilot his former command ship—now converted into a giant missile—on its final mission. Prior to the mission he remarked to Wedge Antilles, Luke Skywalker, and Mara Jade Skywalker, that he would go down in history as the pilot of the \"largest one person fighter ever\". With support from the remaining Republic fleet, Davip was able to successfully ram the Domain Hul worldship, destroying it with former Warmaster Czulkang Lah aboard. Davip escaped in a Y-wing as the explosion consumed both ships."}, {"tag": "p", "text": "In the chaos following the destruction of the Domain Hul worldship, the New Republic was able to successfully withdraw its forces from the Pyria system. For his efforts, Davip was promoted to Major General, and became part of the Galactic Alliance Defense Force command staff."}, {"tag": "h3", "text": "Post-War Role"}, {"tag": "p", "text": "In 44 ABY, General Davip was placed in charge of the Galactic Alliance military contingent on Borleias. This assignment was considered to be typical for officers who had long since passed their prime. Out of a sense of loyalty, Davip had sided with Chief of State Jacen Solo during the Second Galactic Civil War and thus was assigned to Borleias to finish out his career quietly. He was present when the Errant Venture arrived carrying Wynn Dorvan, Moff Drikl Lecersen, and other VIP sabacc players that had been temporarily kidnapped from Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}