{"url": "Electric_Judgment", "categories": ["Category:Legends articles", "Category:Alter powers", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Electric Judgment"}, {"tag": "p", "text": "Electric Judgment, also known as Emerald Lightning, was a Force technique used by the Jedi to spray electric bolts of variable intensity from the hands and fingers."}, {"tag": "p", "text": "Despite being classified as a forbidden Force power within the Jedi Order, a few Jedi such as Plo Koon and Jacen Solo practiced it."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Electric Judgement showed up as  yellow/orange or green force energy instead of blue or white, but otherwise it was very similar in both appearance and usage to the dark side Force power known as Force lightning. One common difference was that the Jedi's application came from a sense of determined justice.  However, on at least one occasion this Light Side power was channeled using a Jedi’s anger. Electric Judgment#cite note-Destiny.27s Way-5"}, {"tag": "h2", "text": "Variants"}, {"tag": "p", "text": "The dark side form of this ability is known as Force lightning."}, {"tag": "p", "text": "Another variant would be the Force ability Kinetite."}, {"tag": "h2", "text": "Notable Practitioners"}, {"tag": "p", "text": "Among the Jedi Order, this Force ability was uncommon and controversial due to its use having intrinsic association with anger and aggression and its similarity to Force lightning. It was even featured on Jedi Seer Sabla-Mandibu's list of \"Forbidden Force Techniques\" and classified as prohibited to be used by Jedi Knights. A few Jedi Masters such as Plo Koon however were studying the technique under controlled conditions."}, {"tag": "p", "text": "During a mission to capture the criminal known as Dreed Pommel, Plo Koon confronted him at a suite in city of Ektra, Metellos. Pommel had taken a young girl hostage and killed her entire family. During this encounter, Koon let out a barrage of lightning at Pommel's head and then a second burst of lightning that knocked him unconscious."}, {"tag": "p", "text": "He immediately reported this incident to the Jedi Council and stated that he had not felt any anger or fear as he let out the blast of Force lightning but was indeed calm and in control of his emotions. The Council asked him to contemplate whether he felt it was wrong of him to have utilized its power during the mission and whether he would use it again."}, {"tag": "p", "text": "After much meditation, Koon concluded that it would be wrong of him to ignore its power and that he should develop it into a useful technique. As requested by the Council, he recorded his experiences with the Force lightning that he dubbed \"Electric Judgment\" on the Great Holocron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Anakin Solo possibly used this when he was consumed by the light side of the Force just before his death, with streams of energy flowing from his limbs into his enemies. Jacen Solo also used this power against Yuuzhan Vong Warriors at the Battle of Ebaq 9. It was believed that Grand Master Luke Skywalker used this power, or a variation of it, aboard Shimrra's Citadel during the battle against Shimrra Jamaane in an attempt to save his niece and nephew from the Slayers; his powerful version sent green sparks coruscating over the body of a Slayer, instantly killing him and causing his body to convulse."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}