{"url": "Electro-whip", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Electrical weaponry", "Category:Whips"], "nodes": [{"tag": "h1", "text": "Electro-whip"}, {"tag": "p", "text": "An electro-whip, also called a Zygerrian slaver whip or a lightwhip, was an electrified whip that was the preferred method of domination for the subjugation of slaves taken by the Zygerrian Slave Empire. It consisted of a metal grip and an electrified wire that glowed when powered up. The wire could be retracted into the grip when powered down. It was incredibly painful, but typically not physically damaging, as Zygerrians did not want to damage their merchandise irreparably. Electro-whips could be effectively used against lightsabers. Members of the Mining Guild were also known to use the weapon during the Imperial Era. The alternate name \"lightwhip\" typically referred to an unrelated lightsaber variant with pure plasma blades."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Electro-whips consisted of a metal grip and an electrified, retractable wire that glowed when powered up, and automatically retracted into the grip when the weapon was powered off. The whips were designed to stun, and although they were painful, they were not typically physically damaging, as Zygerrian slavers preferred not to irreparably damage their merchandise. Electro-whips could withstand the blade of a lightsaber while powered up. \"Lightwhip\" was a known alternate term for the weapon, although the word usually referred to a specialized lightsaber variant with flexible blades made of pure plasma."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Electro-whips were heavily associated with the Zygerrian Slave Empire and its practice of slavery and, for this reason, were also known as Zygerrian slaver whips. The Zygerrian slaver Darts D'Nar attempted to fight Jedi Padawan Ahsoka Tano with his whip when she captured him during the Battle of Kiros, but she easily subdued him before the arrival of her Master, Anakin Skywalker. Subsequently, Skywalker, Tano, Obi-Wan Kenobi, Clone Captain Rex and R2-D2 undertook a mission to find and rescue the kidnapped Togruta colonists of Kiros. Kenobi was captured during the mission while attempting to rescue Governor Gupat Roshti, and was whipped by his captors. Later, at the Royal Slave Auction, Queen Miraj Scintel loaned her personal whip to a disguised Skywalker and asked that he whip Kenobi to prove he was a slaver, but Skywalker instead started a fight that led to all the non-droid members of the team being captured and subdued, mostly with electro-whips. Later, during his and Tano's escape from Zygerria, Skywalker attempted to duel the Sith Lord Count Dooku with Scintel's electro-whip, but performed poorly."}, {"tag": "p", "text": "During the Imperial Era, the Mining Guild foreman and Slave Master Proach, in charge of the ore crawler 413-24 on the occupied planet Lothal, used a whip to keep the slaves aboard his vehicle in line. When members of the Spectres hijacked the vehicle to use its transmitter, Proach fought Padawan Ezra Bridger, briefly managing to disarm him of his lightsaber during the fight. However, the slaver was ultimately defeated."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Electro-whips first appeared in the Star Wars: The Clone Wars season four episode \"Kidnapped,\" and were first identified in its corresponding Databank entry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}