{"url": "Ahakistan_Civil_War", "categories": ["Category:Legends articles", "Category:Articles with unconfirmed titles", "Category:Pages needing citation", "Category:Battles in the Myto sector", "Category:Civil wars", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Ahakistan Civil War"}, {"tag": "p", "text": "Ahakistan Civil War was a small conflict that took place on the planet Ahakista approximately 9 months after the Battle of Yavin. Its citizens grew tired of the Imperial-aligned government, and attempted to overthrow it, leading to a full-scale civil war. Unfortunately for them, the unrest drew the attention of the Galactic Empire, who sent none other than Sith Lord Darth Vader himself to smash the resistance and ensure the security of the Hub, the supercomputer responsible for coordinating the traffic of the entire Imperial Fleet, located on Ahakista."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After Ahakista's democratic government was dissolved by the Empire, it was replaced by one composed of members of the planet's wealthy upper class and loyal to the Empire. Like many citizens, a man named Dunlan resented the new government's policies, which had eroded the prosperity and freedom that they had been accustomed to. He eventually became the leader of the resistance movement that began a full-scale civil war against the government."}, {"tag": "p", "text": "Dunlan was viewed by disenfranchised citizens as a hero. As explosions began to shake the streets of Ahakista, government officials took a dimmer view of him as a terrorist and a threat to their grasp on power. After Dunlan assassinated Councilman Derral and Derral's fellow council member, the Empire ascertained that the intensity of the conflict posed a significant threat to the Hub located on Ahakista and decided to directly intervene."}, {"tag": "p", "text": "Darth Vader saw the quick solution to the problem in eliminating Dunlan. To achieve it, he put a bounty on his head. It was soon that Dunlan's fellow rebels began to question his authority, as the Empire made its full presence within the city. Eventually Dunlan was betrayed by Astor, his former subordinate, who provided Vader with the location of one of their safehouses."}, {"tag": "p", "text": "Shortly thereafter, stormtroopers under Vader's command attacked the safehouse, killing most of the rebels present there, but failing to eliminate Dunlan, who managed to slip away and ran. He was nonetheless soon tracked down and killed by Vader, who effectively ended the Ahakistan Rebellion."}, {"tag": "h2", "text": "Appearances"}]}