{"url": "Electromagnetic_pulse_grenade", "categories": ["Category:Legends articles", "Category:BlasTech Industries products", "Category:EMP demolitions", "Category:Grenades"], "nodes": [{"tag": "h1", "text": "Electromagnetic pulse grenade"}, {"tag": "p", "text": "The electromagnetic pulse grenade, also known as an EMP grenade, haywire grenade, Electrostatic Charge Detonator, ECD, and often referred to by Republic clone troopers as droid poppers, was an anti-droid weapon often used by the Grand Army of the Republic—specifically by the Army's elite soldiers, the clone commandos—during the Clone Wars against battle droid opponents."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "EMP grenades released a 3-meter blast of disruptive electrical energy that damaged and disabled electronic systems. They were especially useful for disabling droids. These electromagnetic pulses were not quite as effective against organics, but were still capable of electrocuting or stunning lifeforms that had cybernetic enhancements. Detonations also temporarily disrupted the sensors and visual displays of a clone trooper's helmet systems for a few seconds, somewhat similar to the effects of the reverse-polarity pulse grenade. Since the clone commandos had a more electronic helmet, the effect on them would last closer to an hour than just a few seconds."}, {"tag": "p", "text": "When rolled at just the right speed, EMP grenades could bypass the shield of a droideka and disable it, making them more effective than blasters."}, {"tag": "p", "text": "Other anti-droid weapons that produced similar effects were the ion grenade and the electromagnetic pulse launcher."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "EMP grenades were standard-issue weapons for clone troopers and were used to disable battle droids of the Confederacy of Independent Systems during the Clone Wars. They were also carried by clone jet troopers who fired them from grenade launchers. Various models were developed and employed by the clone troopers, such as the V-6 haywire grenade and the reverse-polarity pulse grenade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}