{"url": "Electrum_(Venator-class)", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Starships of Sentinel Base's flotilla", "Category:Venator-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Electrum (Venator-class)"}, {"tag": "p", "text": "The Electrum was a Venator-class Star Destroyer that served in the Imperial Navy during the Imperial Era. Originally stationed at the planet Ryloth's deepdock, the Star Destroyer was loaned out to serve in the flotilla of the Imperial installation known as Sentinel Base. In 14 BBY, while under the command of Captain Burque, the Electrum was chosen by Sentinel's commanding officer, Moff Wilhuff Tarkin, to react to a distress signal from the nearby Rampart Station."}, {"tag": "p", "text": "Tarkin, correctly assuming the signal was fake, ordered Burque to take the Electrum to the edge of Sentinel Base's system via microjump. After Burque complied, Sentinel Base was attacked by a rebel cell's warship and droid fighters. Upon Tarkin's command, the Electrum returned, with its TIE fighters engaging the enemy starfighters. Although the rebel warship fled the scene shortly after the Venator's return, Burque's crew later managed to salvage debris from the droid fighters for analysis."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Electrum was a Venator-class Star Destroyer equipped with sublight engines and a hyperdrive, and armed with weapons systems. It carried squadrons of TIE fighters aboard its dorsal hangar bay, and additionally featured a holoprojector."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "On loan to Sentinel Base"}, {"tag": "p", "text": "Sharing its name with a type of crystal, the Star Destroyer Electrum served under the Imperial Navy. During the Imperial Era, the vessel was stationed at the Outer Rim planet Ryloth, at a deepdock there. However, by 14 BBY, the Electrum had been loaned out to serve in the flotilla of Sentinel Base, an Imperial facility commanded by Moff Wilhuff Tarkin which oversaw the construction of the Imperial battle station later known as the Death Star. While stationed at Sentinel, the Star Destroyer was commanded by Captain Burque."}, {"tag": "p", "text": "At some point that year, most of the flotilla's other capital ships, including the Core Envoy, Sentinel Base's Imperial-class Star Destroyer, were away escorting supply convoys to the planet Geonosis—the site of the battle station's construction. With most of its ships away, the base received a holotransmission reporting that the nearby Rampart Station, a marshaling depot for supply ships bound for Geonosis, was under attack. When Tarkin arrived at Sentinel Base's command center to investigate the transmission, the Moff correctly suspected the holovid to be fake, due to the presence of a distinctive bar of interval noise. Promising Rampart reinforcements, Tarkin then asked a comm specialist which of Sentinel's vessels were available to him. The specialist reported that the only ships left were the Electrum, the frigate Salliche, and the tug Fremond, the latter two of which were both vacant and parked in stationary orbits over the moon Sentinel Base was situated on."}, {"tag": "h3", "text": "The attack"}, {"tag": "p", "text": "After considering his options, Tarkin eventually ordered the specialist to contact Captain Burque. Speaking to the captain via hologram, Tarkin asked Burque if he knew of the situation at Rampart, to which the captain replied that he did, and that the Electrum was prepared to travel to the station through hyperspace upon the Moff's command. Tarkin, however, ordered Burque to keep Rampart's coordinates at the ready, but instead commence a microjump to the Rimward edge of Sentinel Base's system, where the captain would await further orders."}, {"tag": "p", "text": "Burque then asked if the Electrum should be in plain sight or obscure. Tarkin replied that it likely would not matter, although it would be preferable to find something to hide behind. After Tarkin then revealed he was expecting trouble, the pair's communication ended, with the Electrum commencing its ordered microjump shortly after. Not long after the Star Destroyer departed, a rebel cell's 920-meter-long, heavily armed warship—the same one seen attacking Rampart in the fake transmission—reverted from hyperspace 200,000 kilometers from Sentinel Base. The specialist reporting the details of the vessel to Sentinel's command center then exclaimed that it was a good thing the Electrum had been dispatched—it would have been destroyed by the enemy's arrival."}, {"tag": "p", "text": "When the carrier then launched droid starfighters to attack Sentinel Base, including tri-fighters and vulture droids, Tarkin ordered the Electrum to return. As the base's ground-based artillery began to destroy the enemy fighters, and just as the warship started to retreat, the Venator-class Star Destroyer returned, and Tarkin asked for Burque to be informed that his TIE fighter pilots were going to enjoy a target-rich environment."}, {"tag": "h3", "text": "Imperial victory"}, {"tag": "p", "text": "Burque himself then appeared via hologram, and Tarkin told him that the Electrum should merely incapacitate the warship so that its crew could be interrogated. Subsequently, squadrons of newly minted TIE fighters were launched from the dorsal bay of the Star Destroyer to engage the droid starfighters. Just as Tarkin was contacted by Rampart Station, who confirmed they had not been attacked, the enemy warship jumped to hyperspace before the Electrum could get off a disabling shot. As a result, the attackers' droid fighters were sent spinning out of control, making them even easier targets for the TIEs."}, {"tag": "p", "text": "Disappointed, Tarkin ordered Burque to gather debris for analysis and to snare a few intact droids, warning the captain that they could still be liable to self-destruct. The Electrum's salvage teams recovered a vulture droid whose auto-destruct mechanism had been damaged during combat. The droid was then analyzed in Sentinel Base's maintenance hangar, revealing limited intelligence on the enemy. Tarkin, deeply troubled by the attack, went on to pursue leads on the rebel cell, eventually managing to defeat the group."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "During the vessel's time at Sentinel Base, the Electrum was commanded by Captain Burque. Although confused when Moff Tarkin ordered him not to aid Rampart Station, the captain nonetheless followed his superior's orders. The Electrum was also crewed by Imperial Starfighter Pilots and salvage teams."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Electrum appeared, albeit only as a hologram, in Tarkin, a 2014 novel by James Luceno."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}