{"url": "Eleemosynary", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Captured starships", "Category:Flagships", "Category:Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Eleemosynary"}, {"tag": "p", "text": "The Eleemosynary was an Imperial Star Destroyer that served as the personal command ship of the cyborg Grand Admiral Osvald Teshik. The warship was one of many destroyers that comprised the Imperial Fleet during the Battle of Endor, while Teshik was aboard the second Death Star battlestation. The Grand Admiral narrowly escaped the Death Star's destruction and retreated to the Eleemosynary, from where he continued to combat the Rebel Alliance for three hours after the Imperial withdrawal was initiated. However, the Alliance eventually disabled the Eleemosynary with concentrated ion cannon fire and captured Teshik."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Eleemosynary was a Star Destroyer in the Galactic Empire's navy. Grand Admiral Osvald Teshik used the warship as his personal command ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 4 ABY, the Eleemosynary was in use as the command ship of the cyborg Grand Admiral Osvald Teshik. The Star Destroyer was present in the Endor system while Teshik was aboard the second Death Star, a battlestation undergoing construction above the Forest Moon of Endor. Along with the bulk of the Imperial Fleet, also stationed in the system, the Eleemosynary participated in the Battle of Endor against the Rebel Alliance Navy."}, {"tag": "p", "text": "As the battle raged on, the Alliance succeeded in destroying the Death Star's reactor core. Teshik was able to escape the battlestation before its destruction, returning to the Eleemosynary. When an Imperial retreat was sounded, Teshik opted to remain behind in the Endor system with his command ship and continue to fight the Rebels. Three hours later, the Alliance succeeded in disabling the Eleemosynary with a barrage of ion cannon fire. The destroyer and its commander were both captured by Alliance forces; Teshik was later executed."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Star Destroyer Eleemosynary was commanded by Osvald Teshik, a Grand Admiral whose body was 75% artificial. Teshik was a tactical genius dedicated to serving the Empire, standing his ground even when faced with overwhelming odds against success. This was evident in the closing stage of the Battle of Endor, but his refusal to retreat resulted in his capture by the Alliance and his eventual execution by the Alliance's successor state, the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eleemosynary was first mentioned in Who's Who: Imperial Grand Admirals, an article by Daniel Wallace and Abel G. Peña that appeared in Star Wars Insider 66. In a blog entry on StarWars.com, Wallace explained that \"eleemosynary\" is defined as \"supported by charity,\" and that Peña likely applied the name to Teshik's command ship. The Eleemosynary later received an entry in The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "In an early version of Who's Who: Imperial Grand Admirals, titled \"Dirty Dozen: The Imperial Grand Admirals,\" the Eleemosynary was established as being an Imperial-class Star Destroyer. When the article was reworked for inclusion in Star Wars Insider, several details regarding the Grand Admirals and their flagships were omitted. The Eleemosynary's class was one such piece of information that was cut."}, {"tag": "p", "text": "The New Essential Chronology introduces some confusion regarding when the Eleemosynary was disabled. While Who's Who indicates that the Imperial retreat was sounded three hours before Teshik and his ship were captured by the Alliance, The New Essential Chronology states that Captain Gilad Pellaeon of the Star Destroyer Chimaera ordered the withdrawal after the Eleemosynary was disabled, four hours after the second Death Star's destruction. This article assumes the chronology presented in Who's Who is correct."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}