{"url": "Eleventh_Fleet", "categories": ["Category:Canon articles", "Category:Wookieepedia former Comprehensive articles", "Category:Imperial Navy fleets"], "nodes": [{"tag": "h1", "text": "Eleventh Fleet"}, {"tag": "p", "text": "The Eleventh Fleet was a fleet in the Imperial Navy which was active at the time of the Lothal campaign. Around 0 BBY, Imperial Commodore Karyn Faro was approved to command the fleet by Imperial High Command, after being recommended for the role by her superior, Grand Admiral Thrawn."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Eleventh Fleet was a fleet within the Imperial Navy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Eleventh Fleet was active at the time of the Lothal campaign. Commodore Karyn Faro, captain of the ISD Chimaera, was originally set to command Task Force 231, although Imperial High Command failed to meet their deadlines for her pre-command orientation. A few weeks later, shortly before the Liberation of Lothal in 0 BBY, Faro's commander, Grand Admiral Thrawn of the Seventh Fleet, told her he had been holding back her move to the 231st."}, {"tag": "p", "text": "Thrawn, who had taken Faro as his protégé, believed she was better than the leader of a task force, and so revealed he had requested Faro be considered for command of the Eleventh Fleet, which he believed could come with a promotion. Earlier the morning Thrawn revealed this to her, Imperial High Command had approved his request, with Faro due to leave the Chimaera upon its return to the planet Lothal, heading to the planet Coruscant for orientation on her new command."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Eleventh Fleet was commanded by Karyn Faro, who was cited by her superior, Grand Admiral Thrawn, as having superior skills as an administrator, tactician, officer, commander, and political agent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eleventh Fleet was mentioned in Timothy Zahn's 2019 novel Thrawn: Treason, the third installment of the Star Wars: Thrawn series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}