{"url": "Ahlan_Matale", "categories": ["Category:Legends articles", "Category:Dantooinians", "Category:Farmers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ahlan Matale"}, {"tag": "p", "text": "Ahlan Matale was a Human male living on Dantooine during the Jedi Civil War. He was native to the Core Worlds, but moved to Dantooine to get his family away from the crowded bustle of city life. He soon became one of the most successful plantation owners on Dantooine, and was arguably the most powerful man on Dantooine; until the arrival of the Sandrals. Ahlan and Nurik Sandral developed a heated rivalry, and grew an immense dislike of each other. Ahlan's hatred of the Sandrals caused him to become overly possessive of his son. After his son disappeared, Ahlan immediately suspected Nurik, and the two families came dangerously close to feuding, until the local Jedi Council intervened."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dissatisfied with the crowded core worlds, Ahlan Matale decided to move his family to the distant rural world of Dantooine. Ahlan used his own finances to buy an estate, and took up farming."}, {"tag": "p", "text": "Shortly after his move, however, another family moved to Dantooine from the core worlds, the Sandrals. Ahlan did not like Nurik, the leader of the Sandral family, and convinced himself that Nurik had followed him to Dantooine to steal his wealth. Ahlan spread his hatred onto his son, to ensure that the Sandrals would face the full force of Matale hatred."}, {"tag": "p", "text": "Over time, the Matales and the Sandrals developed a heated rivalry, fighting over land and so forth. The many arguments between Ahlan and Nurik sometimes came to the brink of open warfare between the two families. On one instance, Ahlan detected a battalion of Sandral droids on his estate. Assuming that the Sandrals were most likely attempting to assassinate him or spy out the ways of his estate in preparation of an invasion, Ahlan sent his own battalion of droids to destroy the \"invaders\". In truth, Nurik was simply searching for his son Casus."}, {"tag": "p", "text": "A few weeks later, Ahlan's son, Shen, disappeared. Ahlan was certain that Nurik was responsible. However, he was not totally willing to invade the Sandrals just yet, fearing that they might harm Shen in retaliation. So, instead, Ahlan went to the Jedi, who had established a secret enclave on Dantooine. However, Ahlan grew impatient waiting for the Jedi to act, and threatened to attack the Sandral estate if the Jedi did not act."}, {"tag": "p", "text": "Finally, the Jedi Council of the Dantooine Enclave sent a amnesiac Revan to investigate. Ahlan was frustrated that even the Padawan wasted time he thought would be better used searching the Sandral estate. Instead, Revan insisted on questioning Ahlan about the families' history with each other. Ahlan decided to attempt to motivate the Jedi Padawan with credits, much to the chagrin of Revan, who politely informed Ahlan that Jedi could not be bought with credits. Eventually, Revan left for the Sandral estate."}, {"tag": "p", "text": "Eventually, Ahlan grew tired of waiting for Revan to conclude his investigation, and took a pair of droids to the Sandral estate, to take matters into his own hands. Upon arriving at the front gate, Ahlan discovered Revan with Shen, who had indeed been imprisoned by Nurik, and also with Rahasia Sandral, Nurik's daughter."}, {"tag": "p", "text": "Although briefly relieved at the sight of his son, Ahlan was quickly overtaken by rage when he realized that Shen was in fact in love with Rahasia. The unhappy reunion was interrupted when Nurik, upon realizing Shen's escape, took a pair of droids to confront Ahlan. Nurik accused Ahlan of kidnapping his son Casus, to which Ahlan profusely denied. Nurik also criticized Rahasia for fraternizing with the \"Matale dog\", meaning Shen. Ahlan was outraged at this last remark, and the two men came close to opening fire on each other, were it not for Revan, who pleaded with Ahlan and Nurik, and begged them to allow their children to bypass their feud and join their lives. Ahlan initially refused and ordered Shen to come back to the estate with him. Nurik however suggested that they comply with Revan, and pointed out that they had nearly ruined their children's lives with their over-possessiveness."}, {"tag": "p", "text": "Ahlan was uncertain, but eventually conceded to his son's love for Rahasia. He and Nurik then agreed to buy their children their own house."}, {"tag": "p", "text": "While it is uncertain if Ahlan escaped the Sith invasion of Dantooine, but seeing as how several wealthy settlers were rumored to escape Dantooine, while others were executed, and Ahlan's estate was preserved and used as the post-invasion center of government, Khoonda, it is likely that Ahlan survived. But Terena Adare said the Matales were all \"removed\" from Dantooine, so it is possible he was killed when the Sith invaded."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ahlan was notoriously impatient and impulsive. Although he was correct about his assumption that Nurik kidnapped Shen, it was nevertheless viewed by many as an unfounded conclusion. Ahlan also looked down on those who were not wealthy, and possessed the belief that his wealth made him superior to everyone else. He also viewed those who were wealthy like him with dislike and suspicion, as he did with the Sandrals. Ahlan was also a little paranoid as a result of his feud with Nurik, and never left his home without a contingent of droid bodyguards."}, {"tag": "p", "text": "Despite being selfish, possessive and rather brutish, Ahlan cared for his only son Shen, and was deeply concerned for his personal welfare. However, his feud with Nurik Sandral got in the way of his relationship with Shen. Due to his fear and distrust of the Sandrals, Ahlan was no longer concerned for Shen's welfare, but obsessed. He limited Shen's ability to leave the estate. Shen chafed under Ahlan's possessiveness, and was driven to rebel against his father, eventually falling in love with the daughter of his father's rival."}, {"tag": "p", "text": "Due to his wealth and self-absorption, Ahlan always wore opulent clothing. He also wore a blaster at his side at all times, just in case his droid bodyguards failed in their duties to protect him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "He was voiced by Neil Ross."}, {"tag": "p", "text": "If the player follows the dark side, he/she can convince Nurik that Ahlan killed Casus. In an ensuing fight, Nurik fatally shoots Ahlan."}, {"tag": "p", "text": "If Revan fails to persuade Ahlan to allow his Shen to live his own life, Shen runs away with Rahasia to the Jedi Enclave, leaving his father behind. Ahlan angrily states he won't rest until he has Shen back and leaves."}, {"tag": "p", "text": "Revan can also convince Shen to return with his father and leave Rahasia heartbroken (either by telling him his relationship with Rahasia won't work out or by manipulating him into hating Rahasia)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}