{"url": "Eliminating_the_Rebel_Depot", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Eliminating the Rebel Depot"}, {"tag": "p", "text": "Eliminating the Rebel Depot was a skirmish in the Galactic Civil War that took place in 3 ABY or earlier."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "An Imperial probe encountered a staging depot for the Rebel Alliance containing various containers, tugs, and disabled starfighters at the site. In response, the Empire dispatched Alpha 1 to eliminate the depot, with explicit orders to have the containers be last to be destroyed. As the depot was deemed to have minimal security, they only dispatched Alpha 1 to eliminate it."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Upon arrival, Alpha 1 proceeded to attack a Utility tug and destroy it due to it being closest to the fighter's position. Alpha 1 then proceeded to wipe out the Tugs, although not before some of the fighters ended up activated by them. Alpha 1 then wiped out the activated fighters, using missiles on the A-wings in particular to disable them long enough for Alpha 1 to finish them off."}, {"tag": "p", "text": "Upon destroying all fighters and tugs, Alpha 1 then moved in to destroy the Vic and Limi group of Class-A cargo containers. Before destroying them, however, Alpha 1 proceeded to inspect each of them, discovering they contained equipment and supplies, respectively."}, {"tag": "p", "text": "With the mission complete, Alpha 1 then headed off to the arranged extraction point: a CR90 corvette called the Perfect."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The events of this mission were immortalized as one of the Galactic Empire's Combat Training sequences for newly ordained TIE pilots within the Imperial Navy, specifically for upcoming pilots of the TIE/LN starfighter, with then-rookie pilot Maarek Stele eventually assuming the role of Alpha 1 for this simulation, also earning the Silver TIE fighter combat medallion for participation in this as well as basic exercises and a reenactment of a Rebel raid against an Imperial Navy Supply Depot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Eliminating the Rebel Depot first appears in the 1994 video game Star Wars: TIE Fighter. It is the third Combat Training mission for the TIE Fighter, titled \"Destroy Depot\"."}, {"tag": "p", "text": "The player can destroy the Tugs before they activate the fighters, although the strategy guide implies that they were still activated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}