{"url": "Elis_Helrot", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Givin", "Category:Males", "Category:Pilots", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Elis Helrot"}, {"tag": "p", "text": "Elis Helrot was a Givin male who worked as a pilot and spice smuggler. He spoke with the bounty hunter Bossk about the fugitive Imperial astromech droid 261 in Mos Eisley spaceport on the planet Tatooine in the year 0 BBY. Helrot was later present in Chalmun's Spaceport Cantina when the Jedi Master Obi-Wan Kenobi got into an altercation with the thugs Cornelius Evazan and Ponda Baba."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rogue droid witness"}, {"tag": "p", "text": "Elis Helrot was a Givin male who worked as a pilot and a smuggler of spice during the reign of the Galactic Empire. In the year 0 BBY, Helrot was in the spaceport of Mos Eisley on the planet Tatooine when the rogue Imperial astromech droid 261 crashed its stolen Lambda-class T-4a shuttle in one of the port's hangar bays after escaping from the Death Star battle station with sensitive Imperial files."}, {"tag": "p", "text": "Imperial stormtroopers then engaged the droid in a firefight and managed to damage it, but 261 escaped while leaking oil. When the Trandoshan bounty hunter Bossk arrived in Mos Eisley in search of 261 a short while later, he spoke with Helrot in one of the spaceport's buildings about the events of the crash."}, {"tag": "h3", "text": "Cantina customer"}, {"tag": "p", "text": "Later that year, Helrot sat at a booth table with the Gotal Feltipern Trevagg and the H'nemthe M'iiyoom Onith in Chalmun's Spaceport Cantina in Mos Eisley when the Jedi Master Obi-Wan Kenobi used his lightsaber to fend off the thugs Doctor Cornelius Evazan and Ponda Baba at the cantina's bar."}, {"tag": "p", "text": "Helrot was then joined at the table by the Duros Ohwun De Maal, and the pair were speaking when the Rodian bounty hunter Greedo cornered the smuggler Han Solo in one of the cantina's booths behind Helrot's back. Solo then shot and killed Greedo and left the cantina, briefly drawing the attention of the other customers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Elis Helrot had white skin and black eyes. The Givin spoke disparagingly of Imperial stormtroopers to the bounty hunter Bossk and had little use for them, but respected their raw power and did his best to avoid entanglements with them."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Helrot had average intelligence and speed, with just below average fighting ability and strength. He had poor diplomatic skills and was not Force-sensitive."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Elis Helrot wore a black shirt with a white shawl while in Mos Eisley."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "A New Hope concept alien"}, {"tag": "p", "text": "The character who would eventually become known as Elis Helrot first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The character was portrayed on set by special effects artist Jon Berg, who wore a rubber mask he had created based on a piece of concept art drawn by concept artist Ralph McQuarrie in 1976. Helrot was originally known by the nickname \"Skull Head,\" and was to officially be named \"Kull,\" but that plan never came to fruition."}, {"tag": "p", "text": "During post-production shooting of supplemental footage for the cantina sequence on a sound stage in Dovington's Hollywood studio between January 24 and 25, 1977, Berg sat in a booth with two aliens who would later be named M'iiyoom Onith and Feltipern Trevagg. Footage of Helrot with these characters did not make it into the final cut of the film, although Helrot is visible in another scene in the cantina."}, {"tag": "h3", "text": "Naming"}, {"tag": "p", "text": "The character first received the name Elis Helrot in Star Wars Legends through the 1995 Premiere Limited expansion set of the Star Wars Customizable Card Game by Decipher, Inc. According to a Star Wars CCG fan site, the character was named as an anagram of the game's creator, Rollie Tesh. The 2016 reference book Star Wars: Complete Locations officially established Helrot's name and presence at the Mos Eisley Cantina table alongside Onith and Trevagg."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}