{"url": "Elis_Helrot/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Givin", "Category:Males", "Category:Merchants", "Category:Pilots", "Category:Slavers", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Elis Helrot"}, {"tag": "p", "text": "Elis Helrot was a Givin male who worked as a pilot, smuggler, merchant, and slave trader during the Galactic Civil War. A native of the planet Yag'Dhul, he possessed an analytical mind and was considered a ruthless and unscrupulous businessman by others. Helrot operated from his personally modified starship, the Hinthra, and often made slaving and spice runs from the desert world of Tatooine to the planets Ryloth and Pavilion. A longstanding feud developed between Helrot and the Morseerian smuggler Nabrun Leids during the Givin's career. Both were in Chalmun's Spaceport Cantina on Tatooine one day in 0 BBY and bore witness to a skirmish between Jedi Master Obi-Wan Kenobi and the pirates Ponda Baba and Cornelius Evazan."}, {"tag": "p", "text": "In 3 ABY, Helrot and the crew of the Hinthra took part in a competition organized by Mal Biron, a Vigo of the Black Sun criminal organization who hoped to discover new and loyal allies. The Hinthra was one of seven smuggling vessels that moved along the Sisar Run hyperlane in a race to deliver secret cargo to the luxury liner Destination: Adventure!. When he received his cargo at the Nwarcol Point space station, Helrot opened its sealed container and found unarmed magnetic pulse warheads inside. He smelled profit and, after arriving at the Destination: Adventure!, offered 10,000 credits to another smuggling crew for their identical cargo. The conversation was overheard by Biron, whose enforcers responded by stunning Helrot and his crew into unconsciousness."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Time on Tatooine"}, {"tag": "p", "text": "A Givin male, Elis Helrot hailed from the planet Yag'Dhul, his species' homeworld. During the Galactic Civil War, he was active as a pilot, smuggler, merchant, and slave trader. Helrot operated out of his starship, the Hinthra, a freighter that he himself heavily modified. He often transported slaves and spice to Kala'uun, a city on the planet Ryloth, as well as to the planet Pavilion. Over the course of his career, Helrot developed a rivalry with the Morseerian smuggler Nabrun Leids. During the war, Helrot was often on the desert world of Tatooine, scouring the Mos Eisley spaceport for information on slaves and spice that needed transport and spending time at Chalmun's Spaceport Cantina. He frequently collected cargo on the desert planet and made many deliveries from Tatooine to Ryloth."}, {"tag": "p", "text": "On a day in 0 BBY, Helrot was in Chalmun's cantina concurrently with a number of other smugglers and criminals, including Nabrun Leids. The Givin played a card game with the Abyssin Myo and the Talz Muftak, but he eventually left the game and sat down at a booth with the Gotal Feltipern Trevagg and the H'nemthe M'iiyoom Onith. The two were preoccupied with discussing a forthcoming sexual encounter and paid him little mind. The Jedi Master Obi-Wan Kenobi entered the cantina shortly thereafter and was harassed by the pirates Ponda Baba and Dr. Cornelius Evazan. When it escalated into a physical encounter, Onith grew frightened, and she and Trevagg left the establishment."}, {"tag": "h3", "text": "Running the Sisar"}, {"tag": "p", "text": "In 3 ABY, Helrot and his crew of three aboard the Hinthra—two other Givins and a Human male—were invited to the planet Sriluur's Meirm City by the Shistavanen smuggler Mal Biron, who was seeking out competent and trustworthy allies. Helrot heeded the call and took the Hinthra to Sriluur, where the ship's crew touched down and, following instructions sent to their datapad by Biron, made their way to Meirm City's Docking Bay 42. Therein, they joined a larger group of spacers who had all been invited; Nabrun Leids was among those present. A droid served the motley crew food and drinks, and they ate an uncomfortably silent lunch as they waited for Biron to arrive. During the meal, Biron's Duros assistant, Kalend Thora, surveyed the captains present and recorded their identities. Biron eventually descended the boarding ramp of his docked freighter, the Eyeshine, and with little preamble told the smugglers what he had planned for them."}, {"tag": "p", "text": "The Shistavenan claimed that he needed important cargo moved along the Sisar Run hyperlane, and that he had assembled the diverse group to ensure at least some of it arrived at its destination. 5,000 credits would be paid to each crew for making the Sisar Run, with an additional 5,000 awarded to the first crew to deliver their payload. The crews were to make their way to a secret location to receive their cargo before moving to the Salin Corridor and rendezvousing with the luxury liner Destination: Adventure!, where they would drop off their load. With his instructions complete, Biron greeted each of the crews in turn. None of them were aware that he was a Vigo of the Black Sun criminal organization, or that the forthcoming task was in fact a test of their skills and loyalty in preparation for a larger operation that he had planned. Helrot and his crew returned to the Hinthra and plugged their datapad into the ship's navigation computer. A secret file of Biron's then opened and revealed their first destination: the Novolek Beacon, a neutron star in the Periphery region of space."}, {"tag": "p", "text": "The Hinthra arrived at the beacon around the same time as the six other smuggling vessels it faced. Helrot received a signal from a nearby communications satellite, but the neutron star's presence was disrupting the signal, and the gathered starships raced to the satellite, all vying for the opportunity to be the first to discover their next destination. It was Nwarcol Point, a refueling station located at the intersection of the Sisar Run and the Salin Corridor, and after intercepting the satellite's signal, Helrot and his crew fled into hyperspace. They soon after arrived and docked at Nwarcol, where they were informed by Biron's datapad file that the coordinates for Destination: Adventure! would be provided to them in thirty minutes. They located their cargo aboard the station within that time and loaded it aboard the Hinthra; although it was sealed inside a cargo pod, Helrot peeked inside and discovered that the cargo consisted of several unarmed magnetic pulse warheads."}, {"tag": "p", "text": "When they received their next coordinates, Helrot and his crew traveled along the Salin Corridor toward the luxury liner and emerged from hyperspace concurrently with their opponents—the race remained tight. An Imperial starfighter patrol that consisted of six TIE fighters and a Guardian-class light cruiser stood between the smugglers and their destination, but when three pirate ships emerged from hyperspace behind the smugglers, the Imperials, who were being paid off by Black Sun, allowed the smugglers to pass and engaged the pirates. The Hinthra was not the first ship to arrive, but Biron nevertheless greeted Helrot and his crew after they docked. He then awarded the winning crew 5,000 credits and suggested that everyone retire to the luxury liner's lounge for free food and drinks. Once there, Helrot approached the winning crew and invited them into a back hallway, where he told them what he had seen inside the cargo pod. Helrot had calculated the value of a completed warhead to be a high price and offered 10,000 credits for the other crew's cargo, so that he might arm the weapons himself and reap the consequent profits."}, {"tag": "p", "text": "The smugglers declined his offer, but Helrot and his crew nonetheless made their way to the luxury liner's cargo area. There, they discovered that the cargo had been taken to the Destination: Adventure!'s galley, where they found it being loaded into a large freezer. Before the group could enter the freezer, they were ambushed by Biron and his enforcers, who had overheard Helrot's earlier conversation via planted listening devices. Biron's enforcers fired stun bolts at Helrot and his crew and knocked them unconscious. Kalend Thora then announced that the traitors would be interrogated."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A smuggler, merchant, and slaver, Elis Helrot was considered by others to be an unscrupulous individual with ruthless and airtight business practices. He regularly scoured Mos Eisley in search of slaves to be transported, and, while working for Mal Biron, he was prepared to betray the Shistavenan in order to make a handsome profit. During his smuggling career, Helrot was involved in a longstanding feud with rival smuggler Nabrun Leids. Possessed of an analytical mind, he was not easily impressed and was solely concerned with a situation's bottom line. Helrot disliked being ignorant of the contents of any cargo that he transported and was willing to beg, borrow, or steal a weapon if he required its use."}, {"tag": "p", "text": "Helrot was an able pilot and also showed prowess as a mechanic, having made a number of modifications to his ship, the Hinthra. Like all members of his species, he revered mathematics. Solving numerical puzzles was one of his favorite pastimes. Another trait that Helrot shared with all Givin was the ability to seal his exoskeleton and survive exposure to the vacuum of space. The white and hairless exoskeleton included a pair of sunken black eyes. Feltipern Trevagg found Helrot to be \"ghoulish\" in appearance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character who would eventually be known as Elis Helrot was created to be a background character in the cantina scene of the 1977 film Star Wars, later renamed A New Hope. The character's rubber mask was constructed by makeup artist Rick Baker, whose design was based on concept art by artist Ralph McQuarrie. The mask was worn by an uncredited extra during supplemental shooting for the cantina scene, which was filmed during the movie's post-production when director George Lucas decided to liven the scene with more action and additional characters. The alien was nicknamed \"Skull Head\" on-set and was going to officially be named \"Kull,\" but the idea was ultimately abandoned. During filming, \"Skull Head\" sat in a booth with two characters who would later be christened M'iiyoom Onith and Feltipern Trevagg, but only the latter two characters are clearly visible on-screen in the final cut of the film. Nevertheless, some official sources claim that Helrot appears in A New Hope."}, {"tag": "p", "text": "Following the release of A New Hope, photographs of Helrot, Onith, and Trevagg seated together were presented as in-universe pictures in several Expanded Universe sources, thereby canonizing both Helrot's existence as a character and his presence in the cantina. The name \"Elis Helrot\" was developed for the 1995 release of the Decipher, Inc. Star Wars Customizable Card Game's Premiere Limited set. According to a Star Wars CCG fan site, Elis Helrot was named as an anagram of Decipher game creator Rollie Tesh. Helrot has additionally been mentioned in several sourcebooks and encyclopedias, as well as in 2001's Jedi Knights Trading Card Game, which established a rivalry between Helrot and Nabrun Leids, another character from A New Hope's cantina scene. During gameplay, playing a Helrot or a Leids card against the other will force either one or both of the cards to be discarded. In 2007, a 3 ¾ inch action figure of Helrot was released by Hasbro as part of its Star Wars: 30th Anniversary Collection toy line."}, {"tag": "p", "text": "Secrets of the Sisar Run, a 1997 sourcebook designed to supplement West End Games' Star Wars: The Roleplaying Game, includes Helrot as a non-playable character in the adventure Running the Sisar, which fleshes out his character and allows the players opportunities to interact with him. Several aspects of Helrot's role in the adventure depend on choices made by both the players and the gamemaster. When the smugglers journey to Novolek Beacon, the Hinthra is definitely one of the first five ships to arrive, and it is among the top four if the player characters experience a slow journey. During the race to the communications satellite, the beacon will be fired upon by the treacherous Az-Iban if the gamemaster designates him the first to arrive. If Az-Iban succeeds in destroying it, the Quor'sav Kal'Falnl C'ndros will intercept the signal in time and share it with the others, including Helrot, for a fee."}, {"tag": "p", "text": "As the adventure dictates that the player characters be the first to deliver their payload, the gamemaster is encouraged to establish that any ships which arrive at the Destination: Adventure! ahead of the players—possibly including the Hinthra—are fired upon and damaged by the pirates, thus allowing the players to overtake them. When Helrot later attempts to strike a deal with the player characters, they have the option to accept his offer, in which case they stumble into Biron's trap alongside Helrot and his crew. Such a scenario prevents the players from successfully completing the adventure, and as such, this article assumes that they decline."}, {"tag": "p", "text": "In addition to his canonical appearances, Helrot makes a brief cameo in the non-canon story \"The Emperor's Court\", which is included in the comic book Star Wars Tales 14. In the story, he is among the various denizens of the Mos Eisley Cantina who attend a trial of the smuggler Han Solo, accused of shooting first in his murder of the bounty hunter Greedo. Helrot and the other spectators watch as Solo and Greedo's mother present evidence respectively based on the Special Edition and the original, unaltered version of A New Hope. Although The Emperor's Court and various other sources acknowledge Helrot's presence in the cantina, he is absent in some of A New Hope's adaptations. The cover of The Mos Eisley Cantina Pop-Up Book depicts Onith and Trevagg as being seated with Muftak instead of with Helrot, and its interior shows Onith sitting with Greedo and Ponda Baba. However, Helrot's mask does appear, albeit atop a different costume than the one worn by the character for A New Hope, in a 1979 drunk-driving PSA set in the Mos Eisley Cantina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}