{"url": "Elite_Praetorian_Guard", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Elite Praetorian Guards", "Category:First Order military units", "Category:Guards"], "nodes": [{"tag": "h1", "text": "Elite Praetorian Guard"}, {"tag": "p", "text": "The Elite Praetorian Guard was a First Order unit that consisted of eight human warriors divided into four pairs. Like the Imperial Royal Guards who protected Emperor Palpatine during the reign of the Galactic Empire, the Praetorian Guards served as elite personal bodyguards of Supreme Leader Snoke—ruler of the military junta and hermetic state known as the First Order. As such, they were trained to protect the Supreme Leader by meeting any threat with a ferocious response. Clad in red armor and robes, the Praetorian Guard's appearance deliberately echoed that of the Emperor's royal guardsmen. As combatants they specialized in several forms of martial arts, such as Teräs Käsi, and carried various high-tech melee weapons."}, {"tag": "p", "text": "The Praetorian Guard was stationed aboard the Supreme Leader's flagship, the Supremacy, during the conflict between the First Order and the Resistance. It was in Snoke's throne room where the guards witnessed their master's death at the hand of his apprentice, the First Order warlord Kylo Ren. In response, the Praetorians attacked Ren in an attempt to avenge the fallen Supreme Leader. Despite their efforts, the entire Praetorian Guard—including the First Guard, Third Guard and Seventh Guard—was destroyed by both Ren and Rey, a former scavenger-turned-aspiring Jedi. In the aftermath of Ren's battle with the Praetorians, the dark side warrior claimed the mantle of Supreme Leader for himself."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Serving the Supreme Leader"}, {"tag": "p", "text": "Like the Emperor's Royal Guard, personal bodyguards of Galactic Emperor Sheev Palpatine, the Elite Praetorian Guard was an elite force of eight human warriors who protected the First Order's leader, Supreme Leader Snoke. They flanked the Supreme Leader in his throne room, and held in Snoke's Mega-class Star Dreadnought, the Supremacy. They also were derived to some extent from the Atrisian Emperor's royal guards, in particular how each of them operated in pairs. Three of the guards were known as the First, Third and Seventh Guards, respectively. Snoke had to rely on them for dealing with physical threats from a lethal distance, as while he still retained his potent Force abilities, he was well past his prime regarding his physical prowess and thus could not deal with any direct threats to him."}, {"tag": "p", "text": "The guards were holding court as usual in Snoke's throne room when the Supreme Leader summoned his apprentice Kylo Ren, whom he proceeded to berate for his losses on Starkiller Base. When Kylo responded aggressively to the taunting, the guards quickly assumed combat-ready stances but stood down at Snoke's gesture. While Snoke was telling Rey how she and the Resistance were doomed, Rey grabbed Kylo Ren's lightsaber to attack him, the Guards immediately attempted to attack her but Snoke called them down. As she tried to attack Snoke, he used the force to push her away while the Guards returned to neutral stances."}, {"tag": "p", "text": "During Snoke's confrontation with Rey, he ordered Kylo Ren to fulfill his destiny and strike her down. Snoke was naive however, envisioning Ren turning his own lightsaber to strike Rey down when in fact he was using the force to move the Skywalker Lightsaber which lay next to the Supreme Leader. Ren used the force to activate it, killing Snoke before the Praetorian Guard were aware of what had transpired. The Guards immediately engaged the pair, focusing their attacks on Ren."}, {"tag": "h3", "text": "Dissolution"}, {"tag": "p", "text": "When Snoke was assassinated by Ren, the Praetorian Guards immediately sprung into action to avenge the death of their leader. Ren and Rey, who were present for the assassination, engaged all eight of the guards in a short yet intense fight. The guards were, at first, evenly matched against the two Force-wielders, with their weapons being resistant to their foe's lightsabers and managed to score a wound apiece on them. However, they were ultimately no match for the two and fell one by one, with the last guard being killed when Kylo ignited Rey's lightsaber, which she had thrown to him, through his faceplate, killing him instantly. Ren then assumed the title of Supreme Leader."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "By 35 ABY, towards the end of his rule as Supreme Leader of the First Order, Kylo Ren looked at the Knights of Ren as his own equivalent to the disbanded Elite Praetorian Guard."}, {"tag": "h2", "text": "Equipment and training"}, {"tag": "p", "text": "The Elite Praetorian Guards were clad in ornate crimson armor, robes and plastoid helmet. The layered crimson armor of the Praetorian Guard was a high-tech onion-skin of laminate, impregnated with conductive wirepaths that, once powered, created an intense local magnetic field. Once this energy-intensive field activated, the powered plates could deflect blaster fire. Even a lightsaber would glance off, though a directed thrust could penetrate the shell. The mag-coils were costly, the plates heavy, and mag-field exposure was ultimately painful to the wearer. They were merciless, persistent, and specialized in melee combat, as Snoke sensed they would eventually fight lightsaber wielders."}, {"tag": "p", "text": "The Praetorian Guards boasted an arsenal of melee weapons that were high-tech versions of unpowered analogs found in primitive societies across the galaxy, such as long vibro-voulges, electro-bisentos with an electro-plasma energy filament running along the blade's edge—flailing Bilari electro-chain whips, and heavy double-bladed vibro-arbir blades that could also be separated into dagger-like single-bladed weapons to adjust to any battle scenario. Different Praetorian Guards would specialize in what variation they normally kept their weapon in. The precise, sweeping movements of their martial arts fighting style struck fear into the hearts of foes. The eight Praetorian Guards were really four sets of pairs that wielded the same weapon. The First Guard both wielded electro-bisentos. The Third Guard utilized Bilari electro-chain whips and the Seventh Guard made use of dual vibro-arbir blades."}, {"tag": "p", "text": "Although the Praetorians' weapons and plate armor; which could resist lightsaber attacks—as well as their training enabled them to hold their own against both Ren and Rey for a time, the guards were ultimately defeated and killed by the Force-sensitive pair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Elite Praetorian Guard was created and developed for Star Wars: Episode VIII The Last Jedi, the eighth film in the Star Wars saga, which was released on December 15, 2017. The Praetorian Guard was officially revealed in an article by Entertainment Weekly, released on August 9, 2017. The Guards made their first appearance in Star Wars: Tales of the Force, a young adult Golden Book title published on September 5, 2017 as part of the Journey to Star Wars: The Last Jedi series."}, {"tag": "p", "text": "They were portrayed in Star Wars: Episode VIII The Last Jedi by James Cox, Dan Euston, David R. Grant, Florian Robin, Andy Wareham, William Willoughby, Liang Yang and Karanja Yorke."}, {"tag": "p", "text": "Rian Johnson, the writer and director of The Last Jedi, wanted the Praetorian Guards to be built to move, to seem dangerous more like samurai; in contrast to the Emperor's Royal Guards, which looked very formal and ceremonial. The Praetorian Guards' costume was designed by Michael Kaplan in parallel to Johnson's vision. The guards were named after the real-life Praetorian Guard whose members served as personal bodyguards to the Roman emperors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}