{"url": "Elomin_task_force", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:New Republic fleets"], "nodes": [{"tag": "h1", "text": "Elomin task force"}, {"tag": "p", "text": "The Elomin task force was a New Republic military formation consisting of four Assault Frigate Mark I capital ships and three wings of Incom Corporation T-65 X-wing starfighters. Crewed exclusively by Elomins, the task force was on patrol in the Obroa-skai system when Imperial raiders conducted an information raid on Obroa-skai's library. The task force tracked the raiders back to their mothership, the Imperial-class Star Destroyer Chimaera, which was commanded by Grand Admiral Thrawn. Thrawn used his tactical skills to totally decimate the task force by using the unstructured attack profile of the Marg Sabl maneuver against the Elomins, whose logical nature prevented them from countering it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Elomin task force served the New Republic in 9 ABY and was on patrol in the Obroa-skai system as part of the diplomatic efforts to bring the planet into the Republic. While the task force was in the system, Imperial scout ships arrived in-system and conducted an information raid on Obroa-skai's extensive library. The Elomin task force moved to intercept, relaying a communication back to the New Republic with their intentions, and subsequently chased the raiders into hyperspace."}, {"tag": "p", "text": "When the task force emerged from hyperspace, it found the scout ships heading toward an Imperial-class Star Destroyer, the Chimaera. Deployed in a symmetric cloud-vee formation, the task force moved to attack the Star Destroyer. The commander of the Chimaera, Imperial Grand Admiral Thrawn, ordered three of the vessel's sentry ships to attack the task force. The task force engaged the sentries, destroying one ship; Thrawn then ordered the sentry ships to withdraw."}, {"tag": "p", "text": "As the task force closed in on the Chimaera, the Star Destroyer's Sector Four sentry line scrambled out of the way of the incoming ships. Thrawn then ordered the Chimaera's crew to rotate the ship so the superstructure was pointing toward the task force. As the Elomin force continued to move in, the Sector Four sentry line reformed behind them and began to jam all transmissions out of the area. At the same time, Thrawn ordered the Chimaera's starfighter squadrons to launch while they were covered from the Republic ships by the bulk of the Star Destroyer. The starfighters then initiated a Marg Sabl closure maneuver, a tactic which the logically minded Elomin could not handle due to its unstructured attack profile. Thrawn, who was able to use art to understand a species' psychological make-up, had determined that the commander of the task force was Elomin by the way that the task force had engaged the sentry ships and had used the tactic specifically to defeat the Elomin force. As the Imperial fighters tore into the task force, Thrawn ordered the Chimaera to join the attack. The battle lasted for an hour, resulting in the destruction of the task force."}, {"tag": "p", "text": "The loss of the task force proved to be a minor embarrassment for the New Republic, as no one was able to determine exactly what had happened to the fleet after it left Obroa-skai. Former general Han Solo stopped by the Obroa-skai system while en route to Coruscant to investigate the loss, but found nothing, while smugglers such as Dravis were aware of the fleet's disappearance. The loss became a point of contention between Admiral Gial Ackbar and Borsk Fey'lya, who both served on the New Republic Advisory Council. Despite being high-ranking Republic officials, they were often at odds with each other over Ackbar's control of the military, a position which Fey'lya coveted."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Elomin task force consisted of four Assault Frigate Mark Is, supported by at least three wings of Incom Corporation T-65 X-wing starfighters. The task force was manned exclusively by Elomins, who preferred to work in units consisting of their own species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Elomin task force first appeared in the opening chapter of Heir to the Empire, the first novel in the Thrawn Trilogy by Timothy Zahn. The task force was later depicted in the first issue of the comic adaptation of Heir to the Empire, and was mentioned in the Heir to the Empire Sourcebook published by West End Games. In 2012, the task force was mentioned in The Essential Guide to Warfare."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}