{"url": "Elora_Sund", "categories": ["Category:Legends articles", "Category:Females", "Category:Jedi Commanders", "Category:Jedi trainees of the Jedi Order", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Elora Sund"}, {"tag": "p", "text": "Elora Sund was a female Sullustan Padawan serving the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Sullustan, Elora Sund was trained in the ways of the Force by the Jedi Order in the decade marked by the Separatist Crisis which plagued the Galactic Senate until the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems. Selected as a Padawan, Sund crafted a green-bladed lightsaber and took up the rank of Commander in the Grand Army of the Republic. Early in the war, Sund lost her master to the war and she became a member of the Padawan Pack on Jabiim during the fighting there. In addition to her lightsaber, Sund was trained in the use of a vibroknife, which she was fond of using in battle in conjunction with her lightsaber or a blaster."}, {"tag": "p", "text": "Along with the other masterless Padawans, Sund was forced to adjust to the ever-changing battlefield conditions without the instruction of a master. Commandeering a pair of repuslorlift boots to move around with easy over the muddy ground, Sund found herself fond of fellow Padawan Tae Diath as the group grew closer and closer throughout the fighting. Forming a telepathic link with Diath, she encouraged him to find peace within his mind as he mourned the death of his own master, Nico Diath. During the final battle with rebel leader Alto Stratus, Diath was slain by a group of assassin droids. When Diath died, Sund's mental link betrayed her as she suffered from psychic backlash. Overcome by Diath's death resonating through her mind, Sund died instantly of heart failure. Like countless other Jedi since the dawn of the Republic, Sund's name was added to the Jedi monument on New Holstice as the survivors of the battle whispered her name into the wings of the immortal memory moths flying in the monument."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}