{"url": "Ahsoka%27s_lightsabers", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Ahsoka's lightsabers"}, {"tag": "p", "text": "Ahsoka's lightsabers were a pair of lightsabers owned by Ahsoka Tano during the Clone Wars. The weapons were a single-bladed lightsaber with a green blade, which was later accompanied by a shoto lightsaber with a yellow-green blade that she built upon taking up Jar'Kai during the latter half of the war. She often wielded her weapons in an unorthodox reverse grip. She used the weapons in many battles, although she was separated from them on a few occasions, such as when her lightsaber was stolen by Bannamu and wound up in the hands of the thief Cassilyda Cryar, or upon her abduction by Trandoshan hunter Lo-Taren during the Second Battle of Felucia."}, {"tag": "p", "text": "After Tano's departure from the Jedi Order after being framed for treason, the weapons remained with the Order. Her former master Anakin Skywalker returned the weapons to her upon her return to the Galactic Republic's military to lead forces in the Siege of Mandalore near the end of the war. Tano abandoned the lightsabers for good after Order 66, the means by which the Sith engineered the fall of the Jedi, in order to fake her death to the new Galactic Empire, before eventually replacing them with a pair of white lightsabers upon joining the nascent rebellion."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The primary lightsaber was a single-bladed weapon with a cylindrical silver hilt with black ornamentation. The shoto looked like a smaller, less-detailed version of the other lightsaber. Both sabers contained kyber crystals from the sacred planet of Ilum, with the primary lightsaber having a green blade and the shoto's blade being yellow-green. Both sabers were capable of being wielded underwater, as demonstrated during the Battle of Mon Cala. When Anakin Skywalker returned the lightsabers to Ahsoka Tano prior to the Siege of Mandalore, the blades had become blue due to his tinkering with the weapons."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The first lightsaber"}, {"tag": "p", "text": "Ahsoka Tano, a Togruta Jedi youngling, built the first of her lightsabers after receiving a kyber crystal on a Gathering to the remote world of Ilum. She brought it with her when she traveled to the planet Christophsis in the first year of the Clone Wars upon being appointed the Padawan of Jedi Knight and General Anakin Skywalker, who was fighting to take the planet back from the Separatists with his former Master Obi-Wan Kenobi."}, {"tag": "p", "text": "Tano wielded the lightsaber as she fought alongside her master in many battles, including crossing blades with the feared General Grievous on a mission to Skytop Station, fighting Count Dooku's assassin Asajj Ventress on several occasions, and using them in battles against Separatist forces on worlds like Maridun, Naboo, Felucia, and Geonosis. She also duelled with disguised Clawdite bounty hunter Cato Parasitti after the shapeshifter had disguised herself as Chief Librarian Jocasta Nu during an infiltration of the Jedi Temple, noting that Parasitti lacked the skill of the woman she was impersonating and defeating her easily. Tano later fought her fellow Padawan Barriss Offee after the Mirialan had been infected by a Geonosian brain worm while travelling to the Ord Cestus medical station on the frigate TB-73."}, {"tag": "p", "text": "One mission on Coruscant had Tano waiting on watch outside a cantina in slum district G17 while Skywalker went inside to arrest arms dealer Car Affa. Tano was jostled by a crowd of people running outside as Skywalker took Affa into custody, so she didn't notice that the Patrolian thief Bannamu had taken the opportunity to swipe her lightsaber until after he had vanished into the masses. Desperate for her master not to find out about the loss, Tano teamed up with semi-retired Jedi Master Tera Sinube to track the weapon down. Bannamu sold the lightsaber to a Trandoshan assassin named Nack Movers. However, Movers was shortly murdered by his girlfriend Ione Marcy and her associate Cassilyda Cryar, so when Tano and Sinube tracked the weapon to Movers' apartment, Tano was ambushed by the Terrelian Jango Jumper when she searched the place. Cryar fled through the window after realizing Tano was a Jedi, as she had not yet figured out how to activate the weapon. Tano chased Cryar over the rooftops, but Sinube took the long way around. Eventually, Tano and Sinube followed Marcy and Cryar to a hovertrain station with the aid of a homing beacon, where Marcy was arrested as Cryar fled onto the train. Tano followed her, but was forced to hold off when Cryar held some civilians hostage with the stolen weapon. However, Sinube met the train at the next station and disarmed Cryar, returning Tano's weapon to her."}, {"tag": "p", "text": "Tano was later sent to Mandalore by the Jedi High Council to teach cadets at the Royal Academy of Government about the dangers of corruption, following a request by Duchess Satine Kryze. However, due to what had transpired on Master Kenobi's earlier visit, Tano was required to leave her lightsaber with her master, thus leaving her only her unarmed combat skills and the Force to help expose the corruption of Satine's Prime Minister, Almec."}, {"tag": "h3", "text": "Jar'Kai"}, {"tag": "p", "text": "At some point after her assistance in rescuing Chi Eekway Papanoida following her abduction by Separatist forces, Tano decided to take up Jar'Kai, and journeyed to Ilum for a second kyber crystal. She built a shoto lightsaber with a yellow-green blade to accompany her primary weapon. Tano received some training from Grand Master Yoda on the dual-wielding style of combat."}, {"tag": "p", "text": "Tano subsequently wielded the pair of lightsabers on occasions such as the mission to Mortis, where the blades had no effect against the family of Force wielders that dwelt there. On Mortis, Tano dueled her master after being brainwashed to the dark side by the Son. She later fought in the battle of Lola Sayu with the sabers, even though she had not been intended to go on the mission.. During the Second Battle of Felucia, Tano was involved in an attack on a Separatist fortification along with Skywalker and Jedi Master Plo Koon. Tano's job was to go over the fort's back wall, along with clone troopers from Plo's 104th Battalion, including Sinker, Boost and Comet. However, after all of the troopers had ascended the wall, Tano was ambushed by the Trandoshan hunter Lo-Taren with an electrified net gun, searching for sentient prey for a sadistic bloodsport. Tano was dragged away, with her lightsabers left behind, and brought to the moon of Wasskah, where she was forced to fight for her life unarmed with several newfound allies before she could return to the Republic."}, {"tag": "p", "text": "Tano was again separated from her weapons during the mission to the slaver world of Zygerria. Along with Skywalker, Kenobi, and Clone Captain Rex, Tano had gone on the mission in disguise, in her case as a slave girl, much to her disgust. The Jedi's lightsabers had all been hidden inside of the astromech droid R2-D2. When the Jedi revealed themselves at the Royal Slave Auction and attempted to capture Queen Miraj Scintel, they were overpowered, with Tano knocked unconscious by a shock collar she had been placed in as part of her disguise. The Queen subsequently kept the weapons as trophies. Eventually, Skywalker took the opportunity to free himself and Tano, reclaiming her weapons, before they left to rescue Kenobi, Rex and a large number of abducted Togruta colonists from the planet Kadavo."}, {"tag": "p", "text": "While attending the Confederate–Republic peace conference on Mandalore alongside Senator Padmé Amidala, Tano was unexpectedly reunited with acquaintance Lux Bonteri of Onderon, who had come to denounce Count Dooku for murdering his mother. Sent to rescue him, Tano took him offworld, but he shocked her unconscious and turned their ship towards Carlac, hiding her lightsabers onboard while telling R2-D2 that she had fallen asleep. Upon arriving and discovering that Bonteri was working with the Mandalorian extremists Death Watch, Tano concealed her status as a Jedi, signalling R2 to continue to conceal the weapons after he had retrieved them from where they had been hidden. Tano's initial confrontation with the Death Watch ended in her defeat due to her lack of weapons, but after the droid returned them to her back at the warriors' camp, she fought her way out, crossing blades with Death Watch leader Pre Vizsla, who wielded the ancient Darksaber. Tano, Bonteri and R2-D2 were able to escape, but Bonteri chose not to return to the Republic."}, {"tag": "p", "text": "Later, Tano wielded her sabers when she, Skywalker and Kenobi were attacked by bounty hunter Rako Hardeen in the Coruscant Underworld, where Kenobi was apparently killed in the confrontation. His death was actually a ruse intended to allow him to impersonate Hardeen and infiltrate a plot to kidnap Supreme Chancellor Palpatine from the Festival of Light on Naboo. However, Tano and Skywalker were kept in the dark as part of the plan, and Palpatine, knowing that Skywalker was upset after \"Hardeen\" escaped from jail, sent him and Tano on the path of their disguised friend. During their confrontation on Orondia, Tano jumped into action with her weapons after Cad Bane nearly killed Skywalker, who had been briefly stunned by the disguised Kenobi. As a result, the disguised Jedi Master and the bounty hunters were able to escape, allowing Kenobi to continue his mission."}, {"tag": "p", "text": "Tano, Skywalker, Kenobi and Rex were sent to covertly assist in the Onderonian Civil War, where she was reunited with Bonteri. She stayed behind on Onderon after the others departed to monitor the Onderon rebels. Tano eventually publicly intervened at the attempted execution of rightful Onderonian king Ramsis Dendup to rescue General Akenathen Tandin, who had finally had enough of the usurper Sanjay Rash and turned on him. However, due to the Jedi Council's orders that the rebels not become dependent on Jedi assistance, Tano did little fighting for the remainder of the war, despite her desire to help."}, {"tag": "p", "text": "Later, Tano led a group of younglings on a Gathering to Ilum so they could gain their own lightsaber crystals. However, the return journey was fraught with complications, starting with an attack by the pirate Hondo Ohnaka that led to Tano's capture and yet another separation from her weapons. The younglings set out to rescue Tano, but an attack by General Grievous led to everyone being forced to work together. Tano once again crossed blades with the Kaleesh cyborg briefly while covering the younglings' escape."}, {"tag": "h3", "text": "Parting with the blades"}, {"tag": "p", "text": "In 19 BBY, Tano and Skywalker were called away from fighting on Cato Neimoidia to investigate a bombing at the Jedi Temple hangar, since their absence from Coruscant at the time would make them impartial. The pair identified Letta Turmond, the wife of Jedi Temple employee Jackar Bowmani, as the bomber, having used nano-explosives to unwittingly turn him into a walking bomb to protest the Jedi's involvement in the Clone Wars. Unbeknownst to anyone, however, Turmond was actually a proxy of Tano's friend Barriss Offee, who had secretly fallen to the dark side in her unease over the war. In an attempt to get Tano to join her, Offee framed Tano for the bombing, starting by Force choking Turmond while her cell's surveillance systems had been sabotaged so no sound was recorded, making Tano's attempts to save Turmond's life look like murder. Tano was subsequently arrested, but Offee then assisted in her escape in a way that made her look guilty, including Tano finding her lightsabers on the floor and then later finding several clone troopers who had been killed with such a weapon. During her flight, Tano lost her shoto before escaping into an underworld portal."}, {"tag": "p", "text": "While on the run on Level 1313, Tano encountered Ventress, who had become a bounty hunter after being disowned by Dooku and wanted to try and collect the sizeable bounty on Tano's head. After Tano talked her into an alliance by pointing out the similarities in their positions and that the Jedi and Republic would be unlikely to reward her since she was wanted for crimes committed during her time with the Separatists, Ventress helped Tano non-lethally fight off the clone troopers sent after her. Tano also contacted Offee, unaware of her duplicity, and was thus lured into a trap at an abandoned munitions warehouse. After parting ways with the fugitive Padawan, Ventress was ambushed by Offee, who stole her mask and lightsabers after knocking her unconscious. At the warehouse, Tano was attacked by the disguised Offee, who wore a cloak in addition to her stolen mask and weapons. Exhausted, Tano assumed that her attacker was Ventress, who had apparently changed her mind about taking her in. Offee was able to overpower Tano and disarm her before knocking her into a room full of boxes of the nanodroids used in the Temple attack, leading to her capture by the Coruscant Guard. Tano was subsequently put on trial for her alleged crimes after being expelled from the Jedi Order. Skywalker, investigating, tracked down Ventress and subsequently identified Offee as the true culprit. Tano was released after Offee confessed, but chose not to return to the Jedi, leaving her lightsabers in their possession."}, {"tag": "p", "text": "While the lightsabers were in the custody of the Jedi, Skywalker took care of them, taking the opportunity to, as he saw it, \"improve\" them. The blades changed color to blue as a result. Tano, during her time away from the temple, eventually allied herself with Mandalorian warrior Bo-Katan Kryze and her Nite Owls, who welcomed a Republic invasion of Mandalore as it would unseat the Sith Lord Maul, who had taken over the planet, installed a puppet government and murdered Duchess Satine. Tano made the decision to call on her former Master for help, and she reunited with him, Obi-Wan Kenobi, and Captain Rex. However, when the two Jedi were abruptly called back to Coruscant to help the Supreme Chancellor, Skywalker left Rex and part of the 501st Legion to help her. He also returned the lightsabers to Tano."}, {"tag": "p", "text": "In the subsequent siege, Tano used the blades in battle once again, fighting Mandalorian super commandos on the descent to Sundari in midair. Seeking Maul, Tano was lured into a trap in the Undercity that the renegade Sith Lord had intended for his old enemy Kenobi as well as Skywalker. Tano briefly fought Maul there, but the arrival of backup in the form of Rex and a squad of clones led Maul to choose to retreat then. As the Shadow Collective's forces were beaten back from Sundari, the hunt for Maul continued after he took a hostage, ARC trooper Jesse. Maul eventually made his presence known by sneaking into the Sundari Royal Palace and waiting in the throne room to surprise Tano, Rex and Kryze, returning his hostage as a show of so-called good faith. With Tano left alone as Maul's super commandos attacked again, Maul made Tano an offer to team up and destroy the mysterious Darth Sidious, an offer she initially accepted, but ultimately turned down when Maul revealed he had foreseen Skywalker becoming Sidious' new Sith apprentice, thus orchestrating the siege in an attempt to lure him and Kenobi to the planet so he could kill both of them. In the ensuing duel, Maul briefly disarmed Tano of her primary blade, leaving her with only her shoto, but she was able to retrieve the weapon before kicking Maul, sending him flying through glass and out of the throne room."}, {"tag": "p", "text": "As the battle continued in the city, Tano pursued Maul to the top of Sundari's bio-dome, where he intended to meet an evacuation ship and abandon his forces. They dueled again atop the narrow support beams, and Tano was eventually disarmed of both of her lightsabers, with Maul threatening to drop her to a near-certain death if she refused to join him. However, Tano was able to knock him off of the beam and hold him in midair with the Force, leading to his capture when Rex arrived with reinforcements in several gunships."}, {"tag": "p", "text": "With Tano, Rex, and their allies having won the siege, Kryze retrieved Tano's lightsabers and returned them to her. Maul was imprisoned in the last existing Mandalorian vault, a containment unit designed to imprison Force-users, and Tano and Rex set out for Coruscant aboard the Venator-class Star Destroyer Tribunal to deliver him to the Jedi Council. However, Chancellor Palpatine's abrupt execution of Order 66—his plan as the Dark Lord of the Sith to destroy the Jedi—disrupted the journey with staggering violence. After escaping the bridge, Tano released Maul from the vault to serve as a distraction for the clones, refusing to loan him one of her lightsabers as she was not rooting for him to survive. With the help of three astromech droids, Tano ambushed Rex and had his control chip removed, thus removing his compulsion to follow the order like the other clones. Tano refused to kill any more clones, so the lightsabers were only used for deflecting blaster bolts when she and Rex subsequently fought their way to the hangar. Shortly after, Maul dismantled the ship's hyperdrive, causing it to crash onto an unidentified moon; Maul, Tano, and Rex managed to escape, but all the other clones on the ship were killed in the crash. Tano and Rex built a memorial to the fallen, and, in her anguish and defeat, Tano deposited both of her lightsabers at the site as well, an action that helped to fake her death."}, {"tag": "p", "text": "Over a year after the end of the Clone Wars, Tano built herself a new pair of lightsabers, these ones with curved hilts and white blades, from components she'd picked up on her travels and kyber crystals reclaimed from the lightsaber of the Imperial Inquisitor known as the Sixth Brother. She finished the weapons in time to assist in the evacuation of the population of the moon Raada from the Empire's wrath. She continued to use these lightsabers as far as 9 ABY while she was searching for Grand Admiral Thrawn."}, {"tag": "p", "text": "At some point during the Imperial Era, Darth Vader visited the Tribunal crash site, now buried in snow. In the wreckage, he found his former apprentice's lightsaber, heavily corroded but still working, which he took with him as he left."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ahsoka's lightsaber first appeared in the Star Wars: The Clone Wars movie. The accompanying shoto first appeared in \"Heroes on Both Sides.\" In the flashback in Ahsoka where she abandons the lightsabers after the Siege of Mandalore, the blades are described as green. However, the episode \"Old Friends Not Forgotten\" depicts the lightsabers as blue-bladed upon being returned to her by Anakin prior to the siege. Later editions of the novel changed the description of the lightsabers to match the television show."}, {"tag": "p", "text": "\"Victory and Death\" goes on to retcon the novel's claim that Tano abandoned the lightsabers on Mandalore on a fake grave she and Rex created for him. Instead, she abandons them at the graves that she and Rex made for their fallen clone comrades, on the moon that their Star Destroyer crashed into shortly after the issuing of Order 66. She is also only seen abandoning her primary lightsaber, although her official StarWars.com Databank entry says she abandoned both of them there."}, {"tag": "p", "text": "The scene in which Anakin Skywalker returns Ahsoka Tano's lightsabers to her before the Siege of Mandalore wasn't originally included back when the Siege of Mandalore story arc was in development before the cancellation of Star Wars: The Clone Wars. When the series was revived for Disney+, the scene was conceived and added to the episodes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}