{"url": "Emancipator_(CR90_corvette)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Captured starships", "Category:CR90 corvettes", "Category:Hutt Cartel starships", "Category:Slaver starships"], "nodes": [{"tag": "h1", "text": "Emancipator (CR90 corvette)"}, {"tag": "p", "text": "The Emancipator was a CR90 corvette used by the Alliance to Restore the Republic during the early months of the Galactic Civil War."}, {"tag": "p", "text": "Originally, it was called Helot's Shackle and was a slave ship that had operated out of Ylesia. When Han Solo escaped from the planet along with Bria Tharen, they narrowly avoided being captured and boarded by the orbiting ship."}, {"tag": "p", "text": "Nine years later, Tharen had founded Red Hand Squadron as part of the Rebel Alliance to free slaves around the galaxy. She masterminded an elaborate plan to hijack Helot's Shackle and free the Exultation-addicted slaves who were bound for either Kessel or various Imperial pleasure houses. Despite heavy losses and intense fighting, Red Hand Squadron prevailed and captured the ship. She renamed the ship Emancipator in homage to freeing the slaves."}, {"tag": "p", "text": "The newly commissioned Rebel vessel participated in the Battle of Ylesia, where Bria Tharen freed all the pilgrims from the spice factories and the t'landa Til Exultation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There is a scene in Rebel Dawn where Bria Tharen is talking to her superior officer about renaming the Emancipator. The captured corvette is later referred to as Retribution. This seems to be either an editorial or writer error, since the Retribution was Bria Tharen's Marauder-class corvette. Although the Helot's Shackle's new name is only mentioned twice (once as Emancipator, once as Retribution), it was likely an editorial mistake to call it Retribution."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}