{"url": "Emarr_Ottkreg", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured articles", "Category:Imperial Security Bureau officers", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Emarr Ottkreg"}, {"tag": "p", "text": "Emarr Ottkreg was a male colonel and loyalty officer for the Imperial Security Bureau who was stationed aboard the Imperial-class Star Destroyer Vigilance during the Battle of Endor in 4 ABY. Strongly disliked by the Vigilance's admiral, Rae Sloane, Ottkreg questioned her tactics as she gave orders during the battle while he personally watched the fighting on the Star Destroyer's holotank. Ottkreg greatly enjoyed watching the destruction of the Rebel Alliance on the hologram but began trying to give orders to the crew once the battle started turning against the Empire. Realizing the Empire had lost and that the DS-2 Death Star II Mobile Battle Station was going to be destroyed, Sloane shot and killed Ottkreg rather than arguing with him when she ordered a retreat."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Battle of Endor"}, {"tag": "p", "text": "Emarr Ottkreg was a male colonel from Pondakree who served as a loyalty officer and agent of the Galactic Empire's Imperial Security Bureau, a subdivision of the Commission for the Preservation of the New Order. Much to the disgust of Admiral Rae Sloane, Ottkreg was assigned to the Imperial-class Star Destroyer Vigilance shortly before the Battle of Endor during the Galactic Civil War against the Alliance to Restore the Republic. Unsure if Ottkreg's placement was the result of Galactic Emperor Palpatine's presence aboard the DS-2 Death Star II Mobile Battle Station battle station—currently under construction in orbit around the moon of Endor—or paranoia within the ISB, Sloane assigned her executive officer, Nymos Lyle, to assist Ottkreg, trusting that he would also keep the agent well away from her."}, {"tag": "p", "text": "Ottkreg was still aboard the Vigilance when the Rebel Alliance staged its attack on the Death Star above Endor in 4 ABY. During the battle, he made his way to the Star Destroyer's bridge with Lyle and approached Sloane while she commanded her crew. The admiral led Ottkreg to the forward part of the bridge, so that the crew was less likely to overhear them, after which Ottkreg questioned Sloane on why the Vigilance was only assuming a defensive position and not attacking the Alliance Fleet."}, {"tag": "p", "text": "Sloane revealed that her orders had come directly from Admiral Firmus Piett, commander of the Imperial fleet, and beyond that most likely from the Emperor himself. The loyalty officer tried to parse Sloane's comments for disloyalty to the Empire but was satisfied after she stated that Palpatine's plans were not to be questioned. After Ottkreg asked how Sloane had identified three distant rebel CR90 corvettes that she had ordered Sapphire Squadron—part of her ship's contingent of TIE fighters—to intercept, the admiral brought up the bridge's holotank so that Ottkreg could view a holographic display of the battle to better understand it and also to keep him occupied and less of a distraction to her."}, {"tag": "h3", "text": "Beginning of the end"}, {"tag": "p", "text": "As Ottkreg keenly watched the destruction of the rebel forces on the holotank, Sloane realized that the fulcrum of the battle would be the fighting occurring on the moon below, where the Death Star's shield generator was located, and had her crew try and find out what was happening. When she received conflicting reports, Sloane ordered Lieutenant Habbel to personally contact the bunker for a situation report. This earned a contemptuous glance from Ottkreg, who then returned to the holotank to view more rebel deaths. He was forced to step back from the projection to refocus after Sloane had it changed to an image of the shield bunker, which had just been destroyed. The holotank was quickly changed back to the full view of the battle, causing Ottkreg to splutter indignation when he saw that the rebel starfighters were entering the now-unshielded Death Star superstructure."}, {"tag": "p", "text": "The loyalty officer began shouting, but Sloane ignored him and ordered that Sapphire Squadron not pursue the rebels into the Death Star. Ottkreg began to object but was silenced by Sloane, who then ordered the TIEs to return to the Vigilance. Ottkreg, by this time red in the face, tried to countermand the order and send the TIEs in to attack, but Sloane cut him off and reminded him that he had no power to give such orders on her bridge, only to report on what she did. Ottkreg then turned away in disgust, as Lyle tried to change Sloane's mind, but the admiral would not be swayed and ordered that the Vigilance move to flank position on Piett's Executor-class Star Dreadnought, the Executor."}, {"tag": "p", "text": "However, before the Vigilance could reach the Executor, the Super Star Destroyer smashed into the surface of the Death Star following the destruction of its command bridge. Remaining calm, Sloane asked for communications from the Death Star itself but learned from Communications Officer Ives that the chain of command had fragmented after orders from the Emperor's Throne Room had ceased. Ottkreg refused to believe that the Emperor had gone silent, but Sloane accepted it and ordered that all remaining Imperial forces form up on her ship. Ottkreg then commented that the rebels were retreating as he viewed them on the holotank, at which point Sloane shot Ottkreg dead with her blaster pistol before giving the order for the Imperials to retreat to avoid the Death Star's imminent destruction. His body fell through the holotank he had been viewing and crashed to the floor, rolling over so that even in death he still stared at the holodisplay of the fighting."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Emarr Ottkreg served as an Imperial loyalty officer, monitoring others for disloyalty to the Empire, and so when speaking to individuals such as Admiral Rae Sloane, he would parse their comments for anything he could report. Absolutely loyal to the Emperor, he refused to believe that Palpatine could have stopped issuing orders during the Battle of Endor and tried to force Sloane to use her TIE fighters to protect the Death Star, despite lacking the actual authority to do so. The power of the Death Star and the idea of using it to destroy rebel worlds awed him, and he stared upon the battle station's superlaser with greed in his eyes."}, {"tag": "p", "text": "Ottkreg considered the Rebel Alliance a group of fanatics and enjoyed watching the destruction of their ships above Endor, believing that their assault had been doomed from the start. He thought of the assault as a final attempt at resistance before their inevitable extinction and hoped to tell his future grandchildren about the day he saw the Rebellion die. Ottkreg was greatly disliked by Sloane, who was disgusted by his presence aboard her ship and found it difficult not to provoke him while speaking to him. She believed he lacked any concept of personal space when talking to others. Ultimately, Sloane considered Ottkreg so out of touch with reality that she shot him in order to avoid dealing with his objections as she ordered a retreat from Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Emarr Ottkreg was created by author Jason Fry for the short story \"The Levers of Power,\" which was released as part of The Rise of the Empire compendium on October 6, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}