{"url": "Emberlene", "categories": ["Category:Legends articles", "Category:Authala sector planets", "Category:Confederacy of Independent Systems planets", "Category:Destroyed planets", "Category:Galactic Empire planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Emberlene"}, {"tag": "p", "text": "Emberlene was a planet located in the Authala sector of the Expansion Region."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Emberlene was a planet inhabited by the matriarchal Human Mistryl and governed by a council known as the Eleven Elders of the People. It was famous as the home world of the Mistryl Shadow Guards, highly-trained warrior-women who could be hired for a variety of roles, including bodyguards, assassins, commandos or anti-piracy pickets for high-security cargoes."}, {"tag": "p", "text": "During the Clone Wars, the planet joined the Confederacy of Independent Systems and conquered many neighboring worlds. In response, various conquered peoples pooled their resources and hired a mercenary army under the command of rogue factions of the Thyrsian Sun Guard to raze Emberlene, leaving on it an impoverished people supported only by the income of the Shadow Guard."}, {"tag": "p", "text": "Although the Eleven Elders privately conceded that their own imperialism had been the cause for their neighbors' attack, they spread the myth that Emberlene had been an innocent victim of Imperial aggression, and the Mistryl proudly refused to have any dealings with the New Order, although in practice, even this principle was negotiable."}, {"tag": "p", "text": "After the Clone Wars, Emberlene appeared to have remained independent. The planet was, at least on an official level, defiantly hostile to the Galactic Empire, and there was no evidence that it ever joined the New Republic or the Galactic Federation of Free Alliances."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}