{"url": "Emissary_of_the_Void", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Articles with an excess of redlinks", "Category:Legends short stories from Star Wars Insider", "Category:Star Wars Gamer fiction", "Category:Star Wars: The New Jedi Order"], "nodes": [{"tag": "h1", "text": "Emissary of the Void"}, {"tag": "p", "text": "Emissary of the Void is a six-part serialized epic by Greg Keyes set during the New Jedi Order. It is considered the tenth installment of the New Jedi Order series. The first three parts of the story were printed in Star Wars Gamer 8-10 until the end of the title's run. The final three parts were later published in Star Wars Insider 62-64."}, {"tag": "p", "text": "The first three parts of the story, Battle on Bonadan, Dark Tidings and The War on Wayland; were made freely available online at StarWars.com, prior to the printing of the final three chapters, Relic of Ruin, A Perilous Plan and Emissary of the Void in Insider."}, {"tag": "p", "text": "All six chapters were later reprinted on Hyperspace for members only."}, {"tag": "p", "text": "To this date, Emissary of the Void is the only New Jedi Order tale not to be collected in print, in its entirety, or released as an eBook."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "Set during the Yuuzhan Vong War, the story revolves around the adventures of rescue pilot Uldir Lochett and Jedi Klin-Fa Gi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Emissary Of The Void begins after Edge Of Victory I: Conquest with the first four parts taking place before Edge Of Victory II: Rebirth. The final two parts of Emissary of the Void weave their way throughout the events of Rebirth."}, {"tag": "p", "text": "For the later online reprints, Emissary of the Void III: The War on Wayland incorrectly had \"The\" dropped from the title, becoming Emissary of the Void III: War on Wayland."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Episodes"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}