{"url": "Ahto_City_Civil_Authority", "categories": ["Category:Legends articles", "Category:Galactic Republic-aligned governments", "Category:Planetary governments"], "nodes": [{"tag": "h1", "text": "Ahto City Civil Authority"}, {"tag": "p", "text": "The Ahto City Civil Authority was responsible for administering law and order in Ahto City on Manaan, as well as maintaining Manaan's tentative neutrality with the Galactic Republic and Darth Revan's Sith Empire."}, {"tag": "h2", "text": "Ahto High Court"}, {"tag": "p", "text": "Located in Ahto West, the High Court was a panel of five ostensibly impartial judges who ruled on cases involving significant violations of the law, including murder, disturbance of the peace, or violations of Manaan's neutrality agreement. During the Jedi Civil War, Republic and Sith diplomats regularly appeared before the court to settle their disputes against each other."}, {"tag": "h3", "text": "Arbiters"}, {"tag": "p", "text": "Arbiters served as legal representation for beings on trial. An arbiter was expected to be impartial and a neutral observer. As of 3956 BBY, the following were all arbiters for some period of time:"}, {"tag": "h3", "text": "Trials"}, {"tag": "p", "text": "The following trials took place in 3956 BBY under the auspices of the Ahto High Court, Judges Shelkar, Jhosa, Naleshekan, Kota, and Duula presiding."}, {"tag": "h2", "text": "Ahto City Holding Cells"}, {"tag": "p", "text": "Located in Ahto West across the plaza from the High Court, these holding cells were used to detain prisoners awaiting trial or those unable to pay their fines. Notable detainees included Sunry and Revan. It was guarded from the outside and presided over by a warden."}, {"tag": "h2", "text": "Manaan Port Authority"}, {"tag": "p", "text": "The Port Official was responsible for controlling passage from the docking bays to Ahto City proper. Visitors were charged a 100-credit docking fee every time they arrived, or 500 credits if they were known troublemakers. As welcome they were given a map and visitor guide from the Manaan Board of Tourism and Trade."}, {"tag": "p", "text": "A security droid beside the entrance to the city proper reminded visitors to obey the laws."}, {"tag": "h2", "text": "Selkath Security Forces"}, {"tag": "p", "text": "In order to maintain its strict neutrality, Ahto City officials instituted strict security policies in all public areas. Droid security cameras were a ubiquitous sight in Ahto City's plazas, and security forces were on hand to prevent trouble. The two most important laws on Manaan were:"}, {"tag": "p", "text": "There were no cameras in the Sith and Republic embassies, since they were sovereign territory of their respective governments. Cameras were also deactivated in the docking bays themselves, giving unscrupulous visitors opportunities to engage in illegal activities behind closed doors, a fact that criminals such as Ithorak Guldar were quick to take advantage of."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}]}