{"url": "Emperor%27s_Citadel", "categories": ["Category:Legends articles", "Category:Buildings", "Category:Byss locations", "Category:Cloning facilities", "Category:Galactic Empire locations", "Category:Locations of the Sith"], "nodes": [{"tag": "h1", "text": "Emperor's Citadel"}, {"tag": "p", "text": "The Emperor's Citadel, also known as Imperial Citadel, located on the planet Byss, was a great black and red-tinted tower in the center of the throne city. Six years after the Battle of Endor, the reborn Emperor Palpatine reigned from this hidden location."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "This great black and red-tinted tower contained the personal quarters and offices of Palpatine and his officials. The Emperor's throne room, Clone Labs which kept his collection of clone bodies, dark side Sith alchemical laboratories, the Great Hall, a war room, and libraries filled with dark side tomes were also located within the Emperor's Citadel."}, {"tag": "p", "text": "It was in this citadel on his throne world that Palpatine experimented on a wide range of life with his dark side powers, even sentient beings. There were also sublevel breeding facilities which birthed the deadly Chrysalide rancors. Elite Imperial Sovereign Protectors—the best of the Imperial Royal Guard—were also stationed at the Imperial Citadel. He kept his cloning facilities within the palace to make it easier and faster to resurrect himself when needed."}, {"tag": "p", "text": "There were also a series of training rooms in the Palace compound where Palpatine trained his Dark Side Adepts and a few chosen Inquisitors. He also kept several Jedi and Sith holocrons which he had acquired. The Emperor's throne room was also capable of serving as a military command center which he used to supervise the World Devastator assault on Mon Calamari."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The citadel was constructed shortly after Palpatine rose to power, following the end of the Clone Wars. The Empire used slaves from many conquered worlds—including Gamorr, Toydaria, and Utapau—to complete the citadel quickly."}, {"tag": "p", "text": "Reborn in a clone body after his death aboard the second Death Star, Palpatine brought Luke Skywalker to the citadel, and was able to convert the Jedi Master to the dark side. Later, Leia Organa and Han Solo breached the citadel's defenses to rescue Luke. The citadel was attacked by New Republic agents through the use of sabotaged X-1 Vipers during the Battle of the Emperor's Citadel, but the attack was thwarted through the use of alchemically-altered Chrysalides. The citadel was destroyed along with the rest of Byss in 11 ABY when the Eclipse II rammed into the Galaxy Gun."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The Citadel was guarded by three stormtrooper legions and 600 Imperial Sentinels; Chrysalides, Dark Side Adepts, Hunter-Killer probots and Scorpenek annihilator droids also patrolled the area. Its equipment included HoloNet stations, battle computers and command rooms, the Clone Labs, prisons, a throne room, the Great Hall, a meeting area for the Imperial Inner Circle, libraries, museums, gardens and gladiator combat arenas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the original drafts of A New Hope, the Imperial City was to have been located on the top of an impossibly high spire, far above the surface of the capital world. This was eventually changed into Cloud City for the sequel, but may also have served as an inspiration for the Citadel on Byss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}