{"url": "Emperor%27s_Retreat", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Buildings", "Category:Galactic Empire locations", "Category:Naboo locations"], "nodes": [{"tag": "h1", "text": "Emperor's Retreat"}, {"tag": "p", "text": "The Emperor's Retreat was Emperor Palpatine's private sanctuary on his homeworld Naboo. West of the city of Moenia, the retreat was a luxurious marble edifice nestled in the Naboo hills, overlooking a lake. Palpatine attended his retreat with much of his court, including his Sith apprentice Darth Vader, Head Chamberlain Kaja Or'Zee, Grand Inquisitor Ja'ce Yiaso, Chief Inquisitor and head of security Loam Redge, Procurator of Justice Hethrir, and many others among the Empire's Dark Side Adepts and military. Under Redge's watch, the facility's security included a perimeter of guard towers, several All Terrain Scout Transports and All Terrain Armored Transports, and many stormtroopers and other soldiers, including storm commandos and dark troopers."}, {"tag": "p", "text": "Loam Redge oversaw construction of the site; upon the retreat's establishment, the Rebel Alliance practically disappeared from Naboo and Palpatine had little trouble with them. However, this changed by 1 ABY, when a number of incidents occurred near the retreat, including an assassination attempt on Moff Grayed Wintozzen, a counterfeit operation, and an Imperial captain being shot down in his shuttle. Palpatine reacted by creating a demonstration of the Empire's force, but problems still continued, when a traitor to the Empire started a campaign of sabotage that was only ended with his death."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Emperor Palpatine's retreat was located on his homeworld Naboo, west of the city of Moenia. The structure sat among the hills of Naboo, overlooking a tranquil lake. Palpatine visited the retreat when he wished to contemplate the future of the Empire. The Emperor also held summits with personnel from the highest levels of the Galactic Empire there, and met with some of his most powerful advisors. Palpatine's personal shuttle was granted a landing pad to remain docked while the Emperor was there, with pilots standing by."}, {"tag": "p", "text": "The retreat was a multi-story structure, styled with domed roofs like many Naboo buildings. Guard towers surrounded the facility, and security patrols kept watch outside. A wide stone concourse lined the backside of the building, with a balcony overlooking the lake. The retreat's front was outfitted with a veranda. Leading to the retreat was a long and wide road, large enough to accommodate the Empire's All Terrain Armored Transports. In addition, banners depicting the Imperial Crest insignia specifically utilized by the Emperor's Royal Guard were also adorned throughout various towers."}, {"tag": "p", "text": "The retreat's interior was decorated luxuriously. The walls were made of a mottled pink and tan marble, while the floors of its many hallways were covered with thick, gold-lined maroon carpeting. Computer terminals were scattered throughout the facility. Palpatine's inner sanctum was accessible by elevator, the entrance to which was guarded constantly by the Emperor's Royal Guards. The antechamber to his room was festooned with maroon-and-gold banners and lit with cylindrical gold lamps suspended from the ceiling. Within, Palpatine held audience from his dais."}, {"tag": "h2", "text": "Occupants"}, {"tag": "p", "text": "The principal inhabitant of the Emperor's Retreat was Palpatine, Dark Lord of the Sith and Emperor of the Galactic Empire. Commanding from a dais in his sanctum, Palpatine held audience with those who were granted permission to see him. Access to the retreat, and ultimately to Palpatine, was controlled by the Emperor's Head Chamberlain, Kaja Or'Zee. Those who wished to see Palpatine had to prove themselves worthy of an audience with him. Or'Zee attended to Palpatine, and saw that the business of the retreat ran smoothly. Along with Palpatine, his Sith apprentice Darth Vader had his own chambers in the retreat. Vader saw to those who the Emperor had no personal use for, but could still be useful to the Empire."}, {"tag": "p", "text": "Officials of the Empire's highest ranks and those close to Palpatine took up residence at the retreat as well. Many high-level members of the Inquisitorius could be found within its walls, including Grand Inquisitor Ja'ce Yiaso, Chief Inquisitor Loam Redge, Inquisitor Fa'Zoll, and Inquisitor Vrke. Another member of the Empire's Dark Side Adepts that visited the retreat was Lord Hethrir, Imperial Procurator of Justice. Several ranking members of the Imperial Military were sometimes stationed at the retreat, including the Chiss Captain Mitth'raw'nuruodo and Colonel Maximilian Veers. Officers as low as the rank of major were assigned their own offices."}, {"tag": "p", "text": "Security for the site was charged to Loam Redge. The retreat was heavily guarded: a plethora of soldiers were stationed there, including stormtroopers, storm commandos, snipers, and even dark troopers. Every stormtrooper at the retreat was kept on high alert. Palpatine's sanctum was guarded by two Royal Guards at the elevator to the sanctum, whose job was to prevent assassins from getting in or the Emperor from being disturbed, while two more served the Emperor from aside his dais. Darth Vader had an escort of two stormtrooper riflemen outside his own chambers. The entire facility was protected by a patrol of All Terrain Scout Transports and the more heavy-duty All Terrain Armored Transports, and had an air patrol of TIE/Advanced starfighters. Aside from the Core Worlds, Naboo was the most heavily guarded planet in the galaxy."}, {"tag": "p", "text": "The Emperor's Retreat, like many installations in the Empire, was filled with MSE-6 mouse droids; among the diminutive droids' duties was handling the retreat's housecleaning. RA-7 protocol droids could be found on the grounds of the retreat as well."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Palpatine elected to build a private retreat, he chose his homeworld of Naboo, not because he felt any loyalty to the planet, but because his world's landscape—and the location of the retreat in particular—made for a soothing view. Palpatine assigned construction of the facility to Inquisitor Loam Redge. The Emperor faced little trouble on Naboo after the retreat's establishment, and the Alliance to Restore the Republic's presence on the planet made itself practically invisible to the Empire."}, {"tag": "p", "text": "However, the year 1 ABY saw a good deal of Rebel activity in the retreat's vicinity. Palpatine and his court took up residence in the retreat, spending time in it between the middle of that year and the beginning of the next. In 1.5 ABY, Governor Grayed Wintozzen, Moff of a system near Naboo, visited the retreat to meet with other officials. A local Rebel group plotted to hire an assassin to murder Wintozzen, but after overhearing one of their conversations the Empire, with the help of a visiting Imperial loyalist, was able to take them out first, and the assassin and all conspirators were killed. Kaja Or'Zee wrote a letter of recommendation for the Empire's new ally, promising to put in a good word with the Emperor himself. The Imperials at the retreat saw many more victories over local Rebel movements that year. Chief Inquisitor Loam Redge had a group of Rebel sympathizers hauled in for questioning. Lord Hethrir found a counterfeiter in league with the Rebels, and had him, his Rebel contact, and even the contact's father killed."}, {"tag": "p", "text": "The Rebels made trouble of their own, though. On approach to the retreat, Captain Dolmen was shot down in his shuttle, and Captain Mitth'raw'nuruodo had to send out a party to escort him to safety. Thrawn, as he was known, had the shuttle's transponder retrieved, and the Empire's analyst Geg Winthazen was able to use it to find the Rebels' weapon site. On Thrawn's orders, the Rebel installation was wiped out. Maximilian Veers was in charge of cleaning up after Thrawn, eliminating any survivors of the destroyed cell. After finding a shipment of guns that had been stolen off the shuttle, Veers had the mastermind of the attacks, a Twi'lek named Borvo, killed, sending AT-ATs to his base to finish the job. The plans for the retreat fell into the Rebel's hands that year as well. Disguised as the poetry of a Rebel contact named Nura Tinall, the plans were delivered to Ebenn Q3 Baobab of Naboo. Baobab hired an intermediary in Moenia to pass the plans to Tinall, under the guise of returning her poetry, and Tinall in turn intended to deliver them to Rebel leader Leia Organa."}, {"tag": "p", "text": "Desiring to make a point of the Empire's commitment to destroying the Rebellion, Palpatine hired a band of mercenaries to attack the summer home of Kylantha, Queen of Naboo, in the guise of Rebels. After meeting with Kylantha at the retreat, the Emperor ordered the mock-Rebels crushed as a demonstration of what it meant to defy the Empire and Queen, then had his message delivered directly to Naboo's Parliament. The Emperor's Hand Mara Jade later visited the retreat to pass off information to Vader; the Dark Lord was busy investigating the connection between Jedi Master Obi-Wan Kenobi and the pilot who destroyed the Death Star, Luke Skywalker, a quest he would continue to be consumed with. At the retreat, Vader also met with an agent of the Empire, Finn Darktrin, after the latter failed to retrieve a data holocron containing a list of high ranking Rebel sympathizers."}, {"tag": "p", "text": "The Empire's problems did not abate after the Emperor's demonstration. Palpatine suspected Kylantha was harboring a Rebel general; an investigation was launched that proved the Emperor correct, and the man, Jacen Nire, was located and killed. Meanwhile, Kaja Or'Zee launched an investigation into Rebel infiltration of the retreat. The facility's guard towers had been entered without authorization, an AT-ST had been found with a jamming device on it, and even the landing gear of the Emperor's shuttle had been tampered with. The culprit was eventually fingered as Major Barret Herand, and the major and his associates were killed for his treason. After sending a fake message from the retreat, supposedly from Herand calling for extraction, the Imperials were able to take out Herand's Rebel handlers as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Emperor's Retreat first appeared as a location in the massively multiplayer online roleplaying game Star Wars Galaxies. It serves as the starting point for a number of interconnected quests, collectively termed the \"Imperial Theme Park.\" Many of the characters mentioned in this article, including Palpatine, Vader, Thrawn, Veers, and the Inquisitors, are non-player characters (NPCs) in Galaxies who assign the quests."}, {"tag": "p", "text": "Until September 14, 2007, the Imperial Theme Park consisted of different quests, all of them with endpoints much physically closer to the retreat. This changed with one of Galaxies' updates. An NPC named Wurson Harro appeared in the retreat as well; his sole purpose was to reset the Theme Park—done by speaking to him—for those players who had completed the old version. As it has not been indicated that previous versions of Galaxies have been rendered non-canon, both old and new versions of the Theme Park are included in this article."}, {"tag": "p", "text": "The Champions of the Force installment of Star Wars Galaxies Trading Card Game shows a rather different rendition of the retreat than Galaxies. By precedent with works like Star Wars: Knights of the Old Republic, it is likely Galaxies' simplified rendition is a matter of game mechanics, and the canon version is more like Champions of the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}