{"url": "Emperor%27s_Royal_Guard_TIE/IN_starfighter", "categories": ["Category:Legends articles", "Category:Sienar Fleet Systems products", "Category:TIE/IN interceptors", "Category:TIE Series"], "nodes": [{"tag": "h1", "text": "Emperor's Royal Guard TIE/IN starfighter"}, {"tag": "p", "text": "The Emperor's Royal Guard TIE/IN starfighter was a specially modified version of the TIE/IN interceptor. These TIE Interceptors were flown only by Emperor Palpatine's Royal Guard."}, {"tag": "h2", "text": "Details"}, {"tag": "p", "text": "These starfighters were commonly used to escort Emperor Palpatine's Lambda-class shuttle and its decoys during his travels. Displaying the distinctive crimson red color of the Royal Guard, these deadly war machines struck fear into any opposing fighters. Royal Guard fighter wings were thought to even rival the skills of elite pilots from the 181st Imperial Fighter Wing and Rogue Squadron. These fighters were said to have been commissioned by Palpatine himself."}, {"tag": "p", "text": "Under the supervision of Darth Vader, Imperial workers spent many long hours modifying TIE Interceptor fighters, including installing additional flaps on the curves of the wings. Unlike the original TIE Interceptor, the Royal Guard TIE Interceptor was equipped with a built-in hyperdrive and shield generator, while also having blazing speeds and fantastic maneuverability that exceeded that of its fleet counterpart. On very rare occasions, these fighters found places outside of the Royal Guard, and were thus subject to even further modification, including more devastating weapons, more advanced shielding technologies, and, in rare cases, ordnance launchers. By contrast, regular Interceptors with similar added equipment, such as shield projectors, warhead launchers, and hyperdrives (for instance that of Apwar Trigit) suffered reduced speed and maneuverability."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Royal Guard TIE Interceptor was introduced in Rage of the Wookiees, the second expansion of Star Wars Galaxies. It was a quest reward for Imperial pilots for completing a series of quests from the Civilian Protection Guild."}, {"tag": "p", "text": "In 2007 Hasbro released a die-cast model of the Royal Guard TIE Interceptor as part of their Titanium Series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}