{"url": "Emperor%27s_Throne_Room/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Death Star II locations", "Category:Emperor's throne rooms"], "nodes": [{"tag": "h1", "text": "Emperor's Throne Room"}, {"tag": "p", "text": "The throne room of the second Death Star served as the seat of the Galactic Emperor while he was away from Coruscant and the Imperial Palace. Once occupied, the throne room would be Palpatine's final home before his death during the battle over Endor in 4 ABY at the hands of his apprentice, Darth Vader."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed by 4 ABY, Emperor Palpatine used the room as his command post during his \"inspection\" of the second Death Star, and more importantly to oversee the planned final destruction of the Rebel Alliance in the Battle of Endor."}, {"tag": "p", "text": "After his arrival at the station, he met with his accompanying dignitaries as well as Darth Vader, whom he ordered to send Death Squadron south of Endor, and hold the fleet there until it could be summoned in time for the Rebel Alliance. He also ordered Moff Tiaan Jerjerrod to fire the superlaser at Endor if the Rebels either take over or otherwise destroy the shield generator, an order Jerjerrod reluctantly accepted. Midway through, Vader, disobeying his prior orders to remain on the Executor, returned to the throne room and informed Palpatine that, in addition to the shuttle Tydirium containing the Endor strike team managing to bypass Endor's shield, his son, Luke Skywalker, was among them. Palpatine, initially surprised that he had not sensed Skywalker's arrival, then ordered for Vader to go down to Endor's surface and wait out Skywalker's arrival."}, {"tag": "p", "text": "Upon Skywalker's capture, he was brought to the throne room, where Palpatine personally tried to convert Skywalker to the Sith, and also unveiled that the information the Rebel Alliance was acting on was bait placed by him for a trap, and proceeded to show the futility of the Alliance's efforts and even order for Jerjerrod to fire the Death Star's superlaser at one of the ships to demonstrate to the Rebel Alliance the Death Star's actual operability. He then used Skywalker's anger to instigate a duel between the father and son in the throne room. Ultimately, Palpatine failed, with Palpatine then proceeding to torture Skywalker, although Vader threw Palpatine down the reactor shaft, redeeming and sacrificing himself in the process and fulfilled the prophecy as the Chosen One."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Erected atop a hundred story mooring tower on the surface of the second Death Star, the Imperial throne room was a series of chambers reserved for the exclusive use of Galactic Emperor Palpatine during his visits to the heavily-armed space station. Although this was the primary throne room for Palpatine while onboard the Death Star II, an emergency throne room was also located at the armored sphere located just below the tower's base, in the event that the tower itself suffered structural damage."}, {"tag": "p", "text": "Protected by several turbolaser turrets and more heavily shielded than any other part of the station, the tower was impregnable and completely secure from attack. The hull itself (which was doubly reinforced specifically to protect against incoming artillery), combined with the shielding, was strong enough to completely withstand fire from even capital ships. From the outside the tower resembled the Tranquillity Spire of the Coruscant Jedi Temple, a design that was intended by the Emperor when designed; while the Jedi Temple spire had four smaller supporting towers, this tower had none and stood alone."}, {"tag": "p", "text": "The common circular viewport lined with the web-like framework provided an amazing view for Palpatine, while armrest controls kept him in touch with his countless minions. Barracks for a legion of Royal Guards and various living quarters for his advisors were included at the tower's foot."}, {"tag": "p", "text": "All entrances to the throne room were lined with security scanners and traps to prevent intruders from coming in, in addition to being guarded by four squads of Sidious' loyal Royal Guards when occupied and by four squads of stormtroopers when not. Even entering the corridor leading to the lift required inputting an identification code exactly, with the alternative being either being shot on sight or immediate capture. There was a docking rig for his personal shuttle to dock, chambers for receiving guests that bore resemblance to his quarters on Coruscant, a sleep chamber that monitored his health, and a massive holographic map of the galaxy which was also used to find out which planets or star systems were to be subjugated and/or punished."}, {"tag": "p", "text": "The throne room itself was in many ways similar to his throne room in the EmPal SuRecon Center. The tower was intentionally constructed to resemble the central spire on the Jedi Temple. The tower was an adaptation of standard Imperial mooring towers of large ships, albeit with additional shielding. However, it would become the site of his first death in 4 ABY."}, {"tag": "p", "text": "The throne room, which was accessible via starcase, contained viewscreens on each side of the walls to the side of the throne, which displayed the results of exterior scans and interior views throughout the entire battle station, as well as data including tactical schematics, blueprints, and others. Next to these viewports were display controls. The viewports were encircled with shield projector rings. The audience platform was open underneath. There were interrogation and restraint grappling equipment in front of the throne, which also included a targeting viewer and a holocam/projector. There were also two duty posts for the Emperor's Royal Guardsmen, with additional consoles located underneath the duty posts that acted as lower consoles. Both the lower consoles and duty posts were engineered to allow a small staff of officers to override and operate all of the battle station's functions from the tower. In addition, the throne itself was designed as a simple, swivel-mount contour-chair, owing to Emperor Palpatine's wardrobe of unadorned Sith robes and cowl. All of the transparisteel viewports included magnification scanners to provide close-up views of deep-space battles. Surrounding the throne room and its neighboring rooms was the abyss, an open shaft surrounding the turbolifts, which led directly to the Death Star's power core, 400 km (250 miles) below. The receiving area, or inner sanctum, was separated by a retractable walkway."}, {"tag": "p", "text": "The Receiving area was used for meetings with local system governors and/or the Emperor's advisors. It included a conference table fitted with multi-spectral comm systems, and possessed several statues and other arts, including an idol of Wapoe, the mythical Atrisian demigod of disguise; a jade trophy presented to him by Naboo's Theed Council, back when he was still the Chommell Sector's senator; and an idol that was a gift from Moff Quarsh Panaka, Palpatine's longtime ally and follower. The Royal guards standing at this room and other parts of the throne room were sworn to a vow of silence, which was used as a weapon of intimidation. Some of the pipes were standard modular housing for computers, communication lines, artificial gravity generators, and other equipment. The tower also had a maintenance catwalk nearing the top, which was accessible to droids only for routine maintenance measures."}, {"tag": "p", "text": "There were four turbolifts in the tower, each congregated around the central tower. The turbolifts open on an observation gallery made of gleaming durasteel."}, {"tag": "p", "text": "Depending on whether the throne room and/or the royal quarters was occupied by the Emperor or not, the throne room/royal quarters was guarded by four squads of either stormtroopers (when not occupied) or the Emperor's Royal Guard (when occupied)."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In its earliest incarnation, the Emperor's throne room was not aboard the Death Star at all, but rather deep below a palace on Had Abbadon, overlooking a lake of lava. An early sketch of the exterior of the second Death Star had the Emperor's throne room as a contained sphere held away from the station by two bracketing arms. In another early sketch, the throne was suspended from above by a thick cylindrical arm. Other art showed the throne in a central elevated disk connected by a bewildering array of curving catwalks."}, {"tag": "p", "text": "George Lucas, when discussing with Ian McDiarmid about the latter's role as Emperor Palpatine during filming of Return of the Jedi, pointed out that the throne room was oval-shaped, which was intended to reference the Oval Office, and more specifically former President Richard Nixon's occupancy in it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}