{"url": "Emperor%27s_Tower/Legends", "categories": ["Category:Legends articles", "Category:Death Star II locations"], "nodes": [{"tag": "h1", "text": "Emperor's Tower"}, {"tag": "p", "text": "The so-called Emperor's Tower served as the residence, seat of power and command center of Emperor Palpatine, leader of the Galactic Empire, aboard the second Death Star battlestation. Designed by Bevel Lemelisk and inspired by the spires of the Jedi Temple on Coruscant, its penultimate story had a quadripartite structure, housing a giant holomap, a throne room, private quarters and a docking ring. It was destroyed along with the rest of the Death Star during the Battle of Endor in 4 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A 100-story spire that rose from the northern pole of the second Death Star, the so-called Emperor's Tower served as a special command center from which Palpatine could survey the intended targets of his moon-shaped, 160 kilometers wide battlestation. Although a windowless, armored chamber hidden in the depths of the Death Star would have been a better strategical choice, Emperor Palpatine's great sense of the dramatic favored a more spectacular structure. By sitting from the top of his colossal needle, the Emperor had the highest vantage point on the battlestation and made a statement of his superiority. The Emperor's Tower was designed to be reminiscent of the southwest spire of the Jedi Temple on Coruscant, where the High Council of the Jedi Order used to convene. However, Palpatine's tower was isolated, while the Jedi Council's spire was only one of the five that crowned the Temple. That difference showed that Palpatine was entirely in control of his Empire and did not answer to any council."}, {"tag": "p", "text": "Given the importance of its resident, the Emperor's Tower was protected by an unusually large concentration of XX-9 heavy turbolaser turrets, all with improved fire control and placed at intervals of as little as a few hundred meters. Additional defenses included ion cannons, overlapping deflector shield generators, and TIE/LN starfighter patrol patterns. In addition, the tower itself received the most heavy shielding of the entire station, and its hull was doubly reinforced so as to ensure that it was protected from incoming artillery. All in all, the north pole of the second Death Star was one of its most heavily guarded areas, ensuring that it was virtually impenetrable from the outside. In addition, an emergency throne room was located within the armored sphere just below the tower, in the event that the tower itself suffered structural damage. For internal defenses, the corridors leading to the throne room and royal quarters as well as the tower itself were loaded with traps and various other security measures, with any personnel approaching the corridor leading to the tower's restricted turbolift being required to punch in an identifying code before entering the trap-filled passageway. The penalty of failing to identify themselves properly were subject to either immediate capture or being instantly killed by laserfire."}, {"tag": "p", "text": "A large, open shaft that plunged deep into the station's reactor core housed a cluster of four turbolifts than ran the length of the tower. The penultimate story of the tower was a four-lobed compartment that acted both as a command center and a private sanctum. One lobe contained a docking ring that allowed visitors' starships to moor at the isolation tower. Opposite the mooring area was a vast room containing a giant holomap of the Empire. That map highlighted planets and solar systems that were to be conquered or chastised. A third lobe housed the Emperor's Throne Room, and a fourth one contained a luxuous receiving area as well as Palpatine's private sleeping chamber. The tower's summit was covered in sensors and communications arrays, and was crowned by a girdle of laser cannons. The main area itself was also split into three levels: The gantry stretched above the central floor, the throne room itself, and the royal living quarters and the quarters for the Emperor's personal bodyguards. Depending on whether either the throne room itself or the royal apartment were occupied, it was guarded either by four squads of stormtroopers (unoccupied), or by the same amount of squads for the Imperial Royal Guard (occupied)."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The construction of the second Death Star was ordered by Emperor Palpatine in 0 BBY, while a first, smaller Death Star had just been completed. Ironically, that first battlestation, however, was destroyed at the hands of Luke Skywalker shortly after Palpatine issued the construction order. Because of that drawback, many facets of the original design were altered. As part of that redesign, Palpatine had his chief designer, Bevel Lemelisk, construct a special command center for the second Death Star. In order to appeal to the Emperor's sense of theater, Lemelisk suggested the addition of a tall tower at the northern pole of the new battlestation. Around eight months after the loss of the first Death Star, the isolation tower had been completed, as the Emperor granted an audience to Senior Captain Thrawn in its throne room area."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}