{"url": "Emperor%27s_adviser", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Imperial Advisors", "Category:Political titles"], "nodes": [{"tag": "h1", "text": "Emperor's adviser"}, {"tag": "p", "text": "The Emperor's advisers, also known as Emperor's advisors or Imperial advisors, were high-ranking bureaucrats within the Galactic Empire. They served a variety of roles, including governance and control, as well as more mysterious ones. The most senior among them formed the Imperial Ruling Council, which was chaired by the Grand Vizier. They were noted for their sartorial extravagance."}, {"tag": "h2", "text": "Organization and duties"}, {"tag": "p", "text": "The Emperor's advisers, also referred to as Emperor's advisors or simply as Imperial advisors, were extremely powerful and influential bureaucrats whose duty was to oversee details of the Empire's administration. They also conducted covert surveillance on the home star systems other advisers and high-ranking military officers. Typically, there were around one hundred of them. The most senior among them served on the Imperial Ruling Council, which was chaired by the Grand Vizier."}, {"tag": "p", "text": "Imperial advisers had a large amount of control over large regions of space, and had the power to appoint Moffs. As such, Moffs, who were in control of large sectors and their corresponding Sector Groups, reported directly to them and the Emperor. Imperial advisers carried a variety of decrees from the Emperor, and were charged with reporting to him about the state of affairs of government. Some advisers had more mysterious roles that were only discussed as rumors within the highest levels of government, such as scouring the galaxy for Sith artifacts."}, {"tag": "p", "text": "Despite the actual importance of their duties, the Emperor saw his advisers more as errand boys, as he took advice from no one. To remind them of who they owed their influence to, Palpatine often manipulated his advisers and played them against each other to keep them from gaining too much personal power."}, {"tag": "p", "text": "Imperial advisers wore outlandish garments that were reminiscent of the Naboo noblemen's sartorial extravagance, typically lush, plush, purple robes and flamboyant hats. Most of them operated on the Imperial capital of Coruscant. Even though their duties, tasks, and schemes frequently took them to remote places across the galaxy, they tried not to stay away from the Emperor for too long, for fear of losing influence to a rival or missing important events. While some advisors were well-known public figures, walking like gods among mortals on their respective homeworlds, others worked behind the scenes. They had sundry personal staff of their own and owned posh residences."}, {"tag": "p", "text": "Presumably, only a very small number of advisers were aware of the Emperor's secret identity as a Force-wielding Dark Lord of the Sith. One such privileged individual was Adviser Yupe Tashu."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Sheev Palpatine was still a seemingly unassuming senator representing Naboo in the Senate of the Galactic Republic, a clique formed around him. After Palpatine was made Supreme Chancellor of the Republic, at least some of them—namely Janus Greejatus, Ars Dangor, and Sate Pestage—came to work as his emissaries. Eventually, Palpatine abolished the Republic and proclaimed the First Galactic Empire, anointing himself Galactic Emperor. Many members of his political clique were promoted Imperial advisers, with some like Greejatus, Dangor, Pestage, and Kren Blista-Vanee sitting on the Imperial Ruling Council."}, {"tag": "p", "text": "Early in the Imperial Era, Adviser Rersey was sent to Mustafar to check on the Emperor's Sith apprentice, the cyborg known as Darth Vader, who had angered his master. Rersey lost his mind at Mustafar after witnessing traumatizing events at Fortress Vader."}, {"tag": "p", "text": "At the time of the Gorse conflict, eleven years before the Battle of Yavin, Count Denetrius Vidian was one of the Emperor's advisers. Although he was not part of the Ruling Council at the time, the Imperial Captain Rae Sloane expected him to to be soon."}, {"tag": "p", "text": "In the years that led to the Galactic Civil War, Adviser Sim Aloo and his daughter Alinka collected Sith artifacts from across the galaxy for the Emperor's collection. Adviser Greejatus also participated in that artifact hunt. Similarly, Adviser Veris Hydan was a scholar of Jedi and Sith lore. Upon the discovery of an ancient Jedi Temple on Lothal, he was charged with leading the excavation."}, {"tag": "p", "text": "When the Emperor went to the second Death Star to oversee the destruction of the Alliance to Restore the Republic, six of his advisers, including Janus Greejatus and Sim Aloo, accompanied him aboard his private shuttle. All six died along with their Imperial master when the Death Star was destroyed by the Alliance during the Battle of Endor."}, {"tag": "p", "text": "Following the Emperor's demise at Endor, Adviser Yupe Tashu became part of a short-lived group known as the Imperial Future Council."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}