{"url": "Emperor_Palpatine_Surgical_Reconstruction_Center", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Coruscant medical facilities", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Locations of the Sith", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Emperor Palpatine Surgical Reconstruction Center"}, {"tag": "p", "text": "The Chancellor Palpatine Surgical Reconstruction Center, sometimes shortened to ChanPal SuRecon Center, crowned one of the tallest buildings on Coruscant. During the Clone Wars, it was also known as the Grand Republic Medical Facility or simply as the Grand Medical Facility. It later became known as the Emperor Palpatine Surgical Reconstruction Center, being commonly referred to as the EmPal SuRecon Center. It was an imposing spire that dominated its particular stretch of the Galactic City—later Imperial City—skyline."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Dark designs"}, {"tag": "p", "text": "The Sith stronghold hid in plain sight with large windows that seemed to show that there was nothing to hide. In addition, it relied on the Jedi's reluctance to attack a hospital and risk the patients inside. It featured four landing pads for emergency cases near the top of the structure. The interior was lined with ultradense walls of neuranium shielding to conceal any radiation leak from the building's reactor. Surrounding this shielding was an exterior shell of durasteel armored with a lanthanide and duralium alloy. Palpatine performed acts of Sith alchemy within the ChanPal SuRecon."}, {"tag": "h3", "text": "Darth Vader"}, {"tag": "p", "text": "This gloomy location was the site of Darth Vader's rebuilding. After Darth Vader's duel with his former Master, Obi-Wan Kenobi, Darth Sidious brought his badly wounded apprentice via shuttle to the Reconstruction Center where he was to be rebuilt. During the duel, Vader had sustained near-fatal third-degree burns, severe lung damage and the loss of his remaining limbs, as well as emotional pain."}, {"tag": "p", "text": "The damage to his body would be repaired through intensive cybernetic enhancement at the main laboratory. Palpatine also ordered the medical droids—two 2-1B surgical droids, one FX-6 medical assistant droid, and one DD-13 cybernetic surgical droid—to keep Vader awake during the process so the pain would make him stronger. Many of these droids had either participated in or observed the transformation of Qymaen jai Sheelal into Grievous. Upon his revival as a cyborg, Vader questioned his master about Padmé Amidala. Sidious replied that Vader had killed his wife in his anger. Overwhelmed by his despair in the belief he had killed his wife and their unborn child, Vader broke his bindings on the operating table and struggled to walk under the power of his new mechanical legs. His rage destroyed the medical droids that had saved his life and severely damaged the interior of the main laboratory. It also caused a worker to go deaf permanently."}, {"tag": "p", "text": "The workers didn't know it was Vader who was being worked on. They thought it had been either a ghost or all the beings who had been killed in the Clone Wars screaming one last scream. This rumor continued through 18 BBY."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "In the first months of the Galactic Empire, Emperor Palpatine used the EmPal SuRecon Center as his headquarters. He hosted meetings with members of the Imperial Senate in a throne room below his private chamber and Sith medical facility. He eventually moved his base of operations to the Imperial Palace once it had been rebuilt to his specifications. Darth Vader returned to the facility for repairs to his prosthetic right arm, damaged in a duel with Bol Chatak on Murkhana."}, {"tag": "p", "text": "Later in the reign of the Empire, the EmPal SuRecon Center became known to citizens as one of the most prestigious medical treatment centers in the galaxy. Its architecture included VLD2261 laser cannons, Royal Guard emplacements, a private meditation chamber for Palpatine, and other facilities used for training Dark Jedi. Korriban lightsaber crystals, Sith scrolls, powerful Sith artifacts, bio-details of hundreds of generations of Sith, and a dark force reservoir were also housed in the building's center."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}]}