{"url": "Empire%27s_Wrath", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Articles with gameplay alternatives", "Category:Cleanup", "Category:We're Doomed!", "Category:Empire's Wrath's crew", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Members of the Emperor's power base", "Category:Members of the Sphere of Military Offense", "Category:Pilots", "Category:Sith Lords of the reconstituted Sith Empire", "Category:Sith Warriors", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Empire's Wrath"}, {"tag": "p", "text": "The Empire's Wrath, originally known as the Emperor's Wrath prior to the Sith Emperor's split with the Sith Empire, and also known by the call sign Tempest, was a powerful Sith Lord who studied under Darth Baras, before earning their place as the Emperor's personal enforcer and executioner."}, {"tag": "p", "text": "Securing a place as Baras's Sith apprentice on the planet Korriban, the Sith served as Baras's enforcer, hunting down the Jedi Padawan, Jaesa Willsaam and turning her to the dark side of the Force before taking her as their own student to spite her teacher Nomen Karr."}, {"tag": "p", "text": "Ascending to the rank of Sith Lord, the Sith Warrior helped Baras set in motion the renewed Galactic War with the Galactic Republic and destroy Baras's own Sith Master Darth Vengean, allowing Baras to take Vengean's place on the Dark Council. However, Baras turned on his student and tried to kill the Sith on the planet Quesh. The warrior survived and was recruited by the Emperor's Hand, who anointed the Sith as the new Emperor's Wrath—the personal enforcer of the Sith Emperor—and tasked the Wrath with stopping Baras's plans to declare himself the Emperor's Voice and thus the de-facto leader of the Empire."}, {"tag": "p", "text": "The Wrath systematically destroyed Baras's servants and machinations before slaying the man during a meeting of the Dark Council, and continued to serve as the Wrath during the ongoing conflict. When the Sith Emperor broke from the Empire he once ruled after they learned of his efforts to consume all life in the galaxy, the Wrath was rechristened the Empire's Wrath, but vanished around the same time as the Eternal Empire emerged from the Unknown Regions; despite the efforts of the Wrath's allies, the Sith Lord was still missing five years later."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Trials"}, {"tag": "p", "text": "The unidentified Sith Warrior first arrived on Korriban at the behest of Overseer Tremel, who was himself tasked with finding and training talented acolytes in the dark side of the Force. Though initially unbeknownst to them, Tremel also had plans to use the Warrior to destroy Vemrin, who sought to become a potential apprentice to Darth Baras. To accelerate the trials, Tremel first tasked the acolyte with recovering an ancient Sith warblade from the tomb of Ajunta Pall. The acolyte successfully recovered the blade, which became his primary weapon throughout the upcoming trials."}, {"tag": "p", "text": "Tremel gave the Warrior a series of trials to test and hone skills in the Academy and the Valley of the Dark Lords. One of them required slaying Beast of Marka Ragnos. The death of the beast was felt by Sith throughout the Academy. Among them was also Darth Baras who ordered the Warrior to appear before him. The Warrior quickly came to realize that Tremel's target was a more powerful master and betrayed him at Baras's instruction. By successfully slaying Tremel, the Warrior was ingratiated to Baras and became one of the armored Sith Lord's most valuable and promising acolytes. The first task under the new master was to recover shards from the tomb of Tulak Hord"}, {"tag": "p", "text": "It was not long before Baras assigned the Warrior's the final challenge of their training. The Warrior was sent to Naga Sadow's tomb to retrieve an ancient lightsaber. In order to find the secret path into the tomb, the Warrior was assigned the Twi'lek slave girl Vette, who had been detained for attempting to loot said tomb. With her assistance, the Warrior was able to retrieve the relic, defeat Vemrin and graduate from warblade to lightsaber, as well as from mere acolyte to full apprentice."}, {"tag": "h3", "text": "Apprentice of Darth Baras"}, {"tag": "p", "text": "Master and Apprentice soon traveled to the capital planet of the Empire, Dromund Kaas. The Warrior carried out many tasks for Darth Baras on the stormy world, including the infiltration and assassination of some of Baras's rivals, among them the rogue Lord Grathan. The first mission was to oversee the transfer of a prisoner from at Cargo Port B7. There, the Warrior meet with Commander Lanklyn who was in charge of operation. During the transfer, two gangs interfered: Slestack and his men and TuMarr with his men. The Warrior defeated the thugs and secured the prisoner for Baras. The next mission took place near the unfinished statute of Vowrawn. Vowrawn was a Dark Council member and one of Baras's primary rivals. Baras secretly sparked and supported a rebellion among the slaves that were brought on Dromund Kaas by Lord Qet to build the colossal statue. The slave captains threatened to expose Baras's involvement if they were not provided with more weapons. The Warrior was sent to meet with Commander Pritch and eliminate the slave captains."}, {"tag": "p", "text": "While returning to Kaas City, Baras revealed that the prisoner, who was earlier secured, was a Republic spy named Grik Sonosan. Baras was unable to break the spy's will through conventional interrogation techniques. He then tasked the Warrior to recover an ancient torture and interrogation device known as the Ravager located somewhere within the Dark Temple. The mission was successful and with the new device Baras was able to glean that a new Republic threat had risen to challenge his interests. One of Baras's oldest enemies, Jedi Master Nomen Karr, had been training a Padawan with the unique ability to discern one's true nature with but a glance."}, {"tag": "p", "text": "Fearing that his extensive spy network could be compromised by the Padawan's unique talent, Darth Baras sent the Warrior out into the galaxy to track down and destroy the threat. To this end, Baras provided the Warrior with a pair of lavish gifts: a protocol droid designated 2V-R8 and a Fury-class Imperial interceptor. Once acquainted with the ship, Baras called via hologram and explained that the Warrior's first mission is to first eliminate his exposed spies."}, {"tag": "h4", "text": "Hunting a Jedi"}, {"tag": "h5", "text": "Balmorra"}, {"tag": "p", "text": "The Warrior's first stop was at war-torn Balmorra. Balmorra had played a significant role in the Great Galactic War as both the location of military manufacturing plants and its close proximity to the Core Worlds, but had been abandoned by the Republic military a decade prior due to the terms of the Treaty of Coruscant. Despite this, the planet still offered stiff resistance to the encroachment of the Sith Empire's forces; one of the many hurdles that the Warrior had to overcome during the mission there."}, {"tag": "p", "text": "Baras' spy, Commander Rylon, was embedded amongst the Balmorran resistance and Karr had sent an investigator to expose him. Working with Lieutenant Malavai Quinn, the Warrior worked to cover Rylon's tracks. The most urgent was recovering data from a satellite control tower in the Markaran Plains that contained evidence of Rylon's involvement in sabotage of Balmorran defenses prior to imperial invasion. The next target was his son Durmat, who knew of his father's true allegiance and was waiting to be interrogated by the Jedi investigator. The Warrior eliminated Durmat in his cell before the Jedi arrived. The Warrior then went to confront Rylon at the Balmorran Arms Factory. He first had to deal with the republic commandos, led by Captain Eligyn, who were defending his command center. Before Eligyn's execution, Rylon revealed to him that he is an imperial spy. Rylon then told the Warrior that he was honored to serve the Empire and Baras and that they should fight to make his death seem convincing."}, {"tag": "p", "text": "Quinn warned the Warrior that the investigator is a Jedi Knight, who had recorded the conversation between the Warrior and Rylon and was headed for the Sobrik spaceport. Upon confronting the Jedi, Mashallon, who boasted that she has transmitted the proof to the Jedi Council. She further boasted that her purity in the light side of the Force makes her better than the Warrior's strength in the dark side. The Warrior didn't practically care for her emotionless dribble and engaged her in a lightsaber duel. Seriously wounded, Mashallon offered no resistance, believing that she had at least served the greater good. Just then, Quinn arrived with a squad of Imperial troopers, revealing that he had intercepted her transmission, thereby keeping the Jedi in the dark. The Warrior mocked Mashallon for the utter failure of her mission, to which the Jedi defiantly claimed that Nomen Karr would find the proof despite this setback. And once again, she offered no more resistance, at which the Warrior executed her."}, {"tag": "p", "text": "The Warrior later met with Quinn in his office in Sobrik, to report to Baras on their close call. The Warrior also gave credit to Quinn for his assistance in the mission, so Baras promoted him to captain and a posting of his choosing. Quinn chose to serve with the Warrior."}, {"tag": "h5", "text": "Nar Shaddaa"}, {"tag": "p", "text": "The Warrior's next mission was on the notorious Huttese moon of Nar Shaddaa. Though forced to contend with and become involved in many of the criminal underworld's intrigues, the Warrior's mission was simply to plug an information leak by executing one of Darth Baras' former agents. Upon arriving on Nar Shaddaa, Warrior met with his contact Halidrell Setsyn who revealed that the mission's target, Agent Dellocon, found a refuge at Baras' rival Sith Lord Rathari. Warrior started to thwart Rathari's plans on Nar Shaddaa. In retaliation for the actions against him, he killed Setsyn. But the goal was achieved - through destroying Rathari's operations, Warrior managed to draw him to a confrontation where he was defeated. Agent Dellocon ended up without protection and was eliminated."}, {"tag": "h5", "text": "Meeting a Jedi Master"}, {"tag": "p", "text": "After completing the mission on Nar Shaddaa, Baras warned his apprentice that a Republic listening outpost had been tracking his ship since the beginning of his missions. The Warrior diverted from the primary mission and quickly laid waste to the listening post, destroying important parts of its mechanisms. Arriving in the command center, the Warrior came face-to-face with Nomen Karr, who was monitoring the station via hologram. Karr stated that he was aware of Baras acquiring a new apprentice, so he set up this listening post. He pleaded for the lives of the technicians before them, stating that they were only following orders. The Warrior refused and slaughtered them all. This excessive display horrified Karr, as the Warrior continued to mock him. Karr then boasted that the Warrior is unaware of what he had planned, only for the Warrior to reveal that they know of his Padawan. Surprised at this, Karr regained his composure and declared he would keep his Padawan safe from the taint of the Sith, even as the Warrior promised to \"have her skull as a trophy.\" Karr then summoned a squad of Republic troops, claiming them to be the Republic's finest and urged the Warrior to surrender. The Warrior refused and killed them. Karr then closed the transmission, stating that he has valuable insight on how to defeat the Warrior for their eventual confrontation."}, {"tag": "h5", "text": "Tatooine"}, {"tag": "p", "text": "With the ship's tracks covered, the Warrior then proceeded on to Tatooine in order to destroy many of the mysterious Padawan's personal connections. By sending the Warrior on this mission, Baras hoped that he could use the Warrior to draw out and destroy their prey. However, the Warrior suggested turning the Padawan to the dark side. Baras could not deny the thought, but warned that the Padawan is still dangerous and seduction to the dark side should be left to masters."}, {"tag": "p", "text": "Upon landing Tatooine, Baras explained that the target is Master Yonlach, who brought the Padawan's powers into expression. The Warrior then met with Baras' contact, Sharack Breev, who helped the Warrior retrace the Padawan's trials throughout the planet, which included facing a Sand demon."}, {"tag": "p", "text": "While tracking the Padawan, the Warrior arrived at an oasis in the desert. Here the Warrior was confronted by a reflection of the light side, claiming to be his true potential. The reflection attempted to convince the Warrior to abandon the dark side and embrace the light. It pointed out that if the dark side was so powerful, why was Baras so afraid of a young girl. The Warrior refused and dueled with the reflection. Prevailing, the reflection then started spouting dark side energy and merged with the Warrior. The image then revealed to him the location of the Yonlach's hut in the Dune Sea. However, Sharack stated apprehension, as the Dune Sea go beyond the Forbidden Pass, where no one has ever returned from."}, {"tag": "p", "text": "The Warrior eventually found Yonlach's hut in the middle of the desert. Yonlach's bodyguard, Yul-Li, urged his Master to retreat to safety while he engaged the Sith, but Yonlach restrained him. Yonlach reveals that he has been remotely watching the Warrior's progress and is disgusted by the Sith's perversion of the journey of enlightenment. He also knows that the Warrior seek Karr's Padawan, so he warned her via their psychic link to remain in hiding. He demanded that the Warrior turn back, claiming that he would not prevail against two Jedi, but the Warrior refused. But before engaging, Yonlach rendered the Warrior's companion unconscious to uneven the odds. Despite being outnumbered, the Warrior managed to hold the two Jedi off and bested them. In desperation, Yul-Li gave the Padawan's identity: Jaesa Willsaam. But before he could reveal more, Yonlach wiped all memory of Jaesa from his mind. He refused to give out any more information, stating that Jaesa would lead the Jedi to greatness if untouched by the likes of the Sith. Yonlach offered no further resistance, stating that when he is struck down, Jaesa will feel how calm he is in the face of death. The Warrior obliged him, but decided to make the experience painful and struck the aging Jedi Master down."}, {"tag": "h5", "text": "Intrigues of Alderaan"}, {"tag": "p", "text": "Having learned the Padawan's identity, the Warrior then traveled to her homeworld of Alderaan, which was itself embroiled in a civil war between the Republic-backed House Organa and the Empire-backed House Thul. There, the warrior set about various tasks to aid the Empire's ally and became involved in a number of House Thul's conflicts with various Alderaanian noble houses."}, {"tag": "p", "text": "In the course of the mission, the warrior learned that, apparently, Willsaam had been discovered as a Force-sensitive while acting as a servant girl to Lady Renata Alde of House Alde. After cleaving a path through Alde territory and murdering her personal bodyguard, Lady Renata confessed that Willsaam had actually been handmaiden to Gesselle Organa, before being taken into custody by Thul forces."}, {"tag": "p", "text": "The warrior, with ally Duke Kendoh Thul then set about the difficult task of assaulting the Organa position. Gesselle Organa and her forces were protected by a tremendously powerful force field, which was powered by siphoning off power directly from Alderaan's planetary generator. With the aid of Thul forces, the warrior set out to sabotage the generator to force it into backup mode—cutting off any excess power drains, thereby deactivating the Organa force field."}, {"tag": "p", "text": "After sabotaging the planetary generator, the Warrior successfully cleaved a path into the Organa encampment, slaying numerous soldiers before confronting General Gesselle herself. By torturing her personal guards, one of whom was revealed to be her lover, the Warrior was able extract the information he desired from Organa. She revealed that Jaesa Willsaam's parents were still servants at Castle Organa. The Warrior then executed General Gesselle and her body guards for defying the Empire."}, {"tag": "p", "text": "Continuing the relentless assault, the Warrior fought through Castle Organa's many soldiers and guards to find Willsaam's parents, only to discover them guarded by the Jedi Volryder. The Warrior shocked Volryder by Force choking the older couple to death, and then quickly slayed the Jedi in single combat."}, {"tag": "p", "text": "While reporting the mission's success to Darth Baras, the Warrior learned that Duke Kendoh had turned on his Sith ally, telling Baras lies in order to advance his own position as an Imperial ally. While confronting and executing Kendoh for his treachery, Kendoh's bodyguard and fellow Sith FimmRess stood by and allowed vengeance to take its course."}, {"tag": "h4", "text": "Confrontations"}, {"tag": "p", "text": "Having murdered Willsaam's parents, the Warrior was surprised to find a holomessage from the young Padawan waiting to be viewed. As Darth Baras had planned, she had felt the death of her parents through the Force and was grieving for their loss. Without her master's knowledge, she arranged a meeting between herself and the Warrior aboard her ship in the Outer Rim. The Warrior then turned to the crew for their opinions; Quinn suspected a trap, possibly orchestrated by Karr, while Vette insisted that Willsaam was being honest."}, {"tag": "p", "text": "Instead of finding Willsaam or any crew, the Warrior found just two Jedi Knights aboard the ship. They revealed that their master, Nomen Karr, had learned of Willsaam's plan and sent Ulldin and Zylixx instead—to kill the Warrior. The Knights engaged the Wrath, but the two were quickly defeated. Zylixx was nearly close to the dark side when the warrior immediately slays him while Ulldin was badly injured. As the Wrath was ready to kill him, Ulldin was ready to die and become one with the Force."}, {"tag": "p", "text": "The Warrior contacted Baras upon returning to the ship to report in, but was given far more surprising news by Baras than the news of being ambushed by a pair of Jedi. Nomen Karr had finally succumbed to Darth Baras' machinations, and sought to arrange a duel between Jedi Master and Sith Lord on Hutta to finally resolve their dispute. But not to be drawn into what might have been a trap himself, Baras sent the Warrior to the duel in his stead. With both youth and strong martial skills to rely upon, Baras was confident in the Warrior's ability to defeat his old rival."}, {"tag": "p", "text": "The Warrior traveled to Hutta, and from the spaceport to the site of the arranged duel. Though it was not a trap for Baras, and nor was Karr surprised that Baras hadn't come himself, the Warrior and the Jedi Master dueled nonetheless. Still seeking to draw out Willsaam, the Warrior goaded and taunted Karr throughout the fight until Karr finally embraced the dark side. Ultimately however, Karr proved to be no match for the combat prowess of the Warrior and was defeated."}, {"tag": "p", "text": "After a period of torturing the newly-Dark Jedi, Willsaam arrived to resolve the conflict permanently. Upon seeing her Master defeated, tortured, and twisted by the dark side, she engaged the Warrior with her double-bladed lightsaber in a duel of their own. The strength and combat prowess of the Warrior quickly defeated her as well. After she had acknowledged the power of the dark side over the light side the Warrior took her on as an apprentice."}, {"tag": "h3", "text": "Sith Lord"}, {"tag": "p", "text": "For successfully carrying out so many of Darth Baras' missions, slaying a Jedi Master, and recruiting the threat into their own cause, Baras bestowed upon the Warrior the rank of Sith Lord. While still nominally a servant of Baras, the Warrior was now counted among the ranks of the Lords of the Sith."}, {"tag": "h4", "text": "Plan Zero"}, {"tag": "p", "text": "The new rank afforded the Warrior with new opportunities, and a greater involvement in Darth Baras' more important plots. Baras revealed to the Warrior that his own master, Darth Vengean of the Dark Council, had tasked him with destroying the Treaty of Coruscant, which he regarded as a disgrace to the Sith. To this end, Vengean ordered Baras to hunt down and kill Republic General Karastace Gonn. Gonn had been a thorn in the Empire's side during the Great Galactic War, preventing Imperial forces from being able to conquer fringe systems."}, {"tag": "h5", "text": "Return to Nar Shaddaa"}, {"tag": "p", "text": "Baras' vast intelligence network had uncovered traitors within the ranks of Imperial Intelligence who were feeding information to Gonn. Baras had learned that Gonn was to meet some of these traitors on Nar Shaddaa, and sent the Warrior to kill them all. After dispatching Gonn and his Imperial mole Fawste, the Warrior was summoned back to Dromund Kaas to discuss the next move in Darth Vengean's plot to re-ignite the war between the Empire and the Republic."}, {"tag": "p", "text": "Back on the Imperial capital, the Warrior walked into Baras' office to witness the Sith Lord communicating with Vengean via hologram–and taking credit for the successful killing of General Gonn. The Warrior was briefly introduced to the Dark Council member, before the communication was ended."}, {"tag": "p", "text": "Darth Baras then proceeded to reveal more of the plan to his apprentice. Plan Zero was revealed to the Warrior; the plot to quickly terminate the most senior and experienced members of the Republic's military leadership, with the intention of both restarting the war and ensuring the Empire's victory in it by destroying its most capable leaders before hostilities even began."}, {"tag": "h5", "text": "Taris"}, {"tag": "p", "text": "To this end, the Warrior was sent to the ruins of Taris, a world noted for being the site of major galactic events several centuries prior. On the ruined world, Baras had learned a summit of the Republic's War Trust - consisting of Generals Elaxis Frellka, Minst, Durant, and Faraire - was taking place. Such a rare assembly of important individuals in one place was an opportunity which could not be ignored, and Baras sent the Warrior to kill the four Generals."}, {"tag": "p", "text": "On Taris the Warrior began to work with Moff Hurdenn, aiding the Imperial officer in sabotaging the Republic's efforts to restore the planet in exchange for assistance in hunting down the members of the War Trust. While working in tandem, the Warrior was introduced to a subordinate of Hurdenn, Lt. Pierce. With several missions, the Warrior was able to eliminate the first three targets on Taris: Elaxis Frellka, Minst and Durant."}, {"tag": "p", "text": "When seeking out the final surviving general, Faraire, the Warrior deferred to the tactical experience of Malavai Quinn in co-ordinating the assault on the Republic compound. Ultimately all of the Warrior's companions would prove invaluable in defeating the last surviving member of the War Trust, and Lt. Pierce would join the Warrior's crew."}, {"tag": "h5", "text": "Quesh"}, {"tag": "p", "text": "The Warrior reported the mission's success to Darth Baras back at the ship, and was immediately given a new assignment. Republic Admiral Monk, another target of Plan Zero, had somehow learned that Darth Vengean's flagship was in orbit of Quesh and had launched a surprise attack. Not one to miss an opportunity, Baras ordered the Warrior to join the fray immediately and kill Monk."}, {"tag": "p", "text": "The Warrior arrived in the Quesh system to discover Vengean's flagship besieged and already boarded by Republic soldiers. Avoiding space combat entirely, the Warrior landed on Vengean's ship and cleaved a path through the invaders until reaching the ship's commanding officer."}, {"tag": "p", "text": "Moff Masken, the commander of the vessel, was incensed by the ambush, which he assumed to be Baras betraying Vengean in a Sith power struggle at the cost of Imperial lives, and that the Warrior was complicit in this scheme. From him, the Warrior found out that Admiral Monk had already fled in an escape pod to the planet below. The Warrior dealt with the indignant Moff, and then proceeded down to Quesh."}, {"tag": "p", "text": "Eventually confronting Admiral Monk in Fort Phalanx, the Warrior learns that he and his crew had been turncoats working for Darth Baras for over a decade. It would appear that Moff Masken's suspicions of Sith machinations were proven correct. But it was not yet time for Baras' treachery to be revealed to Vengean, so the Warrior struck the treasonous Republic admiral down. As he died, Monk told him that no one was safe from Baras, not even the Warrior. Upon departing from the toxic planet, Baras made no secret of the fact that he had used both the Imperials and his own apprentice in order to undermine Vengean. Nonetheless, because of Vengean's blunder, the Treaty of Coruscant is ended and Galactic War has been reignited with the Republic."}, {"tag": "h5", "text": "Hoth"}, {"tag": "p", "text": "But there was still work to be done, and Plan Zero was nearing completion. While the Warrior had been searching for Monk, Baras had tracked the final target of the plan, Jedi Knight Xerender, down to the distant ice world Hoth."}, {"tag": "p", "text": "The Hoth system had been the site of a major space battle during the war, and a number of vessels had crashed onto the frigid planet. Xerender, it seemed, was there to find a Republic superweapon which had gone down with one of the ships years earlier. Baras instructed the Warrior to retrieve the weapon if possible, but that terminating Xerender was the primary mission objective."}, {"tag": "p", "text": "Rendezvousing with Baras' underling, Ensign Slinte, at Dorn Base, the Warrior learned that his commanding officer, Commander Lanklyn, had gone missing. The Warrior tracked down Lanklyn, discovering him besieged by Talz. After Lanklyn gave Xerender's last location, the Warrior journeyed there and discovered and empty Talz village. Xerender's Padawan was the only survivor, scared of a bloodthirsty Talz named Broonmark, who then decloaked and snapped his neck. Broonmark was out to kill Fetzellen, the Talz leader allied with Xerender, who had come to Hoth in search of Jedi Master Wyellett. Thus, the Warrior proposed an alliance."}, {"tag": "p", "text": "At the next Imperial base, the Warrior met with Baras via hologram. However, Xerender had intercepted their holofrequency, mocking the Warrior as nothing more than Baras' lapdog and told his foe that he will win this time. As soon as Xerender signed off, Baras took out his frustrations on Lanklyn and Force-choked him to death, promoting Slinte to Lanklyn's former position. Afterwards, the Warrior confirmed Xerender's objective. Baras recalled that Wyellett stole his lightsaber after a failed attempt to redeem him and that he somehow survived the crash of his prison transport over Hoth many years ago. Baras was then able to pinpoint his lightsaber's location, which could also lead straight to Xerender."}, {"tag": "p", "text": "The Warrior interrupted the trade between Talz and pirates. Unfortunately, Broonmark was not happy that the Sith stole his rightful kill and fought against the Warrior, only to be defeated. The Talz then consented to joining the Sith in the search for both their foes."}, {"tag": "p", "text": "At the wreckage of the Star of Coruscant, Broonmark personally beat Fetzellen to death. Journeyed further into the ruined starship, they found Xerender recovering Wyellett, who had sustained himself for years through the Force to survive on Hoth. The Warrior engaged Xerender and defeated him. Wyellett pleaded for his Padawan's life but the Warrior refused and killed him. The aging Jedi then asked to be left alone, having grown beyond the galaxy's concerns during his exile but the Warrior refused to leave him be. They dueled, threatening to cause a cave-in but the Warrior emerged victorious before that could happen."}, {"tag": "h4", "text": "Machinations of Darth Baras"}, {"tag": "p", "text": "When the Warrior defeated Xerender and Plan Zero had succeeded, Baras recalled the Warrior to Dromund Kaas to discuss his own plans to overthrow Vengean, whose blunder at Quesh had the the Dark Council calling out for his head. Baras refrained from facing Vengean himself, stating that if his own apprentice succeeded, it would prove Baras' power to the Dark Council."}, {"tag": "p", "text": "To this end, the Warrior freed Vengean's apprentice, Lord Draahg, who was himself an ally of Baras. The pair went on to confront and kill Vengean, allowing Baras to ascend to his position on the Dark Council. But before killing the Dark Lord, Vengean reminded the Warrior that Baras was a coward and would not have gotten to where he was then without the aid of his strongest enforcer."}, {"tag": "h3", "text": "Wrath of the Emperor"}, {"tag": "h4", "text": "Betrayed"}, {"tag": "p", "text": "Baras soon dispatched the Warrior back to Quesh to thwart a Republic assault on Imperial holdings. The Warrior confronted a Republic strike team inside a mine. Captain Trey-yen attempted to detonate the explosives to take the Sith down with him but for some strange reason the bomb failed to detonate. The Warrior proceeded to slaughter the entire squad before receiving a holocall from Draahg. Draahg reveals that this was all a trap set by Baras. Baras had foreseen that his apprentice could eventually overthrow him, and had one of his Republic moles set up this trap. Draahg then triggers the real detonator."}, {"tag": "p", "text": "The Warrior managed to survive the explosion but was knocked unconscious. Briefly regaining consciousness, the Warrior saw two Pureblood Sith standing over them. The Sith in the hood asked his compatriot if he should revive their asset. The other stated that they must be sure the Warrior is worthy. He says that they will wait at the command center exactly one day for their proof. The Warrior then drifted back into unconsciousness."}, {"tag": "p", "text": "Later waking, the Warrior decided to find out who those mysterious Sith were. Upon arriving at the command center, the Sith without a hood stated that the Warrior is worthy to be the Emperor's Wrath. However, the Warrior demanded to know if they will help kill Baras and Draahg. The Sith stated that they have a mutual goal. They introduced themselves as Servant One and Servant Two, the Emperor's Hands. The two dark agents explained that the Emperor himself has assigned the Hand to take out a threat to the Empire and they have chosen the Warrior to be his personal enforcer and executioner, the Emperor's Wrath, to carry out his will. Baras plans on seizing power against the Emperor's wishes and must be stopped. The Wrath was more than eager to take on their mission if it is to exact vengeance on Baras."}, {"tag": "p", "text": "Servant One explains that since the Treaty of Coruscant, the Emperor has withdrawn from the known galaxy for a \"great calling\". Baras learned of this and has decided to take advantage by claiming to the Dark Council that he has been chosen as the Voice of the Emperor, a vessel who embodies the Emperor's words. The Voice is obeyed as the Emperor himself and if Baras succeeds in convincing the Council to acknowledge him as the Voice, he will wield supreme power over the Empire. The true Voice has disappeared and in its absence, there is nothing to deny Baras' claim. Some on the Council truly believe, others see an advantage in supporting him and Baras plots against those who oppose him. The Wrath states that they could end the threat now by killing Baras. One stated that Baras is currently too powerful to confront now. He tells the Wrath that they have contacted their crew in the Wrath's absence and updated them on these events. While Baras plots his mad scheme, he will remain blind to the Wrath's survival."}, {"tag": "p", "text": "Upon returning to the ship, One tells the Wrath that the first location to begin Baras' downfall is on the planet Belsavis, and promised more information when they arrive. The Wrath then assembled the crew to hear their opinions. Quinn had little-to-no opinion over opposing Baras; Broonmark stated that he will help cleanse the Sith of Baras; Pierce says he doesn't care for Baras; Jaesa grew excited that directly serving the Emperor puts herself and her Master closer to ultimate power; Vette, however, is unsure, saying she's unsettled by the Hand and asks the Wrath if they can do this. The Wrath stated that their mission is to destroy Baras."}, {"tag": "h4", "text": "Blood of the betrayer"}, {"tag": "p", "text": "The Hands sent the Wrath to Belsavis, a Republic prison planet which had been its best kept secret until only recently. Servant Two vaguely stated that Belsavis houses \"the blood of the betrayer.\" One explains that when the prison manifests were leaked, Baras learned that his sister, Darth Ekkage–a member of the Dark Council and leader of the Sith infiltrators–was alive and imprisoned on Belsavis. If she were to reunite with Baras, many more would bow to him."}, {"tag": "p", "text": "Journeying to the planet surface, the Wrath began trailing Baras' agent, Lord Melicoste, who had come to free Ekkage, while slaying any Imperials who threatened to alert Baras. The first major lead was extracted from Lieutenant Kaid who was leading of Melicoste's commando teams. Ultimately, Melicoste's trail led to the records vault."}, {"tag": "p", "text": "Unfortunately, a blast door barred entrance and on the other side was a trapped Jedi Master, Somminick Timmns, who had previously been a Padawan of Nomen Karr. Timmns knew the Wrath's identity and revealed that the Jedi Council has been aware of his activities, proving that the Jedi were not as blind as Baras had assumed. After getting past the blast door, the Wrath discovered that Timmns had destroyed the records to prevent anyone else from discovering Ekkage's cell. He promised to provide the information if the Warrior would stop Ekkage's assassins."}, {"tag": "p", "text": "Finding the assassins locked up in the high security vault, the Wrath called on their loyalty to the Emperor over their mistress. The assassins sensed truth in the Wrath's words and executed Melicoste's commandos. Afterwards, the Wrath rendezvoused with Timmns in the prison section known as The Tomb, where Ekkage was being held. Melicoste had already free the Dark Lord but she killed him for his incompetence, after which both the Wrath and Timmns revealed themselves and fought against Ekkage. Once she was beaten, the Wrath promptly executed her, to Timmns' shock, who insisted they could've re-imprisoned her. The Jedi then asked as to the state of their alliance, whether they would fight as enemies or part ways. The Wrath chose the former and killed Timmns."}, {"tag": "h4", "text": "Reallocation"}, {"tag": "p", "text": "After reporting the mission success to the Hand, the Wrath was sent back to Hoth to reassign Armageddon Battalion to Corellia, where the Republic and Empire were fighting for control of the planet. A Dark Councilor, Darth Vowrawn, was one of the campaign leaders and Armageddon Battalion was to supplement the war effort. Vowrawn was also the sole Dark Councilor who openly defied Baras, who redirected Armageddon Battalion to Hoth in order to undermine Vowrawn. The Wrath was to seek out Armageddon's commander, General Greist, and convince him to abandon Baras' orders. However, Pierce, who had briefly served with Greist, described him as a stubborn character. Servant One stressed that they could not allow Greist's stubborn nature to jeopardize their plans."}, {"tag": "p", "text": "The Wrath reached out to Commander Slinte and convinced him to disclose Armageddon's whereabouts. After successfully convincing Armageddon Battalion to redeploy to Corellia, the Wrath returned to the orbital space station only to find that Draahg was there. Draahg had already subdued the Wrath's inactive companions and was intent on finishing the job he started. After a long and arduous duel did Draahg finally concede defeat but promised that Baras would see the Wrath dead. The Wrath then leaped over Draahg as he charged and Force-pushed him over a railing into a fire."}, {"tag": "p", "text": "Upon reporting to the Hand, the Wrath was informed the death of Draahg had alerted Baras to his survival. The Wrath stated that Baras was a master of information, and therefore, would've eventually figured out the truth. Servant One compliments the Wrath's in-depth knowledge of Baras."}, {"tag": "h4", "text": "Mystery of Voss"}, {"tag": "p", "text": "The Wrath's next mission was on a planet called Voss, where the Republic and Empire are trying to win the support of the Voss people through diplomacy. As access to the planet was restricted without permission from sanctioned officials, the Hand contacted Darth Serevin, who believed the Wrath is coming to help."}, {"tag": "p", "text": "However, the Wrath's mission was not to aid Serevin, but to find the true Voice of the Emperor. As the Hand explained, when the Empire first discovered Voss and tried to invade, the Voss Mystics had a vision of the invasion and repelled it with ease. However, they lacked proper interpretation of the vision. The true purpose of the attack was to kidnap a Voss visionary to house the Voice. The true Voice went on a pilgrimage to discover the nature of a dark side presence on the planet. Baras had orchestrated the Voice's disappearance but avoided killing him, because if the host body were to die, the Emperor's essence would return to the Hand."}, {"tag": "p", "text": "The Wrath sought a hermit named Madaga-Ru, who was the last person to see the Voice. The Wrath gained the hermit's attention by lighting signal fires outside the Voss capital of Voss-Ka, which the Voice previously ignited. Madaga-Ru stated that the Voice went missing in the Dark Heart in the Nightmare Lands. In order venture into the Dark Heart safely, the Wrath required the Blessing of Oneness which was obtained from a Mystic Vana-Xo. To be able to unlock doors the Dark Heart chamber, where the Voice was contained, Wrath then acquired the Pendant of Bone from a Voss Commando Biddeck-Va."}, {"tag": "p", "text": "Venturing into the Dark Heart, the Wrath felt the presence of the dark side entity known as Sel-Makor, who was keeping the Voice imprisoned. Upon finding the Voice, the Emperor commanded his Wrath to kill his host body, as he could commit suicide himself due to Sel-Makor. Unfortunately, Sel-Makor possessed the Voice, determined to keep his power for himself. With great difficulty, the Wrath managed to exorcise the entity and slay the Voss host, freeing the Emperor's essence."}, {"tag": "h4", "text": "A traitor revealed"}, {"tag": "p", "text": "Returning to space, the Wrath was visited by an apparition of Madaga-Ru, who revealed that one of the Wrath's companions was a traitor but couldn't say who. The Wrath then reported to the Hand to confirm another success. The Hand then stated that the final obstacle to get within reach of Baras was to protect Vowrawn from assassination. However, Quinn stated that Baras had instituted martial law on Corellia and they needed to steal a special transponder in order to bypass the Imperial blockade. But upon arriving at a transponder station with Quinn, the captain revealed to the Wrath that there was no martial law. Quinn had thrown his allegiance to Baras, who had ordered him to dispose of his former apprentice. Quinn unveiled two assault droids he programmed with combat data he gathered on the Wrath but his overconfidence proved to be his downfall. The Wrath destroyed the droids and Force choked Quinn for his betrayal but chose to spare him whereas Baras would not. Quinn would then have to earn back his Master's trust."}, {"tag": "h4", "text": "The final step"}, {"tag": "p", "text": "Arriving on Corellia, the Hand transmitted the coordinates of three separate landing pads where one assassin each would be arriving. The Hand stressed the need to protect Vowrawn; if he died, Baras would be named the Voice of the Emperor. But as soon as the Hand say their goodbyes, Darth Baras makes a forced transmission and attempts to convince his former apprentice that the Hand is not who they say they are and that he is truly the Emperor's Voice. He attempted to persuade the Wrath to walk away and promised their personal dispute could be forgiven. The Wrath refused to be swayed and moved to intercept Baras' assassins at their landing spots. First assassin was a droid and the second was an SIS agent. Upon arriving at the landing coordinates of the third assassin, Servant Eleven alerted the Wrath that the third assassin arrived earlier than expected, and revealed the location of Vowrawn's secret base in Incorporation Islands."}, {"tag": "p", "text": "Vowrawn's followers disguised themselves as Republic. Having no time to convince them of being on Vowrawn's side, the Wrath was forced to fight past them. At the end of a corridor, Lord Haresh stood before a forcefield. He refused to allow the Wrath to get to his Master, stating that Vowrawn knows that Baras has orchestrated an elaborate ruse that he and the Wrath have a rift. Though the Wrath insisted that Vowrawn is wrong, Haresh refused to see reason and attacked, forcing the Wrath to kill him. After deactivating the forcefield, the Wrath proceeded into the room and called out for Vowrawn. Instead, his apprentice, Lord Qet and two others barred the way. Just then an elderly Pureblood Sith stepped out of the shadows, Darth Vowrawn himself, who ordered Qet to stand down. Exasperated, the Wrath insisted that killing him is not the mission. However, Vowrawn stubbornly believed that the Wrath still served Baras and offered no resistance, only requesting he not suffer the indignity of a beheading. The Wrath insists to having been sent by the Hand, not Baras, to protect him. Vowrawn remarked that nothing more can be gained by maintaining the deception, unless the Wrath is telling the truth. The Wrath then spotted a thermal detonator roll up from out of nowhere. Qet noticed it too and managed to put up a Force shield to protect himself, his fellow apprentices and his Master. The Wrath then ran up and deflected shots meant for Qet from a Weequay assassin before killing him. This convinced Vowrawn of the Wrath's sincerity of being Baras' enemy and agreed to lend his support in defeating Baras, to the Wrath's delight. Vowrawn then confessed that while he's leading the Corellia campaign, the planet itself houses significant pillars of Baras' power base, and he believes that together, they could tear them down."}, {"tag": "p", "text": "The Wrath didn't disagree but argued that Vowrawn still required protection as Baras will soon dispatch more assassins and insist that he take to the Wrath's ship for protection. Vowrawn didn't disagree as he criticized his bodyguards' failure. However, he first explained that most of the Dark Council knows that Baras is not the Emperor's true Voice but his two top spies on Corellia hold leverage against Sith who defy him and force them to support his bid. For that reason, Vowrawn chose to lead the Corellia campaign in order to neutralize these agents. Once they are gone, Baras' support will evaporate."}, {"tag": "p", "text": "The first spy poses as Colonel Senks of the Corellia resistance, who safeguards secrets Baras uses as leverage. The only problem is that his stronghold in Labor Valley can allow him to escape through a labyrinth of secret passages. Therefore, Vowrawn passed the Wrath pulse disruptors that would lock Senks' secret passages so he can be cornered. Upon confronting Senks, he admitted to being Baras' spy and insisted that he maintain his cover, for he sends resistance forces into battles they can't win. However, the Wrath refused to care and killed Senks before destroying his database."}, {"tag": "p", "text": "The second spy is embedded among Jedi ranks in Axial Park. The Wrath met with Vowrawn's operative, Shadow, who couldn't identify the spy but advised that the Wrath slay all Jedi in the enclave. The Wrath took his advice to heart and went on a killing spree in the enclave. The Jedi spy was not a he, but a she, Master Injaye, embedded in the Jedi for over a decade."}, {"tag": "p", "text": "Unfortunately, another assassin made an attempt on Vowrawn's life, more deadlier than the last. The Wrath's companions were able to move the Dark Councilor to a safehouse in the government district. Upon rendezvousing, Vowrawn commended the Wrath's companions for looking death in the eye and did not flinch."}, {"tag": "p", "text": "Vowrawn revealed that there was one final obstacle before the Wrath can confront Baras. In a secret lair on Corellia, Baras had bound and indentured a powerful Force ghost known as the Entity. He feeds off this ghost's power and all her visions of the future, which he used to build his power base. The Wrath can batter through the prison's defenses and Vowrawn knows the ritual to free her from her prison."}, {"tag": "p", "text": "Upon arriving in the central chamber, the Entity warned that they are not alone. Then suddenly, a death field envelops Vowrawn. The perpetrator is Draahg, who had survived his last duel with the Wrath, rebuilt into a cyborg by Baras, and hungry for revenge. The Entity explained to the Wrath that Draahg's implants power the death field and his death will cancel it. After finally bringing an end to Draahg was Vowrawn freed. But before he released the Entity, he had her confirm that Baras had witnessed all that had transpired through her. As soon as the Entity was free did she bid her goodbyes."}, {"tag": "p", "text": "As the ghost vanished, Vowrawn stated that the time has come for the Wrath to finally confront Darth Baras, news which excited the Wrath. However, he warns that even now, Baras is near indestructible and he knows of no other way to weaken him. Vowrawn tells the Wrath to report back to the Hand and tells them the good news."}, {"tag": "h4", "text": "The final confrontation"}, {"tag": "p", "text": "The Hand was pleased with the Wrath's success on Corellia and stated that the time had finally come to confront Darth Baras. Vowrawn journeys to Korriban as well, where Baras dare not strike in sight of the Dark Council, and grant the Wrath permission to enter the Dark Council Chambers. However, they do warn the Wrath that though Baras may be weakened, he was still a formidable foe."}, {"tag": "p", "text": "The Wrath then met with Vowrawn in the antechamber to the Dark Council. Upon entering, the Wrath announced the Emperor's will and declared Baras the false Voice. Still trying to maintain his deception, Baras tried calling on the Dark Council to assist him in destroying his former apprentice. However, the Council was unsure of who truly spoke for the Emperor and allowed both Master and apprentice to duel before them, with the victor being declared the true servant of the Emperor."}, {"tag": "p", "text": "The Wrath fought a long awaited and vigorous duel with Baras. When it became apparent that he would lose, Baras once again tried calling on the Dark Council for support but found none. Still clinging to his lie, Baras encouraged his apprentice to strike him down, promising that he will one day have his vengeance. Instead, the Wrath claimed well-deserved revenge, used the lightsaber to penetrate the chest of Baras, executed him before the Council. The Dark Council then formally acknowledge the Emperor's Wrath, declaring that they shall not challenge the Wrath's actions unless it be against the will of the Dark Council."}, {"tag": "h3", "text": "Continued travels"}, {"tag": "p", "text": "The Wrath would continue to travel around the galaxy, publicly known as the newly christened Emperor's Wrath. The Wrath would also be part of the Sith Strike Team that attacked Darth Malgus after he betrayed the Empire, slaying his ally Darth Serevin and defeating his forces before defeating Malgus himself in a brutal duel, with the help of Darth Nox, the Grand Champion of the Great Hunt and Cipher Nine; the same strike team developed to defeat Revan at the Foundry quite some time prior to Malgus' betrayal."}, {"tag": "p", "text": "Also, during the Battle of Ilum, the Wrath slew the Jedi Master and Council member Jaric Kaedan."}, {"tag": "p", "text": "After the incident with Malgus, the Wrath was contacted by Darth Marr with grim news that the Empire has discovered the location of the Sith Dread Masters and even though with Styrak dead they were still a formidable force and they had taken refuge on Oricon. Lord Wrath declared that he would destroy them which pleased Marr and was then told to contact the Sith Lord Hargarev and so the Wrath left for Oricon. Once reaching the area where the Empire have occupied he immediately declared as the supreme authority of the hunt and set off to eliminate the Masters; first by freeing the imprisoned the Republic soldiers and bringing forth a temporary but uneasy alliance. Soon afterwards the entrance to the Dread Fortress was opened and the Wrath went and slew Dread Master Bestia but then upon entering further he discovered an inner palace which was the inner sanctum of the Dread Masters. The Wrath defeated the Dread Masters and upon exiting the Wrath ordered Lord Hargarev to confiscate the remainder of the Dread Master technology for the Sith Empire regardless of the decisions of the Dark Council, the Wrath then departed Oricon."}, {"tag": "h4", "text": "Betraying the Emperor"}, {"tag": "p", "text": "Later on, the Wrath's travels bought the Sith Lord to Rishi, where the Wrath was reunited with Darth Vowrawn, who told the Wrath that Opticron droids were spying on the Warrior. Vowrawn provided a Gree device to reveal these spies and advised drawing them out in the jungle."}, {"tag": "p", "text": "Upon returning to Vowrawn's safehouse, the Wrath discovered that the Dark Lord had long since fled and found Servant One standing in his place. Servant One was displeased that the Wrath had destroyed the Opticrons, revealing that their purpose was to keep tabs on their Emperor's Wrath. He voices his concern that the Wrath had lost perspective on what it meant to serve the Emperor, being so preoccupied fighting Hutts and cults, threats the Hand didn't see as a threat to the Emperor himself. He then claimed that Vowrawn had betrayed the Emperor, having tried to learn the Hand's secrets, going as far as interrogating a Servant, at which the Wrath deliberated whether to aid the Hand or not. Servant One then hinted that the Emperor would return and his servants would fuel his flame. Before the conversation ended, the Wrath decided to sever ties with the Emperor and choked him before releasing him. Servant One said that the warrior had made a grievous error, though the Wrath said the error was Servant One's."}, {"tag": "p", "text": "After the defeat of Revan on Yavin 4, the conflict between the Order of Revan and the Coalition forces fueled the slumbering Vitiate, who departed Yavin 4 without taking physical form or possess a body, vowing to retake the galaxy. Additionally, he personally addressed his Wrath, stating that while the Wrath was still special to him, it was for that reason that he will kill his former enforcer last. In the aftermath, Darth Marr acknowledged that in light of the Emperor's betrayal and of the Wrath's importance to the Empire, he rechristened the Sith Warrior as the Empire's Wrath."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "From the beginning as an apprentice, the Wrath demonstrated extreme cunning including the urge to commit bloodshed, whereas others would dismiss the Sith Warrior as a simple brute. As such, the Wrath would take advantage of their underestimation. The Wrath could be a charming and even friendly individual, despite their violent nature. For example, one could claim they were a brutal, effective and just leader, while they made sure that their power and supremacy was realized and respected by all, the Wrath would show the near same attitude towards superiors. For example, the Empire's Wrath was often fond of Malavai Quinn's constant efficiency, and frankly respected anyone who was at the best of themselves."}, {"tag": "p", "text": "The Wrath always despised weakness, cowardliness and boot licking. Their natural respect for strength would affect all that they encountered, as they were a strong believer in the idea that the strong could do as they will, and the weak would always suffer what they must. In the case of the Wrath's enemies, they saw them as existing threats to their own supremacy and power, yet displayed some level of healthy respect, occasionally acknowledging their worthiness. Once the Wrath's adversaries were defeated, the Sith would punish them how they deemed necessary, occasionally showing their own brand of mercy by making the beaten foes servants of the Empire through blackmail, or killing them outright. The Wrath would encourage their foes often to embrace their power and challenge them at their best, as while killing the weak and helpless, in their eyes, was nothing in comparison to a combating an opponent worthy of their skill and capabilities."}, {"tag": "p", "text": "One example of this is that the Wrath took pleasure in the challenge of attempting to turn Jedi to the dark side, such as Nomen Karr, Zylixx, and Jaesa Willsaam. The Wrath, along with that, loved to pull at the moral strings of Jedi, such as congratulating Master Yonlach for wiping his former Padawan's mind and slaying Xerender in front of his former master. Though if it was clear this taunting wasn't working, the Wrath would sometimes simply kill them instead, as in the end, what mattered was that the Jedi would suffer greatly, through psychological torment or otherwise. A warrior lives up to the first part of their title: war."}, {"tag": "p", "text": "The Wrath often appraised situations with a pragmatic eye, such as killing several people connected to Jaesa Willsaam not out of pleasure or spite, but to render her emotions raw and prepare her for service to the dark side. Rather than simply killing some powerful opponents, the Wrath kept them alive, usually with the long-term desire to gain something from it, such as recruiting the Talz Broonmark and gaining Lord Rathari's loyalty."}, {"tag": "p", "text": "Cruel nature aside, the Wrath exhibited a sense of humor. While dry and sardonic at times, they were quick witted and sarcastic, much to the amusement of Vette. While not necessarily their first choice at solving problems, the Wrath was not incapable of showing mercy or compassion, but when they did they did not do it out of sheer altruism, but instead because they believed that the victim could offer something, or possibly be manipulated and used as a tool in the future. Despite their cruel and aggressive nature, the Wrath was capable of exhibiting kindness and compassion as they could choose to help or spare someone rather than hurt or kill them."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Wrath is a master of the lightsaber, whose skills outclass even the oldest of Jedi Masters and senior Dark Council members. The young Sith was a proficient lightsaber duelist, utilizing either a standard lightsaber or twin lightsabers in combat. Lightsaber forms vary between Shii-Cho, Soresu, Ataru, Shien and Juyo."}, {"tag": "p", "text": "The Wrath also specializes in telekinesis, utilizing the Force choke frequently when the Wrath could also guide a thrown lightsaber."}, {"tag": "p", "text": "It's noticeable that the Wrath has a certain mastery of Force sense, which allows the Sith to sense the thoughts of individuals such as Malavai Quinn and Jaesa Willsaam. This sense might be responsible for their bonds and The Wrath's triumphs over several assassination attempts."}, {"tag": "p", "text": "The Wrath has displayed great willpower, strong enough to resist the fear-based powers of the Dread Masters as well as the powers of the Sith Emperor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This article represents the character story of the Sith Warrior player class in Star Wars: The Old Republic, a video game from LucasArts and BioWare. The Sith Warrior's story was penned by Neil Pollner. As a result of being player determined, no canonical description of this individual is currently available; therefore, the article presents the subject's gender as neutral and alignment being dark-sided."}, {"tag": "p", "text": "At the end of Onslaught, a Sith Warrior player who stayed loyal to the Empire is offered the chance of rejoining. The warrior is also offered to become the Emperor's Wrath of either Empress Acina or Emperor Vowrawn, depending on the outcome of the War on Iokath."}, {"tag": "p", "text": "The male Sith Warrior is voiced by Mark Bazeley and the female Sith Warrior is voiced by Natasha Little."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}