{"url": "Empire_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Empire"], "nodes": [{"tag": "h1", "text": "Empire 1"}, {"tag": "p", "text": "Empire 1: Betrayal, Part 1 is the first issue in the Star Wars: Empire series of comics. It was published on September 4, 2002 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Beginning a new ongoing series set during the era when Emperor Palpatine held the galaxy in his iron grip! Even as Rebel forces make their first tentative attacks against the Empire, a plot is brewing within the ranks of those the Emperor and Darth Vader count as loyal to their cause. A small cabal of disaffected Imperial officers have targeted their masters for death, with the goal of taking over the Empire themselves. But in the midst of a conspiracy that includes hired assassins and a private army, there are those who have no intention of sharing power with their co-conspirators…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On Coruscant, Darth Vader, Grand Moff Trachta and Moff Kadir test the blaster accuracy of a battalion of a newly trained stormtroopers. Vader is so impressed by their skill that he orders them sent to escort Governor Wilhuff Tarkin to the Death Star. Kadir objects, as the men were assigned to his Coruscant City Guard. Vader threatens him that the previous commander of Coruscant Security also made demands for more soldiers, and that Kadir should be silent if he doesn't wish to share his predecessor's fate. As Vader leaves, Kadir and Trachta express their annoyance with the Sith. Trachta hints that there might be a solution to the Sith problem, and tells Kadir that he'll be sent for."}, {"tag": "p", "text": "Emperor Palpatine and Trachta meet. Palpatine asks Trachta to provide a skilled detachment of stormtroopers for his escort to the Death Star. He then says that he would have assigned Trachta to oversee the construction of the Death Star instead of Tarkin, if only Trachta wasn't necessary for the Emperor's operations on Coruscant."}, {"tag": "p", "text": "Meanwhile, Darth Vader thinks back to a conversation he had with Qui-Gon Jinn before he was introduced to the Jedi Council. He then meets with Palpatine, who gives him a mission to hunt down a lightsaber-wielding criminal on the planet Dargulli. They both suspect it could be one of Vader's children."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "External links"}]}