{"url": "Empire-in-exile", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Fel Empire", "Category:Governments in exile", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Empire-in-exile"}, {"tag": "p", "text": "The Empire-in-exile, also known as the \"true\" Empire, the Imperial Remnant, the Fel Imperium, or the Bastion resistance by Darth Krayt's Galactic Empire, was the faction of the former Fel Empire that remained loyal to Emperor Roan Fel following the One Sith coup in 130 ABY."}, {"tag": "p", "text": "During the Second Imperial Civil War, the Empire-in-exile fought to overthrow Galactic Emperor Darth Krayt, eventually allying with the Galactic Alliance Remnant and the New Jedi Order. With the downfall of the One Sith on Coruscant, the Empire and its allies formed the Galactic Federation Triumvirate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As the Sith–Imperial War came to an end, Roan Fel was poised to establish his government on Coruscant. After a few days, the leader of the One Sith, Darth Krayt, arrived with Lords Nihl, Wyyrlok and Maladi and revealed their deception to Emperor Fel, killing his double, and seizing the throne for himself."}, {"tag": "p", "text": "The real Emperor Fel escaped the assassination attempt, and after seven years as a fugitive landed on the planet Bastion and formed a government-in-exile to rule the former Imperial Space. Over the next several months of resistance, more and more Imperial military units defected to his territory, subsequently acquiring more, previously stripped, territories. His administration even attempted to form an alliance with the Galactic Alliance Remnant, though the meeting was sabotaged by Jor Torlin and Morrigan Corde, agents of the Empire. As a result, Stazi remained distrustful of Fel's Imperials, while the latter were banned from entering the Wheel."}, {"tag": "p", "text": "A short time afterward, Masters Treis Sinde and Sigel Dare of the Imperial Knights planted three sets of bombs on board the prototype Advanced Star Destroyer Imperious, which would explode the moment the weapon systems were activated. However they didn't anticipate Stazi's plan to \"liberate\" the starship. The saboteurs were dispatched to rescue Monia Gahan from imprisonment on Dac and take her back to Stazi to disarm the bombs.[source?]"}, {"tag": "p", "text": "However on Monia's demand, the pair rescued the rest of the Rogue Squadron members captured after the battle. Due to this display of good faith and the beginning of genocide against the Mon Calamarians, Admiral Gar Stazi agreed to discuss a possible alliance with Fel in order to fight their common enemy.[source?]"}, {"tag": "p", "text": "The first collaboration between the new allies took place during the Battle of Ralltiir, where the alliance nearly met its end when a Fel loyalist, Admiral Edouard Fenel, threatened with fire on defenseless lifepods in order to force the Sith-loyal Coruscant Third Fleet into surrender. Admiral Stazi did everything within its power to prevent the Fel loyalists to resort to the tactics of the enemy, coming close to open fire on them, also making it clear to Emperor Fel that the Galactic Alliance fleet were allies of the Empire-in-exile and not vassals."}, {"tag": "p", "text": "A short time afterward, the Jedi agreed to collaborate with Admiral Stazi, even preventing an assassination attempt on his person. Emperor Fel also arranged to secretly meet with representatives of the Jedi on the planet Agamar."}, {"tag": "p", "text": "At the end of the war, the Empire-in-Exile was merged with Darth Krayt's Empire. The Fel Empire became a part of the new government, the Galactic Federation Triumvirate, which consisted of K'Kruhk, Marasiah Fel and Gar Stazi."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "Following the Sith coup, the Imperial Armed Forces split among those loyal to Krayt and those loyal to Fel. By 130 ABY, the Stormtrooper Corps was merged with the Imperial Army, during the time of the previous state, the Fel Empire. Elements of the Army and Imperial Navy served Fel, however, their forces were considerably smaller and were not capable of an offensive for most of the Empire-in-exile's existence, until the Battle for Coruscant. The Navy used a variety of vessels, including Pellaeon-class Star Destroyers, Ardent-class fast frigates, and Predator-class fighters. Unlike Palpatine's original military, they accepted non-Humans into their ranks. Admiral Edouard Fenel and General Oron Jaeger were some commanders serving the Empire-in-exile, and many Sith loyalists ended up defecting to them."}, {"tag": "h2", "text": "Astrography"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}