{"url": "Empire_13", "categories": ["Category:Real-world articles", "Category:Star Wars: Empire"], "nodes": [{"tag": "h1", "text": "Empire 13"}, {"tag": "p", "text": "Star Wars: Empire 13: What Sin Loyalty? is the thirteenth issue in the Star Wars: Empire series of comics. It was published on November 26, 2003 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "This issue delivers a rare view of the days of the Rebellion from the perspective of a soldier of the Empire -- specifically that of a Stormtrooper who is transferred to the newly commissioned Death Star! Trooper TK-622 is proud to do his duty in the service of the Emperor, but he suspects that that may not be the case for every member of the battle station's crew. Strange \"accidents\" and equipment malfunctions point to the presence of a saboteur, but can the trooper prove it before the station goes into action above Yavin?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "4 days BBY, the planet Ralltiir. What was supposed to be a small Rebel cell turned out to be a planetwide rebellion. Commander Akobi led Imperial forces. In some cases, the Rebels used women and children to defend themselves. The Rebels jammed communications and disrupted sensors. During an Imperial bombing run on a Rebel supply depot, the TIE Bomber's sensors failed. Akobi ordered the pilot to go on anyways. The Bombers bombed a Med Center by accident, killing scores of civilians. The Imperials covered it up, and made Akobi into a hero. While he was trying to get power back up, the Rebels tried to bomb him. His friend and bodyguard, a Stormtrooper, TK-622 saved him. The Commander believed it to be an accident. Akobi and 622 were then assigned to the Death Star."}, {"tag": "p", "text": "During a meeting of officers, an RA-7 servant droid opened fire, killing some of the officers. 622 shot it down before it could do more harm. The remains of the droid was brought to a Technician. While he was scanning it 622 came across an explicit order to kill Commander Akobi. Just then, the droid's memory banks exploded. While TK-622 was escorting Commander Akobi to a medals ceremony for his actions on Ralltiir, an errant probe droid attacked them. It severely wounded Akobi. While medtechs were fighting to save Akobi's life, 622 tried to track any leads. He did not find anything that could help. At this time, the Millennium Falcon was brought on board, eventually escaping with Princess Leia Organa. Akobi died, but not before telling 622 about what really happened on Ralltiir. TK-622 went to the tech's station, where he was attacked by the Technician. They began to fight, as the Battle of Yavin raged. A nearby surface impact caused debris to fall on the Technician, killing him. Before his death though, the traitor confessed to the attacks on Akobi from the power generator bomb on Ralltiir, to the Probe droid's attack. The Technician was from Ralltiir, and was a Rebel agent. TK-622 watched as Luke Skywalker's X-wing starfighter fired into the thermal exhaust port. He knew the station was about to explode, and in his last seconds, he reflected on his life, and stated that you can't silence a million voices."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}]}