{"url": "Empire_35", "categories": ["Category:Real-world articles", "Category:Star Wars: Empire"], "nodes": [{"tag": "h1", "text": "Empire 35"}, {"tag": "p", "text": "Empire 35: A Model Officer is the thirty-fifth issue in the Star Wars: Empire series of comics. It was published on September 14, 2005 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Information obtained from a prisoner captured on Jabiim has set Darth Vader on the trail of the Rebel Fleet. No Alliance defense can divert Vader from his target, and if he is successful it will mean the destruction of the fleet and the end of the Rebellion."}, {"tag": "p", "text": "But there is one small hope for the Rebels, and it all comes down to one man pursuing his duties with an unshakable zeal, and remaining a \"model officer\" to the end…"}, {"tag": "p", "text": "Iron Man writer John Jackson Miller joins the Star Wars team with this one-shot story of duty, honor, and betrayal within the Empire."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "When the crew of the orbiting Reprisal destroy a Rebel scout party before they can be questioned as to the location of the Rebel Fleet, Darth Vader is angered and seeks the head of the Star Destroyer's commander: Demmings. The officer is proud of the result when questioned, however, so is warned to be sure to take the second group of Rebels known to be in the sector alive."}, {"tag": "p", "text": "Eventually the Imperials discover and give chase to a blockade runner. With the Sith Lord watching over his shoulder, Demmings orders his crew to cut them off and disable the ship with precision shots. Successful, gunner Garil Dox is then told to ready the tractor beam but the Alliance ship explodes in the process."}, {"tag": "p", "text": "Failed again, Vader chokes Demmings with the Force while in shock from the destroyed vessel. Demmings protests that he was not at fault and cites the destruction of Alderaan as an example of why he will not apologize for the Rebellion's dead. Vader suddenly releases Demmings from his grip and commends the gasping Imperial for his bloodlust before reminding him that such traits must defer to the plans of the Emperor. He then orders the commander to follow him."}, {"tag": "p", "text": "Back on the bridge and now over the Ejolus system, Demmings tells his crew that redemption of their failure will come with a third Rebel patrol on the planet below. Their final chance, the commander prepares for a surgical strike that will take the site which for all intents and purposes appears to be an agrarian settlement. Dox is told to use turbolasers targeted precisely at a power generator. The guns fire and the base is completely annihilated, so the Sith then blames the man responsible for all the failures: Garil Dox."}, {"tag": "p", "text": "Vader reveals the gunner's birth on Alderaan and underlying Rebel sympathies as well as informing the crew that when the Dark Lord boarded, Lieutenant Dox had increased firepower in an attempt to hide the location of the Alliance fleet and have loyal Demmings die in the process as scapegoat."}, {"tag": "p", "text": "Dox confesses, telling Vader that the deaths were worth the price to keep the fleet hidden and he's been ready to die since his home was destroyed. Demmings informs him that Alderaanian refugees had set up a hidden colony from the Empire and that he could have visited it, if, Vader adds, Dox hadn't just destroyed it."}, {"tag": "p", "text": "His actions allowing the Empire to remove a traitor and permanently subdue dissidents, Dox pleads for death. Vader, however, commends the actions and 'rewards' his service to the Emperor by allowing it to continue in an Imperial labor camp. Yet he also laments that for striking in vengeance and his willingness to kill his supposed allies, Dox was well on the way to becoming a model officer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}