{"url": "Empire_Day/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire holidays"], "nodes": [{"tag": "h1", "text": "Empire Day"}, {"tag": "p", "text": "Empire Day was a galactic holiday celebrated by the Galactic Empire. The observance of Empire Day began in 19 BBY, when Supreme Chancellor Palpatine proclaimed the Clone Wars to be over and reorganized the Galactic Republic into the First Galactic Empire via the Declaration of a New Order. In his declaration, Palpatine mandated that Imperial citizens would celebrate the anniversary of Empire's creation yearly, for the sake of posterity. Although the first Empire Day was marked by several attempts by Jedi to dismantle the Empire, the new government and the tradition lived on. When the rebellious Alliance to Restore the Republic formed in 2 BBY, its members protested the celebration of Empire Day. In a symbolic show of solidarity with the Old Republic, the Alliance began celebrating Remembrance Day on the same date as the Empire's galactic holiday. During the Galactic Civil War, both the Empire and the Alliance ramped up propaganda efforts to promote the observation of the respective holidays."}, {"tag": "p", "text": "Empire Day was celebrated in a number of different ways, depending on region and culture. Although the holiday fell on one specific day of the year, celebrations in some corners of the Empire continued for weeks. An example of such jubilation could be found on Naboo, where the capital city of Theed played host to Imperial Military parades and statues of Emperor Palpatine for days on end. During this time, the Empire would provide loyal citizens with goods that promoted state pride, such as food rations and artwork."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Empire Day was a galactic holiday of the Galactic Empire, celebrated from 19 BBY to at least 1.5 ABY. The anniversary of the Empire's creation was celebrated yearly, on the twenty-third day of the fifth month when using the Great ReSynchronization (GrS) dating system based on Coruscant. Despite the fact that the holiday fell on a single date of the year, celebrations of the event could last for several days or even weeks in certain regions of the Empire, depending on the local culture."}, {"tag": "p", "text": "The holiday was intended to commemorate the dissolution of the Galactic Republic and the creation of the Empire by Supreme Chancellor-turned-Galactic Emperor Palpatine. The day was also a celebration of the might and power of the Empire, as well as that of Palpatine himself. Imperial Military parades were common on Empire Day, as was as the display of statues of the Emperor in public squares. During the Galactic Civil War, Imperials used the holiday as an opportunity to step up propaganda efforts and further Palpatine's cult of personality. Government workers distributed Empire Day memorabilia to passersby, and Imperial citizens offered one another salutations of \"Happy Empire Day\". Many individuals loyal to the Empire celebrated with family or friends, while others sought to be close to their Emperor on his holiday. Because of Palpatine's reclusive habits, few saw this wish realized."}, {"tag": "p", "text": "It also saw the opportunity to award personnel of the Empire with various medals for significant acts of service. These included the Imperial Badge of Meritorious Service, the Imperial Engineering Volunteer, the Imperial Guest Performance, the Imperial Anti-Propaganda Enforcer and the Champion of Empire Day awards, the latter of which was awarded by Darth Vader personally."}, {"tag": "p", "text": "Although practiced by various parts of the Galaxy by the time of the Galactic Civil War, it was most celebrated on Naboo's capital city, Theed, due to the planet being Palpatine's homeworld. Festivities on Theed during this time included awarded medals, erecting statues of the Emperor, and military parades that included Stormtroopers, at least two AT-STs, and Imperial Marines."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The first Empire Day"}, {"tag": "p", "text": "After three years of fighting between the Galactic Republic and the breakaway Confederacy of Independent Systems, the Clone Wars came to a close in 19 BBY, when the Dark Lord of the Sith Darth Sidious decided that the pieces were in place to allow him to seize control of the galaxy. In his alter ego of Supreme Chancellor Palpatine, Sidious enticed the High Council of the Jedi Order to attack him—an attempt that ultimately failed, and provided the Chancellor with a pretense for issuing Contingency Order 66 to the Grand Army of the Republic. While clone troopers across the galaxy killed their Jedi commanders pursuant to the Order, Sidious dispatched his new apprentice Darth Vader to assassinate the leaders of the Confederacy on Mustafar. Vader continued on to deactivate the battle droid armies of the Confederacy, bringing the carnage of the Clone Wars to a close."}, {"tag": "p", "text": "With the Confederate rebellion defeated and his Jedi enemies crushed, Palpatine called an Extraordinary Session of the Galactic Senate on the twenty-third day of the fifth month of 16 GrS. That afternoon, he presented to the Senate evidence of an anti-government Jedi conspiracy before issuing his historic Declaration of a New Order. In the Declaration, Palpatine proclaimed the Clone Wars to be over, transformed the Republic into the First Galactic Empire, and mandated that the anniversary of the Empire's creation be celebrated by Imperial citizens for the sake of their children and future generations. The newly-proclaimed Emperor predicted that Empire Day would be celebrated for ten thousand years before concluding his speech. That inaugural Empire Day was marked by two separate attempts by surviving Jedi to destroy the new regime."}, {"tag": "p", "text": "The first attempt was made by Yoda, the Grand Master of the now-defunct Jedi order and one of the last surviving Jedi. He traveled to the Senate Building immediately following Palpatine's Declaration and confronted the Emperor in his Holding Office. The two engaged in a fierce duel in the Grand Convocation Chamber of the Senate itself. The second attempt was made by surviving Jedi Council member Obi-Wan Kenobi, who sought to kill Darth Vader on Mustafar. Both attempts ended in failure, as Yoda was forced to retreat from his duel and Kenobi found himself unable to execute Vader after maiming him. As such, both the Empire and the tradition of Empire Day lived on."}, {"tag": "h3", "text": "An enduring tradition"}, {"tag": "p", "text": "After that first celebration, Empire Day became an annual celebration across the Empire, which was celebrated between beings by saying \"Happy Empire Day.\""}, {"tag": "p", "text": "After the destruction of the first Death Star, Empire Day was emphasized more vehemently, by both the Empire and the Rebellion. The Rebellion adopted the term Remembrance Day in place of Empire Day, and used Empire Day as a way to remind citizens of the destruction of Alderaan. During one such Empire Day in 1 ABY, Lord Vader landed in front of the Theed Royal Palace to deliver a speech to a crowd of loyal Imperial citizens."}, {"tag": "p", "text": "Guarded by a group of Triumphant-class dark troopers, Darth Vader used the holiday to honor those who served the Empire graciously. As Vader stood in front of a statue of the Emperor, he called out several soldiers present by name, giving them a badge for their service. After his short visit, he boarded his shuttle to leave the planet. As he departed, Imperial TIE Fighters flew by as fireworks exploded overhead."}, {"tag": "p", "text": "During the Empire Day festivities, Brenn Tantor tasked loyal Imperials to tear down Rebel propaganda posters around the city, and put up posters which proclaimed, \"Join Us.\" Kaythree tasked Imperial traders to gather supplies from crashed shuttles, and gave entertainers the option to entertain Imperial soldiers in the Theed cantina. Dac Madine stood by to receive any incoming shipments. Mara Jade also participated in the Empire Day festivities, tasking an Imperial operative with rescuing six Imperial officers from a prison facility in a hidden Rebel base."}, {"tag": "p", "text": "Due to the heavy Imperial patrols in Theed, the Rebellion did little to stop the Empire Day festivities from taking place. However, there were reports of Rebel agents gunning down those who put up Imperial posters. In addition, at least a few of the Imperial recruitment posters ended up defaced by Rebel sympathizers, some of which were sold by Rebel Celebration Organizers and even Imperial Celebration Organizers."}, {"tag": "p", "text": "During festivities, various souvenirs were also sold and handed out, including paintings and posters (Darth Vader, Princess Leia, etc.); models (decoration devices and space station models), decorative sashes; an automated target dummy (based on either the Rebels or the Empire) and tools (Novaless Soni-Optics Goggles Mark V). Although some were exclusive to either Empire Day or Remembrance Day, most of them were available on both holidays. In addition, a celebration organizer often stood near the statue of Emperor Palpatine at the stairs to Theed Palace, where he sold various pro-Imperial rations such as Gracious Government Mix and Order 66 Cookies to those loyal to the Empire. However, due to his being trained to detect any Rebel infiltrators, he will specifically turn away any Rebel-aligned soldiers who try to receive any of the rations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Empire Day was a recurring event in the MMORPG Star Wars Galaxies. The celebrations took part on the anniversary of the games' launch, every year since 2005. In 2008, once every hour, an Imperial shuttle landed and Darth Vader called out one of the Imperial-aligned player characters present at the celebration. This player received a special badge and the title \"Hero of Empire Day.\" All players that visited the celebrations received a special The Empire Strikes Back movie poster and could buy Order 66 Cookies and a Gracious Government Mix, food that temporarily enhanced the players' stats."}, {"tag": "p", "text": "This changed slightly in the 2009 celebration. Vader would land every 15 minutes and call out three players, this time receiving the title \"Champion of Empire Day.\" Players would also receive a Return of the Jedi movie poster to commemorate the six year anniversary of Star Wars Galaxies. In addition, the 2009 celebration included additional quests for players. The 2010 representation of Empire Day remained widely unchanged, except it offered players new badges, a few extra rewards, and a new title, \"Chosen of Empire Day.\" The 2011 celebration saw little change with only new badges being added for completing the same tasks as previous years."}, {"tag": "p", "text": "The term Empire Day was derived from a holiday within the United Kingdom celebrating the anniversary of the British Empire's formation between 1902 and 1958. Coincidentally, the holiday fell on May 20, which was also the day of the UK's premiere of The Empire Strikes Back, resulting in a \"revival\" of sorts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}