{"url": "Empire_Youth", "categories": ["Category:Legends articles", "Category:Dark side organizations", "Category:Empire Reborn members"], "nodes": [{"tag": "h1", "text": "Empire Youth"}, {"tag": "p", "text": "The Empire Youth were Force-sensitive members and minions of Lord Hethrir's Empire Reborn faction. Members of the organization were recruited from the top Proctors and were distinguished by their knee-length pale blue coats. Once Desann became the second in command of the Imperial Empire Reborn faction, he was tasked with their training. He took one of them, Tavion Axmis, to be his apprentice. The Helpers were the lowest members of the Youth."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Eventually Desann led the Empire Youths to the Valley of the Jedi, where he infused them and himself with its energies turning them into skilled individuals, leaving him with a Dark Jedi army he called the Reborn.\nWith his newly acquired Reborn, Desann and Admiral Galak Fyyar, weapon scientist and military leader of the Empire Reborn, attacked Yavin to destroy the Jedi once and for all."}, {"tag": "p", "text": "Though Rogue Squadron showed up, the ship of Desann, the Doomgiver, would not give in and troops began to be deployed.\nUnfortunately for the Empire Reborn's evil schemes, Kyle Katarn was present on the ship and he heavily sabotaged it, and was the one who brought in Rogue Squadron as well. After battling Galak Fyyar himself, who was fighting with his special battle suit, Kyle proceeded to escape the Doomgiver as he had also destroyed the shield generator."}, {"tag": "p", "text": "Rogue Squadron destroyed the Doomgiver, and the bulk of the Reborn were destroyed aboard the ship. Thus ended most of the former Empire Youths, but some escaped even though Desann was slain on Yavin. Those that escaped rallied under Desann's apprentice, Tavion, and with new Cultist followers infused with the Force by the Scepter of Ragnos, formed the Disciples of Ragnos cult. On Korriban the Disciples of Ragnos sought to resurrect Marka Ragnos, but in an epic battle the Jedi intervened - having Jedi Knight Jaden Korr to defeat Tavion and Marka Ragnos - and once and for all ended those that were once known as Empire Youths, Tavion with them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}