{"url": "Empress_Teta/Legends", "categories": ["Category:Legends articles", "Category:Ecumenopolises", "Category:Empress Teta locations", "Category:Empress Teta system", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Koros sector planets", "Category:Mining planets", "Category:New Republic planets", "Category:Sith planets", "Category:Spice producing worlds", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Empress Teta"}, {"tag": "p", "text": "Empress Teta was a ecumenopolis world located in the Empress Teta system, a star system in the Koros sector of the galaxy's Deep Core. Initially known as Koros or Koros Major, the planet's name was changed following Empress Teta's unification of the system in 5000 BBY. The extent to which the capital Cinnagar covered the world also caused many to refer to the world itself as Cinnagar, even in official documentation—a source of confusion at times. A major supplier of refined carbonite, the planet was a major hub of operations for the Mining Guild. It was located on both the Koros Trunk Line and the Carbonite Run, and for a short time on the Daragon Trail. Empress Teta was the main hub of galactic civilization in the Deep Core and was also one of the few highly urbanized planets in the region to rival Coruscant itself in fashion and amenities."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Empress Teta was a city-planet located in the outer shell of the galaxy's Deep Core, at the terminus of the Koros Trunk Line directly galactic south of Coruscant. With over half its landmass covered by its capital Cinnagar, and vast reserves of carbonite that made the backbone of Empress Teta's economy, the planet was the center of galactic civilization in the Deep Core. While officially a monarchy, the Mining Guild held the true power on the planet in the post-Unification era as the stores of carbonite on the planet gave them the advantage of setting galactic prices on the valuable commodity. Due to the reliance on carbonite economically, mines dotted the surface of the planet and the cityscape, and had at one point threatened to completely shatter the environment of the world. The discovery of the valuable substance on the other six worlds of the Empress Teta system enabled the Mining Guild to do much of its business offworld, allowing the nonurbanized areas of Empress Teta to avoid the environmental damage that befell the other worlds of the system. Where the city had not grown, some areas of wildlife remained, including forests and plains."}, {"tag": "p", "text": "In addition to the carbonite stores, Empress Teta was a major source of andris spice within the Core. An authorized supplier of the spice, andris' primary function was as a cure for hibernation sickness, a side effect that befell ancient colonists that had been frozen in carbonite on sleeper ships once they were woke from their slumber. Like most controlled substances, the criminal element on the planet had discovered a way to make andris spice a powerful stimulant and sought ways to sell it on the black market. This criminal problem was an issue until the rise of the Galactic Empire, which stamped out much of the black market dealers. Traffic in the planet's skylanes and orbit was controlled centrally from the Cinnagar Space Traffic Control tower. Cinnagar Control directed ships leaving orbit, arranged for repairs to returning vessels, and kept wanted vessels and those taking unauthorized action in line with its own defense force of Koros Spaceworks interceptors."}, {"tag": "p", "text": "Empress Teta was a wealthy and fashionable world, typical of the many affluent planets in the galactic core, only slightly behind Coruscant itself in the amenities it offered. The ornate artistry of the world's architecture was admired, much of it having arisen in the reconstruction that followed the Great Hyperspace War. Galactic-class museums, fine restaurants, and boutiques attracted tourists and local aristocrats; all of whom flocked to Empress Teta's gems of history and luxury. While most Tetans who lived in the Core District of Cinnagar were accustomed to living in luxury, those who lived outside of the Core District of Cinnagar lived a working-class lifestyle. Nobles on the planet traced their ancestry back to the legendary Empress Teta herself; though some historians questioned her actual existence by the rise of the Galactic Empire. Lesser nobles possessed a share of the Mining Guild's activity in the system, allowing them to amass great fortunes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Settlement and unification"}, {"tag": "p", "text": "The worlds of the Koros system were first colonized before 27,000 BBY by explorers out of Coruscant and Tython, traveling in the first generation ships. These first settlers discovered massive deposits of carbonite ore on all seven inhabitable planets of the system, and the Korosians made a further discovery that space travelers could be frozen in carbonite in a state of suspended animation, allowing them to survive the long trips between stars. The invention of this process saw the end of the generation ship as a means of travel and the development of sleeper ships, which enabled Coruscant to settle worlds across the galaxy. As a means of combating hibernation sickness, the Korosians also first discovered the use of spice as a therapeutic agent, allowing travelers in sleeper ships to make the journey in a greater degree of safety. The Koros system's deposits of andris spice, combined with the carbonite resources, made it a dominant power in the pre-hyperdrive years. The planet of Koros Major became a boomworld, and the new Mining Guild made it one of their strongholds. With the invention of the hyperdrive, hyperspace scouts carved out the hyperspace route known as the Koros Trunk Line or \"Carbonite Pipeline\", running from Koros to Coruscant, shortly before the foundation of the Galactic Republic in 25,053 BBY. With the foundation of the Republic and its subsequent growth, the route saw trillions of tons of carbonite move out to Coruscant while explorers moved in to Koros to take advantage of the unexplored Deep Core. As the outpost on the only major route into the Deep Core, Koros became the primary stop in the region and the largest settlement on the new Deep Core frontier, and almost overnight turned into a booming city-planet. The Hyperspace Navigator's Guild established their headquarters on Koros, launching explorations to find new ways through the densely packed stars of the Deep Core. The rising star of Koros proved to be a major rival to the Core world of Kaikielius."}, {"tag": "p", "text": "While the carbonite mines of Koros were nominally under the control of Coruscant, illegal claimants attempted to take advantage of the world's resources. Supreme Chancellor Fattum of the Republic granted ownership of the system to the Teta aristocrats in a scandal that ultimately ended his administration, but the system's new nobility ignored the smuggling of carbonite. In 5010 BBY, however, Empress Teta took the throne and launched the Unification Wars, an effort to eliminate all non-government mining settlements and unite the seven worlds of the Koros system under a mutual defense and trade alliance. Teta's wars, backed by Coruscant as a triumph of law and order, were one-sided, brutal, and ultimately successful, bringing all the worlds of the system but Kirrek under her control. In 5000 BBY, the Jedi Odan-Urr was dispatched to Koros to aid Teta and her Jedi advisor Memit Nadill in ending the war, and his knowledge and application of battle meditation enabled Teta to take Kirrek with minimal casualties and seize victory in the war. Odan-Urr was assigned on a long-term basis to the Koros system to ensure the security of Teta's realm in the Republic's interest. For this Empress Teta began to rival Coruscant in the Deep Core. The detention facilities of Koros, meanwhile, were used to hold accused war criminals awaiting trial."}, {"tag": "h3", "text": "Wars with the Sith"}, {"tag": "p", "text": "Shortly after Teta's victory, two hyperspace scouts of Koros, Gav and Jori Daragon, incurred the wrath of the local merchant lord Ssk Kahorr when one of their routes, the Goluud Corridor, proved to be unstable and cost Kahorr valuable merchandise. When Kahorr sent assassins after them, the Daragons stole their own ship, Starbreaker 12, out of hock and, fighting their way past the planet's defense forces, set off to find one big route to settle all their debts. They were declared criminals by Empress Teta, who vowed to administer the appropriate justice to them when they were found. Shortly after, Odan-Urr had a vision of danger from the Sith Lords, exiled from the Republic millennia before, which he presented to Teta. Teta brought the Jedi with her to Coruscant to present his warning before the Senate, but the Senators dismissed his claims. Upon her return, Teta put the factories of Koros into action, producing ships and materiél in preparation for coming war."}, {"tag": "p", "text": "The Daragons, meanwhile, had found a new route, and more; after a blind leap into hyperspace, they arrived at Korriban, land of the Sith Empire and the exiled Sith Lords. Naga Sadow, Dark Lord of the Sith, turned Gav to his side and allowed Jori to escape in Starbreaker 12, tracking her back into the heart of the Republic. Upon arriving at Koros, Jori sent off an emergency message warning of the Sith, but her vessel was recognized by Cinnagar Control and forced to the ground by the defense forces. She was placed under arrest, and her warnings about the Sith were dismissed. Odan-Urr, however, found that his trip to Coruscant had not been entirely fruitless; other Jedi heard his warning, and his master Ooroo came to Koros to confer with Teta and the Jedi. Jori, escaping from the prison colony on Ronika, returned to Koros and infiltrated Teta's palace to speak with the Empress. Her statements about the Sith confirmed what Teta had heard from the Jedi; the Empress summoned Koros' defenses and prepared to strengthen the system as a bastion against the coming invasion. Meanwhile, having finally mustered his forces, Naga Sadow followed the Daragons' route back to the star Primus Goluud, where his forces split to launch a series of simultaneous attacks on Republic worlds, initiating the Great Hyperspace War."}, {"tag": "p", "text": "On Koros, Teta accepted the aid of the former Kirrek rebels in exchange for amnesty. The Tetan fleet launched from Koros Major to engage the Sith forces—under the command of Gav Daragon—in orbit above. As the Sith lay siege to the city below, Gav headed to the surface in an attempt to disengage the Korosian defenses and force a near-bloodless victory. When his bodyguards killed a friend of his family's in front of Jori, Gav fled the planet in horror, taking his flagship back to Primus Goluud to kill Sadow. With the Sith offense collapsing on every front, Jori and the Tetan fleet followed, driving Sadow back to the Sith Empire, and ultimately into exile on Yavin 4. The battered Tetan fleet returned home, victorious, to begin the long process of recovery. Odan-Urr salvaged the remnants of the Sith fleet in orbit of Koros for artifacts, taking them with him to build a library on Ossus."}, {"tag": "p", "text": "In the wake of the wars, Koros Major underwent a period of reconstruction. The name of the system and planet were officially changed to \"Empress Teta\", though the planet continued to be known as Koros Major for centuries to come. Koros became the capital of a small empire in the Deep Core, and the carbonite mines brought wealth to all of the world's inhabitants and turned the planet into a prosperous and peaceful model world that much of the Deep Core attempted to emulate. Koros finally eclipsed its rival Kaikielius, driving the latter planet into ruin in an attempt to compete. Teta's descendants continued to rule the system, but over the next millennium they were increasingly forced to share power with the commercial interests that controlled the carbonite mines."}, {"tag": "p", "text": "In 3997 BBY, two descendants of Teta, Satal and Aleema Keto, fell to the dark side of the Force and formed a cult they named the Krath. After getting the Tetan military into their pocket, the Ketos staged a coup against Satal's parents, the rulers of the system. On a carbonite smelter above Empress Teta, the Ketos and their Krath allies arranged a demonstration of their Force powers to their parents and guards, torturing their tutor Korus and, eventually, lowering the Lord Keto to his death in molten carbonite. The Krath response to resistance was quick; Aleema suffocated a group of insurrectionists on Empress Teta who planned to attack the palace. However, the planet still resisted the new rule, the last in the system to hold out against the Krath. Despite heavy resistance, Teta fell to the Krath, after the installation of a military satellite over the planet. Despite a joint task force of Republic soldiers and Jedi assault the Krath warship, Aleema Keto's powerful sorcery was able to destroy moral within the opposition forces. The Republic, led by Captain Orley Vanicus and Jedi Ulic Qel-Droma aboard the Reliance I, was too late to prevent the planet's fall and were forced to retreat."}, {"tag": "p", "text": "While the Jedi Order gathered on Deneba to discuss the Krath reign on Empress Teta, the Krath tightened their grip on the planet. Holed up in the Iron Citadel, Satal and Aleema Keto held mass execution in public squares to inspire loyalty through fear. During one such execution, the Jedi Knight Ulic-Qel Droma cut down a would-be assassin before he could kill Aleema Keto in a bid to gain her trust and infiltrate the Krath. Little did Qel-Droma know, the Ketos had devised this ruse to gain the power of a Jedi within the Krath, and slowly began twisting him to the dark side. Believing he was working in the best interest of his undercover mission, Qel-Droma was seduced to the dark side and became an enforcer of the Krath on Empress Teta. despite the best efforts of several Jedi task forces to rescue Qel-Droma, the fallen Jedi believed that he had dedicated to much time to the undercover assignment to turn his back on it. Shortly thereafter, the planet was visited by fallen Jedi Exar Kun, who desired to destroy those who could potentially impede his own Empire. To this end, he attacked Keto and Qel-Droma, but was interrupted by the spirit of the millennia-old Dark Lord Marka Ragnos, who advised them to ally instead of competing. Thus was formed the new Brotherhood of the Sith, with Exar Kun as Dark Lord of the Sith. The Krath—under the rule of newly-christened Sith Lord Qel-Droma—became an integral part. This signaled the beginning of the true greatness of the Krath. Within six months, the Tetans had conquered large territories and imposed several defeats on the now-strained Republic military. Qel-Droma's alliance with the Mandalorians led by Mandalore the Indomitable further strengthened the cult's influence and strengthened the Empire on Empress Teta. With the Great Sith War and the Krath Holy Crusade in full swing, Empress Teta became the heart of all military operations for the Krath and Sith Brotherhood."}, {"tag": "p", "text": "However, as its military campaign met increasing and determined Republic and Jedi resistance, the Krath/Sith alliance began to fall apart due to internal tensions; Keto began a campaign of more or less open infighting, causing Qel-Droma's capture by the Jedi and murdering his Tetan supporters. Once freed by Kun, the rogue Jedi retaliated by sending Keto on the mission that would prove her doom. When Qel-Droma was eliminated by the Jedi Nomi Sunrider and Kun was defeated by a combined Jedi armada and presumed dead, there was no one left to lead the Krath, and the cult quickly fell apart from internal strife. Leaving behind their stronghold on Teta, the planet was littered with ancient relics from the era. As the city-planet cast off the Krath, new construction quickly consumed the detritus of the past."}, {"tag": "h3", "text": "The rise of the Empire"}, {"tag": "p", "text": "Empress Teta was one of the few Galactic Republic member worlds in the Deep Core by the start of the Clone Wars, and despite the lasting reign of the Keto family, the world was completely under the pall of the Mining Guild. When war was declared by the Confederacy of Independent Systems, Empress Teta was forced to support the Separatists against the Republic. Those nobles who remained loyal to the Galactic Senate expatriated to Coruscant to avoid the conflict in their home system. When the war came to a sudden conclusion and the Mining Guild labeled many of its leaders as traitors, and turned them over to the Empire, naming the expats on Coruscant to positions of power to gain favor with the Emperor. Turning the carbonite over to the Empire at a discounted price, Empress Teta curried favor with Imperial Coruscant, becoming a major Imperial Hyperspace Security Net checkpoint on the perimeter of the Deep Core Security Zone. Astrogation to the planet became especially difficult under the Imperial rule, as it began appearing as Koros, Cinnagar, or Koros Major as a plot by Imperial Intelligence to subtly reroute non-essential traffic. The ancient history of the planet also became muddled with the rise of the Imperials. Known as the Qel-Droma Epics, this series of poems recounting the involvement of the Jedi on the planet around the time of the historical Empress Teta's reign was said to be Jedi propaganda rather than an accurate historical account."}, {"tag": "p", "text": "The planet's location in the hard-to-navigate Deep Core made it easy to defend, and the New Republic planned to evacuate their government to the planet in the eventuality Coruscant fell to the Yuuzhan Vong. However, Senatorial opposition to the plan caused it to be shelved, and when Coruscant actually fell, the government fled to Mon Calamari. It can be assumed that even after the Yuuzhan Vong War had ended Empress Teta continued to rival Coruscant in the Deep Core, continuing with the Galactic Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}