{"url": "Enanan_Supa", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:Resistance Starfighter Corps personnel"], "nodes": [{"tag": "h1", "text": "Enanan Supa"}, {"tag": "p", "text": "Enanan Supa was a human female pilot for the Resistance. A friend of the fallen pilot Nix Jerd, she swapped from piloting MG-100 StarFortress SF-17s to a B-Wing Fighter. She specialized in making ungainly craft seem graceful, and had superb Supa's situation awareness. In 35 ABY, she attended a meeting at the Resistance base on the moon Ajan Kloss where pilot Poe Dameron revealed the Sith Lord Darth Sidious had returned, and later raced through the base during preparations for an attack on the planet Exegol."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Enanan Supa was a human female who flew as a pilot for the Resistance during its war against the First Order. She at one point flew MG-100 StarFortress SF-17s for the Resistance and was a friend of Nix Jerd, a bombardier serving in Cobalt Squadron who perished during the evacuation of the Resistance base on the planet D'Qar in 34 ABY. By 35 ABY, Supa had changed to flying a B-Wing Fighter and begun using a flight helmet that had belonged to Jerd."}, {"tag": "p", "text": "Stationed at the Resistance base on the jungle moon of Ajan Kloss, she was amongst those who attended a meeting in which fellow pilot Poe Dameron revealed that the Sith Lord Darth Sidious had returned and created a fleet on the planet Exegol that the First Order could use to take over the galaxy. After a later meeting to plan an attack on Exegol, she ran through the base past controller Vober Dand as pilots boarded their craft and launched for the assault, where they ultimately defeated the First Order and the Sith."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Enanan Supa specialized in making ungainly craft appear graceful, possessing exceptional situational awareness that allowed her to fly in crowded or confined battle conditions without crashing. She had black hair, dark skin and brown eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Supa wore a yellow flight suit with a white flight harness. Her helmet bore red, yellow and gray markings with a white Rebel Alliance starbird, as it had when its previous owner Nix Jerd had worn it as part of Cobalt Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Enanan Supa first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}