{"url": "Enaleh", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Colonies planets", "Category:Galactic Republic planets", "Category:Ordnance/Regional Depots", "Category:Southern Core planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Enaleh"}, {"tag": "p", "text": "Enaleh was a planet located in the Colonies. At some point between 12,000 BBY and 11,000 BBY, Enaleh became a Galactic Republic Ordnance/Regional Depot outpost and was known by then as Ord Enaleh. The planet had a moist atmosphere, and its surface features included grasslands, freshwater seas, and lakes."}, {"tag": "p", "text": "Two species of creatures native to Enaleh were the slards, feline predators that leaped high into the air while hunting; and the helas, serpentine amphibians that exhibited schooling behavior and floated through Enaleh's atmosphere. Helas could also sense mechanically generated repulsorlift fields and were drawn to their sources."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Enaleh was a planet located in the Enaleh system, a part of the Southern Core portion of the Colonies. The planet had a moist atmosphere, and among its surface features were grasslands occasionally interrupted by groups of trees. Enaleh's hydrosphere included freshwater seas and lakes. The bottom of the those water reservoirs had deposits of silt rich with carbonic compounds."}, {"tag": "p", "text": "Enaleh's fauna included the slards, the helas, and tiny flying insects. The slards were large, feline predators that lived in the planet's grasslands. A slard hunted by hiding in the grasses, then leaping up high in the air and capturing a hela as it was flying above it."}, {"tag": "h3", "text": "Helas"}, {"tag": "p", "text": "Helas were a species of two-meter-long serpentine amphibians that used a biologically generated repulsorlift field to float through Enaleh's atmosphere. The creatures always organized themselves in schools of approximately one hundred individuals and spent their entire lives flying over Enaleh's grasslands. Being filter feeders, helas captured the planet's flying insects in their open mouths."}, {"tag": "p", "text": "During the helas' yearly breeding period, the amphibians gathered above Enaleh's seas and lakes. At first, the female helas deposited large numbers of eggs on the surface of a lake. Subsequently, the males dove repeatedly into the water, releasing gametes that interacted with the carbon compounds in the lake's silt. That reaction caused the release of large amounts of carbon dioxide into the water, facilitating the fertilization of the eggs and promoting the growth of plants in the lake, which served as food for embryonic helas."}, {"tag": "p", "text": "Helas were notable for their unusual behavior in the presence of mechanical repulsorlift generators. The creatures were able to perceive artificial repulsorlift fields over long distances and were drawn to their sources. Upon encountering the source generating the field, helas either attacked the device or adopted it as a member of their school, floating through the air alongside it and matching its movements."}, {"tag": "p", "text": "Occasionally, helas were exported offworld and kept in aeroquaria; however, those specimens had a short lifespan and rarely bred. Overall, the creatures were a rare sight on other planets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Enaleh served as an Ordnance/Regional Depot outpost for the Galactic Republic during the Pius Dea Era, a period of time that lasted between 12,000 BBY and 11,000 BBY. During that era, the planet was known as Ord Enaleh. Enaleh was mentioned during the reign of the Galactic Empire in an entry of a holobrochure for the Tagge Holographic Museum of Chandrila dedicated to the hela."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Several smugglers captured and brought helas to a number of research institutions in return for payment. Many scientists were interested in locating and examining the creatures' organ responsible for the generation of the repulsorlift field."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Enaleh was first mentioned in the 1994 sourcebook Creatures of the Galaxy, published by West End Games for Star Wars: The Roleplaying Game. The section of the book mentioning the planet was authored by Chuck Truett and illustrated by David Plunkett."}, {"tag": "p", "text": "The 2009 reference book The Essential Atlas placed the Enaleh system, and therefore the planet Enaleh, in grid square L-13, while the 2012 book The Essential Guide to Warfare provided the alternate designation of \"Ord Enaleh\" for the planet."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}