{"url": "End_Game", "categories": ["Category:Real-world articles", "Category:Articles to be expanded", "Category:Legends novellas", "Category:Legends short stories", "Category:Short stories published with novels"], "nodes": [{"tag": "h1", "text": "End Game"}, {"tag": "p", "text": "\"End Game\" is a short story written by James Luceno. It was published in the new edition of Star Wars Episode I: The Phantom Menace from Del Rey on January 31, 2012."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Taking place after Darth Maul's first lightsaber duel with Qui-Gon Jinn on Tatooine, the story begins as Maul contemplates the mistakes he made because of the actions he took on the planet, since he failed his mission to kill Jinn and his Padawan Obi-Wan Kenobi and he failed to capture Queen Padmé Amidala as a result. But in spite of his failure, Maul's Sith Master, Darth Sidious, assigns him to overlook the rest of the Trade Federation's occupation of Naboo."}, {"tag": "p", "text": "On Naboo, Maul takes the position as chief commander over the Trade Federation's occupying droid army, and he is disgusted over the idiocy and incompetence from the likes of the Federation's leaders in Viceroy Nute Gunray and Rune Haako. Nevertheless, Maul carries on with the mission assigned to him by Sidious as he commands the droid army to begin looking for the Gungans and eliminate them as a threat. During his venture, though, Maul learns that Naboo's previous monarch, King Ars Veruna, had been killed by a Muun named Hego Damask prior to the Federation's occupation of Naboo. The significance of this to Maul strikes him when he learns that Damask is actually working with Naboo's representative Senator to the Galactic Republic, Palpatine, who is Darth Sidious's alter ego, in orchestrating the Trade Federation's blockade of Naboo."}, {"tag": "p", "text": "From this, Maul hypothesizes that Damask may very well be a Sith Lord controlling Palpatine, and that Palpatine himself is disobeying the Rule of Two by making Maul into a Sith Lord, even though Maul figures that he isn't really much of a Sith Lord so much as he is a weapon. However, Maul still carries on with his duties even as the Battle of Naboo commences. The story ends just as Obi-Wan Kenobi defeats Maul by bisecting him across the waist, but Maul survives this through his sheer will, power, and hatred, fueled by the dark side of the Force, against the Jedi, especially Kenobi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}]}