{"url": "End_of_Watch", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "End of Watch"}, {"tag": "p", "text": "\"End of Watch\" is a short story in the anthology From a Certain Point of View. The story was written by Adam Christopher."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "\"End of Watch\" is told from the point of view of Commander Pamel Poul, an administrative Imperial officer in charge of the Death Star's Station Control West, one of the four circular control rooms responsible for managing the Death Star. She takes pride in the fact that hundreds of thousands of station crew in her hemisphere depended on her constant vigilance. Commander Poul was on duty during the time of Luke Skywalker, Obi-Wan Kenobi, Han Solo, Chewbacca, C-3PO, and R2-D2's fateful mission to rescue Princess Leia Organa."}, {"tag": "p", "text": "Two of Poul's subordinates are Sublieutenant Slallen and Ensign Toos, who are arguing about a YT-1300 light freighter docking at Docking Bay 327, which is messing up the starship traffic on the Death Star. Poul instructs them to get the docking bay cleared by Slallen explains that they have not heard from Captain Edmos Khurgee's scanning crew aboard the freighter. Poul tells the junior officers to continue monitoring and to inform her when Captain Khurgee is finished. At that point, her shift replacement Commander Sheard arrives and Poul places him in charge. Poul then briefs Sheard about the events of the last shift including the status of the \"mystery freighter\" holding up the schedule in Docking Bay 327."}, {"tag": "p", "text": "Commander Sheard asks Toos to show him the ship, which Poul recognizes as an old YT-1300 light freighter. Poul can't believe the ageing freighter is still flying but notices anomalies including an abnormally large sensor dish and an unlicensed quad laser cannon. Poul is curious about the mysterious ship and asks Sublieutenant Slallen about his brother, who was a naval architect stationed at a classified operation on Scarif. Slallen tells Poul that he has not heard from his brother in four weeks. While aware that the Death Star had just visited Scarif three days ago, Poul was unaware of the nature of the station's second test."}, {"tag": "p", "text": "Shortly later, Poul and the others hear an alarm from Detention Block AA-23 on level 5. Poul takes charge of the Imperial response and asks Ensign Toos to put her through to the detention block, which is reserved for political prisoners. When Toos contacts the detention block over the comm channel, Han Solo pretends to be an Imperial officer and claims that there was a slight weapons malfunction but that everything is under control. Toos informs Solo they are sending a squad but Solo claims that they are trying to fix a reactor leak. When Sheard asks who is the duty officer, Poul checks on her datapad that it was Lieutenant Shann Childsen."}, {"tag": "p", "text": "Toos realizes that the impostor is not Childsen and demands his operating number. Solo then blasts the comm. After Toos is unable to reestablish contact, Slallen advises Commander Poul to send a squad. She tells them to keep them on standby due to the alleged reactor leak. Toos checks that the detention block's power systems are normal. Poul gives orders to send in a squad of stormtroopers and tells Slallen to contact Grand Moff Wilhuff Tarkin. However, Tarkin is currently in conference."}, {"tag": "p", "text": "Commander Sheard then walks to the command dais and and sends a priority red request to the Grand Moff. Poul watches as Commander Sheard reports that there is an emergency alert in Detention Block AA-23. When Tarkin remarks the Princess and gives orders to put all sections on alert, Darth Vader then replies that Obi-Wan is here and the Force is with him. Poul recognizes Vader as Tarkin's adviser and enforcer and notices that the entire control room has gone quiet. After issuing orders for a squad of stormtroopers to be dispatched to the detention block, Poul exits her shift and delegates control to Commander Shead. As she heads to the shower, Poul tries to suppress her growing sense of unease around the old freighter, detention block, and Tarkin. However, she decides that it is not her problem and decides to let Shead handle it since he is on duty for the next twelve hours."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}