{"url": "Endangered,_Part_2", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Endangered, Part 2"}, {"tag": "p", "text": "\"Endangered, Part 2\" is the second part of a story that focuses on the Spectres. It was published as the lead story of Star Wars Adventures 8 on March 28, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Creature trouble"}, {"tag": "p", "text": "The Acklay and the creatures around it looked down at Garazeb Orrelios, Kanan Jarrus, Ezra Bridger, Sabine Wren, and Hondo Ohnaka as Sabine contemplated on how to get out of situation they were in. Hondo made a run for it and Ezra chased after him. Kanan ordered the others to get to high ground but Zeb was to slow and the Mordon jumped on him. He pushed the creature off and was about to shot it until Sabine told him to stop. Unable to fight or climb away from the creatures, Kanan decided that their best chance was to run from them."}, {"tag": "p", "text": "Ezra caught up to Hondo and grabbed onto the cage holding the argora. Hondo tried to reason with Ezra but he was interrupted but the arrival of stormtroopers with Captain Zarda and Doctor Hazlekk. Captain Zarda ordered them to raise their hands and Doctor Hazlekk told them to step away from the bird."}, {"tag": "h3", "text": "Cornered"}, {"tag": "p", "text": "As Sabine, Kanan, and Zeb were running down a hallway discussing where the plan went wrong when they turned a corner and found Ezra and Hondo surrounded by the Imperials. The stormtroopers opened fire on the rebels and Hondo took this chance to escape. Ezra chased Hondo again as the others fought back the stormtroopers."}, {"tag": "p", "text": "Sabine realized that the stormtroopers looked scared of them but Zeb figured out that it was something else. Behind them the creatures that Hondo had freed from their cages were behind them. Captain Zarda ordered his stormtroopers to fire on the creatures even though they were for Emperor Palpatine. The rebels took out the stormtroopers and protected the creatures from their blaster fire. The Acklay appeared again, blocking off their exit and leaving them surrounded by the creatures. Kanan used The Force to connect with the creatures in order to get the creatures to work with them. He successfully got them under his control. Doctor Hazlekk was very surprised he got the creatures under his control. But Kanan did not have them under his control, he used the force to \"free\" them. The Imperials ran down the hallway and the rebels with the creatures chased after them. Hondo led the Imperials into a cage so they could escape. After Zardan thanked Hondo, Ezra locked the cage, leaving the Imperials in them. Hondo tried to take the argora again but Zeb stopped him. As they were arguing Ezra used the Force to free the bird from its cage. The bird then flew at Hondo and chased him back to his ship."}, {"tag": "h3", "text": "Returning the bird"}, {"tag": "p", "text": "On the planet Xendek, the Xendekians celebrated as the return of their sacred bird returned. The Xendekian leader thanked Phoenix Cell for the return of its bird. Captain Hera Syndulla warned the leader to keep the argora hidden of the Galactic Empire returns to search for it."}, {"tag": "p", "text": "On their way back to their starship Kanan asked Zeb if he thought their rescue was worth the risk. Zeb agreed although he did not believe what the bird did. When they arrived back to the ship, AP-5 came running out exclaiming that he could not work with all the creatures around. Ezra asked if they would be interested in joining the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}