{"url": "Endicott", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Endicott"}, {"tag": "p", "text": "Endicott was a human male who served as a lieutenant in the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic. In 4 ABY, Endicott was stationed on the DS-2 Death Star II Mobile Battle Station superweapon and oversaw the arrival of the Sith Lord Darth Vader's Lambda-class T-4a shuttle ST 321. As Vader landed, the lieutenant gave the order for the station's commander, Moff Tiaan Jerjerrod, to be alerted to the new arrival. He was later present in the control room for the Death Star's superlaser when it first fired upon the Alliance Fleet during the Battle of Endor and ultimately perished when the battle station was destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Vader's arrival"}, {"tag": "p", "text": "The human male Endicott served as a lieutenant in the Galactic Empire during the Galactic Civil War fought against the Alliance to Restore the Republic. In 4 ABY, Endicott was stationed on board the superweapon known as the DS-2 Death Star II Mobile Battle Station while it was under construction in orbit above the forest moon Endor. He was stationed in the station's control room when the Lambda-class T-4a shuttle ST 321, carrying the Sith Lord Darth Vader, began its approach to the Death Star."}, {"tag": "p", "text": "The lieutenant watched over the shoulder of a station monitor as he confirmed the shuttle's code clearance and then deactivated the hangar's deflector shield so that the starship could enter. Endicott then watched the shuttle land through a viewport into the hangar and gave the order for Moff Tiaan Jerjerrod, commander of the Death Star, be alerted to Lord Vader's arrival. Jerjerrod then greeted Vader personally as the Sith disembarked his shuttle."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "The Death Star was later attacked by the Alliance Fleet, who believed that the station was vulnerable as it was not yet fully operational. This was untrue however, as the rebels had been purposefully deceived as part of Galactic Emperor Palpatine's plan to lure them into a trap. During the battle, Endicott was present in the Death Star's control room when Jerjerrod gave the order for the Death Star's fully functional superlaser to fire its first shot at the rebel fleet, destroying the MC80 Star Cruiser Liberty."}, {"tag": "p", "text": "Despite being unprepared to face the superlaser, the rebels ultimately managed to turn the tide of the battle in their favor after a strike team on Endor managed to destroy the bunker generating the Death Star's shields. Endicott was killed when the superweapon was destroyed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Endicott had fair skin, brown hair and blue eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Endicott wore a black Imperial officer's uniform including a cap and a silver utility belt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Endicott was created for the 1983 film, Star Wars: Episode VI Return of the Jedi, in which he was portrayed by Glyn Baker. In the current canon, the character was first named on a card in the 2018 Topps Star Wars Galactic Files set of trading cards released by The Topps Company, Inc."}, {"tag": "p", "text": "In the Star Wars Legends continuity, Endicott first appeared prior to the films release, unnamed, in the novelization of Return of the Jedi, which was written by James Kahn. The character was then first identified as Endicott on a card in the July 2000 Death Star II Limited expansion set of the Star Wars Customizable Card Game."}, {"tag": "h3", "text": "Deleted scene"}, {"tag": "p", "text": "Endicott also appeared in a scene filmed for Return of the Jedi that was cut from the final release of the film. The scene is set in the same control room as the superlaser firing sequence, and involves Endicott informing Jerjerrod that the shield generator on Endor has been destroyed. Jerjerrod then gives orders for the Death Star to destroy Endor itself and Endicott relays these orders to those stationed in the room. This deleted scene was officially released as part of the 2011 Star Wars: The Complete Saga Blu-ray set."}, {"tag": "p", "text": "Endicott's one line of dialogue in the theatrical release of Return of the Jedi is spoken in an American accent; however, in the deleted scene, the character speaks with a British accent, suggesting Glyn Baker may have been dubbed over for the film's final release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}