{"url": "Endor", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic moons", "Category:Arboreal moons", "Category:Endor locations", "Category:First Order locations", "Category:Galactic Empire moons", "Category:Moons of Endor", "Category:Type I atmosphere moons"], "nodes": [{"tag": "h1", "text": "Endor"}, {"tag": "p", "text": "Endor, designated IX3244-A, also known as the Forest Moon of Endor or the Sanctuary Moon, was a small forested moon that was the ninth moon that orbited the Outer Rim planet of the same name. It was the homeworld of the sentient Dulok, Ewok, and Yuzzum species, as well as the Wistie and semi-sentient Gorax races."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The moon was covered in dense woodlands, tall mountains, and savannas, and home to the sentient Ewok, Dulok, and Yuzzum species. The semi-sentient Gorax also dwelled on the moon as well as the Wistie. Some of Endor's trees reached more than 1,000 meters in height. It contained a breathable atmosphere to humans and 8% surface water. It also had two suns: Endor I and Endor II."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Throughout galactic history, offworld raiders occasionally came to Endor to hunt the native Ewok population to make Ewok Jerky, which was a popular snack across the Outer Rim."}, {"tag": "p", "text": "Sometime during the reign of the Galactic Empire, the Empire established an outpost on the moon that included a shield generator complex to protect the incomplete second Death Star in orbit of the moon. In order to make way for the complex, an Ewok village was razed by Imperial troops, leading to strained Imperial—Ewok relations. As a result of the repulsorlift field emitted by the SLD-26 planetary shield generator to keep the Death Star in a stationary orbit, Endor was prone to earthquakes, tidal imbalances, and other geological disturbances."}, {"tag": "p", "text": "The moon was later the site of the monumental Battle of Endor that saw combat between the Alliance to Restore the Republic and its Ewok allies against Imperial forces who were attempting to protect the shield generator and prevent the Alliance from destroying its superweapon in orbit. After fierce combat on the forest moon, the Rebel Alliance managed not only to destroy the shield generator complex, but also the second Death Star. With the destruction of the Empire's dreaded battle station and the death of Galactic Emperor Palpatine and his enforcer, Darth Vader, the Rebels and Ewoks held a victory celebration on the moon, one of many across the galaxy."}, {"tag": "p", "text": "The Rebels set up shields and tractor beams to protect the moon from debris from the destroyed space station. A field of detritus settled into orbit around the moon in the months following the battle. Additionally, the many hyperspace anomalies present in the Moddell sector absorbed the worst of the Death Star debris fallout. Despite that, some debris still rained down on the moon for a decade after the battle, but Endor's ecosystem proved resilient."}, {"tag": "p", "text": "In 35 ABY, following the Battle of Exegol, a Resurgent-class Star Destroyer stationed above the forest moon was destroyed through use of the Holdo maneuver. The event was watched by Wicket W. Warrick and his son, Pommet Warrick."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Endor made its first appearance in the 1983 film Star Wars: Episode VI Return of the Jedi. The scenes of the forest moon were filmed in the giant redwood forests of northern California, in particular Tall Trees Redwood Grove and other forests near the remote town of Smith River."}, {"tag": "p", "text": "The speeder bike chase was filmed at the Owen R. Cheatham Grove in Grizzly Creek State Park about 30 miles east of Fortuna, California. Most of the other location scenes for Endor were filmed in Stout Grove, part of Jedidah Smith Redwods State Park, 5 miles east of Crescent City, California, near the Tolowa village Hiouchi. Scenes requiring explosions were shot on private logging company land in the vicinity because the trees were scheduled to be logged and the State Park would not allow damage to their trees."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}