{"url": "Endorian_chicken", "categories": ["Category:Legends articles", "Category:Birds", "Category:Creatures of Endor", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Endorian chicken"}, {"tag": "p", "text": "Endorian chickens, also known as tip-yip in Ewokese, were a species of birds that lived in the forests of Endor. These domesticated animals were kept by the Ewoks primarily as a source of food, and their meat was considered delicious."}, {"tag": "h2", "text": "Anatomy"}, {"tag": "p", "text": "Chickens were a species of non-sentient fowl hailing from Endor, a lush moon orbiting planet Tana. They had two thin legs with three clawed toes and an additional spur-like growth on the back of the foot. They also had puff crests of feathers, short wings and a feathered tail."}, {"tag": "h2", "text": "The chickens in culture"}, {"tag": "p", "text": "The sentient Ewoks, a race of diminutive aliens from Endor, kept these chickens for their meat, which was known offworld to be succulent—according to the Besalisk chef Dexter Jettster. During the final decade of the Galactic Republic, Jettster served the Endorian chicken pot pie and fried Endorian chicken at Dex's Diner, his restaurant located in CoCo Town, Coruscant."}, {"tag": "p", "text": "The Imperial All Terrain Scout Transport walker was nicknamed \"chicken walker\" after the creature. The Ewokese name for the species was \"tip-yip.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The real life fowls that appeared in the 1984 made-for-TV film Caravan of Courage: An Ewok Adventure resembled the breeds of Silkies and Polish chickens, which have either the characteristics of bouffant crest of feathers or feathers that resemble fur. The Endorian chicken was also mentioned in the Galactic Phrase Book & Travel Guide as a word to say to the native Ewoks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}