{"url": "Endurance_(Endurance-class)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Endurance-class fleet carriers", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Endurance (Endurance-class)"}, {"tag": "p", "text": "The Endurance was an Endurance-class fleet carrier in service to the New Republic Defense Force in 12 ABY. Commanded by Admiral Areta Bell, the Endurance was dispatched to assist General Wedge Antilles and the Executor-class Star Dreadnought Lusankya in opposing Imperial Admiral Gilad Pellaeon's capture of the planet Orinda and six other systems along the Entralla Route in the Mid Rim. The Endurance fought alongside the Lusankya at Obredaan, eventually forcing a confrontation with Pellaeon's forces—led by the Executor-class Star Dreadnought Reaper—at Orinda."}, {"tag": "p", "text": "During the battle, Bell refused to launch the Endurance's squadrons of E-wing escort starfighters until the Reaper's defenses had been sufficiently weakened to allow for a pinpoint tactical strike by her fighters. However, Pellaeon sprung a trap at Orinda using six Interdictors and the Star Dreadnought Dominion, commanded by Admiral Teren Rogriss. The Endurance was caught between the firepower of the two Imperial Star Dreadnoughts, and was swiftly destroyed with the loss of all hands."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Endurance was an Endurance-class fleet carrier manufactured by the Republic Engineering Corporation. Measuring 1,040 meters from stem to stern, the Endurance-class was a dedicated fleet carrier capable of carrying two full wings of starfighters; the Endurance's complement was comprised of squadrons of new E-wing escort starfighters. The Endurance was armed with twelve turbolaser cannons, twenty laser cannons, and eight ion cannons, with four tractor beam projectors for retrieval operations. The vessel was also equipped with shields, but they were not powerful enough to stand up to the firepower of a Star Dreadnought."}, {"tag": "p", "text": "Equipped with a Class One hyperdrive and a Class Ten back up, the Endurance was able to traverse the galaxy quickly and had a top speed of 1,000 km/h in atmosphere. Commanded by veteran New Republic naval officer Admiral Areta Bell, the Endurance could support a crew of 6,795 beings, but could be manned by a skeleton crew of only 2,265. The carrier's weapons systems required a gunnery crew of seventy-six, and the Endurance had room to carry 1,600 troops. The Endurance's cargo capacity was 15,000 metric tons, and the carrier could carry consumables to sustain the crew for five months."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 12 ABY, Admiral Gilad Pellaeon of the Galactic Empire launched a campaign against the planet Orinda, in the Irishi sector of the Mid Rim, capturing the planet and six Coreward systems along the Entralla Route as far as Lonnaw as a show of Imperial power. At the head of his force was the Executor-class Star Dreadnought Reaper. Orinda was targeted as it had previously been the capital of the Empire from the fall of Coruscant to just after Grand Admiral Thrawn's defeat at Bilbringi. Pellaeon dispatched emissaries to the New Republic at Ord Mantell with the message that the Empire had retaken a culturally significant world and had secured their borders. If the New Republic respected the Empire's claim, then further offensives would not take place. Pellaeon's entreaties were genuine, but the New Republic, fearful of a renewed Imperial offensive on the Core, dispatched a force led by the Executor-class Star Dreadnought Lusankya and including Rogue Squadron to retake the captured territory, under the command of General Wedge Antilles."}, {"tag": "p", "text": "Antilles' and Pellaeon's forces clashed throughout the Mid Rim in a series of battles as Rogue Squadron dueled with Turr Phennir's elite 181st Imperial Fighter Wing. While media reports captivated citizens across both the New Republic and Empire, the leaders of the New Republic's Defense Force made the decision to reinforce Antilles with the Endurance, commanded by Admiral Areta Bell and loaded with squadrons of E-wings. Naval Command was less than enthused that a major campaign was being fought between two Star Dreadnoughts when their own doctrine had focused on the superiority of starfighters and smaller capital ships, and Bell was under pressure to prove that starfighters—especially the new E-wings—were still the dominant force in space warfare. The Endurance was dispatched from the Drearia system on the Hydian Way, taking a route that took the vessel through Walin'or and Ord Mantell before hooking up with the Lusankya."}, {"tag": "p", "text": "Antilles and Bell forced Pellaeon to fall back, winning a battle at Obredaan before forcing a confrontation at Orinda. As the Lusankya and Reaper traded broadsides, Antilles needed Bell to launch her fighters and have them join the fray. Bell, however, refused. Her squadrons had been plagued by mechanical failure, and the E-wings were designed for precision attacks, not combat against a large capital ship. She promised that once the Reaper was vulnerable, she would launch her squadrons. Pellaeon, however, had other ideas. At his signal, six Interdictors dropped out of hyperspace, trapping the New Republic force in the system. They were followed by another Star Dreadnought, the Dominion, under the command of Admiral Teren Rogriss. The New Republic was unaware of the existence of the Dominion—Pellaeon had discovered it hidden in the Deep Core alongside the Megador and had kept both vessels hidden from the New Republic—and its arrival tipped the balance at Orinda. Caught between the firepower of the Reaper and the Dominion, the Lusankya was forced to retreat. The Endurance's shields were quickly overcome by the combined might of the two Star Dreadnoughts and the carrier was lost with all hands and all fighters still in the hangar. Rogue Squadron was able to punch a hole in the Imperial Interdictor screen which allowed the Lusankya to escape, leaving Orinda in Imperial hands."}, {"tag": "p", "text": "The destruction of the Endurance had a lasting effect on New Republic military doctrine. After Orinda, fleet carriers launched all their starfighters upon entering an engagement zone to reduce the risk of losing a full-loaded vessel."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Endurance was commanded by Admiral Areta Bell, a veteran officer of the Alliance to Restore the Republic and its successor state, the New Republic. She had commanded the GR-75 medium transport Dutyfree during the Alliance's evacuation from Hoth, and the Victory II-class Star Destroyer Swift Liberty during the New Republic's campaign against Prince-Admiral Delak Krennel's Ciutric Hegemony."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Endurance was first mentioned in Before the Storm, the first book of The Black Fleet Crisis by Michael P. Kube-McDowell published in 1996. The events surrounding the Battle of Orinda were further expanded on in 2000's The Essential Chronology and 2005's The New Essential Chronology, and the Endurance received an entry in The Complete Star Wars Encyclopedia published in 2008. In the entry, the Endurance is referenced as being assigned to the Fifth Fleet; however, since the Fifth was not inaugurated until 16 ABY, four years after the events of the Battle of Orinda, this article treats the reference as erroneous. The Endurance was later mentioned in The Essential Guide to Warfare, where the Orinda campaign was featured in detail, and Areta Bell's assignation as the ship's commanding officer was revealed. While Bell is a female, the commanding officer of the Endurance had been referred to as male in Before the Storm."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}