{"url": "Endurance/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Flagships", "Category:Ships of the Open Circle Fleet", "Category:Venator-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Endurance"}, {"tag": "p", "text": "The Endurance was a Venator-class Star Destroyer and the flagship of Republic Admiral Shoan Kilian during the Clone Wars. It later crashed on Vanqor following crippling sabotage perpetrated by the young Boba Fett."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, a young Boba Fett, posing as a cadet in the Clone Youth Brigade nicknamed \"Lucky\", sneaked aboard the Endurance with a plan to plant a bomb in Mace Windu's quarters, but due to the request of Windu's presence elsewhere on the ship, his bomb resulted only in the death of a clone trooper, not Windu. His plan scuttled, Fett then proceeded to detonate the vessel's reactor core in order to disable the ship and possibly kill Windu in the resulting crash. The explosion of the core tore the engines of the ship to fragments along with much adjoining superstructure, causing an evacuation of the doomed vessel. However, Admiral Shoan Kilian, refusing a direct order from the Jedi to evacuate, elected to stay aboard, along with many of his command staff (including Commander Ponds), and go down with his ship. Kilian, Ponds, and another clone were later captured by Fett and the bounty hunters Aurra Sing, Bossk, and Castas."}, {"tag": "p", "text": "Anakin Skywalker and Mace Windu later searched the Endurance at its final resting place for survivors. On the bridge, they found a Mandalorian helmet, which contained a bomb planted by Fett. The bomb detonated, and the remains of the Endurance began to fall apart, trapping Skywalker and Windu. Fett, Sing, and Castas made their way to the ship to recover Windu's body, or to capture him if he was still alive."}, {"tag": "p", "text": "Skywalker sent R2-D2 to call the Jedi Temple for help. However, the droid spotted the four bounty hunters approaching the bridge, and attempted to hold them back by dropping obstacles in their path. The bounty hunters eventually gave up, deciding instead to simply destroy the remainder of the ship using Slave I."}, {"tag": "p", "text": "R2-D2, unable to send a clear transmission to Coruscant, flew Windu's Jedi fighter into space for a better signal. However, his communications device was destroyed by the Slave I, which pursued R2 and the starfighter. R2, however, managed to jump into hyperspace and reach Coruscant, where he informed Plo Koon and Ahsoka Tano of Skywalker and Windu's situation. R2, Tano, and Koon returned to Vanqor with several clone troopers, and rescued Skywalker and Windu, leaving with them as the Endurance's Bridge fell apart."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Endurance first appeared in Death Trap, the twentieth episode of the second season of the Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}