{"url": "Enemy_Lines_duology", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Enemy Lines duology"], "nodes": [{"tag": "h1", "text": "Enemy Lines duology"}, {"tag": "p", "text": "The Enemy Lines duology was written by Aaron Allston and was a part of The New Jedi Order and included the novels Enemy Lines I: Rebel Dream and Enemy Lines II: Rebel Stand."}, {"tag": "p", "text": "Both novels were included in a hardcover omnibus by the Science Fiction Book Club."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Rebel Dream: Scattering after the Yuuzhan Vong's invasion of Coruscant, the panic-stricken members of the New Republic Advisory Council pause just long enough to set up a mock defense on nearby Borleias—an attempt to buy time that fools no one, least of all the Jedi."}, {"tag": "p", "text": "Leia and Han Solo travel from world to world to foment rebellion against the New Republic's disastrous appeasement policies. But Luke Skywalker has chosen the most dangerous assignment of all: to sneak into the Yuuzhan Vong's stronghold on Coruscant. His outrageous scheme to gain entry is either brilliant or suicidal, depending on the outcome. Bearing down swiftly on Borleias is a Yuuzhan Vong invasion fleet, determined to destroy the galaxy's remaining defenders…"}, {"tag": "p", "text": "Rebel Stand: Luke Skywalker's daring mission to halt the Yuuzhan Vong's nefarious plot to overthrow the New Republic is struggling on all fronts. And time is slipping away for Han and Leia Organa Solo, trapped on a small planet whose rulers are about to yield to Yuuzhan Vong pressure to give up the Jedi rebels."}, {"tag": "p", "text": "On Coruscant, Luke and Mara Jade Skywalker have made a shocking discovery that is preventing the Yuuzhan Vong from exerting complete control. But when the enemy tracks them down, Luke and Mara are thrust into a fierce battle for their lives. Suddenly, the chances of escaping appear nearly impossible. And in space, another battle rages, one that holds ominous consequences for the New Republic—and for the Jedi themselves."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}