{"url": "Ailyn_Vel", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Bounty hunters", "Category:Clan Fett", "Category:Females", "Category:Impersonators", "Category:Kiffar", "Category:Near-Human Hybrids"], "nodes": [{"tag": "h1", "text": "Ailyn Vel"}, {"tag": "p", "text": "Ailyn Vel was a near-Human bounty hunter, the daughter of Boba Fett and Sintas Vel and the granddaughter of Jango Fett. When Ailyn was just a baby, her father, Boba, was forced to leave her and her mother. By the time she was sixteen, her mother disappeared, leaving her alone."}, {"tag": "p", "text": "She became a very successful bounty hunter, like her father, and devoted many years to hunting her father down to avenge her mother's death. She eventually killed a clone of her grandfather Jango Fett, which she believed was Boba. Afterward, she assumed the role of Boba Fett himself, and kept her real identity unknown. Shortly before the Yuuzhan Vong War, Vel had a daughter, Mirta."}, {"tag": "p", "text": "By the time of the Second Galactic Civil War, Vel had become a respectable bounty hunter like her father, and took a contract from Thrackan Sal-Solo to kill his cousin, Han Solo. She found out that her father was alive and attempted to use her daughter to bring Fett to her and kill him once and for all, but never got the chance. Vel was arrested by Jacen Solo on a GAG raid, and was accidentally killed by Jacen during her interrogation."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Ailyn was born in approximately 15 BBY, when her father was roughly eighteen years old. The place of Ailyn's birth was unknown, though it was believed that she was born on Concord Dawn, where Fett may have been a Journeyman Protector at the time. Her mother, Sintas Vel, was a Kiffar bounty hunter."}, {"tag": "p", "text": "It seemed Ailyn's father walked out on the family (in actuality, Fett was exiled from Concord Dawn) circa 12 BBY. As a result, Ailyn grew to hate her father. She lived with her mother until she was a teenager. Sometime between the age of five and fourteen, she and her mother then met a man named \"Quinny\". Ailyn then helped \"Quinny\" and her mother fight off a hit team of Devaronians by using a small ion cannon. After successfully fighting them off, Ailyn, her mother and Quinny then decided to go to a safe house in a nearby village."}, {"tag": "p", "text": "Tragedy struck Ailyn again shortly prior to her sixteenth birthday, when her mother was presumed to have been killed while in pursuit of a bounty. Sintas had taken the bounty mission for the sole purpose of getting credits to buy a special birthday gift for her daughter. Ailyn was devastated by her mother's loss."}, {"tag": "p", "text": "The death of Ailyn's mother fueled the strong hatred she had towards her father, and her ambition in life became killing Boba, whom Ailyn blamed for her mother's death."}, {"tag": "p", "text": "Tracking Fett was a difficult task for young Ailyn, so she resorted to becoming a hunt-saboteur in hope of finding Fett in her travels. Unfortunately, her efforts went unrewarded for a long time."}, {"tag": "h3", "text": "Bounty hunter"}, {"tag": "p", "text": "It was not until some years after the reported death of Fett at the Great Pit of Carkoon that Ailyn felt she could finally move on in life. It was from that point that she began her career as a bounty hunter."}, {"tag": "p", "text": "Years later, Ailyn discovered that her father still lived, and so the biggest hunt of her lifetime had resumed. She eventually hunted Fett down in the Extrictarium Nebula. However, on confronting her target, she found a man that was not her father, but was in fact an old clone of Jango Fett known as Spar. Ailyn killed the old ARC trooper and took his Mandalorian armor with her, and so her hunt continued."}, {"tag": "p", "text": "Ailyn returned to hunting bounties, and on occasion would don the Mandalorian armor and act as Boba Fett, in order to receive bounties with much larger payouts. She began to believe that she was truly Fett's equal—or better."}, {"tag": "p", "text": "In 21 ABY, Ailyn once again believed her father to be dead. She tracked \"Fett\" down at Shogun and found evidence of a dead Mandalorian supercommando. She also found Fett's Slave IV and took it as her own, assuming the corpse was that of her father."}, {"tag": "p", "text": "Believing this dead man to be her father, she committed to assuming Fett's identity, taking jobs from Bwahl the Hutt and for Nolaa Tarkona of the Diversity Alliance to find shipping merchant Bornan Thul. On the way she encountered wannabe bounty hunter Zekk. She eventually found Thul, discovering that he'd been hiding-the coordinates of a plague storehouse-and then transmitting that data to Tarkona. The Diversity Alliance crumbled in battle with the New Republic."}, {"tag": "p", "text": "In 22 ABY, Ailyn had a daughter, Mirta Gev. The father was Makin Marec, a Mandalorian warrior she had met while researching Mandalorian culture. The two raised Mirta in the midst of the devastating Yuuzhan Vong War that would rage for much of the decade. It was probably at this time, possibly through Mirta's Mandalorian father, that Ailyn learned that her father, Boba, was indeed still alive."}, {"tag": "h4", "text": "Second Galactic Civil War and death"}, {"tag": "p", "text": "By the time of the Second Galactic Civil War, under the alias Ailyn Habuur, she accepted Thrackan Sal-Solo's bounty on the Solo family. What she did not know, however, was that Sal-Solo was setting her up to be caught to hide the real threat posed by other hunters he had hired for the contract. Also at this time, Ailyn told her daughter Mirta to find her father, Boba, and lure him to Coruscant with the Heart of Fire pendant that he gave to her mother, Sintas, when the two first married. She intended to kill him once and for all."}, {"tag": "p", "text": "Because of Sal-Solo's deception, Ailyn was led to Coruscant. There she hid in a Corellian community and was caught during the Galactic Alliance Guard's raids. Believing her to be a Corellian terrorist, Jacen Solo interrogated her. When she did not provide information, he used the Force to bludgeon her and attempted to enter her mind. However, this was too much for Ailyn to endure, and she died."}, {"tag": "p", "text": "Mirta, who had successfully found Boba on Taris, had traveled with him to Corellia. Boba, who had learned that Ailyn took the contract to kill the Solos, found Han Solo, and tried to use him as bait to reunite with his daughter. However, Han revealed that Ailyn had been captured. Later on, Thrackan Sal-Solo revealed his deception, which resulted in Mirta killing him in a fit of rage. After Han led the two to Leia Organa Solo, she contacted Jacen to bring her to Corellia. However, she then informed Boba and Mirta of Ailyn's death."}, {"tag": "p", "text": "Jacen Solo traveled to Corellia to bring Ailyn's corpse to Boba and Mirta. Later on, after learning from a fellow Mandalorian that Jacen Solo was the cause of Ailyn's death, Boba Fett considered hunting him down. However, he was already aware of the strife going on in the Solo family, and figured that they would cause enough damage to themselves in ways worse than he ever could."}, {"tag": "p", "text": "Ailyn was buried with half of the Heart of Fire pendant in a modest grave in a wooded area outside Keldabe. She would never learn that her mother was still alive, having been encased in carbonite since around the time she took the bounty for Ailyn's present."}, {"tag": "p", "text": "A year later, in a Coruscant Holozine, Ailyn was referenced as \"Fett Junior.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ailyn Vel's character was developed by Abel G. Peña, fleshed out exclusively for his article in Star Wars Insider 80 entitled The History of the Mandalorians. Ailyn was designed as the typical \"gorgeous butt-kicker\", based on characters such as Joan of Arc, TV's Xena the Warrior Princess, Kill Bill's Beatrix Kiddo, and the hookers of Frank Miller's Sin City."}, {"tag": "p", "text": "The artwork depicting Ailyn that appeared in the article was by Joe Corroney, inspired by a photograph of model Anastasia Heonis. The photo was taken by Jason Perlman.[source?]"}, {"tag": "p", "text": "Ailyn assuming her father's identity was based on the concept of Dread Pirate Roberts from The Princess Bride."}, {"tag": "p", "text": "Several reasons exist behind Peña's decision to make the appearance of Boba Fett in the second story arc of the Young Jedi Knights series Ailyn, instead of Fett himself. \"The Last One Standing: The Tale of Boba Fett\" short story, which takes place five years earlier, builds toward the suggestion that Fett's ardent animosity toward Han Solo comes to an end. His adherence to the Bounty Hunters' Creed in Young Jedi Knights also conflicts with his past behaviour, having betrayed other hunters on multiple occasions, even going so far as to help destroy the Bounty Hunters' Guild itself. The clincher for Peña was a quote given in Young Jedi Knights: Diversity Alliance, in which a character speculates that Fett could be female under his helmet, to which \"Fett\" responds that he removes his helmet for no one."}, {"tag": "p", "text": "Ailyn first appeared as a baby in the arms of Sintas with Boba Fett in \"Outbid But Never Outgunned\", though her name and character was likely not established at that time. While this story, like all other stories in the early Star Wars Tales issues, was not meant to be necessarily canon, the references in The History of the Mandalorians and Legacy of the Force: Sacrifice have made her existence canonical."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "External links"}]}