{"url": "Enforcer", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Enforcer"}, {"tag": "p", "text": "The Enforcer was a Star Destroyer in the Imperial Navy during the Imperial Era. In 14 BBY, it was stationed at the planet Pii's Imperial marshaling station, along with the Compliant, another Star Destroyer. When a rebel cell attacked an Imperial convoy near the Gulf of Tatooine, the two Star Destroyers were dispatched to the battle. However, by the time they had arrived, the rebels had already been defeated by Moff Wilhuff Tarkin on the Executrix."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Star Destroyer, the Enforcer was equipped with engines and a hyperdrive."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 14 BBY, during the Imperial Era, the Enforcer was stationed at the planet Pii's Imperial marshaling station, along with another Star Destroyer, the Compliant. At that time, Berch Teller and his rebel cell launched an attack on an Imperial convoy in a star system Coreward of the Gulf of Tatooine. With the attack, Teller aimed to impede the progress of an Imperial battle station, later known as the Death Star, which was being constructed over the planet Geonosis and was the convoy's final destination."}, {"tag": "p", "text": "Due to the attack, the Enforcer and the Compliant were dispatched from Pii to assist in the battle. However, by the time the two Star Destroyers reached the system through hyperspace, the rebels had just been defeated, as Imperial Moff Wilhuff Tarkin's Imperial-class Star Destroyer Executrix had arrived beforehand to protect the convoy. As the Compliant and Enforcer arrived, an Imperial technician on the Executrix's bridge informed Tarkin that two marks were reverting from hyperspace. For a moment, Tarkin thought he had fallen into a trap, but the technician then clarified that the two marks were Star Destroyers dispatched from Pii."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Enforcer was mentioned in James Luceno's 2014 novel, Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}