{"url": "Enforcer_One_(dreadnaught)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Core Galaxy Systems Dreadnaughts", "Category:Dreadnoughts", "Category:Flagships", "Category:Galactic Republic starships"], "nodes": [{"tag": "h1", "text": "Enforcer One (dreadnaught)"}, {"tag": "p", "text": "The Enforcer One was a modified Core Galaxy Systems Dreadnaught that served as the flagship of Stenness Node–based crime lord Bogga the Hutt in the years leading up to the Great Sith War. Captained by an enslaved Near-Human named Norufu, the Enforcer One was nine hundred meters long and held a crew of forty-five, including the Weequay Grimorg, one of Bogga's top enforcers. The Enforcer One was heavily armed, boasting heavy turbolasers, sixteen laser cannons, and four tractor beam projectors."}, {"tag": "p", "text": "In 3999 BBY, the dreadnaught was assigned to protect an Ithullian ore hauler that was traveling through the Stenness Node from pirates. However, the ore hauler was attacked by a gang of pirates led by Captain Finhead Stonebone, forcing the Enforcer One to enter the fray. The dreadnaught used its tractor beams to capture the pirate ships Marauder Starjacker and Stenness Raider, and subsequently brought them to Bogga's estate on the moon Vo Dasha."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Enforcer One was a modified Core Galaxy Systems Dreadnaught. The ship was nine hundred meters long, and had enough cargo space to hold three thousand tons of material. The dreadnaught, after coming into the possession of the crime lord Bogga the Hutt, had extra laser cannons added, bringing its number of cannons to sixteen. The ship also wielded heavy turbolasers and four tractor beam projectors."}, {"tag": "p", "text": "The Enforcer One was originally designed for planetary occupations, using its turbolasers to blast through planetary defense armadas and then releasing dropships to deliver an invasion force. Although Bogga acquired the Enforcer One in a stripped-down state, the ship still had powerful weapons and shields. The Enforcer One's main weapon was its heavy turbolaser. The power core and laser actuator had an advanced cooling system to allow the weapon extended usage, while the long laser barrel was modified with experimental galven circuitry to allow tighter focus of the beam and increased range."}, {"tag": "p", "text": "Enforcer One had an interior landing bay nearly three hundred meters long, and a pair of immense ship loading arms that could be used to pull captured vessels into the bay. Enforcer One carried six light tactical fighters which Bogga replaced frequently. The fighter pilots seldom received much starfighter combat training, and the Hutt considered the light tactical fighters expendable. Enforcer One was crewed by an assortment of multispecies Hutt enforcers, including Nikto, Vodrans, Weequays, and Klatooinians. They served as boarding troops and crew hands, and the Enforcer One had enough room to keep five hundred of them aboard."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Enforcer One was originally a part of the Galactic Republic military, but after it was decommissioned the ship ended up in the salvage yards of the Outer Rim planet Ord Trasi. Enforcer One was later retrieved by Stenness Node–based crime lord Bogga the Hutt at some point, and the Hutt converted the dreadnaught into a devastating space combat–ready starship. Bogga had extra laser cannons installed onto Enforcer One for starfighter engagement, and it later became the flagship of Bogga's fleet. As such, the ship was docked at Bogga's estate on the moon of Vo Dasha. Bogga appointed Norufu, an enslaved Near-Human, to be Enforcer One's captain, and the Weequay Grimorg was made the crewmember in charge of keeping control of the ship's boarding troops. Enforcer One brought Bogga victories he never would have secured otherwise, such as the successful raid on the Nematiec Gang's asteroid base."}, {"tag": "p", "text": "In 3999 BBY, the Enforcer One, along with starfighter pilot Dreebo in one of the ship's light tactical fighters, was assigned to protect an Ithullian ore hauler under the command of Captain Gruna. Nevertheless, the ore hauler was attacked by a gang of pirates led by Captain Finhead Stonebone. In an effort to defend the ore hauler, Enforcer One dispatched Dreebo to attack the pirate ships, but to no avail. Dreebo's starfighter was destroyed by the pirate ore siphoner Marauder Starjacker, forcing Enforcer One to reveal itself. With ease, the dreadnaught captured both the Marauder Starjacker and its sister ship, the Stenness Raider, in its tractor beam, bringing the ships on board. Once the pirates were within Enforcer One's holding bay, Grimorg and his group of boarding troops surrounded the pirate vessels and took the pirates into their custody. Enforcer One then went to Vo Dasha, and Grimorg brought the shackled pirates before Bogga himself."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Enforcer One was captained by Norufu, an enslaved Near-Human. Norufu had great confidence in the utter power of Enforcer One, and would often toy with enemies attacking the ship—allowing the attackers to fire the first few shots, only to watch them harmlessly dissipate in the dreadnaught's powerful shields, and using the tractor beam to haul around a captured ship before destroying it with Enforcer One's heavy turbolaser. Norufu was also in charge of the down-and-out spacers who managed the control, navigation, and weapons systems. Enforcer One also counted among its crew Grimorg, a Weequay who was one of Bogga's top enforcers. Grimorg's duty was to keep control of the many Vodrans, Klatooinians, Weequays, and Nikto who served as crew hands and boarding troops. Additionally, Enforcer One contained a group of starfighter pilots who flew the complement of light tactical fighters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Enforcer One first appeared in Tales of the Jedi: The Saga of Nomi Sunrider, the second story arc of the Tales of the Jedi comic book series, written by Tom Veitch and released over late 1993 to early 1994. Enforcer One made its first and only appearance in the arc's second issue. In this appearance the ship was illustrated by David Roach. Further information on Enforcer One was later given in Bill Smith's 1996 reference book The Essential Guide to Vehicles and Vessels, and in George R. Strayton's work Tales of the Jedi Companion published later that year. Enforcer One also garnered mentions in an article in Star Wars Insider 26, 1998's Star Wars Encyclopedia, and The Complete Star Wars Encyclopedia in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}