{"url": "Engagement_over_Belsavis", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Bozhnee sector", "Category:Battles of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Engagement over Belsavis"}, {"tag": "p", "text": "Shortly after the capture of the six Sith Lords known as the Dread Masters in 3668 BBY during the Great Galactic War, an attempt by the Dread Masters to break out of the Galactic Republic's prison complex on the planet Belsavis led to a short battle above the planet. After the Sith were moved to the prison district of Section X to ensure that they would not harm other inmates, the six reached out to an apprentice of theirs and ordered him to bring the Fatality—a warship of the Sith Empire that carried dozens of elite HK-51 assassin droids—to Belsavis so that they could break out. However, the prison's defenses destroyed the Fatality in orbit, sending the heavily damaged warship crashing into a frozen lake near Section X."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3668 BBY, during the Great Galactic War between the Galactic Republic and the Sith Empire, a strike team composed of Jedi Knight Jaric Kaedan and a Republic Special Forces Division unit managed to capture the six Sith Lords known as the Dread Masters with the help of the Republic's intelligence agency, the Republic Strategic Information Service. The Dread Masters, who were capable of using a dark side version of battle meditation to inspire crippling fear in their opponents, were sent to the Republic's secret prison complex on the planet Belsavis."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "However, the Dread Masters were able to reach out to one of their apprentices and ordered him to steal the Fatality, an Imperial destroyer that was carrying dozens of the highly advanced HK-51 assassin droids, and break them out of prison. The apprentice complied with their orders, bringing the Fatality to Belsavis—a location which the Republic had worked hard to ensure that the Empire never discovered. Fortunately for the Republic, the rest of the Empire was unaware of the apprentice's purpose or location, so when the prison's defenses shot down the Fatality over the district of Section X, the Republic's secret prison remained secret. However, the Republic was unaware that the Fatality was not destroyed on impact, but had in fact crashed into a frozen lake near Section X where it would remain for the next three decades."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The HK-51 droids aboard the Fatality remained frozen and deactivated until 3639 BBY, when the recently-freed Dread Masters brought the Dread Guard—an army of Imperials and other individuals under their mental control—back to Section X and began to excavate the destroyer while also pursuing other goals in the area."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle above Belsavis was first mentioned in several promotional releases for Game Update 1.5 of the video game Star Wars: The Old Republic, as the update featured the addition of Section X and a series of missions that allowed players to acquire HK-51 as a companion. It was later expanded on in the Republic and Imperial missions in Section X, giving the battle a date and background."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}