{"url": "Engineer/Legends", "categories": ["Category:Legends articles", "Category:Engineering and manufacturing occupations", "Category:Engineers"], "nodes": [{"tag": "h1", "text": "Engineer"}, {"tag": "p", "text": "An engineer was a person involved in construction, design, or the use of engines or machines."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Military engineers were technology specialists who focused their energy on making repairs in the field. They were often part of a combat unit and were trained to make rapid repairs and adjustments in highly stressful situations—even while under fire."}, {"tag": "p", "text": "Starship engineers were members of a starship's crew who maintained the ship's systems. In combat, the engineer could reroute power to increase speed or shielding, and repair or jury-rig battle-damaged systems."}, {"tag": "p", "text": "Other types of engineers included:"}, {"tag": "h2", "text": "Notable engineers"}, {"tag": "p", "text": "Bao-Dur was a military engineer during the Mandalorian Wars and later a companion of the Jedi Exile."}, {"tag": "p", "text": "Feno Gamoc was a Rybet male who served Confederacy of Independent Systems as a senior engineer aboard the Munificent-class star frigate Sa Nalaor during the Clone Wars."}, {"tag": "p", "text": "Walex Blissex was a starship engineer who designed all kinds of craft, from starfighters to battleships, and earned the title of doctor. Another prominent starship engineer was Raith Sienar, who ran Sienar Fleet Systems where he designed the TIE fighter."}, {"tag": "p", "text": "Massad Thrumble was an engineer, and the Imperial spy Lucius Rothingham was a former engineer."}, {"tag": "p", "text": "Engineering-related groups included the Republic Combat Engineer Battalion and the Imperial Engineers Academy. The later of which trained Imperial Combat Engineers. Each Special missions platoon had one Engineering squad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Engineer class is a class of soldiers in the video game Star Wars: Battlefront II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}