{"url": "Aiolin_Astarte", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Character stubs", "Category:Cyborgs", "Category:Cylo Directive personnel", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Aiolin Astarte"}, {"tag": "p", "text": "Aiolin Astarte was a female human engineered and trained by Doctor Cylo to replace the Sith Lord Darth Vader as Darth Sidious' Sith apprentice."}, {"tag": "p", "text": "Aiolin and her twin brother Morit Astarte were born of the Astarte line of Celanon, who had joined the Separatist cause. The Astarte line funded much of Cylo's early work. Cylo thought of them as \"generally smart\" and \"forward facing.\" Fearing retribution for their allegiance during the Clone Wars, the Astartes passed their children to Cylo for training and experimentation, in the hope of redeeming themselves."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Aiolin was born, along with her brother, Morit, into the Astarte line of Celanon either before or during the Clone Wars. His family financially backed the research of Doctor Cylo, a specialist in cybernetics whose experiments were considered immoral and illegal by the Galactic Republic, during this time. The Astartes sided with the Separatists during the war and, fearing the retribution of the new Galactic Empire, gave their two children over to Cylo's care."}, {"tag": "p", "text": "With backing from the newly self-appointed Galactic Emperor Sheev Palpatine, Cylo continued his research and included Aiolin and Morit into his experiments. He upgraded them with the best genetic enhancements and technolgy that made them stronger and capable of greater feats than common warriors. Such an ability was an ability to slice into technological systems and with little to no ability. Cylo believed that this not only made up for their lack of Force sensitivity, but also eliminated any need for the Force. He also provided the twins with advanced training in lightsaber combat. Coupled with their technological upgrades, including rockets placed in the soles of their feet and missile launchers in their wrists, this turned the Astarte twins into warriors with abilities equaling those of the Jedi and Sith of old."}, {"tag": "h3", "text": "The arrival of Vader"}, {"tag": "p", "text": "Several weeks after the Battle of Yavin, Sith Lord Darth Vader learned of her and her brother's existence after he captured and killed Cylo, after learning of the doctor's existence from the Emperor, Darth Sidious. She was sent along with her brother, Morit, to Sho-Torun to aid Darth Vader in subduing the the Ore-Baron revolt against Queen Trios at Sho-Torun. During the ensuing conflict at Sho-Torun, she gravitated towards Vader as a mentor, wishing he would teach her the ways of the Jedi. She hoped Vader would train her to become better at the lightsaber. Vader was quick to dismiss this, saying nothing he could teach would be useful to her, and telling her that she and her brother had bought a fantasy: Neither of them had any future."}, {"tag": "p", "text": "Nearing the end of the revolt at the Sho-Torun war, she and her brother Morit tried to ambush Vader, in order to take out one of their competitors in their scheme for who would be the Emperor's right hand. However, Vader successfully held them off, and Aiolin told her brother that she was no longer certain they could ever defeat Vader. Morit was however still determined to eliminate one of his competitors on that occasion, and in an act of sudden betrayal, he pushed Aiolin off a cliff, making her fall into a pit of molten lava."}, {"tag": "p", "text": "Before she succumbed to her agonizing wounds, Vader used the Force to raise her from the lava. In an uncharacteristic display of seeming compassion, he assured her that the pain would soon pass, but asked her to tell him everything she knew. The horribly burnt woman revealed that Cylo V had collaborated with the Ore-Barons in the rebellion against Queen Trios and was planning to betray the Emperor Palpatine. Aiolin then thanked Vader in advance for ending her pain, apparently understanding what this really entailed: Vader used his lightsaber to kill her and quickly put her out of her misery."}, {"tag": "p", "text": "Vader's somewhat merciful handling of the situation—even though he was dealing with a person who had just tried to kill him—was probably motivated by his own traumatic memory of being maimed and burnt on Mustafar.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}