{"url": "Eos", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cadavine sector planets", "Category:Trade Federation planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Eos"}, {"tag": "p", "text": "Eos was a mineral-rich volcanic planet that hosted a large droid foundry belonging to the Trade Federation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Eos was an Outer Rim Territories volcano planet. Found in the Eos system in the Cadavine sector, it orbited one sun."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Clone Wars"}, {"tag": "p", "text": "The Trade Federation established a foundry on Eos, which was protected by a deflector shield powered by eight generator pylons, and a large planetary cannon that could shred capital ships. The continual movement of the planet's heavy molten rock and ore made Eos's electromagnetic fields both powerful and variable. For this reason, the natives were forced to adopt treaded transports over standard repulsorlift vehicles.[source?] Eos produced many of the weapons that saw action with the Trade Federation invasion army that conquered Naboo in 32 BBY."}, {"tag": "p", "text": "Shortly prior to the Invasion of Naboo, the foundry was discovered accidentally by the mercenary Vana Sage, as she tracked a damaged Hunter-Seeker droid to the molten surface. There she found herself trapped by the shield, which she was forced to destroy in order to escape; during which she expressed her surprise at the planet's ability to \"remain geometrically stable enough to form a gravimetric mass\". Later, she, Nym, Reti, and Rhys Dallows returned to aid Naboo by destroying the factory. Reti and Rhys remained in orbit to destroy the cannon's targeting satellites, using their speed to their advantage, while Vana and Nym headed to the surface to take down the facility. With the destruction of the Eos facility, the Trade Federation moved much of its droid production to factories on Geonosis and Hypori."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "The Galactic Empire also fought a battle on the world, commanded by Brenn Tantor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}