{"url": "Epic_Battles_Multiplayer_Expansion", "categories": ["Category:Real-world articles", "Category:Star Wars: X-Wing Second Edition"], "nodes": [{"tag": "h1", "text": "Epic Battles Multiplayer Expansion"}, {"tag": "p", "text": "The Epic Battles Multiplayer Expansion is a multi-player expansion for the Star Wars: X-Wing Second Edition miniatures game, a tactical ship-to-ship combat game released by Fantasy Flight Games. It will allow two to eight players to engage in large scale space battle scenarios. The expansion was teased on Fantasy Flight Games' twitter feed on April 13, 2019 during Celebration Chicago and officially announced on FFG's website on July 11, 2019 for a fourth quarter release that year."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Broaden the possibilities of your Star Wars™: X-Wing games with the Epic Battles Multiplayer Expansion! This expansion introduces a totally new way to play X-Wing, inviting two to eight players to engage in epic multiplayer battles as they command massive fleets in large-scale games that evoke iconic Star Wars scenes."}, {"tag": "p", "text": "Featuring eleven cinematic scenarios, Epic Battles gives players the chance to fly coordinated wings of starfighters into a wide variety of situations. From desperate defensive actions to daring assaults on enemy fortifications, each scenario creates an exciting X-Wing experience. Within this expansion, you'll find five wing tools, eight upgrade cards, seven Wing Quick Build Cards, and everything else you need to stage your own epic X-Wing battles!"}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Mission scenarios"}, {"tag": "h3", "text": "Upgrades"}, {"tag": "h4", "text": "Command"}, {"tag": "h4", "text": "Remote"}, {"tag": "h4", "text": "Wing ID Cards"}, {"tag": "h3", "text": "Tokens"}, {"tag": "h2", "text": "Other"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}