{"url": "Epicanthix", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Epicanthix", "Category:Human and Near-Human species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Epicanthix"}, {"tag": "p", "text": "The Epicanthix were a warrior species of Near-Humans native to the Outer Rim world of Panatha, within the Pacanth Reach."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Physically, Epicanthix were generally human in appearance, possessing faces that were somewhat longer than usual, with narrow eyes, black hair, and lithe builds with powerful musculature that tended to be willowy and graceful due to a cultural focus on physical training and combat readiness."}, {"tag": "p", "text": "Due to their similarities with \"baseline\" humans, some suggested that the Epicanthix evolved from a forgotten colonization effort many millennia ago.\nRegardless of possible ancestry, however, Epicanthix had enough minute differences to be recognized on sight as near-human, and many sentients regarded them as an entirely separate race."}, {"tag": "p", "text": "Some Epicanthix possessed a natural unconscious talent to shield their minds from Force-assisted mental tricks, influence, domination, and mind reading, with the talent being widespread enough that the Minister of Intelligence during the time of the Sith Empire sought out the Epicanthix for use as spies, as was the case with Ula Vii. This ability, similar to that of Hutts and Toydarians, was powerful enough to prevent Darth Chratis, a Sith powerful enough to read the minds of other Sith against their will, from ascertaining the true intentions of an honest non-forceful Imperial Agent."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "A race of warriors known for their their combination of militaristic mindsets and high regard for art and culture, the Epicanthix trained and honed their bodies in preperation for war - with great value being placed on an individual's combat readiness - while simultaneously broadening their minds by studying art, music, and literature. Practical yet praising aesthetic, the Epicanthix worked this duality into much of their way of life; their starships were beautiful yet lethal, their hair was tied in ceremonial styles that were not only attractive but practical for combat, and while they trained their bodies for strength they simultaneously toned them for beauty. Even when conquering an enemy, the Epicanthix would absorb their conquered subject's culture, regarding a subjugated people's art and culture as equally important as their material wealth."}, {"tag": "p", "text": "Despite their technological progress and their mastering of the hyperdrive, the Epicanthix were sequestered in the remote Pacanth Reach star cluster in the Unknown Regions; as a result, while aware of the wider galaxy, they were largely unfamiliar with galactic society at large until the Rise of the Empire Era. As such, on first contact with the Galactic Empire many Epicanthix left their homeworld in order to see and experience the wider galaxy; and just as many Epicanthix returned soon after, having been overwhelmed by the vast diversity and unfathomable sights of the Empire's millions of worlds."}, {"tag": "p", "text": "This phenomenon became casually known as a type of \"Galactic Naivetè,\" and affected many Epicanthix due to the species being relatively recently encountered. As a direct result, while some Epicanthix continued to venture out into the wider galaxy, most eventually returned to the Pacanth Reach after making their fortunes, with the species as a whole being relatively content to stay in the Reach and amass wealth, further their exploration of cultures, and war with unruly conquered subjects when problems arose."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "From their civilization's earliest days, great armies of Epicanthix warriors marched from their mountain clan-fortresses to battle other clans for control of territory - fertile mountain pastures, high-altitude lakes, and caves rich with nutritious fungus - and in quest of slaves, plunder, and glory. In this way, they settled much of their homeworld of Panatha, carving out new kingdoms through blade and blood, their way of life unchanging until the coming of a warrior by the name of Canthar. Canthar united many of the clans, and subdued those who refused, declaring a planet-wide era of peace; and, though border disputes erupted from time to time, the cessation of hostilities was widely maintained."}, {"tag": "p", "text": "Peace brought a new age to Epicanthix civilization, spurring on greater developments in harvesting, architecture, commerce, and culture. While warriors continued to train, and high value was placed on an individual's combat readiness, new emphasis was placed on art, scholarship, literature, and music. Over time, cultural advancement heralded technological advancement, and the Epicanthix swiftly rose from an industrial society, to an information society, and then further to the stars as they attained hyperspace travel."}, {"tag": "p", "text": "With the advent of the hyperdrive, the Epicanthix set out to conquer their neighbors in beautiful yet deadly ships; with those civilizations that failed to fall prostrate at the arrival of Epicanthix landing parties being blasted into submission. The Epicanthix quickly annexed or outright conquered Bunduki, Ravaath, Fornow, and Sorimow, dominating all the major systems and their colonies in the Pacanth Reach. In addition to swallowing up the wealth of these worlds, the Epicanthix also absorbed their cultures, immersing themselves in the art, literature, and music of their subject peoples."}, {"tag": "p", "text": "Imperial scouts reached the Epicanthix on the edge of the Unknown Regions shortly after Palpatine came to power and declared his New Order. True to their warrior ways, the Epicanthix were quick to size up their opponent; though on realizing the sheer military might of the Empire, were quick to submit to Imperial rule lest they face total subjugation. As a result, an Imperial Governor was installed to administer the Pacanth Reach, and worked with the Epicanthix to export valuable commodities (mostly minerals) and import items useful to the inhabitants. Due to the Epicanthix's cooperation, the Epicanthix government retained a certain degree of autonomy, reigning in conjunction with the Imperial governor and a handful of Imperial troops."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It has been speculated that the Epicanthix are named after the epicanthic fold, a feature of human eyes commonly associated with East Asian people. Author Daniel Wallace has expressed discomfort at the idea."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}