{"url": "Episode_XXIV:_Death_on_the_Rim", "categories": ["Category:Legends articles", "Category:Holofilms"], "nodes": [{"tag": "h1", "text": "Episode XXIV: Death on the Rim"}, {"tag": "p", "text": "Episode XXIV: Death on the Rim was the twenty-fourth instalment of the historical holodrama series True Tales of the Ancient Republic. It was released in 114 BBY. Set during the Kymoodon Era, it followed the exploits of the Sector Ranger Novan Nune, who fought to rescue the colonists of Parcovey Minor after they were kidnapped and enslaved by a Hutt kajidic. Considered a popular and entertaining holofilm, Death on the Rim was still being studied by academics of popular entertainment as late as 6 ABY."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "The story followed the intrepid Sector Ranger Novan Nune. After the colonists of Parcovey Minor were attacked and enslaved by the Hutts, Nune followed them to the arenas of Affavan deep in Hutt Space, where he fought as a gladiator to win their freedom. Finally, Nune returned to face Huska the Hutt in single combat and destroyed the kajidic that had ravaged Parcovey Minor."}, {"tag": "h2", "text": "Historical accuracy"}, {"tag": "p", "text": "Death on the Rim was loosely based on a real assault on Parcovey Minor sponsored by the Utoradii kajidic in the final years of the Kymoodon Era. In this period, Republic colonists pushing into the Outer Rim began to encroach on territory claimed by the Hutts, and Parcovey Minor was one of many planets targeted for Hutt-sponsored slave raids. In this case, however, the colonists were warned of the coming assault, allowing the Belasco Free Volunteers to catch the raiders by surprise when they arrived and then counterattack, destroying the Utoradii at a parlay-feat on Affavan."}, {"tag": "p", "text": "Historians of the period like Thunys Albegron considered Novan Nune to be entirely fictional, but considered the real story of Parcovey Minor to be just as compelling. In 6 ABY, Death on the Rim was studied at the Conference on Popular Entertainment on Obroa-skai, where Albegron illustrated the differences between fiction and the reality."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Episode XXIV: Death on the Rim, and by extension, the series True Tales of the Ancient Republic was an in-universe work that was conceived for 2012's The Essential Guide to Warfare. Jason Fry, the author of the book, intended to write this section to portray the monstrous side of the Hutts instead of depicting them as comic relief. The opening crawl and the overall nature of the section also included meta elements to create an affectionate parody of Star Wars itself, as well as The War of the Worlds. Although both Fry and Erich Schoeneweiss agreed that it was a fun section and that the Hutts needed to have their vile natures emphasized, it was cut due to it not serving much purpose as well as being too long."}, {"tag": "h2", "text": "Sources"}]}