{"url": "Er%27stacian", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Er'stacians", "Category:Wild Space species"], "nodes": [{"tag": "h1", "text": "Er'stacian"}, {"tag": "p", "text": "Er'stacians were a sentient species of humanoids with purple skin and three clawed fingers per hand. They lived on Er'stacia, a planet in Wild Space, where they divided themselves into clans based upon lineages traced back to the tidal pools of their ancestors. The clans revered a single forebear known as the Venerable One, who was represented as a massive stone known as the Megalith. Despite such universal veneration for the object, each clan believed that it should have sole possession of the statue. The situation resulted in near-perpetual clan wars during which the Er'stacians wielded a mixture of low- and high-tech weaponry, such as swords, spears, and walkers."}, {"tag": "p", "text": "At some point between 22 and 19 BBY, one such Er'stacian clan war had grown so out of hand that, when word of it reached the Jedi Council on Coruscant, the Jedi feared it might result in genocide. The council sent Jedi Master Mace Windu to negotiate a peace settlement, but when the Jedi reached Er'stacia, he found that no peace was possible as long as the clans clung to the belief that only one of them could possess the Megalith. Windu was only able to halt the war by carving up the Megalith into thousands of pieces, forcing the Er'stacians to either work together to repair it or to divvy up the rubble."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Er'stacians were sentient humanoid beings whose hands ended in three plump, clawed fingers. Their mottled, purple hides were covered with knots and spikes. While all members of the species sported round, white eyes; large, protruding, blocky, bluish teeth; a red or white tongue; and a cluster of knobby growths under the chin, clan affiliation determined other phenotypic features. For example, each member of one Er'stacian clan featured a distinct, upturned nose and a prognathic lower jaw, while each member of another instead sported a prominent snout and a noticeable overbite. Clan affiliation also determined an individual's pattern of skin mottling; one clan featured dark purple spots, while another had circular spots of the same color as that of the rest of the skin. Regardless of their clan affiliation, Er'stacians cried blue tears, drooled blue saliva, and sniffled blue mucus."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Er'stacian society was divided along clan lines, with each clan claiming descent from various tidal pools pock-marking their homeworld, Er'stacia. All Er'stacians were united in their veneration of the Venerable One or Exalted One, the species' legendary creator and ancestral divider; worship of the figure constituted the center of Er'stacian culture. However, the clans disagreed over who should have control of their maker's holy megalithic statue, and constant clan wars rocked the Er'stacians as each clan almost constantly battled the others for possession of the Megalith. Each portion of the statue held religious significance: the single claw held a Pearl of Wisdom, for example, and the sinewy segments brought the Venerable One from the Primordial Pool to conquer the land. All factions agreed that damaging the statue was desecration and blasphemy, and that the mending of damage to the statue took precedence over other considerations. At least some Er'stacians could speak and understand Basic, although they peppered their speech with k'tik and k'tuk sounds."}, {"tag": "p", "text": "With rare exception, clan armies fought constant wars on the world for possession of the Megalith, fielding soldiers who wore armor based on their clan affiliation. For example, one clan's warriors wore red armor, while another clan's wore green and tan armor. The typical suit of armor consisted of a helmet—sometimes with horns—a breastplate, gauntlets, shoulder pads, and spiked knee-high boots, all worn over a simple cloth tunic. Typical weaponry ranged from simple swords, spears, and morningstars to more sophisticated guns and five-legged walkers. Despite their reliance on weapons and armor, Er'stacian combat experts could also fight with their bare hands if necessary. War banners further differentiated factions in wartime."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Er'stacians hailed from Er'stacia, a terrestrial planet of hills and tidal pools. According to their cultural legends, the Venerable One was the originator of their species and brought the Er'stacians to the land when he climbed from the Primordial Pool. Since that time, according to the species' mythology, their clans could trace their ancestry to various tidal pools."}, {"tag": "p", "text": "Outsiders from another world made contact with Er'stacia at some point before 22 BBY, and the world became part of Wild Space."}, {"tag": "p", "text": "For much of their history, the Er'stacian clans were at war with one another over possession of the Megalith, a statue representing the Venerable One revered by all clans. Sometime between 22 BBY and 19 BBY, one such war was taking place between two rival clans. Bedecked in their clan armor—red for one side and green and tan for the other—the hostilities escalated. When word reached the outside, the Jedi Council dispatched Jedi Master Mace Windu to the world to avert a potential genocide. Windu traveled to Er'stacia in his Jedi starfighter to try to put an end to the fighting."}, {"tag": "p", "text": "The Er'stacian combatants were in the middle of pitched battle in the vicinity of the Venerable One when Windu arrived. The Jedi Master demonstrated his Force-using prowess and wowed the fighters into a temporary cease-fire, even going so far as to reflect blaster fire directed toward him back on the attacker and then healing him. Windu ordered the two sides to stop fighting, threatening them with his own retribution should they refuse. The Er'stacians protested that they could not cease their animosity until one side gained sole possession of the sculpture of the Venerable One nearby. Windu proposed slicing the statue in two with his lightsaber, but both sides averred that such an action would be unfair, as each piece of the statue held some religious and cultural significance."}, {"tag": "p", "text": "During the negotiations, a member of the red-armored clan inadvertently fired a round into the statue and chipped a piece off the Venerable One. The misstep triggered another outbreak of violence, as the Er'stacian was accused of blasphemy and torn limb from limb. Windu stopped the hostilities once again, and the two clans turned their attention to their holy statue to see whether it needed tending. Realizing that both sides held in common their veneration and protective attitude toward the megalith, Windu sliced it into thousands of pieces. Such desecration brought peace, as both clans worked together to mend the statue or determine which clans would take which pieces of the once-great monument. Meanwhile, Windu departed and reported the events to Jedi Master Yoda on Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Er'stacians were created for the story \"Puzzle Peace,\" first published in 2002 as part of Star Wars Tales 13 from Dark Horse Comics. The species was created by writer Scott Beatty and illustrated by Sanford Greene, with inks by Kris Kaufman and colors by Dan Jackson. The story was republished in 2004 as part of Star Wars Tales Volume 4. Although the canon status of stories from Star Wars Tales 1–20 is ambiguous by default, the Er'stacian species, their constant quarreling, and Windu's mission are mentioned in the \"Megalith\" entry of The Complete Star Wars Encyclopedia, published in 2008, indicating that the events of the story did indeed take place in Star Wars canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}