{"url": "Era_of_the_Sith", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Galactic Republic events", "Category:Jedi", "Category:Sith", "Category:Time periods"], "nodes": [{"tag": "h1", "text": "Era of the Sith"}, {"tag": "p", "text": "During the Old Republic's decline, the Sith were able to seize control of much of the known galaxy, ushering in a brief period where the Dark Lords reigned supreme across the stars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the aftermath of the Hundred-Year Darkness, the Sith returned to known space after many years to make war on the Old Republic and the Jedi Order—the ancient enemies of the Sith. For millennia both factions fought against one another, and periods of constant warfare ultimately strained the Old Republic's resources. With the steady collapse of the Republic at hand, the Sith ultimately became the dominant power in the galaxy for a period of time."}, {"tag": "p", "text": "The Sith's rule across the galaxy would ultimately decrease over time. Although the Republic still continued to fall, the Jedi and remnants of the Old Republic would have one final war against the Sith, bringing an end to their despotic reign once and for all, although the Order survived in secret through the Rule of Two."}, {"tag": "p", "text": "One thousand years later, Supreme Chancellor Sheev Palpatine of the Galactic Republic, who was secretly the Dark Lord of the Sith Darth Sidious, transformed his government into the Galactic Empire, declaring himself Emperor in the process. He was an admirer of the Sith Empire and the Sith Lords who ruled it and wished to usher in a renewed period of its rule. He also possessed various artifacts dating back to the days of the dark empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A period of a Sith controlled galaxy is first mentioned by Sheev Palpatine in a scene from the 2005 film Star Wars: Episode III Revenge of the Sith. This time was never specified, as in Legends, which was seen as the official Star Wars canon at the time of the movie's release, had various stories depicting multiple Sith empires throughout the Old Republic era. This was ultimately cleared up after Book of Sith: Secrets from the Dark Side was published in 2012, when, in a segment \"written by\" Darth Sidious, it was stated that he admired the dark lords Malgus and Vitiate of the Second Sith Empire and modeled his vision of the Galactic Empire after the civilization, which was at its height during the Cold War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}