{"url": "Eramuth_Bwua%27tu", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Character stubs", "Category:Bothans", "Category:Galactic Alliance bureaucrats", "Category:Legal professionals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Eramuth Bwua'tu"}, {"tag": "p", "text": "Eramuth Bwua'tu was a male Bothan who served as a respected and successful attorney from the family Bwua'tu, always defending his beliefs, and the uncle of Galactic Alliance Admiral Nek Bwua'tu. In 44 ABY, Bwua'tu represented former Jedi Tahiri Veila in her trial against the Galactic Alliance for the assassination of Admiral Gilad Pellaeon during the Second Galactic Civil War. He had a reputation for being a fair attorney, and his main legal strategy consisted of playing on the sympathies of the jury. He was a part of Club Bwua'tu, an organization comprising of him, his nephew Nek, Wynn Dorvan and Padnel Ovin which was determined to uncover various conspiracies which aimed to cause galaxy-wide anarchy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Career as a lawyer"}, {"tag": "p", "text": "From the Siberian Botanical Bwua'tu family, Eramuth won every case he argued. He is known for his elegant and old-fashioned style, and for being very courteous in manner. While his eccentricities suited him, every detail--from old-fashioned mannerisms aimed at charming a jury, to pretending to sleep through a prosecutor's cross-examination of a witness--was calculated. He represented clients only if he was convinced of their innocence and of his eventual victory. Around the time of the Second Galactic Civil War, he retired to academia. He felt it was an honor to pass his knowledge onto the next generation, especially since he felt that his mind grew better with age."}, {"tag": "p", "text": "He tried at least one previous case against prosecutor Sul Dekkon. When Tahiri asked if he won, he answered \"naturally.\""}, {"tag": "h3", "text": "Representing Tahiri Veila"}, {"tag": "p", "text": "Tahiri Veila, a former Jedi who became the Sith apprentice to Darth Caedus, was sued by Natasi Daala's Galactic Alliance for the assassination of Admiral Gilad Pellaeon. After the court refused to allow Nawara Ven to represent her, and Mardek Mool admitted he wasn't up to the challenge, Jagged Fel's fiancee Jaina Solo convinced him to see that Tahiri had fair representation. The result was Eramuth agreeing to take the case."}, {"tag": "p", "text": "Veila was at first off-put by Eramuth's eccentricities--such as using Flimsi because he preferred everything in hard copy--but she quickly grew to trust his judgment."}, {"tag": "p", "text": "Eramuth wanted the jury to empathize with Tahiri, to understand everything she went through before falling under Caedus' sway. This was punctuated by the theatrical arrival of Anakin Solo look-alike Dab Hantaq while Tahiri was on the witness stand. This was undermined by as the prosecution brought forth surprise evidence: a recording of Pellaeon and Veila, just before he was killed. Eramuth tried every means to prevent the playing of the recording and requested a more detailed examination on the recording."}, {"tag": "p", "text": "During the trial, Lydea Pagorski, a communications officer aboard the Bloodfin, told the court about Pellaeon's death and that Veila was the one who killed him in order for the Moffs to ally with no resistance as his new chief of the empire. Wanted to address the judge as a lawyer, Eramuth refused to believe that and discovered that the recording of the Grand Admiral's death, had not been monitored, but Pagorski lied that Veila stayed with her lover Liyn, who was a member of the security unit, during the the time of the war. Eramuth wanted to find out why Pagorski lied to the court and presented a military data storage, which he had received from Jagged Fel to request for evidence which included a recording. After the recording revealed the conversation between Caedus and Veila, Eramuth accused Lydea for false testimony in the murder trial."}, {"tag": "p", "text": "After an incident at the prison, Eramuth spoke before the next hearing because he wanted to ensure that his client would come out free from this criminal case. In his view, he built his defense on the fact that they had been deliberately lured to a place where they had attacked the former Jedi. He later went with Veila in the courtroom where he applied for a short break in order to discuss things with his client. Although, Tahiri believed that Bwua'tu may have won all the important parts of the process, but the Bothan explains that they now had greater problems. In addition, the acquisition of the Galactic Alliance had caused a negative mood towards the Jedi, as this was considered a monstrous betrayal. After the break, Bwua'tu was talking quietly with Tahiri and was sure that he would win her freedom. Although, Tahiri couldn't risk him to anything for her and apologized."}, {"tag": "p", "text": "Later, Eramuth continued to ease his client's conditions since the Jedi could do nothing to help. When he was about to show a presentation that should help Veila pass the death penalty, the former Jedi sensed danger and ordered Bwua'tu, to go into cover and lay down on the floor. In fact, the institution was attacked shortly by the bounty hunter Boba Fett, who wanted to rid the deposed head of state. While Bwua'tu was unharmed, Tahiri took advantage of the situation and escaped from captivity. Eramuth was shocked by the escape of his client, which almost covered the shame of the case. On the run, Veila planned on returning to Bwua'tu, but she considered that her lawyer would not look good."}, {"tag": "h3", "text": "Against Corruption"}, {"tag": "p", "text": "After the trial, Eramuth Bwua'tu continued to care for his nephew and sat long at the bed of the admiral until the Bothan finally awoke from the coma. He inquired about the welfare of his nephew and also called the adjutant of the injured Rynog Asokaji to himself, who informed him of the change of power at the head of the Galactic Alliance and the slave revolts. Together with Wynn Dorvan, his nephew, and the new head of state, Padnel Ovin, they formed a secret intelligence service called Club Bwua'tu, where they plan to uncover the conspiracy in the government. A little later, Eramuth delivered complete information about Tahiri Veila, while Dorvan entertained with his nephew. He later went to see Leia Organa who was imprisoned after the Jedi left Coruscant. With the intention to assist in a possible court case, he met Ovin, who assured him that all charges would be dropped. Nevertheless, he chatted with the Jedi and told her husband that Leia Han Solo was planning their liberation with the club."}, {"tag": "p", "text": "Following the Liberation on Coruscant, he participated in the meeting of the Jedi Council where he provided information to the Jedi Council. He planned to call an attack on the capital, but the Jedi convinced him not too in which he agreed."}, {"tag": "h2", "text": "Appearances"}]}