{"url": "Eriadu/Legends", "categories": ["Category:Legends articles", "Category:Confederation planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Eriadu Authority planets", "Category:Eriadu locations", "Category:Fortress worlds", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Outer Rim Territories planets on the Hydian Way", "Category:Rimma Trade Route", "Category:Seswenna sector planets", "Category:Sith planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Eriadu"}, {"tag": "p", "text": "Eriadu was the primary world in the Seswenna sector, and one of the Outer Rim's most active trade centers. It sat on the intersection of several hyperspace routes, including the Rimma Trade Route, the Hydian Way, the Lipsec Run, and the Yankirk Route."}, {"tag": "p", "text": "The planet was originally located on the Eriadu Bypass until the Hydian Way was remapped to run through Eriadu (reflecting economic realities) rather than Seswenna. It was an important launch point for ships headed to the Moddell sector, such as the colony ship Free Enterprise in 130 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Eriadu was a terrestrial planet that occupied the fourth position from the star Eriadu in the Eriadu system, at the center of the Seswenna sector in the Outer Rim Territories region of the galaxy. Eriadu served as the capital of the Seswenna sector and was situated at the intersection of the Rimma Trade Route, the Hydian Way, the Lipsec Run, and the Yankirk Route. Possessing a breathable atmosphere, standard gravity, and a single moon, Eriadu was a gray factory world of rugged landmasses and narrow seas whose terrain included industrial cityscape and waste zones. The planet had a day that lasted 24 standard hours, a year that consisted of 360 local days, and diameter of 13,490 kilometers."}, {"tag": "p", "text": "Eriadu's climate was polluted and an orange haze appeared in its lower atmosphere; the world was dominated by heavy industry, and toxic by-products spewed from numerous unregulated factories fouled its air, land, and sea. Most of the inhabited regions on Eriadu were heavily industrialized with blocky, utilitarian architecture. The advanced waste disposal systems, atmosphere scrubbers, and aquifer purifiers that were used on most prosperous worlds were absent on Eriadu. Eriadu Manufacturing, the largest employer on the planet, was by far the greatest polluter, and its processes were directly responsible for much of the environmental damage inflicted on the planet's ecosystem. The rapid industrialization of Eriadu drove most of its native species into extinction; the Eriaduan rat, which thrived in the new environment, was one exception."}, {"tag": "p", "text": "In spite of its pollution issues, Eriadu was an active hub of trade and government in the Outer Rim Territories. Eriadu imported foodstuffs, medicinals, and lommite ore, and exported computer technology, manufacturing, textiles, and droids. Although several droid manufacturers were present, droid labor was uncommon on Eriadu; despite this, at least one EV-series supervisor droid that had been equipped with an MDF motivator instead of the standard EV motivator was used on Eriadu, where, as a result of sadism induced by the MDF motivator, it had the feet of 160 droids melted to a factory floor to prevent them from leaving their work stations. Apartments on Eriadu, rented under false names, were among the off-world assets of House Organa."}, {"tag": "p", "text": "Major cities on Eriadu included its capital, Eriadu City, Phelar and Old Town Factoryville. The planet was also mentioned to have forests. Eriadu was orbited by one natural moon, small shipyards, and several orbital habitats."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "Eriadu fell within space that had been widely explored by the Galactic Republic by the time of the Jedi Civil War and was within Sith-controlled space during the New Sith Wars. Eriadu was known for delicate shellwork jewelry prior to the arrival of the Quintad, an oligarchy of five powerful families of Corulag ancestry, around 900 BBY. Under the guidance of the Quintad, who sought to transform the world into \"the Coruscant of the Outer Rim,\" Eriadu became a manufacturing center with prestigious shipyards. Eriadu also became a rival of the noble houses of the Senex and Juvex sectors, and around 700 BBY, the houses annexed a number of systems that became known as the Ninth Quadrant in an effort to guard against Eriadu's influence."}, {"tag": "p", "text": "Around 130 BBY, the colony ship Free Enterprise departed from Eriadu, carrying several hundred Jinda and Tulgah settlers, before vanishing on its way to Kuna's Eye in the Moddell sector. After retiring from the Republic Outland Regions Security Force to assume a political position on his homeworld, Eriadu native Wilhuff Tarkin won the office of lieutenant governor of Eriadu. Ruling from an ostentatious coastal estate, he quickly immersed himself in Eriadu's political and economic spheres. Tarkin arranged a competition between Lommite Limited and InterGalactic Ore in an effort to keep Eriadu's shipbuilding industries supplied with lommite, but when the two companies raced to deliver their ore to Eriadu, their barges were sabotaged and crashed into each other. The talk show Essence was based on Eriadu by 23 BBY, and in 22 BBY, Eriadu network executives paid for Jonava Billane's transit to the Seswenna sector prior to a scheduled appearance by Billane on Essence."}, {"tag": "p", "text": "Brigadier Gideon Tarkin served as Eriadu's Minister of Security by 22 BBY, when agents of Eriadu Customs and Immigration detained the Tandleroff's Trove while it was passing through Phelar Port and found 144 hailfire droids packaged within the independent starship. Eriadu served as the headquarters of the Eighteenth Army and as a forward position for the Galactic Republic during the Clone Wars due to the presence of significant Separatist forces in the surrounding sectors. The initial Republic defense force received reinforcements in the form of twelve Delta-7 Aethersprite starfighters moved to Phelar Port by the Jedi Council in cooperation with Brigadier Gideon Tarkin, and later skirmishes would result in still greater presence by the Jedi and the Republic military on Eriadu. Eriadu hosted a full fleet under the command of Brigadier Tarkin, who merged various planetary navies into \"priority theaters\" and launched them from Eriadu, and had become the primary Republic staging point for all battles in its quadrant by the time the nearby manufacturing center of Sullust seceded from the Republic in 21 BBY. Around this time, a battle took place over Eriadu between the Republic and a Separatist force under the command of Kaleesh cyborg General Grievous, and during the engagement Grievous slaughtered many clone troopers. Troops from Eriadu would also besiege worlds such as Sluis Van and Xagobah in the Praesitlyn theater."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "Wilhuff Tarkin was granted command of the Seswenna sector upon Palpatine's restructuring of the galactic government, and as a Moff, Tarkin established his administration on Eriadu and made it the sector's capital. Tarkin's decision took advantage of the system's industrial, commercial, and strategic importance and provided a semblance of Core Worlds culture for Imperial and noble representatives from Coruscant who had been posted there. Under Tarkin's rule, Eriadu's manufacturing grew, its exports of technology increased, and corporations with interests there thrived. Tarkin directed the Western Reaches Operation from Eriadu in 17 BBY, and after the campaign concluded, Imperial pilot Shea Hublin was given a marquisate on Eriadu, where he married Eris Harro, the heiress of one of the Quintad Houses. After Emperor Palpatine promoted him to the position of Grand Moff, Wilhuff Tarkin took up residence on Eriadu full-time to oversee his new jurisdiction of Oversector Outer."}, {"tag": "p", "text": "A sizeable underground resistance was present on Eriadu from the outset of the New Order, and after the signing of the Corellian Treaty in 2 BBY, the group became a formal part of the Alliance to Restore the Republic. Due to the threat of Imperial reprisals, however, Rebel agents merely used Eriadu as a base of operations for off-world activity; the large volume of commercial starship traffic allowed insurgents to travel between Eriadu and other locations within the Seswenna sector and other major ports around the galaxy with relative ease. Some time prior to the Battle of Yavin, a Rebel Alliance strike team attacked Grand Moff Tarkin's personal shuttle near Eriadu in a failed attempt to assassinate Tarkin that nevertheless resulted in the liberation of a Mon Calamari slave named Gial Ackbar."}, {"tag": "p", "text": "Upon Wilhuff Tarkin's death in 0 ABY, Ardus Kaine assumed his command over Oversector Outer and relocated its capital from Eriadu to Entralla. Admiral Sander Delvardus refused to follow Kaine and fortified Eriadu, from which he controlled a portion of the Hydian Way and moved Coreward to secure the Rimma Trade Route as far north as Yag'Dhul after the Battle of Endor. Shea Hublin, who had also refused to accompany Grand Moff Kaine, aligned with Superior General Delvardus and his Eriadu Authority, and in 4 ABY, he led a squadron at Chelleya to repel Nagai raiders from Eriadu. Delvardus soon fell out with the ruling families of Eriadu, who wanted him to defend their system's interests instead of positioning toward an invasion of the Core Worlds, and the Eriadu Authority soon disintegrated."}, {"tag": "p", "text": "Eriadu remained within Imperial territory as late as the Thrawn campaign of 9 ABY but eventually became a begrudging member of the New Republic due to economic considerations. Slaves on Eriadu were freed during the ascension of the New Republic, severely harming the Eriaduan economy in the short term; nevertheless, under the New Republic, Eriadu was a key economic power in the Outer Rim and an industrial and commercial center."}, {"tag": "p", "text": "Under the Galactic Empire, the Eriaduans kept non-Human slaves. Eriadu was also the most important Imperial drydock."}, {"tag": "p", "text": "The planet was the homeworld of Grand Moff Wilhuff Tarkin, formerly lieutenant governor of the planet under the Republic, who oversaw the Seswenna Sector and Oversector Outer from the planet under the New Order. After his death, the Tarkin Memorial Conference Center was constructed in Eriadu City, named to honor the late Grand Moff."}, {"tag": "h3", "text": "Yuuzhan Vong War and beyond"}, {"tag": "p", "text": "In 26 ABY, during the Yuuzhan Vong War, the Jedi Corran Horn, Anakin Solo, and Tahiri Veila visited the planet. During their time at Eriadu, Anakin and Tahiri came to the aid of the Rodian Jedi Kelbis Nu who was under attack by Peace Brigade agents. Before Kelbis died, they learned that Yag'Dhul would be attacked by the Yuuzhan Vong because it was where the Corellian Trade Spine and the Rimma Trade Route met."}, {"tag": "p", "text": "Unfortunately, the two Jedi were arrested by Eriaduan judicials and were interrogated by judicial Lieutenant Themion. During the interrogation, Anakin was subject to brutal treatment by Themion until Tahiri came to his aid. Anakin, Tahiri, and Corran escaped Eriadu on the transport Lucre. Eriadu remained a member of the New Republic and the Galactic Alliance, though there was a certain degree of resentment toward the galactic government due to the economic hardships experienced by emancipation of the slaves and the new environmental controls placed on the planet. When it became apparent that Contruum was to be attacked during the Defense of Mon Calamari, two Eriaduan taskforces jumped out of the system, though these may have been individual decisions."}, {"tag": "p", "text": "The Yuuzhan Vong bypassed Eriadu, which emerged from their conflict with greatly enhanced importance and influence. Eriadu was a member of the Confederation during the Second Galactic Civil War, and by 137 ABY, it fell within space controlled by the Galactic Empire of Darth Krayt."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Eriadu City, located in the world's southern hemisphere, was the capital and primary urban center of Eriadu, as well as the site of most of the heavy industry carried out on the world."}, {"tag": "h2", "text": "Population"}, {"tag": "p", "text": "Humans comprised 86% of Eriadu's population of 22 billion. Galactic Basic Standard was spoken on Eriadu. A significant slave population of nearly three billion was present on Eriadu during the time of the Galactic Republic and the Galactic Empire. Eriaduan men tended to wear turbans and beards while women were veiled. Notable Eriaduans included the Tarkin family which played a role in the history of the Galactic Republic and the Galactic Empire. Many if not all Eriaduans were also Humanocentric. The Eriaduan accent was distinctive, and was said to be \"more Core than Core\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}