{"url": "Eris_Harro/Legends", "categories": ["Category:Legends articles", "Category:Eriaduans", "Category:Females", "Category:Individuals of unspecified species", "Category:Journalists"], "nodes": [{"tag": "h1", "text": "Eris Harro"}, {"tag": "p", "text": "Eris Harro was a female individual from the planet Eriadu, who was an heiress of one of the world's Quintad houses. During the early years of the Galactic Empire, Harro worked as reporter for the Eriadu News Service. and in 17 BBY, she traveled to the war-torn planet Kelrodo-Ai along with an ENS news team, to interview the Imperial pilot Captain Shea Hublin of the 77th Air Wing. Hublin was leading a campaign to rid the world of Confederacy of Independent Systems holdout forces as part of the Empire's wider Western Reaches Operation, and he spoke to Harro about the battle. Once she had concluded her interview Hublin, Harro and the rest of the news team quickly departed from the planet."}, {"tag": "p", "text": "Following the conclusion of the Western Reaches Operation, Hublin was granted a marquisate on Eriadu, and he and Harro became married. In 13 BBY, Hublin lost his leg and half of his right arm during a battle, which led Harro to demand that he retire from the Starfighter Corps."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Eris Harro was created by the writer Jason Fry and she first appeared in The Guns of Kelrodo-Ai, a short story that was published in the magazine Star Wars Insider 132 in 2012. The Guns of Kelrodo-Ai was intended to act as a tie-in to the reference book The Essential Guide to Warfare and Harro subsequently received a mention in the reference book itself. However, there is a discrepancy between the two sources regarding the spelling of her name; The Guns of Kelrodo-Ai refers to her as \"Eris Herro,\" while The Essential Guide to Warfare spells her name \"Eris Harro.\" This article uses the spelling given in The Essential Guide to Warfare, because the the guide book was the most recently-released of the two sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}