{"url": "Ernek_Marskan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Blue Squadron personnel", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ernek Marskan"}, {"tag": "p", "text": "Ernek Marskan was a captain in the Alliance Starfighter Corps during the Galactic Civil War. He served as a pilot with Blue Squadron on the Mon Calamari Star Cruiser Independence, participating in many missions during this time. When his younger brother, Casal, was killed during a mission with fellow pilot Keyan Farlander, Marskan blamed Farlander for his death. However, when Marskan confronted the other pilot, Farlander used the Force to choke him. The incident led to animosity toward Farlander from the other pilots. Marksan was later one of several pilots transferred to Yavin 4 for the battle against the Death Star, and among the few pilots to survive."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ernek Marskan was the elder brother of Casal Marskan. He joined the Alliance to Restore the Republic early in the Galactic Civil War, preceding his brother into the Alliance Starfighter Corps. By 1 BBY, Marskan had achieved the rank of captain and was a senior flight leader in Blue Squadron aboard the Mon Calamari Star Cruiser Independence, though he flew with other squadrons when needed."}, {"tag": "p", "text": "After the Galactic Empire launched Operation Strike Fear in response to the Rebel victory at the Battle of Turkana, Marskan was one of several officers involved in the early planning for a Rebel operation to destroy the Imperial-class Star Destroyer Invincible. The Alliance had learned of a powerful Imperial explosive device being transported aboard the BFF-1 bulk freighter Gafra to the Celanon spaceport and was planning a raid to capture it for use against the Invincible. Marskan was concerned that Celanon was too well defended for a raid to succeed. His opinion was shared by the Independence's mission planner, Commander S'man, who decided to launch the raid at a deep-space transfer zone along the Gafra's course to Celanon. The mission was a success and the Rebels were later able to smuggle the explosive aboard the Star Destroyer and detonate it, destroying the vessel."}, {"tag": "p", "text": "Following the defeat of Operation Strike Fear, as the Rebels searched for more information about the Death Star, the Imperial-class Star Destroyer Intrepid's hyperdrive was damaged in an accidental collision with an EF76 Nebulon-B escort frigate, leaving it stranded in the Circarpous system. A Rebel team of BTL Y-wing starfighters, led by Keyan Farlander and escorted by Marskan in a T-65 X-wing starfighter, were sent to destroy a group of Imperial reinforcements before they could reach the Star Destroyer. Marskan arrived late and his performance was reckless, frequently targeting the same ships as the Y-wings, putting his allies in danger. The mission was a success, nevertheless, allowing the Rebels to mount a subsequent attack that destroyed the Star Destroyer. However, following Marskan's poor performance, the Independence's briefing officer, Commander Lagrane, promised Farlander that Marskan would receive an official reprimand, but Farlander asked him to go easy on the pilot as everybody makes mistakes."}, {"tag": "p", "text": "Shortly before the Battle of Yavin in 0 BBY, Marskan was one of several pilots in the ready room aboard the Independence when Farlander entered, having lost his wingmate, Breth Gart, in a previous mission. Captain Samuel Raider went to console Farlander and was clearly surprised when the other replied that Gart simply hadn't been strong enough to survive. The incident was one of the first signs of a growing change in Farlander. The pilot quickly became increasingly militant, taking a group of rookie pilots under his wing and encouraging them to act aggressively in combat. Among his followers was Marskan's younger brother, Casal, having recently followed Marskan into the Alliance."}, {"tag": "p", "text": "When Casal was killed flying a mission with Farlander a few days later, Marskan blamed the other for his brother's death. He confronted Farlander as he emerged from a debriefing, shoving him against a wall, gripping his throat, and moving to strike him. Farlander used the Force to make Marskan release him, before closing his windpipe and choking him. Marskan clutched uselessly at his throat before Farlander, shocked by his own actions, finally released him. Scared and angry, Marskan fled to the ready room, where he told several other pilots, including Raider and Speedy, what had happened, creating hostility toward Farlander from the others."}, {"tag": "p", "text": "Shortly after Marskan's confrontation with Farlander, the Independence traveled to the Alliance's base on Yavin 4 to assist in the preparations for an expected attack from the Death Star. Marskan, along with several other pilots including Raider and Farlander, was transferred to Yavin Base upon arrival. The Death Star arrived in the Yavin system soon after the Rebels, but the Alliance pilots succeeded in defeating the Imperial battlestation due to the efforts of the rookie pilot Luke Skywalker. Marskan was among the survivors of the Battle of Yavin, as was Farlander. However, despite Farlander apologizing for his actions, Marskan continued to hate him for his part in Casal's death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Marskan was a competent pilot who, despite at least one reckless performance, was generally considered reliable in combat. While he was friendly with the other pilots aboard the Independence, his relationship with Farlander was strained by the other pilot's role in his brother's death, which left Marskan angry to the point where he attacked Farlander, though Farlander's use of the Force easily defeated him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ernek Marskan was created by Rusel DeMaria for the 1993 book X-Wing: The Official Strategy Guide, which presented the story of Keyan Farlander, the player character in the game Star Wars: X-Wing. In the book, Marskan is established as one of the previously unidentified pilots aboard the Independence. While writing the 2012 reference book, The Essential Guide to Warfare, author Jason Fry considered Marskan as one of several candidates for the role of Red Twelve, a previously unidentified Rebel pilot whose death at the Battle of Yavin is depicted in Star Wars: Episode IV A New Hope. Fry and Leland Chee, keeper of the Holocron continuity database ultimately rejected Marskan in favor of another character from X-Wing: The Official Strategy Guide, Puck Naeco. X-Wing: The Official Strategy Guide had previously established that Marskan survived the Battle of Yavin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}