{"url": "Erv_Lekauf", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Erv Lekauf"}, {"tag": "p", "text": "Erv Lekauf was a lieutenant in the Imperial Army who served as Darth Vader's personal aide for several years. On a mission to Vohai in 19 BBY, Lekauf helped Vader fight the Emperor's Hand Sa Cuis, impressing the Dark Lord with his courage and loyalty. Vader had him cloned as part of a new Imperial project, and Lekauf took over the training of the six clones made of him. On a trip back to Coruscant in 18 BBY following the completion of the cloning program, Lekauf and his clones helped defeat the rogue Emperor's Hand Sheyvan and six Force-sensitive clones of Sa Cuis. Though Lekauf was badly burned during this fight, he survived. Following the completion of his career with the Empire, Erv Lekauf helped raise his grandson Jori Lekauf, who would serve in the Galactic Alliance Guard several decades later."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "A Human male, Erv Lekauf was a lieutenant in the Imperial Army. In addition to his Imperial career, Lekauf was married and had a child. He was the aide of Darth Vader, and one of his few trusted subordinates. In 19 BBY, Lekauf accompanied Vader on a mission to Vohai. Vader was intent on speaking with the head of Arkanian Microtechnologies, hoping to find new cloning technologies. When the two arrived there, they were ambushed by several assassins with Thunderbolt repeating blasters. Vader easily defeated the assassins, with the aid of Lekauf, who defied Vader's orders by shooting at the assassins in an attempt to help the Dark Lord. Though Lekauf had disobeyed him, Vader was not upset. Instead, he was pleasantly surprised that Lekauf would go so far as to ignore his orders to protect him, noting that he almost never saw such loyalty from any of his subordinates."}, {"tag": "p", "text": "As a result of the assassination attempt, Vader ordered the execution of the head of the company, Tef Shabiak, claiming Shabiak needed to ensure that he had better security. Later, Vader was attacked by a strange man wielding two lightsabers, who introduced himself as Sa Cuis. Vader realized that he was an Emperor's Hand, and believed that his Master, Emperor Palpatine, had sent Cuis to kill him. Though Lekauf attempted to help his master, Vader held him back, knowing this was his mission alone. Vader dueled Cuis, overpowering him into submission, demanding that Cuis tell him who had sent him. In his interrogation of Cuis, Vader Force choked him, hoping to learn his motive. However, Cuis still would not reveal his master, although Vader felt sure it was Palpatine. Impressed with Cuis's loyalty, he had tissue samples of the Emperor's Hand taken before he killed him. These samples would be grown into six clones of Sa Cuis. Vader was also pleased with Lekauf; the courage he had shown, as well as a firm willingness to protect his master, impressed Vader so much that he ordered that clones be made of his aide as well. Lekauf felt honored by this request."}, {"tag": "h3", "text": "Assistant to the Dark Lord"}, {"tag": "p", "text": "In 18 BBY, over six months after the inauguration of the Empire, Vader had Lekauf investigate records from the Clone Wars, seeking to learn more about the Jedi and the success rate of Order 66, in which clone troopers had turned against their Jedi Generals under Supreme Chancellor Palpatine's orders. When Lekauf discovered the report from Felucia, he found that the 327th Star Corps had executed two Jedi to apparently stop them from poisoning the planet's water. Vader questioned Lekauf as to whether any Padawans were listed as being stationed there. When Lekauf told him that there were no records of a Padawan on Felucia, the Dark Lord had his aide find clone troopers who had served on the world. Lekauf located two troopers: CC-5052 and CT-6734, now on Yutusk. Vader then contacted them, enlisting them in his hunt for the fugitive Jedi Drake Lo'gaan—a Jedi who was on the planet during the Battle of Felucia—whom Vader had been searching for earlier."}, {"tag": "p", "text": "A year after the mission to Vohai, when the first six clones of him were old enough, Lekauf traveled to Yinchorr, where he spent the next six months training them. One of the things he taught them was the art of sword combat, something they practiced against the Cuis clones, who had been trained by the Emperor's Hand Sheyvan. Due to their Force-sensitivity, the Cuis duplicates usually won in training combat, although that did not discourage Lekauf. The Emperor came to view the progress, watching Lekauf teach his clones. After several months, Palpatine concluded that the training was complete, and decided to head back to Coruscant with Vader, Sheyvan and the clones. Eager to get back to his family, Lekauf was allowed to come too."}, {"tag": "p", "text": "While aboard a Lambda-class shuttle headed back to Imperial Center, Lekauf and his clones were forced to battle Sheyvan and the six duplicates of Sa Cuis. The Cuis clones, led by the dissident Sheyvan, had rebelled against Palpatine and Vader and taken control of the ship. Though Sheyvan attempted to turn Vader against Palpatine, whom he saw as a traitor, the Dark Lord took the fight to the rebels."}, {"tag": "p", "text": "Armed with flamethrowers, Lekauf and his clones burst into the cockpit and fought the Cuis copies alongside Vader. During the fight, Lekauf was badly burned by a ball of fire deflected by one of the Cuis clones with a lightsaber. The flame was aimed at Vader, and the lieutenant threw himself in front his master in act of extreme dedication. Though Sheyvan and the six Cuis replicas were killed, Lekauf was badly wounded. He did survive, however, thanks to Vader who comforted Lekauf and called for the pilot, Pepin, to retrieve bacta patches. Once on Coruscant, Lekauf underwent bacta treatments. Despite his burns, he survived to see his family. Impressed with Lekauf, Palpatine planned to have more clones made of him."}, {"tag": "p", "text": "After this incident, Lekauf lived his life with his family, helping to raise his grandson, Jori Lekauf. By 40 ABY, Lekauf had passed away. That same year, his grandson Jori became a corporal in the Galactic Alliance Guard. Jori once recounted to fellow Guards Ben Skywalker and Jacen Solo that his grandfather had thought very highly of Darth Vader, also informing Solo that Lekauf had essentially raised him, and that he looked up to his grandfather more so than he looked up to his parents."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lekauf was extremely loyal, to both Darth Vader and the Galactic Empire. He risked his life in multiple instances to defend his master, who admired this loyalty and rewarded Lekauf for it. As a result, Lekauf grew even more willing to defend Vader. Lekauf was also brave, as shown by his actions in the fights on Vohai and aboard the shuttle. He was able to see the good in Vader, even admiring him. Lekauf was proud of the fact that he had been chosen as a possible cloning template, and he worked hard to teach his clones, striving for perfection. Lekauf especially loved his family and cared for them, particularly his grandson Jori, on whom he had a strong influence. Jori believed that his grandfather had raised him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Erv Lekauf was created by Karen Traviss and was named after Ryan Kaufman. Lekauf's mutilation was partially a \"retaliation\" for Kaufman killing off the Jedi Master Traavis (named for Traviss) in the short story Orders."}, {"tag": "p", "text": "Lekauf first appeared in the Traviss short story In His Image, where he served as Darth Vader's aide, someone whom Vader evidently cared for. He later appeared in Evasive Action: End Game and A Two-Edged Sword, again as the Dark Lord's adjutant. His grandson Jori was introduced in the Star Wars: Legacy of the Force series, in which he identifies Lekauf as having a strong influence on him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}