{"url": "Escape_from_Balis-Baurgh", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal fiction"], "nodes": [{"tag": "h1", "text": "Escape from Balis-Baurgh"}, {"tag": "p", "text": "Escape from Balis-Baurgh is a short story by Paul Balsamo, which was published in Star Wars Adventure Journal 1 by West End Games in February 1994. It tells the story of an Ewok called Grael and Junas Turner who are captured by the Galactic Empire and sent to the fully automated prison colony of Balis-Baurgh. The short story is notable for being narrated in first person from the perspective of an Ewok who has no understanding of advanced technology."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Grael the Ewok tells a story to his son Ponto before bed. In this story Grael goes hunting for a Yootak, and instead discovers a Alliance to Restore the Republic member, Captain Junas Turner. At first thinking Junas was just a particularly intelligent animal, Grael convinces him to follow back to the Tribe Panshee village. Before they can arrive, however, they are captured by Stormtroopers."}, {"tag": "p", "text": "The rebel and the Ewok are taken to Balis-Baurgh, an Imperial prison. At first overwhelmed by all that he sees, Grael slowly begins to learn Galactic Basic Standard and understand the workings of the prison, which is mostly automated by droids under the command of a 4XB Programmer Droid. Grael is introduced to two more captured rebels, Lon and Becker, and becomes convinced that Tribe Panshee should support \"Tribe Rebellion\" against \"Tribe Empire\". Junas tells Grael that the Empire is building a terrible weapon near Endor, and that he must get news of it back to the Rebellion."}, {"tag": "p", "text": "Grael is able to duplicate the command tones of the 4xB using his pan flute, and escape with Junas, but they are forced to leave Lon and Becker behind in order to get news of the Death Star to the Rebel Alliance. They deliver the information to the Rebels, and return to Endor in time for the victory celebration."}, {"tag": "p", "text": "Grael ends his story to his son, and heads to bed. In the morning, he and Junas will attempt to rescue Lon and Becker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}