{"url": "Escape_from_Darth_Vader", "categories": ["Category:Real-world articles", "Category:Wookieepedia former Good articles", "Category:World of Reading: Level 1"], "nodes": [{"tag": "h1", "text": "Escape from Darth Vader"}, {"tag": "p", "text": "Escape from Darth Vader is a young-readers story from Disney–Lucasfilm Press, released on September 16, 2014. Written by Michael Siglain, with illustrations by Stéphane Roux, it tells the story of the opening events of Star Wars: Episode IV A New Hope, from the Rebel Alliance vessel Tantive IV being pursued by the Imperial Star Destroyer Devastator to the droids R2-D2 and C-3PO escaping and landing on the desert planet Tatooine, the former carrying secret plans to the Empire's Death Star battle station."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "C-3PO and R2D2 [sic] must keep Darth Vader from discovering the Rebels' secret plans! This fully-illustrated level 1 reader retells the classic scenes from A New Hope where the droids crash land on the desert planet of Tatooine and meet a young farmer named Luke."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A Rebel vessel carrying Princess Leia Organa is under attack by a larger spaceship. Organa is in possession of secret plans for an Imperial battle station. R2-D2, a specialized droid, desperately seeks the princess, who moves swiftly to escape a boarding party sent by the Empire. Meanwhile, a droid of another type, C-3PO, worries that everyone aboard the vessel is doomed."}, {"tag": "p", "text": "Organa evades pursuing troopers and provides R2-D2 with the secret plans to keep them from falling into the hands of the feared Sith Lord Darth Vader. She is soon captured by the pursuing troops and taken to Vader but does not reveal the plans' whereabouts. C-3PO finds R2-D2, and together the two board an escape pod, which lands on a sandy planet. Having escaped Vader with the secret plans, they begin a new journey that will bring them into contact with Luke Skywalker, Obi-Wan Kenobi, Han Solo, and Chewbacca."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "On April 25, 2014, Lucasfilm announced a new storytelling structure for the Star Wars franchise, wherein past titles considered part of the Expanded Universe would be rebranded as Star Wars Legends, while new releases would form a new continuity of canon. Escape from Darth Vader, a thirty-two-page fully illustrated book written by Michael Siglain and illustrated by Stéphane Roux, was published on September 16, 2014, making it part of the new canon."}, {"tag": "p", "text": "The title, designed for readers ages 6-8, retells situations and events previously depicted in full in the original Star Wars film. Amazon Digital released an electronic edition on October 7, 2014, and Egmont issued a U.K. edition on June 4, 2015."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Escape from Darth Vader is part of a series of Star Wars titles under the World of Reading banner that retell events from the original trilogy in a format suitable for the youngest audiences. Other titles in the series include Use the Force!, Rescue from Jabba's Palace, and AT-AT Attack!, all of which were published in 2015."}, {"tag": "p", "text": "Escape from Darth Vader is also one of eleven stories published within 5-Minute Star Wars Stories, a December 2015 compilation from Disney–Lucasfilm Press featuring at least one story focused on events from each of the films in the Star Wars saga series to date. This new version of the story is credited as being authored by Brooke Dworkin. It retains the same basic narrative and illustrations by Stéphane Roux but uses somewhat more complex language, as well as direct quotations from the film not featured in Siglain's version."}, {"tag": "p", "text": "Escape from Darth Vader is included in the compendium book 3 Out-of-This-World Tales!, published on August 29, 2017. The title also include the stories AT-AT Attack! and Ewoks Join the Fight, along with an accompanying CD narration."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Overall reception to Escape from Darth Vader by reviewers has been positive. As of December 15, 2016, the title had received seventy-seven customer reviews at Amazon.com, with an overall rating of 4.7/5 stars. Reviewers describe the story variously as a \"well-written recounting\" and \"a story that has lured my young daughters away from helpless princesses.\" Mundie Kids, a book review site written by a mother, featured a positive review, which stated, \"This is a book I wish I had, had [sic] for my son when he was learning how to read.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}