{"url": "Escape_from_Dagu", "categories": ["Category:Real-world articles", "Category:Canceled novels", "Category:Clone Wars novels"], "nodes": [{"tag": "h1", "text": "Escape from Dagu"}, {"tag": "p", "text": "Escape from Dagu was a canceled Clone Wars novel written by William C. Dietz with cover art by Dave Seeley. It was to cover Shaak Ti leading a mission to rescue Republic clone trooper prisoners of war from the planet Dagu, where they were being held captive by Dark Acolyte Artel Darc. It was to be published in March 2004, and was set 9 months after the First Battle of Geonosis. The book was to be part of the Clone Wars multimedia project."}, {"tag": "p", "text": "The story was apparently completed when it was decided to scrap it in favor of Yoda: Dark Rendezvous, due to the greater public appeal of Yoda. However, Darc, Dagu, and Shaak Ti's mission were referenced in Republic HoloNet News Core Edition 14:3:22 and The Official Star Wars Fact File 116, making the general storyline of Escape from Dagu still canon within the continuity of Star Wars Legends."}, {"tag": "h2", "text": "Official site description"}, {"tag": "p", "text": "William Dietz, author of the Dark Forces novellas, returns to Star Wars with Escape from Dagu. In the paperback novel, due out March 2004 from Del Rey, the Jedi Shaak Ti attempts to liberate Republic prisoners of war caught behind Separatist lines."}, {"tag": "p", "text": "The shroud of the dark side has fallen and the Clone Wars have begun. Thousands of solar systems are defecting to the Separatists' Confederacy of Independent Systems, led by the charismatic fallen Jedi Master Count Dooku. But the threat to the Galactic Republic does not end there, for the malevolent Count answers to a shadowy Sith Lord—onewho harbors his own sinister agenda."}, {"tag": "p", "text": "The swamp planet Dagu, a remote place where the Confederacy has chosen to build a military base using prisoners of war, seethes with discontent. The slave laborers, including clone troopers, are determined to escape—and the native reptilian Rybets [sic] have sworn to regain their freedom."}, {"tag": "p", "text": "Count Dooku has learned that among the prisoners is a courier with information that could bring down the Republic. Dooku has selected Artel Darc, a most cunning and capable Dark Jedi, to apprehend the courier. But Artel Darc doesn't know that Shaak Ti, the legendary Jedi Master, is among the prisoners. Nor can he fathom how awesome a weapon the desire for liberty can be—even against seemingly impossible odds."}, {"tag": "h2", "text": "External links"}]}