{"url": "Escape_from_Fest", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Battles in the Atrivis sector", "Category:Battles of the Seerdon Campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Escape from Fest"}, {"tag": "p", "text": "The Escape from Fest, also known as the raid on Fest, was a ground battle between the Alliance to Restore the Republic and the Galactic Empire that took place during the Galactic Civil War. The battle was initially an Alliance Special Forces mission to steal three All Terrain Personal Transports from the Imperial research lab on Fest. When their cover was blown and the squad was trapped, Rogue Squadron intervened and extracted them safely."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "While the Taloraan operation was taking place, a team of Rebel commandos attacked an Imperial Weapons Research Facility on Fest and liberated a squad of AT-PT walkers. The AT-PTs attempted to make their escape, with Imperial troops and armor in pursuit. However, they soon found themselves trapped as the main gate of the complex was raised, cutting them off from their escape route."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Rogue Squadron deployed to Fest to aid in the escape immediately after completing their mission at Taloraan. The Rogues split up to simultaneously bring down the main gate, as well as to cover the commandos' retreat. When the AT-PTs were liberated, the squadron aided them in blasting their way through the Imperial defenses. In a fierce battle against Imperial AT-ATs and XR-85 tank droids, the Rogues and the commandos successfully punched their way through to the landing zone."}, {"tag": "p", "text": "In a final attempt to stop the AT-PTs, the Imperials sent in a wave of TIE/sa bombers to carpet-bomb the walkers. The Rogues managed to repulse this final attack as well, allowing the commandos to reach the safety of the Rebel's Y-4 Raptor-class transport."}, {"tag": "p", "text": "When the commandos were away, the squadron turned back to finish off the Fest research facility. After attacking the DSS-02 shield generator situated in an outlying outpost and bringing down the protective shield, the Rogues razed the building with concentrated fire."}, {"tag": "p", "text": "During the bombardment, Rogue Squadron did a detour to retrieve seeker proton torpedoes in close proximity to the research facility proper."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Moff Kohl Seerdon was infuriated by the incident, and in retaliation blockaded Chandrila, Mon Mothma's home planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Escape from Fest appears in a level of the 1998 video game Star Wars: Rogue Squadron, the player is required to use the harpoon and tow cable of a T-47 airspeeder against an AT-AT in order to complete the mission successfully. As the Battle of Fest takes place in the timeline prior to the Battle of Hoth, during which Luke Skywalker supposedly devised the strategy for downing the four-legged walkers, this element of the mission may be non-canon and chalked up to game mechanics."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}