{"url": "Escape_from_Kalaan", "categories": ["Category:Legends articles", "Category:Battles in the Churnis sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Escape from Kalaan"}, {"tag": "p", "text": "In 3 ABY, Brenn Tantor and Luke Skywalker were freed by Tantor's stormtrooper unit in the Escape from Kalaan."}, {"tag": "p", "text": "During the course of the Massacre on Abridon, Skywalker was captured by Imperial general Tantor and his forces. Skywalker was sent to Kalaan, where he was imprisoned while awaiting transfer to Coruscant and the Sith Lords who awaited him there."}, {"tag": "p", "text": "Later in the battle, Tantor refused an order from his superior, Grand General Malcor Brashin, to raze a refugee camp. Tantor was stripped of command and sent to the prison on Kalaan."}, {"tag": "p", "text": "Once on Kalaan, Tantor was put in an outdoor cell and informed by Brashin that in the morning, he would we tried, found guilty, and executed. Unknown to Brashin, several factors conspired to foil his plans."}, {"tag": "p", "text": "First, Tantor had contacted the Rebel Alliance on his way to Kalaan and arranged with General Tyr Taskeen to defect. When Tantor made it there, Taskeen was ready for him. A small base and several takeoff-ready shuttles waited for Tantor only a short distance from the Imperial base."}, {"tag": "p", "text": "Second, Brashin made the mistake of assigning a unit of Tantor's own stormtroopers to guard him. The ten stormtroopers were strongly loyal to the commander who had led through battle after battle, and it was not difficult for Gana Lant to convince his nine comrades to free their general."}, {"tag": "p", "text": "When Brashin left Tantor's cell, Lant arrived, informing Tantor that his guards were ready to defect. Freed by Lant, Tantor hijacked the Tracked Mobile Base, a heavily armored command crawler. He directed Lant's men to storm the prison, freeing Skywalker. With the combination of his own military skills, the Jedi hero Skywalker, the prototype TR-MB, and the unit of stormtroopers, Tantor finally felt that he was in a strong enough position to defect."}, {"tag": "p", "text": "The group set out down Kalaan's barren valleys, but couldn't leave the prison without triggering the alarm. Alerted, several Imperial patrols joined the turrets that dotted the canyon walls as threats."}, {"tag": "p", "text": "Nevertheless, Tantor was able to overcome the patrols and capture the turrets with the aid of several native Kalaanite resistance fighters and the AT-ST walkers they had captured. After carefully making their way through the valleys, Tantor and Skywalker arrived at Taskeen's base safely. From there, they and their squad were airlifted to Taskeen's fleet, where Skywalker was welcomed back to the Alliance and Tantor was imprisoned until he could prove that he was not an Imperial plant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}