{"url": "Escape_from_Hoth", "categories": ["Category:Real-world articles", "Category:The Hoth Cycle"], "nodes": [{"tag": "h1", "text": "Escape from Hoth"}, {"tag": "p", "text": "Escape from Hoth is the sixth and final Force Pack in The Hoth Cycle for Fantasy Flight Games' Star Wars: The Card Game. It was released on September 20, 2013."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "It is a desperate time for the Rebel Alliance. The Battle of Hoth has turned against the Rebels and their allies. Their base has been breached by Imperial snowtroopers while a fleet of Star Destroyers waits to make sure no ships slip free of the Hoth system. While General Veers pilots his massive AT-AT walker against Echo Base's primary shield generator, Luke Skywalker, Han Solo, and Princess Leia Organa seek to buy time—and hope—for the Rebel evacuation…"}, {"tag": "p", "text": "Escape from Hoth is the exciting final Force Pack in The Hoth Cycle for Star Wars™: The Card Game! The balance of the Force turns to the dark side in Escape from Hoth as it gains three of the Force Pack's five new objective sets, including one that introduces the Super Star Destroyer, Executor. However, even as the dark side looks to deploy this incredible Vehicle and hunt down the rag-tag remnants of the Rebellion with hired bounty hunters, the light side isn't yet ready to concede defeat. Light side players can take hope from the arrival of several iconic new units, including a new Rebel Alliance version of Han Solo!"}, {"tag": "p", "text": "At the end of The Hoth Cycle, the siege on Echo Base and the cycle's focus on the Hoth trait come to a dramatic close. Will this Force Pack see the end of the Rebel Alliance and its allies? Or will Luke, Leia, Han, and the light side's other key champions escape from the frozen planet to plan their next strike and keep the fires of freedom lit?"}, {"tag": "h2", "text": "Card list"}, {"tag": "p", "text": "65. Heat of Battle \n170. Target of Opportunity \n185. Snowspeeder \n216. Tauntaun \n236. Battle of Hoth \n300. A Hero's Resolve \n301. Luke Skywalker \n302. Evacuation Procedure \n303. Han Solo \n304. Toryn Farr \n305. Bright Hope"}, {"tag": "p", "text": "306. Buried Outpost \n307. The Executor Arrives \n308. Executor \n309. ISB Liaison \n310. Sith Holocron \n311. Aggression \n312. Hunt Them Down \n313. Dengar \n314. Kihraxz-class Assault Fighter \n315. Remote Hideout \n316. Endless Reserves \n317. Vast Resources"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}