{"url": "Escape_from_Eshkrene", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Battles of Kesh"], "nodes": [{"tag": "h1", "text": "Escape from Eshkrene"}, {"tag": "p", "text": "The Escape from Eshkrene occurred in 2974 BBY when the Lost Tribe anarchist Parlan Spinner stole the \"great weapon\" from the Doomed—the descendants of ancient Jedi and Dark Jedi who had settled on Kesh following the Great Calamity. The \"great weapon\" turned out to be the ancient Dark Jedi Remulus Dreypa who was sealed within an oubliette."}, {"tag": "p", "text": "Spinner wanted to settle scores against the Lost Tribe and managed to convince the surviving Keshiri crew to escape from prison and steal the \"great weapon\". They then managed to escape Eshkrene aboard the Southern Star, a wooden sailing ship. However, they were pursed by the Doomed leader Kaliska and the Sith princess Takara Hilts. Spinner broke open the oubliette, releasing Lord Dreypa. Spinner and the crew then pledged allegiance to the ancient Dark Jedi and took Kaliska and Hilts captive."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Following the conquest of Alanciar in 2975 BBY, the Sith Tribe gained access to a continent that was rich in lumber. The Alanciari had a maritime culture and had experience with building large wooden sailing ships that were capable of long-distance travel. Grand Lord Varner Hilts theorized that the Sith Tribe had not been the first offworlders to come to Kesh since the Tribe had been so easily accepted by the native Keshiri. Hilts wanted to discover the origins of the legends behind the Protectors and the Destructors, powerful gods in Keshiri mythology. He sent an Alanciari ship, the Southern Star, under the command of the Alanciari captain Chegg to explore Eshkrene, the planet's southern polar continent. Among the crew were the Sith outcast Parlan Spinner, who had been given a \"second chance\" following a failed assassination attempt against Varner Hilts, and Hilts' own daughter Takara Hilts, who had secretly stowed aboard."}, {"tag": "p", "text": "Spinner and Hilts became tired of the harsh working conditions aboard the Southern Star where they were treated by the Alanciari crew as \"slaves\". After the Alanciari ship landed on the frozen shores of Eshkrene, the two Sith attempted to sneak back aboard the ship, hijack it, and travel to Alanciar. However, they were spotted by Chegg who ordered his crew to execute the slaves for mutiny. The two Sith were pursued by the Alanciari and eventually stumbled at the foot of a hill. Chegg and his crew caught up with them and attempted to execute the two Humans. However, their Alanciari pursuers were killed by arrows fired by members of the Doomed, the descendants of Force-sensitive Jedi and Dark Jedi who had become stranded on Kesh following the Hundred-Year Darkness. The Doomed then took the two Sith and the remaining Sith crew and their ship into custody."}, {"tag": "h3", "text": "Captives of the Doomed"}, {"tag": "p", "text": "The Keshiri crew were imprisoned at an undisclosed building in the City of the Doomed. Meanwhile, the two Sith Spinner and Takara were taken by their Doomed captors to the Hall of Regret, the Doomed's main place of worship. On the way, Spinner and Takara attempted to escaped but were restrained by the Doomed. Their leader was a S'kytri woman who introduced herself as Kaliska. She explained that she could not allow the Keshiri explorers to find Eshkrene but that they could not stand by and watch any harm befall Takara and her \"Protector\" Spinner. During their time in the Hall of Regret, Kaliska told the two Sith visitors about the history and origins of the Doomed."}, {"tag": "p", "text": "The Doomed were the descendants of Dark Jedi and Jedi who had become stranded on Kesh following the Hundred-Year Darkness. Several Dark Jedi had been exiled following the Battle of Corbos to the Stygian Caldera where they established the first Sith Empire. However, a group of Dark Jedi had sought to return to the wider galaxy and seek vengeance against the Jedi and the Galactic Republic that had expelled them. These Dark Jedi came into contact with a Jedi patrol that was guarding the Stygian Caldera. Many of these Jedi were Corbos veterans and were eager for revenge as well. The Jedi pursued the Dark Jedi's starship to Kesh. The Jedi were unable to call for help since the planet's strange magnetic field interfered with their signals."}, {"tag": "p", "text": "The Dark Jedi and their Jedi pursuers fought a great battle on Kesh, which would remembered by later generations of Keshiri as the Great Calamity. The Dark Jedi unleashed their Leviathans, monstrous \"great weapons\" which scarred the planet's surface. This became the source of the Keshiri legends about the Protectors and Destructors. This occurred about two thousands prior to the arrival of the Lost Tribe of Sith on Kesh in 5000 BBY. Kesh was almost destroyed during this conflict but both sides including the Dark Jedi began to tire of the destruction they had caused. In the end, the two sides agreed to make peace and the Dark Jedi agreed to seal away their \"greatest weapon\". As a result, the \"great atonement\" began and the two former enemies migrated to Eshkrene."}, {"tag": "p", "text": "There, in Kesh's South Pole, the two groups worked to achieve \"true neutrality\" in the Force. Over time, this offworld community became known as the Doomed. They consisted of individuals from various species including S'kytri, Wookiees, Chagrians, Ithorians, Rodians, Twi'leks, and Weequays. For the next four millennia, they kept a watchful vigil on the Keshiri and the Lost Tribe. They also guarded their \"great weapon\" from anyone who would use it for threatening the Keshiri. The Doomed regarded the Force as a curse and no member of the community was allowed to leave Kesh as long as anybody among them had the ability to use it."}, {"tag": "p", "text": "While Takara was able to understand and sympathize with the Doomed, Spinner was cheeky and insolent towards his hosts. He sat on their holy reliquary and expressed his interest in seeing the \"great weapon\" for himself. In response, Kaliska ordered the Doomed to imprison him with the sailing ship's crew while they decided what to do. While the explorers could never go home, they could not join them since they could not use the Force. She feared that she may have to treat them like any other natural predators. Meanwhile, Takara expressed her interest in staying and learning more about the Doomed. Kaliska consented and took her on a tour of Eshkrene's \"greatest treasure\", which turned out to be their stables and farm animals."}, {"tag": "h3", "text": "The great escape"}, {"tag": "p", "text": "Later, Parlan Spinner managed to sneak out of his prison and kill the three Doomed sentries with his shikkar glass blade. He had created the blade from pieces of a broken lantern. He then stole the fallen sentries' metal blades and headed towards the city's tower, which he reasoned was where the \"great weapon\" was stored. Spinner's escape was not noticed by the other Doomed because the city was preoccupied with morning meditation. Spinner used his Force abilities to leap over the buildings and then used his metal knives to climb the tower. He managed to enter the top chamber through a triangular window and wounded the guards with his metal knives. The guards had been looking away from the window and were caught by surprise."}, {"tag": "p", "text": "Upon entering the chamber, Spinner saw that the \"great weapon\" was sealed within a black oubliette, a stasis casket where beings were kept in suspended animation. Since the oubliette was too heavy for him to carry alone, he decided to free the rest of the Keshiri crew from the Southern Star. The Weequay guard overheard Spinner talking and begged him not to open the oubliette. Spinner responded that he was not going to waste it on the \"Doomed\" but was going to use it to settle scores with people back home in Keshtah Minor. Spinner returned with Keshiri crew and they lowered the weapon from the tower onto a sledge. They then seized back control of the Southern Star and overpowered the token Doomed force guarding the ship."}, {"tag": "p", "text": "By the time that the Doomed found out that their prisoners had escaped with the \"great weapon\", the Southern Star was already sailing into the open seas. The Doomed sounded an alarm and Kaliska and Takara were forced to end their tour of the Doomed's stables early. Based on the footsteps outside of the tower, the sentries deduced that the crew had lowered the \"weapon\" from the tower on a sledge and escaped while the city was still in morning meditation. Kaliska regretted not burning the Keshiri ship immediately and ordered all warriors to assemble at the harbor. Takara managed to convince Kaliska to allow her to reason with Spinner. The winged Kaliska then flew with Takara in pursuit of the Southern Star."}, {"tag": "p", "text": "They eventually managed to catch with the ship and landed on its deck. Takara attempted to reason with Spinner, saying that the \"great weapon\" was sealed for a reason. However, Spinner ignored her and state that he was not a slave of the Tribe anymore. He also boasted that there was no weapon he could not use and expressed his interest in seeing what the \"great Jedi\" were so afraid of. Spinner smashed the oubliette's surface with a hammer which triggered a small explosion which disabled the oubliette. This explosion released clouds of vapor. The \"great weapon\" turned out to be the ancient Sith Lord Remulus Dreypa, who was a Corbos veteran and had helped formed the Sith Order. Spinner and the Keshiri crew immediately allied themselves with Dreypa while Takara and Kaliska were imprisoned below deck."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "After several days of sailing, the Southern Star arrived at the port of Eorm, in southern Keshtah Minor. Lord Dreypa made Spinner his de-facto lieutenant and the latter updated him about all the events that occurred on Kesh over the past four millennia. While Dreypa was determined to return to the stars and wreak vengeance against the Jedi and the Republic, he agreed to help Spinner lead a slave rebellion against the Lost Tribe of Sith, whom he condemned for not following the true Sith path. Dreypa and Spinner invaded Eorm and killed the local Sith Lord Galathos. They then rallied the local slaves to their cause and began preparations to march on Tahv."}, {"tag": "p", "text": "While Dreypa and Spinner had planned to use the Sith princess Takara Hilts as a bargaining chip with the Tribe, she managed to escape with Kaliska. The two women then returned to Eshkrene with Eorm's entire herd of uvaks, winged reptilian beasts of burden. They then brought the Doomed over the Southern Ocean to Keshtah Minor to stop Dreypa from returning to the stars. Ultimately, Dreypa was defeated and killed following a brief but bloody rebellion which devastated parts of Keshtah Minor including the Tribe's capital of Tahv in the interior."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While not officially named, the Escape from Eshkrene occurred as one of the plot elements of John Jackson Miller's Lost Tribe of the Sith—Spiral 2, the second comic issue of the Spiral comic story, which was released on September 12, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}