{"url": "Escape_from_Kamino_(1_BBY)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Battles of Kamino"], "nodes": [{"tag": "h1", "text": "Escape from Kamino  (1 BBY)"}, {"tag": "p", "text": "In the year 1 BBY, a battle was fought on the planet Kamino. After the death of Galen Marek, former apprentice to the Imperial Dark Lord Darth Vader, on the first Death Star battlestation, Vader sought to recreate his apprentice, collecting Marek's corpse and using genetic samples from the body to create a series of clones intended as replacement apprentices. Most of the clones were deformed and insane, though progress was gradually made, and a new generation of increasingly stable clones was created. Vader proceeded to train the clones, though many of these subjects would eventually succumb to the madness that had claimed so many of their predecessors. After one would go insane, Vader simply moved on to train the next clone. One of the clones, called Starkiller, was only the latest in a long line of failures, though he was one of the most promising subjects."}, {"tag": "p", "text": "During a training match with a number of Sith Training Droids, Starkiller proved unable to strike down one of the droids when it assumed the shape of Juno Eclipse, Marek's former lover. The inability to overcome the genetic memories of Starkiller's template marked him as a failure, and Vader prepared to execute the clone. However, Starkiller refused to submit and lashed out at Vader with Force lightning, using the Dark Lord's momentary distraction to escape the training complex. Going through the Imperial forces—which included riot stormtroopers, jumptroopers, carbonite war droids, and others—garrisoned in Timira City, where he was cloned, Starkiller fought his way to a landing pad. While on his way, he gained some help from stormtroopers on whom he used mind tricks. Once on the landing pad, Starkiller escaped Vader and hijacked the Sith Lord's personal fighter, escaping from the planet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the year 2 BBY, the Dark Lord of the Sith Darth Vader's original apprentice, Galen Marek, had been dispatched to create the Rebel Alliance as part of an elaborate scheme to distract Emperor Palpatine of the Galactic Empire so that Vader and Marek could catch him off-guard and assassinate him. While Marek was successful in his task, Vader betrayed him, revealing that the plan had been Palpatine's brainchild, intended to gather all of his enemies in a single place for quick elimination, and that Marek's own apprenticeship under Vader had been a sham. The Dark Lord had no intention of rebelling against his Master, and Marek was left for dead, while the Rebel leaders were captured and taken to the first Death Star battlestation for personal execution by Palpatine. However, Marek refused to accept the state of affairs and traveled to the Death Star, intent on rescuing the Rebels. Defeating Vader in a vicious lightsaber duel, Marek was given the choice of killing the Dark Lord and replacing him as Palpatine's apprentice, but he refused and attacked Palpatine. Marek died in the process, but not before the Rebel leaders escaped aboard his ship."}, {"tag": "p", "text": "Seeking to recreate Marek in the year 1 BBY, Vader went to the cloning laboratories on the water world Kamino and saw to it that a series of clones of his late apprentice was created. The process was very hit-and-miss, with numerous setbacks and failures caused by the inherent difficulties in cloning Force-sensitives; many of the early subjects were deformed, and even the later, more stable clones still fell prey to insanity and psychosis within months. As the subjects failed, Vader simply disposed of them and moved on to training the next clone. Eventually, Vader began training another clone identified as \"Starkiller,\" Galen Marek's codename."}, {"tag": "h2", "text": "The escape"}, {"tag": "h3", "text": "Starkiller's training session"}, {"tag": "p", "text": "When Vader arrived in Timira City on Kamino to check on the Starkiller clone, the subject had been in an isolation pit for approximately thirteen days, relying on the Force to sustain his starved and dehydrated body. Vader was impressed with the clone's performance, releasing him from the pit and informing him that the Jedi mentor to Galen Marek, General Rahm Kota, had been captured on the planet Cato Neimoidia. Vader stated that when the clone's training was complete, he would be sent to execute the Jedi. Vader then inquired about Starkiller's continuing visions and memory flashes. While Starkiller elaborated on them, Vader decried them as the memories of a dead man, a mere side-effect of the cloning process that would eventually fade. However, Vader also made clear that if they did not fade, Starkiller would be of no further use to him. Vader activated a number of Sith Training Droids and provided Starkiller with a pair of lightsabers, initiating the training session."}, {"tag": "p", "text": "Starkiller fought well in the training match, cutting down the holodroids with practiced ease, until only one remained. As he moved to cut down the remaining droid, Starkiller halted when he realized it had taken the shape of Juno Eclipse, Galen Marek's former lover. Despite Vader's urgings, Starkiller was unable to overcome his instinctual love of her, and he could not attack the droid. Vader cut down the droid himself, before stating that Starkiller would receive the same treatment as the other failed clones. Before Vader could follow through on his threat, Starkiller experienced a sudden vision of the original Starkiller's betrayal at Vader's hands. Starkiller decided to fight back before Vader executed him, turning on the Sith Lord and lashing out with a blast of Force lightning. Vader was momentarily driven to his knees as his cybernetics malfunctioned under the onslaught, and Starkiller used the opening to tear open the wall of the training room and leap out into the Kamino rainstorms."}, {"tag": "h3", "text": "Escape into Timira City"}, {"tag": "p", "text": "Starkiller's training facility was situated at the peak of one of the spires of Timira City, so Starkiller leaped into open air. As he plummeted down the side of the tower, he used his powerful telekinetic abilities to clear a path for himself, destroying exterior fixtures on the tower and blasting apart a wing of TIE fighters that tried to intercept him. Crashing through a large glass dome at the base of the spire, Starkiller unleashed a powerful Force wave as he hit the ground, killing the stormtroopers in the room. He fought his way out onto the exterior ramparts of the city, making short work of any troopers in his path. The riot stormtroopers who joined the fray provided a small challenge for Starkiller, as their electrostaffs blocked his lightsaber strikes, though they were no match for his Force abilities."}, {"tag": "p", "text": "Fighting his way along the ramparts, Starkiller managed to re-enter the city, making his way to one of the smaller cloning facilities. Continuing through the labs, he eventually reached an observation gallery overlooking the Timira City parade grounds. Starkiller suddenly had a brief vision showing him how to use a Force mind trick, and he compelled the lone trooper patrolling the area to commit suicide by leaping through the gallery window and falling to his death. The sudden activity caught the notice of the gunners manning the heavy laser emplacements above the parade ground, and they opened fire on the gallery, forcing Starkiller to retreat to the grounds. Battling through the parade grounds, he reached one of the main entrances, where he was confronted by a carbonite war droid. Starkiller used telekinesis to rip off the automaton's heavy shield before destroying the droid. Starkiller continued to use his lightsabers and the Force to combat his enemies—including stormtroopers, Imperial jumptroopers, riot stormtroopers, and others—he faced along the way. He also employed the mind trick power to get enemy forces to assist him by either fighting the other troops or by killing themselves. He caused severe structural damage along the way as well, such as at Barracks D4."}, {"tag": "p", "text": "Starkiller happened upon one of the main landing platforms, where he fended off a horde of stormtroopers delivered by Imperial gunships. Making his way along a series of catwalks above the landing platform, Starkiller destroyed all of the troopers in his path before re-entering the facility once again. As he traveled down a windowed corridor along the edge of one of the domes, he was harassed by another gunship, which destroyed the corridor behind him as he fled. Exiting the dome, he saw Darth Vader's TIE Advanced x1 docked on the adjacent landing platform. Destroying the communications tower in front of him, Starkiller used it as a bridge to reach the platform."}, {"tag": "p", "text": "Once on the platform, Starkiller drew heavily on the Force as he attacked the trio of All Terrain Scout Transports guarding Vader's ship, falling into Force fury. He made short work of the walkers and cut loose against the stormtrooper reinforcements who arrived. The landing platform was quickly cleared, and Starkiller started toward Vader's starfighter. It was then that Vader himself arrived, telekinetically blasting open the double doors into the cloning facility as he marched out into the rain. Starkiller increased his pace and quickly boarded the fighter, taking off immediately. As Starkiller attempted to fly away, Vader grasped the ship with the Force, seeking to halt the clone's escape. After a brief contest between Vader's power and the ship's engines, Starkiller managed to flee in the fighter. Following Starkiller's escape, Vader hired the bounty hunter Boba Fett to find and capture Juno Eclipse and bring her back to Kamino. Vader planned on using Eclipse as bait to draw Starkiller back to Kamino, where Vader would be waiting."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In response to the breakout, security at the facility was increased, affecting the development of Subject 1157, another clone of Marek. Following the information provided by Vader, Starkiller traveled to Cato Neimoidia, intent on rescuing Rahm Kota in order to discern the whereabouts of Juno Eclipse. Starkiller successfully completed his mission, although Kota did not know the location of Eclipse. Starkiller then traveled to the planet Dagobah, where he found Jedi Master–in–exile Yoda. After having a vision about Eclipse and speaking with Yoda, Starkiller left for the Itani Nebula to find Eclipse. However, by the time he arrived there, Eclipse had been captured by Boba Fett and taken back to Kamino. Starkiller went back to Kamino to rescue her, and he there fought against Vader, defeating the Dark Lord and finally reuniting with Eclipse. Vader was taken hostage by the Rebel Alliance, and they took him away to be put on trial."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The escape from Kamino was first mentioned in the original version of the promotional website for the 2010 LucasArts video game Star Wars: The Force Unleashed II. The old version of the website featured the perspective of Subject 1157, another clone of Marek, from inside his cloning tank. Viewers could listen to audio logs about 1157's development, one of which mentioned the battle. The escape is also mentioned in the current version of the website, which changed in format after the game was released. The battle had its first appearance in author Sean Williams' 2010 novelization of Star Wars: The Force Unleashed II. The escape from Kamino was the first level in the video game."}, {"tag": "p", "text": "The Flash-based game Escape from Kamino also recreated the level. The game was found on the official Facebook page for Star Wars: The Force Unleashed II."}, {"tag": "p", "text": "While the Wii, Nintendo DS, and Xbox 360/PlayStation 3 versions of the game differ from each other, the storyline remains basically the same. This article follows the Xbox 360/PlayStation 3 version, since it remains closer to the novel, which is considered the higher level of canonicity. The story presented in the novel cuts down the battle considerably; Starkiller jumps out of the training facility directly to the landing platform that holds Vader's starfighter. He uses the Force to knock down the three AT-STs before boarding the fighter. Also, Vader uses the Force to grip the fighter, although Starkiller manages to break free."}, {"tag": "p", "text": "The mission in the Wii version follows a different path through the facility, although the introduction is the same. Starkiller lands on the outside after escaping Vader by sliding down the side of the facility, and then he fights through Imperial troops. In one part of the facility, he uses Force lightning on a fan to stop its blades and pass through. In another part of the facility, he fights Vader, with Vader Force-choking him. An explosion then knocks Starkiller down an turbolift shaft and outside the facility. After fighting through more troops, he finds himself in the training grounds, which are protected by pop-up turrets. Re-entering the facility, Starkiller fights more troops and faces Vader again. They fight, and Starkiller shoves him away to escape on a turbolift. The turbolift takes him to a corridor filled with troops, and past the corridor are two AT-STs, one of which he stabs with his lightsaber, and the other of which he knocks aside after Force-gripping a tower. He then throws the tower at Vader, allowing him to escape aboard the TIE fighter."}, {"tag": "p", "text": "The level for the Nintendo DS version is played in 2D mode, rather than in the 3D mode of the other versions of the game. As with the Wii version, the overall story remains basically the same. Starkiller fights his way through Imperial troops on Kamino. At certain parts, he must be careful not to touch a green-colored substance that could harm him. Starkiller also uses his lightsabers to destroy several fans along his way so that he may go through those sections of the level. After fighting through Imperial forces inside and outside buildings, Starkiller comes to a landing pad where Vader's TIE fighter is sitting. Although Vader comes out to confront Starkiller, the latter manages to escape in the starfighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}