{"url": "Escape_from_Kamino", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles with conjectural titles", "Category:Battles of Kamino", "Category:Events during the Imperial Era", "Category:Missions of Clone Force 99"], "nodes": [{"tag": "h1", "text": "Escape from Kamino"}, {"tag": "p", "text": "Shortly after the formation of the Galactic Empire, the members of Clone Force 99 were forced to escape the planet Kamino. The members of the so-called \"Bad Batch\" were enhanced in ways which made them immune to the inhibitor chips which caused the rest of the clone troopers to carry out Order 66, with the exception of team sniper CT-9904 \"Crosshair.\" In order to test the squad's loyalty, Admiral Wilhuff Tarkin had ordered the Bad Batch on a mission to Onderon, supposedly to wipe out a Separatist holdout. However, the unit refused to carry out the mission after encountering civilian refugees being protected by Saw Gerrera and his Partisans, who had formerly fought for the Galactic Republic. Clone Sergeant \"Hunter\" decided to return to Kamino to rescue Omega, a young enhanced clone who had attempted to warn the unit about going on the mission."}, {"tag": "p", "text": "The Bad Batch was arrested upon their return and thrown in the brig with Omega, who had been taken into custody by the Coruscant Guard after they found her in the Batch's barracks. Tarkin had Crosshair taken away to have the effects of his chip enhanced, making him totally loyal to the Empire. The rest of the squad escaped from their cells and made their way to their starship, where they were confronted by Crosshair and the Imperial shock troopers. During the firefight, Crosshair ordered one of his troopers to close the hangar doors in order to prevent his former team from leaving. However, the system controlling the doors was secretly overridden by Doctor Nala Se, allowing Omega and the Bad Batch to escape from the Kaminoan homeworld."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Clone Wars was a conflict fought between the Galactic Republic and the breakaway Confederacy of Independent Systems between the years 22 and 19 BBY. The Republic Military was largely made up of clone troopers created by the Kaminoans, under the command of Jedi Generals. However, although the clone army had been commissioned by the Jedi Master Sifo-Dyas because of Force visions he had had, he had been murdered by the Sith, ancient enemies of the Jedi, and the army project hijacked. Pretending it was at Sifo-Dyas' request, the Sith Lord Tyranus had the Kaminoans implant inhibitor chips into the clones which were secretly programmed with Order 66, a directive which the Kaminoans believed would keep the clones from being given orders by rogue Jedi, but was actually intended to force the clones to kill them."}, {"tag": "p", "text": "At the end of the war, Dark Lord of the Sith Darth Sidious, publicly Supreme Chancellor Palpatine, enacted Order 66, bringing about the fall of the Jedi Order. Almost all of the Grand Army of the Republic was brainwashed by the command, becoming mindlessly obedient to Palpatine. Among the very few exceptions were most of the members of Clone Force 99, an irregular clone commando unit nicknamed the \"Bad Batch\" because all of its original members were genetically defective clones with mutations which gave them certain enhanced abilities. The Bad Batch had been participating in a battle on Kaller when Order 66 occurred, and witnessed Jedi General Depa Billaba's death at the hands of her own soldiers with shock and confusion. Billaba's Padawan, Caleb Dume, escaped into a nearby forest afterwards. Clone Sergeant Hunter decided to go after Dume and try to help him, bringing along the sniper Crosshair as backup while sending the other members of the squad to try and find out what was going on and to stall the other clones."}, {"tag": "p", "text": "However, while the rest of the squad was immune to Order 66 due to their mutations or, in Echo's case, cybernetics and experimentation at the hands of the Techno Union, Crosshair was not, although his chip was not as active as those of standard clones. As a result, he attacked Dume upon encountering him in the forest, although the Padawan was able to overpower him and knock him unconscious. Subsequently, Dume fled from Hunter as well, and the sergeant let the boy escape across a canyon. When Crosshair came around and caught up, Hunter claimed that he had stunned Dume as he jumped, leading him to fall into the canyon and die. However, Crosshair suspected that Hunter was lying."}, {"tag": "p", "text": "The Bad Batch returned to Kamino shortly thereafter, discovering that Order 66 had been carried out there as well. When they reached their barracks, Crosshair accused Hunter of not following orders because he had let Dume go. Echo, meanwhile, expressed unease over why Billaba's forces had turned on her so suddenly, and Tech speculated that the normal clones had somehow been programmed to do so. The clones on Kamino were shortly summoned to a mandatory assembly where they watched Palpatine declare the \"Jedi rebellion\" had been crushed before proclaiming the reorganization of the Republic into the Galactic Empire. At the assembly, Hunter spotted a blonde child accompanying Chief Medical Scientist Nala Se who disappeared when he glanced away for a moment. The new Empire further unsettled some members of the Batch, particularly Echo. After the assembly, the child, a girl named Omega, approached the squad and introduced herself, revealing she knew who they were, before she was found and escorted away by Nala Se."}, {"tag": "p", "text": "Shortly afterwards, Admiral Wilhuff Tarkin arrived on Kamino to assess the clone army, informing Prime Minister Lama Su that the Empire did not intend to continue the Republic's contracts with the cloners in favour of an army of recruits, ostensibly on the grounds that clones were too expensive. After witnessing a cafeteria brawl between members of the Bad Batch and standard clones, Tarkin decided to have the squad assessed in a combat test, which they passed by using innovative tactics after the Admiral switched to live fire partway through. Echo, who had previously encountered Tarkin during the battle where he had been captured by the Separatists, was unnerved by his presence, knowing he disliked clones. Although Tarkin found Clone Force 99's combat skills impressive, he was concerned about their disregard for orders and loyalty to the Empire, particularly regarding Order 66, as Crosshair had secretly reported Dume's survival."}, {"tag": "p", "text": "Tarkin decided to test the Bad Batch's loyalty by sending them on a mission to Onderon to wipe out what he said were Separatist insurgents. Omega, who had witnessed enough of Tarkin to know his distrust for clones, attempted to warn Hunter not to go on the mission, asking him to take her along and not return to Kamino, although he turned her request down. When the squad arrived on Onderon, they found an encampment of former Republic fighters led by Saw Gerrera, a known rebel who had fought against the Separatists during the Onderonian Civil War after being trained by Jedi General Anakin Skywalker and Clone Captain Rex. Gerrera's fighters were protecting a number of civilian refugees forced on the run by the new Empire. Despite Crosshair's protests, after speaking with Gerrera, Hunter let the Onderonian and his people leave peacefully. After destroying a probe droid Tarkin had sent to spy on them, Hunter decided he was done with the Empire, realizing that Omega had told him the truth. Tech revealed that he had deduced Omega was an enhanced clone like them, and Hunter decided that they should return to Kamino to rescue her. Meanwhile, Tarkin, alerted of the squad's treason in letting Gerrera go, prepared to arrest them. Omega was thrown into detention in Tipoca City when she was found in the Batch's barracks by the Coruscant Guard when they were preparing to clear out the room."}, {"tag": "h2", "text": "The escape"}, {"tag": "h3", "text": "Capture"}, {"tag": "p", "text": "On the Havoc Marauder's approach to Tipoca City, the shuttle received no response from comscan, which Tech found unusual. Landing outside a hangar bay, the team disembarked, and Hunter gave orders for them to split up to locate Omega, before returning to the starship. However, when they entered the hangar, they were shortly surrounded by Imperial shock troopers. Tarkin personally confronted them, stating that mission failure was not acceptable, and Hunter responded that there had been complications. The Admiral had them arrested for treason. The Batch was stripped of their equipment, which was placed in a hangar bay alongside the Marauder and the belongings from their barracks."}, {"tag": "p", "text": "The squad was locked up in the same cell Omega had been placed in. She asked them why they had returned, and was surprised when Hunter told her they had come back for her. He asked her if she wanted to come with them, and she agreed. Wrecker asked how they were going to escape, and Hunter replied that he was working on it. Crosshair, affected by his chip, started an argument with Hunter about his disobeying orders, leading Tech to remark that Crosshair had never previously been bothered by that kind of thing. The sniper railed at Hunter about him going \"soft\" and that all of his decisions since Kaller had been wrong, leading Hunter to retort that they could argue about his decisions after they escaped. Afterwards, Crosshair retreated to the corner of the cell, where he sat down and rubbed his temple as if he had a headache. Omega approached him, noting that he was angry, to which he sarcastically responded that she was observant. She told him that she knew what he was going to do and asked him not to, although she knew it was not his fault."}, {"tag": "h3", "text": "Brainwashing"}, {"tag": "p", "text": "Three shock troopers arrived at the cell and ordered Crosshair to accompany them. Hunter protested, insisting that the squad always stayed together, but he was knocked down and Crosshair was led away. The sniper was taken to a medical bay, where he was placed in a scanner which monitored his brain, as Tarkin and Nala Se watched from an adjoining room. Tarkin noted that Crosshair had exhibited loyalty to the Empire on Onderon, and Nala Se reported that Crosshair's inhibitor chip was active, but at a lower level than in the standard clones, due to his mutation's effects on his cranial activity. Tarkin asked if the chip could be enhanced to increase his loyalty, and Nala Se stated that it was possible. On the Admiral's request, Crosshair was subjected to a painful procedure via energy directed into his head to amplify his inhibitor chip. Afterwards, the now totally-loyal Crosshair was outfitted with black-and-green armour and a new sniper rifle."}, {"tag": "h3", "text": "Breakout"}, {"tag": "p", "text": "While the rest of the Batch and Omega remained in their cell, Tech finally deduced a method to break out: he noted that their cell had been retrofitted into a Kaminoan facility constructed prior to the Clone Wars, when there had been no need for a detention centre. As a result, Tech figured that the cell was not built to hold someone like the super-strong Wrecker. Locating a weak point on the wall, Tech told Wrecker to hit there as Hunter, Echo and Omega stood at the front of the cell to block the shock troopers' view. Hunter gave Wrecker the all-clear to proceed, but his first attempt was unsuccessful. Tech told him to hit harder, and his second attempt dislodged a wall panel which Tech peeled open. Wrecker said that he was too large to fit, and Tech sarcastically remarked about his astuteness. Omega immediately volunteered, and Hunter told her to deactivate the switch controlling the cell's force field. The girl entered the hole and climbed up, as Tech and Wrecker pushed the panel back into place."}, {"tag": "p", "text": "The three shock troopers, after checking a datapad, were approaching the cell again when they noticed Omega's absence. The leader demanded to know the girl's whereabouts, and Tech suggested that they tell them, Echo threatening the leader that if he harmed the girl he was a dead man. Omega, having reached the ceiling, witnessed the exchange through a panel, which audibly shifted under her weight. The shock troopers inquired about the noise, and Wrecker, sitting on the floor in front of the wall panel, attempted to cover for the noise by loudly repeating Tech's earlier remarks about the cells being too flimsy to hold someone of his strength, prompting Tech to facepalm in exasperation. The shock troopers ordered a check on Omega's location, but were told she was still registering as being present in the secure area. One shock trooper ordered Wrecker to move, asking what was behind him, and he retorted that they should try and make him. Omega knocked the ceiling panel loose, causing it to fall upon the shock troopers with herself on top. At Hunter's urging, she got up and ran for the controls as some of the troopers recovered, managing to deactivate the door just before one of them grabbed her. Hunter and Tech armed themselves with the shock troopers' DC-15A blaster carbines while Echo took the datapad and Wrecker punched out the trooper who had seized Omega. Leaving the three troopers insensate, the group fled the area."}, {"tag": "h3", "text": "Firefight"}, {"tag": "p", "text": "The group made their way through the hallways of Tipoca City, avoiding shock trooper patrols. Tech remarked that they were not going to get far without their gear, and Omega said the Batch's equipment was probably in the hangar where the troopers had moved the items from their barracks. They immediately set out for the hangar, where they found their belongings and the Havoc Marauder. Hunter ordered the squad to suit up. Omega, hearing Wrecker panic because his tooka doll Lula was not with his equipment, spotted the doll on the floor nearby and walked over to get it. As Hunter ordered Tech to get onboard the ship and start it up while the rest of them located Crosshair, Omega heard the sound of the door beginning to open and said that they would not have to go far. The door opened to reveal a squad of shock troopers, led by the now-Imperial Crosshair, as the members of the Batch took cover."}, {"tag": "p", "text": "Wrecker was shocked by the sniper's appearance, and Hunter stood up and faced Crosshair, asking him if he had lost his mind. Crosshair ordered Hunter to surrender, and he responded that he supposed he was disobeying that order as well. After a moment of tense silence, the shooting began, and Hunter dodged back into cover. The shock troopers charged forward and tossed some smoke bombs which obfuscated vision. Hunter ordered Wrecker to clear the smoke on a count of three. When the count was up, Wrecker leaped into the fray with a pair of panels which he beat together to disperse the smoke, before throwing one to knock out several shock troopers. When Wrecker threw the other one, Crosshair rolled out of the way before shooting him in the shoulder in the spot where he had been hit during the live fire training exercise, knocking him to the ground. Omega attempted to run to him, but Hunter pulled her back as Crosshair was using Wrecker as bait to get the others out of cover."}, {"tag": "p", "text": "As Tech successfully started the Marauder's engines, Hunter and Echo prepared to get Wrecker, Hunter telling Omega to run for the ship and not stop. Crosshair ordered one of the shock troopers to seal the hangar bay doors, but the controls were overridden by Nala Se, who was observing the fight via security cameras from elsewhere in the city, and the door stayed open. Hunter and Echo opened fire on the shock troopers as Omega ran to the ramp, and Hunter helped Wrecker up. Omega observed as Echo shot a shock trooper, before noticing a blaster on a nearby crate. Crosshair aimed at Hunter's head and was about to shoot when Omega grabbed the blaster and shot his rifle out of his hands, to the others' shock. With Omega providing cover fire, everyone was able to get onboard the Marauder. As the ship escaped, Crosshair unsuccessfully opened fire with his blaster pistol, but he was left standing in the hangar staring after them."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Nala Se reported to Lama Su that although the augmentation of Crosshair's inhibitor chip had been successful, Clone Force 99 had escaped with Omega. He told her to say nothing to the Imperials until the Empire's intentions had been made clear. The Kaminoans later planned to regain the Empire's favour with a new kind of superior clone, which they needed the genetic material of one of the escapees for."}, {"tag": "p", "text": "After Wrecker's injury was tended to, Hunter decided that going to ground in one place was not feasible since Crosshair was looking for them. They initially travelled to Saleucami to visit a contact of theirs, the clone deserter Cut Lawquane, for advice about how to lie low, but ended up assisting him and his family in escaping offworld. Hunter was angry with himself for Crosshair's loss, as he had left a man behind. However, the squad learned of the inhibitor chips from Omega and realized that Crosshair's actions may not have been willing. Omega was also insistent that his betrayal had not been his fault."}, {"tag": "p", "text": "Crosshair was made the commander of a squad of recruited Elite Squad Troopers as part of Project War-Mantle, an operation spearheaded by Vice Admiral Rampart to bring non-clone soldiers into the Imperial Military. The squad's first mission was to Onderon, where they wiped out a group of Saw Gerrera's fighters and the refugees they had been protecting."}, {"tag": "p", "text": "On a supply run to Pantora before the squad had intended to go into hiding, Omega was nearly abducted by the bounty hunter Fennec Shand, who had been hired by the Kaminoans. This left the Batch with a new imperative to find out who had placed a bounty on her and why. This led them to seek out the information broker Cid, who subsequently hired them as mercenaries in a \"mutually beneficial arrangement\" where she helped keep the heat off them while they got paid."}, {"tag": "p", "text": "Fellow rogue clone Captain Rex eventually tracked the Batch down on Ord Mantell and, after learning they had not yet removed their inhibitor chips, set up a rendezvous with them on Bracca to do so in the medical bay of a wrecked Venator-class Star Destroyer. However, Wrecker's chip activated due to severe headaches he had been suffering from, briefly turning him against the others before they managed to subdue him and perform the surgeries. In the aftermath, however, Bracca's Scrapper Guild spotted the intruders and reported them to the Empire. The Batch lingered on Bracca because Hunter saw an opportunity to acquire valuable salvage to square a debt the squad owed to Cid, but the decision led to them being cornered by Imperial forces led by Crosshair. They were able to escape, but the Kaminoans, aware that the Imperials intended to kill the Batch, sent another bounty hunter, Cad Bane, to abduct Omega so they could proceed with their contingency plan. Bane was successful in his task, severely injuring Hunter in the process."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}