{"url": "Escape_from_Tipoca_City", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles of Kamino", "Category:Events during the Clone Wars", "Category:Missions"], "nodes": [{"tag": "h1", "text": "Escape from Tipoca City"}, {"tag": "p", "text": "During the third year of the Clone Wars, rogue ARC trooper \"Fives\" escaped from Tipoca City on Kamino while trying to uncover the mystery of why his friend Tup had suddenly killed a Jedi Master, and after discovering he was in danger of memory-wiping for what he knew about the chip he had discovered in Tup's head. With the assistance of droid AZI-3, Fives escaped from the city, before later sneaking back in to have his own chip removed and confirm that all the clone troopers had them."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Battle of Ringo Vinda, CT-5385 (nicknamed \"Tup\") malfunctioned in the midst of battle and executed Order 66 prematurely, killing Jedi General Tiplar. Following an initial examination of the clone, the Republic sent him to a medical facility on Kamino in an attempt to discover the cause of this strange behavior. While there, ARC Trooper CT-5555 (nicknamed \"Fives\") located and removed a tumor from the head of Tup in a desperate attempt to save his friend. However, immediately following the procedure, Tup died and Fives was placed under arrest by Jedi General Shaak Ti. Following the discovery of the tumor, Shaak Ti contacted Supreme Chancellor Palpatine to inform him of the discovery, and the Chancellor ordered that the tumor be sent to the Grand Republic Medical Facility on Coruscant."}, {"tag": "h2", "text": "The escape"}, {"tag": "p", "text": "Following the conversation with Palpatine, Shaak Ti returned to the room where Fives was being held and commanded that the tumor be taken to the Jedi Temple rather than the Grand Republic Medical Facility that the Chancellor had commanded it go to. Shaak Ti then told Fives that he would need to pass a final physical examination before he was sent back to the front. En route to the supposed examination, medical droid AZI-345211896246498721347 (otherwise known as AZI-3) revealed to him that he was actually going to have his memory wiped and be placed on sanitation detail on Kamino. Following this revelation, Fives swiftly disarmed the clones escorting him and escaped, along with AZI-3. After an alarm was sounded, Fives ran to the room in which he was being held prisoner and retrieved the tumor from a switched case."}, {"tag": "p", "text": "Now possessing the tumor, Fives quickly dashed to a hangar where he knocked out a clone pilot so that he could steal a ship. Just as Fives was entering the ship, Shaak Ti arrived with several clone troopers. However, she was unable to prevent Fives' theft of the ship. Having successfully stolen the ship, Fives set the ship on autopilot and — along with AZI-3 — jumped into the ocean below. After traveling back to Tipoca city on AZI-3, Fives re-entered the city and stole the armor of a passing clone trooper so he could fit in more easily. Fives then told AZI-3 to examine the tumor further. This led AZI-3 to take Fives to the genetic records hall where they could compare the DNA in the tumor to that of Jango Fett. AZI-3 then proceeded to compare the samples but found no similarity whatsoever. This discovery led AZI-3 to believe that the tumor was, in fact, an implant rather than a natural brain tumor."}, {"tag": "p", "text": "Seeking to discover whether the tumor was in him as well as Tup, Fives and AZI-3 fled again, this time to a medical chamber where AZI-3 performed a surgery on Fives to remove the tumor. Having discovered and removed the tumor from his brain, Fives wanted to discover how widespread the tumors were. At AZI-3's recommendation, they went to the facility where clones in the early stages of development were being grown. After examining several clone embryos, AZI-3 discovered that all clones had these tumors implanted in them from birth. At this point Doctor Nala Se entered the room after being alerted by two Kaminoans that Fives and AZI-3 had passed. Fives confronted her about the tumors in the clones, to which Se responded that they were inhibitor chips designed to limit the aggressiveness that was present in Jango Fett. After this revelation, Shaak Ti and several clone troopers entered the room. Fives held Se at gunpoint. Following an exchange during which the evidence Fives had collected was presented to Shaak Ti, she ordered him and all the evidence to be taken immediately to Coruscant."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "En route to Coruscant, Nala Se secretly drugged Fives with an unknown compound before his meeting with the Chancellor. At the meeting, once they were alone, Palpatine revealed to Fives the true purpose of the control chips, which led Fives to be framed for attempting to kill the Chancellor, forcing the rogue ARC trooper to escape the Grand Republic Medical Facility and go on the run. Fives eventually found out that the 501st Legion had returned to Coruscant and confronted Kix at the clone bar 79's, passing him coordinates for a location on Level 1325 where he wanted to meet Clone Captain Rex and Jedi General Anakin Skywalker in the hopes of telling them the truth about what was going on."}, {"tag": "p", "text": "However, Fives was spotted and followed by a probe droid which alerted the Coruscant Guard. When Skywalker and Rex arrived at the abandoned warehouse the coordinates led to, they were trapped in a ray shield by a paranoid Fives, who attempted to tell them about the chips and their purpose but could not articulate himself properly due to the drug Nala Se had administered, sounding insane. When Commander Fox and his troops arrived in response to the probe droid's report, the paranoid Fives went for one of Rex's blaster pistols and was shot dead."}, {"tag": "p", "text": "With Fives and Tup both dead, Palpatine attributed the entire series of incidents to a parasite the clones had picked up on Ringo Vinda, leaving the Jedi unaware of the true nature of the \"inhibitor\" chips that would eventually be their demise."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}