{"url": "Escape_from_the_Invincible_Faith", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Escape from the Invincible Faith"}, {"tag": "p", "text": "During the Galactic Civil War, Commander Iden Versio of Inferno Squad escaped from the Rebel MC80 Star Cruiser Invincible Faith with the help of an ID10 seeker droid after being taken captive."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Sometime before, the Rebel Alliance managed to retrieve a message from Moff Raythe, which contained orders for Death Squadron to move to the far side of the planet Endor for the Galactic Empire's trap during the upcoming Battle of Endor. Needing to keep the information secretive, Inferno Squad Commander Iden Versio was assigned to retrieve the message before the Rebel Alliance managed to decode it. In order to infiltrate the MC80 Star Cruiser Invincible Faith where the message was being decoded, Versio feigned her capture."}, {"tag": "p", "text": "Aboard the Invincible Faith, the ship's captain attempted to interrogate Versio in order to get the activation code for her droid. He attempted to coax her by offering her a spot in the Rebel Alliance as he believed that the Galactic Empire would soon be toppled during the Battle of Endor; however, she refused his offer. Once he left, Versio spoke the activation code into her helmet, which was linked to her droid, activating it."}, {"tag": "h2", "text": "The escape"}, {"tag": "p", "text": "After being awakened with the activation code, the ID10 began to scan the room while a Sullustan technician attempted to hack its memory core. While working, the Sullustan was shocked by the ID10's electro-shock prod. Having discovered Versio's location by hacking into the ship's computers, the ID10 headed for the ventilation system. Exiting the ventilation system, the ID10 came across many rebel troopers just outside Versio's cell, and was ordered to head back into the ventilation system and find another way through. Once more exiting the ventilation system, the ID10 came across a large staging area. Avoiding several rebels, the ID10 managed to reach a console which allowed it access to another ventilation system outside, which led directly to Versio's cell. Finally reaching her cell, the ID10 freed Versio of her shackles."}, {"tag": "p", "text": "Freed, Versio placed her helmet back on, once again gaining access to communications with the Corvus and Agent Gideon Hask. She informed Agent Hask that her mission was going smoothly, while her ID10 opened her cell door. She began to move through the ship, knocking out several rebels along her way with a baton, before discovering a weapons cache and stealing a DH-17 blaster pistol. With her weapon, she began to move through the ship once more, eventually reaching the communications center and taking out the officer working on decrypting the message. She quickly played the message before deleting it. However, deleting the message triggered the ship's alarm, and now the rebels were on high alert. Moving to take an A280C blaster rifle, she ordered Hask to begin moving in for extraction."}, {"tag": "p", "text": "Heading toward an airlock, Versio eliminated many rebel soldiers during her escape. Finally, Versio made it to a heavily secured door, which would take longer to slice than the others. Pinned down, Versio did her best to defend against the oncoming waves of rebel soldiers before the droid finally finished slicing the door. At the airlock, Versio sealed herself inside and informed Hask that she was in position for extraction. As Hask counted down, the airlock opened and Versio was jettisoned into the vacuum of space before the Corvus arrived, allowing her to land in its hangar bay. While the Invincible Faith fired concussion missiles, the Corvus made its escape into hyperspace."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "On the command deck of the Corvus, Versio congratulated her crew on a successful rescue. Hask questioned her on the successful deletion of the message, which was met with approval. The crew then contacted Admiral Garrick Versio to tell him of the mission's success."}, {"tag": "p", "text": "With the retrieval of Raythe's message, the Rebel Alliance was caught off-guard at the Battle of Endor, unknowingly walking into the trap the Empire had set for them. Even so, the Rebel Alliance managed to disable the shield generator around the Death Star II and destroy its reactor core from the inside, striking a critical blow against the Empire. Eventually, the Empire was toppled during the Battle of Jakku."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}