{"url": "Escape_pod/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Escape pod classes", "Category:Escape pods", "Category:Starship types"], "nodes": [{"tag": "h1", "text": "Escape pod"}, {"tag": "p", "text": "Escape pods, also known as life pods, repair pods, or lifeboats, were small escape craft for use in emergencies. They were standard aboard all deep-space starships."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "While there were as many different types of escape pods as there were starships, they all shared a few characteristics. The interior of an escape pod was spartan—passengers were expected to use the pod only for a few hours. Some pods seated as few as two people, while larger pods could carry over a dozen beings. Padded g-couches protected occupants from injury. Some models, like the Class-6 escape pod were designed to disallow mechanicals into the pod."}, {"tag": "p", "text": "A simple piloting station provided access to the sensor, communication, and flight control systems, although the shipboard systems were heavily automated so the escape pod could land without a pilot at the controls. Sensors provided atmosphere as well as radiation and gravitational information about nearby planets, and a limited comm transceiver scanned for activity on standard communication frequencies. Emergency homing beacons were also standard, often at least as powerful as an OmniNode communications set. Many escape pods were equipped with limited hyperspace capability to facilitate travel to a planet on which to land."}, {"tag": "p", "text": "The interior compartments carried up to two weeks of rations, including food, water, survival shelters, medpacs, breath masks, glowrods, and comlinks. Galactic law often required escape pods to be fitted with a medkit and at least one medpac, though many times these regulations weren't followed. Sometimes an escape pod's emergency supplies included a civilian hunting blaster. In emergencies, survivors could use the escape pod as a shelter while seeking more adequate protection."}, {"tag": "p", "text": "Escape pods had simple drive systems with just enough fuel to orient the pod toward the nearest habitable planet and assist in emergency braking during landing. In some pods, parachutes, maneuvering jets, flotation devices, or repulsorlift drive units slowed planetary descent and cushioned landing."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Life pods carried aboard Tetan Corsairs were used by the Krath to deliver Krath war droids to the surface of Deneba. Nomi Sunrider used an escape pod from the Nebulon Ranger to reach the surface of Empress Teta in an attempt to rescue Ulic Qel-Droma from the Krath. The escape pods carried aboard ion mining ships in the Teedio system were small, simple spheres. When Vima Sunrider was piloting an ion mining ship, she became stuck in a magnetic loop, and was forced to eject in an escape pod. Tott Doneeta rescued her, using a grappling line to reel the pod into his ship. On one famous occasion, Bastila Shan, an amnesiac Revan, Carth Onasi, and a few other Republic soldiers used these escape pods to escape the dying Endar Spire."}, {"tag": "p", "text": "The two escape pods carried aboard Consular-class space cruisers carried 8 passengers each and could only be activated from the inside. Luxury life pods used aboard the Aurorient Express carried many more luxury features such as entertainment, increased seating comfort and lower shock. An escape pod was used by Aayla Secura to escape Havor's spacecraft before it was destroyed by a Kiffar Guardian vessel. The crew of the Guardian vessel logged in the escape pod and allowed it to land on Kiffex, since its passenger would have been sent there anyway for violating restricted space."}, {"tag": "p", "text": "The escape pods aboard Drama Korr's space yacht were equipped with four thrusters and a viewport. Anakin Skywalker tricked Durge into one of the pods and then sent both pod and occupant plunging into the star Karthakk. Each Providence-class carrier/destroyer carried numerous escape pods. In 19 BBY, General Grievous prematurely released the pods of the disabled Invisible Hand in an attempt to doom Anakin Skywalker, Obi-Wan Kenobi, and Palpatine to death."}, {"tag": "p", "text": "The Tantive IV carried eight six-being Class-6 escape pods, all very simple in construction. Explosive separator charges ejected such pods away from the ship, and the escape pod's distress beacon was automatically activated upon launch, although the astromech droid R2-D2 deactivated the distress beacon on his escape pod just before touchdown on Tatooine in order to throw off Imperial pursuit. Later same year, Janek Sunber used an escape pod to flee the Rebel One."}, {"tag": "p", "text": "When Luke Skywalker's starship crashed on Drexel, he escaped the sinking ship in one of its four life pods. The pod ejected and floated to the surface, where it was attacked by ship-dwellers. R2-D2 escaped The Wheel in one of the station's escape pods with the help of Master-Com. The escape pods used aboard DP20 frigates were launched from the gunship's aft section. Luke Skywalker once used such a life pod to escape 13-K."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}