{"url": "Esh-kha", "categories": ["Category:Legends articles", "Category:Esh-kha", "Category:Pre-Republic", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Esh-kha"}, {"tag": "p", "text": "The Esh-kha were an alien species that inhabited the galaxy before being imprisoned on the planet Belsavis thousands of years ago."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "In terms of appearance, the Esh-kha were a gray-skinned humanoid species with equine features, including muzzles and digitigrade legs. They also had small black eyes."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "In terms of society, their race's culture resembled that of a hive society though each individual retained their own thoughts and aspirations yet all being bred for a specific role that they were eager to fulfill. A caste system was present amongst the Esh-kha which included Force-sensitive simple minded savants, more numerous skilled determined warriors that watched over them and finally the patriarchs that acted as leaders who provided their wisdom as well as decisions to their entire people."}, {"tag": "p", "text": "Whilst their kind were individuals, Esh-kha were not named at birth but instead earned their names through their actions. Thus, those members of their kind that displayed cunning were able to be called \"Razor Mind\", \"Water Thinker\" or a similar such naming convention. An Esh-kha that displayed great skill in battle could be called \"Swift Blade\", or maybe \"Deadly Cutter\" or some other such name. It was believed that this partly explained an Esh-kha's zeal in battle with young warriors seeking not only victory but an opportunity to lay claim to a name and forge their own identity."}, {"tag": "p", "text": "Esh-kha appeared to outsiders as a savage violent species that cared only for the destruction of all other races. This hatred for other sentient species was believed to had stemmed from their tightly-knit hive-like society. It was suspected that the Esh-kha were simply unable to tolerate or even adapt to the existence of thinking of outsiders who only suffered their wrath. Their race only turned violent against one another in the most extreme of circumstances."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Only the ancient warnings carved on the prison walls of Belsavis provided an in-depth history on the Esh-kha race. According to these writings, this race were once considered one of the most feared species in the galaxy during its distant past. They were known to have arisen from their isolated homeworld, whereupon they began to cut a swath of destruction across countless systems. These campaigns saw entire races being hunted to extinction by the savage Esh-kha, who expanded into their conquered worlds. The population of the Esh-kha expanded as their living space increased and this led to the rise of a new rival patriarch, even as the old one was still alive. Such an event was unmarked by this species and this new patriarch known as Hallow Voice proposed a more peaceful approach in their dealings with other races through cooperation. As the Esh-kha population grew too large, Hallow Voice took a number of his followers away who settled on other worlds in order to reach out to other nearby cultures. During the height of their race, they were known to have conquered half the galaxy."}, {"tag": "p", "text": "Despite their works, the Esh-kha became well known for violence and mass destruction with only a few tentative alliances being formed. During this time, the marauding Esh-kha destroyed dozens of slave worlds that belonged to the Infinite Empire. These incursions eventually attracted the attention of the fearsome Rakata, who assembled a massive military force against this threat. Their conflict was known to have engulfed the entire galaxy which nearly saw the Esh-kha wiped out. Ultimately, the Infinite Empire won the resultant conflict and took the defeated hundred thousand surviving Esh-kha to the prison world of Belsavis. Once there, they were imprisoned within the Tomb in stasis beneath the surface, where they were kept in a conscious state, though immobile The Esh-kha were left in the darkness for thousands of years. A monument of this achievement was placed on Hoth, where an interactive hologram detailed the punishment of the Esh-kha and that their imprisonment was meant for them to reflect on their mistake in challenging the Infinite Empire. Scattered mentions of this imprisoned army were present in numerous texts that were later available to the Noetikons."}, {"tag": "p", "text": "In later years, Jedi historians came to wonder on whether the legend of gray-skinned warriors in the Outer Rim did not refer to the Taung, but may have been sightings of Hallow Voice's followers. By the Cold War era, the security systems of Belsavis began to break down leading to the Esh-kha being freed from stasis. Once freed, they began to resume their campaign of ruthless expansion and zealous combat. Among their noted goals appeared to be releasing their kin that remain trapped on Belsavis and spreading as much chaos within the prison planet as possible. As time moved on, they continued to recover more technology and strange weapons as they attempted to return back to the stars. Freed Esh-kha also began pillaging nearby vaults for weapons, such as plasma dischargers, for use against their enemies while others worked as saboteurs who began disabling the stasis field generators in order to free more of their kind."}, {"tag": "p", "text": "Following their release from the Ancient Prison Caverns by the Sith, the Esh-kha attacked both Imperial and Republic forces equally where they devastated their lines. An Imperial individual was tasked with preventing the Esh-kha from salvaging Rakatan stasis technology for their own uses. A Republic Individual was also dispatched to prevent Esh-kha from salvaging a crashed starship on Belsavis as a means of escaping the prison world. The Barsen'thor of the Jedi Order sought out the Esh-kha as a possible army for use against the Sith and was aided in freeing Hallow Voice by the Rakata Lhunu. Among the noted patriarchs that controlled the freed Esh-kha included Gore Claw who intended to free an ancient entity known as the World Razer that was trapped deep within Belsavis. In addition, they sought to take control of the Rakatan transportation technology as a means of escaping Belsavis. A group of Esh-kha also attempted to harness the great power of the Dread Masters until they were freed."}, {"tag": "p", "text": "Darth Synar was noted to have held an interest in the Esh-kha and sent her servants to acquire some of their High Savants that were talented in the Force. However, her followers failed and she tasked a Sith spacer with capturing the specimens with a subjugation device."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}