{"url": "Eshkrene", "categories": ["Category:Legends articles", "Category:Continents", "Category:Kesh locations"], "nodes": [{"tag": "h1", "text": "Eshkrene"}, {"tag": "p", "text": "Eshkrene was the south polar continent of the planet Kesh, home to a settlement of the Doomed, that was discovered by the Lost Tribe of Sith in 2974 BBY. It was first colonized by a group of Jedi and Dark Jedi who had become stranded on Kesh following the Hundred-Year Darkness. These Force-sensitive individuals had fought each other during the Great Calamity and had since made peace. Over the next four millennia, their descendants became known as the Doomed, a Force-sensitive order that was committed to finding true neutrality in the Force. They also maintained a constant vigil over the Keshiri and their \"great weapon\", Remulus Dreypa, who was sealed within an oubliette. In 2974 BBY, Eshkrene was discovered by an Alanciari expedition which had been sent by the Lost Tribe. These explorers encountered the Doomed and unleashed a chain of events which led to the return and subsequent death of Dreypa following a rebellion which wiped out the Doomed and devastated large areas of the Tribe's home continent of Keshtah Minor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Settlement"}, {"tag": "p", "text": "Eshkrene was a frozen polar continent in Kesh's southern hemisphere. It was first settled by several Jedi and Dark Jedi who had become stranded on the planet Kesh at some point after the end of the Hundred-Year Darkness in 6900 BBY. These offworlders had fought a fierce battle which severed access between the two continents of Keshtah Minor and Alanciar. This battle between the two Force-factions was remembered by the native Keshiri as a \"great battle\" between the Protectors and the Destructors. In the end, the Jedi and the Dark Jedi made peace and turned back from the brink of destruction. The Dark Jedi sealed their fanatical leader, the Sith Lord Remulus Dreypa, inside an oubliette, where he would remain for the next four thousand years. Meanwhile, the Jedi hid their last remaining starship beneath Tahv's Circle Eternal."}, {"tag": "p", "text": "Since Kesh was isolated from the galaxy and the Keshiri were still a primitive stone-age civilization, the Jedi and Dark Jedi decided to withdraw from the Keshiri, whom their actions had endangered. They migrated to Eshkrene where they built a settlement which became known as the City of the Doomed. For the next four thousand years, the former Jedi and Dark Jedi strove to find true neutrality in the Force and became known as the Doomed. The original ancestors of the Doomed came from a wide variety of species including S'kytri, Rodians, Wookiees, Weequay, and Twi'lek. However due to their isolation, several species gradually died out over each generation. They also used the frozen climate to preserve genetic material for several generations, thus ensuring the continued existence of some species."}, {"tag": "p", "text": "While the Doomed regarded the Force as a curse and forbade any of their members from leaving Kesh as long as they could still wield the Force, they used the Force for hunting. The Doomed also used their Force powers to create ice mirrors which enabled them to maintain a constant vigil on the Keshiri, whom they swore to protect. Over the millennia, they monitored developments on Keshtah, which had been settled by a group of Human Sith known as the Lost Tribe of Sith during the Great Hyperspace War. While the Doomed had considered intervening once during the Time of the Rot, they relented after the reformist Sith Varner Hilts assumed leadership of the Tribe and rebuilt Keshtah's society. Finally, the Doomed maintained a constant guard over Dreypa, their dreaded \"Great Weapon\" who was capable of devastating entire planets."}, {"tag": "h3", "text": "Sith Contact"}, {"tag": "p", "text": "In 2974 BBY, Eshkrene's isolation came to an end when the Alanciari sailing ship Southern Star discovered the continent. The previous year, the Lost Tribe had annexed Alanciar and adopted the Alanciaris' sailing ship technology. To support the Tribe's primary vision of returning to the stars, the ruling Grand Lord Varner Hilts initiated a programme to explore and conquer the rest of Kesh. He wanted to ensure the survival of the Tribe by giving them a purpose to work for. Upon landing, two of the Southern Star's Human crew, the outlaw Parlan Spinner and the Sith princess Takara Hilts attempted to desert the Alanciari ship crew and sneak back aboard the ship in order to sail away. However, they were spotted by Captain Chegg, whom ordered his men to kill them."}, {"tag": "p", "text": "The Alanciari crew pursued the two Sith but were ambushed and killed by several Doomed archers, who then took the two Sith and the remaining Alanciari crew prisoner. They also impounded the Southern Star. Spinner and Takara met the Doomed's leader Kaliska, who related to them the history of her people. The Doomed did not intend for their captives to leave in order to preserve their community's secrecy. While they wanted to spare Takara, they intended to execute the Alanciari crew and Spinner; the latter had expressed an interest in the Doomed's \"Great Weapon.\" However, Spinner and the Alanciari crew escaped on their ship and also stole the Doomed's \"Great Weapon.\" Spinner intended to use the \"Great Weapon\" to settle scores with the Tribe, who had mistreated his ancestors and condemned his family to slavery. When Takara and Kaliska pursued them, they too were taken prisoner."}, {"tag": "p", "text": "After releasing Remulus Dreypa from his prison, Spinner returned to Keshtah on the Southern Star. There, he and Dreypa instigated a slave rebellion against the Tribe and attempted to march on Tahv. However, they were defeated at the Battle of the Marisota Floodplain and were driven to Sessal Spire, a volcano on the south-western tip of Keshtah. Meanwhile, Takara and Kaliska returned to Eshkrene on a herd of uvak, winged reptilian beasts capable of flying for long distances, and rallied the Doomed for a confrontation against Dreypa. The Doomed used the uvak to fly to Keshtah where they made their final stand at the Battle of Sessal Spire. While all members of the Doomed died during the conflict, Dreypa was ultimately defeated by his former ally Spinner, who also destroyed the Doomed's last remaining starship in the process. As a result, a major threat to the Tribe was ended and Spinner was elevated from brigand to hero for his role in saving the Tribe from Dreypa."}, {"tag": "p", "text": "Following the defeat of Dreypa's rebellion, Grand Lord Hilts sent a second expedition to Eshkrene to explore the Doomed's settlement. Following their deaths, the settlement's buildings had disintegrated into ruins since their will was no longer protecting the settlement. During a private meeting with Spinner, Varner acknowledged that he had sent the Southern Star to Eshkrene because he suspected that it was home to pre-Tribe settlers. He had wanted to test this hypothesis and was ultimately proven right. It can be assumed that Eshkrene fell under the dominion of the Lost Tribe of Sith following the events of 2974 BBY."}, {"tag": "h2", "text": "Geography and environment"}, {"tag": "p", "text": "Eshkrene was a continent that lay at the bottom of the planet Kesh. Due to its location, Eshkrene had a polar climate and was mainly covered in ice and snow for much of the year. While little is known about the geography of that continent, its northern fringes were habitable enough to support some trees and an unidentified non-sentient mammalian species. Eshkrene was also known to have hills and mountains. Eshkrene was known to have one settlement, known as the City of the Doomed, until 2974 BBY. This small city was home to a Force-sensitive multi-species community known as the Doomed, who lived in isolation from the planet's native Keshiri and the Lost Tribe of Sith for much of their existence. This city also had a series of stables that housed several animals from other parts of Kesh, which were grown and raised as livestock by the Doomed. Other known buildings at the City of the Doomed included the Hall of Regret and an unidentified tower, which stored the Doomed's \"Great Weapon\"—Remulus Dreypa."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "For approximately four thousand years, Eshkrene was home to a small offworld community known as the Doomed, who included members from various different species including S'kytri, Wookiees, Rodians, Chagrians, Twi'leks, and Weequays. The Doomed were the descendants of Dark Jedi and Jedi, whose arrival on Kesh had triggered the cataclysmic Great Calamity which was later remembered by the Keshiri as a great battle between two rival groups of gods: the Skyborn and the Destructors. Members of the Doomed committed their lives to finding true neutrality in the Force and rejected violence, except when it came to hunting. While the polar climate of Eshkrene made it impossible for the Doomed to grow crops, they were known to raise livestock animals at a series of stables in the City of the Doomed, which became their main source of food."}, {"tag": "p", "text": "They also dedicated themselves to maintaining a watchful vigil over the Keshiri and vowed to intervene in the event that the Keshiri were threatened. The Doomed's existence came to an end in 2974 BBY when Remulus Dreypa escaped to Keshtah. In response, the Doomed rallied their forces in an attempt to stop Dreypa but were all killed by the Sith Lord's Leviathan Sithspawn. Following the defeat of Dreypa's rebellion, the City of the Doomed crumbled into ruins since it was only the Doomed's will in the Force which was holding the settlement's ancient buildings together."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}