{"url": "Eskaron", "categories": ["Category:Legends articles", "Category:Eskaron locations", "Category:Thaere sector moons"], "nodes": [{"tag": "h1", "text": "Eskaron"}, {"tag": "p", "text": "Eskaron was a moon of Genarius."}, {"tag": "p", "text": "Originally a habitable moon, Eskaron was perforated by long networks of tunnels created by space worms, which fed on a type of metal within the planet. The worms exposed Eskaron's molten core which expanded and destroyed the local atmosphere, killing several of the worms. Once all of that metal was consumed, the space worms moved on, leaving behind only the tunnels and some remains."}, {"tag": "p", "text": "The tunnels varied in size, from only a few meters up to several kilometers wide. Most tunnels were large enough for starships to fly through, so organized races were set up by Riboga the Hutt since 72 BBY, an activity which continued after Nirama took over Riboga's organization in 53 BBY. Nirama took a cut of the revenues, and also made bets on the results of the race. The races were active in 32 BBY. The governor of Forard city, Klis Joo, was building a racer for the Eskaron races as a hobby at that time."}, {"tag": "p", "text": "The tunnels were also used to test piloting skills and the Blood Velkers gang held rites of initiation there."}, {"tag": "p", "text": "In 32 BBY, there was a track that youth gang Blood Raptors used while Nirama's races were being performed in another part of Eskaron. The Raptor track first went through The Spiral and, after a sharp turn, through the area known as Skinning the Mynock, formed as two figure eights. It then crossed the track of Nirama's race and continued through the Cavern of Teeth and twelve zig-zag turns, before leaving the moon. The first racers could then choose between going to the asteroid belt and back, or visiting the city of Nub Saar before going back to the start point; any other racers were supposed to follow the chosen path."}, {"tag": "p", "text": "At that point, during a race at that track between Raptor Gael Kinner's G-59 Cannibalizer and Rodian intimidated entrepreneur Teeloo's YT-1210 Neeva-Beelo, one of Nirama's racers was destroyed, killing pilot Arraxx. Immediately, Nirama asked for revenge against the responsible people, who were tracked after they finished the race."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}