{"url": "Eso", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Alliance Army officers", "Category:Males", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Eso"}, {"tag": "p", "text": "Eso was a male Trandoshan captain of the Alliance to Restore the Republic who conducted combat activities out of a camp in the Val'Arnos Jungle on Yavin 4 during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Flanking the Empire"}, {"tag": "p", "text": "The male Trandoshan by the name of Eso was alive during time of the major galactic conflict known as the Galactic Civil War, during which the Alliance to Restore the Republic won a decisive victory against the Galactic Empire at the Battle of Yavin in 0 BBY. About 6 months later, the Rebel Alliance evacuated the moon, but Eso remained embroiled in combat against the Empire while stationed out of a camp in Yavin 4's Val'Arnos Jungle. By that time, Eso held the rank of captain in the Rebel Alliance and fought alongside several Rebel commandos, including a marine armor-clad Zabrak sergeant by the name of Yith Seenath. During his time at the camp, a recon team dispatched by Captain Eso found themselves pinned down by unexpected numbers of wetland assault stormtroopers."}, {"tag": "p", "text": "Fortunately for the battle-hardened Trandoshan, an individual loyal to the Rebel cause arrived to Eso's camp and agreed to help him save his men. Eso uploaded the location of known Imperial forces to the Rebel's datapad, and recommended that a stealthy approach be utilized to quietly shoot the Imperials in the back of their skulls. While the operative did succeed in reaching the squad of Imperials, the Rebel was detected by one of the swamptroopers. After shouting that they had been flanked, the rest of the squad opened fire on the Rebel combatant, eliminating any chance of a quick and quiet solution. However, the surprised Imperial forces were no match for the Rebel's superior combat ability, and were eventually killed during the firefight. Although the recon team was rescued, Captain Eso derided the Rebel operative for what he perceived to have been a messy and reckless approach. Nonetheless, he ultimately commended the Rebel for completing the rescue operation successfully."}, {"tag": "h3", "text": "Destroying the Triage Unit"}, {"tag": "p", "text": "Thanks to the efforts of the rescued recon team, a hidden triage camp was discovered out in the dense jungle of Yavin 4. Eso remarked that because of Yavin 4's isolated nature, the Empire did not have the time to take their stormtroopers to a fully operational medcenter. He remarked that out in the battlefield, soldiers would simply throw on bacta-soaked bandages and get back out into battle. To that end, Eso urged the Rebel operative to set out to the triage camp and kill the Empire's field medic. To Eso, medics were not to be seen as non-combat units, but rather active participants of war. The Rebel operative who had helped rescue the recon team was not soft to the realities of war, and agreed to carry out the captain's wishes. The Imperial triage camp was staffed by a single Imperial field medic and equipped with functioning bacta tanks. When the medic sighted the approaching Rebel operative, he shouted for his friends to save him. Out of the brush, a couple wetland assault stormtroopers emerged to open fire on the Rebel. However, their attempt to save the life of their field medic was in vain. Once again, the Rebel operative proved to be more formidable in combat, and all who defended the triage camp were killed. With the triage unit gone, Eso remarked that it would be easier to hunt down additional troopers, and that the Empire might now be unable to come at them with full force."}, {"tag": "h3", "text": "An Infected Wound"}, {"tag": "p", "text": "Captain Eso was faced with the difficult responsibility of dealing with a young, shell-shocked Rebel soldier. Eso believed that the young kid had seen too much fighting and was about to snap. Eso likened this soldier to a rotting wound which endangered his entire body of men. He feared that if the disturbed soldier were to lash out at an inopportune time, it could result in his entire battalion being wiped out by Imperial forces. Eso recognized the sensitive nature of the situation, and asked the Rebel operative to help resolve it. The Rebel operative, who had already eliminated one the Empire's medics, was not the squeamish type. Eso instructed his operative to approach the young soldier, tell him, \"Hey, look over there,\" and shoot him with his back turned."}, {"tag": "h3", "text": "Removing the Wound"}, {"tag": "p", "text": "The Rebel operative set out into the wilderness to locate the shell-shocked soldier, who was a trooper within the Alliance Military. The operative eventually sighted the young man in the thick jungle calling out for his mother to bring him home. Although Eso had instructed the operative to use subtlety in executing the battle-wearied soldier, the maddened Rebel sighted Captain Eso's operative brandishing a blaster, and asked what it was going to be used for. Before he could say anything more, the Rebel operative fulfilled Captain Eso's orders, and shot and killed the Rebel. When the operative returned to Eso to report the news, the Captain simply remarked that they both had blood on their hands, but that the job needed to be done in order to save the rest."}, {"tag": "h3", "text": "Preparing for Evacuation"}, {"tag": "p", "text": "Unfortunately for Captain Eso, summarily executing the young soldier proved to be in vain. Prior to being killed, his cries out to his mother were recorded by Imperial probe droids, allowing them to pin down their camp's location. With their whereabouts compromised, Captain Eso had no choice but to evacuate his fellow commandos. To help buy them some time, Eso ordered the Rebel operative to take out preliminary Imperial scouts seeking to confirm the camp's location. In order the save the lives of Captain Eso's battalion, the Rebel agreed to defeat as many incoming Imperial stormtroopers as possible. When the Imperial scout force sighted the Rebel operative, one of them remarked that they were in the right place, and to start by killing lone the Rebel. Despite facing overwhelming numbers in the face of the preliminary scout force, the Rebel had managed to kill a swath of stormtroopers."}, {"tag": "h3", "text": "Facing the Empire"}, {"tag": "p", "text": "Thanks to the Rebel operative's success in eliminating the preliminary scout force, Captain Eso managed to pull a full evacuation of his soldiers. However, the Empire still knew of their location, and was planning an offensive. Nonetheless, he curtly commended the Rebel operative who had aided him so loyally, and gave one final order to leave the camp for good. Even though Captain Eso believed that a few hundred Imperial troops were incoming, he was determined to stay behind to take care of them himself."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Eso had green scaly skin, and gold colored eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time in the Val'Arnos Jungle, he wore a gray formfitting undershirt beneath a brown camouflage spec-ops duster. He also wore brown paramilitary camo pants and a dark colored helmet which resembled those commonly worn by Rebel forces during the Battle of Endor, including Luke Skywalker and Leia Organa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Eso was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}