{"url": "Espirion", "categories": ["Category:Canon articles", "Category:Planets"], "nodes": [{"tag": "h1", "text": "Espirion"}, {"tag": "p", "text": "Espirion was a planet of the galaxy that was home to a sentient species. Although heavily militarized, Espirion was a known haven to refugees and wanderers, to the point that its natives engineered micro-ecologies to accommodate exotic lifeforms. Long before the Battle of Yavin, a number of Alderaanians, the human inhabitants of Alderaan, established their presence on Espirion. They ended up intermarrying with the locals, giving rise to a race of half-Alderaanians, the Alder-Espirions. As the generations passed, the Alderaanians of Espirion mostly lost contact with their world of origin. However, when Alderaan was blown up by the Galactic Empire, Princess Leia Organa attempted to re-unite those half-Alderaanians with the other survivors."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "From space, the planet Espirion looked like a pale blue sphere marbled with faint pinkish veins. During at least some parts of the year, the sky appeared deep blue from the surface of the planet. Espirion housed at least one city, whose skyline consisted of gently curved white buildings. A number of specifically engineered micro-ecologies coexisted on the planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The native species established a society that, although heavily militarized, was very welcoming to visitors, to the point that they developed micro-ecologies capable of supporting diverse life forms. Several generations before the Galactic Civil War, a number of human inhabitants of Alderaan left their home planet and relocated to Espirion. Those Alderaanians interbred with the natives, which in time gave birth to a population of hybrids called Alder-Espirions. Other species represented on Espirion included the Bith, the Rodians, and the Talz."}, {"tag": "p", "text": "During the Galactic Civil War, a sizable portion of the galaxy was dominated by the autocratic Galactic Empire. In the early stages of the conflict, however, Espirion was free of Imperial presence. Shortly after the battle of Yavin, Espirion received a visit by envoys of Leia Organa, Crown Princess of Alderaan. Since her planet had been destroyed recently, Organa sought to achieve a reunification with the Alder-Espirion. The talks, however, collapsed quickly when one of Organa's envoys caused a diplomatic incident by showing disgust for hybrids. Despite that, when a fleet of vessels housing Alderaanians came under attack from an Imperial-class Star Destroyer in orbit of Espirion, the local population sent one of their own ship, Espirion Multi, to aid the fleet. The Star Destroyer was destroyed, which, Organa feared, would soon bring the Empire to Espirion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Espirion first appeared in the fourth issue of the Marvel comic book series Star Wars: Princess Leia, written by Mark Waid and illustrated by Terry Dodson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}