{"url": "Esseles/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Core Founders", "Category:Esseles locations", "Category:Essesia system planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Perlemian Trade Route", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Esseles"}, {"tag": "p", "text": "Esseles was a planet located along the Perlemian Trade Route in Darpa sector of the Ringali Shell. It was the third in position in the Essesia system and had one moon."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Esseles was under constant volcanic activity by 10,000,000 BBY."}, {"tag": "p", "text": "The planet had a population of 24 billion and was covered in many high, steep, rugged, volcanic mountain chains. The atmosphere was heavy, and so it has a warm, wet climate. It was a large planet, with a diameter of 9,186 mi (14,783 km). Its capital city was Calamar, a cultured city that served as a center for education, art, recreation, and holoproduction. Esseles was known for its beautiful architecture."}, {"tag": "p", "text": "It served as headquarters for Caldrahlsen Mechanicals, DynaCorp, Trinkatta Starships, and Damorian Manufacturing Corporation. Esseles was also the site of one of the Core Worlds' few podracing courses, the Togatto Speedway."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Old Republic era"}, {"tag": "p", "text": "For millennia, Esseles was the hub of a once grand empire known as the Esselian Empire that at one point contained nineteen planets spanning the Darpa Sector."}, {"tag": "p", "text": "It had evolved into a military fortress world by the time the planet became one of the Core Founders of the Galactic Republic. A Jedi Watchman, named Nuck Lyu was on the planet around 25,000 BBY."}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "p", "text": "During the later decades of the Republic, Esseles was represented in the Galactic Senate by Senator Gabrial Atanna."}, {"tag": "p", "text": "During the Clone Wars, an Esselian Separatist-funded government faction declared that the planet had joined the Confederacy of Independent Systems. The planet was retaken from the CIS by a Republic loyalist resistance movement in 21 BBY. Griff Takel was then appointed as Governor of Esseles by the Republic."}, {"tag": "p", "text": "After several millennia of existence, the Esselian Empire eventually collapsed just after the end of the Clone Wars."}, {"tag": "p", "text": "Soon after the Declaration of a New Order, Jedi Master Dass Jennir and the crew of the Uhumele raided Dezono Qua's villa in order to rescue the daughter of Bomo Greenbark."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Esseles was formally ruled by President of the Esselian Hall Cambira Ralle in 0 ABY, but the planet's Imperial governor was still Griff Takel. It was also home to a very active Rebel cell. Although Esseles did not directly contest Imperial rule, the people had a high sense of nationalism with enthusiastic optimism for the future."}, {"tag": "p", "text": "In 1 ABY, Esseles was the site of a series of terrorist attacks that was considered to be the worst atrocities to hit the planet since the Algeran Faction attacks during the rise to power of Emperor Palpatine."}, {"tag": "p", "text": "After the Battle of Endor, Imperial Navy forces were retreating from Esseles when a battle erupted in the outer Essesia system. This battle was the only major battle in this star system during the Galactic Civil War. The Imperials eventually retreated and the planet Esseles joined the New Republic without suffering any damage. It emerged from the Galactic Civil War as a major high-tech industrial center. The planet later returned to Imperial control during Operation Shadow Hand."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}