{"url": "Essowyn", "categories": ["Category:Legends articles", "Category:Essowyn locations", "Category:Terrestrial planets", "Category:Trax sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Essowyn"}, {"tag": "p", "text": "Essowyn was the only planet in the Saurton system. The planet was located in the Trax sector, situated between the Kanawyn and Greawyn asteroid belts."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The surface of Essowyn was mainly covered by a massive ocean, broken up by four large continents, called Sorontill, Baslar, Steltout, and Macor, and a smattering of hundreds of smaller islands. These islands were covered in plains, temperate forests, and small mountains, all of which were completely pock-marked by meteorites that fall in from the surrounding asteroid belts. These constant bombardments made Essowyn a hard place to live, and all structures were built completely underground. The atmosphere's temperature varied drastically, due mainly to the planet's erratic orbit around its sun, a yellow star called Saurton. These temperature fluctuations bred terrible storms at the equator that spread to the rest of the planet, dissipating before they reached the polar zones."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Essowyn became a popular world when mining corporations discovered the valuable ferrous materials in the surrounding asteroid belts. The first of these companies was the massive Messert Mines Corporation; their arrival split the Saurtons into warring factions. Messert quickly arranged to purchase from the Tresycht (one of the local factions) mining rights to the Thergum Pits, an area whose ownership was in dispute between the Tresycht and the neighboring Yistze. Messert sent in a mining expedition along with a few armed starfighter squadrons and subjugated the Yitsze in a matter of weeks. Eventually, all the other factions similarly succumbed to Messert's forces, until the entire planet was under the control of the Tresycht High Priest, Gellack."}, {"tag": "p", "text": "Gellack tried to forge a new government, but eventually decided that re-empowering the priests of the old nations to govern their own 'sectors' would be the most efficient method. This evolved into the current Essowyn government, with the descendants of Gellack sitting on the Council of Elders. Mining companies flocked to the system, claiming parts of the belts as their own and setting up orbital platforms and even small bases on some of the larger asteroids."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Saurtons, a sentient species native to Essowyn, were a hearty reptilian race. Most were golden, or some combination of gold and brown, black, or green. Unlike most reptiles, they were warm blooded, though they reproduced by laying eggs. Their hearty immune system could tolerate a larger-than-usual amount of filth and as such it would usually accumulate in and around their cities."}, {"tag": "p", "text": "The more warlike tendencies of the native Saurton split the population into two factions; the Quenno, those looking back to tradition, and the Des'mar, those looking forward."}, {"tag": "p", "text": "The Quenno were conservative traditionalists. They believed that Essowyn, and the entire Saurton system, should be wrested from the control of the mining corporations and returned to the Saurton people. They espoused the belief that control of all resources should be given to the council of elders, just as it had been for centuries."}, {"tag": "p", "text": "The Des'mar was the younger of the two groups, and its members were fewer in number, but they did have the full financial backing of the mining corporations. The Des'mar wanted Essowyn to continue as it was, with the corporations bringing in galactic trade and culture."}, {"tag": "p", "text": "There were many smaller groups with more temperate ideals, but most believed that the Saurton government was not powerful enough to put down a revolution, should one actually arise. Many groups stockpiled weapons, and secret deals with the mining corporations and the Council of Elders were not uncommon."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Cities"}, {"tag": "p", "text": "Cities on Essowyn were similar to those found on Sullust. Massive caverns were carved out of the planets crust, usually no less than one hundred meters from the surface. These caverns contained the rooms, buildings, city squares, markets, and other structures found on the planet. All of these cities had tunnels leading to the surface. After the advent of the hyperdrive, many cities under the surface of Essowyn chose to excavate large caverns to house starships."}, {"tag": "p", "text": "Dangerous and disease-causing bacteria were a mainstay of the underground cities of Essowyn, mainly due to the amount of squalor that the native Saurton could tolerate. Most Humans and other aliens had to take precautions in order to avoid contracting one of several communicable diseases found on the planet."}, {"tag": "h3", "text": "Mining Corporations"}, {"tag": "p", "text": "Mining companies were granted charters to specific territories for a set number of years, and exercised complete authority in those areas, known as Corporate Complexes. In exchange, the Saurton government got a hefty percentage of the profit, which was due mostly to excavations of the metal quadrillium. Corporate Complexes were complete cities, and as such were completely autonomous."}, {"tag": "p", "text": "The actual mines themselves were very dangerous and cramped. There was little light or air, and caves collapsed all the time. Most of the work is done by droids, and what few living creatures ventured into the mines ddid it because the danger brought with it an increased level of compensation."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}