{"url": "Eta-5_interceptor", "categories": ["Category:Legends articles", "Category:A-wing models", "Category:Galactic Alliance starfighter classes", "Category:Kuat Drive Yards products"], "nodes": [{"tag": "h1", "text": "Eta-5 interceptor"}, {"tag": "p", "text": "The Eta-5 interceptor was a type of interceptor in use by the New Jedi Order and the Galactic Alliance Navy as of 40 ABY. Developed by Kuat Drive Yards, it was a descendant of the Eta-2 interceptor, but it was also regarded as a type of A-wing."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Built by Kuat Drive Yards, the Eta-5 possessed a pair of wing arrays similar to its Eta-2 predecessor, but had an overall hull shape in line with A-wings, with solar panels mounted on struts extending from midway up the fuselage. The interceptor had a cramped cockpit equipped with rocker arms on the seat, and was powered by twin ion engines, giving it top-of-the-line speed and maneuverability, but it had light armor and minimal shielding. It was equipped with dual fire-linked concussion missile launchers, twin laser cannons, and advanced computer-aided targeting systems, giving the Eta-5 considerable punching power when it needed to engage small capital ships. Due to its wedge-shaped hull, the Eta-5 was referred to as an A-wing by some pilots."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 40 ABY, Wedge Antilles's daughter, Syal Antilles, flew this model when she entered the Galactic Alliance military under the name of Lysa Dunter. She joined VibroSword Squadron based out of the Galactic-class battle carrier Dodonna and flew as VibroSword Seven during Operation Roundabout at Corellia before the onset of the Second Galactic Civil War. However, she was forced to pull out of the squadron due to illicit Corellian activities, and was reassigned to serve as a pilot for the new Aleph-class starfighters."}, {"tag": "p", "text": "Pilot Rhysati Ynr made use of an Eta-5 during Lando Calrissian's mission to prevent the destruction of Kessel, and loaned it briefly to Wedge Antilles when he expressed an interest in flying it. Wedge later used the fighter to protect the Millennium Falcon from an energy spider."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eta-5 interceptor made its first appearance in the 2006 novel Legacy of the Force: Betrayal. In the 2007 novel Star Wars: Legacy of the Force: Legacy of the Force: Fury, Syal Antilles reflects that her combat experience has been limited to \"A-wings and Alephs\". As she had seen battle in Eta-5s and Alephs in the earlier novel Legacy of the Force: Betrayal, this references the fact that the Eta-5 was in fact, in part, a derivative of the earlier RZ-1 A-wing interceptor from Incom Corporation as well as being a descendant of the Eta-2 interceptor. This implication is continued in detail in the 2009 Fate of the Jedi novel Fate of the Jedi: Outcast, in which the Eta-5 is described as appearing similarly to an A-wing fighter, with strut-mounted solar panels protruding from midway up the fuselage."}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia mentions that the Eta-5 was also utilized by the New Jedi Order, but no source has ever depicted this."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}