{"url": "Eta-class_shuttle", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Eta-class shuttles", "Category:Galactic Republic starship classes", "Category:Jedi Order starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Eta-class shuttle"}, {"tag": "p", "text": "The Eta-class shuttle, also known as the Jedi ambassador shuttle or Republic ambassadorial shuttle, was a model of shuttle manufactured by Cygnus Spaceworks and used by the Galactic Senate and the Republic Ambassadorial Corps for diplomatic missions, and was later utilized by the Jedi Order during the Clone Wars. The Dark Lord of the Sith Darth Sidious used the Republic executive shuttle, a variant of the Eta-class, as his personal shuttle."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Introduced before the outbreak of the Clone Wars between the Galactic Republic and Confederacy of Independent Systems, Cygnus Spaceworks' Eta-class shuttle was study in stylish utility. A relatively small shuttlecraft at 14.2 meters in length, the Eta-class was initially designed for the Republic Ambassadorial Corps and the Galactic Senate as a VIP transport, and costed 100,000 credits. However, with the outbreak of the war on Geonosis, the shuttle were pressed into service by both the Grand Army of the Republic and the Jedi Order. Some were outfitted with three hidden triple light laser cannons and stealth systems for use as black ops ships."}, {"tag": "p", "text": "Eta-class shuttles could carry ten passengers in comfort, along with their baggage of up to 100 metric tons for capacity and two months worth of consumables. In addition to their cargo, the Eta-class was sold with a pair of on-board folding Undicur-class jumpspeeders. The shuttle was also equipped with short-range sensors and a navigation computer, as well as a Class 2 hyperdrive generator with a Class 12 backup generator, while also boasting a maximum atmospheric speed of 750 kilometers per hour."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eta-class shuttle first appeared in \"Grievous Intrigue,\" the  ninth episode of the animated television series Star Wars: The Clone Wars' second season, which originally aired on January 1, 2010. The shuttle was later first identified in the 2018 reference book Star Wars Encyclopedia of Starfighters and Other Vehicles, written by Landry Q. Walker and published by Dorling Kindersley."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}