{"url": "Eta-2_Actis-class_interceptor", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starfighter classes", "Category:Eta-2 Actis-class interceptors", "Category:Galactic Republic starfighter classes", "Category:Imperial starfighter classes"], "nodes": [{"tag": "h1", "text": "Eta-2 Actis-class interceptor"}, {"tag": "p", "text": "The Eta-2 Actis-class interceptor, also known as the Jedi interceptor or Jedi starfighter due to its extensive use by Jedi pilots, was a Republic starfighter used late in the Clone Wars that shared design elements with the Republic's Delta-7 and Delta-7B starfighters, as well as the TIE fighters of the later Galactic Empire. The Galactic Alliance would later come to utilize a successor, the Eta-5 interceptor."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "At 5.47 meters in length, the Eta-2 was significantly shorter than the already diminutive Delta-7. The new fighter's mass was further reduced by removing much of the forward space-frame, leaving the front of the ship in a forked shape. Like its predecessor, it was also too small to hold an onboard hyperdrive. Because of this, the Eta-2 had to rely on carrier vessels or Syliure-45 hyperdrive modules for long-distance travel. However, the Actis did have a full astromech droid socket, instead of a truncated unit as was seen in the early models of Aethersprite starfighters."}, {"tag": "p", "text": "Like the simultaneously developed ARC-170 and Alpha-3 Nimbus-class V-wing starfighters, the Eta-2 incorporated S-foils to radiate excess engine heat in the thick of combat, reducing the likelihood of damage to the craft. Occasionally, though not always, the lifting panels were opened during normal flight to further reduce stress on the engines."}, {"tag": "p", "text": "Such a design element carried with it certain flaws, however; this area of the hull was lightly armored, and extremely vulnerable to laser fire and buzz droid sabotage."}, {"tag": "p", "text": "This design element would be carried on through the radiator panels of later TIE fighters which, unlike the Eta-2's foils, were locked in static positions but essentially served the same purpose."}, {"tag": "p", "text": "Thanks mostly to the fact that its development occurred in the midst of a galactic civil war, the Eta-2 had more firepower at its disposal than the Delta-7 and Delta-7B—two large laser cannons and two ion cannons. While the size of its guns provided it with respectable firepower, the fighter's limited power systems restricted its ability to fire continuously. Raith Sienar's twin ion engine design allowed the Eta-2 to achieve a maximum acceleration of 5,200 g. Unlike the Delta-7 and Delta-7B, the standard Eta-2 was not equipped with shields, as Sienar reasoned that agility and speed were its best defense. However, a later variant did include shields, as well as slightly heavier armor and a stronger hull."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The Eta-2 Actis was designed by Kuat Systems Engineering, following up on its success with the Aethersprite. It included and improved upon many design elements of the latter. The only prominent drawback was apparent in the removal of shields, though this trade-off reduced production cost and lightened the craft. A number of Jedi Knights voiced strong opposition to the new craft's lack of shielding, causing a shielded and more resilient variant to be developed. More importantly, it was much smaller than its predecessor, allowing far more Eta-2 ships to fit into hangars that could only hold a handful of Delta-7 and Delta-7B craft. The standard fighter complement of a Venator-class Star Destroyer included 192 Eta-2 interceptors."}, {"tag": "p", "text": "The first prototype of the craft was deployed during the initial skirmishes with the Valahari people, and the craft was used by Anakin Skywalker to combat the advanced Tempest Zero starfighter used by Tofen Vane. The prototype proved itself in the Battle of the Veil Nebula where it managed to shoot down Vane's craft and thus aid in a Republic victory against the Separatist forces. This concept led to much wider production and widespread deployment in the Republic Navy than the Delta-7 and Delta-7B had seen, since the Delta-7 and Delta-7B had been designed exclusively for the Jedi. It would also inspire the design and size rules that made the TIE fighters of the later Empire so cheap, modular, and effective."}, {"tag": "p", "text": "Eta-2s that were flown by the Jedi were usually stripped down for even faster performance. Heavy sensors and flight instruments were removed, since they were unnecessary for a pilot with precognitive Force abilities. While most Jedi pilots flew Eta-2s more in line with the factory standard, such as Obi-Wan Kenobi, whose fighters were red- or blue-hued against a white undercoat, some chose to customize theirs with unorthodox color schemes.\nAnakin Skywalker's first craft was painted a bright yellow color against a metallic undercoat. He maintained that this was a tribute to his childhood podracer, but some believed that the bright hue was designed to draw attention to himself in battle. Unfortunately, Skywalker lost his fighter in the Battle of Coruscant, and he later flew temporarily under a more standard green and white paint scheme, which he used in the Mission to Mustafar. Saesee Tiin's interceptor was green, and Mace Windu's had purple coloring."}, {"tag": "p", "text": "Kuat Systems Engineering made sure to provide the Jedi with variants of the Eta-2 within months of its introduction. After making so many different versions of the Delta-7 Aethersprite-class light interceptor, the manufacturers tested new models even before receiving feedback from Jedi pilots using the Eta-2 in actual combat. The first of these was a high-maneuver variant based on a similar modification to the Delta-7. Later, a heavy-defense variant was also created after renowned pilot Saesee Tiin removed a number of unnecessary offensive systems from his own Eta-2. Although unpopular at first, this version of the starfighter gained a more positive reputation after it saw use during the Battle of Coruscant."}, {"tag": "p", "text": "During the late stages of the Clone Wars, another variant was introduced. It was equipped with a triad of thrusters, and lacked an astromech socket. This version was primarily flown by clone pilots."}, {"tag": "h3", "text": "Imperial era"}, {"tag": "p", "text": "The Eta-2 became one of the first starfighter models in use by the Imperial Navy. Squadrons of Eta-2s flew in formation above Coruscant as part of the security detail after the Galactic Empire had been established.\nWhen Anakin Skywalker became Darth Vader, he would receive a new black Eta-2. Vader piloted this Eta-2 during some of his early missions for Emperor Palpatine as the Great Jedi Purge continued, sometimes flanked by V-wing starfighters. Vader was assisted in the new fighter by R4-K5."}, {"tag": "p", "text": "Elements of the Eta-2 Actis design were used in the creation of the Sienar Fleet Systems line of TIE starfighters—most notably the vertical radiator panels and twin ion engines, as well as the spoked viewing port; this was expanded in the Eta-2's TIE successor to become the fighter's main viewport."}, {"tag": "p", "text": "However, the greatest legacy of the Actis-class was the philosophy behind it—that smaller, more nimble, unshielded, and relatively under-equipped fighters, when mass-produced, could be ultimately more effective than a lesser quantity of costlier, bulkier, well-armed, and better-protected starfighters. This had been demonstrated in the Battle of Coruscant where more heavy fighters suffered significant losses at the hands of lighter, more agile fighters. This opinion principally ushered in the dominance of the TIE series, and inevitably spurred the phasing-out of superior-quality fighters like the ARC-170."}, {"tag": "p", "text": "This decision would come back to haunt the Imperial Navy, however, when the ARC-170's successor, the T-65 X-wing starfighter, proved superior to the TIE/LN swarms of the Empire and was pivotal in the defeat of the Empire in the Galactic Civil War. One difference between the Clone Wars and Galactic Civil War was that most Eta-2 pilots were Jedi and were able to survive due to the Force and good skill; TIE pilots were well-trained, but few—if any—had an affinity for the Force and so casualty rates were higher than in the Clone Wars. Most Eta-2 pilots gaining experience were able to hone their skills to veteran levels, but the high casualty rate of TIE pilots prevented them from developing any further."}, {"tag": "p", "text": "During the Galactic Civil War, some Eta-2s still remained operational in the Imperial Navy and were reserved for skilled pilots. Others were captured and used by the Rebel Alliance and other various parties, with similar requirements. The Lonely Five, owned by Jedi Knight Rachi Sitra, was used by the Rebel Alliance."}, {"tag": "h3", "text": "Design legacy"}, {"tag": "p", "text": "During the establishment of the Galactic Alliance, a successor series known as the Eta-5 interceptor was used in the Second Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Designed for Revenge of the Sith, the Eta-2 interceptor is one of many aspects of the film designed to bridge the gap between RotS and the original trilogy. Intended to be reminiscent of both TIE Fighters and Vader's TIE Advanced x1 from A New Hope, the designers of the fighter included the segmented cockpit window of the original TIE Fighter as well as the bent wing formation and targeting systems seen on Vader's personal starfighter in ANH."}, {"tag": "p", "text": "The prototype Eta-2 model that Anakin Skywalker pilots in the Hero of the Confederacy arc is based on actual concept art of the Eta-2 designed for Episode III: Revenge of the Sith; this artwork can be viewed in the 2005 book The Art of Star Wars Episode III: Revenge of the Sith."}, {"tag": "p", "text": "There is some discrepancy about when the Eta-2s were introduced. In the 2005 series Star Wars: Clone Wars, Anakin is first shown piloting his interceptor, immediately after his knighthood ceremony in Chapter 21. On the other hand, a later source, The Clone Wars 12, shows the first prototype of the Eta-2 when Anakin is already well into his knighthood and has Ahsoka as his Padawan."}, {"tag": "p", "text": "In Labyrinth of Evil, Anakin's and Obi-Wan's Eta-2 interceptors are described as being equipped with missile launchers. This discrepancy with official technical specifications has not yet been explained, but is partially answered with a source listed below. The Hasbro-brand Jedi Starfighter action vehicles feature launching missiles, and in the Star Wars PocketModels Trading Card Game, a game piece depicting Obi-Wan Kenobi's Jedi Interceptor is indicated as carrying proton torpedoes. Eta-2s in Star Wars: Battlefront II also include missile launchers; this is attributable to game mechanics, as the standard vessel is not equipped with them. Starships of the Galaxy explains that some few Eta-2s were equipped with up to four concussion missiles. This was a rare modification that usually required removal of the ion cannons and was only carried out for special missions."}, {"tag": "p", "text": "Moreover, inconsistencies regarding the actual placement of the laser cannons have arisen in certain sources; in Star Wars Battlefront: Renegade Squadron and Darth Vader and the Lost Command 2, the laser cannons are shown to occupy what should be the ion cannon positions. In the former source, missile launchers are shown to be placed between the forward tines, reinforcing Labyrinth of Evil's statement. However, both cases could be defined as game mechanics and special modifications respectively."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}