{"url": "Eta-class_supply_barge", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Empire starship classes", "Category:Telgorn Corporation products", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "Eta-class supply barge"}, {"tag": "p", "text": "The Eta-class supply barge was a type of supply barge used by the Galactic Empire during the Imperial occupation of Jedha to transport kyber crystals that powered the Death Star's superlaser. Larger than the Zeta-class Heavy Cargo Shuttle, the Eta-class could hold multiple pods aloft on a dorsal cargo bed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Telgorn Corporation presented both the Eta-class supply barge and the Zeta-class Heavy Cargo Shuttle as a complete system of logistics vessels. As a result of this, the Galactic Empire rewarded the corporation with a major Imperial Navy contract for logistics modernization, and was introduced during the final months of the Death Star's construction. The Eta-class was primarily used for strategic spacelift between logistics bases unlike the Zeta-class, which was utilized as tactical delivery to the front line. During the Death Star's construction, it was also used to transport secret cargo along Project Stardust's covert supply lines."}, {"tag": "p", "text": "One of the key features of both the Eta-class and Zeta-class vessels was the commonality of containers between both ships, which allowed cargo to be sealed and certified at its point of origin and only opened at its destination, despite the possibility of the cargo being transferred between multiple vessels en route to its receiver. Befitting its role in the Imperial logistics chain, the supply barge boasted highly reliable systems, good shields, and significant cargo capacity at the expense of its speed and offensive capabilities."}, {"tag": "p", "text": "The Eta-class mounted racks on both its dorsal and ventral sides, which held twenty and forty-five containers at maximum, respectively. Though Telgorn included mountings for turrets to the fore and aft of the container racks, the Imperial Navy chose not to mount weapons onboard the supply barge, instead relying on dedicated escorts to protect the shipment. This was due largely to research originating from the Prefsbelt Academy, though hotly debated among naval theorists, that states that crews of armed transports, such as the Gozanti-class cruiser, needlessly endanger their cargo in an attempt to up their kill counts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}