{"url": "Etahn_A%27baht", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Admirals and generals", "Category:Dorneans", "Category:Males", "Category:New Republic Defense Fleet admirals", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Etahn A'baht"}, {"tag": "p", "text": "Etahn A'baht was a pragmatic career naval officer, devoted to military service. A male Dornean, he served in the Dornean Navy with distinction, rising to command the entire eighty-ship force and using it to keep the Galactic Empire from conquering Dornea. He fought with the Alliance to Restore the Republic at the Battle of Endor, but Dornea declined to join that body or the New Republic until after A'baht had driven the Empire from Dornean space entirely."}, {"tag": "p", "text": "When Dornea joined the New Republic, A'baht was recruited into the New Republic Defense Fleet. He defeated Imperial Admiral Gilad Pellaeon's forces at the Battle of Celanon in 13 ABY and, in 16 ABY, he became the inaugural commander of the New Republic Fifth Battle Group, which was quickly put to the test in the Black Fleet Crisis. Despite causing President Leia Organa Solo to doubt his judgment when he became irritated with her reluctance to consider the Yevetha a threat, A'baht was fully backed by Supreme Commander Gial Ackbar and regained Organa Solo's confidence. He led the Fifth Fleet, and later a double-sized combined force, against Viceroy Nil Spaar of the Duskhan League, defeating the Yevetha in the Battle of N'zoth."}, {"tag": "p", "text": "A'baht later left command of the Fifth and accepted a demotion to brigadier general. He remained an important officer in the fleet, and served as one of the top strategic advisors to Supreme Commander Sien Sovv during the early Yuuzhan Vong War, urging Sovv to abandon his strategy of defending only strategically vital worlds and leaving the rest to fend for themselves. When his superiors failed to listen, A'baht resigned his commission and returned home to defend Dornea."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "h4", "text": "Dornean career"}, {"tag": "p", "text": "Born on Dornea prior to 84 BBY, Etahn A'baht joined the Dornean Navy. Dorneans had lifespans of some three hundred years, and by the time of the Galactic Empire, A'baht was middle-aged. By that point a very highly-placed fleet officer, A'baht led Dornea in resisting Imperial domination. The remote world was strongly defended, and the Empire never sent sufficient force to subdue Dornea. A prolonged state of cold war existed between Dornea and the dominant galactic power, in which A'baht kept the Empire from Dornea. During his time in the Dornean Navy, A'baht became close friends with a fellow officer, Kiles L'toth, and at some point saved his life."}, {"tag": "p", "text": "Shortly before the Battle of Endor in 4 ABY, the Dornean Navy was approached by the Alliance to Restore the Republic, looking for naval power to add to its strike against the second Death Star. The Dornean government agreed to send two of its brand-new, powerful Braha'tok-class gunships, and A'baht was selected for the mission. A'baht commanded the Torktarak, while his good friend L'toth commanded the Braha'tok. The two ships served in the fleet's attack on the Death Star during the Battle of Endor, and A'baht used the Torktarak to eliminate the Carrack-class cruiser Eminence in an attack from the rear when it threatened the Braha'tok. A'baht continued to guard L'toth as his fellow officer led the Braha'tok in rescuing survivors from the destroyed Mon Calamari Star Cruiser Liberty."}, {"tag": "p", "text": "After the battle, A'baht returned victorious to Dornea, where he was promoted to the rank of general. L'toth, on the other hand, retired. When the Empire found itself pressed by the New Republic, A'baht, the commander of the Dornean Navy, led the Dornean offensive that saw the entire eighty-ship Dornean Navy completely rid Dornea of the Imperial presence."}, {"tag": "h4", "text": "Command of the Fifth Fleet"}, {"tag": "p", "text": "By 13 ABY, Dornea had joined the New Republic. Due to his extensive military experience and performance against the Empire, A'baht was recruited into the New Republic Defense Fleet. He was allowed to keep his Dornean-style rank of general rather than being commissioned as an admiral. In 13 ABY, the Imperial Moffs ordered Admiral Gilad Pellaeon to launch an offensive against the New Republic, leading him to clash with A'baht at the Battle of Celanon, where A'baht defeated Pellaeon's forces and destroyed the Star Dreadnought Reaper. In 16 ABY, A'baht was given command of the New Republic Fifth Battle Group, a brand-new force of New Class ships. As A'baht was not used to commanding the less consistently organized masses that comprised the other four New Republic fleets, it was felt that the orderly Fifth was a natural command for him. While there was some discontent with A'baht's appointment to such a significant command after only two years of experience with the fleet, Supreme Commander Gial Ackbar was a great proponent of A'baht and vigorously defended the general as having vital experience in holding and assaulting worlds."}, {"tag": "p", "text": "A'baht took the brand-new Fifth, which was designed with planetary assault of recalcitrant Imperial fortress worlds in mind, on an exercise at Bessimir against automated defenses. From the Endurance-class fleet carrier Intrepid, his flagship, A'baht commanded the shakedown exercise. His battle plan went off without any significant flaws as the Council on the Common Defense, President Leia Organa Solo, Ackbar, and several senior officers watched via relay on Coruscant. The live-fire exercise concluded smoothly, and A'baht reported on it with a recommendation that the Fifth be made formally operational. His recommendation was put into action when he brought the fleet back to Coruscant. The fleet was held at Coruscant to help protect it as the First Fleet and Second Fleet rotated assignments, and the Second took over the capital's defense. It was planned that the Fifth would soon move out on a goodwill patrol of the Seventh Security Zone, patching up minor problems."}, {"tag": "h3", "text": "The Black Fleet Crisis"}, {"tag": "h4", "text": "The threat of the Black Fleet"}, {"tag": "p", "text": "When a complete Imperial order of battle was found in the wreck of the Star Destroyer Gnisnal, however, it was discovered that forty-four ships, including three Super Star Destroyers, from Black Sword Command were unaccounted for and could pose a significant threat. A'baht and Ackbar presented the findings to Organa Solo, who believed the New Republic could deal with such a menace, if one even existed. A'baht and Ackbar argued strongly to convince her that the New Republic needed to act to search for the Black Fleet in the Hatawa sector and Farlax sector, in which they had last been stationed, and recommended that the Fifth be dispatched for that task. A'baht was deeply frustrated when Organa Solo approved the search but exempted the Koornacht Cluster from examination due to the ongoing negotiations with the Yevetha, who claimed Koornacht and refused to allow the New Republic inside. Nevertheless, the political considerations remained in place."}, {"tag": "p", "text": "During her negotiations, however, Organa Solo gave the list of missing ships to Nil Spaar, the Yevethan viceroy, and he assured her that most of them had been destroyed in the Imperial evacuation of Koornacht. The President pushed to cancel the search, further aggravating A'baht, who began to consider her unreasonably naive and trusting. The pair clashed, and it took the full weight of Ackbar's reputation to convince Organa Solo to allow the Fifth Fleet to go ahead with the search and not merely take Spaar's word. Organa Solo, however, had lost confidence that A'baht would respect her orders and concerns, and decided to send her husband, General Han Solo, along on the mission to provide her a voice in the Fifth Fleet."}, {"tag": "p", "text": "Just before A'baht departed, Ackbar arranged a meeting at his home between A'baht and Admiral Hiram Drayson, the leader of the supremely secret Alpha Blue intelligence department. Drayson was deeply concerned by the Yevetha's secretive nature and did not trust them any more than A'baht did. He gave A'baht a comm code that would allow the general to communicate with Alpha Blue without anyone else knowing. The Dornean was deeply uncomfortable with concealing information from his superiors, but neither he nor Drayson had confidence in Organa Solo's judgment regarding the Yevetha, and he reluctantly agreed to learn the code. He also caved to Drayson's suggestion that he contact L'toth, who had become the head of the Astrographic Survey Institute, and A'baht prevailed upon L'toth to send some of his survey ships to scout the Koornacht Cluster immediately, calling in the debt L'toth owed him for saving his life."}, {"tag": "p", "text": "When A'baht transferred up to the Fifth, waiting in orbit to depart, he learned that Solo was aboard, and rumor was that he would take over command of the fleet. A'baht went to see the other general and find the truth, which was that Solo had no desire to take over command. He was merely there to reassure the Chief of State. Though A'baht knew he did not enjoy her confidence, he was not particularly upset by Solo's presence, as the other man wanted to work with and not against him."}, {"tag": "h4", "text": "Relieved of command"}, {"tag": "p", "text": "After A'baht was in the Hatawa sector some two months, he was contacted by Drayson, who relayed to him the fact that Spaar had left Coruscant after broadcasting claims that the New Republic was acting against the Yevethan Duskhan League. Spaar displayed the wreckage of one of L'toth's survey ships, which he claimed was a New Republic spy craft that had self-destructed. A'baht tried to speak with Organa Solo, but she was completely out of contact. After a long wait, the President contacted him and, upon A'baht's admission that he had requested the survey knowing she would disapprove, relieved him of command and ordered General Solo to return the Fifth to Coruscant. Solo, on hearing A'baht's explanation, was convinced that the Yevetha were dangerous, and that the survey ship had found something important, likely elements of the Black Fleet. He made the decision to leave the Fifth's prowlers and surveillance resources in the area."}, {"tag": "p", "text": "On his return to Coruscant, A'baht offered his resignation to Organa Solo and apologized, then awaited the consequences. Meanwhile, one of the Fifth's prowlers found Plat Mallar. A resident of Polneye in the Koornacht Cluster, he had seen the Yevetha strike as soon as the Fifth Fleet turned back, annihilating his world's population. Plat fled in a TIE interceptor with recordings of the xenophobic Yevethan attack on his world. Combined with additional evidence that the Yevetha were exterminating all other life within the Koornacht Cluster, Organa Solo agreed to send the Fifth Fleet to protect the worlds along its borders, and on her husband's advice restored A'baht to command. She came to visit him personally, apologizing and turning the Fifth back over to him. A'baht was quite embarrassed by the apology, but happily returned to command, taking the Fifth, which had remained on high alert, back to Farlax sector at once."}, {"tag": "h4", "text": "Return to Koornacht"}, {"tag": "p", "text": "When they arrived, they took up position in a cordon outside Koornacht, making a show of force. A'baht was uneasy with the fact that the Yevetha were almost certainly observing the Fifth, but resigned himself to it. He immediately prepared a report to Ackbar requesting additional assets, especially Interdictors, and units dispatched to protect the worlds on the Cluster's border directly. He also requested permission to take up a more effective blockade position with the Fifth. When no reinforcements came due to political deadlock on how to deal with the situation, A'baht was forced to dispatch elements of his fleet to guard Wehttam and Galantos, the two most endangered worlds. He was contacted by Drayson, who suggested that Organa Solo would need indisputable intelligence on the Yevetha, something not coming from Alpha Blue's covert sources, to help justify stronger action against the Yevetha. Drayson further suggested that A'baht might find such intelligence in Zone Nineteen. He declined, however, to accept Drayson's recommendation that he station small ships at all the inhabited worlds along Koornacht in a token presence that might come under attack and thereby justify a New Republic declaration of war; A'baht was unwilling to use his men as bait."}, {"tag": "p", "text": "A'baht's ferret in Zone Nineteen was able to record a Yevethan transmission containing a holographic recording of the attack on the world of Doornik-319, also known as Morning Bell. He forwarded the holograms to Organa Solo, who was able to use them to gain enough consensus to issue a declaration to the Duskhan League demanding their withdrawal from the worlds they had seized. A'baht kept his fleet on high alert as the New Republic waited for the Yevethan response. None came, but Alpha Blue assets were able to detect that the Yevetha were fortifying their captured worlds. There would be no withdrawal. In response, A'baht was ordered to blockade Doornik-319 and led a task force there personally to enforce the blockade."}, {"tag": "h4", "text": "Escalation"}, {"tag": "p", "text": "On arriving, A'baht set up his blockade but was surprised and suspicious to find no Yevethan ships in orbit or on Doornik-319. His suspicion was proven right when they were almost immediately ambushed by ground fire and a Yevethan fleet that micro-jumped into the New Republic formation. However, he had prepared for such an eventuality, and had his ships retreat from their compromised position while Task Forces Aster and Blackvine jumped into the system and engaged the ambushers. However, the Yevetha began broadcasting the appeals of hostages within their ships, causing enough of the attacking bombers to hesitate that the enemy fleet remained intact. A'baht was forced to call a retreat."}, {"tag": "p", "text": "Now that a state of war existed, Coruscant sent several ships to reinforce the border worlds, and A'baht proposed that he send scouts on flash passes through all the Yevethan worlds in order to gather as much data as possible on the opponents he faced. On the basis of the information about Yevethan strength that the reconnaissance runs gathered, Coruscant detached five task forces from the other fleets of the New Republic, doubling its strength in Koornacht. Han Solo was sent to command the combined force, but his shuttle was pulled from hyperspace on its way to the Fifth by the Yevetha, tipped off by the treasonous actions of Senator Tig Peramis, which remained undiscovered. Solo was captured."}, {"tag": "p", "text": "A'baht had the incident investigated, and retained command of the combined task force as the senior officer present. However, he believed that Coruscant high command had no confidence in him and expected to be replaced shortly. He conferred with the five new task force commanders, one of whom was Commodore Farley Carson of Task Force Apex from the New Republic Fourth Battle Group, a friend to A'baht. Carson assured A'baht that the other task force commanders believed that A'baht was perfectly up to the task and had full faith in his command skills. A'baht integrated the newly arrived task forces' intelligence assets into a centralized command reporting to Colonel Mauit'ta, his intelligence officer, and funneled all tactical duties through Colonel Corgan, his staff tactical officer. A'baht also decided that, due to Yevethan strength, no ships would be deployed in a strength less than two task forces. Furthermore, he decided to take the fleet into the fringes of the Cluster, making it harder for the fleet to be found and easier to keep an eye on the Yevetha. They would also search Doornik-1142 for one of the three missing Imperial shipyards that had been located in the Koornacht Cluster."}, {"tag": "p", "text": "One shipyard was found and destroyed by a small patrol under Commodore Turk Brand of Task Force Aster, the first successful engagement against the Yevetha. Thereafter, facing political pressure at home, Organa Solo declared war on the Yevetha, directing A'baht, whom she confirmed as combined force commander, to drive the Yevetha from their conquered worlds and neutralize the Yevetha as a threat to peace. A'baht prepared an assault on Doornik-319 and stepped up his searches for the remaining shipyards. Fleet command considered sending A'baht to attack the Yevetha over N'zoth, their capital, as cover for a Jedi commando raid to free Solo, a proposal of which A'baht was highly dubious."}, {"tag": "h4", "text": "Operation Strong Hand"}, {"tag": "p", "text": "Before any rescue mission was launched, Luke Skywalker approached the fleet, requesting a meeting with A'baht. The reclusive Jedi Master presented his companions, Wialu and Akanah Norand Goss Pell, two of the Fallanassi Force-users. They had the ability to create massive illusions, and Skywalker proposed that A'baht make use of their skills to intimidate the Duskhan League into a quick resolution to the war. A'baht, Corgan, Mauit'ta, and Captain Morano of the Intrepid remained skeptical, unwilling to depend on something they could not understand for their battle plan. Wialu provided a demonstration, generating an entirely convincing illusion of an incoming fleet. A'baht was impressed, but the matter was quickly put aside by the arrival of the Millennium Falcon, bearing General Solo. Chewbacca and his relations had pulled off a daring rescue of the captured general, who was quickly taken to a bacta tank as A'baht informed Organa Solo of the escape."}, {"tag": "p", "text": "A'baht drew up Operation Strong Hand, a battle plan for a strike against N'zoth, where the strongest Yevethan fleet was located, using Wialu's powers of illusion to bolster their forces with phantom ships. A strike at Doornik-319 would provide a distraction the day before the attack, and strikes at Wakiza, Tizon, Z'fell, and the recently-discovered shipyards at Tholaz would be carried out simultaneously with the attack on N'zoth. A'baht offered Skywalker a role in the battle as a fighter pilot, but was surprised and disappointed when Skywalker turned him down, citing his need to be with the Fallanassi."}, {"tag": "p", "text": "A'baht presaged his fleet's arrival with that of several probes, attracting Yevethan attention for the arrival of his combined force, at which point he issued a final ultimatum demanding Yevethan surrender. Spaar answered defiantly, but A'baht was soon puzzled by the deceleration of all the Black Fleet ships in Spaar's armada. As the Imperial ships turned away from combat, A'baht received a transmission from Major Sil Sorannan, who explained that he and the other Black Sword Command survivors who had been used by the Yevetha as slaves had taken control of the fleet and were withdrawing. A'baht had a difficult time believing this, as the Yevethan thrustships continued attacking and the chain of command appeared intact despite the loss of Spaar's flagship. A'baht committed to the fight against the thrustships, but remained on guard for the ambush he expected to come. Sorannan had told the truth, however, and no ambush came. In the long, hard-fought battle against the well-shielded thrustships, A'baht's friend Carson was killed. Casualties were high, and the Yevetha fought to the bitter end, using suicide tactics as they reached the last gasp, but the Battle of N'zoth was a New Republic victory."}, {"tag": "p", "text": "The events of the other simultaneous battles were identical, with the Imperial ships disappearing and the Yevetha refusing to surrender. A'baht was disgusted at the loss of life, but he felt that it had been absolutely necessary to destroy the threat posed by the ferocious Yevetha. When the Fallanassi departed, A'baht saw them off, and returned to the duty of overseeing the pacification of the Yevethan worlds. The Yevetha were stripped of their capacity to make war, but largely left alone, isolated in the Koornacht Cluster and closely watched."}, {"tag": "p", "text": "While A'baht had seen the Fifth Fleet through the Black Fleet Crisis, he was eventually relieved of command and replaced with L'toth. He was also demoted to the rank of brigadier general. He did not leave military service, however, and became an advisor to the New Republic Defense Force high command."}, {"tag": "h3", "text": "The Yuuzhan Vong War"}, {"tag": "h4", "text": "Debate in the ranks"}, {"tag": "p", "text": "In 25 ABY, when the Yuuzhan Vong invaded from outside the galaxy, A'baht was one of the senior officers participating in conferences on war strategy. He sought hard data on the strange, biotechnology-using attackers and was disappointed by the flimsy nature of available intelligence. At a briefing on Kuat by Colonel Ixidro Legorburu on the matter, A'baht pushed for more information and looked to be able to take a more aggressive stance against the invasion. The meeting, with Supreme Commander Sien Sovv present, was interrupted by news of the capture of a Yuuzhan Vong defector, the priestess Elan. The defection failed to provide the information A'baht hoped to gain, however, as Elan's defection proved to be a ruse aimed at assassinating the Jedi leadership."}, {"tag": "p", "text": "A'baht was part of the command group that helped plot the course of the war. He opposed the strategy, championed by his former subordinate Brand, that the New Republic adopted of bolstering key worlds' defenses while leaving less significant ones to fall. He felt it sent the wrong message, that the New Republic was only concerned with protecting the Core Worlds, and saw it reflecting in decreasing willingness to fight the Yuuzhan Vong among member worlds. Instead, he suggested that the New Republic send its forces where they were most needed. The war, he felt, was far more serious than the other commanders were willing to admit."}, {"tag": "h4", "text": "Resignation"}, {"tag": "p", "text": "After the fall of Gyndine, which he had argued should be defended more heavily, he clashed with Brand over the New Republic's priorities once more. He argued that the Yuuzhan Vong were not proceeding based on standard tactics and were instead pursuing a psychological campaign, targeting cultural centers and refugee populations. He argued, against Brand's counsel, that the Bothan sector would be the likely next target, not the Core. A'baht was somewhat pacified by the presentation of a plan to enlist the Hapes Consortium in the war, but a plan to use Centerpoint Station in a trap in the Corellian system alarmed him, as he felt that Corellia was being exposed to excessive risk in order to protect the other Core Worlds. The trap ultimately proved a failure, with a misfire from Centerpoint wiping out much of the Hapan fleet along with the Yuuzhan Vong, who attacked Fondor instead. Less than a year into the war, A'baht resigned his commission and returned to his homeworld. With the Dornean Navy once more under his command, A'baht halted the Yuuzhan Vong's advance in his home sector."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Etahn A'baht was a pragmatist who believed in complete military preparedness. In the political arena, he did not put stock in friendship and was not willing to simply take another's word for an unproven assertion. Instead, he preached constant wariness and aggressive pursuit of the state's interests in security. As an officer, he demanded the best of his subordinates and trained them to deliver exactly that."}, {"tag": "p", "text": "A blunt and straightforward being, A'baht spoke directly to his friends and allies and strongly preferred that they do the same to him. While he thought nothing of subterfuge against enemies and possible enemies, he felt a deep distaste for keeping secrets from his fellow officers and superiors in the New Republic, though he was capable of doing so when he felt the situation absolutely necessitated it. Nevertheless, he was fully willing to bear the consequences of his decisions with dignity when he did so. While a deeply serious man, A'baht was not above taking a fancy to a sleek ship such as the Poranji orbital jumper."}, {"tag": "p", "text": "During the Yuuzhan Vong War, A'baht preferred a strategy of defending all worlds equally as they came under threat, rather than giving preference solely to strategically and politically important worlds, as was the New Republic's policy. He felt that the other members of high command underestimated the threat posed by the Yuuzhan Vong and sought a stronger opposition to the invaders; he saw little reason to be optimistic about the course of the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Etahn A'baht was created by author Michael P. Kube-McDowell as the commander of the New Republic Fifth Fleet in The Black Fleet Crisis, first appearing in the opening book of the series, Before the Storm, released in 1996. With the exception of a profile in Cracken's Threat Dossier concerning the Black Fleet Crisis and a mention in The Essential Guide to Droids, A'baht did not appear in any further material until author James Luceno revived A'baht, along with a host of other personnel from The Black Fleet Crisis, in depicting the New Republic's military in the Agents of Chaos Duology of The New Jedi Order series. A'baht was again used and his past elaborated on in the Databank entry for the Dornean Gunship, a What's The Story? submission by a StarWars.com user known as Ello137."}, {"tag": "p", "text": "A'baht's rank is given in The New Jedi Order: Agents of Chaos I: Hero's Trial as brigadier general. This must represent a demotion, as in Tyrant's Test, A'baht outranked Tolokus, who, as an admiral, would have been superior to a brigadier general."}, {"tag": "p", "text": "Ello137 has written a blog in which he discusses the reasoning behind his use of A'baht in the What's the Story? entry. He intended to explain the origin of the favor owed by L'toth to A'baht with A'baht's rescue of L'toth's ship. Ello137 also suggests that, in retrospect, A'baht's promotion represents an implicit error, going against implication in The Black Fleet Crisis and Cracken's Threat Dossier that A'baht had held his rank in the Dornean Navy for much longer. He suggests that the promotion be regarded as a publicity stunt promoting A'baht, already the supreme commander of the Dornean Navy, to an even higher grade of generalship. This is not a canonical retcon, and there is no explicit canonical error in the Databank entry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}