{"url": "Eternal_Alliance_Recon_Unit", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Eternal Alliance", "Category:Military units"], "nodes": [{"tag": "h1", "text": "Eternal Alliance Recon Unit"}, {"tag": "p", "text": "The Eternal Alliance Recon Unit, commonly referred to as just the Alliance Recon Unit, was a group of highly skilled soldiers within the Eternal Alliance tasked with scouting out an area before the main Alliance forces engaged. The unit was under direct control of Alliance Intelligence and took orders from Theron Shan. In high-priority situations, they were directed by the Alliance Commander."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The unit was formed in 3630 BBY, after the death of the Eternal Empire's Empress Vaylin and reorganization of Alliance into the Eternal Alliance, in response to various uprisings sparking across the galaxy. It was deployed to deal with crises such as reclaiming stolen plans for the Alliance base from the Dust Vipers pirates, liberating Port Nowhere from a Crimson Fang takeover, neutralizing Sith Lords Adacin and Zanisk in the former Separatist stronghold on Ord Mantell, and neutralizing Commander Kallin and foil his plan to bomb the Senate tower from The Works on Coruscant."}, {"tag": "p", "text": "Their biggest operation was during the battle against General Amos Rike and his Rike's Raiders on Denova. They were meant to join the Alliance Commander in battle, but the unit's shuttle was shot down and crashed, nearly killing Raine and injuring the other members."}, {"tag": "p", "text": "After the uprisings against the Alliance ended, the unit remained, ready to fight for their cause."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Alliance Recon Unit appears in Star Wars: The Old Republic: Knights of the Eternal Throne during various Uprisings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}