{"url": "Eternal_Alliance", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Articles in need of updating", "Category:Eternal Alliance"], "nodes": [{"tag": "h1", "text": "Eternal Alliance"}, {"tag": "p", "text": "The Eternal Alliance, also known as the Galactic Alliance, was a military organization formed by the Outlander. Known in its early days as the Alliance Against Zakuul, the Alliance was initially a resistance movement to the formerly dominant Eternal Empire and sought to overthrow the tyrannical Emperor Arcann, and later Empress Vaylin, his sister. Eventually defeating both Arcann and Vaylin, the Alliance would seize the throne after defeating the last forces of the Empire in the Battle of Zakuul. The Alliance was then reorganized by the Outlander, and transformed into the Eternal Alliance. All military assets of the Eternal Empire, including its enormous fleet, were absorbed into the Alliance. With control of the Eternal Fleet, the Alliance was considered the most powerful faction in the galaxy."}, {"tag": "p", "text": "Following the Order of Zildrog's campaign against the Alliance and the destruction of the Eternal Fleet at the hands of the superweapon Zildrog, many personnel returned to their original factions."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Founding"}, {"tag": "p", "text": "Following the Battle of Asylum, elements from both the Galactic Republic and reconstituted Sith Empire realized that the Eternal Empire was not invincible. The movement was initially organized by the individual known as the Outlander on the planet Odessen, a force-neutral planet making it a perfect place for an alliance between the light side-aligned Republic and dark-side aligned Empire, whereupon a fortress was constructed on the base of a cliff which would serve as the Alliance's base of operations during the coming war. Although the resistance movement started small, it gradually grew into a larger force, consisting of individuals from both the Sith Empire and the Galactic Republic, such as Theron Shan, Lana Beniko, Major Pierce, Bey'wan Aygo, Hutt doctor Juvard Illip Oggurobb, and Hylo Visz, among many other specialists. Once the Alliance established itself as a force to be reckoned with, the Outlander was named the commander of the organization, and ultimately helped it grow in strength as well as lead a series of tactical strikes against the Eternal Empire's Star Fortresses."}, {"tag": "h3", "text": "Initial strikes"}, {"tag": "h4", "text": "The GEMINI Deception"}, {"tag": "p", "text": "The first objective the Alliance targeted was the Eternal Fleet. Subsequently, collaboration with Kaliyo Djannis and Havoc Squad enabled the Alliance to locate a hyperwave relay station beneath the Spire that transmitted orders to the Fleet. Kaliyo and Havoc Squad attempted to infiltrate the Spire to reach the relay station but were forced to flee, but not before obtaining a datacore on the GEMINI droids that ran the Fleet."}, {"tag": "p", "text": "Analysis of the datacore revealed the existence of the GEMINIs template, GEMINI Prime, hidden in a factory on Darvannis. To acquire the droid, the Alliance worked alongside Mandalorians to besiege the factory."}, {"tag": "p", "text": "After acquiring the Prime, SCORPIO determined that GEMINI Prime could take control of the Eternal Fleet if she were plugged into the captain's chair of one of the ships. The Commander personally led a boarding party to seize one lone ship, but SCORPIO double-crossed the Alliance, seizing control of Zakuul and most of the Eternal Fleet for herself while exposing Odessen's location to Arcann."}, {"tag": "h4", "text": "Battle of Odessen"}, {"tag": "p", "text": "With their location exposed, the Alliance fought in defense of their base, with only the Gravestone facing off against Arcann and the Eternal Fleet ships under his control. The Outlander led a boarding party aboard the Eternal Flagship to defeat the Emperor and disable the Flagship, even as SCORPIO seized control of Arcann's ships to eliminate both her enemies at once. The Commander succeeded in defeating Arcann and left him for dead, only for his mother Senya Tirall to betray the Alliance to rescue her son and fled the system. The Gravestone soon wiped out the Eternal Fleet, saving the Alliance from destruction."}, {"tag": "p", "text": "With their victory over Arcann, Republic and Imperial forces from across the galaxy defected to join the fledgling Galactic Alliance."}, {"tag": "h3", "text": "Invasion of Voss"}, {"tag": "p", "text": "Despite Arcann's defeat, the Alliance faced a deadlier opponent in his sister Vaylin, who assumed the throne with SCORPIO becoming her advisor and began scouring the galaxy for her family. Eventually, the Alliance came to the defense of Voss when the Eternal Fleet launched an all-out attack. The battle ended when the Sith Empire intervened, sending the Fleet into retreat."}, {"tag": "h3", "text": "Attempted Coup"}, {"tag": "p", "text": "In light of Empress Acina's aid, the Commander traveled to Dromund Kaas to discuss an alliance against Zakuul. However, some time after arriving, both the Commander and Empress reportedly died in a shuttle crash. Subsequently, former Republic Supreme Chancellor, Leontyne Saresh, offered to step in and lead the Alliance. Aygo desired to send her away but the lower-ranking troops wanted to hear her out, uncertain how the Alliance would continue without their leader. However, just as Saresh began her speech, the Commander returned to Odessen alive and well, having survived being assassinated by the GenoHaradan, who were sent by Saresh in her bid to take control of the Alliance, and put an end to her attempted coup."}, {"tag": "h3", "text": "Retaking the Gravestone"}, {"tag": "p", "text": "The Alliance later answered a distress call from Captain Koth Vortena aboard the Gravestone, which had been boarded by Vaylin and SCORPIO. The Alliance fleet engaged the Eternal Fleet once more while the Commander and their inner circle attempted to retake the Gravestone. Unfortunately, after the Commander disabled the quantum bomb aboard the Gravestone, SCORPIO seized control and took it and the Eternal Fleet to their homeworld of Iokath. To the Alliance's relief, the Commander managed to survive Iokath and returned to Odessen with the Gravestone. The Alliance soon began upgrading the Gravestone with the aid of datafiles recovered from Iokath."}, {"tag": "h3", "text": "Operation Dragon's Maw"}, {"tag": "p", "text": "With Vaylin having retaken control of the Eternal Fleet from SCORPIO, the Alliance resolved to put an end to her rule by collaborating with local Zakuulan rebels led by Indo Zal. The Commander, along with Theron Shan and Lana Beniko, infiltrated the Grand Festival of Empress Vaylin in an attempt to get close to assassinate Vaylin. The operation became complicated when Arcann independently led an assault on the Palace of the Eternal Dragon with a group of loyalists and ultimately, Vaylin fled Zakuul in disgrace."}, {"tag": "h3", "text": "Second Battle of Odessen"}, {"tag": "p", "text": "The Commander later pursued Vaylin to Nathema, where the Empress managed to break her mental conditioning before launching an all-out assault on Odessen. The Alliance once again held their own against the Eternal Empire's onslaught before the Commander managed to kill Vaylin, sending the Eternal Fleet into retreat and her ground forces into surrendering."}, {"tag": "p", "text": "The battle resulted in heavy casualties for both the Alliance and Eternal Empire, but these losses would turn the tide of the war, with an Alliance victory almost certain."}, {"tag": "h3", "text": "Battle of Zakuul"}, {"tag": "p", "text": "Unfortunately, without a master, the Eternal Fleet began to rampage across known space with the intent of wiping out all life. With no other recourse, the Alliance fleet, with the Gravestone at its head, traveled to Zakuul, where the Fleet was bombarding the planet and protecting the Eternal Throne. While the Alliance kept the Fleet preoccupied, the Commander attempted to access the Throne from the surface. Once the Commander assumed control of the Throne, the Fleet became pacified."}, {"tag": "h3", "text": "Reformation"}, {"tag": "p", "text": "With the Eternal Fleet under control and the Royal Family of Zakuul defeated, the Commander announced to the entire galaxy the dissolution of the Eternal Empire and the Alliance's reformation as the Eternal Alliance as a new galactic power. However, despite this victory, the Republic and Sith Empire began preparing for war and rogue factions across the galaxy initiated their own uprisings in response to the Eternal Alliance's rise to power."}, {"tag": "h3", "text": "War on Iokath"}, {"tag": "p", "text": "When radiation levels ceased to sustainable conditions, Lana Beniko scouted the planet Iokath for a supposed superweapon, later proven to be quite real and a massive threat. However, before she could investigate further, a Republic scout fired upon and destroyed her probe droid, and then engaged unknown Imperial scouts. While the two battled, the Eternal Alliance set up a massive base camp, heavily defended, with the Eternal Fleet overhead, only with its weapons deactivated. When the Alliance Commander arrived, the Eternal Alliance was choked in a newly spawned war on the planet between the age-old enemies of the Galactic Republic and Sith Empire. Trying to focus on the objective at hand, the Commander gathered allies to a throne where the secrets of Iokath laid. However, the throne was reached by the opposing power's leader first, who then attempted to release the superweapon, but they were overtaken by Iokath's hidden power and were killed in the process of learning such power. While a tragic moment, this freed the Eternal Alliance (as well as Sith and Republic) fleet. The Commander then ordered Eternal Fleet ships to fire upon the superweapon revealed to be a droid named Tyth, not before it firing and destroying an Eternal Fleet warship first. The weapon retreated underground, where Alliance forces closed in, awaiting orders."}, {"tag": "p", "text": "The Alliance Commander formed a special operations team and engaged Tyth soon after, destroying it. But the Commander did gain a power cell from Tyth, and gained the ability to create more droids like him for the Alliance, something both the Republic and Empire feared but could not prevent, being preoccupied with the quarrel against each other."}, {"tag": "h3", "text": "Crisis on Umbara"}, {"tag": "p", "text": "Shortly after the battle on Iokath, the Alliance Commander was informed by Theron Shan and Lana Beniko that the traitor was on Umbara attempting to smuggle Adegan crystals. With Theron and Lana at their side, the Commander raced to Umbara to catch the traitor. The Commander hijacked a moving train and fought their way to the front of it. The traitor then revealed himself as none other than Theron Shan. Theron explained his motives for why he betrayed the Alliance and desired to topple it. He told the Commander how he thought the Alliance would be no different than the Eternal Empire. Theron escaped the train on a speeder while the Commander and Lana jumped before the train could crash. Stranded in the Umbaran wilderness, the Commander and Lana fought against local Umbarans and wildlife while also collecting Adegan crystals to enhance the Alliance's weaponry. Eventually, Theron escaped and the Commander, along with Lana, fought against an Umbaran Spider Tank."}, {"tag": "p", "text": "Back at the Alliance Base, the Commander was informed by Lana that she had her agents looking for Theron and assessing how much damage he inflicted from the inside. The Commander then sent a galaxy-wide message to Theron. Meanwhile, a mysterious figure welcomes Theron to the Order via holomessage."}, {"tag": "h3", "text": "A Traitor Among the Chiss"}, {"tag": "p", "text": "The Alliance Commander received a message from the Chiss Ascendancy about Theron Shan taking refuge with a rival house, House Inrokini. The Ascendancy, officially, can't act on this, but they secretly supported the Alliance. The Commander, with the help of Raina Temple, landed on Copero. They infiltrated House Inrokini, and after defeating the powerful Guardian Droid, and Syndic Zenta, they learned that Theron was trying to locate a powerful superweapon that could lay waste to the Alliance. Valss, a powerful Chiss Force-sensitive ally of Theron's, distracted the Commander, while Theron escaped. Back at the Odessen base, the Commander was given the secret support of the Ascendancy, and Temple would stay as a liaison."}, {"tag": "h3", "text": "Joining the Republic"}, {"tag": "p", "text": "Following the Order of Zildrog conflict, the Eternal Alliance prospered on Odessen until stories of the Quesh riots and Wild Space skirmishes arrived. The signals of a renewed conflict between the Sith Empire and Republic prompted Lana Beniko to ask the Commander to join forces with one of the major factions. The Commander chose to support the Republic and traveled to Nar Shaddaa to meet Jonas Balkar and arrange it."}, {"tag": "p", "text": "Soon after, back on Odessen, the Commander was contacted by the Republic Military's General Ardinondu Dipolus Daeruun who requested the Commander's aid on the planet Ossus. General Daeruun had discovered that a hidden Jedi settlement led by Jedi Master Gnost-Dural was being threatened by Imperial discovery and couldn't assemble the needed forces in time to prevent the colony's destruction."}, {"tag": "p", "text": "The Commander traveled alone to Ossus to support the evacuation, pending the Imperial invasion of the planet."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "During the beginning of the Alliance, their forces were composed of volunteers from the Sith Empire, Galactic Republic, Jedi, Sith, and among many others opposers to the Eternal Empire. Military Operations, was the military division of the Alliance and was led by former Republic Admiral Bey'wan Aygo, but was under direct control of the Alliance Commander at all times."}, {"tag": "h3", "text": "Navy"}, {"tag": "p", "text": "At first, the Alliance Fleet comprised of the privately owned ships of those who donated their resources to the effort. Following the first Battle of Odessen Thranta-class and Terminus-class cruisers left their respective factions and joined the Alliance. The ancient frigate known as the Gravestone was the Navy's flagship, headed by Captain Koth Vortena."}, {"tag": "p", "text": "Following the Battle of Zakuul, the Alliance Navy greatly expanded with the Eternal Fleet being commanded by the Alliance Commander, making the Eternal Alliance the holder of the most powerful Navy in the galaxy. By absorbing the entirety of the Eternal Empire, many considered the Eternal Alliance as the dominant power in the galaxy, surpassing even the Galactic Republic and Sith Empire."}, {"tag": "p", "text": "As a result of the Commander's Mission to Nathema the Alliance Navy's strength dropped significantly following the destruction of the Eternal Fleet and the Gravestone, lowering the overall military might of the alliance."}, {"tag": "h3", "text": "Army"}, {"tag": "p", "text": "The Alliance Army consisted of former Republic and Imperial citizens and soldiers, Jedi and Sith, along with Voss Mystics to keep the two longtime enemies cooperative, smugglers and pirates of all origins and backgrounds, Mandalorians, independent forces ranging from farmers to mercenaries, and later Zakuulans. When the majority of Zakuul's armed forces joined the Eternal Alliance, the organization's original members were prejudiced towards their former enemy. However, over time Zakuulans proved their dedication to the Alliance and showed that they were not necessarily supportive of their Emperor's actions. With the Eternal Empire's large dedication to military superiority, the Zakuulans made the Alliance's power and influence greater in nearly every aspect. On top of this, many Knights of Zakuul joined, along with the entire force of Skytrooper droids – and their manufacturing facilities – further enhancing the newly founded superpower."}, {"tag": "p", "text": "The Alliance Army also contained a special Recon Task Force, often led by the Alliance Commander themselves. It was made up of four highly trained, stealthy agents capable of eliminating powerful and dangerous threats. This squad was known to be sent ahead of a main Alliance force. Although part of the Army, they were directed by Alliance Intelligence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: The Old Republic: Onslaught, the player has a choice to intergrate the Alliance into either the Republic's Task Force Nova or the Empire's Hand. The player may also choose to continue the Alliance's independence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}