{"url": "Eternal_Empire_conquest", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with conjectural titles", "Category:Battles of the Eternal Empire conquest", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Expansion Region", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Eternal Empire conquest"}, {"tag": "p", "text": "Around 3636 BBY, the emerging Eternal Empire launched a campaign of conquest into the Core Worlds, defeating both the Galactic Republic and the Sith Empire, the known galaxy's major powers."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During most of the Sith Emperor's absence from reigning his Sith Empire, he had been secretly developing a new empire, the Eternal Empire, positioned in uncharted territory within Wild Space and with its capital on the planet Zakuul. There, known as Emperor Valkorion, he built and strengthened his forces to one day emerge and conquer the galaxy. By 3636 BBY, the Sith Empire's few outposts in the Wild regions had been wiped out by the Eternal Empire to test the latter's strength although the Sith Empire was unable to discover the culprits. Soon that year, as the Galactic War raged between the Sith Empire, Republic and third parties, the Eternal Empire launched raids and decimated several of their planets, including Korriban, before retreating back into Wild Space."}, {"tag": "p", "text": "Darth Marr, de facto head of the Dark Council and the Imperial Military, led a joint Imperial-Republic expedition into Wild Space to pursue the Emperor, only to be ambushed by the Eternal Fleet. Marr and another prominent figure, who would become known as \"the Outlander\", were captured from Marr's destroyed flagship by Prince Arcann, the surviving son of Valkorion, and brought to the Emperor on Zakuul. Valkorion offered to share his power with his captives if they would kneel before him. Marr, recognizing Valkorion as the Sith Emperor, refused, and was killed for his defiance. As he offered the same to the Outlander, Valkorion was killed, and Arcann assumed the throne in his place. The new Emperor publicly accused the Outlander of his father's assassination, and declared that the Core Worlds would burn as a result. The Outlander was frozen in carbonite, as Arcann sensed that Valkorion lived on within the mind of his \"murderer\"."}, {"tag": "h2", "text": "The war"}, {"tag": "p", "text": "Arcann's war was swift and brutal. Directing the fleet from the Eternal Throne, the new Emperor attacked both Republic and Empire at once, destroying their shipyards and blockading the major trade routes. The Eternal Empire had numbers and speed on its side; only ships powered with isotope-5 could hope to evade the more powerful vessels of the Eternal Fleet. Within three months, they had achieved naval superiority over both sides, and by the end of the first year, the Republic capital of Coruscant and the Imperial capital of Dromund Kaas were blockaded. The Dark Council of the Sith Empire fought on, but without Marr's leadership, the Council was all but destroyed. Similarly, the Republic's Supreme Chancellor, Leontyne Saresh, refused to submit the Republic to Zakuulan authority - and, incredibly, waged a war against both the Eternal Empire and the Sith Empire, at the cost of millions of Republic lives. Saresh was swiftly overridden by the Galactic Senate, which sued for peace. The Minister of Logistics did likewise for the Empire."}, {"tag": "p", "text": "Both sides sent emissaries - Senator Evran for the Republic, and Darth Vowrawn for the Empire - to Zakuul, where they were brought before Arcann. The Emperor agreed to a ceasefire, provided that the Republic and the Empire pay heavy tribute to Zakuul and submit to armament restrictions. With little option left to them, both sides agreed. In the years that followed, Saresh was out of power, but continued to dictate policy through her successor, Jebevel Madon. Similarly, with the Dark Council practically dissolved, its one visible remaining member, Darth Acina, declared herself Empress of the Sith. Even after this, the war between the Republic and the Empire continued - Saresh unwilling to even consider any form of alliance with the Sith to overthrow the Eternal Empire - and Arcann allowed it to continue, provided that they acknowledge the supremacy of Zakuul, and continue to pay the tribute demanded of them."}, {"tag": "p", "text": "Rather than control his new holdings with occupation armies, Arcann deployed hundreds of massive battle stations known as Star Fortresses in orbit around major planets, such as Alderaan, Belsavis, and Voss. These battle stations were commanded by Exarchs - Knights of Zakuul enhanced by biological and cybernetic upgrades - and were empowered by great \"sun generators\", essentially artificial stars (similar to those used on Zakuul itself), and protected by shield generators built on the surface. Any attempts at resistance were answered by the stations venting excess plasma from the sun generators into devastating beams fired at the surface, essentially holding the planets and their populations hostage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}