{"url": "Eternal_Empire_military", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Eternal Empire military"], "nodes": [{"tag": "h1", "text": "Eternal Empire military"}, {"tag": "p", "text": "The Eternal Empire military was the military force of the Eternal Empire of Zakuul."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While the Force-sensitive Knights of Zakuul answered directly to the Emperor and the High Justice, Zakuulan military was composed of regular conscripts and skytroopers, though they always worked in conjunction with the Knights and were deployed simultaneously. The majority of the Eternal Empire fighting force was composed of droids, either the GEMINI units that commanded the Eternal Fleet, or the various skytrooper models that filled the ranks of ground soldiers. Humans held only a few key positions such as piloting Eternal Empire shuttles and Eternal Empire Walkers, as well as serving as crew members on the few ships that were not part of the Eternal Fleet."}, {"tag": "p", "text": "After the assassination of Valkorion and ascension of his son Arcann to the Eternal Throne in 3636 BBY, Zakuul revealed itself to the larger galaxy and led a swift and brutal Eternal Empire conquest of the Core Worlds, which the natives of Wild Space world of Zakuul called the larger part of the known galaxy. During the Occupation of Denon ground forces were ordered to fire on protesting civilians, but Captain Koth Vortena and his men, including Len Parvek, refused to follow that order and defected. This contributed to further phasing out of non-skytrooper Human personnel, and by the time the galaxy rose up in the war against Zakuul five years later, only skytroopers and the Knights of Zakuul were commonly deployed on other worlds, with non Force-sensitive Human personnel mostly restricted to the security force on Zakuul itself. Despite this, Eternal Empire troopers were tasked with guarding the shield generator bunkers for Star Fortresses, and Zakuul soldiers were deployed by Empress Vaylin during the Assault on Odessen."}, {"tag": "p", "text": "The revolt eventually succeeded, with the Eternal Alliance achieving victory over Zakuul and dismantling the Eternal Empire. The people of Zakuul were left free to rule themselves, and the Alliance seized control over Zakuul's military assets, including the Eternal Fleet. Some former soldiers and Knights of Zakuul joined the Alliance military, which also incorporated Zakuulan skytroopers and walkers, while others went rogue, joining either Battalion Commander Tassar or Vinn Atrius's Order of Zildrog."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}