{"url": "Airspeeder/Legends", "categories": ["Category:Legends articles", "Category:Airspeeders"], "nodes": [{"tag": "h1", "text": "Airspeeder"}, {"tag": "p", "text": "Airspeeders, also known as aircars, were repulsorlift vehicles common throughout the galaxy. They were distinguished from landspeeders by a higher operating altitude and normally higher top speed. Some were also equipped with boosters that enabled them to achieve low planetary orbit for a short time. They were not designed for orbital flight, though they could attain such high altitude that they pushed the boundaries of atmosphere and space."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Airspeeders were used for a wide variety of roles galaxy-wide. These included transportation, recreation, and offensive and defensive combat. The skies of many industrialized and/or urbanized planets, particularly Coruscant and other Core Worlds, were often clogged with airspeeders. This became such a problem for ecumenopoleis such as Coruscant and Taris that they were forced to adopt a series of rigidly controlled skylanes to which most civilian airspeeders were regulated. To fly beyond these lanes often required special dispensation from the government; this often required the pilot to demonstrate a degree of skill in handling his craft."}, {"tag": "p", "text": "Standard government-model airspeeders were equipped with a speed governor, an altitude limiter, and a pilot droid."}, {"tag": "p", "text": "Many notable companies produced airspeeders, including Incom Corporation, Tagge Company, and SoroSuub Corporation. Even the Yuuzhan Vong produced a type of combat airspeeder analog called the Tsik vai."}, {"tag": "h3", "text": "Famous airspeeder types"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Aaron Allston, in three of the four novels he wrote for the X-wing series (X-Wing: Wraith Squadron, X-Wing: Iron Fist, X-Wing: Solo Command and X-Wing: Mercy Kill), used the word \"skimmer\" as a catch-all term for both landspeeders and airspeeders, despite the fact that skimmers were a distinct class or subclass of repulsorlift vehicle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}