{"url": "Eulyn", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Keshiri"], "nodes": [{"tag": "h1", "text": "Eulyn"}, {"tag": "p", "text": "Eulyn was a Keshiri female who lived on the planet Kesh around 5000 BBY. The mother of widowed geologist Adari Vaal, Eulyn cared for her two grandchildren, Tona and Finn, in a wooden house in the city of Tahv inherited after the death of her son-in-law, Zhari Vaal. Adari became notorious for teachings contrary to the common religion of the time, leading Eulyn to regard her daughter as a heretic. After their house was bombarded with rocks by an angry mob, Adari fled and stumbled across a group of Sith, who proclaimed themselves to be gods. Although Adari was honored for her role, Eulyn never truly understood her daughter's canonization and died sometime before 4975 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Keshiri female, Eulyn was a native of the planet Kesh, living during the era of the Great Hyperspace War. Eulyn had a daughter named Adari, a geologist who married a member of the planet's ruling Neshtovar, Zhari Vaal. Eulyn was largely responsible for the marriage—seeking to solidify her family's future position, she lobbied for the union for years. After Vaal's death in an accident while riding an uvak beast, Eulyn and Adari inherited a wooden house in the city of Tahv, where Eulyn took care of her grandchildren, Tona and Finn. Through her work in geology, Adari uncovered clues about the natural formation of the Keshiri landscape that contradicted the widely-held religious belief that the planet's continents were formed by the blood of the Keshiri gods, the Skyborn, and began teaching these findings to other Keshiri. Generally disapproving of her daughter's profession, and an ardent adherent to the religion, Eulyn was appalled by her daughter's discoveries and believed her to be a heretic."}, {"tag": "p", "text": "In 5000 BBY, Adari testified about the validity of her findings to the Neshtovar, leading to mobs descending upon Eulyn and Adari's household and pelting it with rocks. The torrent of abuse became so bad, in fact, that Adari sent Eulyn and the children to stay at her uncle's home. As for Adari, she fled the angry Keshiri on her husband's old uvak, Nink, and stumbled onto the site of a Sith crash site high in the Cetajan Mountains. Adari discovered a group of surviving Sith and led them back to society. The Sith, led by Captain Yaru Korsin, proclaimed themselves to be the Skyborn, and Adari was honored for her role. Just as she did not understand her daughter's supposed heresy, Eulyn failed to understand Adari's canonization, and she died sometime before the year 4975 BBY. After her daughter's death, Adari's personal memoirs were found, written during her exile in the far-off continent of Alanciar, and included a few tart passages about Eulyn."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Eulyn was a devout follower of the Skyborn religion and, as such, was appalled by her daughter's perceived heresy. Eulyn did not understand Adari's adherence to her theories, her profession, or her veneration after the arrival of the Sith, and tended to be very argumentative with her daughter. She was very ambitious regarding her family's position, lobbying heavily for Adari to marry a powerful member of the Neshtovar, and she was elated when she obtained an upscale wooden house. Eulyn had violet skin and dark eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Eulyn first appeared in Lost Tribe of the Sith: Skyborn, a 2009 eBook by John Jackson Miller. Thus far, it is her only appearance in Star Wars canon, although she was mentioned in one of Skyborn's sequels, Lost Tribe of the Sith: Savior."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}