{"url": "Eusebus", "categories": ["Category:Legends articles", "Category:Capital cities"], "nodes": [{"tag": "h1", "text": "Eusebus"}, {"tag": "p", "text": "Eusebus, also called Euceron City, was the capital city of the planet Euceron. The city was normally not full of traffic, but when the Galactic Games took place on the planet in 26 BBY, it became considerably more crowded. It was a city built entirely of plastoid materials because there was no native stone on the planet. The buildings were brightly colored and no higher than twenty stories."}, {"tag": "p", "text": "On the northern outskirts of the city were the Great Dordon Caves where Anakin Skywalker went to podrace during his Galactic Games stay with other Jedi, who were sent to monitor the games and keep the peace at the request of the Ruling Power, Euceron's governing body. The podrace was considered \"illegal\" by the Council of the Games leadership, but their high-profile members proved ultra-hypocritical in their assessment. For they themselves not only were complicit in the race's illegalities and rigged nature, but also were plotting by the use of the Games events (and in league with the Commerce Guild that vied via legislation for banking activity control in the Core Worlds) to destroy the reputations of several respected Galactic Senators who opposed them (by placing falsified gambling bets in their names and rigging fail-proof game-wins for certain contestants). They also held as worthless the innocent lives of untold numbers of their own citizen-spectators (in a prefabricated podracer-grandstand collision disaster, which if successful they could then blame on the senators)—all for selfish gain in power, prestige, and wealth."}, {"tag": "p", "text": "During the Galactic Games, Eusebus' streets were filled with undercover security officers, whom its citizen's loathed, for they served but as pawns to the Ruling Power's repressive form of government. Ill-feeling and dark discontent among the Euceron citizenry boiled beneath the city's colorful façade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}