{"url": "Evacuation_of_Dubrillion", "categories": ["Category:Legends articles", "Category:Battles of Dubrillion", "Category:Battles of the Yuuzhan Vong War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Evacuation of Dubrillion"}, {"tag": "p", "text": "The evacuation of Dubrillion occurred early in the Yuuzhan Vong War."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Shortly after their arrival on the planet, Leia Organa Solo and Senator Elegos A'Kla began helping Lando Calrissian evacuate the populace of Dubrillion. The evacuation would have been impossible, were it not for the donation of dozens of evacuation ships by the Agamarian Council. As the evacuation commenced in earnest, Admiral Traest Kre'fey arrived with his flagship, the Ralroost, and Rogue Squadron to help defend the evacuation convoy from Yuuzhan Vong forces stationed in the system's asteroid belt. Calrissian also provided Kre'fey with two squadrons of Ugly starfighters to help defend the convoy."}, {"tag": "p", "text": "As the convoy began to move out, a Miid ro'ik warship emerged from the asteroid belt, escorted by squadrons of Coralskippers. The Coralskippers immediately began strafing runs on the convoy and combat traffic controllers on the Ralroost quickly ordered Dubrillion's fighters to intercept them. Meanwhile the larger Yuuzhan Vong warship opened fire on the convoy and succeeded in destroying at least one evacuation freighter. After receiving orders from the Ralroost, Colonel Gavin Darklighter led Rogue Squadron in an attack on the Miid ro'ik. New squadron member and Jedi Knight Jaina Solo, working with wingperson Anni Capstan, managed to deal light damage to the Yuuzhan Vong warship before being forced to withdraw."}, {"tag": "p", "text": "After the first few evacuation ships escaped, the Yuuzhan Vong used their Dovin basals to prevent the remaining New Republic vessels from escaping on their predetermined hyperspace route. Unable to fall back to Agamar, the remaining New Republic forces instead fled to Dantooine. The Yuuzhan Vong then proceeded to invade and occupy Dubrillion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}