{"url": "Evacuation_of_Paucris_Major", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Evacuations", "Category:Events of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Evacuation of Paucris Major"}, {"tag": "p", "text": "In 3 BBY, a fleet of rebel ships evacuated Paucris Major after learning from Princess Leia Organa that the Galactic Empire intended to send a fleet to the Paucris system."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3 BBY, Princess Leia Organa of Alderaan, investigating her parents' involvement with the rebellion, discovered that a fleet was being constructed at Paucris Major. A couple of months later, while serving as her father Bail Organa's senatorial aide and in the Apprentice Legislature, she was summoned to a meeting with Grand Moff Wilhuff Tarkin. Tarkin, who harboured suspicions of the Organas, mentioned Paucris as one of several systems that the Galactic Empire hoped to achieve \"peace\" in. Leia realized that this meant the Empire suspected rebel activity in the system, and attempted to contact her father after the meeting, but he was not on Coruscant. Since Bail was still offworld, Leia contacted Chandrilan Senator Mon Mothma, another leader of the rebellion, and her mother Queen Breha Organa to inform them that the Empire knew about Paucris Major. Mothma charged Leia to go to Paucris and warn the rebels there. As the Alderaanian royal yacht Polestar was on Alderaan, Leia had to hire another ship for transport. Mothma gave her an untraceable credit solid to pay for the trip. Before she left, Leia contacted Kier Domadi, who she had been planning to meet, to tell him that she had to go to Paucris. She promised him that they would talk again soon."}, {"tag": "p", "text": "Leia had some difficulty hiring a ship incognito, until she ran into fellow Apprentice Legislators Chassellon Stevis and Amilyn Holdo attempting to hire the freighter Mighty Oak Apocalypse to take them to a speeder auction on Arkanis. Holdo, knowing of Leia's rebel connections, persuaded Stevis to stay behind, as she and Leia hired the Moa to take them to the planet Pamarthe. On Pamarthe, one of the planet's famous storms was threatening to prevent all ships from leaving the planet, making it difficult for the girls to find another ship to take them to the Paucris system – until Leia saw a Chalhuddan ship. The leader of the Chalhuddans, Occo Quentto, owed Leia a favor stemming from a relief mission she had made to Chal Hudda delivering vaccines, and she called in the favor for passage to Paucris Major."}, {"tag": "h2", "text": "Evacuation"}, {"tag": "p", "text": "When Leia and Holdo, travelling with an escort of Chalhuddan ships sent by Quentto, arrived at Paucris, no Imperial ships were detected in the system. Leia sent a signal to whoever was in charge of the Paucris rebel base, and her father Bail answered. Bail was initially angry at Leia's presence, until she told him that the Empire was coming, and that she had been sent by Breha and Mothma. Bail immediately ordered the evacuation, and told Leia to rendezvous with him on the Tantive IV."}, {"tag": "p", "text": "Leia and Holdo disembarked from the Chalhuddan ship onto the Tantive IV, where they were greeted by Bail. He informed Leia that the portion of the fleet at Paucris was being broken up, and that the orbital repair stations' self-destructs would be activated before the last convoy left. Leia requested a shuttle so she and Holdo could return to Coruscant, so as not to link the Chalhuddans with the rebellion. The girls were given a small hopper that looked like a civilian craft."}, {"tag": "p", "text": "On board the hopper, Leia and Holdo waited for the other ships to leave. Leia plotted a course to Baltizaar, as it would be risky to return directly to Coruscant. As the last ships jumped out, Holdo informed Leia that another ship had arrived in the system: a nondescript cutter approaching the repair stations. Leia attempted to figure out whose ship it was, and realized in horror that it was piloted by Domadi, the only other person besides the rebels and the Empire who knew about the Paucris system. She attempted to warn Domadi that the orbital stations were about to self-destruct, but the warning came too late, and Domadi's ship was badly damaged in the shockwave from the stations detonating."}, {"tag": "p", "text": "Leia and Holdo approached Domadi's ship in their hopper and docked. Boarding, they found that the ship's artificial gravity generator was no longer functional. They eventually found Domadi in the cockpit, mortally injured. Dying, he told Leia that he had followed her to the Paucris system, and that he had been collecting information about the rebellion, intending to turn it over to the Empire to ensure the safety of Alderaan and Leia. He asked Leia to hand over the memory rod with the data, before dying. Leia left the rod on Domadi's ship, but took his body on board the hopper. Domadi's ship was left to burn up on reentry into Paucris Major's atmosphere, destroying the evidence he'd collected."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The rebel ships at Paucris were successfully evacuated. When Leia and Holdo's hopper arrived at Alderaan, they were contacted by an Imperial ship, which stated that their vessel's ionization levels suggested travel to a system under investigation. Using her knowledge of astrology, Holdo claimed that the hopper had just returned from the Shili system, which had a sun with near-identical ionization levels to that of Paucris Major. Holdo then got the Imperial officer to sign off by playing up her astrological interest and her odd personality quirks. Leia was grief-stricken by Domadi's death, and took some time to recover. His parents were told that he had died saving Leia during a small-craft accident in Alderaan's upper atmosphere. Back on Coruscant, Leia was contacted by Tarkin again, who made little secret of his suspicions of the Organas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}