{"url": "Evacuation_of_Ivarujar", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Evacuations"], "nodes": [{"tag": "h1", "text": "Evacuation of Ivarujar"}, {"tag": "p", "text": "Seven months after the Battle of Yavin, the Imperial Star Destroyer Devastator undertook an evacuation of the Imperial garrisons on Ivarujar, a planet that had undergone a massive volcanic eruption. Lieutenant Commander Ciena Ree was charged with evacuating a local stormtrooper garrison in the capital city. After rescuing the stormtroopers, she managed to evacuate forty civilians before the city was completely overrun by lava. Ciena's troop transport barely managed to escape the firestorm and reached the Devastator. While Ciena's humanitarian gesture won her the respect of the Ivarujarians, she was reprimanded and disciplined by the Imperial Security Bureau Captain Ronnadam for not consulting her superiors about the civilian rescue."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Age of the Empire, the Galactic Empire maintained several garrisons on the planet Ivarujar. Seven months after the Battle of Yavin, a massive volcanic eruption devastated the planet, endangering many civilians and threatening the lives and safety of the Imperial stormtroopers stationed on Ivarujar. This eruption was predicted to cover the planet in smoke and ash for years to come. As the closest Imperial Navy ship in that sector, the Imperial Star Destroyer Devastator dispatched several troop transports to evacuate the Imperial garrisons on Ivarujar. The garrisons were trapped on the planet since the original eruption had badly damaged their vessels."}, {"tag": "h2", "text": "The evacuation"}, {"tag": "p", "text": "Lieutenant Commander Ciena Ree, a recent graduate of the Royal Imperial Academy, was charged with commanding the transport flying closest to the volcano itself. By the time she arrived, the capital city was completely engulfed in lava. Ree's stormtrooper pilot spotted several stormtroopers standing on top of a nearby building, waiting to be evacuated. While the pilot double-checked his instruments, Ciena took control of the helm and instructed the pilot to carry the injured men onto the craft. Ciena then flew the transport through the lava-covered streets before parking on the roof of the garrison."}, {"tag": "p", "text": "Despite the ash and smoke, the stormtroopers at the Ivarujarian capital stood in formation and refused to break protocol. After evacuating them, Ciena witnesses a group of Ivarujarian civilians huddled onto the roof of another building. She deduced that these civilians had failed to make it to their civilian transports in time or had been excluded due to insufficient space. Ciena then ordered her pilot to fly the transport to the building and told the other troops to make room for more passengers. While Ciena had not been given orders to evacuate civilians, she was unable to ignore her conscience."}, {"tag": "p", "text": "In spite of the deteriorating atmosphere conditions, Ree managed to land the transport on the corner of a building. Many of the civilians were coughing since they lacked helmets and ventilation masks. Ciena exited the cockpit to help the stormtroopers evacuate the civilians. Leading by example, She lifted a small boy into the shuttle before turning to help the father as well. Ciena's subordinates followed suit and they succeeded in rescuing forty civilians. However, the extra weight made it difficult to fly the vessel. With the pilot unwilling to fly the transport, Ciena took control of the ship again."}, {"tag": "p", "text": "Taking the ship's engines to full power, Ciena managed to narrowly avoid an approaching firestorm. With much difficulty, she managed to flee Ivarujar and land safely in the hangar bay of the Devastator. Ciena's brave and selfless actions earned her the cheers of the rescued passengers, both stormtroopers and civilians. Much of Ivarujar's capital was destroyed during the inferno including the Imperial garrison there."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "While Ciena's actions earned her the praise of the rescued stormtroopers and civilians, her Imperial Security Bureau superior Captain Ronnadam was displeased that she had disobeyed Imperial orders by rescuing civilians. When Ciena pointed out her orders had not explicitly forbidden her from doing so, Romnadam accused her of looking for loopholes. When Ciena responded that she was reacting instinctively and saw no obstacle to doing so, Ronnadam scolded her for failing to consult her superior officers. Realizing that it was no point arguing, Ciena apologized for her mistake in not clearing her mission before undertaking it."}, {"tag": "p", "text": "Ronnadam accepted her remorse and ordered her to do five weeks of double-duty shifts as punishment. He warned Ciena that the Empire would not be so lenient next time. Ciena accepted her punishment and vowed not to repeat her mistake. While Ciena was angry that they had reprimanded her for saving lives, she realized that Ronnadam had only punished her for subverting the chain of command. She reasoned that the Empire would not object to evacuating civilians if she had consulted her superior officers. Following the Irajuvarian evacuation, Ciena was later promoted to Commander before becoming Captain of the Star Destroyer Inflictor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The evacuation of Ivarujar first appeared in Claudia Gray's 2015 novel Lost Stars. The events is told from the viewpoint of Ciena Ree, one of the novel's two protagonists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}