{"url": "Evacuation_of_Gelgelar", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Elrood sector", "Category:Battles of Spreading the Rebellion campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Evacuation of Gelgelar"}, {"tag": "p", "text": "The First Battle of Gelgelar saw the evacuation of the local Rebel base and subsequent retreat of the Alliance forces of Elrood sector to the Airam sector. It also marked Task Force Vengeance's first steps towards pacifying the Airam sector and driving any Rebel presence from it."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "After getting word of Admiral Wooyou Senn's orders to form Task Force Vengeance, the Alliance knew it was only a matter of time until their assets in the Elrood sector would fall victim to a quick stroke by the Empire."}, {"tag": "p", "text": "Preparations went well, and both Rogue and Gold Squadrons were put on constant vigil, patrolling the surroundings of the XQ5 Platform. A few GR-75 medium transports were assigned to evacuate the personnel of the base."}, {"tag": "p", "text": "Though what was planned as an orderly retreat soon became a running battle for the very survival of the transports and the base itself."}, {"tag": "p", "text": "The first wave of attackers consisted of Assault Gunboats, starting a torpedo attack on the platform. They were soon joined by the Victory-class Star Destroyer Stormhawk, which immediately deployed fighters to deal with the Rebel Z-95s."}, {"tag": "p", "text": "To make matters worse, the Imperial-class Star Destroyer Rage jumped into the system and deployed Avenger Squadron (piloting TIE/IN interceptor craft) and a separate flight of TIE/sa bombers, as well as conveniently blocking the exit vector of the evacuation vessels."}, {"tag": "p", "text": "Rogue Squadron managed to fulfill their role in space superiority and fire suppression well enough to allow the command shuttle Raven and the three medium transports to escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The base at Gelgelar was a vital asset to the Alliance, serving as a hospital space station for the Alliance forces present in the Elrood sector. The loss of the base made treatment difficult, and some of the Alliance's supplies had to be left behind in the hurry."}, {"tag": "p", "text": "The arrival of Task Force Vengeance further complicated matters and required the Alliance to completely retreat into the remote Airam sector."}, {"tag": "h2", "text": "Appearances"}]}