{"url": "Evacuation_of_Research", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Zaarin insurrection"], "nodes": [{"tag": "h1", "text": "Evacuation of Research"}, {"tag": "p", "text": "During the Zaarin insurrection, loyalist Imperial forces evacuated the XQ6 Platform Research and Zaarin's forces recaptured it."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After repelling, at significant cost, Grand Admiral Zaarin's previous attack on his Research platform. Loyalist Imperial forces, knowing that Zaarin will still not give in, were left with no choice but to evacuate the facility. To that end the Empire assigned BFF-1 bulk freighter Mharsup to pick up the two remaining TIE Defender prototypes Proto 11 and Proto 12, while Lambda-class T-4a shuttle G'nabgib was assigned to evacuate the scientists and technicians, one of which happened to be the chief scientist of the project."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Maarek Stele left the Research platform just as Mharsup arrived with two Escort shuttles Dragonfly. Shortly afterwards 6 Assault Gunboats Z-Mu arrived to disrupt operations, but Stele with the help of the Escort Shuttles fend them of. However, instead of a Nebulon-B frigate, as his briefing officer suggested the Imperial-class Star Destroy Glory arrived launching 6 Stormtrooper transports Z-Sigma, some Utility Tugs 20f16, TIE Advanced and TIE Bombers that were modified to have Deflector shields. Despite being outnumbered, Stele held of Zaarin's fighters long enough for both the Mharsup and G'nabgib to escape into Hyperspace. With both ships in Hyperspace, Stele disengaged and headed for the rendezvous point, encouraged by Zaarin's own TIE Defenders. The Glory likely destroyed the Research platform."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Both ships arrived at Navigation buoy B-0F9 to arrange a secret transfer to Modified corvette group Hashim. This transfer area would encounter difficulties."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle was first featured in the 1994 LucasArts video game Star Wars: TIE Fighter, in which players fly as Maarek Stele. The battle is depicted in the mission \"Protect Evacuation\", the third mission of the game's ninth tour of campaign, \"T/D Technology\"."}, {"tag": "p", "text": "This article assumes completion of all \"Primary\" objectives as well as significant \"Bonus\" objectives which are the destruction of all Assault Gunboats, Transports, tugs, and inflicting many starfighter casualties, including at least one TIE Defender kill on both groups."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}