{"url": "Evacuation_of_Rhen_Var", "categories": ["Category:Legends articles", "Category:Battles of the Dark Reaper Crisis", "Category:Battles of Rhen Var"], "nodes": [{"tag": "h1", "text": "Evacuation of Rhen Var"}, {"tag": "p", "text": "The Evacuation of Rhen Var took place in the first month of the Clone Wars. It was a crushing defeat for the Galactic Republic, despite the fact that the planet was believed unimportant to Republic forces at the time. It was only later that the Jedi High Council realized that capturing Rhen Var was the first step in the Dark Reaper Project."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "While stationed in the Tion Cluster, Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker detected a Separatist battle group comprising several Lucrehulk-class battleships emerging from hyperspace. Equipped with only their own Delta-7 starfighters, the two Jedi were unable to confront the fleet and so decided to instead warn the fleet's intended target, plotting their course to Rhen Var in the Tobali system."}, {"tag": "h2", "text": "Evacuation"}, {"tag": "p", "text": "Rhen Var was home to a small Republic outpost known as Bravo Base, located not far from where the Separatist army had made planetfall. Incapable of defending against an invasion of that size and magnitude, Kenobi called for transports to evacuate the base's personnel. Upon landing, he helped prepare the base for the evacuation, tasking his Padawan and a clone trooper crew in an LAAT/i gunship to retrieve the workers of a nearby communications facility that was already under siege when Skywalker arrived. After destroying the CIS Armored Assault Tanks and Hailfire droids, the workers were rushed on board and safely transported to Bravo Base. An inbound convoy of Republic Troop Transports full of clone troopers from the planet's garrison became Skywalker's next priority. He escorted them to the base, combating Separatist fighter and mortar tanks from the air. Upon the convoy's arrival at the base, Kenobi informed Skywalker of a small Jedi sanctuary caught between the Separatist forces and the base and ordered the extraction of the five Jedi stationed there. Once the Jedi had been recovered and delivered to the base, Skywalker joined in the battle to defend Bravo Base while the evacuation transports lifted off."}, {"tag": "p", "text": "After a grueling battle against overpowering forces that only continued to grow larger as more CIS landing craft touched down, the transports managed to flee the planet with Kenobi and Skywalker following shortly as Bravo Base was overwhelmed and subsequently destroyed. The two Jedi responsible for saving its personnel could only report to the Jedi Council that the planet had fallen to the Separatists."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the outpost was destroyed in this battle, the Republic later returned in search of the ancient Jedi Ulic Qel-Droma's tomb. Unfortunately, Count Dooku had already discovered Qel-Droma's burial site, and had received guidance from his spirit, in the process learning where the Force Harvester was buried—Raxus Prime."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}