{"url": "Evacuation_of_Yavin", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles to be expanded", "Category:Unsourced quotes", "Category:Battles of the Galactic Civil War", "Category:Battles of Yavin", "Category:Evacuations"], "nodes": [{"tag": "h1", "text": "Evacuation of Yavin"}, {"tag": "p", "text": "The Evacuation of Yavin was a battle between the Rebel Alliance and the Galactic Empire that took place six months after the Battle of Yavin in 0 ABY. It was to be the final clash of the long siege of the moon before the Alliance base was evacuated."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "On what was later marked as the start of a new calendar system by the New Republic, the Rebel Alliance destroyed the Galactic Empire's Death Star near their base on the moon Yavin 4. Although the Rebels celebrated the destruction of the superweapon, they prepared to evacuate from their base. The Empire blockaded the system, though. Small ships were able to escape the blockade, and Rebel leader Leia Organa undertook several missions on behalf of the Rebellion. Before the blockade was in place, heavy equipment was taken away from Yavin base, although the base's commander, General Jan Dodonna, concluded that the personnel could be evacuated quickly, and so convinced the Rebellion's leader Mon Mothma to allow the base to remain in operation as an act of defiance. The Imperial leadership therefore faced a dilemma with Yavin base still in operation. They could concentrate on wiping out the base, and risk a devastating raid elsewhere by the Alliance Fleet; or they could not focus heavily enough on blockading the system, and allow Mothma's forces to break the blockade. The blockade was therefore formed from a hastily-assembled task force from the House of Tagge and requisitioned from Nox Vellam, Grand Moff of the Bright Jewel Oversector, which contained the Yavin system."}, {"tag": "p", "text": "During the blockade, Yavin 4 was the site of several battles and retaliatory strikes. The Rebels also fought against small raiding parties. The blockade was successful in catching several Rebel units. The blockade continued for six months, angering Imperial fleet commanders, although the Supreme Commander and Sith Lord Darth Vader held off from ordering Yavin base's destruction while construction continued on his flagship, the Super Star Destroyer Executor. When it was finished, it launched toward the blockade. The Rebels used an power gem mounted on an attack ship piloted by Vrad Dodonna to delay the flagship. The move succeeded, but with the loss of Dodonna. The main portion of the Alliance Fleet was not at Yavin, though, and was able to stage a diversion to attempt to break the blockade."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Defending the temple"}, {"tag": "p", "text": "Rebel forces under Admiral Gial Ackbar engaged Imperial ships at three locations—Kli'aar, Pinoora, and the Vallusk Cluster—in order to trick the Imperial blockade into diverting ships to reinforce the attacked positions, leaving a space open for the Rebel fleet to go into hyperspace."}, {"tag": "p", "text": "However, the completed Executor finally arrived at Yavin 4 with Lord Vader's Death Squadron fleet, as well as elements of the personal fleet of Baron Tagge, and the battle began. TIE/LN starfighter and scouts on 74-Z speeder bikes scoured the moon for stragglers."}, {"tag": "p", "text": "Survivors of the Death Star combined their ranks and moved against the Rebel's main base. Imperial All Terrain Scout Transports, stormtroopers, shock troopers, scout troopers, and Imperial Army pilots fought against Rebel troopers, snipers, Wookiee soldiers, and vanguard divisions around a set of ruins and a Fountain near the base. The Rebels defeated those forces, buying time for the evacuation. General Dodonna ordered the base's fighters and transports to escape though he refused to evacuate himself until everyone had left."}, {"tag": "p", "text": "During the assault, the Empire launched an array of vehicles including A5 Juggernauts along with All Terrain Armored Transport and All Terrain Scout Transports carried on-board Y-85 Titan dropships, and PX-4 Mobile Command Bases. TIE Fighters and TIE/sa bombers also shelled the jungle area. Other Rebel forces included Rebel Armored Freerunners.[source?]"}, {"tag": "p", "text": "The Rebel operatives X2 and Shara fought against Imperial forces during the battle. X2 helped destroy a TX-130T fighter tank, and went into the base to activate the evacuation signal. A TIE bomber blew the comm tower, though, and X2 was forced activate turrets to destroy the bombers, then went out to repair the tower. X2 took a T4-B heavy tank to make his way to the waterfall. He then used his Force powers to jump to the top of the tower and used a fusioncutter to repair the tower. He then took control of an anti-air gun to defend the tower from more bombers. X2 then retreated to the hangar and took an X-wing starfighter."}, {"tag": "p", "text": "Lord Vader personally led a force of stormtroopers and dewback troopers in an attack on the main Rebel base, but he was caught in a fight with the Rebel forces from two other bases, Falcon Base and Raven Base. Although he was harassed by scouts on swoops, he proceeded to destroy both outposts, which were defended by troopers, cavalry units, and T1-B hovertanks. After eliminating the Rebel troop centers and Mech factories, he was supplied with reinforcements, including 2 AT-STs and TIE bombers. The force pushed all the way up to the Rebel's Massassi Temple and destroyed the missile turrets to allow for an aerial bombardment. Vader commented that they had a \"special surprise\" waiting for when the air defenses were down."}, {"tag": "h3", "text": "Evacuating"}, {"tag": "p", "text": "After the evacuation order had been given, a smaller Imperial force had pushed their way through to the Massassi Temple. However, Commander Col Serra and his newly created fighting force, Renegade Squadron, pushed back the Imperials and set up a perimeter to keep the Imperials busy while the evacuation proceeded. The door to the temple jammed, so a jetpack-equipped Squadron member jumped through a hole and repaired the door, as well as a turret to defend the temple. Another TX-130T fighter tank then arrived, and Serra ordered the squadron to destroy it. The group then captured a position near the Pyramid, killing at least four stormtroopers. A scout trooper managed to steal communication logs from the Temple, and the Squadron hunted the trooper and recovered the logs. Serra then ordered the Squadron to destroy three Data Banks with sensitive information to prevent them from falling into Imperial hands before escaping."}, {"tag": "p", "text": "General Dodonna and Lieutenant Bren Derlin found themselves trapped inside the Massassi temple as Imperial ground forces occupied the base; they were extracted by Red Squadron's Luke Skywalker, Wedge Antilles and Sarkli Piett. Dodonna, however, refused to board an escape transport: he had planted several concussion charges, which decimated a whole squadron of TIE Interdictors as they attacked the Temple. It was believed that the General had died in action, though it was later revealed he had been captured and imprisoned in the Star Dreadnought and prison Lusankya. A mind-scan conducted on the captive officer revealed the Rebel's plan to attack the agriworld Reytha."}, {"tag": "p", "text": "Over the moon, X2 joined with Commander Serra and took out a communications array on a Star Destroyer to prevent reinforcements from being called in. They then boarded the ship, and X2 sabotaged the reactor core. The two escaped before the ship blew."}, {"tag": "p", "text": "The evacuated Rebels rendezvoused in orbit to run the blockade. Vader, on-board his flagship, deliberately left a weak spot in the blockade to try to trap Luke Skywalker, the pilot who had destroyed the Death Star. The Rebel fleet moved within range of the Executor, but Admiral Amise Griff, commanding three Star Destroyers, made a hyperspace jump to cover the hole, and his three starships crashed into Vader's flagship, allowing the Rebels an instant in which to escape into hyperspace."}, {"tag": "p", "text": "Meanwhile, Commander Keyan Farlander, having been reassigned from the Independence to the Defiance to aid in the evacuation of the Rebels, was commissioned to fly an R-22 Spearhead under the call sign of Red 1 to escort the five CR90 Corvette group Crescent, which had been carrying the last of the evacuated staff from Yavin. Upon arriving from hyperspace to the Frigate's rendezvous point, while verifying the location of the corvettes from his inflight map, Farlander noticed a squadron of Imperial Alpha-class Xg-1 Star Wing Assault Gunboats attacking a group of four supply freighters 16 kilometers away. As he was too far away from them to save them in time (due to their shields already failing) as well as his immediate orders being to guard the corvettes, he let them be destroyed. He then reviewed his mission start-up procedures and cycled through the corvettes to inspect their contents, before assigning the lead ship to memory. Farlander then increased his own shields to maximum, just in time for the Nebulon-B Frigate Red Wind exit hyperspace from 10 kilometers away. The Red Wind then proceeded to launch two TIE/LN starfighters from Eta squadron, and four TIE/sa bombers. Farlander then went after the TIE Bombers, also intercepting several TIE fighters (including doing hull damage to the TIE fighter Eta 1). He kept his focus on the TIE bombers, viewing them as the priority threat. Afterwards, the Red Wind launched Beta Squadron of TIE Bombers. He also had to evade the Red Wind's gunners while tailing the bombers, due to being in close proximity to the frigate. Farlander then continued to defend Rebel transports as they reached one hyperspace jump point, and was eventually assisted by the arrival of Blue Squadron"}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "During the blockade, Skywalker had discovered an ice world called Hoth. He suggested that a command center for the Alliance could be established there if necessary. The evacuated Rebels hoped to establish a base on Hoth, but they had to replenish their supplies first. After escaping the blockade, the Heroes of Yavin were forced to battle the starship Hungry Ghost. Renegade Squadron searched for a new base. After his failure to capture the Rebel leadership, Vader continued his search for Skywalker. In 2 ABY, the Rebels were able to take refuge on Hoth, beginning the construction of a new base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The evacuation of Yavin was first mentioned in Star Wars: Episode V The Empire Strikes Back, and appeared in the Doom Mission and Race for Survival comic strips in 1983. Other sources released since then expanded on the battle."}, {"tag": "p", "text": "In the Darth Vader campaign 2001 video game Star Wars: Galactic Battlegrounds, Mara Jade can be spotted on the game map during the battle. After she is spotted, Vader exclaims \"What's this?!\" and Jade leaves on a Sentinel-class landing craft. However, since it is required to use cheat codes to see her, her appearance is likely an easter-egg and its canon status is dubious. In addition, the same game also implies that Darth Vader killed Jan Dodonna shortly after learning about Rebel activities on Raythar. Also, if the TIE Interdictors are moved far enough from the temple when it explodes, they will not be destroyed."}, {"tag": "p", "text": "One source which includes the evacuation is the 2004 video game Star Wars: Battlefront, although the storyline is considered S-canon by Leland Chee, the Keeper of the Lucasfilm Ltd. Holocron continuity database. The battle also appears in the game's 2009 sequel, Star Wars Battlefront: Elite Squadron, although only in the PlayStation Portable version."}, {"tag": "p", "text": "A seeming continuity error was created by Imperial Spy, which placed Q-7N at the Evacuation of Yavin and the preceding evacuation preparation. This clashes with Star Wars Missions 20: Total Destruction, which shows Q-7N's destruction, and, subsequently, the Rebels returning to Yavin Four. However, in Imperial Spy, Q-7N does not appear in the last set of frames, which show the Rebels after the evacuation. It is possible that the events of the final Missions arc took place during the events of Imperial Spy, though this has not been confirmed. However, it is also possible that Imperial Spy shows an entirely different event, after which the Rebels returned to Yavin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}