{"url": "Evacuation_of_Yavin_4", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of the Galactic Civil War", "Category:Battles of Yavin", "Category:Evacuations", "Category:Events of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Evacuation of Yavin 4"}, {"tag": "p", "text": "The evacuation of Yavin 4, also known as the evacuation of Base One or the evacuation of the Great Temple, by the Alliance to Restore the Republic took place in 0 ABY, in the days that followed the Battle of Yavin. Having destroyed the Galactic Empire's newest battle station, the Death Star, the Alliance feared reprisal attacks now that their position had been revealed. Therefore, they were forced to abandon the Great Temple on Yavin 4 in order to find a new base of operations. According to the cartographer Emil Graf, the final act of the evacuation involved an attack by an Imperial-class Star Destroyer, which was thwarted by the Alliance pilot Evaan Verlaine."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Nineteen years after Sheev Palpatine's rise to emperorship, on a day that was later marked as the start of a new calendar system, the Rebels of the Alliance to Restore the Republic launched an attack on the Galactic Empire's Death Star battle station from their headquarters at the Great Temple, on the fourth moon of Yavin. They managed to destroy the planet-killing battle station, dealing the Empire a major blow. Although there had been casualties, the Alliance happily celebrated their victory. The morning after the battle, two heroes of the battle, Luke Skywalker and Han Solo, were awarded the Medal of Bravery during a ceremony presided by Princess Leia Organa of the Alliance, who was instrumental to the rebellion, and whose homeworld of Alderaan had been destroyed by the Death Star."}, {"tag": "h2", "text": "Evacuation"}, {"tag": "p", "text": "As soon as the award ceremony was over, General Jan Dodonna addressed the assembled Rebels, telling them that the base should be evacuated immediately for fear of Imperial retaliation. All rebel fleets arrived in order to assist with the evacuation, and each Rebel was assigned a station for dismantling and transporting, while some were charged with scouting for potential outposts. Meanwhile, Dodonna began working to find a planet or moon to serve as a new secret base of operations. Against the general's order, Princess Leia Organa left the base under the cover of darkness with a compatriot and fellow Alderaanian, Evaan Verlaine of the Rebel Alliance Starfighter Corps. Together, they undertook an unsanctioned mission to rescue their fellow Alderaanians who had survived the destruction of their home planet. When Organa came back alone, Verlaine having remained behind with the newly assembled Alderaan Flotilla, the evacuation of Yavin 4 was still ongoing."}, {"tag": "h2", "text": "The Flat Mountain of Yavin"}, {"tag": "p", "text": "According to a tale told by the Wild Space cartographer Emil Graf, the Imperial retaliation strike Dodonna had feared did happen. While most of the Alliance personnel were still inside the Great Temple, an Imperial-class Star Destroyer and a contingent of TIE/ln fighters appeared in the sky of Yavin 4 and started attacking the site. According to Graf, Evaan Verlaine and a few Alliance troopers manage to infiltrate the Star Destroyer and incapacitate its crew. However, the controls were locked, and the capital ship was programmed to shoot at the Great Temple at full power after five minutes. As the troopers could not  bypass the security protocols, Verlaine decided to handle things herself. She ran to the Star Destroyer's hangar, boarded a Raider-class corvette she found there, and took off. Once in the atmosphere, she programmed the corvette to ram into the Star Destroyer before quickly escaping in a life pod. At first, it seemed that her plan had failed, since the capital ship did not change course. However, when the Star Destroyer finally fired, it turned out that it had moved just enough to deviate the blast slightly to the right. It hit a mountain behind the Temple, blowing off its summit and creating the \"Flat Mountain of Yavin\" in the process. Even though the Empire eventually regained control of the Star Destroyer, Verlaine's audacity and quick thinking allowed the Alliance to complete their evacuation."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Not long after the Rebel evacuation, the Empire began scouring the Great Temple in hopes of finding out where the Rebels had gone. As punishment for failing to stop an attack on the Tarkin Initiative laboratory on Eadu, Imperial Captain Magna Tolvan was tasked with leading that mission on Grand General Cassio Tagge's order. The captain's efforts, however, were greatly disturbed by the presence of the rogue archaeologist Chelli Aphra and her team. Ultimately, Tolvan and her men did not find anything of interest left behind in the Great Temple, just as Tagge had expected."}, {"tag": "p", "text": "A bit later, however, the Rebels realized that, in their haste to evacuate, they had neglected to destroy some of their data centers completely. Suspecting that the Imperials might be on their way to retrieve the secrets of the Alliance, Colonel Jennica Pierce ordered her Tatooinian agent to return to Yavin 4 and destroy the data before it fell in the Empire's hands. When the agent and his partner Saponza arrived at the former Rebel site, the Empire was already there, having massed forces and set up operations all over the moon. Despite the sheer number of Imperial troops opposing them, the Rebel operatives managed to destroy the data centers in time."}, {"tag": "p", "text": "After that, the Empire left Yavin 4, which remained largely untouched until after the Battle of Endor, when it was settled by colonists. In the years that followed the evacuation, the Rebels headquartered themselves in Echo Base on the snow planet Hoth and later on the small planet 5251977."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The evacuation of Yavin was first mentioned in the opening crawl of Star Wars: Episode V The Empire Strikes Back and it made its first canonical appearance in the 2015 comic, Princess Leia 1."}, {"tag": "p", "text": "In the 2017 video game Star Wars Battlefront II, a multiplayer mode in Galactic Assault depicts the evacuation. As the base's evacuation neared completion, an Imperial brigade lead by Colonel Brenna landed on Yavin 4 and attacked the Rebels, hoping to obtain their data banks. They were met with resistance from Alliance Major Shin and his troops, who attempted to hold them off while the last of anything valuable to the Empire was evacuated, including the data banks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}