{"url": "Evasive_Action:_Prey", "categories": ["Category:Real-world articles", "Category:Webstrips"], "nodes": [{"tag": "h1", "text": "Evasive Action: Prey"}, {"tag": "p", "text": "Evasive Action: Prey was an ongoing daily webstrip on Hyperspace, written by Paul Ens and illustrated by Thomas Hodges. The series began March 6, 2006."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "The three heroes of the previous webstrips, Drake Lo'gaan, Zonder and Ekria, are back in another adventure."}, {"tag": "p", "text": "The Padawans are still on the run from the Empire, hiding in their flat in the lower levels. Inquisitor Antinnis Tremayne is desperate to capture the three teenagers before Darth Vader hears of his failure."}, {"tag": "p", "text": "However, Tremayne is not the only danger the trio are facing. The scaly, green alien future leader of the Black Sun is hot on their trail…"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Inquisitor Tremayne had just returned from an expedition to the far flung corners of the galaxy in his quest for escaped Jedi. Lord Vader was very anxious to see the products of the search and appeared pleased when Tremayne presented him with the lightsabers of the Jedi he had killed, including Jedi Knight Niebur Boton. Tremayne proceeded to ask Vader for more funding in his attempts to hunt down more Jedi. When Vader had left, Tremayne confesses his fear that Vader might find out that he has failed to capture Drake Lo'gaan and his friends."}, {"tag": "p", "text": "Meanwhile in an exclusive sector of Coruscant, the Omwati, Kodo Finn and his wife Aleema had just finished their evening meal at a restaurant and were heading home. As they enter a pedestrian tunnel they are stopped by a gang of thieves linked to Xizor. Kodo gave them his wallet but the Duros leader of the gang was not satisfied. Suddenly from the middle of nowhere Ekria appears and used the Force to fend off the attacking thieves. With help from Drake and Zonder they succeeded in chasing away the criminals, but not before Kodo was branded onto the neck."}, {"tag": "p", "text": "After some research, Ekria discovered (to her horror) that the burn was the mark of Black Sun, sending Drake and Zonder to protect the Omwati before another attack could happen. The timing was perfect - Xizor had already hired Boushh, a bounty hunter, to finish what had been started by the gang. When Boushh arrived at the Finn's apartment, Zonder quickly helped the couple escape while Drake engaged their attacker. Ironically, Drake and Boushh formed a temporary alliance when Tremayne and his stormtroopers arrived on the scene."}, {"tag": "p", "text": "After Drake escaped once again, he and his fellow Padawans learned the entire story: Kodo was an employee for TaggeCo, a rival to Xizor's corporation, and had been paid off to divert Xizor's ships in favor of TaggeCo's. As a result, Xizor had placed a high bounty on Kodo's head in retaliation. To resolve the situation, the Padawans came to Xizor's headquarters with Kodo; after fighting their way through reclaimed CIS droidekas and Black Sun bodyguards, they met with Xizor himself and offered the Prince a deal."}, {"tag": "p", "text": "In exchange for information on TaggeCo's future operations, the Finns were allowed to leave Coruscant for a new life in the Outer Rim, and Xizor called off the bounty on them. On the sly, Xizor tried to use his encounter with the Padawans to his advantage; he had tracking devices discretely placed on them, and formed an alliance with Tremayne to exchange information on the Padawans for knowledge about Darth Vader."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to Ens, the plot and characters of Prey have some crossover and references to Coruscant Nights I: Jedi Twilight, as the two were developed at the same time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}