{"url": "Even_Piell/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Jedi Generals", "Category:Jedi Guardians", "Category:Lannik", "Category:Males", "Category:Pilots", "Category:Post-Ruusan Jedi High Council members", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Even Piell"}, {"tag": "p", "text": "Even Piell was a long-lived Lannik Jedi Master who served on the Jedi High Council during the waning days of the Galactic Republic. A native of the war-torn planet Lannik, he was taken from poverty and trained as a Jedi Knight at a young age, proving to be a fierce warrior and talented Force-user. He became a Master and was given a long-term seat on the Jedi Council, serving on the Council during the Stark Hyperspace War, the Yinchorri Uprising, and the Eriadu Trade Summit. Piell also occasionally served with the Palace Guard of his species's prince and foiled an assassination attempt on the prince—at the cost of one of his eyes."}, {"tag": "p", "text": "In 32 BBY, Piell was part of a team of Jedi sent to Malastare to conduct peace negotiations between the newest prince of Lannik, R'cardo Sooflie IX, and the Red Iaro revolutionaries, who wanted the fighting to stop. The negotiations proved fruitless, and several of Sooflie's guardsmen—one of whom Piell had once served alongside—attempted to assassinate the Jedi to win support for the Red Iaro. Piell managed to foil the attempt and later helped save Sooflie from an attempt on his life by the remaining Red Iaro members. During Piell's continuing service on the Council, the Corellian Jax Pavan became his Padawan learner."}, {"tag": "p", "text": "When the Clone Wars broke out on Geonosis, Piell was there to fight the rising Confederacy of Independent Systems, and he served in many other battles during the war. At one point, Piell and his Republic Navy captain, Wilhuff Tarkin, were captured by the Confederacy for their discovery of the Nexus Route hyperlane. Although they and their clone troopers escaped from imprisonment in the Citadel, Piell was fatally wounded by an anooba. Before passing on, Piell sent his half of the Nexus Route intelligence to the Jedi Council through Jedi Padawan Ahsoka Tano. Piell was laid to rest on Lola Sayu, where his sacrifice could be remembered."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Lannik male, Even Piell was born into an impoverished family on the war-ravaged world of Lannik during the waning days of the Galactic Republic. Like most of his generation, he was expected to live a life of deprivation and misery on a planet where continuous conflict was commonplace. However, Piell was discovered to be strong in the Force as an infant and was taken away from his homeworld by a Jedi to undergo training at the Jedi Temple on Coruscant. Piell showed an aptitude for the light side of the Force and proved an able wielder of the lightsaber. The Lannik Jedi constructed his own lightsaber and often used it in his duties as a Jedi Guardian. He earned a reputation as a fierce and humorless warrior who would never back away from a fight, eventually becoming a revered Jedi Knight. After becoming a Master sometime prior to the Stark Hyperspace War, he was granted a long-term seat on the Jedi High Council alongside the likes of Masters Yoda and Mace Windu. He was also a scholar on the Council of First Knowledge. Jedi Initiates like Telloti Cillmam'n remembered Piell for his stories about the Jedi Order's clashes with the Sith from centuries prior."}, {"tag": "h3", "text": "Jedi Master"}, {"tag": "p", "text": "Sometime during the Republic Classic era, Piell became one of select few Jedi to return to his planet of origin after being Knighted. He served with the Lannik royal Palace Guard, alongside fellow Lannik Hutar Zash, protecting two generations of Lannik princes; though a Jedi and fiercely loyal to the Republic, he never forgot his roots and served loyally and diligently. The Lannik government were embroiled in a costly war with a group of terrorists known as the Red Iaro, who were opposed to the traditional ways of Lannik and wanted to rule the planet in their own, extremist way. Negotiations between the two groups—mediated by high-profile Corellian diplomats—proved fruitless, and in a desperate, suicidal attempt to gain a foothold in the war, seven members of the Red Iaro, led by General Myk'chur Finux Zug, stormed a meeting between the diplomats and Lannik's prince in the Lannik High Court, holding them hostage."}, {"tag": "p", "text": "Piell fought off the revolutionaries, slaying six of them and saving the lives of the Lannik royalty and the Corellian diplomats. However, Zug was able to flee and continue his rebel activities. During the fighting, Piell lost his left eye and suffered many grievous wounds, which scarred his entire face. However, he refused to accept bacta therapy or a prosthetic replacement for his lost eye; to him, the scar represented honor, bravery, and reminded him of his prevailing against the immoral despite incredible odds. He carried it as a badge of pride, and he never forgot his efforts in keeping the peace on his homeworld. Yet the Red Iaro continued their insurgent activities under Zug's command; a bounty, later accepted by the bounty hunter Aldar Beedo, was put on Piell and his fellow Council members' heads by the \"Chosen One,\" the leader of a cult which hoped to increase terrorist activity on Lannik."}, {"tag": "p", "text": "The Corellian diplomats' daughter, Adi Gallia, was herself a Jedi, and she forever felt indebted to Piell for his actions in saving her parents. Even after she joined him on the Jedi Council, Gallia sought for a way to repay him, though Piell shrugged off her suggestions, insisting it was all part of his duty. Piell served on the Council during many conflicts, such as the Stark Hyperspace War, as one of the Council's senior and strongest members. He was more outspoken that the majority of his peers, and he was characterized by his somewhat radical—and always direct—ideas and decisions. During the Yinchorri Uprising in 33 BBY, when many Council members were investigating in the Yinchorri system, the Temple was infiltrated by a group of Yinchorri warriors in a bold attempt to assassinate the Jedi. Wielding his lightsaber, Piell, as well as numerous other Jedi, was able to repel the Yinchorri with minimal casualties, though the Council was deeply worried—it was evident that some unknown entity had guided the Yinchorri into such a foolhardy assault. The mission to the Yinchorr system undertaken by Mace Windu and a team of other Jedi was successful, although not without its casualties; Piell attended the triple funeral of fellow Council member Micah Giiett, as well as the Jedi Lilit Twoseas and Theen Fida."}, {"tag": "p", "text": "Piell was on the Council during the Eriadu Trade Summit in the same year. A team of Jedi led by Master Qui-Gon Jinn had been ambushed during a mission to Asmeru concurrent with the Summit and had lost contact with Coruscant; the Nebula Front terrorist organization claimed to have captured a number of hostages on Asmeru and demanded that the Trade Summit be canceled. Piell advocated stopping the Nebula Front with force, but many of his fellow Council members wished for a more subtle approach. The Lannik also advised offering the houses of the Senex sector—a self-governing domain that existed apart from the Republic and controlled Asmeru—a deal in exchange for their co-operation; Piell believed that allowing them free trade with the Republic—something which they had been refused because of their slave breeding—for their assistance in bringing the Nebula Front to justice was the best course of action to take. Ultimately, Supreme Chancellor Finis Valorum was able to end the crisis, though not without losing a considerable amount of support in the Senate. Also in 33 BBY, Piell and his fellow Councilors agreed that Nuru Kungurama, a Chiss youngling found by Jedi Masters Ring-Sol Ambase and Dooku, should be accepted into the Jedi Order as an Initiate."}, {"tag": "p", "text": "In 32 BBY, the Sith, long thought to be extinct, returned. Qui-Gon Jinn briefly dueled one of the Dark Lords of the Sith on the planet Tatooine, but was able to flee. He told the Council of his encounter, though many of its members were skeptical; nevertheless, Mace Windu agreed to investigate and learn the identity of Jinn's attacker. Jinn had another matter to discuss with the Council: he had found a young boy, named Anakin Skywalker, who was extremely strong in the Force and whom Jinn believed might be the Chosen One. Skywalker was brought before the Council, though they deemed him too old and potentially dangerous to be trained. Windu sent Jinn and his Padawan, Obi-Wan Kenobi, to Naboo in an attempt to lure out the supposed Sith; the plan worked, and Kenobi was able so slay the Dark Lord, but Jinn perished. Piell and the other members of the Council traveled to Naboo to attend Jinn's funeral. It was the beginning of a dark time for the Jedi High Council; one Sith had been slain, but they were unsure if it was the Master or the apprentice. Skywalker became the Padawan of Obi-Wan Kenobi, though the Council still had doubts about the boy."}, {"tag": "h3", "text": "Mission to Malastare"}, {"tag": "p", "text": "Later that same year, the conflict between the Red Iaro and the government on Piell's homeworld drew to an apparent close, and Myk'chur Finux Zug declared a stalemate, requesting that the peace process begin. The Gran Protectorate offered to hold the negotiations on a neutral ground, the planet Malastare, and the Republic's Judicial Department requested that the Jedi Council send delegates to act as arbiters during the meetings. Adi Gallia, still feeling that she had a debt to repay to Piell, brought the matter up at a meeting of the Council, championing Piell's sacrifice, though he brushed off her comments. As it was a matter of great importance to many systems nearby Lannik, Supreme Chancellor Palpatine requested that only members of the Council travel to Malastare. Piell volunteered, as his people's ways—considered somewhat primitive and strange by galactic society—were unknown to the other Jedi, and he felt his presence on Malastare was necessary. Masters Ki-Adi-Mundi, Plo Koon, Mace Windu, Yaddle, and Adi Gallia also volunteered to attend the negotiations."}, {"tag": "p", "text": "Traveling in a Consular-class space cruiser, the team of Jedi reached Malastare in days, and they were greeted by Gran Senators Ainlee Teem and Baskol Yeesrim, who began escorting them to their quarters. The Jedi were suspicious and on guard, as they suspected that the Gran had their own surreptitious reasons for hosting the talks on their adopted homeworld. En route, Piell, Gallia, and Yaddle realized the group was being followed and monitored by a Lannik, whom they presumed was a member of the Red Iaro, and a hooded Ffib priest, a member of a theocratic religion established on the planet Lorahns; intrigued, Piell and Gallia doubled back and intercepted the duo, asking why they were following the Jedi Council members. The Lannik and the priest responded by shooting at Piell and Gallia, though the Jedi Masters were able to fend them off with ease, with the help of Ki-Adi-Mundi and his Padawan, A'Sharad Hett, who had just arrived in the corridor. Piell's attackers fled, and the Jedi gave chase but ultimately reached a dead end, where two Gran guards claimed to have seen no beings fleeing in the corridor."}, {"tag": "p", "text": "Teem and Yeesrim admonished the guards and sent them to look for the assailants before taking the Jedi to Governor Gujdim Wiphshun's palace, where Teem assured them they would be safe. The Jedi sensed great danger and deception on Malastare, though they put such thoughts to rest when the actual negotiations took place. They were introduced to Wphshun and Senator Aks Moe, the Grans who would chair the meeting; Lannik Prince R'cardo Sooflie IX, the son of the prince whose life Piell had saved several years previously; and Sooflie's military advisor, Piell's old colleague Hutar Zash. Sooflie was suspicious of a countryman serving with what he considered \"religious ragamuffins,\" and Piell introduced himself; when Sooflie showed no sign of remembering either Piell or his sacrifice, Gallia admonished him, though the Lannik Prince remarked that had Piell not saved his parents' lives, he might have become prince sooner."}, {"tag": "p", "text": "The Red Iaro representatives, led by Myk'chur Finux Zug, eventually arrived, several minutes late, and were immediately dismissive of the Jedi, believing their presence to be unnecessary. Piell confronted Zug, but the Lannik revolutionary claimed that times had changed; the Red Iaro, he said, was tired of fighting and wished to stop. Piell, however, knew that Zug would be back to his old ways before long. Negotiations started, though it was clear to the Jedi that they would go nowhere; Zug's demands were not unreasonable, but Sooflie refused to accept anything, and after an angry outburst from the Prince, Windu called a recess in the talks. Hutar Zash and several other Lannik guardsmen offered to give the Jedi a lift to their quarters in the Governor's palace, and, hoping to use the opportunity to speak to Zash, Piell accepted."}, {"tag": "p", "text": "En route, Zash told Piell of matters on Lannik; since Sooflie had ascended to power, the old ways and traditions were dying, and the people were growing more and more unhappy with their new prince. Suddenly, Zash and his subordinates revealed that they had thermite charges strapped around their torsos—they hoped that their sacrifice, performed in front of many cam droids recording a podrace on concurrent with the peace talks, would help bring back the old ways on Lannik. Piell reacted extremely quickly, using his lightsaber to bisect the EasyRide passenger airspeeder, leaving himself, Gallia, and Windu on one side and the two Lannik on the other. Zash and his companion's explosives detonated, but the Jedi survived—however, they were plummeting toward the ground."}, {"tag": "p", "text": "They managed to grab a hold of a passing podracer, piloted by Sebulba, though the Dug podracer attempted to knock them off. Eventually, Windu—whom Piell and Gallia were holding on to—lost his grip and fell, though the other airspeeder, piloted by Yaddle, was able to collect them. Presuming that Zug and Zash were in league with each other, the Jedi believed that Zug, with his plan to kill the Jedi a failure, would be desperate, and they concluded that he would attempt to assassinate Sooflie. They arrived in the Prince's chamber as Zug and his minions were preparing to feed Sooflie to a pair of akk dogs, non-sentient predators native to Haruun Kal. Not wanting to kill the creatures, the Jedi subdued them, but Zug was able to use the opportunity to try and escape with a jetpack through the ceiling window—however, he collided with a podracer, and was killed. Aks Moe and his guards arrived within moments, removing the remaining revolutionaries before the Jedi could question them; the Senator announced the peace talks' end and requested the Jedi return to Coruscant. Sooflie left without showing any sign of gratitude to Piell, though the Jedi Master did not mind—he knew he had done his duty to the Republic. Piell and his fellow Jedi returned to Coruscant, their mission a complete failure."}, {"tag": "h3", "text": "Separatist Crisis and Clone Wars"}, {"tag": "p", "text": "Some time later, Piell took a Padawan learner of his own, a Corellian named Jax Pavan. Pavan's father, Lorn, had once been a worker in the Temple, but had been requested to leave after his son was admitted to the ranks of the Jedi Order. Piell served on the Jedi Council throughout the Separatist Crisis and watched with continuing dismay as more and more systems seceded and joined the Confederacy of Independent Systems, led by Count Dooku—a former Jedi. However, the CIS was by far not the only threat that the Order, and the Republic, faced. In 30 BBY, a rogue Dark Jedi—former Jedi Padawan Aurra Sing—killed two Jedi Masters, J'Mikel and Peerce, on Coruscant, in the shadow of the Temple itself. Piell in particular was shocked by this when it was announced during a Council meeting, and although many efforts were made to apprehend Sing, none succeeded. Following Sing's attack on the Jedi, Piell and the Council attended the ceremony to make Jedi Knight Quinlan Vos a Jedi Master and Padawan Aayla Secura a Knight, though the Council lost Masters Yaddle and Yarael Poof, who both perished defending the Republic from terrorists; they were replaced by the Jedi Shaak Ti and Coleman Trebor, respectively. Piell attended Poof's funeral on Coruscant alongside the Jedi High Council and several Quermian Jedi."}, {"tag": "p", "text": "In 22 BBY, matters between the Confederacy and the Republic reached a boiling point. Obi-Wan Kenobi, along with Anakin Skywalker and Senator Padmé Amidala, was captured by Separatists on the planet Geonosis, and a team of Jedi led by Mace Windu traveled to the Petranaki arena on Geonosis to rescue them. Piell was among the 200 Jedi sent and fought in the Battle of Geonosis. Fighting against battle droids in the Petranaki arena, he was eventually separated from the majority of the Jedi in the arena. The Lannik was one of select few Jedi who survived the battle, with the aid of a clone army taken by Yoda to Geonosis. The Clone Wars had begun."}, {"tag": "p", "text": "Piell became a Jedi General and participated in a myriad of battles during the three-year conflict, often being assigned vital missions to safeguard vital Republic territory and information. His fleet officer from the Republic Navy came to be Captain Wilhuff Tarkin, who harbored a certain mistrust for Jedi. Early in the war, Piell was present during an important Jedi Council meeting, in which the Masters discussed the war. The Separatists' new Supreme Commander, General Grievous, had recently killed several Jedi during the Battle of Hypori, and the Council was worried about the dwindling numbers of fully-fledged Jedi in the Order. Newly promoted Council member Obi-Wan Kenobi suggested that they make his Padawan, Anakin Skywalker, a Knight, though many on the Council disagreed, believing Skywalker too headstrong. Piell pointed out that Supreme Chancellor Palpatine had been campaigning for Skywalker's promotion, though Master Windu replied that politicians had no say in Jedi matters. Ultimately, it was decided that Skywalker would be Knighted, and Piell was present during the ceremony."}, {"tag": "h3", "text": "Prisoner of the Citadel"}, {"tag": "p", "text": "On a perilous assignment in the Outer Rim Territories, Piell and Tarkin uncovered the coordinates of a secret hyperspace lane called the Nexus Route, which linked both the Republic and Separatist homeworlds and therefore proved valuable to both sides of the war. When Piell and Tarkin returned from the Outer Rim aboard their flagship, however, the Separatists—seeking to pilfer the Nexus Route's coordinates from Piell—mounted an attack on his Star Destroyer with the intention of capturing him. While a Confederate fleet launched droid starfighters against Piell's cruiser, a battle droid squad boarded the vessel to capture Piell. To safeguard the information on the Nexus Route, Piell erased his ship's computers and committed half of the information to memory while Tarkin memorized the other half—that way, in case Piell surrendered the intelligence, it would be useless to the Confederacy without Tarkin's half. It was not long before the battle droid boarding party made it to Piell's position on the bridge of the Star Destroyer. Piell at first succeeded in using the Force to destroy the initial group of B2 super battle droids, but the appearance of droidekas forced him to surrender."}, {"tag": "p", "text": "Piell was stripped of his lightsaber, and he, Tarkin, and their crew were taken to the Citadel, a reputed Separatist prison on the sulfurous, cracked planet Lola Sayu. Overseen by the cruel warden Osi Sobeck, the prison had been built to hold rogue Jedi and had gained a reputation as a highly impenetrable detention facility. While Tarkin and several clone naval officers were installed in a holding cell, Piell was incarcerated in another cell, where he was held in a containment field. Under supervision from an A4 laboratory assistant droid, a BX-series droid commando electrocuted Piell multiple times with an electrostaff in an attempt to force the Nexus Route intelligence out of him. Piell failed to crack, however, even when the A4-series droid coerced him into yielding the information to put an end to the torture. Just as the droid made to cut out Piell's remaining eye, an elite team of Jedi and clone troopers—having infiltrated the Citadel under the command of Anakin Skywalker and Obi-Wan Kenobi—broke into Piell's cell. Advanced Recon Commandos CT-27-5555 and CT-21-0408—nicknamed \"Fives\" and \"Echo,\" respectively—shot down the droid commando assaulting Piell and another droid commando in the cell, while Clone Captain CT-7567, nicknamed \"Rex,\" took care of the interrogator droid. Kenobi, Skywalker, and the latter's Padawan, Ahsoka Tano, then entered the cell with the rest of the team."}, {"tag": "p", "text": "After Kenobi and Skywalker freed him from his containment field and returned his lightsaber to him, Piell told them of his exploits with separating the information on the Nexus Route between himself and Tarkin. The team therefore resolved to free Tarkin and the other officers from their cell. On the way to Tarkin's cell, the Jedi and clones cut through a squad of highly maneuverable droid commandos, though Sobeck—who was aware of Piell's escape—had more in store for them. Sobeck activated an ultrasonic wave that impaired the group's hearing, while a powerful magnet drew the Jedi's lightsabers and the clones' blasters to a raised crevasse in the ceiling. Skywalker was even sucked up to the ceiling by his cybernetic arm, which fell to the magnet's attraction. As the sound frequency died down, droid commandos arrived from both directions of the hallway to subdue the unarmed Jedi and troopers. In response, Piell and Tano attempted to Force-push the droids away, while Kenobi pitted his telekinesis against the others. When the droids magnetized their feet to the floor, the three Jedi redoubled their efforts, giving Skywalker enough time to deactivate the magnet holding their lightsabers. Skywalker and the squad's weapons dropped to the floor, and the group made quick work of the droids before continuing on to rescue Tarkin and the naval officers."}, {"tag": "p", "text": "Once the droid commandos guarding Tarkin and the clones had been destroyed, Piell entered the cell and introduced the others to Tarkin. Although Kenobi and Tarkin debated the best possible method of escaping from the Citadel—Kenobi favored splitting up to continue separating the Nexus Route information, while Tarkin believed that strength laid in numbers—Piell chose to go with Kenobi and his squad to create a diversion for Tarkin, Skywalker, Tano, and some of the other clones to escape. The group split up, and Piell and Kenobi led their men through the Citadel, planting thermal detonators as they went. When Kenobi activated the charges, they caused an intense explosion to take the Citadel, compromising one of its entire levels. Thanks to the distraction, Skywalker and his comrades were able to escape from the Citadel. Meanwhile, Kenobi, Piell, and their team headed for the Citadel's upper levels through a ventilation shaft. Kenobi contacted the Republic's stolen Separatist shuttle, piloted by Skywalker's astromech droid, R2-D2, and several reprogrammed battle droids. Kenobi requested a pickup at the Citadel's rear landing platform, only to find out that Skywalker had already given the go-ahead for their departure."}, {"tag": "p", "text": "As Piell, Kenobi, and their men proceeded further upward through the vents, they were spotted by a Confederate probe droid. Piell quickly propelled himself into the air, destroying the droid. However, security doors started closing throughout the shaft, cutting one clone trooper in half and separating the members of Piell's group from each other. Using their lightsabers, Piell and Kenobi were able to cut their way through the security doors. Emerging from the shaft, Kenobi, Piell, and the clones used ascension cables to reach a lower level near the landing pad. Kenobi tried to raise Skywalker via comlink, but instead they heard Sobeck, who revealed that he had predicted their every move. Upon his words, several hidden turrets on the platform came online, while droid commandos, droidekas, and an LM-432 crab droid emerged, capturing Piell and the others. They were subsequently taken to Sobeck's command center, where the warden demanded that Piell disclose his half of information, threatening to start executing his men if he refused. Piell did not comply, stating that all of them, including the clones, were ready to die to protect the intelligence. Challenging Piell's claims, Sobeck killed one of them with a shot in the head. As he prepared to execute a second trooper, Sobeck was interrupted by his T-series tactical droid, K2-B4, who informed him that Skywalker's group had been discovered. Sobeck subsequently ordered his droids to take Piell, Kenobi, and the clone troopers to the interrogation center and torture them."}, {"tag": "p", "text": "On their way to the prison block, the Republic hostages and their battle droid escorts were intercepted by R2-D2's reprogrammed droids, who assured Sobeck's droids that they would escort the prisoners from that point. Now free, Piell and the others rendezvoused with R2-D2 himself and proceeded toward the landing pad and the shuttle parked there. Reaching the landing pad, heavily guarded by droids, the Republic team proceeded toward the shuttle, still posing as prisoners under escort from R2-D2's battle droids. The leader of R2-D2's droid team, OOM-10, tried to bluff his way past several droids guarding the shuttle, telling them that he was taking the prisoners to the fictitious Point Tarron. The lie initially worked and allowed Piell and the others passage toward the shuttle, but they were soon stopped when K2-B4 informed the droid guards about the group's escape—with assistance from reprogrammed droids. Kenobi destroyed the nearest guard with his lightsaber, but heavy laser cannons opened fire at the Republic team, forcing them to take cover, while more battle droids arrived at the landing platform. At this moment, Skywalker's group arrived, joining the battle. Tarkin proposed a direct assault on the shuttle, planning to use its weaponry to defeat the droids, but the Jedi were distracted by three droids approaching on Single Trooper Aerial Platforms."}, {"tag": "p", "text": "Leaping onto Skywalker's shoulders and then into the air, Piell dispatched one STAP, while Skywalker took control of another. The third droid followed Skywalker, and Piell hopped onto Skywalker's speeder, deflecting the enemy's shots and dispatching the STAP. Meanwhile, a droid commando attempted to use one of the laser cannons to destroy the Republic shuttle, and trooper Echo informed Skywalker of this. Skywalker and Piell launched an attack run on the droid commando, but the latter shot down their STAP, and the two crashed on the ground. The droid also managed to destroy the shuttle, and Echo was killed trying to protect the craft. With their only means of escape destroyed, Piell and the others retreated from the landing pad. As they were escaping, Kenobi and Skywalker contacted the Jedi Temple, requesting retrieval from the Jedi Council stationed there, and Master Plo Koon promised to send a fleet of cruisers to rescue them. Once they were safely away from the Citadel, Kenobi informed the others that they would have to reach a rendezvous point and hold out long enough to be extracted. However, in order to reach the rendezvous point, they would have to trek across the nearly unnavigable landscape of Lola Sayu."}, {"tag": "h3", "text": "Death and legacy"}, {"tag": "p", "text": "As the group moved across Lola Sayu's terrain, Kenobi decided to contact the Jedi Council for an update on the Republic forces' estimated time of arrival. Using the holoprojector built into R2-D2, Piell and Skywalker contacted the Council, talking to Masters Mace Windu and Yoda, who informed them that Koon's battle group was already on its way to Lola Sayu. Yoda and Windu also told them about their rendezvous point with the Republic gunships—a small island amidst a boiling lake of lava—and reminded the escapees that they would have only a small window of opportunity for extraction. The group were soon attacked by several droid commandos, but Fives was quick to toss a grenade at a rock base, collapsing it and sealing the way for the droids. Despite the victory, Kenobi was certain that more droids were on the way. As Piell and the others reached a cliff, they were indeed attacked by more droids, including some crab droids. While R2-D2's battle droids delayed the enemy forces, the Jedi and the clone troopers used ascension cables to reach the lower levels, carrying Piell and his officers on their backs; the group suffered more casualties in the descent as a clone trooper and the clone officer he was carrying fell to their deaths when battle droids compromised their cable. After the surviving members of the group reached the ground, they escaped to an underground tunnel to avoid the droids' fire from the cliff."}, {"tag": "p", "text": "As the team emerged from the tunnel and avoided an STAP droid patrol, they heard a distant howling. They realized that they would soon be faced with some dangerous predators—more specifically, a group of anoobas that Sobeck had released to track them. With the anoobas close behind, the Jedi realized that they would have to battle the creatures, as the creatures would alert the battle droids to their position. To surround the anoobas and better fight them, Skywalker, Kenobi, and R2-D2 continued to move on to serve as a distraction for the creatures to follow. Piell, Tano, Tarkin, and the rest of the team meanwhile waited at a nearby cave for the anoobas to pass, intending to attack the creatures from behind. After Skywalker and Kenobi had begun to battle the anoobas and their accompanying patrol of STAPs, Piell and his group moved in to attack the Separatists from behind. However, they were quickly surrounded by a large number of crab droids. Piell reacted quickly, cutting his way through a crab droid that had been about to kill a clone officer. Ordering Tarkin and the clones to catch up with Skywalker and Kenobi, Piell remained at the cave with Tano to handle the droids, making quick work of most of them. While his attention was focused on destroying one of the last droids, however, Piell was assaulted by one of the anoobas, which knocked him down and mauled him with a mortal wound."}, {"tag": "p", "text": "Seeing this, Tano quickly dealt with the anooba and rushed to Piell's side. She made to get help, but Piell, knowing that he was dying, instructed her to listen and memorize his half of information on the Nexus Route. Tano was hesitant to take such a burden, explaining that she was not even supposed to be on the mission, but Piell assured her that it did not matter anymore—she was there, and she would now be the mission's most important part. Instructing her to reveal the information only to the Jedi Council, Piell told her all he knew about the route and then passed on. Tano carried Piell's body back to Skywalker and the others, who had defeated Sobeck's forces for the moment. The Jedi draped Piell's body in a cloth and took a brief moment to honor his sacrifice, consigning his body to the lava of Lola Sayu. They performed the ritual quickly, knowing that Piell would have wanted them to complete the mission."}, {"tag": "p", "text": "The Republic team successfully reached the island, killed Sobeck, and was extracted by the arriving Republic forces. Upon arrival on Coruscant, however, there was a disagreement between Tano and Tarkin; Skywalker's Padawan intended to deliver her part of information to the Council as she had promised Piell, while Tarkin wanted to share his half directly with Supreme Chancellor Palpatine. Yoda then decided to meet with the Chancellor and choose the best course of action. Piell was greatly missed by the Jedi Council, but his sacrifice was remembered. In 19 BBY, the Clone Wars ended with the near-extermination of the Jedi Order and the reformation of the Galactic Republic into the Galactic Empire, with Palpatine as the Emperor. Piell's species entered a period of great hardship after the Empire blocked the flow of trade to their planet, and, even decades after the Empire was toppled, they were still attempting to restore their economy. Piell was remembered as one of the most famous Lanniks, and his exploits in dealing with the Red Iaro were widely documented."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite being diminutive in stature, Even Piell was larger than life. Gruff, outspoken, and battle-hardened, he was a great warrior who was noted for his willingness to charge into battle, as well as for his fearlessness, courage, and tenacity. He became known as one of the Jedi High Council's senior and strongest members. During the Red Iaro attack on the Lannik royalty, Piell seemed, to some, hopelessly outnumbered, yet he did not let the odds deter him and emerged victorious. Despite the urgings of many of his peers, he did not attempt to heal his scars; Piell was proud of his achievements, and, to him, his scars represented honor, bravery, and perseverance and reminded him of that day in the Lannik High Court. Although he had a passion for wisdom and was glad to be a scholar on the Council of First Knowledge, he did not let such a position stand in the way of making snap decisions, be it on the Jedi Council or on the battlefield. He believed in diplomacy and negotiations, but he also did not shy away from using force to settle confrontations."}, {"tag": "p", "text": "Piell was extremely loyal to the Jedi, the Republic, and his homeworld. While most Jedi never returned to their planet of origin after being trained in the ways of the Force, Piell was an exception, and to him it was an honor to serve the Lannik royal family, something he took very seriously. He cared deeply for the fate of his homeworld, and it saddened him that some, such as the Gran, seemed to be determined to exploit its untapped natural resources. Piell was known for his considerable wisdom, which he acquired during his long life as a Jedi. However, too many, particularly those on his homeworld who did not understand the ways of the Jedi, he was simply an old man who was too attached to ancient traditions. He was a traditionalist, teaching his pupils with tested, proven methods; he disapproved of the unorthodox teaching methods favored by many of his peers, such as Master An'ya Kuro, claiming that they were brutal and disturbing. Piell was opposed to oppression or slavery of any kind, and he voiced his displeasure to the Grans of Malastare that they had subjugated the native Dugs of the world and made them subservient. Despite this, Piell was a proponent of ignoring the Senex sector's stance on slave breeding at the time Eriadu Trade Summit, and allowing them to join the Republic in exchange for their co-operation in apprehending the bounty hunter Arwen Cohl."}, {"tag": "p", "text": "Piell was quick-thinking, and when his Star Destroyer was boarded by the Separatists, he cleverly committed half of the information on the Nexus Route to memory while having his Captain, Wilhuff Tarkin, memorize the other half. Piell sometimes disagreed with Tarkin, who harbored certain doubts about the Jedi and their abilities, and their relationship was slightly tense at times. When Tarkin inquired as to what they would do if they did not find the Republic forces at the rendezvous point, Piell brusquely told him to just keep moving, leading Skywalker to advise Tarkin not to try to argue with the diminutive Jedi Master. Unlike Tarkin, who meant for his half of the information to reach Supreme Chancellor Palpatine's ears, Piell intended for his part of the intelligence to be disclosed only to the Jedi High Council. While being interrogated in the Citadel, Piell refused to surrender his information on the Nexus Route to a mere interrogator droid. When faced with Osi Sobeck himself, who threatened to start killing his men if he refused to divulge the information, Piell believed that all of them, including the threatened clones, were prepared to die to protect the information for the Republic."}, {"tag": "p", "text": "Although his seriousness made him well-suited to important Council business, Piell had a dry sense of humor, developed from his long years spent on the battlefield; he joked with Anakin Skywalker and Obi-Wan Kenobi even when faced with the daunting prospect of escaping from the Citadel. He also displayed a certain amount of self-confidence, believing that it would not be a problem for the Republic team to hold out on Lola Sayu until Plo Koon's arrival and that they would easily defeat Sobeck's battle droids. Even when dying, he was determined to complete the mission at all costs and found within himself the strength to tell Ahsoka Tano the vital information before he died. Despite the fact that Tano had not even been authorized to join the mission, Piell felt that she had become the most important part of the operation, as she was now the person who would ensure, in his place, that the Nexus Route intelligence reached the Jedi Council. Tano viewed Piell's sacrifice as honorable, and the news of his actions struck the Jedi on Coruscant as well, with Mace Windu stating that he would be missed."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A great warrior who was no stranger to battle, Even Piell practiced all seven lightsaber forms with equal proficiency, although he did not have a preference for any one of them. He was a highly talented swordsman with his crimson—later green—lightsaber, capable of deflecting blaster bolts with ease, which he demonstrated during the mission to Malastare and his escape from the Citadel. He even came to be considered one of the Jedi Council's strongest members. Among his natural abilities included his increased audio capacity, as his large ears were sensitive in thin atmospheres. He stood up to severe amounts of torture and electrocution, even remaining conscious throughout such bouts. Like all Jedi, however, he was not infallible, and droidekas were able to take him prisoner aboard his cruiser. Piell was a Jedi Guardian, meaning that he focused more lightsaber combat and also on using the Force in combat than for other means. He was also a skilled manipulator of the Force; he was able to use it to telekinetically push battle droids away aboard his cruiser and to propel himself in the air while facing off against numerous battle droids on Lola Sayu. His mastery of the Force on Lola Sayu was well complemented by his agility in combat; he was quite nimble given his size, and he used his nimbleness in conjunction with his use of a lightsaber. Piell was also rather strong physically and was a skilled pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Even Piell was created for the 1999 film Star Wars: Episode I The Phantom Menace, as one of the non-speaking Jedi during the scenes involving the Jedi Council, though he was debuted in Terry Brooks' Episode I novelization. In the film, he was portrayed by actress Michaela Cottrell, who wore heavy make-up. Piell was again featured in Star Wars: Episode II Attack of the Clones, albeit via stock footage taken during the filming of The Phantom Menace, though he was not seen in the Battle of Geonosis scenes. The character was not featured in Star Wars: Episode III Revenge of the Sith."}, {"tag": "p", "text": "Piell has had several appearances in subsequent spin off material, mainly as a member of the Jedi Council in comics. He first appeared in the Emissaries to Malastare story arc of the Star Wars: Republic comic series, which greatly expanded his backstory and character. He also appeared in numerous other Dark Horse Comics works, though as a minor character, usually without dialogue, as well as in James Luceno's Cloak of Deception in 2001. Sources such as the Power of the Jedi Sourcebook and The New Essential Guide to Characters established that, although he was not seen in the Geonosis portions of Attack of the Clones, Piell participated in and survived the Battle of Geonosis. Piell was featured briefly in Clone Wars Chapter 21, where he was voiced by Daran Norris."}, {"tag": "p", "text": "Piell had also appeared in two comics featured in Star Wars Tales, whose canonicity is uncertain. Piell appears on the Jedi Council in \"Yaddle's Tale: The One Below\"; the story has since been referenced by The Official Star Wars Fact File, though Piell's part in the tale has yet to be referenced by a canon source. As Oppo Rancisis, later revealed to be Yaddle's Padawan in the Power of the Jedi Sourcebook, is present on the Council when Yaddle is inducted to that body, it can be assumed that at least some of the Councilors featured in it are not canon. Piell also makes a brief appearance in \"The Lesson\", which portrays him fighting during the Battle of Geonosis. Piell's role in the comic was canonized in Leland Chee's blog, though the canonicity of the comic as a whole is uncertain."}, {"tag": "h3", "text": "Fate under debate"}, {"tag": "p", "text": "Piell's absence in Revenge of the Sith left his fate unexplained, and it was not known if he had survived Order 66 or not until author Michael Reaves featured him in the opening chapters of his 2008 novel, Coruscant Nights I: Jedi Twilight. However, this was to be retconned several years later in February 2011, when Piell made his debut in the Star Wars: The Clone Wars television series. Voiced by voice actor Blair Bess, Piell appeared in a third season story arc comprised of the episodes \"The Citadel,\" \"Counterattack,\" and \"Citadel Rescue.\" The latter episode overturned the canonicity of Jedi Twilight by depicting Piell's death on Lola Sayu, chronologically prior to his original death in the novel during Order 66. According to Leland Chee, who clarified the major change in continuity, Piell had been chosen to die in Jedi Twilight because he was a prominent Jedi, though he had not in fact made an appearance in Episode III."}, {"tag": "p", "text": "The following section lists the events of Coruscant Nights I: Jedi Twilight, which can no longer be regarded as canonical with the newer version of Piell's death in \"Citadel Rescue.\" Although the novel depicted the Corellian Jax Pavan as Piell's Padawan, Leland Chee initially stated that with the premiere of \"Citadel Rescue,\" Piell was no longer considered to be Pavan's Master. However, this was revised and clarified with the release of the Star Wars: The Clone Wars Comic UK 6.18 publication; Chee stated that Piell was in fact still assumed to be Pavan's Master, at least at one point in time. Specific parts of Coruscant Nights I: Jedi Twilight were never retconned. Chee indicated that staff at Lucasfilm Ltd. discussed the idea of making modifications to future reprints of the novel, though they ultimately decided against it."}, {"tag": "h4", "text": "Coruscant Nights I: Jedi Twilight"}, {"tag": "p", "text": "During his training of Jax Pavan, Piell taught Pavan that Jedi did not need the Force to exist; even without it, their ideals and dogma still made them Jedi. Pavan found this particular lesson difficult to comprehend, even years later. Piell, who became almost like a father to his Padawan, took Pavan on many assignments, including two into the deepest level of Coruscant's undercity. Pavan was knighted two months before the war's end in 19 BBY; by this point, Piell, now quite old, was no longer a member of the Jedi High Council, and his vacant seat was taken by Anakin Skywalker. Piell was present in the Jedi Temple when Order 66 and Operation: Knightfall were initiated. Hordes of clone troopers, led by Anakin Skywalker—who had become the Sith Lord Darth Vader, freshly turned to the dark side—assaulted the Temple, mercilessly killing Jedi, employees, and younglings, while across the galaxy, clone troopers turned on their generals and executed them. Piell fled the Temple, finding his way into Coruscant's underlevels and hiding there. He believed that he was the only senior Council member to survive the slaughter, though several other Councilors did in fact survive. In the days that followed, Palpatine issued the Declaration of a New Order, becoming Galactic Emperor, and the remaining Jedi were hunted down one by one by Darth Vader and many other dark side underlings. Piell knew his days were numbered, and for the first time in his life, he knew fear."}, {"tag": "p", "text": "Piell survived for weeks; while many of his fellow survivors stopped using the Force in an attempt to avoid detection, he refused to sever his ties to the Jedi Order and continued to utilize the Force. He did, however, avoid using it in public, though he generally lived in ghettos and slums in the Crimson Corridor, where he could avoid detection. Some time after Operation: Knightfall, Piell learned of a droid, designated 4-TO, that held considerable amounts of secret information of a sensitive nature about the Empire. According to his sources, Darth Vader was attempting to hunt down the droid, and Piell made it his mission to locate it, believing he would save many lives in doing so."}, {"tag": "p", "text": "Several months after the Great Jedi Purge had begun, Piell was somehow located by the Empire, and teams of stormtroopers pursued him in Coruscant's deepest slums. Sensing them through the Force, he attempted to hide in what was once a spice den, but in doing so, he had allowed himself to be cornered. Piell tried to escape via a tube, through which an elevator once traveled, though he had to use the Force in order to push himself upwards. The stormtroopers entered the building just as he entered the tube, and began firing at it; too late, Piell realized their tactics. They fired above and below where he was, melting the tube and fusing the two sides together to create an impassable mass, leaving Piell trapped. Using his lightsaber, he was able to free himself from the tube, though he was still effectively trapped; the five troopers had blocked the only exit, and Piell knew that his weeks on the run, with little food or rest, had left him far from peak fighting condition."}, {"tag": "p", "text": "Piell deflected everything the Imperials fired at him, but he was unable to escape. Knowing it was a risky tactic which the stormtroopers might have witnessed before, he Force Jumped over the troopers and towards the exit, and his attempt was almost successful. However, one of the troopers detonated a flash grenade, leaving Piell temporarily blind, while the troopers' helmets made them immune to the grenade's effects. Piell was still able to use the Force to deflect blaster bolts and make his way toward the door, but again, the clones were one step ahead of him. One of them threw an impact sensitive grenade toward him, while another fired at it, detonating the explosive less than a meter away from Piell and injuring him severely. Piell realized that he had been outwitted, before releasing a horrified scream."}, {"tag": "p", "text": "The stormtroopers never got the chance to finish off the Jedi Master, as a group of Whiplash rebels ambushed them from the other side of the exit, injuring several of them and forcing the troopers to flee. Piell recognized one of the rebels as Nick Rostu, a friend of the Jedi Order, and beckoned him to listen to his final request. Despite Rostu's comments, the Lannik Jedi knew he would die within minutes; he told Rostu about 4-TO and his mission, asking him to locate Jax Pavan—who Piell knew was still alive—and have him complete the mission. Rostu agreed, and Piell died."}, {"tag": "p", "text": "Rostu informed Pavan, who had already sensed his Master's death, about Piell's mission, and with the help of several others, Pavan located and tracked down the droid. Ultimately, 4-TO had been a ruse by Darth Vader; hoping to lure out Pavan for his own clandestine reasons, he had purposely allowed Piell to learn about the droid's supposed \"secrets\"—which were in fact non-existent—knowing he would assign the mission to Pavan. Pavan discovered this, but he refused to forget what Master Piell had taught him and continued to live as a Jedi."}, {"tag": "h3", "text": "Non-canon storyline"}, {"tag": "p", "text": "After the airing of The Clone Wars episodes featuring Piell and the change in his biography they created, Star Wars: The Clone Wars Comic UK 6.20 presented an alternative, Infinities, scenario to the events from those episodes which would have unfolded if Skywalker and Kenobi had failed to rescue Piell from the Citadel because they had collided with a rogue hyperspace shadow while en-route to Lola Sayu. The shadow sends their shuttle off-course from Lola Sayu and deactivates R2-D2 and his droids. Without R2-D2 to release them from carbonite, in which they froze themselves to pass the Citadel's lifeform sensors, Kenobi, Skywalker, and their men remain in hibernation for nearly twenty years. In the meantime, Sobeck successfully extracts the information regarding the Nexus Route from Piell and Tarkin. With the coordinates of the Nexus Route now in their hands, the Confederacy launches a surprise attack on Coruscant, forcing Palpatine—who is secretly leading the Confederacy as the Sith Lord Darth Sidious—to \"negotiate\" a surrender with Dooku that places Palpatine at the throne as the Galactic Emperor. Nearly twenty years later, Bail Organa, the leader of the Alliance to Restore the Republic, finds the drifting Republic shuttle and unfreezes Kenobi, Skywalker, and the others, who join the fight against the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}