{"url": "Evir_Derricote", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Biologists", "Category:Galactic Empire admirals and generals", "Category:Galactic Empire science and engineering personnel", "Category:Humans", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Males", "Category:Members of the 181st Imperial Fighter Wing"], "nodes": [{"tag": "h1", "text": "Evir Derricote"}, {"tag": "p", "text": "General Evir Derricote was an Imperial officer best known for creating such devastating bioweapons as the Emperor's Plague and the Krytos virus, which were responsible for the deaths of millions of aliens. A brilliant military tactician and scientist, Derricote commanded the 181st Imperial Fighter Wing, which was considered one of the worst TIE pilot squadrons in the Empire until the arrival of Soontir Fel in 0 ABY. For his role in the Battle of Derra IV, Derricote was promoted to General in 3 ABY and given command of an Imperial outpost on Borleias. Before accepting the post, he was commissioned by Emperor Palpatine to develop a number of species-specific viruses, including the Emperor's Plague, which was nearly unleashed by the anti-Human Diversity Alliance almost twenty years after Derricote's death."}, {"tag": "p", "text": "At Borleias, Derricote used stolen Imperial funds to turn an abandoned Alderaan Biotics facility into a profitable personal enterprise, and implemented a number of secret defense measures that led to an overwhelming victory against New Republic forces at the First Battle of Borleias. Derricote was hand-picked by Ysanne Isard to develop the alien-targeting Krytos virus, which she hoped would divide the Human and non-Human factions of the New Republic and ultimately destroy the Rebel movement. When the virus did not live up to Isard's high standards, she punished Derricote by incarcerating him in her secret prison aboard the Executor-class Star Dreadnought Lusankya. There, he was killed by Rogue Squadron pilot Corran Horn, who he attempted to ambush during Horn's escape attempt."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Imperial service"}, {"tag": "h4", "text": "Early life"}, {"tag": "p", "text": "Evir Derricote was born on Kalla VII, an Imperial-occupied planet in the Corporate Sector. When he was of age, he entered the Imperial Academy system and, upon scoring in the top two percent in his entrance exams, qualified for the elite Imperial Naval Academy. After the standard 30 months of training, Derricote ranked among the top third of the cadets in his class, which made him eligible for training as a TIE pilot. Although it was during these years he developed the military genius that would eventually serve him in later years, he concentrated his strongest efforts on biological and botanical subjects. Derricote graduated from the Imperial Naval Academy and eventually gained the rank of colonel."}, {"tag": "h4", "text": "Commander of the 181st"}, {"tag": "p", "text": "Prior to 1 BBY, Derricote served as commander of the 181st Imperial Fighter Wing. Under his command, the 181st was an undisciplined TIE pilot wing widely considered one of the worst in the Empire. The 181st chambers were cluttered and pilots lounged in their undershirts, drank while on duty, and spoke informally to superior officers. The unit was filled with dysfunctional washout pilots who had incurred the wrath of political enemies; Derricote publicly hinted that he himself made such enemies, but never revealed who they were or what he did to upset them."}, {"tag": "p", "text": "Derricote not only recognized the wing's poor reputation, but he embraced it, dubbing the wing the \"One-Eighty-Worst,\" and allowing a banner reading \"The Emperor's Forgotten Ones\" to be draped in the pilot's quarters. He mocked new recruits for earning the assignment by angering superior officers, and told them the squadrons' missions were geared towards shame and high fatalities. Derricote did not bother keeping up a clean appearance before his men, often wearing a dirty undershirt and appearing filthy and sweaty due to his gardening work."}, {"tag": "p", "text": "Derricote made no effort to improve the discipline or performance of the 181st not only due to indifference, but because he preferred avoiding the attention of the Empire. By maintaining the 181st as a lackluster unit, he was largely ignored by his superior officers, and thus able to pursue his horticultural interests. Derricote spent most of his time in his private greenhouse, which was adorned with dozens of small trees and exotic plants, including mycosia flowers. His work in this so-called \"glass house\" served as a precursor to future biotic work."}, {"tag": "h4", "text": "Assignment to Dac"}, {"tag": "p", "text": "In 1 BBY, the 181st Imperial Fighter Wing was tasked with providing defense for the Imperial-controlled Dac, a planet in the Calamari system home to such species as the Mon Calamari and the Quarren. The wing operated primarily out of Heurkea Floating City, which was located on the planet's southern territorial zone. In keeping with Derricote's leadership style, the pilots were lazy and undisciplined, their living quarters were messy, and they showed no sign of respect whenever their commander entered the room or gave them orders. Likewise, Derricote maintained a disheveled and unprofessional appearance, leaving his collar loose, his uniform partially unbuttoned, his hair messy and his sleeves rolled up. Derricote spent most of his time in his greenhouse, which he dubbed the \"nursery\"."}, {"tag": "p", "text": "During this time, Heurkea was secretly infiltrated by a group of Rebels that included Senator Bail Organa, pilot Juno Eclipse and two anti-Imperial resistance leaders, the Mon Calamari Gial Ackbar and the Quarren Seggor Tels. They planned to plant and detonate several explosives around the city that would humiliate the Empire and strengthen the resolve of local resistance movements on Dac. PROXY, a holodroid working with the group, was equipped with advanced hologram technology that allowed him to adopt a wide range of elaborate and convincing-looking disguises. Prior to arriving at Heurkea, PROXY assimilated the Imperial files and obtained information about Derricote's physical appearance. Once the group arrived on the planet, the droid disguised himself as Derricote by taking on his appearance and voice."}, {"tag": "p", "text": "Now posing as Derricote, PROXY pretended that Organa and Eclipse were his informants, and that Ackbar and Tels were captured members of a Dac resistance movement on their way to an interrogation. Initially, the illusion was not persuasive, and Organa and Eclipse were forced to kill two stormtroopers who realized PROXY was a fake. After observing how filthy and poorly maintained the 181st living quarters were, Eclipse realized the problem with PROXY's disguise was that he was too clean and well-kempt. After making him appearing sloppier, the disguise was more convincing to the 181st pilots, and PROXY successfully ordered them to launch their TIE fighters and practice honor roll exercises over Heurkea. Meanwhile, Organa and Tels split from the other Rebels, tracked down and captured the real Derricote, who they secured in stun cuffs and brought back to the rest of the group."}, {"tag": "p", "text": "The Rebels originally planned to take Derricote away from Dac as their prisoner, but they were stopped when two dozen stormtroopers led by Grand Moff Wilhuff Tarkin surrounded and ambushed the group. Derricote was released and thanked Tarkin for rescuing him, although the Grand Moff showed little respect for the commander and admitted rescuing him was not his first priority. However, unbeknownst to the Imperials, a group of Quarren had already planted explosives, which the Rebels detonated. Because the 181st TIE fighters were performing their honor rolls as the bombs went off, Tarkin and his stormtroopers incorrectly believed they had fired upon the city. In the chaos, the Rebels opened fire on Tarkin and the stormtroopers, who fled the room as a terrified Derricote huddled in a ball in the corner of the room."}, {"tag": "p", "text": "Satisfied that their demonstration would humiliate the Imperials and embolden the Dac resistance movement, the Rebels decided not to take Derricote prisoner as planned, but rather release him so he could bear witness to what had happened. A suspicious Derricote believed the Rebels would gun him down, but they let him go as promised. The incident further harmed Derricote's standing with his Imperial superiors and damaged his career. The 181st pilots were initially arrested by the stormtroopers under suspicion of betraying the Empire and attacking Heurkea, but it was ultimately explained that the explosions were the result of bombs planted by the Rebels, not the TIE pilots."}, {"tag": "h4", "text": "Soontir Fel joins the 181st"}, {"tag": "p", "text": "In 0 ABY, Captain Soontir Fel was transferred to the 181st after a number of Imperial Academy cadets trained by Fel, including Biggs Darklighter and Hobbie Klivian, hijacked the Rand Ecliptic and defected to the Rebel Alliance. Fel was disgusted by the lack of discipline among the 181st and asked Derricote for permission to transform the second squadron, which Fel commanded, into a proper military unit. Derricote did not object, but as the squadron improved, he did not submit the squadron's performance numbers to superior officers because he did not want to draw attention to the wing."}, {"tag": "p", "text": "Nevertheless, the 181st gradually began to improve in quality and reputation, particularly after Fel led his squadron to victory at the Second Battle of Ord Biniir. Since that battle took place on the same day as the Battle of Yavin, a devastating Imperial loss, the Empire propagandized and overplayed the importance of the Ord Biniir victory. In 0.5 ABY, the 181st was downsized from a wing to a group, which allowed Fel to use his expertise as an academy instructor to transform it into the Empire's most elite starfighter unit."}, {"tag": "p", "text": "During the next two years, Derricote left all 181st training entirely to Fel, who worked vigorously to prepare the group for a variety of missions. Derricote's own reputation improved due entirely to Fel's efforts, but Fel gave no indication that he objected to sharing the credit. In fact, he often collaborated with Derricote in his gardening hobby and made suggestions for how to better care for his plants. Eventually, Fel started his own garden, which Derricote helped him maintain."}, {"tag": "h4", "text": "Battle of Derra IV"}, {"tag": "p", "text": "In 3 ABY, Darth Vader and Grand Admiral Thrawn selected the 181st Imperial Fighter Group to attack a Rebel supply convoy in the Battle of Derra IV. Derricote led the 181st in the battle, but it was Fel's training, not Derricote's, that led the TIE fighter pilots to victory. Nevertheless, Derricote proved a capable pilot and fighter during the battle, contributing significantly to wiping out the enemy and delivering the fatal blow that destroyed the Hopskip, the freighter that was tracked by Thrawn and led to the battle in the first place. Derricote also learned during the battle that he was not only skilled at killing Rebels, but derived pleasure from it."}, {"tag": "p", "text": "Upon returning to the Imperial II-class Star Destroyer the group was temporarily assigned to for the battle, Derricote happily accepted the accolades for the victory, while Fel shied away from them, disillusioned by Derricote's hypocrisy in embracing an attack plan concocted by Thrawn—a Chiss alien—despite Derricote's speciesism. Emperor Palpatine himself praised Derricote as a hero and presented him a medal for his part in the battle, along with Fel and Turr Phennir, a 181st pilot who destroyed four transports. Derricote was promoted to general and given command of the Imperial forces of the Pyria system, a star system in the Colonies region that included the planet Borleias, where Derricote would set up his base of operations. Fel inherited command of the 181st."}, {"tag": "h3", "text": "Command of Pyria system"}, {"tag": "h4", "text": "Creating the Emperor's Plague"}, {"tag": "p", "text": "In the time between 3 and 4 ABY, prior to assuming his new commission in the Pyria system, Derricote was selected by the Emperor himself to develop a series of devastating bioweapons. Palpatine, who became familiar with Derricote after the Battle of Derra IV, recognized his biological expertise and commissioned him to establish a series of species-specific viruses, which would be used to wipe out entire races. Only Palpatine knew whether he intended to use these plagues to purge the galaxy of alien races or to simply use them to further exercise control and fear over them. Regardless of the Emperor's motives, Derricote accepted the assignment."}, {"tag": "p", "text": "A headquarters, which would eventually become known as the Emperor's Plague Storehouse, was established for Derricote in a secret research facility on an uncharted asteroid in the Deep Core, the location of which was so obscure it took six separate hyperspace jumps and many hours to reach. The depot consisted of a labyrinth of pressurized domes, tunnels and sealed chambers surrounding a central hub with an array of sealed cylinders, tubes and canisters to contain Derricote's future creations."}, {"tag": "p", "text": "Derricote began developing the viruses, which required test subjects from various species. Palpatine provided the general with all the specimens he needed, which included Wookiees, Twi'leks, Mon Calamari, Quarren and Gamorreans, among countless others. Some of these aliens were dissected in order to give Derricote a better understanding of their biology; others were used to test the virus samples. All of them died in horrific ways as Derricote slowly finalized a virus for each race. Eventually, although the incubation and response times varied, Derricote developed enough viruses to wipe out all known races in the galaxy. Among these viruses was what would eventually be known as the Emperor's Plague, a fast-moving strand that would infect and kill only Humans. Even Palpatine, a Human, considered the virus too deadly and terrible to be used, but he nevertheless had it stored with the others."}, {"tag": "p", "text": "When Derricote's work was complete, Palpatine ordered that all the viruses remain stored in the secret asteroid depot, and the general finally assumed his Borleias post sometime before the Battle of Endor in 4 ABY. Palpatine had the storehouse's coordinates removed from the Imperial archives to hide its location and only a few high-ranking Imperials, including Derricote, were even aware of the station's existence. Palpatine unleashed a handful of the diseases on some species, but died before he had the opportunity to fully utilize the bioweapons."}, {"tag": "h4", "text": "Borleias and the Alderaan Biotics facility"}, {"tag": "p", "text": "On Borleias, Derricote discovered a forgotten company named Alderaan Biotics, completely abandoned except for a crew of maintenance droids that kept it from falling apart. The facility, which specialized in exotic flora from the planet Alderaan, was little more than a tax loss for the parent company in previous years, but the market for Alderaanian goods had blossomed tremendously after the planet was destroyed by the first Death Star. Derricote not only saw an opportunity to generate a considerable profit and pursue his horticultural interests, but also a means of survival amidst the collapse of the Empire, which was beginning to crumble following the loss at the Battle of Endor. Although he still maintained a loose sense of Imperial loyalty, he also felt the Empire was doomed to die after the loss of Palpatine, and he wanted to be prepared for whatever rose to replace it."}, {"tag": "p", "text": "For all these reasons, Derricote not only decided to keep the venture secret from the Empire, but he siphoned money from the Empire's treasury to fund it. He secretly duplicated requisitions, attached intricate routing tags to them and sent them off to multiple commands, creating a series of false orders to funnel enough fuel and funds to run the Alderaan Biotics plant. The facility was soon operational, reaching its fullest production capacity in 5 ABY. Since the operation was illegally subsidized by the Empire, overhead costs were low and the plant generated 2.75 million credits over the next 15 months. Derricote invested the money in inventory maintained off-world, further concealing the profits of his secret operation. These investments helped Derricote establish connections for a wide range of goods, including Whyren's Reserve Corellian whiskey. Most of the goods, which mainly consisted of foodstuffs, were sold to the refugee Alderaanian population, which would have been viewed by his Imperial superiors as providing aid and comfort to the enemy had it not been kept secret."}, {"tag": "p", "text": "Although Derricote seldom showed any leadership effort with the 181st, the effort to keep his pet project secret and safe resulted in a complete reversal in his work ethic. Anticipating a future attack against his facility, he moved to improve the defenses by keeping its shield generator in good repair and his TIE fighters at a high level of readiness, as well as implementing a training schedule that had his pilots logging enough time for twice their number. Derricote also implemented secret defensive measures, using his stolen funds to add additional TIE interceptor squadrons, ion cannons and a power generator that doubled the shield generator's capacity."}, {"tag": "p", "text": "To conceal his stolen funds, Derricote kept computer security nearly as tight as on Imperial Center itself but, as an extra precaution, excluded information about the base's secret defense measures from even his own private office datapads. Bothan spies occasionally sliced into the base's HoloNet communications seeking information about the facility, but Derricote kept the spies at bay by secretly feeding them data. Despite his careful precautions, Derricote was realistic enough to understand he could not keep the secret from the Empire forever, but was confident his biotics operation would be valuable enough that his skills would be recognized and his life would be spared."}, {"tag": "h4", "text": "The Battle of Borleias"}, {"tag": "p", "text": "In 6.5 ABY, Ysanne Isard, Director of Imperial Intelligence and de facto ruler of the Empire, became interested in Derricote and suspected he could be helpful in her plan to establish an alien-targeting virus, which she hoped to utilize to damage the New Republic's relationship with non-Humans. Isard dispatched Imperial Intelligence Agent Kirtan Loor to Borleias to spy on him. Loor, however, was unaware of the reason for the assignment, and falsely believed he was dispatched to defend the planet from a suspected assault by Rogue Squadron. Just prior to Loor's arrival, Derricote noticed HoloNet slices by the New Republic were growing in both frequency and length, and sensed that his secret would finally be revealed to the Empire in the near future."}, {"tag": "p", "text": "Indeed, Loor became suspicious of Derricote's new work ethic, which he said was stronger than any Imperial officer outside of the Emperor himself. He recognized that Derricote was working on his own behalf, not that of the Empire, and discovered his secret operation by hacking into secret files in his office datapad, although he failed to discover the secret defense measures. Loor informed Derricote of the suspected Rogue Squadron siege against the Borleias outpost which, if successful, would give them a staging area to launch an attack against Coruscant due to the system's proximity to the Galactic Core. Derricote was not only confident his defenses would fend off the impending attack, but he was also looking forward to the attack, anxious to inflict harm on the Rebels as he did during the Battle of Derra IV."}, {"tag": "p", "text": "When the New Republic forces launched their attack, led by the Bothan General Laryn Kre'fey and Rogue Leader Wedge Antilles, Derricote instructed his technicians to simulate a gradual failure of the shields. Kre'fey took the bait, declining to utilize his full arsenal because he did not want to damage the base he hoped to capture, and failing to arrange a proper defensive escort because he wanted to avoid an \"unnecessary delay.\" As the Bothan's shuttle descended upon the planet, Derricote activated the secret shield generators, reinforcing the shield at twice the original strength. He then fired upon the Rebel forces with his ion cannons and launched the TIE Interceptors. Among the casualties were Kre'fey and two Rogue pilots, Peshk Vri'syk and Andoorni Hui. The New Republic forces fled and the battle quickly became a decisive victory for Derricote and his Imperial forces."}, {"tag": "h4", "text": "Transfer to Coruscant"}, {"tag": "p", "text": "As Kirtan Loor planned his departure, Derricote knew the Intelligence agent planned to use the information about the Borleias base to his advantage, but the general showed no signs of concern and even presented Loor with a bottle of Whyren's Reserve as a token of appreciation for warning him about the incoming New Republic forces. Derricote expressed confidence that Isard would utilize his base and skills rather than simply destroying them both, and he even went so far as to offer Loor the opportunity to return to Borleias if the Empire collapsed. Loor, who initially underestimated Derricote, was visibly impressed with the general, but did report him to Isard. Upon receiving Loor's information, she dispatched a Super Star Destroyer to Borleias to collect Derricote and bring him to Coruscant."}, {"tag": "p", "text": "Derricote had no desire to leave his Borleias outpost or biotics facility in the hands of Isard's people. At the same time, he knew her forces were more than capable of overcoming his defenses, so he agreed and was transferred to Imperial City. Isard ordered Derricote to utilize his biological skills to develop an airborne disease fatal to non-Human species, but treatable with bacta. She then planned to unleash the epidemic upon Coruscant and turn the planet over to the New Republic, which she hoped would collapse due to overwhelming bacta costs and friction between Human and alien species. Isard insisted that if the work was done to her specifications, Derricote would get his Borleias facility back. He accepted, not only because he had no choice, but because the proposal also appealed to Derricote, and was similar in nature to the biological agents he had previously developed for Palpatine."}, {"tag": "p", "text": "A laboratory was established for Derricote in the lowest levels of the Imperial Palace. The space consisted of stark white and silver surfaces, lacking the exquisiteness of the rest of the palace, but was sufficient for Derricote's needs. The labyrinthine stainless steel corridors led to an array of rooms including laboratories with surgical droids for dissecting aliens, and chambers for the subjects fitted with triple-paned transparisteel windows for observation. Each room had negative air pressure to prevent any viruses from escaping the lab in the event of a problem."}, {"tag": "p", "text": "Loor, as part of his overarching mission to destroy Rogue Squadron, was assigned to provide Derricote with whatever assistance he needed. The Intelligence agent resented having to work with the general, and Derricote, for his part, enjoyed exposing any lack of understanding Loor had of his work. Isard also assigned Diric Wessiri to help with the project, although Derricote was unaware that Wessiri was a brainwashed sleeper agent Isard actually appointed to spy on the general."}, {"tag": "p", "text": "Mere weeks after Derricote's transfer, New Republic forces launched a second attack on Borleias. Due to reconnaissance information collected during the first battle by pilot Corran Horn's R2 unit, Whistler, Rogue Squadron pinpointed Derricote's power generator at the Alderaan Biotics facility. The Rogue Squadron pilots severed the conduit that sent the auxiliary power to the shield generators and ion cannons, and the base was captured by the New Republic forces. Derricote was distraught and outraged by the loss, complaining that the base would not have fallen if he had been present. Isard disregarded these complaints as \"tantrums,\" asserting that Derricote would eventually regain control of Borleias and that the capture would mean little in the grand scheme of her plan."}, {"tag": "h3", "text": "Creation of the Krytos virus"}, {"tag": "h4", "text": "Developing the Krytos virus"}, {"tag": "p", "text": "As Derricote began his work on the virus, he made requisition requests for test subjects, just as he did during his work for Emperor Palpatine three years prior. His first requests were for Gamorreans, who provided a good platform for creating a virus that could also migrate to other species. Isard had subjects rounded up from the Alien Protection Zone, an area of Coruscant where the Empire used to segregate aliens from the Human population. The Gamorreans who were not dissected were used to test the earliest stages of the Krytos virus. The subjects, only slightly ill at first, soon began to develop painful black boils; eventually, their flesh began to crack and they began running around hysterically as blood oozed from their wounds. While these sights were understandably revolting to most observers, Derricote, who saw similar results during his time at the Emperor's Storehouse, took pride in his work and relished in the results, becoming personally offended if anyone expressed distaste for the virus."}, {"tag": "p", "text": "Soon, Derricote reached his first breakthrough by establishing a form of the virus with an incubation period of one month, which was contagious during the final four days of the infection and was fatal in 75% of cases. Derricote found, however, that the same genetics that would make the plague transmissible by air would also greatly facilitate a spontaneous mutation that could make it affect Humans. He concluded that the virus, which could survive in the water supply for about one day, would have to be transmitted through bodily fluid. Although a significant step forward, Isard found the results unacceptable, demanding a shorter incubation period and an airborne virus. Derricote knew the latter demand was impossible, but he believed since he was engineering a strain unlike anything the galaxy had known, Isard would eventually drop her unreasonable demands."}, {"tag": "p", "text": "Derricote found the metabolism of the Gamorreans was too sluggish and requested Quarren subjects, which had less cross-species susceptibility but a higher metabolic rate. These increasing demands for aliens greatly annoyed Loor, especially because Derricote tended to throw tantrums when his requests were not met right away. Isard also began to grow impatient with Derricote's slow-moving progress and threatened both his and Loor's lives if the strain was not completed in time; but, recognizing the vital importance of Derricote's work, she agreed to all of his demands, provided he cut the incubation period to one week."}, {"tag": "p", "text": "The Quarren subjects proved extremely helpful, allowing Derricote to lower the incubation period and improve the virus so that only a milliliter of a patient's blood could infect an adult. It was during this point in his work that Derricote named the virus \"Krytos,\" a combination of the world names of the viruses he combined. Derricote began making more demands, this time for a species more similar to other races so he could further develop cross-species infections. He requested a raid on Kashyyyk for Wookiees, but Loor rejected the request because he did not want to eliminate a slave labor source, so Derricote asked for Sullustans instead, because they could serve as a bridge race to Shistavanens and Bothans."}, {"tag": "p", "text": "While the Sullustan species was also not preferred because its SoroSuub Corporation designed many useful weapons, droids and vehicles, Isard felt the prospect of eliminating Bothans outweighed the disadvantages. Although she agreed to provide Sullustans, Derricote grew impatient and started conducting his own raids on the Alien Protection Zone. He personally reviewed his kidnapped aliens to choose the healthiest possible specimens; during one such raid, he unknowingly took and infected Aril Nunb, an undercover Rogue Squadron pilot."}, {"tag": "p", "text": "Loor was furious about Derricote's security procedure violations, especially because the subjects were not properly screened and were injected with the Krytos virus before Loor could interrogate them. Loor requested disciplinary action against Derricote, but Isard, pleased with the new strain and Derricote's prediction that the incubation process could be lowered, disregarded Loor's complaints and took no punitive measures. However, knowing a Rogue Squadron attack against Coruscant was imminent, she did demand Derricote finish the virus to her exact specifications in two weeks. Derricote knew the virus would continue to resist airborne transmission, but still believed his unprecedented work would please Isard in the end."}, {"tag": "h4", "text": "Dissatisfaction with the Krytos virus"}, {"tag": "p", "text": "By the end of the two week deadline, however, the incubation period was still twelve days, longer than Derricote had anticipated. Isard grew furious, especially about the lack of airborne transmission, and demanded Derricote begin the replication of the current virus strains and release them into the water supply. The general said he believed in four more days he would have enough of the strain to infect the whole planet, but Isard gave him no such time, and Loor demanded that he put even his still-experimental versions into the water supply because he no longer trusted Derricote's transmission numbers. Loor also unwittingly saved Aril Nunb's life when he demanded Derricote use her to test whether bacta would heal the virus on Sullustans, a measure Derricote had argued was unnecessary."}, {"tag": "p", "text": "Once New Republic forces launched their strike for Coruscant, Isard allowed the planet to fall and released the Krytos virus as planned. The virus killed millions of non-Humans and became one of the most notable and prolific uses of biological warfare in the galaxy. However, the impact of the virus was not as devastating as Isard hoped."}, {"tag": "p", "text": "The non-airborne virus was already of a milder strain than Derricote intended due to Isard's command to release it early, and the effect was further diminished when Rogue Squadron vaporized much of Coruscant's water supply during their attack. Many affected aliens were killed before they had the opportunity to spread the virus to others. And, although Isard limited the supply of bacta by taking control of the medicine-producing planet Thyferra, New Republic forces eventually developed rylca as a substitute to treat the Krytos victims."}, {"tag": "p", "text": "In her anger, Isard blamed Derricote for the flaws of the virus, even those that were out of his control and in no way his fault. She dubbed the general a failure and ordered that he be imprisoned on the Lusankya, her Executor-class Star Dreadnought buried beneath Coruscant's planetary surface. The massive flagship included her private prison for both Rebel and Imperial captives. Derricote was astonished by the punishment, feeling that he not only fulfilled his orders but developed a biological breakthrough, despite Isard's unreasonable expectations."}, {"tag": "h4", "text": "Imprisonment at Lusankya"}, {"tag": "p", "text": "Along with his fellow prisoners, Derricote was forced to undergo exhausting and mind-numbing physical labor that included breaking down large rocks into smaller rocks, which was then ground to gravel and moved from one point to another. Derricote was the highest ranking Imperial prisoner at Lusankya, but ranks held little importance at the prison, so he realized he needed other methods to insure some level of comfort."}, {"tag": "p", "text": "He bribed guards with the money from his Alderaan Biotics venture, which he had hidden in numerous secret accounts; although it did not get him out of labor, he was able to curry some favors, which included obtaining nectars Derricote used to ferment a mild ale. He shared this ale with the prisoners, winning their favor by providing them a pleasure they had long been denied."}, {"tag": "p", "text": "Regardless of his betrayal and imprisonment by Isard, Derricote remained proud of his Imperial service. He despised the Rebel prisoners and consciously showed little regard for them, speaking often about the superiority of the Empire and bragging about his victory at Borleias, omitting the fact that the world was captured by the New Republic a few days later."}, {"tag": "p", "text": "Despite these prejudices, Derricote got along relatively well with Jan Dodonna, the Rebel Alliance war hero and highest-ranking Rebel prisoner. He took an immediate dislike to Corran Horn, the Rogue Squadron pilot captured by Isard during the Battle of Coruscant. Derricote found Horn unintelligent and annoying, and nearly provoked a physical fight when he bragged about the deaths of Rogue pilots during the Battle of Borleias."}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "During a labor session, Derricote observed Horn throwing small rocks at the ceiling. Assuming Horn was planning something or attacking one of the guards, Derricote was about to report him before he noticed one of the rocks shot straight up to the ceiling and stayed there. After considering and ruling out several possible explanations, Derricote came to the same conclusion Horn had: the artificial gravity in the prison was rotated and the prisoners were standing upside down relative to the surface of the planet."}, {"tag": "p", "text": "Derricote realized Horn was using this knowledge to plan an escape, and saw an opportunity for his own freedom. Rather than informing the guards about Horn's plan, Derricote decided to tail Horn and catch him in the act, believing he could impress Isard enough that she would set him free. Derricote began watching Horn closely until he finally made his escape attempt, squeezing through a partially open gate. He then bribed a guard for the combination to the gate and followed the Rogue pilot."}, {"tag": "p", "text": "While Horn was descending a cavern slope, Derricote picked up a shovel and hit him in the back, incapacitating him. Just as Derricote was about to kill the defenseless pilot, he was attacked from behind by Jan Dodonna, who noticed Derricote was missing and had come to warn Horn. Derricote knocked Dodonna back and began to attack him, but Horn took the shovel and knocked Derricote to the ground. With another blow to the head, Horn broke Derricote's skull and killed him."}, {"tag": "h3", "text": "Post-death"}, {"tag": "h4", "text": "Post-death and legacy"}, {"tag": "p", "text": "Horn realized he could not leave Derricote's corpse exposed without letting the guards know the secret of the artificial gravity had been discovered, which would have made another escape attempt virtually impossible. Horn dragged the body along with him as he continued his escape, shoving him through several tight doorways and occasionally dropping him to lower levels. Finally, Horn dropped the body down a foul-smelling garbage chute."}, {"tag": "p", "text": "After giving Horn a sufficient head start, Dodonna reported Derricote missing, prompting Isard to order a search for the missing general. Isard learned of a supposed secret witness in the trial of Tycho Celchu, a Rogue Squadron pilot she had framed for Horn's murder, and assumed it was Derricote. She activated Diric Wessiri, her brainwashed sleeper agent now free on Coruscant, to lie in wait outside the court and kill Derricote. Before being gunned down himself, Wessiri ambushed and killed the actual witness, Kirtan Loor, who died disappointed that the assassination order was for Derricote and that Isard did not consider Loor important enough to target specifically."}, {"tag": "p", "text": "The same Alderaan Biotics facility Derricote so profited from was ultimately utilized by the New Republic to help destroy his Krytos virus. Mirax Terrik, a smuggler and ally to Rogue Squadron, was dispatched to Borleias to help develop the rylca that eventually treated the Krytos victims. Since Terrik was believed to be killed during a strike by Warlord Zsinj on a bacta convoy, she was able to conduct her rylca mission secretly and avoid angering the Thyferran bacta producers into cutting off their medicine supplies. Eventually, enough rylca was treated to obliterate the virus from Coruscant."}, {"tag": "p", "text": "Derricote and his work did much to fan the flames of anti-Humanism among many alien factions, starting with the Alien Combine, which originally formed in 3 ABY but grew stronger in 6.5 ABY in response to the abductions in Coruscant's Alien Protection Zone. The Alien Combine, which promoted non-violence where possible but was not averse to resorting to violence against Humans deemed suspicious, was the precursor for the much more dangerous Diversity Alliance, which formed in 24 ABY and often referred to the Krytos virus in promoting its anti-Human cause."}, {"tag": "h4", "text": "The Emperor's Plague resurfacing"}, {"tag": "p", "text": "In 24 ABY, 17 years after Derricote's death, an alien scavenger named Fonterrat discovered the Emperor's Plague Storehouse and the viruses concealed within. Fonterrat sold the information to Nolaa Tarkona, leader of the anti-Human Diversity Alliance, who planned to use the Emperor's Plague to wipe out the Human race. Although Tarkona despised Humans, she described Derricote as a genius and respected him for developing the virus she believed would destroy his own species."}, {"tag": "p", "text": "Among the various bioweapons at the storehouse was a slow-acting, multiple-species targeting virus labeled the \"Krytos Plague.\" Derricote developed these plagues more than two years before engineering the Krytos virus that was unleashed upon Coruscant. The Krytos Plague stored in the Emperor's Plague Storehouse was either a different virus with the same name, or Derricote somehow smuggled some of the real Krytos virus into the storehouse in 6.5 ABY."}, {"tag": "p", "text": "The Emperor's Plague Storehouse, and Derricote's legacy, was ultimately destroyed by explosives planted by the young Jedi trainees Lowbacca, Jacen Solo and Jaina Solo. Tarkona escaped with a vial of the Emperor's Plague, but soon died from another plague she was exposed to when several of the virus containers were broken open during a firefight. The plague remained with Raabakyysh, Tarkona's Wookiee companion, who exiled herself to an unnamed planet in the Outer Rim Territories after realizing the extent of her former master's evil."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Evir Derricote was an obese man with a toad-like demeanor, huge double chins and a head of thinning hair. From his outward appearance, others would assume he posed no threat, and Derricote used this to his advantage. He would often present himself in such a manner and posture as to make himself appear fat and stupid to make others underestimate him, a tactic he used successfully against Kirtan Loor while trying to conceal his secret Borleias operations. In reality, Derricote was an extremely cunning and intelligent man. He graduated at the top of his classes in his Academy days, and his vast scientific knowledge allowed him to develop sophisticated bioweapons the likes of which had never been designed before in relatively short periods of time."}, {"tag": "p", "text": "He was also a military genius who was able to implement defensive measures at Borleias that quickly and utterly obliterated New Republic enemy forces. Derricote was a capable TIE pilot who fought with distinction at the Battle of Derra IV. He never became stressed by the concept of fighting; in fact, he highly anticipated putting his skills to the test and found genuine enjoyment in killing his Rebel enemies. However, Derricote appeared extremely frightened while in the middle of a gun battle, such as the one that broke out on Dac, where he huddled into a ball and cowered in the corner of the room. Derricote was responsible for the deaths of countless aliens through the bioweapons he designed, especially the Krytos virus, yet he showed little regard for the lives he cost. During experiments in which test subjects died in graphic and horrendous ways, Derricote simply admired his handiwork while other observers nearly became sick, revealing a combination of cruelty, Imperial Humanocentric speciesism and a scientific detachment from his work."}, {"tag": "p", "text": "Many concluded based on his poor leadership of the 181st Imperial Fighter Wing that Derricote was lazy, but his work ethic at Borleias proved this was not at all the case. Rather, Derricote simply concentrated his efforts on his own personal projects, like Borleias, or projects he found challenging or intriguing, like the Emperor's Plague and the Krytos virus. Unlike most Imperial officers who ambitiously sought greater power and authority, Derricote simply preferred to be left to his own devices. He had immense pride in the Galactic Empire and his service to it, but nevertheless had no problem hiding information from them and, indeed, stealing funds from them to serve his personal projects. Following the death of Emperor Palpatine, he did not cling to false notions that the Empire would survive, and began actively preparing for whatever would replace it."}, {"tag": "p", "text": "Derricote's great amount of confidence convinced him that his abilities would sustain him against strict Imperial policies that often rewarded failure with fatal consequences. He understood that his secret, illegally-funded Borleias operations would eventually be discovered, but was confident his superior officers would be impressed enough with his skills to spare his life. Similarly, he expected (though erroneously) that Ysanne Isard would be impressed enough with the Krytos virus he designed to forgive him for failing to completely live up to her demands."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Evir Derricote was created by Michael A. Stackpole for his X-wing series, first appearing in X-Wing: Rogue Squadron in 1996. Stackpole later used Derricote in a Rogue Squadron comic issue, The Making of Baron Fel, in 1997. Kevin J. Anderson and Rebecca Moesta also frequently mentioned Derricote in the Young Jedi Knights series, which take place over a dozen years after his death in X-Wing: The Krytos Trap."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}