{"url": "Evocii", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Enslaved species", "Category:Evocii", "Category:Hutt Space species", "Category:Human and Near-Human species"], "nodes": [{"tag": "h1", "text": "Evocii"}, {"tag": "p", "text": "The Evocii were a primitive humanoid race from Evocar, which later became the capital Hutt world Nal Hutta."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Usurpation of Evocar"}, {"tag": "p", "text": "When the Hutts arrived at Evocar from their homeworld Varl around 15,000 BBY, the Evocii were amazed by the wonderful technologies that the slug-like aliens brought with them. Soon, they began trading pieces of their homeworld in exchange for the technology the Hutts brought with them, until they realized that the Hutts owned almost their entire planet. Hutt palaces and other constructions were built all over Evocar, and the Evocii became powerless to stop further expansion."}, {"tag": "p", "text": "They appealed to the Galactic Republic, though the laws of the Republic then ruled in favor of the Hutts. Many Evocii were evicted from Evocar by the Hutts and relocated to the planet's fifth moon, which would later be known as Nar Shaddaa, \"The Smuggler's Moon\". Evocar was then renamed Nal Hutta. The Hutts destroyed the remaining Evocii architecture and began to enslave most of the remaining natives. In the days of the Old Republic, on Nal Hutta, the few remaining Evocii not enslaved in the cities banded together into rebel tribes to harass the Hutts and their interests. A leader of one such rebel group was Huttsbane, known as a great warrior and feared by many Hutts. Ultimately, they were defeated and exterminated. The Hutts then used the Evocii on Nar Shaddaa as slave subjects as well, to build the spaceports and cities of Nal Hutta.[source?]"}, {"tag": "h3", "text": "Refuge on Nar Shaddaa"}, {"tag": "p", "text": "When Nal Hutta's cities were complete, the on-world Evocii were moved to assist the Evocii on Nar Shaddaa. By the time the moon's cities were complete, most of the Evocii had died off from long periods of exposure to the harsh atmosphere, and the surviving few took refuge in the lower levels of Nar Shaddaa, causing mutation to begin."}, {"tag": "p", "text": "As an inevitable result of generations of inbreeding and mutation on Nar Shaddaa, the Evocii devolved into pallid, sickly humanoids with heightened susceptibility to mind manipulation by Force-users. Many sentients, including the Hutts, incorrectly believed the Evocii to be extinct."}, {"tag": "p", "text": "In 26 ABY, when the Yuuzhan Vong reduced Nar Shaddaa into rubble in a brutal orbital bombardment and subsequently sent different types of bacteria to the undercity to kill all remaining inhabitants, the Evocii presumably met their true extinction, while the presence of Evocii living off-world since the Cold War, along with the absence of their servitude to the Hutts says otherwise."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}