{"url": "Evrios", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Outbound Flight residents", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Evrios"}, {"tag": "p", "text": "Evrios was a male Jedi Master who served the Jedi Order during the final years of the Galactic Republic. Along with four other Masters, Evrios joined Master Jorus C'baoth aboard Outbound Flight as part of the experimental Outbound Flight Project in 27 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive trained in the ways of the Force by the Jedi Order, Evrios had attained the rank of Jedi Master by the beginning of the Separatist Crisis which plagued the Galactic Republic in its final decade. Evrios was one of five Jedi Masters who fell under the persuasive sway of Master Jorus C'baoth, joining him in support of the radical Outbound Flight Project. In addition to the five Masters, twelve Jedi Knights also backed C'baoth's project. The powerfully influential Jedi, after much lobbying and mediation to bolster his standing and prestige among members of the Galactic Senate, was finally able to secure Jedi High Council approval for Outbound Flight's maiden voyage; the massive 6-Dreadnought leviathan, built around a central storage core, was set to depart the galaxy in 27 BBY."}, {"tag": "p", "text": "Assigned to oversee Dreadnaught-Two, Evrios had no qualms when Master C'baoth ordered the Jedi to begin sifting through the ship's passengers, whose children had been previously screened for Force-sensitivity. The children so marked as potential Jedi Initiates were, by C'baoth's order, to be taken, conscripted, and indoctrinated to on-board Jedi training, with or without parental consent."}, {"tag": "p", "text": "But when the titanic starship was intercepted by the Chiss Expansionary Defense Force, all six dreadnaughts were destroyed in the ensuing battle, resulting tragically not only in Master Evrios' death but the deaths of most of the other passengers as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}