{"url": "Ewokese/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Ewok culture", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Ewokese"}, {"tag": "p", "text": "Ewokese was the language spoken by the Ewoks. C-3PO claimed Ewokese was a primitive language, but despite its isolation, he was able to understand it. Ewoks were able to learn and speak other languages, including Basic."}, {"tag": "p", "text": "Ewokese was related to other tongues on the Forest Moon of Endor. Many linguists suggested that the language developed from the Yuzzum language, which was taught off-world, and which suggested a possible relationship between the Ewoks and Yuzzums. Most Ewoks understood Yuzzum, and it was through that tongue that C-3PO was able to communicate with the Ewoks of Bright Tree Village.[source?] Moreover, Ewoks had no difficulty communicating with Duloks, suggesting that the Dulok language may have been a dialect of Ewokese."}, {"tag": "h2", "text": "Vocabulary"}, {"tag": "h3", "text": "A"}, {"tag": "h3", "text": "B"}, {"tag": "h3", "text": "C"}, {"tag": "h3", "text": "D"}, {"tag": "h3", "text": "E"}, {"tag": "h3", "text": "F"}, {"tag": "h3", "text": "G"}, {"tag": "h3", "text": "H"}, {"tag": "h3", "text": "I"}, {"tag": "h3", "text": "J"}, {"tag": "h3", "text": "K"}, {"tag": "h3", "text": "L"}, {"tag": "h3", "text": "M"}, {"tag": "h3", "text": "N"}, {"tag": "h3", "text": "O"}, {"tag": "h3", "text": "P[1]"}, {"tag": "h3", "text": "R"}, {"tag": "h3", "text": "S"}, {"tag": "h3", "text": "T"}, {"tag": "h3", "text": "U"}, {"tag": "h3", "text": "V"}, {"tag": "h3", "text": "W"}, {"tag": "h3", "text": "X"}, {"tag": "h3", "text": "Y"}, {"tag": "h3", "text": "Z"}, {"tag": "h2", "text": "Notable non-native speakers of Ewokese"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The language of the Ewoks first appeared in 1983 in Star Wars: Episode VI Return of the Jedi, the last installment of the original trilogy.\nThe Ewokese featured in Return of the Jedi was developed by ILM sound designer Ben Burtt, and was largely based on Chalmuk, a Mongolian, nomadic tribal dialect. African and South-Pacific languages also influenced Ewokese. The primary inspiration, however, was the Kalmyk Oirat language, spoken by Russians of Kalmyk ethnicity. He decided to make Ewokese based on that language after hearing it in a documentary. He got an 80-year-old Kalmyk woman to speak tales of her people through her native tongue, and then recorded the sounds, with the various actors imitating various portions of the recording. In addition, Ben Burtt and Anthony Daniels later used and even invented their own terms in the language when doing the scene where C-3PO was reciting the story of the Rebel Alliance's efforts to stop the Galactic Empire."}, {"tag": "p", "text": "Ewokese was featured more prominently in Caravan of Courage: An Ewok Adventure and Ewoks: The Battle for Endor, a duology of made-for-TV films set on the forest moon of Endor. According to the movie credits, the Ewokese dialogues were created by Mari Mine-Rutka."}, {"tag": "p", "text": "According to the Ultimate Alien Anthology, Ewokese had no written form. While Ewoks episode \"The Haunted Village\" shows writing that Ewoks can read, it also (like all Ewoks episodes) depicts Ewoks speaking Basic rather than Ewokese, demonstrating a lack of strict fidelity to canon in matters of Ewokese."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}