{"url": "Ewok_religion", "categories": ["Category:Legends articles", "Category:Religions"], "nodes": [{"tag": "h1", "text": "Ewok religion"}, {"tag": "p", "text": "The Ewok religion was the traditional spirituality of the Ewoks from Endor, a small forested moon orbiting the gas giant planet of the same name. The Ewoks worshipped many different supernatural beings, known either as \"gods\" or \"spirits.\" In some cases, those deities were humanoid in shape, others were animistic, and others were associated with \"natural\" forces on the moon, such as the trees, the wind, the rain, and the night. The Ewoks saw their deities as close to them, existing within the same world; they would frequently call upon the spirits and address prayers to them. Since Endor was a forest moon, Ewoks had a tendency to worship and mythologize trees."}, {"tag": "h2", "text": "Tree worship"}, {"tag": "p", "text": "Ewoks regarded the Endorian trees as living spirit who watched over them and protected them. For that reason, it was against their religion to do harm to ancient tree, let alone to cut it down. However, that religious prescript did not prevent Ewoks such as Chukha-Trok to work as woodcutters. The Ewoks thought that tree had a language of their own, although it could only be heard and understood by young Ewoks under normal circumstances. The tallest tree on the moon, which was referred to as Father Tree, was thought to lead the Ewoks in battle. Another spirit known as the Forest Father would hear the prayers of the woklings who were lost in the woods. Yet another prominent entity was the Great Spirit Tree, which was thought to have been the original tree on Endor."}, {"tag": "h2", "text": "Spirits and gods"}, {"tag": "p", "text": "Generally speaking, the spirits associated with the night were perceived as malevolent: Denlett was thought to often lure Ewoks into walking off platforms in the dark, falling to their death, while Heesh was known for trying to make its victims fall asleep. More importantly, the evil god par excellence was called the \"Night Spirit.\" According to the believers, that god would sometimes manifest as a ghostly apparition. A group of mysterious aliens with a toothy grin known as the Wizards of the Night Spirit were also thought to serve the evil entity. However, not all spirits of the night were considered malicious. Jahjee, for one, had a more neutral role, as he would bring the sleeping Ewoks their dreams."}, {"tag": "p", "text": "Occasionally, the Ewoks would mistake extraordinary offworlders for some of their gods. This notably happened when the Twi'lek Jedi Master Aayla Secura set foot on Endor during the Clone Wars. The protocol droid C-3PO was also mistaken for \"the Golden One,\" whose coming among the Ewoks had been foretold by prophets."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}