{"url": "Ewok_battle_wagon", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Ewok weapons", "Category:Ground vehicles"], "nodes": [{"tag": "h1", "text": "Ewok battle wagon"}, {"tag": "p", "text": "The Ewok battle wagon, or war wagon, was a large war vehicle created by the Ewok Erpham Warrick on the Forest Moon of Endor. The weapon consisted of two levels: a lower stage for its battering ram, and an upper stage with the skull of a tusked bantha alongside a ceremonial drum. The wagon was primarily assembled from logs strapped together with cord. Levers and ropes controlled the machine's parts, and a main support peg kept the war wagon from collapsing. The base of the machine was rectangular and supported four walls and four longer pylons, which held up the vehicle's second level. The upper deck was accessible by a wooden ladder. The battle wagon's main armament was a battering ram, essentially a long, thick tree trunk. Mobility was achieved via four stone wheels and required the users to push the device unless going downhill."}, {"tag": "p", "text": "Erpham Warrick of Bright Tree Village built the battle wagon to defend against the forces of a tribe of Duloks with whom the Ewoks had a long-standing feud. When Dulok warriors arrived in the forest and sought to destroy the Ewok village's Soul Trees—objects of great spiritual value to the Ewoks—Warrick commanded the battle wagon and drove the aggressors from the battlefield. The weapon proved instrumental in ending the conflict in the Ewoks' favor, forcing the Duloks to remain in Endor's swampier regions. However, as the years passed, the Ewoks largely forgot about Warrick's massive siege engine."}, {"tag": "p", "text": "Three generations later, in 3 ABY, the device was rediscovered by Erpham Warrick's descendant, Wicket Wystri Warrick. The younger Warrick rebuilt the wagon using his ancestor's blueprints; fellow tribe member Malani and the bordok Baga aided him in the endeavor. When the Dulok king, Gorneesh, learned of the restoration, he ordered his tribe to capture the vehicle. Meeting no real opposition, the Duloks stole the wagon and used it to attack Ewok territory, again with the aim of destroying the Soul Trees. The assault failed when Warrick removed the weapon's main support peg and caused the device to collapse. The battle wagon was rebuilt yet again by the Ewok tribe and used to resist the forces of the Galactic Empire after the galactic government established itself on Endor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Ewok battle wagon, or war wagon, was a large war machine found on the Forest Moon of Endor. The device operated under the basic principle of rolling the device toward enemy fortifications or vehicles and breaking through them with the wagon's attached battering ram. The weapon accommodated a crew of up to eight Ewoks, and on one occasion, it held thirteen Duloks."}, {"tag": "p", "text": "The battle wagon's basic structure incorporated two rectangular platforms that lay parallel to one another and to the ground with their shorter sides facing toward the weapon's front and rear. At its front and rear, the upper platform was supported by cross-beams held aloft by four pylons, which extended vertically from each corner; the greater length of the support posts at the wagon's front caused the upper deck to be uneven, with an upward-slanting mid-section connecting the lower aft to the higher fore. A square hole cut into the weapon's bottom level opened to the ground below and allowed the siege engine's occupants to drop into the hole and push the vehicle from within. Both platforms were made from thin wooden logs tied together with cord and varnished. A support peg on the inside of one of the posts kept the contraption together; if pulled out of place, the battle wagon collapsed into its constituent pieces."}, {"tag": "p", "text": "A short wall made of tied-together logs stood upright at the wagon's right and left sides; the structures protected the passengers and crew but permitted them to wield their own weapons and hurl missiles at the enemy. The walls were detachable by pulling a lever in the rear corner of the wagon; leaned against one another at a right angle, the disjoined walls made an impromptu fort. Another wall of logs protected the wagon's front by extending from the base platform to the top deck; a rectangular cutout in the wall permitted the battering ram to swing through. A crank on the wagon's upper platform attached to the front wall raised and lowered it as a ramp, thus permitting the warriors inside to charge the enemy with melee weapons such as spears."}, {"tag": "p", "text": "The battle wagon rolled on four large wheels made of stone, which were set into the four corners of the base platform, with two on each of the weapon's longer sides. Crewmembers pushed the device from within the hole in the lower platform or from the vehicle's rear. The battle wagon thus gained more momentum when pushed down a slope. Although the wagon was a land-based weapon, it floated in water with only its bottom platform, wheels, and pylons submerged."}, {"tag": "p", "text": "The war wagon's primary weapon was an enormous battering ram made from a large, wooden log. A cap at the log's striking end served as the focal point of each impact. The ram hung from the upper deck from forked structures. Crewmembers operated the battering ram from a lever inside the wagon; when aimed correctly, the wagon was capable of crushing through barriers of stone and wood, and even for battling against All Terrain Scout Transport walkers."}, {"tag": "p", "text": "A cage for ferrying prisoners hung from a hook at the end of a rope at the back of the battle wagon, nestled into a notch cut from the vehicle's rear. The cage was constructed from long lengths of wood tied together to form a rectangular prism nearly as tall as the space between the top and bottom platforms. The size made it large enough to hold a Human or Dulok prisoner. One side of the cage acted as a door and swung open to allow captives to be placed within or taken out; a lock at the top of the cage and a padlock on the door prevented escape. A pair of longer pieces of wood extended horizontally from the cage to allow Ewoks to carry it on their shoulders."}, {"tag": "p", "text": "A wooden ladder was attached to the battle wagon toward the rear of its left side and leaned forward into a notch in the vehicle's top platform. The wagon's top platform held a large skull, a drum, and two cranks. The skull, bleached white and large enough to hold four Ewoks or three Duloks inside, lay at the front of the vehicle. Individuals hiding inside the skull were able to peer out through its eyeholes to act as lookouts or to direct crewmembers below who were pushing the war wagon. The skull, from a type of bantha with large tusks, served ceremonial purposes as well, as did the battle drum located to its rear. In addition to the ramp-lowering hand crank on the upper platform, the other crank raised and lowered the cage at the back of the weapon."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ewok–Dulok war"}, {"tag": "p", "text": "Hundreds of seasons before 3 ABY, the Ewoks of Bright Tree Village were at war with a nearby tribe of Duloks, inhabitants of Endor's swamps. As part of the war effort, the warrior Erpham Warrick designed the Ewok battle wagon, using a piece of parchment to outline his plans. During construction, the rest of Warrick's village considered the project to be foolish and laughed at the Ewok's folly. Nevertheless, Warrick persisted and finished the battle wagon single-handedly."}, {"tag": "p", "text": "Warrick's foresight proved itself when the Bright Tree Ewoks came under attack by a band of Duloks intent on chopping down the Ewoks' Soul Trees, which played a key role in Ewok spirituality. Warrick led the counterattack, calling his fellows to arms from the roof of the battle wagon and then attacking the Duloks with the siege weapon. The Duloks fled back into the swamps at the sight of the device, and the Ewoks won the day. Warrick was fêted as a hero and became famous from the incident; a stone slab was placed within the wagon to commemorate the victory. The village legend keeper, Kaink, gained possession of Warrick's written plans. Meanwhile, the wagon itself fell into disrepair as vegetation from the woods reclaimed it, making it useful as little more than a rain shelter. The Ewoks, save for Kaink, forgot about the contraption and left it abandoned in the woods."}, {"tag": "h3", "text": "Reconstruction"}, {"tag": "p", "text": "Seasons later, in 3 ABY, three of Erpham Warrick's great-grandsons—Weechee, Willy, and Wicket W. Warrick—rediscovered the battle wagon when a sudden rainstorm prompted them to seek shelter within what they originally took to be a small cave. The slab inside revealed the refuge's true nature, however, and the Ewok priestess Kaink, who had also sought shelter within the decrepit war machine, explained the device's role in the long-ago war with the Duloks, as well as Erpham Warrick's role in the affair. Wicket W. Warrick pledged to refurbish his great-grandfather's battle wagon, despite his elder brothers' dismissal."}, {"tag": "p", "text": "When Warrick's friends showed more interest in roughhouse behavior that endangered the fragile remains of the wagon, the young Ewok resolved to fix up the dilapidated device on his own using his great-grandfather's plans, which he had received from Kaink. Nevertheless, the female wokling Malani and Warrick's pet bordok, Baga, provided assistance. The repairs entailed replacing old and broken planks, cleaning the bantha skull, changing the skin over the war drum, varnishing the wood, and adding a flower for decoration."}, {"tag": "p", "text": "Unbeknownst to Warrick and his companions, their activities caught the attention of a Dulok scout. A few days before the Ewoks finished the repairs, the scout informed the ruler of his tribe, King Gorneesh, of the refurbishment of the battle wagon. Unable to determine the Ewoks' intentions, Gorneesh dispatched the village shaman, Umwak, to investigate the matter. Accompanied by Gorneesh's wife, Queen Urgah, Umwak beseeched the Dulok oracle, Murgoob, for information on the battle wagon. From the bowels of his lair, the ancient Dulok regaled his younger tribemates with the tale of the Duloks' defeat seasons ago due to the Ewoks' use of the siege weapon. Murgoob admitted that the wagon terrified him, but he suggested that if the Duloks managed to steal the contraption, it might allow them to wrest control of the forest from the Ewoks once and for all."}, {"tag": "p", "text": "The scout led Gorneesh and Umwak to the construction site, and Gorneesh suggested a cautious approach: they would wait until the repairs had been completed and then overpower the Ewoks to take the machine. Several weeks after he had initiated the project, Warrick declared the repairs on the wagon complete. That night, Gorneesh, Umwak, and Dulok warriors rolled the weapon through the forest with the sleeping Warrick inside. Although the Ewok awoke from the jostling and escaped into the forest, the Duloks reached their village and began to plan their attack."}, {"tag": "h3", "text": "Attack on the Soul Trees"}, {"tag": "p", "text": "Warrick's warning to his village went unheeded; because the wagon had been constructed by two children with only a bordok to help them, the villagers dismissed the battle wagon as a viable threat even if under Dulok control. The next day, Warrick sought solace at the Soul Tree of his great-grandfather Erpham Warrick. The elder Warrick's ghost consoled the boy and reassured him that the village had scornfully dismissed the weapon during its original construction as well. At his great-grandfather's urging, Wicket W. Warrick swore to reclaim the battle wagon from the Duloks."}, {"tag": "p", "text": "Meanwhile, the Duloks struggled to operate the war machine, their first attempt landing the device in a river. When Umwak beseeched Murgoob to help the Duloks with the weapon, the Dulok Oracle suggested the tribe use it to destroy the Ewoks' Soul Trees and thus crush the Ewoks' will to live. Nevertheless, Murgoob refused to come out of hiding to participate in the assault. Warrick espied the exchange and took advantage of Murgoob's reclusion to impersonate the elderly Dulok. As Gorneesh's troops loaded the battle wagon with weapons for the impending attack, the disguised Warrick convinced them to roll the machine in the wrong direction and back into the river. As Warrick rushed to warn Bright Tree Village once again, the real Murgoob, at last outside his hut, caught the young Ewok. Warrick found himself held prisoner in the wagon's cage."}, {"tag": "p", "text": "Loaded with Dulok warriors, King Gorneesh, Queen Urgah, the shaman Umwak, and Murgoob, the war wagon rolled out. The Duloks first attacked a group of picnicking woklings, whom Warrick warned about the impending Dulok assault on the Soul Trees. The young Ewoks escaped to alert the village, so by the time the Dulok war party reached its target, a line of Ewoks led by Chief Chirpa and the shaman Logray met them, determined to defend the Soul Trees to the last. Undeterred, Gorneesh ordered the Duloks to accelerate the wheeled weapon to ramming speed."}, {"tag": "p", "text": "The battle wagon barreled through barricades of logs and boulders, the Duloks hurled spears at lines of Ewok fighters, and the wagon's battering ram scattered other Ewok defenders. Only a single Ewok stayed at speed with the battle wagon, the wokling Malani riding on the bordok Baga. Although Gorneesh dismissed her as no threat, she managed to leap onto the battle wagon, where a wild swing by a Dulok warrior missed the wokling but bashed open Warrick's cage. The two Ewoks then took advantage of their intimate knowledge of the wagon's workings to pull various levers, flatten the wagon's walls, activate the battering ram, and dump unsuspecting Dulok warriors and Murgoob from the device. On the battle wagon's top platform, agile dodges and further removal of wagon components, such as the ladder, allowed Warrick and Malani to send all but Gorneesh and Urgah over the edge. With no other choice, Warrick pulled the war wagon's main support peg. As the Ewoks jumped clear of the contraption, it collapsed directly before Erpham Warrick's Soul Tree—with Gorneesh and Urgah caught in its rubble."}, {"tag": "h3", "text": "Later use"}, {"tag": "p", "text": "The Bright Tree Village Ewoks held a celebration to commemorate the victory, but Wicket W. Warrick gave the battle wagon up as destroyed. Nevertheless, his fellow Ewoks rebuilt the war machine without Warrick's knowledge and presented it to Warrick as a surprise. The memory of his experience rebuilding the wagon and battling the Duloks remained fresh in Warrick's mind even into adulthood, when he reminisced about the events as one of the great adventures of his youth."}, {"tag": "p", "text": "By the time of the Dulok theft of the battle wagon, the Galactic Empire had established a presence on Endor. At some point after Bright Tree Village recovered and rebuilt the machine and before the Empire's defeat at the Battle of Endor in 4 ABY, the Ewoks came into conflict with the invaders from offworld. During an encounter with Imperial forces, the Ewoks used the battle wagon to combat stormtroopers and AT-ST walkers. The shaman Logray manned the wagon's bantha skull, Wicket W. Warrick shot a bow and arrow from the top platform, Teebo attacked from the weapon's front ramp, and Paploo and another Ewok guarded a stormtrooper prisoner in the device's cage. The wagon was still in use at the time of the Battle of Endor, when the Ewoks showed the weapon to the Human Rebel Alliance operatives Leia Organa, Luke Skywalker, Han Solo, and the droids C-3PO and R2-D2."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The toy company Kenner introduced the Ewok battle wagon in 1984 as a vehicle and playset. Earlier drafts of the toy's box art depict the battle wagon toppling over under attack from an AT-ST walker's guns, but Lucasfilm rejected the design in favor of a version where a tree blocks the Imperial vehicle's blast. Although the instruction manual for the toy labels it as part of Kenner's Star Wars: Ewoks line, the box art marks it instead as part of the Star Wars: The Power of the Force series. Catalogs and prototype proof sheets show that the company originally intended to release the vehicle for both lines."}, {"tag": "p", "text": "A 1985 television advertisement for the Ewoks toy line prominently features the battle wagon. A band of Duloks led by Gorneesh has trapped Logray in a wooden cage. However, Wicket W. Warrick leads Chirpa and Paploo into the Duloks' territory from a perch in the eye socket of the battle wagon's ceremonial skull. Although the Dulok scouts flee, the shaman Umwak casts a magic spell that animates nearby trees to attack the siege weapon. However, the bewitched plants prove no match for the war wagon's battering ram. Umwak then causes a groundquake to forge a chasm between the Duloks and Ewoks; nevertheless, the wagon's front ramp drops to allow the Ewoks to cross the ravine. The defeated Duloks flee the scene and allow the Ewoks to free the Ewok shaman."}, {"tag": "p", "text": "The siege weapon appears in \"Wicket's Wagon,\" an episode of the Ewoks animated cartoon series that originally aired on November 9, 1985. Due to the long production process of animation, it is unclear whether the cartoon series' producers took the idea for the siege weapon from Kenner's toy or vice versa. Writer Jon Bradley Snyder has declared \"Wicket's Wagon\" as one of the highlights of the series due to the \"great animated sequences,\" and authors Robin Pronovost and Daniel Wallace have listed it as a prime example of Dulok villainy. The United Kingdom–based Dragon Picture Books published a storybook adaptation of \"Wicket's Wagon\" in 1987. Tales from the Endor Woods, a 2004 DVD compilation, also features the episode. A few disparities differentiate the animated battle wagon from its plastic counterpart; for instance, the cartoon device employs three forked pieces to support its battering ram, while the toy uses only two."}, {"tag": "p", "text": "Later reference works mention or describe the battle wagon. Indeed, The Complete Star Wars Encyclopedia includes two separate entries on the siege weapon, in one instance as the \"Ewok battle wagon\" and the other as the \"war wagon.\" Stephen J. Sansweet in Star Wars: The Action Figure Archive doubts the commonly asserted connection between the battle wagon's tusked skull ornament and the bantha species, since banthas are native to the planet Tatooine. Nevertheless, this article follows the bulk of sources that identify the skull ornament as having come from a bantha."}, {"tag": "p", "text": "Kenner's battle wagon playset had a second life in 1992 as part of the Robin Hood: Prince of Thieves action figure line, based on the feature film directed by Kevin Reynolds. Kenner redecorated the wagon to fit the medieval English theme of the film. For instance, the new battle wagon came with a catapult that fit on its upper deck in lieu of the bantha skull. The catapult itself was also a reused Ewok weapon from the Star Wars license."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}