{"url": "Ewokese", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Language stubs", "Category:Ewok culture", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Ewokese"}, {"tag": "p", "text": "Ewokese was the lively language spoken by the furry, diminutive Ewoks who lived on the forest moon of Endor. It was mutually intelligible with the language of the Yuzzum, and contained more than three dozen words for conifers the Ewoks referred to principally as \"life trees.\""}, {"tag": "p", "text": "When the Rebel Alliance's strike team came to Endor to destroy the second Death Star's shield generator, the protocol droid C-3PO communicated with the Ewoks using Yuzzum, and managed to translate the Ewokese into Galactic Basic Standard so the Ewok named Wicket was able to guide the Rebels to the Imperial bunker."}, {"tag": "p", "text": "The human scavenger Rey learned the language from a salvaged ship computer on Jakku, but had not found an opportunity to use it."}, {"tag": "h2", "text": "Known phrases"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ewokese language first appeared in the 1983 movie Star Wars: Episode VI Return of the Jedi, the last installment of the original trilogy of Star Wars. It was first identified as \"Ewokese\" in the Star Wars Legends continuity in the novelization of the film. It was developed by Ben Burtt, sound designer at ILM, and was largely based on Kalmyk Oirat, a dialect spoken by Russians of Kalmyk ethnicity. Burtt decided to make Ewokese based on that language after hearing it in a documentary. He got an 80-year-old Kalmyk woman to speak tales of her people through her native tongue, and then recorded the sounds, with the various actors imitating various portions of the recording. African and South-Pacific languages also influenced Ewokese. In addition, Burtt and actor Anthony Daniels later used and even invented their own terms in the language when doing the scene where C-3PO was reciting the story of the Rebel Alliance's efforts to stop the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}