{"url": "Ewoks:_The_Battle_for_Endor", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Legends television films", "Category:1985 releases"], "nodes": [{"tag": "h1", "text": "Ewoks: The Battle for Endor"}, {"tag": "p", "text": "Ewoks: The Battle for Endor is a 1985 made-for-TV movie written and directed by brothers Jim and Ken Wheat from a story by George Lucas. It focuses on Cindel, a little girl who joins her friends Noa, Wicket and the other Ewoks in facing off against a band of Marauders. The film is a follow-up to 1984's Caravan of Courage: An Ewok Adventure."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "h3", "text": "The Sanyassan raid and tragedy"}, {"tag": "p", "text": "On the forest moon of Endor, Cindel Towani and Wicket Wystri Warrick are walking through the forest picking flowers. They reach a ledge overlooking her father Jeremitt, who is finishing repairs on the star cruiser. She yells to him that she and Wicket are going back to the village. As they continue walking, Cindel and Wicket discuss the fact that she will be leaving soon, and how they are both sad about this fact. Wicket senses danger as they approach the village, and the pair run to investigate."}, {"tag": "p", "text": "When the pair reach the village, they find the Sanyassan Marauders attacking. They are immediately knocked down a hill by a Sanyassan with a staff, and manage to hide behind a downed Sanyassan cart. Wicket tells Cindel to stay behind as he decides to join the rest of the Ewoks in defending the village. Cindel's life monitor reveals that her mother Catarine's life is fading, so she goes to investigate. She finds her brother Mace at the side of their dead mother. He tells her to stay back and to get help from their father. He tries to fight back against the Sanyassans, but is killed when a hut he is hiding in is blown up. During the battle, the Ewoks are all eventually captured and many of their huts burned down."}, {"tag": "p", "text": "At the Towani starcruiser, Jeremitt is confronted by Charal (a Nightsister) and Terak (leader of the Sanyassans). As they demand that he give them \"the power\", Terak's men tear apart the ship trying to find it. Jeremitt insists that he doesn't know what they're talking about and doesn't have what they are looking for, but one of Terak's men eventually finds what they are looking for. Cindel then reaches the ship, and Jeremitt attacks one of the men when he sees her. He attempts to escape, but is shot in the back by one of the Sanyassans. He picks Cindel up and they run into the forest. Meanwhile, Charal uses her ring to turn into a raven."}, {"tag": "p", "text": "As they hide at the trunk of a tree, Cindel tells her father that Catarine and Mace are dead. Jeremitt explains their situation by reminding her of a story about a young bird learning to fly. He tells her to find Deej and the Ewoks so that they can take care of her. She resists at first, but he hugs her and reassures her that he will always be with her. He sees Charal in raven form, who has alerted the Sanyassans. This prompts him to tell Cindel to run away, which she does as instructed. Jeremitt exchanges fire with the Sanyassans, but is soon killed. As Cindel runs away, Charal flies after and catches her."}, {"tag": "h3", "text": "Escaping captivity"}, {"tag": "p", "text": "At the captured Ewok village, Cindel is now being held prisoner with the Ewoks, but is happy to be reunited with Wicket. They are being held in carts being pulled by blurrgs, which then leave the village. Cindel explains to Wicket that her family is dead, but Wicket reassures her that he will take care of her and that the Ewoks are her new family. Some of the Ewoks tear a board out from the floor, but discover that they are too big to fit through."}, {"tag": "p", "text": "Despite this challenge, Cindel insists that she and Wicket could fit, so they slide on through and escape into the forest. However, two of the Sanyassans spot them, and shoot and chase after them. Cindel and Wicket climb up the side of a mountain, with the Sanyassans on their trail. They run into a cave. The Sanyassans shoot at the cave entrance, which causes rocks to fall and knock them off of the side of the mountain to their deaths."}, {"tag": "p", "text": "Cindel and Wicket realize that although they are safe from the Sanyassans, they are also trapped from the rock collapse. Wicket insists that they can find a way out. They walk through the cave until they find themselves at an opening atop a ledge overlooking the forest. Wicket then finds some materials to build a skin glider. Later on, after they have built a fire, Wicket is almost finished with the glider."}, {"tag": "p", "text": "As he searches the cave for some final materials to put the finishing touches on the glider, he runs across a condor dragon. He runs from it and tries to hold it off with a spear and a rock. Cindel also throws a torch at it. However, this does not deter it, and it picks up Cindel and carries her away into the night sky. Wicket panics, but quickly gets on his glider and chases after it. He drops a stone on its head, which causes it to drop Cindel. He flies down and catches her, and then crashes the glider into the ground. They see the dragon overhead, which prompts them to run off into the forest. When they stop, Wicket sees the dragon fly away, and tells Cindel that she is safe. They find a hollow tree trunk to rest in for the night."}, {"tag": "h3", "text": "Meeting Teek and Noa"}, {"tag": "p", "text": "The next morning, they are awoken by Teek, a very fast creature who annoys Wicket and amuses Cindel. Wicket tries to attack him, but Cindel insists he could help them. Teek leads them to a house, which they find to be messy and full of junk. Cindel assumes that it is deserted, and suggests that they clean it up and make it their house."}, {"tag": "p", "text": "Later on however, as they are preparing to eat, the house's owner Noa arrives at the door. He is very displeased with them being there, and sends them away. He then scolds Teek for letting them in. Cindel and Wicket sit down not far from the house, where they discuss how hungry they are. Noa finds the food they were making, and prepares he and Teek some of the food. Noa tells Teek not to give any of the food to Cindel or Wicket, but he does anyway while Noa isn't looking."}, {"tag": "h3", "text": "Noa's change of heart"}, {"tag": "p", "text": "Outside, Cindel and Wicket start a fire, which is soon extinguished by an angry Noa with a bucket of water. He invites them in to stay for the night. During the night, Cindel dreams that the Sanyassans attack the house. She wakes up calling for Wicket, and Noa reassures her and lets her and Wicket sleep in his bed instead of himself. The next morning, Noa tells Wicket that it's time for them to leave, insisting that they must have family somewhere worried about them. Wicket asks Cindel if they are leaving, saying that his family needs him. She wonders where they are, and he says they will find them."}, {"tag": "h3", "text": "Charal's mission"}, {"tag": "p", "text": "At Terak's castle, Charal bows before Terak's throne, trying to perform a ritual on the power supply that they stole from the Towani starcruiser. Terak is frustrated, wondering if the power supply really is \"the power\" they were looking for, to which she suggests that it is. He tells her that she either \"discover its magic or die\". She then says things would have been easier if he wouldn't have let \"that child\" (Cindel) escape. Terak becomes infuriated and repeatedly screams at her to \"Find me that child!\""}, {"tag": "h3", "text": "Noa's starship"}, {"tag": "p", "text": "Back in the forest, Noa returns home and assumes that Cindel and Wicket are gone. He pretends to be glad that they are gone, and tries to explain away the fact that he made two beds. Just then, Cindel and Wicket return, showing him the flowers they've been picking. That night, they make pies with the flowers, and Noa puts Cindel and Wicket to bed in the beds that he made for them. The next morning before he leaves, Noa gives Cindel and Wicket a series of chores that he wants them to do every day. Cindel wonders where Noa goes during the day, and convinces Wicket that they should follow him. They follow him to a ship, where they get caught in a booby trap. This sets off an alarm, which alerts Noa. He gets very upset with them, and frees them while explaining that he doesn't even allow Teek to come there."}, {"tag": "p", "text": "Inside the ship, Cindel asks Noa how he got to Endor. He explains that when he was a young man, he and his friend Salak were on their first mission together when their ship crashed on Endor. The crystal oscillator was shattered in the crash, so Salek went in search for another one while Noa stayed behind. Salek never returned, so Noa ended up stranded there. That night, Noa plays his flute and they all make music, until Wicket accidentally hits a steam cap that bounces around the room. Cindel sits in Noa's lap, and bonds with Noa over the fact that they both have lost people close to them. She sings him \"My Star\", a song that her mother used to sing to her. Outside meanwhile, Charal (in raven form) has tracked Cindel down."}, {"tag": "h3", "text": "Kidnapping Cindel"}, {"tag": "p", "text": "The next morning, Cindel hears a voice calling for her that she thinks is her mother. She starts trying to follow the voice to its source in the forest. Wicket realizes that Cindel is gone, and wakes Noa up by throwing a bucket of water on him. Wicket senses danger, and he and Noa also hear the mysterious voice, which is by now singing \"My Star\". In the forest, and finds a woman dressed all in white, with a white horse by her side. Cindel approaches the woman, who asks her to get her robe. The woman then reveals her true form to be Charal, who kidnaps her and rides away on her black horse. Noa and Wicket see the horse carrying Cindel away, so they quickly return to Noa's house, where he gets weapons and supplies. As they leave, Teek follows them."}, {"tag": "p", "text": "Meanwhile, Charal rides back to Terak's castle, where she presents Cindel to Terak. She demands to know what he has done to the Ewoks, to which he insists they are his \"guests\". He promises not to hurt the Ewoks as long as she can make the power supply work. He asks her to perform her magic, but she says she knows nothing about magic. He gives her until dawn to do what he asks, or else they are \"doomed\". Before they are taken to their cells, Terak takes away Charal's ring. Meanwhile not far away, Noa, Wicket and Teek approach the castle. Back in the castle, Charal tries to get information out of Cindel, who again says that she doesn't know anything, and insists that it's only a component of the starcruiser. Charal then reveals that Salek came to her long ago looking for \"the power\", and that Terak killed him for it."}, {"tag": "h3", "text": "The rescue mission"}, {"tag": "p", "text": "Noa, Wicket and Teek reach the castle's moat, and use a grappling hook to climb to the top. Teek easily climbs the rope, where he secures the grappling hook for the other two. Wicket climbs up second, and is nearly attacked by a moat monster. Noa then prepares to climb up, but is spotted by a Sanyassan. Wicket ties one end of the rope to the Sanyassan and throws him into the moat, which acts as a pulley, causing Noa to instantly be pulled up to safety."}, {"tag": "p", "text": "They descend into the castle, where the Sanyassans are drinking and laughing. Wicket realizes where the Ewoks are located, and tells the others. Teek sneaks into the main room, where he grabs a cloak. He, Noa and Wicket then walk through the main room pretending to be a robed figure. They reach the imprisoned Ewoks, but need a key to unlock the cages. The keys are located near a pair of card-playing Sanyassans, so Teek plays a trick on them. He inserts a card into one of their sleeves, which eventually falls out and causes the other to accuse him of cheating. The two instantly draw their guns and shoot each other. Meanwhile, Teek takes the keys. They then use the keys to free Cindel and the Ewoks. Charal also begs to be freed, but Cindel protests and throws the keys into a drain."}, {"tag": "p", "text": "Noa, Cindel, Wicket, Teek and the Ewoks then try to make their way out of the castle, but run into a Sanyassan guard, whom Wicket shoots in the leg. They run the other way, but the guards alert the rest of the castle of their escape, who proceed to look for the escapees. Meanwhile, Noa uses a thermal detonator to blow a hole in the castle wall. Wicket tries to hold the Sanyassans of by shooting a few with a blaster. Noa throws a grappling hook over to a rock, which allows them to escape from the castle."}, {"tag": "p", "text": "Before they leave, Cindel points out Salek's skeleton and explains what happened to Noa. She also shows him the power converter, which he takes with them at Charal's protest. They all finish escaping, with the Sanyassans shooting at them. Inside the castle, Terak threatens to kill Charal, but she tells him that there is another ship. He gives her ring back, and she turns into a raven. He then takes her ring back, leaving her in raven form. As the humans and Ewoks make their way back to the village, the Sanyassans prepare for an attack. They too then head for the village, with Charal flying ahead of them."}, {"tag": "h3", "text": "Battle for freedom"}, {"tag": "p", "text": "Everyone reaches the village at nearly the same time. Noa tells the Ewoks to defend against the Sanyassans while he gets his ship ready. He then installs the power converter into the ship, but has trouble getting it to work. Meanwhile, the Ewoks prepare to fight. They fight the Sanyassan army with a combination of their own techniques and ingenuity, combined with use of Noa's catapult. The Sanyassans eventually reach the ship, and start attacking it. Noa finally gets the power going, and he, along with Teek and an Ewok, use to turrets to defend against the Sanyassans."}, {"tag": "p", "text": "Cindel initially watches the battle from one of the ship's monitors, but eventually ventures out to help Wicket. Terak captures her, and has the Ewoks tell Noa he will trade Cindel for the power supply. Noa confronts Terak, and they engage in a duel, with Terak using his sword and Noa using his walking stick. Cindel urges Wicket to \"do something\", and he uses his sling to shoot a rock at the ring hanging around Terak's chest, which causes him to turn to ash. Charal, who is still trapped in her raven form, flies away."}, {"tag": "h3", "text": "Farewell Endor"}, {"tag": "p", "text": "With the Sanyassans defeated and Noa's ship now operational, Cindel and Noa say goodbye to Teek and the Ewoks. Teek is sad to see Noa go and the two embrace. Cindel also speaks with Wicket and Teek, promising to visit them again. Before leaving, she hugs Wicket. The two humans then climb aboard the ship, which flies away. Teek and Wicket, who are now friends, watch as the ship blasts off into the atmosphere."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Following the success of Caravan of Courage, George Lucas decided that he wanted to create a second film. He hired Jim and Ken Wheat as directors for the film after they told him that they thought Caravan of Courage had been flawed and disappointing. Lucas then met with the Wheat brothers in two four-hour story conferences. The brothers first proposed to him a story involving the entire Towani family. However, Lucas had viewed the film Heidi with his daughter Amanda prior to the sessions, and told the Wheat brothers that he wanted the film to center around the young girl character of Cindel Towani, who would be orphaned and come into the care of an old man in the woods. Inspired by various adventure films they had seen as children, the Wheat brothers suggested the Marauders as villains, which Lucas felt should be seven feet tall. Joe Johnston and Phil Tippett took part in the second story conference. Though the Wheat brothers were originally only hired to direct, it was judged that the original script was poor, so they were given screenwriting duties as well."}, {"tag": "p", "text": "The film was shot under complete secrecy. During production, Lucas would visit the set three times per week, often to look at art and costume designs. He would voice his opinion of the designs using a set of rubber stamps made for him by Johnston that read \"Great,\" \"CBB\" (could be better) and \"86\" respectively. According to Ken Wheat, Lucas's involvement was mainly in pre-production and editing: \"He'd given almost no notes on the script at all, but after our first cut, he came up with an assortment of new scenes and shots for us to film and cut in. Apparently, that's the way he likes to work, and although we hadn't been tipped off in advance, producer Tom Smith had scheduled and budgeted this 'George Factor' from the beginning\". Warwick Davis explained his shooting schedule to Starlog magazine: \"I did seven weeks from May 11 and then I went back to England. Two weeks later, I did a few more weeks.\" […] \"We did quite a lot of location stuff in the Redwoods around San Rafael and then we went to ILM to do some of the special FX and most of the indoor scenes inside the cottage and castle.\" Davis performed several of his own stunts, including parts of the moat scene at Terak's castle. Wilford Brimley did not like working with the Wheat brothers, so his scenes were shot by Joe Johnston."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "The film debuted as a holiday television special on ABC on November 24, 1985. It was accompanied by a \"parent's discretion\" warning due to the violent nature of the film and the distressing theme of the death of Cindel's family. The end credits rolled over a still image of the final shot (whereas all home video releases have the end credits rolling after the final scene, over a traditional black background). The film later aired on the Disney Channel in 1991."}, {"tag": "p", "text": "When Cindel has a nightmare about the Marauders coming into Noa's house to get her, the scene where Terak pops out of Noa's bed was cut in a version for television. In this television version, she wakes after the men break in. In a home video release, two scenes were deleted; When being chased by Terak's men, Wicket races for Noa's house only to have Noa tell him their only chance is the star cruiser; In the other scene, Terak's men burn down Noa's house. On the DVD release, Cindel's line \"Do something, Wicket! Use your sling! You hit the ring!\" is instead \"Do something, Wicket! Do something!\"."}, {"tag": "h3", "text": "Marketing"}, {"tag": "p", "text": "In 1986, Random House published The Ring, the Witch, and the Crystal: An Ewok Adventure, a children's book adaptation of the film, and Buena Vista Records published Ewoks: The Battle for Endor, a book-and-record that fills in some of the gaps in the story and at times contains different dialogue than the film. The film's soundtrack was released as the 1986 LP Ewoks. Peter Bernstein—who had composed the music for Caravan of Courage—returned as composer for The Battle for Endor."}, {"tag": "h3", "text": "Home video"}, {"tag": "p", "text": "The film was released on VHS and Laserdisc in 1990 through MGM. On November 23, 2004, Lucasfilm and 20th Century Fox released the film on DVD. The DVD presents the film in its original 1.33:1 aspect ratio with a Dolby Digital 2.0 English audio track and English subtitles. The release was billed as Star Wars: Ewok Adventures, a \"double feature\" of Caravan of Courage and The Battle for Endor. The disc itself is double-sided, featuring one film on each side. Eric Walker has expressed disappointment with the DVD's lack of extras."}, {"tag": "p", "text": "On March 16, 2021, it was announced on Disney's fan club website D23.com that the movie, along with Caravan of Courage, would be available on Disney+ starting April 2."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "In late 1985, George Lucas told Starlog that further Ewok films were planned, and both Warwick Davis and Eric Walker believed that a third film was in the works. However, as Lucas later recalled \"We made two, and were going to do a third, but they became very expensive to make.\""}, {"tag": "p", "text": "Lucas biographer John Baxter described Ewoks: The Battle for Endor as \"a dry run for Willow.\" The film was voted the favorite of the two Ewok films by fans in a 2001 StarWars.com poll. In 2009, StarWars.com celebrated the 25th anniversary of the Ewok films with a series of articles covering various aspects of each."}, {"tag": "p", "text": "During the Celebration IV opening ceremonies, the cast of \"Star Wars in 30 Minutes\" performed a skit called \"Lucasfilm in Five Minutes 1983-2005,\" in which they re-enacted segments or imitated elements from all major Lucasfilm productions from 1983 to 2005. Both Ewok films were included in the act. Bonnie Burton listed Noa Briqualon and Teek as #7 on her list of \"10 Unlikely Unleashed Figures\", though she felt that Teek would make a better figure than Noa."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The film was classified as C-canon in the Holocron continuity database. However, Lucasfilm's canon system was completely reorganized following the 2012 Disney buyout in anticipation of the Star Wars sequel trilogy. From April 25, 2014, only the six episodic films, The Clone Wars TV series, and anything going forward were to be considered canon."}, {"tag": "p", "text": "There has been some controversy as to the story's placement in continuity; A timeline published in Star Wars Insider shows the Ewok films occurring a short time before Return of the Jedi. Although the films make extensive use of Ewokese, the language developed by Ben Burtt for the Ewok species, Wicket appears to learn Basic in The Battle for Endor through his association with Cindel. This would seemingly create a continuity error with Return of the Jedi, since Wicket is shown to not understand Leia Organa's Basic in that film. StarWars.com suggests that Cindel and her family are actually speaking a different language from Basic, and that it was translated into Basic (English) for the benefit of the viewing audience."}, {"tag": "p", "text": "On page 155 of the novel Legacy of the Force: Fury, Darth Caedus goes to check on his daughter Allana in a secret compartment of the Anakin Solo, and he finds her sleeping as an \"entertainment broadcast in which Ewoks spoke Basic and befriended shipwrecked little girls\" plays on a viewscreen. An Abyssin ornament as seen in Jabba's Palace in Star Wars: Episode VI Return of the Jedi is seen in Terak's fortress as an alarm bell holder."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}