{"url": "Ewoks_2", "categories": ["Category:Real-world articles", "Category:Marvel Ewoks"], "nodes": [{"tag": "h1", "text": "Ewoks 2"}, {"tag": "p", "text": "Ewoks 2 is the second issue of the Ewoks series of comic books and was published under the Marvel Comics Star Comics imprint in July 1985. The story is split up into three chapters, \"Rites of Power,\" \"Rites to [sic] Power Part II: A Call to Arms,\" and \"Rites of Power Part III: Fight to the Finish.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Ewoks Wicket Wystri Warrick and his friend Teebo are up in the trees of Endor on scouting duty for Bright Tree Village during their friend Princess Kneesaa's birthday. They are startled to see a band of Zorbian space pirates under the leadership of Captain Krag advancing towards their village, the purpose of their incursion being to acquire the valuable Ewok Gemwood tree. Wicket and Teebo decide to alert the village; however, Teebo accidentally drops an apple on the head of Krag, which alerts him to their presence. He orders their capture, and the two are ensnared on a tree branch by well-aimed bolo-slings thrown by the pirates. However, Teebo is able to use his spear to free Wicket, and he sets off to warn the village but is thrown off balance by another incoming bolo-sling and falls off the branch into some bushes and is injured but nevertheless he carries on his journey. Krag decides to let Wicket go so he can tell the village that the pirates have Teebo, which will draw the warriors away from the village in an effort to rescue him, leaving it unprotected."}, {"tag": "p", "text": "Meanwhile at the village, Princess Kneesaa is enjoying her birthday celebrations, during which she is given the Bordok Baga by Logray as a present from Wicket and Teebo. Her father Chief Chirpa then presents her with his own gift; a Ruling staff made from the Gemwood tree and subsequently announces her as heiress apparent to the title of Chieftains of the Bright Tree Tribe. This news, however, does not please the Village Council, especially First Elder Kazak who points out that all Ewok leaders have been males and that a Chief should be strong enough to carry a spear into battle (he tosses a spear into Kneesaa's fumbling arms as he declares this). Despite the protestations by Chirpa and Logray the Council agrees that they will choose a new Chief themselves when the time comes."}, {"tag": "p", "text": "At this moment Wicket returns to the village in a state of utter exhaustion and bursts in on the celebrations warning the village of the space pirates and the capture of Teebo. Chirpa imminently decides to mount a rescue operation and leads the warriors into the woods. However, before he sets off, Kneesaa asks to join the expedition in a attempt to prove her worth to the Elders, but Chirpa refuses and tells her to stay with Logray and nurse Wicket back to health. Feeling as though her father agrees with the Elders, she bitterly tells Logray that she wished to have been born a boy instead of a girl. Logray tells her that carrying a spear into battle is not the true test of a leader; he then shows her the Gemwood tree, and Kneesaa asks how one can protect one's property and way of life without violence, to which Logray responds that asking such questions are what makes a fine leader."}, {"tag": "p", "text": "The warriors of the village approach the pirates' ship and see Teebo tied up to staves and gagged. Upon rescuing him, he warns them that they have been trapped and as he says this a vast net is propelled over the Ewoks capturing them. Krag gloats over his captives and decides to take Chirpa and a few others with him to the village as hostages. As they approach the village Kneesaa is informed of their approach and starts to make a plan to protect the village and the Gemwood tree."}, {"tag": "p", "text": "Upon their arrival at the village Krag and his men find it to be deserted, and so calls out to Ewoks that he will execute their leaders he captured. Kneesaa, however, approaches him with the others and asks Krag not to hurt them. Krag, pleased with her apparent compliance, strokes her chin, but Kneesaa bites his finger and runs off, telling the other Ewoks to man their posts. The pirates run off in pursuit of her and the women and children of the tribe. However, according to Kneesaa's plan, they fall into various traps and many are captured or incapacitated. Krag, however, is able to track her down and confronts her, but Baga charges him from behind, knocking him down. Kneesaa mounts Baga and rides off, but not before Krag throws a bolo-sling at her and ensnares Baga's legs causing her to fly off him. Luckily Kneesaa's friend Latara is near the supply shed and tells Kneesaa to run to it, she complies and as Krag is about to swing his axe at her Latara tips a honey pot on the roof inundating him with honey which incapacitates the pirate."}, {"tag": "p", "text": "Afterwards, the leaders are freed, and the pirates are sent back to their ship. Chirpa tells Kneesaa of his immense pride in her deeds that day, and Kazak and the other Elders apologize for doubting her abilities to lead the tribe and give her their blessing along with her ruling staff. Wicket and Teebo congratulate her acceptance and give her a request: a piece of birthday cake."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}