{"url": "Ewoks_14", "categories": ["Category:Real-world articles", "Category:Marvel Ewoks"], "nodes": [{"tag": "h1", "text": "Ewoks 14"}, {"tag": "p", "text": "Ewoks 14 is the fourteenth and final issue of the Ewoks series of comic books and was published under the Marvel Comics Star Comics imprint. The planned issue that would follow, Ewoks 15, was announced by Marvel but later canceled. It contained the story \"King For a Day.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Chief Chirpa and Logray need to go away for one day, in order to honor the spirit tree. Chirpa decided to pull a name out of the hat and let the winner rule the village for a day. The result gets him worried and he hesitates to announce it. After being repeatedly asked who has been chosen, he announces that it's Teebo. Everybody laughs. Teebo hears they're calling him, while he is chasing a butterfly and as he runs to see what's going on, he trips over his butterfly net. The Ewoks are laughing even more and one of them remarks that Teebo would not be able to lead them out of a berry patch, with a map. Teebo himself is confused and states that he always saw himself as a great follower, but this does not change Chripa's decision."}, {"tag": "p", "text": "Once the tribe leaders left, Teebo reaches out to Princess Kneesaa for advice. She tells him to make sure everything in the village runs smoothly, advising him to gain the villagers' confidence in order to show them who's in charge. He then sees Brador who's having problems with his stubborn bordok and slaps the animal on its backside. As the bordok runs away, it tears through some laundry, crashes through a hut that one Ewok is showing to his spouse at that exact moment and breaks some pottery. The Ewoks run after Teebo and Wicket and Kneesaa try to stop them, asking the mob not to harm their friend. The others claim that they would just lock him up before he destroys the village. Teebo manages to escape on his hang-glider and and ponders if he should just fly around until Logray and Chirpa come back. Suddenly, an unknown probe droid crashes into the glider and causes it to fall into some bushes. Teebo remains still until the threat goes away."}, {"tag": "p", "text": "The probe droid locates the Ewok village and, in Zornak's spaceship, captain Zornak is telling his henchman about a plan to capture Ewoks and use them as slaves, with the help of obedience stones. He is then teleported to the village, where he encounters Wicket and Kneesaa, claiming he's just a simple traveler seeking their hospitality and offers them a couple of stones on necklaces. While Kneesaa welcomes him to the village, she is not interested in his gift before Wicket says that they should not hurt the strangers' feelings. Once they have put the stones on, they blindly obey Zornak's orders and soon, everybody else is wearing the stones, allowing him to take them away."}, {"tag": "p", "text": "Teebo returns to the village to warn everybody that there might be danger approaching. The village appears to be deserted, and he is worried that everybody ran away from his leadership. The probe droid appears again and the young Ewok, having figured out that it has something to do with everybody else's disappearance, hops on a new glider to follow it."}, {"tag": "p", "text": "The droid stops in the Crystal Valley. Teebo spots Zornak's henchmen commanding the hypnotized Ewoks who are carrying batches of gems to the spaceship. He is angry that somebody's making slaves out of his friends. Then the probe droid approaches him again and Zornak's people notice that there is an Ewok who has not been captured yet. Instead of searching the unknown to find Teebo, they decide to send Wicket for him. Wicket must obey and soon he's chasing his best friend through the woods with a stun weapon. Teebo is unsure of what to do until his hood gets stuck on a branch. He gets an idea and climbs a tree with some fruits, while his hood remains on top of a bush, as a trap. He then calls Wicket, who fires onto the bushes, and drops a fruit on his head."}, {"tag": "p", "text": "When Wicket comes around, Teebo assures him that he is not angry and then he gets another idea. He places the stone back around his friend's neck, effectively getting command of him. They head back to Zornak's spaceship, where Wicket then places an obedience stone around Zornak's neck, as per Teebo's command. Teebo then commands the alien slavedriver to free the captured Ewoks and leave Endor immediately. The villagers are grateful to Teebo for having saved them, which surprises Chief Chirpa and Logray once they have returned from their trip. As they observe Teebo carried around by cheering villagers, Logray remarks to Chirpa that he would've been out of his job, had they been gone away for another day."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}