{"url": "Ewok%E2%80%93Dulok_wars", "categories": ["Category:Legends articles", "Category:Battles of the Ewok–Dulok wars", "Category:Dulok culture", "Category:Ewok culture"], "nodes": [{"tag": "h1", "text": "Ewok–Dulok wars"}, {"tag": "p", "text": "The Ewok–Dulok wars were fought between the Ewok tribe that lived in Bright Tree Village and the Dulok tribe that lived in the Dulok Swamp. The conflict lasted for generations, during which the Duloks made numerous attempts to destroy areas held sacred by the Ewoks. In two battles, the Ewok battle wagon played an integral role. Wicket Wystri Warrick and his friends foiled several Dulok war strategies in 3 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "First Battle of the Soul Trees"}, {"tag": "p", "text": "In one important confrontation, an army of Duloks attempted to cut down the Ewoks' Soul Trees with stone axes. The Ewok Erpham Warrick fought back with the Ewok battle wagon, a war machine he had constructed, and forced the invaders back to their swamps."}, {"tag": "h3", "text": "Battle of the Tree of Light"}, {"tag": "p", "text": "Long after Erpham Warrick had died and the Dulok tribe had come under the rule of King Gorneesh, another battle occurred at the Ewoks' sacred Tree of Light. The Ewoks believed the tree to be weakening and in need of renewal. As a team of young Ewoks traveled to perform the necessary rituals, Gorneesh and his warriors attempted to fell the weakened tree. The rival factions clashed at the tree, and Wicket Wystri Warrick and Kneesaa a Jari Kintaka turned the tide in the Ewoks' favor."}, {"tag": "h3", "text": "Second Battle of the Soul Trees"}, {"tag": "p", "text": "Wicket W. Warrick, grandson of Erpham Warrick, reconstructed his ancestor's battle wagon in 3 ABY, but it fell into the hands of Gorneesh's Duloks. Under guidance of their oracle, Murgoob, the Duloks aimed the contraption at the Ewoks' Soul Trees. Warrick and another Ewok named Malani managed to sabotage the war machine before it could reach its target and cause any real damage."}, {"tag": "h3", "text": "Fish carving affair"}, {"tag": "p", "text": "The Duloks fought back some time later with a river-going battleship. They stole a sacred fish carving from the Bright Tree Ewoks and kidnapped several young Ewoks for use as galley slaves. Before they could attack their rivals, however, the Dulok prisoners managed to escape and reclaim the carving."}, {"tag": "h3", "text": "Chirpa-Gorneesh peace summit"}, {"tag": "p", "text": "Eventually, Gorneesh offered a peace treaty to Chief Chirpa, the Ewok leader. The two agreed to hold a peace summit, but at the agreed upon place, Gorneesh revealed his true intentions when his warriors tried to cut the ropes holding up the bridge Chirpa and his representatives were crossing. The summit a failure, the war continued."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ewok–Dulok wars were first named in the character profile of Chief Chirpa, as drawn and written by Zack Giallongo for the release of Star Wars: Ewoks—Shadows of Endor in 2013."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}