{"url": "Ewoks_vs._The_Empire_-_Small_but_Mighty", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxy of Adventures episodes"], "nodes": [{"tag": "h1", "text": "Ewoks vs. The Empire - Small but Mighty"}, {"tag": "p", "text": "\"Ewoks vs. The Empire - Small but Mighty\" is the thirty-fifth episode of Star Wars Galaxy of Adventures. It premiered on the Star Wars Kids website and YouTube channel on July 5, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The episode opens with Han Solo's Endor strike team including Princess Leia Organa being surrounded by a legion of Imperial stormtroopers, scout troopers, and AT-ST walkers. One stormtrooper tells them don't move while the Imperial commander smirks triumphantly. Just then, a horn blows in the forest."}, {"tag": "p", "text": "As armed Ewoks emerge from the forest and undergrowth, the narrator explains that in a \"galaxy of adventures\", the Ewoks may be small but are mighty. At Chief Chirpa's signal, Ewok archers rain down arrows on the Imperials. Other Ewoks swing down on ropes, knocking more Imperials to the ground. Solo and Leia grab blaster pistols and join the fight."}, {"tag": "p", "text": "Two Ewoks steal a 74-Z speeder bike and lure a mounted scout trooper into a rope trap. Another Ewok wraps a lasso around a second speeder bike, causing it to crash into a tree. Ewoks ambush stormtroopers with some stealing their blasters. The Ewoks also use several log and rock traps to destroy several AT-ST walkers."}, {"tag": "p", "text": "The battle ends with three surviving Imperials—the officer, a scout trooper, and stormtrooper—surrendering to a pack of armed Ewoks. Chewbacca, Solo, Leia, and Wicket W. Warrick watch triumphantly."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The series once again replaces Nik Sant by the clone Commander Rex, during the short it can be seen how the Rebel in the Scout trooper armor has blue and white markings of the 501st Legion, these marks are similar to the ones Rex wears in the series Star Wars Rebels, and in the short \"Han Solo - From Smuggler to General\", where Rex replaced for the first time Nik Sant. The short doesn't confirm if Nik Sant and Rex are meant to be the same person."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}