{"url": "Exar_Kun_mural", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Murals"], "nodes": [{"tag": "h1", "text": "Exar Kun mural"}, {"tag": "p", "text": "The Exar Kun mural was a work of art depicting the Dark Lord of the Sith Exar Kun. It was found by a group of spacers after they ventured into the Temple of Exar Kun—located on the moon Yavin 4—sometime after the Battle of Yavin during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. The spacers had entered the temple on a mission to destroy the Cult of Exar Kun. The final, deepest chamber of the temple featured a much larger version of the mural."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The center of the Exar Kun mural depicted the Human male Dark Lord of the Sith Exar Kun in the foreground, wielding his double-bladed lightsaber, his body giving off a red aura. The center's background depicted dark, jagged spikes with a red light shining from the top-left corner. Dark side cultists cloaked in black appeared on either side of the center image, with red lightning emanating from their forms. The images were set into a dark, carved stone frame."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The mural was discovered by a group of spacers during their explorations of the Temple of Exar Kun—a Sith Temple located on the moon Yavin 4—sometime after the Battle of Yavin during the Galactic Civil War, a series of conflicts between the Galactic Empire and the Alliance to Restore the Republic. The spacers had come to the temple on a mission to destroy the Cult of Exar Kun and banish the resurrected Sith Lord's evil spirit back into the Void. They looted the mural from the Sith Lord's corpse."}, {"tag": "p", "text": "A larger version of the mural hung upon the wall in Exar Kun's throne room, the deepest chamber of the temple."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Exar Kun mural appeared in the 2003 video game Star Wars Galaxies: An Empire Divided. It was added to the game on April 3, 2008, as part of the Chapter 9: The Fury of Exar Kun game update. It was one of the many new pieces of loot found on enemies within the Temple of Exar Kun \"heroic encounter\" that the patch added. This particular item was from Exar Kun, the final boss of the encounter. It was extremely rare and could be sold to other players for several hundred million credits, depending on the server on which it was featured. It could be used in a player's personal structure as a decoration. The painting also appeared as part of the artwork for the \"Throne Room\" card in the Star Wars Galaxies Trading Card Game expansion set Galactic Hunters, released on March 12, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}