{"url": "Executioner_trooper", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:First Order stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Executioner trooper"}, {"tag": "p", "text": "Executioner troopers, also known as First Order Judicial Stormtroopers or First Order stormtrooper executioners, were First Order stormtroopers randomly selected from existing ranks and assigned to dispense final justice on enemies and traitors of the First Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Owing to the First Order's merciless attitude towards treason—exceeding even that of the Galactic Empire, where even a derogatory remark was considered treasonous—the First Order Executioner troopers tended to do several public executions each day on anyone with even slight loyalty issues. In addition, the executioner trooper underwent several rotations during each session, and was even considered at times a test to see whether they would make it within the Stormtrooper Corps. They were trained to deal with anyone disloyal to the First Order, with it being considered an effective method of stormtrooper training. Unlike most stormtrooper variants, however, they were not from a specialist unit, but were instead randomly picked among regular stormtroopers for that day depending on various assignments. When wearing the Executioner trooper armor, their identity was left anonymous by not broadcasting their serial number which would appear on displays of other stormtroopers. The Executioner trooper also had a built in vocoder which disguised their voice. Only their commanding officer  was aware of their identity."}, {"tag": "p", "text": "Prior to his defection from the First Order, Finn undertook executioner duty, hoping each day would end without having to carry out any executions."}, {"tag": "p", "text": "After Finn's defection to the Resistance and subsequent capture aboard the Supremacy, two of these were brought out by Captain Phasma to execute Finn and his companion Rose Tico, deeming an execution by blaster to be \"too good for them.\" The two selected prepared to behead them on Phasma's command. Right as she gave the order, however, the Supremacy was suddenly devastated by Vice Admiral Amilyn Holdo's suicide maneuver when she rammed the heavy cruiser Raddus into the Supremacy at lightspeed. The two executioners, along with the majority of those gathered in the hangar, were killed instantly in the devastation."}, {"tag": "p", "text": "Aboard a Resurgent-class Star Destroyer, Agent Tierny and Commander Pyre had two executioners escort TIE fighter pilots Tamara Ryvora and Jace Rucklin, the latter of whom protested his innocence, to a cell block. Upon their arrival, the executioners were shot down by Jarek Yeager who, along with Kazuda Xiono, had come to rescue Tam. The three were later captured, with a second pair of executioners escorting them to the bridge. When the Star Destroyer was attacked by the Colossus, the three used the distraction to break free. Wrestling with a stormtrooper, Yeager used their F-11D blaster rifle to shoot down the two executioners. Kaz, who had been wrestling with the second executioner, made off with their BL-155 Laser ax."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The executioners wore specially marked armor with a carbon-finish to denote their role as such. Additionally, their equipment did not broadcast serial numbers to their squadmates, in order to ensure their identity remained anonymous. Their helmets were also equipped with polarized lenses and Multi-Frequency Targeting and Acquisition Systems. They carried BL-155 Laser axes for execution purposes, which were intended to inflict great pain upon use."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The First Order stormtrooper executioners were created for the 2017 film Star Wars: Episode VIII The Last Jedi, directed by Rian Johnson. The executioner was first officially revealed in behind-the-scenes footage from The Last Jedi at the D23 Expo in July 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}