{"url": "Executive_Separatist_Council", "categories": ["Category:Canon articles", "Category:Stub", "Category:Confederacy of Independent Systems organizations"], "nodes": [{"tag": "h1", "text": "Executive Separatist Council"}, {"tag": "p", "text": "The Executive Separatist Council, also known simply as the Separatist Council, was a governing body, led by Count Dooku, within the Confederacy of Independent Systems. It was made up of a number of Separatist leaders from the various major powers that backed the Separatist cause during the Clone Wars, including the Trade Federation, the Techno Union, the Corporate Alliance, the Commerce Guild, and the InterGalactic Banking Clan. The entire Council was betrayed by Sidious, who had them slaughtered by Darth Vader on Mustafar at the end of the war in 19 BBY, bringing an end to the Confederacy leadership."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before the Confederacy of Independent Systems was founded, Count Dooku of Serenno secretly allied with major galactic corporations, including the Techno Union, Commerce Guild, and Trade Federation. While joining the Count was a risk, becoming one of the Confederacy's founding corporations offered them special privileges, and the chief privilege was that the corporation would gain a seat on the Council."}, {"tag": "p", "text": "In 22 BBY, the Council members were present on Geonosis and planned with Count Dooku to combat the Galactic Republic. Senator Rogwa Wodrata attended the meeting as well. By the time of their meeting, the Trade Federation of Viceroy Nute Gunray had pledged their Droid Army to Dooku, and the other corporations decided to do the same. During the Clone Wars, the Council acted as the secret group behind the civilian Separatist Senate, which dealt with civil matters, with the Council dealing with military matters and funding. Its members were mostly fueled by self-interest and greed."}, {"tag": "p", "text": "After the Battle of Coruscant in 19 BBY, which saw the death of their leader Count Dooku, the Council members were placed under the protection of General Grievous, now the official leader of the Confederacy. On orders of Dooku's former master, Darth Sidious, Grievous ordered the Council to relocate to the planet of Mustafar. The Council members left Utapau just before a battle broke out on the planet between the Republic and the Confederacy, which resulted in Grievous' death at the hands of Jedi Master Obi-Wan Kenobi. Soon afterwards, Sidious told them through a hologram that his new apprentice Darth Vader would take care of them, though they were unaware that Sidious had betrayed them and had really sent Vader to kill them. They were soon then brutally murdered on Mustafar by Vader, as Sidious had no further use for any of the Council members following his transformation of the Republic into the tyrannical Galactic Empire. The Confederacy itself soon collapsed with the deactivation of its droid armies and the takeover of its assets by the Empire."}, {"tag": "h2", "text": "Members"}, {"tag": "p", "text": "The council consisted of eight Separatist leaders:"}, {"tag": "p", "text": "These leaders were also helped by various aides, including Rune Haako, Cat Miin, Sun Fac, Denaria Kee, Rute Gunnay, an unidentified Purkoll citizen, and Nank Tun."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Revenge of the Sith, an unidentified Separatist is seated next to Tikkes on Utapau. Without any speaking lines or focus on the character, however, it is not clear if this Separatist was part of the Separatist Council or merely an aide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}