{"url": "Executor-class_Star_Dreadnought/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Executor-class Star Dreadnoughts", "Category:Galactic Alliance starship classes", "Category:Galactic Empire starship classes", "Category:New Republic starship classes", "Category:Star Dreadnought classes"], "nodes": [{"tag": "h1", "text": "Executor-class Star Dreadnought"}, {"tag": "p", "text": "The Executor-class Star Dreadnought, colloquially known as the Executor-class Super Star Destroyer, Executor-class Star Destroyer or simply Super Star Destroyer, was a heavy warship class in the Star Dreadnought league, often used as command ships and flagships in the Imperial Navy. At their prime, they were among the largest vessels in the galaxy, and were almost invincible in combat, although they were costly to operate."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like most KDY-style warships, the ship's overall shape was pointed, although unlike the Imperial-class, the Executor-class was closer to dagger-shaped. It also retained the KDY-style command bridge and possessed a massive cityscape on the top and, to a certain degree, at the aft. Its primary colors were dark gray and white for the main hull, and black for the cityscape sections, although the various lights aboard the vessel combined with operating in deep-space environments at times gave a more cerulean appearance to its hull."}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Executor-class measured 19 kilometers in length and was 100 times more massive than the ubiquitous Imperial-class Star Destroyer."}, {"tag": "p", "text": "280,734 Imperial Navy officers, gunners and enlisted men were said to have crewed each vessel. The Rebel leader Mon Mothma, when learning of the staff required to man such a vessel, admitted it would be virtually impossible to command it, even if the Rebellion were to somehow capture it, due to there not being enough personnel on their end."}, {"tag": "p", "text": "Though several variants of the Executor-class existed, all followed similar design attributes in terms of structure. In terms of length, it was also tied with the Vengeance-class dreadnought as the largest ship class within Star Dreadnoughts or Super Star Destroyers."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The Executor-class was built with one main reactor and an unknown number of secondary reactors. Thirteen Executor-50.x engines placed in five thruster banks gave the Executor-class impressive acceleration for its size. The main reactor was accessible through various service tubes."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The Executor-class had over 5,000 weapons emplacements, including turbolasers, assault concussion missile launchers, and ion cannons. With warships able to direct all power to their energy weapons, the Executor-class had at least 100 times more firepower than an Imperial-class destroyer."}, {"tag": "p", "text": "A majority of gun batteries and missile launchers were located in the central cityscape on the class's dorsal side, while some point-defense guns were located throughout the side trenches. On at least one ship, many heavy batteries were sacrificed for an increased number of anti-starfighter cannons."}, {"tag": "p", "text": "Despite its impressive firepower, the design was far from perfect, as the ventral side and the aft were relatively undefended, and Executor-class SSDs required an impressive starfighter defensive screen to chase off enemy starfighters and marauding smaller capital ships who otherwise could remain in the main weaponry's blind spots. In addition, the Executor-class possessed several trenches in its cityscape, which also left it vulnerable to the Trench Run Defense tactic should its shields be disabled. Such a weakness is what destroyed an in-development variant possessing cloaking abilities at Fondor, and is ultimately what destroyed the Executor at Endor."}, {"tag": "p", "text": "Its shields handled much of the power generated—an amount equivalent to the total power of a medium star (3.8 × 1026 W). Shield projectors were placed throughout the hull, which decentralized the protection system and decreased the chance of all shields falling at once. Known shield segments included the dorsal, ventral, bow, aft, port and starboard shields. In later-model ships, an extra shield generator was mounted in the middle of the ship."}, {"tag": "p", "text": "In addition to the shield generators, several Executors had cloaking generators or stealth armor fitted to the vessel, in order to perform sneak attacks on enemy targets."}, {"tag": "h3", "text": "Sensor domes"}, {"tag": "p", "text": "The geodesic domes located on and around the Executor's bridge tower (similar to those of Imperial-class Star Destroyers) served dual purposes. Inside the dome were hyperwave transceiver coils for supralight active sensors, while vanes jutting out of the dome served as shield projectors for the surrounding area. There were many such geodesic domes scattered around the ship. The ship also possessed long-range scanners, which also ensured, alongside Viper probe droids, that the Executor could locate Echo base."}, {"tag": "p", "text": "These domes were not vulnerable to external attack as long as the shields remained intact, but concentrated capital-ship bombardment—such as that ordered by Admiral Gial Ackbar during the Battle of Endor—could knock out this protective field. The sensors and shield projectors thus became vulnerable to attack, as demonstrated by Rebel starfighter pilots."}, {"tag": "h3", "text": "Complement"}, {"tag": "p", "text": "A minimum of 144 starfighters were carried on board Executor-class vessels, but the massive hangars could hold thousands. In addition to fighters, the Executor-class also carried a large number of landing craft, dropships, ground armor and two prefabricated garrison bases."}, {"tag": "p", "text": "At least three hangar bays were located on the portside, several underneath the vessel and multi-level fighter bays deep inside the main superstructure.\nThe class had an internal Beltway cargo handling system. The internal freight shaft went from the stern to the prow of the battleship, equipped with a tracked hauler that could carry large loads throughout the vessel."}, {"tag": "p", "text": "These Super-class Star Destroyers possessed six detention blocks that were used for crew discipline alone. They held ten additional high-security blocks that were used for enemy prisoners. Furthermore, they contained three cargo areas that were designed for the secure transport of large quantities of slaves, refugees or even prisoners of war. Adjacent to the large landing bays used by the bulk shuttles were holding areas that were equipped with only minimal facilities in terms of water taps, ventilation and food dispensers. These regions of the ship were considered adequate for up to a thousand people."}, {"tag": "h3", "text": "Bridge"}, {"tag": "p", "text": "The bridge tower was almost a starship in itself and was a standard module on many different KDY warship classes. It was equipped with heavy shielding to compensate for its highly visible location, and contained mess halls, special quarters for officers of high rank, and large escape pods. The admiral aboard the vessel even had his own escape pod, directly above the command bridge and next to admiral's suites. The command tower also had its own power generators, relays, and life-support systems. It was connected to the ship's main reactor by a cluster of power feeds. The tower's shaft was also littered with thin flaps that had a variety of purposes, including heat-sink panels, small radiators, antennas, and even defensive cannons on occasion."}, {"tag": "p", "text": "The bridge of the Executor had the same basic layout as standard Star Destroyers. The outermost part featured nine triangular viewports. The center contained two crewpits which housed the control consoles for the ship, of which there were six consoles for each crew pit. As the crewpits inhibited the flight data officers, tracking systems specialists, and combat supervisors' ability to see through the bridge's viewport, the crew focused on their consoles without unnecessary distraction. Between them was the command walkway. To the right and left sides of the bridge were two alcoves containing the weapons and defense stations, which were located to the right and left of the hall, respectively, and likewise were placed near minor viewports. Behind the bridge was the Security Foyer, which contained the communications stations on the leftmost wall, a turbolift, and a HoloNet pod for ship-to-ship communications at the center. Immediately behind the Security Foyer was a series of steps that led directly to the main corridor, with the immediate entryway to the corridor possessing access doorways to each side. On the level directly beneath the bridge was the main navigation complex."}, {"tag": "p", "text": "Additional tower structures were located throughout the ship's main superstructure, including a forward structure similar in design to the Munificent-class Star Frigate's command tower."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Design and construction"}, {"tag": "p", "text": "The Executor-class was the brainchild of Lira Wessex, the brilliant and ambitious engineer who already had the designs of the Venator-class and Imperator-class (later renamed Imperial-class) Star Destroyers to her credit. Following her work on the already-impressive Imperial-class, Wessex sought to improve on the design."}, {"tag": "p", "text": "Adhering to Kuat Drive Yards' philosophy of psychological effect in starship design, or \"terror styling,\" she believed that the immense size of an Imperial-class Star Destroyer was largely responsible for its ability to intimidate opponents. Working on that theory, she began designing a starship that would dwarf all her previous works. Though KDY had designed and built extremely large warships in the past, such as Star Dreadnoughts like the Mandator-class and battlecruisers like the Procurator-class, the result obtained by Wessex was utterly gargantuan. Although the ship was developed by Kuat Drive Yards, the Emperor commissioned Fondor Shipyards to finish the lead ship, much to Fondor's consternation, as they had to put several civilian ship designs on hold. Their anger grew worse when it became apparent that Kuat Drive Yards would continue development of all future Super Star Destroyer models, as they hoped this would act as an opportunity to steal future design grants from their business rival. In addition, Kuat was also commissioned to develop a second Executor-class in secret, in order to get away with stating that the ship was developed in both Kuat and Fondor."}, {"tag": "p", "text": "Emperor Palpatine authorized the construction of the first four Executor-class ships even before the Battle of Yavin (0 BBY), but it still had to be slipped past the watchful eyes of various oversight committees in the Imperial Senate; to the very last, the minority of Senators who opposed Palpatine and his policies used the few political tools they had left to hinder him, and one of these was budget oversight. To conceal the particulars of the vessel from the opposition, the Navy listed the new ship as a \"Super-class Star Destroyer\" in budget reports submitted to the Senate, and understated its true length (19,000 meters) by many kilometers."}, {"tag": "p", "text": "Owing to this, the Executor-class and other ships of its range in size came to be unofficially classed \"Super Star Destroyers.\" The ship's length, even in Imperial government scandocs, was variously reported as 8,000 or 12,800 meters, before the true details of the size of the class came to light."}, {"tag": "p", "text": "The first of the class, the Executor, began construction in the years preceding the Battle of Yavin. The unfinished vessel was used as a headquarters for Darth Vader and his secret apprentice, Galen Marek.\nWith the sudden and unanticipated destruction of the Death Star at Yavin, Wessex's production schedule changed completely. At the urging of Darth Vader, the Emperor ordered her to rush the new line into production as quickly as possible, to compensate for the loss of the battle station. As certain segments of naval command may have anticipated, a new symbol of intimidation was needed, and as Wessex had believed, the Executor-class fit the need well."}, {"tag": "p", "text": "The first two Executor-class ships were now being built simultaneously, with the Lusankya at Kuat Drive Yards and the Executor moved to the Fondor Shipyards. Darth Vader received the finished Executor at Fondor about half a year after the fiasco at Yavin. The second ship, then known as the Executor II, was completed shortly afterwards at Kuat, received its new name, and was hidden on Coruscant."}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "The Executor went on to become the most feared and famous of its class by virtue of its status as Darth Vader's command ship. Because of the Executor's stance as the lead ship of Darth Vader's fleet, Death Squadron, Death Squadron's fleet insignia also bore the image of an Executor-class Star Dreadnought. In addition, four Executor-class Star Dreadnoughts, including the Executor itself, were known to have been in service to the Empire by the time of the Battle of Hoth in 3 ABY. However, the vessel was destroyed at the Battle of Endor in 4 ABY, after an A-wing starfighter rammed through its bridge and it subsequently crashed into the Death Star II."}, {"tag": "p", "text": "During the early years of the Galactic Civil War, several other Executor-class ships were built and fielded. A Rebel strike destroyed an Executor-class ship, upgraded with cloaking technology, while still under construction at Fondor in 3 ABY. Another Star Dreadnaught with cloaking capability, the Terror, was already operational by 3 ABY. The Vengeance led a task force around this time. Towards the end of Palpatine's glory days in 4 ABY, other Executors were noted as well. The Guardian was tasked with protecting Coruscant, the Annihilator served close to Kuat, the Reaper led Scourge Squadron on its patrols in the Outer Rim Territories and the Brawl was given to Admiral Zsinj by Palpatine himself."}, {"tag": "p", "text": "In the later years, production on Executor-class Star Dreadnoughts and other Super Star Destroyers accelerated in a display of the Emperor's wealth and power. After the death of the Emperor and the fragmentation of the Galactic Empire into feuding fiefs, Executor-class Star Dreadnoughts were popular acquisitions amongst warlords hoping to improve their military power and prestige. Some would fall into the hands of the New Republic, where they would fight against the Empire they had once served. The Imperial Warlord Superior General Sander Delvardus had a new Executor-class Star Dreadnought constructed at great expense and it was completed in 12 ABY. It was named the Night Hammer and was soon taken by Admiral Natasi Daala as her flagship. She renamed it the Knight Hammer and led it in an attack against the Jedi Praxeum on Yavin 4. However, it was destroyed by the Jedi Callista Ming."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following the Black Fleet Crisis, where the New Republic faced the Star Dreadnought Intimidator, a decision was made to build a warship class that could counter threats from rogue warships like the Executor-class. The result was the Star Dreadnought-analogue Viscount-class Star Defender built by the Mon Calamari."}, {"tag": "p", "text": "In addition to these Star Defenders, the few Executor-class Star Dreadnoughts left after the Galactic Civil War would see heavy action in the Yuuzhan Vong War, where even more ships were lost.\nAfter the war, the only known Star Dreadnought left and operating under the Galactic Alliance was the Guardian, which was present at the Battle of Yuuzhan'tar, and later returned to its post at Kashyyyk, following the war's end."}, {"tag": "p", "text": "By the Sith–Imperial War, the Executor-class was gone from active service, having been found too expensive to run. It shared this fate with many other heavy warship designs, as fleet doctrine moved towards smaller, compact weapons platforms, like the MC140 Scythe-class main battle cruiser.\nThe final legacy of the Executor-class was its partial inspiration for the Pellaeon-class Star Destroyer, which incorporated systems from both it and the Imperial-class Star Destroyer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Other phrases used to describe these vessels were \"cruiser\" (Empire Strikes Back novelization), \"battlecruiser,\" \"battleship,\" and \"dreadnaught\" (all from the Classic Star Wars comics), \"Star Destroyer\" (Star Wars: Episode V The Empire Strikes Back), and \"Star Cruiser\" (Marvel's Star Wars comics)."}, {"tag": "p", "text": "In the Empire Strikes Back arcade game for Atari, an Imperial ship can be seen searching for the Rebels' secret base shortly before the Battle of Hoth. This crude vector drawing was similar to an early Executor production painting. A similar reuse was made in Star Wars 60 and Star Wars 61, where the flagship of Admiral Mils Giel, the Helmsman, was based on early Executor concept art."}, {"tag": "p", "text": "The filming model of Executor included some unusual items attached or built-in to create structural details. One notable item visible on close examination of the model is a toy soldier."}, {"tag": "p", "text": "Originally, during production of The Empire Strikes Back, the Executor was meant to be just another type of Star Destroyer, similar in design to the ones seen in Star Wars: Episode IV A New Hope, only faster. At some point, the design was changed and enlarged, and the vessel became much bigger than its escorting Star Destroyers. G-canon movie visuals established a length of around 11 miles, a size that was maintained by the special-effects team for its two on-screen appearances. Early sources like the Star Wars Episode V: The Empire Strikes Back script (1978), the Empire Strikes Back novelization (1980), and The Empire Strikes Back Official Poster Monthly (1980) described the Executor as larger and more powerful than the five ISDs accompanying it. (The sources all used \"larger,\" but the other characteristics differed slightly. The script used the phrase \"more awesome,\" the Poster Monthly \"stronger,\" and the novelization \"more ominous.\" The relation to the five escorting ships remained constant.)"}, {"tag": "p", "text": "A Guide to the Star Wars Universe (1984) said it was approximately five times larger and more destructive than any Star Destroyer in the Imperial Fleet. Since multiple mile-long Star Destroyers are in Legends material (implicitly stated in books like Darksaber and Dark Forces: Soldier for the Empire, and explicitly stated in Star Wars: Attack of the Clones Incredible Cross-Sections), this is consistent with earlier sources and does not indicate the Imperial-class specifically, which would have created an inconsistency."}, {"tag": "p", "text": "In 1989, the roleplaying-game-based Imperial Sourcebook stated that the class was exactly five times the length of the Imperial-class Star Destroyer, and this figure was perpetuated for about 15 years, in game and non-game sources. Often, the accompanying Executor illustrations did not match the model used in the films, with the command tower being too large compared to the rest of the vessel, the tail section being truncated, and the ship having fewer engines (usually stated as nine)."}, {"tag": "p", "text": "The behind-the-scenes book From Star Wars to Indiana Jones: The Best of the Lucasfilm Archives (1995) showed the film props and stated that the Executor was conceived as eleven times the size of the original Star Destroyer, which itself was one mile (1.6 km) long. The Star Wars Customizable Card Game (1996) stated that the Executor was over 8 kilometers long, while the Topps Widevision card set released in the same year repeated that the Executor was larger than the five ISDs that accompanied it in The Empire Strikes Back. The novel X-Wing: The Bacta War also mentioned a sister ship, the Lusankya, as being ten times larger than an ISD it was battling. Despite this, the novel also described the Lusankya as 8 kilometers long.\nThe Black Fleet Crisis novel Shield of Lies (1996) contained a reference to one of the Executor's sister ships as an \"Executor-class Star Destroyer.\" The Executor-class would later be reused as the class name of the Executor and its sister ships.\nThe 1998 LucasArts interactive CD-ROM Star Wars: Behind the Magic described the Executor alternately as 8 and 12.8 kilometers."}, {"tag": "p", "text": "In 2004, the Inside the Worlds of Star Wars Trilogy reference book changed the Executor's length to 19 kilometers. It was explained by continuity checker Leland Chee to be more consistent with the films. Later books and reference guides mostly followed this number."}, {"tag": "p", "text": "The official Databank has given various sizes over the years, starting with \"over eight times longer than an ISD,\" to 12.8 kilometers (as a compromise between fan groups), and finally, 19 kilometers. In addition to the Executor's size, its class and its members were retconned to be Executor-class Star Dreadnoughts, with the earlier classifications of Super Star Destroyer and Super-class Star Destroyer being explained as military colloquialisms and used originally for disinformation purposes by the Empire (explained on the Wizards of the Coast website)."}, {"tag": "p", "text": "Some fans criticized this information for only pandering to a group derisively called \"Saxtonites\" (based on the Star Wars author and technical fan site webmaster Curtis Saxton), and some still reject that the earlier 8-kilometer number was erroneous or that the films can be used to justify \"facts\" in the Star Wars universe, despite being classified by Lucas Licensing as the highest canon externally and as part of G-canon internally. The continued use of Super-class Star Destroyer and Super Star Destroyer for these bigger warships, now as colloquialisms instead of nomenclature that describes the ship type, limits any potential continuity errors. The latest ship-centered book, the 2007 edition of Starships of the Galaxy, uses both the colloquial terms as well as the more recent nomenclature, even adding a separate term for SSDs in general, \"star dreadnought,\" regardless of whether they're of the specific Star Dreadnought type."}, {"tag": "p", "text": "In addition to the reclassification of the Executor, there have been many additions to the Super Star Destroyer line, which originally only described the Executor and its class. These include Admiral Giel's flagship seen in the Marvel comics, the Eclipse, the Allegiance, and the Sovereign seen in Star Wars: Dark Empire and its sourcebook. Several types are described in Inside the Worlds of Star Wars Trilogy, from smaller Star Cruisers to bigger battlecruisers and Star Dreadnoughts, like the sixteen-engine Megador featured in the Dark Nest Trilogy, and an early, smaller prototype explored in Dawn of Defiance."}, {"tag": "p", "text": "When the domes on Executor's bridge tower exploded during the Battle of Endor, a crewman said that the bridge shields were down. This could suggest the domes were shield generators (despite one dome being intact), something that was reinforced by the Star Wars Roleplaying Game's sourcebooks. In the February 1983 issue of Cinefex, Richard Edlund of Industrial Light & Magic simply referred to them as \"radar domes,\" similar to real-life domes on warships. Despite this, novels like the X-wing books have used destroying the domes to disable shields as a plot point. To complicate things, The Bacta War also mentioned the SSD Lusankya as having sensor domes. The book Inside the Worlds of the Star Wars Trilogy clarified that these domes were, in fact, sensor domes built with local-area shield emitter vanes."}, {"tag": "p", "text": "In one of the new shots inserted into The Empire Strikes Back 1997 Special Edition, Executor was light gray, in contrast to all other shots of it in the film, where it is bluish-gray. This could be accounted for by different background lighting, as the Executor is seen as both light gray and white in publicity shots."}, {"tag": "p", "text": "Jason Fry in his endnotes admitted that he deliberately kept the exact number of Executor-class Star Dreadnoughts ambiguous, and hoped that the reference to black budgets and intelligence work would cover the in-universe reason behind the ambiguous amount."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}