{"url": "Exegol_landing_team", "categories": ["Category:Canon articles", "Category:Military stubs", "Category:Exegol landing team personnel", "Category:Resistance military units", "Category:Strike teams"], "nodes": [{"tag": "h1", "text": "Exegol landing team"}, {"tag": "p", "text": "During the war between the First Order and the Resistance, the Exegol landing team led by General Finn was given the task of destroying the navigation tower that was capable of making the Sith Eternal's fleet leave the hidden Sith planet of Exegol."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The ground invasion force was transported by the Resistance's troop carrier the Fortitude. They were originally going to land of the surface of Exegol and take out the Sith Eternal's navigation tower so their fleet could not deploy. However, a First Order officer onboard Allegiant General Enric Pryde's Resurgent-class Star Destroyer Steadfast realized the Resistance's plan and informed Admiral Frantis Griss and Pryde. Pryde ordered the navigation signal to come to his ship."}, {"tag": "p", "text": "As the tower shut down, Finn sensed through the Force that the navigation signal was coming from the command ship, and ordered the ground invasion to target the Steadfast. The troop carrier landed on the outside deck of the destroyer, deploying Company 77, mounted on Orbaks. The cavalry charged towards the navigation tower, with General Finn, Jannah, and BB-8 at the front. Commander Rose Tico, Captain Beaumont Kin, and Lieutenant Kaydel Ko Connix lead the infantry behind them with Sidon Ithano. The team succeeded in their mission to take out the tower, but was attacked by Sith troopers. Connix was hit with a laser bolt to the leg, then Tico and Kin came to her aid. The overwhelming attack from Sith TIE fighters, Sith troopers, and Sith Jetpack Troopers killed many Resistance troopers, forcing the remaining infantry and cavalry to retreat back to the troop carrier. BB-8 joined the retreating infantry with Connix and Kin. Tico contacted Finn, urging him and Jannah to leave with the surviving troops, but Finn refused and ordered her to leave with the others. After the troop carrier departed, Finn and Jannah managed to take control of a cannon and use it to target the command deck, causing the Steadfast to plummet down to the surface, which resulted with the Sith fleet to be trapped on Exegol. Finn and Jannah held onto the ship as it became vertical, until they were rescued by Lando Calrissian and Chewbacca aboard the Millennium Falcon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Exegol landing team was created and developed for the 2019 Star Wars film Star Wars: Episode IX The Rise of Skywalker. It was later given its name in the Star Wars: The Rise of Skywalker: The Visual Dictionary that was released on the same day."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}