{"url": "Exocron", "categories": ["Category:Legends articles", "Category:Exocron locations", "Category:Kathol sector planets", "Category:Type I atmosphere planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Exocron"}, {"tag": "p", "text": "Exocron was a planet in the Kathol Outback, hidden in a protostar gas cloud near the Kathol Rift. It was settled by colonists who were opposed to the \"plastic societies\" of the Galactic Republic, and who were searching for a legendary planet called Exo. The colony grew in isolation from the rest of the galaxy, controlled by a technocracy known as the Devisors who forbade space travel. Their rule lasted until 8 ABY when the New Republic corvette FarStar assisted the local population in freeing themselves from the oppressive regime. At some point, the smuggler Jorj Car'das retired on the planet."}, {"tag": "p", "text": "Exocron came to the attention of outside forces in 19 ABY during the Caamas Document Crisis. The smuggler Talon Karrde traveled to the planet in search of Jorj Car'das, and was followed by the pirate Rei'Kas. A battle was fought, and the planet was assisted by the mysterious Aing-Tii monks. The victory allowed Karrde to retrieve vital information that would eventually lead to peace between the New Republic and Imperial Remnant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Exocron was a garden world, covered in forests and mountain ranges. The planet was hidden inside a protostar that threw up a cloak of radiation and sensor-jamming static. Much of the Kathol Outback were unaware of the existence of the planet, and it did not appear on any official starcharts of the region. However, legends persisted of a fabled, hidden world."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Colonization"}, {"tag": "p", "text": "The planet was colonized by the colony ship Exocros Cabal during the Galactic Republic. The Exocros Cabal was part of the The Cabal, a series of expeditions beyond the edges of the Outer Rim Territories funded by Deamos Na-Coth to find the legendary planet, Exo."}, {"tag": "p", "text": "During the Exocros Cabal's journey, the vessel was struck by an uncharted asteroid storm that destroyed much of the bridge and killed the captain. Mutiny broke out on the ship, and the various warring families fought for control of the vessel. Over time, different families took control of the remains of the bridge, and sent the ship in different directions according to their interpretation of Na-Coth's writings."}, {"tag": "p", "text": "Finally, a group of engineers took control of the ship. The Exocros Cabal was pursued by pirates, and the engineers decided that they needed to find a world to settle on. Accidentally, they found a planet hidden by a gas cloud, and established the colony there. They named the planet \"Exocron\" in honor of their vessel and the mythical planet that they had searched for."}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "The early years of the colony were not peaceful as some of the factions from the colony ship wanted to take the ship and continue the search for Exo. The engineers purposefully destroyed the hyperdrive engines of the colony ship to keep the colony together. The colony reverted to an industrial-based technology level, and the engineers, who became known as the Devisors, controlled all advanced technology on the planet."}, {"tag": "p", "text": "Over time, Exocron society developed into a two-tiered caste system, with the Devisors on top, and the rest of the people below. New technology was only given to the people after the Devisors ensured it posed no threat to them or their rule."}, {"tag": "h3", "text": "Under the Devisors"}, {"tag": "p", "text": "The Devisors came to see anything from beyond their planet as evil, and a threat to the stability of the planet. To this end, they devised the Laws of the Devisors, the first of which was \"Travel beyond our home is forbidden\". In spite of this law, the Devisors maintained the secrets of space travel, and denied them to the populace."}, {"tag": "p", "text": "However, the Devisors rule was not unchallenged. The Corsairs who lived in the western canyons openly defied their rule, and an underground resistance operated within the capital, Caballa City. Many believed that the Devisors were denying them their birthright to go into space, and that they maintained their rule through fear and deceit. Although a separate Ruling Council was established, the Devisors had a large amount of influence over their decisions."}, {"tag": "p", "text": "At some point, Exocron became embroiled in internal conflict as the planet was split into several squabbling regimes. The Exocron Airfleet was vital in keeping the government unified and in power."}, {"tag": "h3", "text": "Arrival of the FarStar"}, {"tag": "p", "text": "In 8 ABY, the New Republic CR90 corvette FarStar discovered the planet. Discovering the gaseous cloud that hid the planet, the commander of the FarStar, Captain Kaiya Adrimetrum ordered a probe droid to be sent into the cloud to determine whether it was hiding any forces allied to Moff Kentor Sarne."}, {"tag": "p", "text": "The probe droid was recovered by airships from the Exocron Airfleet, and a retrieval mission sent in by Captain Adrimetrum was intercepted by the sky-dreadnaught Maxion, commanded by Captain Horzao Darr. Darr invited the FarStar's command crew onboard his vessel, and they were taken to Caballa City. During the journey, Corsairs from the western canyons attacked the airship Desaclates which was transporting the probe droid back to Caballa City. Starfighters from the FarStar assisted in the defense of the vessel."}, {"tag": "p", "text": "Arriving at Caballa City, the representatives from the FarStar were viewed as a threat by the Devisors. The Devisors ordered that the crew would remain on the planet for the rest of their lives, and that their ship and technology would be impounded for study, all to maintain the safety of Exocron. Captain Adrimetrum was taken away for questioning, while an archaic, but powerful, tractor beam, locked onto the FarStar in orbit and started to gradually bring it down to the planet."}, {"tag": "p", "text": "Captain Darr, disgusted at the treatment of the New Republic personnel, rescued the remaining members of the delegation, and secreted them away to the home of Eida Sharden, a member of the underground. With her aid, the crew recovered their X-wings, and assaulted the tractor beam generator to free the FarStar. At the same time, the Maxion inserted other members of the FarStar crew into the Ministry of Technology utilizing repulsorlift personal jump packs. The New Republic forces succeeded in rescuing Adrimentrum, and defeating the Devisors."}, {"tag": "p", "text": "With the public discovery that they controlled high-technology in the form of the tractor beam, the Devisors power was broken. The Ruling Council assumed control of Exocron, and Captain Adrimetrum provided data on spaceflight and hyperdrive technology to those who requested it. The planet allied itself with the New Republic, and promised the FarStar a safe port during its search for Moff Sarne."}, {"tag": "h3", "text": "Later threats"}, {"tag": "p", "text": "Around 18 ABY, the Rodian pirate and slaver Rei'Kas began setting up operations close to Exocron. Rei'Kas had long coveted Exocron's wealth, but did not know its location. Exocron's leaders worried about the threat that Rei'Kas posed, knowing that their Combined Air-Space Fleet stood little chance against his forces. However, Jorj Car'das knew that if Rei'Kas was to attack, he could call upon the Aing-Tii, a race of alien mystics who despised slavery. For the Aing-Tii to intervene, though, Rei'Kas's forces had to be close to the Kathol Rift, and Exocron's leaders couldn't just openly invite Rei'Kas to the planet."}, {"tag": "h3", "text": "The Battle of Exocron"}, {"tag": "p", "text": "In 19 ABY, Talon Karrde was traveling through the Outback, hoping to locate Car'das and a copy of the Caamas Document in an effort to prevent a civil war within the New Republic. While on the planet Dayark, Karrde ran afoul of some of Rei'Kas's personnel, and the Rodian swore revenge on the smuggler. One of Rei'Kas's ships followed Karrde's vessel, the Wild Karrde, and discovered the location of the planet."}, {"tag": "p", "text": "Exocron's leaders seized the opportunity, knowing that Rei'Kas would follow with his fleet. It took Exocron nearly eight hours to mobilize its small attack force, including hastily-armed civilian vessels and the Wild Karrde. Admiral Trey David commanded the force from the bridge of the Wild Karrde. Using the Combined Air-Space Fleet as bait, they drew Rei'Kas's fleet in, allowing the Aing-Tii to arrive behind the pirate fleet and destroy it."}, {"tag": "p", "text": "The victory allowed Karrde to contact Car'das to find out if he had a copy of the Caamas Document. Car'das didn't, but had something equally valuable - the identity of the man posing as Grand Admiral Thrawn. Ultimately, the information would lead to the signing of peace accords between the New Republic and Imperial Remnant."}, {"tag": "h2", "text": "Government"}, {"tag": "p", "text": "Exocron was ruled by the Devisors, a technocracy that kept the secrets of high-technology to themselves to maintain their power base. They also forbade all off-world travel. In 8 ABY, their hold on power was broken, and the Ruling Council assumed power. By 19 ABY, the Ruling Council was apparently still in power, although Supreme Admiral Horzao Darr wielded a great deal of power as commander of the Exocron Combined Air-Space Fleet. In addition, the former smuggler Jorj Car'das seemed to be well connected with government, assisting them in dealing with Rei'Kas's pirate fleet."}, {"tag": "h2", "text": "Military forces"}, {"tag": "p", "text": "By 8 ABY, Exocron's main military force was the Exocron Airfleet, based at Caballa City and under the command of the Devisors. With the fall of the Devisors, the Ruling Council began a program of starship construction using data provided by Captain Adrimetrum of the New Republic. The result was the Exocron Combined Air-Space Fleet, although not all of the ships were built by the planet. Some were apparently purchased from other planets, as the Wild Karrde was escorted to the planet by two aging system patrol ships. The Airfleet was still kept active for planetary defense. By 19 ABY, the military was under the command of Supreme Admiral Horzao Darr, with Admiral Trey David as his second in command."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}