{"url": "Ak-rev/Legends", "categories": ["Category:Legends articles", "Category:Desilijic servants", "Category:Guards", "Category:Males", "Category:Max Rebo Band members", "Category:Tatooinians", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Ak-rev"}, {"tag": "p", "text": "Ak-rev was a male Weequay drum master and a bodyguard for Jabba Desilijic Tiure. He was born in the Sriluur's capital city of Al-Campur. While on Sriluur, he studied at the Weequay monastery to their god of thunder, Am-Shak. While he was outside the monastery, Ak-rev often fought in the streets of Al-Campur. While on a trip to the desert world of Tatooine, Ak-rev was hired as a bodyguard by the Hutt crime lord Jabba Desilijic Tiure, after the Hutt witnessed a fight between Ak and one of Jabba's Gamorrean guards. While in Jabba's employ, Ak would play a large set of drums to back up the Max Rebo Band along with a Klatooinian, Umpass-stay. In 4 ABY, he witnessed the death of one of Jabba's slave dancers, the Twi'lek Oola, for insubordination. After the death of Jabba at the Great Pit of Carkoon at the hands of the Princess of Alderaan, Leia Organa Solo, Ak and Umpass set out across the Dune Sea to Mos Eisley. While making their way across the dunes, the pair was attacked by Tusken Raiders, and Ak was beaten to death by the Sand People."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born and orphaned in the capital city of Al-Campur on the Weequay homeworld of Sriluur, Ak-rev was brought into a monastery of Am-Shak, the Weequay god of thunder. The monks of Am-Shak taught Ak-rev hand-to-hand combat and the art of drumming on the thunder drums. After leaving the monastery, Ak-rev entered the violent underworld of Al-Campur as a street fighter. Despite his involvement in gang violence, Ak-rev continued to perform drum ceremonies in honor of Am-Shak and gave a bit of his money to the monastery. The monks of the monastery served as the only solace and the drums the only joy to Ak-rev during his youth."}, {"tag": "p", "text": "Ak-Rev did not trust outlanders and non-Weequays, and while on a visit to Tatooine, Ak had a brawl with Gamorreans. The Gamorreans were in the employment of the Hutt crime lord Jabba Desilijic Tiure's, more commonly know as Jabba the Hutt. Jabba was impressed by Ak-Rev's tenacity, and agreed to hire him as a bodyguard. While the Hutt disgusted Ak-Rev, he agreed, if only because there were so many Weequays in Jabba's Palace that he felt at home again. When Jabba the Hutt heard Ak-rev's passionate drum performance at an Am-Shak ceremony, he offered Ak-rev a position in the Max Rebo Band alongside the Klatooinian Umpass-stay. They would occasionally play backup for the band on huge drums."}, {"tag": "p", "text": "In 4 ABY, Ak and Umpass, along with the rest of the Max Rebo Band, were playing a song to entertain Jabba's quests, when they witnessed the death of one of Jabba's Twi'lek slave dancers, Oola. Oola had refused the Hutt crime lord's advances, and as a result, the Twi'lek was dropped into a large pit underneath Jabba's throne room that housed his pet Rancor midway through the song. Oola was subsequently eaten alive by the large predator."}, {"tag": "p", "text": "Later that night, Jabba captured the Princess of Alderaan and Rebel Alliance hero Leia Organa, who had been disguised as the bounty hunter Boushh, while she was trying to rescue Han Solo, and as a result, Leia was put into slavery under the Hutt. Solo was an ex-smuggler turned rebellion General who was frozen in carbonite a year earlier for failing to repay Jabba for dumping a large amount of spice while on a run for the Hutt. The next day, the last Jedi Knight in the galaxy and rebel commander Luke Skywalker came to Jabba's palace to negotiate the release of Han, Leia, and Solo's Wookiee companion, Chewbacca, who had been brought into Jabba's custody by Leia when she was disguised as Boushh so she could get into the palace, but Skywalker too was captured."}, {"tag": "p", "text": "Ak and Umpass stayed behind at Jabba's palace when the Hutt and several of his denizens went out into the Dune Sea in his sail barge to execute Han, Luke, and Chewbacca at the Great Pit of Carkoon. However, Jabba's prisoners freed themselves with the help of Lando Calrissian, who had been disguised as one of Jabba's guards. The Hutt was killed when Leia choked him with chain he had used to keep the princess imprisoned."}, {"tag": "p", "text": "When news of Jabba's death reached Ak-rev and Umpass-stay, the two set out across the Dune Sea, through Tusken Raider territory, bound for Mos Eisley, a small spaceport town. En route, they were ambushed by a tribe of Sand People whose banthas had been slain by Ak's fellow Weequays in a sacrifice to the Weequays' gods. The Raiders beat Ak-rev to death, returning the favor of sacrifice, although Umpass survived and lived on to serve another Desilijic clan house."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ak-rev was added to the extended musical number in the Special Edition of Return of the Jedi. The drumming done by him and Umpass-stay was derived from the Japanese art of Taiko drumming with the help of San Francisco Taiko Dojo."}, {"tag": "p", "text": "Hasbro released an Ak-rev figure in 2008 including a leg of R7-Z0."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}