{"url": "Expansion_Region", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Expansion Region", "Category:Regions"], "nodes": [{"tag": "h1", "text": "Expansion Region"}, {"tag": "p", "text": "The Expansion Region was a region of the galaxy located between the Inner Rim and the Mid Rim. In addition to the Ghost Nebula sector, which contained the Umbara system, the Expansion Region included the Cvetaen and Sumitra star systems, as well as the planets Aquaris, Kerkoidia, Thustra, and Sibensko."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the worlds of the Expansion Region served as battlegrounds due to the region's location between the Inner Rim and the Mid Rim. The Mud Jumpers of the 224th Division of the Grand Army of the Republic fought Separatist forces on the Expansion Region world of Mimban. They also armed and trained the indigenous Mimbanese Liberation Army, promising them freedom when the Separatist Droid Army was repelled."}, {"tag": "p", "text": "In 20 BBY, the Expansion Region world of Umbara was the site of a prolonged battle between the Grand Army of the Republic and the native Umbarans, who had aligned themselves with the Confederacy of Independent Systems. Numerous clone troopers and Umbaran soldiers were killed during the fighting. The Besalisk Jedi Master Pong Krell commanded the 501st Legion during the battle and proved unpopular with his men. After Krell's treason was revealed, the trooper Dogma executed the fallen Jedi for betraying the Galactic Republic. In the aftermath of the battle, the Republic occupied Umbara."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "During the Imperial Era, much of the Expansion Region fell under the jurisdiction of the Galactic Empire, a new regime that replaced the Republic. Following the theft of Moff Wilhuff Tarkin's personal starship Carrion Spike, an Imperial comms officer calculated that the Expansion Region planets of Aquaris and Thustra were the closest sites to the location of the stolen ship while it was at the location sector-designated as LCC-4-4-7. The same officer also estimated that LCC-4-4-7 was located equidistant to the Sumitra and Cvetaen systems. Vice Admiral Dodd Rancit also theorized that the Imperial facility on the Expansion Region world of Cartao would be the next target of Berch Teller's rebel cell."}, {"tag": "p", "text": "In 10 BBY, Diles Anevi served as the governor of the Expansion Region while Moff Bin Essada governed the Circarpous sector from the administrative world of Gyndine. Essada ordered Imperial forces to strip Mimban of all its resources. That same year, the Mimbanese Liberation Army resisted Imperial forces, who wanted to exploit Mimban for its energy mining resources. Han Solo served as a swamp trooper of the Imperial Army's 224th Imperial Armored Division before deserting with the liberated Wookiee slave Chewbacca to join Tobias Beckett's gang."}, {"tag": "p", "text": "In 0 BBY, the Rebel Alliance intelligence officer Cassian Andor visited the Expansion Region trading post known as the Ring of Kafrene to investigate why Imperial shipments of kyber crystals were being shipped across the galaxy. There, Andor encountered the rebel informant Tivik, who informed him that an Imperial pilot Bodhi Rook had defected with information about a planet-killing superweapon. Andor was forced to kill Tivik after the latter was wounded during a skirmish with stormtroopers."}, {"tag": "p", "text": "Following the destruction of Alderaan and the Battle of Yavin, the Imperial officer Ciena Ree counseled the disillusioned TIE fighter pilot Thane Kyrell to find work somewhere in the Expansion Region and Outer Rim Territories after failing to convince him to return to the Empire. Thane later joined the Rebel Alliance."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "In 28 ABY, the watery planet Sibensko was reputed throughout the New Republic as a crime haven. It had an underwater city that served as the headquarters of the Amaxine warriors, a militia group funded by the First Order, a remnant of the Old Empire. The city was later destroyed during a skirmish which wiped out most of the Amaxine warriors."}, {"tag": "h3", "text": "First Order–Resistance War"}, {"tag": "p", "text": "In 35 ABY, Rey, Finn, Poe Dameron, Chewbacca, C-3PO, and BB-8 traveled to the Forbidden Valley on the planet Pasaana to seek out a Sith wayfinder that could lead them to the planet Exegol. There, they encountered Rebellion hero Lando Calrissian, who helped to locate the Sith assassin Ochi's dagger, which contained information about the Wayfinder, in the Shifting Mires. However, the Resistance team were pursued by the Knights of Ren and First Order forces led by Supreme Leader Kylo Ren, who captured Chewbacca, Ochi's dagger, and the Millennium Falcon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}