{"url": "Aka%27jor-class_shuttle", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Law enforcement vehicles", "Category:MandalMotors products", "Category:Mandalorian starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Aka'jor-class shuttle"}, {"tag": "p", "text": "The Aka'jor-class shuttle, or simply the Mandalorian shuttle, was a model of shuttle used by the New Mandalorians of Mandalore. It was produced by MandalMotors and saw use during the Clone Wars on Mandalore."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Aka'jor-class shuttle, also referred to simply as the Mandalorian shuttle, was a type of shuttle manufactured by MandalMotors during the Clone Wars for the New Mandalorians. The Aka'jor-class was not equipped with a hyperdrive, measured at a length of 17.97 meters, and could reach speeds of 900 kilometers per hour. Although unarmed, several owners modified their shuttles to carry weapons."}, {"tag": "p", "text": "The shuttles had two rotating wings, one on each side, that changed position when landing, and acting as part of the landing gear. The wings were also decorated with Mandalorian designs. The front of the shuttle also had a landing gear leg, and a platform with a ramp that lowered from the rear of the ship for entry and exit. The shuttle could accommodate at least four passengers, and was crewed by at least two pilots."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Aka'jor-class was intended for peaceful transportations between Mandalore and other planets. They were often used to ferry individuals between Mandalore and its moon, Concordia. The Mandalorian Guard also utilized the shuttles to conduct criminal investigations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Developed by MandalMotors for Mandalorians, the Aka'jor-class shuttle, was a type of shuttle that saw use during the Clone Wars by the New Mandalorians. After the bombing of the Memorial Shrine in the capital city of Sundari on Mandalore saw the death of the Death Watch bomber, a Concordian, Duchess Satine Kryze and Jedi Master Obi-Wan Kenobi utilized an Aka'jor-class shuttle to transport the body to Concordia."}, {"tag": "p", "text": "Sometime later, a member of the Mandalorian Guard used an Aka'jor-class to travel to Mandalore after scouting Death Watch movements, and observed that they were preparing for an invasion of Mandalore. The scout reported to Prime Minister Almec of his findings."}, {"tag": "p", "text": "Aka'jor-class shuttles saw continued use during the Clone Wars, with several shuttle present when Senator Padmé Amidala arrived on Sundari during a black market conspiracy, and when Ahsoka Tano arrived to root out the conspiracy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Aka'jor-class shuttle debuted in the twelfth episode of the second season of the animated TV-series, Star Wars: The Clone Wars, The Mandalore Plot, released in 2010. It was identified as the Mandalorian shuttle in the accompanying episode guide, and later named as the Aka'jor-class shuttle in the 2018 canon reference book Star Wars Encyclopedia of Starfighters and Other Vehicles written by Landry Q. Walker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}