{"url": "Aka%27jor-class_shuttle/Legends", "categories": ["Category:Legends articles", "Category:MandalMotors products", "Category:Mandalorian starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Aka'jor-class shuttle"}, {"tag": "p", "text": "The Aka'jor-class shuttle was a shuttle model designed and built by the Mandalorian starship company, MandalMotors. The shuttle was lauded for the efficiency of its engines and the smooth acceleration they provided, contributing to its popularity. Just under eighteen meters in length, the Aka'jor-class shuttle was constructed without weapons, but was easily modified with additional armament by customers interested in owning an assault craft rather than a peaceful transport."}, {"tag": "p", "text": "Though the transport found numerous buyers throughout the galaxy, the Aka'jor-class shuttle found significant use among the pacifistic New Mandalorian faction. The New Mandalorians' leader, Duchess Satine Kryze, made use of an Akajor shuttle to transport herself and the visiting Jedi Master Obi-Wan Kenobi from the New Mandalorians' capital city of Sundari, to Mandalore's moon, Concordia. A member of the New Mandalorian police later utilized an Aka'jor-class shuttle while spying on the renegade Mandalorians group known as the Death Watch, at their secret base on Concordia."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Aka'jor-class shuttle was 17.97 meters in length. Manufactured by the Mandalorian starship corporation, MandalMotors, the shuttle featured twin rotating wings that were held in a horizontal layout while flying, but swung into an upward configuration for landing. This feature was one shared by MandalMotors' Kom'rk-class fighter/transport, but unlike the Kom'rk, the standard Aka'jor-class shuttle was built without any manner of armament. However, the shuttle was receptive to custom modifications, and a number of MandalMotors customers transformed the shuttle into attack craft with aftermarket weaponry. Crewed by a sparse two individuals, including a pilot, from a forward-positioned cockpit the speedy vessel possessed two wing-mounted engines for propulsion, whose efficiency contributed to a praised smoothness of acceleration. At the shuttle's rear, an aft lift was responsible for the boarding of passengers and the loading of cargo."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The unarmed Aka'jor was most prominently a shuttle, in line with its official MandalMotors designation. Capable of entering and exiting a planet's atmosphere, a number of Aka'jor-class shuttles were used by the New Mandalorian faction for transport back and forth between Mandalore and Concordia, one of the Outer Rim world's two moons. Other customers elected to modify their Aka'jor-class shuttles, adding non-standard weaponry to the vehicle, and transforming them into customized assault craft."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Designed by MandalMotors—a prominent Mandalorian starship company and driving force behind the planet Mandalore's economy, headquartered in the planet's capital city of Keldabe—the Aka'jor-class shuttle was put into production at a point in time prior to the start of the pan-galactic Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. A large number of MandalMotors clients purchased Aka'jor-class shuttles, and the Mandalorian vessel soon gained a reputation for its efficient engines and smooth acceleration. Many of these buyers took to customizing their shuttles with aftermarket weaponry, forming modified attack craft from the standard unarmed vehicle."}, {"tag": "p", "text": "A number of standard, unarmed Aka'jor-class shuttles entered into the possession of the pacifist Mandalorian faction calling themselves the New Mandalorians. Several could be found at the docks of the New Mandalorian domed capital, Sundari, in the year 21 BBY, the second year of the Clone Wars. That same year, when the Memorial Shrine at the heart of Sundari was bombed and the perpetrator took his own life, the New Mandalorians' leader, Duchess Satine Kryze traveled with Jedi Master Obi-Wan Kenobi—who was on Mandalore investigating rumors of Mandalorian terrorism—aboard an Aka'jor-class shuttle to return the dead man's body to Mandalore's moon, Concordia, where he was from. There, Kryze and Kenobi discovered the hidden base of the Mandalorian splinter-group, Death Watch. Not long after, a member of the New Mandalorian police force used an Aka'jor-class shuttle while scouting the Death Watch's base in the Concordian beskar mines. Piloting the Aka'jor shuttle back to Sundari from Mandalore's moon, the scout reported his findings on the amassing Death Watch army to the New Mandalorian Prime Minister, Almec."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Aka'jor-class shuttle first appeared in the Star Wars: The Clone Wars television series' second season episode, The Mandalore Plot, which originally aired January 29, 2010. It later appeared in the following episodes, Duchess of Mandalore, Corruption, and The Academy, all of which featured the New Mandalorians. Statistical information on the vehicle was later provided through the Star Wars: The Clone Wars: Incredible Vehicles guide book, published in 2011, which finally gave the shuttle its name."}, {"tag": "p", "text": "The name Aka'jor appears to come from the Mandalorian language of Mando'a, developed by author Karen Traviss, specifically the words aka, meaning \"mission\", and jorir, meaning \"carry\"."}, {"tag": "p", "text": "The shuttle also made a background appearance in the now-closed online game, Star Wars: Clone Wars Adventures. This variant appeared to be equipped with weapons towards the front of the ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}