{"url": "Expeditionary_Library", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Csilla locations", "Category:Libraries"], "nodes": [{"tag": "h1", "text": "Expeditionary Library"}, {"tag": "p", "text": "The Expeditionary Library was a massive underground library located under the ice of the Chiss Ascendancy's capital planet of Csilla. The library contained the documents and works produced from the Chiss Expansionary Defense Force's exploration of the Unknown Regions, with most of it translated into Basic and in written form to prevent losing any data to ice storms. In 28 ABY, a Galactic Alliance–Imperial Remnant group led by Jedi Master Luke Skywalker visited the Chiss library in hopes of finding the location of the sentient world Zonama Sekot, and succeeded in pinpointing the position of the planet to the Klasse Ephemora system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Expeditionary Library was located in a remote sector on the planet Csilla, the capital of the Chiss Ascendancy in the Unknown Regions, and was some distance away from the Chiss city Ac'siel. Situated deep underneath the ice that covered Csilla, the library was in a secure installation and featured a pair of large, sturdy doors that permitted access to the facility. Taking up the size of a docking bay, the Expeditionary Library was rectangular in shape and had four levels of walkways—accessed by steep stairwells—that adorned the walls. Yellow lights hung from the ceiling of the library, supported by cables, and the main floor was partitioned by a multitude of shelves arranged in rows, with narrow aisles between them. A large square table made of snowwood was located in the center of the Expeditionary Library, and it had room enough to seat at least twenty people. The air in the library was still, warm, and dry."}, {"tag": "p", "text": "The Expeditionary Library housed the mission reports, contact histories, anthropological essays, and xenobiology tracts from the Chiss Expansionary Defense Force's exploration of the Unknown Regions of the galaxy, all stored in book form, as data stored by technological means could be destroyed by ice storms; thus, the library did not have any holoscreens. Because all of the sources in the library were in written form, certain methods helped when searching for a subject, and the contents of the library were scrupulously cataloged. The majority of the text available in the library was translated into Basic, though some of it remained in Cheunh, the language of the Chiss species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Expeditionary Library was in existence by the year 28 ABY, during the Yuuzhan Vong War, when the extra-galactic Yuuzhan Vong invaded the galaxy. By that time, the Chiss Expansionary Defense Force's exploration of the Unknown Regions had been going on for centuries. As a result, the library contained millions, possibly billions, of pages of content. That year, a Galactic Alliance–Imperial Remnant team led by Jedi Master Luke Skywalker visited Csilla in its search for the hyperspace-traveling, sentient planet Zonama Sekot."}, {"tag": "p", "text": "The representatives of the Ruling Families of the Chiss and the Chiss Expansionary Defense Force granted the team access to the Expeditionary Library for two days and provided a guide, Tris. The members of the team became part of the few non-Chiss to have ever entered the Expeditionary Library. In searching for Zonama Sekot, they followed a trail of references to the wandering planet in the reports from the Chiss Expansionary Defense Force and endured a skirmish with Chiss elements who disapproved of the changes being made due to outsider influence. With the help of young Csilla resident Wynssa Fel, the team sought to find the current position of the living planet by searching for systems that had gained planets in the previous sixty years using an algorithm Fel created on a holopad. When that failed, a change to searching for moon acquisitions gave the team the location of Zonama Sekot: the Klasse Ephemora system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Expeditionary Library appeared in Sean Williams and Shane Dix's Force Heretic II: Refugee, a 2003 novel released as part of The New Jedi Order series. The library was later mentioned in two more books from 2003 that were part of the series, Force Heretic III: Reunion and The Unifying Force, with the former written by Williams and Dix, and the latter by James Luceno."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}