{"url": "Expeditionary_Battle_Planetoid", "categories": ["Category:Legends articles", "Category:Death Stars"], "nodes": [{"tag": "h1", "text": "Expeditionary Battle Planetoid"}, {"tag": "p", "text": "The Expeditionary Battle Planetoid was a theoretical spherical battlestation conceptualized by Raith Sienar in 29 BBY. It was one of the precursors to the finalized Death Stars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Expeditionary Battle Planetoid was the first true precursor to the designs that would eventually give birth to the Death Star project. The design was similar to the Death Star, although it differed in a number of key ways, most notably in that it lacked a superlaser (and was therefore designed for space combat, not the annihilation of planets) and the design included two smaller spheres, attached to the poles of the main sphere (which was around 90-100 kilometers wide)."}, {"tag": "p", "text": "Equipped with massive turbolasers, it was powered by an inner plasma implosion core over a kilometer wide. Sienar planned to fuel it using large ice asteroids that were common in the Outer Rim systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around the time of the Second Battle of Zonama Sekot, Raith Sienar presented the plans for the Battle Planetoid to Republic Outland Regions Security Force Commander Wilhuff Tarkin, who was enamored of the idea. Tarkin turned around and showed the plans to then-Supreme Chancellor Palpatine, taking credit for them as well. Sienar, however, had since abandoned the idea of developing the weapon himself, and appeared indifferent to the apparent backstabbing."}, {"tag": "p", "text": "In 29 BBY, the design was still considered impossible, as it required particular advances in hypermatter technology in order to become fully feasible. Presumably, the issues were solved by 22 BBY (and were the cause of Republic Sienar Systems' grant to the Ministry of Science for hypermatter research)."}, {"tag": "p", "text": "With the formation of the Confederacy of Independent Systems in the months before the outbreak of the Clone Wars, Palpatine—as Darth Sidious—gave the plans to his Sith apprentice and Confederate leader, Count Dooku. The Geonosians took the designs and from them developed their Ultimate Weapon, transforming the Battle Planetoid with a functional superlaser into a planet-killing superweapon."}, {"tag": "p", "text": "After the Declaration of a New Order in 19 BBY, the Ultimate Weapon's design was refined into that of the Death Star, and construction on the station began and, ostensibly as a reward for \"his\" design, Tarkin became the Moff overseeing the project."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}