{"url": "Extraction_on_Raxus", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles needing illustration", "Category:Battles in the Tion Hegemony", "Category:Events during the Imperial Era", "Category:Missions of Clone Force 99"], "nodes": [{"tag": "h1", "text": "Extraction on Raxus"}, {"tag": "p", "text": "The extraction on Raxus was a mission that the former clone commandos of the Bad Batch were sent on shortly after the formation of the Galactic Empire. They were tasked with rescuing Avi Singh, a former senator of the Confederacy of Independent Systems, from Imperial custody on Raxus Secundus after he had refused to endorse the Imperial occupation to his people. Singh's protocol droid GS-8 contacted the information broker Cid as per her master's instructions, and Cid sent the so-called Bad Batch, some of whom were uneasy about taking the job due to their past as Galactic Republic soldiers. Despite the misgivings, the group successfully infiltrated Singh's residence in Raxulon and extracted him from Captain Bragg and her clone stormtroopers. After his rescue, Singh was somewhat reluctant to leave Raxus, but was persuaded that he could help his people better if he remained out of Imperial custody, allowing the Batch to transport him to Ord Mantell."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Clone Wars was a three-year conflict between the Galactic Republic and the breakaway Confederacy of Independent Systems. In 19 BBY, the war ended abruptly when the Republic's Supreme Chancellor, Sheev Palpatine, revealed himself as the Dark Lord of the Sith and had the Jedi who had been leading the Grand Army of the Republic executed by their own clone troopers through Order 66, a secret command which activated mind-controlling inhibitor chips implanted in the clones. Palpatine, as Darth Sidious, secretly controlled the Separatists as well, and since they had served their purpose, he sent his new Sith apprentice, Darth Vader, to kill the Executive Separatist Council and deactivate the Separatist Droid Army. With the reorganization of the Republic into the Galactic Empire, Palpatine's plot to rule the galaxy had succeeded."}, {"tag": "p", "text": "As their military leader General Grievous and Head of State Count Dooku were also dead, the only leaders the Separatists had left were the members of the Separatist Senate, headquartered on the Confederacy's capital planet Raxus Secundus. An Imperial occupation force headed by Captain Bragg was sent to the planet to enforce the new government's will. Many Separatist Senators were arrested for refusing to cooperate, and Bragg strong-armed Raxus' own representative, Senator Avi Singh, into capitulating to the Empire's will, arranging a public address in front of the Separatist Senate Building where she intended Singh to make a speech about his new allegiance. Singh, however, was truly dedicated to his people, and found himself unable to go through with it, choosing to instead denounce the Empire. Bragg had Singh arrested, but he had arranged a contingency plan: following his pre-arranged instructions, Singh's protocol droid GS-8 contacted the information broker Cid to hire mercenaries for a rescue mission."}, {"tag": "p", "text": "Shortly after the end of the war, Cid, who had also worked as an informant for the Jedi, met Clone Force 99, a former clone commando squad who had defected from the Empire days after its formation because they were among the rare clones immune to their inhibitor chips. The so-called \"Bad Batch\" found themselves working for Cid as mercenaries in the aftermath, but quickly accrued a large debt to her after failing to retrieve the head of a tactical droid on Corellia, in addition to various expenses they incurred over the course of several jobs."}, {"tag": "p", "text": "After the squad returned to Ord Mantell following an incident with bounty hunters who had been attempting to kidnap Omega, a young clone who had joined the Batch during their flight from Kamino, Cid told them about the job on Raxus. They were hesitant to go because Raxus would be crawling with Imperial troops, and Echo in particular vehemently disliked the Separatists after an unpleasant experience as a Techno Union prisoner. However, Cid held the debt they owed her over them as inducement for them to go, giving Hunter a data disk with the intel on the job. Wanting to keep Omega out of the line of fire due to the bounty hunters chasing her, Hunter ordered her to stay with Cid and not leave the parlor, who promised to look after her because of the credits on the line, although Omega was very upset. On the way to Raxus, the squad discussed the job. Echo was still very against the mission. Hunter had been uneasy because he was used to fighting Separatists, not allying with them, but resigned himself to the task. Tech and Wrecker were both less bothered by the political implications."}, {"tag": "h2", "text": "The extraction"}, {"tag": "p", "text": "Upon the Havoc Marauder's arrival at Raxus, the shuttle encountered two V-wing starfighters, being informed that the airspace above capital city Raxulon was restricted. However, the clearance codes Singh and GS-8 had provided allowed the Batch and their starship through, with the pilots welcoming them to Raxus. The Marauder landed in a forested area outside the city, where they had been given coordinates to meet with their employer. The commandos were surprised to be met by GS-8, who introduced herself and explained they were rescuing her master. She led the squad into the city."}, {"tag": "p", "text": "When the group arrived at Singh's residence, where the senator was being held, Tech identified the surveillance system and patrolling clones inside and outside the building. Echo was suspicious that they were being led into a trap, but GS-8 said such a thing was against her programming. Hunter told Echo and Wrecker to behave, stating they had to take out the compound's security system. They snuck up to the building, staying out of sight of one of the cameras, and Hunter ambushed and knocked out a clone guard from behind. After Tech noted two guards on a door, Hunter pushed GS-8 out of concealment to act as a diversion, although the droid protested that she did not have any military skills. When the guards saw her, one shouted that this was a restricted area, and GS-8 asked him who he was addressing as this was her master's residence, suggesting he needed to leave immediately. GS-8 fled back when the two troopers followed her, but they were quickly knocked out by the Batch."}, {"tag": "p", "text": "The group entered the compound via a gate which GS-8 unlocked. Sneaking through a passage, they encountered a door, avoiding another guard patrol as they approached it. Tech quickly hacked into the security system through the door controls, and opened the door after he confirmed his success. Hunter ordered Echo and Wrecker to clear the upper levels while he and Tech took the ground floor, telling GS-8 she was sticking with him. The Batch used stun blasts to take out the \"reg\" clones on guard duty inside the house. Hunter and Tech approached a door guarded by two troopers, and Tech detected another four in the adjacent corridor. Saying he would handle them, Hunter told Tech to loop around with Omega, but Tech reminded him that she was not on the mission. Deciding she was getting the hang of this kind of thing, GS-8 ventured into the hallway despite Hunter and Tech's whispered protests, telling the guards she was lost and asking them to direct her to the nearest egress. The clones aimed their blasters at her, but Hunter and Tech rolled an Electro Magnetic Pulse grenade along the floor, using it to knock out the enemy troopers by shorting out their armor systems."}, {"tag": "p", "text": "As Hunter approached the door to the cellar, it opened to reveal another trooper, whom Hunter attacked before he could shoot. Hunter slammed the other clone's head into a display stand, breaking a vase, before slamming him into the wall and letting go. The unconscious trooper fell into another plinth before falling to the floor, knocking loose another vase which GS-8 caught before it could hit the floor. Asking the commandos to be careful, GS-8 said the vase had been gifted to Singh for his years of service and was highly valuable, leading Hunter to make a sarcastic remark before they continued on."}, {"tag": "p", "text": "Singh was being held in the cellar, where Bragg lectured him about disobeying the Empire while helping herself to his wine. The captain had an interrogator droid brought in, escorted by two clones, as she talked, and Singh remarked that her draconian tactics would not work on him. However, before the droid could be used on the senator, a smoke bomb was tossed down the stairs. As the smoke filled the room, Bragg and the two troopers were quickly stunned, although the captain managed to activate her comlink before she was knocked unconscious. The interrogation droid was also shot before Hunter, Tech and GS-8 emerged from the smoke. Tech removed the senator's binders while GS-8 assured him that she had saved his precious vase, leading Hunter to interrupt her to point out that they needed to leave. Checking his datapad, Tech reported that an alert had been triggered, with Imperial reinforcements, including several All Terrain Tactical Enforcers, rushing to the scene. The group rushed out of the cellar."}, {"tag": "p", "text": "Regrouping with Echo and Wrecker, the Batch and their clients headed to a tower at the top of the compound. Apprising the situation, Hunter decided that they would seize control of one of the AT-TEs. Wrecker fired a line onto the tank near its main cannon, and the gunner only had enough time to react in surprise before he was stunned by Tech, who was sliding down the line. Joined by Echo, Tech opened the hatch above the driver's compartment and stunned him, before dropping in two more EMP grenades to knock out the troopers inside. The two then opened up the tank's main hatch. GS-8 was impressed, but as Singh was expressing hesitation over boarding the vehicle, Wrecker grabbed him and slid down the line to enter the tank, dropping him inside. Hunter followed with GS-8, who had retrieved the senator's hat."}, {"tag": "p", "text": "As Tech got the AT-TE moving, Wrecker tossed out the unconscious clones with a remark that they would feel the aftereffects of their encounter with the Batch in the morning. Bragg, who had recovered from her stunning, saw the hijacked vehicle lurching away from the tower and gave orders for it to be pinned down. An Imperial tank located and fired upon the Batch's vehicle, knocking out the rear axle stabilizer and immobilizing it. Tech, reporting the damage, said it would have to be recalibrated manually, and Hunter ordered him to get on it while he and Wrecker held off Imperial troops. The Batch exited the tank, Tech and Echo working on repairs while Hunter and Wrecker charged at the enemy tank. A squad of Imperial clones approached while the two ran under the AT-TE's legs, but were quickly taken out by a barrage of stun shots as Hunter and Wrecker grabbed on to the enemy walker. Climbing up the front of the tank, Wrecker used his strength to push the main cannon off-target, leading the gunner's next shot to strike a building before he was stunned by Hunter. A trooper inside raised a hatch to see what was going on, but Wrecker grabbed the hatch and slammed it down to knock the clone unconscious before Hunter tossed him an EMP grenade, which he tossed into the tank. With the vehicle neutralized, Hunter and Wrecker were forced to flee when it was destroyed by mass-driver cannon fire from a third tank."}, {"tag": "p", "text": "As more Imperial clones approached, backed up by a tank, Hunter and Wrecker took cover behind the downed vehicle while participating in a firefight. The third tank began climbing atop the downed AT-TE, and Hunter asked Tech how he was doing. Tech said he needed more time, but he and Echo were cornered by three troopers who ordered them to drop their weapons. Watching from inside the tank, Singh took the vase and threw it at one of the clones, which knocked him out and distracted the other two, giving Tech and Echo an opening to knock them out. Singh remarked to GS-8 that he had never much cared for the vase. Tech reported that the repairs were complete, and Hunter and Wrecker returned to the hijacked AT-TE as the third tank finished climbing over the remains of the second one. The Batch quickly re-boarded the tank as Tech began driving the damaged vehicle away from the scene. Singh instructed Tech to turn down an alleyway, and when Tech noted they would be caught in a chokepoint, the senator said they would have to trust him. At a nod from Hunter, Tech followed Singh's directions."}, {"tag": "p", "text": "The gunner on the pursuing tank fired several shots which struck nearby buildings, before reporting that the hijacked AT-TE was turning into a dead end. As more walkers approached the scene, Singh instructed Tech to move their tank into position next to a wall, explaining there was an underground passage on the other side. After Tech had parked the tank as directed, Singh opened the hatch and asked the Batch to blast a hole through the wall. Wrecker eagerly planted an explosive, and they resealed the hatch briefly to shield themselves from the blast before exiting the tank into the tunnel. An approaching Imperial walker opened fire on the abandoned AT-TE as the group evacuated into the tunnel, Singh leading the way. Wrecker planted another bomb to seal the tunnel behind them. Imperial troopers inspected the walker and found it empty, with one reporting the discovery to Captain Bragg."}, {"tag": "p", "text": "The group exited Raxulon and returned to the Havoc Marauder. However, as he was about to board the ship, Singh was hesitant to leave, not wishing to abandon his people. However, GS-8 and Echo, who had changed his mind about the senator, both reminded Singh that it was better to live to fight another day instead of being captured, and he agreed to leave the planet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "When the Batch returned to Ord Mantell with Singh and GS-8, they found a crowd at Cid's Parlor: Omega and Cid had discovered that the girl's natural strategic talents made her unbeatable at dejarik, and they had made a large amount of money through bets on her playing games. Hunter was concerned about the attention Omega had drawn due to the people after her, but Cid informed him that the girl had earned enough to pay off the Batch's debts. Omega explained that she had wanted to make herself useful. After Cid took Singh and his droid into her office to discuss payment, Hunter decided to put Omega's skills to the test and challenged her to a match, promising to not leave her behind again if she won. Omega continued to accompany the Batch on later missions, including delivering weapons to the Free Ryloth Movement on Ryloth's nearest moon."}, {"tag": "p", "text": "When the squad was later asked to carry out a rescue on Ryloth itself, Tech found the amount of Imperial soldiers present there to be comparable to Raxus, even though Ryloth had been part of the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}