{"url": "Eye_of_Mesra/Legends", "categories": ["Category:Legends articles", "Category:Toys and merchandise"], "nodes": [{"tag": "h1", "text": "Eye of Mesra"}, {"tag": "p", "text": "The Eye of Mesra was a small, round fortune-telling toy. An old desert tradition, they were commonly used by children of Mos Espa, Tatooine."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A fortune-telling toy known as the Eye of Mesra was small and round in appearance, and resembled an eye. The exterior was colored a light shade of pink, while the interior section was colored blue with a black colored pupil decal. When the user asked the Eye of Mesra a question, it would respond with one of many types of answers, including a positive, negative, or noncommittal response. In this way, the Eye of Mesra was similar to the Quay novelty toy, another type of fortune-telling device."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Eye of Mesra had its roots as an old desert tradition. Although they were commonly used by children in the Tatooine city of Mos Espa, they could also be found on many other worlds of the galaxy, such as Naboo. However, it did share a namesake with Tatooine's Great Mesra Plateau."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eye of Mesra received entries in a number of source books, including the Star Wars: Episode I Insider's Guide (1999), Star Wars: Episode I The Visual Dictionary (1999), and The Complete Star Wars Encyclopedia (2008)."}, {"tag": "p", "text": "Their first appearance was as an item in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The item acted as a sort of mini-game, allowing players to ask the the Eye a question in return for a random answer, much in the same way as a real world Magic 8-Ball. In fact, the game's directory tree files refer to the Eyes of Mesra text Strings Table File as \"magic_eight_ball.\""}, {"tag": "p", "text": "Following the release of Publish 25's New Game Enhancements on November 15, 2005, the Eye of Mesra was modified to actually allow the player to type a question into a prompt window displayed by the item. The Eye of Mesra was later featured in a December 1, 2015 StarWars.com news post, titled Let's Go Play Ball: Toys and Games from a Galaxy Far, Far Away by Tim Veekhoven."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}