{"url": "Eye_of_Webbish_Bog", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Cleanup", "Category:Individuals of unidentified species", "Category:Individuals of unspecified gender", "Category:Mustafar residents"], "nodes": [{"tag": "h1", "text": "Eye of Webbish Bog"}, {"tag": "p", "text": "The Eye of Webbish Bog was a spider-like being that existed on the planet Mustafar. It was locked in symbiosis with a blind giant, living within a lake near the Corvax Fen. It encountered the Sith Lord Darth Vader during the Galactic Civil War when Vader was punished by Emperor Palpatine for his past failures. While Vader tried to survive and fight against Ochi of Bestoon, a Sith assassin sent by his Sith Master, Vader awakened the Eye through the Force and went to meet him, an encounter in which the Eye attacked Vader with questions and inquiries about his past before giving him a Sith wayfinder to find the hidden Sith world of Exegol."}, {"tag": "p", "text": "Years after Vader's death, the Eye of Webbish Bog met with Supreme Leader Kylo Ren from the First Order, who was Vader's grandson, during the war between the First Order and the Resistance. After slaughtering the Alazmec of Winsit with his forces, Ren encountered the Eye, who claimed to have been tasked with guardianship of Vader's wayfinder by Vader himself, and directed the Supreme Leader to the artifact's location after considering him worthy of having earned the wayfinder for destroying its protectors."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Encounter with Darth Vader"}, {"tag": "p", "text": "Sometime after the Duel on Cloud City, the Eye of the Webbish Bog was accidentally awakened by the Sith Lord Darth Vader on Mustafar as Vader was fighting against Ochi of Bestoon, a Sith assassin send by Darth Sidious, his Sith Master, to kill Vader for his past failures. Upon trying to approach Ochi to discover the Emperor's plans, Vader was called up by the Eye of Webbish Bog through the Force, who demanded to know who was shouting before asking who was demanding answers so insistently. Ochi felt the Eye's presence and noted that Vader had used the Force despite that the Emperor had forbidden him from using it to survive, but Vader stated that the Eye was the one calling for him from a cave. Ochi tried to prevent Vader from reaching the Eye by blocking the cave's entrance with rocks, but Vader was able to make it into the cave. The Eye then told Vader from afar that he didn't know which questions he wanted to ask nor understand the answers he would receive, proceeding to mock him by arrogantly saying that the Sith's fury couldn't solve the riddles of the Eye of Webbish Bog."}, {"tag": "p", "text": "While Ochi left Darth Vader for dead at the cave as no one was known from ever returning of meeting the Eye of Webbish Bog, some lava fleas attacked Vader as the Eye asked him if he was a fierce warrior or why he thought he could sweep away all his enemies so easily, to which Vader killed a huge lava flea and asked in turn why the Eye had called him up, leading the Eye to question him back if he really thought he was calling him or choosing him for a special destiny instead of many other Force-sensitives with the same abilities as him, triggering Vader with flashbacks of his former Jedi Master Obi-Wan Kenobi, Emperor Palpatine and his son Luke Skywalker to reminder him of his destiny as the Chosen One. The Eye asked Vader that had he been given the option to choose if he would have chosen to be chosen or to make his own choice while it sic a roggwart against the Sith Lord, who easily killed him with a skin piece from a lava flea. Furious, Vader demanded the Eye to know if it served his Sith Master, desiring to know what Sidious was secretly building and where, threatening the Eye to tell him or he would choose to destroy it, opening up the chamber where the Eye was resting above the blind giant it was locked in symbiosis with."}, {"tag": "p", "text": "The Eye of Webbish Bog laughed at Vader and asked him what he needed or wanted to know and if he knew or remembered what he wanted and needed, triggering Vader with flashbacks of when he saved Darth Sidious' life, when Sidious told him that Luke Skywalker was the offspring of Anakin Skywalker and when he offered Luke at Cloud City to join and aid him on overthrowing the Emperor. The Eye then requested Vader to search through his feelings to discover. Furious with the Eye, Vader punched hard a rock platform from which he was grabbing, bringing it down and sending him into the lava pool where the Eye and the giant were resting, where Vader warned the Eye that he had enough with its lies and tricks and demanded it to give him what he came for. Once more, the Eye asked him the same questions but used the Force to change the giant's appearance into that of Anakin Skywalker, Luke Skywalker and Darth Sidious, asking Vader if anyone would care about what he chooses if he was chosen, to which Vader walked towards the Eye and proclaimed that he had made his decision and that the Eye would care for it. The Eye then laughed and made the giant emerge from the lava pool to give Vader a Sith wayfinder while musing that while Vader had come for answers, it had given him questions and would leave him with one more, which consisted whether he believed he had passed the test it had given to him or if he failed it. Eventually, Vader left the cave."}, {"tag": "h3", "text": "Encounter with Kylo Ren"}, {"tag": "p", "text": "In 35 ABY, during the war between the First Order and the Resistance, Supreme Leader Kylo Ren, Vader's grandson, came to Mustafar in search of his grandfather's Sith wayfinder to track down the long-deceased Emperor Palpatine, who had announced his imminent return from the dead. Upon arriving on the fiery planet, Ren engaged the Sith cultists known as the Alazmec of Winsit in a fight along with a squad of his stormtroopers before meeting the Eye of Webbish Bog, who emerged along with the blind giant from a lake near Corvax Fen. The Eye presented itself to Kylo Ren and told him that he had what he sought. Ren tried to perform a mind trick on the Eye so it would give him the wayfinder immediately, but the Eye laughed at Ren and informed him that it was immune to Force trick, noting that Vader tasked it to guard the Sith artifact."}, {"tag": "p", "text": "The Eye of Webbish Bog then warned Kylo Ren that Mustafar burned deception and that he would encounter his true self had he continued with the path he had established for himself, given that he had been after the wayfinder for a while. Noting that Ren was silently growing impatient, the Eye stated that in accordance to Vader's wishes, he had earned his wayfinder by defeating its protectors, leading the blind giant to raise its enormous hand from the water and point out toward a small island in the lake. As Ren examined the wayfinder, the Eye informed Ren that the wayfinder would guide him through the Unknown Regions to the hidden Sith world of Exegol, where Palpatine was hiding. After staring at the wayfinder for a while, an startled Ren turned around only to see that the Eye of Webbish Bog and the blind giant were gone, slipped back beneath the lake's surface so like if nothing lived within it at all."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Eye of Webbish Bog appeared in Rae Carson's Star Wars: The Rise of Skywalker: Expanded Edition, the novelization of the 2019 film Star Wars: Episode IX The Rise of Skywalker, the third and final installment of the Star Wars sequel trilogy."}, {"tag": "p", "text": "According to creature and special make-up effects creative supervisor Neal Scanlan, creature concept designer Jake Lunt Davies designed the Eye early on the development of The Rise of Skywalker. Director J.J. Abrams approved the design and requested its inclusion in the film, leading the special effects team to build the character, which was taken to be filmed on location in a lake at Black Park, near Pinewood Studios. Though the scene was filmed, it was cut due to runtime concerns. In an interview with the website Collider, Scanlan claimed that the scene was too lengthy an explanation for information that could be explained more concisely. Scanlan nevertheless stated that he was interested in revisiting the Eye of Webbish Bog's design for further Star Wars projects, such as the television series The Mandalorian."}, {"tag": "p", "text": "In the concept art, the Eye of Webbish Bog was referred to as the \"Oracle.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}