{"url": "FC-20_speeder_bike/Legends", "categories": ["Category:Legends articles", "Category:Razalon products", "Category:Sith vehicles", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "FC-20 speeder bike"}, {"tag": "p", "text": "The FC-20 speeder bike was a small, one-being speeder bike produced by Razalon prior to the Battle of Naboo. Darth Maul owned a custom FC-20, dubbed the Sith speeder, though actually named Bloodfin."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Razalon FC-20 speeder bike consisted of a semi-circular body powered by a repulsorlift and piloted with a simple steering handle. The strange, curved body gave the FC-20 a low center of gravity, affording its rider a dramatically improved cornering ability. The FC-20 was most useful for those who did not wish to be seen, since the compact design presented a small target profile. The FC-20 was not armed, though for assassins like Darth Maul, who wielded a deadly double-bladed lightsaber, this hardly mattered."}, {"tag": "p", "text": "As with many other swoopbikes, the FC-20 was a small repulsorlift vehicle with a powerful rear thrust engine. Its engine systems were designed to provide the rider with fast acceleration and allowed it to reach maximum open-ground speed within seconds. Its design gave it an extremely low center of gravity, improved its cornering ability greatly and presented enemies with a very small target."}, {"tag": "p", "text": "The FC-20 speeder also lacked shields or sensors, though an auto-brake feature brought the bike to a safe halt if the rider released the steering handles. Though popular, the FC-20 model was considered to be slower than other speeder bikes of the time, with a maximum speed of 180 kilometers per hour. The speeder bike also had a limited range before a recharge was required. It had a small repulsorlift engine with heavy baffling which made it a very quiet vehicle. That and its low riding height made it a popular vehicle for use in scouting."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 32 BBY, while seeking out Padmé Amidala on Tatooine, Darth Maul used the Bloodfin to combat Master Qui-Gon Jinn. Having jumped from the speeder, it presumably halted due to the auto-brake feature and was used by Maul to return to his starship Scimitar. Following Maul's presumed death at the Battle of Naboo at the hands of Qui-Gon's Padawan Obi-Wan Kenobi, the Bloodfin was confiscated by Galactic Republic authorities along with his starship though they both later mysteriously disappeared forever. In 2 ABY, a cloned Darth Maul once again used such a speeder during Jabba Desilijic Tiure's demolition games. It is unknown as to whether it was the Bloodfin or another of this make."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}