{"url": "FC-1_flechette_launcher/Legends", "categories": ["Category:Legends articles", "Category:Flechette launchers", "Category:Golan Arms products"], "nodes": [{"tag": "h1", "text": "FC-1 flechette launcher"}, {"tag": "p", "text": "The FC-1 flechette launcher was an antipersonnel and antivehicle flechette launcher produced by Golan Arms."}, {"tag": "p", "text": "The FC-1 fired a spray of metal flechettes effective at close range against both soft targets and armored targets, depending on what canister it fired off. The weapon featured four canister tubes, each able to hold a single canister, with two reserve tubes. Tapping the firing stud allowed the user to select which tube to fire while aiming down the range finder allowed them to select a detonation point. The ideal way for the canister to detonate ten meters in front of the intended target, achieving maximum dispersal of the flechettes, though in an emergency the canister can launch without a point set. This meant the canister would detonate on impact, dramatically reducing the effectiveness of the flechettes."}, {"tag": "p", "text": "The FC-1 could fire two standard types of canisters: anti-personnel and anti-vehicle. The anti-personnel canister was a small globe which upon detonation spread hundreds of razor-sharp flechettes over a ten-meter area, potentially eliminating an entire squad in one shot. The anti-vehicle canister was an eleven-centimeter-long missile which released much longer flechettes capable of penetrating up to ten centimeters of durasteel, making them ideal for taking out lightly armored repulsorcraft such as snowspeeders. These canisters also featured a shaped charge which concentrated the flechettes over an area five meters in diameter."}, {"tag": "p", "text": "The Corporate Sector Authority, Imperial Remnant's stormtroopers and the unknown mercenary faction that supplemented them widely used this weapon. The Galactic Empire equipped swamptroopers with them. Kyle Katarn used the FC-1 extensively in his career, as did Han Solo during his escape from the hijacked Lady of Mindor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia identifies this weapon as the FC11 flechette launcher."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}