{"url": "FN-3181", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:FN Corps members", "Category:Males"], "nodes": [{"tag": "h1", "text": "FN-3181"}, {"tag": "p", "text": "FN-3181 was a human male stormtrooper who served the First Order. In the year 34 ABY, he was deployed to the planet Jakku as part of a First Order attack on the village of Tuanul in an effort to obtain part of a map showing the location of vanished Jedi Master Luke Skywalker."}, {"tag": "p", "text": "After the stormtroopers killed or captured the village's residents, Kylo Ren, the leader of the Knights of Ren, arrived and executed villager Lor San Tekka. This prompted the Resistance pilot Poe Dameron to try and attack Ren, who used the Force to freeze Dameron. FN-3181 and another trooper then dragged Dameron to Ren and searched the prisoner, before carrying him aboard an Atmospheric Assault Lander to be taken away."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Attack on Jakku"}, {"tag": "p", "text": "FN-3181 was a human male who served in the FN Corps, a stormtrooper unit in the First Order's military during its conflict with the New Republic–backed Resistance. In the year 34 ABY, he was was one of eighty troopers deployed from the Resurgent-class Star Destroyer Finalizer to the planet Jakku in four Atmospheric Assault Landers."}, {"tag": "p", "text": "The soldiers were led by Captain Phasma and landed at night\noutside the village of Tuanul, which they had orders to attack in order to obtain part of a map that led to the vanished Jedi Master Luke Skywalker. The village's occupants fought back against FN-3181 and his comrades but were quickly overwhelmed, with those not killed being captured and rounded up into the village's center."}, {"tag": "h3", "text": "Capturing Poe Dameron"}, {"tag": "p", "text": "The Force-sensitive leader of the Knights of Ren, Kylo Ren, then arrived in the village in his Upsilon-class command shuttle, and village resident Lor San Tekka, who had owned the map piece but was no longer in possession of it, was brought before him. The two briefly exchanged words before Ren killed the villager."}, {"tag": "p", "text": "The Resistance pilot Poe Dameron, who had been in the village to meet with San Tekka and had received the map piece, witnessed the man's death from his hiding place and opened fire on Ren in anger. Ren froze both the blaster bolt and Dameron in place using the Force, after which FN-3181 and another trooper ran up to the pilot and grabbed him, each taking an arm and dragging Dameron before Ren."}, {"tag": "p", "text": "Ren had FN-3181 search Dameron, while the other trooper scanned him with a personal scanner. After they found nothing on the pilot, the pair and another trooper escorted Dameron to one of the Atmospheric Assault Landers so that he could be taken back to the Finalizer. However, Dameron no longer had the map piece, as he had given it to his astromech droid, BB-8. The droid escaped from Tuanul and eventually delivered it to the Resistance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When FN-3181 searched Poe Dameron, he did so with thuggish delight, smacking the pilot instead of patting him down. When the trooper found nothing, he was disappointed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "FN-3181 wore standard First Order stormtrooper armor and carried an F-11D blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "FN-3181 first appeared in the 2015 sequel trilogy film, Star Wars: Episode VII The Force Awakens. The character was portrayed by Michael Giacchino, a long-time musical collaborator of the film's director, J.J. Abrams. Giacchino has provided the musical score for several of Abrams' other works, as well as the film Rogue One: A Star Wars Story. FN-3181 is not referred to by name in the film itself but is identified in the credits."}, {"tag": "p", "text": "In the novelization of The Force Awakens, written by Alan Dean Foster, FN-3181's actions are slightly altered. After the trooper searches Poe Dameron, the pilot sarcastically compliments him and winks, prompting FN-3181 to kick his legs out from under him."}, {"tag": "p", "text": "In 2018, Giacchino voiced a First Order stormtrooper in the film Ralph Breaks the Internet and later identified the trooper as FN-3181 on Twitter. In the film, FN-3181 and several other First Order stormtroopers discover the heroine Vanellope Von Schweetz in the Oh My Disney website. As Von Schweetz is not allowed on the site, they begin to chase her, but Von Schweetz touches FN-3181 with a video link and sends him to BuzzzTube, causing him to yell the Wilhelm scream. Von Schweetz then hides in a room containing all of the Disney Princesses in order to escape the other stormtroopers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}