{"url": "FX-7_medical_assistant_droid/Legends", "categories": ["Category:Legends articles", "Category:FX-series medical assistant droid models"], "nodes": [{"tag": "h1", "text": "FX-7 medical assistant droid"}, {"tag": "p", "text": "The FX-7 medical assistant droid was a medical droid manufactured by Medtech Industries as part of the FX-series of surgical assistants and nursing droids. Typically, an FX-7 droid cost 3,500 credits. After the FX-7's manufacturing ended, it was only available as used by the time of the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The FX-7 model was a tall, cylindrical unit roughly symmetrical on all sides. It was equipped with a wide array of sophisticated appendages. Twenty retractable manipulator arms were the norm, but because medical needs varied from system to system, Medtech specifically designed the arms to be modular. Its main manipulator arm, which could extend up to one meter, was located near the upper half of the body, featuring a removable grasper able to be replaced with specific tools. The droid's cap-like head, which could rotate 360 degrees, featured a cluster of sophisticated medical sensors and diagnostic equipment. Its main body contained a medicine/anesthesia dispensing hose and a control board manipulator. The standard FX-7 lacked a droid language vocoder, but was equipped with an expansion slot allowing for the addition of one. In lieu of vocal communication, the FX-7 had readout screens and a scomp link for direct access to medical computers or other droids. Medtech's conceptual engineers did not consider mobility to be an important factor of the FX-7's design, intending the droid to be placed at a specific medical station. However, an optional repulsorcart, also manufactured by Medtech, allowed the droid to be carried from place to place."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The FX-7s proved to be highly effective droids—so much so that Medtech did not receive a single complaint during the entire production run—though newer, far superior droids such as the 2-1B surgical droid and the MD-series medical specialist droid largely made the FX units obsolete by at least 3 ABY. Medtech ultimately retired the line, though during the Galactic Civil War, hundreds of FX-7 droids could still be found in the Expansion Region and Outer Rim Territories."}, {"tag": "p", "text": "FX-7 droids proved particularly useful to the credit-strapped Alliance to Restore the Republic. By the time of Medtech's demise sometime prior to 3 ABY, the Rebellion had secured several warehouses full of surplus FX models and had acquired others through the black market."}, {"tag": "p", "text": "An FX-7 unit was employed at Echo Base on Hoth, where it worked alongside a 2-1B droid. Noa Briqualon also owned an FX-7 droid, which he kept on his starship. Many medical assistants were also owned by the Xuchpra and Zaltin bacta conglomerates on Thyferra, as they made superior bacta tank operators."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}