{"url": "FX-7/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic droids", "Category:FX-series medical assistant droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "FX-7"}, {"tag": "p", "text": "FX-7 (or FX7), also known as Fixit, was a FX-7 medical assistant droid in service to the Alliance to Restore the Republic around the time of the Battle of Hoth."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "FX-7 was stationed in the Rebels secret Echo Base on the ice planet of Hoth. He assisted both Human and droid medics in the Echo Base medical lab. The droids ability to use its twenty retractable manipulator arms simultaneously proved useful to an understaffed medical bay. After the loss of Yavin Base, the Alliance used any outmoded equipment they could find. This droid was certainly classed as outmoded but proved invaluable for its sophisticated medical, diagnostic and procedural programming. Although this droid was capable of speech, its speech synthesizer card was missing."}, {"tag": "p", "text": "FX-7 assisted 2-1B on Hoth after Luke Skywalker was attacked by a wampa. The droids built up a good rapport with one another, and had worked together for more than a year. Despite this, 2-1B would often state his superiority over his medical assistant, due to his egotistical droid personality."}, {"tag": "p", "text": "FX-7 and 2-1B escaped Hoth aboard the GR-75 medium transport Bright Hope, the last transport to leave the planet. After the bounty hunters 4-LOM and Zuckuss rescued the passengers of the Bright Hope, including the two medical droids, FX-7 was reassigned to the EF76 Nebulon-B escort frigate Redemption."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "FX-7's first appearance in the vintage 3 and 3/4 inch Kenner line came in 1980. Released on the new Empire cards, FX-7 is a unique figure in the original line. Consisting of a gray tubular body, a head that can be spun 360 degrees and can be extended upwards by an inch in height. Underneath the head is a rigid white arm terminating in a claw appendage, this arm is mounted on a spinning ring allowing it to be spun 360 degrees around the body. The main part of the body has eight white arms that can be opened out away from the body. Although these limbs have no joints, they can be slightly articulated at the elbow and shoulder. There is a major variation with the FX-7 figure in that two different head molds exist. One head being smaller with differently situated detail than the other. Another shorter FX-7 can be found on card, this figure is simply missing its glued on base that sometimes broke off during production. This shorter FX-7 is not classed as a true variation but merely a production mistake. FX-7 ran for 5 years through the Empire, Jedi and Tri-logo line. The next FX-7 figure to be released came in the Power Of The Jedi line in 2000-2002. This new figure offers a far more realistic look and greater attention to detail that the vintage toy. The addition of twice the number of articulated limbs of the vintage figure, jointed at the elbow and shoulder, add much more detail and capture a close likeness of the original production prop."}, {"tag": "p", "text": "In Of Possible Futures: The Tale of Zuckuss and 4-LOM, author M. Shayne Bell mistakenly and inexplicably varies between referring to FX-7 first as \"Effour-Seven,\" and then calling the droid \"Effex-Seven\" once, the only time in the story the droid is correctly named, before again returning to calling him \"Effour-Seven,\" all within the course of several paragraphs."}, {"tag": "p", "text": "Star Wars Insider made use of FX-7's status as assistant to 2-1B in the latter's short-lived \"advice column,\" Dear 2-1B. To counter the brash ego of the humanoid droid, the magazine's editors \"brought in\" FX-7 to answer reader mail in Star Wars Insider 55."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}