{"url": "Faa/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Creatures of Naboo", "Category:Creatures of unspecified diet", "Category:Non-sentient species", "Category:Scalefish", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Faa"}, {"tag": "p", "text": "The faa, or faynaa, as they were known to the Gungan species, were fast-moving, non-sentient predatory scalefish native to the oceans and swamps of the Mid Rim planet Naboo. They were considered dangerous and would attack virtually anything with little provocation."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Faa were fast-moving, carnivorous scalefish of medium size that were native to the planet Naboo's oceans and swamps. They attacked with little provocation and were considered quite dangerous. The typical faa had a tall, narrow body that was stiff and well-armored. They ranged in color from red to orange and had a large orange-and-white tail fin that flapped to move the fish through the water column."}, {"tag": "p", "text": "The species' thin frames allowed faa to inhabit thin crevices in underwater rocks, from which they could catch prey that hid in the crags. The deep swamp was also where faa preferred to reproduce, producing up to twelve offspring at a time."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Faa traveled in schools and could usually be found only in deep waters. They were especially prominent around Otoh Gunga, an underwater city of the Gungan species located beneath Lake Paonga, as faa were attracted by its bright lights. Out in the swamps, however, a school of faa—which could include up to thirty fish— could be extremely dangerous for unwitting creatures."}, {"tag": "p", "text": "Faa feasted on a variety of prey, including mee; gorgs; nunas; nyorks; bowlumps; galoomps; geejaws; ollopoms; pom-hoppers; scurriers; shiros and shiro-traps; skettos; hohokums; and yobshrimp. Faa schools even attacked Gungans if hungry or provoked but would disperse if responded to with loud noises. Another tactic Gungans employed was to remain motionless in the water column, in the chance that the school would pass them by. One predator of the faa was the dianoga."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Faa, given the name faynaa by the Gungans, were present in the waters of the planet Naboo as early as 32 BBY. Jedi Master Qui-Gon Jinn; his Padawan, Obi-Wan Kenobi; and the Gungan Jar Jar Binks encountered some faa as they swam to Otoh Gunga to meet with its representatives during the Trade Federation's Invasion of Naboo. Shortly after the invasion, faa were transported to Naboo's moon Ohma-D'un as part of Gungan colonization efforts there."}, {"tag": "h2", "text": "Faa in the galaxy"}, {"tag": "p", "text": "Around 20 BBY, faa, along with mee, ray, and laa, were present in a holding tank aboard the exploration vessel Titavian IV. The ship belonged to the Intergalactic Zoological Society, whose mission was to gather and catalog specimens from across the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The faa, along with other musically-named scalefish, such as the doo, laa, mee, ray, see, and tee, made their first appearance in the 1999 prequel trilogy film Star Wars: Episode I The Phantom Menace. They later appeared in associated materials such as Sea Creatures Battle Bags, where it was previously known as a \"skittle sea creature\", and the video game Star Wars Episode I: The Gungan Frontier, in which their name was first revealed. Faa were soon after mentioned in the 2000 Ryder Windham young readers book Episode I Adventures 10: Festival of Warriors, in material with regards to aquatic life on Naboo in the 2001 Terryl Whitlatch illustrated book The Wildlife of Star Wars: A Field Guide, in the video game Star Wars Galaxies, and in the 2004 comic book Republic 69."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}