{"url": "Faalo%27s_cadences", "categories": ["Category:Legends articles", "Category:Lightsaber combat"], "nodes": [{"tag": "h1", "text": "Faalo's cadences"}, {"tag": "p", "text": "Faalo's cadences were a series of lightsaber training techniques developed by the famed Jedi Master, Vo'ren Faalo. It involved manipulating durasteel ball bearings atop wax candles."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "In each of Vo'ren Faalo's cadences, the primary practice is to stand in a circle of candles with the ball bearings and attempt to strike the ball bearings without hitting the candles. As the duelist proceeds through each of the cadences, the number of candles would be incrementally increased until the fifth, where the duelist will have achieved such a state of mastery that the candles are unnecessary, as the duelist will simply know when he has performed the sequence correctly."}, {"tag": "p", "text": "First Cadence"}, {"tag": "p", "text": "The first cadence uses nineteen candles spaced at ten degree intervals in a semi-circle in front of the duelist. The duelist would then strike each ball bearing, attempting to avoid striking the candles below, developing the ability to do so and honing the duelists sensory awareness and body control. This exercise required 190 ball bearings, and would be repeated until all the bearings were \"used up\". It takes approximately one hour to complete."}, {"tag": "p", "text": "Second Cadence"}, {"tag": "p", "text": "The second cadence uses seventy-two candles set a five degree intervals in a full circle around the duelist. Like the first cadence, the goal was to strike each ball bearing without contacting the candles. However, the duelist had to do so without turning to face each candle, further honing the duelist's body control and spatial awareness. 2701 ball bearings were required for the exercise repeats, and the cadence would take approximately two hours to complete."}, {"tag": "p", "text": "Third Cadence"}, {"tag": "p", "text": "The third cadence uses 180 candles set up at two degree intervals in a full circle. The goal of this exercise was to strike every fifth ball bearing without turning, preparing the duelist for irregular attack patterns from all sides, and honing his control of his body and sensory awareness. 16290 ball bearings were required, and the full cadence would take approximately three hours to complete."}, {"tag": "p", "text": "Fourth Cadence"}, {"tag": "p", "text": "The fourth cadence called for 360 candles at one degree intervals. In a departure from the previous regiments, this exercise called for no ball bearings, as the candles were the targets. The objective was to strike each of the candles, but do so in a sequence determined by a complex mathematical formula. Rather than develop a duelist's physical skills, this cadence developed composure and taught quick thinking amid the chaos of battle. This exercise took approximately three hours to complete."}, {"tag": "p", "text": "Fifth Cadence"}, {"tag": "p", "text": "This cadence was not a teaching exercise, the goal was to test one's self. Relying on the Force, the duelist would telekinetically manipulate the lightsaber, performing complex sequences with the blade as a test of the physical, mental and sensory control and precision. This final exercise took approximately three hours to complete."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}