{"url": "Faazah", "categories": ["Category:Canon articles", "Category:Arms dealers", "Category:Crime lords", "Category:Males", "Category:Smugglers", "Category:Sugi"], "nodes": [{"tag": "h1", "text": "Faazah"}, {"tag": "p", "text": "Faazah was a Sugi crime lord and smuggler based on the planet Murkhana during the Imperial Era. He was a one-time ally of the Sith Lord Darth Vader, who eliminated his Black Sun predecessor. As a crime lord, Faazah maintained a large harem, had numerous progeny, and had a large complement of bodyguards and battle droids."}, {"tag": "p", "text": "In 14 BBY, Faazah helped smuggle fuel cells which fell into the hands of the insurgent Berch Teller and his followers, who subsequently stole Moff Wilhuff Tarkin's personal corvette, Carrion Spike. Darth Vader and Tarkin later forced Faazah to hand over his personal starship Parsec Predator so that they could pursue Teller through space. As punishment for keeping them waiting, Vader force choked Faazah, killing him. The Imperials then slaughtered Faazah's underlings."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Sugi crime lord Faazah lived on Murkhana during the Imperial Era. Following the Clone Wars, Faazah struck a deal with Darth Vader to kill his predecessor and convince Black Sun to abandon Murkhana for \"safer realms.\" This won Lord Vader Faazah's respect. As a crime lord, Faazah had numerous wives and children. He also had a large retinue of Sugi guards and several repurposed battle droids. Faazah also owned a starship called the Parsec Predator."}, {"tag": "p", "text": "In 14 BBY, Faazah entered into a deal with a Crymorah syndicate lieutenant to import a shipment of custom fuel cells. This deal was brokered by a human information broker from Lantillies named Knotts, who was an associate of the former Republic Intelligence officer–turned insurgent leader Berch Teller. These fuel cells were part of Teller and his followers' plot to steal Moff Wilhuff Tarkin's personal corvette, Carrion Spike, to wage an insurgent campaign against the Galactic Empire."}, {"tag": "p", "text": "Following the theft of the Carrion Spike, Lord Vader and Moff Tarkin visited Faazah's throne room. Faazah's guards led them into the throne room. The crime lord told the Sith Lord that the only reason he allowed him to enter his abode was to thank him for killing his rival. When Vader remarked that Faazah was as insolent as his predecessor, Faazah boasted he had the upper hand. When Vader disagreed, Faazah quipped that the two would triumph over his numerous followers and demanded to know why they wanted to commandeer the Parsec Predator in order to pursue the thieves who had stolen the Carrion Spike."}, {"tag": "p", "text": "Tarkin then acknowledged they were outnumbered and suggested that Faazah do as Lord Vader asked. Lord Vader then introduced Faazah to Moff Tarkin, governor of Greater Seswenna. Though Faazah acknowledged his guests were high-ranking Imperials, he joked about doing the galaxy a favor by eliminating them. When Tarkin suggested that there were always alternatives to using brute force, Faazah responded that he was unwilling to part with his starship. Tarkin then drew a portable holoprojector and contacted Sergeant Crest, who informed Lord Vader that he and his men had seized Faazah's weapon's warehouse."}, {"tag": "p", "text": "Faazah was unwilling to trade his warehouse for his starship until Tarkin revealed that his men had also rounded up Faazah's wives and offspring, adding that he was attached to them. Unwilling to risk the lives of his family, Faazah reluctantly surrendered the Parsec Predator to the two Imperials. Tarkin then demanded that Faazah provide them with the necessary launch codes and that he order his underlings to evacuate the landing field. When Vader ordered Sergeant Crest to transport Faazah's family to the landing field, the Sugi pleaded for the Imperials to spare his family. Tarkin reassured him that they \"would survive you.\""}, {"tag": "p", "text": "After Sergeant Crest obtained possession of the Parsec Predator and the ship's launch codes, Lord Vader exacted revenge on the crime lord for keeping them waiting. Lord Vader killed Faazah by Force choking him, crushing his windpipe. Imperial stormtroopers then stormed the crime lord's headquarters, catching Sugi's underlings by surprise with flash grenades and blasters. Vader then personally wiped out Faazah's Sugi followers and battle droids with his lightsaber. Using the Parsec Predator, Vader and Tarkin pursued the stolen Carrion Spike. Though they managed to track down the insurgents to Galidraan Station, Faazah's ship was disabled by an ion cannon from the Carrion Spike."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Faazah was a male Sugi who spoke heavily accented Galactic Basic Standard. He was a crime lord who specialized in smuggling and arms trafficking. Faazah regarded Darth Vader as an ally for killing his Black Sun rival. However, he was also willing to deal with insurgent elements such as the information broker Knotts, who was part of Berch Teller's rebel cell. Faazah helped the insurgents steal Tarkin's corvette Carrion Spike by providing them with the fuel cells needed to keep the ship going."}, {"tag": "p", "text": "Lord Vader regarded Faazah as insolent as his predecessor. Faazah believed in numerical superiority but underestimated the ruthlessness and bold cunning of Lord Vader and Moff Tarkin. Vader killed Faazah after the latter outlived his usefulness to the Sith Lord."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Faazah appeared in James Luceno's 2014 canon novel Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}