{"url": "Factory_District", "categories": ["Category:Legends articles", "Category:Coruscant districts"], "nodes": [{"tag": "h1", "text": "Factory District"}, {"tag": "p", "text": "The Factory District—or as it was later known, the Feral City—was a district on Coruscant, situated in the Antipodes, the exact opposite side of the planet from Imperial City. It was said to be the most dangerous place on the planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Once a thriving industrial center many centuries before the onset of the Clone Wars, the development of industry on nearby worlds like Metellos and Brentaal meant that work could be completed cheaper off-planet. Abandoning the facilities in the district, it became a haven for criminals and subterranean creatures. It was even rumored that there were bands of feral droids that patrolled the Factory District."}, {"tag": "p", "text": "The rather small buildings, no taller than fifty stories, fell into disrepair, as did the roadways and other fragments of the infrastructure. Because of the remoteness of the area, Falleen Black Sun Vigo Prince Xizor established a secret laboratory where his scientists and technicians could work to perfect the technology for a human replica droid. Although Xizor hired a band of mercenaries known as the Salissians to eliminate the feral droids, the droids proved too vicious to be controlled. The droids later attacked the Vigo's lab, destroying all research and personnel."}, {"tag": "p", "text": "During their search for 10-4TO, Den Dhur and I-5YQ discovered a massive reactor leak taking place beneath the Factory District; they decided the leak had caused the droids to become murderous. While the Sullustan and his droid escaped the area, along with former Jedi Jax Pavan the reactor overloaded and detonated, creating an eighty meter crater and reducing a considerable amount of the Factory District to radioactive rubble."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It is also referred to in the narration as \"the Antipodes,\" the real-world term for the diametric opposite of a point on the globe. However, as its use here was capitalized, and the antipodes of the Factory District was Imperial City itself, it may be that this signifier held particular significance in this case."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}