{"url": "Faddaff_Davenspon", "categories": ["Category:Canon articles", "Category:Deymasollians", "Category:Females", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Faddaff Davenspon"}, {"tag": "p", "text": "Faddaff Davenspon was a Deymasollian female  with an innate feel for starship systems who worked as an outlaw tech-for-hire. In 35 ABY, she spent time in the bar of the Spice Runners' Den in Kijimi City on the planet Kijimi shortly before it was destroyed by the First Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Faddaff Davespon was a Deymasollian female, born in around 265 BBY, who worked as a outlaw tech-for-hire and for many winters lived on the planet Kijimi. In 35 ABY, she stood with two hooded figures in the bar of the Spice Runners' Den in Kijimi City when the Spice Runner Zorii Bliss led a group of Resistance agents through the room. Not long after the encounter, the First Order, who had been occupying Kijimi, pulled all their forces from the world and destroyed it."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Faddaff Davenspon had an innate feel for starship systems and was willing to cut a deal to get her hands on technology that intrigued or excited her. This was especially true of starship designs that she had not previously encountered in her long and well traveled life. Like all Deymasollian, Davenspon had a keen memory and would never have settled for a routine job. She had yellow skin, black eyes and a white fur coat that had grown in thicker over her many winters on Kijimi. The Deymasollian's delicate fingers were well scaled for fine technology work."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Davenspon wore a black outfit including boots and gloves and had three grease tanks attached to her chest. She used a pair of gray goggles with yellow lenses."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Faddaff Davenspon was created for the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was identified simultaneously in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo, and a card in the 2019 Topps Star Wars: The Rise of Skywalker Series 1 trading card set by The Topps Company, Inc.. Concept art of Davenspon titled \"Wizard 16\" was created for the film by creature concept designer and senior sculptor Louis Wiltshire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}