{"url": "Faeto", "categories": ["Category:Legends articles", "Category:Bith", "Category:Criminals", "Category:Males", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Faeto"}, {"tag": "p", "text": "Bosshand Faeto was a male Bith criminal who lived on Tatooine during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time following the Battle of Yavin, Bosshand Faeto was a minor criminal leader in Mos Eisley. He ruled his gang and expanded his activities with the ambition to rule Tatooine one day. In the meanwhile, he was smart enough to avoid conflict with Jabba the Hutt. Faeto usually spent a lot of time in Lady Valarian's Lucky Despot cantina."}, {"tag": "p", "text": "Circa 1 ABY, an individual known as Untas owned Faeto money. Although the amount was ridiculously low, 100 credits, Faeto hired a bounty hunter to kill Untas in order to preserve his reputation. The bounty hunter Boba Fett heard about the death mark and advised an acquainted bounty hunter to accept the mission. Bosshand Faeto met the bounty hunter in the Lucky Despot and they agreed with the terms of the contract. Faeto recommended the bounty hunter to first ask a woman known as Taibela about Untas. After Taibela, the bounty hunter met her fiancé Oldksam, and later Untas' partner Sleash. The drug addict Sleash agreed with giving Untas' location, in the White Thranta Shipping offices, and the bounty hunter eventually killed Untas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Faeto was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Faeto was added to the game as part of the \"Legacy Quest\" with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}