{"url": "Fakir_sector/Legends", "categories": ["Category:Legends articles", "Category:Colonies sectors", "Category:Confederacy of Independent Systems sectors", "Category:Fakir sector", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors"], "nodes": [{"tag": "h1", "text": "Fakir sector"}, {"tag": "p", "text": "The Fakir sector was in the Bakchou arm of the Colonies."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The sector included several hundred planets capable of sustaining life. Fifty of those planets developed sentient life, but only ten of species achieved space-travel technology. Human settlers colonized around 150 other planets in the sector."}, {"tag": "p", "text": "Planets in the sector included Abonshee, Alabash, Iyuta, Lorimax, Mycroft, Palanhi, Vakkar, Doneer'so, Flankers, Halowan, Sinkar, and Fakir itself. The Sarnikken Asteroid Belt and the asteroid Yirt-4138-Grek-12 were also in the sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Sector was controlled by the Corporate Alliance."}, {"tag": "p", "text": "When the Galactic Empire came to power after the Clone Wars it established government headquarters on Doneer'so, and placed it under the rule of Moff Lorin The sector was considered safe and stable, which led to most of the Sector Fleet's forces being from the sector following the Battle of Yavin in 0 ABY. While these forces fought the Rebel Alliance in the Outer Rim, the Rebels took the opportunity and inserted the Reekeene's Roughnecks Irregulars to destabilize the sector. After several months, the Imperial Governor-General had to request an entire battle fleet as reinforcements."}, {"tag": "p", "text": "Around 2 ABY, it was also the operation area of Ho'Din saboteur Yansan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Star Wars: Rebellion incorrectly places Ando, Delaya, Berchest, Carida, Ralltiir, Obroa-skai, and Bimmisaari in the Fakir sector. Ando is in the Dufilvian sector; Delaya is in the Alderaan sector; Berchest is in the Anthos sector; Carida is in the Colonies; Ralltiir is in the Darpa sector; Bimmisaari is in the Halla sector; Obroa-skai is in the Borderland Regions of the Inner Rim. Additionally, the game mistakenly places the sector in the Galactic Core."}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia incorrectly places both the Hijoian Docks and the Ichalin Station in the Fakir sector instead of Hijoian Space."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}