{"url": "Falco_Sang", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Assassins", "Category:Bounty hunters", "Category:Humans", "Category:Jedi hunters", "Category:Males"], "nodes": [{"tag": "h1", "text": "Falco Sang"}, {"tag": "p", "text": "Falco Sang was a Human male bounty hunter who specialized in assassinations."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A Bounty on a Jedi"}, {"tag": "p", "text": "Sang and his droid Izee broke into Imperial Prison ISO-L8, using a passing asteroid as cover for their starship in search of information on Jedi fugitive Dass Jennir. The pair had been hired to enact revenge on Jennir and his crew for killing Dezono Qua. They killed Jennir's captured crewmate Janks before downloading Imperial information on their target. Falco and Izee then narrowly escaped security and Darth Vader, who was onboard at the time, successfully evacuating the station."}, {"tag": "p", "text": "The Imperial information drew the pair to the desert planet of Prine, where they discovered the missing starship of Dezono Qua. Noticing footprints heading away from the ship, Izee calculated them to be fifteen days old. Sang told Izee to follow them as he hopped onto a speeder bike."}, {"tag": "p", "text": "However, Jennir sensed their presence with the Force and had his own droid, H2 sweep away their tracks as they continued. Sang and Izee eventually reached a dead end. Removing his mask, Sang decided they would rest for the night and split up the next morning. During the search, Izee discovered tracks made during the night by a group of pirates. Sang speculated that Jennir and his female companion would be with the caravan in an attempt to find civilization. Sang then asked Izee to pull up a topographical map of the region, which he used to plan an ambush."}, {"tag": "p", "text": "Sang and Izee set up position ahead of the caravan, but was surpised by a spontaneous commotion that began to take place. Jennir had mounted a rescue attempt for Chankeli, who had been captured by the pirates. Due to a poor position on the low ground, however, Sang could not discern what was going on, noting to Izee to remember to always take the high ground, if avaliable. Sang later shot a pirate aiming at Jennir to Izee's surprise. Sang remarked that nobody but he was to kill the Jedi."}, {"tag": "p", "text": "When the fighting died down, Jennir was about to release the chained Ember Chankeli and her new friend Maddie when Sang took a shot at the barge, causing an explosion and Chankeli to fall off, suspended her by her chained leg. When Jennir tried to help her, Sang took another shot, narrowly missing target's head. Jennir decided to flee with H2 and Maddie and return for Chankeli as Sang sped towards them. With Maddie fleeing on Jennir's mount, Sang gained ground on his primary target. However, Jennir scored a clean shot on the bounty hunter's speeder, sending Sang into the air. Still, the skilled assassin recovered in mid-air and landed firmly with dual blaster pistols in hand. As he glanced forward, however, Jennir had already disappeared into the mountains."}, {"tag": "h3", "text": "Confronting Jennir"}, {"tag": "p", "text": "Sang let the surviving pirates go but kept Chankeli as a captive. She said she was surprised at his act of mercy, but he remarked that he was not a monster, just a professional. She argued that they might come back, as he made them leave the barges behind. He stated that if that happened, then he would kill them. She wondered why he had kept her while she let the others go and tried seducing him. However, he retorted that it was her footprints matched those of Jennir's companion, and as such would be used as bait. Chankeli tried to reason with her captor, telling him that she held no allegiance to the Jedi and that her lies were what got them stuck on the planet to begin with. She suggested that in exchange for her freedom and the bounty, she would lure Jennir back. Sang asked how she knew he wouldn't betray her in the end, and Chankeli replied that as he had just explained, he was a professional. The bounty hunter then reached into Chankeli's shirt and pulled out a blaster, telling her that as a professional, he was sure to guard against being shot in the back. Sang then gagged her and and tied her to a post, awaiting Jennir's. As a safeguard, Sang had Izee lock a sniper on the back of her chest in the event she attempted to escape or warn his prey."}, {"tag": "p", "text": "Sang lay in waiting underneath one of the barges. Jennir's figure later approached to rescue his companion, and Sang managed to score a direct hit. However, as the cloak and hat fell to the ground, he discovered it to be H2. The real Jennir then surprised Sang from behind, pulling him out from underneath the barge and disarming him. Jennir anticipated that Sang would not risk such a far shot at night, but the bounty hunter revealed that he had waited for another reason; to see Jennir, a Jedi, die. Jennier then slammed his hunter against the barge. As the bounty hunter revealed the reason for his pursuit, Jennir told H2 to free Chankeli. He also explained that he had used H2's security channels and the Imperial records on Qua's ship to track them across the galaxy. As Sang finished his story, he revealed he had already killed Janks, and had now kill Jennir's \"girlfriend\" as well. Giving the signal, Izee fired a round directly into H2, penetrating its chassis and straight into Chankeli. As Jennir crouched over the woman and attempted to heal her, Sang instructed to Izee to fire a second shot, this time at the Jedi. As the bolt approached, however, Jennir drew his lightsaber and effortlessly reflected the shot without looking back into Izee, destroying it. With Jennir distracted, Sang managed to scape. As he arrived at his speeder, panting, he felt remorse for his destroyed droid."}, {"tag": "h3", "text": "Vader's Jedi Hunter"}, {"tag": "p", "text": "Sang returned to the ships to find the area being patrolled by Stormtroopers. Letting out a faint curse, Sang was jolted when a reply came from behind. Darth Vader, recognizing him as the intruder who had killed the now non-interrogative Janks, lifted him into the air and began choking, remarking that he would have ample time to reveal everything he knew about Jennir."}, {"tag": "p", "text": "Vader then imprisoned him within a research facility on Coruscant, and subjected to a harsh obstacle course where he had to dodge blaster fire from battle droids. Eventually, Sang deduced they were only using stinger blasters and decided not to bother dodging or even returning fire, and attempted to escape twice. Vader later ordered to replace the stinger blasters with live blasters, although ordered only to shoot to wound. Upon finding this out, Sang ended up shot in the foot and required a repulsorlift to move about. The next day, he angrily confronted Vader over this and accused him of trying to have him killed. However, Vader responded by telekinetically lifting him and then throwing him, stating that Sang would have been dead far earlier if that was what he intended, and that he would kill Sang in person should he prove himself useless to either himself or the Empire. He eventually witnessed the transmission of the Venator-class Star Destroyer Tenacious's dereliction of duty, and decided that obedience to Vader is not universal."}, {"tag": "p", "text": "At some point afterwards, a new strategy was implemented under Gregg's suggestion: Deliberately placing Gregg without protection from Sang, yet at the same time reprogramming the entire prison facility to lock down should Gregg be killed, ensuring that Sang would be trapped in the facility. Sang was eventually convinced to aid Vader in tracking down Jennir after being reassured that Vader will not interfere with his bounty. Sang, in an attempt to impress Vader per Gregg's suggestion, fought him shortly after Vader delivered Sang's ship from the impound. Sang and Gregg later ended up fixing the ship in the aftermath, due to the engines only running on 80% of power. After Jennir was discovered on the Colonies world of Kestavel, Sang accompanied Vader over to the Venator-class Star Destroyer Hound, also using his own ship to bring Vader to the Star Destroyer. Upon boarding, he also yelled at some Imperial officers who dismissively referred to him as \"Vader's pet.\""}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "His reputation put him in a league with the infamous Boba Fett, as it was said that Fett was someone one wanted if one wanted someone captured. Sang was the one if one wanted someone dead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}