{"url": "Fallanassi_Powers", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Fallanassi powers"], "nodes": [{"tag": "h1", "text": "Fallanassi Powers"}, {"tag": "p", "text": "Fallanassi Powers were Force powers employed by adepts of the White Current in order to perform their defensive illusions and techniques."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Doppelgänger"}, {"tag": "p", "text": "This technique allows the Fallanassi to create an advanced illusion of themselves that moves, acts, sounds, and behaves like them. Unlike normal Illusions a Fallanassi has a special connection with her doppelgänger. She is able to see what the doppelgänger sees, can hear what the doppelgänger hears, and even speak through its mouth. She can also pick things up and use \"the Force\" to move it, kind of like telekinesis."}, {"tag": "h3", "text": "Illusion"}, {"tag": "p", "text": "Used to create non-detailed images, like holos, to hide things and people or trick others into believing they are seeing something that is not real."}, {"tag": "h4", "text": "Master illusion"}, {"tag": "p", "text": "The Fallanassi use this ability to create improved illusions to trick, or distract those who perceive them. This skill has often provoked fatal mistakes by those who don't realize the illusion is not real."}, {"tag": "h3", "text": "Immersion"}, {"tag": "p", "text": "This skill causes the current to well up and render a Fallanassi undetectable. This allows her to move around without being seen, heard, or other wise sensed by organic, non-organic, or Force-based means."}, {"tag": "h4", "text": "Immerse another"}, {"tag": "p", "text": "This allows them to make someone or something else completely disappear or be immersed into the White Current."}, {"tag": "h4", "text": "Master immersion"}, {"tag": "p", "text": "This ability is used to immerse a Fallanassi, another person, or even an object into the Current so all are undetectable. Thus following the same principles and allowances of the singular immersion skill, the extra object could be anything from a ship to a planet."}, {"tag": "h4", "text": "Meditation of immersion"}, {"tag": "p", "text": "This technique involves the stilling of one's physical and mental state to a profound level, thus allowing nearly direct contact with the White Current. While in this state, some Fallanassi have achieved the ability to become invisible and even project images around them that have a vivid clarity to them."}, {"tag": "h3", "text": "Scribing"}, {"tag": "p", "text": "Using the White Current to inscribe words on objects for another Fallanassi to read later is a very useful skill. The scribing never fades away, can only be seen and read by Fallanassi methods and can only be erased by those same methods."}, {"tag": "h3", "text": "Sense scribing"}, {"tag": "p", "text": "This ability is used to sense where scribing would be on any given object. This talent is reserved for well trained Fallanassi."}, {"tag": "h3", "text": "Sense current"}, {"tag": "p", "text": "The ability to sense sentient beings by the ripples they make in the Current. This power will detect the presence of sentient beings as well as their approximate numbers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}