{"url": "Falleen/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Ectothermic species", "Category:Falleen", "Category:Mid Rim species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Falleen"}, {"tag": "p", "text": "The Falleen were the indigenous reptilian sentient species of the planet Falleen."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Falleen were an exotic, cold-blooded reptilian species known to be long lived, with life spans averaging 250 years. Fallen skin was generally green or gray-green in color, though it could become red to orange when certain pheromones were released."}, {"tag": "p", "text": "The sleek symmetry of their features, calculating and cold demeanors, their exotic looks, and their ability to alter their skin pigmentation meant that the Falleen were often considered to be among the most aesthetically pleasing beings in the galaxy. In addition to their strikingly beautiful appearance, the Falleen exuded pheromones which made them all but irresistible to both sexes, as evidenced when Quinlan Vos fell under the influence of a male Falleen's pheromones. They had small scales all over their bodies, as well as slightly clawed fingers and toes. In addition, the Falleen displayed prominent facial and spinal ridges, though females tended to have slighter, more subtle growths."}, {"tag": "p", "text": "The Falleen were semi-aquatic, and were able to hold their breath underwater for a long period of time, leading exobiologists to believe that the Falleen's ancestors were completely aquatic. The appearance of breasts and other mammalian characteristics in Falleen females and males have also led exobiologists to believe that Falleen had a mammal ancestor."}, {"tag": "p", "text": "They were one of the few species resistant to mind tricks, and had green blood."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Falleen society was of a feudal nature, with noble houses ruling over the lower classes. The upper echelons of Falleen monarchies were rife with politics and intrigue, but they rarely spilled blood over blatant disputes or open warfare. The skin pigmentation of the Falleen changed naturally to reflect the mood of the individual; however, the Falleen long ago mastered the ability to change their skin tone at will and used this as something of a covert weapon in their politics, fostering an appearance of calm, for example, when they were really panicking."}, {"tag": "p", "text": "As a cold-blooded species, the Falleen respected discipline and control, particularly self-control. They tended to shun public displays of emotion, and were very patient. As a result of this attitude, they tended to look down on the more openly passionate, whom they saw as lacking self-control. Indeed, the Falleen as a species had a towering sense of superiority which they felt was only right and proper due to their discipline and rigid self-control. They also tended to view Falleen, and not Coruscant, as the civilized and cultural capital of the galaxy. This arrogance made the Falleen something of an isolationist species, and though they were not a rare species, it was rare to find them away from their homeworld."}, {"tag": "p", "text": "Young Falleen nobles often toured the galaxy for a while to acquire a taste of life away from Falleen. More often than not, though, this merely reinforced the Falleen's biased views and sense of superiority, ensuring that the youth of Falleen never felt the desire to leave home. The invasion of the Yuuzhan Vong, and the fall of the planet to the alien invaders, cut short these trips and isolated the Falleen even more. In the aftermath of the war, many Falleen were seen off world, especially on Coruscant."}, {"tag": "p", "text": "C. 29 BBY, the Falleen Miss Mylla, a courtesan and manager of the entertainment house Miss Mylla's Saloon in Lamaredd, was rumored to be the concubine of a member of the Falleen Royal family, an heir to the crown fallen into disfavor or a holo actress hiding from a jealous wife. She was known to have arranged the marriage of an escort working for her with a Falleen Prince."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though the Falleen joined the Galactic Republic close to four thousand years before the Battle of Yavin, they later sided with the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "p", "text": "A few of the Falleen joined the Rebellion when Darth Vader razed a city and slaughtered some 200,000 individuals to contain a failed biological experiment on the Falleen homeworld including Prince Xizor's father, King Haxim. Xora, Zuur, and Xizor were three of the Falleen known to have sought revenge on Darth Vader for the deaths of their families and friends, only to be killed by the very same Sith Lord anyway."}, {"tag": "p", "text": "The Falleen decided against joining the New Republic after the fall of the Galactic Empire. During the invasion of the Yuuzhan Vong, the planet fell to the alien invaders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Different artists have depicted Falleen with either four- or five-fingered hands."}, {"tag": "p", "text": "In Coruscant Nights I: Jedi Twilight, Falleen is misspelled 'Fallen'."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}