{"url": "Falmal", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Krish", "Category:Males"], "nodes": [{"tag": "h1", "text": "Falmal"}, {"tag": "p", "text": "Falmal was a male Krish who was part of the organization controlled by Gamgalon. One of his most trusted lieutenants, he was often employed in positions of authority. In 7 ABY, Gamgalon established a Morodin-hunting safari on the planet Varonat as a cover for illegal activities he was conducting in the Great Jungle. Falmal was assigned to lead the expeditions."}, {"tag": "p", "text": "In 8 ABY, Falmal led an expedition that included Syndic Pandis Hart and Captain Seoul in the jungle. Falmal grew suspicious of the pair, and his suspicions were well founded. The two Humans were, in actuality, the smugglers Talon Karrde and Quelev Tapper who were looking to cut in on Gamgalon's operation. In the ensuing confrontation with Gamgalon and his Krish, Tapper was killed. In turn, Falmal and Gamgalon were killed by Celina Marniss, a hyperdrive mechanic that Karrde had employed in Tropis-on-Varonat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Falmal was a male Krish criminal and gun-runner who was part of the organization run by his fellow Krish, Gamgalon. it was a small-time operation always struggling to make a profit, and Falmal served as Gamgalon's lieutenant, often acting as a field supervisor and enforcer. Eventually, Gamgalon ended up dealing with Jabba the Hutt. The association drove the Krish organization into deep debt, and eventually the group became a part of Jabba's smuggling operation. Following Jabba's death at the hands of Luke Skywalker in 4 ABY, Gamgalon took his operation independent again."}, {"tag": "p", "text": "In 7 ABY, Gamgalon set up operations on the planet Varonat on the Ison Corridor. It was discovered that the slime trails of the native Morodins enacted a chemical change in the pips of aleudrupe berries, which, when combined with rethan-K and promhassic triaxli, created a blaster formulation as powerful as spin-sealed Tibanna gas. All three products were completely innocuous and legal, and would pass customs without inspection. Inside Varonat's Great Jungle, Gamgalon began operations planting Yagaran aleudrupe plant alongside the Morodin slime trails, and marking their locations with transpond markers. To cover their activities in the jungle, Gamgalon established a safari to hunt the Morodins. Falmal was assigned to lead the expeditions, assisted by the Human, Buzzy and the Rodian, Jombo."}, {"tag": "p", "text": "In 8 ABY, Falmal led a safari expedition into the jungle consisting of two Duros, a Thennqora, a Saffa, and two Humans. Riding aboard Aratech Arrow-17 airspeeders, Falmal was accompanied by the two Humans—Syndic Pandis Hart and Captain Seoul of Sif-Uwana. Hart inquired as to the frequency of the hunts, and the liklihood of actually bagging a trophy. Falmal assured Hart that he would be successful in the hunt."}, {"tag": "p", "text": "Leaving the base camp, the expedition hiked through the jungle for several hours. During a rest break, Hart and Seoul showed interest in a planting of the Yagaran aleudrupe plant alongside a slime trail, arousing Falmal's suspicions. He covered the unusual sight of a non-native plant in the jungle by blaming it on previous hunters who had dropped aleudrupe berries during their visit. He quickly called an end to the break, and hiked for several more hours before setting up camp. Along with Buzzy ansd Jombo, he helped the inexperienced hunters to raise their tents."}, {"tag": "p", "text": "As the camp was erected, the distinctive growl of a Morodin was heard from the jungle. Falmal ordered the group to disperse into the three person teams that had been established on the airspeeder ride to camp, and each grouping headed into the jungle at different points. Falmal led Hart and Seoul, tracking slime trails and discovering that at least three Morodins were present in the immediate area. Falmal and the Humans came upon a single Morodin, and Falmal instructed Hart to shoot the creature. The Syndic hesitated, and two of the other hunters, Tamish the Thennquora and Cob-caree the Saffa, slew the target."}, {"tag": "p", "text": "Shortly after, Hart and Seoul disappeared from camp, and Falamal, suspecting them to be spies or saboteurs, contacted Gamgalon. Along with several other Krish, they found the pair observing a herd of Morodin. The two Humans revealed their true identities to be smugglers Talon Karrde and Quelev Tapper, and Gamgalon revealed the extent of his operation to them, including bribing the local governor to turn a blind eye to the Morodin hunts. Gamgalon decided to kill them, not wanting any word of his operation to leak out. Tapper attempted to escape, and was subsequently cut down by one of the Krish. Gamgalon ordered two Krish to take Karrde, and the group started to walk into the jungle. Suddenly, the group heard Morodin growls all around them; Gamgalon ordered the Krish holding Karrde to spread out into the jungle, and directed Falmal to take hold of the smuggler. As they neared the Krish's airspeeders, Falmal was struck by a thrown knife that penetrated his side. As Gamgalon spun round to find the attacker, he was shot in the chest. Karrde had been rescued by Celina Marniss, a hyperdrive mechanic he had contracted to fix his ship in Trois-on-Varonat, and the pair escaped Varonat."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Falmal had red hair and light purple skin. One of Gamgalon's longest serving and most trusted lieutenants, Falmal always showed due deference to his boss, addressing him as \"my leige.\" Protective of Gamgalon's operations, he would do anything necessary to ensure its continuation. He was able to determine that Talon Karrde and Quelev Tapper were not entirely on the level during their safari, although he believed they had come to harm the operation rather than looking for a cut. Falmal was a keen hunter, and enjoyed the strategy involved in the sport. As a result, he was proficient in tracking and surviving in the jungle. He carried a blaster rifle, and a pack of survival gear."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Falmal first appeared in First Contact, written by Timothy Zahn and published in West End Games' Star Wars Adventure Journal 1. Additional RPG material was provided by Peter M. Schweighofer, and the art was by Mike Vilardi. First Contact was subsequently reprinted in Tales from the Empire, The Best of the Star Wars Adventure Journal, Issues 1-4, and Hyperspace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}