{"url": "False_Sun_Runner", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Alpha-class heavy transports", "Category:Hutt Cartel starships", "Category:Unidentified transports"], "nodes": [{"tag": "h1", "text": "False Sun Runner"}, {"tag": "p", "text": "In 23 BBY, one year before the start of the Clone Wars, Groodo the Hutt created a copy of the ancient starship the Sun Runner in a scheme to destroy the Fondor Shipyards. The counterfeit derelict was powered by a hypermatter reactor, fitted with a contemporary sensor jammer, and armed with 20 Arakyd Industries sensor-guided missiles and state-of-the-art Trang Robotics Duelist Elite combat droids with flexisteel sabers and vocabulators. Additionally, controlling the ship was a dome-headed, black R1 astromech (Industrial Automaton) guarded by three SoroSuub 501-Z security droids heavily armed with new Merr-Sonn B-20 blaster rifles with pressure-wiped stocks."}, {"tag": "p", "text": "Professing he believed the derelict to be genuine, but having only seen, he said, its façade, Fondor's Senator Rodd, who claimed salvage rights to the drifting vessel, stated that he wished to transform it into an amusement center—a kind of orbital museum of interstellar travel (while, in fact, he was in secret collusion with Groodo). Alternately, Nallastia's Margravine, Quenelle, as the direct descendant of the Margrave Octan, claimed full property ownership of what she, too, believed, by all outward appearances, to be authentic. She accused Rodd of secretly harboring the belief that the vessel contained—though she assured him he was mistaken—the fabled Lost Stars of Nallastia."}, {"tag": "p", "text": "When the derelict ship fired upon the Republic diplomatic cruiser Unitive, however, it was counterattacked and destroyed by the Jedi Master-apprentice team of Obi-Wan Kenobi and Anakin Skywalker. The counterfeit ship's advanced power source, navigational equipment, and armaments provided evidence that this inexact replica did not originate from the Unknown Regions of the galaxy, as was previously thought. The false Sun Runner was at last destroyed by Skywalker when the 18-year-old Jedi planted a proton grenade on the vessel's hypermatter reactor and demolished its sensor-guided missile silo with the concussion-missile launcher of a borrowed CloakShape fighter."}, {"tag": "p", "text": "Arriving back on Fondor, Rodd openly accused Kenobi of having destroyed what the Senator claimed to have been the real Sun Runner in a desperate attempt to resolve the dispute with Nallastia and prevent a Fondorian civil war. But Kenobi reaffirmed the ship's contemporary internal build and cutting-edge accoutrements, estimating its construction to have been within the previous four years and suggesting that Rodd consult with the crew of the Fondor Space Patrol ship that had been recovered from the derelict, and ask them what they saw. The Senator could only accuse Kenobi again by suggesting that he had employed Jedi mind tricks to compel the crew to tell Rodd only what the Jedi wanted him to believe, leaving them even less reliable as witnesses than the memory-wiped droids that were on board the Sun Runner. It was then that Obi-Wan realized that he hadn't told Rodd that the transport's droids were memory-wiped, although it was something Anakin had, in fact, discovered when he was aboard the derelict."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}