{"url": "Family_emergency", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Chiss stubs", "Category:Chiss families"], "nodes": [{"tag": "h1", "text": "Family emergency"}, {"tag": "p", "text": "A family emergency was a heightened state of security for a Chiss family which could be declared by members of political rank at least Patriel. During a family emergency, members of that family serving in the Chiss Expansionary Defense Fleet—both officers and warriors—could be recalled to a specific planet or location to defend their family's interests."}, {"tag": "p", "text": "According to the history student Coduyo'po'nekri, family emergencies could be declared by member families of the Chiss Great Families, so long as:"}, {"tag": "p", "text": "A conspiratorial scheme by Jixtus of the Grysk Hegemony nearly caused a civil war in the Chiss Ascendancy, when three rival Great Families; each allied with a mutually-rivaled Ruling Family; declared family emergencies to attempt to claim a supposedly nyix-rich mining planet. The three families sent their family fleets to the world and nearly attacked one-another, until Senior Captains Mitth'raw'nuruodo and Xodlak'in'daro managed to defuse the tensions and bring each family glory through cooperation."}, {"tag": "p", "text": "Upon learning of the process of family emergencies from Yoponek, the ambitious Xodlak family Councilor Lakuviv kidnapped and impersonated Xodlak family Patriel Lakooni, declaring a Xodlak family emergency by posing as her. Unbeknownst to Lakuviv, the Pommrio family and Erighal family had also done the same, calling their Fleet personnel to serve in their family fleets and stake claim to the mining world."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Family emergencies were declared since at least 50 BBY, when the Coduyo family declared one to defend the planet Massoss from a \"breakaway alien sect\"."}, {"tag": "p", "text": "The simultaneous declarations of family emergencies by the Xodlak, Pommrio and Erighal families in 18 BBY nearly led to a civil war within the Chiss Ascendancy. The Grysk Jixtus had a plot to destroy the Chiss Ascendancy that depended on their family fleets coming into conflict above the planet Hoxim. However, Senior Captains Mitth'raw'nuruodo and Xodlak'in'daro managed to prevent the Skirmish above Hoxim from blossoming into a full-fledged Chiss civil war."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}