{"url": "Fane_Peturri", "categories": ["Category:Legends articles", "Category:Galactic Empire science and engineering personnel", "Category:Historians", "Category:Humans", "Category:Males", "Category:Rakghouls"], "nodes": [{"tag": "h1", "text": "Fane Peturri"}, {"tag": "p", "text": "Fane Peturri was a historian and a friend of Schurk-Heren, the captain of the crew of the Uhumele who was willing to trade Dreypa's Oubliette."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Captain Schurk-Heren was willing to trade his vessel's valuable cargo, as he believed that Fane had no underworld connections. However, Peturri was an agent of Darth Vader, who learned of the ship's cargo and set a trap for the crew. Peturri then began studying the oubliette and the Sith artifacts with it. He discovered a Snivvian crime lord's memoirs and a Jedi who interrupted him about rakghouls. Fane determined that the oubliette was made in a pre-Republic era."}, {"tag": "p", "text": "Against Fane's warnings about the Muur Talisman and its power to create rakghouls inside, Vader sliced it open, revealing a young woman, inside. In a panic, Fane put on a suit to keep from getting infected. As soon as Celeste woke up, he told her that it was four thousand years from her previous time. She then bombarded him with questions about a Covenant, rakghouls, Mandalorians and the Republic. When he informed her that the Sith had taken over, she immediately attacked Vader."}, {"tag": "p", "text": "When the duel came to a halt, Peturri tried to run off to Vader's transport, but was Force grabbed by Vader in the process, who figured out that this was another test from his master. Fane confessed that he was indeed forced by the Emperor that sensed in Vader the desire to usurp him and to find an apprentice to aid him in his quest."}, {"tag": "p", "text": "Fane's special suit did not shield him from the effects of Sith magic, so he transformed into a rakghoul. He was cut off in the air, as he tried to attack the Sith Lord, instantly dying."}, {"tag": "h2", "text": "Appearances"}]}