{"url": "Fang-class", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance to Restore the Republic starfighter classes", "Category:Black Sun starfighter classes", "Category:MandalMotors products", "Category:Mandalorian starfighter classes", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "Fang-class"}, {"tag": "p", "text": "The Fang-class starfighter, also known as Fang fighter, Protectorate fighter, or as the Protector Fang Fighter, was a starfighter manufactured by SoroSuub Corporation and MandalMotors and used by the Mandalorian Protectors."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Fang fighters were fast and highly maneuverable starship designed specifically for combat. The craft's narrow attack profile and swivel-mounted wings that provided vectored-thrust control gave the fighter unmatched agility."}, {"tag": "p", "text": "The Fang fighter was designed and manufactured by MandalMotors, and SoroSuub Corporation Possessing a frame that was considered elegant yet aggressive in design, the Fang fighter had a thin, angular silhouette and a cranked-delta platform that gave the vessel an unmistakable profile. The fighter's fuselage took the form of a small, elongated hexagon with a low-profile canopy that covered the vessel's midship-mounted cockpit; the starfighter's aft section was dominated by a single, large, high-output ion engine. Two articulated S-foil wings were mounted to the fighter's fuselage, each capable of rotating and able to be raised or lowered, and possessed of a large, additional ion engine. The Fang fighter featured a sophisticated vectored thrust system, advanced flight controls, and automated vernier thrusters."}, {"tag": "p", "text": "Fang fighters could accommodate a single pilot, with no room for other passengers, and enough consumables for one to three standard days. They possessed an array of close range sensors, a class 2 hyperdrive, and an onboard navigation computer. The Fang fighter's S-foil wings housed the majority of the starfighter's weapon systems, which comprised of a pair of forward-mounted laser cannons. Just forward of the cockpit, mounted in the fighter's underside, was a retractable torpedo launcher that carried a single proton torpedo, offering the vessel a degree of tactical flexibility. The hidden launcher allowed a pilot to launch a devastating salvo before their quarry realized the vessel was carrying ordnance. Fang fighters typically cost between 120,000 to 185,000 credits."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Fang fighter was custom-built for starfighter combat, and the vessel's narrow attack profile and pivot wing technology could be used to achieve unmatched agility, making the Fang fighter well suited to executing deadly head-on charges such as the Concordia Face Off maneuver. The Fang fighter was designed to build upon the successes of the Kom'rk-class fighter/transport, a model considered to be the Fang fighter's spiritual older sibling."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Fang fighter was manufactured by MandalMotors and SoroSuub Corporation during the the last years of the Galactic Republic, and during this time it found significant use among the forces of the Mandalorian Protectors of Concord Dawn, who purchased the majority of the line. This led to the Fang fighter becoming known colloquially as the \"Protectorate fighter.\" Favored by the Concord Dawn Protectorate's elite pilots, Fang fighters became a common sight throughout the Concord Dawn system and across the Mandalore sector."}, {"tag": "p", "text": "All Mandalorian Protector Fang pilots were personally trained by Fenn Rau, leader of Skull Squadron during the Clone Wars and eventually leader of the Protectors during the Age of the Empire. The ships were deadly weapons when piloted by these Mandalorians, who despite the neutrality of Mandalore in the Clone Wars participated in the Third Battle of Mygeeto, during which they assisted Republic forces led by Jedi Master Depa Billaba and her apprentice, Caleb Dume. During the Imperial Era, Fang fighters piloted by the Protectors encountered and easily destroyed an entire unit of Phoenix Cell's RZ-1 A-wing interceptors. Eventually, the Mandalorian Protectors sided with Phoenix Cell and supported their rebel movements. After some time, a civil war ignited in Mandalorian society between Clan Wren, House Kryze and House Vizsla against Clan Saxon and the Galactic Empire. Clan Wren dispatched a contingent of Fang fighters to support the Rebel Alliance during the Battle of Atollon against the Galactic Empire, and were vital to the Alliance's survival."}, {"tag": "p", "text": "Several Fang fighters were sold to other parties on the open market, and a number of former Protectorate fighters came into the possession of the Black Sun, a criminal syndicate that subsequently resold the hard to obtain vessels to collectors and mercenary pilots. Over time, two Fang fighters came into the possession of Kad Solus and Teroch."}, {"tag": "p", "text": "At some point following the Battle of Yavin, the Fang fighter became a standard starfighter asset of the Rebel Alliance, who had acquired Fang fighters for use as powerful anti-vehicle air support during the Galactic Civil War. They were prominently used during the Battle for Tatooine and similar operations launched by the Tatooine rebel cell."}, {"tag": "p", "text": "In 35 ABY, several Fang-class fighters were part of a fleet assembled by Lando Calrissian to assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol. At least two Fang fighters were struck with Darth Sidious' Force lightning which disabled until they were able to regain power after Sidious was distracted and killed by the Jedi Rey."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Fang fighter made a simultaneous first appearance in \"The Protector of Concord Dawn,\" the thirteenth episode of the animated television series Star Wars Rebels' second season, and in the comic Kanan 10. Both the episode and the comic were released on January 27, 2016."}, {"tag": "p", "text": "In a December 2016 update for the mobile game Star Wars: Commander, Fang fighters became available for use by players in their bases."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}