{"url": "Fanta", "categories": ["Category:Legends articles", "Category:Males", "Category:Poldts", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Fanta"}, {"tag": "p", "text": "A male Poldt named Fanta was a spectator of the Boonta Eve Classic in 32 BBY. at some point during the event he bickered with Jar Jar Binks."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the year 32 BBY, Fanta was a spectator of the annual Boonta Eve Classic podrace at Mos Espa Grand Arena on the planet Tatooine. During the race, a Gungan named Jar Jar Binks continuously tried to peer over his shoulder to see the race on his hand held viewscreen. This annoyed Fanta, who apparently wanted nothing to do with Binks, and he intentionally hid his screen from the Gungan's view throughout the race. Shortly after Ben Quadinaros' Podracer exploded before the second lap, Binks pounded on Fanta's back in excitement, which prompted the Poldt to grimace and try to move away."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Fanta was a male Poldt, a slender and uniquely sculpted Species.He possessed a sour attitude, at least towards Jar Jar Binks During the Boonta Eve Classic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fanta the Poldt was to appear in the 1999 movie Star Wars: Episode I The Phantom Menace. While his scene was ultimately left on the cutting room's floor, it remained in both the screenplay and in Terry Brooks' movie novelization, thus ensuring Fanta's canonicity. To create the Poldt's likeness, Lucasfilm Ltd. used discarded pieces of Neimoidian concept art. Originally, the Neimoidians were meant to be computer-generated, and George Lucas envisioned them as the organic models of the B1-Series battle droids that made up the Trade Federation army. However, when the decision was made to portray the Neimoidians with actors wearing animatronic masks, the original design was deemed too impractical. The creation crew later took the discarded Neimoidian design and used it to create Fanta the Poldt. A few of the sketches shown in the interactive CD-ROM Star Wars: Episode I Insider's Guide are labelled both \"Neimoidian\" (or some variation of that word) and the name \"Phanta.\" Later sketches were just labelled \"Fanta,\" with no specific species. The original Neimoidian concept art was later refined into the Geonosians during the pre-production Star Wars: Episode II Attack of the Clones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}