{"url": "Fantasy_Flight_Games", "categories": ["Category:Real-world articles", "Category:Articles in need of updating", "Category:Fantasy Flight Games"], "nodes": [{"tag": "h1", "text": "Fantasy Flight Games"}, {"tag": "p", "text": "Fantasy Flight Games (FFG) is the current license holder to Star Wars cards, roleplaying and miniatures games. When they made this announcement in August of 2011, they also announced that they were planning to release Star Wars: X-Wing Miniatures Game, a tactical miniatures game, and Star Wars: The Card Game, a cooperative card game, in Spring 2012. Fantasy Flight Games is based in Roseville, Minnesota."}, {"tag": "p", "text": "At Gen Con in 2012, it was announced that Sterling Hershey was one of the designers of Fantasy Flight Games' new Star Wars–themed roleplaying game, Star Wars: Edge of the Empire. That year, he discussed on his blog the names of two future installments: a Rebel vs. Empire campaign named Age of Rebellion in 2014 and a Jedi-based campaign called Force and Destiny in 2015."}, {"tag": "p", "text": "However, on June 6, 2013, he announced on his website the completion and upcoming release of the first direct expansion of the game, Beyond the Rim, Star Wars: Edge of the Empire's first full length adventure, scheduled for release in the 3rd Quarter of 2013."}, {"tag": "p", "text": "On November 3, 2015, Star Wars: Rebellion was announced on Fantasy Flight Games' website. It was later released on March 31, 2016."}, {"tag": "p", "text": "On July 29, 2016, the collectible dice card game Star Wars: Destiny was announced, with a release of November 2016."}, {"tag": "p", "text": "At the 2019 Gen Con, an adventure for the RPG, \"Begun, The Clone Wars Have!\", was made available to attendees."}, {"tag": "h2", "text": "Games"}, {"tag": "h3", "text": "Roleplaying games"}, {"tag": "h3", "text": "Miniatures games"}, {"tag": "h3", "text": "Card games"}, {"tag": "h3", "text": "Board games"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}