{"url": "Far_Orbit", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance to Restore the Republic starships", "Category:EF76 Nebulon-B escort frigates", "Category:Privateer starships", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Far Orbit"}, {"tag": "p", "text": "The Far Orbit was an EF76 Nebulon-B escort frigate that served in the Galactic Empire's navy until, after a mutiny among its crew, it became one of the first privateering vessels for the Alliance to Restore the Republic. Produced by Kuat Drive Yards, the Far Orbit was initially helmed by Imperial Captain Vocis Kenit as it hunted down pirates in the Outer Rim Territories. However, due to Kenit's tyrannical leadership, his second-in-command Commander Dhas Fenoep Vedij—who had become disillusioned with the Empire—led a successful mutiny in 0 ABY against Kenit and the Imperial forces aboard the frigate. After discharging the Imperial-aligned crew members and those who refused to enlist with the Rebel Alliance, Vedij had the Far Orbit travel to the space station StarForge Station, where it picked up replacement crew members and joined up with the Alliance. The Far Orbit thus became a privateering vessel for the Alliance in the Ringali Shell of the Core Worlds."}, {"tag": "p", "text": "Soon afterwards, the Far Orbit captured the Imperial escort frigate New Star and Shipment 1037, an entire convoy of freighters, after leading them into a trap with the help of an Alliance task force. The privateers then detained Imperial Advisor Coh Veshiv near the planet Esseles after convincing Veshiv to transfer over to the Far Orbit from the CR90 corvette Empire Forever by claiming that the Far Orbit would be used as Veshiv's next vessel. Following Veshiv's capture, Kenit—tasked by the Empire with tracking down his old ship—manipulated the Far Orbit into a confrontation with the Solar Terrors pirate group. However, Vedij and the privateers emerged victorious from that battle. Kenit later caught up to the Far Orbit using the transport SPF 14897 as bait; when the Far Orbit raided SPF 14897, Kenit's task force pounced on the frigate. In the resulting battle, the privateers escaped only after knocking out one of the gravity wells of the Imperial Interdictor Claw, allowing the Far Orbit to jump to hyperspace."}, {"tag": "p", "text": "After the heavily damaged Far Orbit was repaired, the frigate once more returned to the Ringali Shell and went to the world Brentaal IV. There, a landing party from the Nebulon-B picked up a datadisc containing important information about the route of the Imperial Star Galleon-class frigate Emperor's Will, which was carrying a very valuable cargo of treasures. While attempting to capture the frigate, the Far Orbit was engaged by the Claw again after it dragged the ship from hyperspace near the Ringali Nebula, though the privateers managed to escape once more. Vedij and his crew then proceeded to attack the Emperor's Will and its escort, the Zaff Jendinpurg, after forcing them out of hyperspace. Dispatching the escort, the Far Orbit seized the frigate's cargo pod after the Emperor's Will's captain ejected it from the ship."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "General information"}, {"tag": "p", "text": "The Far Orbit was a EF76 Nebulon-B escort frigate, produced by Kuat Drive Yards and measuring 300 meters in length. As a Nebulon-B, the starship's main section was at the fore of the craft, with a thin boom module connecting the fore to the aft propulsion section. At full capacity, the Far Orbit's crew numbered 854 with sixty-six additional gunners, though the escort frigate–class ran on a skeleton crew of 307 hands and ten gunners if need be. However, running on a less-than-full crew resulted in decreased combat efficiency, and in that situation, certain unused sections of the ship were closed off to conserve the ship's energy. In addition to crew, the Far Orbit could house seventy-five passengers, which were usually troops, while its storage compartments could hold up to six thousand metric tons worth of cargo and up to four months' worth of consumables. For every fifty cubic meters of cargo space, a hundred tons of cargo could be held."}, {"tag": "p", "text": "The propulsion module was the site of the Far Orbit's static discharge vanes, which were used to vent dangerous excess amounts of energy in the ship's engines. The discharge function was not used regularly, as doing so was only necessary in certain situations such as combat or ion storms. The vanes were mounted on the outer hull of the frigate, and if they were damaged or lost, the reactor could potentially melt down if energy built up to dangerous amounts, or the fuel system could explode. There were two turbolift shafts located in the Far Orbit: one in the forward module and one in the propulsion. Each shaft had two cars and spanned multiple floors. However, the turbolifts were not continuously in service and, for security reasons, did not go to every deck. Additionally, any turbolift could be overridden by the rank cylinder of an officer, which would cause it to ignore calls from other decks. Most traffic between decks on the frigate was done via hatches with ladders that went from one level to the next."}, {"tag": "p", "text": "Basic crew quarters existed on Deck 5, in the command module. These quarters had limited entertainment options and only common refreshers to service the crew there. The triple-bunk crew quarters only housed average-sized Humans, though modifications could be made to fit larger beings. The trooper quarters were also situated in the command module between the main crew quarters, the officer quarters, and the bridge. This was intended to halt or hamper the efforts of a mutiny by preventing mutineers from reaching the bridge or the officers. Additionally, since all of the frigate's docking facilities were above the trooper quarters, the trooper quarters stood between potential boarders and the bridge. The standard trooper quarter, which meant to house two squads, was comprised of a pair of rooms, with the larger one filled with double bunk beds and the smaller one with a common refresher."}, {"tag": "p", "text": "Officer quarters were situated under the trooper and the main crew quarters in the command module. All of the officer quarters, whether they were for junior officers or senior officers, had a small entertainment console, pre-made meals, and a low-quality autochef which dispensed hot and cold drinks. The quarters for the ship's engineers were housed in the propulsion module. These rooms were similar to the quarters for officers and standard hands that were located in the command module, though they were dirtier, due to the tools and materials that the engineers handled and sometimes brought back to their quarters. The standard engineer quarter featured two rooms, with the larger walled with triple bunk beds, some storage, an A/V unit, and a workbench. Privacy curtains were also featured in the room, and the other room was a basic refresher. The common engineer officer quarter had three rooms, with a pair of identical rooms mirroring each other and separated by a refresher unit. The identical rooms each had a double bunk near the door to the refresher and a closet, desk, and A/V unit on the wall opposite to the refresher. Both non-refresher rooms also had a workbench, which was opposite the A/V unit, and a privacy curtain that concealed the bed from sight if one sat at the workbench. The crew of the deflector shield generator was also kept in the propulsion module for increased combat readiness."}, {"tag": "h3", "text": "Equipment, complement, and armaments"}, {"tag": "p", "text": "The sensor arrays of the Far Orbit were housed in the ship's Sixth Section, and it was there that the sensor computer, sensor technicians, and operators were located. The sensor computer correlated the data received by the sensors, which acted as the eyes and ears of the vessel, and also recorded and reported on that same data. The computer could then make a sophisticated analysis on a variety of subjects based on the data it received. The frigate possessed both a forward and an aft sensor unit, which, because the Far Orbit was an EF76 Nebulon-B, were of excellent quality. The frigate had one of the most sensitive long-range sensor arrays in the entire Imperial fleet and possessed a full range of sensors. These included standard electro photo receptors, full spectrum transceivers, dedicated energy receptors, and lifeform indicators. Additionally, the Far Orbit had hyperwave signal interceptors and the rarer crystal gravfield traps. The crystal gravfield traps were used to detect and find cloaked or stealthy ships, and dark objects. Hyperwave signal interceptors were used for long-range scans and were able to find the vector of a ship entering or exiting hyperspace after detecting them. After the vector was found, it was possible for the astrogation section of the ship to uncover its destination. The hyperwave signal interceptors were also used to catch hypertransceiver and subspace transceiver signals, which, after being intercepted, were sent to Primary Communications on Deck 1 for decryption."}, {"tag": "p", "text": "Prior to the mutiny that occurred on the Far Orbit, the frigate had several shuttles and two squadrons of TIE/LN starfighters as its complement; however, the Far Orbit lost its entire fighter complement in its engagement with the Silent Blades pirate gang. Additionally, after the mutiny, many of the Imperial loyalists were sent off the ship in the frigate's shuttles, leaving only a pair of craft for the Far Orbit. One was a Grek-class troop shuttle, and the other a Katarn-class boarding shuttle. Over the course of its privateering days after the mutiny, the frigate added to its complement with various starfighters and shuttles that it acquired. The Nebulon-B was externally armored all over her hull, and the amount of armoring varied from place to place. In addition, the ship was defended by the capabilities of a Delphus JC-671 deflector shield projector, which protected the ship from most space debris and made the Far Orbit tough enough to engage in combat. The shield generator was located off the main propulsion module so as to avoid the threat of the generator's explosive reaction to being breached. The shield generator was quite powerful and used up great amounts of energy when the Far Orbit was in a space battle."}, {"tag": "p", "text": "In terms of armaments, the frigate had twelve turbolaser cannons, twelve smaller laser cannons, and a pair of tractor beam projectors that were suited to combat purposes. Half of the turbolaser batteries were located at the front of the Far Orbit, with three more on each side. The laser cannons were positioned with six to the front, two on each side, and a pair at the aft of the frigate. Crewed by a dozen hands, the two combat tractor beam projectors were at the front of the ship. The laser cannons and the turbolasers ran off the same power system and blaster gas canisters, though they did consume spare gas tanks and power cells in combat situations in order to dampen the impact of destroying one of the weapons emplacements. The turbolasers were the main fighting guns of the ship, and despite being not overly powerful, they were quite damaging when used together. The laser cannons, on the other hand, were not powerful and only proved effective when used in concert. Both the laser cannons and the turbolasers had a minimum range of between two and six meters, a medium range of twenty-four meters, and a maximum range of fifty meters in a planet's atmosphere."}, {"tag": "p", "text": "Though the guns of the Far Orbit were located all over the vessel, the primary weapons were located in the Seventh Section of the ship. It had the most cannons and was the first place to receive targeting orders, and because of this, the other guns followed the primary weapons' fire. The Seventh Section also held the main weapon power processing units, the targeting computers, and the central blaster gas tanks, which were heavily armored to avoid explosions. In the event of the blaster tanks exploding, the cannons of the EF76 were still able to operate because they all operated on battery power, and all had their own reserve of blaster gas. The gunnery stations of the frigate were sparsely lit in order to prevent glares on targeting scopes. They also echoed with the rumble of the weapon's testing routines, as the stations were located near the Far Orbit's outer hull, and thus were poorly insulated against noise. The gunners of the cannons handled all of the aiming and firing of the weapons via the targeting data that the ship's sensors collected. Although the bridge of the Far Orbit usually gave out firing commands, some captains let the gunners pick and choose their targets. Because the turbolasers were wired directly to the main reactor, located in the propulsion module, they kept up a constant rate of fire as long as there was enough blaster gas for them to use."}, {"tag": "p", "text": "The majority of blaster gas on the Far Orbit was stored in canisters that were one meter tall and a third of a meter in diameter. These canisters weighed 110 kilograms, and each had enough gas to supply a laser cannon with sufficient energy to fire twenty capital-scale shots. If set to smaller-scale blaster shots, which were designed to take out starfighters, the canisters held enough gas to fire forty. To reload a cannon, the gunner had to lift up the canister to the cradle that was connected to the cannon's power supply system. The cradle was then \"rammed\" into the main cannon, and the gunner broke the seal on the canister by operating a control on his or her status panel. The main tractor beams ran off the main power grid and had no expendable ammunition. They were used for securing an enemy ship and reeling it in so the Far Orbit's guns had more control, or to help with boarding. These tractor beams had a minimum range of two to ten meters, a medium range of thirty meters, and a maximum range of sixty meters. In addition to the two combat tractor beams, the Far Orbit had several non-combat tractor beams which were positioned in the ship's TIE fighter flight deck, in each docking bay, and in the boarding bay. These non-combat tractor beams, each crewed by three men, served the purpose of stabilizing docking ships, bringing in both TIE starfighters and shuttles, and helping with boarding actions by securing the enemy ship to the Far Orbit."}, {"tag": "h3", "text": "Decks of the ship"}, {"tag": "h4", "text": "Deck 1"}, {"tag": "p", "text": "Deck 1 of the Far Orbit housed Primary Communications, and it fell under the Aft First Section, which was located at the top portion of the Nebulon-B's forward module. The Primary Communications deck, nicknamed PrimeComm or P-Com, was the home of the ship's long-range subspace transceiver, which had a range of over a hundred light-years. Due to the fact that the Far Orbit was meant to serve as a capital ship on missions, the frigate possessed a pair of communication arrays, one for contacting local frequencies and the other for use in long-range transmissions. The communications computer that processed all of the signals was a powerful and highly advanced TerexComm processor unit that was located in a room at the aft of the deck on the port side. The processor boasted multi-channel sorting and high-speed channel switching, as well as full programming in encryption and decryption. With the processor unit, comm techs could tap into secure transmissions and listen for information."}, {"tag": "p", "text": "At the front of the Primary Communications section was a pair of rooms used for encryption and coding, as well as a secure comm room that featured a holoprojector, viewscreen, and several seats. The comm room was used for secure and critical communications. The P-Com itself was held in the middle of the deck, where it also had a holoprojector, with the room where the channel switches were housed directly behind it. A quartet of offices were situated aft of the secure transmissions room and starboard of the P-Com, with the forward-most room being the head office. Antenna equipment and other communications structures filled up the majority of the forward port section of the deck."}, {"tag": "h4", "text": "Deck 2"}, {"tag": "p", "text": "Deck 2 was the location of Short Range Communications, also referred to as ShortComm or S-Com, and it operated independently of Deck 1, as it used its own antennae. S-Com was located further aft of P-Com, and was also located in the Aft First Section. The S-Com handled all local lightspeed transmissions, as well as intercom traffic and maintenance. It was housed in the middle of the area assigned to Short Range Transmissions, with a head office aft of it, and to the port resided a trio of offices. The starboard side of S-Com held another pair of offices and the channel switches for short ranged communications, and antenna equipment and structures were located just fore of S-Com."}, {"tag": "h4", "text": "Deck 4"}, {"tag": "p", "text": "Deck 4 of the Far Orbit housed the frigate's main crew galley, which was located in the Forward First Section of the ship and was also in the command module. Only enlisted crew members ate their meals in the main galley. However, the galley was not large enough to house all average crew members, so they ate in shifts or whenever they were off-duty. The galley was run and organized by a few hands, and it possessed some cooking and serving droids. With the kitchen and serving area located at the front of the crew galley, hands came in through the front and, after receiving their meal, proceeded to the tables in the dining room aft of the kitchen and serving area. To each side of the kitchen were pantries and autochefs, the latter of which were connected to the main kitchen via under-deck feeds. Just aft of the kitchen resided a recycler, and a staging area was present in the back of the dining room."}, {"tag": "h4", "text": "Deck 5"}, {"tag": "p", "text": "The command part of Deck 5 was situated in both the Forward First Section and the Forward Aft Section and was located in the command module of the Far Orbit. Almost half of that part of Deck 5 was taken up by a set of TIE fighter racks, which were located to the front of Deck 5. The TIE racks could hold up to two squadrons of TIE fighters and was situated directly over the TIE flight deck located on the deck below. A repair rack for damaged fighters was located near the TIE racks, and repeating blaster cannon hard points were located just aft of the TIE racks. In front of the TIE racks was a quartet of triple bunk crew quarters, which were rather cramped, and a pair of basic refreshers. Parts of the Far Orbit's ship systems were located past those crew quarters, at the farthest part forward of Deck 5."}, {"tag": "p", "text": "Aft of the TIE racks were more crew quarters with triple bunks in each, as well as storage units; the units stored a variety of goods but did not include weapons, parts, or specialized tools. Just aft of these crew quarters was the boom module and the machinery that operated the docking tube located in the middle. Additionally, Deck 5 had Tractor Beam machinery, a control room, and a machine shop on the port side. A pair of airlocks and a security station were situated on the starboard side. The entirety of the crew—minus officers, engineers, guests, and troopers—was supposed to be housed in the cramped crew quarters on Deck 5."}, {"tag": "h4", "text": "Deck 6"}, {"tag": "p", "text": "Deck 6 housed the TIE flight deck, which was directly under the TIE fighter racks for ease of deployment. The hangar had repair bays, as well as a short range catapult/cushion tractor beam to aid in the launching and recovering of the Far Orbit's TIEs. The flight deck also had a control center. Deck 6 was the location of the forward docking tube, which was located on the boom module. The forward docking tube possessed a control station, status panels, and a waiting area, as well as the docking tube itself, operated by machinery just aft of it. The docking tube was one of two; the other was located aft of it, and both were on the access corridor, which was a one deck deep walkway from the foreword module to the propulsion module. The access corridor was heavily armored to prevent local hull breaches."}, {"tag": "h4", "text": "Deck 7"}, {"tag": "p", "text": "Both Docking Bay 1 and Docking Bay 2 were located on Deck 7 in the boom module section, with the former closer to the command module and the latter to the propulsion module. Docking Bay 1, however, was actually shared between Decks 7 and 8. It housed a launch/land tractor beam setup, which was intended to help pilots maneuver into and out of the bay, and was used for unloading shuttles and small freighters in the command section of the ship. The forward section of the bay housed some of the Far Orbit's shuttle craft, including the captain's shuttle. As the bay could sometimes be a tight fit, wider ships and freighters relied on the docking tubes instead. Docking Bay 2 was used to unload supplies for the propulsion module, and also served as a repair bay. It was quite similar to Docking Bay 1, with a turbolift dock aft of it and four cargo bays located toward the rear. A control room with emergency supplies was also to the port side of the bay. A pair of power conduits that spanned multiple decks sat behind the turbolifts there."}, {"tag": "h4", "text": "Deck 8"}, {"tag": "p", "text": "The command section of Deck 8 was housed in the forward module of the Far Orbit, though Docking Bay 1, which was on the deck, was considered part of the boom module. The command section spanned both the Forward First Section and the Aft First Section, and the primary features of the deck were the medical facilities, the brig, and trooper training facilities. The sick bay, or the medical facilities, was able to treat all normal injuries and illnesses that crew members might suffer. Led by the Far Orbit's doctor, a small amount of Human medical assistants and an entire complement of MD-series medical specialist droids helped treat wounds and maladies. The medical facilities' standard procedure regarding bacta treatment required that the patient be stabilized before treatment. A limited number of functional and inorganic-looking cybernetic limbs and prosthetics were available to the sick bay, though some additional ones could be assembled with a day's notice. The medical droids, ranging from the MD-0 medical droid to the MD-5 medical droid, all had separate tasks aboard the frigate."}, {"tag": "p", "text": "The MD-5 performed all minor surgeries and checkups, and since it had all of the officers' medical records on file, it could obtain the medical records of any crew member in no time at all. The MD-0 served as the diagnostics droid, and it could perform a good diagnostic on any patient complaining of an illness from a wound in a couple of minutes. Additionally, the MD-0 took care of emergency triage during combat situations and played the role of the MD-5's aid when the other ran checkups on crew members. An MD-3 medical droid managed the sick bay's eight bacta tanks and also ran the pharmacy. The MD-4 medical droid served as the frigate's surgery droid, overseeing the surgery unit on the Far Orbit, which was capable of preforming procedures ranging from amputations and installing cybernetic replacements to microsurgeries."}, {"tag": "p", "text": "An MD-2 medical droid unit served as the MD-4's aide and also as the anesthesia/life monitor droid. Lastly, a MD-1 medical droid operated the medical lab and was able to handle most pathological investigations. The MD-2 and the MD-3 consulted with the MD-1 from time to time here. The sick bay and medical facilities were located in the aft half of the Deck 8 command section, with the main entry being the forward-most part. The entry space doubled as a triage station, and located behind that was the Intensive Care Unit (ICU) examination spot, which was followed by four ICU rooms. Beyond those were a pair of surgery suits and the bacta ward. Recovery wards laid on either side of the bacta ward, with the port one having the medical lab, the pharmacy, the medical droid bay, and the doctor's office in front of it. Behind the entire medical facility was part of Docking Bay 1, with its control room located nearby."}, {"tag": "p", "text": "The brig of the ship was located to the starboard side of the medical facilities, and it was able to hold up to thirty-six prisoners at a time. It had numerous security cameras and remote-activated locks, making it quite secure. With a set of refreshers separating it from the recovery ward on the starboard side of the deck, the brig had seven rooms for prisoners: one held up to ten, two could hold up to nine, and the last four were meant to hold a pair of inmates. However, if the brig was needed to hold more than thirty-six, a maximum total of seventy-two could be achieved if the prisoners were squished into the cells. The brig's security office was held near the cells. Just fore of the main turbolift dock on Deck 8, which was in front of the entrance to the sick bay, briefing rooms and locker rooms with small arms in them existed, available for the troopers on board the Far Orbit. Training rooms were to the port of the briefing room, while trooper offices were located to the starboard. In front of the locker rooms, a large training room existed, flanked on both sides by weapons ranges. Just ahead of the large training room were a pair of training equipment storage rooms."}, {"tag": "h4", "text": "Deck 9"}, {"tag": "p", "text": "Deck 9 housed the pair of hyperdrive motivators, which were built by Aether Hypernautics, that allowed the ship to enter hyperspace. Additionally, Main Engineering was on Deck 9, along with the fuel tanks and power regulators. Secondary systems monitoring sat at the front of Deck 9, followed by the Main Engineering area, in which engineers could check and, if necessary, control the primary systems of the ship via the engineer's rank cylinder. The deck widened at Main Engineering, with a pair of escape pods located on either side. Behind both sets of pods was a pair of workshops, and aft of the port workshops was a micro shop and a mech shop. Behind the starboard pair of workshops was the engineering computer. Right behind Main Engineering and between the two sets of workshops was the turbolift dock on Deck 9, with the Chief Engineer's office just in front."}, {"tag": "p", "text": "On the far starboard side of Deck 9, near the escape pods and their charging system, was a storage room and a fabrication shop. Located on the port side, aft of the escape pods there, was an engineering conference room, with a refresher and a storage unit squished between it and the outer hull. Behind the conference room was a parts storage room. Three fuel cells occupied the majority of the back half of Deck 9, with one behind the parts storage room, a second aft of the turbolifts, and the third behind the fabrication shop. Able to store up to two years' worth of fuel in total for the engines and hyperdrive motivators, the fuel cells were comprised of high quality quadranium to prevent breaches, as they were a priority target in ship-to-ship battles. A pair of power conduits that ran from deck to deck were located between the middle cell and the turbolifts. Situated between the middle full cell and the port one, and the middle and the starboard, was a hyperdrive motivator and a power regulator, with the motivator in front of the regulator in each case. The hyperdrive motivators were linked to the Far Orbit's primary Class 2 hyperdrive and the backup Class 12."}, {"tag": "p", "text": "A fuel systems control room was located between the starboard fuel cell and the starboard hyperdrive motivator, and between the port fuel cell and the port motivator. Three of the frigate's seven engines were located just underneath the fuel cells on Deck 9. These engines were highly efficient Kuat Drive Yard products, and they both propelled and powered the Far Orbit. The engines could allow the ship to reach a maximum speed of 800 kilometers per hour in a planet's atmosphere."}, {"tag": "h4", "text": "Deck 11"}, {"tag": "p", "text": "The part of Deck 11 located in the command module of the Far Orbit fell under both the Forward Second Section and the Aft Second Section. Officer quarters filled the forward part of the deck, with officer's mess and lounge taking up the rear portion. With ship's systems equipment filling up the foremost tip of the deck, sixteen junior officer's quarters were just aft of that, and these rooms took up over a third of the space in the command module for Deck 11. The junior officer's quarters had two to a room, which each possessed double bunks. Eight refresher units were interspaced within the quarters there. To the aft of those quarters and refreshers, about a third of the deck was taken up by the senior officer quarters. Two pairs of senior quarters were kept apart by a set of utility shafts in the middle of the deck, with a pair of junior officer quarters and the turbolift dock for Deck 11 behind those. To the each side of the senior and junior officer quarters in the middle of the deck was a pair of officer quarters designed for one occupant each; senior officer quarters were also meant for one officer only."}, {"tag": "p", "text": "Although all of the officer quarters had the autochef in them, Deck 11 had a mess for the officers, and it was located behind the turbolifts. On the port side, the autochef for the mess was in the galley, with the officer's Dining room behind it and the galley's pantry just fore of it. The junior officers usually ate after the senior officers in the dining room. On the starboard side of the deck, with an access corridor between the mess and it, was the officer's lounge. It was used as a social area in which officers could play sabacc, be entertained, or grab a meal from the lounge's own autochef, located just fore of the lounge itself. A small escape pod and life boat bay was located aft of the mess and lounge."}, {"tag": "h4", "text": "Deck 14"}, {"tag": "p", "text": "The command module section of Deck 14 served as the guest quarters for the Far Orbit and fell under the Forward Second Section. Guest rooms aboard the frigate had the same amenities as officer quarters, though the number of occupants that they were designed for varied. The two spacious rooms that were designated as VIP quarters were situated at the forefront of Deck 14, at the tip of the corridor that ran from the turbolifts up to near the front of the deck. Refreshers on either side of the corridor separated the VIP rooms from a single bunk guest quarter. These single bunks were in turn separated from a triple bunk guest room on either side of the corridor by another pair of refreshers. The triple bunks wrapped around the turbolift dock on Deck 14 on either side of it."}, {"tag": "p", "text": "On the outer hull, to the port and starboard of the turbolifts and a little aft of the triple bunk rooms, was a single bunk room followed by a refresher unit. Aft of the turbolifts was another pair of triple bunk guest quarters, and behind those were two guest conference rooms that doubled as lounges. At the very end of the deck was a pair of escape pods and an accompanying charging system."}, {"tag": "h4", "text": "Deck 16"}, {"tag": "p", "text": "The part of Deck 16 located within the propulsion module of the Far Orbit housed the main reactor control room and both levels of the sublight engine control room. The main reactor, which was located at the very bottom of the propulsion module and outside of the frigate's gravity well, was monitored by a square control room on Deck 16. The control room featured a circular control station in the middle, split into two halves by a small walkway between them, and a circular group of monitoring stations. The starboard side of the circle had viewports along the outer edge, as well as several monitoring stations on the inner edge behind a railing. The port side featured control stations and monitoring systems and had railings on the outer and the inner edges. Both sides of the circular monitoring station in the middle were raised from the floor and accessible by stairs on the inner edge of the half circles."}, {"tag": "p", "text": "To the port of the control room were control systems in the corners of the rooms. The starboard side of the room, not including the half of the circular control station there, was sealed off by a pair of isolation airlocks. Past the forward airlock was an equipment isolation room, wrapping around the edge of the circular control station, with equipment lockers squeezed between it and the outer wall of the room. From the equipment isolation room, one could reach the access shafts that led to the main reactor, which converted the fuel from the cells above into energy for the ship. In the event that the main reactor melted down, it would only burn through the outer hull of the frigate, as no decks were between it and the outside. In that case, the engineers of the ship could either shut down the reactor or eject it entirely, though the second course of action was harder to accomplish."}, {"tag": "p", "text": "The sublight engine control room had two levels, with one on top of each other. The upper level had a small catwalk with monitoring stations on it at the front, which was connected to engine control systems by a little walkway. The area on either side of that walkway was open to the lower floor, and a ladder from the catwalk on the port side allowed crew members to access both levels. At the rear of the upper level, two sublight engines existed, one on each side of the engine control systems. The lower floor was the same shape as the floor above and had monitoring stations under the catwalk above it, near the front of the lower level. At the aft of it, a systems enclosure existed, with the engine control systems behind it. Two more sublight engines sat under the spots that their counterparts on the deck above rested."}, {"tag": "h4", "text": "Deck 17"}, {"tag": "p", "text": "The command module part of Deck 17, which was classified as part of the Forward Third Section, served as the Far Orbit's bridge. The part of the bridge that contained the bridge stations was located at the front of the deck, with large viewscreens before and behind it. With one crescent of bridge stations facing the foreword view screen, two other crescents were behind that one, facing each a different wall of the ship. Between these two crescents was the captain's chair. Each of the bridge stations located on Deck 17 could override their section's controls elsewhere in the ship, though that section's head's rank cylinder would have to be used to do so. The captain, if he or she so wished, could also override any of the ship's systems with the captain's rank cylinder; this was intended to limit the effect of a mutiny or boarding operation."}, {"tag": "p", "text": "There were eleven different bridge stations. The operations station, crewed by the Operations Officer, could use almost any of the ship's controls, issue lockout commands, or talk to any of the section control stations on the ship. Although one could use any of the ship's controls from that station, only one could be accessed as a time, making it easier to simply use the designated bridge section or the section control station for that system. The sensors station on the bridge had access to a direct link that fed it sensor reports after they went to the sensor computer, and had the ability to issue and relay sensor orders. Additionally, the station could direct and monitor scanning nodes, though only a single node could be compiled at any one point in time."}, {"tag": "p", "text": "Via the communications system, it was possible to patch into any of the Far Orbit's communication arrays from the bridge. Here, the comm operator was responsible for all communications, be it internal or external. Transmissions that were routine could be, if necessary, routed through the bridge station, though secure transmissions were made from the P-Comm on Deck 1. A gunnery station also existed on the bridge, and it served as a command relay point. The security station on the bridge was used as a coordination center for any boarding, be it on the Far Orbit or an other ship, as well as riot suppression and other activities in which the ship's troopers were involved."}, {"tag": "p", "text": "From Deck 17, the deflector station was able to relay any shield switching orders. The engineering operations station located on the bridge acted as the monitoring post. However, the majority of engineering controls were in the engineering section in the Far Orbit's propulsion module. Among the bridge stations was the helm station, which was able to control the frigate's primary and lateral thrust when the Far Orbit was not in hyperspace. However, the controls here could be taken over by the engineers. Additionally, the helm station was responsible for engaging the hyperdrive motivators, after the astrogation station gave the go ahead."}, {"tag": "p", "text": "The astrogator ran the astrogation center, which was where the ship's hyperspace jumps were calculated via the navigation computer. After a jump was calculated, the astrogator relayed the coordinates and necessary data to the helm station, and then released the hyperdrive motivators for use. A power systems station was also on the bridge, though it served as mainly a monitoring and relay station. In an emergency, however, system-to-system power switching could be changed and controlled from the station. The last station on the bridge was the life support station, which was also a relay and monitoring station. However, like the power systems station, this one had the means to override controls if necessary. The station controller could shut off the ship's gravity, air, or water from here. The controller could also open or close any hatch, as the life support station served as the damage control station. It was responsible for fire and life support in combat circumstances."}, {"tag": "p", "text": "Behind the bridge stations was a turbolift dock, with a refresher and an officer's ready room to the port of those. The ready rooms were the administrative centers for the officers, and all command section module officers had ready rooms near Deck 17. To the starboard of the turbolift was the captain's ready room, and a security station laid behind the turbolift. To the port behind that security station was a refresher and a tactical room, and to the starboard was the main conference room. At the very rear of the deck laid three escape pods and their charging station."}, {"tag": "h4", "text": "Deck 18"}, {"tag": "p", "text": "The forward module section of Deck 18 was located just under the Far Orbit's bridge, and served as mainly officer ready rooms and the armory; that part of the deck was classified as the Forward Third Section. From the tip of the deck, the first third of the area was divided lengthwise by a small corridor. On each side at the front of the deck, an emergency supply room existed, with three officer ready rooms behind it. A conference room sat in the middle of Deck 18, with the turbolift dock for that level behind it. To both the starboard and the port of the conference room were two more officer ready rooms. Behind the turbolift was a staging area, with a maintenance shop to the port of it. Starboard of the staging area was a security station and the ship's main armory. This room was kept under the control of the Far Orbit's officers, and the only way to open it was to use a senior officer's rank cylinder. The armory itself was heavily armored and held blaster pistols, blaster rifles, light repeating blasters, munitions, and other boarding equipment that the crew would need in combat. At the aft of the deck was a trio of escape pods and their charging system."}, {"tag": "h4", "text": "Deck 21"}, {"tag": "p", "text": "The entirety of Deck 21 was located in the command module, and it was known as the power section of Secondary Engineering. Falling under the Fourth Section, the forward-most rooms were a pair of storage rooms, one of which was used for equipment. The equipment room was on the port side, with the other located to starboard. Behind those two were power conditioners and turbolift systems. The turbolift dock for Deck 21 laid just aft of the turbolift systems. Behind the lifts, and to both sides, were utility shafts and power distributors. Beyond that, power regulators existed on both sides of the frigate, with emergency power switching and distribution rooms even farther aft. Located near Deck 21 were emergency batteries for use in combat. These could also provide more power to the command module or its subsections if the supplied section was cut off from the main power grid of the ship."}, {"tag": "h4", "text": "Deck 26"}, {"tag": "p", "text": "All of Deck 26 was located in the command module of the ship, and it fell under the Fifth Section, as it housed water and air recyclers. The former were located along the entire port side of the deck, while the latter took up the starboard side. The recycling station of the Far Orbit was quite advanced, holding a 99.5% efficiency rating. The recycling system purified hundreds of kilograms of air and water a day, as the frigate did not store much of those, and thus the amount that it had had to be reused constantly. As a Nebulon-B, the Far Orbit could last for two years without restocking before its supply of air and water would begin to run out."}, {"tag": "p", "text": "The life support control center was located at the aft of Deck 26, behind the turbolift dock on that level, which was roughly in the middle of the deck. It was the control station for the ship's air, water, and gravity and had the responsibility of making sure that air and water made it to every deck unimpeded. Additionally, the station was tasked with preventing the gravity on the different decks of the ship from varying farther than .05 Gs. The life support station also had a hatch override control—with a higher priority than the security's override control—which allowed it to shut any hatches it wished in case of a fire. The fire would be extinguished after the hatch was sealed and all of the air in the room removed."}, {"tag": "h3", "text": "Modifications"}, {"tag": "p", "text": "Over the course of its privateering campaign, the Far Orbit underwent various modifications."}, {"tag": "p", "text": "The frigate acquired various bits of stealth gear to aid in its hunting of freighters, as well as some ion cannon batteries to help in capturing those vessels. These modifications were available from some of the galaxy's shadowports. Additionally, because of the loss of the Far Orbit's TIE complement, which left it vulnerable to a starfighter strike, X-wing starfighters and Z-95 Headhunters were added as replacements for the ones lost, as they were easier to acquire on the black market than TIEs. However, the TIE flight racks of the Far Orbit could not house these craft, so they were removed and the launch port widened. The bay's magcon shield was strengthened and enlarged, and the docking bay tractor beams were also enhanced. This modification to house a new complement of starfighters took twenty men."}, {"tag": "p", "text": "The Far Orbit was a standard frigate with no special modification. This changed with the mutiny aboard the ship and its ensuing service as an Alliance privateer, since the new mission profiles called for special weapons like ion cannons. Overtime, the privateers also linked the main reactor directly to the turbolasers, which drastically increased the firepower of the frigate, allowing the guns to keep firing as long as there was enough blaster gas."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Imperial service"}, {"tag": "p", "text": "The Far Orbit was constructed prior to 0 BBY and introduced into the Imperial Navy of the Galactic Empire, and command of the vessel was awarded to Imperial officer Vocis Kenit. Kenit's promotion to captain of the Far Orbit was partially a reward for his twelve years of Imperial service. However, the promotion also served as a convenient way for his many political enemies to get rid of him as Kenit helmed the Far Orbit in its search for pirates in the Outer Rim Territories. As the leader of the ship, Kenit was an authoritarian and a bit of a bully, and his ways of maintaining the discipline of his men were quite harsh. After receiving the rank of commander, Dhas Fenoep Vedij was transferred to the Far Orbit to serve as Kenit's second-in-command. Vedij's transfer coincided with his learning of the death of his father Ronnan Tyla Vedij—a former admiral—and his mother in a traffic accident on the planet Coruscant; the commander believed that his parents had actually been assassinated because his father was strongly against the retooling of the Imperial Navy."}, {"tag": "p", "text": "Two days after the death of Vedij's parents, the commander's younger brother Elon Vedij, who was a pilot, was transferred to the Far Orbit. Because of this, Vedij believed that he and his brother had been moved together so it would be easier for the Imperial authorities to get rid of them, due to their connection to their father. The commander began to plot a mutiny due to Elon's transfer and Kenit's lack of good leadership. In fact, many of the officers on the frigate disliked the captain. Kenit required that all senior officers join him for a formal dinner each night in the officer's mess, and forbade the playing of the gambling game of sabacc on the ship, as he was quite bad at it. Additionally, the violence of Kenit's command and his personality drove away more officers. One dissenting officer on the Far Orbit was reported to the Imperial Security Bureau and later died under strange circumstances."}, {"tag": "p", "text": "However, Kenit was proficient at taking out pirates: as a result of his organization of local Imperial assets into military strikes, three pirate lords and numerous lone pirating vessels were captured or destroyed. Shortly before 0 ABY, the Far Orbit was tracking the Silent Blades, a pirate gang that had destroyed several system patrol ships and starfighters, which had necessitated Imperial intervention. The frigate had the pirates running, and the Silent Blades holed themselves in an asteroid field. This initiated a standoff, as the Far Orbit could not easily get at the pirates, who were themselves trapped with the frigate outside the field."}, {"tag": "p", "text": "Ignoring Vedij's advice that the Far Orbit should wait for reinforcements, Kenit ordered a starfighter assault. Though the Silent Blades were almost eradicated, the entire TIE complement of the frigate, including Elon, perished in the attack. As a result, Vedij began to seriously plan a mutiny, as Kenit was wasting lives in order to gain glory or a promotion. Over the course of the next few months, the Far Orbit's second-in-command started to gather support among the frigate's crew members as he waited for an event from which he could trigger the mutiny via the crew's outrage."}, {"tag": "h3", "text": "Mutiny"}, {"tag": "p", "text": "The opportunity came when word reached the Far Orbit of the planet Alderaan's destruction at the hands of the Imperial DS-1 Orbital Battle Station superweapon because it had been suspected of harboring Alliance to Restore the Republic personnel and sentiments; at that time, the Empire was engaged with the Alliance in the Galactic Civil War. Because a shiphand on the Far Orbit was from Alderaan, the crew member was arrested for suspected treason against the Empire. Vedij, realizing that the arrest was related to Imperial propaganda, began to spread a rumor amongst the crew that the Alderaanian had only been arrested because he was from Alderaan, and that the destruction of the world had been a demonstration of Imperial might. In preparation for the mutiny, Vedij convinced the platoon of Imperial Navy troopers who provided half of the ship's security to stay in their quarters."}, {"tag": "p", "text": "Two-thirds of the crew joined Vedij in the mutiny after he announced it, and those who did not were placed with the platoon of stormtroopers who provided the other half of the ship's security; the stormtroopers had been caught off-guard by the false alarm that announced a riot, and security bulkheads had further trapped them. The single COMPNOR Observation officer on the frigate was overcome, and Kenit himself was captured on the way to the ship's bridge. Vedij's mutiny succeeded in seizing the vessel. The former captain of the Far Orbit and his Imperial loyalists were taken off the frigate in escape pods and some of the Nebulon-B's shuttles. Vedij and some of the mutineers personally placed Kenit in an escape pod along with a junior officer and six Imperial Navy troopers, but not before Kenit threatened Vedij and the rebellious crew with Imperial judgment."}, {"tag": "p", "text": "Shortly after the mutiny, Vedij, who had become the captain of the Far Orbit, announced on the frigate's comm that Kenit had been put off the ship. He also informed the crew that because most mutineers headed for the Outer Rim, the Far Orbit would go to the Core Worlds, specifically the Ringali Shell, to confuse the Imperials trying to track them, and that the frigate would teach the Empire a lesson. Half of the remaining crew jumped ship in escape pods and shuttles rather than staying with the mutineers, leaving the Far Orbit with barely enough crew to sustain it. In total, the ship retained 380 crew hands and twenty-five gunners after the event, with six months worth of consumables remaining. Furthermore, the crew leaving the Far Orbit left it with no escape pods and only two shuttles: a Grek-class troop shuttle and a Katarn-class boarding shuttle."}, {"tag": "p", "text": "Vedij cleared out the captain's ready room, which was filled with Kenit's personal possessions, and soon thought of a way to finance the Far Orbit in its fight against the Empire: the Far Orbit would become a privateer for the Alliance, and prey on Imperial ships. The captain also had all of the crew participate in combat training and had the engineers try to automate decks where there was little or no crew, as well as selecting decks and areas to be mothballed. The Far Orbit then set a course for StarForge Station, a space station located in the StarForge Nebula, where the ship could both take on crew and negotiate with the Alliance, which would hopefully grant them privateering status."}, {"tag": "h3", "text": "StarForge Station"}, {"tag": "p", "text": "It took the Far Orbit around eighteen hours to reach the StarForge Nebula, and once there, its crew began to use a chart that the Alliance had given them to search for the space station, which constantly moved around to avoid being caught by the Empire."}, {"tag": "p", "text": "After six hours of unsuccessfully scanning for the station, the Far Orbit encountered a quartet of BTL Y-wing starfighters that StarForge Station owned. After convincing the Y-wing pilots that the Far Orbit was indeed the frigate due to arrive at the space station, the Y-wings led the vessel to StarForge Station. The majority of the crew—including Vedij, as he was about to deal with the Alliance—were shuttled over to StarForge Station, where most of them were set loose to do whatever they wanted. However, Vedij and five others went to the Lean Nuuti Bar and Grill eatery, where they were to meet with an Alliance representative."}, {"tag": "p", "text": "Vedij had been instructed to come in a group of six to the eatery and to order flangth and ootoowergs alongside Shasa ale. Following this, they would be approached by an Ithorian, and a deal could be struck with the Alliance. The group did as instructed, placing their order with a serving droid in the Lean Nuuti Bar and Grill. Shortly after, an Ithorian staff member came up to them, and Vedij and another mutineer left with the Ithorian to discuss the deal with the Alliance. In that meeting, Vedij successfully obtained a letter of marque and reprisal from the Alliance that would allow the frigate to conduct raids in the Ringali Shell against Imperial forces and Imperial-allied transports as one of the first privateering vessels for the Alliance."}, {"tag": "p", "text": "The next day, after the general crew had time to browse the wares of StarForge Station's market, Vedij posted a call for people with experience with capital starships. At the hiring station on the station's docks, Vedij waited until a fair-sized crowd had gathered before announcing that the Far Orbit was looking for crew members who were technicians, general deckhands, or persons who knew how to operate a capital vessel. Vedij had them form a line to sign up."}, {"tag": "p", "text": "After applicants had signed up for a berth on the Far Orbit, the officers of the frigate staged a series of tests to see who was well-suited for serving on the Nebulon-B. Among those was a marksmanship test, in which the applicants involved had thirty seconds to hit five moving targets. Another test gave applicants a minute to plot an emergency astrogation course on a data pad. Yet another involved the new would-be crew members piloting a simulated Nebulon-B into a fight against Imperial TIE fighters. An unarmed combat test was also staged, with applicants pairing off against each other to wrestle. The top five of the wrestlers were given berths. Among those who were selected fit for service on the Far Orbit through those tests were Kanarak, a bloodthirsty killer; Swifty Yonsen, a spacer with a fierce reputation; Xad, a Falleen aristocrat; the gunhand Katiz Xemir; Gruk, a Gamorrean; the Tiss'shar pirate Pao-Neh-Lo; Cemma the Younger, another gunhand; the Sluissi engineer Napvansa Tadavv; and the Human Mii Heswop, a nitwit."}, {"tag": "p", "text": "After all the new hands were taken over to the frigate, Vedij took the last shuttle over and ordered the crew to get the frigate ready for departure from the nebula. The Far Orbit made it to the edge of the StarForge Nebula in a few hours and set out on its privateering mission. However, shortly after leaving StarForge Station, pressure began to rise between the mutineers and the new non-Human crew members, and due to this, a number of incidents occurred. The first was a brawl in the crew galley between the aliens and the Humans over food matters. Another incident involved Kanarak, who considered all Humans weak, killing all of the Humans he could find for that reason. After leaving StarForge Station, Gruk, who liked to fight, took on a Human and broke the man's back. Due to this, a group of Humans began to exact vengeance with clubs, which in turn led to the beating of lone aliens and Humans."}, {"tag": "p", "text": "Because of the friction between the Imperial mutineers and the fringe Humans who had been taken on at the space station, a career pirate officer challenged a mutineer officer to a duel in which killing was avoided. Vedij agreed to this, as this would be the end of a series of scuffles between the two sides. Another incident involved an important non-Human crew member offending a group of Human racists. That same crew member was killed with a stabbing weapon, and because of this, the tension between the aliens and the Humans increased."}, {"tag": "h3", "text": "The taking of Shipment 1037"}, {"tag": "p", "text": "For its first set of raids, the Far Orbit disguised itself as an Imperial ship. This was in part possible due to the fact that only the Empire possessed Nebulon-Bs at that time. With this cover story, the Far Orbit could easily board potential targets under the pretense of a raid and could even confiscate goods without breaking cover if need be. However, most of its raids involved dropping the Imperial façade after docking with the target. Throughout their raiding, the privateers used StarForge Station as the Far Orbit's main refueling and restocking destination. Additionally, an Alliance observer by the name of Major Cet Willak went along with the Far Orbit on its raids to ensure that the privateers were abiding by the rules of their contract."}, {"tag": "p", "text": "Shortly after the trip to StarForge Station, the Far Orbit traveled to the Nopces system, pretending to be an Imperial patrol frigate as it looked for its first major target. Following the change in watch on the sensors station, a light freighter was detected traveling from the world Nopces Prime toward the privateers. The freighter was Red Star Shipping Lines's Transport A-175, captained by Joh Steen. Thinking that the privateers were legitimate Imperial forces, the crew of the freighter let the privateers conduct an inspection of Transport A-175. During this inspection, the crew of the Far Orbit learned that the transport was going to be part of a convoy, Shipment 1037, which was departing from Brentaal IV—a world in the Bormea sector—in three days for the Outer Rim. Since the privateers considered the convoy a good opportunity, they offered to accompany Transport A-175 to the convoy, where they would supposedly participate in guarding the group of ships."}, {"tag": "p", "text": "Using a special communications link to the Alliance, the crew of the Far Orbit convinced them that they would divert the convoy into a trap which the Alliance could prearrange. This trap consisted of thirty-six Y-wing starfighters and a pair of CR90 corvettes. After the Far Orbit and Transport A-175 joined up with the convoy, the privateers managed to convince Captain Miech Conar of the frigate New Star, which was also guarding the convoy, that a new destination had been added to the group's route. There, the privateers said they would meet up with a larger escort force because a plot targeting the convoy had been discovered. The Far Orbit then led the convoy successfully to the position of the trap, and once there, the privateering frigate turned and used her forward guns on the New Star while the Alliance forces engaged the same frigate and helped keep the convoy in check."}, {"tag": "p", "text": "Vedij issued a command to the convoy, which contained twelve transports, ordering them to cut their engines and prepare to be boarded, and also had a jamming signal created to silence any calls for help. In the end, the New Star was subdued, with both it and its officers intact and undamaged. After capturing the convoy, which was carrying over 180,000 tons of mixed cargoes, the entire profit for the Alliance and the privateers was 340 million credits. Additionally, the convoy carried enough food supplies to completely restock the frigate's stores, so the Far Orbit sacrificed 18 million of the frigate's portion of the profits to acquire the supplies. As the Far Orbit had captured the New Star, the privateers were awarded an additional 3 million."}, {"tag": "h3", "text": "Dealing with Puulo, and early adventures"}, {"tag": "p", "text": "Sometime after the Far Orbit became a privateering ship for the Alliance, Vedij started to use the black market to acquire certain goods and resources—including weapons, starfighters, replacement parts, food, and personnel—for the frigate as the Far Orbit was not receiving much help from the Alliance. Vedij turned to a criminal faction run by the Hutt Shettora, which operated out of Brentaal IV. The faction controlled the black market around Brentaal IV and had decent goods and wares that were only marked up a bit over list price. Some of the frigate's crew went to Brentaal IV to negotiate an agreement with Puullo, a Hutt who served as a criminal lieutenant."}, {"tag": "p", "text": "An agreement was reached between the faction and the Far Orbit: for thirty percent of the goods and money that the frigate seized as a privateer, the Hutts would grant the frigate access to a shadowport, the ability for crew members to purchase illegal weapons from the faction, and protection from any bounty hunters who might be seeking the crew. Vedij, however, excluded in the agreement any weaponry that the Far Orbit might take from its targets, as the frigate was in need of additional armaments itself."}, {"tag": "p", "text": "Meanwhile, former captain Kenit had been picked up by Imperial forces and sentenced to death for failing to retain command of the frigate. However, this sentence was suspended until the result of Kenit's new mission was known. The assignment, which Imperial Advisor Sate Pestage provided, was to hunt down and destroy the Far Orbit and its new commander. Kenit was given command of the Nebulon-B Stalwart, and he started the search for Vedij and the frigate in the Outer Rim."}, {"tag": "p", "text": "Following their raid on the convoy, the Far Orbit had a couple of adventures that did not compromise their status as an Imperial frigate. One of these was where the frigate stumbled upon a pirate raid on a passenger liner, and because of the Far Orbit's cover as an Imperial escort vessel, the liner's captain asked the privateers for assistance. The Far Orbit defeated the pirates, but Vedij later offered them jobs under him as crew aboard the frigate. Vedij also decided at around that time to obtain a base of operations and sent a group of his crew to meet with a contact on Brentaal IV. While there, the group eluded Imperial Security Bureau agents who were tailing them, before negotiating with their contact in order to find a base for the Far Orbit."}, {"tag": "p", "text": "Shortly after the frigate's seizure of the convoy, the privateers came across a large Imperial Navy training exercise while near the Ringali Nebula. After a fleet of Star Destroyers and a multitude of smaller support ships exited hyperspace in that region, the Far Orbit was forced to take cover in the nebula to avoid being caught."}, {"tag": "h3", "text": "Capturing an Imperial Advisor"}, {"tag": "p", "text": "At some point after capturing Shipment 1037, the Far Orbit managed to intercept a key Imperial transmission, and the crew decoded it using their on-board equipment. The transmission stated that Imperial Advisor Coh Veshiv, who was on a fact-finding mission in the Ringali Shell after being sent away from Coruscant because he had annoyed Emperor Palpatine, was soon to arrive at the world of Esseles. Vedij and the crew saw the advisor as a prime target, not because of the 10,000 bounty he would fetch when he was handed over to the Alliance, but because he was a semi-important political player. However, as the exact route was not contained in the transmission, the Far Orbit would not be able to set up a blockade to stop Veshiv's CR90 corvette, the Empire Forever, and would instead have to go to Esseles if the privateers wanted to capture the Imperial Advisor."}, {"tag": "p", "text": "The plan was to capture Veshiv at his departure from Esseles via jump point 180:45:115, which was in the sights of the Golan III Space Defense NovaGun Platform 8127/121. After entering Esseles space, the Far Orbit transmitted its faked clearance codes to the Imperial authorities on request, and the crew took an orbit parallel to that of the Empire Forever. Upon approaching Veshiv's ship, Vedij hailed it and sent bogus orders to its captain, Annance, claiming that Far Orbit was going to take the advisor on the next leg of his journey. Partially because Veshiv had managed to annoy Annance throughout their time together on the CR90, the captain hardly looked at those orders and sent the advisor over to the frigate in the Lambda-class T-4a shuttle Myrenia, along with his two aides and his squad of stormtrooper bodyguards. As soon as Veshiv departed his shuttle in the hangar, he started to complain that he requested a cruiser, not a frigate or a corvette; Veshiv had been particularly annoyed and angry when he found that the ship that was assigned to him for his fact-finding mission was a mere corvette."}, {"tag": "p", "text": "However, Veshiv's complaining ceased after the frigate jumped to hyperspace, which led to the privateers' attempt to subdue the advisor and his retinue via force. Unable to call for help to the Empire Forever or Platform 8127/2121 because the Far Orbit was in hyperspace, the stormtrooper guards tried to storm the bridge of the frigate, which led to a firefight throughout the corridors of the ship. However, the privateers were successful, capturing the advisor and overwhelming his troopers; the pilots of the Myrenia had surrendered earlier after realizing they could not escape the frigate while it was in hyperspace. Upon capture, Veshiv followed all the orders of the privateers and, to ensure his welfare, told the crew of the Far Orbit useless information about the Imperial Court. The privateers handed the advisor over to their Alliance friends as soon as they could in exchange for the bounty."}, {"tag": "p", "text": "In response to the Far Orbit's seizure of Veshiv, the Empire became fully aware of the Far Orbit's activities in the Ringali Shell, compromising the frigate's cover as an Imperial patrol frigate. Two days after the capture, Pestage contacted Kenit on the Stalwart and informed him that the Far Orbit was in the Ringali Shell, not the Outer Rim. Thus, the former captain of the Far Orbit moved his search to the Core Worlds. In one of its raids, the Far Orbit attacked a Santhe/Sienar Technologies shipment which was guarded by a prototype TIE Advanced x1, a well-equipped starfighter that outclassed any of the fighters that the privateers had obtained. In the battle, the frigate managed to seize the prototype by using its ion cannons against it. The TIE Advanced was then added to the Far Orbit's complement."}, {"tag": "h3", "text": "Fighting with pirates"}, {"tag": "p", "text": "Because the encryption codes were changed, Imperial transmissions became harder to intercept for the privateers as time elapsed. However, the frigate could still easily intercept public transmissions, and sometime after the kidnapping of Veshiv, the sensor arrays picked up a disturbing news transmission. It was an Imperial HoloVision news report by Ashii Nermani that informed the public of pirate raids, undertaken by the Solar Terrors and their captain Venslas Beeli, on civilian transports near Brentaal IV, Esseles, and the world of Rhinnal. Beeli claimed to be an Alliance pirate, though some of the crew members of the Far Orbit remembered Beeli as a pirate from the Outer Rim, who once laughed at the idea of a rebel force striking against the Empire."}, {"tag": "p", "text": "Unbeknownst to the privateers, Beeli and his crew had been forced to commit those atrocities on pain of death after Imperial forces had captured them. Kenit, out to get the Far Orbit, had infected the pirates with Vira606, a non-contagious disease which could only be cured by a serum that the Empire possessed. Kenit had the pirates attack the civilians to poison the public's opinion against the Alliance for when the Far Orbit's crew announced that it was an Alliance privateering vessel, as well as to draw the frigate out. The crew of the Far Orbit decided to hunt down the pirates, as they were tarnishing the reputation of the privateers. The Far Orbit began to look for a pattern in the Solar Terrors' raids and to patrol probable raiding points. Though it was hard to tap into Imperial transmissions to unearth details about the raids, the crew managed to find an overall pattern: Beeli's vessels—the Zahtjav, the Javiq, and the Pyesmev—always hit Brentaal space every third raid."}, {"tag": "p", "text": "Eventually, the Far Orbit managed to catch the Solar Terrors in the act of raiding a ship in the Brentaal system; as part of Kenit's plan, Imperial patrol vessels in the Brentaal system had been ordered to step down to allow the Far Orbit a chance to find the pirates. The privateers engaged the pirates, who all ganged up on the Far Orbit on one side of the ship, staying out of its forward firing act. Beeli fought with abandon, as he wanted to die in battle and not succumb to a disease. In the end, the Far Orbit destroyed the pirates and their ships, ending the threat that they posed to the civilians and the privateers' name."}, {"tag": "p", "text": "At some point in time, Kenit placed bounties on the heads of Vedij and those who helped mutiny. Because of this, the bounty hunter Dej Vennor, who only took contracts that targeted pirates and their sort, went after the Far Orbit in order to claim the bounties. During one of their many raids, the crew of the Far Orbit seized cargo that contained a tracking device which Imperial Intelligence had hid there. Because of this, the Imperial special agent WRATH tracked the Far Orbit, and teams of undercover Imperial agents struck at places the frigate had just left, such as StarForge Station and the black market on Brentaal IV. These attacks sullied the reputation of the Nebulon-B and caused many to be suspicious of the privateers. Vedij, realizing that the Far Orbit was probably being tracked via a device, tried to use that information to stage an ambush to take out the agents."}, {"tag": "h3", "text": "It's a trap!"}, {"tag": "p", "text": "Shortly after dealing with the Solar Terrors, the Far Orbit was approaching a cheap jump-point in the space near Brentaal when it came across SPF 14897, a Mark III bulk transport from Santhe Passenger and Freight. The captain of the vessel, Mils Lolinc, was cooperative enough to transport a cargo manifest on request. Scans of the Mark III showed everything as normal, though the hold was ion shielded, which was standard procedure for a ship carrying ion engine parts."}, {"tag": "p", "text": "After docking with the freighter, the privateers carried out a raid on the ship. However, when they reached the cargo hold and opened it, they found that it was full of Imperial stormtroopers. Additionally, the opening of the hold triggered a hypertransceiver beam which alerted a nearby Imperial task force under the command of Kenit. SPF 14897 was actually the bait of a trap that the former captain of the Far Orbit had created. The hold of the Mark III was filled with twenty-four trained stormtroopers who specialized in counter-boarding and anti-piracy missions. Additionally, the hold contained ten SpecNav troopers and eight Imperial storm commandos. Leading the troopers in the hold was a trio of Imperial officers and the ISB agent Bannish Kolow, while the crew of SPF 14897 were all expendable CompForce Observers."}, {"tag": "p", "text": "The stormtroopers and the other Imperial forces on SPF 14897 were meant to occupy the Far Orbit and hold its crew until Kenit's task force, which was waiting mere minutes away by hyperspace, arrived. The task force was composed of the Stalwart, the Strike-class medium cruiser Hammer, two GAT-12 Skipray Blastboats designated SB-109 and SB-32, as well as the Immobilizer 418 cruiser Claw. Kenit's aim was to capture the frigate if possible."}, {"tag": "p", "text": "After the privateering boarders opened the hold, they were pushed back by the Imperials and their tactics, and only the reinforcements that Vedij sent in let some of them get out. The Imperial troopers then attempted a counter-boarding operation, aiming to take the Far Orbit's bridge, propulsion module, and operations section. To make matters worse, the Imperial task force then arrived, and the Claw targeted the Far Orbit with its gravity well projectors, preventing the privateers from escaping to hyperspace. From his command ship, Kenit informed the crew of the Far Orbit that they were all under arrest and that handing over Vedij would put a favorable light on them in their court trials. However, Vedij sent his crew to their battle stations and to repel the boarders from SPF 14897."}, {"tag": "p", "text": "While the Hammer and the Stalwart launched their TIE starfighters—of which the Strike-class had twelve and the frigate twenty-four—the pair of Skiprays flanked the privateering ship to target its engines and shield generators if need be. All of the ships, save for the Stalwart and the TIEs, attacked the frigate with ion fire, while Kenit's ships latched onto the privateers with its tractor beams to steady the ships and help its allies. However, Vedij and the privateers did not surrender, instead attempting to take out the Interdictor to open an escape route. Using the Far Orbit's tractor beams, they took hold of some of the Imperial TIEs, using them as shields against the Skiprays as the Far Orbit tried to close in on the Claw. The Imperial forces then switched to standard laser batteries from ion cannons and began to target the frigate's shield module and engines, while the rest of the TIEs were sent in to attack the main and secondary weapons. However, the Far Orbit made it to the Claw and managed to destroy one of the Interdictor's gravity wells in the engagement with the cruiser. Free to jump once again, the privateers left the system, escaping from Kenit's forces."}, {"tag": "h3", "text": "Return to Brentaal IV"}, {"tag": "p", "text": "After escaping Kenit's forces, Vedij had the Far Orbit withdraw to the nearest shadowport outside the Ringali Shell, as the frigate was heavily damaged. A couple weeks later, after the Far Orbit was fully repaired, the privateers returned to the Ringali Shell. Once there, Vedij, who had kept to himself for much of the recovery period, had the Far Orbit's first officer assemble a landing party for a special mission. This assignment was to acquire a datadisc from an Alliance contact on Brentaal IV in Kesk Cityblock's Pathline Tapcafe. Using a hyperspace-capable ship that the Far Orbit had captured during its campaign, the landing party jumped to Brentaal IV, leaving the Far Orbit to reach an empty system nearby. There, the frigate's crew turned most systems to minimal power in order to remain undetected."}, {"tag": "p", "text": "Meanwhile, the landing party managed to land on the world and made its way to the Pathline Tapcafe. Despite the absence of the Devaronian contact Tynial, who had been arrested, the group managed to find another contact who was disguised as a waiter. He directed the landing party to the abandoned night club Jovvitz, where he met the privateers and gave them the datadisc. However, ISB agents found them there and subsequently set upon the group of crew from the Far Orbit. Initially pursued by the ISB agents in speeders, the privateers made it back to their vessel after shaking the Imperial forces off their tail."}, {"tag": "p", "text": "The group reached orbit before Imperial command closed down Kesk Cityblock spaceports and ordered all ships originating there to return. Upon refusing to go back, the landing party's ship was attacked by six TIE fighters, forcing the privateers to activate their distress beacon to inform the Far Orbit of their situation. After receiving that same transmission, Vedij had the Far Orbit make a micro-jump to Brentaal IV, having the weapons prepared and the shields activated. Upon arrival, Vedij used a wide beam transmission to inform the public of the Far Orbit's turn to privateering because of the Empire's deeds, and also told them of his honorable intentions."}, {"tag": "p", "text": "Because this announcement hit the Brentaalian news channels and was broadcast to the public, all of the Imperial forces near the world were ordered to take out the Far Orbit, leading the six TIEs to disengage from the party's vessel and head for the EF76. Additionally, a pair of Hunter-Killer probots also tried to attack the Far Orbit, and on their way past the privateer landing ship, they attempted to capture it, though the fleeing vessel easily evaded them. Because the landing party had succeeded in escaping in its vessel, and because of the mass of Imperials coming for them, the Far Orbit left the Brentaal system. The datadisc turned out to contain the exact route of the Imperial Taxation Bureau's Emperor's Will, a Star Galleon-class frigate which was supposedly carrying 400 million credits' worth of metals, minerals, and spice. The datadisc claimed that the frigate was due at Esseles in three days and that it would be out of communication for the entirety of its journey through hyperspace, which started in the Arkanis sector and ended near Esseles. The datadisc also said that the frigate had an escort, a Nebulon-B known as the Zaff Jendinpurg."}, {"tag": "h3", "text": "Hunting the Emperor's Will"}, {"tag": "p", "text": "Knowing the route of the Emperor's Will, Vedij had the Far Orbit go to the edges of the Ringali Nebula, where they would pull the Star Galleon and its escort out of hyperspace by using asteroids to block their path. However, twenty-nine seconds before they were to revert to realspace, the frigate was pulled out early. The unexpected jolt that accompanied the early reversion resulted in seventeen minor injuries and three serious ones. One of the more seriously injured was Vedij, who was not strapped in like most of the crew and was thrown against a bulkhead. Additionally, a power generator was blown, some sensors were down, and the main hyperdrive generator was damaged, though the secondary generator was fine. The cause for the early reversion was discovered to be the gravity wells of the Claw, the same Interdictor that Kenit had with him when he tried to capture the frigate. The Claw was one of the many Imperial Interdictors that had been sent to the Ringali Nebula to catch the privateers as they went after the Star Galleon."}, {"tag": "p", "text": "The privateers attempted to race the Claw to the nebula, which was two minutes away at top speed, where they could lose it before jumping to hyperspace. As they were facing the Ringali Nebula and the Interdictor was turned away from it, the Far Orbit gained a good head start and passed under the Claw, all the while exchanging fire with the Interdictor. The Nebulon-B beat the Imperial ship to the nebula, partially because the Claw's gravity wells were draining its energy at the start of the race. Upon reaching the sensor dampening clouds of the nebula, the Far Orbit evaded the Claw and soon departed using its backup hyperdrive."}, {"tag": "p", "text": "The crew repaired the main hyperdrive and once again tried to catch the Emperor's Will near the Ringali Nebula. It took an hour to find an asteroid with enough mass to pull the Emperor's Will from hyperspace, and the crew then towed it and some other asteroids into position to make a mass barrier. The Far Orbit waited for the treasure ship and its escort to arrive, and, just a couple seconds behind schedule, they did. The asteroids pulled both vessels from hyperspace, with the Zaff Jendinpurg taking damage and swinging out of control. The Far Orbit concentrated its attack on the escort frigate, and as both Imperial ships were caught completely by surprise, the privateers dispatched the Zaff Jendinpurg with little difficulty, though the frigate managed to launch some of its complement and return fire with its cannons."}, {"tag": "p", "text": "While at first the Emperor's Will joined the fight with a barrage of concussion missiles aimed at the privateers, the Star Galleon-class frigate soon turned away and attempted to escape into hyperspace. However, this allowed the Far Orbit to target the Emperor's Will's unguarded aft, and the damage inflicted upon the Imperial frigate was enough to prevent it from making the jump, forcing the craft to reengage the Far Orbit. The captain tried to attack the Far Orbit's side, but realized that the battle was lost for the Imperials. Because of this, the captain, after using explosive charges to split the hull apart, ejected the Emperor's Will's cargo pod, which contained the treasure and had a built-in hyperdrive, in an attempt to deprive the privateers of it. However, the Far Orbit's crew captured the pod, securing the treasure within."}, {"tag": "p", "text": "The cargo hold contained a range of gems that included Bothan Glitterstones, chrysopazs, crystalline vertices, diamonds, emeralds, Gallinorean rainbow gems, a Jasse heart, kuggerags, a nova crystal, Quella gems, sapphires, and Sasho gems; among the treasure was also a single Corusca gem. Additionally, a Jorallan opal necklace and a pair of matched sets of Lalmy'ashian pearl necklaces and earrings were within the pod. As for spices, the cargo contained quantities of andris, carsunum, and ryll kor. The pod also contained valuable artwork taken from alien worlds. As far as metals, there were 1,836 bars of gold, 1,296 bars of mythra, and 936 bars of platinum. Additionally, the pod contained several hundred crates of both gold and platinum coins, all denoted with the Imperial seal, and weighing a total of 10 tons. However, the Emperor's Will's current cargo weighed far less than the frigate's maximum cargo capacity of 100,000 tons."}, {"tag": "p", "text": "Unbeknownst to Vedij and the crew, the Corusca gem among the seized treasure had unique tracking properties that Kenit knew about, as his brother was a gemologist. Kenit believed that though the Far Orbit and its captain might have been able to escape him for another half year, the Corusca gem sealed their fate. However, Kenit was summoned to his ship's holopod, supposedly by Pestage, before he could use the ability of the gem against the frigate. It was Emperor Palpatine himself, not Pestage, who called Kenit there, and the Sith Lord killed the Imperial captain from across the galaxy through the use of the Force. Kenit's secret about tracking the Far Orbit died with him."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "As a result of the Far Orbit's quick attacks and the ensuing panic among the local governments, the Imperial Navy, ISB and the Commerce Branch formed a joint committee to hunt down the frigate. A year later, this committee was still in operation due to the high increase in Rebel privateering that followed."}, {"tag": "p", "text": "The depredations of the Far Orbit wasted, according to Alliance Intelligence, a year's equivalent of an entire standard sector's production for the Galactic Empire, only to track down and recapture the vessel. The Alliance thus mainly benefited by the strain this caused on the Imperial budget, and not by the 120,000 tons of material which was diverted to their hands. Additionally, the Far Orbit's actions split the Imperial Navy's forces in the Darpa and Bormea sectors, panicked many of the local governors, and enraged Emperor Palpatine himself. The actions of the ship inspired many others to join the Rebellion against the Empire."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "h3", "text": "Captains"}, {"tag": "h4", "text": "Vocis Kenit"}, {"tag": "p", "text": "The Far Orbit's first captain, Kenit was given command of the ship as a gift for his loyal service to the Empire. As a rising officer in the ranks of the Imperial Navy, Kenit regularly reported the political failings of his superiors and rivals, and the certain Imperial ideologies that they lacked. This, in combination with his intelligent service, led to a series of promotions. However, many of these promotions served to also isolate Kenit from his political enemies, with the promotion to captain of the Far Orbit being one such move. As the commander of the frigate, Kenit was tyrannical, and his methods of keeping discipline on the ship were quite harsh and brutal, though his ship's treatment of prisoners was even worse. Because of his personality and desire for glory at the cost of others' lives, many of the officers aboard the Far Orbit disliked him, including Commander Vedij. Kenit's treatment of the crew was his downfall, as it was one of the contributing factors to the mutiny."}, {"tag": "p", "text": "Following the mutiny, Kenit was imprisoned and then court-martialed for failing to retain command of the Far Orbit. He was sentenced to death, though he was spared on account of being assigned to hunt down his former ship. Success would clear his name, while failure would result in his death. Kenit tried multiple ploys to catch the Far Orbit, including manipulating the privateers to attack the Silent Blades and almost trapping them near Brentaal. However, his continued failure to catch the frigate caused Palpatine to execute him."}, {"tag": "h4", "text": "Dhas Fenoep Vedij"}, {"tag": "p", "text": "Born into a wealthy family with ties to the Imperial Navy, Vedij was transferred to the Far Orbit, where he served as Kenit's second-in-command. The commander heavily disliked Kenit, as he was the captain only because of his proficiency in political games and because of his command style. Kenit's poor leadership and the death of both of his parents and his brother led Vedij to seize the Nebulon-B from his superior officer via a mutiny. Vedij was an excellent leader and strategist in battle scenarios and was completely dedicated to the Far Orbit after the mutiny. He was quiet, and because he was sagacious and cold in nature, Vedij had few friends."}, {"tag": "p", "text": "Following the mutiny, Vedij led the mutineers to become privateers for the Alliance. He remained their captain throughout the Far Orbit's many missions and attempts to evade Kenit and his forces. During their search for the Emperor's Will, he was injured when the Claw pulled them from hyperspace, though he recovered enough to command his frigate during the capture of the Emperor's Will's cargo pod."}, {"tag": "h3", "text": "Crew"}, {"tag": "p", "text": "As an Imperial vessel, the Far Orbit's crew was composed of some individuals drafted into Imperial service and others who had voluntarily joined the Navy. After the mutiny, when the Far Orbit took on more crew, the staff became a mix of mutineers as well as pirates and other lowlifes. With the majority of the mutineers being Human, and the new crew members taken on at StarForge Station aliens, tensions rose between the two sides, which led to a series of incidents."}, {"tag": "h3", "text": "Command sections"}, {"tag": "p", "text": "The Far Orbit's crew was divided into separate sections that each looked after different areas of the ship. Each section was commanded by an officer and had their headquarters of sorts on the main bridge. After the mutiny, Vedij kept intact much of the command sections that the Imperial Far Orbit had established."}, {"tag": "p", "text": "The Operations Section was the largest section in the Far Orbit. It was responsible for the overall running of the ship, as well as insuring that all the other sections worked together. Several other sections reported directly to the Operations Section, and the Ops Officer served as the frigate's second-in-command; prior to the mutiny, Vedij held the position of Ops Officer."}, {"tag": "p", "text": "The Quarters section had the responsibility of maintaining the living parts, such as the crew quarters, of the Far Orbit. Although enlisted personnel on the frigate kept their own quarters clean, there was a small staff of droids and hands who cleaned the officers' areas and the public places. The Quarters Section also ran the main galley and the autochef, and was one of the more minor administrative posts aboard the frigate. Generally, on most Imperial ships, a junior lieutenant headed the Quarters Section and reported to the Operations Section. The Engineering Quarters Section was located underneath the Quarters Section and had the same officer in charge."}, {"tag": "p", "text": "The Command Section of the ship had the overall responsibility of the entire frigate. It was connected to Link Command, the mind of the Far Orbit. All of the other sections of the frigate answered to the Command Section, as the Command Section Chief was the captain of the Far Orbit."}, {"tag": "p", "text": "The Secondary Engineering section had the job of keeping the power running and performing maintenance and repairs for the ship. It was also in charge of emergency power if the command module was cut off in any way from the propulsion module at the aft of the frigate. Secondary Engineering was commonly referred to as the Power section, to differentiate it from the Primary Engineering section. The commanding officer of Secondary Engineering was known as the Power Chief, and he or she reported both to Engineering and to the Operations Section."}, {"tag": "p", "text": "The Life Support section, sometimes referred to as Life, was one of the most valuable sections of the Far Orbit. It maintained the atmospheric tanks, air scrubbers, water system, gravity generators, and all of the temperature controls. The commanding officer in Life Support was known as the Chief of Life Support, and he or she worked with Secondary Engineering and also answered to Primary Engineering."}, {"tag": "p", "text": "The Sensors and Communication section also known as SenCom, was split into three sections. The main sensors area was located near the ventral end of the command module, while both the primary and secondary communication areas were at the top of that same module. The sensors and communications sections were separated in order to reduce interference, though they were grouped in the same command section because they were similar in nature, as SenCom acted as the Far Orbit's senses. The SenCom Chief led Sensors and Communications and had two other experts beneath him in rank: the Sensor Officer and the Communications Officer. Both sensors and communications each had a separate spot on the bridge. Answering to the captain himself, the SenCom Chief was a role that was mostly administrative."}, {"tag": "p", "text": "The Weapons and Security section was responsible for all aspects of the Far Orbit's weapons and shielding. The frigate's staff of gunners and shield operators was relatively small in number. Prior to the mutiny on the Nebulon-B, security was managed by the Weapons Officer, who controlled the Imperial Navy troopers. Before the mutineers took over, the stormtroopers aboard the Far Orbit had their own internal administration and answered more readily to Kenit and the CompForce Observer than to the Weapons Officer. After the Imperial troopers were removed from the ship during the mutiny, boarders assumed the stormtroopers' roles."}, {"tag": "p", "text": "The Flight and Vehicle Operations Section was also known as the FVO or Boom section and was responsible for maintaining and operating all of the Far Orbit's fighters, shuttles, and ground vehicles. Immediately after the mutiny, due to the loss of the TIE complement, the escape pods, and most of the shuttles, this section's staff was rather small. Additionally, the frigate was never issued ground vehicles. The FVO section was under the command of the Operations Section."}, {"tag": "p", "text": "The Deflectors section operated out of a small armored module that was located near the engineering section. It was only in use when the Far Orbit was in or preparing for a combat situation. In a combat scenario, the section was a high-priority target, as it was very important. Most repairs, if they were simple enough, could be completed by the Deflectors section's staff. The administration for the Deflectors section was located at the top of the propulsion module, and the Deflector Chief answered to the Weapons Officer from the Weapons and Security Section."}, {"tag": "p", "text": "The Engineering section was responsible for the operation of the ship's engines and for supplying the ship with power. Additionally, the section had the job of maintaining the frigate's hardware and other technical aspects. The Chief Engineering Officer was in charge of the section, and he or she had a couple of sections under his or her authority. The Engineering section was based in the main engineering area, in the propulsion module."}, {"tag": "p", "text": "The Engines section contained all of the technicians needed to run the engines and much of the other equipment in the propulsion module."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Far Orbit was first mentioned in the premier edition of the The Rebel Alliance Sourcebook, published in 1990 by West End Games. It was also mentioned in the second edition, released in 1994. The year 1997 saw the publication of Pirates & Privateers, a supplement for Star Wars: The Roleplaying Game, which also mentioned the Far Orbit. The Far Orbit Project was released in 1998 as a sequel of sorts to Pirates & Privateers, with the privateering frigate playing an important role as the book's main vessel. The book provided a thorough description of the Far Orbit as well as deck plans for some of its levels. The Nebulon-B was featured in all eight of The Far Orbit Project's adventure scenarios: Preparing for War, The Hijacking of Shipment 1037, The Capture of Coh Veshiv, The Rival, The Trap, Raid on Brentaal, Hunter/Hunted, and The Grand Prize. The definitive final fate of the Far Orbit is not mentioned in the book or the scenarios, and it is unclear whether or nor the Imperials managed to catch the privateers in the end. The Far Orbit also received a small entry in The Complete Star Wars Encyclopedia in 2008 and was mentioned in some of the compendium's other entries."}, {"tag": "p", "text": "The Far Orbit Project divides the campaign of the Far Orbit into three phases. The first phase, known as \"Predator in the Fold,\" is the easiest for the players participating in the game, as the Empire is unaware of their activities and is not actively pursuing the frigate. However, this can only last so long, since the Empire soon becomes aware of them shortly after the privateers capture Shipment 1037—or another large convoy, as chosen by the gamemaster presiding over the game. The capture of Advisor Veshiv ends Phase 1, making the Imperial forces fully aware of the Far Orbit and its endeavors. Other events can replace the taking of Veshiv as the one that alerts the Empire, but that then prevents the capture from occurring."}, {"tag": "p", "text": "In Phase 2, which the book entitles the \"Gathering Storm,\" local security forces are stepping up their game in order to catch the privateers, and Imperial propaganda is being used to paint them in a bad light as Imperial forces pursue the frigate. Phase 2 ends when the Far Orbit is defeated by the Imperials, and in the adventure scenarios, this is during The Trap. The last phase, named \"Stormbreak,\" begins when the Far Orbit returns from its rest after its defeat at the hands if the Imperials. Although the Imperial forces at the beginning no longer consider the ship to be a threat because it was driven off, they soon start to hunt the Far Orbit in force once again."}, {"tag": "p", "text": "The last adventure scenario does not have to be the end of the Far Orbit's campaign, and the gamemaster can have the privateers continue their raids if he or she wishes. Additionally, they can have the Far Orbit meet ruin and have Vedij killed if they think that is the best course of action. The Far Orbit Project contains some suggestions for the gamemaster to use if they wish to continue the campaign after the adventure scenarios."}, {"tag": "h3", "text": "Alternative scenario paths"}, {"tag": "p", "text": "As The Far Orbit Project is a supplement to a roleplaying game, players can take many paths while playing the scenarios within the book. The choices made in the body of the article were chosen because they enable the Far Orbit to accomplish the most and gain the greatest profit in the raids without harming any future ones. Below are some of the alternative paths—and their consequences—that players can take:"}, {"tag": "h4", "text": "Preparing for War"}, {"tag": "p", "text": "Preparing for War is the first scenario in The Far Orbit Project. In the scenario, Vedij and the frigate go to StarForge Station in search of a crew. While looking for the station in the nebula, it is possible for the Far Orbit to find StarForge Station's location before the Y-wings encounter them. However, this is less likely than the scenario in which the fighters locate them first and thus is not chosen. For all of the tests that are listed as ones that can help judge whether a potential character is good enough to serve on the frigate, this article assumes that all are undergone as part of the selection. As for all the individuals that are listed as potential candidates, it is presumed that they all pass the tests or do well enough in them. This is because some of them, such Gruk and Kanarak, take part in the situations that the Human–alien tension creates. This article considers all of those situations to be canon."}, {"tag": "h4", "text": "The Hijacking of Shipment 1037"}, {"tag": "p", "text": "The Hijacking of Shipment 1037 involves the Far Orbit's raid on the convoy, and it too has many paths that can be followed. The frigate's crew can raid Transport A-175 instead of accompanying it, and during that potential raid it is discovered that A-175 is headed for the convoy. However, because the adventure scenario highly recommends that the Far Orbit accompany A-175 to the convoy and not raid it, this article takes that course. In the case that the players fail to think of taking the convoy after inspecting A-175, Captain Vedij, who mostly is controlled by the adventure's presiding gamemaster, suggests the idea. If the Alliance does not help the privateer during the battle, the Far Orbit can target the New Star in order to capture it, or the players can attempt to apprehend as many transports as possible. In the case that the Alliance does not decide to help the privateers, the players can chose not to attempt to take the convoy, as it is quite risky."}, {"tag": "p", "text": "In the event that the Far Orbit indeed has Alliance help and the players do not spring the trap when they are in the right spot, Vedij does so by default. In doing so, he turns the Far Orbit and attempts to destroy the New Star. In the case that the privateers manage to capture the New Star undamaged, with its crew also intact, the Alliance awards them 3 million, and 2 million if the Imperial frigate is captured but seriously damaged. If the New Star is destroyed during the battle, only 1 million is awarded, while the Far Orbit gets nothing at all if it escapes from the trap, even if it is damaged. This article assumes that the Far Orbit fulfilled the mission in the best way possible."}, {"tag": "h4", "text": "The Capture of Coh Veshiv"}, {"tag": "p", "text": "The third adventure scenario, titled The Capture of Coh Veshiv, tells of the Far Orbit's seize of the Imperial Advisor. Here, there are less possible paths than usual. Although Vedij proposes the capture of Veshiv, it is completely up to the players to decide how to do so. The scenario suggests the likeliest course of action—capturing him on departure—and then proceeds to state how to accomplish that. This article therefore assumes that this course of action is the most canon. If the players fail to give the right identification codes to the Imperial authorities on Esseles, Vedij will step in to save them. There are only two different scenarios that can occur during the capture of the advisor. One of these is for the privateers to wait till the Far Orbit is in hyperspace before capturing Veshiv, while the other is for them to proceed without waiting. The latter allows the crew of the shuttle Myrenia to attempt to blast out of the cargo bay to escape, and it also allows them to contact the Empire Forever or Platform 8127/121 for help. As the first option prevents them from doing so, it is considered the most canon."}, {"tag": "p", "text": "The third scenario also contains three scenario hooks of sorts that are all placed before the events at Esseles. In the passenger liner scenario, there are a couple of paths that can occur. One is where the Far Orbit merely fights off the pirates. This option can be expanded into the path that this article takes, in which the Far Orbit seemingly defeats the pirates so that Vedij can offer them jobs on board the frigate. Another path is where the pirates and the Far Orbit gang up to take out the liner and seize the loot, or the players can take out the pirates to keep all the rewards for themselves. However, since the liner's passengers would most likely be ransomed, this would cause the Far Orbit's cover story as an Imperial frigate to go up in smoke as soon as the passengers were released. Thus, the option to seize the passenger liner is not taken. The other two scenario hooks do not have any paths that can be taken, though the one involving the training exercise advises that the privateers do not attack the Imperials, as they would risk the wrath of the entire fleet."}, {"tag": "h4", "text": "The Rival"}, {"tag": "p", "text": "The Rival is the fourth scenario, in which the privateers went up against Beeli and his pirate gang. Here too there are different paths that can be followed, and these occur during the final battle with the pirates. There are three different options that can occur. One is in which the Far Orbit manages to track down the Solar Terrors to where they have a deep space rendezvous with Kenit and the Stalwart. However, the smartest thing for the privateers to do here is flee, as they are outnumbered. Another possibility is that the Far Orbit catches up to the Solar Terrors while the pirates are fleeing from a Sector Ranger patrol and three IPV-1 System Patrol Craft. This puts the Imperials momentarily on the side of the privateers, as they both try to take down the pirates. The last scenario is the one where the privateering frigate catches Beeli in the act of raiding. Since the last scenario is the most plausible, this article assumes that case occurs."}, {"tag": "p", "text": "In the fight, since Beeli is fighting off a fatal illness and wishes to die in battle, it is most likely that all of his ships will be destroyed, because he will ram his ships into the Far Orbit if necessary. Thus, this article presumes that Beeli died and that all of his starships were destroyed in the battle. The gamemaster can choose to use the pirates, instead of SPF 14897, as the bait of the trap in the scenario. However, as this cuts out the majority of the first half of the fifth adventure scenario and also removes the boarding action, it is assumed that this option is not taken."}, {"tag": "h4", "text": "The Trap"}, {"tag": "p", "text": "The fifth adventure scenario contained within The Far Orbit Project, The Trap, is where Kenit attempts to snare the privateers using SPF 14897 as bait. Once again, there are many paths that can be chosen. In response to the stormtroopers in the hold of the Mark III, the players can either send in more troops to help get the boarders out of SPF 14897, or disengage from the freighter entirely, leaving the boarders to their doom. Although the first option gets more crew killed, it helps maintain morale among the frigate's crew; hence, this is the option that this article chooses. Though the second possibility prevents any counter-boarding, it kills the crew's morale."}, {"tag": "p", "text": "The battle with the fleet allows many paths to occur. One such one is where Vedij surrenders himself to Kenit in exchange for letting the privateers go. However, the Imperial captain plans to double-cross his former second-in-command and kill the crew as soon as he has Vedij. While their captain is shuttled over to the Stalwart, the crew of the Far Orbit devises a new plan and escapes from the present Imperial forces before vowing to return to free their captain. The article does not use this option as the canon one because it does not quite flow with the later adventures, since Vedij is left in Imperial hands. Another path involves the Alliance sending a small fleet to rescue Vedij and his crew, composed of twenty-four X-wing starfighters and ten CR90 corvettes. Although they distract the Imperials long enough for the frigate to escape, the cost of the operation means that the Alliance will no longer provide aid."}, {"tag": "p", "text": "Another possibility is that the Far Orbit battles it out with the Imperials and, in doing so, destroys or drives off all the opposing battleships. This, however, is unlikely due to the odds stacked against them and results in the Far Orbit being heavily damaged. However, the privateers can scrounge for spare parts from the destroyed Imperial vessels. This option draws lots of Imperial attention because of the Far Orbit's victory, and a whole fleet, including some Star Destroyers, is sent after the privateers. This causes StarForge Station to bar them from restocking there in order to avoid detection by the Imperials. The article does not choose either of the latter two possibilities because the first prevents the Alliance from helping them again, while the second is highly unlikely and sends more Imperials after them."}, {"tag": "p", "text": "There is one more possibility: the Far Orbit disables the Claw to escape. This is the option that this article uses, as it does not harm any of the Far Orbit's later adventures. There is an extension to the path where the frigate takes out the Interdictor's gravity wells, involving the Nebulon-B using its tractor beams to maneuver the enemy fighters into a collision with the weapons of the Claw, and then using the crippled ship as a shield against enemy fire. However, this part of the option is avoided because it would seriously damage or destroy the Claw, which appears later in canon in the 1999 video game Star Wars: X-Wing Alliance."}, {"tag": "h4", "text": "Raid on Brentaal"}, {"tag": "p", "text": "The sixth scenario, Raid on Brentaal, has the least path deviations out of all the other adventure ideas. The ship that the privateer landing party uses to go to Brentaal IV from the Far Orbit can be a shuttle, but the scenario suggests that it is a freighter. The scenario itself can be changed into a privateer-only mission by the gamemaster if he or she deems it so, with the crew researching the planet before making a small base of operations there. They thereafter acquire the information that is on the datadisc in the normal adventure via a slicer and flee the world. However, since the scenario contains a much more detailed telling of the Alliance and the privateering mission, this article presumes that that path is taken."}, {"tag": "h4", "text": "Hunter/Hunted"}, {"tag": "p", "text": "The seventh adventure idea, dubbed Hunter/Hunted, is short and tells of the Far Orbit's encounter with the Claw in the Ringali Nebula. In the case that the Claw was destroyed in its earlier encounter near Brentaal IV with the privateers, a different Interdictor pulls them out instead. As the Claw was featured in X-Wing Alliance, this is not considered canon. There are two main paths that can be taken. The first involves the one that this article selects, which is where the Far Orbit flees to the nebula. Once there, the frigate can escape to hyperspace or try to board the Interdictor via a shuttle. The boarders seize the Imperial vessel's bridge before using stun gas to take out the crew, while the stormtroopers are also dealt with. This would leave the Claw under the privateers' control and would be beneficial for future raids. However, as the Claw is in Imperial possession in X-Wing Alliance, this path is not considered canon. A totally different option is to assault the Claw right after the privateers are pulled from hyperspace. Because they have a superior crew, the Far Orbit manages to neutralize the threat of the Interdictor, and it escapes before Imperial reinforcements arrive. However, as it is very unlikely that the Nebulon-B would be able to pull this off, this article does not utilize this path."}, {"tag": "h4", "text": "The Grand Prize"}, {"tag": "p", "text": "The last of the scenarios is The Grand Prize, in which the Far Orbit attempts to capture the Emperor's Will. In this scenario, as the privateers do not want to destroy the treasure in the cargo pod by blowing away the Star Galleon, the Emperor's Will must be neutralized. Options include precision fire against the engines of the Imperial ship, ion cannon fire against the main hull if the Far Orbit has acquired those, or even attaching the Far Orbit to the Imperial frigate with its tractor beams to prevent it from escaping. It is also possible for the players to deliver the ion charge via starfighters if they have acquired them in their prior raids. The Emperor's Will can also be boarded if the players wish to do so, but the stormtroopers will resist the intrusion; The Far Orbit Project itself states that if the gamemaster wishes to kill Vedij off, as this is the last adventure scenario, the boarding would be an ideal place to do so, as long as the death is heroic."}, {"tag": "p", "text": "However, it doesn't matter much how the Emperor's Will is neutralized, as it still releases its cargo pod. As a result, this article does not choose one of the options as the best one, and the canon one, though the boarding possibility with Vedij dying is not considered one of the better options. Once the cargo pod is launched, the gamemaster can choose to have Imperial vessels arrive on the scene and delay the privateers long enough for the pod to make an emergency jump to hyperspace. The Far Orbit must then elude an Imperial task force that is dispatched in search of the Emperor's Will, which is led by a Star Destroyer, as the privateers try to find the pod and then disable its tracking device so the Imperial forces cannot track it. The frigate can then seize the pod with its tractor beams before attempting to open it. However, this article presumes that the gamemasters is not so mean as to send Imperial ships to prevent the privateers from seizing the loot."}, {"tag": "p", "text": "When the players try to open the cargo pod, it can be booby-trapped with fragmentation explosives, highly charged electrical locks, or antipersonnel blasters. For each of the players' failure to open the pod, a boarder is killed. Gamemasters can change the contents of the cargo pod and, subsequently, their total value to align with the scale of the Far Orbit's campaign and the players' preferences. They can even choose to add unique items to the pod, such as a Jedi holocron, to spice up the loot."}, {"tag": "h3", "text": "Scenario Hooks"}, {"tag": "p", "text": "The Far Orbit Project also contains a complement of scenario hooks that are adventure stubs that the gamemasters can expand upon. Some of the ones that do not interfere with the canonicity of the adventure ideas were added to this article. These include The Price of Success, Tracking Devices, and TIE Prototypes. However, a trio of Scenario Hooks—Smash the Scourge, Who Is The More Foolish?, and Raid on 2LC/Blue—are not considered canon, as they contradict events in The Capture of Coh Veshiv."}, {"tag": "p", "text": "Raid on 2LC/Blue involves the players targeting the Imperial Bavos-I heavy-duty military space platform Station 2LC/Blue. They can either raid its supplies that are delivered by small freighters, or attack the station itself with a team of boarders disguised as Imperial troops or staff in order to steal the facility's starfighters and supplies. Who Is The More Foolish? has the privateers conducting raids against Station 1B6/Green, a Bavos-II heavy-duty military space platform, so that the Victory I-class Star Destroyer Scourge would be drawn away from the world of Ralltiir, allowing the Alliance forces there to slip more blockade runners through."}, {"tag": "p", "text": "Smash the Scourge involves the Far Orbit committing small raids against 1B6/Green until the Scourge is actively chasing the privateers. Once this has happened, Vedij lures the Star Destroyer to a prearranged ambush site, where an Alliance task force tries to capture the Scourge. However, all three of these scenario hooks have the Far Orbit giving up its cover as an Imperial escort frigate, which directly contradicts The Capture of Veshiv, in which the Far Orbit loses its cover. Another scenario hook that is not considered canon is Never Raid An XTS Freighter, in which Vedij and the privateers deal with the consequences of seizing a ship owned by Xizor Transport Systems. Some of these consequences include Puullo reneging on his promises to the Far Orbit, StarForge Station not allowing them to dock there, and teams of mercenaries and thugs pursuing the Nebulon-B."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}