{"url": "Farnel_Research_Facility_Industrial_Complex", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Bugtown locations", "Category:Medical facilities"], "nodes": [{"tag": "h1", "text": "Farnel Research Facility Industrial Complex"}, {"tag": "p", "text": "The Farnel Research Facility Industrial Complex was the primary industrial facility for the Farnel Research Facility, a research complex located on the planet Balmorra. When the Farnel Research Facility was overrun by insectoid Colicoids, the entire area became known as \"Bugtown,\" and the Colicoids established nests within the Industrial Complex. The Balmorran resistance later drove the Colicoids out and established a hospital in the facility, though they continued to suffer Colicoid intrusions during the battle against the Sith Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Farnel Research Facility Industrial Complex was built as part of the Farnel Research Facility, a scientific research facility built on the edges of Lake Farnell on the planet Balmorra. The facility's industrial complex was an underground bunker that on the northern side of the facility and the bunker was filled with industrial and scientific equipment. However, when the insectoid Colicoids that were being experimented on at the lab were released, they overran the area, and the industrial complex was one of several facilities that they established nests in. When the Balmorran resistance and the Republic Military retook the bunker, they converted it into a hospital and brought in medical equipment.,"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Farnel Research Facility was an experimental genetic research facility established with the aid of the Colicoid Creation Nest, a group of Colicoids dedicated to the improvement of their species, sometime before the Great Galactic War between the Galactic Republic and the Sith Empire. The facility experimented on and mutated Colicoid specimens, turning them into vicious monstrosities but granting them the ability to metabolize the toxic waste common to the industrial planet. The Farnel Research Facility Industrial Complex also worked on other weaponry, such as a powerful neutron detonator. However, during the Great Galactic War, Balmorra was targeted for invasion by the Sith Empire, and Imperial saboteurs released the Colicoid specimens. The Colicoids immediately overran the entire complex and killed the facility's staff, making nests in the industrial complex and other sections of the Farnel Research Facility—an area that soon became known as \"Bugtown.\""}, {"tag": "p", "text": "The Colicoids released from the facility soon spread to other parts of the planet, but Bugtown remained infested with Colicoids for decades as the Empire and Republic battled for control of Balmorra. Around 3643 BBY, a decade after the end of the Great Galactic War and the beginning of the Cold War between the Empire and the Republic, Imperial forces began making incursions into Bugtown and established a foothold there. Lieutenant Piloc of the Fifth Infantry's First Battalion heard a rumor about the neutron detonator that had been under development at the industrial complex, and sent his squad on several assaults on the Colicoid-infested bunker in an attempt to acquire the plans. Private Suzoku discovered that Piloc had lied about being ordered to retrieve the plans, which was why Piloc refused to call for reinforcements; however, Suzoku was trapped in the complex on the third attack. He managed to leave behind a recording describing Piloc's incompetence and his actions before the Colicoids killed the soldier."}, {"tag": "p", "text": "Not long afterwards, Imperial-allied individuals sent by Piloc were able to penetrate the bunker and retrieve the plans, and though Suzoku's recording was found, Piloc's incompetence was not reported to his superiors."}, {"tag": "p", "text": "By 3642 BBY, the Galactic War had erupted between the Republic and the Empire, and Republic forces established a beachhead in Bugtown and drove back the Colicoids. The Balmorran resistance against the Empire took over the now-cleared industrial complex, and the combat medic Archiban \"Doc\" Kimble headed a hospital in the facility. However, the Colicoids burrowed underground and attacked the industrial complex; Kimble and his patients were saved by the timely arrival of the Jedi Knight known as the Hero of Tython, who drove back the Colicoids and gave Doc's staff time to move their patients to the bunker's secure area. After the attack, Doc refused to evacuate his patients due to the severity of their wounds, so he asked the Jedi to acquire Imperial trauma kits to stabilize his patients. Once they were stabilized, the wounded were evacuated and the facility abandoned due to the Colicoid threat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Farnel Research Facility Industrial Complex first appeared in Star Wars: The Old Republic, a video game released by BioWare in 2011. Unlike most worlds, the planet Balmorra is not a shared-faction planet, and thus is different for Republic and Imperial players. On the Imperial version of Balmorra, the complex is the site of the Heroic mission \"A Question of Motivation,\" which ends with players choosing whether or not to report Piloc for his incompetence. As Imperial players are assumed to make the choices that reward dark side alignment points, this article assumes that Piloc was not reported, as it is the dark side option in the mission. The Republic version of Balmorra includes the complex as a class-restricted phase for players in the Jedi Knight class, and is the site of the class mission \"Lives in the Balance.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}