{"url": "Farnsworth", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with gameplay alternatives", "Category:Ithorians", "Category:Males", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Farnsworth"}, {"tag": "p", "text": "Doctor Farnsworth was a male Ithorian scientist who traveled to the planet Kashyyyk to study the environment around the city of Kachirho. Sometime after the Battle of Yavin, when five of Farnsworth's environmental survey devices stopped transmitting, the Ithorian doctor enlisted the help of a passing spacer, whom he told to go find the survey devices and bring back their data to him. After the spacer completed his task, Farnsworth gave the helpful being 10,000 credits and a painting of a Clone Wars-era clone trooper for assisting him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Doctor Farnsworth was an elderly Ithorian male scientist who decided to do a study of galactic history. During his historian career, Farnsworth had a painting of an Old Republic clone trooper dressed in Phase I armor commissioned."}, {"tag": "p", "text": "After his tenure as a historian was finished, Farnsworth journeyed to the Wookiee homeworld of Kashyyyk to study the local environment around the city of Kachirho. Shortly after the Battle of Yavin, five of his environmental survey devices stopped sending in signals, likely due to atmospheric interference. As a result, someone needed to go out into the forest and download the memory from the devices by hand, but the area around the devices was far too dangerous for the aged Ithorian to travel through, being filled with a variety of deadly predators, including varactyl and bolotaurs."}, {"tag": "p", "text": "However, Farnsworth soon met a passing spacer, who—after Farnsworth explained his predicament—agreed to go out and collect the data from the survey equipment and bring it back to the Ithorian. After the spacer retrieved the information, Farnsworth gave the spacer 10,000 credits and his painting of the clone trooper as payment for the spacer's services."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Doctor Farnsworth was very polite when he conversed with the spacer, a being he had never seen before. When the spacer retrieved his survey data, Farnsworth both graciously thanked and paid the spacer for his helpfulness. The Ithorian also cared about the spacer, hoping that his helper would not get hurt while searching for the data. Farnsworth admired Kashyyyk's nature and forests, believing them to be a fascinating study and a lovely landscape. Farnsworth had a wispy white and brown beard, brown skin, and brown eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Doctor Farnsworth made his first and only appearance in the 2005 Star Wars Galaxies expansion pack Rage of the Wookiees, prior to the game's closure on December 15, 2011. In the game, he had a quest that the player could complete for experience points and other rewards. Although the player could choose not to do Farnsworth's quest and refuse his request for assistance, this article assumes 100% game completion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}