{"url": "Faro_Argyus", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Captains", "Category:Confederacy of Independent Systems individuals", "Category:Galactic Republic defectors", "Category:Humans", "Category:Males", "Category:Senate Commandos"], "nodes": [{"tag": "h1", "text": "Faro Argyus"}, {"tag": "p", "text": "Faro Argyus was a human male captain who served with the elite commandos of the Senate Guard during the Clone Wars. He betrayed the Galactic Republic while on an assignment to deliver Viceroy Nute Gunray to Coruscant, believing that his contribution to the rescue of a Separatist leader would be rewarded by Count Dooku. Argyus was killed, however, by Dooku's personal assassin, Asajj Ventress."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Faro Argyus was born as a member of the affluent Argyus family who served the Senate Guard of the Galactic Republic. By the time Argyus joined, the family had served the Guard for five generations. Due to his abilities as a leader and as a soldier, Argyus was then inducted in the Guard's famed Senate Commando division."}, {"tag": "p", "text": "At the time of the Clone Wars, Argyus held the rank of captain in the Senate Commandos. Following the arrest of Viceroy Nute Gunray of the Confederacy of Independent Systems, Argyus and a team of commandos were tasked with escorting the prisoner to Coruscant where he would stand trial for acts of treason against the Galactic Republic. In response to the capture of Gunray, the Separatist assassin Asajj Ventress led an assault on the Venator-class Star Destroyer Tranquility in order to retrieve or silence the Neimoidian should he talk. Argyus and the commandos guarded Gunray in the ship's brig alongside Jedi Commander Ahsoka Tano and CC-1004 (\"Gree\") while Jedi General Luminara Unduli and the clone troopers of Green Company defended the vessel against Ventress and her battle droids."}, {"tag": "p", "text": "After Ventress failed in her first attempt to rescue Gunray, Argyus encouraged Tano to aid Unduli in her pursuit of the assassin. With the Padawan gone, however, Argyus killed the remaining commandos and fought with Commander Gree to liberate Gunray. Despite the Clone Commander's efforts, Argyus fled the Star Destroyer in an escape pod with both Gunray and Ventress. The former captain believed that his efforts would be rewarded by Count Dooku, only to be impaled in side of the chest by Ventress while attempting to claim credit for the success of the mission."}, {"tag": "p", "text": "Ultimately, Argyus's treason brought the loyalty of the Senate Guard into question. Jedi Grand Master Yoda was troubled by the captain's betrayal, seeing that the Republic's enemies were around them all. The Guard's authority was weakened, and Supreme Chancellor Sheev Palpatine's view of the organization was diminished. While Senate Commandos were once seen as a high level of security, the Red Guard and Jedi Order became the groups that oversaw the transfer of high-value prisoners."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a member of the Senate Commandos, Captain Argyus was among the best and bravest soldiers in the ranks of the Senate Guard. Despite his service to the Republic, Argyus resented his career as a soldier which he regarded as a life of meaningless servitude. His disillusionment and desire for wealth caused his loyalties to falter, allowing for his allegiance to be purchased through bribery by Count Dooku. Though motivated by the promise of financial compensation, Argyus justified treason through his conviction that a good soldier acted in accordance with his conscience."}, {"tag": "p", "text": "Argyus was a human male who stood at 1.83 meters. He had blond hair, amber eyes, and light skin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}