{"url": "Farquil_Ban%27n", "categories": ["Category:Legends articles", "Category:Bith", "Category:Females", "Category:Servants"], "nodes": [{"tag": "h1", "text": "Farquil Ban'n"}, {"tag": "p", "text": "Farquil Ban'n was a female Bith from Clak'dor VII who served as Embra the Hutt's assistant in 0 BBY. When Embra participated in a competition with fellow Hutts Malta and Jabba Desilijic Tiure to see who could hire the the most effective contractors to retrieve the valuable Yavin Vassilika artifact, Ban'n was charged with organizing Embra's hirelings—the bounty hunters Zuckuss, 4-LOM, and Sardu Sallowe. The hunt commenced, with Embra's contractors pitting themselves against the likes of Boba Fett, Bossk, and Han Solo."}, {"tag": "p", "text": "Ban'n, however, had other ideas, and wanted to claim the prize for herself and leave Embra's service. She decided to track Malta's assistant, Jozzel Moffet, who had originally suggested the entire escapade and was accompanying Solo and another of Jabba's contractors, Lando Calrissian, on the hunt. After Moffet collected the artifact, Ban'n tracked her to the jungle moon of Yavin 4, where Moffet received payment for delivering the Vassilika to representatives from the Alliance to Restore the Republic. A firefight broke out after the other contractors converged on the moon, but Ban'n was able to isolate Moffet, kill her, and collect the 4,000,000 payment. Ban'n subsequently quit Embra's employ, but was tracked down by Fett, who retrieved the money on behalf of Jabba."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Yavin Vassilika"}, {"tag": "p", "text": "Farquil Ban'n was a female Bith who hailed from Clak'dor VII, the homeworld of her species. She found employment in the service of Embra the Hutt. In 0 BBY, she was asked by Embra to don a Theselonian bridal gown while serving the Hutt biscuits—a task that Ban'n found to be extremely painful. A week later she accompanied Embra to the palace of another Hutt, Jabba Desilijic Tiure, who had recently won a decisive victory over the rival Besadii clan. Traveling to the palace on Tatooine, Embra and yet another Hutt, Malta paid tribute to Jabba, and joined him for a game of dejarik. Meanwhile, Ban'n joined Jabba's majordomo, Bib Fortuna and Malta's handmaiden, Jozzel Moffet in watching from the sidelines, waiting for their masters to call on them. Ban'n and Moffet spoke disparagingly of their bosses, causing Fortuna to bristle, but Moffet was adamant that she would be able to break out of her servitude to Malta and earn a living on her own, much to Ban'n's skepticism."}, {"tag": "p", "text": "Ban'n and Fortuna watched as Moffet first poured wine for Malta, and then pushed the boundaries of her position by suggesting a contest between the three Hutts—the legendary and extremely valuable Yavin Vassilika artifact had recently re-emerged, a fact that intrigued the Hutts. They dictated the rules of the treasure hunt, wherein each Hutt could only hire three contractors each to locate the Vassilika and bring it to Nar Shaddaa, the Smuggler's Moon. Embra quickly put Ban'n to use collating information gathered by the Hutt's network of informants, compiling a list of the contractors hired by his rivals. Jabba had elected to hire the smugglers Han Solo and Lando Calrissian, while Malta had hired a trio of bounty hunters: IG-88B, Bossk, and Dengar. Embra elected to go down the same route, meeting with the bounty hunters Zuckuss, 4-LOM, and Sardu Sallowe at the Hutt's residence."}, {"tag": "p", "text": "Embra placed Ban'n at the trio's disposal, and made sure that they were provided with full documentary breakdown of the mission, including the lists of rival contractors. 4-LOM identified that Jabba had only hired two to hunt down the Vassilika, and Embra admitted that the identity of the third had escaped his and Ban'n's information network. The Hutt assured the bounty hunters that his Bith servant would continue her attempts to divine the information, and would forward it onto the hunters as soon as it was available. Sallowe suggested that they would find out for themselves, before the trio departed to find the Vassilika. Jabba's third contractor was ultimately revealed to be yet another bounty hunter, Boba Fett. Ban'n, secretly wanting to claim the prize for herself, elected to act independently of Embra, and track Moffet, who was personally accompanying Solo and Calrissian on the hunt. During the hunt, Zuckuss decided to give himself an advantage by taking out 200,000 registered bounties on both Bossk and Dengar as part of a contingency plan, of which Ban'n was aware. Ultimately, 4-LOM, Zuckuss, and Sallowe managed to track the Vassilika to an uncharted planet that was home to a colony of Barundi, with Jabba's and Malta's contractors following close behind."}, {"tag": "h3", "text": "Turning the tables"}, {"tag": "p", "text": "4-LOM was effectively disabled by the Barundi trying to recover the Vassilika from their village—ultimately the artifact was recovered by Moffet, who ferried it away to the jungle moon of Yavin 4. Ban'n made her way to the moon in her ship as Moffet met with General Jan Dodonna and Bria Tharen—representatives of the Alliance to Restore the Republic who paid 4,000,000 and a perfect forgery of the artifact for the true Vassilika. The exchange, however, was interrupted by Zuckuss, Sallowe, Bossk, Dengar, IG-88B, and ultimately Fett. Zuckuss attempted to claim the briefcase full of credits, prompting a firefight between the bounty hunters. Amid the confusion, one of Sallowe's Jawa assistants ran off with the briefcase, pursued by yet another bounty hunter, Greedo, who had been accompanying Moffet, Calrissian, and Solo. He in turn was pursued by Moffet, who was still being tracked by the clandestine Ban'n."}, {"tag": "p", "text": "Greedo eventually caught the Jawa, allowing Moffet to easily claim the briefcase. As Malta's servant attempted to depart with both the replca Vassilika and the briefcase, Ban'n emerged and shot her in the back just as Zuckuss and Sallowe arrived on the scene. The bounty hunters registered surprise at the Bith's sudden appearance, but she managed to placate them by handing over the replica Vassilika, which they could take to Embra in order to claim the reward. Ban'n would also organize a further 200,000 for Zuckuss, to be used to either repair 4-LOM or cover the cost of one of his registered bounties on Bossk and Dengar. Ban'n then departed Yavin 4 in her ship, and made her way across the galaxy to another world, where she set herself up with a deck chair on a beach with her briefcase of 4 million credits, watching the planet's suns set. She then called Embra on her comlink, and informed him that she was resigning from his service. She terminated the communication as the Hutt protested, only to have Boba Fett arrive unannounced to collect the credits for Jabba, much to Ban'n's shock. The credits were the result of a sale of Besadii spice claimed in Jabba's earlier victory, and the Hutt felt it was his by right. Fett successfully extracted the money from Ban'n."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Farquil Ban'n was not happy with her job, and had a low opinion of her employer, Embra, to the point of finding him and his fellow Hutts to be contemptuous. A demure Bith, she was given to sarcasm and witticism, not unlike fellow servant to the Hutts Jozzel Moffet, and she would address those more devoted to the Hutts, such as Bib Fortuna, in a condescending fashion. Ban'n was utilized by Embra as a gatherer of information and data, and was instrumental in the organization of his three bounty hunters dispatched to retrieve the Yavin Vassilika. She admired Moffet's cunning in acquiring the Vassilika by deceiving numerous bounty hunters and smugglers, and also respected the work of the bounty hunter Zuckuss. Ban'n was also an enterprising individual, taking Moffet's idea of setting herself up with money independently to escape the influence of the Hutts and decided to make the aspiration her own. After retiring from the service of Embra the Hutt, Ban'n became very particular about her comfort, even confronting those who would stand in her light when she had elected to bask in the warmth of the suns."}, {"tag": "h3", "text": "Appearance, attire, and equipment"}, {"tag": "p", "text": "Farquil Ban'n had black eyes and pink skin, similar to other Bith across the galaxy. She wore brown robes with a black yoke while in the service of Embra, and donned a cloak and cap while on Yavin 4. When she had departed from Embra's employ she favored a straw hat while relaxing on the beach. Ban'n utilized a blaster pistol and a ship with a purple hull. Also among Ban'n's effects were a comlink that could make interplanetary calls, and a drinking glass."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Farquil Ban'n first appeared in the first issue of the Underworld: The Yavin Vassilika (2001) comic series, written by Mike Kennedy and penciled by Carlos Meglia. The character did not appear again until the fifth issue of the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}