{"url": "Aks_Moe/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic senators", "Category:Gran", "Category:Males"], "nodes": [{"tag": "h1", "text": "Aks Moe"}, {"tag": "p", "text": "Aks Moe was a male Gran senator from Malastare representing the Gran Protectorate in the Galactic Senate during the last decades of the Galactic Republic. He was noted for his delight in bureaucratic minutiae and was a prime example of the inefficiencies of the late-form Galactic Congress. He represented the Gran Protectorate jointly at times with Ainlee Teem and Baskol Yeesrim, who both later continued to serve him as Representatives until his assassination in 22 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Galactic Senator"}, {"tag": "p", "text": "A male Gran, Aks Moe became involved in politics within the Gran Protectorate on his homeworld Malastare, eventually attaining the position of aide to Senator Pax Teem by 54 BBY. Alongside Teem, Moe attended a gala on his homeworld in celebration of the Dug winners of the Vinta Harvest Classic. Two years later, Moe was not on Coruscant when Teem and other members of the Gran Protectorate's delegation on the planet were massacred under mysterious circumstances."}, {"tag": "p", "text": "Following the attack on Coruscant, Aks Moe was approached by the Trade Federation to work out a deal that would guarantee his support; Moe was appointed as the Senator of the Protectorate soon after. He began to serve jointly with Ainlee Teem as of 33 BBY. By 32 BBY, Baskol Yeesrim also joined their joint representation of Malastare."}, {"tag": "p", "text": "In 32 BBY, when Queen Amidala of Naboo presented a plea for help from the Senate against the Trade Federation, Moe attempted to delay decisive action against the Federation, seconding a motion to send a survey team to Naboo to confirm the alleged attack. His obstruction demonstrated to Amidala the weaknesses of the body and she initiated a Vote of No Confidence in Supreme Chancellor Valorum."}, {"tag": "p", "text": "In the ensuing political chaos, Ainlee Teem was nominated to succeed as Chancellor by Senator Edcel Bar Gane of Roona. While he ran a fierce campaign against the other candidates Bail Antilles of Alderaan and Palpatine of Naboo, he was ultimately defeated by the latter."}, {"tag": "p", "text": "After the election, Moe returned to Malastare to attend peace negotiations between the warring factions involved in the civil war on Lannik; the meetings also happened to run concurrent with the Vinta Harvest Classic podracing event. The senator secretly conspired with Myk'chur Finux Zug, the leader of the terrorist Red Iaro delegation, to kill Prince R'cardo Sooflie IX with akk dogs and establish a new government in which the Gran senator would take advantage of the planet's unexploited resources. The plot was foiled and Zug killed thanks to the delegation of Jedi Knights responsible for mediating between the parties, and although the Jedi suspected the involvement of the Gran authorities in the plot, a lack of evidence allowed Moe to avoid blame and retained his position for the time being."}, {"tag": "h3", "text": "Separatist Crisis"}, {"tag": "p", "text": "Over the next few years, Moe retained his seat in the Senate, becoming a founding member of the Loyalist Committee as a secessionist movement began to take hold. As the Separatist Crisis grew more volatile and more and more star systems broke away, Moe actively voiced his Militarist views and was a vocal proponent of the Military Creation Act."}, {"tag": "p", "text": "In 22 BBY, Moe was visiting the banking world of Aargau to meet with representatives of the InterGalactic Banking Clan in order to discuss possible funding options for a proposed Republic military initiative. Moe boarded his staff speeder for a visit to the Commodities Exchange Cathedral in New Escrow and had only just merged onto an automated expressway when the speeder's power core overloaded and exploded, killing the Senator instantly. Moe's traveling companion and two Dug servants were also killed in the blast, along with the injury of eighteen commuters."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following an investigation, Aks Moe's body was transported back to Malastare where a funeral was held in honor of Moe's service to the Protectorate. During the ceremony, Dug activists of the Dugs-for-Democracy movement took to the skies in podracers in a successful attempt to disrupt the corrupt Senator's memorial service. In the following months, acting Senator Ask Aak would be officially recognized as Moe's replacement in the Senate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Episode I The Visual Dictionary, Aks Moe was mistakenly referred to as Baskol Yeesrim, who instead was his aide in the Senate. This mistake was corrected in future publications."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}