{"url": "Farsight", "categories": ["Category:Canon articles", "Category:Stub", "Category:Incomplete lists", "Category:Sense powers"], "nodes": [{"tag": "h1", "text": "Farsight"}, {"tag": "p", "text": "Farsight was a Force ability that allowed the user to \"see\" their targets without actually needing their eyes."}, {"tag": "p", "text": "In 20 BBY, the former Dark Acolyte Asajj Ventress led a Nightsister assassination attempt on the Sith Lord Count Dooku in his castle on Serenno. Before confronting Tyranus, Ventress shot a poison dart at the Sith Lord that impaired his sense of sight. Believing his assailants to be Jedi, Dooku used Farsight to discern the location of his attackers and engage them in lightsaber combat. Ultimately, Dooku survived and the Nightsisters escaped."}, {"tag": "p", "text": "While assisting in the training of the Jedi Padawan Ezra Bridger, Ahsoka Tano took the kyber crystal from his lightsaber and threw it into a field of grass. Hoping to teach the young Padawan a lesson, Ahsoka drew her lightsaber and began swiping at Ezra. Bridger became frustrated, as he was unsure how he was supposed to find his crystal while simultaneously avoiding Tano's attacks. Closing his eyes, Ezra used the Force to view his surroundings, eventually discovering the location of his crystal despite Tano's assault. Retrieving his crystal, Ezra ignited his own lightsaber and clashed with Ahsoka, having learnt to trust in the power of the Force."}, {"tag": "p", "text": "Kanan Jarrus learned to use it full time from the Bendu, augmenting his spatial awareness despite his blindness. In 0 BBY, Luke Skywalker used it to deflect blasts from a remote while training in the ways of the Force with Jedi Master Obi-Wan Kenobi while en route to Alderaan. Skywalker once again used Farsight when training with Yoda, who instructed him to sprint through the treetops of Dagobah with his eyes closed. Having failed previously, Skywalker ran the course and marveled at his success by relying on the Force rather than his own eyesight, describing his ability to perceive his surroundings. Yoda himself could utilize Farsight, as could Darth Sidious."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}