{"url": "Farstine/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Empire planets", "Category:Ryndellian sector planets", "Category:Triellus Trade Route"], "nodes": [{"tag": "h1", "text": "Farstine"}, {"tag": "p", "text": "Farstine was a planet within the Farstine system, situated in the Mid Rim's Ryndellian sector. The planet was located on two major hyperlanes: the Five Veils Route, which connected the Mid Rim to the Svivreni and Skine sectors in the Outer Rim Territories, and the Triellus Trade Route, which spanned a large section of the Outer Rim within the Slice. Farstine possessed a methane atmosphere, requiring oxygen-breathing species to use breath masks for survival on the surface. Relatively untouched by galactic events, a battle was fought at Farstine in 19 BBY between Separatist holdout forces commanded by Trade Federation Customs Vizier Marath Vooro, and an Imperial fleet headed by the Imperial officer Octavian Grant. The planet was known to be one of the spice trade's major transshipment hubs, and was under Imperial occupation at some point during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Farstine was a planet located in the Ryndellian sector on the edge of the Mid Rim in the Trailing Sectors. Situated within the Farstine system, Farstine was the starting point for the Five Veils Route, a trade route that directly connected the world to Trigalis. The Five Veils Route, also known as the Five Veils' Tour trade route, boasted two separate endpoints, connecting Farstine to the planets Skynara in the Skine sector and Svivren in the Svivreni sector, both in the Outer Rim Territories. Farstine was also located between the planets Zhar and Ryndellia on the Triellus Trade Route, a hyperlane that linked a swath of the Outer Rim contained within the Slice, skirting Hutt Space before turning into the Mid Rim and terminating at Enarc. Farstine had a methane atmosphere, and oxygen-breathing species required breath masks for survival. By 25 ABY, Farstine had a population numbering between 500 million to one billion inhabitants."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Farstine was discovered and settled sometime prior to the Cold War, an uneasy eleven-year period of peace between the Galactic Republic and the Sith Empire following the signing of the Treaty of Coruscant, which ended the Great Galactic War in 3653 BBY. The Rattataki criminal Kaliyo Djannis visited the planet with her lover, the arms dealer Yjal, before the war. They broke off their relationship while on the planet. Over two thousand years later, during the New Sith Wars—which pitted the Republic against the Sith Brotherhood of Darkness between 1004 BBY and 1000 BBY—Farstine was located in disputed territory."}, {"tag": "p", "text": "During the Clone Wars that raged from 22 BBY to 19 BBY, fought between the Republic and the breakaway separatists of the Confederacy of Independent Systems, Farstine fell within Republic-controlled space. In 19 BBY, following the end of the Clone Wars, the victorious Republic was transformed into the Galactic Empire. Trade Federation Customs Vizier Marath Vooro refused to recognize the legitimacy of the treaty that Acting Viceroy Sentepeth Findos approved, which effectively dissolved the Trade Federation—a major contributor to the Confederacy of Independent Systems—by signing over all their assets to the Empire. Vooro retained command of Trade Federation Defense Fleet ships and battle droids at Enarc, which lay on the Triellus Trade Route relatively close to Farstine. Seeking to bring various Separatist holdouts—including Vooro—to heel, the Empire launched a series of campaigns to reconquer the Outer Rim Territories. A fleet commanded by the Imperial officer Octavian Grant faced Vooro's forces at Farstine and defeated them, forcing Vooro to retreat down the Five Veils Route. Grant subsequently captured Vooro on the fringes of the Hook Nebula."}, {"tag": "p", "text": "Farstine was well-known as a major transshipment point for the spice trade, with consignments of the narcotic traveling along both the Triellus Trade Route and the Five Veils Route upon which Farstine was located. During the Galactic Civil War, which was fought between the Empire and the insurgent Alliance to Restore the Republic, Imperial forces occupied Farstine. While the Empire was taking control of the planet, a bounty hunter encountered a child who had been orphaned when his parents were killed by Imperial troops. The homeless, penniless child had only fifteen minutes of oxygen remaining; taking pity on the boy, the bounty hunter—who privately admitted that the orphan stirred memories of a younger brother who had died at an early age—took charge of the child."}, {"tag": "p", "text": "The luxury yacht Veil of Skynara regularly ran cruises for tourists from Farstine to Skynara in the Skine sector during the Galactic Civil War. In 3 ABY, the Imperial Death Squadron used Farstine as a transit point en route from the Qeimet system to the Eriadu system. The bounty hunter Boba Fett also employed the planet as a navigational stopover as he traveled from the Vergesso Asteroids in the Lybeya system to the planet Tatooine with the carbonite-encased Han Solo in the hold of his starship, Slave I. In 9 ABY, Imperial forces allied with Grand Admiral Thrawn passed by Farstine on route to Svivren, where they laid siege to the planet on 44:7:24 as part of Thrawn's campaign against the New Republic, the galactic government and successor state to the Alliance. By 137 ABY, Farstine fell within the space claimed by Darth Krayt's Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Farstine was first mentioned in Star Wars: The Roleplaying Game, published by West End Games in 1987. It was later mentioned in 1993's Galaxy Guide 9: Fragments from the Rim, also published by West End Games. Farstine received an entry in 2008's The Complete Star Wars Encyclopedia, and was mentioned in dialogue by the character Kaliyo Djannis in 2011's Star Wars: The Old Republic, an MMORPG by BioWare."}, {"tag": "p", "text": "Galaxy Guide 9: Fragments from the Rim establishes that Farstine is the head of the Five Veils' Tour trade route, which linked Farstine to Skynara in the Skine sector. In 2009's The Essential Atlas by Jason Fry and Daniel Wallace, no mention was made of the Five Veils' Tour trade route, but a Five Veils Route was included, linking Farstine to Svivren in the Svivreni sector. In a thread on the Jedi Council Forums on TheForce.Net, Fry clarified that the Five Veils' Tour trade route and the Five Veils Route were the same hyperlane and that the differing destinations were a result of tourism and shipping companies setting different endpoints."}, {"tag": "p", "text": "Farstine's entry in The Complete Star Wars Encyclopedia established that it was located in the Skine sector. While Skynara, the end point of the Five Veils Route, had been established to be located in the Skine sector in Galaxy Guide 9: Fragments from the Rim, Farstine had not. The Online Companion to The Essential Atlas established that Farstine was actually located in the Ryndellian sector."}, {"tag": "p", "text": "In The Essential Atlas, a map entitled \"Galactic Explorations\" on page 120 charts when regions of the galaxy were first discovered and explored. Farstine is located within an area stated to have been explored between 3000 BBY and 1,000 BBY. However, as Farstine is mentioned in dialogue in Star Wars: The Old Republic, set between 3643 BBY and 3640 BBY, the planet must have been discovered prior to that date."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}