{"url": "Farstey/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good article nominations", "Category:Alliance to Restore the Republic astronomical objects", "Category:Farstey sector astronomical objects"], "nodes": [{"tag": "h1", "text": "Farstey"}, {"tag": "p", "text": "Farstey was an Expansion Region astronomical object situated in the Farstey sector. During the Galactic Civil War, while the Galactic Empire was carrying out an offensive in Farstey's vicinity, the Rebel Alliance Chief of Sector Command suggested during a meeting of the Alliance High Command that the Rebel starfighter base at Farstey could be stripped to form a fighter wing for a planned assault on an Imperial base over the planet Mantooine."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Farstey was an astronomical object located in the Farstey system, a part of the Farstey sector in the Trans-Hydian portion of the Expansion Region."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, a Rebel Alliance starfighter base was located at Farstey. At some point between 0.5 ABY and 2 ABY, the Galactic Empire was carrying out an offensive in the region that, in addition to Farstey, included the Mid Rim planet Homon and the Expansion Region planet Tierfon."}, {"tag": "p", "text": "At the 251st meeting of the Alliance High Command held during that time, the Rebel Chief of Sector Command noted that the bases at Farstey, Homon, and Tierfon could be stripped of their starfighters in order to form an additional fighter wing for the purposes of Operation Cobolt, a planned Alliance assault on an Imperial base located in orbit of the Outer Rim Territories planet Mantooine. According to the Chief of Sector Command, however, such relocation of Alliance resources could only be done if the Empire did not continue its offensive in the region containing Farstey. Ultimately, the Alliance did draw the starfighters from the Farstey, Homon, and Sumitra sectors and carried out the planned assault."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Farstey was introduced via mention in \"Extract of Minutes from the 251st Meeting of the Alliance High Command,\" a short companion narrative included in The Rebel Alliance Sourcebook, which was authored by Paul Murphy and published in 1990 for use with West End Games's Star Wars: The Roleplaying Game. The StarWars.com Online Companion to the 2009 reference book The Essential Atlas placed the Farstey system, and therefore the celestial body Farstey, in grid square O-8."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}