{"url": "Fate_of_the_Jedi:_Abyss", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Star Wars: Fate of the Jedi"], "nodes": [{"tag": "h1", "text": "Fate of the Jedi: Abyss"}, {"tag": "p", "text": "Fate of the Jedi: Abyss is the third novel in the nine-book Fate of the Jedi series set two years after Star Wars: Legacy of the Force by Troy Denning and was released on August 18, 2009. At the end of the book, it has an introduction to Backlash. The audio version is narrated by Marc Thompson. The paperback was released on June 22, 2010."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "h4", "text": "Back cover"}, {"tag": "p", "text": "Peace is the way of the Jedi. But with deadly enemies on every side, war may be the only way out."}, {"tag": "h4", "text": "Internal flap"}, {"tag": "p", "text": "Following a trail of clues across the galaxy, Luke Skywalker continues his quest to find the reasons behind Jacen Solo's dark downfall and to win redemption for the Jedi Order. Sojourning among the mysterious Aing-Tii monks has left Luke and his son Ben with no real answers, only the suspicion that the revelations they seek lie in the forbidden reaches of the distant Maw Cluster. There, hidden from the galaxy in a labyrinth of black holes, dwell the Mind Walkers: those whose power to transcend their bodies and be one with the Force is as seductive and intoxicating as it is potentially fatal. But it may be Luke's only path to the truth."}, {"tag": "p", "text": "Meanwhile, on Coruscant, the war of wills between Galactic Alliance Chief of State Natasi Daala and the Jedi Order is escalating. Outraged over the carbonite freezing of young Jedi Knights Valin and Jysella Horn after their inexplicable mental breakdowns, the Jedi are determined to defy Daala's martial tactics, override Council Master Kenth Hamner's wavering leadership, and deal on their own terms with the epidemic of madness preying on their ranks. As Han and Leia Solo, along with their daughter Jaina, join the fight to protect more stricken Knights from arrest, Jedi healers race to find a cure for the rapidly spreading affliction. But none of them realize the blaster barrel is already swinging in their direction and Chief Daala is about to pull the trigger."}, {"tag": "p", "text": "Nor do Luke and Ben, deep in the Maw Cluster and pushing their Force abilities beyond known limits, realize how close they are–to the Sith strike squad bent on exterminating the Skywalkers, to a nexus of dark–side energy unprecedented in its power and its hunger, and to an explosive confrontation between opposing wielders of the Force from which only one Master–good or evil–can emerge alive."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts off in the basement levels of the Jedi Temple on Coruscant where captured Jedi Knights Seff Hellin and Natua Wan are held captive for the Force psychosis that they are suffering. Han and Leia Organa Solo are visiting to check up on the two Jedi. They also visit Raynar Thul, who has been virtually healed from his burn scars since the Tachyon Flier crash on Yoggoy, as well as the mental scars since ruling the Killiks as UnuThul. He is diagnosed by Cilghal fit enough to leave, although Raynar expresses his own doubts on his readiness. Han and Leia act as distractions for Seff so that Cilghal and Tekli can see how his mentality is. Seff sees through the ploy and gets into a brief confrontation with Leia that ends with him being knocked out, thus concluding Cilghal and Tekli's brief experiment regarding his mental capacity."}, {"tag": "p", "text": "In another part of the galaxy, Luke and Ben Skywalker are continuing their journey to find out what led the late Jacen Solo down the path of the dark side of the Force. They journey to the Maw, and after nearly getting killed by the missing Jedi Knight Qwallo Mode, the Skywalkers arrive in a space station, which looks like a miniature version of the destroyed Centerpoint Station. Running parallel to this, Ben senses a dark presence in the system that he hadn't felt since his time as an infant in the Maw. On board the station, they find the group known as the Mind Walkers, a group of Force-sensitive beings who are meditating themselves to death in order to pass beyond shadows, with Qwallo Mode among them. They believe that the real world is nothing more than an illusion, and a higher plane of existence in the Force awaits them. The Mind Walkers reveal that Jacen was with them during his sojourn, and they explain that when he left, he wanted to right the galaxy of any wrongs as he prepared to leave them. Luke concludes that this is where Jacen had begun his fall to the dark side, but the Mind Walkers disagree, even after being informed that Jacen had become the Sith Lord Darth Caedus before he died. To prove their case to Luke, the Mind Walkers have him pass beyond shadows with them to seek what Jacen sought which made him turn to the dark side. That way, Luke could understand what Jacen's motives were prior to his fall."}, {"tag": "p", "text": "On Coruscant, Yaqeel Saav'etu and Bazel Warv are the next two Jedi to fall to the Force psychosis. Though they are quickly knocked out by the three remaining Solos and Jagged Fel, the Solos and Jag are demanded to relinquish Yaqeel and Bazel to Galactic Alliance Security. The Solos and Jag discover that GAS found out about the two Jedi's fall to the psychosis via a cleaning droid installed by the reporter Javis Tyrr. This droid has a holocam mounted on it to record such vital information within the New Jedi Order, revealing how Tyrr was able to get a recording of Seff Hellin's incarceration beneath the Jedi Temple in the previous novel. Jag uses his diplomatic immunity as Head of State of the Galactic Empire, Jaina uses a legal threat that can have Tyrr arrested for spying, and Han and Leia pull off a bait-and-switch that gets Yaqeel and Bazel into Jedi custody. GAS begrudgingly allow the Jedi alone, while Cilghal states that with Yaqeel and Bazel in custody, she will be able to draw conclusions as to how this Force psychosis is targeting young Jedi Knights. One theory she draws is that each Knight has been in the Maw at a very early age to keep from being targeted by the Yuuzhan Vong during the war against them; therefore, there could be something in the Maw affecting the minds of these young Knights. Meanwhile, Jag tells Jaina that he had overheard a conversation between Chief of State Natasi Daala and her assistant Chief of Staff Wynn Dorvan where Daala had suggested bringing in Mandalorian mercenaries against the Jedi in order to bring them in line with the Alliance government. Jaina promises Jag to keep this a secret, as Jag believes that he can use this information to his advantage in order to actually help the Order somehow."}, {"tag": "p", "text": "Elsewhere, near Sinkhole Station, a portion of the small fleet collected by the Lost Tribe of Sith continues to hunt down the Sith Meditation Sphere known as Ship. The Tribe uses Vestara Khai, the Sith Tyro that Ship had first contacted back on the Tribe home world of Kesh, to track the Sphere down. However, they soon learn that Ship is leading the fleet toward the source that had coerced him to leave the Tribe in the first place. They track Ship down to an unknown planet, but the Sith members are steadily killed off by the planet's dangerous plants. However, just as they find Ship, he evades their grasp once again and they meet a mysterious woman named Abeloth, who can change her physical appearance at will. She provides the Sith protection from the dangerous plants, but Vestara is suspicious of Abeloth's motives. These suspicions are heightened once the Sith find Ship again and Vestara's Master Lady Olaris Rhea is nearly killed by a plant beneath one of the planet's crimson rivers. Vestara communicates through the Force with Ship and finds that he can't obey her or any of the Sith's commands, as it was designed to, because of the strange presence that lured him away from Kesh. Vestara concludes that it was Abeloth who was responsible for luring Ship over to the planet and that she is keeping the Sith on the world because she is lonely. The probable reason that the plant beneath the crimson river nearly ate Lady Rhea was because she didn't want Ship to be found, considering that Rhea is the official leader of the Sith squad on the planet. These suspicions are what allow Vestara to see Abeloth for who she truly is—a hideous, ugly monster. Despite these suspicions, the Sith and Abeloth reclaim Ship, and the Sith then use it to travel to Sinkhole Station."}, {"tag": "p", "text": "Back on Coruscant, Wynn Dorvan tells Han and Leia that Daala is planning to use a pack of Mandalorian supercommandos against the Jedi, information that he deliberately gave to Jag by secretly allowing him to overhear his conversation with Daala regarding the matter. The Solos are dubious, believing it to be a trick of Daala's but Wynn insists that, unlike Daala, he knows the Jedi are needed to protect the galaxy from worse threats. The Solos give this information to the Jedi Council, who promise to use this information to their advantage, while the Masters give the Solos the task of defending Tahiri Veila in court for the murder of Gilad Pellaeon two years earlier. Meanwhile, Jaina investigates into the bug planted on the cleaning droid thanks to Tyrr, and traces it back to Moff Drikl Lecersen. She calls Jag to come over so that she can give him this information, and then she is confronted by her parents over Jag keeping the secret of Daala preparing to use the Mandalorians against the Jedi. Noting Jaina's lack of shock and subsequent defense of Jag, Han and Leia learn that she, too, knew the situation regarding the Mandalorians and didn't bother to tell the Order. This causes a schism between Jaina and her parents, who look down on Jag for keeping this secret from everyone but Jaina. Jaina still tells Jag about Lecersen's involvement into causing conflict between Daala and the Jedi, and he promises to take this information to Daala to reaffirm her view of the Order. However, on the day of Tahiri's arraignment, when Jag does tell Daala about Lecersen's likely involvement in the conflict, she still refuses to release any hold of the public prejudice held against the Jedi. She explains that it was thanks to Darth Caedus who set her on this mental path, as he was a Sith, and to Daala, a Sith is nothing more than a fallen Jedi."}, {"tag": "p", "text": "Later, the Jedi plan to get Valin and Jysella Horn out of Daala's secret prison on Coruscant, and they disguise their reconnaissance as a visit to check up on whether they are physically stable in their carbonite-frozen forms. Though Valin and Jysella's mother, Mirax, knocks out the manager of the prison, Wruq Retk, for using her children as office decorations, the plan fails because Daala arrives at the scene. She then promises to make sure that the Horn children's carbonite-frozen forms will be treated with more dignity. Meanwhile, Han and Leia, with the help of a few Jedi Knights, plan to transport the Jedi that they have to the Jedi base on Shedu Maad. But Mandalorian supercommandos attack, and though they are defeated, Bazel is provoked into killing one of them using a Force ability that no one is aware of: killing the mercenary by phasing his arm through his armor without even denting it. Fortunately, after the Mandalorians' defeat, Raynar Thul uses Bazel's Force psychosis to the Order's advantage by threatening that if he didn't come with them to Shedu Maad, then he will leave Yaqeel, his friend, and the other Knights alone with the \"imposters.\" Bazel complies and goes with his fellow Knights to Shedu Maad."}, {"tag": "p", "text": "In Sinkhole Station, Ben overcomes the distractions provided by Rolund and Rhondi Tremaine and travels beyond shadows with his father and the Mind Walkers' leader Seek Ryontarr, as Ben is worried that Luke is spending too much time beyond shadows. Ben wishes to quickly get their information of Jacen's fall to the dark side and get out of the station. With the help of their guides beyond shadows, the Skywalkers journey to the Lake of Apparitions where they meet the souls of Anakin Solo, Luke's late wife and Ben's dead mother, Mara, and finally, Jacen. None of the deceased characters that Luke and Ben encounter tell them about the mysterious female presence who Luke senses in the Lake of Apparitions, and the feelings between the Skywalkers and Jacen are still difficult, considering all that he had done to them during the Second Galactic Civil War. Nevertheless, Luke asks Jacen what prompted him to fall to the dark side, and he confirms what Luke already suspected—a great threat to the galaxy which coerced him to do whatever it took to ensure peace. Jacen also tells Luke that, in the visions they shared of someone ruling with an iron fist on a great throne, it wasn't Luke on the throne. And Jacen is pleased to learn that when Luke had the vision, he saw the former's daughter, Allana, ruling in a time of ensured peace, surrounded by friends. With that, the Skywalkers depart the Lake of Apparitions, and subsequently beyond shadows, and return to the real world. They are about to depart when they confront the surviving members of the Sith squad, led to the station by the Sith Meditation Sphere and Abeloth. But thanks to the Skywalkers' superior fighting abilities, with one of the Skywalkers killing Ahri Raas (a potential Keshiri crush of Vestara's) and the treacherous ambitions of individual Sith members killing rival colleagues (such as Yuvar Xal intending to kill Lady Rhea and take her position as leader of the team, only to be foiled by Vestara killing him), all but one of the members are killed—the last member being Vestara. However, instead of killing or capturing her, Luke uses the Dathomiri blood mark on Vestara and allows her to leave using one of the abandoned ships in the station's hangar."}, {"tag": "p", "text": "The novel ends with Luke and Ben still residing in the Maw aboard the Jade Shadow, waiting for Vestara to make her move and leave the star cluster; that way, they would be able to use the blood trail on her to track her down to her home planet, where the Sith reside. Ben asks who Jacen saw on the throne in his visions, and Luke says that, to Ben at least, it doesn't matter... and it never will."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Abyss contains several errors. In the hardcover version, the phrase \"A long time ago, in a galaxy far, far away...\" was accidentally changed to \"In a galaxy long, long ago...,\" a mistake that was corrected in the paperback release. Abyss also incorrectly states that Ben Skywalker was five when he met the Killiks, when in fact, according to Dark Nest I: The Joiner King, he was eight at the time. Some editions, though not all, incorrectly state that \"This novel has an excerpt from the forthcoming book Star Wars: Fate of the Jedi: Backlash by Troy Denning\";[source?] Backlash was actually written by Aaron Allston. Additionally, the novel states that Jaden Korr's eyes are dark instead of light grey, which was an error at the time of publication, but this was later retconned by the novel Riptide, which revealed that a couple of years before the events of Abyss, Korr's consciousness was transferred into a clone body with a different eye color."}, {"tag": "p", "text": "The Mindwalkers who Ben and Luke meet are similar to the lotus-eaters encountered by Odysseus in Homer's The Odyssey."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}