{"url": "Fate_of_the_Jedi:_Ascension", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Fate of the Jedi"], "nodes": [{"tag": "h1", "text": "Fate of the Jedi: Ascension"}, {"tag": "p", "text": "Fate of the Jedi: Ascension is a Star Wars Legends novel and the penultimate volume in the nine-part Star Wars: Fate of the Jedi series. It was written by Christie Golden and first published by Del Rey in hardcover on August 9, 2011. The first paperback edition was released on November 27, 2012."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "h4", "text": "Back cover"}, {"tag": "p", "text": "How long can the Jedi remain in power? How far will the Sith go to rule supreme? What chance do both stand against Abeloth?"}, {"tag": "h4", "text": "Internal flap"}, {"tag": "p", "text": "As Luke and Ben Skywalker pursue the formidable dark-side being Abeloth, the Lost Tribe of the Sith is about to be sundered by an even greater power—which will thrust one Dark Lord into mortal conflict with his own flesh-and-blood."}, {"tag": "p", "text": "On Coruscant, a political vacuum has left tensions at the boiling point, with factions racing to claim control of the Galactic Alliance. Suddenly surrounded by hidden agendas, treacherous conspiracies, and covert Sith agents, the Jedi Order must struggle to keep the GA government from collapsing into anarchy."}, {"tag": "p", "text": "The Jedi are committed to maintaining peace and ensuring just rule, but even they are not prepared to take on the combined threats of Sith power, a deposed dictator bent on galaxywide vengeance, and an entity of pure cunning and profound evil hungry to become a god."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel begins with the Circle of Lords meeting to determine whether or not they should accept Abeloth's offer of an alliance to destroy Luke Skywalker and the Jedi Order. The Lords are divided, but in the end, despite his reservations over Abeloth's intentions, Grand Lord Darish Vol decides that the Lost Tribe of the Sith must accept Abeloth's offer. Vol then contacts Gavar Khai, who has brought Abeloth and Ship to Kesh, and tells him that they must delay Abeloth's arrival on the planet so they can prepare a celebration for their powerful new ally. After Khai relays this information to Abeloth, the entity is skeptical and suspicious of Vol's motives, but accepts the conditions. Abeloth then tells Khai that he and everyone in his fleet should return to Kesh to visit with friends and family members. Khai acquiesces and spends the night with his wife, Lahka. The two discuss the implications of their daughter's actions and her choice to side with the Skywalkers. Gavar kills Vestara's pet uvak, Tikk, as a result of convictions that Vestara must be punished."}, {"tag": "p", "text": "Eventually, Abeloth is officially welcomed to Kesh with a lavish parade and masquerade. During these events, Grand Lord Vol closely observes Abeloth to understand her motives. After all of the festivities are completed, and Vol retires to his bed chamber and is assaulted in his dreams by Abeloth. However, Vol lures Abeloth into a mental trap and launches his own assault on the dark side entity. But when Abeloth is attacked, she sends out a Force shock-wave that destroys Kesh's capital city of Tahv, killing millions of citizens, Sith and non-Sith alike, including Lahka Khai. Vol is weakened while Ship picks up Abeloth and leaves with her. Depsite his wife's death, Gavar Khai and the Sith under his command remain loyal to Abeloth (who has manipulated them all with the Force) and accompany her into hyperspace. Later, Abeloth views footage of an interview with Rokari Kem, the beloved leader of the freedom fighters of Qaras, and takes great interest in Kem."}, {"tag": "p", "text": "Luke, Ben, Vestara, and Jaina Solo discuss a list of Ship's possible retreats, including a number of planets with strong historical links to the Sith. Jaina suggests that they investigate Korriban first, and proposes that Vestara accompany the Jedi on the investigation. Luke agrees, though he has reservations about taking the young Sith to a planet so heavily steeped in the dark side of the Force. When they do investigate Korriban, specifically the Valley of the Dark Lords, they're confronted by dog-like guardians known as the tuk'ata. Vestara speaks to the tuk'ata in the ancient Sith language to ward them off and to ask them to lead the party to any other Sith on Korriban. While the guardians fulfill their first demand from Vestara, they're unable to fulfill her second request due to the fact that there are no Sith left on Korriban. When she reports all of this to the Skywalkers and Jaina, she neglects to mention that she had a third demand for the tuk'ata; if there are anymore Sith who come, the guardians must tell them to hide for their own safety."}, {"tag": "p", "text": "On Coruscant, Galactic Alliance General Merratt Jaxton is replaced by former GA Chief of Staff Wynn Dorvan as a member of the governing triumvirate, which also includes Kuati Senator Haydnat Treen and Jedi Master Saba Sebatyne. The triumvirate and their chief advisers are doing their best to manage the Galactic Alliance's affairs in the wake of former Chief of State Natasi Daala's fall from power. They are primarily concerned with the series of revolutions on slave-holding worlds that have resulted in the formation of new anti-slavery governments that wish to join the Galactic Alliance. These developments all favor the machinations of Imperial Moff Drikl Lecersen and his co-conspirators, (include Treen, Jaxton, Coruscanti Senator Fost Bramsin, GA Admiral Sallinor Parova, and General Stavin Thaal) who all seek to overthrow their respective governments so that they can rule in their wake. A new member is added to their conspiracy: a new Senator from a recently liberated world, Kameron Suldar."}, {"tag": "p", "text": "Meanwhile, Daala remains on the loose in the galaxy with Boba Fett. The bounty hunter reveals that he and his Mandalorians have discovered that Lecersen was responsible for starting Freedom Flight specifically so they could cause trouble for Daala make it easier for his conspiracy to stage their coup. Daala allies herself with Moff Porrak Vansyn and they lead Lecersen into a trap in Imperial space. There, Daala offers an ultimatum to Lecersen; either she will kill Lecersen for his betrayal and reveal to the galaxy evidence of Lecersen's connections with Freedom Flight, or the Moff can join her in fulfilling her plans. Meanwhile, the Squib trio of Emala, Sligh, and Grees meet up with the Solos in order to divulge Daala's whereabouts in exchange for credits and safety from their Imperial pursuers. The Squibs carry out their end of the bargain, but when they meet Imperial Head of State Jagged Fel to ask for amnesty, the alien trio are forced to reveal that they had also stolen an Imperial chemical that reverses aging. Jag blackmails them into returning the chemical in exchange for amnesty."}, {"tag": "p", "text": "Luke, Ben, Jaina, and Vestara's search for Abeloth and her Sith allies leads them to the ancient Sith world of Dromund Kaas. There, they confront a strike team of ten Sith Sabers loyal to Abeloth led by Gavar Khai. While the Skywalkers and Jaina defeat and kill most of their attackers, Vestara is forced to fight her father. With Gavar's mind clouded by Abeloth's influence, Vestara is able to strike him down. This experience provides the last push needed for Vestara to embrace the light side of the Force. Ben and Vestara ultimately admit their love for each other, and she asks to become a Jedi apprentice. After probing her thoughts for deception, Luke sees that Vestara is sincere in her desire to become a Jedi, and accepts her into the Order. Vestara's redemption also allows Ben to view his late cousin, Jacen Solo, not as the Sith Lord Darth Caedus, who he died as, but as the good man he once was before the Second Galactic Civil War."}, {"tag": "p", "text": "Afterward, they return to Coruscant—with Luke's sentence of exile from the GA capital world officially lifted since Daala's deposition—in order to accomplish two goals: to search the Jedi Archives for clues about Abeloth and her allies' whereabouts, and for Luke to make an announcement. First though, Luke decides that Saba Sebatyne won't be punished for killing Master Kenth Hamner, as she did it for the good of the Order. He then declares that the Jedi Order shall become a separate entity from the Galactic Alliance. This effectively dissolves the GA triumvirate, prompting the Galactic Alliance Senate to hold an emergency session in order to elect an acting Chief of State. While the Jedi prepare to leave Coruscant, Jagged Fel meets with the Solos, who give him the custody of escaped GA convict Tahiri Veila. Tahiri, wishing to atone for killing Grand Admiral Gilad Pellaeon, offers to serve as Jag's bodyguard until such time as she can stand trial in an Imperial court. Jag accepts this arrangement, though he has no desire to see Tahiri come to any harm."}, {"tag": "p", "text": "As the Jedi depart Coruscant to investigate the Sith world of Upekzar (which had been discovered through research conducted Jedi Knight Natua Wan), Leia stays behind in order to help advise in the Galactic Alliance leadership, while Tesar Sebatyne and his fellow Barabel Jedi secretly guard the Jedi Temple from the caverns they nest in. In the aftermath of the Jedi's departure, Senator Suldar and many other newcomer Senators in the GA form an anti-Jedi subcommittee that substantially influences the vote for acting Chief of State; instead of front-runner Wynn Dorvan being elected, former terrorist/freedom fighter Senator Padnel Ovin is sworn in as the Chief. But Ovin is sharp enough to realize that his voters decided on him due to his simplistic leadership style, which they believe would allow them to manipulate him as a puppet. So Ovin hires Dorvan back in his old position as \n\nChief of Staff in order to help Ovin cope with the political machinations of Suldar's faction."}, {"tag": "p", "text": "As it turns out, Kameron Suldar, whose real name is Ivaar Workan, and all of the other Senators in the anti-Jedi subcommittee are really the human members of the Lost Tribe of the Sith doing their duties whilst their Keshiri colleagues scour the Jedi Temple. The subcommittee quickly has Leia arrested on trumped-up charges, but she does not resist; as it turns out, Luke was aware of the Lost Tribe's infiltration of the GA early on, which was what partially persuaded him to remove the Jedi from the Galactic Alliance and Coruscant. While this does allow the Sith to secretly control the government, it gives the Jedi time to deal with Abeloth, Ship, and their Sith allies; when Abeloth and the others are taken care of, the Jedi will swoop in on Coruscant and wipe out the remainders of the Lost Tribe in one swift stroke."}, {"tag": "p", "text": "In the meantime, Leia, gets involved in a new conspiracy circle called Club Bwua'tu, which includes the newly-reawakened Admiral Nek Bwua'tu, his uncle Eramuth, Wynn Dorvan, and a few others; their intention is to expose the Lecersen conspiracy still boiling within the Galactic Alliance. Because of all this, the Lecersen conspiracy gradually dissolves, beginning with Stavin Thaal telling Senator Treen that it's time to disband. Treen kills Bramsin, making it look like he died of old age, and then retires from politics in order to return to her home world of Kuat. Parova is caught by Club Bwua'tu, but before she can reveal any information, she is killed in a refresher by Ivaar Workan's Sith. Jaxton is forced to commit suicide by Thaal, who in turn goes into hiding, and the Imperial-Alliance conspiracy ends."}, {"tag": "p", "text": "Meanwhile, Jag confronts Moff Tol Getelles on the experiments the Squibs discovered, which leads to him shooting Jag aboard the Bloodfin and Getelles reporting to Daala that Jag is dead. However, unknown to Daala, Getelles actually staged the whole thing, only stunning Jag and then defect to Daala. In an attempt to stop Daala's plan for becoming Empress of the Imperial Remnant, Jag, together with the vanguard of the Empire of the Hand and his own loyal forces of the Remnant, track her down to a meeting of her Maw Irregular Fleet and the forces of Lecersen, Vansyn, Trevin, and Getelles, surprising them in the Exodo system. With Jag attacking her from the front, killing Trevin and his forces, and Getelles turning on Daala, it looks as if Jag can defeat Daala quickly. But the tide of the battle changes when Lecersen destroys Jag's hidden base, the hollowed-out moon Boreleo, as well as the Pellaeon hidden near the moon. Jag, Kthira'shi'ktarloo, and Tahiri manage to escape to the Bloodfin, commanded by Admiral Vitor Reige, but now face a hard battle."}, {"tag": "p", "text": "Grand Lord Vol, arriving on Coruscant, learns from Lord Workan that Rokari Kem, the new and charismatic Senator from Qaras, is not who she claims to be and could be a threat to the Sith. Vol decides to kill her as a result, only to be killed by Kem herself. Kem then tasks Workan, in his guise as Senator Suldar, to get her elected as Chief of State in place of Ovin. Using the Force, she gives the Chief of State a heart attack. Ovin filibusters the Senate with a speech about his homeworld. Ovin dies, and Kem is almost immediately elected Chief of State. She then takes up residence in the abandoned Jedi Temple, where she learns that Leia has escaped prison with the help of Club Bwua'tu, but that one of the conspirators, Wynn Dorvan, has been captured. Kem then goes to Dorvan in order to learn what she can from him, and reveals herself to be Abeloth."}, {"tag": "p", "text": "Meanwhile, on Upekzar, Luke leads the vast majority of the Jedi Order in the hunt for Abeloth, only to discover that she set a trap by using the body of Sith Saber Tola Annax as a Force bomb. The Jedi manage to escape, though the explosion sets of a massive groundquake. At the same time, Ben, Vestara, and Natua Wan are tasked by Luke to explore the inactive lava tunnels below the planet and are attacked by a mutated Dream Singer; while fighting it, Ben is incapacitated by hallucinations created by the beast. Vestara, seeing no other way to save his life, kills Natua by feeding her to the beast, which then retreats into the tunnel. Despite managing to save his life, making the choice to kill a Jedi instead of trying to fight the beast some other way makes Vestara realize that she might be too much of a Sith to ever truly become a Jedi. The novel ends with Vestara reflecting that one day, she will be forced to completely return to her Sith roots, and which may require her to kill Ben as a result."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In chapter six, Leia Organa Solo is said to be former GA Chief of State. In fact she was Chief of State of New Republic."}, {"tag": "p", "text": "In chapter eight, Jacen Solo is said to be an uncle of Ben Skywalker, instead of his cousin."}, {"tag": "p", "text": "In chapter nine, Dromund Kaas is misspelled Dromand Kaas."}, {"tag": "p", "text": "In chapter twenty-five, Porrak Vansyn's first name is constantly spelled Porak."}, {"tag": "p", "text": "In chapter twenty-eight, Eramuth Bwua'tu was introduced as a cousin of Nek Bwua'tu, instead of his uncle."}, {"tag": "p", "text": "In chapter thirty-three Natasi Daala is referred to nonexistent position as Chief of State of Galactic Empire, instead she was recently deposed Chief of State of Galactic Alliance."}, {"tag": "p", "text": "In chapter thirty-five, a TIE Defender is twice referred to as a \"TIE Destroyer\", and an Interdictor is referred to as an \"Interceptor\"."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}