{"url": "Fate_of_the_Jedi:_Conviction", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Fate of the Jedi"], "nodes": [{"tag": "h1", "text": "Fate of the Jedi: Conviction"}, {"tag": "p", "text": "Fate of the Jedi: Conviction by Aaron Allston is the seventh novel in the Fate of the Jedi series and was released on May 24, 2011. At the end of the book, it has an introduction to Fate of the Jedi: Ascension. The audio version is narrated by Marc Thompson. The paperback was released on August 28, 2012."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "h4", "text": "Back cover"}, {"tag": "p", "text": "The Jedi have struck a blow against the heart of tyranny. Can Luke Skywalker strike down the embodiment of evil?"}, {"tag": "h4", "text": "Internal flap"}, {"tag": "p", "text": "Chief of State Natasi Daala has been overthrown, and the Jedi Order has taken control of the Galactic Alliance. But while the new governors dismantle Daala's draconian regime, forces still loyal to the deposed official are mobilizing a counterstrike. And even the Jedi's new authority may not be enough to save Tahiri Veila, the former Jedi Knight and onetime Sith apprentice convicted of treason for the killing of Galactic Alliance officer Gilad Pellaeon."}, {"tag": "p", "text": "Meanwhile, Luke and Ben Skywalker are relentlessly pursuing Abeloth, the powerful dark-side entity bent on ruling the galaxy. But as they corner their monstrous quarry on the planet Nam Chorios, the two lone Jedi must also face the fury of the Sith death squadron bearing down on them. And when Abeloth turns the tables with an insidious ambush, the Skywalkers' quest threatens to become a suicide mission."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Taking place just after the previous novel, Valin and Jysella Horn are freed from carbonite. Those present believe that the Horns are cured of the Force psychosis that had plagued them prior to their freezing. However, it turns out that Valin and Jysella are still infected despite the fact that every other victim of the disease was cured when Abeloth was forced to go on the run. Valin and Jysella, still believing that everyone else in the galaxy has been replaced by imposters, pretend they are indeed normal. Cilghal and Tekli, though, are still skeptical of the siblings' conditions."}, {"tag": "p", "text": "On Pydyr, the battle between the Jedi and Sith forces concludes with the remainders of both forces pulling back now that the Skywalkers, Vestara Khai, Abeloth, and Ship have left the system. Meanwhile, the Skywalkers and Vestara track Abeloth and Ship to the planet Nam Chorios, where the entity plans to take over the Theran Listeners and the tsils. Luke quickly seeks out the Theran Listeners to learn mnemotherapy, which he believes will be useful in a confrontation with Abeloth. This rare Force ability allows him to extract memories from people so that he can either let those memories die off or exchange the memories with someone else. Shortly after, Abeloth makes her presence known by causing a Force storm that damages much of the city."}, {"tag": "p", "text": "Back on Coruscant, the conflict between the Jedi Order and Galactic Alliance Chief of State Natasi Daala finally reaches its boiling point. Booster Terrik returns the hostages taken aboard the Errant Venture in the previous novel. A conspiracy containing Imperial Moff Drikl Lecersen, Kuati Senator Haydnat Treen, several high-ranking military offers, move in to overthrow Daala, but they are surprised by the Jedi moving in at the same time. The Jedi capture Daala and she is placed in prison with Tahiri Veila, who is awaiting the verdict of her trial for her murder of Grand Admiral Gilad Pellaeon during the Second Galactic Civil War. A triumvirate composed of Jedi Master Saba Sebatyne, Treen, and General Merratt Jaxton is established to run the GA. Saba reveals to the public that she is the new acting Grand Master of the Jedi Order due to Kenth Hamner's death in the previous novel. Hamner is given a traditional Jedi cremation in spite of his unpopular policy of appeasing Daala, and his armed assault on Saba."}, {"tag": "p", "text": "Meanwhile, throughout the galaxy several star systems that had engaged in the practice of slavery experience revolutions. Han and Leia Organa Solo are dispatched to one of these star systems, Klatooine, to facilitate a peaceful transition of government and to prepare Klatooine for membership in the Galactic Alliance. However, Hapan Queen Mother Tenel Ka Djo is needed to help speed the process along, and her journey from Hapes to Klatooine is tracked by a Lost Tribe stealth ship. The ship's crew is under orders from Sith Saber Gavar Khai to find the Jedi Queen seen by Khai and the late High Lord Sarasu Taalon in the Pool of Knowledge. Considering Tenel Ka's history as a Jedi, she is not unlikely as a suspect. When the Sith follow Tenel Ka's retinue to Klatooine, their leader, Querdan Dei, eventually figures out the connection between the Queen Mother and Han and Leia's allegedly adopted daughter, Allana. Dei abducts C-3PO plants a bomb in the protocol droid's body without his knowledge before allowing Allana to rescue him. As Threepio attends the summit with Tenel Ka, Allana discovers him and grabs the detonator before Dei can use it. Leia arrives to save Allana, and briefly duels Dei, decapitating him. Following Dei's death, the rest of his team decide their mission is a failure and leave as the bomb is removed from C-3PO. Soon, Klatooine is taken in as a member of the Galactic Alliance and is officially freed from the tyranny of the Hutts. The Solos and the Hapans all leave afterward, but Tenel Ka and Allana are unable to meet or even say good-bye."}, {"tag": "p", "text": "On Coruscant, Tahiri is found guilty and sentenced to death. However, as she is returned to prison Boba Fett breaks in to help Daala escape. They are successful, but Tahiri uses Daala's escape to her own advantage so that she could also flee in the chaos, becoming a homeless fugitive as a result."}, {"tag": "p", "text": "Back on Nam Charios, Vestara manages to lead the Sith to the planet so that they can help her and the Skywalkers in killing Abeloth. Valin and Jysella have also been called to the planet by Abeloth to help her. They eventually track Abeloth to a pumping station, where Ben and Vestara are forced to duel Valin. When Luke personally confronts Abeloth, the entity reveals that her Callista Ming persona is not just another life she has absorbed, but more of a conscience for Abeloth. Luke, realizing that Callista cannot go on like this, uses mnemotherapy to rip Callista's soul from Abeloth's body, allowing the former to finally die in peace and become one with the Force. The Sith then arrive and surround Vestara and the Jedi. Knowing that they cannot win such a battle, Vestara kills a tsil, which causes a Force wave that mentally harms all nearby Force users in order to level the playing field and allow herself and the Skywalkers to escape. The Jedi StealthX fleet arrives to once again do battle with the Sith forces. Despite Luke, Jaina Solo, and Zekk's attempts at trying to destroy Abeloth and Ship in the battle, the latter two escape but are severely wounded, both physically and mentally. The Jedi and Sith again withdraw following Abeloth and Ship's escape. In the end, however, Abeloth, now grieving over Callista's loss, meets with Gavar Khai and his Sith fleet and proposes that they join forces to kill Luke Skywalker and his allies. Khai carefully considers this offer."}, {"tag": "p", "text": "The novel ends back on Coruscant, where Tahiri is hiding out in an abandoned apartment building. Since most of the Jedi haven't returned to the Temple yet, she will have to stay a fugitive for a while. Despite her situation, she is finally glad that she is free and can walk barefoot again, just the way she likes it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This novel reveals that it was because of the machinations of the Imperial-Alliance conspiracy that sent the fake Jedi who put Nek Bwua'tu in that coma back in Fate of the Jedi: Allies."}, {"tag": "p", "text": "Tenel Ka Djo and Boba Fett both make their returns in this entry of Fate of the Jedi after their final respective appearances in the finale to Star Wars: Legacy of the Force, Legacy of the Force: Invincible."}, {"tag": "p", "text": "This novel finally puts an end to the subplot of Tahiri Veila's trial over the murder of Grand Admiral Gilad Pellaeon."}, {"tag": "p", "text": "Throughout the novel, it is stated that the events that had occurred on Pydyr back in Fate of the Jedi: Vortex had occurred on its parent planet of Almania."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}