{"url": "Fate_of_the_Jedi:_Vortex", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Fate of the Jedi"], "nodes": [{"tag": "h1", "text": "Fate of the Jedi: Vortex"}, {"tag": "p", "text": "Fate of the Jedi: Vortex by Troy Denning is the sixth novel in the Fate of the Jedi series and was released on November 30, 2010. At the end of the book, it has an introduction to Fate of the Jedi: Conviction. The audio version is narrated by Marc Thompson. The paperback was released on March 27, 2012."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "h4", "text": "Back cover"}, {"tag": "p", "text": "Jedi and Sith fight side by side against an even greater foe. But how long can enemies remain allies? And how high is the price of betrayal?"}, {"tag": "h4", "text": "Internal flap"}, {"tag": "p", "text": "In a stunning turn of events, Luke Skywalker and his son, Ben, joined forces with members of the Sith armada sent to kill them—and turned their combined might against the monstrous being Abeloth. But with one menace dealt with, a new and even more insidious threat looms."}, {"tag": "p", "text": "Now Luke and Ben must go on the run, taking along the inscrutable—and ever dangerous—Sith apprentice Vestara Khai. With a host of Sith warriors in hot pursuit, the Skywalkers soon find themselves trapped on the moon Pydyr, caught between their former allies and a mob of angry Fallanassi. A new truce may be their only hope. But can a Sith ever be trusted?"}, {"tag": "p", "text": "With the Jedi's most famous father-and-son team outnumbered and outgunned, the countdown to galactic disaster has begun—and time is running out."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts out aboard the Rockhound. Jaina Solo and Lando Calrissian are traveling back to Coruscant to inform the New Jedi Order of Luke and Ben Skywalker's situation. However, they find themselves near Kessel, which was not on their intended course. Jaina and Lando soon discover that the ship's droid crew are being manipulated by an unknown source. Jaina goes to her damaged StealthX X-wing starfighter despite Lando's protests and finds that the StealthX's weapons are being dismantled by one of the droids. Jaina then learns that on the Rockhound's stop at Klatooine, the ship had received a mouse droid as a new delivery. Jaina, in conclusion, determines that whoever is manipulating the droids—she suspects the Lost Tribe of the Sith—is using that mouse droid to maneuver the Rockhound toward Kessel instead of Coruscant. She then tells Lando to search for the mouse droid while she goes out in her StealthX wing, now equipped with only four shadow bombs, to ward off anyone trying to take hold of the Rockhound. Several skiffs arrive in the system, and Jaina fights them off, using all four of her shadow bombs to destroy most of the skiffs and their \"mothership.\" Now unable to defend herself against the remaining skiffs, Jaina pilots her StealthX back to the Rockhound, where Lando has located and destroyed the manipulative mouse droid. They escape into hyperspace. Jaina now has confirmation that the attackers were in fact Sith pirates, based on the how they knew where to fire whenever she used the Force to launch her shadow bombs."}, {"tag": "p", "text": "On the mysterious planet where the Skywalkers and the Lost Tribe of Sith fought and apparently killed the mysterious entity known as Abeloth, Luke Skywalker is working with High Lord Sarasu Taalon and Sith Saber Gavar Khai to find clues about Abeloth's origins by searching her lair. Meanwhile, aboard the Jade Shadow docked some distance away from Abeloth's lair, Vestara Khai tells Ben Skywalker that the Sith Meditation Sphere known as Ship has contacted her through the Force, telling her that he is coming back to serve the Lost Tribe. They agree to take this information to Luke. But Vestara first has Ben check in on their patient, Dyon Stadd; while he does so, she locks him inside the Jade Shadow's medical bay. She now can go directly to either Taalon or her father rather than to Luke in order to inform them of Ship's impending arrival. However, Ben cuts his way out of the medical bay with his lightsaber and catches up to Vestara before she can make it to Abeloth's lair, forcing her to promise not to betray the Skywalkers or tell either Gavar or Taalon of Ship coming to the planet. With that, they continue on to the lair where, despite the presence of Gavar and Taalon, Ben is able to communicate to his father about Ship while Vestara, even under the threat of punishment, does not inform either of her masters as to why she and Ben left Dyon alone back on the Jade Shadow."}, {"tag": "p", "text": "Knowing that the Jedi-Sith alliance would crumble if either Taalon or Gavar received this knowledge, Luke proceeds to save Vestara from abuse at Taalon's hands, but more as a distraction than genuine concern for her well-being. This way, Ben is able to attempt to take Abeloth's body away so that he and his father can get her back to Coruscant for examination by Cilghal. Vestara and Taalon see what Ben is up to and Taalon nearly kills him before Vestara stops the High Lord to point out that during the scuffle the sheet covering the corpse was knocked off, revealing not Abeloth's body, but Dyon Stadd's. They conclude that what they thought had been an illusion of Abeloth killing Stadd during their battle was real, and that Abeloth faked her death and took Stadd's place aboard the Jade Shadow."}, {"tag": "p", "text": "On Coruscant, Galactic Alliance Chief of State Natasi Daala continues her Mandalorian siege on the New Jedi Temple, demanding that the most recent Jedi Knights to fall prey to the Force psychosis, Sothais Saar and Turi Altamik, be turned over into GA custody. The two Jedi are brought outside, where Daala's Bith surgeon, Thalleus Tharn, looks them over for a brief preliminary test to confirm that they're not impostors or still insane. Tharn tests to make sure of this by kneeing Saar in the groin, which prompts Altamik to stop the surgeon by raising him up in the air with the Force to prevent any further attacks from the Bith. Using this action as basic evidence that Saar and Altamik are not still insane, considering how the latter Knight controlled herself in the event of the attack, and that Tharn's practiced eye would have seen any work of plastic surgery meant to disguise impostors, Tharn concludes that the Force psychosis is indeed gone, and the Knights are sane again. Daala then calls off the siege, but says that until she knows that the Jedi are holding nothing back from her, Valin and Jysella Horn will remain in Galactic Alliance Security's custody."}, {"tag": "p", "text": "Later, the Jedi High Council hold a meeting over how they can convince Daala to thaw Valin and Jysella out of carbonite. Acting Grand Master Kenth Hamner insists that they confront Daala through non-violent means while the rest of the Council's members argue that they must go into an all-out war against the Chief of State in order to reclaim the Horns. Things get even more heated when news reports from the world of Blaudu Sextus reveal several Mandalorians gunning down Octusi, peaceful protestors fighting for their freedom from slavery at the hands of the Sextuna Mining Corporation. The meeting ultimately leads to Hamner having to reveal that, in an effort to have Daala stand down against the Jedi, he made a secret deal with someone, whose identity he refuses to divulge, just to convince the Council not to make any active moves against the Chief. Hamner's position in the Council becomes even more tenuous than before as a result, but the other Masters do agree to do it his way after Corran Horn says that the time and circumstances aren't right for a regime change--at least not yet. Things get even more complicated for the Council, and for the Jedi Order as a whole, when Jaina and Lando report the pirate attack on the Rockhound and present data indicating that the Lost Tribe have spread throughout the galaxy. Meanwhile, in order to have a bill passed that will substantially support the Jedi, the Solos' and Lando meet with Sullustan Senator Luewet Wuul. Wuul inadvertently reveals that Kenth Hamner's secret deal was made with Admiral Nek Bwua'tu during the Mandalorian siege on the Jedi Temple. Wuul then reluctantly reveals the terms of the deal: if Hamner makes sure that the Jedi don't launch their StealthX wing to help Luke Skywalker, then Bwua'tu would convince Daala to lighten up on the Order."}, {"tag": "p", "text": "Back on the mysterious planet in the Maw, the Skywalkers and the Sith, now aware of Abeloth's survival, find Ship. Despite the Skywalker's earlier fears, the Jedi-Sith alliance remains intact because they must still work together to kill Abeloth. Ship, who appears to vow complete loyalty to the Sith, transports the Jedi-Sith party to the Pool of Knowledge so they can use it to find Abeloth. The Pool shows them an image of Abeloth running on along shore of the island that the party is on. But before they can go after her, the Jedi-Sith alliance finally breaks when the Sith see an image in the Pool of a Jedi queen on a throne surrounded by many Force-users--the same vision Luke had received in Fate of the Jedi: Abyss. This prompts Luke and Ben to fight Taalon and the Khais so that the Jedi Queen's existence is kept a secret. During the fight, Taalon dives into the Pool. The Skywalkers barely escape alive, aware that Abeloth has already taken Ship and the Jade Shadow off planet, so their only way off-world is to the Emiax, the Sith's shuttle. They decide to take Vestara with them, using her as a hostage to protect them from the Sith, and because they hope to extract the location of the Lost Tribe's home world from her. Luke convinces her to come with him and his son by reminding her that since she failed her duty to lead the Skywalkers to their deaths, Taalon and Gavar will likely try to kill her. Now off-world, the Skywalkers, with Vestara in tow, begin their search for Abeloth."}, {"tag": "p", "text": "On Coruscant, Tahiri Veila's trial continues to be go badly, especially now that her lawyer, Eramuth Bwua'tu, appears to be incompetent. The Solos hire a second defense attorney named Sardonne Sardon to help Bwua'tu prove that Tahiri was acting under orders from the late Darth Caedus to kill the late Grand Admiral Gilad Pellaeon if she couldn't persuade him to side with Caedus in the Second Battle of Fondor during the Second Galactic Civil War. Unfortunately, Bwua'tu and Sardon's different legal methods impede Tahiri's case theory that she was acting under orders, which prompts Tahiri to fire Sardon, believings that Bwua'tu works better alone. He reveals his acts of incompetence were to make Tahiri look good with the jury and not so much like a fool, despite the fact that it was harming her case. Bwua'tu manages to admit into evidence, a holovid recorded aboard the Star Destroyer Bloodfin. This holovid shows the prosecution's star witness Imperial Lieutenant Lydea Pagorski's failure to act when it became apparent that Pellaeon's life would be in danger. With Pagorski's credibility shattered, her testimony is stricken from the record and she is removed from court for perjury."}, {"tag": "p", "text": "Meanwhile, Admiral Nek Bwua'tu is in a coma after being attacked by fake Jedi in the last novel. Even Chief of State Daala knows that the Jedi couldn't have been behind it because it was tactically unsound for them to attack such a high-placed officer in the Galactic Alliance military; furthermore two Jedi would have easily killed Bwua'tu rather than botch the attempt. In her quest to find out who was behind Bwua'tu's attack, Daala finds out that the Admiral seems to be stimulated by the sight of reporter Madhi Vaandt on the HoloNet reporting the anti-slavery revolt on Blaudu Sextus. Daala doubts that Bwua'tu is stimulated by her sexually, and starts to believe that Vaandt might be behind the attack. Later, Daala meets with Imperial Head of State Jagged Fel to show him the video footage that her spies had taken on Jaina Solo and Lando Calrissian presiding over the trial against the Sith on Klatooine during the planet's slave revolt. Jag understands Daala is trying to blackmail him when it becomes apparent that Jaina and Lando only allowed half the Sith who stood trial be sentenced to death while letting the others go free. Daala tells Jag that if he doesn't lend her Imperial support to put down the pan-galactic slave revolts, then she will broadcast the video throughout the galaxy to expose the Jedi's alliance with the Sith."}, {"tag": "p", "text": "It isn't long before the revolt on Blaudu Sextus again erupts into violence instigated by Belok Rhal's Mandalorians. Though the Mandalorians are stopped by Sothais Saar and Avinoam Arelis, Madhi Vaandt is killed by Rhal. This outrages the Jedi, with the Council except for Kenth Hamner, believing that now is the time to take the fight to Daala. Then, when Han Solo forces Hamner to reveal that he made a secret agreement with Nek Bwua'tu during the Temple siege, the rest of the Jedi Masters informally vote him out as their leader. This results in a complex plan to free Valin and Jysella Horn from their carbonite prison and to respond to Luke Skywalker's recent distress call for the Jedi StealthX fleet to assemble at Abeloth's suspected location: Almania's moon of Pydyr. However, Jagged Fel tells the Solos that he and the Moffs have decided that as long as Daala rules the GA, the Imperial Remnant will never join the Alliance. So he plans on leaving soon and advises the Jedi to move quickly with their plans before Daala finds out about everything. The Order agrees, while Jaina and Jag renew their engagement."}, {"tag": "p", "text": "On Pydyr, the populace appears infected with a plague, though in reality it is an illusion cast by the Fallanassi to deter outsiders. Luke immerses himself in the White Current to see through the illusions, but declines to inform either Ben or Vestara of the nature of the plague. He reasons that Vestara would likely call her Sith masters to Pydyr, but if she doesn't know the plague is an illusion, then she can't pass this information on to the Sith. Ben must also be kept in the dark, because Luke feels there is a substantial risk that he might tell Vestara the truth. So as Luke sets off to find Abeloth himself, leaving Ben and Vestara aboard the Emiax, he encounters Akanah Norand Goss Pell, an old Fallanassi acquaintance, and learns that the Fallanassi are hiding Abeloth, believing the entity is one of their own. Ben and Vestara disobey orders to stay behind aboard the Emiax and join up with Luke. The Sith also arrive, having been tipped off by Vestara while Ben was distracted."}, {"tag": "p", "text": "On Coruscant, the Solos and several allies—including C-3PO, Zekk, and Taryn Zel—break into the prison where Valin and Jysella are being held and retrieve them. Meanwhile, Booster Terrik holds a celebrity sabacc tournament aboard the Errant Venture, intending to use the highly-placed people aboard, (including Wynn Dorvan, Drikl Lecersen, and several others) as hostages while the Venture fires at orbiting satellites around Coruscant. This is a distraction to lure the Sixth Fleet's attention away from the Jedi Temple as the Jedi prepare to launch their StealthX fighters. As the Fleet chases the Errant Venture into hyperspace, the StealthX launch is nearly stopped by the actions of the disgraced Kenth Hamner. Hamner, believing he is acting in the Order's best interest, tries to regain his authority on the Council by attempting to kill Saba Sebatyne, who is leading the Jedi against Daala. As he and Saba engage in a duel, Hamner tries to disable the hangar doors to prevent the StealthXs from launching. In the end, Saba is forced to kill Hamner in order to ensure the success of the launch. With Hamner now dead, the StealthXs make it off Coruscant and set course for Pydyr. The other Masters formally elect Saba as acting Grand Master of the Order. Saba, however, is stricken with grief at having to kill a fellow Master, and vows to accept whatever punishment Luke places on her when he resumes his position as Grand Master."}, {"tag": "p", "text": "On Pydyr, it is revealed High Lord Taalon's dive into the Pool of Knowledge has caused a strange transformation: his Force powers have increased, and he begins to resemble Abeloth. Luke agrees to help Taalon and the rest of the Sith find Abeloth so that she can tell Taalon what is happening to him and then they can kill her. They quickly find Abeloth, who has now taken over Akanah's body. To protect the entity, the Fallanassi use their illusions to attack most of the group, leaving only the Skywalkers, Taalon, and Vestara free to confront Abeloth. Abeloth then leads the four of them into a meeting hall where she promises to tell Taalon about his transformation if he orders Vestara to turn on the Jedi. As Ben duels both Vestara and Taalon, Luke and Abeloth fight. Luke kills Abeloth's Akanah body, only to find out that she has another body in the form of Callista Ming. In the end, Luke and Ben are both defeated, severely wounded, and about to be killed by Taalon. Vestara, knowing that Abeloth is the greater threat and that she intends to use Taalon as her puppet to control the Sith, turns on the High Lord and kills him."}, {"tag": "p", "text": "As Abeloth flees following Taalon's death, the StealthX fleet arrives and battles the Sith forces, who have recovered from the Fallanassi's illusory attack. Although Vestara still refuses to embrace the light side of the Force, she knows that she cannot return to the Sith after murdering a High Lord. She decides to stay with the Skywalkers as they are her only remaining allies. Luke and Ben allow her to join them only if she treats them as true allies. She agrees and helps them fight off several Sith. The three of them reclaim the Jade Shadow, make a brief report to the Errant Venture, and prepare to continue the hunt for Abeloth."}, {"tag": "p", "text": "In the aftermath of the StealthX launch and the rescue of the Horn siblings, Daala threatens to attack the Jedi Temple. However, Saba, Corran Horn, and Cilghal all warn her that any drastic measures will be met with reprisals against the hostages aboard the Errant Venture. While Daala doubts that the Jedi would ever go that far, she nevertheless backs down—at least until the hostages are returned."}, {"tag": "p", "text": "Allana Solo, her Jedi guardian Bazel Warv, and her pet nexu Anji discover a hidden catacomb deep within the New Jedi Temple where Tesar Sebatyne and three other Barabel Jedi have made a nest for their spawn. The Barabels wish to keep the nest a secret, and decide they must either kill Allana, Bazel, and Anji, or have them join them for the next two months. Allana reveals her true identity as the granddaughter of Han and Leia Organa Solo, and daughter of the late Jacen Solo and Hapan Queen Mother Tenel Ka Djo. They compromise and agree to keep each other's secrets. The novel ends with the Barabels letting Allana, Bazel, and Anji leave so that they can join Han, Leia, Corran, and Mirax Terrik Horn in watching Cilghal and Tekli unfreeze Valin and Jysella from their carbonite prisons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}