{"url": "Father_(Mortis)", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Force wielders", "Category:Males"], "nodes": [{"tag": "h1", "text": "Father  (Mortis)"}, {"tag": "p", "text": "The Father was a powerful Force wielder who resided in the realm of Mortis. His children, the Daughter and the Son, represented the light side and the dark side of the Force, respectively. Balance was maintained between them by the Father until his failing health compelled him to search for a successor."}, {"tag": "p", "text": "During the Clone Wars, the Father guided Anakin Skywalker to Mortis in order to test the Jedi Knight's abilities and concluded that he was indeed the Chosen One destined to bring balance to the Force. Skywalker declined the Father's invitation to remain on Mortis, however. Moreover, the machinations of the Son ultimately resulted in the destruction of both himself and his family. Near death, the Father divined that one day Skywalker would fulfill his destiny."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Father was a male individual who was a member of an enigmatic Force wielder family known as the Ones. He was the father of the Daughter and the Son, who represented the embodiment of the light and dark side of the Force respectively. The Father sought to act as a balance between the two siblings and to keep the galaxy safe from their immense Force powers."}, {"tag": "p", "text": "Due to the Force powers of his children, the Father brought the Daughter and the Son to the Wild Space planet of Mortis, which existed on the spiritual plane in the remote Chrelythiumn system. Mortis was believed to have been the origin point of the Force and acted as a conduit for all things connected to it. For eons, the Father kept watch over the balance of the Force in the galaxy. While his Daughter remained loyal to the light side, the dark-side-leaning Son sought to usurp his Father's authority."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "The Chosen One"}, {"tag": "p", "text": "During the Clone Wars, news reached the Ones that the Chosen One had been found. This prophesied Chosen One turned out to be Anakin Skywalker, a Jedi General and Padawan Ahsoka Tano's master. The Father used an ancient Jedi distress code to lure Skywalker and his fellow Jedi Master Obi-Wan Kenobi and Ahsoka to the Chrelythiumn system. Anakin and his Jedi comrades traveled to there and found themselves on the planet Mortis."}, {"tag": "p", "text": "Upon landing, the Father sent the Daughter to greet the visitors and bring them to him. On the way, they were waylaid by the Son; who rolled a rock onto the path they were traveling. While the Daughter and the Jedi visitors were unhurt, the travelers were separated by the rock. By nightfall, Skywalker had made his way to the Mortis monastery which served as the abode of the Father and Daughter. The Father bid Skywalker welcome and led him to a bed. After the Son appeared to Anakin in the form of his late mother Shmi Skywalker Lars, the young Jedi Knight angrily confronted the Father; who denied being a Sith."}, {"tag": "p", "text": "The Father then introduced himself and his children as Force wielders. After relating the history of his family, the Father told Anakin that he and his friends were free to leave Mortis once he had undergone a test. This test was intended to determine whether Skywalker was indeed the Chosen One and to force him to confront his own guilt. The following morning, the test took place in the courtyard of the Mortis monastery. The Son and Daughter had transformed into their animal forms and kidnapped both Tano and Kenobi. As part of the test, Anakin was forced to choose whom he would save."}, {"tag": "p", "text": "Anakin passed the test by using the planet's Force-amplifying properties to force the Son and the Daughter to release their captives and revert to their humanoid forms. The Father congratulated Anakin for passing the test but told him that he still had to learn about the true nature within himself. The Father then asked Anakin to take his place as the balancing force between his two children. He also warned the Jedi Knight that if he chose to leave, he would endanger the galaxy with his selfishness. Unwilling to abandon his Jedi comrades, a conflicted Anakin decided to leave with Kenobi and Ahsoka on their ship."}, {"tag": "h4", "text": "The center cannot hold"}, {"tag": "p", "text": "Before Anakin and his Jedi comrades could leave Mortis on their ship, they were accosted by the Son, who kidnapped Ahsoka Tano and brought her to his cathedral. Kenobi recommended that they consult the Father for help but Anakin was determined to rescue his Padawan and headed to the Son's cathedral. Later, the Father confronted the Son at the Mortis monastery and implored him to let go of the dark side. The Son lost his temper and blasted the Father with Force lightning just as Kenobi arrived inside the monastery."}, {"tag": "p", "text": "The Father was rendered unconscious by the Son's attack. In his absence, the Daughter managed to convince Kenobi to retrieve the Dagger of Mortis from the altar in order to stop the Son from escaping offworld to wreak havoc on the galaxy. Anakin, Kenobi, and the Daughter confronted the Son and a dark side-corrupted Ahsoka at the Son's cathedral. The Father eventually recovered from his unconsciousness and tried to put a stop to the fighting between his children. However, the Father proved no match for the Son due to his weakened state."}, {"tag": "p", "text": "During the struggle, the Son attempted to kill the Father with the Dagger of Mortis. However, the Daughter intercepted the blade and was mortally wounded. Grief-stricken by the death of his sister, the Son fled the scene. As the Daughter died, the balance of the Force on Mortis was upset and the planet descended into darkness. In her dying moments, the Daughter used her remaining Force powers to cleanse Ahsoka of her dark side influences and to revive her from the dead. Fearing that the imbalance on Mortis would cause the Sith and dark side to gain the upper hand in the galaxy, the grieving Father implored the Jedi to leave before the Son could use their ship to escape offworld. As the Jedi left, the Father mourned his Daughter's death."}, {"tag": "h4", "text": "Sacrifice"}, {"tag": "p", "text": "After mourning the Daughter, the Father buried her in a crypt with the Dagger of Mortis. He was soon joined by Anakin, who had come to seek his help in stopping the Son. Skywalker feared that the Son could not be imprisoned on Mortis forever. While the Father was determined to eliminate his Son before he could endanger the galaxy, he refused to accept Skywalker's help because he feared that the Son could use the young Jedi Knight's powers to tilt the balance of the Force and wreak havoc in the galaxy. The Father added that their fates were now in the hands of the Force and implored him to search himself for the answers needed to stop the Son."}, {"tag": "p", "text": "Despite the Father's warning, Anakin was seduced by the Son in the Well of the Dark Side. The Son convinced him that he could embrace the dark side in order to avert terrible visions of the future including the Great Jedi Purge and the rise of the Galactic Empire. Under the Son's influence, Skywalker trapped Master Kenobi in the Well and then attempted to reach his starship. Kenobi however managed to contact Ahsoka and convince her to disable the ship's power systems, sabotaging the Son's plans."}, {"tag": "p", "text": "The Father then confronted Anakin outside his starship. After Skywalker voiced his fear that he would bring great suffering in the future, the Father used his Force powers to erase Anakin's recent memory and to drive the dark side from him. The Father and the three Jedi visitors then confronted the Son at the Mortis monastery. The Father implored his Son to give up his plans but he refused. A skirmish soon broke out and the Son's powers proved too powerful for even the combined might of the Father and the Jedi."}, {"tag": "p", "text": "In order to strip the Son of his Force powers, the Father sacrificed his own life by stabbing himself with the Dagger of Mortis. Shaken by remorse, the Son came to his senses and made peace with the Father shortly before he was impaled by Anakin's lightsaber. With his dying breath, Father proclaimed that Anakin was the Chosen One for restoring balance to Mortis. The Father also prophesied that Anakin would bring back balance to the Force in the wider galaxy but warned the Jedi to beware of his inner self lest he bring doom to the galaxy. The Father's body then vanished, leading to the disappearance of Mortis."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following the Father's death, Anakin and his Jedi comrades found themselves transferred back to the physical realm. Ultimately, the Son's prophecy that Anakin would fall to the dark side came to fruition at the end of the Clone Wars. Under the influence of Darth Sidious, Skywalker became Darth Vader. As the Emperor's enforcer, Vader brought much doom and misery to the galaxy. However, the Father's prophecy that Anakin would restore balance to the Force in the galaxy also came to fruition when he sacrificed his own life to save his son Luke Skywalker during the Battle of Endor."}, {"tag": "p", "text": "During the Galactic Civil War, the Emperor's adviser Veris Hydan and Spectre Ezra Bridger discovered a painting depicting the Father with his two children. Their painting was actually a doorway to an alternate dimension known as the World Between Worlds. In the World Between Worlds, Ezra heard the Father's voice along with those of many other important figures in the galaxy."}, {"tag": "p", "text": "Shortly after Ezra left the dimension and closed the portal, the temple started to break apart. As this happened, the painted image of the Father came to life and raised its hands and brought them together, as the painted images of Loth-wolves ran towards it. This caused the temple to fully collapse, leaving nothing behind."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Appearing in the form of a wizened and ancient humanoid, the Father had a long flowing beard and smooth, gray skin. He loved his children, the Daughter and the Son, greatly. Knowing the danger of their Force powers, the Father kept them isolated from the galaxy on the planet Mortis, which existed on a spiritual plane. The Father was a wise Force-wielder who sought to maintain balance in the Force. He also rightfully regarded Anakin Skywalker as the Chosen One and sought to guide the young Jedi Knight on that path."}, {"tag": "p", "text": "The Father tried to convince his wayward Son not to embrace the dark side and return to the galaxy to wreak havoc. As such, the Father attempted to reason with his Son but failed. The Father sought to keep Anakin from straying onto the path of the dark side. On one occasion, he purged Anakin's memories in order to prevent the Son from using Skywalker to wreak havoc on the galaxy. The Father was also willing to sacrifice his own life in order to stop his own Son."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Father was a Force-wielder who dwelled in the spirit plane and appeared to have lived for eons. While the Father appeared in the form of a wizened and ancient humanoid, he was capable of accomplishing great feats through the Force including stripping his children of their animal forms. His Force abilities include the ability to stop a lightsaber blade with his hand. The Father could also teleport instantly as shown when he was testing Anakin. The Father was capable of purging Anakin's memories by touching his head. The Father was also able to fly by sporting wings from his back. The Father was also able to use a powerful force push, so powerful that The Son and The Daughter flew out of a window and landed in their courtyard. The Father was able to absorb The Son's force lightning. While he was capable of fighting with his Force powers, he was no match for the dark side powers of his son. Due to his age, he was becoming weaker and could not hold off The Son's assault. Although he was very powerful and immortal, the only thing that could kill him was the Dagger of Mortis. The Father used this dagger to kill himself. In doing so, The Son also lost his immortality and Anakin was able to kill him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Father first appeared in 2011, in the episode \"Overlords\" in the third season of The Clone Wars. He was voiced by Lloyd Sherr and also appeared in episodes \"Altar of Mortis\" and \"Ghosts of Mortis.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}