{"url": "Fear_Virus", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Articles with conjectural titles", "Category:Viruses", "Category:Weaponized plagues and viruses"], "nodes": [{"tag": "h1", "text": "Fear Virus"}, {"tag": "p", "text": "The Fear Virus was a virus developed by the Separatists during the Clone Wars. It was a relatively simple virus and so could be killed by most antiviral compounds, such as those found in a starship's bio-scrubbers, as well as by exposure to vacuum. It had both a solid, slime-like form and an airborne form. The virus took one hour to affect beings exposed to the airborne form, though beings could resist it at this time, and it would affect them more and more each hour. The slime-like substance, however, affected anyone who came in contact with it."}, {"tag": "p", "text": "The virus attacked the victim's brain, causing hallucinations which were generated from the more morbid regions of the victim's mind. These illusions were very dangerous, however, as the victims were essentially hypnotized and so would fully believe in any fantastic creature from their imagination, or past, that they saw. Any damage that the illusionary creature dealt them would thus cause actual damage, generally in the form of blisters, cuts, and bruises. However, the cure for the virus was in the victim's subconscious; squirt guns, whipped-cream pies, odd gestures, and other nonsense that children would use to ward off or dispel their imaginary monsters would also work against these illusions."}, {"tag": "p", "text": "The only known containers of the virus were placed upon a bulk freighter which drifted in space for over one hundred years before being found. Somehow during this time it had become a burned-out wreck with holes in its hull through the bridge and engineering sections. Also, for over 75 years before being found, the ship's bio-scrubbers had been overloaded. Though a group entered the ship and was attacked by both the virus itself and the droids on board, they managed to make it off alive and decontaminated the entire ship, taking it as their own."}, {"tag": "h2", "text": "Sources"}]}