{"url": "Fe_Sun", "categories": ["Category:Legends articles", "Category:Females", "Category:Individuals of unidentified species", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Fe Sun"}, {"tag": "p", "text": "Fe Sun was a female Jedi Knight and the second Padawan of Jedi Master Shaak Ti. Soon after achieving knighthood, Sun was murdered by the Zeltron criminal Lyshaa."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi training and knighthood"}, {"tag": "p", "text": "Discovered to be Force-sensitive at an early age, Fe Sun was trained at the Coruscant Jedi Temple throughout her childhood, before being accepted as the Padawan of Jedi Knight Shaak Ti. Unlike most Padawan-Master pairs, Ti and Sun did not accept journey missions from the Jedi High Council; instead Ti chose to train Sun in the wilds of Shili. Studying the ways of the Force and how to survive in the wilderness, Ti's training methods emphasized training over experience."}, {"tag": "p", "text": "When it was deemed that Sun had completed her training, the girl faced her Trials of Knighthood back on Coruscant and passed, ascending to the rank of Knight herself. Accepting missions from the High Council, her first assignment took her to a world plagued by mercenaries. Sent to quell a dispute, Sun faced a world inhabited by anti-Jedi natives, something she had never experienced on Shili. Unprepared, Sun was overwhelmed when the Zeltron criminal Lyshaa led a revolt against her. Lyshaa, seeking fame for killing a Jedi, executed Jedi Sun and gloated about the deed."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The death of Fe Sun gave Shaak Ti the unpleasant distinction of having trained two Padawans who met a violent death after becoming a Knight. Though she was overcome by grief, Ti was able to continue, using her strength to stay strong and true to the Force. Lyshaa, on the other hand, had little time to bask in her new found fame; for the Jedi were swift to exact justice on her. Lyshaa was sent to a prison complex on Brentaal IV where she would stay until her death during the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}