{"url": "Feeana_Tala", "categories": ["Category:Legends articles", "Category:Crime lords", "Category:Females", "Category:Mawans"], "nodes": [{"tag": "h1", "text": "Feeana Tala"}, {"tag": "p", "text": "Feeana Tala was a female Mawan. She became a crimelord after a civil war broke out on the planet of Mawan."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Feeana Tala was born before 36 BBY. She grew up as a resident of the planet's capital city, Naatan."}, {"tag": "h3", "text": "Becoming a crimelord"}, {"tag": "p", "text": "During the planet's civil war of 36 BBY, which its citzens called the Great Purge, Feeana Tala retreated to her hideout, which was within the tunnel system of Naatan's underground infrastructure. There she began selling goods and services to the citizens of the planet—the dwellers beneath the capital city being part of the largest faction of free Mawans onworld. Tala and her accomplices also carried out raids."}, {"tag": "p", "text": "After the civil war ended, Feeana, along with Decca and Striker, became one of three principal crimelords of Mawan. Although not as powerful as the other crimelords, she controlled most of the goods and services sold to the majority of citizens harbored beneath the capital and commandeered many troopers and soldiers. Because she supplied the tunnel workers with food, earning great respect from the underground dwellers in the process, she knew the tunnels below almost as well as those of the Resistance movement."}, {"tag": "h3", "text": "Supporting the peace"}, {"tag": "p", "text": "In 25 BBY, Tala met Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker. They convinced her to support the peace on her homeworld. She agreed to help the Jedi establish a peaceful government in exchange for relinquishing her criminal career and being granted amnesty and a place in the Malwan government."}, {"tag": "p", "text": "To that end, Feeana supported Jedi Master Yaddle in her efforts to wrest control of Naatan's power grid and reactivate the energy supply on the surface of the planet. Thereafter, her troops aided Yaddle to secure and patrol the surface while watching the Jedi Master's back against the counter-efforts of Strider and Decca."}, {"tag": "p", "text": "Although Striker later captured Skywalker, desiring to kill him, Anakin was freed by Yaddle and managed to escape. Yaddle, however, did not escape, but was instead killed by Striker, when he attempted to unleash a biochemical bomb on the planet. Tala's position thereafter seemed to her untenable and hopeless as she sought to protect her people against Striker. Even so, the sacrifice of Yaddle persuaded Tala to remain on Mawan."}, {"tag": "p", "text": "It was when the crimelords Decca and Striker joined their forces against the Jedi that Tala, too, decided to switch sides once again. She formed an alliance with Striker and betrayed the Jedi."}, {"tag": "p", "text": "Feeana Tala had hoped to be able to escape the planet with \"Striker\" (who was actually the mysterious Granta Omega), but he betrayed her in the end. Nearly killed by Omega when he threw her from his transport as a distraction, Tala only survived with the intervention of Anakin Skywalker."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "After the Jedi were able to restore peace again to the planet, Feeana Tala was imprisoned along with the planet's other captured criminals."}, {"tag": "p", "text": "Feena Tala was described as a young Mawan female, wiry and tough, with acute senses."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}