{"url": "Feeorin/Legends", "categories": ["Category:Legends articles", "Category:Endothermic species", "Category:Feeorin", "Category:Reptilian sentient species", "Category:Reptomammalian sentient species", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Feeorin"}, {"tag": "p", "text": "The Feeorin were a bipedal species of sapients that spread across the Outer Rim after the demise of their homeworld, thousands of years before the Invasion of Naboo, and established a major colony on Odryn. Feeorin were quick to anger and highly impersonal. They typically placed their own affairs above others, causing other species to regard them as selfish."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The average Feeorin had thick tendrils hanging from the backs of their heads (similar to those of the amphibious Nautolans) and much smaller and thinner ones hanging from their face. They also had mottled skin ranging from yellow to green and blue, with a few individuals even having jet-black or white skin pigmentation. The Feeorin could live for up to four hundred years, and due to a unique metabolism, they grew stronger with age rather than weaker. Curiously, some Feeorins had noses while others lacked any nasal openings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Mandalorian Wars, the Feeorin were ruled by the Exalted, the oldest and strongest of the Feeorin Elders. At the time, the title was held by Jedi Master Feln, who had defeated all other tribes and united his people. He kept his title even after becoming a Jedi, which allowed the Jedi Covenant to use the holiest place of the Feeorin, the Sanctum of the Exalted, as a secret facility for the storage and research of Sith artifacts."}, {"tag": "p", "text": "After the demise of Odryn, many of the Feeorin colony ships never reached their destination, and the survivors were seen as raiders and scavengers by the natives of their settled worlds. It was apparently rare for Feeorin to become Jedi."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Feeorin believed that the spirits of their fallen Elders resided at the Sanctum of the Exalted, where they forged Odryn's seasons. Because of this, when the presence of the Helm of Dathka Graush altered the weather six kilometers around the Sanctum, many believed the dead Elders were angry at the presence of outsiders—non-Feeorin—there. This was also a violation of the Rime Feeorin, the Feeorin's ancient code.\nFeeorin mostly had simple names composed of no more than 4 or 5 letters."}, {"tag": "h2", "text": "Feeorin in the galaxy"}, {"tag": "p", "text": "The most famous members of the Feeorin species was the pirate captain Nym, who battled the Trade Federation in the Karthakk system prior to the Clone Wars; Feln, leader of the Feeorin during the Mandalorian Wars and a member of the Jedi Covenant; and the pirate Rav, who lived circa 130 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}