{"url": "Fefze", "categories": ["Category:Legends articles", "Category:Fefze", "Category:Insectoid sentient species", "Category:Mid Rim species", "Category:Oviparous species"], "nodes": [{"tag": "h1", "text": "Fefze"}, {"tag": "p", "text": "The Fefze were an insectoid species who came from the planet Fef. While a single Fefze was non-sentient, swarms of Fefze collectively formed a sentient intelligence."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Fefze were meter-high insects with black carapaces. Their antennae provided them with their senses of smell and hearing. They also communicated by rubbing and clicking their antennae together. When threatened, Fefze could curl their heads and legs underneath their carapaces. Their carapaces could also split into two wings, allowing them to fly short distances."}, {"tag": "p", "text": "One of their most notable abilities was their adaptable digestive system, which could digest nearly any sort of carbon-based organic material. They did this by coating food with digestive acids which freed the carbohydrates in the food. Fefze ate the carbohydrates, leaving a protein-rich paste behind. Their digestive system also acted as a defense mechanism—they could spit their powerful digestive acids to harm a predator, or simply flee leaving some protein gruel as a distraction."}, {"tag": "p", "text": "Due to the abundance of food available to the Fefze and their lack of dexterous appendages, they never developed technologically and had few exports."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Individual Fefze were no more intelligent than any other non-sentient insect. However, each one was part of a swarm of ten to one hundred Fefze. A single Fefze's brain acted as merely one component of a larger intelligence. Though a Fefze's lifespan was approximately 10 years, swarms could live for centuries."}, {"tag": "p", "text": "Fefze swarms began as small groups of hatchlings from the same egg globule. Swarms added members through a swarm dance. In this mating ritual, male Fefze from one swarm would fertilize the eggs of the females of another swarm (and vice versa). Each swarm would take a share of the eggs back to their own territory, so the hatchlings would join the existing swarm. Another egg globule would be abandoned in hopes that it would grow into a new swarm. Over the years, the Fefze swarm dance developed into an art form."}, {"tag": "h2", "text": "Fefze in the galaxy"}, {"tag": "p", "text": "Fefze swarms were renowned throughout the galaxy as dancers, visual artists (specializing in organic and ephemeral media), and even musicians. Other Fefze swarms were recruited by companies such as the New Horizons Development Corporation as colonists and food producers, since they could convert nearly anything into nourishment for other species."}, {"tag": "p", "text": "A swarm of Fefze was once contracted to work on Duro. Because of the pollution, they mutated into the Fefze beetle, a non-sentient predator. Several swarms—including the wealthy and pro-Imperial Nat'xikta swarm—colonized the planet Brolsam in the Kathol sector, where they helped convince their Rodian and Human neighbors to join with the New Republic forces."}, {"tag": "p", "text": "During the Swarm War, the Fefze were among the sentient insectoid species who became Joiners and fought on the side of the Killiks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}