{"url": "Felinian", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles from unlicensed sources", "Category:Articles with gameplay alternatives", "Category:Feline sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Felinian"}, {"tag": "p", "text": "The Felinians were a species of sentient felinoids native to the planet Zoma V, where they lived in jungles. During the Galactic Civil War, the Felinians had developed technology considered primitive in the galaxy at large, but they desired advanced weapons such as blasters, commodities for which they traded precious stones. The Saurian crime lord Sithless Leethe attempted to smuggle Imperial weapons to the Felinians under the oversight of his associate, a Saurian named Slopper. Nevertheless, the couriers he had chosen to deliver the cargo—spacers to whom he had sold a light freighter on condition of delivery of the unopened crates to the Felinians—chose to deliver the weapons to the Rebel Alliance instead."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Felinians were sentient felinoids with a physiology that enabled them to wield blaster weapons intended for Humans."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The species inhabited the jungles of their homeworld, Zoma V. Although their technology was considered primitive by the standards of the greater galaxy, at least some Felinians could use advanced weaponry such as blasters. The Felinians bartered for such goods by trading precious stones."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Felinians hailed from Zoma V, a world in the Zoma system. The region had been explored by outsiders some point between 15,000 and 8000 BBY, and it eventually became part of the Hunnoverrs sector of the Outer Rim Territories. The area had fallen under the influence of the Sith Empire between 1004 and 1000 BBY, during the New Sith Wars. From 52 to 19 BBY, it was within territory considered part of Hutt Space."}, {"tag": "p", "text": "During the Galactic Civil War, a Saurian crime lord named Sithless Leethe obtained a shipment of Imperial munitions that he attempted to smuggle to the Felinians. He stored the weapons in a light freighter called the Limping Lady on Tatooine and placed them under guard of his lieutenant, another Saurian named Slopper. Leethe then found a band of spacers to buy the starship from him; as part of the deal, they agreed to deliver the cargo unopened to the Felinians on Zoma V."}, {"tag": "p", "text": "Nevertheless, the spacers deviated from the plan and took the weapons instead to the Alliance to Restore the Republic. Leethe discovered their duplicity and retaliated by taking out a bounty for their capture."}, {"tag": "p", "text": "Circa 25 ABY, Zoma V fell within a region where the average sentient population per star system was under one million. It had fallen into territory considered part of Darth Krayt's Galactic Empire by 137 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Felinians are mentioned in the roleplaying adventure \"Limping Lady,\" which was written by Peter M. Schweighofer and published in Challenge 64 in September 1992. The narrative above assumes the player-characters—the unnamed spacers—deliver the cargo to the Rebel Alliance, as this is the scenario that affords them the largest reward and is considered the correct path. Nevertheless, what they do with Sithless Leethe's cargo is up to them; players may also opt to visit Zoma V and deliver the weapons to the Felinians. In such a scenario, the catlike aliens give the Saurian Slopper 5,000 in precious stones in exchange."}, {"tag": "p", "text": "Challenge magazine was unaffiliated with Lucasfilm Ltd., which has left the canon status of the Felinians ambiguous. Despite the uncertainty surrounding the species' place in continuity, the Felinian home system is referenced in The Essential Atlas, published in 2009. However, according to one of the authors, Jason Fry, \"its inclusion shouldn't be taken as a statement of canonicity for anything except the geography.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}