{"url": "Felucia/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Commerce Guild locations", "Category:Confederacy of Independent Systems planets", "Category:Felucia locations", "Category:Felucia system planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Jungle planets", "Category:Low-gravity planets", "Category:New Republic planets", "Category:Type I atmosphere planets", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Felucia"}, {"tag": "p", "text": "Felucia ((pronounced /fʌ'luʃə/) or /fʌ'lusiə/) was a largely unsettled terrestrial jungle planet in the Felucia system of the Thanium Worlds in the Outer Rim Territories. Located near the junction of the Perlemian Trade Route and Shaltin Tunnels, the world featured a hot and humid atmosphere and significant water resources beneath a surface irradiated by ultraviolet light of the star Felix. Native plant, fungal, and animal life evolved to dominate the environment in a deep symbiotic relationship, causing significant Force energy to permeate the ecosystem. One native species of sentient Felucians developed Force-based tribal societies in subterranean caverns while another socialized in farming communities based around nysillin crop; both were largely undisturbed by the greater galaxy until 27,000 BBY, when the planet was discovered by Gossam Couriver hyperspace explorers/colonists from Castell. After aggressive resistance from the native wildlife indicated that the world would not support large-scale colonies, the new arrivals established hard-fought, scattered resort settlements on the surface. Early populations, comprising only wealthy Gossams and their poor servants, knew the planet as Galuch and retained colonial control over it until around 25,126 BBY, when Xim the Despot absorbed the world into his empire as it expanded throughout the Tion Cluster."}, {"tag": "p", "text": "Xim's dominion fell in 25,096 BBY, and although Felucia changed political loyalties throughout the millennia, the world and its meager settlements of mixed-species immigrant laborers were entirely controlled by the Gossam-dominated Commerce Guild by 700 BBY. These small settlements eventually developed into commercially administered cities like Kway Teow, Har Gau, Jiaozi, and Niango, pushing the native jungle-dwelling Felucians to retreat into the wilderness. Independent communities of escaped workers, fugitive labor organizers, and Felucian nysillin farmers maintained tenuous communities in the dangerous wilds, but the Commerce Guild retained economic and political control of their world. When the Guild allied with the anti-Galactic Republic Separatist Movement to create the Confederacy of Independent Systems in 22 BBY, Felucia joined the rebellion movement in the Clone Wars as a Confederate fortress world. Separatist General Grievous set up a blockade of the planet early in the war, which was unsuccessfully challenged by the Grand Army of the Republic around the beginning of the conflict. The Republic made a more successful second attempt around a year later. By 19 BBY, the Commerce Guild had once again established its dominance of Felucia and Guild Presidente Shu Mai chose it as her new headquarters and base of military operations. Its tactical significance made it a primary target in the Republic's Outer Rim Sieges, resulting in a bloody months-long battle at the end of the Clone Wars."}, {"tag": "p", "text": "The battle ended with the near-poisoning of the Felucian water supply and the mass murder of the Republic's Jedi commanders with the issuance of Order 66. The years of violence traumatized the native ecosystem, pushing its natural energies and Force-sensitive inhabitants towards the dark side. During the Great Jedi Purge, Jedi Master Shaak Ti and her apprentice Maris Brood went into hiding in the Felucia jungles, working to bring the shamanistic Felucian tribes away from the dark side. Master Ti was killed by an assassin in 3 BBY, throwing the surviving Felucian shaman and Maris Brood deep into the grip of the dark side. The natural Force power of the natives eventually caught the attention of the Galactic Empire, which prepared to exterminate the tribes in order to preempt any threat their power posed. Brood led hordes of dark-sided Felucians against Imperial invaders, but was herself killed during the fight. Although the Empire later maintained a presence on the planet through the Galactic Civil War, Felucia became heavily trafficked by crime syndicates like the Jabba Desilijic Tiure's chapter of the Hutt Cartel and the rival Zann Consortium. The New Republic later wrested control of the world away from the Empire; it again changed hands during the Yuuzhan Vong War, when the alien invaders claimed it for their Empire. Following the war, Felucia was colonized by Ithorian refugees."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Felucia had a diversity of bizarre plants (such as spike, spore, and enormous pitcher plants), fungi, and animals which were almost rubber-like and translucent. When the sun shone, the environment glittered like multicolored glass. Most of Felucia was entirely covered by a humid, fetid landscape of huge fungal forests, and its wildlife included native gelagrubs, immigrated acklays, and a prodigious sarlacc. Felucia had strong ties to the Living Force, and as such the world's flora and fauna, including Jungle Felucians, could be influenced by a presence of a strong Force-user, both light and dark. Most plants and animals of Felucia had adapted special defenses to protect them from each other, which made them particularly hostile to off-worlders. Felucia was known to radiate a sort of life force that the native Jungle Felucians were capable of feeling."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Originally known as Galuch, the planet was colonized by the Gossam Courivers in 27,000 BBY, early in their interstellar history. Felucia was a hard planet to colonize because of its dense forests and creatures. When the Gossams tried to colonize it, many aggressive plants and animals tried to defend the planet, but the Gossams finally gained a few footholds on it. Felucia was one of their earliest colonies, though it was one of the least populated since its vast fungus jungles proved too wild to support large Gossam colonies. As such, the planet became little more that an exotic retreat world for the wealthy Gossam along with their lowly servants and laborers. Circa 25,126 BBY, the planet was absorbed into Xim's empire as he expanded his borders from the Kingdom of Cron."}, {"tag": "p", "text": "Sometime before 700 BBY, the planet began to be controlled entirely by the Commerce Guild, and resistance to the Guild was found in scattered townships in the wilderness. These townships were home to escaped workers, criminals, and enemies of the Guild. As colonies spread, the native Jungle Felucian species went underground or lived in small villages in the thickest forests. Many, if not all, of the Jungle Felucians were Force-sensitive, and had a communal relationship with the planet's ecosystem."}, {"tag": "p", "text": "Around 53 BBY, Felucia became a member of the Republic. A little over two months after, Senator Palpatine took up his post on Coruscant, and Felucia was given a seat in the Galactic Senate. The move was viewed by some as a way for the Trade Federation to secure greater support in the Senate. Indeed, some senators, chief amongst them the delegate from Sullust, openly viewed Murkhana as a mere \"client world\" of the Trade Federation."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "At some point during the Clone Wars, a farming community was established on the planet to grow the nysillin that served as a medical herb. The reptilian Felucian farmers were later terrorized by Hondo Ohnaka's pirate gang, who demanded that the settlement hand over their harvest. In order to protect themselves, the farmers hired a group of bounty hunters which consisted of Sugi, Embo, Seripas and Rumi Paramita. The Galactic Republic also established a medical station in orbit around the planet in order to treat clone troopers wounded in battle. However, the Confederacy of Independent Systems staged an assault that destroyed the space station and deployed a station that held Vulture droids to destroy any intruders."}, {"tag": "p", "text": "Felucia later became the headquarters of the Commerce Guild, which supported the Confederacy of Independent Systems, and Felucia would become a valuable member world. In 21 BBY, the Jedi Obi-Wan Kenobi, Anakin Skywalker, Ahsoka Tano, and Plo Koon were involved in a futile assault on the planet. Later in the war, the planet was named by Supreme Chancellor Palpatine as part of a \"Triad of Evil,\" alongside Mygeeto and Saleucami. Felucia's proximity to several important hyperlanes made it an important target for both sides of the war, and the campaigns on the planet dragged on. At one point, Ahsoka Tano was kidnapped by Trandoshan headhunters during the push to take a Separatist outpost."}, {"tag": "p", "text": "The Republic later sent the 182nd Legion to Felucia to fight Separatist troops on the planet. One month later, contact with the legion had been lost, and the Republic sent the 501st Legion to fight the Separatists. The 501st were confronted by Acklay and flesh-eating diseases for many weeks. The horror of the battle was so bad that one clone said they would have been driven insane, if not for the Jedi Commander Aayla Secura. A group of clones were sent to find a missing AT-TE in the Felucian forest. There they found that Acklay had killed the occupants, but the clones protected their platoon by killing the acklay. After retrieving power cells from a crashed LAAT/i gunship, the clones reactivated the AT-TE and finally broke through the Separatists' front line by damaging their artillery."}, {"tag": "p", "text": "The planet was attacked during the Outer Rim Sieges. After the first attack, in 19 BBY, Barriss Offee and Zonder were imprisoned on the planet. Aayla Secura took the Intrepid to Felucia to capture Shu Mai and rescue Barriss and Zonder; meanwhile, the Separatists began their attack on Coruscant."}, {"tag": "p", "text": "With the help of Padawan Ekria, Aayla Secura rescued Barriss and Zonder from the Nigkoe Detention Facility, resulting in a full-fledged ground battle. The Republic forces then assaulted Shu Mai's personal compound, not realizing Mai had already evacuated and was on Utapau."}, {"tag": "p", "text": "The Jedi infiltrated the compound and found Mai long gone, but managed to shut down the droid army remotely, letting Commander Bly's clone troops into the compound, at the same time the Invisible Hand was crashing onto Coruscant."}, {"tag": "p", "text": "Unfortunately, the compound was booby-trapped, and released toxins, killing many clones. The Jedi barely escaped before the entire compound exploded, but many clones did not. The trap also triggered a \"poisoned well\" policy to keep the planet from being of worth to the Republic, unleashing a highly poisonous biological agent into the water supply of Felucia's natural planet-wide aquatic distribution system, capable of infecting the entire planet in four days."}, {"tag": "p", "text": "Shu Mai had left behind forces ordered to fortify the planet's major water-treatment facilities. They knew the only way to prevent the deaths of millions was to take over the facilities and contain the toxin. The Jedi Council sent Stass Allie with clone reinforcements to Felucia."}, {"tag": "p", "text": "Stass dropped off the clone reinforcements and Padawan Drake Lo'gaan on Felucia and then headed to Saleucami. The Republic forces split into three forces, each headed toward a different facility: Barriss, Lieutenant Inc, and Lieutenant Barr to Har Gau; Ekria, Zonder, Drake, and Lieutenant Galle to Jiaozi; and Aayla and Commander Bly to Niango."}, {"tag": "p", "text": "Barriss' forces defeated a Commerce Guild patrol, at the cost of Lieutenant Inc's life. Barriss ordered Lieutenant Barr's troops to abandon her and go get Lieutenant Galle for help."}, {"tag": "p", "text": "Meanwhile, Lieutenant Galle used a staged retreat to distract the Commerce Guild forces from the facility at Jiaozi, which the Padawans were able to infiltrate. The Padawans completed their mission at Jiaozi by shutting down the outgoing pipes before the arrival of the toxin, but were unable to access the controls of the Niango and Har Gau."}, {"tag": "p", "text": "Ekria was puzzled when she detected a Confederacy-encrypted holo from Coruscant being received by Bly, not understanding that it was Darth Sidious relaying Order 66. Ekria was able to tap into the clone-cam feeds of Bly's troops and behold Aayla, who was spooked by the complete silence of the wildlife as she and Bly headed towards Niango. As Aayla was distracted by a native bird taking to the air, she was gunned down from behind by Bly and the other clones."}, {"tag": "p", "text": "Simultaneously, Barriss was fighting alone, surrounded by droids. To her relief, she saw Lieutenant Galle's men seemingly rush to her rescue, but instead they shot her down."}, {"tag": "p", "text": "The Padawans were horrified by Aayla's murder, but able to decrypt the message and hear Order 66. They then heard a new message on Republic channels from Coruscant: \"Calling all Jedi. This is Supreme Chancellor Palpatine. The war is over. I repeat, the war is over. All Jedi are ordered to return to the Jedi Temple immediately. You will receive further instructions when you arrive.\""}, {"tag": "p", "text": "The Padawans then checked Galle's clone-cam, and saw that Galle's troops were about to burst into the Jiaozi facility to kill the Padawans. The Padawans barely escaped, and would later head to Coruscant."}, {"tag": "h3", "text": "Later events"}, {"tag": "p", "text": "Since their defeat, Separatist remnants, including Gossam settlers, found shelter in small enclaves in the fungal wilderness, joining forces with fugitive laborers, outlaws and smugglers they formerly persecuted."}, {"tag": "p", "text": "After the Clone Wars, the damage to the ecosystem combined with the pain and suffering felt on the planet caused many of the force sensitive Jungle Felucians to teeter dangerously close to the dark side of the Force. This made Felucia an even more dangerous place, in many years to come. Sometime before the Galactic Civil War, the Empire conquered the planet, after the world's capture, they destroyed any local resistance. In the aftermath of Felucia's fall, the Empire began to occupy the world. The Imperial forces maintained presence in Kway Teow primarily to gather Gossam slaves for export and to research biological agents takes from diverse and abundant plant life. However, the Consortium continued to offer freedom for the locals against the Empire."}, {"tag": "p", "text": "During the late days of the Great Jedi Purge, Darth Vader sent his secret apprentice Starkiller to Felucia to deal with Force-sensitives there. Master Shaak Ti had exiled herself to this planet, where she was training the grief-stricken Padawan, Maris Brood, and Jungle Felucians for a confrontation with the Dark Lord. Starkiller fought his way through a small army of Jungle Felucian warriors and engaged Shaak Ti in a lightsaber duel. Despite Master Ti summoning more Jungle Felucians and even calling on the assistance of a Sarlacc, Starkiller defeated her in combat, and after informing Marek about how he could be \"so much more\" if he turned to the light, she then purposely fell into the pit and conceded her defeat. Marek attempted to save her as she began her plummet, but her body exploded in blue light as she died, causing him to turn back and shield his eyes, this had further plundered Felucia to the Dark Side. Not realizing that Ti was dead, Senator Bail Organa came to convince the Jedi to join his rebellion. Maris, who had been driven insane by the dark side, kidnapped the senator to use to bargain with Darth Vader. However, one year later, a reformed Starkiller redeemed himself by rescuing the Senator. After dueling Maris, he allowed her to live, something that Organa condemned, likening her to Darth Vader. The Empire began operations on the planet to eliminate the native Force sensitives and established a prison facility, from which agents of Bail Prestor Organa rescued Admiral Gilder Varth."}, {"tag": "p", "text": "During the Galactic Civil War, in 1 BBY, Jabba Desilijic Tiure had sent a Sith holocron that he spent half his wealth on to Felucia to be protected by the Empire, where it was stolen by the Zann Consortium. It was during this time that Tyber Zann here led a contingent of his underworld mercenaries against the Imperial forces. However, Zann would get captured by Imperial forces as part of a trap set up by Jabba, although he would later escape."}, {"tag": "p", "text": "Sometime afterward, the New Republic liberated Felucia from the Empire's rule and ended their reign on the planet."}, {"tag": "p", "text": "The planet was overrun by the Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "p", "text": "The Ithorians later colonized the planet, along with Borao, after the devastation of Ithor, under the protection of the Galactic Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Felucia was created for Star Wars: Episode III Revenge of the Sith. Early concept art for the planet depicted a world of enormous bulbous plants that seeped antigravitic goo into the skies, which later evolved to become the planet Saleucami (at the time, named \"Falucia\"). Originally designed for an opening montage of Confederacy planets under assault by the Galactic Republic, Felucia later was used during the Order 66 montage scene, serving as the place of the death of fan favorite Aayla Secura. The planet was later explored in the Expanded Universe media such as Paul Ens' webstrip Evasive Action: Reversal of Fortune and the Star Wars: The Force Unleashed multimedia project. The planet has been featured in the video games Star Wars: Battlefront II and Star Wars: Empire at War: Forces of Corruption as playable battleground. With its background expanded in The Force Unleashed Campaign Guide and The Essential Atlas, Felucia has also appeared in Season Two and Season Three of Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}