{"url": "Female_Saarai-kaar", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Dark Jedi", "Category:Invids", "Category:Jensaarai", "Category:New Jedi Order members", "Category:Redeemed Force-sensitives", "Category:Unidentified females", "Category:Unidentified humans", "Category:Unidentified Jedi of the New Jedi Order", "Category:Unidentified pirates"], "nodes": [{"tag": "h1", "text": "Female Saarai-kaar"}, {"tag": "p", "text": "A female Saarai-kaar served as the leader of the Jensaarai following the death of Nikkos Tyris."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When Tyris and her husband were killed by the Jedi Nejaa Halcyon and Ylenic It'kla in 22 BBY, she developed a hatred of the Jedi, whom she believed were responsible for murdering her husband and Master (unaware that Tyris was a Dark Acolyte of Count Dooku). She assumed the leadership of the Jensaarai and kept them hidden from the Galactic Empire on Susevfi. However, her son approached Darth Vader, offering to become a Jedi hunter. Vader killed him on sight, and the Saarai-kaar further hid her people."}, {"tag": "p", "text": "She trained Mei, the daughter of Sukarr, and her lover Fomadu who would seek revenge on Obi-Wan Kenobi \"Desertwind\" on Nar Shaddaa for the murder of her father, some time after the Proclamation of the Empire."}, {"tag": "p", "text": "Admiral Leonia Tavira, however, later found the Jensaarai, and forced them to help her pirate fleet. The Saarai-kaar discovered Mirax Terrik Horn among Leonia's pirate crew, and kept her in a Force-induced hibernation. When Corran Horn, Nejaa Halcyon's grandson, arrived on Susevfi with Luke Skywalker and Elegos A'Kla, Ylenic's nephew, they fought the Saari-kaar, defeating her. After the battle, Elegos shared the memnis of Tyris and Halcyon's deaths with the Saarai-kaar, and she was able to forgive the Jedi. She also discussed the possibility of allowing some of the Jensaarai and herself to join Luke Skywalker's Jedi Praxeum."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}