{"url": "Fenn_Booda", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Republic individuals", "Category:Individuals of unidentified species", "Category:Males", "Category:Podrace hosts", "Category:Wardens"], "nodes": [{"tag": "h1", "text": "Fenn Booda"}, {"tag": "p", "text": "Fenn Booda was the warden of Desolation Alley, a prison and labor camp located on the moon Oovo IV that was affiliated with the Correctional Authority of the Galactic Republic by the year 32 BBY. As reward for the Desolation Alley inmates' hard work in the Oovo IV ore mines, Booda occasionally entertained them with Podraces that sped through the prison's facilities and the moon's rocky surface. In addition, Booda granted inmate Fud Sang the chance to race with the promise of a possible release if Sang performed well. Booda presented Sang with an old Podracer, which the diminutive alien used to great extent on Oovo IV's three courses: Vengeance, Executioner, and The Gauntlet."}, {"tag": "p", "text": "Booda personally hosted all three of Oovo IV's Podracing events but was usually booed off-stage by the inmates during the opening ceremonies. To increase the inmates' appeal to the races, Booda and the prison's other wardens filled the anti-gravity tunnels that made up parts of the courses with chunks of ore for Podracer pilots to crash into. Booda continued to be Desolation Alley's warden through the start of the Clone Wars in 22 BBY. During that time, Desolation Alley held prisoner the famed Jedi killer Aurra Sing, who tried to trade information to Booda in exchange for her freedom."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Podracing in Desolation Alley"}, {"tag": "p", "text": "Fenn Booda served as the lead warden of the Desolation Alley prison, located on the moon Oovo IV, by the year 32 BBY. The penal colony also served as a labor camp and was affiliated with the Galactic Republic's Correctional Authority division. Inmates were forced to mine for ore under the moon's surface. To keep the prisoners entertained, Booda rewarded their hard work with occasional Podraces. The prison boasted three Podrace courses: Vengeance, Executioner, and The Gauntlet. All three courses started in a circular arena and sped through various anti-gravity tunnels, cell blocks, and power stations. The Gauntlet was the only course that sped across the moon's barren surface."}, {"tag": "p", "text": "To keep the races more interesting, Booda and the prison's other wardens filled the anti-gravity tunnels with chunks of ore and rock, creating hazardous obstacles for Podracer pilots. One tunnel on Vengeance lacked any ore whatsoever and instead played host to an exogorth—a giant space slug. Booda personally hosted each and every Oovo IV race and was introduced to the spectators by the Troig race commentator Fodesinbeed Annodue. However, every time Booda took center stage to see the racers off, the prison's inmates routinely booed the warden off the stage. By 32 BBY, all three of Oovo IV's courses were part of professional Podracing circuits."}, {"tag": "p", "text": "Booda collaborated with the diminutive and highly-talkative Fud Sang, an inmate serving four back-to-back life sentences in the prison, to provide the inmates someone to root for, as well as a sure winner for the races. Although Sang was a mediocre pilot at best, Booda nonetheless presented him with an old Bokaan Race Engineering BRE Block6 Tri-Ram Podracer and promised that he would consider granting Sang's release if the pilot performed well enough. Sang eventually became Vengeance's crowd favorite and also participated in races on the other Oovo IV tracks. Sang was even given the chance to race offworld on the planet Ando Prime, allowing him to become the crowd favorite of a race course there."}, {"tag": "h3", "text": "Detainment of Aurra Sing"}, {"tag": "p", "text": "Booda continued to serve as the prison's warden through the year 22 BBY, during which time he continued to receive Republic prisoners as the galaxy-wide Clone Wars raged on. After a criminal investigation on the planet Devaron, the renowned bounty hunter and Jedi killer Aurra Sing was captured by the Republic's Jedi Order after she was defeated in combat by the Jedi Aayla Secura. Although Sing's accomplice, Vien'sai'Malloc, was handed over to Devaronian authorities, Sing was sent to Desolation Alley."}, {"tag": "p", "text": "Once in the prison, Sing requested a meeting with Booda. After introducing himself to the bounty hunter, Booda listened to Sing as she offered information about other bounty hunters being hired to kill Jedi in exchange for her release. Booda considered the offer but otherwise noted that Sing would remain in Desolation Alley for some time. Ultimately, Sing was released after serving only a few months in Desolation Alley, as her offer was accepted and she revealed what she knew."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Fenn Booda was both benevolent and malicious at the same time. Although the warden would entertain his inmates with Podraces to keep them happy and compliant, Booda enjoyed the prospect of seeing hapless Podracers crash in his ore-filled anti-gravity tunnels, as he felt that the crashes would make the races more interesting. Booda also hosted The Gauntlet, the only course to speed outdoors, during an annual meteor shower."}, {"tag": "p", "text": "The otherwise strict Booda could also be accommodating, such as when giving Fud Sang a chance to become a Podracing star and offering medical aid to Aurra Sing. He also considered giving both prisoners their freedom, and did so in Sing's case, at least in exchange for information on Jedi hunters. Despite giving his inmates an opportunity to take a break from their work to watch Podraces, Booda was still immensely disliked by the inmates, and they regularly decried the warden during the races. The Podrace commentator Fode Annodue was aware of that and parodied the relationship between Booda and the inmates when introducing the warden at Podraces."}, {"tag": "p", "text": "Booda was a male member of a tall, gaunt species and displayed white-colored skin around his face, with black skin on his arms. The alien's eyes were white in 32 BBY, but ten years later, his eyes had turned yellow and glowed red. Booda's thin arms both ended in three slender digits. He carried a staff with him and wore an ornate headpiece with a red cap and a white shawl, which he accompanied with flowing robes of various colors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fenn Booda was created for the 1999 video game Star Wars Episode I: Racer. Although the game was released for PC, Nintendo 64, and Sega Dreamcast, Booda only appeared in pre-rendered cutscenes for the PC release and was absent from the console versions."}, {"tag": "p", "text": "Throughout Booda's appearances in Star Wars Legends media, the character's arm color is depicted inconsistently. In Episode I Racer Booda's arms are both black, which this article treats as the correct coloration. In Episode I Racer's Prima strategy guide, an illustration of Booda shows him with white arms, although a screenshot of the black-armed Booda from the game is also present in the book. Finally, in the 2003 comic book Jedi: Aayla Secura, Booda's arms are orange in color."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}