{"url": "Fennec_Shand", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Assassins", "Category:Bounty hunters", "Category:Cyborgs", "Category:Females", "Category:Humans", "Category:Hutt Clan individuals", "Category:Mercenaries", "Category:Pilots", "Category:Sharpshooters and snipers"], "nodes": [{"tag": "h1", "text": "Fennec Shand"}, {"tag": "p", "text": "Fennec Shand was a human female assassin, mercenary, and bounty hunter who worked for many of the top crime syndicates. During the early days of the Galactic Empire, when Clone Force 99 landed on Pantora, Shand took it upon herself to capture the clone girl Omega who had a bounty placed on her. She managed to gain Omega's trust, but betrayed Omega and her friends when clone commando sergeant Hunter came to rescue her. She fought off Wrecker, another member of Clone Force 99, and chased Omega to the top of a tower. Shand dropped Omega onto a hovertruck and followed her. Omega was able to escape her grasp and return to Hunter, but Shand vowed to continue her hunt for the girl."}, {"tag": "p", "text": "After the New Republic imprisoned many of her employers, she went on the run and ended up on the planet Tatooine, where she was tracked down by two bounty hunters, Din Djarin and rookie Toro Calican. After she fired on the pair in the desert, they waited till nightfall then charged at her on speeder bikes, using flash charges to cover their approach."}, {"tag": "p", "text": "Shand managed to shoot down Djarin's bike, but Calican reached her and the pair fought. Shand quickly defeated the inexperienced hunter, but he was saved by the arrival of Din Djarin, who forced the assassin to surrender at blaster point. With only one speeder bike left to carry them, the Mandalorian left to search for a dewback, while Calican guarded Shand. As they waited, she successfully convinced him to turn on the Mandalorian, who was also wanted by the Bounty Hunters' Guild; however, instead of freeing her as she had hoped, Calican shot and left Shand for dead, suspecting she would kill him if he freed her."}, {"tag": "p", "text": "Shand was eventually discovered by the bounty hunter Boba Fett, who saved her life with the use of cybernetics. In return, Shand worked as his partner. Following a skirmish against Moff Gideon's Imperial remnant on Tython, Fett and Shand agreed to aid Djarin in rescuing his foundling, Grogu, from the Moff. This led her to be involved in future missions with Djarin, which included the infiltration and attack on an Imperial Remnant on Morak."}, {"tag": "p", "text": "Soon after, the group assaulted Moff Gideon's light cruiser in hopes of rescuing Grogu. After taking the bridge of the cruiser, Djarin returned from his mission to rescue Grogu with a now captured Gideon alongside the Force-sensitive infant. However, the dark troopers that Djarin had managed to shoot out of an airlock while rescuing Grogu soon returned, but, while the group waited for them to arrive, a Jedi searching for Grogu came to retrieve him and rescued the group from the dark troopers. The Jedi revealed himself to be Luke Skywalker and took Grogu from Djarin for further training in the Force."}, {"tag": "p", "text": "With their debt paid, Shand and Fett returned to Tatooine to take control of Jabba's Palace, which had been taken over by Bib Fortuna since Jabba the Hutt's death. Taking control of the palace and killing Fortuna, Shand stood by Fett as he took Fortuna's former throne as the new rulers of Jabba's Palace."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "h4", "text": "Hunting Omega"}, {"tag": "p", "text": "Fennec Shand was a human female assassin who was active within the galaxy during the rise of the Galactic Empire. As she was beginning her career as a bounty hunter, she quickly proved her skills and began work on a direct commission from Kaminoan scientist Nala Se to bring in the enhanced clone girl Omega. During this time, she was contacted by the Sullustan Raspar Six, who had located the ship of Clone Force 99 on Pantora. On her ship, she opened a hologram of Omega and ordered Six to not allow the Bad Batch to escape."}, {"tag": "p", "text": "Shortly after arriving on Pantora, Shand met Omega, who had become lost in Ro Station after chasing a voorpak craft. The bounty hunter offered to help Omega find her companions. As Shand and Omega walked through the city, she tripped a trader carrying fruits and, after pocketing two fruits in clandestine fashion, gave one to the hungry Omega. Omega noted that she hadn't paid for the food, but Shand told her that sometimes it was fine to break the rules. She also questioned why Shand had a blaster, to which Shand responded that she used to protect herself."}, {"tag": "p", "text": "Clone sergeant Hunter then appeared and order Omega to step away from Shand. Omega was initially puzzled, saying that Shand was helping her, but then Shand opened fire on Hunter and engaged him in hand-to-hand combat. After headbutting the clone and stunning him, she chased Omega, but the girl escaped down a hatch and into the maintenance tunnels. A short time later, the Bad Batch learned Shand's identity from the information broker Cid."}, {"tag": "h4", "text": "Chasing down the bounty"}, {"tag": "p", "text": "Shand eventually caught up to Omega, who had been joined by her friend Wrecker. After Omega began to climb a ladder out of the tunnels, Wrecker took on Shand himself, but she easily evades his attack and knocked him out. Shand then chased Omega to the top of a tower. After blasting the door open, Shand grabbed Omega from her doom after she was thrown back by the blast. She then dropped Omega in a hovertruck below and followed her. But Omega pulled a lever on the truck which caused the bounty hunter and the truck's goods to fall and land on an airspeeder. She then threw the owner out of the airspeeder and continued the chase."}, {"tag": "p", "text": "As Hunter tried to save Omega, Shand rammed her speeder into him, causing him to swerve away. She then took out a pair of Pantoran security officers who had begun chasing them. Hunter returned to continue the chase and blasted the engines of Shand's commandeered speeder. When Hunter tossed a pyro denton explosive, Shand was forced to jump out and land in the streets as the speeder exploded and crashed. Without a vehicle to give chase, Shand watched as her quarry escaped. She then returned to Six, who told her that he tried to stop them and begged for mercy. She threw him a credit and told him to contact her if he located Clone Force 99 before informing her employer she would continue the hunt for Omega."}, {"tag": "h4", "text": "Encounter with Bane"}, {"tag": "p", "text": "Shand took her ship and continued tracking the young clone. She was contacted by Se to stop Taun We from claiming Omega from fellow bounty hunter Cad Bane at a abandoned faciltity on Bora Vio. There, Shand killed We, took her credits and confronted Bane. She demanded Omega, fought Bane and attempted to claim Omega. Omega was able to escape her, Bane, and his droid Todo 360. Shand was able to toss Bane off a platform and returned to her ship. Before leaving, she sabotaged Bane's ship, the Justifier, and was contacted by Se. Shand was paid, offered to go after Omega for extra, but Se said she did her job."}, {"tag": "p", "text": "Shand would continue her career, making a name for herself working as an elite and expensive mercenary for the underworld's top crime syndicates, including the Hutt Clan. At some point in her career, she became wanted by the Imperial Security Bureau. In the aftermath of the Battle of Hoth, when a bounty was put on hunter Beilert Valance due to his alliance with rogue hunter Nakano Lash, bondsman Syphacc hired pit fighter Tasu Leech instead of Shand, as he would need to pay Leech less. However, Valance defeated the young pit fighter."}, {"tag": "h3", "text": "Left for dead"}, {"tag": "h4", "text": "On the run"}, {"tag": "p", "text": "Around the year 9 ABY, Shand was on the run with a ten thousand credit bounty on her head after the New Republic arrested many of her former employers. She ended up on the planet Tatooine hiding out beyond the Dune Sea."}, {"tag": "p", "text": "In the desert, Shand killed a human bounty hunter who had been tracking her on a dewback. His corpse, still being dragged through the sand by his mount, was then discovered by two more bounty hunters on her trail, the Mandalorian Din Djarin and the rookie Toro Calican. Calican hid behind a dune while Din Djarin approached the corpse to confirm if it was Shand or not. Shand, who was positioned on a ridge some distance away, then opened fire on the two hunters. She managed to hit Din Djarin twice in the back as he retreated toward the dune, but he survived due to his beskar armor."}, {"tag": "h4", "text": "Desert battle"}, {"tag": "p", "text": "As Shand had the high ground, she waited for the bounty hunters to make the first move instead of trying to escape. Guessing her plan, Djarin and Calican waited till nightfall to make their approach. Once darkness had fallen, the two bounty hunters drove directly at Shand's location on a pair of Zephyr-J speeder bikes. As the assassin prepared to fire, Djarin fired off a flash charge, blinding her and forcing her to remove her helmet. She then missed her first shot, and after Calican fired off another charge she missed again."}, {"tag": "p", "text": "However, when Calican misfired his next flash charge, Shand was able to shoot out Djarin's bike from beneath him. The bounty hunter survived and fired off another flash charge to cover the last portion of Calican's approach, after which Shand shot Djarin in the chest and knocked him to the ground. As she prepared to kill Din Djarin downed, Calican announced himself behind her, allowing her to strike his weapon with a thrown blade and slow him long enough to attack. The rookie attempted to shoot her multiple times as she battled him unarmed, but he was unable to hit her and was quickly disarmed and defeated. As Shand began to crush Calican's neck, Djarin arrived and forced her to surrender at blaster point."}, {"tag": "h4", "text": "Underestimating a rookie"}, {"tag": "p", "text": "Din Djarin forced Shand to put on a pair of stuncuffs and the two hunters marched her down to their sole remaining speeder bike, which Shand mockingly pointed out would not carry all three of them. Djarin suggested that Calican go find the dewback they had seen earlier, but after the rookie refused to trust Din Djarin alone with both the bike and the bounty, the more experienced hunter set off to find it himself, leaving Shand and Calican alone together."}, {"tag": "p", "text": "As the pair waited Tatooine's twin suns rose and Shand began attempting to convince Calican to work with her rather than the Mandalorian. At first she claimed to have a rendezvous in Mos Espa and offered to pay him double her bounty if he took her there instead of turning her in. When he claimed money did not interest him, she instead suggested he capture Din Djarin, as she had heard he had betrayed the Guild and now possessed a high-value asset, a child. She pointed out to Calican that claiming the bounty on a traitor would provide a far greater reputation boost than turning in her bounty and offered to help him subdue the other bounty hunter. She also gave him a bit of advice as to how to thrive in their line of work."}, {"tag": "p", "text": "Calican appeared convinced and holstered his weapon, so Shand approached with her arms outstretched, expecting him to unlock the stuncuffs. Instead, the rookie hunter shot her in the stomach. As she collapsed to the ground, he pointed out that he knew she would have simply killed him once he removed the cuffs, and with Din Djarin's bounty to claim, he no longer needed her. He then thanked her for her advice and the tip she'd given him before mounting his speeder bike."}, {"tag": "h3", "text": "A friend of Fett"}, {"tag": "h4", "text": "Rescue"}, {"tag": "p", "text": "With his business with Shand concluded, Calican left her to die in the desert. Some hours later, Djarin returned on the dewback only to discover her unconscious body. Assuming that Shand had died, Djarin rode back to Mos Eisley to confront Calican, who had captured the Mandalorian's child, a Force-sensitive infant named Grogu. After killing Calican and rescuing the child, Djarin departed Tatooine, believing that his business had been taken care of. Unbeknownst to him, however, Shand had survived their encounter. Alone and unconscious in the desert, her body was retrieved by a man who had been left to die on Tatooine just as Shand had: Boba Fett, the son of the Mandalorian foundling Jango Fett. The outlaw saved her life in a manner that replaced the interior of her lower abdomen, where she had received her wound, with cybernetics. Alive and grateful, Shand swore her services to Fett, who was on a personal quest to retrieve his father's Mandalorian armor."}, {"tag": "h4", "text": "Tython ambush"}, {"tag": "p", "text": "Sometime later, Fett discovered that Djarin had returned to Tatooine and taken Fett's armor from Cobb Vanth, a lawman who used the suit to protect a small town. Shand aided Fett in tracking down Djarin to Tython where she set her scope on Grogu until Fett and Djarin were able to come to a compromise. The trio were soon after ambushed by Moff Gideon's Imperial remnant, most of whom were quickly disposed of; however, the Child was captured by Moff Gideon's detachment of dark troopers. As thanks for returning his armor, Fett offered Djarin his and Shand's help to save Grogu from the clutches of the Empire. Shand accompanied the two to Nevarro aboard Fett's ship, Slave I."}, {"tag": "h4", "text": "Rescuing Grogu"}, {"tag": "h5", "text": "Morak infiltration"}, {"tag": "p", "text": "Shand went with New Republic marshal Carasynthia Dune, Djarin and Fett to the Karthon Chop Fields. There, they took former Imperial sharpshooter turned mercenary Migs Mayfeld into their custody. Djarin wanted to use Mayfeld to find Gideon's light cruiser using a terminal at Imperial refinery on Morak. Upon their arrival on Morak, Shand and Dune took sniper positions outside of the refinery while Djarin and Mayfeld snuck into the refinery. After Mayfeld killed Valin Hess, Shand and Dune took out several of the stormtroopers, gunners and shoretroopers as Djarin and Mayfeld escaped to Slave I. Being an excellent marksman herself, Shand was impressed with Mayfeld's shot that destroyed the Refinery."}, {"tag": "h5", "text": "Capturing Moff Gideon"}, {"tag": "p", "text": "After Djarin recruited two Mandalorians, Lady Bo-Katan Kryze and Koska Reeves, Fennec accompanied the group aboard Dr. Pershing's Imperial shuttle. Along with Dune, Kryze, and Reeves, she made her way through Gideon's cruiser, killing numerous stormtroopers along the way, to the bridge, where they commandeered the vessel. She then stood ready to assist her compatriots against a platoon of dark troopers which were about to gain entry to the bridge, before they were all destroyed by the Jedi Luke Skywalker, who left with Grogu, intending to train him in the ways of the Force."}, {"tag": "h4", "text": "Return to Tatooine"}, {"tag": "p", "text": "Following Grogu's rescue, Shand and Fett's pledge to Djarin was fulfilled, and they returned to Tatooine. They went to Jabba's Palace, and, after taking out several of Bib Fortuna's guards and freeing one of his slaves, she stood by as Fett killed Fortuna. As Fett sat on Fortuna's throne, Shand stood behind him and took a bottle of spotchka to celebrate."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A capable and confident individual, Shand advised the young hunter Toro Calican that the best way to work as a bounty hunter was to make deals in one's own best interest, ensuring their personal survival. Through her words, she believed that she had tricked the rookie gunslinger into freeing her by convincing him to turn on his partner. Calican, however, had assumed that she would betray him and shot her; Shand's overconfidence nearly cost the assassin her life."}, {"tag": "p", "text": "After being rescued from death by Boba Fett, Shand dedicated her services to him as repayment, later vowing to do the same for Din Djarin after his ward was kidnapped by Gideon's forces, proving Shand was not without honor and later showed compassion in freeing a Twi'lek slave from Bib Fortuna. Shand had tan skin, brown eyes, and black hair braided with brown-and-red cording."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Shand was a highly skilled mercenary, with a reputation Din Djarin had heard of that made him hesitate in attempting to capture her. She possessed a mastery of firearm usage, particularly in regards to sniper rifles. During her time on Tatooine, Shand was able to successfully shoot Djarin off his Zephyr-J bike from a great distance, even after being partially blinded by the hunter's flash charges. Her marksmanship was also deadly at shorter ranges, a skill she displayed on Tython when she managed to drop several stormtroopers within a matter of seconds. Shand was able to meet her mark even while airborne; by her own word, she never missed a shot, though was seen to have missed multiple times on Tython."}, {"tag": "p", "text": "Shand was also a capable fighter in hand-to-hand combat. She was capable of matching the clone Hunter in a close-quarters duel on Pantora and easily bested Toro Calican on Tatooine with a series of punches and kicks that ended with the would-be hunter in a crushing headlock between Shand's legs. She was only stopped when Djarin held her at gunpoint. An athletic individual, Shand possessed enough martial skill to knock out Wrecker with his own momentum and later pushed a boulder down a hill on Tython after using it as cover from an E-Web heavy repeating blaster cannon. Like other hunters who had attained a reputation like her own, she was typically only hired for jobs that a client deemed to be truly important."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Shand used an MK sniper rifle with a throwing blade hidden in the stock and carried also a blaster pistol. She wore a black jacket and pants with brown boots and a red and black helmet. During the early weeks of the Galactic Empire, Shand also flew her own ship, but, after allying with Boba Fett during the New Republic Era, the two shared Fett's modified Firespray-31-class patrol and attack craft Slave I."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fennec Shand first appeared in Chapter 5 of Jon Favreau's 2019 Disney+ television series The Mandalorian, which aired on December 6, 2019. She was portrayed by Ming-Na Wen, with Ming Qiu and Lauren Mary Kim serving as stunt doubles. The character was first revealed prior to the episode's release in an article on Vanity Fair on November 4, 2019. Fennec Shand's name was inspired by the Fennec fox. It was promised that a more detailed look at Shand's attire would be released, and, in celebration of Star Wars day, Wen released full body images of her costume on her Twitter account."}, {"tag": "p", "text": "When conceiving Shand, character designer Brian Matyas was instructed to explore the shape and opulence of Lando Calrissian from Star Wars: Episode V The Empire Strikes Back for inspiration. Matyas based Shand's helmet on medieval jousting helmets and gave her armor more feminine and aggressive curves, intending to reflect the role of a high-class assassin by implementing fashionable colors, geometric shapes and fabric textures."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}