{"url": "Ferric_Obdur", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bureaucrats of the Galactic Empire", "Category:Humans", "Category:Males", "Category:Propagandists"], "nodes": [{"tag": "h1", "text": "Ferric Obdur"}, {"tag": "p", "text": "Ferric Obdur was a human male officer who served the Galactic Empire. Originally a member of the Grand Army of the Galactic Republic, Obdur was placed in charge of the official media output during the transition into the Empire. By the late Galactic Civil War, he had been named Grand Admiral Rae Sloane's chief informational officer by Fleet Admiral Gallius Rax, the de facto leader of the fragmented Empire. In this role, he was later appointed to Rax's Shadow Council. During this time, Obdur was served by a female assistant."}, {"tag": "p", "text": "After Rax seized power as Counselor to the Empire, Obdur accompanied the rest of the Shadow Council and Rax's Imperial forces to the Inner Rim world of Jakku. As the months dragged on, Rax found little use for Obdur's work as a propagandist. Obdur was assassinated under Rax's orders prior to the Battle of Jakku."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Propagandist"}, {"tag": "p", "text": "During the Clone Wars, Ferric Obdur was a young officer in the Grand Army of the Republic. He was involved in propaganda work and helped facilitate the transition of the Galactic Republic into the Galactic Empire. Due to his skill as a propagandist, Obdur found himself appointed as Grand Admiral Rae Sloane's chief informational officer a year after the Battle of Endor. Sloane commanded the Imperial Navy which was based in the Vulpinus Nebula. The Empire were locked in a war of attrition against the New Republic, the successor to the Alliance to Restore the Republic, which had gained control of large areas of the galaxy."}, {"tag": "p", "text": "As Grand Admiral Sloane's chief informational officer, Obdur headed the Office of Imperial Promotion, Galactic Truth, and Fact Correction (OIP), a remnant of the former Commission for the Preservation of the New Order. Obdur was based aboard Sloane's flagship, the Super Star Destroyer Ravager. Obdur's work included producing propaganda posters attacking the New Republic and managing Sloane's propaganda broadcasts. Obdur's posters depicted the New Republic as criminals who murdered Imperial cadets and consorted with criminal elements including the Hutts. Grand Admiral Sloane disagreed with Obdur's exaggerated propaganda and urged him to rely on facts."}, {"tag": "p", "text": "Obdur was unapologetic and insisted that facts were flexible. He added that images and graphics could be used to lead viewers to the truth even if they did not precisely portray them. Obdur then laid his hand on her foream but Sloane moved away and grabbed his wrist. She then reasserted her authority and warned him that she was not a \"girlish assistant\" that he could toy with. Obdur apologized for his indiscretion and asked Sloane if he had her permission to publish those images. Sloane reluctantly approved Obdur's \"distorted\" posters."}, {"tag": "h3", "text": "Shadow Council"}, {"tag": "p", "text": "Due to his skills as a propagandist, Ferric Obdur was invited by Fleet Admiral Gallius Rax to join his newly-created Shadow Council, a secret high council that sought to restore the Galactic Empire. Rax was the former commander of the Ravager and the true leader of the Imperial forces in the Vulpinus Nebula; with Sloane serving as his figurehead. During the Shadow Council's inaugural dinner, Obdur and Sloane fraternized with the other Council members: the former Commandant Brendol Hux, Grand Moff Randd, and General Hodnar Borrum."}, {"tag": "p", "text": "When Grand Moff Randd remarked that the Empire pick itself up and fight back, Obdur gestured with his cutlery and responded that they would show the rest of the galaxy how it would be done and why they were still needed. Turning to Sloane, Obdur asked her to tell a rousing childhood story. When Hux interrupted her, Sloane retaliated by embarrassing the former Commandant about his illegitimate son Armitage Hux. Later, Obdur urged his fellow delegates to propagate the narrative of the Empire being the wounded loyal hound that had been brutalized and kicked out by its deadbeat father."}, {"tag": "p", "text": "Obdur's words pleased Fleet Admiral Rax, who joined the dinner. He informed Obdur and the others that he had convened the Shadow Council to ensure the survival of the Empire. During the meeting, Rax revealed that he secretly commanded other Imperial forces in the Almagest, the Recluse's Nebula, the Queluhan Nebula, the Ro-Loo Triangle, and the Inamorata. Rax also announced his plans to use the Outer Rim worlds of Zhadalene, Korrus, and Belladoon to produce weapons, starships, and vehicles for a renewed Imperial offensive against the New Republic."}, {"tag": "p", "text": "Following the attack on Chandrila, Obdur and his fellow Shadow Council members attended a meeting with Fleet Admiral Rax, who informed them of the \"loss\" of Grand Admiral Sloane. Obdur claimed that Sloane had been captured by the New Republic on Chandrila and that every effort would be made to recover her. Obdur listened as Rax proclaimed himself Counselor to the Empire and ordered the Imperial fleets to marshal for a showdown with the New Republic above the desert planet of Jakku in the Western Reaches. Obdur and his fellow Council members were unaware that Rax was secretly planning to eliminate them with the exception of Hux, whom he viewed as necessary to revitalizing the Empire."}, {"tag": "h3", "text": "The Contingency"}, {"tag": "p", "text": "Following the Attack on Chandrila, Obdur and the Imperial fleet traveled to the desert planet of Jakku in the Western Reaches under the orders of the self-proclaimed Counselor to the Empire Rax, who had taken charge in the absence of Sloane. In the months after their arrival on Jakku, Obdur and his fellow Shadow Council members attended a meeting at the Imperial headquarters on Jakku. During the meeting, Obdur tried to raise the matter of propaganda but was shushed by Rax. Rax regarded Obdur as irrelevant since the late Emperor's posthumous Contingency called for the destruction of the entire Empire."}, {"tag": "p", "text": "As part of the Contingency, Rax ordered Hux's new child soldiers, who were recruited from local children on Jakku, to assassinate the propagandist. Obdur was killed in his bed aboard the Super Star Destroyer Ravager. During the Battle of Jakku, Rax claimed that Obdur was ill in order to cover up his death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ferric Obdur was a human male who was older than Grand Admiral Rae Sloane. By the aftermath of the Battle of Endor, he had silver hair on his cheeks, jowls, and chin. He was a skilled propagandist who worked for both the Galactic Republic and the Galactic Empire. Obdur had a habit of constantly smiling and also thought that he knew more than his colleagues. Obdur was known to have a beautiful female assistant who had pale skin and dark veins."}, {"tag": "p", "text": "As a propagandist, Obdur was not above distorting facts to suit the interests and agenda of his masters. He thought that images and graphics could be used to lead viewers to the \"truth\" even if they did not precisely portray the facts. Obdur apparently fancied Grand Admiral Sloane and once touched her under the pretext of comforting her. However, Sloane did not take kindly to his indiscretion and warned him that he would lose his arm if he dared to touch her again. Sloane despised Obdur as an opportunistic sycophant who dabbled in lies and falsehoods. Despite disliking his methods, Sloane still regarded Obdur as one of her favorite Imperial colleagues."}, {"tag": "p", "text": "Obdur's skills as a propagandist won him the praise of Fleet Admiral Rax, who liked Obdur's cunning manipulation of the facts to create a pro-Imperial narrative. Obdur's talents secured him a place at Rax's vaunted Shadow Council, which the latter intended to use to \"thin the herd.\" After Obdur had outlived his usefulness as a propagandist, Rax arranged for his assassination. This was part of the Emperor's posthumous Contingency plan to weed out the weak and bring a small elect of worthy Imperials into the Unknown Regions to rebuild the Empire anew."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ferric Obdur first appeared as a secondary character in Chuck Wendig's 2016 novel Aftermath: Life Debt and its 2017 sequel Aftermath: Empire's End, which is set a year after the events of Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}