{"url": "Alan_Dean_Foster", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Novel authors"], "nodes": [{"tag": "h1", "text": "Alan Dean Foster"}, {"tag": "p", "text": "Alan Dean Foster (born November 18, 1946, New York City) is an author of dozens of fiction and non-fiction works and has had his works in more than 100 books. He received a Master of Fine Arts in Cinema from the University of California, Los Angeles in 1968. Foster's writing focuses primarily on science fiction and fantasy genres, although he has had some non-fiction published. Foster has had his works translated into over 50 languages."}, {"tag": "p", "text": "In 1995, he wrote the novelization for the LucasArts video game, The Dig, based on an original idea by Steven Spielberg. He wrote the novelizations for Star Trek (2009) and Star Trek Into Darkness (2013), two films directed by J.J. Abrams. He also authored the novelization for the first three movies of the Alien franchise."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He wrote the novelization of Star Wars: Episode IV A New Hope, as George Lucas' ghost writer, and the very first Expanded Universe novel: Splinter of the Mind's Eye. He later returned to Star Wars, first writing the Republic-era novel The Approaching Storm, and later the novelization of Star Wars: Episode VII The Force Awakens. and the short story \"Bait\" (published in Star Wars Insider 162)."}, {"tag": "p", "text": "In 2018, Foster posted an unofficial treatment for Star Wars: Episode IX on his website."}, {"tag": "p", "text": "After Disney bought Lucasfilm, Foster stopped receiving royalties from the novels written before the acquisition, including the novelization of the first Star Wars movie and Splinter of the Mind's Eye. A few years later, the same happened when Disney took control of 20th Century Fox, and didn't respect the contract between the author and the studio, for which he had written novelizations for the Alien franchise. In 2019, Foster seized the Science Fiction and Fantasy Writers of America Grievance Committee, which tried to settle the dispute. A year later, after encountering strong resistance from Disney, the SFWA decided to go public with the affair. Mary Robinette Kowal, SFWA's President, commented: \"In my decade with the organization, the fact that we are forced to present this publicly is unprecedented.\""}, {"tag": "h2", "text": "Star Wars published works"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}