{"url": "Festival", "categories": ["Category:Legends articles", "Category:Holidays"], "nodes": [{"tag": "h1", "text": "Festival"}, {"tag": "p", "text": "The Festival also known as the SoroSuub Anniversary celebration, was a four-day holiday that was celebrated with a party every year (1,424 standard days) in planet Genarius and certain cities of other planets in the Cularin system."}, {"tag": "h2", "text": "Origin"}, {"tag": "p", "text": "The Festival was initiated when SoroSuub Corporation, the biggest corporate interest in Edic Bar, began the production of the G-59 Cannibalizer, a snub fighter intended to compete with Incom's Z-95 Headhunter. After several problems with the development (including failed attempts at reverse engineering of the Z-95), the production line was completed and the first completed unit was finished and ready for sale."}, {"tag": "p", "text": "At that point, the Director of Formal Activities for SoroSuub, Miim Te'Suub, stopped the production and, following orders of higher echelons, gave a short speech to the workers to say that they had the rest of that day as free time. The confused, workaholic Sullustans reacted by partying in neighbor city of Tolea Biqua. They got carried away, spreading their binge to the Toleans and even to other cities, and the party continued for four days before they remembered they had jobs at SoroSuub."}, {"tag": "p", "text": "The workers were so satisfied that they decided to repeat yearly the situation, taking four days in remembrance of the first produced Cannibalizer. The Festival, as it would become known, was soon extended to all the cities in Genarius, and even to some cities in neighboring planets."}, {"tag": "p", "text": "Director Te'Suub was initially scared, but his bosses were satisfied as he had followed orders. Besides, SoroSuub could use the Festival, and the threat of removing it, to control unsatisfied workers."}, {"tag": "h2", "text": "Further parties"}, {"tag": "p", "text": "The Festival of 31 BBY was shaken by different incidents. Firstly, a prototype ship had been stole from SoroSuub facilities by dark Jedi Karae Nalvas or an associate of his. The ship was kept in the hangars of the Conkesta, Nalvas's secret headquarters in a hidden location near the planetary core. Nalvas's enemies infiltrated the Conkesta and escaped in the prototype ship, crash-landing in Tolea Biqua coincidentially near some SoroSuube executives who recognized the ship and offered a reward for it."}, {"tag": "p", "text": "A radiation storm then swept over Tolea Biqua and knocked out the city's shields. Former Jedi and scholar Dazen Mok, who witnessed the event, later theorized that the storm could have been caused by the destruction of the Conkesta, which had been built using the dark side of the Force Other damage threatened to sent the city plunging into the core far below. A number of heroes managed to avert this crash."}, {"tag": "p", "text": "Finally, Miim Te'Suub of SoroSuub gave his annual speech, but the sudden appearance of a logo of the Metatheran Cartel overimposed made him angry. Te'Suub blamed Thurm Loogg of the Cartel, and the Jedi witnesses had to resolve the dispute."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}