{"url": "Fexian_skullborer", "categories": ["Category:Canon articles", "Category:Predatory creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Fexian skullborer"}, {"tag": "p", "text": "Fexian skullborers were the apex predators of the purple moon of Fex in the Sha Qarot system of the Deep Core, inhabiting the trees of the mostly unexplored moon. The species' name was derived from the method by which they fed, drilling holes into the skulls of their prey via their long snouts and feeding off the victims' brains. The skullborers would drop down from the trees of the moon and latch onto their prey with their six limbs ending in clawed fingers. The predators also had a natural, full body camouflage they used to maintain the element of surprise when they attacked, as well as back spines that contained toxins that would poison their prey if they attempted to remove the skullborers from their head."}, {"tag": "p", "text": "The skullborers were first discovered and recorded shortly after the Battle of Yavin by a collection team of scientists sent to Fex by biotechnology company Kelen Biolabs. Unprepared to combat the skullborers when they attacked, three members of the collection crew were killed by the predators. Interested in harvesting the Skullborers for research on their toxins and boring physiology, the Biolabs sent a second collection crew to the planet with better armor and weapons. The crew managed to capture ten skullborers and return them to their starship the Harvester safely, but five of the creatures escaped from their containment and killed all but one of the second collection crew. Kelen Biolabs sent a third collection crew of Luke Skywalker and Nakari Kelen to the moon, who found the Harvester and killed the five escaped skullborers, despite their use of adaptive tactics to find the pair. Due to the intelligence the predators displayed in fighting the duo, Skywalker and Kelen believed the creatures possessed some level of sentience."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Fexian skullborers was the name assigned to a a species of possible semi-sentience or sentience. The skullborers were small in stature compared to a fully grown humanoid, and were very light in weight. The creatures had six spindly limbs, each with clawed fingers. The skullborers' central body had a neck forming a large skull, ringed with eight eyes evenly spaced across it. The skull also had a large snout protruding out that had an outer layer of skin with an inner, translucent feeding tube. Between the two layers of the snout was a ring of bone covered by a layer of crystalline with the hardness similar to diamond. The teeth ring was connected to a muscular system at the junction of the snout and skull that allowed to teeth to rotate, and were arranged at an angle to prevent the teeth from cutting the inner feeding tube. This would allow the skullborers to cut through a variety of tough substances to feed, including heavy armor and thick polycarbonate glass."}, {"tag": "p", "text": "The skullborers had rigid and sharp spines on their back in four rows of four radiating to the sides that contained toxins that would poison anyone that touched the spines. They species also possessed an active full body camouflage that would hide them from the naked eye. The skullborers could consciously control this camouflage, but if the skullborers were unconscious or dead their camouflage would dissipate, revealing skin that would radiate color at the touch. Despite having light weight, thin bones, the skullborers' skeleton was very strong."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "The Fexian skullborers were native to Fex, the purple moon of the planet Sha Qarot in the system of the same name in the Deep Core. The species were the apex predators of the moon, feeding off the brain matter of their prey. The skullborers resided in Fex's tall trees, dropping on their prey from above, and latching onto their victim's head with their clawed fingers. The skullborers would place their snouts onto the skull of their prey and the rotating teeth of the predator would drill through the bone and any armor to reach their desired food."}, {"tag": "p", "text": "Fexian skullborers were capable of camouflaging themselves to appear invisible from their prey, which they used to shield them from view. The predators used vantage points in the trees to prevent their prey from smelling them, maintaining an element of surprise. The toxic spines on their back would poison their prey if the skullborers' target attempted to swipe the predators off their head."}, {"tag": "p", "text": "The skullborers exhibited adaptable behavior and tactics to combat their prey and avoid capture, which conveyed some level of sentience. When captured and put in thick polycarbonate glass containers, a group of skullborers learned to bore through the glass using their teeth to escape. In a confined starship, the freed skullborers climbed to the ceiling of the ship to gain a vantage point to attack their captures. When on the attack, two of the skullborers could observe that their preys' hands, which had been used to kill other skullborers, needed to be neutralized before attacking their preys' heads. The skullborers also possibly demonstrated some level of self sacrifice for a tactical advantage. When two skullborers attacked Luke Skywalker, one jumped on top of another, impaling the higher skullborer on the spikes of the lower one, but also shielding the skullborer from Skywalker's stun stick. Skywalker was not sure if the skullborer had intended to sacrifice itself, or if it had landed on its compatriot by happenstance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Galactic Civil War, the Fexian skullborers had evolved be so effective at their predation that most other large animals of Fex, predators and herbivores alike, had evolved to have thick, crystalline structures and horns covering their heads or highly armored body cavities to withdraw their head into. The Fexians skullborers and the Sha Qarot system overall remained undocumented by the greater galactic society until shortly after the Battle of Yavin when the biotechnology Kelen Biolabs discovered the system. Believing Fex to hold possible value for future medications and other biological utilities, Fayet Kelen, the owner of the Biolabs, dispatched a collection crew of scientists to Fex to survey and collect samples for study. Three of the crew's members, the Bith Priban, the Duros Hafner, and human member disembarked their starship the Harvester to more closely explore the ecosystem of Fex."}, {"tag": "p", "text": "As the trio were walking under a canopy of trees, recording the trip with holocams installed in their helmets, a skullborer landed Priban's helmet and began to drill into his head. Priban grabbed his head out of reflex, stabbing himself with the skullborer's spikes and poisoning him in the process. Unable to see the creature due to its camouflage and unsure of what was happening, the other two scientists were unable to react before Priban fell motionless. The human was next to be attacked by a skullborer, and realizing that something was assaulting him, called for Hafner to shoot a stun blast at his head as well as Priban's. Hafner was not able to react in time and the human too fell to the ground. Hafner finally stunned the human's head and the skullborer on it, revealing the creature visually. Hafner began to inspect the predator's physiology, making the first documentation of the species with his holocam, until another skullborer fell on the Duros. Trying to protect himself, Hafner commed the Harvester to come pick him up and stunned his head, knocking out both him and the skullborer. However, the Harvester was too slow in retrieving the crew members, and all three had their brains eaten out when the skullborers awoke, retreating into the trees afterwards."}, {"tag": "p", "text": "With the holorecordings from the three deceased scientists preserved, Kelen Biolabs was interested in capturing the skullborers to study the physiology of their boring snouts as well as the toxins in their back spines. The company sent a second crew of five to Fex better equipped with stun sticks and heavier armored helmets aboard the Harvester. The second crew managed to successfully contain ten skullborers and bring them back aboard the ship. However, five of the skullborers were able to escape the polycarbonate glass containers the crew had imprisoned the predators in by boring through them. The crew, having taken their armor off by under the false guise of safety in their own ship, were caught unprepared when the skullborer's attacked them. All but one of the crew members were killed, the last man managed to lock himself in one of the ship's quarters to prevent the skullborers from attacking him."}, {"tag": "p", "text": "Having lost contact with the second crew, Fayet Kelen hired two human Rebel operatives, the prospective Jedi Luke Skywalker and Fayet's daughter Nakari Kelen, to go to Fex as a third collection crew as well as return the Harvester and its crew. The senior Kelen gave to two stun sticks and a prototype head armor even heavier than what the second collection crew had, as well as the recording of the first crew's encounter with the skullborers. Upon reaching the moon, the pair tracked down the Harvester and began to inspect its interior. The five escaped skullborers were residing in cluster of wires and tubes on the ceiling of the ship's medical bay, and when Skywalker entered the room one of the predators jumped onto his helmet. The pilot quickly stunned the skullborer using his stick, toppling to the floor in the process. Two more skullborers then jumped on Skywalker's visor, a weak point in the helmet's design, with one skullborer landing on top of the other. While the top skullborer was killed by the other's back spikes, the lower skullborer was shielded from Skywalker's stun baton."}, {"tag": "p", "text": "In desperation the young Jedi shot a blaster bolt across his visor, incinerating the skullborers. Kelen entered the room and shot the skullborer Skywalker had stunned. The two remaining skullborers on the ceiling, having witnessed the two humans kill the other skullborers using their hands, changed their tactics and attacked Kelen's hands. Kelen quickly reacted, killing the skullborers in rapid succession. The pair collected the corpses of the five dead skullborers along with the five skullborers that had remained in their glass containers, and returned to the planet Pasher, the base of Kelen Biolabs, with the Harvester and the lone survivor of the second crew in tow. Upon arrival, Nakari Kelen reported to her father that, due to adaptable behavior the skullborers had demonstrated in escaping the previous crew and attacking the duo, they believed the skullborers were sentient in some form."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fexian skullborers first and only appearance was in the canon novel Heir to the Jedi, written by Kevin Hearne and published in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}