{"url": "Field_Sports", "categories": ["Category:Legends articles", "Category:Arms manufacturing companies"], "nodes": [{"tag": "h1", "text": "Field Sports"}, {"tag": "p", "text": "Field Sports was an air weapons manufacturing company which was active during the Galactic Civil War and whose products were still in use by the time of the Yuuzhan Vong War. They were the manufacturers of both the air pistol and the Model 77 air rifle, and during the Civil War were a trusted name in air projectile weaponry."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Established prior to the Galactic Civil War between the Galactic Empire and Alliance to Restore the Republic, the Field Sports company were a trusted name in air weapon manufacturing by the time the War commenced. During the War they produced both the air pistol for 200 and the Model 77 air rifle for 750, the later of which was the most popular air rifle in circulation at the time. Their products, as slugthrowers using compressed air to fire projectiles, were not considered weapons but toys on the majority of worlds, and as such the air pistol could be purchased in sports shops throughout the galaxy. The pistol, which was produced in a range of colors, was used by sportsmen as a targeting device, while the rifle was generally brought by hobby shooters, collectors or those who needed to practice shooting safely, quietly and with an easy-to-use weapon."}, {"tag": "p", "text": "Both weapons however had secondary, more dangerous, uses. The pistol could be used effectively as a weapon at short ranges if upgraded with a compressed air canister and because of this several of the more stealthy units of the Alliance Special Forces made use of the pistol during the war. The rifle was commonly used by big-game hunters to hunt large prey due to its balance, accuracy, portability and near silent fire mechanism. To cater to the hunting market, Field Sports worked with the Corellian Chemical Corporation to produce \"SmartTranq\" a specialist tranquilliser which could replace the normal tranquiliser in Model 77s at the cost of 500. The chemical contained an active ingredient which constantly mutated upon entering a targets bloodstream as to overcome their immune system and render them unconscious with optimal efficiency. The air pistol was still in use by the time of the Yuuzhan Vong War, in which the Yuuzhan Vong species invaded the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Field Sports were first mentioned in Rules of Engagement: The Rebel SpecForce Handbook, a sourcebook written by Timothy S. O'Brien in 1997 for Star Wars: The Roleplaying Game, a roleplaying game produced by West End Games. The company were then mentioned again in the Arms & Equipment Guide sourcebook produced by Jeff Grubb and Owen K.C. Stephens in 2002 for the Star Wars Roleplaying Game made by Wizards of the Coast, the successor to West End Games' version. In 2013 it then appeared in Enter the Unknown written by Sterling Hershey, a sourcebook for the third incarnation of a Star Wars roleplaying game, Fantasy Flight Games' Star Wars: Edge of the Empire."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}