{"url": "Field_stormtrooper", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Field stormtrooper"}, {"tag": "p", "text": "Field stormtroopers, also known as field troopers, were higher ranking stormtroopers with superior field experience and weaponry in the service of the Galactic Empire during the Galactic Civil War. Equipped with E-11 blaster rifles, rail detonators or Imperial Repeater Rifles, they were commonly seen supporting regular stormtrooper riflemen during field operations. They were easily recognized by their yellow, orange, or red pauldrons."}, {"tag": "p", "text": "After the fall of the Empire, the Dark Jedi Jerec employed dozens of of field troopers during his quest for the Valley of the Jedi, using them as guards for his towers on the moon of Sulon and using them as the primary ground force for his invasion of the planet Ruusan. A number of field troopers were also present on one of his ships, the Sulon Star. Sometime later, field troopers were used en masse during the Battle of Altyr V, when a number of them attacked a New Republic base located on the planet Altyr V during Operation Shadow Hand, while many more were stationed aboard two weapons disguised as asteroids that were bombarding the planet. Field troopers also served alongside regular stormtroopers on the planet of Katraasii, patrolling the streets of the Katraasii Spaceport."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins and Jerec's campaign"}, {"tag": "p", "text": "Field stormtroopers were a highly skilled extension of the Galactic Empire's Stormtrooper Corps. Boasting better training and equipment specially tailored for field operations, field troopers represented the highest possible rank that a stormtrooper could achieve. After the Battle of Endor during the year 4 ABY, which saw the death of the Imperial leaders Emperor Palpatine and Darth Vader, the Empire became fragmented. By 5 ABY some of the fragmented forces rallied under the Dark Jedi and Imperial Inquisitor Jerec. Among this surplus were scores of field troopers, who became the backbone of Jerec's army. Initially, many field troopers were assigned to the Government House of the city Barons Hed, located on the moon Sulon, where they guarded the inside of the towers, while the surrounding ground was patrolled by regular stormtroopers and AT-ST walkers, although they were backed up by some field troopers who carried rail detonators. A number of field troopers were also assigned to one of Jerec's cargo vessels, the Sulon Star. While the Sulon Star was docked at Sulon's Fuel City, the place was heavily guarded by field troopers, stormtroopers, Imperial officers, Grave Tuskens, and Trandoshan bounty hunters."}, {"tag": "p", "text": "During 5 ABY, former Rebel Alliance agent Kyle Katarn, who was now working for the Alliance's successor, the New Republic, returned to his home on Sulon in search of a droid designated 8t88. The droid possessed a map to the fabled Valley of the Jedi, a place of untold power that was also Jerec's ultimate goal. Katarn wanted the map in order to reach the valley and stop Jerec from harnessing the valley's power, as well as extract revenge against Jerec, as the Dark Jedi had killed Katarn's father. 8t88 was located in the Government House, under heavy guard as he prepared to disembark to Fuel City. After fighting through the ground forces and a Dark Jedi named Yun, Katarn encountered numerous field troopers as he made his way through the towers. Squads of field troopers began to assemble in the tower's spacious ventilation systems. However, the troopers were unsuccessful in their attempt to stop Katarn, although they bought enough time for 8t88 to escape to Fuel City. 8t88 eventually boarded the Sulon Star, where he was decapitated by Gorc and Pic, two more of Jerec's Dark Jedi henchmen. Meanwhile, Katarn continued fighting Imperial forces in Fuel City, eventually sneaking aboard the Sulon Star. Although the ship's guard compliment was built up primarily of field troopers, they received assistance from various officers and Viper probe droids in slowing down Katarn. However, like on Sulon, the field troopers were unable to kill Katarn, nor stop him from retrieving 8t88's cranial unit and slaying Gorc and Pic. In addition, they were unable to stop the Jedi-in-training from escaping the cargo ship."}, {"tag": "p", "text": "Eventually Jerec's fleet made it to the planet of Ruusan, which housed the Valley of the Jedi. Field troopers were instrumental in the invasion, with large numbers of troopers landing on the planet to set up its defenses, bases, and the excavation of ancient Jedi ruins. During the excavations, a large number of field troopers with orange pauldrons encountered a number of kell dragons who were living in the ruins. Several of the troopers were attacked, killed, and dismembered by the beasts. Field troopers also assisted the Dark Jedi Sariss, Boc Aseca, and Yun in the attack on Fort Nowhere, which was a settlement made up of Sulon refugees. Eventually Katarn, along with his partner Jan Ors, reached Ruusan during his quest for Jerec and the valley. Katarn fought his ways through the Imperial forces, but in the meantime Ors was captured by a squad of field troopers and brought to Jerec. Katarn eventually came across the location where the Sulon Star had been moored, and after a confrontation with Jerec, was thrown aboard the ship via Jerec's mastery of the Force. However, the Force blast was powerful enough to knock the Sulon Star off of the dock, sending it plummeting to the ground below, with much of its crew still on board. As Katarn tried to escape the ship, he encountered several lone field troopers who attempted to shoot him. Katarn escaped the ship, and and Sulon Star and its remaining crew was destroyed when the ship hit the planet's surface. After defeating Sariss, Katarn went after Jerec and Ors, encountering further resistance from Field troopers and Imperial commandos. Despite the heavy resistance, the troopers were ultimately ineffective in stopping Katarn. Katarn eventually rescued Ors and killed Jerec. After the Dark Jedi's death, the remaining Imperials vacated Ruusan."}, {"tag": "h3", "text": "Altyr V"}, {"tag": "p", "text": "Five years later, Emperor Palpatine was reborn and instituted Operation Shadow Hand, a series of attacks that targeted bases of the recently formed New Republic. One of these targets was the planet of Altyr V, which housed a small New Republic base. The Empire decided to employ two new weapons for the operation, a pair of space worthy cannons that were disguised as asteroids in order to bypass the base's warning system, as falling asteroids were a common occurrence on the world. However, the base's commander quickly realized the asteroid's true intentions when they began a geosynchronous orbit around the planet and began to bombard their stationary ships. One of the asteroids was large enough to house hangars outfitted with TIE/LN starfighters, various landing crafts, and a large number of field troopers. After bombarding the base, a number of troop transports were sent to Altyr V's surface, loaded with field troopers, scout troopers, and at least two AT-ST walkers. Field troopers began to blast there way through the base's walls and opened fire on the defending forces. Although the New Republic troopers were armed with the same E-11 blaster rifles the Imperials had, the field troopers also came equipped with Imperial Repeater Rifles and rail detonators. The detonators proved to be very effective against the Republic troopers. The field troopers initiated their attack at the North hangar. However, the Imperials soon encountered Kyle Katarn, who was now a fully trained Jedi. Katarn was assigned to the base when he decided to help the fledgling New Republic. The North hangar became Katarn's first stop."}, {"tag": "p", "text": "Katarn received a plea from the base's commander to close the hangar's blast door in order to hold off the field trooper's advance. The Jedi obliged, but as the door neared being shut, a TIE/sa bomber flew by and dropped its payload on the door, jamming it and killing any field trooper or defender near the door. The remaining field troopers were defeated by the survivors and Katarn."}, {"tag": "p", "text": "The troopers continued to blast their way into the base, and eventually attacked the base's operation center, known as Ops. The attack forced the commander to retreat, leaving an officer in charge. Field troopers, alongside scout troopers, also blasted their way into the base's auxiliary generator room and, after killing the defending troops, turned off half of the base's power. This caused several automatic doors near the room to lock, cutting off another hangar from the rest of the base. This hangar was guarded by only two Republic troopers, who were under attack by at least four field troopers and one AT-ST. Katarn eventually reached Ops, repelled the field troopers, and reactivated the auxiliary generator. At some point during the fighting, a Lambda-class T-4a shuttle landed outside of the base. It was put under the guard of four field troopers and an AT-ST. Katarn killed the two troopers who were guarding the ship's immediate area, and used the shuttle to fly up to the asteroids. Katarn's plan was to use the asteroids cannon to destroy its sister weapon, and then cause his asteroid to self-destruct. As Katarn fought through the defenses, he was pursued by two field troopers armed with rail detonators, TK8252 and his partner. The rail troopers corned Katarn at a cliff drop, and blasted the ground next to him, causing Katarn to fall of the ledge. TK8252 reported that Katarn was killed, believing that the fall could not be survived. However, Katarn did survive and reached the controls for the cannon. He destroyed the other asteroid, and then sabotaged the asteroid he was on, rigging it to self-destruct. Despite heavy resistance from field troopers and commandos, Katarn escaped the asteroid before it was destroyed. Once again, the field troopers were unable to secure a victory against Katarn and his allies. Altyr V was evacuated soon afterwards, due to a large Imperial fleet on the way."}, {"tag": "h3", "text": "Use at the Katraasii Spaceport"}, {"tag": "p", "text": "Around the same time of the Battle of Altyr V, the planet of Katraasii was still under the influence of of the Galactic Empire. Its spaceport, while under the guard of stormtroopers, became a haven for criminal activity, and became a regular destination for the Abron Mar, the majordomo for the crime lord Takara, and his cronies. For the most part, the Imperials and Takara's men coexisted without incident. The spaceport was primarily guarded by field stormtroopers. The spaceport had one storeroom for their weapons. If any non Imperial was to stumble upon the room, they would be immediately attacked by the field troopers, who would then actively hunt the individual if they escaped the guards. In addition, squads of field troopers existed that were used to investigate problem-some individuals. One such individual was Mara Jade, who was hunting Mar on the behalf of Takara's rival, Ka'Pa the Hutt. Jade had been battling Mar's cronies throughout the spaceport, and grabbed the attention of the local Imperials. A hefty platoon of field troopers were eventually dispatched to deal with Jade after she infiltrated the hangar where Mar kept his R-41 Starchaser and shut the bay doors. Jade survived the field trooper's attack, but fell victim to Mar's men, who rendered her unconscious and took her to Takara's stronghold."}, {"tag": "h2", "text": "Organization and structure"}, {"tag": "p", "text": "The rank of field trooper was the highest rank in the stormtrooper hierarchy. Field troopers had better training, a wider variety of weapons, and were used for field operations or as guards. In addition, there were three varieties of field trooper, all identifiable by the color of their pauldron. Orange pauldron troopers were the most common variety of the field stormtrooper, and made up the bulk of he rank. Jerec and his Dark Jedi companions employed dozens of these field troopers for the invasion of Ruusan, and they served as the primary guard force for the Government House on Sulon. The next, and less common, variety of field trooper were troopers with red pauldrons. These troopers generally served alongside troopers with orange pauldrons, and were overall fewer in number. The majority of them wielded Imperial Repeater Rifles."}, {"tag": "p", "text": "Although they often supported orange field troopers during the Ruusan campaign, numerous red pauldron troopers were used during the operation on Altyr V. It was a group of the red pauldron troopers that disabled the New Republic base's auxiliary generator. The rarest variety of field trooper were the troopers with yellow pauldrons. These field troopers carried heavy weapons like the rail detonator, and provided backup and cover-fire for their rifle wielding peers. Due to their explosive weapons, they were the deadliest of field troopers. They proved to be very useful when put up against the rifle wielding troops of the New Republic on Altyr V. TK8252 and his partner were rail troopers, and were semi-successful in besting Kyle Katarn during fighting above Altyr V, as they were able to launch Katarn off of a cliff."}, {"tag": "h3", "text": "Tactics"}, {"tag": "p", "text": "Under the reign of Jerec, field troopers served as the bulk of his forces, with normal stormtroopers only assigned to the ground defense around the Government House on Sulon. Troopers with orange pauldrons were the most common variety under Jerec's rule, with red pauldron troopers providing backup to their comrades. Yellow pauldron troopers were assembled alongside the other varieties when they began to search the Government House's ventilation system for Katarn. A full field trooper squad could contain up to five orange troopers, one red trooper, and on occasion, one yellow trooper. In defensive situations as demonstrated on Ruusan, field troopers would work in large groups, often in accordance with other officers and Imperial commandos. In offensive operations, such the battle on Altyr V, orange troopers would proceed before the others, and were the troopers who would rush in first and engage the defending forces. Red troopers would either provide backup or perform their own side missions in squads built entirely out of red pauldron troopers. They would also work with scout troopers. Yellow pauldron troopers would occasionally work with orange troopers in attacking and defending key locations, although during the battle of Altyr V, they were primarily seen defending AT-ST walkers. When confronting targets, field troopers would strafe in order to avoid return fire, and would work together to try and flank their enemies."}, {"tag": "p", "text": "The Katraasii Spaceport was guarded exclusively by orange pauldron troopers, who would either work alone or in pairs. However, large squads of troopers would be used to apprehend or kill individuals, as seen on two occasion on Katraasii—once when the troopers rushed Mara Jade, and again when a squad of field troopers fruitlessly fired at an escaping YT-1300 light freighter. When investigating hangar bays in the spaceport, a squad of troopers would be sent up to the ship dock, while several troopers would stay below the dock. If an individual were to escape the first wave of troops, they would be greeted by the field troopers who had remained below deck."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "Field stormtroopers, depending on their rank and pauldron color, were issued one of three weapons, each notably different. The most commonly issued weapon was the BlasTech E-11 blaster rifle, which was the Empire's general purpose rifle. The weapon had several firing modes, including semi-automatic, automatic, and a pulse-fire setting. The weapon was generally assigned to field troopers with orange pauldrons, who preferred to fire the weapon on the semi-automatic setting. The weapon was somewhat ineffective against personal energy shields, as the blaster bolts could not penetrate the shield directly. However, the weapon could wear on the shield's charge, weakening the device's usefulness. Field troopers fired from the hip and were not always accurate with the weapon. However, they were observably better with the weapon when compared to their stormtrooper counterparts. They were less accurate than commandos. Ammunition for their rifles were carried in their backpacks."}, {"tag": "p", "text": "Field troopers with red pauldrons were issued Imperial Repeater Rifles, a weapon originally designed by Moff Rebus for the failed Dark Trooper Project. The rifles were issued to both field troopers and commandos, and featured ballistic ammunition fed from a belt packed inside a drum magazine. The weapon also had a folding stock attached to it, although field troopers generally fired the weapon from the hip, like the blaster rifles. The weapon had three barrels, and could fire all three barrels at once, although no field troopers were observed using this feature. The Repeater was very accurate, and could be fired on a fully automatic setting with pinpoint accuracy. However, some field troopers preferred to fire the weapon one shot at a time, often with very varied results regarding accuracy. Some troopers who fired with the gun's semi-automatic mode were far more accurate than other field troopers, however. Like the rifle, the bullets could not penetrate personal shields, but could dilute their power. Field troopers with Repeaters would support blaster troops."}, {"tag": "p", "text": "Rail detonators were issued exclusively to field troopers with yellow pauldrons. Essential personal missile launcher, rail detonators fired rail charges, which were yellow projectiles that could explode on impact, explode after a few second of hitting a target, or explode when the operator manually detonated the charge. Detonators were loaded with three charges at a time, which were loaded into a compartment on the bottom of the weapon. Field troopers would use the weapon's timed explosion fire mode. When a target was hit with a timed or manually detonated rail charge, the target would try and flee. The charges, however, would hold tight to the target, disallowing any kind of escape. Field troopers would refrain from using the weapon in close quarters combat, and instead use the weapon like a club. Rail charges could blow straight through a personal shielding unit, and injure the target. However, if the shield was strong enough, it could negate any damage to the shield's owner. However, as shield's do not protect users from physical blows, a trooper using the weapon as a club could prove hazardous to one's health."}, {"tag": "h3", "text": "Armor"}, {"tag": "p", "text": "A field stormtrooper's armor was basic stormtrooper armor, albeit slightly stronger and more durable. Although the armor could sustain heavy damage, it was susceptible to direct blaster hits. The armor was most formidable against physical attacks, such as a punch from a Human's balled up fist. However, the armor was no match for the jaws of a Kell dragon, or the burning blade of a lightsaber. The primary difference between the armor worn by a field stormtrooper and a regular stormtrooper, however, was that field troopers wore colored pauldrons and carried backpacks that were stuffed with power cells, energy cells, and personal shield units. Stormtrooper helmets were outfitted with polarized visors that protected the wearer from bright flashes, such as the flashes offered by flash-bang grenades. Helmets also contained communications equipment, padding for head comfort, air intake and exhaust ports, and computer equipment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Field stormtroopers were created for and first appeared in the 1997 video game Star Wars: Jedi Knight: Dark Forces II. Although the game's manual seemed to indicate that only stormtroopers armed with Imperial Repeater Rifles or rail detonators were field troopers, the game's strategy guide, written by Rick Barba, confirmed that all pauldron wearing stormtroopers were actually field stormtroopers. Field stormtroopers also appeared in Jedi Knight's expansion pack Star Wars: Jedi Knight: Mysteries of the Sith. While not explicitly named in text, field stormtroopers appeared in two illustrations that appeared in the novella Dark Forces: Jedi Knight, which was an adaption of the game. The book was written by William C. Dietz and illustrated by Dave Dorman."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}