{"url": "Alanciar", "categories": ["Category:Legends articles", "Category:Continents", "Category:Kesh locations"], "nodes": [{"tag": "h1", "text": "Alanciar"}, {"tag": "p", "text": "Alanciar, also known as Keshtah Major, was a large continent located on the planet Kesh's southern hemisphere. It was home to a Keshiri civilization who called themselves the Alanciari. It was situated halfway across the world from Keshtah Minor, the continent that housed the city Tahv and the Lost Tribe of Sith. Sith Grand Lord Yaru Korsin used data collected during the starship Omen's crash on Kesh to determine the existence of Keshtah Major, but he kept its existence a secret from the rest of the Tribe. In 4975 BBY, the Keshiri rebel Adari Vaal and three-hundred surviving followers fled to Alanciar where they warned the Alanciari about the threat posed by the Sith. As a result, the Alanciari developed a highly-disciplined and centralized society with a strong military to resist any invasion from Keshtah."}, {"tag": "p", "text": "Alanciar was finally discovered in 3000 BBY by Caretaker Varner Hilts, who went on to lead the Tribe into a new era, in which they successfully to conquered the larger continent. Despite heavy losses and a mutiny by High Lord Korsin Bentado, The Sith were able to convince the Alanciari to willingly submit to their rule by using the Alanciari soldier Jogan Halder to convince his people that the Sith did not actually pose a threat to them. Following the \"Unification\", Alanciar would develop close maritime trading links with Kesh and Alanciari sailing ships would play an important role in exploring the uncharted northern hemisphere and south pole, Eshkrene, of the planet Kesh."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Ancient Cataclysm"}, {"tag": "p", "text": "In prehistoric times, the Keshiri living on Alanciar and the neighboring continent of Keshtah shared the same beliefs about the Protectors and Destructors, a race of powerful gods who fought a \"great battle\". The Keshiri geologist Adari Vaal, who had migrated from Keshtah to Alanciar, theorized that an \"Ancient Cataclysm\" had severed access between Alanciar and Keshtah. In reality, the legends of the Protectors and Destructors were based on a conflict between two groups of offworlders—the Jedi and their Dark Jedi opponents. Following the end of the Hundred-Year Darkness in 6900 BBY, the victorious Jedi and the Galactic Republic had exiled the surviving Dark Jedi into the Stygian Caldera. There, these exiles led by Karness Muur, Remulus Dreypa, and XoXaan subjugated the Sith species and forged the first Sith Empire. However, some of these Dark Jedi exiles were not content to rule over their new empire and sought revenged against the Jedi and the Republic."}, {"tag": "p", "text": "Under the leadership of Remulus Dreypa, these recusant Dark Jedi obtained a starship and attempted to leave the Stygian Caldera. However, they were quickly attacked by a Jedi patrol who pursued them across the galaxy. Many of these Jedi were veterans from the Battle of Corbos. Eventually, these Dark Jedi and their Jedi opponents crash-landed on Kesh. Both sides were stranded on Kesh and the planet's strange magnetic fields prevented the Jedi from calling for help. The Dark Jedi and Jedi fought on Kesh and unleashed leviathans, \"great weapons\", which devastated the planet's surfaced and terrorized the Keshiri. While the exact details of this conflict are not known, it is implied that the \"Great Calamity\" devastated Keshiri civilization and somehow led to the severance of access between Alanciar and Keshtah. What little is know is that the westward peninsulas known as the Six Claws were related in geological terms to the series of reefs which lined the southwestern coast of Alanciar."}, {"tag": "p", "text": "Eventually, the Dark Jedi realized the error of their ways and made peace with their Jedi opponents. To seal this peace agreement, the Dark Jedi sealed their fanatical leader Dreypa within an oubliette. Meanwhile the Jedi hid their last remaining starship within the Keshiri catacombs beneath the Circle Eternal, a plaza in the town of Tahv. These Jedi and Dark Jedi traveled to Kesh's south pole Eshkrene where they established a new community known as the Doomed, which was dedicated to finding true neutrality in the Force. The Doomed maintained a watchful vigil over events in the rest of Keshtah through ice mirrors."}, {"tag": "h3", "text": "The Rock of Keshtah"}, {"tag": "p", "text": "In 5000 BBY, a group of Human Sith landed on Keshtah Minor. Using their Force powers and aided by the Keshiri geologist Adari Vaal, these Sith established themselves as the new ruling elite on Keshtah and became known as the Lost Tribe of Sith. To establish their legitimacy, the Lost Tribe claimed to be the Protectors and were regarded by the Keshiri on Keshtah as gods. Opposition to Sith rule led to the formation of an underground Keshiri resistance movement under the leadership of Vaal, who realized that the Sith were actually not gods and viewed them as a \"plague\" on Keshiri society. In 4975 BBY, she led an unsuccessful uprising against the Tribe but was defeated and forced into exile. Adari and a thousand Keshiri rebels flew on their uvak into the jet stream above the volcano Sessal Spire which swept them across the planet Kesh's atmosphere. Adari and three hundred rebels survived this journey and landed on a remote island off the south-western coast of Alanciar."}, {"tag": "p", "text": "Eventually, Adari and her followers were picked up by Keshiri fishermen from Alanciar. These Keshiri called themselves the Alanciari and their homeland Alanciar. She succeeded in warning them about the threat posed by the Sith living on Keshtah. As a result, the Alanciari developed from a primitive society into a highly-militarized and patriotic society over the next two thousand years. In addition, the Alanciari adopted Galactic Basic Standard, the language of the Sith offworlders. For centuries, successive generations of Alanciari were taught to hate the Sith and to dedicate their entire lives to the \"Great Cause\" of resisting any Sith invasion. Adari's legacy was commemorated in the Keshtah Chronicles, a popular history book which detailed everything that she knew about the Tribe, and Observance Day, a holiday held every ten years to commemorate Adari's secret ten year resistance against the Sith."}, {"tag": "p", "text": "The Alanciari developed a large military that was supplemented by a highly-intricate network of semaphore stations and thoughtcriers, individuals who were trained to project thoughts through the Force. The Alanciari also developed a wide network of well-paved roads and canals where boats transported goods and people to different settlements. By 2975 BBY, six signal towers had also been established on the Six Claws, the rugged south-western frontier of Alanciar, to provide the continent with an early invasion warning system of the Sith invasion. The Alanciari also developed a highly centralized system of government which was based in the capital Sus'mintri. The Alanciari government was known as the War Cabinet and ran every aspect of Alanciari society including education, training, and industry. In 2985 BBY, the various directorates of the War Cabinet shifted their operations to Vaal Hall, a highly-centralized command center with its own signal tower and thought-crying facilities which were used for controlling all communications throughout the continent."}, {"tag": "h3", "text": "The Sith Invasion"}, {"tag": "p", "text": "Alanciar's isolation came to an end in 2975 BBY, approximately two thousand years after the arrival of Adari Vaal, when the Sith finally reached Alanciar's south-western frontier. In 3000 BBY, the Sith Caretaker Varner Hilts had discovered a map in the Kesh Sith Temple on Keshtah which confirmed the existence of Alanciar, which the Sith called \"Keshtah Major.\" For the next twenty-five years, the Lost Tribe of Sith dedicated all their resources and energies to developing a technology that would allow them to travel between Keshtah and Alanciar safely. After much experimentation, the Sith engineer Edell Vrai developed airships, which were held aloft by helium and hydrogen gasbags and were propelled by uvak. The Sith plan involved Edell leading a reconnaissance mission to scout the new continent. When he had returned, the High Lord Korsin Bentado would lead an invasion force of airships known as the Ebon Fleet which would invade Alanciar."}, {"tag": "p", "text": "However, the Alanciari had prepared for the Sith invasion for two thousand years. The Alanciari signal officer Jogan Halder and his thoughtcrier Quarra Thayn, who were stationed at Point Defiance, spotted the Sith scouting ships and quickly alerted the Alanciari military. Upon arriving above the peninsula Garrow's Neck, Edell's airships were attacked and shot down by ballistae and the Alanciari air force. While most of the reconnaissance force was wiped out, Edell and five other Sith managed to survive the debacle and regroup. These Sith succeeded in capturing two Alanciari—Jogan Halder and Quarra Thayn—and the harvesting trawler Mischance. The capture of the Mischance enabled the Sith to gain access to the Alanciaris' wooden sailing ship technology. Edell was also able to coerce Quarra into serving as a guide for an inland reconnaissance mission into Alanciar's interior and capital of Sus'mintri by using her lover Halder as a bargaining chip. Meanwhile, Edell's second-in-command Peppin took the Mischance and Halder back to Keshtah by sailing through the Southern Passage which led to the Sea of Flames. This marked the first transoceanic voyage between the two continents after two thousand years of isolation."}, {"tag": "p", "text": "The Sith invasion left a significant impact on Alanciari society. As a result of the Sith invasion, Alanciar was put on full alert with air raid sirens ringing throughout the continent for several days. The Alanciari military scoured the Six Claws for any trace of the invaders while the War Cabinet ordered the deployment of anti-air forces in the western frontier. However, they found no trace of the Sith since most of the scouting force had been wiped out and the few survivors had already escaped back to Keshtah. Since the invasion coincided with Observance Day, Alanciari patriotic fervor reached fever pitch level and passion plays were staged in several Alanciari towns including Kerebba to remind the Alanciari masses about the danger posed by the Sith. During his reconnaissance mission, Edell learned that the Alanciari had progressed to a high level of technological development as a result of Adari's flight to Alanciar. Despite losing contact with Edell's forces and possessing virtually no information about the Alanciari, Korsin Bentado still convinced Grand Lord Hilts to allow him to launch an invasion of Alanciar. The Grand Lord and his Grand Consort Iliana Hilts allowed Bentado to proceed with the invasion plans because they saw this as an opportunity to eliminate a potential rival to the Grand Lordship."}, {"tag": "p", "text": "Following Bentado's departure, Peppin and the Sith survivors returned with their captive Halder. Despite their heavy losses in Alanciar, the Sith compensated for this by obtaining a copy of Adari's popular Keshtah Chronicles, which gave them an insight into what the Alanciari knew about them. Grand Lord Hilts saw the opportunity to recruit Halder as the Tribe's new ambassador to the Alanciari and staged a grand deception operation to convince Halder that the Lost Tribe were actually not a threat to the Alanciari but were rather the benign Protectors. Based on his reading of the Keshtah Chronicles, Hilts also deduced that the Alanciari would treat Bentado and his Ebon Fleet as \"evil invaders\" and that they also had the military capabilities to resist the Sith invaders. Since Bentado's Korsinite League supporters would be regarded by the Alanciari as the \"face of evil\", Hilts' Sith followers had to appear to be something different and benign. Hilts also did not warn Bentado because he saw the invasion as an opportunity to eliminate Bentado and his supporters. With the cooperation of the Tribe's loyal Keshiri followers and the Circle of Lords, Hilts was able to win over Halder's trust."}, {"tag": "p", "text": "After a few days, Korsin Bentado's fleet arrived at the Western Shield, a countryside region in central Alanciar. As before, the Alanciari military responded swiftly and anti-air force units were deployed to the battlefield within minutes of the enemy airships being sighted. Bentado's forces were largely wiped out and all of airships were shot down. The surviving Sith were killed or captured by the Alanciari military. However, Bentado and the crew aboard his personal dirigible Yaru survived and managed to reach Sus'mintri, the capital of Alanciar. There, they infiltrated Vaal Hall and slew the entire War Cabinet and many Alanciari bureaucrats and soldiers without alerting the garrison. Bentado then seized control of the building's \"worldwatch\" and its signal tower; allowing him to control all semaphore and telepathic communications in Alanciar. Once in control, Bentado ordered the Alanciari to round up the other Sith survivors from the Ebon Fleet and bring them to Sus'mintri. This subterfuge enabled Bentado to regroup his forces."}, {"tag": "p", "text": "The disappearance of the War Cabinet, combined with the Sith invasion, threw the Alanciari population into a state of fear and panic. Seeing the opportunity to harness Alanciar's highly centralized civilization into a new empire, Bentado then mutinied against his liege Grand Lord Hilts and attempted to create a \"Second Tribe\" on Alanciar. Bentado also attempted to order the Alanciari to shoot down Hilts' airshop Good Omen, which was traveling to Alanciar with his new ambassador Jogan Halder. However, Bentado was stopped by Edell, Quarra, and his own servant Squab, who was actually an agent of the Hilts family. With the aid of Squab and the Keshiri servants who had accompanied Bentado's Ebon Fleet, Edell reasserted control over Bentado's men; ending Bentado's mutiny. Meanwhile, Hilts arrived safely in the Alanciari city of Port Melephos where he and his Keshiri servants were warmly welcomed by the local Alanciari population. By this stage, news of the killings of the War Cabinet had reached the other parts of Alanciar. Professing to bring peace and reconciliation, Hilts and Halder traveled to Sus'mintri to convince the Alanciari of their good intentions."}, {"tag": "h3", "text": "The Unification"}, {"tag": "p", "text": "As a result of the Sith invasion, Alanciar came under Sith rule. However, this conquest did not involve a full-scale military invasion of the continent which would have resulted in the loss of many lives. Despite the strong antipathy towards the Sith, Grand Lord Hilts was able to disarm this hostility by employing the diplomacy of his new-found ambassador Jogan Halder, an Alanciari soldier. Halder related the story of his first contact with the Sith and his travels to Keshtah where he was shown the \"truth\" about the Sith. Instead of being the evil \"Destructors\" whom Adari had warned about, Halder claimed that most of the Sith were benign and were revered by the Keshiri in Keshtah as the Protectors. With Hilts' backing, Halder acknowledged that Adari had been right about the presence of servants of the Destructors among the Lost Tribe but claimed that these had been cast out of the Tribe. Halder and Hilts distorted the factual account of the Sith invasion by claiming that Bentado and his followers were the malevolent servants of the Destructors. Hilts' expression of remorse and grief when recalling the deaths of the War Cabinet won him the trust and goodwill of the Alanciari. As a result, the Alanciari welcomed Hilts and the Tribe."}, {"tag": "p", "text": "Following Hilts' arrival, Jogan Halder's message was relayed by semaphore throughout Alanciar. Following Halder's testament, white-robed Human and Keshiri relief workers from Keshtah arrived in Alanciar to facilitate peace and reconciliation between the two continents. To win the hearts and minds of the locals, the Sith were well behaved and distributed gifts from across the Western Sea. Bentado's surviving Korsinite League followers were disarmed and enslaved by Hilts' forces; ending the Korsinite League's existence as a faction. Meanwhile, Edell Vrai was made the de-facto governor of Alanciar and was tasked with evaluating every unknown Keshiri innovation for use by the Tribe. Due to this new cross-cultural contact, the Lost Tribe of Sith gained access to Alanciari technology. While certain Alanciari technologies like fireglobes and sailing vessels were adopted, other more offensive technologies like ballistae were gradually phased out. There were also plans to raise a couple of reefs in the ocean to provide uvak with rest stations for oceanic crossings. This facilitated the re-establishment of connections between Alanciar and Keshtah, something which had been lost as a result of the Great Calamity."}, {"tag": "p", "text": "Under Sith rule, Adari Vaal's influence was gradually diminished and the Observance Day plays were replaced with newer plays emphasizing Jogan Halder's successful first contact with the Sith. As a result of the \"Unification\" of Keshtah and Alanciar, maritime trade was established between the two continents. Keshiri ports like Eorm and the new docks to the west of Berav were regularly visited by Alanciari sailing ships. Over the following years, Alanciari sailing ships were used by the Tribe to explore the rest of Kesh including the southern polar continent of Eshkrene and its unexplored northern hemisphere. One Alanciari captain Chegg and his ship Southern Star played a role in discovering the Doomed and their settlement in Eshkrene. In 2974 BBY, many people living in Keshtah including Grand Lord Hilts' daughter Takara Hilts regarded Alanciar as a new frontier full of wonders. Over time, many Alanciari like Quarra and Chegg came to realize that the Sith were not actually gods but were actually fellow sentient beings. Due to Grand Lord Hilts' policies of admitting Keshiri into the Lost Tribe of the Sith, many Force-sensitive Alanciari presumably joined the Tribe. By 44 ABY, Alanciar had been ruled by the Sith for around three thousand years."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Alanciar was a large continent that was about four-times the size of Keshtah Minor. According to the Keshiri Wardmaster Quarra Thayn, Alanciar resembled the hind leg of a muntok, a reptilian beast of burden that was native to that continent. It had six peninsulas on its southwestern frontier which were collectively known as the Six Claws. One of these peninsula was known as Garrow's Neck and had a cove on its southern coast called Meori Cove, which was one of the few unguarded beachheads into Alanciar. These peninsulas faced the Western Sea and were connected to a series of reefs, which was formerly sunken land. The Six Claws were known to have six forts—Point Readiness, Point Solidarity, Point Awareness, Point Foresight, Point Vigilance, and Point Defiance—,which were used to provide the Alanciari of any Sith invasion attempt until the \"Unification\" of 2975 BBY. The Shank was the southern region of Alanciar and was home to many canals and farms."}, {"tag": "p", "text": "Alanciar was home to at least one large mountain range known as the Eskellon Mountains on its southern coast which straddled the Southern Passage, a cold sea that was known for its rocket-fast polar currents and ice conditions. The Northern Slope also contained several industrial cities and forests. The north-western coast of Alanciar was also dotted with at least four forts. Alanciar also had a plateau in the center of its northern region. Eastern Alanciar was also home to several forests and settlements. To the east of Alanciar lay a large eastern ocean known as the Sea of Flames. The Shank was used mainly for growing crops while northern Alanciar was a predominantly industrial region. Meanwhile, the Six Claws were regarded as a coastal frontier region. Known settlements on Alanciar included the capital Sus'mintri and the cities of Kerebba, Minrath, Port Melephos, and Uhrar. Alanciar's closest neighbor was Keshtah Minor, the domain of the Lost Tribe of Sith."}, {"tag": "h2", "text": "Flora and Fauna"}, {"tag": "p", "text": "Alanciar was home to at least three species of large animals including the uvak, the shumshur, and the muntok, which were employed by the Alanciari as beasts of burden. Uvak were large winged reptiles that were also found on Keshtah. Shumshur were known for their strength and were presumably used to transport heavy goods. Muntoks were four-legged reptiles that were known for their swiftness and could seat at least one rider. Muntoks were also used to transport goods and people across Alanciar's network of roads and canals. Alanciar also had trees that were capable of producing woods that were strong and durable enough for building ships. Due to centuries of urbanization and development, most of Alanciar's jungles had been cleared by 2975 BBY."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Due to the arrival of the Keshtah exile Adari Vaal, Alanciar developed into a militaristic and urbanized society over the next two thousand years. Generations of Alanciari were raised from young to despise the Sith Tribe which ruled the neighboring continent of Keshtah and to prepare for any Sith invasion. Due to the Sith threat, the Alanciari developed an early-warning system consisting of frontier signal towers, semaphore transmitters, and thoughtcriers. In addition, the Alanciari developed a well-trained and equipped military which consisted of ballistae, infantry units, an air force, and a coast guard known as the Shore Guard. All Alanciari were required to contribute to the Great Cause of resisting the Sith. All eligible citizens were required to report for military training at adolescence while elderly Keshiri were still obliged to support the war effort by working at factories. Like their Keshtah counterparts, the Keshiri on Alanciar also developed theater troupes which were used for both entertainment and to propagate messages both prior to and after the Sith conquest."}, {"tag": "p", "text": "Alanciar also had several technological innovations that were unknown to neighboring Keshtah until the \"Unification\" of 2975 BBY. These included sailing ships, canals, waterwheels, fireglobes, ballistae, and concrete, which was used to build canals, roads, and buildings. Most Keshiri settlements and homes were built out of concrete. Alanciar also had a wide and efficient network of roads and canals that were used to transport people and goods throughout the continent. Muntok-drawn barges were an innovation that was unique to Alanciar. Following the Sith \"Unification\", several Alanciari technologies like sailing ships, fireglobes, and waterwheels were adopted by the Sith. By contrast, some lethal technologies like ballistae were gradually phased out. Like their Keshtah neighbors, the Alanciari also had the technology to produce books and scrolls."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}