{"url": "Fifth_Battle_of_Qotile", "categories": ["Category:Legends articles", "Category:Battles of the Stark Hyperspace War"], "nodes": [{"tag": "h1", "text": "Fifth Battle of Qotile"}, {"tag": "p", "text": "The Fifth Battle of Qotile was the last battle of the Stark Hyperspace War."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the failure of Stark Collective forces in the previous battle, Iaco Stark's co-directors were unwilling to continue to tolerate what they saw as his bumbling leadership, and were on the verge of killing him, when he told them that he had an ally on the inside of the Republic stronghold of Mount Avos—neglecting to point out, however, that his ally was Jedi Knight Plo Koon, who had convinced Stark via telepathy to defect."}, {"tag": "p", "text": "Meanwhile, Nute Gunray and the Trade Federation, on threat of incriminating disclosures to the Senate, had given the Jedi Council the use of a fleet of freighters and C-9979 landing craft. Jedi Master Oppo Rancisis was on the bridge of the command ship where his use of battle meditation would be most effective, while Saesee Tiin prepared to command the two Jedi fighter groups, Red and Blue Squadrons."}, {"tag": "p", "text": "Mace Windu, Adi Gallia, and Eeth Koth also accompanied the force. Although outnumbered by the Combine fleet, they trusted that their better training, resolve, and use of the Force would carry the battle."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "On Troiken, Jedi Knight Tholme and his Padawan Quinlan Vos infiltrated the Combine's command ship, Raptor, in preparation for broadcasting a patch to the Combine's crippling navcomputer virus, while Qui-Gon Jinn and Obi-Wan Kenobi infiltrated the Combine's headquarters to acquire the patch itself."}, {"tag": "p", "text": "Jinn and Kenobi encountered trouble, however, as the protocol droid in charge of the patch required a password to release it. The password was soon supplied by Stark himself, who arrived with two of his co-directors—both of whom (Boor-Daa and Tam Gozon) he killed in front of the Jedi. Having telepathically received from Jedi Knight Plo Koon a promise of amnesty with his cooperation, Stark (having already realized his cause was a lost one) supplied the password and then helped the two Jedi pacify the command center."}, {"tag": "p", "text": "Overhead, Tholme and Vos transmitted the patch to the Trade Federation fleet, with Vos additionally reversing the controls of the shield generators of the Raptor, setting them instead to lower when ordered to raise. The Jedi then fought their way off the ship on one of its fighters as the Jedi force arrived en masse in the Qotile system."}, {"tag": "p", "text": "At Mount Avos, the Republic force retreated out a back entrance of the mine while the Combine forces swarmed in from the front. Koon planned to seal both entrances once the Republic soldiers had evacuated, thus trapping the Combine soldiers harmlessly inside the mine."}, {"tag": "p", "text": "The plan failed however when, determined to kill off both the Jedi who had stolen his glory and the enemy he had been unable to vanquish, General Ranulph Tarkin stole the last detonator charge and used it to open the challat eater cave to a devouring of all forces within the caves, killing himself in the blast while securing for himself a self-styled immortality as the \"Hero of Troiken\"—the man who indeed destroyed the Stark Combine and won the war in one fell swoop of self-sacrifice. Koon managed to escape just in time, using the Force to seal the mine, unfortunately trapping the majority of the Combine soldiers inside the insect-infested mine, where they were eaten alive."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As the Raptor was destroyed overhead, the few surviving ground forces of the Combine surrendered, ending both the battle and the Stark Hyperspace War. As for Plo Koon, he was made a Jedi Master and would hold a life-time seat on the Jedi High Council, in honor of his Master's dying wish."}, {"tag": "p", "text": "Tarkin's family, in a bid to rightfully exalt their progenitor as the \"Hero of Troiken,\" later struck a political bargain with Finis Valorum, supporting his election as Supreme Chancellor in 40 BBY in exchange for securing, via posthumous decoration, Tarkin's reputation as the war's definitive hero."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}