{"url": "Alanciari_military", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Military units"], "nodes": [{"tag": "h1", "text": "Alanciari military"}, {"tag": "p", "text": "A military existed on Alanciar, a continent on the planet Kesh that remained independent of the Sith Tribe until 2975 BBY. Their primary function was to defend their continent from any possible Sith invasion from Keshtah Minor. The organization consisted entirely of Keshiri, a purple-skinned species indigenous to Kesh, and was open to both males and females. Keshiri youths between the ages of 12 and 15 were required to report for compulsory military training. Members of the Alanciari military wore tan and gray uniforms."}, {"tag": "p", "text": "Some known units of the armed forces included the Signal Corps, the Training Directorate, an \"air force\" consisting of uvak-riders who were armed with diamond flak tubes, the Shore Guard which had a fleet of patrol ships, and several ballistae artillery units that were stationed across Alanciar. The military was known to maintain a series of forts on the Six Claws, a series of peninsulas on the southwestern coast of the continent known as the Shank. It also maintained another ring of forts on the northwestern coast. It answered directly to the War Cabinet, the centralized military government of the continent which was based in the city of Sus'mintri."}, {"tag": "p", "text": "Some known members of the Alanciari military including the Wardmaster Quarra Thayn, Captain Ruehn, and the soldier Jogan Halder. The forces repelled two separate incursions by the Lost Tribe of Sith in 2975 BBY. However, Sith forces under High Lord Korsin Bentado managed to regroup and infiltrate Sus'mintri where they killed the entire Alanciari War Cabinet. This effectively decapitated the Alanciari leadership and left the military without a command structure. Bentado attempted to use the Tribe's thoughtcriers to order the Alanciari ballistae to shoot down Grand Lord Varner Hilts' airship Good Omen. However, he was stopped by Quarra along with the Sith High Lord Edell Vrai and Squab."}, {"tag": "p", "text": "Jogan managed to convince the Alanciari that the Sith were not a threat to them but were rather the legendary Protectors, gods in Keshiri mythology. Thus, the Alanciari submitted to Sith rule and both Alanciar and Keshtah Minor were unified under Sith rule. Under Unification, the Alanciari burned their ballistae."}, {"tag": "h2", "text": "Appearances"}]}