{"url": "Fighter_wing/Legends", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Organizational military units"], "nodes": [{"tag": "h1", "text": "Fighter wing"}, {"tag": "p", "text": "The term fighter wing was an organizational unit and the largest unit of starfighters fielded by most space navies, including the Alliance to Restore the Republic/New Republic Defense Force, the Imperial Navy, and the Yuuzhan Vong fleet."}, {"tag": "h2", "text": "Imperial Navy"}, {"tag": "p", "text": "In the navy of the Galactic Empire, the fighter wing usually referred to all of the starfighters carried aboard an Imperial-class Star Destroyer, which amounted to six squadrons or seventy-two starfighters and bombers. Each squadron was typically divided into three flights of four fighters, but each flight could separate into two elements of two fighters. The types of starfighters used within an Imperial fighter wing varied, with wings stationed on newer front-line vessels such as Executor-class Star Dreadnoughts making greater use of advanced fighters such as the TIE/IN interceptor."}, {"tag": "p", "text": "Ground support wings attached to the Imperial Army were smaller than naval wings, consisting of ten flights of four fighters. Three flights formed a TIE/sa bomber squadron, six flights formed two TIE/LN starfighter squadrons, and one flight flew TIE/fc starfighters to act as spotters. In addition to the 40 pilots, the wing had 25 sensor techs, 25 controllers, and 60 ground crew personnel for a total of 150 men. Presumably, the naval wing had similar numbers of non-flying personnel."}, {"tag": "h2", "text": "Rebel Alliance/New Republic"}, {"tag": "p", "text": "Within the Rebel Alliance, and later the New Republic, a fighter wing generally consisted of three squadrons of starfighters. These wings were approximately half the size of an Imperial Navy wing, with three squadrons of twelve fighters. Three squadrons was the usual number of fighters that were stationed aboard large Rebel capital ships such as Mon Calamari Star Cruisers. Squadrons assigned to the same wing that operated independently of a warship almost always flew the same types of craft. For example, General Horton Salm's Defender Wing was originally made up of Y-wings, but later fully converted to B-wings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}