{"url": "Filar-Nitzan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Filar-Nitzan", "Category:Shape-shifting species", "Category:Wild Space species"], "nodes": [{"tag": "h1", "text": "Filar-Nitzan"}, {"tag": "p", "text": "The Filar-Nitzan were a polymorphic sentient species indigenous to the Wild Space planet DNX-N1. They resembled colored fog or smoke, with two eyes in a color opposite that of the main body: green Filar-Nitzan had red eyes, blue Filar-Nitzan had orange eyes, and so on. The species' gaseous nature made them immune to physical damage, and it allowed them to change shape quickly enough to avoid energy attacks; they could even diffuse damage from blaster bolts with a difficult-to-learn skill. However, their lack of a rigid form also prevented Filar-Nitzan from easily manipulating solid objects."}, {"tag": "p", "text": "Commonly considered legends, Filar-Nitzan were nearly unknown in the galaxy beyond their star system. They featured in stories as cloud demons and gas devils, entities reputed to be dangerous killers and frightening apparitions. Few xenobiologists were aware of the species' existence; those who were speculated that some four hundred individuals comprised the species' entire population. Nevertheless, some Filar-Nitzan integrated into the greater galaxy as infiltrators and spies."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Filar-Nitzan were a species of gaseous sentient beings who looked like puffs of smoke with wisps that wafted from a central mass. Two distinct eyes floated within the billows of the main body. The coloration of the central body and eyes varied widely, but in general, the two parts had complementary hues. For instance, Filar-Nitzan with green, blue, or yellow bodies had red, orange, or purple eyes, respectively. Filar-Nitzan could hide their eyes if necessary. Members of other species generally found the smokey beings' appearance frightening."}, {"tag": "p", "text": "Filar-Nitzan were capable of shifting into various forms and controlling their relative density. For instance, Filar-Nitzan were able to condense their gaseous bodies as small as 0.3 square meters, or as thin as 2.1 square meters. The ability allowed them to sift through small openings, such as ventilation shafts. Filar-Nitzan were impervious to melee attacks and other physical damage but vulnerable to energy-based injury. Filar-Nitzan who had been trained in energy diffusion had the ability to dissipate some of the damage caused by energy weapons or fire and lessen its impact. However, when confronted with a fast-moving attack, such as a blaster bolt, a Filar-Nitzan could simply avert gas from the body so that the potentially lethal blast passed through empty space and caused no damage in the first place."}, {"tag": "p", "text": "The species' form gave them a serious handicap when trying to interact with solid objects; only with extreme effort was a Filar-Nitzan able to handle even a small solid object. They were also slow; an individual wafted about at about half the rate of an average Human at a run. Nevertheless, their slow, steady movement was completely silent, a fact that made Filar-Nitzan extremely stealthy. Their diffuse nature also made them difficult to detect by beings used to dealing only with solid creatures. Filar-Nitzan had both male and female sexes, and they possessed genetic material that made cloning them possible."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Filar-Nitzan could express emotions with their eyes. At least one Fllar-Nitzan had a name: this specimen, Vacander, was calm and peaceable by nature."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The homeworld of the Filar-Nitzan was a largely unexplored planet known as DNX-N1. The world had been charted by outsiders by the end of the Galactic Civil War, and it became part of the region known as Wild Space. By the time of the Galactic Civil War, xenobiologists knew of the species and suspected that the Filar-Nitzan did not number more than four hundred individuals. After the transition from the Rebel Alliance to the New Republic, scientists who studied alien life had not changed their estimate."}, {"tag": "h2", "text": "Filar-Nitzan in the galaxy"}, {"tag": "p", "text": "Filar-Nitzan were exceedingly rare in the galaxy, and most beings had never heard of the species, let alone encountered one of its members. The few who had met a Filar-Nitzan generally found the experience harrowing, and stories from such interactions used terms such as \"cloud demons\" and \"gas devils\" to describe the species, terminology that led most non-Filar-Nitzan to dismiss the tales and to consider the gaseous beings pure myth. Similarly, the Filar-Nitzan's shape-shifting abilities subjected them to common prejudices that painted polymorphic species as dangerous killers."}, {"tag": "p", "text": "A few Filar-Nitzan made their way beyond their home system. For instance, the Kaminoans of the planet Kamino kept at least one Filar-Nitzan specimen in captivity at the planet's Malio Preserve Units; they eventually cloned the species after much difficulty. Filar-Nitzan could be found on Keyorin, a lawless world in the Outer Rim Territories. The Filar-Nitzan's gaseous nature allowed them to waft through security systems created for solid beings, a fact that made the species ideal infiltrators and spies. Vacander was one such Filar-Nitzan; during the Galactic Civil War, he was considered a major threat to the Rebel Alliance. Lieutenant Colonel Palpatine Essex Yerac submitted a report on Vacander to the Alliance SecuriDex that detailed Vacander's known dealings with the Galactic Empire and its allies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Filar-Nitzan Vacander appears in the sourcebook Alliance Intelligence Reports, written by Craig Robert Carey, J. P. Pietrzak, Bill Smith, and Trevor J. Wilson. The book was published by West End Games in 1995 as part of the Star Wars: The Roleplaying Game line. Vacander's entry includes game statistics to allow gamemasters to create new Filar-Nitzan characters; the game rules establish the species as fairly clumsy, physically weak, and inept with technology, yet intelligent and perceptive. Filar-Nitzan have a smaller pool of dice from which to assign various scores than that available to most other sentient species. In contrast, the species receives special abilities to allow them to avoid or lesson damage, although these powers are expensive to improve. The book suggests that players of the roleplaying game not be allowed to portray Filar-Nitzan characters. The illustration for the entry was provided by Matt Busch. Alien Encounters, a book published by West End Games in 1998, reprints the game statistics from Alliance Intelligence Reports and adds more background information on the species. The illustration that accompanies the entry was created by an uncredited artist."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}