{"url": "Filordus", "categories": ["Category:Legends articles", "Category:Filordi", "Category:Inner Rim species", "Category:Metatheran Cartel members"], "nodes": [{"tag": "h1", "text": "Filordus"}, {"tag": "p", "text": "Filordi (singular, Filordus) were sapients indigenous to Filordis."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Filordi were a species of asexual, sentient, six-limbed quadrupeds that stood at a about 1.4 meters in height. A Filordus, the singular term by which members of the species were known, had an unusual body shape and possessed two arms that hung from shoulders on their upper body, each with a three-fingered hand, with two long, spindly front legs attached to their abdomen. A set of shorter, stubbier back legs extruded from their hind quarters, and though they normally walked on all four of their legs, Filordi were capable of rising up onto their rear set of legs to walk in a bipedal fashion. However, they found walking in this manner to be tiring and walked less quickly when standing on two legs than they could on all four. At the ends of their legs, they had two large, flat back feet and a pair of smaller, more curved, front feet. Each of their feet culminated in a set of pincer-like toes which could be used for fighting, with the toes on their front set of legs facing rearwards and their back set of toes facing forwards."}, {"tag": "p", "text": "Filordi had humanoid-like faces with two eyes, a mouth, a nose and two large ears that could fold down over the rest of their face and be used to shield their eyes during windy and rainy conditions. Due to the large size of their ears, the Filordi possessed good hearing that allowed them to pick out sounds from among the roaring winds of their homeworld Filordis, though their increased sensitivity to sound also made them vulnerable to sonic attacks. Filordi were covered in a coat of short hair and some member of their species were orange in color, while others were covered in blue stripes."}, {"tag": "p", "text": "Entering adolescence at the age of 10, Filordi were considered to have reached adulthood by the time they reached the age of 14. At 40, they entered middle age, and members of the species ultimately went on to have a life expectancy of about 70 years. Filordi reproduced asexually while dying, and a week after a Filordus passed away an infant Filordus would emerge and crawl out from the corpse of its predecessor. Filordi had different dietary requirements to the Caarites, a porcine sentient species from the planet Caarimon."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Filordi were a resourceful and intelligent species that were adaptable to whatever circumstances they found themselves in. Filordi were creative and driven by a persistent desire to be successful, which led them to become ruthless and opportunistic. However, they were often short-sighted in their goals and would consume all resources that they obtained with no thought to the longer-term sustainability of their lifestyles. Their resilient nature helped the Filordi to survive on their homeworld Filordis, a rocky wasteland-covered world that was prone to thunderstorms and strong winds, and the two primary aims of most Filordi were to make their homeworld a less hostile environment and to leave Filordis altogether."}, {"tag": "p", "text": "Filordi were not gendered and were sometimes referred to with the pronoun \"it,\" as in the case of Yve. At other times, individual Filordi were referred to as male Filordi or using the pronoun \"he\"; notable examples include Furran, Nui Gneppe, and Verkul Seimbo."}, {"tag": "p", "text": "When fighting in a brawl, a Filordus would typically crouch onto its back legs and use its arms and pincers to attack its opponents. The Filordi spoke Filordian as their native language and could also learn Basic, which they spoke with gravely voices, though they would miss some consonant sounds. Filordi generally wore clothing around their torso area, with their lower body left bare. Some Filordi names included Anazzar, Birkalz, Dreevan, Grizztil, Hizka, Nirzru, Surlan and Zebbil."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Motivated by their desire to make their world a safer place, the Filordi actively terraformed their homeworld to make it less inhospitable. At some point after its founding in 350 BBY, the Filordi became a member species of the Trade Federation, a powerful trade and shipping concern that operated throughout the galaxy. During the last decades of the Galactic Republic, the Federation fell under the influence of the Sith Lord Darth Sidious and he directed the corporation to initiate plans to invade the planet Naboo. The Filordi and the Caarites, another member species of the Federation, objected to the plans, and, in 33 BBY, after holding secret negotiations on Filordis between representatives of both species, the Caarites persuaded the Filordi to join with them and breakaway from the Trade Federation to found the Metatheran Cartel, a rival shipping concern. The Cartel subsequently entered into direct competition with the Federation and the Caarites and the Filordi attempted to discredit their former partners by exposing some of the Federation's unethical practices."}, {"tag": "p", "text": "Around 33 BBY, Cularin crime lord Nirama bought technology from the Filordi to use it against the local asteroid belt pirates."}, {"tag": "p", "text": "Although the Cartel based on Cularin, it also opened secondary headquarters in Filordis and in the Caarite homeworld, Caarimon. In day-to-day dealings with the public, the reclusive Filordi let the Caarites be the face of the Cartel, and were rarely seen."}, {"tag": "p", "text": "Two Filordi security agents and three Filordi cooks were seen in the Metatheran Cartel jungle base of Cularin in 31 BBY. Another Filordus, Furran, was a permitor affiliated to the House Intari in Depatar around the same time; Furran got little job opportunities because his species was such a rare sight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}