{"url": "Findsman/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Findsmen", "Category:Force-based organizations", "Category:Gand culture", "Category:Law enforcement occupations", "Category:Religious occupations", "Category:Religious titles"], "nodes": [{"tag": "h1", "text": "Findsman"}, {"tag": "p", "text": "The findsmen were a Force-sensitive—though the findsmen themselves claimed that their abilities did not stem from the Force—religious tradition of bounty hunters unique to the Gand species. The findsmen worshiped the enshrouding mists of the planet Gand, divining omens and signs in order to locate their prey. Becoming a findsman sometimes was granted to a Gand during a janwuine-jika. Findsmen could locate people, things, places, and even events by auguring signs sent to them during their mystical rituals that could take at least three hours to complete. Findsmen were legendary figures in Gand society, and the title had a bit of prestige outside of Gand society as well."}, {"tag": "p", "text": "Certain findsmen sects would instruct their apprentices to bathe in specific chemicals, or even subject them to genetic manipulation, which would cause knob-like growths to appear on portions of their exoskeletons. These serrated growths, usually located on the arms and legs and sometimes four to five centimeters in length, would then be used as weapons in hand-to-hand combat."}, {"tag": "p", "text": "The findsmen had developed a form of martial arts centuries ago that made use of the Gand biology. The tenets of the form were not understood, though a few moves were described; \"Piercing Touch\" and \"Striking Mist.\" \"Piercing Touch\" was described as a powerful punch that could penetrate bone, chitin, and various armors. Ooryl Qrygg demonstrated this move on Talasea, when he punched a hole through stormtrooper armor. The other move, \"Striking Mist,\" allowed the attacking Gand to sneak in close to their opponent so that the Gand's hits could not be parried or dodged."}, {"tag": "p", "text": "Outsiders often saw the findsman as a bizarre religious sect devoted to hunting, while the Gand themselves considered findsmen as being on the \"path to truth.\""}, {"tag": "p", "text": "Findsmen were hired as security advisors, bodyguards, bounty hunters, investigators, and even assassins. The training of a findsman required devotion and study, and leaving the tradition would often be a death sentence for the wayward findsman. Members of that findsman's sect, if they were to learn of their initiate's stray from the path, were likely to deem that findsman as a rogue and kill them on sight."}, {"tag": "p", "text": "In 3951 BBY a group of nearly a hundred Gand bounty hunters left to temporarily settle on Nar Shaddaa in order to help find Meetra Surik at the request of G0-T0. Among their number were several findsmen, most of whom were killed by Surik and her party in the ensuing conflict."}, {"tag": "p", "text": "Prior to 3 ABY, the findsman tradition had started to die out, and during the Galactic Civil War, the bounty hunter Zuckuss and the pilot Ooryl Qrygg were findsmen, two of the few to leave their homeworld."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}