{"url": "Finis_Valorum%27s_father", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:House Valorum", "Category:Individuals of unspecified species", "Category:Politicians", "Category:Unidentified fathers"], "nodes": [{"tag": "h1", "text": "Finis Valorum's father"}, {"tag": "p", "text": "An male member of House Valorum worked as a politician. His actions involved patronage of artistic works such as the opera The Brief Reign of Future Wraiths, and a situation with the Nebula Front that did not destroy the terrorist group. The politician had a son named Finis Valorum, who followed his father's career and became Supreme Chancellor of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male member of the influential Valorum dynasty worked as a politician. At one point in their career they dealt with a terrorist organization called the Nebula Front, and had an opportunity to destroy the group, instead he only chastised the group, and they continued to function throughout the galaxy. The politician had a partner, and together they underwrote a number of major artistic works, including an opera called The Brief Reign of Future Wraiths. On the planet Coruscant the two had a Human son named Finis Valorum."}, {"tag": "p", "text": "The young Valorum was presumed by observers to follow in his father's political career, and as such his election as senator of the Lytton sector was unsurprising, and aided by familial and political connections. Valorum later became Supreme Chancellor of the Galactic Republic. During his second term in 32 BBY, Valorum faced crisis in the fallout of the Dorvalla Incident, an attack perpetrated by the Nebula Front. Shortly afterwards he attended a performance of The Brief Reign of Future Wraiths at the Coruscant Opera, considered a fitting touch given his parents patronage of it. Before the performance began Senator Palpatine discussed the Dorvala Incident with several other senators, believing it ironic that Valorum was affected by an event caused by the inaction of his father."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Finis Valorum's father served as a politician, and his connections allowed his son to rise to senatorial office. He also did not eliminate the Nebula Front despite opportunity to do so, choosing instead to chastise them, an act that had ramifications for his son's own career."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Finis Valorum's father was first mentioned in Cloak of Deception, a 2001 novel by James Luceno."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}