{"url": "Finn_Ertay", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Females", "Category:Jedi of the Jedi Order", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Finn Ertay"}, {"tag": "p", "text": "Finn Ertay was a Twi'lek female who served as a Jedi during the Clone Wars. In 19 BBY, Ertay and a fellow Jedi encountered the Nightbrothers known as Maul and Savage Opress on a spaceport somewhere in the Outer Rim."}, {"tag": "p", "text": "The two Jedi engaged Maul and Opress in a Lightsaber duel. Ertay faced Maul until she saw her comrade in danger of being killed by Savage. She used her speed and agility to evade Maul's lightsaber strikes and slid across the floor to engage Savage Opress, saving her Jedi friend's life. Whilst she was occupied with Savage, Maul came up behind Ertay and ran her through the back with his lightsaber, killing her. The Jedi whose life she saved was killed by the brothers shortly after."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Clone Wars in 21 BBY,[source?] Finn Ertay was present at the Jedi Temple at the Jedi Temple communication center where she watched a message from Separatist General Grievous. Ertay along with the other Jedi were horrified by his torturing of Jedi Master Eeth Koth. She left soon after after Grand Master Yoda dismissed the Jedi younglings."}, {"tag": "p", "text": "In 20 BBY,[source?] Ertay was present at the Jedi Temple and welcomed back Jedi trainees Jinx and O-Mer who were rescued from Wasskah by Wookiee General Tarfful."}, {"tag": "p", "text": "In 19 BBY,[source?] Ertay and a Nikto Jedi dueled former Sith Lord Maul and his brother Savage Opress at an Outer Rim spaceport. The Nikto was injured by Opress and Ertay leapt to aid her ally, only to be stabbed in the back by Maul, killing her. Shortly afterward, her comrade also was killed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Finn Ertay had blue eyes and green skin. She was disturbed by Eeth Koth's torture and left the room shortly afterward. When she saw her fellow Jedi in danger during their fight with the Nightbrothers, she quickly broke off her fight with Maul to defend him, which cost her her life when Maul stabbed her from behind."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Finn Ertay possessed skill in lightsaber combat, managing to briefly defend herself against Darth Maul and Savage Opress. She showed herself to be somewhat athletic and fast, sliding between Maul's legs to block a blow from Savage that would have killed her comrade, but her skill was not sufficient to save her life or defeat her opponents."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Finn Ertay used a blue lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}