{"url": "Finn_Vaal", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Keshiri", "Category:Males"], "nodes": [{"tag": "h1", "text": "Finn Vaal"}, {"tag": "p", "text": "Finn Vaal was a male Keshiri native of the planet Kesh who lived in the era of the Great Hyperspace War. Son of Zhari and Adari Vaal, Finn lost his father in an accident when he was young, and he and his brother, Tona, were left to be raised by their grandmother, as their mother was often away on geology work. In 5000 BBY, Adari Vaal happened across a group of crashed Sith who claimed to be the Keshiri gods, the Skyborn. Finn's mother was honored, and, over the coming years, Finn became devoted to the supposed Skyborn. Although he was exempt from working on the labor crews building monuments and tributes to the Sith due to his exalted mother, Finn volunteered anyway, and he died in 4987 BBY when the scaffold on which he was working collapsed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Finn Vaal, a Keshiri male, was born on the planet Kesh. He was the oldest son of Zhari and Adari Vaal, and had one younger brother, Tona. His father, Zhari, a member of Kesh's ruling Neshtovar, died in an accident while riding an uvak beast when Finn was still young. After that, Finn, Tona, and his mother moved in with Adari's mother, Eulyn. Adari was often busy with her work as a geologist, so Finn and his younger brother were cared for by their grandmother. In 5000 BBY, Adari became notorious for teachings that ran contrary to the prevalent Keshiri religion, and, after the Vaal family home came under siege by an angry mob, she fled into the Takara Mountains while Finn and the rest of the Vaal family took refuge at a relative's home. While in the mountains, Adari came across a group of Sith who proclaimed themselves to be the Keshiri gods, the Skyborn. Adari Vaal was honored for her role in finding the supposed Skyborn, and Finn happily attended the ceremony in which both her mother and the Skyborn were exalted in the Circle Eternal plaza in the city of Tahv."}, {"tag": "p", "text": "By the time Finn came of age, the Sith were firmly entrenched as the rulers of Kesh. Many Keshiri set to work on labor crews, building monuments and the like glorifying the Sith. Although Finn, as the son of the honored Adari Vaal, did not have to work, he insisted on joining one of these crews once he was old enough, eventually getting his way. One day, a scaffold on which Finn was working collapsed, killing him. Adari rushed his lifeless body to Sith leader Yaru Korsin in the Kesh Sith Temple, hoping that Korsin could resurrect Finn with Sith magic, but the Sith leader was unable to do so. The incident destroyed Adari's faith in the Sith and drove her to lead the Keshiri resistance, which secretly opposed the Sith. Years later, regretful passages about Finn and his brother Tona were found in his mother's personal memoirs, written during her exile in the far-off continent of Alanciar, after the disintegration of her resistance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a youth, Finn Vaal was very rambunctious, and it was a challenge for his caretakers to get him to sleep. He dearly loved his mother, despite the fact that she was usually unable to care for him. Both he and his brother, Tona, took after their father, but not in a positive way according to Adari—she regarded Finn as dim-witted and no kinder than her late husband had been. By the time Finn came of age, he was devoted to the Sith, so much so that he decided to labor on one of their work crews even though he was exempt from service."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Finn Vaal first appeared in Lost Tribe of the Sith: Skyborn, a 2009 eBook by John Jackson Miller. Thus far, it is his only appearance in Star Wars canon, although he was mentioned in one of Skyborn's sequels, Lost Tribe of the Sith: Savior. In Skyborn, Finn is described as Adari Vaal's oldest child, but in Savior he is said to be the youngest. For the purposes of this article, the former is treated as correct. In an email interview dated to December 11 2013, Miller has since confirmed that Finn was indeed the eldest son of Adari Vaal, as first mentioned in Skyborn. He also acknowledged that the description of Finn as the youngest in Savior was an error."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}