{"url": "Finn_Shallo", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Humans", "Category:Journalists", "Category:Males"], "nodes": [{"tag": "h1", "text": "Finn Shallo"}, {"tag": "p", "text": "Finn Shallo was a Human male journalist who lived on Corellia during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time following the Battle of Yavin, Finn Shallo worked in Coronet City as an editor for the Corellia Times. He was leading his own team of reporters and was known to be an expert on the Corellian terrorist and criminal organizations. During his career, he worked with Demmi Wot, an ex-member of the Ragtags who helped him to find information about those criminal groups."}, {"tag": "p", "text": "Circa 1 ABY, Finn Shallo accepted to help a spacer working for CorSec Lieutenant Mack Jasper and provided information about the Meatlump criminals. Thanks to Shallo, the spacer discovered that the Ragtags were responsible for vandalism in the Coronet Starport."}, {"tag": "p", "text": "Around the same time, Finn Shallo helped a spacer to find the owner of a viewscreen with the Corellia Times logo on it retrieved from a Meatlump sublieutenant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Finn Shallo was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "Finn Shallo was added to the game with the release of the \"Publish 21,\" on August 4, 2005. He was involved in two independent questlines: \"Ral Mundi's quest,\" and \"Vani Korr's quest.\" Ral Mundi's quest was later revamped with the release of the \"Publish 27,\" on February 15, 2006, as the quest was inserted into the \"Legacy Quest,\" the main questline in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}