{"url": "Finn_Ertay/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Post-Ruusan Jedi", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Finn Ertay"}, {"tag": "p", "text": "Finn Ertay was a Twi'lek female who served the Galactic Republic as a member of the Jedi Order during the Clone Wars. Around 22 BBY, Ertay attended a meeting in the Jedi Temple on Coruscant when Confederate General Grievous broadcast his capture of Jedi Master Eeth Koth, prompting a Jedi-led task force to rescue Koth from Grievous's clutches. She was also present when a group of Jedi Initiates returned to the Temple from imprisonment on the Trandoshan moon of Wasskah. When the Nightbrothers Darth Maul and Savage Opress began to target a number of Outer Rim outposts circa 20 BBY, Ertay and a Nikto Jedi confronted the Sith brothers at an Outer Rim spaceport. She attempted to save her comrade from Opress's blade in the ensuing lightsaber duel, but both Jedi were killed in combat by the Nightbrothers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Twi'lek female Finn Ertay lived during the final decades of the Galactic Republic. Being sensitive to the Force, she received training in the ways of the Jedi and became a member of the Jedi Order by the time of the intergalactic Clone Wars, fought between the Republic and the Confederacy of Independent Systems. Around 22 BBY, the first year of the war, Ertay was present at the Jedi Temple on the galactic capital of Coruscant when a meeting was called at the Temple communication center. Attending alongside a number of her colleagues, Ertay witnessed Confederate General Grievous holographically broadcast his torture of Jedi Master Eeth Koth, a member of the Jedi High Council whom the cyborg General had captured during a battle near the Arda system. When Jedi Grand Master Yoda ordered away the present younglings, Ertay was among those, including Eekar Oki, who withdrew from the room. Koth was later freed from Grievous's custody thanks to the efforts of a Jedi-led task force from the Grand Army of the Republic."}, {"tag": "p", "text": "In 21 BBY, when a group of Jedi Initiates was rescued from the moon Wasskah, where they had been hunted for sport by Trandoshan hunters, Ertay joined Oki and several Jedi Council members in welcoming the younglings back to the Jedi Temple upon their arrival aboard the bounty hunter gunship Halo. Ertay spoke with the initiate O-Mer on the landing platform before the group proceeded back into the Temple. Later, around the war's third year, the Nightbrothers and self-proclaimed Sith Lords Darth Maul and Savage Opress began a scourge through the Outer Rim Territories, targeting a number of poorly defended outposts in that area of the galaxy. Ertay teamed up with a Nikto Jedi to confront the Sith brothers at an Outer Rim spaceport."}, {"tag": "p", "text": "While her Nikto comrade faced down Opress in lightsaber combat, Ertay took on Maul, employing her acrobatic skills in their duel. When she saw Opress kick the Nikto to the ground, she ducked between Maul's cybernetic legs and brought her lightsaber up to intercept a strike from Opress's blade that would have killed the Nikto. However, that move allowed Maul to assail her from behind. Ertay was struck through the back by Maul's lightsaber, falling to the Nightbrothers alongside her Nikto companion. Their deaths, in addition to the recent Outer Rim attacks, prompted Jedi Masters Obi-Wan Kenobi and Adi Gallia to track down Maul and Opress, who were forced into a showdown on the planet Florrum."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Finn Ertay had green skin and blue eyes. Being a Twi'lek, she wore a headpiece around her pair of lekku, along with a low-cut Jedi robe complete with boots. She served the Republic as a member of the Jedi Order. During the duel at the Outer Rim spaceport, Ertay attempted to defend her fellow Nikto Jedi when he was struck down by Savage Opress, though her decision enabled Darth Maul to exploit her momentary preoccupation and kill her. Ertay wielded a lightsaber with a blue crystal."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Finn Ertay was sensitive to the Force and trained as a Jedi. In addition to a proficiency in lightsaber combat, she possessed acrobatic skill, ducking under Darth Maul's cybernetic legs to intercept Savage Opress's blade in a single fluid motion. Despite her faculty for combat, she was unable to withstand the combined efforts of the two Nightbrothers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Finn Ertay was created for the Star Wars: The Clone Wars television series, mainly appearing as a background Jedi character throughout her appearances in the series. She was introduced in the second season episode \"Grievous Intrigue,\" which aired on January 1, 2010, being identified by name in the episode's corresponding guide on StarWars.com. She was again featured in the episode \"Wookiee Hunt,\" which aired on April 1, 2011 with the series' third season. In the Newsreel of \"Revival,\" the fifth season's premiere episode, her death was depicted at the blade of Darth Maul. The episode was released on September 29, 2012."}, {"tag": "p", "text": "The story adaptation of \"Wookiee Hunt\" in Star Wars: The Clone Wars Annual 2012 states that during the scene in which O-Mer and the other Jedi younglings return to the Jedi Temple from Wasskah, the young Jedi are \"reunited with their masters.\" Given that in the episode, Ertay is among the Jedi who greet the newly returned younglings at the Temple, the possibility that she is one of the \"masters\" is implied, though the text does not explicitly mention Ertay by name. To date, any official connection has yet to be clarified."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}