{"url": "Firaxan_shark", "categories": ["Category:Legends articles", "Category:Creatures of Manaan", "Category:Creatures of unspecified diet", "Category:Non-sentient species", "Category:Sharks"], "nodes": [{"tag": "h1", "text": "Firaxan shark"}, {"tag": "p", "text": "The firaxan shark, or firaxa, was a fierce underwater creature that inhabited the seas of Manaan. They were extremely deadly and were known to attack anyone who dared to swim in their waters."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was believed that the firaxa and the Selkath were distant cousins, both descended from the Progenitor. This would explain why the firaxan sharks did not attack Selkath in the water, despite no compelling reason to deviate from their normal vicious predation. Both species were also affected similarly by the distress of the Progenitor when her territory was invaded. She emitted a signal which drove the Selkath mad and made both species much more aggressive."}, {"tag": "p", "text": "Firaxae were known to be weakened by sonic pulses."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "To protect themselves against the sharks, some deep-sea explorers carried sonic emitters while walking around the dangerous ocean floor, using them when a firaxa came too near."}, {"tag": "p", "text": "Scientists working at Hrakert Station were tormented by a giant shark which may have been the Progenitor after it was awakened during a mining operation. While the Selkath at the station went insane after the shark let out her psychic call, there were scientists developing a repellent to keep the firaxa at bay while they conducted their research. A small amount of the toxin was available to Revan as a possible method for dealing with the Progenitor. He chose not to poison the great beast, however. Instead, Revan destroyed all the machinery within the station, which calmed the shark and sent it back to the depths."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If Revan chooses the dark side option he can kill the scientists and use the poison on the Progenitor, although he would then be banned from Manaan unless he blackmails them by threatening to reveal the Selkath's involvement with the Republic Embassy, publicly shattering their neutrality."}, {"tag": "p", "text": "In \"Dining at Dex's,\" an ingredient in the Manaan slider is called a Firaxan shark fillet though, aside from the nominal connection, the work by Gregory Walker does not establish a canonical connection to firaxan sharks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}