{"url": "Firdaaz", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:FarStar crewmembers and personnel", "Category:Humans", "Category:Males", "Category:Scouts", "Category:Socorrans"], "nodes": [{"tag": "h1", "text": "Firdaaz"}, {"tag": "p", "text": "\"Gammer\" Firdaaz was a Human male scout from the planet Socorro who spent the majority of his life exploring other worlds. An alcoholic, Firdaaz spent a lot of his time drunk, but he had a wealth of knowledge and survival skills. In 8 ABY, Firdaaz found himself on Kal'Shebbol, the sector capital of the Kathol sector, and subsequently signed onto the crew of the New Republic CR90 corvette FarStar, which had been assigned to track down the Imperial warlord Moff Kentor Sarne. Sarne had ruled Kal'Shebbol until the New Republic liberated the planet but had fled during the battle, taking the majority of his fleet with him. Unlike many other members of the crew, Firdaaz had no personal stake in the mission, and he sought no vengeance against Sarne himself—he simply wanted to visit as many planets as possible before he died. Firdaaz served on the FarStar until the ship reached the planet known as Demonsgate on the edge of the Kathol Rift, a volatile area of space filled with dense gas clouds and lightstorms that disrupted sensors, navigational instruments, and communications. He volunteered to remain on the planet to maintain the communications link known as the Lifeline Project, which was the corvette's only means of staying in contact with New Republic forces based on Kal'Shebbol."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born on the planet Socorro, the Human male Firdaaz was a scout for most of his life, and he explored countless planets. Firdaaz was also an alcoholic, and he often spent much of his time in a drunken stupor. Sometime during the course of his life, he acquired the nickname \"Gammer.\" In 8 ABY, the elderly Firdaaz was on the planet Kal'Shebbol, the sector capital of the Kathol sector in the Outer Rim Territories, when it was liberated by the New Republic."}, {"tag": "h3", "text": "Service aboard the FarStar"}, {"tag": "p", "text": "Firdaaz learned about the New Republic's mission to track down Moff Kentor Sarne, the Imperial warlord who had ruled Kal'Shebbol and the Kathol sector. Sarne had fled the planet with the majority of his forces, and the New Republic was sending a single ship, the modified CR90 corvette FarStar, after him. However, due to manpower shortages, the New Republic could not afford to crew the vessel with entirely New Republic personnel, so they took to recruiting from amongst the population of Kal'Shebbol itself. Firdaaz, possessed by a deep desire to see as much of the galaxy as he could before he died, signed onto the crew as a scout, believing that his skills would be an asset to the mission. Unlike many of his new crewmates, Firdaaz had no personal issues against the Moff to settle. However, his alcoholism affected his shipboard duties, as he was often drunk. He found common ground with several other members of the crew who had the same problem, and they often hid in isolated corners of the ship to indulge themselves whenever a bottle of alcohol was found or smuggled aboard."}, {"tag": "p", "text": "Several weeks into the FarStar's voyage, the ship stopped off at the planet Binaros to replenish its food supplies after crossing the Marcol Void, an empty expanse of space. The landing party inadvertently brought feeder plant spores back aboard, and several settled in the corvette's lower forward hold. As the plant began to grow, mobile feeders were sent out to bring the plant the nutrients and water it required. Firdaaz, sleeping in one of the ship's alcoves after a drinking session, was awakened by several of the small plant creatures poking at him. Frightened, he ran to the bridge and relayed his experience to Captain Kaiya Adrimetrum, ranting and raving, and he demanded that the captain do something about the \"beasties\" loose on the ship. Members of the crew investigated the alcove but found no evidence of the creature's existence, and it was dismissed because Firdaaz was drunk at the time. The crew later found that out that Firdaaz had been correct, and they were forced to battle the plant after it entered a stage in its life-cycle where it developed a need for the nitrogen found in the blood of living beings. Varel DeVay, a scientist working in the ship's hydroponic bays, managed to create a gaseous poison that killed the plant."}, {"tag": "p", "text": "Months after leaving Kal'Shebbol, the FarStar passed through a volatile gas cloud known as the Kathol Rift. Due to the severe radiation and energy storms present in the Rift, long-range communications with New Republic assets stationed at Kal'Shebbol were impossible. Brophar Tofarain and Lofryyhn, the FarStar's chief mechanics, devised a solution to the communications problem. Dubbed the Lifeline Project, six probe droids were to be stationed at predetermined points in the Rift to act as a communications relay. The planet Demonsgate at the edge of the Rift was chosen as the end point for the project, and Firdaaz volunteered to remain on the planet to maintain a semi-permanent facility for the link for as long as the FarStar needed it. Although she was initially skeptical about leaving the scout behind, Captain Adrimetrum agreed to his request. The maintenance of the Lifeline Project proved crucial to the FarStar's mission, as it allowed the Bothan Combat Response Element, which had been trailing the ship, to reinforce the corvette during the Battle of Kathol wherein the New Republic forces claimed victory over Moff Sarne."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "\"Gammer\" Firdaaz had dark skin, white hair, and a mustache. He always believed that he knew what was best in any given situation, and he made his feelings on all matters perfectly clear. He was always quick to berate others if they tried something their own way and it did not work. Although not part of the FarStar's command crew, Firdaaz acted as though he was, and he had to be told otherwise on several occasions. Firdaaz was an alcoholic, and he was often drunk. He made sure he was never very far from a bottle of Socorran raava. When Firdaaz was not drunk, he was grumpy and unwilling to follow orders and often needed incentives to perform his duties."}, {"tag": "p", "text": "An experienced scout, Firdaaz had an extensive knowledge of survival skills and was an experienced tracker, abilities that helped him to stay alive on the hostile planets he explored. Only truly happy when he had the solid ground of a new world under his feet and he was allowed to explore, Firdaaz quickly grew tired of shipboard life during the FarStar's mission and relished the opportunity to disembark and scout a new planet. To assist him in his scouting duties, he carried a blaster pistol, a knife, a breath mask, macrobinoculars, a medpac, and protective goggles."}, {"tag": "p", "text": "Firdaaz also had a knowledge of alien species and planetary systems, and could use a personal blaster or ones mounted to vehicles. He also had some training in melee combat. He was able to plot courses through hyperspace, operate and repair repulsorlift vehicles, and ride animals. He was also trained in first aid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Gammer\" Firdaaz was created for The DarkStryder Campaign by West End Games for Star Wars: The Roleplaying Game. He was a member of the support crew and appeared only sporadically throughout the subsequent supplements The Kathol Outback and The Kathol Rift. While players had the freedom to develop Firdaaz as they saw fit, The DarkStryder Campaign stated that he was to remain alive as he would be developed in later supplements."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}