{"url": "FireStar_II-class_Orbital_Defense_Platform", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Galactic Empire space station classes", "Category:Galactic Republic space stations", "Category:Rendili StarDrive products"], "nodes": [{"tag": "h1", "text": "FireStar II-class Orbital Defense Platform"}, {"tag": "p", "text": "The FireStar II-class Orbital Defense Platform, also known as the FireStar II-class Orbital Defense Station, was a battle station of the Galactic Republic and later Galactic Empire that was an upgrade over the original FireStar-class."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The FireStar II-class Orbital Defense Platform was a battle station that was manufactured by Rendili StarDrive that was designed to provide a higher concentration of firepower from a smaller, cheaper, and more easily produced space station than the original FireStar. The battle station had three spires that each extended from the core of the station from above and below the weapon rings, which were a pair of circular platforms with tracks to allow armaments to rotate to the side of the space station when needed. It was possible that the rings were susceptible to damaged weapons clogging the tracks, but the armament could be ejected in emergency situations. The spires housed more weapons and surveillance equipment."}, {"tag": "p", "text": "The FireStar II-class had a central deck that was surrounded from above and below by the weapon rings, with four hangars for starfighters and freighters on each side. Each corner of the hanger deck extended past the weapon rings and finished in a cluster of thrusters for maneuvering the station. The central levels of the station within the rings were the crew quarters, administration, surveillance systems, and communications. The FireStar II-class had several reactors that were situated below the core and were surrounded by the lower weapon ring."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The FireStar II-class Orbital Defense Platform was commissioned for area defense as well as surveillance and intelligence gathering."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The FireStar II-class Orbital Defense Platform was commissioned after the creation of the original FireStar. During the Clone Wars between the Galactic Republic and the Separatist Alliance, the Republic Navy had at its arsenal the FireStar II-class. One such battle station that was active was the Sentinel Flare, which defended the supply and waystation located in the Truwel system. Late during the Clone Wars, the Sentinel Flare suffered a surprise Separatist attack which left it severely damaged. Soon after, the war ended and the Galactic Empire reigned over the galaxy. With the abrupt end of the war, the Empire did not recognize that the Sentinel Flare was in need of restoration, and as such only returned it to its core functionality. The Sentinel Flare remained as an intelligence asset for several years before it was given to the Truwel planetary government."}, {"tag": "p", "text": "With this new ownership, entire sections of the station were abandoned, half of the upper-track weapons operated, the lower track required a complete rebuild, the lower spires were heavily damaged and abandoned below the reactor levels, it had one upper spire operational with the other two only partially, had outdated surveillance systems, half of the reactors were operational while the rest powered the weapons systems or needed restoration, and had two hangars operational. The waystation, however, received five new service stations to service Imperial starships. Eventually, a Rebel Alliance attacked the waystation provided local rebel sympathizers with inspiration for Operation Shield Bash. As the Empire sought for ways to cheaply increase security operations, the sympathizers seized the opportunity, and after meeting local Rebel Alliance members they were able to convince Imperial officials to upgrade the Sentinel Flare. Rebels considered various strategies and undertook various operations to bring the Sentinel Flare under their control."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The FireStar II-class Orbital Defense Platform was first mentioned and pictured in the 2018 canon Fantasy Flight Games roleplaying book Fully Operational."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}