{"url": "Fireball", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Racers (starship)", "Category:Resistance starships"], "nodes": [{"tag": "h1", "text": "Fireball"}, {"tag": "p", "text": "The Fireball was an old racer that Team Fireball tried to restore in their repair shop on the Colossus, a refueling station on the planet Castilon. It was given its name because of its tendency to burst into flames and/or explode."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The racer was equipped with armament in the form of wingtip-mounted laser cannons and a pair of missile launchers. At one point, Tamara Ryvora was working on installing a cannon on it."}, {"tag": "p", "text": "At one point, the team painted a gorg on the starboard side."}, {"tag": "p", "text": "Rumor had it that Jarek Yeager cobbled it together from an old T-65B X-wing starfighter and a Z-75 Headhunter that he inherited from family."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Xiono's race"}, {"tag": "p", "text": "At the time of Kazuda Xiono's arrival at the station as part of a spy mission, it had been promised to Ryvora, if she could get it to fly. Yeager offered it to Xiono in order to compete in a race against Torra Doza. Yeager's team was able to repair it in time, but Xiono pushed it too fast during the race, causing the engines to catch flame and crash into the ocean. It was later recovered, along with Xiono."}, {"tag": "h3", "text": "The broken compensator"}, {"tag": "p", "text": "Some time later, Team Fireball was repairing the acceleration compensator. Xiono accidentally broke the repair job, causing Ryvora to become angry and demand that he repair it. After becoming involved in the hunt for two children on the station, his new friends the Chelidae engineers helped him repair the compensator, which Xiono presented to Ryvora."}, {"tag": "h3", "text": "Rendezvous with Poe"}, {"tag": "p", "text": "The Fireball was next flown when Xiono needed to go to an offworld rendezvous with the Resistance. Yeager arranged for Xiono and BB-8 to leave the Colossus early enough that Ryvora, who was possessive of the ship, would only learn of their departure after they were gone. However, unbeknownst to Yeager and Xiono, Ryvora had decided to replace the ship's stabilizers, and had not yet completed the job. When she revealed this fact to Yeager after discovering Xiono had left, Yeager was concerned. Above Castilon, Xiono and BB-8 ran into mechanical trouble due to the missing stabilizer, and Xiono thought that the ship was going to explode before several Resistance ships arrived just in time. Poe Dameron, shocked that Xiono was flying such an old ship, promised to have mechanics look at it."}, {"tag": "h3", "text": "The Bibo incident"}, {"tag": "p", "text": "Some time later, it was ready for launch. During the Bibo incident, Kaz jumped into the cockpit and launched to assist the Aces in fighting off a rokkna which was assaulting the station. Kaz used it to strafe the sea monster, and at one point gave a wingtip assist to Griff Halloran. Eventually, Team Fireball realized that the rokkna was there to find her baby, which Neeku Vozo had adopted and named \"Bibo.\" The mechanic returned the baby, defusing the situation."}, {"tag": "h3", "text": "Torra's kidnapping"}, {"tag": "p", "text": "When Torra Doza was kidnapped by the Warbird gang, Kaz and BB-8 sortied in the Fireball in pursuit. While chasing the pirates' skiff, the Fireball received damage to its transponder, preventing Kaz from relaying Torra's coordinates immediately. By the time they caught up to Kragan Gorr's sail barge, the Galleon, the First Order, led by Major Elrik Vonreg, faked a rescue of Torra. During the chaos, BB-8 managed to fix the transponder, enabling them to alert Captain Imanuel Doza and Ace Squadron to their location, but by then, the First Order had already made off with Torra. The Fireball then returned to the Colossus."}, {"tag": "h3", "text": "Mission to the Dassal system"}, {"tag": "p", "text": "When Poe infiltrated the Colossus to pickup BB-8 for their mission to Jakku, Kaz informed him of First Order activity in the Dassal system, forcing them to take a detour. To get them off the Colossus undetected, they used the Fireball to perform a Widowmaker, enabling them to reach Poe's X-Wing with CB-23 onboard. Upon arriving in the Dassal system, they discover its star had vanished and its planetoids cored out. As they traveled through one of the planetoids, they got caught in a gravity well, which they managed to survive."}, {"tag": "p", "text": "They soon landed on a habitable moon and determined that its inhabitants were massacred, shortly before they were attacked by a probe droid. After disabling the droid, they determined that it was First Order as some TIE fighters flew overhead. Kaz and Poe managed to make it back to their ships and fled their pursuers. At Poe's direction, Kaz piloted the Fireball back through the gravity well, knowing the First Order wouldn't be able to quickly adapt as they did. Once they were out of danger, Kaz and Poe did a droid swap before parting ways. With CB-23's aid, Kaz was able to land the Fireball back on the Colossus without being detected."}, {"tag": "h3", "text": "War with the First Order"}, {"tag": "p", "text": "Kaz took the Fireball out into battle to escort the Colossus as it fled the planet and First Order occupation. He flew around to shoot down Major Vonreg."}, {"tag": "p", "text": "Shortly afterward, as the station launched into hyperspace, Xiono and Yeager were assigned by Captain Doza to Ace Squadron."}, {"tag": "h3", "text": "Re-supplying"}, {"tag": "p", "text": "With the Colossus critically low on supplies, the crew was forced to stop at Celsor 3. The initial attempt to harvest the jakoosk by the Warbird gang failed; Xiono and Torra Doza took their ships down to the moon themselves. The Fireball and Blue Ace were stolen by surviving pirates, however the two pilots were able to kill the creature and return to the station."}, {"tag": "p", "text": "Later, while at a rendezvous point, they were ambushed by Commander Pyre's Star Destroyer. The Aces fought off First Order TIEs. One almost shot down the Fireball, but Torra Doza was able to destroy it. They then escaped."}, {"tag": "h3", "text": "Battle of Exegol"}, {"tag": "p", "text": "In 35 ABY, the Fireball, along with Jarek Yeager's racer and Blue Ace, was among a fleet of 14,000 starships assembled by Lando Calrissian and Chewbacca to help assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol. Kaz flew the Fireball during the battle and reported in at its start."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Fireball is Kazuda Xiono's craft in the 2018 animated series Star Wars Resistance. It was designed by veteran Star Wars modelmaker Bill George, developed as a cross between a T-65B X-wing starfighter and a Chance-Vought F4U Corsair, an American naval fighter from World War II."}, {"tag": "p", "text": "A full-scale model of the ship was built for the 2018 New York Comic Con."}, {"tag": "p", "text": "The ship also appeared in the film Star Wars: Episode IX The Rise of Skywalker, as confirmed by Neal Scanlan in an interview with Yahoo. The Fireball was among the ships modeled by ILM and included the end battle of film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}