{"url": "Firefight_at_the_Blue_Star_casino", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Morshdine sector", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Firefight at the Blue Star casino"}, {"tag": "p", "text": "The Firefight at the Blue Star casino was a skirmish between Han Solo and several forces under the command of the Columi brothers, Craitheus and Marvid Qreph, who were attempting to claim a one million credit bounty on Solo"}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In 45 ABY, the Columi brothers, Craitheus and Marvid Qreph were attempting to arrest financial control of the lucrative Chiloon Rift. However, they came into conflict with Lando Calrissian, who refused to sell his holdings in the rift. Determined to drive Calrissian away, the Qrephs attempted to kill Calrissian and his companions, Han and Leia Organa Solo. Although the Qrephs organized the destruction of Calrissian's refinery on the planet Sarnus, they failed to kill their targets. To escape, Calrissian and the Solos made their way to Valnoos on the recommendation of Calrissian's associate, Dena Yus, who was a secret agent of the Qrephs. The group headed to the Blue Star casino, unawares that it had been recently purchased by the Qrephs who were ready for their arrival. To ensure at least the capture of Solo, the Qrephs had also placed a one million credit bounty on Solo"}, {"tag": "h2", "text": "The skirmish"}, {"tag": "p", "text": "As Calrissian and Solo gambled in a sabacc variant game known as riftwalker, Leia Organa Solo and Luke Skywalker, disguised as a Devaronian and a Twi'lek respectively, watched from afar. With Solo and Calrissian right where they wanted them, the Qrephs' agents moved in. The Mandalorian, Mirta Gev, flanked by several Mandalorian troopers entered the casino, and Mirta joined the sabacc game, hoping to get Solo to come with her peacefully. Solo, hoping that his wife and his brother-in-law would rescue him before Gev could take him offworld, agreed to go peacefully. However, as Gev was taking him into custody, Omad Kaeg, an associate of Calrissian, refused to let Solo be captured. He opened fire on the Mandalorians and the Blue Star security personnel, triggering a firefight. As blasterbolts flew across the casino, Solo attacked Dena Yus, who he had realized was a spy. In the struggle, Solo opened her purse to reveal several arachnokillers. As the creatures scattered, they began to explode in the casino, throwing the area into disarray. In the confusion, Gev grabbed Solo and made her escape."}, {"tag": "p", "text": "As Solo was about to be dragged into a Tra'kad shuttle, Skywalker and Organa Solo broke into the hangar with their lightsabers. Mandalorian troopers attempted to stop the Jedi, but they were soundly defeated, and it appeared that Gev would be unable to escape. However, the Qrephs' Force-sensitive agent, Savara Raine, used her abilities to distract the Jedi, throwing grenades at their feet. Unable to focus on Gev, the Mandalorian pulled Solo aboard her shuttle and departed Valnoos. However, the Jedi were able to throw a homing beacon on the ship beore it could escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Upon her departure, Gev brought Solo to the Qrephs on their asteroid crusher, the Ormni. However, she was unable to collect the entire one million credit bounty due to Savara Raine's claim that she had been responsible for Gev escaping. The argument was interrupted by the arrival of the Jedi in a ScragHull commando boat who had come to rescue Solo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}