{"url": "Firepath", "categories": ["Category:Legends articles", "Category:Games"], "nodes": [{"tag": "h1", "text": "Firepath"}, {"tag": "p", "text": "Firepath was a two-player game of strategy which involved moving large game pieces across a playing field consisting of a finite number of circles, called \"rings\" or \"radials,\" and these were organized into groups called \"stones\"; pieces could only move from ring to ring, but it is not known if the rules permitted a piece to move across several rings at once or only one at a time. Players made use of elaborate strategies and ruses to attempt to outwit their opponents, often by tricking them into thinking they were using one stratagem when they were in fact using another. Either player had the ability to activate columns of fire at certain rings, allowing him or her to destroy the other player's pieces, but it is not known what rules applied to the use of these flames. It was possible to lose a score of pieces without forfeiting the game."}, {"tag": "p", "text": "Known game pieces include the Cardinal, the Conjurer, and the Merchant. Known positions on the playing field include the Fool's Ring, Third Stone, the Southern Radial, Second Stone, the Traitor's Ring, Second Stone, the Beast's Ring, Seventh Stone, the Western Radial, Fifth Stone, and the Sorcerer's Ring, First Stone (it is possible that the Fool, Traitor, Beast, and Sorcerer were also pieces). Known strategies include the Surgeon's Variant and Droom's Gambit, which appear to be very similar, but may require a player to sacrifice a piece to determine which the opponent is playing."}, {"tag": "p", "text": "Darth Vader was known to be an avid player of Firepath, and was well-versed in its intricate maneuvers; his playing style was said to be marked by \"intrigue and charm\", and he frequently sacrificed pieces to draw his opponents into more vulnerable positions. He played on several occasions against Lady Dhol, who invited him to a game in her Hive Palace on Cheelit. Their game was interrupted by the arrival of Clat the Shamer, an assassin sent by the Guild of Vindicators to kill Vader for his many crimes, but the assassin, apparently not understanding the game of Firepath, foolishly stood on the playing field while using his empathic powers to try to force Vader to kill himself."}, {"tag": "p", "text": "Instead of killing himself, however, the Dark Lord of the Sith demonstrated his cunning by activating the column of flame at the Western Radial, Fifth Stone, and incinerating his would-be assassin. He then used the column at the Sorcerer's Ring, First Stone, to kill Lady Dhol, who had invited him to Cheelit in order to lure him there so that the Shamer could kill him. Since Vader and Dhol had played against one another before, it can be safely assumed that games of Firepath did not usually end with the death of one of the players."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}