{"url": "Firmus_Kett", "categories": ["Category:Legends articles", "Category:Business owners and executives", "Category:Captains", "Category:Individuals of unspecified species", "Category:Males", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Firmus Kett"}, {"tag": "p", "text": "Firmus Kett was a Captain in the Defense Force of the Trade Federation in the final century of the Galactic Republic. He was the great-great-great-grandson of Findal Kett, who in 214 BBY had made the family company, Kett Shipping, a subsidiary of the Trade Federation."}, {"tag": "p", "text": "The Kett family had been controlling the shipment of ore and nova crystals out of Cotellier and throughout the Rseik sector for centuries before Firmus' time. Kett transports moved up the Sanrafsix Corridor to Kabal, where the ore and crystals were sold on for export to the Inner Rim or the Expansion Region. The transports would then return to Cotellier with grain or agricultural supplies. The company made the Ketts relatively wealthy, and Firmus controlled the family's ancestral holdings, investments on Ma'ar Shaddam and Rseik proper, and a holiday retreat on Z'trop."}, {"tag": "p", "text": "Firmus attributed the family's success to the Trade Federation, in particular Findal Kett's decision to make Kett Shipping a subsidiary. Firmus disliked the policies of the Neimoidians who had since come to dominate the Trade Federation, in particular their control of the ore and crystal trade, and their role in the shipment of illegal spice. He accepted that the Tamarin and Rseik sectors were effectively Trade Federation vassals, and admitted to having followed orders in the TDF that he was not proud of. However, he was well aware of the intense piracy that had plagued the region before the Trade Federation arrived, and had no confidence in the Galactic Republic to maintain order should the Trade Federation leave."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Findal Kett was supposed to be first mentioned in The Essential Guide to Warfare, a sourcebook released in 2012 written by Jason Fry and Paul R. Urquhart. The piece was intended to illustrate the initial positive influence of the Trade Federation that had allowed it to amass so much power by the time of the events of The Phantom Menace. However, it was ultimately cut from the final product for being both uninteresting and excessively focused on the minutiae of the Expanded Universe. The section was later published as part of Star Wars: The Essential Guide to Warfare Author's Cut, a series of articles published on the StarWars.com blog starting in 2013."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}