{"url": "Firrerre/Legends", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:New Republic planets", "Category:Sugai sector planets", "Category:Waterworlds", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Firrerre"}, {"tag": "p", "text": "Firrerre was a planet located in the Firrerre system in the Outer Rim Territories. Its sole sentient indigenous species were the near-extinct Firrerreo."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Firrerre's terrain formerly consisted largely of mountains and waterfalls. From space, it appeared that a large area of the planet was covered by oceans. It was also the homeworld of the mishalopes, who once thrived in the mountains and trees near the Grand Falls. The planetary capital was situated beside a waterfall and its buildings including the government center, a school and a church. A spaceport was also located near the capital."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to the arrival of the Galactic Republic and Galactic Empire, the Firrerreos were divided into a rigid clan society where uttering another Firrerreo's name was believed to give the speaker power over the subject."}, {"tag": "p", "text": "During the height of the Empire, two Force-sensitive Firrerreos, Hethrir, and his mate, Rillao, became students of the Sith Lord Darth Vader."}, {"tag": "p", "text": "To reward his service to the Empire, Hethrir was awarded the title of Procurator of Justice. His actions while holding that post included condemning \"treasonous\" member worlds by interning their inhabitants in suspended animation onboard sublight \"passenger freighters\" and sending them off to colonize distant worlds beyond the rim of the galaxy for Imperial purposes."}, {"tag": "p", "text": "In an attempt to prove his loyalty towards the humanocentric Imperial leadership, he committed his most cruel and atrocious action by condemning his own homeworld and most of his people to death. A few years before the Battle of Yavin, thousands of adult Firrerreos were abducted and taken onboard passenger freighters while millions more were left behind on Firrerre. Aboard the departing ships, these Firrerreos were forced to watch helplessly as Galactic Emperor Palpatine's elite Starcrash Brigade released a lethal strain of hive virus which wiped out all forms of life on the planet over a period of a few days. This plague would eat its way through the bodies of its victims while they were alive. To prevent the plague from spreading offworld, the planet was quarantined by the Empire."}, {"tag": "p", "text": "The remaining few thousand Firrereos were kept in suspended animation onboard these passenger freighters which would travel across the depths of space at sublight speeds to colonize new worlds beyond the rim of the Galaxy for Imperial purposes. Hethrir believed that both he and the Empire would last a thousand years. After a thousand years, Hethrir planned to return to those freighters and awake their prisoners from their sleep, in the hopes that they would remember him as an all-powerful god whom they had to obey."}, {"tag": "p", "text": "With the defeat of the Galactic Empire at the Battle of Endor in 4 ABY, Hethrir lost his position as Procurator of Justice due to the deterioration of Imperial power. He then tracked down all the passenger freighters he had dispatched into deep space. After having them towed to a classified location, Hethrir would visit these freighters from time to time to select captive children to sell into slavery or indoctrinate into servants of his Empire Reborn."}, {"tag": "p", "text": "Disgusted by her husband's actions, Rillao spirited herself away to a remote world along with their unborn child Tigris. Unfortunately, he eventually caught up with her and incarcerated her in a torture web onboard one of his freighters. Hethrir took Tigris away in order to make him the heir of his Empire Reborn. Earlier, Darth Vader had high hopes for turning him to the dark side. Unfortunately, the boy possessed no Force powers and was relegated to a lowly servant."}, {"tag": "p", "text": "In 14 ABY, New Republic Chief of State Leia Organa Solo discovered Hethrir's freighters and their \"living cargo\" while searching for her three kidnapped children who had been abducted during a meeting on Munto Codru. Boarding the nearest freighter, she quickly discovered that all the prisoners were of Firrerreo descent. She managed to free Rillao from her years of torment and the pair departed the freighter onboard her personal yacht Alderaan. In the process, they also freed another Firrerreo who refused to leave even though the freighter would take decades to reach another world at sublight speed because he would not abandon his people."}, {"tag": "p", "text": "The planet was later taken by the Yuuzhan Vong during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}