{"url": "Firrerreo_Genocide", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Sugai sector", "Category:Battles of the early Imperial campaigns", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Firrerreo Genocide"}, {"tag": "p", "text": "The Firrereo Genocide was initiated by the Galactic Empire through the Procurator of Justice Hethrir to wipe out all life forms on the planet Firrerre, particularly the sentient Firrerreo."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "A remote planet in the Outer Rim Territories, Firrerre was far from the Core Worlds, where the politics of the Galaxy were shaped. During the height of Palpatine's Galactic Empire, two Force-sensitive Firrerreos, Hethrir, and his mate Rillao, became students of the Sith Lord Darth Vader. Due to his loyalty, Hethrir was awarded the title of Procurator of Justice, though Rillao remained ever in the light despite the darkness of her teacher, who seemed to neither notice nor care."}, {"tag": "p", "text": "Hethrir's actions while holding the post included condemning \"treasonous\" Imperial worlds by interring their inhabitants in suspended animation aboard sublight-driven \"passenger freighters\", sending these ersatz colony ships off to resettle on distant worlds beyond the rim of the galaxy. To prove his loyalty towards the Humanocentric Imperial leadership, Hethrir condemned his own homeworld and most of his people to death. It is unknown whether the Firrerreo people or their government had been critical of the Empire's policies."}, {"tag": "h2", "text": "Details"}, {"tag": "p", "text": "Several years before the Battle of Yavin, thousands of adult Firrerreos were abducted and taken aboard passenger freighters while millions more were left behind on Firrerre. While imprisoned on the departing ships these Firrerreos were forced to watch helplessly as Emperor Palpatine's elite Starcrash Brigade released a lethal strain of hive virus, the result of which wiped out all forms of life on the planet over a period of only a few days. This plague would eat its way through the bodies of its victims while they were still alive, producing great pain and anguish in those afflicted. To prevent the plague from spreading offworld, the planet was quarantined by the Empire."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The remaining few thousand Firrereos were kept in suspended animation aboard these passenger freighters which would travel across the depths of space at sublight speeds to colonize new worlds beyond the rim of the Galaxy, though whether or not this was for Imperial purposes remains unclear. Hethrir believed that both he and the Empire would last a thousand years; after such a time had passed he planned to return to those freighters and awaken the prisoners from their sleep in the hope that they would remember him as an all-powerful god whom they had to obey."}, {"tag": "p", "text": "With the defeat of the Galactic Empire at the Battle of Endor in 4 ABY, Hethrir lost his position as Procurator of Justice due to the deterioration of Imperial power and prestige. He then tracked down all of the passenger freighters he had dispatched into deep space. After having them towed to a classified location, Hethrir would visit these freighters from time to time to select captive children to sell into slavery or indoctrinate into the service of his Empire Reborn."}, {"tag": "p", "text": "Disgusted by her husband's actions, Rillao spirited herself and her unborn child Tigris to an unknown world. Unfortunately the Procurator would eventually catch up with her, incarcerating her in a torture web aboard one of his freighters. Hethrir took Tigris away in order to make him the heir of his Empire Reborn, however, it was not to be. When he had taken Hethrir and Rillao, Darth Vader had had high hopes that the couple would produce an offspring strong in the Force. Unfortunately the boy possessed no talent with the Force; thus he was relegated to serve his father as a servant, completely unaware that the man he served was his father and of what he had done."}, {"tag": "p", "text": "In 14 ABY, New Republic Chief of State Leia Organa Solo discovered Hethrir's freighters and their \"living cargo\" while searching for her three children who had been abducted by Hethrir during a diplomatic conference on Munto Codru. Boarding the nearest freighter, she quickly discovered that all the prisoners were Firrerreo. She managed to free Rillao from her years of torment and the pair departed the freighter aboard Leia's personal yacht Alderaan. In the process they also freed another Firrerreo, who refused to leave even though the freighter would take decades to to reach another world at sublight speeds, stating that he would not abandon his people."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}