{"url": "First", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Slaves", "Category:Unidentified females", "Category:Unidentified humans"], "nodes": [{"tag": "h1", "text": "First"}, {"tag": "p", "text": "\"First\" was the name given to a female Human by Sith apprentice Vestara Khai. Once a slave from B'nish, the girl stowed away aboard a Damorian s18 light freighter around 41.5 ABY. However, the starship fell under attack by the Sith Meditation Sphere Ship and was forced to make an emergency landing on a nearby planet. On the surface, the girl encountered Sith apprentice Vestara Khai, who killed the girl with her parang. When Ship told Khai to name the girl, Khai chose the name \"First,\" as Khai hoped the girl would be the first of many kills."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female Human girl was a slave from B'nish for some time, acquiring several scars at a young age. When a Damorian s18 light freighter came to B'nish around 41.5 ABY, the girl seized her chance and, with the help of the starship's pilots, stowed away aboard the vessel, wearing just a single tattered garment covering her from her shoulders to her knees."}, {"tag": "p", "text": "After departing the planet of Eriadu, however, the ship fell under attack by the Lost Tribe of Sith from the planet Kesh and their Sith Meditation Sphere, Ship. The sphere opened fire with its weapons, and the freighter, heavily damaged, was forced to crash-land on a nearby planet for repairs. In the rough landing, the girl suffered a wound on her head and was knocked unconscious. When she awoke, she encountered Vestara Khai, an apprentice of the Lost Tribe. The girl, seeing an activated lightsaber in the apprentice's hand, begged for her life, and offered Khai the cargo aboard the ship, promising that nobody would ever know if Khai allowed her to escape, as her name was not on any crew roster. Khai, however, told the girl that she would have to kill her and offered her a painless death if the girl knelt in cooperation. The girl broke into tears and declared that her life was her own, and that she was no longer anybody's servant. She attempted to escape, but Khai threw her glass parang at the fleeing girl, killing her instantly. As Khai approached the girl, wondering what her name might have been, Ship told Khai to name the girl herself. After a moment's thought, Khai named the girl \"First,\" as she was the first of many whose lives the Sith apprentice hoped to take."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Though a slave, the blue-eyed girl \"First\" had an affection for life. She longed to live a life of her choosing, in which she would not have to respond to the orders of others. When the Sith Vestara Khai threatened the girl with her lightsaber, First offered Khai the cargo from the freighter and begged the Sith to spare her life. While frightened to the point of tears by the knowledge that she was about to die, First showed the strength and resolve to live her last moments as a free being, refusing to kneel when instructed to do so. Instead, the girl ran, and while Khai killed her, the disturbance her death triggered in the Force was enough to stop the Sith's breath, as the girl held a passion for life that Khai had never before encountered."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First, whose actual name has not yet been canonically provided, was indirectly mentioned in Christie Golden's 2010 novel, Fate of the Jedi: Allies, the fifth novel in the Fate of the Jedi series. She later appeared in Golden's short story \"First Blood,\" which was published in the 125th issue of the Star Wars Insider magazine. The short story, illustrated by Brian Rood, contains an image depicting Khai standing over First's corpse."}, {"tag": "p", "text": "While First claims that she was from B'nish, and the ship carrying First had departed Eriadu, neither Allies nor \"First Blood\" confirms the name of the planet on which First's ship was forced to land."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}