{"url": "First_Battle_of_Omonoth", "categories": ["Category:Legends articles", "Category:Battles in the Inner Rim", "Category:Battles of the Mandalorian Wars"], "nodes": [{"tag": "h1", "text": "First Battle of Omonoth"}, {"tag": "p", "text": "The First Battle of Omonoth, also known as the Adasca affair or Project: Black Harvest, was fought during the Mandalorian Wars in the year 3963 BBY. It was a three-way skirmish between the Galactic Republic, the Mandalorian Neo-Crusaders, and the security forces of Adascorp. The battle took place in the Omonoth system aboard the Arkanian Legacy, the flagship of Adascorp."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Arkoh Adasca, the chairman of Adascorp, had set up a bidding war between the Republic and the Mandalorians for a biological weapon system that his company had developed. Years earlier, Adasca's family had found a nest of hibernating exogorths in the system. With the aid of the Arkanian Offshoot scientist Gorman Vandrayk, Adasca managed to weaponize the massive creatures. By playing the Mandalorians against the Republic, he hoped to increase his own power and that of his species, but his plan failed."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Unbeknownst to the rest of Adasca's guests, he held old friend, Jedi Master Lucien Draay and his fugitive Padawan Zayne Carrick in his brig. Working together, the two Jedi managed to break free and they formed a temporary alliance. With the aid of the renegade Mandalorian Rohlan Dyre and Carth Onasi, a lieutenant in the Republic Navy, they worked to put an end to Arkoh Adasca's scheme. While Mandalore the Ultimate and Saul Karath bargained for their respective factions, the relatively peaceful meeting suddenly degenerated into a battlefield. Zayne and his accomplices tricked the Mandalorians into believing that Adasca planned to assassinate Mandalore. Believing that he had been betrayed, Mandalore the Ultimate stormed from the meeting and his forces opened fire."}, {"tag": "p", "text": "Amidst the resulting chaos, the scientist Gorman Vandrayk suddenly turned on his employer and directed his creations to attack the Arkanian Legacy. The vessel was heavily damaged by the exogorths and Arkoh Adasca was killed. Before the creatures could destroy the vessel, Vandrayk called them off and led them into deep space where no one was likely to find them. Meanwhile, both the Mandalorians and the Republic military officers fled the gutted vessel. Zayne and his companions fought their way through waves of enemies and managed to escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "In the aftermath of the battle, both Mandalorians and Republic forces attempted to salvage what remained of the Arkanian Legacy. This resulted in a clash between the two sides which inevitably led to neither able to take what remained of the massive flagship."}, {"tag": "p", "text": "Almost four thousand years later, Arkanian professor Nasdra Magrody alluded to the exogorth project and its results, which was by that time ancient and obscure history, while in a HoloNet panel discussion on the origins and function of a secret weapon deployed by the Separatists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}