{"url": "First_Battle_of_Obroa-skai", "categories": ["Category:Legends articles", "Category:Battles of Obroa-skai", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "First Battle of Obroa-skai"}, {"tag": "p", "text": "The First Battle of Obroa-skai during the Yuuzhan Vong War was a major victory for the Yuuzhan Vong forces. The capture of the world known for its immense libraries and wealth of galactic knowledge was crucial in providing the invaders with key intelligence and information on the various species and worlds of the galaxy."}, {"tag": "h2", "text": "Pre-battle"}, {"tag": "p", "text": "During the Yuuzhan Vong assault of the Hydian Way, the New Republic forces were defeated at Corsin. They retreated to Contruum and the Vong pursued them along the Vaathkree Trade Corridor. The planet Kroctar surrendered but Obroa-skai didn't."}, {"tag": "p", "text": "Despite the fact that Obroa-skai's library was one of the most important assets to the New Republic government, defenses at the world were minor in the lead up to the battle. Despite the pleading of the Obroan Institute and its director, Bel-dar-Nolek, the world's defenses consisted of only a pair of reconditioned Golan Defense Platforms and a handful of antiquated warships. These forces would be woefully inadequate in defending Obroa-skai from attack."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "The battle was presumably quick, as the meager New Republic defenses were shattered by the Yuuzhan Vong invasion forces. The pair of Golan platforms and handful of warships were brushed aside as Yuuzhan Vong forces settled into an orbital bombardment. A quartet of X-wing fighters were among the only forces to escape the battle, managing to destroy a Yuuzhan Vong gunship before retreating."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Normally a world appearing green, blue, and white from space, Obroa-skai turned ash-gray and reddish-brown as Yuuzhan Vong warships laid waste to the world. Large tracks of verdant rainforest were turned to ash while the planet's glaciers and small oceans were vaporized. The few major cities were bombarded and eventually conquered as Yuuzhan Vong warriors captured scientists and researchers for sacrifice. The planet and its libraries then passed into the possession of the Priest caste, which was tasked with translating the various texts into Yuuzhan Vong."}, {"tag": "p", "text": "The loss of Obroa-skai shocked the galaxy, while further driving a wedge between New Republic worlds located in the invasion path and those safely located in the Core Worlds. The New Republic Senate began to blame the New Jedi Order while some members began to contemplate a separate peace with the invaders."}, {"tag": "p", "text": "The Yuuzhan Vong also captured several capital ships in dry dock and gave them to the collaborationist Peace Brigade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}