{"url": "First_Battle_of_Javin", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Javin sector", "Category:Battles of the Mugaari Campaign"], "nodes": [{"tag": "h1", "text": "First Battle of Javin"}, {"tag": "p", "text": "This first battle of Javin was a minor battle shortly after the Battle of Hoth in 3 ABY."}, {"tag": "h2", "text": "The prologue"}, {"tag": "p", "text": "Following the capture of BFF-1 bulk freighter Onece 3, the Imperials realized that the Rebels would retaliate by destroying Outpost D-34, so they sent three TIE/LN starfighters from Alpha, Beta, and Gamma squadrons. They were to patrol the station and hold of any Rebel attack until the Imperial-class Star Destroyer Hammer, under the command of Admiral Flanken would arrive to relieve them. Flanken planned to not arrive until much later believing that the initial attack was either a feint or they're testing the situation, once they would commence the full force he would hit them with full power."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "A series of BTL Y-wing starfighters, starting with Petdur, Gold, and Laire squadrons, attacked the outpost. The Mugaari pirates Y-wings went for the fighters while the Rebel Y-wings launch torpedo attacks onto the outpost. All of the Y-wings were destroyed however by the stations TIE pilots in the TIE Fighters, including Maarek Stele. Soon afterward, a couple of X-wing starfighters, which consisted of Derk and Blue squadrons, attacked the station, which were also destroyed in the attempt. Stele then spotted Rebel officers in the Scutz, a stolen shuttle, who were trying to flee through the system he then identified it and three Assault Gunboats were sent to disable the shuttle. When it was, a stormtrooper transport then boarded the shuttle and the Rebel officers were soon captured by the Imperials. During this, two more Y-wings from Red Squadron attacked the station but were also destroyed."}, {"tag": "p", "text": "When the Hammer arrived, the Rebel Ubote group, consisting of three CR90 corvettes, also came to intervene. The Hammer then sent TIE/sa bombers to help the station's defenses destroy them. Maarek Stele kept his distance as he knew his TIE Fighter was no match for the corvettes."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Imperials successfully thwarted the Rebel attack and captured some Rebel officers at the same time. They soon traced the attack to a Mugaari cargo loading area in the Tungra sector where they would then decide to counterattack the pirates and the Rebels."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This is Battle 1, mission 2 in the game."}, {"tag": "p", "text": "This is the storyline of the mission following \"medium\" difficulty. In hard difficulty the Mugaari fighter squadrons will have two fighters instead of one. Also the Rebel Y-wings may have space bombs instead of proton torpedos."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}