{"url": "First_Blood_(short_story)", "categories": ["Category:Real-world articles", "Category:Legends short stories from Star Wars Insider"], "nodes": [{"tag": "h1", "text": "First Blood  (short story)"}, {"tag": "p", "text": "\"First Blood\" is a short story written by Christie Golden. It appeared in Star Wars Insider 125 and featured the Sith apprentice Vestara Khai. It was later reprinted in Star Wars Insider Special Edition 2013."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The short story starts with Sith apprentice Vestara Khai standing with her master as Ship announced those who would be following him to find a vessel. Those that would accompany were: High Lord Sarasu Taalon, Lord Ivaar Workan, Lady Olaris Rhea, Saber Ruku Myal and Vestara. Ship continued to instruct the five to follow."}, {"tag": "p", "text": "After a brief conversation with Myal and Taalon, Ship informed them that a Damorian S18 light freighter was en route from Eriadu and that the ships cargo would aid the Sith. After deciding to damage the ship and force it to land, Ship ordered Taalon and the Sith to control him. Taalon, using the Force, commanded Ship to attack the ship while using an impressive array of weaponry to do so."}, {"tag": "p", "text": "When Ship arrived on land, the Sith discovered that the crew had already fled. The Sith followed the footprints while deliberating on the fact that the crew would be armed. The footprints split off in two separate directions. Much to Vestara's annoyance, she was split with her master who would travel with Taalon. Vestara then traveled with the two other Sith until they reached open terrain. The matter of keeping the crew alive came up, but was quickly suppressed by Workan who thought it was best to eliminate all witnesses. The group came across a tree thats movements were unnatural. Workan used his parang and killed a Sullustan male pilot who was hiding in the tree. The three Sith felt immediate danger and came across the Sullustan's friend. Myal killed the crewman while the other two Sith defended. Taalon contacted the group to tell them he had found the rest of the crew and, much to Vestara's embarrassment, asked for the two Sith. Vestara was instructed to return to the frigate and begin to catalog its contents. She quickly returned to the frigate but, as she approached the ship, Vestara felt the presence of another. A human girl that was badly injured revealed herself as a stowaway and not a part of the crew and was escaping from B'nish. Vestara knew she would have to kill the girl and, even after her many pleas, would not listen. The girl attempted to escape, but Vestara shot her down with her parang. Vestara, who was suffering from the knowledge of what she did, was pestered by Ship to name the girl. So Vestara did, she was named First."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}]}