{"url": "17,000_BBY", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Years in the Indecta era"], "nodes": [{"tag": "h1", "text": "17,000 BBY"}, {"tag": "p", "text": "The year 17,000 before the Battle of Yavin (BBY) was a span of time in the Galactic Republic's Indecta Era that occurred during the First Alsakan Conflict. During the conflict, which had begun eighteen years previously, Arkanian scientists, who were seeking to perform genetic experiment on sentient species, discovered the primitive Xexto on Troiken. The Arkanians took a sample of the species and moved them to nearby Quermia, where both groups were experimented upon."}, {"tag": "h2", "text": "Proem"}, {"tag": "p", "text": "The Great Manifest Period of the Galactic Republic was a time of expansion within the then-known galactic community. Planetary governments and corporate interests were rapidly expanding into the Slice in order to claim new worlds for settlement and exploitation of natural resources. In the northern portion of this region, near the Perlemian Trade Route, the planets of Alsakan and Coruscant were fervently competing against each other, with hostilities brewing as the two planets fought for dominance economically and culturally. Furthermore, the Republic's bureaucracy and politicking grew with fervor, fueling the rivalry as sectors of the galaxy had become so large that they were ungovernable. The growing governmental structure included the creation of the Bureau of Ships and Services more than one thousand years prior to the conclusion of the Great Manifest Period. This organization was created to help regulate interstellar trade as well as to maintain records of starship transactions and movements. Furthermore, the intensifying strife between Alsakan and Coruscant had reached a boiling point. Initially, the conflict started as a blockade. Soon thereafter, however, the event escalated into actual fighting. An outright civil war was only avoided by legislation passed by the Bureau of Ships and Services. With legislation in place, the specific conflict settled. Nevertheless, economic advantages in the Expansion Region were not the only motivating factors for open war. Alsakan also desired to usurp the seat of government from Coruscant, believing it to be their deserved place in the galaxy. As a result, the motivations behind the fighting went unresolved. Open warefare began in 17,018 BBY with the Republic assault and capture of Virujansi."}, {"tag": "h2", "text": "The galaxy in 17,000 BBY"}, {"tag": "p", "text": "While the Republic was busied with the First Alsakan Conflict, the arboreal hunter-gatherer Xexto species of Troiken was discovered by rogue scientists from Arkania. The scientists sought to perform genetic experimentation on sentient species outside of the Republic's borders, because such actions were illegal within Republic space. Around 17,000 BBY, the Arkanian scientists secretly took a sample of the Xexto and relocated them to the nearby planet Quermia. There, the planet was terraformed, and the transplanted Xexto became helpless subjects of genetic experimentation and manipulation. The experiments were not confined to Quermia, however, as the Arkanians also performed some experiments on those who had remained behind on Troiken."}, {"tag": "h2", "text": "Impact"}, {"tag": "p", "text": "Inside the Republic, the conflict between Alsakan and Coruscant was the first of seventeen such skirmishes between the two planets. While the Bureau of Ships and Services was able to intervene in the first Alsakan Conflict, the desire to usurp the capital coupled with the competition in the Slice caused periodic unrest until the final conflict occurred in 3017 BBY. The seventeen conflicts destroyed historical landmarks, such as Belgoth's Beacon and the Alsakan Mosaics, and laid waste to portions of the Expansion Region."}, {"tag": "p", "text": "The group of Xexto that underwent genetic experimentation on Quermia by Arkanian scientists were monitored and tested for only a few generations. At that point, the geneticists abandoned their research, fearing the wrath of the Republic. They instead turned their focus to other projects. Nevertheless, permanent alterations to the Xexto on Troiken had taken hold. On Quermia, the dramatically altered subjects were left to develop within the natural processes, and they became the Quermian species. Both the Xexto and Quermians became technologically-developed societies independent of each other. After both species were discovered by the broader galactic community, it became a commonly held belief that they were genetically related. The connection between Quermians and Xexto was discovered millennia after their forced genetic divergence, but the Xexto initially refused to acknowledge it. Eventually, however, they reluctantly accepted what genetic tests had verified."}, {"tag": "h2", "text": "Notable events"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The year 17,000 BBY is first mentioned in the Ultimate Alien Anthology, a Wizards of the Coast roleplaying game sourcebook published in April 2003. This established that around 17,000 BBY the Quermian and Xexto species had diverged because of genetic experimentation and asserted the role of Arkanian scientists in the matter. The year received a passing mention two years later in The New Essential Chronology. Here, the starting date for the Alsakan Conflicts was established as 17,000 BBY. The Quermian and Xexto also received a mention in this source. 17,000 BBY received direct mention in The Complete Star Wars Encyclopedia under the entries \"Quermian\" and \"Xexto,\" as well."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}