{"url": "First_Galactic_Alliance_Chief_of_State_election_(44_ABY)", "categories": ["Category:Legends articles", "Category:Changes of government"], "nodes": [{"tag": "h1", "text": "First Galactic Alliance Chief of State election  (44 ABY)"}, {"tag": "p", "text": "The first Galactic Alliance Chief of State election of 44 ABY occurred following the collapse of the caretaker Triumvirate government that briefly held power following a coup that removed controversial Chief of State Natasi Daala from power."}, {"tag": "p", "text": "It was widely assumed that Daala's former Chief of Staff Wynn Dorvan, who had served as a Triumvir in the caretaker government, would be elected unopposed. However, members of the Lost Tribe of Sith managed to infiltrate the upper echelons of the Alliance government, with many members impersonating Senators from newly accepted Alliance member worlds. When the Galactic Alliance Senate met to elect Dorvan as Chief of State, Senator Kameron Suldar (actually Sith High Lord Ivaar Workan in disguise), addressed the Senate and accused Dorvan of being irrevokably associated with the Daala administration in the public conscience, and would therefore be unable to perform the affairs of state effectively."}, {"tag": "p", "text": "Workan nominated newly elected Klatooinian Senator Padnel Ovin, a career soldier with little political experience, as an alternative candidate to Dorvan. The Senate debated the two candidates for a total of twelve hours before Ovin finally achieved the three quarter majority required to form government."}, {"tag": "p", "text": "Ovin realized that he was nominated merely due to his lack of political savvy and the assumption that he would be easily controlled and accepted the position regardless. However, he retained Dorvan as chief of staff in the hopes of utilizing his wealth of political expertize to thwart the corrupt Senators, many of whom were secretly Sith, and stabilize the fracturing government."}, {"tag": "h2", "text": "Appearances"}]}