{"url": "First_Impressions", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 15"], "nodes": [{"tag": "h1", "text": "First Impressions"}, {"tag": "p", "text": "First Impressions is a comic appearing in Star Wars Tales 15 and collected in Star Wars Tales Volume 4."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Senator Bail Prestor Organa, preparing to hand his Senate seat over to Leia Organa, brings her to Coruscant for the first time. Her father allows her to go off into the city with two guards. At first entranced by what she sees, Leia then witnesses a Caamasi being arrested by two stormtroopers for simply trying to buy a drink at a cafe. When she tries to intervene on his behalf, the stormtroopers nearly arrest her as well."}, {"tag": "p", "text": "Back at the apartment, Leia fumes to Bail, and says that she'll bring it up to Palpatine when she meets him at a reception being held at the Imperial Palace that night. Bail tries to dissuade her, saying that doing so now would jeopardize Alderaan when, once she is a senator, she will have the ability and power to try to make changes. Leia refuses to be deterred."}, {"tag": "p", "text": "At the Palace, Leia is appalled at how deferential and pandering everyone is to the Emperor, which only hardens her resolve to bring up the issue to him. When they finally meet face to face, however, Leia is struck by the pure evil radiating from him, and is unable to do anything more than mumble thanks to his compliments as Darth Vader watches."}, {"tag": "p", "text": "Following the reception, Bail assures Leia that it is nothing to be ashamed of, as that is a common reaction to seeing Palpatine, especially for the first time, and that to make changes, one must be subtle. He tells her how proud he is of her, and relates a piece of good news - he has arranged for the Caamasi she saw arrested to be released. Happy, Leia goes to meet him, and the story ends with him introducing himself as Eg'ros Akala."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The events of this story were referenced in Star Wars: The Ultimate Visual Guide and the new canon novel Moving Target: A Princess Leia Adventure."}, {"tag": "p", "text": ""}]}