{"url": "First_Mission_to_Ralltiir", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Battle stubs", "Category:Battles of Ralltiir", "Category:Sith missions"], "nodes": [{"tag": "h1", "text": "First Mission to Ralltiir"}, {"tag": "p", "text": "As a test of his recently completed training, Sith Lord Darth Maul was sent by his Master, Darth Sidious, on a mission to Ralltiir to exterminate the leadership of the Black Sun criminal syndicate."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "After defeating a legion of Black Sun elite forces on Ralltiir, Maul was faced with the bodyguards of the Vigos, which he defeated easily. He then proceeded to slaughter every last Vigo residing there. After Darth Maul had decimated all of the ranks of the criminal Black Sun organization, he planned to complete his task by killing their leader, Alexi Garyn."}, {"tag": "p", "text": "Mighella, Nightsister and Garyn's personal body guard, attempted to act as her liege's last line of defense, and confronted the pursuing Sith in the bowels of Garyn fortress on Ralltiir. The two masters of the dark side then engaged each other, Mighella with her darksword, and Darth Maul with his double-bladed lightsaber. Mighella's sword eventually broke after absorbing repeated blows from the Sith Lord's weapon, at which time she blasted him with a barrage of Force lightning. Maul, however, was able to withstand the Nightsister's assault, and proceeded to slice her in half with his lightsaber, ending both the duel and her life."}, {"tag": "p", "text": "He then killed Alexi Garyn, but not before the latter wounded him in the chest."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The only survivor to escape Maul's slaughter was the late Alexi's retainer, Oolth, who tried to get word of Maul's attack to the Jedi High Council on Coruscant. Unfortunately, he was killed by hawk-bats before he was able to reach his goal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}