{"url": "First_Order_All_Terrain_Scout_Transport", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:All Terrain Scout Transport variants", "Category:First Order vehicles", "Category:Kuat-Entralla Drive Yards products"], "nodes": [{"tag": "h1", "text": "First Order All Terrain Scout Transport"}, {"tag": "p", "text": "The First Order All Terrain Scout Transport (AT-ST) was a model of All Terrain Scout Transport walker manufactured by Kuat-Entralla Drive Yards and fielded by the First Order. Clad in next-generation reinforced composite armor, this updated design's improved gyroscopic systems made it more stable than preceding AT-ST models used by the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Although it was based on the Galactic Empire's AT-ST design, the First Order All Terrain Scout Transport possessed several modest updates. The scout walker's gyroscopic systems were improved, which stabilized its balance, and, because of new breakthroughs in lightweight materials, the AT-ST's armored shell was upgraded, along with improved weapons systems."}, {"tag": "p", "text": "Unlike the AT-STs used by the Galactic Empire, which had a separate viewport for each of the two crew members, the First Order AT-ST's cockpit had one long viewport across its front."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the First Order attacked the planet Demir, the army deployed an AT-ST to clear a path to the Demirian stronghold. Once in position, Captain Phasma ordered for her stormtroopers to stop their advance so the walker could fulfill its purpose. However, the Demirians were able to take down the vehicle, forcing Phasma to employ a different plan."}, {"tag": "p", "text": "One such AT-ST stored in the hangar of the Supremacy was hijacked by BB-8 to rescue Finn and Rose Tico from stormtroopers. AT-STs, along with First Order All Terrain Armored Transports and AAL-1971/9.1 Troop Transports, were also stored aboard the Resurgent-class Star Destroyer commanded by Agent Tierny and Commander Pyre."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}