{"url": "First_Order_Raider", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:First Order stormtrooper variants"], "nodes": [{"tag": "h1", "text": "First Order Raider"}, {"tag": "p", "text": "First Order Raiders were specialized stormtroopers used by the First Order during their war against the Resistance. Skilled hunters, they were tasked with acquiring ancient Sith artifacts by Supreme Leader Kylo Ren. In 34 ABY, a group of Raiders led by Agent Raith chased Mika Grey to Vargos 9. The archaeologist was able to escape them and later arrived on the planet Ashas Ree, in search of an ancient Sith relic. Raith and his Raiders also travelled to the planet, and captured members of Team Colossus who had come to Ashas Ree for supplies. Their attempts to interrogate their newfound prisoners were thwarted, however, when Grey unleashed the power of the Sith relic, which she had found inside a Sith Temple. The Raiders attempted to contain the relic but its activation vaporized them, and the Colossus resistance fighters returned to their ship with Grey now in tow."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "First Order Raiders were specialized stormtroopers of the First Order, who served the regime during their war against the Resistance. They were employed by Supreme Leader Kylo Ren to locate and obtain Sith artifacts, with their ranks consisting of highly-skilled hunters of a very specific variety. In 34 ABY, a contingent of Raiders under the command of Agent Raith pursued archaeologist Mika Grey to Vargos 9. Grey escaped and travelled to the planet Ashas Ree, to locate an ancient Sith relic that she hoped to prevent the First Order from acquiring. When the Raiders arrived on Ashas Ree, in search of this relic, they entered a trading outpost that housed two ancient temples of the Force: one belonging to the Jedi and the other claimed by the Sith. In the outpost, they encountered Torra Doza and Freya Fenris, alongside their accompanying droids. Unbeknownst to them, the duo were actually members of Team Colossus. Labelling them 'trespassers', the main body of Raiders captured them and attempted to conduct an interrogation outside of the duo's ship. Mika Grey's ship was also discovered and destroyed in an explosion, courtesy of the Raiders."}, {"tag": "p", "text": "Meanwhile, two other troopers were ordered by Raith to search the area further and came across four more members of the Colossus resistance. One of them, Kazuda Xiono, urged the Raiders not to open fire as they were unarmed. They were quickly escorted to the Jedi Temple's entrance and Raith's body of troopers and prisoners soon congregated there as well. Xiono stressed that they were only looking for supplies but Raith was unconvinced and demanded to know what they had found inside the Sith temple. Just then, Grey revealed herself and taunted the Raiders for their inability to catch her or acquire the relic. Raith threatened to execute the two adolescent trespassers, Kel and Eila, but Grey acted quickly. She activated the relic and proceeded to throw it as far as she could behind the Raiders' position. The prisoners ran and the troopers, aware of the danger they were in, attempted to deactivate the relic. However, they were not fast enough. The relic unleashed a powerful wave of red energy that electrified the Raiders, killing them. With their enemies defeated and the Sith relic rendered obsolete, Grey accompanied the resistance members back to their home ship, the Colossus."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like standard First Order stormtroopers, First Order Raiders were equipped with armor that could accommodate rank pauldrons. Additionally, they wielded F-11D blaster rifles."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First Order Raiders first appeared in \"The Relic Raiders,\" the seventh episode in the second season of the animated series Star Wars Resistance. They were first unveiled in the trailer for Season Two, released on the official Star Wars YouTube channel. The Raiders were a new and original design created for the show."}, {"tag": "p", "text": "In the game Star Wars: Galaxy of Heroes, The First Order Raiders have an unit portrait, but the characters themselves were excluded from the game. The Name of the portrait is: \"tex.charui_firstorder_raider\"[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}