{"url": "First_Order_jet_trooper", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:First Order stormtrooper variants"], "nodes": [{"tag": "h1", "text": "First Order jet trooper"}, {"tag": "p", "text": "First Order jet troopers, or simply jet troopers, were a stormtrooper variant in the Stormtrooper Corps of the First Order. Unlike the standard trooper, who was mostly trained in ground operations, these specialists were trained in aerial combat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like the Galactic Empire's jumptroopers, First Order jet troopers were specialized stormtroopers that were trained in aerial combat utilizing specialized armor and weaponry."}, {"tag": "h3", "text": "Variants"}, {"tag": "p", "text": "One variant was equipped with a standard stormtrooper helmet, a control box on their chest armor, F-11D blaster rifles, and jetpacks."}, {"tag": "p", "text": "This differed from Omicron Formation's jet troopers, who sported inscription in Aurebesh alongside red markings on their chest armor, with no control box."}, {"tag": "p", "text": "Another variant was equipped a similar helmet with a dark colored jetpack with straps, and could operate in space environments."}, {"tag": "p", "text": "A fourth variant existed, where the helmet was distinctly different, and troopers of the variant operated with G125 projectile launchers and chest armor likened to the second variant's that was incorporated into the armor itself, rather than an external addition. Sith jet troopers employed by the Sith Eternal military had the same armor design and function, with the distinction of plating color, in which a Sith red and black theme was prevalent."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jet troopers were active during the Cold War between the First Order and the Resistance. During a mission to Ovanis undertaken by Resistance Commander Poe Dameron and his Black Squadron to locate Lor San Tekka for information on Jedi Master Luke Skywalker's location, First Order Agent Terex deployed multiple jet troopers alongside flametroopers with unidentified flametrooper transports. Eventually, the First Order forces were defeated on Ovanis."}, {"tag": "p", "text": "Several jet troopers were involved in the rescue of Lor San Tekka by the Resistance in the Great Forveen Nebula, where they captured San Tekka and attempted to bring him aboard a First Order Light Cruiser, though they were eliminated by a Resistance retrieval squad. During the First Order/Resistance War, jet troopers and 125-Z treadspeeder bikes were deployed in the mission to Pasaana, but they were ultimately defeated by Resistance forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The trooper first appeared in the 2016 Star Wars comic book Poe Dameron 1, authored by Charles Soule and illustrated by Phil Noto. They were first identified as \"rocket trooper[s]\" in the 2017 video game Star Wars Battlefront II, before receiving the name \"First Order jet trooper\" on StarWars.com's Databank in 2019."}, {"tag": "p", "text": "With The Rise of Skywalker Update on Battlefront II, the rocket trooper's appearance and name was updated to match with the 2019 film Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "p", "text": "According to Lucasfilm Ltd.'s collections and exhibitions archivist Madlyn Burkert, the unique design of the jet trooper variant seen in Star Wars: Episode IX The Rise of Skywalker incorporates nods to unused Ralph McQuarrie designs for the snowtrooper for the 1980 film Star Wars: Episode V The Empire Strikes Back and the death troopers of the 2016 Star Wars Anthology film Rogue One: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}