{"url": "First_Order_landing_platform", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:First Order starship classes", "Category:Landing platforms"], "nodes": [{"tag": "h1", "text": "First Order landing platform"}, {"tag": "p", "text": "During the Mission to Ovanis, the First Order used a model of landing platform as a staging area to launch both TIE/fo space superiority fighters and TIE/sf space superiority fighters as well as atmospheric assault landers."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The First Order landing platform was a type of flatbed starship used for the transportation of starfighters and troops. The platform was a simple rectangular flat starship, distinguished by a pair of frontal fins and a single off-center bridge. The platform was armed with 3 ventral twin laser cannons and one twin laser cannon mounted next to the bridge. The First Order landing platform could be deployed by a larger cruiser, such as a Maxima-A class heavy cruiser."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Similar to their predecessor's aerial landing platform, the First Order's landing platform could be utilized to transport troops and various starcraft and to act as a staging area. It provided fuel and acted as a landing platform for starfighters on mountainous planets where it would otherwise be difficult."}, {"tag": "p", "text": "The platform could carry an assortment of 8 TIE/fo or TIE/sf space superiority fighters, along with an additional two AAL-1971/9.1 Troop Transport and at least 1 First Order speeder bike."}, {"tag": "p", "text": "The First Order landing platform carried a crew of at least 14."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Cold war"}, {"tag": "h4", "text": "Mission to Ovanis"}, {"tag": "p", "text": "During the Cold War, the military junta known as the First Order employed at least one of these landing platforms. Around 33 ABY, during the Resistance's mission to Ovanis, the First Order deployed this platform from the Maxima-A-class heavy cruiser, Ravenous, to the surface of Ovanis to reinforce Agent Terex during his hunt for the Resistance pilot Poe Dameron. The platform brought with it 2 TIE/fo space superiority fighters, 6 TIE/sf space superiority fighters, 2 AAL-1971/9.1 Troop Transports, 2 single-person transports, a First Order speeder bike, and a squadron of First Order Stormtroopers consisting of at least 2 Flametroopers, 8 First Order jet troopers, and 2 First Order Special Forces."}, {"tag": "p", "text": "The landing platform floated above Ovanis' rocky surface, blocking the entrance to a cave, cutting off Resistance starfighter group Black Squadron from their commander, Poe Dameron, who at the time was inside the cave negotiating with the native Crèche. Dameron was unaware of the First Order's arrival, or that Agent Terex was in puruit with a squadron of troopers. In a bid to take the landing platform for themselves and gain the upper hand, Black Squadron attacked the platform, destroying the First Order's TIE support. However, during the assault the landing platform was destroyed. The debris from the destruction blocked the opening to the Crèche cave, trapping Poe Dameron with the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The First Order landing platform made its first appearance in the 2016 debut issue of comic series Star Wars: Poe Dameron, written by Charles Soule and illustrated by Phil Noto."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}