{"url": "First_WatchCircle", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:WatchCircles"], "nodes": [{"tag": "h1", "text": "First WatchCircle"}, {"tag": "p", "text": "The First WatchCircle was a group composed of Jedi Seers within the Jedi Covenant. It consisted of five Jedi Masters, all of whom were dedicated to prevent the return of the Sith."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "Selected from a group of students trained at the Draay Estate on Coruscant; Feln, Q'Anilia, Raana Tey, Xamar, were decidedly the most potent seers of all of the students Krynda Draay had trained. Her own son, Lucien, was the Hand, a position that was suggested by Haazen, Krynda's retainer. He was responsible for handling arrangements, protection, etc. After being knighted, these five Jedi were often grouped together at the same postings. This was done in no small part due to the Covenant's machinations so the four Seers of the group could work closely together."}, {"tag": "p", "text": "Although the Covenant was a secret society that acted separately from the Jedi High Council; the First WatchCircle's members were in the Order, and did have to answer to the newly formed Council if they wished to maintain their secrecy. All the while, they would teach their students that it is the Jedi's duty to prevent the return of the Sith."}, {"tag": "h3", "text": "Assignment on Taris"}, {"tag": "p", "text": "The group was positioned on Taris during the Mandalorian Wars at the Jedi Tower there. The Jedi High Council assigned them Padawans, much to the displeasure of the five masters who agreed they needed to be focused on their assignment of locating the Muur Talisman, an ancient artifact located somewhere on Taris."}, {"tag": "p", "text": "While meditating on the Rogue Moon, the four seers had a vision of the return of the Sith and the ruin of the Jedi Order. Believing that one of their Padawans would become the Sith from their visions they decided to eliminate the threat by murdering their Padawans at their knighting ceremony. However, due to Lucien's Padawan, Zayne Carrick's tardiness, the plan did not go completely as planned. Q'Anilia's Padawan Shad Jelavan began to question the Masters on why Zayne would be knighted, forcing them to execute the four student present. Zayne arrived at that moment and was able to escape. Blaming Carrick publicly as the murderer, the WatchCircle placed a bounty on the surviving Padawan. After repeated attempts and failures at capturing Carrick; the High Council recalled the five to Coruscant in an attempt to maintain control of the situation."}, {"tag": "h3", "text": "Separation anxiety"}, {"tag": "p", "text": "Upon meeting with the Jedi High Council, the Masters were quickly admonished for their lack of aptitude in not only training their Padawans responsibly and well, but for not sensing the darkness in Zayne. When Master Lucien requested that he and his fellow Masters be allowed to spearhead the search for his former Padawan, Master Vrook Lamar adamantly ordered to the contrary."}, {"tag": "p", "text": "Master Vrook had grown suspicious of the group over time, not knowing their true allegiance. He had come to find it strange that, regardless of where they were, these five Masters kept ending up together. Resolving this matter, Master Vrook inadvertently dissolved the First WatchCircle when he reassigned each of the five Masters to different postings around the galaxy."}, {"tag": "p", "text": "Although separate, the five masters maintained contact. With Raana Tey on assignment to the Chancellor, Q'Anilia working to aid refugees from the War, and Lucien on working to aid Haazen and the Covenant, the group was growing greatly ineffective. Raana began to have a relapse of terrible nightmares rendering her useless as a seer."}, {"tag": "p", "text": "Believing Zayne was dead after the Courageous's destruction, Draay was informed by Haazen that Arkoh Adasca, now the owner of Adascorp, was behind a sinister plot. Lucien was ordered to investigate the situation and discover the source of the dark power. Meeting with Arkoh on board his flagship, the Arkanian Legacy, Arkoh drugged Lucien, putting him into a coma. Finding himself stuck with his thought-dead Padawan, Zayne Carrick the two were forced to work together to escape; though Lucien attempted to kill Carrick, he was forced to flee before he succeeded."}, {"tag": "p", "text": "On Taris, the Mandalorians, led by Cassus Fett, had already besieged the planet. Raana Tey managed to locate the missing senator Haydel Goravvus who was leading the Taris Resistance. Tey manipulated Shel Jelavan, sister of deceased Shad Jelavan and ordered her to find Carrick and to extract revenge on him for murdering her brother, Shad. After being betrayed by Shel at the Jedi Tower, Raana attempted to stop Zayne from escaping by leaping onto the roof where she was greatly injured. The tower was destroyed, along with Raana herself when Marn Hierogryph detonated explosives at the base."}, {"tag": "p", "text": "While holding Raana's funeral on Coruscant, the WatchCircle had a vision involving the Muur Talisman, and intelligent rakghouls who could use weapons and ships. According to Zayne and three others, one dark armored, a calm one and a pirate, everything is happening now. Concluding that if Zayne finds the Talisman, he would sink even more into the dark side, Lucien sent Covenant Shadow Celeste Morne to recover the Talisman."}, {"tag": "p", "text": "Haazen later used his resources to put Lucien on the Jedi High Council in order for the Shadows to move about freely. After his appointment, Haazen tells Lucien that Morne had arrived at Odryn. Feln went back his home planet where the Covenant was secretly testing Sith artifacts to meet up with Celeste only to find Zayne and Gryph captured by the Feeorins. Suspecting that Zayne killed Celeste and was further corrupted by the Talisman, Lucien ordered Option Ossus: destroy the Sanctum of the Exalted. However, Haazen interjected, not wanting to lose such a valuable station. After a holography argument, Feln decided to pummel Zayne into pulp. But when Zayne's allies returned to pick him up, Feln misinterpreted it as a raid and destroyed the Sanctum. However, this also destroyed the village below, angering the villagers, who butchered him to death."}, {"tag": "h3", "text": "The breaking of the Circle"}, {"tag": "p", "text": "After Feln's death, Lucien had Master Xamar assigned to the Republic Navy. Xamar complied reluctantly, having remembered that in his part of the Rogue Moon Prophecy, he was killed by Republic fire. However, Xamar begun to have doubts about what the WatchCircle had done, and after capturing Zayne Carrick on Coruscant, he confessed to the Council, what he and his fellow Covenant members had done, in the hopes of absolving Krynda, whom he remained loyal to. Xamar proceeded to accompany Zayne, who was disguised as a Sith, to the Draay estate in the hope of drawing Krynda out into the open and subsequently rescue her. Unfortunately, Haazen saw through this plot and revealed himself as a servant of the dark side. This proved fatal to Master Xamar, who was killed when a fleet under Haazen's command, having sliced the Vanjervalis Chain, fired on the Draay Estate. He then revealed that himself, Gryph, Zayne, Lucien and Q'Anilia were the figures in Krynda's Prophecy of the Five."}, {"tag": "p", "text": "As chaos ensued at the Estate, Q'Anilia rushed to find Krynda. Upon finding what she assumed to be her Lady's dead body, the Miraluka poisoned herself, ending her life. With the Draay Estate in ruins and all members but Lucien dead, the WatchCircle was no more."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}