{"url": "First_duel_on_unidentified_desert_moon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Expansion Region", "Category:Battles of the Great Jedi Purge", "Category:Duels"], "nodes": [{"tag": "h1", "text": "First duel on unidentified desert moon"}, {"tag": "p", "text": "The Duel on unidentified desert moon was a lightsaber duel fought in the year 19 BBY, between Jedi Shadow Celeste Morne and the Dark Lord of the Sith Darth Vader, on a desolate moon orbiting a gas planet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Determined to get rid of the infamous \"Jebble Box\", the crew of the Uhumele landed on a moon to sell it to Fane Peturri, a well known scholar and historian. Unknown to the Uhumele's crew, Peturri was also an agent of the Sith Lord Darth Vader, who learned of the ship's cargo from the Phindian crewmember Janks. After having the crew cuffed to poles, Peturri began looking through a holographic message left by a Snivvian crimelord, detailing his \"memoirs\", the Muur Talisman, Jebble and rakghouls, which was interrupted by his Jedi friend, Zayne Carrick. Peturri used the hologram to explain to Vader that he believed the Jebble Box contained the Muur Talisman, and also, a Jedi from forty centuries past."}, {"tag": "p", "text": "Against Peturri's warnings about the talisman, Vader slashed the crate holding Dreypa's Oubliette to open it, finding a young woman, Celeste Morne, inside, with the Muur Talisman attached to her neck. In a panic, Peturri put on a helmet to avoid infection. Celeste awoke, expecting to see Zayne Carrick, but still felt the spirit of Karness Muur alongside her. Muur cursed his enemy. Remulus Dreypa, and his oubliette upon their release from the millennia imprisonment. Confused, Celeste asks Peturri about a Covenant, the rakghouls, the Mandalorians, their conquest and the Republic. Peturri informed her that the Sith overthrew the Republic at which point she attacked Vader."}, {"tag": "h2", "text": "The duel"}, {"tag": "p", "text": "Celeste faced off against Vader with her lightsaber and deflected blaster bolts from clone troopers. Despite the taunts of Vader, who sought a powerful apprentice he could use to overthrow Palpatine, and of Muur, who sensed Vader could unleash the Muur Talisman's full power, Celeste reaffirmed her determination to keep it from him. Nonetheless, Vader overpowered Celeste in combat, but the Sith Lord hesitated to kill her and claim the talisman, realizing that to wield the talisman would merely be to trade slavery to Palpatine for slavery to Muur."}, {"tag": "p", "text": "Assuming Vader was distracted by the duel, Fane Peturri attempted to take the opportunity to flee the moon. However, with Celeste subdued and held by clone troopers, Vader was able to block him, and correctly identified Peturri as an agent of Palpatine himself, sent to spy on Vader. Vader revealed that while Force-sensitivity protected both himself and Celeste from the rakghoul plague, a mere environment suit could not protect Peturri from Sith magic. Accordingly Peturri mutated into a rakghoul and Vader immediately slew it."}, {"tag": "p", "text": "With Vader distracted by the rakghoul Peturri, Celeste threw away the clones guarding her and recovered her lightsaber, and re-engaged Darth Vader. During the chaos Schurk-Heren was able to subdue a clone trooper and steal a blaster, which he used to free the rest of the Uhumele's  crew. They immediately ran for their ship, intending to escape."}, {"tag": "p", "text": "Aware of the inevitability of her defeat, Celeste chose to utilize the full power of the Muur Talisman to prevent Vader from claiming it, immediately turning all clone troopers present into rakghouls – and, unfortunately, Crys Taanzer. Schurk-Heren was forced to shoot the newly infected Crys, at which point the remaining crew of the Uhumele made their escape."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Suddenly outnumbered, Darth Vader was forced to flee the battle and retreated to his shuttle, having realized both that Celeste could not serve as his apprentice and that the Talisman would not serve his purpose. Celeste, without any means of leaving the world, then settled in to wait with her rakghoul servants until some other would arrive, content in the knowledge that Karness Muur was left just as trapped as she."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}