{"url": "First_mission_to_Raxus_Prime", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Tion Hegemony", "Category:Duels", "Category:Missions of the Great Jedi Purge"], "nodes": [{"tag": "h1", "text": "First mission to Raxus Prime"}, {"tag": "p", "text": "The second of three \"test\" assignments given to Galen Marek by Darth Vader, Marek's mission to kill the deranged Jedi Kazdan Paratus brought the apprentice to the junkyard world of Raxus Prime, where the former Jedi Master secluded himself from reality in an obsessive reconstruction of the Jedi Temple on Coruscant. Defended by an army of junk golems thrown together by Paratus, Marek's mission to breach the junk temple proved to be a difficult task."}, {"tag": "p", "text": "After fighting his way through the armies of junk golems and a team of Rodian scavengers sifting through the junkyard hoping to make use of the materials found within, the Dark Jedi confronted Paratus in what was the Raxus Prime equivalent of the High Council Chamber. Paratus was killed in the ensuing struggle, and Vader promised his apprentice that this victory brought him a step closer to his destiny: to assassinate Emperor Palpatine."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Darth Vader summoned his secret apprentice once more. He informed him that his spies had uncovered the location of another Jedi on the world of Raxus Prime. This Jedi was Kazdan Paratus, who was noted to have been far more powerful then previous opponents that Galen Marek had faced, and that Lord Vader did not expect his apprentice to survive. However, if he did, then it would bring him one more step closer to his destiny—challenging Emperor Palpatine himself."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Accepting his mission, Marek took the Rogue Shadow to his next target."}, {"tag": "p", "text": "Touching down in the massive junkyard, Marek wound his way through the piles of refuse, confronting droid warriors held together by the Force. Fighting his way to the junk Temple in the distance, Marek encountered junk golems, Rodian scavengers, and many other opponents."}, {"tag": "p", "text": "Upon nearing the Temple, the Sith apprentice met the Rodian's leader, Drexl Roosh. A bounty hunter, Drexl ordered his minions to attack the assassin in order to prevent him from entering the Temple, both to acquire a bounty from the Empire, and as revenge for his earlier interrogation of Drexl. They were quickly defeated, however, and Marek continued on toward the Temple."}, {"tag": "p", "text": "After negotiating the junk world, Marek arrived in Paratus's facsimile Temple and was confronted by a Junk Titan armed with two large vibro-axs, and a variety of weapons tipping its other arms. This machine spoke in Paratus's voice and was greatly angered at Marek's invasion of the temple. The Sith apprentice dodged blows from the junk warrior, and as the floor buckled under the Titan's weight, knocked off one of its weapons with a telekinetic punch. Dodging another attack by the golem, slicing as he went, Marek removed more of its weapons. He rolled through the machine's legs and cut up its spine, scoring a deep blow."}, {"tag": "p", "text": "The crippled machine attempted to turn at the man, but he used his lightsaber to cut at both its vibro-axe arms, forcing it to drop one axe. He sent a barrage of lightning at the machine, sending all the strength he could muster at it. Its photoreceptors, a droid's \"eye,\" became nonfunctional but it still came at Marek with its other ax. The apprentice used the Force to push the creature, knocking it off one of its legs, through the walls of the Temple, following it and finally bringing it down in a junk version of the High Council Chamber of the Jedi Temple with junk effigies of the late or missing council members."}, {"tag": "p", "text": "From a hatch in the machine's front emerged the Jedi Master Marek had been searching for. Paratus swore he would protect the \"Masters\" and the mannequins began to stir, distracting the apprentice. Paratus lunged at the invader, slightly scoring a cut down Marek's left arm before it was parried. Though Marek fought back, every move he made was either blocked almost instantly by the Aleena's Lightsaber pike or missed because of the Jedi's constant hopping from place to place. The invader sent a volley of lightning against Paratus, noticing that Paratus had an extreme aversion to the electric pulses. He hit Paratus with more and more lightning but as he did so, the apprentice was suddenly struck from behind and his lightsaber fell from his hand."}, {"tag": "p", "text": "He turned to see the junk version of Plo Koon standing behind him in a Form V stance, a vibroblade in place of his lightsaber. After a moment of surprise, the apprentice used the Force to blow apart the patchwork tribute and regained his lightsaber, deflecting a blow from the recovered Paratus. More \"Masters,\" including Obi-Wan Kenobi, Yoda, and Anakin Skywalker, attempted to face the apprentices, but all were destroyed. With each \"death,\" Paratus clasped his chest deeper in pain and despair at their loss, crying when the last one fell to the apprentice. Paratus then attempted to throw a large engine at Marek. Marek blocked this and sent it flying back toward the tiring Jedi Master. Paratus jumped to avoid the flying engine and the battle moved onto a narrow ledge above the Council Chamber. Paratus attempted to strike at Marek, who easily deflected the blow. Paratus then attempted to push Marek back, however the push was sent hurtling back toward the Jedi Master, who was unable to block the ferocious attack and was slammed into a wall. Paratus then ran up the wall using his suit to climb up the wall, but was quickly followed by Marek. Paratus then jumped down onto a second ledge and Marek then through the engine core at him. Paratus blocked this and sent it flying back towards Marek, but Marek was too strong and after charging up his attack, sent the engine flying back towards the Jedi Master. Marek's power was too great and the engine slammed into Kazdan Paratus and pinned him to the floor, mortally wounding him."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "As he lay dying with his eyes closed, Paratus uttered his last words, apologizing to the Masters for failing them yet again. Paratus then became one with the Force and his body disappeared in a flash."}, {"tag": "p", "text": "Marek returned to his ship and left for his next mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}