{"url": "Firwirrung", "categories": ["Category:Legends articles", "Category:Males", "Category:Ssi-ruuk"], "nodes": [{"tag": "h1", "text": "Firwirrung"}, {"tag": "p", "text": "Master Firwirrung was the lead entechment specialist onboard the Ssi-ruuk ship Shriwirr. He was the master of Dev Sibwarra, and, along with Elder Sh'tk'ith, had been responsible for studying him since his capture. Firwirrung was killed onboard the Shriwirr when his plan to capture Luke Skywalker for entechment experiments backfired, and the Jedi—with the freed Sibwarra's help—captured the ship during the Battle of Bakura."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Brown-scaled, Firwirrung achieved great power despite his youth and standing as a part of the Ssi-ruuvi caste considered as outcasts."}, {"tag": "p", "text": "Around 2 BBY, Firwirrung was assistant to entechment chief Yifaii. Yifaii was present at the Ssi-ruuvi invasion of G'rho. There, a young human boy named Dev Sibwarra was spared from entechment and Yifaii considered that he might warrant further study on Lwhekk. It was decided that the boy should be given to Firwirrung."}, {"tag": "p", "text": "In 4 ABY, Firwirrung was now entechment chief himself onboard the Shriwirr during the Ssi-ruuk invasion of the planet Bakura. Since beginning his military service, he had made many improvements to entechment technology and his great ability to manipulate, repair and design entechment apparatus allowed him to advance far beyond other members of his caste. He was not well-regarded by superiors and shipmates, including Admiral Ivpikkis and even those from his own caste who regarded him as overly ambitious and not worthy of the praises he had been given."}, {"tag": "p", "text": "Firwirrung was still the master of Dev Sibwarra and treated him like a companion or pet. Dev slept in Firwirrung's quarters and had great devotion to the entechment chief, despite torture and cruelty inflicted upon him by the Ssi-ruu over time."}, {"tag": "p", "text": "When news came of an outsider, someone like Dev with Force abilities, it was decided that the entechment apparatus should be modified appropriately. Firwirrung's plan was to modify it in a way that would allow a Force-user to pull energy from humans at great distances. Within hours, Firwirrung designed, built, and tested a device such as this, a task that would take most Ssi-ruuk engineers weeks, months or even years to complete. The updated entechment apparatus was tested on Dev, who, under brainwashing from Elder Sh'tk'ith, was more than willing to be the test subject."}, {"tag": "p", "text": "Having bargained with the governor of Bakura, Wilek Nereus, a group of Ssi-ruuk, including Firwirrung, Sh'tk'ith and Dev, infiltrated Bakura and landed on Pad 12. They planned to capture the Force-user, Luke Skywalker, and bring him to the Shriwirr. This they did successfully, but the Jedi had managed to break Dev free from his brainwashing. Following this, Dev tried to hide his feelings from the Ssi-ruuk."}, {"tag": "p", "text": "With Luke their prisoner, he was brought to the entechment laboratory and bound to the chair. However, Dev was revealed to be free of brainwashing and all of the lights in the laboratory went out. Luke had used the Force to manipulate a P'w'eck into attacking a control board."}, {"tag": "p", "text": "Firwirrung and Sh'tk'ith escaped. Firwirrung began work at once on a second entechment chair while Elder Sh'tk'ith and some P'w'ecks confronted the escaping Luke and Dev at Deck 16. Soon, Luke and Dev made it to the engineering deck where Firwirrung had been working. Now, he and a group of P'w'ecks ambushed the pair. Firwirrung accused Dev of betrayal and shot him down, rendering him hurt by the shot. In the Dominant, Commander Pter Thanas executed a blast on the Shriwirr. As a result of this, Firwirrung was killed by the blast."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Firwirrung was aggressively innovative, always seeking to construct better entechment devices and sought to do the best job possible."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}