{"url": "Fist_of_the_Empire_(group)", "categories": ["Category:Legends articles", "Category:Sith organizations", "Category:Imperial organizations"], "nodes": [{"tag": "h1", "text": "Fist of the Empire  (group)"}, {"tag": "p", "text": "The Fist of the Empire or Sith Army was the Sith organization that the Sith Lord Darth Tyranus planned to establish following the creation of his master's New Order, the Galactic Empire, at the end of the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darth Tyranus, also known as Count Dooku, planned that it would be formed from the remains of the Jedi Order, with those Jedi who were unwilling to convert to the dark side of the Force killed, while those who submitted being indoctrinated in the ways of the Sith. Anakin Skywalker would form the nucleus of it, beginning to use his fame and HoloNet access to subtly and reluctantly speak out against the Jedi Order and blame them for prolonging the war, eventually announcing the formation of a new sect of Force warriors. Following the creation of the New Order, Dooku envisioned Skywalker becoming one of his lead generals in the Fist."}, {"tag": "p", "text": "Instead of the Jedi's famed diplomacy, the Fist would enforce its will through force. Only Humans (and apparently near-Humans) would compose the Fist; all Force-sensitive Humans across the galaxy would be taken into the Fist as children, regardless of their own or their parents' wishes, and be trained in the Sith way. Dooku's thoughts seemed to indicate that such Force-sensitive sub-species as Korunnai, Kiffars, and Dathomiri would be completely enrolled in the Fist's membership."}, {"tag": "p", "text": "It is unclear how much of this Palpatine agreed with and how much of it was simply a play to Dooku's own ideals and opinions. While Palpatine did establish the Inquisitorius, his Dark Side Elite and the Emperor's Hands, very few of them were former Jedi, even fewer were educated in Sith teachings, there were nonhumans in their ranks, and there is no evidence that any Force-sensitive subspecies were enslaved to it. Naturally, the overall idea died aboard Invisible Hand when Dooku was beheaded by Skywalker."}, {"tag": "h2", "text": "Appearances"}]}