{"url": "Five_Veils_Campaign", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Battles of the Five Veils Campaign", "Category:Early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Five Veils Campaign"}, {"tag": "p", "text": "The Five Veils Campaign was an Imperial campaign launched in 19 BBY during the Empire's Reconquest of the Rim, against the remnants of the organization known as the Trade Federation. Led by Customs Vizier Marath Vooro, portions of the company refused to acknowledge the treaty that gave the Empire control of the Federation's resources and assets. In response, Imperial Grand Moff Octavian Grant smashed Vooro's forces at the planet Farstine, before capturing Vooro in the Hook Nebula, ending the campaign."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the end of the Clone Wars in 19 BBY saw the Galactic Republic defeat the Confederacy of Independent Systems, some parts of the Confederacy-allied Trade Federation company continued to resist the Galactic Empire. The resistance, which was led by the Trade Federation's Customs Vizier Marath Vooro, refused to acknowledge the treaty signed by Acting Viceroy Sentepeth Findos, which gave control of all of the company's resources and assets to the Empire."}, {"tag": "p", "text": "Vooro, who declared that Findos' authority to make decisions for the Trade Federation was illegitimate, led the resisting portions of the company from the Mid Rim planet Enarc. There he retained a force of Trade Federation Defense Fleet battleships and battle droids, challenging the Empire to come and take the Federation's wealth. The Empire responded by dispatching Grand Moff Octavian Grant to deal with them during their Reconquest of the Rim."}, {"tag": "h2", "text": "The campaign"}, {"tag": "p", "text": "Vooro's campaign was hampered by a lack of effective commanders. Consequently, Grant's fleet decisively defeated Vooro's forces at the world of Farstine, before chasing Vooro down the Five Veils Route. Grant finally captured Vooro on the fringes of the Hook Nebula in the Outer Rim Territories, ending the campaign."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the resistance eliminated and Vooro captured, the Trade Federation ceased to exist."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Five Veils Campaign was first mentioned in the article Republic HoloNet News Special Inaugural Edition 16:5:241, written by Daniel Wallace and Pablo Hidalgo, and released in 2005 in the 84th issue of the Star Wars Insider magazine. In 2012, the campaign was identified and expanded on in The Essential Guide to Warfare, an extensive guide dedicated to the conflicts in the galaxy, written by Jason Fry and Paul R. Urquhart."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}