{"url": "Albee_Dewaw/Legends", "categories": ["Category:Legends articles", "Category:Aliases, nicknames, and pseudonyms", "Category:Males", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Albee Dewaw"}, {"tag": "p", "text": "Albee Dewaw was the persona of an enormous hologram created to rule over the Balnab civilization on the planet Balnab. Terrified by the superior technology of Dewaw, the Balnab obeyed his every whim. C-3PO and R2-D2 arrived on the planet shortly after a misadventure on Patitite Pattuna and revealed Albee Dewaw to be a projection controlled by a group of DUM-series pit droids. Upon learning this, the Balnabs promptly attacked their droid masters, while C-3PO and R2-D2 quietly left the scene."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After crashing on Balnab, a group of pit droids created Albee Dewaw in order to rule the relatively unintelligent Balnab. Albee Dewaw was many times more massive than the Balnab and was designed with the ability to generate bolts of lightning. Due to these attributes, the hologram was able to cow the inhabitants and rule as dictator."}, {"tag": "p", "text": "Some time later, the droids R2-D2 and C-3PO were forced to land on the planet due to their starfighter running out of fuel after escaping the Battle of Patitite Pattuna. While the two droids searched for fuel for their ship, a Balnab hunting party spotted the duo and captured them with a stun net. They then brought the two droids to Albee Dewaw, who became enraged with the visitors and executed the Balnab responsible for their arrival. While C-3PO began negotiating with Albee Dewaw, R2-D2 discovered a secret hatch leading into the remnants of a crashed starship. He opened it and saw the pit droids controlling the holographic image of Albee Dewaw. R2-D2 quickly exposed the treachery to the Balnabs, who became enraged and attacked the pit droids, while R2 and C-3PO escaped."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}