{"url": "Albinism", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Incomplete lists", "Category:Biological phenomena"], "nodes": [{"tag": "h1", "text": "Albinism"}, {"tag": "p", "text": "Albinism was a deformity that caused the pigmentation of a creature's skin to appear as a pale white. The mutation could occur in members of the sentient Trandoshan species, including the New Republic pilot Feresk Tssat. Known as Frisk to his companions, Tssat was ostracized by the more barbaric members of his species on Dosh, later finding his place with the pilots of the Republic's Vanguard Squadron."}, {"tag": "p", "text": "Non-sentient species were also susceptible to albinism. Years before the Battle of Yavin, an albino Eriadu veermok stalked the Carrion Plateau on the planet Eriadu. Since the creature's condition prevented it from utilizing the dense greenery as camouflage, the veermok's life was a constant struggle. But the beast managed to survive, becoming the top predator of the plateau. It was later killed by Ellian Zahra, an officer of the Galactic Empire sent to hunt the creature by Grand Moff Wilhuff Tarkin. On Kashyyyk during the Imperial Era, albinism occurred in Wyyyschokk. They posed a threat to stormtroopers and Cal Kestis alike. Norel Quo, a Koorivar who served as Supreme Chancellor Lina Soh's primary aide during the Great Disaster in the High Republic, had unpigmented skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Albinism first appeared in Star Wars canon in Star Wars: Squadrons, a 2020 starfighter combat video game. The condition was specifically identified as albinism in the StarWars.com Databank for Feresk Tssat, a non-player character in the game. In the Star Wars Legends continuity, albino creatures first appeared in \"Children of the Force,\" a short story in the thirteenth issue of the comic book series Star Wars Tales."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}