{"url": "Flametrooper_(Galactic_Empire)", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Flametrooper  (Galactic Empire)"}, {"tag": "p", "text": "Flametroopers were a variant of Imperial stormtrooper equipped with incendiary weapons. In the Imperial Era, they were deployed to Kashyyyk and Agaris to defend Imperial facilities against native fauna."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Flametroopers were a variant of stormtrooper in the Galactic Empire's Stormtrooper Corps, notable for their use of flamethrowers. Over the Imperial Era, they used several different designs of armor. One, notably utilized on Agaris, was similar to the armor of snowtroopers, but with maroon markings on the helmet and shoulders. It featured a black backpack which attached to the flamethrower, and fabric extending from the goggles over the mouth. Another armor variant was used on Kashyyyk, which was more angular in design, and purely white. It had a lower set mouth cover, a white backpack, and a kama."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Flametroopers could be used to defend Imperial facilities from attacks from native fauna, or in assaults on enemy positions."}, {"tag": "p", "text": "They were skilled in the use of incendiary weapons. Their flame rifle had a range of roughly ten meters. However, it limited their agility. It also utilized a combustible fuel source that required a cool down after use."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial Era, Moff Wilhuff Tarkin used flametroopers on the planet Agaris to burn down the native Agarians living in the forests surrounding the Imperial compound there."}, {"tag": "p", "text": "During the early rebellion against the Galactic Empire, flametroopers were deployed on the planet Kashyyyk's Imperial Refinery. There, they helped defend the facility against the native wyyyschokk and flame beetles with their flamethrowers."}, {"tag": "p", "text": "In 3 ABY, in the Battle of Hoth, Rebel pilot Thane Kyrell speculated that the Empire would deploy flametroopers to combat the Alliance to Restore the Republic's ground forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Flametroopers were first mentioned in Lost Stars, a canon 2015 young adult novel written by Claudia Gray. They first appeared in the 2017 junior novel Adventures in Wild Space: The Rescue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}