{"url": "Flamewind", "categories": ["Category:Legends articles", "Category:Oseon system", "Category:Physics"], "nodes": [{"tag": "h1", "text": "Flamewind"}, {"tag": "p", "text": "The Flamewind was a stream of radiation, in wavelengths from the infrared to the ultraviolet, that issued from the star Oseon. It flared out to encompass the entire Oseon system, tearing off electrically charged particles from the asteroids to form a giant pinwheel of constantly shifting color. It occurred once a year according to the Galactic Standard Calendar and lasted three weeks."}, {"tag": "p", "text": "Its cause was unknown. Some believed the Oseon system was full of an exotic isotope that sparked the Flamewind (this hypothetical element may also have caused the explosion of the planets that made up the asteroid belts in the Oseon). Another belief was that the Flamewind was made of lost souls, those killed before their time since the previous year."}, {"tag": "p", "text": "The Flamewind was considered one of the most beautiful wonders of the galaxy. It was a massively profitable tourist attraction for the Oseon and the Centrality, especially as the Flamewind made communication impossible and navigation ridiculously difficult, leaving travelers stranded until it was over. Any who wished to travel had to do so without the aid of navigation computers. Gadfrey Oseon, discoverer of the system, was the first to realize the money-making potential, turning the Oseon into one of the galaxy's premiere tourist resorts for the rich during the Flamewind, and a mining capital in between."}, {"tag": "p", "text": "The different colors of the Flamewind seemed to set off emotional reactions in those who traveled while it was happening, even in droids. Reactions included:"}, {"tag": "p", "text": "Lando Calrissian and Vuffi Raa were forced to navigate the Oseon during the Flamewind on a mission from Lob Doluff, Administrator Senior of the Oseon system."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}