{"url": "Flanker", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Flanker"}, {"tag": "p", "text": "\"Flanker\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Along with his hatchmate, Shiv, he underwent desert training in 22 BBY. Flanker was later killed during the Battle of Christophsis, but Shiv wrote letters to Flanker even after his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "\"Flanker\" was the nickname of one of the clones of the Mandalorian bounty hunter Jango Fett. Flanker was born and trained on Kamino to fight for the Grand Army of the Republic in the Clone Wars. In 22 BBY, Flanker—along with his hatchmate, Shiv—was assigned to desert training. During this time, Flanker joked that after all their desert training, one of them would end up being deployed to a water planet."}, {"tag": "p", "text": "When Confederate forces attacked the Outer Rim planet of Christophsis, Flanker was one of the clone troopers whom the Republic dispatched to defend the world; however, he was killed during the battle. Despite Flanker's death, Shiv relaxed himself during his own missions by writing letters to his hatchmate. Shiv wrote one such letter about problems he and his squad faced while on the ice planet Orto Plutonia. During the mission, Shiv talked with his commander, Mag, about Flanker and his recent death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Flanker did not care much for letters, but he had a sense of humor when he joked about his desert training with Shiv, jesting that one of them would get shipped to a water world. As a clone of Jango Fett, Flanker stood 1.83 meters tall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Flanker was first mentioned in Cold Snap, a tie-in webcomic for \"Trespass,\" an episode of the first season of the Star Wars: The Clone Wars television series. Cold Snap was written by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}