{"url": "Flare_Squadron", "categories": ["Category:Canon articles", "Category:New Republic stubs", "Category:Flare Squadron personnel", "Category:New Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Flare Squadron"}, {"tag": "p", "text": "Flare Squadron was a New Republic starfighter squadron that was stationed on the New Republic flagship Deliverance as part of Commander Wyl Lark's starfighter wing. The squadron was led by Flare Leader Captain Essovin and utilized X-wing starfighters. The squadron were newcomers to the starfighter wing, it's X-wing pilots had never fought\nthe 204th Imperial Fighter Wing before joining General Hera Syndulla's battle group. They were summoned by Syndulla to support the Hunt for Shadow Wing in place of Vanguard Squadron."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Flare Squadron was a starfighter squadron in the New Republic, that was part of Commander Wyl Lark's starfighter wing, stationed onboard General Hera Syndulla's flagship Deliverance. The squadron utilized X-wing starfighters and was led by Flare Leader Captain Essovin with Lieutenant Lourgh T'oknell as a staff officer."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Summoned to the Deliverance"}, {"tag": "p", "text": "Following the destruction of General Hera Syndulla's flagship, the Lodestar, at the hands of the 204th Imperial Fighter Wing over Troithe, the New Republic assigned her a new flagship, a refitted Star Destroyer, the Deliverance. Recently promoted, Commander Wyl Lark was given command of the Deliverance's starfighter wing, which included Hail Squadron and Wild Squadron. Flare Squadron joined the wing after they were summoned by Syndulla to support the Hunt for Shadow Wing in place of Vanguard Squadron."}, {"tag": "h3", "text": "Rescue in Midgor"}, {"tag": "p", "text": "In 5 ABY, Flare Squadron, along with the rest of Syndulla's New Republic forces, participated in a heavy reconnaissance mission that that took them to Midgor in the Croynar sector. They stumbled across an Imperial convoy that was left damaged and disabled after being attacked by the 204th. Lark told Hail and Wild Squadrons to hold back, while he took Flare Squadron in closer to investigate. Lark initiated contact with the convoy, and Captain Oultovar Misk of the Imperial freighter Diamond Tor surrendered and asked for assistance. Lark offered New Republic help and brought in more ships."}, {"tag": "h3", "text": "Sabotage of the Deliverance"}, {"tag": "p", "text": "Flare Squadron was present on board the Deliverance when it was attacked by sabotage droids, which led to the death of the Deliverance's captain, and one of its engineers."}, {"tag": "h3", "text": "Skirmish in the Ciaox Verith system"}, {"tag": "p", "text": "Two days after the Deliverance completed emergency repairs following the sabotage droid attack, Syndulla's forces arrived in the Ciaox Verith system after receiving comm bursts that gave away clues to the position of the 204th's flagship, the bulk freighter Yadeez. Flare Squadron had already launched with Lark, and later joined by Hail and Wild Squadrons, however the New Republic forces were unable to get close enough to stop the 204th from escaping and jumping to lightspeed. One TIE was destroyed, however Flare pilot, Lieutenant Lourgh T'oknell was killed."}, {"tag": "h3", "text": "Battle in the Red Yars system"}, {"tag": "p", "text": "Later, Syndulla's forces caught up to the 204th in the Red Yars system. Flare Squadron were launched to intercept the Yadeez. One of Hail Squadron's pilots, Boyvech Toons, and Alphabet Squadron pilot Chass na Chadic, were the only New Republic pilots to loose shots, but neither was in range when the 204th jumped to lightspeed."}, {"tag": "h3", "text": "Third encounter with the Yadeez"}, {"tag": "p", "text": "The third encounter with the 204th occurred after the comm burst had ceased and the Deliverance resumed its system-by-system. Within hours, the 204th had been found, and after the Deliverance emerged from hyperspace with its tractor beam primed and was able to lock on to the Yadeez. The squadrons, including Flare, were deployed to stay close and protect the tractor beam projector under the cover of the Star Destroyer's point-defense weaponry. Two TIEs managed to break through, although unable to do any damage with their cannons, however one TIE impacted the beam projector in a suicide run and obliterated it, killing three crew members aboard the Deliverance. The 204th escaped again."}, {"tag": "h3", "text": "Fourth encounter with the Yadeez"}, {"tag": "p", "text": "A few days later, another comm burst came through. With no tractor beam, the Deliverance emerged from hyperspace deep in-system in a surprise encounter in a unmapped system with a alphanumeric designation, that was cluttered with planetoids and debris. The Yadeez and its escorts were forced toward one of the planetoids, to prevent it from jumping. Flare and the other squadrons skirmished with the 204th TIEs that lasted six minutes before they escaped. Two TIEs were destroyed with no New Republic casualties, other than a single minor injury to Genni Avremif (Hail Six) after his ejector seat had accidentally triggered on landing."}, {"tag": "h3", "text": "Battle in the Ghonoath system"}, {"tag": "p", "text": "Syndulla's forces caught up to the 204th, after they stopped in the Ghonoath system to permit one of their Raider-class corvettes to refuel. The Yadeez and its escorts dropped into the atmosphere of a radioactive deathworld to slow down the New Republic forces and buy time for the Raider. TIE squadrons were launched and a battle ensued with the New Republic starfighter squadrons. TIE/sa bombers dropped proton bombs without detonator timers to drift like mines in the planet's fierce winds, which managed to destroy two X-wings. 204th pilot Garl \"Snapper\" Lykan, known by Alphabet Squadron for his Needle maneuver, was killed by a trio of X-wings that converged on him. After the TIEs boarded the Yadeez and exited the planet's atmosphere, it jumped to lightspeed with its escorts."}, {"tag": "h3", "text": "Skirmish in the G'Tep'Noi system"}, {"tag": "p", "text": "Syndulla's force continued their pursuit of the 204th and one such encounter led them to the G'Tep'Noi system, where Lark and the more nimble fighters worked their way through an asteroid field to find a path, while the slower fighters and bombers, such as Flare Squadron, held back. As they neared, the 204th left themselves open to attack as the Yadeez was leaving the asteroid field to jump to lightspeed. Lark ordered the fighters to attack, Flare and Hail Squadron moved to either side of him, while Wild prepared to flank the bulk freighter. Out of nowhere, former Alphabet leader and traitor, Lieutenant Yrica Quell, announced over the comm her allegiance to the 204th, warning the New Republic forces to withdraw or be destroyed. This surprised Syndulla and her forces, particularly the other members of Alphabet Squadron, because she was presumed dead at Cerberon. Quell fired at Lark and during the confusion, Quell's TIE boarded the freighter. But it was too late for Flare and Hail to reach it, and the Yadeez disappeared once again into hyperspace."}, {"tag": "h3", "text": "Battle at Chadawa"}, {"tag": "p", "text": "Later, Flare Squadron participated in a battle that took place over the planet Chadawa, in which Syndulla's New Republic forces tried to prevent the 204th from destroying the Imperial-aligned planet as part of a second Operation: Cinder. The Chadawan government was under the protection of Colonel Madrighast's Imperial forces, who decided to retreat to the far side of the planet, and left the New Republic and the 204th to battle it out over a couple of days. Flare Squadron were launched alonside Wild Squadron in a direct attack against the 204th, with Hail Squadron tasked on a stealthy bombing mission against the 204th's two Raider-class corvettes, led by Captain Nath Tensent, by sneaking around the planet undetected in the particle tide's radiation. When the particle tide increased to high levels, Syndulla called off the attack and the New Republic forces, include Flare Squadron retreated. However, Lark taunted Colonel Soran Keize into a duel, which Tensent saw as a cue to continue Hail's bombing run, while everyone was distracted by the duel. The Y-wing bombers managed to destroy the first Raider, losing three Hail pilots in the process, before Colonel Madrighast's Imperial-class Star Destroyer Unyielding closed in and fired openly on both sides, including the 204th's second Raider. The second Raider was eventually destroyed and the 204th withdrew from Chadawa. Syndulla ordered the Deliverance in pursuit, which caught the attention of the Unyielding, which attacked the Deliverance. Flare and Wild Squadrons attacked the Yadeez while the Deliverance concentrated its defenses on destroying the Unyielding."}, {"tag": "h3", "text": "Battle of Jakku"}, {"tag": "p", "text": "Following the battle at Chadawa, Syndulla's forces joined the rest of the amassed Alliance fleet at the Battle of Jakku, in which Flare Squadron was present. Following Lark's refusal to enter battle and taking any further life, Tensent took command and led the wing into battle. Tensent, in his own Y-wing, led the bombing runs on the Yadeez, alongside Chadic in her A/SF-01 B-wing starfighter. The starfighters from Flare and Wild Squadrons provided protection for the bombers from the 204th's TIEs, which they suffered many casualties from. Tensent later retreated from the battle, which he claimed was due to critical damage to his ship. Lieutenant Itina (Wild Eight) assumed leadership of the remaining fighters and Flare Two continued to fight under her leadership, alongside Genni Avremif  (Hail Six) and Wild Seven. The battle was a decisive victory for the New Republic, and marked the end of the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Flare Squadron first appeared in the 2021 novel Victory's Price, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}