{"url": "Flash/Legends", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Flash"}, {"tag": "p", "text": "\"Flash\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. Around 21 BBY, Flash and several other clone troopers assisted Jedi General Anakin Skywalker in evacuating the Venator-class Star Destroyer Liberty after it was attacked by Confederacy of Independent Systems forces over the planet Quell. They rescued Jedi General Aayla Secura and Commander CC-5052, evacuating the ship aboard a Consular-class cruiser. During the escape, the cruiser suffered damage, causing the hyperdrive to activate and subsequently crash the ship on the planet Maridun. On the surface, Flash—along with fellow clones Cameron and Lucky—were killed by mastiff phalones, predators native to the world."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "\"Flash\" was the nickname of a clone trooper, bred on the planet Kamino using DNA from the bounty hunter Jango Fett to serve the Galactic Republic. Around 21 BBY, during the Clone Wars against the Confederacy of Independent Systems, Flash was aboard the Venator-class Star Destroyer Resolute, flagship of Jedi General Anakin Skywalker. The Resolute answered a distress signal from the Liberty, which was commanded by Jedi General Aayla Secura. On Skywalker's order, the Resolute jumped to the planet Quell, where Secura's fleet of three Venator-class Star Destroyers were engaged with a Separatist force consisting of four Munificent-class star frigates. The tactical droid in command of the Separatist flotilla ordered rocket pack–equipped B2-RP battle droids to board the Liberty. With the Liberty heavily damaged and listing in Quell's atmosphere, Skywalker led his troops to Secura's vessel in LAAT/i gunships to evacuate the ship. Flash, along with fellow clone troopers Cameron and Lucky, rode in Skywalker's gunship along with the general's Padawan, Ahsoka Tano, and Captain CT-7567, nicknamed \"Rex\"."}, {"tag": "p", "text": "As the battle was raging in Quell's upper atmosphere, Skywalker jumped out of the gunship, using the Force to slow his descent. Shortly after, one of the Separatist B2-RP battle droids disabled the gunship that Flash was traveling in, causing it to crash onto the hull of the Liberty. Captain Rex and Tano led Flash and the other troopers into the vessel using a breach in its hull, rendezvousing with General Skywalker. The group subsequently met up with General Secura and her clone commander CC-5052, known as \"Bly\". Skywalker had arranged for a Consular-class cruiser to dock in the Liberty's ventral hangar, and he led the small group of Jedi and clones to be evacuated, fighting a running battle with B1 and B2 super battle droids as they went. On route to the hangar, an explosion aboard the Liberty sent flames and concussive force down the corridors of the cruiser. The wavefront approached the group of Jedi and clones as they were about cross through the gangway to board the evacuation ship; seeing the danger, Skywalker used the Force to push Flash and the rest of the group through the airlock. As the cruiser's blast doors sealed in front and behind him, Skywalker tried to use the Force to contain the approaching blast. He failed, and the resulting impact blew the blast doors apart. Severely injured by flying debris, Skywalker was rescued by Tano and Secura—who had opened the blast doors leading to the rescue ship—just as the cruiser undocked from the Liberty's hangar."}, {"tag": "p", "text": "As the Consular-class cruiser attempted to dock with the Resolute, it came under fire from Separatist Vulture droid starfighters, resulting in its hyperdrive being triggered. The ship executed a blind jump, and ended up crashing onto the planet Maridun. Flash survived the crash-landing, and assisted the other survivors—Secura, Tano, Rex, Bly, Cameron and Lucky—in erecting a temporary camp and shelter to care for the injured Skywalker. Commander Bly discovered a small engraving on a stone table that indicated that the planet held intelligent life near the campsite, and Secura was determined to locate them as Skywalker's condition was worsening and they needed medical aid to treat him."}, {"tag": "p", "text": "Leaving Rex to watch over Skywalker, Secura led the remaining clone troopers and Tano in search of the natives. During their search, the group came across a giant tree with large seedpods hanging from it. Some of the seedpods detached from the tree, causing the clones underneath it to scatter to avoid being crushed to death. Secura noted that tracks from the tree indicated that an intelligent species had dragged several of the seedpods away, and ordered the group to follow the trail. After night fell, Flash, along with the rest of the group, entered a small clearing surrounded by long grass, where they were ambushed by three mastiff phalones, predators native to the planet. One beast caught Lucky in his midsection, tossing him high into the air, while another attacked Flash, jumping on him and using its powerful jaws to bite his neck through the gap in his armor. Although Bly managed to kill the predator with his blaster pistol, Flash was already dead. The third creature killed Cameron, then tossed the corpse at Bly before retreating. Bly confirmed their deaths to Secura and Tano before the three left the bodies of the dead clones behind in the clearing to continue their search. Secura, Tano and Bly eventually found a colony of Lurmen living on the planet who treated Skywalker's injuries."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone of Jango Fett, Flash stood 1.83 meters tall. He was equipped with Phase I clone trooper armor, and his helmet was mounted with two flashlights, one on either side. He wielded a DC-15S."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Flash was introduced in Jedi Crash, the thirteenth episode of Star Wars: The Clone Wars first season in which he is killed. In the DVD subtitles for Jedi Crash, Flash's name is misspelled as \"Flesh\"."}, {"tag": "p", "text": "Flash is never specifically identified on-screen during Jedi Crash, and is one of three generic clone troopers present in the episode. While he and the other two (Cameron and Lucky) are only referred to by name on Maridun after the crash of the Consular-class cruiser, three clone troopers are seen accompanying Skywalker, Tano and Rex on the LAAT gunship they use to board the Liberty. The troopers are present with Rex in all subsequent scenes. Flash's name is only mentioned after he is killed by a mastiff phalone, and his corpse is not specifically identified. This article assumes that Flash and his compatriots were the clone troopers accompanying Rex, Tano and Skywalker during the battle. In addition, this article also assumes that the order in which Bly looks at the bodies and mentions the trooper's names indicates that Flash was the clone killed by the mastiff phalone which Bly killed during the ambush."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}