{"url": "Flashpoint_(planet)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Desert planets", "Category:Galactic Republic planets", "Category:Mandalorian planets", "Category:Meerian sector planets"], "nodes": [{"tag": "h1", "text": "Flashpoint  (planet)"}, {"tag": "p", "text": "Flashpoint was an airless planet that orbited very close to its star, with a day lasting just one standard hour. Being so close to its star meant that the planet was bathed in stellar radiation and thus devoid of life. Before the Great Sith War, a protective magnetic field was set up and a research station established by scientists to study stars. In 3965 BBY, this station was seized by Mandalorian warriors as part of their invasion of Galactic Republic space. The Mandalorian scientist Demagol used the research station to experiment on Jedi in an attempt to discover the source of their powers, but the Mandalorian presence was later expunged from Flashpoint by fugitive Jedi Padawan Zayne Carrick and his companions in 3964 BBY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the Meerian sector of the Outer Rim Territories, Flashpoint was a planet that orbited very close to its star and had no orbiting moons. Flashpoint was a relatively new arrival in its star system and subsequently had a year that was 1,776 local days long, with each day lasting only one standard hour. The proximity to its star also meant that the surface of the planet—constantly bombarded by stellar radiation—was extremely arid and lacked an atmosphere of any kind, leaving it void of life."}, {"tag": "p", "text": "A small area of Flashpoint was made habitable when a magnetic field was set up on the surface by scientists of the Galactic Republic. The scientists also established a research station on the planet to study stars. Surface travel was impossible outside this field due to the solar radiation clinging to the planet. The short nighttime had no effect on the radiation, and Flashpoint would cool only slightly during this time."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Four-thousand years before the Galactic Civil War, the Galactic Republic established the Flashpoint Stellar Research Station on the planet to study the life cycle of stars, with funding for the station diverted from another solar observatory on Metellos 3. In 3965 BBY, after the Great Sith War, the nomadic Mandalorian Neo-Crusaders instigated the Mandalorian Wars by invading Republic worlds close to the edge of Mandalorian-controlled space. One of these worlds was Flashpoint. A year later, Mandalore the Ultimate, leader of the Mandalorians, awarded the captured Flashpoint research station to the Mandalorian scientist Demagol as a location for him to carry out experiments on Jedi to discover the source of their powers. When the conflict between the Neo-Crusaders and the Republic escalated, greater numbers of Jedi were brought to Flashpoint, usually in small Teroch-type gunships."}, {"tag": "p", "text": "Shortly after the Battle of Vanquo in 3963 BBY, fugitive Jedi Padawan Zayne Carrick and the crew of the space transport Last Resort traveled to Flashpoint to stage a rescue of Jarael, a crew member who had been captured by Mandalorians on Vanquo. By posing as the prisoner of an apostatized Mandalorian scout, Rohlan Dyre, Carrick planted himself inside the research station, where he ambushed Demagol and took the scientist's Mandalorian armor. Dyre, together with a now-disguised Carrick, then distracted the Neo-Crusader sentries in the station's landing area while the Padawan used the Force to subtly place mining charges on nearby vessels and shield projectors. Marn Hierogryph, one of Carrick's other companions, detonated the charges remotely to leave only one Mandalorian craft, which the the remaining Neo-Crusaders used to flee. With their captors gone, the Jedi prisoners were able to leave Flashpoint while Jarael was reunited with Carrick and the crew. When they too departed, Flashpoint was left deserted."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The intense heat and radiation from its sun left the surface of Flashpoint entirely devoid of life. Sentient beings, mainly scientific researchers, were able to reside on the planet after the Great Sith War as a result of the protection accorded by a magnetic shield. By the time of the Mandalorian occupation, the majority of Flashpoint's inhabitants were Humans, with sentries also residing in the research station to control the numerous Jedi prisoners being held for Demagol's notorious experiments."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Flashpoint Stellar Research Station"}, {"tag": "p", "text": "The only habitable location on Flashpoint was the Flashpoint Stellar Research Station set up by Republic scientists around 4000 BBY. Five projectors maintained a protective magnetic shield over the actual structure of the station as well as a landing area large enough to accommodate at least three Ministry-class shuttle-sized craft. The main part of the station was in an underground bunker and contained Demagol's experimentation room."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Flashpoint first appeared in Knights of the Old Republic 8, the second issue of the eponymous story arc of the Star Wars: Knights of the Old Republic comic book series, Flashpoint. The planet was further mentioned in several of the later issues, including a short story focusing on Demagol by John Jackson Miller, the writer of the comic series. Flashpoint received entries in the 2008 Knights of the Old Republic Campaign Guide and The Complete Star Wars Encyclopedia. A precise location for the planet was given in The Essential Atlas, published in 2009."}, {"tag": "p", "text": "Miller has stated that he liked creating locations such as Flashpoint for the series, as it took readers to places they would not have seen before in the Star Wars universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}