{"url": "Fleet_Admiral/Legends", "categories": ["Category:Legends articles", "Category:Imperial Navy ranks"], "nodes": [{"tag": "h1", "text": "Fleet Admiral"}, {"tag": "p", "text": "The rank of Fleet Admiral was a naval rank used in several eras."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The rank was first used in the Galactic Republic. The Fleet Admirals were possibly part of the Admiralty."}, {"tag": "p", "text": "Within the Imperial Navy, Fleet Admiral was not a formal line rank but a position that could be held by Admirals or Vice Admirals. The title of Fleet Admiral was accorded to the commanding officer of a major fleet within a Sector Group. A Fleet Admiral answered directly to the High Admiral in charge of Navy operations within their Sector, who was normally the Moff of the sector. His own command might be a front-line Superiority fleet, an Assault fleet or Bombard fleet for planetary suppression operations, or a logistical Deepdock fleet or Support fleet. A Fleet Admiral was a very important member of the military hierarchy within a Sector, with authority over multiple systems forces commanded by subordinate systems admirals."}, {"tag": "p", "text": "The commanding officer of Death Squadron under Darth Vader was also a Fleet Admiral, such as Kendal Ozzel and Firmus Piett."}, {"tag": "p", "text": "In the New Republic, Supreme Commander Sien Sovv held the rank of Fleet Admiral during his leadership of the Defense Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rank of Fleet Admiral is introduced in the Imperial Sourcebook for West End Games Star Wars: The Roleplaying Game, but it is not clear whether it is to be understood as a formal rank, or a title denoting a certain sort of command: the other posts discussed in the same section include some that seem to be substantive ranks, most obviously Captain of the Line, but also others that are evidently positional titles, such as a ship's captain and an Admiral's adjutant. The example of Michael Unther, who was apparently a Fleet Admiral before achieving the substantive rank of Rear Admiral, adds weight to the hypothesis that \"Fleet Admiral\" was a title rather than a real rank; indeed, Unther's subsequent promotion to flag rank suggets that some Fleet Admirals were actually Line Captains or Commanders by rank."}, {"tag": "p", "text": "A number of fan websites have speculated as to the rank insignia of Fleet Admirals, among which probably the most influential discussion is that at the Star Wars Technical Commentaries website (see here). More cautiously, it can be noted that the rank insignia worn by Admirals Ozzel and Piett as commanders of Death Squadron in The Empire Strikes Back are probably appropriate for a Fleet Admiral, with both men sharing the same insignia - six red squares over six blue, with two code cylinders on the left and one on the right; however, it is impossible to say whether this insignia was in any way specifically appropriate for a Fleet Admiral, or if it indicated some other substantive rank which both men held while commanding Death Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}