{"url": "Flight_of_the_Defender", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Flight of the Defender"}, {"tag": "p", "text": "\"Flight of the Defender\" is the sixth episode of the fourth season of the animated television series Star Wars Rebels. The episode premiered on Disney XD on October 30, 2017. It is also the sixty-fifth episode of the series overall."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The rebels look to secure intel on a deadly new Imperial fighter prototype."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Stakeout"}, {"tag": "p", "text": "Three Loth-cats run in the wilderness, approaching the rebels Ezra Bridger, Sabine Wren, Garazeb Orrelios and Ryder Azadi, who are staking out a remote Imperial testing facility in Lothal's wilderness. Sabine, studying the base, notes that she sees plenty of TIE Interceptors, but that's nothing new. Ryder explains that his spies have gotten information that the Empire plans to test their new TIE Defender here. Zeb is skeptical that the starfighter exists, grumbling that the only thing they've found are the Loth-cats, which are crawling on him. Ezra responds that he can't help that the cats like him. Sabine quips that it's nice that something likes Ezra, but they need to focus on the mission. Ezra's comlink beeps, and Hera Syndulla asks how the mission is going. He tells her that the fighter hasn't shown up yet. Hera, at Ezra's old tower with Kanan Jarrus and Chopper, reports that Empire is fortifying their anti-aircraft defenses and there are new fuel tanks at the Imperial factories. Kanan suspects that the Empire intends to start full-scale production. Hera orders Ezra to watch until nightfall, then return to base."}, {"tag": "p", "text": "Ryder explains that the new Defender is even more dangerous than the normal variety. The cats suddenly growl, and the Defender Elite flies overhead, blowing Ryder's hat and Sabine's helmet right off their heads. Pulling it back on, Sabine takes a closer look at the new prototype, which Zeb is now willing to admit exists. Sabine recognizes the pilot exiting the prototype as Vult Skerris. Since they have pictures, Ryder states that they should leave, but Sabine has another idea, proposing extracting the fighter's flight data recorder so the Rebellion will know more about the fighter's capabilities. Zeb thinks it is a bad idea, and Ryder points out that since they have no starships, it will be difficult to get the data back to the Rebellion. Sabine points out that transmissions can be intercepted, and that having no way to get the data recorder to the Alliance is what she calls a good problem. Ezra and Sabine sneak off on their mission, while Zeb and Ryder wait."}, {"tag": "h3", "text": "Stealing the prototype"}, {"tag": "p", "text": "The two Spectres sneak onto the base, with two Loth-cats in tow. They observe the prototype Elite, noting it is guarded by two stormtroopers. Ezra suggests that Sabine create a distraction so she can sneak aboard. Before she can, however, the Loth-cats emerge from behind the crates the rebels are using as cover and approach the guards. Seeing this, Ezra tells Sabine that the cats are handling it. The stormtroopers, irritated at the animals' presence, wonder if they can fly. One of the troopers shoots at a cat, which jumps out of the way. As the troopers agree that Loth-cats can't fly, the animals, angered, attack them. The cats then flee, with the troopers in pursuit. Sabine notes she likes the cats more and more, before asking Ezra to keep watch while she sneaks aboard the Defender. As Sabine begins to extract the flight recorder, Zeb contacts her and Ezra to report a ship approaching from the south. Skerris meets the Sentinel-class landing craft as it arrives at the airfield. Ezra, in his hiding place, looks over and is horrified to see Grand Admiral Thrawn and Governor Arihnda Pryce exiting the shuttle. Sabine asks Ezra, over the comms, what's happening, and he tells her \"something terrible.\" Ryder notes, horrified, that Sabine is still in the Elite, and Zeb responds that things are about to get interesting."}, {"tag": "p", "text": "Skerris, greeting Thrawn and Pryce, states that he has planned a simulation flight to showcase the Elite's capabilities. Sabine, looking up from her work to see the Imperials approaching, asks Ezra to distract them as she is nearly finished. Ezra asks how he's supposed to do that, and she responds that he'll think of something. Ezra prepares to execute a diversion, but is distracted by the sight of a white Loth-wolf on top of a rock across the valley. A TIE pilot catches him off guard, and in defending himself, Ezra is seen by Thrawn, Pryce and Skerris. The surprised commander remarks on the presence of a Jedi, and Thrawn identifies Ezra. Pryce orders the stormtroopers to apprehend him, and Thrawn orders their squad of death troopers to secure the prototype. Sabine, working, is surprised to discover that the fighter has a navicomputer. She looks up to see Ezra fighting the stormtroopers, and tells him he definitely got their attention. He snaps that he's glad things are working out for her. Zeb contacts Ezra, telling him and Sabine to make their way to the south end of the airfield, and that he and Ryder are going to go over there to help them escape. Ezra tells Ryder and Zeb to get the information they already had back to the others, and that he and Sabine will find their own way out. After she removes the flight recorder, Sabine looks up to see the approaching death troopers, and remarks that maybe this wasn't such a good idea. Looking at the Elite's controls, she decides she has a better one."}, {"tag": "p", "text": "As Ezra dodges stormtroopers amidst crates on the landing field, he contacts Sabine, who tells him to take cover. She fires on the Imperial troops with the Elite's guns, and picks up Ezra. Sabine makes several passes to destroy most of the base's TIE fighters and Interceptors. On her final pass, Thrawn, despite being in the line of fire, calmly shoots at the prototype several times, making no attempt to take cover. Sabine destroys Thrawn's shuttle before buzzing the control tower, causing the officers inside to duck. After the prototype escapes, Thrawn asks Skerris if this was part of the demonstration, and he responds that they won't get very far as the fighter's hyperdrive is offline. Pryce offers to activate its kill switch, but Thrawn tells her not to, as he sees this as a good opportunity to perform a combat test. He orders Skerris to get his pilots in the air, and three TIE Interceptors are launched. Zeb tells Ryder that he'd said it was going to get interesting, and the two depart. The two stormtroopers from earlier, still chasing the Loth-cats, are knocked down by the Elite's speed as it passes overhead."}, {"tag": "h3", "text": "Combat test"}, {"tag": "p", "text": "As she flies the Elite, Sabine tells Ezra that the prototype has a navicomputer, which means it has a hyperdrive, making it their best option for getting the flight data recorder back to the Rebellion. Ezra likes the plan, and Sabine gives him the controls, telling him to keep flying east. She begins to deactivate the prototype's homing beacon, so the Empire can't track them. Several blips appear on the fighter's scope, and Ezra reports enemy fighters closing in. As the prototype is chased through a landscape of rock spires, Ezra shoots down one of the pursuing Interceptors. Sabine tells him to keep it steady, as she is still working, and Ezra retorts that he is trying not to get shot down. He shoots down a second pursuer."}, {"tag": "p", "text": "At the Imperial base, Thrawn wonders who else besides Ezra is on board. Skerris, noting the pilot's capabilities, suggests that Hera Syndulla is piloting the prototype. Thrawn states that it has to be someone else, as if Hera were piloting, than all three of the Interceptors would have been shot down by now. Ezra destroys the last of the pursuers with the Elite's missiles. Sabine finishes deactivating the homing beacon, but then panics as she discovers something else. When this happens, Thrawn, noting that the homing beacon was deactivated in record time, deduces that Sabine is the other rebel in the Elite. Onboard the prototype, Sabine, realizing that the prototype has a kill switch, tells Ezra to land, reminding him of the ones on the TIE fighters from her mission to Skystrike Academy. Back at the base, Thrawn notes that if a modest pilot Ezra can defeat three trained Interceptor pilots so quickly, it more than proves the prototype's combat capabilities. He orders Pryce to activate the kill switch, and after she does, she orders gunships sent to the crash site."}, {"tag": "p", "text": "The Elite is heading for a landing in the wilderness when the switch is activated, and two of its wings are ripped off before Sabine manages to cut off the signal. The fighter crash-lands on its one remaining wing, and Ezra and Sabine exit with the data recorder. Sabine insists that they have to remove the fighter's hyperdrive, as they might be able to install it on Ryder's U-wing, which no longer has a functioning one. Ezra asks how they're going to carry it, and Sabine responds, \"Any way we can.\" He tells her to make it quick."}, {"tag": "p", "text": "Zeb and Ryder arrive back at Ryder's U-wing, and Zeb grumbles that he knew the kids would pull something crazy like this. Kanan tells him not to worry, and climbs up into the copilot's seat. Hera reports that Imperial chatter is saying that they crashed, and Ryder points out that they can't contact Ezra and Sabine without leaving a signal trace. The U-wing takes off, as Hera resolves to find them before the Empire does."}, {"tag": "p", "text": "After extracting it, Ezra and Sabine slowly drag the heavy hyperdrive away from the wreckage. Ezra sees a white Loth-cat, which directs him to an alcove. He suggests that they hide the hyperdrive there so they can come back for it later, as they'll make better time without it. Sabine asks Ezra how he knew about the place, and he tells her that he \"followed the white Loth-cat.\" As she didn't see it, she doesn't know what he's talking about. The two rebels push the hyperdrive inside, and Ezra pushes a stone in front for concealment. As they leave, Ezra hears howling in the distance. Imperial gunships arrive at the crash site after nightfall as Pryce begins her search, and Thrawn promises ground troops to secure the area. Elsewhere, Hera flies Ryder's U-wing through the rocks, staying close to the ground. She hears that the Empire has secured the crash site, and Kanan reassures her that Ezra and Sabine will be safe."}, {"tag": "h3", "text": "Escape"}, {"tag": "p", "text": "Ezra and Sabine, carrying the flight recorder, are forced to hide from the searchlights of Imperial gunships. Sabine insists that they have to keep moving. Ezra sees the Loth-wolf again, but Sabine doesn't. She recalls it as a creature depicted in cave paintings, and Ezra explains that it was native to Lothal, but that no one's seen one in a hundred years. At this point, the Loth-wolf comes up behind Sabine, and Ezra, nervous, gets her to turn around. The wolf puts her to sleep before looking at Ezra, who asks what he did to Sabine and reaches for his lightsaber. The white Loth-cat appears on the wolf's head, reassuring and surprising Ezra. When Imperial gunships appear in the distance, the wolf and cat growl, and Ezra notes that they don't like the Empire either. Ezra tells the wolf that the gunships are searching for them, and he offers him and the sleeping Sabine a ride. Putting Sabine on the wolf's back, Ezra then picks up her helmet and the data recorder and climbs on as well. The wolf runs, avoiding searchlights, and Ezra looks back as they flee before thanking the creature."}, {"tag": "p", "text": "The Loth-wolf drops Ezra and Sabine off near where Ryder's U-wing is landed, after daybreak. Ezra asks the wolf why it helped him, and it gives him a cryptic message, \"Dume,\" before vanishing. Sabine wakes up as the other rebels approach, and Hera is very glad to see the two safe. Zeb asks how they got back to the camp so quickly, and Ezra asks the others if they saw the wolf, only to discover him gone. Sabine says she remembers nothing of the journey except Ezra saying \"wolf.\" Ezra and Sabine show the others the flight recorder, and reveal that they hid the Elite's hyperdrive near the crash site. Zeb congratulates them on a job well done. As they walk back to Ryder's U-wing, Ezra asks Kanan about the wolf. Kanan believes Ezra, but is unsure of what is happening. He says that all paths are coming together, and that they'll know what that means when they get there. Behind them, the Loth-wolf watches the Rebels walk away."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Ezra Bridger refers to himself as \"Phoenix Six,\" when in reality he should've referred to himself as \"Spectre-6.\""}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}