{"url": "Flight_of_the_Falcon,_Part_2:_The_Planet_of_Misfit_Droids", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Flight of the Falcon", "Category:Star Wars Adventures (2017) backup stories"], "nodes": [{"tag": "h1", "text": "Flight of the Falcon, Part 2: The Planet of Misfit Droids"}, {"tag": "p", "text": "\"Flight of the Falcon, Part 2: The Planet of Misfit Droids\" is the second comic in the Flight of the Falcon publishing line, focusing on several droids from Lotho Minor. It was published as the secondary story of Star Wars Adventures 15 on October 31, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The junk planet"}, {"tag": "p", "text": "At a market the droid, Doc was telling a story to his counterpart, Teetee when they were told to stop by Bazine Netal. Netal was looking for information on the Millennium Falcon and the droids promised her the information. This time Teetee told the story, believing he could tell the story better the Doc."}, {"tag": "p", "text": "decades earlier, the Millennium Falcon touched down on the planet Lotho Minor. Teetee, and Doc decided to investigate what was going on before the Maker discovers the visitors. The smuggler, Han Solo ran out of the ship and congratulated Princess Leia Organa for discovering a junk planet for their rebel base. Luke Skywalker didn't think there was anything on the planet but Solo warned him to keep a look on the planet."}, {"tag": "p", "text": "They walked around the area but when looked heard strange noises he activated his lightsaber. Doc, Teetee, and a GNK-series power droid appeared but got immediately scared when they saw Skywalker's lightsaber. Teetee told them that they were in danger, Solo questioned what it was but was interrupted by a hooded figure standing by his ship. The figure introduced himself as Akar Duel, promising no harm. Solo began to boast about his ship but Duel stopped him again and told him that his ship was junk. On the planet they were on, junk was craved. Duel said he must have the Falcon. More droids appeared with their blasters drawn. Teetee tried to warn the droids to stop blindly following Duel's orders but it did not work. An EV unit tried to warn Teetee that he will be punished for his is obedience."}, {"tag": "h3", "text": "C-3PO unknowingly to the rescue"}, {"tag": "p", "text": "But then C-3PO came running out of the Falcon to report to Skywalker that there were droids on the planet but stopped when he realized what was happening. The EV unit questioned why 3PO was allowed to leave the ship without permission but C-3PO told them that he is allowed to come and go as he pleased. The EV unit along with all the droids realized that they two can act freely and turned on Duel. Princess Organa gave up on the planet and the Millennium Falcon left."}, {"tag": "p", "text": "Back at the market, Bazine Netal was angry with Teetee for not giving her the information she seeked. She grabbed the droid but he told her that he once heard that the bounty hunter, Embo once came in contact with her bounty and she knew just where to find him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}