{"url": "Flight_school", "categories": ["Category:Legends articles", "Category:Imperial military units", "Category:Schools"], "nodes": [{"tag": "h1", "text": "Flight school"}, {"tag": "p", "text": "Flight school was the name of the Imperial Navy's system for training TIE pilots. It was not a part of the Imperial Academy, however. Instead, the Navy's best junior officers would transfer to flight school after they left the Academy system. Only the top five percent of Navy cadets could enter flight school, although at the central Imperial Naval Academy, this eligibility was extended to the top third. These restrictions reflected the demanding nature of pilot training, and flight school itself had a 90% failure rate, but with such strict measures in place, the Academy system alone could not provide enough pilots for the Empire."}, {"tag": "p", "text": "As a result, additional flight school candidates included serving officers with proven potential, and skilled flyers from outside the Navy. The former group included men like T. Alvak, who had previously flown with a Navy shuttle unit for two years, while the most famous example of the non-military intake was perhaps Maarek Stele, who was put through flight school after just a two-month basic-training course."}, {"tag": "p", "text": "Flight school emphasized a hands-on approach, putting the young officers behind the controls of TIE fighters in a training squadron from about half way through their course. Although this was not a front-line unit, it was normally part of a front-line wing, so that cadets would fly under combat conditions even during their training. Reflecting this, many flight schools were located aboard Star Destroyers. The Tir training school was on the Inflexible, while the training squadron aboard the Victorious, the flagship of the Qeimet fleet, also provided new pilots for the Scimitar assault wing. The Vengeance also appears to have operated a flight school under Captain Trox."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A number of prominent characters advance from the Imperial Academy system directly to front-line postings as TIE pilots, including Soontir Fel's tour of duty with 6/37th aboard the Abrogator, and the service of Biggs Darklighter and Derek Klivian with Twilight Squadron aboard the Rand Ecliptic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}