{"url": "Flight_of_the_Falcon,_Part_5:_Grand_Theft_Falcon", "categories": ["Category:Real-world articles", "Category:Flight of the Falcon", "Category:Star Wars Adventures (2017) backup stories"], "nodes": [{"tag": "h1", "text": "Flight of the Falcon, Part 5: Grand Theft Falcon"}, {"tag": "p", "text": "\"Flight of the Falcon, Part 5: Grand Theft Falcon\" is the fifth comic in the Flight of the Falcon publishing line. It was published as the secondary story of Star Wars Adventures 18 on February 20, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Helping Solo"}, {"tag": "p", "text": "At Takodana Castle on the planet Takodana, Gannis Ducain worked at Maz Kanata's castle but wished to explore space instead. One day, he overheard a conversation between Kanata and the smuggler, Han Solo. Solo was without Chewbacca for his job but Ducain volunteered himself for the job instead. Solo agreed and warned Ducain about the dangers of the job. Ducain didn't listen as he was shocked to see the Millennium Falcon. Ducain told Solo that he wanted to be like him but Solo gave him a piece of advice. He told him that doing what was right was more important than being a smuggler, no matter how dirty the job is."}, {"tag": "p", "text": "The two arrived on the planet Christophsis, and Solo told Ducain to wait on the ship while he went out. After Solo took off, Ducain realized that this was his chance. He powered on the Falcon and took off."}, {"tag": "h3", "text": "Stealing the Falcon"}, {"tag": "p", "text": "Over the next years, Ducain became a smuggler and traveled to many planets with his stolen ship. He grew very wealthy and famous until one day on the planet, Vardos he met a First Order officer. The officer introduced himself as Ducain's employer and Ducain to be part of the new order coming to the galaxy. Ducain reluctantly agreed but he knew that he would have to run. He planned on returning the Falcon to Solo but the Irving Boys stole the ship before he could."}, {"tag": "p", "text": "Finishing up his story, Bazine Netal was in disbelief that all the people she has asked have all lost the Falcon. Ducain tried to argue but she didn't care. Ducain got up to leave and told Netal that he was off to join the Resistance. Netal stormed off but received a message on her holoprojector from Lady Proxima. Proxima told her that she had located the Millennium Falcon on the planet Batuu and Netal went off to find it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}