{"url": "Flint", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Dark Side Adepts", "Category:Former Sith", "Category:Humans", "Category:Males", "Category:New Jedi Order members", "Category:Sith Lords of Lumiya's Sith", "Category:Sith rejects", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Flint"}, {"tag": "p", "text": "Flint was a male Human native to Belderone who was the son of Clone Wars-era Jedi Knight Flint Torul. During the Imperial period, Flint was chosen by Darth Vader as his fourth pupil, following the destruction of his home and death of his mother, Zana. While Flint was in service as a stormtrooper, he received personal training from Vader so that he would eventually face Vader's other pupil, Lumiya, for the honor to be Vader's Shadow Hand. However, after Vader's death, the showdown took place prematurely, and resulted in Flint becoming the apprentice to the new Dark Lady of the Sith, Lumiya."}, {"tag": "p", "text": "Flint served under Lumiya as she prepared for the Nagai-Tof War and was sent to subjugate the Phelleem sector. He was also ordered to avenge Vader's death at Endor by confronting and killing the Sith Lord's own son, Luke Skywalker. Flint finally had a showdown with Skywalker on the planet of Naldar, but was unable to bring himself to overcome or kill the Jedi. In the end, his childhood friend, Barney, helped redeem Flint from the dark side of the Force, and he turned on his Imperial allies. After residing in prison for a time, Flint took to helping displaced peoples from the Galactic Civil War. This work continued until he was finally murdered by his old master Lumiya for his ultimate betrayal."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Flint was the son of a Jedi Knight, Flint Torul and a woman named Zana. Flint's father was killed during the Clone Wars by General Grievous near the end of the Outer Rim Sieges. Whether the Jedi knew of his son or if he was a legitimate child is unknown, but Zana was forced to raise her young son alone. To support their small family, Flint had to begin work at a young age. Zana worked the evening shift as a waitress in a cantina while Flint worked in a localized Imperial factory that was specializing in the production of AT-ATs."}, {"tag": "p", "text": "Although shifts at the factory were strictly enforced by the Empire, Flint constantly had his head in the clouds and dreamed of becoming a Jedi Knight like his father. Zana was in constant worry that Flint might miss his shifts at the factory, but her son's skill as a landspeeder pilot made sure that he was always on time. Flint's idealism also got on the nerves of his best friend Barney. While Flint became excited at any change of scenery, even the occasional spacecraft that landed in the Belderone spaceport, Barney always had to be dragged along, not sharing the enthusiasm that Flint possessed."}, {"tag": "p", "text": "During the height of the Galactic Civil War, the rebel heroes Luke Skywalker, Leia Organa, Lando Calrissian, and Chewbacca arrived on Belderone in the Millennium Falcon. As was their custom, Flint and Barney went to see the craft's arrival. Flint became ecstatic when he saw that Skywalker had a lightsaber clipped to his belt. Although Flint was sure that Skywalker and he had something in common with both of their fathers being Jedi, Skywalker denied it, in part because he had just recently discovered his father's true identity as Darth Vader."}, {"tag": "h3", "text": "Following a Jedi"}, {"tag": "p", "text": "Although Skywalker refused to acknowledge that he was a Jedi, Flint was confident that Skywalker would be the one to teach him to use the Force, and he led the rebels into the main city. Flint continued to follow Skywalker around, trying to work up the courage to ask the Jedi to train him. As Barney and Flint tried to casually spy on Skywalker a trio of Imperial assassins attempted to eliminate the rebel crew. The two friends watched as Skywalker's skills helped him easily eliminate the threat."}, {"tag": "p", "text": "Now confident that Skywalker was a Jedi, Flint decided to show the rebels the AT-AT factory on the world, knowing that they would want to eliminate it to weaken the Imperials' hold on the planet. However, when the group finally arrived at the factory they found it swarming with troops, including several active AT-ATs that were making their way towards Flint's hometown. As the rebels signaled their allies to attack the monstrous machines, Flint and Barney jumped in a landspeeder and sped towards town in hopes of warning the general populace, especially Flint's unaware mother. Unfortunately, Flint's piloting skills failed him and he crashed the craft just on the outskirts of the city. Flint and Barney were both knocked unconscious."}, {"tag": "p", "text": "Waking up the next morning, Flint found Barney still unconscious and believed him to be dead. One of the AT-ATs had managed to escape the rebel assault and had destroyed Flint's town. As Flint looked at his destroyed home, he realized that he had not been able to warn his mother in time, and sprinted into the city. Seeing his mother's cantina completely destroyed, he expected the worst. Among the wreckage Flint found his mother's lifeless body and broke down into a state of despair. He had not known how serious the situation was and blamed the rebels for allowing him to believe that he could make a difference."}, {"tag": "p", "text": "Flint promised himself that he would become someone who mattered, someone who would show everyone that he was not worthless. As Flint spoke his promises out loud, Darth Vader arrived and recognized the power within Flint. He told the young man that he could make Flint someone of great importance and offered him a place by his side. Flint happily agreed and decided to join the Empire. Vader immediately made Flint into one of his many stormtroopers, promising that in time he would train him to use the Force."}, {"tag": "h3", "text": "Fall to the dark side"}, {"tag": "p", "text": "Before long, Flint began to receive personal training from Darth Vader. Just as with Vader's other illegitimate apprentices such as Lumiya, and Galen Marek, Flint was kept secret from Emperor Palpatine. Flint slowly developed his Force powers eventually mastering the art of telekinesis and was able to sail boulders through the air with ease. Unknown to Flint, Vader was preparing him for a showdown with Lumiya to determine who would become his Shadow Hand when he decided to overthrow Palpatine."}, {"tag": "p", "text": "However, before this could take place, Vader died along with Palpatine at the Battle of Endor. Vader's death affected Flint greatly. He had grown to love Vader and saw him as the father he never had. With his beloved mentor's death, Flint retreated to the planet Vjun to grieve, eventually making his way to Bast Castle. In a state of despair, Flint was disturbed in his mourning by the arrival of Lumiya. After a fierce confrontation, Flint was defeated and taken on as Lumiya's first apprentice."}, {"tag": "p", "text": "With the roles of master and apprentice decided, Lumiya ordered Flint to subjugate the Phelleem sector while she prepared for the arrival of the Nagai and their imminent invasion. Flint was also given one final task, one which he was more than happy to accept: a mission to kill Luke Skywalker. Flint knew that Skywalker would eventually come to him as he and his men slowly conquered the Phelleem sector. Flint's reputation eventually led to an identity as the Dark Lord of Belderone in which he wore extravagant armor and wielded a red-bladed lightsaber."}, {"tag": "h3", "text": "Reunion"}, {"tag": "p", "text": "Flint's campaign in the Phelleem sector eventually led to the planet Naldar and a series of brutal battles took place. The entire royal family of Naldar was wiped out except for young Princess Vila who left to find help from the Rebellion. Her starfighter landed on the forest moon of Endor, and Vila requested to be trained as a Jedi by Luke to save her people from Flint's forces. Luke, Leia, and Barney decided to accompany her to Naldar. During the trip, Luke Skywalker was warned by the Force ghosts of Obi-Wan Kenobi, Yoda, and Anakin Skywalker that only he could redeem Flint. Anakin pleaded with Luke to undo the damage to Flint that he had done as Vader and was now unable to undo himself."}, {"tag": "p", "text": "Meanwhile, Flint waited for the rebel's return, preparing an ambush for anyone that decided to rescue Naldar. Eventually Flint's forces witnessed the arrival of the Millennium Falcon and surrounded the rebels. Flint told his men to stand down, and he personally confronted Luke, igniting his lightsaber. Luke and Flint engaged in a furious duel, matching each other blow for blow. Luke tried to reach out to Flint and convince him to turn away from the dark side, but Flint refused to listen. Eventually, one of Flint's stormtroopers was able to hit Luke in the arm with a carefully placed blaster shot, ending the fight. Now with the upper hand, Flint revealed to the rest of the rebels that he and his forces had prepared an enormous energy cannon to destroy the rest of the city and that it was too late to stop its activation."}, {"tag": "p", "text": "However, before Flint could signal his troops, his old friend Barney confronted him. Flint was shocked to see Barney still alive, and his resolve weakened. Barney asked Flint to turn away from the Empire and reexamine the atrocities that he had committed. The Dark Lord of Belderone found that he could not continue in his actions any longer and began to repent. One of Flint's stormtroopers witnessed his betrayal and prepared to execute his commander for his treason. However, the Imperial blaster bolt meant for Flint was intercepted by Vila, mortally wounding her. With another death on his conscience, Flint could no longer serve the Empire, and in his last act as a Dark Lord, he self-destructed the energy cannon, killing his Imperial allies and winning the day for the Rebellion."}, {"tag": "h3", "text": "Redemption"}, {"tag": "p", "text": "After his defection and capture, Flint was kept in a cell of Mandalorian iron on an Alliance safe-world for many years, in order to overcome his traumatic experiences as a darksider. He was eventually reformed and returned to Belderone to live out a simple life."}, {"tag": "p", "text": "After the destruction of the Crystal Star in the Crseih system, the New Republic sought to find a new home for the dislocated and enslaved Firrerreo freed by Leia and Rillao. With a passionate plea, Flint persuaded the Belderonian people to accept the Firrerreos to their world, although the two groups would later develop a rivalry which the Yuuzhan Vong manipulated to lead to the mutual extinction of both peoples."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Following the fall of the Disciples of Ragnos, Flint's body was found on Belderone, having apparently been stabbed through the throat by a lightsaber or a lightwhip. It appeared that Lumiya had taken revenge on her former pupil, after having vowed to deal with his treachery many years before. Flint was replaced by Carnor Jax, who almost took Palpatine's place on the throne."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Flint was an enthusiastic and compassionate individual during his early life. Much the same as Luke Skywalker, he had a dream to go off-world and become a Jedi like his father before him. However, when Flint finally thought that he had found someone just like him when Skywalker visited the world, the Jedi denied it, pushing Flint away. Although Flint's dream to be trained as a Jedi was hurt by Skywalker's refusal, he still maintained a positive attitude, trying to impress Skywalker enough to change his mind. This came to a crashing halt following the Empire's attack on his home town. He became a bitter and cynical individual, coming to an understanding that rising up against the status quo was a foolish idea."}, {"tag": "p", "text": "After his recruitment into the stormtrooper corps, Flint still kept a picture of his mother with him to remind him of his former life. However, his training under Vader completely warped his view toward events of the past, and he blamed Skywalker for his mother's death and the destruction of his town. When Flint finally came under Dark Lady Lumiya's influence, he was enveloped in hatred for the Jedi and was eager to track him down and punish him. When Flint finally faced Skywalker in a duel, he stated that he had purged himself of fear. The fight proved otherwise, and Flint's offensive was battered aside. He was only saved by a loyal stormtrooper hitting Skywalker with a blaster shot."}, {"tag": "p", "text": "Flint's hatred was finally broken by his friend Barney who finally reached Flint and reminded him of the truth about his mother's death. With his head finally clear, Flint was able to realize the evil he was perpetuating. He turned on his Imperial allies and repented, submitting to New Republic authority. Flint was obviously reformed during his imprisonment, and he was soon back to his compassionate ways, using his enthusiasm to help persons recover from the war. Flint died as a hero of the peace and a lesson to the dangers of the dark side."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Flint had an exceptional skill at controlling the landspeeder, which allowed him not to miss his shifts at the AT-TE factory. Although Flint was confident in his skill, it failed him when he rushed to warn his mother. Flint had enough Force potential to be chosen as Darth Vader's apprentice, but not enough to defeat Lumiya. After his training under Vader and Lumiya, Flint became adept at telekinesis, being able to push aside one of the stormtroopers on Naldar and to manipulate a boulder behind Skywalker's back. Flint was also skilled with the lightsaber and successfully utilized it against Skywalker. The latter himself acknowledged that Flint almost matched him in physical prowess and strength."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Flint was created by Mary Jo Duffy for use in the Marvel Star Wars comic series. The character had a backstory much the same as Luke Skywalker with a missing father that had been a Jedi Knight as well as an idealistic temperament and wish to go off-world. However, the character's final fate was ending up working for the Empire instead of against it. With these opposite fates and outcomes, it's likely that the character was made as a \"what could have been\" character in relation to Luke. Artist Jan Duursema viewed him as an analogy for Luke, sort of a, 'What if Luke had gone to the dark side?' kind of story."}, {"tag": "p", "text": "It also deserves to be mentioned that Flint's character begins his journey onto the dark path after seeing the death of his mother. This is notable because his mentor, Darth Vader, also witnessed the death of his mother before starting on the path towards the dark side. This information about Vader was revealed after the release of the Marvel comic during the prequel trilogy which makes this connection all the more interesting."}, {"tag": "p", "text": "Flint was used once again near the end of the Marvel series where Flint finally had a showdown with Luke. The fight was the first lightsaber battle between two Force users shown in the Expanded Universe, aside from the Luke-Vader battle in Splinter of the Mind's Eye, the battle he had with Kharys in the Star Wars Annual 1, and disregarding the fight that Luke had with Baron Orman Tagge who was not a Force-sensitive individual. It's interesting to note that the trick that Flint tries to use on Luke during the duel (flying a boulder through the air at Luke's back) is used again by Carnor Jax in his duel with Kir Kanos during Crimson Empire. This is even more interesting considering later retcons which made Jax the replacement apprentice to Lumiya following Flint's capture."}, {"tag": "p", "text": "When Star Wars artist Jan Duursema and writer Jo Duffy designed Flint's armor for the Marvel comic story The Dream, they wanted to hint at the samurai influences on Darth Vader's costume, but also wanted to pull in something stylistically unique to Flint. Duursema researched Far Eastern armor, as well as medieval armor, and tried to come up with a blend for Flint's costume."}, {"tag": "p", "text": "Flint was unreferenced until a minor reference in 1995's The Essential Guide to Characters which mentioned his exploits in the Marvel run. New information on Flint eventually came in 2001 in The Essential Guide to Alien Species which mentioned Flint's work with the displaced Firrerreo species. He was then referenced again later that same year in Abel G. Peña's first article, The Emperor's Pawns which among other things, confirmed Flint's apprenticeship to Lumiya during the Marvel series. After this, Flint was mentioned in another Peña work, Evil Never Dies: The Sith Dynasties which finally referenced Flint's death at the hands of Lumiya."}, {"tag": "p", "text": "It is interesting to note that the character of Flint was involved in the first works of both Abel G. Peña and Jan Duursema who did the art for Star Wars 92: The Dream, since both are fairly popular with the current Star Wars fandom."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}