{"url": "Fliry_Vorru", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Black Sun members", "Category:Corellians", "Category:Crime lords", "Category:Galactic Republic governors", "Category:Humans", "Category:Imperial defectors", "Category:Males", "Category:Moffs of the Galactic Empire", "Category:Personnel of Ysanne Isard's Thyferran regime"], "nodes": [{"tag": "h1", "text": "Fliry Vorru"}, {"tag": "p", "text": "Fliry Vorru was a famed Corellian Human male who served as a politician and criminal underlord."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imperial Moff"}, {"tag": "p", "text": "Vorru first appeared in known history as the governor of Corellia during the final years of the Galactic Republic. It is unclear what his relationship was with Diktat Shyla Merricope."}, {"tag": "p", "text": "When Emperor Palpatine declared his Galactic Empire in 19 BBY, Vorru was made Grand Moff of the Corellian Oversector and assumed the role of commander of the 2nd Sector Army."}, {"tag": "p", "text": "During his tenure as Moff, Vorru turned a blind eye to the growing presence of crime, giving birth to Corellia's reputation as a planet of smugglers and pirates. With his extensive political and criminal connections, Vorru wielded considerable influence by 7 BBY[source?]. It was then that Prince Xizor, Vorru's principal rival, framed the Moff to balance his growing power and allow the placement of a Black Sun lieutenant on Corellia. It is unclear for what crime Vorru was framed. It was stated by some, including Booster Terrik and Vorru himself, that the Emperor saw Vorru as something of a rival for power—as Vorru was considered as charismatic, clever, and popular—and jumped at the chance Xizor's phony evidence provided."}, {"tag": "h3", "text": "Black Sun"}, {"tag": "p", "text": "Following the death of Xizor, Vorru gained control of Black Sun's remnants. For years, Vorru served in the spice mines of Kessel until he was liberated by Rogue Squadron for use in their plot to distract Imperial authorities during their infiltration of Coruscant. During his tenure in the mines, Vorru met Booster Terrik. Booster recognized Vorru as a dangerous individual as Vorru confidently expected some “loyal son of Corellia” to one day liberate him from his prison and was prepared to wait. Wedge Antilles agreed to release Vorru as a counterweight to the psychotic and dangerous Zekka Thyne."}, {"tag": "h3", "text": "Release"}, {"tag": "p", "text": "When Vorru made planetfall on Coruscant, he might well have struck a deal with Ysanne Isard to keep from being rearrested in exchange for helping her out. Certainly his abilities revived Black Sun as a force to be reckoned with. Isard may have leaked her plan of the Krytos virus to Vorru so he could begin stockpiling bacta for the shortages which would result once the virus was released into the water supply."}, {"tag": "p", "text": "After Coruscant fell to the New Republic, Vorru was asked to develop the Imperial Center People's Militia to bring the leaderless criminal underworld under his control. With the approval of the Provisional Council, who were strapped for resources, Vorru began a complicated game of allegiances, playing Ysanne Isard, Kirtan Loor, and the New Republic against one another. Kirtan Loor, who was leading the Palpatine Counterinsurgency Front, deeply resented Vorru's manipulations and orders. Vorru kept Loor on a short leash and once ordered Loor to blow up a school to cause panic, thus making the New Republic more dependent on the Militia. Despite his efforts to advance his own agenda, Vorru eventually became a pawn of Isard, providing inaccurate information to the New Republic that allowed Isard to flee Coruscant."}, {"tag": "p", "text": "Vorru fled alongside Isard, who appointed him the Minister of Trade on Thyferra. Vorru despised his time on Thyferra as he preferred a more urban, cosmopolitan environment. He also recognized that Isard was becoming more and more obsessed with Wedge Antilles rather than re-establishing the Empire. He made contingency plans by embezzling money from the Thyferrans and planned to escape with Erisi Dlarit. As the Battle of Thyferra reached its apex, Vorru attempted to flee Thyferra, but was trapped by Elscol Loro and Iella Wessiri. Vorru attempted to bluff his way out of the situation claiming that he knew too much about the dirty secrets of New Republic Councilors to ever face trial. Wessiri agreed and then encouraged Loro to shoot Vorru with a bolt intended to kill him, unaware that her blaster had been set to stun by Wessiri. Vorru was captured and brought to the New Republic to be tried for his crimes."}, {"tag": "p", "text": "Following his arrest and imprisonment, Vorru was returned to the Spice Mines of Kessel. His former lieutenant Y'ull Acib took his place as Black Sun leader."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Vorru was incorrectly spelled \"Flirry Vorru\" in The Emperor's Pawns and The New Essential Chronology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}