{"url": "Flitknot_Speeder_Bike", "categories": ["Category:Canon articles", "Category:Confederacy of Independent Systems repulsorcraft", "Category:Speeder bikes"], "nodes": [{"tag": "h1", "text": "Flitknot Speeder Bike"}, {"tag": "p", "text": "The Flitknot Speeder Bike, also known as the Flitknot Speeder, Geonosian Speeder, or the Separatist speeder, was a model of speeder bike used by the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Flitknot Speeder was the preferred speeder bike of the Sith Lord Count Dooku. These bikes were fast and maneuverable, enough so that it was able to outrun a Galactic Republic gunship. Being of simple design, this speeder had more bulk located at its rear in the engines than anywhere else. It had dual handholds and dual footholds, making them ideal for humanoids to use."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Count Dooku used a Flitknot Speeder Bike during the First Battle of Geonosis to escape from the Stalgasin hive to his secret hangar. He abandoned the vehicle once he left Geonosis in his solar sailer. He later used a Flitknot to meet Anakin Skywalker and duel him on Tatooine. Following the duel, Skywalker stole the speeder to escape the Dune Sea and head for Jabba the Hutt's Palace."}, {"tag": "p", "text": "At least one Flitknot speeder, painted in the Separatist color scheme, was present on Naboo, it was used by TR-350 on a patrol prior to the Blue Shadow Virus incident."}, {"tag": "p", "text": "During the Second Battle of Geonosis, Flitknot speeders were extensively used by the Geonosians, and many Commando droids used Flitknot speeders during the Battle of Kiros. Clone troopers used captured speeders to go to places on Coruscant. One was used by clone trooper Fives when he was trying to escape from other clones to prove his innocence when he was framed for the attempted murder of Supreme Chancellor Sheev Palpatine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}