{"url": "Flix", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Colossus residents", "Category:Flix's flock", "Category:Gozzo", "Category:LGBTQ+ individuals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Flix"}, {"tag": "p", "text": "Flix was a male Gozzo who ran the Office of Acquisitions on the Colossus with his partner Orka."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Flix was born on Drahgor III, where his flock ran a fuel refinery. Feeling that his homeworld was backwards, Flix eventually left with plans to become a cantina singer, something his cousin Flanx looked down on him for. Flix never achieved this dream, and by 34 ABY, he was running the Office of Acquisitions shop, which sold salvaged starship parts, with his Chadra-Fan partner Orka on the Colossus platform. They were assisted by a DUM-series pit droid named G-LN. Flix was the one in charge of the administrative side of their common business."}, {"tag": "h3", "text": "Meeting Kaz"}, {"tag": "p", "text": "During the New Republic era, Flix and Orka were visited by the Resistance spy and \"mechanic\" Kazuda Xiono, who had unwittingly found himself competing with Ace Squadron pilot Torra Doza. Xiono was looking for spare parts for the racer Fireball. Flix initially did not take Xiono seriously until his fellow mechanic and friend Neeku Vozo produced an acquisition order. Since Xiono lacked the funds to pay for the starship parts, Flix agreed to wage a hundred credits on the Fireball. Orka agreed to give Xiono spare parts if he could obtain a gorg for them for lunch. By the time Xiono arrived, Flix and Orka were already having their lunch. Nevertheless, they gave them three boxes of old spare parts."}, {"tag": "h3", "text": "Kaz's second visit"}, {"tag": "p", "text": "Flix and Orka were later present at their shop when Kaz visited to purchase a CX-19 compressor. While Kaz was purchasing the compressor, Flix took an interest in Kaz's lucky trophy but the youth refused to part with his prize, which he had won during a space race. Shortly after, another of Jarek Yeager's employees Tam Ryvora entered the store and chastised Xiono for running behind schedule. Later that day, the Colossus was raided by the Quarren pirate Kragan Gorr's Warbird gang."}, {"tag": "h3", "text": "The tri-tracker chip"}, {"tag": "p", "text": "While searching for a CoMar Tri-Tracker chip to install on the Colossus' anti-aircraft defense system, Kaz and BB-8 visited the Office of Acquisitions. After Orka claimed that they had the tri-tracker chips along with hyperdrive cores and kyber crystals, Flix revealed that Orka was bluffing. Flix then advised Xiono to seek the scavengers before laughing at Orka's remark about them having kyber crystals. Xiono managed to obtain a tri-tracker chip from the undercover pirate Synara San. Team Fireball managed to repair the anti-aircraft defense but not before a second pirate raid on the Colossus."}, {"tag": "h3", "text": "The botched robbery"}, {"tag": "p", "text": "One day, Flix and Orka were robbed by the Snivvian criminal Narb, who forced them at gunpoint to hand him several crates. As Narb exited the Office of Acquisitions, Orka activated a trapdoor, which caused Narb to fall. Flix then captured the crates before they fell. Later, Narb's brother Nod entered the shop searching for his brother and also fell down the trap door."}, {"tag": "h3", "text": "Unwanted treasure"}, {"tag": "p", "text": "Flix and Orka later bought a treasure chest from the salvager and undercover pirate Synara San. After some difficulty, Orka managed to open the chest only to discover that it was full of thermal detonators. When Orka accidentally activated the detonators, Flix tried to switch them off. Fortunately, the detonators did not explode. After disposing of the treasure chest and detonators at sea, Flix and Orka purchased a second chest from Synara with Flix quipping that he loved surprises."}, {"tag": "h3", "text": "Drinks at Aunt Z"}, {"tag": "p", "text": "Flix and Orka later went for drinks at Aunt Z's Tavern with their pit droid G-LN. After Orka served G-LN some blurrgfire, the pit droid went on a hyperactive rampage, annoying two serving droids including Glitch and the Klatooinian merchant Bolza Grool. These ganged up on G-LN and roughed up the droid. Flix and Orka found him and surmised that the blurrgfire did not agree with G-LN."}, {"tag": "h3", "text": "Hype's droid"}, {"tag": "p", "text": "Later, Ace leader Hype Fazon brought his astromech droid R4-G77 for Flix and Orka to examine, believing that he had an damaged motivator. However, R4-G77 did not want to be examined and fought the two merchants, throwing the shop into disarray. Orka managed to subdue him. When Flix remarked that it was not so bad, Orka agreed before slumping to the floor in exhaustion."}, {"tag": "h3", "text": "The phase connector theft"}, {"tag": "p", "text": "In return for supplying starship components to Team Fireball, Flix and Orka managed to hire Xiono to look after their shop and their pet gorg Bitey for a day. Flix and Orka left to visit Flix's mother with their pit droid G-LN. However, the First Order agent Teroj Kee had been monitoring their communications and attempted to steal a phase connector, which they had sold to a mining company. Teroj damaged their shop during a fight with BB-8 and escaped with the phase connector. However, Kaz managed to sink their freighter with the help of Bitey."}, {"tag": "p", "text": "After returning to their shop, Kaz recounted Teroj's attempted heist to Flix and Orka. When Kaz asked what a phase connector was used for, Flix explained that it was used to crack open asteroids and planetoids for heavy mining. While the two were pleased that they had stopped Teroj from escaping offworld with the technology, they insisted that Kaz clean up the mess. Later, Kaz and BB-8 reported the First Order's interest in the phase connector to the Resistance."}, {"tag": "h3", "text": "The First Order occupation"}, {"tag": "p", "text": "After Kaz and his friends submerged the Colossus in order to send a distress call to the Resistance, Kaz and CB-23 encountered Flix, Orka, their pet gorg Bitey, and droid G-LN hiding inside a chest while heading towards Doza Tower. Flix and Orka told Kaz that their plan to escape the First Order was to smuggle themselves out in a crate to Flix's mother on Talivar. Flix and Orka were skeptical that Kaz's plan to liberate the Colossus from the First Order would succeed. Ultimately, they were proven wrong and Kaz and his resistance cell managed to expel the First Order and take the Colossus into hyperspace."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Flix had white fur and black eyes. Flix liked to claim that his father was part Gungan, a claim that Orka found implausible. While Orka was more of a joker, Flix appeared to be the more serious of the two."}, {"tag": "p", "text": "When Flix was young, he regarded his homeworld of Drahgor III as backward and despised his family's work as miners. Flix had dreams of becoming a cantina singer but proved unsuccessful, opting to become the co-owner of a starship parts store called the \"Office of Acquisitions.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Flix is a character created and developed for Star Wars Resistance. He is voiced by Jim Rash. The first time Rash saw the character, he believed Flix was a porg, a species first introduced in Star Wars: Episode VIII The Last Jedi. The character was designed by Amy Beth Christenson, based on Ralph McQuarrie's early concept sketches for the Ewoks. During the Coffee with Kenobi podcast on September 30, 2019, producers Justin Ridge and Brandon Auman confirmed that Flix was in a romantic relationship with Orka."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}