{"url": "Florrum/Legends", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Confederacy of Independent Systems planets", "Category:Desert planets", "Category:Florrum locations", "Category:Sertar sector planets"], "nodes": [{"tag": "h1", "text": "Florrum"}, {"tag": "p", "text": "Florrum was a rocky, backwater planet located six parsecs from Vanqor in the Outer Rim Territories."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Florrum had a dry climate and the surface of the planet was a mixture of deserts, canyons and areas with many sulfuric geysers. Skalders were creatures native to the Doshar fields with thick hides that protected them from the acid coming out of the geysers. Other species living on Florrum were Weequays, Jawas, Nikto and Bith."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Capture of Dooku"}, {"tag": "p", "text": "A Weequay pirate gang led by Hondo Ohnaka had its headquarters located on Florrum. After their capture of Count Dooku, they returned to the planet with the Sith Lord. Later it was there that Ohnaka captured Jedi Obi-Wan Kenobi and Anakin Skywalker after they came to check that Dooku was there to pay the ransom for him. They escaped soon after, with the help of Representative Binks, Commander Stone and several clone troopers. The planet was then left in peace by the Republic, but Kenobi told Ohnaka that Dooku did not have the same honor and kneeboarding where Ohnaka was."}, {"tag": "h3", "text": "Boba Fett's Arrival"}, {"tag": "p", "text": "Following an incident in which Boba Fett and Aurra Sing, alongside fellow bounty hunters Bossk and Castas, took Republic hostages in the aftermath of an attack as part of Boba Fett's revenge scheme against Mace Windu, the need to take shelter on a distant planet arose. Sing therefore commandeered Slave I and landed on Florrum to seek the aid of Hondo Ohnaka, whom Aurra Sing wanted to replace Castas, due to his desire to quit the mission. While Ohnaka allowed the group and their captives, among them Admiral Shoan Kilian, to take refuge with his gang, he refused to aid them in their endeavors. Meanwhile, Boba Fett was becoming increasingly disillusioned with Sing's methods, most especially after she killed Castas when he attempted to turn the other bounty hunters in. Shortly thereafter, Plo Koon and Ahsoka Tano arrived on Florrum in pursuit of the bounty hunters, having heard Castas' message to his underworld friends back on Coruscant. After a brief skirmish in Ohnaka's cantina, Sing escaped the Jedi, leaving Boba Fett to be captured. Ahsoka pursued Sing, while Ohnaka convinced Fett that assisting the Jedi would be the honorable thing to do. While attempting to escape aboard Slave I, Sing was seemingly killed when the ship crashed as a result of Ahsoka's efforts. Boba Fett and Bossk were then taken back to Coruscant by the Jedi, and the hostages were freed. Unbeknownst to them, however, Ohnaka had managed to retrieve Aurra Sing from the wreckage of Slave I, allowing her to survive and undertake future missions."}, {"tag": "h3", "text": "Crash landing"}, {"tag": "p", "text": "Shortly after Cad Bane and his accomplices broke Ziro the Hutt out of Galactic Republic imprisonment, Shahan Alama, one of Cad Bane's accomplices, was caught in a battle over Florrum, while trying to hide from the Republic in the Outer Rim. A Republic gunship, which was under attack by a Munificent-class star frigate and several starfighters, shot Alama's saucer craft down. Shahan was forced to make an emergency landing on Florrum's rocky surface, where he met Hondo Ohnaka and was captured by him."}, {"tag": "h3", "text": "Rescue Mission"}, {"tag": "p", "text": "Later during the Clone Wars, a group of younglings planned to rescue their chaperon, Jedi Padawan Ahsoka Tano, after she was kidnapped by Hondo and his pirates following a raid the pirates conducted on their Jedi training cruiser, the Crucible. Once landed on Florrum's surface, the younglings go scout for the pirates, but instead find a circus vessel led by Preigo. They impress the circus leader with their stunts and acts and join his circus. While preforming at Hondo's base, they managed to free Ahsoka and escape the outpost."}, {"tag": "h3", "text": "Second battle of Florrum"}, {"tag": "p", "text": "General Grievous, under the orders of Count Dooku, launched an attack on Obi-Wan Kenobi's fleet for control over the Florrum system. The Separatists were victorious and Kenobi and the surviving members of his crew were forced to flee. Kenobi and CC-2224 activated their ship's self destruct system just before they fled. Grievous then lead a ground assault on Florrum where they easily took over the pirate stronghold and held Ohnaka and his men captive. Some of Ohnaka's men, along with Ahsoka and the younglings, managed to infiltrate the base and free him and the rest of the pirates. Ohnaka then fled to his secret starship vault with his men and was ready to leave Florrum, but at the urging of one of the younglings, piloted Slave I and rescued Ahsoka and the other younglings. Ohnaka and his men then returned to Florrum after returning Ahsoka and the younglings to Kenobi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}