{"url": "Foerost/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Core Worlds planets", "Category:Foerost locations", "Category:Galactic Republic planets", "Category:Mandalorian planets", "Category:Mining planets", "Category:Planets with shipyards", "Category:Sith planets", "Category:Techno Union planets"], "nodes": [{"tag": "h1", "text": "Foerost"}, {"tag": "p", "text": "Foerost was a Core planet on the Koros Trunk Line between Kuar and Kaikielius. It was orbited by the Foerost Shipyards, which was one of the Republic's largest and oldest shipyards. It even held the title of largest, and highest quality ships in the galaxy till Kuat later usurped the title in the Clone Wars. The shipyards' engineers removed raw materials from the planet and transported them to the shipyards in high orbit."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet was originally a vassal colony of Kaikielius, but had achieved full Republic membership by 11,000 BBY."}, {"tag": "p", "text": "The Foerost Shipyards were engulfed by Naga Sadow's fleet during the Great Hyperspace War."}, {"tag": "p", "text": "In 3996 BBY, during the Great Sith War, a combined Krath/Mandalorian fleet stole 300 Galactic Republic warships from the shipyards for use in an assault on Coruscant. In 3959 BBY, Sith Lords Revan and Darth Malak stole a major Republic fleet from the shipyards, triggering the Jedi Civil War. In 522 BBY, the shipyards were purchased from the Republic by the Techno Union."}, {"tag": "p", "text": "In 22 BBY, the Techno Union secretly tightened the security of the shipyards, in preparation for the Clone Wars. Later during that conflict, the system was blockaded by the Republic. In 20 BBY, the Techno Union broke the Republic blockade through the use of a fleet of Bulwark Mark I battlecruisers, setting off the epic Battle of Foerost. This fleet ravaged Sector Zero until it was stopped by a fleet of Victory-class Star Destroyers, the Victory Fleet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}