{"url": "Fogger", "categories": ["Category:Legends articles", "Category:EF76 Nebulon-B escort frigates", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Fogger"}, {"tag": "p", "text": "The Fogger was an EF76 Nebulon-B escort frigate that served with the Imperial Navy during the Galactic Civil War. The vessel was sent to relieve the Imperial I-class Star Destroyer Hammer in the Javin system, where the space station Outpost D-34 was located, after the Battle of Hoth."}, {"tag": "p", "text": "The Rebel Alliance had forces in the area that were working closely with the Mugaari pirates. When intelligence received reports of an arms deal between the two groups at a Cargo loading area in the Tungra sector, the Fogger was sent to stop the deal. Upon exiting hyperspace, Fogger launched its TIE Bombers and Interceptors. The Mugaari had a number of Y-wings defending the pirate and Rebel cargo ferries and transport, but the interceptors were able to keep them off the bombers, while they could engage the cargo ships. The engagement was short, and before long, the Rebel and Mugaari ships were completely destroyed."}, {"tag": "p", "text": "In the frigate's absence from the Javin system, the Rebel Alliance was able to launch their own attack, successfully capturing D-34. When Fogger returned, they found the Rebels looting the space station for equipment. TIE Interceptors were quickly launched from the frigate, who engaged the small group of ships defending the station. Fogger launched stormtrooper transports to disable and recapture D-34. They were also successful in capturing a container transport that was attempting to escape with the stolen equipment from the station."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Fogger was introduced as a Nebulon-B escort frigate during the attack on the Mugaari cargo area. However, in the following mission, the model used in the game was a Nebulon-B2 frigate. Nonetheless, the mission always refers to the vessel as \"the frigate Fogger\", so it was presumably a blooper on the part of the game developers, although it can be retroactively explained as a swift refit of the ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}