{"url": "Folaris", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Coruscant Security Force officers", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Folaris"}, {"tag": "p", "text": "Folaris was a Human female who lived on the planet Coruscant during the Cold War between the Galactic Republic and the Sith Empire. She served as a police officer for the Coruscant Security Force, working as an undercover agent in the Black Sun territory. Around 3643 BBY, Folaris discovered that the Black Sun criminal syndicate was planning to purge several members—informants and rival gang leaders—it suspected of undermining its operations. Folaris wanted access to that list so that the persons targeted could be warned. However, she also saw an opportunity in selling the list: if the names went public, the targeted persons would possibly be warned and Folaris would be able to supplement her income. A Republic individual whom Folaris had recruited to help her convinced her not to sell the list but turn it over to her superiors."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female, Folaris lived on the planet Coruscant, where she served as a police officer with the Coruscant Security Force. During the Cold War between the Galactic Republic and the Sith Empire, Folaris was assigned as an undercover agent in the Black Sun territory. There, Folaris developed a list of contacts and informants to help her get information on the Black Sun criminal syndicate. Around 3643 BBY, Folaris discovered that leaders in Black Sun were planning a purge of suspected spies and rival gang leaders. The mass executions would cost Folaris her network of informants and the lives of innocent people. Folaris knew that she could slice the computers of Black Sun and retrieve the list of targeted persons, but she needed to be able to prevent Black Sun from tracing her."}, {"tag": "p", "text": "She was able to convince a Republic individual to assist her by going inside the Black Sun Headquarters and disabling the tracing equipment. The individual did so and returned to Folaris, who had been able to retrieve the list. At that point, Folaris suggested to the individual that a good amount of money could be made from selling the list to an information broker named Nizkif at the Dealer's Den cantina on Coruscant, where Folaris was well known. However, the individual convinced Folaris that selling the list would cause more harm than good, and she should turn the names over to her superiors."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Folaris had light-colored skin, blue eyes, and red hair. She served as an undercover police officer in one of the most dangerous areas of Coruscant with determination, if also frustration. Folaris felt that for the risks she was asked to take, she was not compensated financially enough to make the effort worth it. Though Folaris claimed loyalty to the people of Coruscant, she also had a certain amount of personal greed. When the opportunity came to sell the list of Black Sun targets, Folaris jumped at the chance, despite her duty as a cop. However, Folaris was not so consumed by her resentment and greed that it took much convincing for her to abandon her scheme."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Folaris appears in the mission \"Partial Eclipse\" in Star Wars: The Old Republic, a massively multiplayer online roleplaying game by BioWare released on December 20, 2011. The player can choose to alternatively agree to selling the list of names to Nizkif by meeting him in the Dealer's Den Cantina and thereby receive dark side points. The player can also choose to cheat Folaris out of the money."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}