{"url": "Fondor", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Articles with gameplay alternatives", "Category:Fondor locations", "Category:Galactic Empire planets", "Category:Planets with shipyards", "Category:Tapani sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Fondor"}, {"tag": "p", "text": "Fondor was a planet located in the Colonies region. During the reign of the Galactic Empire, Fondor served as a massive manufacturing hub for the Imperials, featuring dozens of orbital shipyards known as the Fondor Shipyards. Late in the Galactic Civil War, Fondor served as the site of two attacks from the Rebel Alliance against the Empire, the latter of which resulted in an Imperial defeat. During the First Order/Resistance War, the shipyards were seized by the First Order."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Fondor was a planet which was situated in the Colonies region of the galaxy, within grid square L-13. It featured a purple surface, covered by interconnected bright lines and circles. Fondor also had at least one moon."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In the last years of the Galactic Republic, an important part of the planet Eriadu's economy was the shipping of lommite to Fondor via Malastare. During the Separatist Crisis, Count Dooku, the leader of the Confederacy of Independent Systems, argued that Fondor would join the Confederacy instead of the Republic in an attempt to convince Eriadu's Governor Wilhuff Tarkin to side with the Confederacy. Tarkin doubted that Fondor would join willingly, suspecting the Confederacy might capture the world by force. He ultimately rejected the offer, siding with the Republic, which later emerged victorious in the ensuing Clone Wars and was reformed into the Galactic Empire."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "With the formation of the Empire, Fondor became a manufacturing center, with its large shipyards becoming on par with those at Scarif and Kuat. Fondor became home to loyal Imperial citizens, scientists, and officers. Its shipyards were used for Imperial research and development of classified technologies. The climate disruption arrays, among other projects, could trace parts of their early development to Fondor."}, {"tag": "p", "text": "In 14 BBY, the Imperial-class Star Destroyer Sovereign was stationed at Fondor with Commander Abel LaSal stationed onboard."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "At some point during the Galactic Civil War, the Fondor Shipyards came under attack by Rebel forces lead by Major Shin. While the Rebels attempted to destroy an Imperial II-class Star Destroyer docked at the shipyards for repair, Colonel Brenna and her fighters mobilized to defend it."}, {"tag": "p", "text": "Sometime after the Battle of Endor, Commander Iden Versio of Inferno Squad was recalled to a shipyard above the planet and received orders for Operation: Cinder from her father and a sentinel droid. After securing the climate disruption arrays to the ISD Dauntless, the shipyards were attacked by the Rebel Alliance. Shortly before the Battle of Jakku, another battle took place between Imperial and New Republic forces, which resulted in the defeat of the Galactic Empire."}, {"tag": "h3", "text": "First Order-Resistance war"}, {"tag": "p", "text": "The Resistance came to Fondor looking for help but were refused it. Sometime after, the First Order came to the planet seeking any traces of the Resistance. Despite Fondor's past loyalty to the Empire, history of independence and denial of the Resistance's plea for help, Supreme Leader Kylo Ren ordered the shipyards seized under charges of treason, and killed a Fondor official who protested these actions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fondor was first mentioned in the new Star Wars canon in the novel Tarkin, written by James Luceno and released in 2014. It made its first full appearance in the campaign of DICE's 2017 video game Star Wars Battlefront II. Fondor had previously been created for the Star Wars Legends continuity's novel Han Solo at Stars' End, written by Brian Daley and released in 1979."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}