{"url": "Fondor_Spaceport", "categories": ["Category:Legends articles", "Category:Satellites", "Category:Spaceports"], "nodes": [{"tag": "h1", "text": "Fondor Spaceport"}, {"tag": "p", "text": "Fondor Spaceport was a large orbital spaceport in the space above the planet Fondor. It shared the skies with the Fondor Shipyards."}, {"tag": "p", "text": "The two-kilometer-long tubular orbital station was lined with 160 pressurized hangar bays and had two deflector-shield projectors—geodesic domes that hugged the station's hull-like massive blisters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 23 BBY, Jedi Knight Bultar Swan spent some time at the spaceport while on a mission to settle a conflict between Fondor and its moon, Nallastia. Groodo the Hutt, in collusion with Senator Rodd and Hurlo Holowan, later took over Fondor Spaceport with his Droid Control Army. But his efforts to destroy it were thwarted by the Jedi Order, whose Knights joined with Nallastia's Skull Queen, the Margravine Quenelle, to disable the defense shield projectors and handily dispatch Groodo's modified high-tech droids."}, {"tag": "h3", "text": "Star power"}, {"tag": "p", "text": "Ignoring the Droid Control Army's order not to land, Jedi Master Mace Windu, piloting a Republic cruiser, drew within 50 meters of the massive spaceport, when the Stars of Nallastia they were carrying caused the spaceport's exterior to suddenly illuminate by a brilliant flash of blue light: the deflector shields and their projectors were instantly rendered impotent by the Skull Queen's power gems. Following the shuttle tracker of Princess Calvaria, the Queen's daughter, Mace steered the cruiser into one of the spaceport's hangar bays."}, {"tag": "p", "text": "Jedi Kit Fisto and Bultar Swan joined Windu and Quenelle to liberate the spaceport. As part of the Hutt's Droid Control Army, a GNK power droid modified with a rapid-repeating blaster in its upper casing was encountered by the Jedi strike team. Master Windu handily defeated it with his lightsaber, neatly severing the blaster that had emerged from beneath a lid in the droid's upper frame. Also encountered by Windu in a spaceport security office were two specially modified astromech droids—cylindrical-bodied, dome-headed droids with concealed panels to extend a manipulator-gripped fusion-cutter, a cutting tool that emitted a high-energy plasma beam."}, {"tag": "p", "text": "Master Windu discovered from the security office's records that Fondor Spaceport had been infiltrated and seized by a total of twelve unauthorized droids, which had then forced all 'organics' into Hangar 173. Mace noted that six droids were currently guarding the captives. Windu had already defeated three enemy droids, which left—in addition to the six in Hangar 173—three more droids at large elsewhere in the spaceport. The security computer could not ascertain, unfortunately, the location of the three unaccounted-for droids."}, {"tag": "h3", "text": "Hangar 173"}, {"tag": "p", "text": "Quickly moving to Hangar 173, where he indeed found a large group of FX medical assistant droid-guarded captives on the landing pad, Windu advanced high on a catwalk toward the droids—each one equipped with precise manipulator arms and a single primary grasping arm. Indeed, they, like their counterparts in the Droid Control Army that Windu had already dealt with, would not have seemed out of place on a space station under normal circumstances—which undoubtedly was the reason they'd so easily been able to infiltrate the spaceport. But the present circumstances were far from normal, and instead of wielding medical tools, each FX droid brandished numerous deadly weapons. All six units, moreover, were mounted on treadwell bases, allowing them greater mobility than a standard-issue FX droid."}, {"tag": "p", "text": "Windu took the controls of the hangar's tractor-beam projector to trap three of the FX units in the projector's force field and push them through the docking port, out into space, where they tumbled off in the direction of Fondor's sun. The droids had been far enough away from the captives for Windu to do this, but the remaining droids were not, and Mace knew that he had to draw their fire away from the beings on the landing pad. Yelling for the captives to get down, he raced along the catwalk as the remaining droids fired their weapons at him. Reaching a service gantry, he noticed an electromagnetic pincer crane suspended from the hangar's ceiling, directly above one of the remaining FX droids. Windu leaped from the gantry, dragging his lightsaber through the crane's ceiling mount, and landed on the hangar floor simultaneously with the crashing crane, which crushed the droid. As the two remaining droids rolled toward Mace, the Jedi Master used the Force to push one of them over the edge of a deep, rectangular hydrolift well (used to transport cargo to different levels). Its impact after falling down the shaft produced a satisfying explosion."}, {"tag": "h3", "text": "Princely heroics"}, {"tag": "p", "text": "As the last FX unit prepared to fire at Windu from its protective cover behind a column, without warning, one of the captives heroically attempted to run at the droid and take it down before it could harm the Jedi. But before he could reach the droid, the FX unit spun and struck him with a stun baton. The young man—dressed in mechanic's coveralls—was instantly paralyzed, and he collapsed to the hangar floor. \"Rench!\" a young woman shouted, as she raced from the landing pad towards the would-be-hero: it was Princess Calvaria, whom Windu recognized from her holographic appearance at the Skull Queen's fortress."}, {"tag": "p", "text": "The FX droid seized the Princess immediately with its three manipulator arms, used the stun baton on her, and she fell limp. Lifting her unconscious form, the droid used four other manipulator arms—aiming one blaster pistol at Calvaria, a second towards the landing-pad captives, a third at Rench's motionless form, and a fourth pistol at Mace. The droid's black photoreceptor was trained directly on Windu, as if challenging him to make a move, and he knew it would not hesitate to fire any one of its blasters. Soon Swan and Fisto came rushing into the hanger, their lightsabers drawn, and Windu calmly told his allies to lower their weapons. Still clutching the Princess, the FX droid moved slowly back and exited the hangar bay. Mace directed the other Jedi to stay and protect the former captives while he pursued the droid."}, {"tag": "h3", "text": "FX rogue"}, {"tag": "p", "text": "Tracking the FX unit to the Flight Control hangar, Mace also discovered there the three remaining, previously unaccounted-for droids—they were astromechs, and they were jacked into a broad console. Windu spotted the FX droid as it carried Calvaria into one of the light starships resting at the far end of the hangar (an ion-powered Incom Corporation landing craft with a large, single-aft thrust vector). Just as he was about to run after the droid, he saw on the astromechs' wide-console monitor a digital image of the spaceport's position relative to the planet Fondor, with a ticking numerical counter, and he suddenly realized Groodo's plan: having destabilized the spaceport's orbit, the droids were deliberately steering it into Fondor's atmosphere."}, {"tag": "p", "text": "As the starship angled to take off from the hangar's docking port, Mace quickly removed a palm-sized tracer beacon from his utility belt and hurled it at the craft's hull, its magnetic grips catching just as the ship blasted out of the hangar. Windu then turned, his lightsaber ablaze, to dispatch the astromechs that had raised from various panels their modified appendages, ready to strike, including micro-laser cannon periscopes raised from their domes. Their fired energy bolts, no match for the skill of the Jedi Master who deftly deflected them, came fiercely back at them, leaving all riddled with holes. Then, in a wide arc, Mace dragged his lightsaber through the droids, severing their domes from their bodies, which he kicked away from the console. He quickly switched the spaceport's flight controls over to manual, making several adjustments until the spaceport had entered a safer orbit. When the Skull Queen rushed in, Windu directed her to relay a message to Kit Fisto to have a complete diagnostic run on the spaceport by one of their own astromechs while he went after Quenelle's daughter."}, {"tag": "h3", "text": "Rescuing a princess"}, {"tag": "p", "text": "Sprinting for a Kuat Systems Delta-6 starfighter, Mace leaped into the cockpit and fired up its engines. Within seconds he'd shot from the hangar and into space, and obtained a lock through the ship's navigational sensor on the tracer he'd secured to the fleeing vessel. His much-faster ship soon had brought him near the droid's vessel and, through his transparisteel canopy, he saw that it was heading for a garish-looking private cruiser with huge decorative fins, its unusually colorful exterior making it especially hideous. But suddenly the Incom craft veered away from the hideous-looking cruiser and curved back toward the spaceport. Windu steered after the elusive droid that was angling its craft for the hangar from which it first exited. As the droid craft did not decrease speed, Mace realized the droid was attempting to crash its ship."}, {"tag": "p", "text": "Desperate to save Calvaria, Master Windu aimed the dual laser cannons of his Delta-6 at the landing craft's aft-thrust vector and fired. The resultant explosion disabled the ship's thruster, but because the vacuum of space offered no resistance, the craft continued on its collision course with the spaceport. Matching the Incom vehicle's velocity, Windu brought his starship over the droid-piloted craft and made contact with its hull, which he was able to clamp onto with the Delta-6's landing gear—claw-like grippers for zero-gravity docking. As he hit the starship's inertial dampers, both vehicles, traveling as one, decelerated rapidly, and Mace was able to steer the conglomerate craft into the Flight Control hangar of Fondor Spaceport. The Jedi Master, finding that the FX unit had been deactivated, cut his way through the landing craft's locked egress hatch with his lightsaber to free Princess Calvaria, who, though laying motionless on a long seat, had a steady pulse and was unharmed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}