{"url": "Fondor_Shipyards/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Shipyards"], "nodes": [{"tag": "h1", "text": "Fondor Shipyards"}, {"tag": "p", "text": "The Fondor Shipyards, also known as the Starshipyards of Fondor, were huge starship construction facilities orbiting the planet Fondor, in the Fondor system. Numerous capital ships and freighters were in construction here almost all the time. Presumably because of the shipyard's strategic importance, the shipyards were also guarded by a complement of Imperial Storm commandos as well as several Imperial escort carriers."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The shipyards had a varying layout. There were various space stations and construction devices in the area. In addition, for the more secretive projects at the shipyards, a giant shield was enveloped requiring at least 18 shield stations to maintain, and the destruction or otherwise disabling of one would result in the shield collapsing."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre–Clone Wars"}, {"tag": "p", "text": "The Jedi mission to Fondor during the Separatist Crisis foiled a scheme by Groodo the Hutt to destroy the Fondor Shipyards using a counterfeit Sun Runner transport. Before the drifting derelict could collide with the shipyards, an 18-year-old Anakin Skywalker was able to destroy it through a combination of planting a proton grenade to the vessel's hypermatter reactor and demolishing its sensor-guided missile silo with the concussion-missile launcher of a borrowed CloakShape fighter—the shock waves of these explosions, however, forced Skywalker to crash-land on the Fondor jungle-moon of Nallastia."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "The shipyards were seized by the Galactic Empire shortly after the Battle of Yavin, and used to finalize the construction of Darth Vader's Super Star Destroyer, and the lead ship of the Executor-class Star Dreadnought line, the Executor. The executives were outraged over the Emperor's orders, but nonetheless complied, hoping it would allow them to steal lucrative project grants from their rival, Kuat Drive Yards, in the future. However, to their anger, Kuat Drive Yards ended up gaining all rights to any future models of Super Star Destroyers."}, {"tag": "p", "text": "Despite this setback, the Empire somehow allowed Fondor to develop an Executor-class Star Dreadnought variant possessing cloaking capabilities. The Rebel Alliance, learning of this development, made an attack against the orbital shipyards in year 3 ABY, which resulted in the destruction of the vessel before it was ever completed, or deployed. In actuality, the Empire, under the Emperor's orders, deliberately leaked the intel of the ship's construction to the Rebel Alliance to grant them a victory as to ensure that they grow overconfident enough to be drawn into a trap."}, {"tag": "p", "text": "The shipyards were raided by the Rebels twelve times prior to the Battle of Endor."}, {"tag": "p", "text": "After the Battle of Endor, the shipyards were renamed the Fondor Independent Shipyards[source?] and were used by the Alliance to Restore the Republic. A brief supply problem was solved after Han Solo escorted the two Venerated Ones to their home planet of Vandelhelm."}, {"tag": "h3", "text": "Yuuzhan Vong war"}, {"tag": "p", "text": "Fondor was the location of a crucial battle against the Yuuzhan Vong. Having been deceived by the Vong, the New Republic was caught fatally off guard by the attack at Fondor. Many Republic vessels were lost, most vaporized by an overly hasty firing of Centerpoint Station. Orbital Shipyard 1321, one of the orbiting shipyards, was rammed by several Yuuzhan Vong coralskippers during the battle, and destroyed."}, {"tag": "p", "text": "Although the shipyards were largely in ruins, they continued to operate throughout the war. General Garm Bel Iblis later took up station at Fondor after the Battle of Coruscant."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "As of 40 ABY, Fondor had allied with, and was producing ships for, the Confederation, and was soon targeted by Joint Chief of State Jacen Solo. However, the attempt to take the planet, including the yards and other assets, intact, failed, causing Solo to order the bombing of Oridin, a major Fondorian city, with the result being a split in the GA, but a more unified Fondor. During the battle, one of the docks repelled a GA boarding party. Others sustained heavy fire from Imperial and Galactic Alliance ships. It was revealed that the Fondorians had hidden large numbers of ships in the docks by making it appear that the ships were under construction."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}