{"url": "Fondor_shipyard_assault", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Battles of Fondor", "Category:Battles of the Galactic Civil War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Fondor shipyard assault"}, {"tag": "p", "text": "Shortly before the Battle of Endor, the Rebel Alliance launched the Fondor shipyard assault against the Imperial Fondor Shipyards. The Rebels's plan, spearheaded by Rogue Squadron, to destroy a prototype Executor-class Star Dreadnought, was to utilize three previously stolen TIE Hunters and a reprogrammed GR-75 medium transport to infiltrate the shipyards. When their cover was blown, a Rebel fleet commanded by General Crix Madine came out of hyperspace and stormed the facility."}, {"tag": "p", "text": "When the shipyard defenses were disabled, the attack on the Super Star Destroyer commenced. Three cloaking devices installed in the ship were targeted by the Rebel force, which caused a chain reaction of explosions which would compromise the entire starship. Though the Rebels emerged victorious, it was not as it seemed on the surface."}, {"tag": "p", "text": "Like all the other events surrounding the Rebel's assault on the Death Star II, the events of the battle were manipulated by Galactic Emperor Palpatine. His decision to give the Alliance a major victory was based on giving the Alliance the courage it needed to mount their attack on Endor, which would have led to their destruction if Antilles and Lando Calrissian hadn't destroyed the Death Star II in time."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the Battle of Yavin, the Fondor Shipyards were tasked with finishing the lead ship of the Executor-class Star Dreadnought, to their outrage. However, after it was completed, the Kuat Drive Yards were granted by the Empire sole development copyrights to any future Super Star Destroyer style ships in the future, angering Fondor even more, as they had planned to steal future ship-development contracts from their rival in the future. Nonetheless, they somehow convinced the Empire to make an exception[source?] by building a variant of the Executor-class Star Dreadnought that included cloaking capabilities."}, {"tag": "p", "text": "Following the Rebel Alliance's escape from the surprise ambush over Dubrillion in 3 ABY, Wedge Antilles, commander of the elite Rebel flight Rogue Squadron, accompanied by two wingmen, somehow managed to steal a trio of experimental TIE Hunters, elite TIE craft used by the Empire's storm commando units. In retaliation for the massive losses over Dubrillion, Rogue group planned to destroy a unique Star Dreadnought with advanced cloaking device technology that was under construction in orbit of the industrial planet Fondor, after having somehow learned of its development. To achieve this task, the stolen TIE hunters were utilized, along with a \"captured\" Rebel transport."}, {"tag": "p", "text": "In reality, the transport was empty, and was programmed to ram into one of the shipyard's shield stations' command deck to allow a Rebel fleet commanded by General Crix Madine safe passage into the construction yard."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "When the reprogrammed transport was escorted into the perimeter of the shipyard, Antilles insisted to the base's commander that they were bringing in a shipment of prisoners. However, the Imperial commander quickly realized that it was a ruse both due to no scheduled appearance of prisoners and the lack of lifeforms being revealed in a scan of the \"transport,\" and deployed TIE squadrons and an Imperial escort carrier to stop the rebels. Despite this, Rogue group still managed to defend the transport, which successfully plowed into the Imperial command center."}, {"tag": "p", "text": "A Rebel Nebulon-B escort frigate commanded by Madine, along with several starfighter squadrons, arrived to cover the attack on the generator. The generator's doors were deactivated by Antille's ion cannons. Meanwhile, his wingmen exchanged fire with several defensive turrets to give him cover as the frigate and its fighter complement exchanged fire with two additional Imperial escort carriers which had joined the battle."}, {"tag": "p", "text": "Eventually seeing no further use for the TIE Hunter, he then proceeded to dock with the frigate and utilize an RZ-1 A-wing interceptor for the remainder of the battle."}, {"tag": "p", "text": "He was quickly able to destroy the generator, shutting down the shield. More Rebel X-wing, Y-wing, and A-wing squadrons arrived, covering Antilles as he moved into the entrenched structures on the ship. Avoiding or destroying defensive turbolaser towers, Antilles and the others flew through the trenches, destroying the three cloaking devices installed in the ship, which caused a chain reaction. The result was that the entire Star Dreadnought exploded before Imperial reinforcements arrived."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though this was a clear victory for the Rebel Alliance, the Emperor believed it would make the Rebels overconfident in the upcoming battles. As he saw it, even then, the Rebels were being lured into a trap."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle over Fondor was depicted in the final mission of the Wedge Antilles campaign of the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike. If the player fails to destroy all cloaking generators in time, a cutscene will play where two Imperial-class Star Destroyers will warp into the system, presumably having been dispatched by the Imperial forces within the Fondor Shipyard as backup."}, {"tag": "p", "text": "The strategy guide for Rebel Strike referred to the initial plans of the Rebel Alliance to shut down the shield generator as being a variant of the Trojan Horse ploy, a reference to the real-life Greek-Trojan war, where the Greeks, as a final resort, proceeded to give a gift to the Trojans, a giant wooden horse when \"surrendering\" to them. The horse, known as the Trojan Horse, secretly contained a platoon of Greek Soldiers to infiltrate the city after the celebrations and kill the Trojans, also resulting in more Greeks arriving to infiltrate the city upon the destruction of the Trojan wall."}, {"tag": "p", "text": "Shortly after disabling the shield generator doors, the player has the option of switching out with an A-wing. The strategy guide mentions that doing so will make the final objective more challenging, although this article assumes the player did so."}, {"tag": "p", "text": "Some of the cutscene stills in the Rebel Strike strategy guide (which at the beginning of every coverage of a mission/campaign shows a film reel that depicted stills of cutscenes from the game or the Star Wars films) indicated that, during the level's creation, Antilles' wingmen would have originally piloted TIE/IN interceptors for the mission. They piloted TIE Hunters in the final version, like Antilles did."}, {"tag": "p", "text": "Unlike most other levels, the \"Fondor Shipyard Assault\" level was not given an audio commentary dedicated to it. The audio commentary for the level instead focused on the multiplayer option for Rebel Strike."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}