{"url": "Fool%27s_Bargain", "categories": ["Category:Real-world articles", "Category:Legends eNovellas", "Category:Short stories republished with novels"], "nodes": [{"tag": "h1", "text": "Fool's Bargain"}, {"tag": "p", "text": "Fool's Bargain was a novella which was written by Timothy Zahn in 2004 and was originally in eBook format. The story is a supplement to his novel Survivor's Quest and was subsequently included in the paperback version which was published on December 28, 2004 by Del Rey. Fool's Bargain details the exploits of the 501st Legion shortly before the events of the novel."}, {"tag": "p", "text": "It is the only book that is completely dedicated to Imperial stormtroopers and that shows a story solely from their point of view."}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "The story opens with Aurek Company of the 501st Legion in a disguised transport preparing to attack the stronghold of the Warlord in order to free the Eickarie people. The story follows Unit Aurek-Seven as the troopers leave the transport and proceed to the alleyway they have been assigned to. The Eickarie named Su-mil emerges from a nearby cantina and invites the stormtroopers into a building where they make a bargain: the troopers help to free the Eickarie prisoners before attempting to capture the Warlord in exchange for a way into the fortress. The Eckiares and stormtroopers use an under ground passage and gain entry to the fortress, where they fight their way to the prison area. After convincing the Eckarie prisoners to join the battle, they split up. Two stormtroopers and many Eckaries returned to the city via the tunnel well the other troopers and Eickaries proceeded to the center of the fortress. After fighting past an ambush, the second party secures the fortress and captures the Warlord. Twister then invites Su-mil to join the Empire of the Hand. Su-mil accepts and joins Aurek-seven."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}