{"url": "For_a_Few_Kilotons_More", "categories": ["Category:Real-world articles", "Category:Twin Stars of Kira adventures"], "nodes": [{"tag": "h1", "text": "For a Few Kilotons More"}, {"tag": "p", "text": "\"For a Few Kilotons More\" is an adventure for Star Wars: The Roleplaying Game, 2nd ed. It was written by Michael Allen Horne and published as part of the book Twin Stars of Kira in 1993. \"For a Few Kilotons More\" is the fifth of ten adventures in the book, all of which deal with the systems along the Enarc Run and the Harrin Trade Corridor in the Twin Stars of Kira region of the galaxy. The adventure takes place during the New Republic era."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The adventure sends the player characters to seek their fortunes on the planet Krann, where the Mon Tondievz, Ltd. mining company has experienced sabotage that threatens its output of nova crystals and, more broadly, the stability of the New Republic's currency."}, {"tag": "p", "text": "The group disembarks from a shuttle at the planet's main spaceport. There, they meet with a representative of Mon Tondievz named Vanel at the Wages of Phy'r cantina. She explains that her company is currently in competition with several newcomers, including operations owned by the House of Tagge and the Hutt Jeweler's Guild. She takes the newcomers to a warehouse, where they speak to Quarlo I'Shibix via hologram. He tells them about the troubles Mon Tondievz is facing, blames it on the Galactic Empire, and offers them a reward if they can safely escort a shipment of nova crystals to the Tagge camp for shuttling offworld."}, {"tag": "p", "text": "Vanel escorts the group to the Mon Tondievz mining port. They board speeder trucks and head off into the jungle. They stumbled upon the Cathedral of Shade, a crumbling temple of the native Kluuzot species, and began investigating it. There they find a Kluuzot under the effects of eldratz spice. A group of thugs then attacks the party only to be interrupted again by several more drug-crazed Kluuzot. The offworlders escape, but find themselves off course and with a speeder truck in need of repairs. Inside the coolant system, they discover not just nova crystals, but a thermal detonator set to explode when they reach the Tagge camp. They also discover an additional cargo: flasks of eldratz, ostensibly the real source of Mon Tondievz's revenue. An explosion in the distance alerts them that the other truck of miners must have been destroyed, alerting them to their own fate had they not found the explosives."}, {"tag": "p", "text": "The group continues to the Tagge camp, where they encounter Vanel and Quarlo, now known to be part of the eldratz ring. There they confront Vanel and her assassin droid, an Eradicator E8U. In the ensuing battle, the player characters defeat Quarlo and Vanel. A New Republic Nebulon-B frigate, the Salamander, comes on the scene a few hours later. The player characters, having defeated the person who hired them (albeit as patsies) are left unpaid but with the possibility of salvaging and selling off nova crystals."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}