{"url": "Forard", "categories": ["Category:Legends articles", "Category:Almas locations", "Category:Capital cities"], "nodes": [{"tag": "h1", "text": "Forard"}, {"tag": "p", "text": "Forard was a town on Almas, and the only large settlement on the planet. It was built around the Almas Academy, and had very little besides for basic services and entertainment facilities. The town was built directly upon a patch of kaluthin."}, {"tag": "p", "text": "Forard grew in a circular pattern around the Academy, with one quarter of the circle housing the spaceport and other large facilities. People who were not students or Jedi were usually not allowed near the Academy, so there was a hole in the center of Forard between the Academy and the rest of the town. A research station stood just beyond the outskirts of the town."}, {"tag": "p", "text": "The spaceport was just a landing field with minimal starship services available. It originally was capable of handling four starships, but after Klis Joo became governor, she had Bran Isken come in and overhaul the spaceport, making it able to handle up to twenty ships."}, {"tag": "p", "text": "Due to the slightly toxic amounts of trace elements and overly rich oxygen in the atmosphere of Almas, each building in Forard was sealed and had its own atmospheric controls."}, {"tag": "p", "text": "Forard had about 24,000 inhabitants in 32 BBY, and a number them had nothing to do with the Academy. As a small town on an out-of-the-way planet, there was a peaceful isolation to Forard that drew certain types of individuals. They were also drawn to the planet's strange lighting caused by the kaluthin."}, {"tag": "p", "text": "There were also a couple thousand droids in Forard. Most of those were treaded, as the kaluthin could hamper other forms of movement. Forard's small police force used a number of security droids, because they were immune to mind tricks. It was not that there was a large concern that one of the Jedi students would commit a crime, but Kibh Jeen had left the Cularin system with a greater awareness of the dangers of Dark Jedi. Between the security forces and the Jedi, there was almost no obvious crime in Forard. Crimes that do not attract attention, however, were actually easy to perpetrate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}