{"url": "Force_Clouding", "categories": ["Category:Legends articles", "Category:Dark side", "Category:Force powers"], "nodes": [{"tag": "h1", "text": "Force Clouding"}, {"tag": "p", "text": "Force Clouding was a Force technique used by the Sith, particularly those who belonged to the Order of the Sith Lords to mask their Dark side powers when in the presence of the Jedi."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Force clouding was a cloaking technique employed by the Sith to conceal their true nature from the Jedi and other users of the Force. The individual would pull their dark powers into themselves and adopt a mask of insignificance. This projected illusion would enable a Sith to hide in plain sight whenever they would go out in public. By concealing their connection to the dark side of the Force, Sith Masters and their apprentices would be able to move about and interact with the members of the Jedi when necessary and with out fear of discovery."}, {"tag": "p", "text": "By concealing their identities, the Sith of Bane's order were able to take an active part in manipulating the affairs of the Galactic Republic publicly, and not attract the attention of any Jedi they would met in any of their public or private dealings. This would help set the ground work for a number of events that would lead to the culmination of the Sith Grand Plan."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "There were two methods of Force clouding. The first and most common method was channeled through the mind. This was done by the individual being him or herself and allowing those around him to take them for granted. The practitioner would submerge themselves in the unified pattern the Jedi were attuned to; visible in the Force but not as a Sith. In this method of hiding, a Sith would be able cloak himself but still be able to attack without warning if needed."}, {"tag": "p", "text": "The second method was accomplished through the use of Sith Sorcery and involved the user casting a complicated spell on themselves. Force clouding by this method required achieving a balance between strength and delicacy. This method was used when a Sith wished to project an aura of light-side energy so they could pass themselves off as being a Jedi."}, {"tag": "p", "text": "It took time for an individual to master Force clouding. Keeping the illusion up required a certain amount of strength and concentration from the caster and maintaining the illusion for prolonged periods required even more. It was not uncommon for first time casters to doubt on their own ability to maintain their projected illusion in the presence of the Jedi. During her infiltration of the Jedi Archives, Darth Zannah felt she could not keep up her illusion for more than a few days due to momentarily slips of her concentration."}, {"tag": "p", "text": "While their connection to the dark side was hidden, the caster themselves was not actually hidden. By not drawing attention to themselves would the caster remain unnoticed by those around them."}, {"tag": "p", "text": "When using Force Clouding, a Sith could also use a Force Disperser to aid them in concealing their presence in the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}