{"url": "Force_Convention", "categories": ["Category:Real-world articles", "Category:Living Force adventures"], "nodes": [{"tag": "h1", "text": "Force Convention"}, {"tag": "p", "text": "Force Convention was a roleplaying-game adventure in year three of the Living Force campaign. It was the third adventure of the Forces of Cularin trilogy and was written by Matthew Domville and edited by Jae Walker."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "p", "text": "In a time of war, some seek peace. An organization called Sentient Beings Opposing Violence has brought a peace conference to Cularin and invited the Jedi to address them. Now it appears the peace conference has gone horribly wrong. Cularin is faced with a terrible threat, one that requires heroes to face it…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A group of Cularin heroes are contacted by Jedi Master Lanius Qel-Bertuk requesting they go to the Gadrin Jedi enclave as swiftly as possible. En route, the heroes are attacked by the bounty hunter Coar Maw, whose objective is to delay the heroes' arrival. After fighting off Maw, the heroes are briefed by Qel-Bertuk via holoprojector. Qel-Bertuk had sent the Wookiee Jedi Master Kirlocca as his representative to a conference hosted by the pacifist organization Sentient Beings Opposing Violence. Qel-Bertuk subsequently had reason to believe the conference was going to be sabotaged and was unable to contact the Wookiee. He therefore requested the heroes seek out his envoy and protect him."}, {"tag": "p", "text": "The heroes travel to the Luxury, in orbit over Rennokk, which is where the conference is hosted. The ship is protected by members of the Navy of Thaere but the heroes eventually manage to convince the Navy to allow them aboard. Just as the heroes dock on the Luxury, the ship fires upon the Navy starfighters, who subsequently retaliated, damaging the ship and causing its orbit to decay; held within Rennok's gravity well, the luxury liner could crash into the moon's surface. This attack on the Thaereians was commanded by the Dark Jedi Raik Muun who has been seeking to discredit and destroy the Jedi of Cularin. Having captured the Luxury, Muun planned to release t'salaks, causing Kirlocca to go berserk. Muun's plan was to broadcast this and discredit the Jedi. Her plan is rushed by the arrival of the Cularin heroes, but she nonetheless unleashes the t'salak. The dark side creatures attack Kirlocca and his two companion Padawans, subsequently killing all three. The heroes of Cularin do manage to defeat the t'salak—which are entrusted to Mother Morad'Ka—as well as defeating Raik Muun, and preventing the Luxury from crashing into Rennok."}, {"tag": "h2", "text": "Appearances"}]}