{"url": "Force_Priestesses", "categories": ["Category:Canon articles", "Category:Deity stubs", "Category:Force Priestesses"], "nodes": [{"tag": "h1", "text": "Force Priestesses"}, {"tag": "p", "text": "The Force Priestesses were five beings that resided on the Wellspring of Life, the home of the midi-chlorians."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The priestesses were representative of the connection between the Living Force as experienced by living beings, and the Cosmic Force in its role in the greater scheme of the universe. Existing within the Wellspring of Life, the five were a form of shape-shifter, and would mutate their forms to manifest as Serenity, Joy, Anger, Confusion, and Sadness."}, {"tag": "p", "text": "Jedi Master Yoda encountered the Force Priestesses during the Clone Wars. They knew the secret to transforming into a Force spirit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Though installments from The Lost Missions of Star Wars: The Clone Wars implied that Qui-Gon Jinn had learned from the Force Priestesses and directed Kenobi to them as well, canon material from the official Databank and the now-defunct Encyclopedia on StarWars.com still refer to Jinn as having learned from a \"Shaman of the Whills,\" the Ancient Order of the Whills having first been referenced in the novelization of the original Star Wars film."}, {"tag": "p", "text": "In an interview, Dave Filoni indicated the Force Priestesses may be one being who became five over a long period of time, saying, \"The way that I reconciled that being is actually one being. It's one ancient being separated over a time that for our perception to be able to see her, she is these many different iconic things presented to us. But she died a long, long, long time ago, she is conscious in the Force, and she has a limited ability to manifest.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}