{"url": "Force_Wars", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Articles with non-canon elements", "Category:Battles in the Tython system", "Category:Conflicts involving the Infinite Empire", "Category:Conflicts involving the Je'daii Order", "Category:Pre-Republic events and conflicts"], "nodes": [{"tag": "h1", "text": "Force Wars"}, {"tag": "p", "text": "The Force Wars were a ten year long series of conflicts that took place on Tython more than seven centuries before the formation of the Galactic Republic. They were considered the first conflicts between the followers of the light and dark sides of the Force. The Force Wars originally began as an invasion by the forces of the Rakatan Infinite Empire."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "The Force Wars of Tython have their origins in the years following the Despot War which pitted the armies of Hadiya, a queen of Shikaakwa, against the Je'daii Order. Around 25,800 BBY, Je'daii Master Daegen Lok deviated from the conventional wisdom and descended into the Chasm below Anil Kesh temple, where he and his companion Hawk Ryo were overcome by a terrible Force vision Within their vision, an army of dark warriors wielding blades of frozen fire marching across Ska Gora, led by a being with one red eye. To combat this, they saw themselves leading the Je'daii armies against the threat. Driven mad by the visions, Lok fell to the dark side of the Force, and was taken before the Je'daii Council for questioning. Despite his passion, the Council did not believe in Lok's vision or warning and banished him to the moon of Bogan until he renounced his vision and returned to Balance in the Force. Over the next seven years, Lok lived out his exile in solitude, carving an enormous mural of himself wielding the blade of fire, and numerous pictures of the weapon."}, {"tag": "h3", "text": "War with the Infinite Empire"}, {"tag": "h3", "text": "Light and darkness war"}, {"tag": "p", "text": "While the Rakatan threat was diminished, a schism grew within the Order between those of Daegen Lok's followers, and the Je'daii Council. Eventually the two groups were defined by an ideology divided between the use of the Ashla, or light side of the Force, and the followers of the Bogan, otherwise known as the dark side of the Force. Both sides utilized the traditional metal swords augmented through the Force, as well as the Bogan Je'daii fighting with Forcesabers. When the Ashla Je'daii reorganized as the Jedi under the leadership of a High Council, peace seemed imminent until the defection of revered Master Rajivari. Holing up within Kaleth, Rajivari's followers fought to the death, and were subsequently defeated."}, {"tag": "h3", "text": "Conclusion"}, {"tag": "p", "text": "In 25,783 BBY, a cataclysm destroyed the planet's biosphere, rendering the world uninhabitable. What Bogan Je'daii survived fled to the Rim, and the Jedi hunted them aboard generation ships before settling on Ossus 730 years later."}, {"tag": "p", "text": "While the young Galactic Republic banned travel to Tython, the Jedi Order occasionally returned briefly, though they would not resettle their homeworld until the Cold War, after Satele Shan rediscovered the planet, shortly after the Treaty of Coruscant. Rumors existed during the Galactic Civil War that a secret temple existed on the world where they kept their hidden treasures."}, {"tag": "p", "text": "The Force Wars were studied by Padawan students at the Jedi academy on Coruscant as part of Mrs. Pilton's course on the History of the Jedi Order. Roan Novachez was weak in his knowledge of this subject-- on his report card for the course in the third semester, he earned a B+ with a note that his studies were \"excellent, except for study of major events during the Force Wars.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}