{"url": "Force_blast", "categories": ["Category:Legends articles", "Category:Alter powers", "Category:Sith magic"], "nodes": [{"tag": "h1", "text": "Force blast"}, {"tag": "p", "text": "Force blast was a Force power used by the dark side and neutral Force-sensitives, that when conjured, projected concentrated blasts of pure dark side energy at objects or opponents, usually with devastating effects. This ability was even further expanded upon, resulting in the Sickening blast."}, {"tag": "p", "text": "Using one's hands, the conjurer could project focused blasts of dark side energy, that could obliterate objects, or destroy living beings or creatures. At first, users would experience moderate difficulty in controlling such powerful dark side energy. With practice, the aspiring sorcerer could learn to direct the energies into a power that could obliterate anything in its path. Sometimes the user would suffer burns to their flesh, but feel no pain. While its effects were enhanced if the wearer was in possession of a Sith amulet, the amulet was not required."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Freedon Nadd Uprising of 3998 BBY, Ommin, the sorcerer King of the planet Onderon, used this ability to overwhelm the Jedi Knights sent to free Jedi Master Arca Jeth. Drawing on his connection to the dark side of the Force, Ommin blasted both Nomi Sunrider and Ulic Qel-Droma with what was described as \"infinite hatred.\" Just as he prepared to finish Qel-Droma with another wave of energy, the young Jedi destroyed his armature to incapacitate him. While on his own progression down the dark side, Dark Jedi Exar Kun learned this ability after acquiring a Sith amulet from the spirit of Freedon Nadd, who he destroyed with a Force blast. While just a beginner, Kun soon found this power was to his liking, practicing it on the hapless Massassi warriors of Yavin 4. He mastered the ability rather quickly, and repaid his Sith Master Nadd by blasting his astral form at close range, which resulted in a second death for Nadd. During the Second Battle of Empress Teta when Kun stormed the Krath palace in Cinnagar, sorceress Aleema Keto used a Force blast on Exar Kun, who repaid her with an even stronger blast that knocked her across the room. Later, Kun's ghost on Yavin 4 would blast Gantoris to death when he refused to turn to the dark side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}