{"url": "Force_cage", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Force field technology", "Category:Holding cells"], "nodes": [{"tag": "h1", "text": "Force cage"}, {"tag": "p", "text": "A force cage was a device that was designed for and used to contain prisoners, the first examples of which were seen some time prior to 3956 BBY during the Jedi Civil War. Existing through to the era of the New Republic, these types of detention cells were, in essence, energy shields that took the form of a tube. The device itself consisted of a base and cap that was connected by a column at the back that also anchored it to a wall. This assemblage served as a conduit for the energy barrier, keeping it running and anchoring it in place. Force cages were found throughout the galaxy, on worlds ranging from the urbanized city-planet of Taris to the remote and desolate Sith world of Korriban, and even aboard warships such as the Leviathan, the flagship of the Sith Empire's war fleet. During the years prior to the Galactic Civil War, a portable version of the still-popular device was developed; these types of cages were often employed by bounty hunters, such as War'qi and Jango and Boba Fett, who wished to ensure the continued confinement of a live capture until delivery."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Most force cages were deceptively simple devices that resembled octagonal tubes when activated. The frame itself, permanently mounted to a wall or bulkhead, stood approximately two meters in height, with the base slightly below floor level in most instances. The force fields that these types of detention cells emitted varied in color from bright blue to orange, and could carry a charge that ranged from a small shock to incapacitation, including the inflicting of minor electrical burns. These apparatuses could also be modified to project a sort of \"torture field\" that, when activated, sent waves of extremely painful electrical currents into and through those trapped inside; this effect too could be modulated. Such fields could be ramped up in intensity to lethal proportions, serving as an ad hoc execution device. Typical force cages included plenty of room for a detainee to either stand or sit; some force cages, such as the ones in the Telosian Jedi Academy that had been converted from water regulation pipes, were large enough for a grown Human to sleep in."}, {"tag": "p", "text": "Later-model force cages, particularly those in use during the era of the Galactic Empire, were made of a light yet durable ceramic material; portable models were typically two meters long, two high, and four wide once erected. Still portable even after assembly, the frame also provided an additional electrical deterrent against attempted breakout. Assembly was usually fairly simple, requiring only basic knowledge of security technology in order to set them up; however, they were not without flaws. Typical models of portable force cages were considerably weaker than their more permanent counterparts; incorrect assembly would negate the shocking effect of the device's force field, and even if properly set up, a being of sufficient strength could still batter their way through either the field or the frame."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although most force cages used nonlethal barriers, they could and often were tweaked to cause minor amounts of pain when uncooperative prisoners attempted to bash their way through the energy barrier. Force cages could also be modified to double as torture devices by installing feedback nodes that would project powerful electric shocks into the victim contained within. Examples of such modifications could be found within the estate of Tarisian crime lord Davik Kang, who used such a device to torture the former pilot of his ship, the Ebon Hawk. Other cages that had been modified thusly were located aboard the Leviathan, Admiral Saul Karath's Sith flagship, in which he tortured the captive Revan, Carth Onasi, and Bastila Shan as the former Republic officer interrogated them about their mission to find the Star Forge. These cells could also be used to perform executions via electrocution or poison gas, such as the ones in the Sith military base located on Taris, or the Republic Embassy on the neutral world of Manaan. Cages of this type were also found within the Sith Academy on Korriban."}, {"tag": "p", "text": "When they were first developed some time prior to 3956 BBY, force cages were often found in groups contained within a separate, often locked room within police stations, security rooms, and other such places throughout the galaxy. One such place was within offices of the Telos Security Force aboard the massive Citadel Station in orbit over Telos IV, where the Jedi Exile and her companions, Kreia and Atton Rand, were briefly held in the wake of the destruction of the Peragus Mining Facility. These banks of detention cells were typically controlled through a central computer interface terminal, allowing barriers to be raised or lowered in any number of combinations at once; when an assassin, working for the Exchange criminal syndicate and posing as TSF officer Batu Rem, attempted to kill the Exile and her party, he used a similar console to short out the security holocams as well to shut down the cages in which they were held."}, {"tag": "p", "text": "The reformed Sith Empire made use of force cages during the Great Galactic War and its aftermath, during which the Sith Imperials installed the devices on Sith warships to transport prisoners of war. One such prisoner was the Togruta Jedi Master Dar'Nala, who was captured by the forces of Imperial Captain Sivill in 3653 BBY, in the immediate aftermath of the signing of the Treaty of Coruscant. Sivill, under the impression that Dar'Nala had violated the terms of the treaty, used the cage's torture field while interrogating the Jedi Master on her perceived misconduct. Dar'Nala was adamant in her claims of innocence, and so incurred heavy punishment via electric shock. She was able to withstand most of the torture, but apparently succumbed to the jolts after Sivill ordered her execution. In truth, Dar'Nala survived even these shocks, albeit grievously scarred as a result of the high voltage."}, {"tag": "p", "text": "During the era of the Galactic Empire, a portable version, with a frame manufactured from ceramic compounds, was developed that had been designed to be collapsible for use in the field. Once assembled, these types of portable force cages, similar in form and function to those that could be found within Imperial detention centers located throughout Imperial Space, were still somewhat mobile once they were erected and activated. These devices were often used by bounty hunters, in instances when they needed to secure the live capture of a target, either for rendition to whoever had posted the original bounty, or for other purposes. One popular model, the S-3, which was manufactured by Damorind Securities, had been purchased by a bounty hunter named War'qi and installed in the cargo hold of his ship. One of the six holding cells within the Firespray-31-class patrol and attack craft Slave I, the vessel of Boba Fett and his father Jango Fett before him, was a force cage. On the planet Questal, the merchant Honest Ellam—owner of Honest Ellam's Speeder Lot—utilized a force cage to keep three caniphants restrained. He would let the predatory creatures out at night to patrol the Speeder Lot to ward off intruders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Force cages were first presented in passing in the 1987 West End Games roleplaying publication The Star Wars Sourcebook as an in-universe account of the prison-like cargo hold found in bounty hunter Boba Fett's starship, Slave I. Subsequent West End Games sourcebooks would reprint this information, without additional elaboration concerning the type of force cage to be found in the vessel. Nonetheless, Galaxy Guide 10: Bounty Hunters, did expand upon the general characterization, and a force cage was described as a portable detention device similar to fixed installations that could be found within Imperial prisons."}, {"tag": "p", "text": "The publication of The Essential Guide to Vehicles and Vessels introduced a conflict with the established continuity by declaring that the cargo hold aboard Slave I was occupied by prisoner cages, in addition to a force cage that was specifically intended to contain a Force-sensitive individual. Similar information was repeated in Star Wars: Behind the Magic. This did not match the previous description of a force cage. However, an earlier series of comics, Star Wars: Dark Empire, had depicted a type of containment device for Force-wielding individuals called a Universal Energy Cage. The continuity was further complicated by The Official Star Wars Fact File 26 (SLA1), which stated that Slave I contained a universal energy cage and prison cages, but did not mention force cages. The New Essential Guide to Vehicles and Vessels noted that Slave I included a Force-wielding prisoner cell. Other publications, such as the Star Wars: Incredible Cross-Sections and the Star Wars: Complete Cross-Sections, did not specify the type of prisoner containment found within Slave I. In the Shadows of the Empire comic book, there were three story panels that depicted prisoner containment systems aboard Slave I; however, they were not identified, and their types were unclear."}, {"tag": "p", "text": "In contrast to previous depictions, the models of force cages that appear in the Star Wars: Knights of the Old Republic, Star Wars: Knights of the Old Republic II: The Sith Lords, and The Old Republic, Threat of Peace Act 2: New Galactic Order are shown to be permanent or semi-permanent constructions that are immobile once built and do not have a collapsible counterpart. Other, similar devices are featured in Star Wars lore, such as the containment field from Star Wars: Episode II Attack of the Clones, and the mobile stockade from Showdown at Centerpoint."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}