{"url": "Force_meld", "categories": ["Category:Legends articles", "Category:Light side powers", "Category:Sense powers"], "nodes": [{"tag": "h1", "text": "Force meld"}, {"tag": "p", "text": "Force Meld, otherwise known as Jedi meld or Battle meld, was a technique where a number of Force users joined their minds together through the Force, drawing strength from each other. A refinement of battle meditation, it was known to the ancient Jedi, though dangerous. While battle meditation could influence both the Force-sensitives and the insensitives of both sides, Force Meld concentrated on coordinating and improving the Force-sensitives of the user's side."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Because the number of Force-sensitives participating in a full scale battle was usually much smaller than the insensitives, in a way the demand of Force Meld was smaller than that of battle meditation as the meld influenced a smaller number of sentient minds. As a result, Force Meld was believed to be relatively easier to master, as the number of meld practitioners in the New Jedi Order was almost half of all the known battle meditation practitioners in the old order."}, {"tag": "p", "text": "Jorus C'baoth performed it at least eight times in his life. Anakin Solo redeveloped it for the New Jedi Order during the Yuuzhan Vong War, which allowed the Jedi fighting the Yuuzhan Vong to act as a single, powerful entity. Under the coordination of Jacen Solo, Force Meld played an important role during the Mission to Myrkr, boosting the efficiency of the Myrkr strike team. Later, inspired by Joruus C'baoth's legendary power during the Thrawn campaign, Jaina Solo further fine tuned Force Meld as a starfighter squadron tactic used in her Twin Suns Squadron. Shortly afterward, Madurrin applied the meld as an inter-squadron coordinating tactic, with Jacen and Luke Skywalker soon taking up such a post as well."}, {"tag": "p", "text": "Prolonged use of this technique will cause the users to start finishing each other's sentences or thoughts. This power can also be seen as a form of telepathy. Obi-Wan Kenobi warned that Force Meld took a Master of great power and depth in the Force to create a single entity state without killing or destroying the minds of everyone involved. The drawback of Force Meld was one of the elements which led to the Dark Nest Crisis."}, {"tag": "p", "text": "The enhanced power brought by Force Meld worked both ways: while the entity could influence a large number of minds with much more power, a great disturbance in the Force could overwhelm the melding participants as they received the pain through their enhanced senses. If the pain was caused by the minds the melding participants were touching, it would bring devastating effects to the participants, sometimes to such a degree that the participants would lose control of their own minds and become ignorant to other threats."}, {"tag": "p", "text": "The majority of light side meld participants could prevent a single participant from slipping to the dark side. However, if the meld participants were divided in thoughts and could not focus to a common objective, the meld would become a liability rather than an asset."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During a statement to reporters, U.S. President Barack Obama unintentionally referred to the Force meld when he made mention of a \"Jedi mind meld.\" Some fans were angered by his merger of terms from both the Star Wars and Star Trek universes, while others, including Lynne Hale, pointed to this article on Wookieepedia depicting the existence of a Jedi meld. An alternate name of the Force meld is indeed the \"Jedi meld,\" as mentioned in Jedi vs. Sith: The Essential Guide to the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}