{"url": "Force_lightning/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Cleanup", "Category:Alter powers", "Category:Dark side powers"], "nodes": [{"tag": "h1", "text": "Force lightning"}, {"tag": "p", "text": "Force lightning was a well-known Force ability used most often by practitioners of the dark side of the Force, especially the Sith. The ability was commonly referred to as Sith lightning due to the affiliations of its typical users and manipulation of lightning."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Force lightning was a purely offensive, energy-based attack that channeled Force energy down the user's limbs, hurling arcing bolts of electricity from the wielder's fingertips or palms; Force lightning could be executed with either one or two hands. Powerful discharges would branch out into dozens of smaller forks; thus, skilled practitioners could target several foes at once."}, {"tag": "p", "text": "The intensity varied based on a number of factors. Users skilled in controlling the intensity and force of their lightning could render a target unconscious with only a short burst, or kill a person instantly with a single, powerful blast. Darth Bane's lightning, for example, would often electrocute his opponents to death on contact. Galen Marek was another Force-user who could channel lightning that would kill on contact. Both Kyle Katarn and Darth Sidious could conjure lightning so powerful that not only would it instantly kill its target, it would also physically hurl them backwards. The latter's usage was also powerful enough to render anyone caught in it into charred husks if used to its full potency, as demonstrated by his execution of Headmaster Gentis for his military coup against him. Galen Marek's clone and Sidious were able to produce lightning at such intensity that it literally vaporized their targets. These are the most powerful known usages of Force lightning."}, {"tag": "p", "text": "The fact that it caused not only severe physical damage but also unbearable agony to the victim led to it being widely used as a form of torture. Sidious repeatedly assaulted his former apprentice, Darth Maul, as well as Luke Skywalker with lightning, and Darth Malak used it upon Bastila Shan, having captured her aboard the Leviathan and having brought her to Lehon, where he converted her to the dark side."}, {"tag": "p", "text": "Due to the fact that Force lightning was, at its core, simply electricity generated by the dark side, it could be grounded with any material that was resistant to electrical currents. Depending on the level of intensity, Force lightning could ground itself on an ignited lightsaber, with no apparent ill effect on the lightsaber's operation. However, some of the technique's most exceptionally powerful practitioners, were capable of producing blasts that contained enough kinetic energy to tear an ignited lightsaber from their opponent's grasp. One of the most notable examples of this was seen during the duel between Darth Sidious and Yoda, where Sidious disarmed the Jedi master with a particularly powerful lightning blast, forcing Yoda to use tutaminis to defend himself. Powerful light-siders were sometimes able to resist the attack, or even block the lightning completely. Mace Windu, with his lightsaber combat form Vaapad, could reflect the lightning back to its source with a \"superconducting loop\". It required tremendous effort on the reflector's part, however, as seen in Windu's battle with Palpatine; Windu was seemingly able to overcome Sidious's lightning. Obi-Wan Kenobi was also able to deflect Count Dooku's lightning, with his lightsaber, without exerting much effort as well. Darth Vader was also seen doing this against Starkiller, despite the fact that Starkiller's lightning was powerful enough to outright disintegrate his targets. Galen Marek was capable of creating a shield out of his lightning and could deflect even Palpatine's Force lightning back at him."}, {"tag": "p", "text": "Force lightning could also be absorbed and redirected by a Jedi of sufficient skill; Yoda demonstrated this ability by both deflecting and absorbing the dark power during battles with Darth Sidious and Tyranus, using nothing more than his own two hands. Galen Marek was also able to block Palpatine's lightning with only his bare hands while walking towards him. Luke Skywalker attempted this, and succeeded for a short amount of time, before the Emperor's attack overwhelmed him. Revan demonstrated great proficiency in this ability; he used his bare hands to absorb a very powerful barrage of Force Lightning from Darth Nyriss and then deflected it back at her, destroying her with her own power in the process. The Force could also be used to simply deflect Force lightning without absorbing it, as demonstrated by Darth Tyranus during his initial engagement with Yoda."}, {"tag": "p", "text": "There was an advanced version of Force lightning which may have been used by Revan in the Jedi Civil War and Meetra Surik during the First Jedi Purge. Its destructive potential was legendary; the apocalyptic power was known as Force storm. Galen Marek used this power on the giant sarlacc on Felucia during his duel with Shaak Ti."}, {"tag": "h2", "text": "Effect of Force lightning"}, {"tag": "p", "text": "Though the short-term effects of Force lightning are obvious, the sheer power invoked by its use could have insidious long-term effects, both on those subjected to its power and those who would wield it. It could deform the person being shocked and it could also lead to them being crippled for the rest of their life.[source?] It was also known to cause brain damage and blindness.[source?] Prolonged exposure to intense electrical fields (such as a sustained current of Force lightning) caused most humanoids to experience sudden and massive calcification of their skeletal system; the abrupt drop in blood minerals provoked muscular micro-seizures all over the victim's body. Intense enough doses of Force lightning will also have the victim having his or her skeletal system being seen through the body, as demonstrated with Darth Vader and Mace Windu. However, this does not impact the user if it is redirected at him or her. This is especially evident with Sidious shortly before his death, as despite being hit with Force lightning at an intensity great enough to cause Vader's skeleton to shine through his armor when picked up by Vader, he did not exhibit the same symptoms."}, {"tag": "p", "text": "Telltale symptoms included generalized muscle aches and double vision. A blood test or bioscan could be used to confirm the diagnosis."}, {"tag": "p", "text": "Unless the victim received complete bed rest and appropriate medical treatment, the disorder would become chronic, lingering for years (barring timely bacta immersion). Luke Skywalker, who was diagnosed with the disorder by 4 ABY was confined to a hoverchair for his trip to Bakura during the Ssi-Ruuk invasion, mere days after his near-fatal encounter with Sidious."}, {"tag": "p", "text": "It was thought that very intense use of Force lightning could drain the user physically, and possibly result in severe facial and body deformations. The deformities Sidious displayed after unleashing a barrage of Force lightning on Mace Windu, only to have it reflected back upon him by the Jedi Master's lightsaber is an example of this, although it was also implied that he was using the mask ability up to that point. Darth Plagueis also implied that the users' abilities with Force Lightning would grow even stronger when subjected to their own attack."}, {"tag": "p", "text": "When Anakin Skywalker redeemed himself and killed the Emperor, his life support circuitry was critically damaged, leaving him a heavy and lifeless quadriplegic."}, {"tag": "p", "text": "Besides draining the user's energy, Force lightning had the added drawback of occasionally charring the hand of the person who used it. When Jacen Solo flew into a rage underneath the ruins of the Jedi Temple on Yuuzhan'tar and attacked his Yuuzhan Vong pursuers with Force lightning, he later found that the blasts had burned charred holes in his palm."}, {"tag": "p", "text": "Very powerful blasts of Force lightning could highlight and illuminate the victim's skeleton, as shown with Mace Windu, Asajj Ventress, and Darth Vader."}, {"tag": "p", "text": "For unknown reasons, Force lightning (together with its various variants, such as Electric Judgment) was the only known Force power able to affect the Force-immune alien Yuuzhan Vong."}, {"tag": "h2", "text": "Use by Jedi"}, {"tag": "p", "text": "Force lightning ability was not restricted to dark-siders. Jedi and other light-siders who were strong of will and character could learn this power without falling to the dark side—but its use was viewed as inherently corrupting, and most Jedi Councils forbade its use."}, {"tag": "p", "text": "Some Jedi nonetheless refused to dismiss the natural power of this ability. During the Great Sith War, Jedi Master Lian Dray used Force lightning against the Sith apprentice Sindra. Revan, Meetra Surik, Jolee Bindo, Bastila Shan, and Vrook Lamar were amongst its users during the Mandalorian Wars, the Jedi Civil War and the First Jedi Purge. Plo Koon used this ability (which he called Electric Judgment) to subdue a criminal named Pommel, who had taken a hostage. Koon used Force lightning to knock Pommel out, yet claimed to have no plans to experiment with it in the future. Quinlan Vos could also employ this power effectively, and used it against the Anzat Jedi Volfe Karkko. Darrus Jeht also used Force lightning against the Dark Jedi Asajj Ventress."}, {"tag": "p", "text": "Galen Marek was an extremely skilled user of this Force power, even after his conversion to the light side, rivaling Darth Sidious. He could kill foes with a single blast and was able to hit many adversaries at the same time. He was also able to deflect Force lightning with his lightsaber or even with his bare hands such as during the Battle on Death Star I. He could also charge objects and people with lightning and use them as improvised grenades, and to create a shield of lightning around his body to protect himself. Marek's clone was even more proficient, being able to set stormtrooper armor on fire with the power."}, {"tag": "p", "text": "Some members of the New Jedi Order such as Kyle Katarn and Jaden Korr also used Force lightning (colloquially known as \"Emerald Lightning\", a similar ability to Electric Judgment), but it remained very controversial. Other Jedi practitioners of this power have been Relin Druur, Kyp Durron, Jaina Solo (in a black variant respectively), Jacen Solo, Mara Jade Skywalker and Luke Skywalker. Skywalker in particular was able to utilize a green variant that possessed the ability to instantaneously kill his targets without succumbing to the dark side. However, he was only known to have utilized this deadly variant during his engagement with the Slayers during the Recapture of Coruscant."}, {"tag": "p", "text": "Cade Skywalker was able to use Force lighting in a very unique way. Utilizing his ability to see Shatterpoints in people and objects around him, he could use lightning to heal people, bringing them back from the very edge of death, or to kill them."}, {"tag": "h2", "text": "Force lightning users"}, {"tag": "p", "text": "Force lightning required a living conduit for the energy to be channeled; thus Darth Vader, despite being an immensely powerful Sith Lord, was never able to properly employ this ability, as any attempt to generate it carried the risk of shorting out his life support systems. In addition, Vader's life support systems were not well insulated, and the system's delicate circuitry was vulnerable to the damaging effects of Force lightning. This vulnerability would eventually contribute to his death."}, {"tag": "p", "text": "Jorak Uln, the former headmaster of the Sith Academy on Korriban who hid in the Valley of the Dark Lords during the Jedi Civil War, would sometimes kidnap and torture Sith students. One of his favorite games was testing his captives on Sith philosophy, punishing their failure with Force lightning, often until they were killed."}, {"tag": "p", "text": "Darth Malak used Force lightning as a means of torture to turn Bastila Shan to the dark side. It was intended to give her a \"taste\" of the dark side's power, a technique that eventually succeeded."}, {"tag": "p", "text": "The Sith Emperor's Force Lightning was so powerful that he overwhelmed the Jedi Master Revan, to a degree that Revan's mask started to melt into his skin. As Valkorion, he later employed this against both Darth Marr, killing him instantly, and his son Arcann, who was able to resist it, despite being severely burned. Arcann later used the same type of lightning against The Outlander."}, {"tag": "p", "text": "Darth Tyranus had an affinity for use of Force lightning; often to inflict punishment and occasionally personal delight. He also performed the technique in acts of defense in absence of his lightsaber. Dooku used the technique to incapacitate Anakin Skywalker during the First Battle of Geonosis. He also attempted the technique on Obi-Wan Kenobi, who was able to block it with his lightsaber, and Master Yoda, who managed to reflect and dispel the energy with his bare hands. In addition, Tyranus utilized this power to stabilize the heartbeat of General Grievous after the Kaleesh's body was mangled in a shuttle crash."}, {"tag": "p", "text": "Darth Sidious was a master of the technique. He used Force lightning to punish Luke Skywalker for his refusal to join him, beginning with an agonizing but non-lethal quantity and working his way gradually upwards toward lethality. When Anakin Skywalker turned on the Emperor, Sidious used the lightning at a much higher intensity, which eventually killed him."}, {"tag": "p", "text": "Other Force-sensitives known to have used the power or its variants include:"}, {"tag": "h2", "text": "Variants of Force lightning"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Electric Judgement"}, {"tag": "p", "text": "Also known as Emerald Lightning, this Light Side variant of Force Lightning was used by some Jedi Knights and Masters to launch green or orange bolts to stun or kill their enemies.  Unlike most other forms of Force Lightning, it was possible to fuel using feelings of justice or the normal method of using ones anger.  Plo Koon was a noted user of this technique.[source?]"}, {"tag": "h3", "text": "Force shock"}, {"tag": "p", "text": "Force shock was a Force power that allowed the user to create an energy spark that would track and damage the nearest enemy. The shock could be thrown at an opponent to stun and injure them, or could be set loose to track an opponent until it dissipates. The shock would not last more than five seconds or so before disappearing into a tiny burst of heat, but it was a useful technique for Sith apprentices."}, {"tag": "h3", "text": "Force storm"}, {"tag": "p", "text": "Force storm was a Force lightning variant. The user would raise their palm upward and would create, through the Force, an explosion of electrical energy directed at all foes in the vicinity. It also appeared as a tornado of energy which created a great disturbance in the Force. Jedi could also join together to create a Force storm, though its use was frowned upon by more orthodox Jedi."}, {"tag": "p", "text": "Unlike Force lightning, Force storm was not limited to attacking enemies in one direction, as it affected all foes within a certain radius from the user. Some notable practitioners of this power were Revan, Darth Nox, Darth Nyriss, the Sith Emperor, Darth Bane, Galen Marek, and Darth Sidious."}, {"tag": "h3", "text": "Force Tempest"}, {"tag": "p", "text": "Force Tempest was a variant in which the user could project Force lightning from all of their limbs in a whirlwind that encircled their body. It could be used to inflict damage to multiple adversaries."}, {"tag": "h3", "text": "Chain lightning"}, {"tag": "p", "text": "Chain lightning was a variation of Force lightning with the difference being that the lightning was able to strike one person and then move to another or several others. As it was more powerful than the standard lightning, it required a greater amount of discipline and concentration to project and sustain the stream of lightning. The only confirmed users are the Force apparition known as Dark Mara, Galen Marek, Darth Nox, Starkiller, and Count Dooku."}, {"tag": "h3", "text": "Sith barrage"}, {"tag": "p", "text": "Sith barrage was a variant of Force lightning that allowed users to create a bolt of lightning up from the ground damaging anything in its way."}, {"tag": "h3", "text": "Lightning Shield"}, {"tag": "p", "text": "Lightning Shield was another variation of Force lightning in which a shield of lightning covered and protected the user. Its effects could extend beyond the immediate space near the user, and could shock enemies in the distance. It could lower damage taken by the user, and could also enhance the saber damage the user dealt out. It was not the most powerful form of Force lightning, however; it still took mastery in the art of Force lightning and high concentration to use Lightning Shield. It could even redirect Force lightning back at another user of Force lightning. The only known users were Emperor Palpatine and Galen Marek."}, {"tag": "h3", "text": "Lightning Grenade"}, {"tag": "p", "text": "Lightning Grenade was a Force lightning variation in which the user gripped an opponent or object with the Force and lifted them up into the air. While the victim was suspended the user blasted them with a brief burst of lightning. The practitioner then either dropped the victim or slammed them into an object, causing the lightning coursing within them to explode. Galen Marek and Darth Sidious were the only known practitioners."}, {"tag": "h3", "text": "Lightning Bomb"}, {"tag": "p", "text": "Lightning Bomb was a powerful variation of Force lightning. The Force user blasted an opponent with lightning, and then, using the Force, caused the lightning to amplify within the victim's body until it reached a critical point and exploded out of the victim. The explosion would also shock and kill anyone unlucky enough to be standing near the victim when the explosion occurred."}, {"tag": "h3", "text": "Sith Seeker"}, {"tag": "p", "text": "Sith Seeker was a very uncontrollable form of Force push. The Force user blasted the target with Force push, sending the object through the air. The user then generated a large ball of Force lightning. The Force user allowed the lightning to expand freely until it was no longer under his or her control. They would then blast the Force lightning ball after the target, hence \"Sith Seeker\". The lightning exploded on impact with an opponent or object. The only known practitioner of Sith Seeker was Galen Marek."}, {"tag": "h3", "text": "Lightning Burst"}, {"tag": "p", "text": "Lightning burst was a variant of Force lightning, where the user would have lightning arc out from their body to strike adjacent enemies."}, {"tag": "h3", "text": "Vader's variant"}, {"tag": "p", "text": "This was a particular variant of Force lightning, utilized as an alternative for Vader, who was unable to generate it normally. He could summon Force lightning from directly above an opponent, and then directing it from a storm he generates with the Force."}, {"tag": "h2", "text": "Colors"}, {"tag": "p", "text": "While most Force Lightning manifested itself as blue, it could appear in several hues, though whether or not the color is distinctive was unclear. For example, Palpatine, Darth Bane and Darth Nox had all used purple lightning. The Hidden One used white. Talzin, Mother and Luke Skywalker were seen using green. Dark side users like Darth Desolous, Darth Tenebrous, Darth Maul\nand the Son, were seen wielding red. Jaina Solo also used a highly unusual color variant, in the form of black. Force users of the Eternal Empire used a form of yellow/orange lightning."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the MMORPG Star Wars: Galaxies, if a player of the Imperial faction attempted to contact Emperor Palpatine via hologram upon completing the Avenging Mort mission, Palpatine's hologram will use Force Lightning on the player to cover up his involvement."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}