{"url": "Force_nexus", "categories": ["Category:Legends articles", "Category:Articles to be merged", "Category:Force phenomena", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Force nexus"}, {"tag": "p", "text": "Force nexus, or vergence, is a term used to refer to any location where the Force, or any particular aspect of the Force, was unusually strong."}, {"tag": "p", "text": "Such nexuses could be caused by any number of different events. Korriban in general and the Valley of the Dark Lords specifically were nexuses of the dark side of the Force due to the long-term presence of the Sith Lords, Nam Chorios was a nexus of the Force due to the omnipresence of the Tsils, a form of life; Vjun was a nexus of the dark side due to the horrible events of its past, the Dark Side Cave on Dagobah and a spot in orbit over Endor were tainted by the death of dark side users, Byss was a nexus of the dark side of the Force because it housed Palpatine's clones and his various Sith alchemy experiments and the Force energies sucking the lives on the planet."}, {"tag": "p", "text": "There may have been a nexus in Lumiya's habitat asteroid, where Alema Rar was able to draw energy from it to power her Force specters."}, {"tag": "p", "text": "The natural mountain on which the foundation of the Jedi Temple on Coruscant rested was a nexus. This became tainted by the dark side with the defeat of Lord Nyax at the site of the ruined Temple during the Yuuzhan Vong War. The most powerful nexus was the Valley of the Jedi, where the spirits of several thousand Jedi, both light and dark, were trapped after the Seventh Battle of Ruusan, a perhaps limitless source of Force energy even after the spirits were freed."}, {"tag": "p", "text": "In 14 ABY, the Disciples of Ragnos drained several Force Nexuses of their Force Energy with the Scepter of Ragnos."}, {"tag": "p", "text": "Possibly the most powerful Force Nexus of the Galaxy was on Mortis, a planet inhabited by the Ones, a race of Godlike Force Wielders that were possibly Celestials."}, {"tag": "h2", "text": "Force objects"}, {"tag": "p", "text": "Objects left in the presence of a Force nexus for extended amounts of time eventually became saturated with the Force, which imbued the object with special abilities, like an edge that will never dull, the ability to absorb some Force powers like Force lightning and electric judgment, or even the ability to enhance the wielder's perception of time, allowing him to think and react faster than otherwise possible. This effect allowed even a being who wasn't Force-sensitive to use the weapon to a great degree. Further, objects (such as a holocron) imbued with a particular aspect of the Force—be it light or dark—could actually become so saturated as to make their very presence intolerable to those of opposite alignment."}, {"tag": "p", "text": "In 29 BBY, Obi-Wan Kenobi and Anakin Skywalker encountered a nexus of powerful dark side energies in an underwater geyser crater on the planet Kodai, where the ancient Sith Holocron of King Adas was hidden. The strong underwater nexus was perceived even with the evil artifact having been stolen from its burial place. As the Jedi duo pursued the holocron's thief through hyperspace, its dark energies were again perceived as a powerful \"ripple\" or \"wave\" in the Force, causing the Jedi to quickly exit hyperspace to investigate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first Force nexus to appear in Star Wars continuity was the cave on Dagobah, seen during Star Wars: Episode V The Empire Strikes Back. The concept of a location imbued with Force energy was then expanded on in the 1997 video game Star Wars: Jedi Knight: Dark Forces II."}, {"tag": "p", "text": "In the 2001 video game Star Wars: Obi-Wan, a Force nexus is a power-up which grants the user unlimited Force powers for a limited time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}