{"url": "Force_power/Legends", "categories": ["Category:Legends articles", "Category:We're Doomed!", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Force powers", "Category:Lists"], "nodes": [{"tag": "h1", "text": "Force power"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Force powers were the manifestations of a Jedi, Sith, or other Force-adept's connection with the Force, an energy field that bound everything in existence. These powers were supernatural abilities not described by science.\nThe powers were usually taught by Force-using organizations, but there were examples of individual, self-improving methods of learning to use the Force. There were many kinds of Force powers, but not all were available to a single person, since some of them required a deep connection with one side of the Force and others were secret. Also, as a side note, it should be taken into account that the Force is not \"magic,\" nor does it have specific \"spells\" or \"powers,\" and they are far more interrelated than the list might suggest. Alternatively, the Force was used as a form of magic by users such as the Witches of Dathomir, Nightsisters, Mind-witches, and users of Sith magic and Sith alchemy."}, {"tag": "h2", "text": "Aspects of Force powers"}, {"tag": "p", "text": "The Force had a range of powers that functioned in accordance to fundamental attributes that were cardinal in nature, and categorized by the way in which a user was able to focus on the Force while using an ability. The aspects of the Force were divided into Control, Sense, and Alter by the Jedi Order. Under these three themes were several core abilities, that could be expanded upon and changed, depending on the user. Stemming from the core ability were several different ways to manipulate the Force, some of them mainstream within the Jedi and Sith teachings, others personally developed and unique."}, {"tag": "h3", "text": "Control"}, {"tag": "p", "text": "The Jedi Order's teaching method began with the aspect of Control, taught to Jedi Initiates as a way to open their minds to the Force and establish a base point for further development. The theme of Control was centered on the ability to control one's own body, as self control was the starting point for all Jedi teachings. Development of these skills would continue throughout a Jedi's life, as the basics of all other disciplines of Force use began here. One of the most well known side-effects of mastering the discipline of Control was prolonged life and the avoidance of decay."}, {"tag": "p", "text": "Three main abilities were centered around Control: tutaminis, curato salva, and altus sopor. These three umbrella abilities incorporated many of the abilities Jedi used throughout their service to the Republic."}, {"tag": "h3", "text": "Sense"}, {"tag": "p", "text": "Classified as Sense abilities by the Jedi Order, these techniques were taught to Padawans to broaden the scope of their Control abilities. Dipping into a deeper understanding of the Living Force, Sense abilities allowed Force-wielders to immerse themselves in the environment. By the end of their apprenticeship, Padawans were expected to use the Force as an additional sense, constantly attuned to the undulation of the Force."}, {"tag": "p", "text": "The Jedi Order saw the Sense abilities divided into four main groups: prima vitae, tactus otium, tai vordrax/psychometry, and projected telepathy. While there were many other styles to the Sense family, these were considered the most vital to Jedi teachings."}, {"tag": "h3", "text": "Alter"}, {"tag": "p", "text": "An advanced form of Force-use, many non-trained Force-sensitives stumbled upon this group of powers accidentally, usually resulting in disastrous events. Untamed, these Force powers can cause mass chaos, as the art of manipulating other objects must be perfected and honed. Within the Jedi Order, these abilities were considered to be Alter abilities and were taught to Jedi Knights who had mastered the art of Control and Sense. Capable of affecting the environment, these abilities were vital to a successful Knight, as without them, individuals could see the Force, but were incapable of manipulating it."}, {"tag": "p", "text": "In the Order of the Jedi, the great Masters considered the techniques of telekinesis, affect mind, and alter environment to make up this family of abilities."}, {"tag": "h2", "text": "Using Force powers"}, {"tag": "p", "text": "According to the theory that the Force is one, the light and dark sides did not actually describe the Force, but rather defined how an individual used it: to directly harm his enemies or to help himself overcome situations. Thus the aggressive or vengeful abilities inherently belonged to the dark side, while those which were healing, defensive, self-empowering, or diversionary belonged to the light side."}, {"tag": "p", "text": "For example, a Dark Jedi could cast powers that inherently belonged to the light side (like Persuasion). Kyle Katarn, who allied himself with the light side, made use of dark side powers such as Grip and Lightning, possibly because of his experience while fighting Maw, and later on Dromund Kaas. This indicated that skillful Jedi of strong character could use these abilities according to their wisdom since their high experience prevented them from drifting towards the dark side."}, {"tag": "h3", "text": "Core"}, {"tag": "p", "text": "The Core powers were the first powers a Jedi learned, and directly affected his own body or objects without actually harming or benefiting anything (except for Push, which could be used against enemies)."}, {"tag": "h4", "text": "Control"}, {"tag": "p", "text": "The most basic Force techniques, requiring mastery over self. Control was the first basic abilities to be learned by a Jedi."}, {"tag": "h4", "text": "Force Sense"}, {"tag": "p", "text": "The Force technique of Force Sense included all abilities enhancing perception of the world around a being."}, {"tag": "h4", "text": "Alter"}, {"tag": "p", "text": "The most perceptive to the dark side, alter was the last technique taught to younglings. It included powers to create external phenomenon."}, {"tag": "h3", "text": "Universal"}, {"tag": "p", "text": "Universal powers were generic Force techniques which were associated with neither side of the Force. Almost all Core powers also qualified as Universal powers, but many of them were uncommon and not an integral part of basic Jedi training."}, {"tag": "h3", "text": "Light"}, {"tag": "p", "text": "Light side powers were the Force powers that the user accessed through the Force's light side. The Jedi used them for protection, increasing physical and mental capacities, and for defense. They could also inspire and increase the resolve of allies. Certain light side powers could also be used offensively, but very few would directly cause physical harm."}, {"tag": "h3", "text": "Dark"}, {"tag": "p", "text": "Dark side powers were used to harm, debilitate, or kill. Some, like Rage and Drain, were used to benefit the user personally, akin to powers of the light side, with the difference that these were used at the expense of his or her own health or another individual's Force reserve. The dark side drew its power from negative emotions, and while the intent behind their use may well have been good at the time, it was most likely to lead one to further spiritual corruption from overuse, without the proper self control and mindset. Continuous use of dark powers was shown to have a physically corrupting effect on the Force-user, regardless of intent, due to the body's inability to handle such power for long periods of time."}, {"tag": "h3", "text": "Force powers applied to lightsaber combat"}, {"tag": "p", "text": "The Jedi and other Force organizations that used lightsabers also developed specific Force techniques especially for lightsaber combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The various abilities listed above have been seen in the movies, the Star Wars Roleplaying Game and Star Wars games licensed or developed by LucasArts, where 'official' names and definitions are given. In some of the games, the Potentium point that Force powers themselves were not inherently evil, but rather reflected the alignment of the Force-user is sometimes stressed, depending on the source."}, {"tag": "p", "text": "The Control/Sense/Alter splitting was developed for RPG rules, and was treat as game mechanics, but the Jedi vs. Sith: The Essential Guide to the Force canonized it as in-universe."}, {"tag": "p", "text": "Note that some powers, although they have multiple names, are describing the same power, in different levels or ways of use."}, {"tag": "p", "text": "It is also important to note that the rigidity of the above system merely reflects the various game design and storytelling strategies, as opposed to some actual delineation."}, {"tag": "p", "text": "Despite its name, the Force kick is highly unlikely to be a power."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}