{"url": "Force_power", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Articles needing additional sources", "Category:Force powers"], "nodes": [{"tag": "h1", "text": "Force power"}, {"tag": "p", "text": "A Force power was, generally speaking, any ability that could be used by a Force-sensitive individual using the power of the Force. Some such abilities, such as enhanced reflexes and minor acts of precognition, could be accessed without conscious application. Others, such as telekinesis or mind tricks, required acts of will, though with training could be made to seem effortless. In certain cases, attempting to act consciously could actually hinder one's ability to draw upon the Force. Some abilities could only be accessed through the light side of the Force, while others were only accessed through the dark side. Certain abilities, such as Force barriers, were neutral and could be used by any trained Force-sensitive. Aside from specific abilities that could only be accessed by the dark side, such as Force lightning, or the light side, such as becoming a Force spirit, neutral Force powers could be aligned to the light or the dark depending on how they were used. A Force choke was when the wielder used telekinesis to strangle their opponent by crushing their throat, and drew on the dark side in its intent to do harm. Contrarily, when Luke Skywalker used telekinesis to crush a Dark Trooper, it wasn't aligned with the dark side, as the act wasn't fueled by a desire to cause pain or harm. Master Yoda stated that \"a Jedi uses the Force for knowledge and defense\" and \"never attack.\" Any Force power used to harm an opponent, beyond what was necessary to protect oneself or others, would push a user closer to the dark side as such actions were generally filled with the desire to hurt the opponent, or at the very least showed a callous disregard for their safety or even their life."}, {"tag": "h2", "text": "General abilities"}, {"tag": "p", "text": "A wide variety of abilities were open to those who were able to use the power of the Force. One of the most common abilities that were utilized was telekinesis, the ability to move or otherwise manipulate objects using only an application of the Force. Similarly, an ability known as Force Stasis allowed a Force user to slow down or completely freeze an object, person, or even pure energy in place, as demonstrated in 34 ABY by Kylo Ren, who froze a blaster bolt in mid-air during the Attack on Tuanul. Another well-known ability was the mind trick, a power that could be applied to influence the thoughts and actions of another individual, often to the user's advantage. Notably, mind tricks could only affect those with weak minds.. Force visions were a powerful and mysterious ability that sometimes occurred without conscious application in sleep, though such visions were not always reliable. Force users were also able to, both consciously and inherently through their connection to the Force, augment their own natural athleticism, allowing for speed, coordination and acrobatic maneuvers beyond natural limits. These included the ability to run on walls. A mind probe was a Force power which allowed the user to search the thoughts of others. It was possible to resist this ability using the Force; powerful Force users could even turn the effects of the probe around and manage a look into the mind of the user. Some users of the Force could also use their power to sedate, as Qui-Gon Jinn demonstrated on Jar Jar Binks, or even to induce sleep and render a person unconscious, as Kylo Ren demonstrated on Rey and Mace Windu demonstrated on Rako Hardeen."}, {"tag": "p", "text": "Additionally, by using the Force on oneself, combined with the user's strength of mind and will, a Force user could telekinetically increase his or her resilience to harm, especially to other Force abilities. This typically allowed both strong and skilled practitioners of the Force to defend against another Force-user's attempt to restrain, throw, repel, mentally influence or evaluate, or otherwise affect or harm them with the Force. Most Force users were, therefore, less able to effectively use the Force on each other and tend to rely on physical attacks to break their opponents guard before attempting to use a telekinetic attack. However, those with sufficient enough skill or power in the Force could more easily overwhelm such defenses with less effort as well as make themselves practically immune to having their protection broken by others, making them extremely dangerous in direct combat.[source?]"}, {"tag": "p", "text": "Luke Skywalker displayed the ability to use Force projection across the galaxy, sending a lifelike image of himself from Ahch-To to Crait, light-years away. This projection was so realistic that Kylo Ren could not detect any deception until he tried and failed to strike Skywalker down with his lightsaber. However, the strain of creating such a projection proved to be fatal for Skywalker, who was still reconnecting with the Force after previously severed his connection. A similar form of projection, used by Yoda, allowed a Force user to communicate with another who was thousands of light-years away."}, {"tag": "p", "text": "A number of Force users, including Grogu, Rey, and Ben Solo, demonstrated the ability to use Force healing, an ability that allowed them to heal injuries and remove poisons by transferring life force from the healer, which could be recovered by resting or meditating. In the rare case of a Force dyad, the power could even resurrect the recently deceased, albeit at the cost of the user's own life. Ben Solo used this ability to resurrect Rey in 35 ABY."}, {"tag": "p", "text": "Snoke was able to manipulate the Force-bond between Rey and Ben Solo, in which they could see each other (though not their surroundings) over vast distances and were able to converse. Matter and objects could sometimes pass between individuals in a Force dyad, which Rey deliberately used to pass a lightsaber to Ben Solo during the Battle of Exegol."}, {"tag": "p", "text": "Disturbances in the Force were caused by serious events such as mass death or the presence of powerful Force users, whose signature in the Force was strong. These disturbances could be quite powerful; when nearly all of the Jedi were killed by Order 66, Yoda felt physical pain, despite the fact that he was on Kashyyyk, thousands of light-years away. More minor occurrences could also cause disturbances in the Force; when Darth Sidious killed Mace Windu, Saesee Tiin, Agen Kolar, and Kit Fisto, Yoda again felt their deaths. It is possible that Yoda's unusual power allowed him to feel such events while others could not, which would explain why few other Jedi felt the deaths of either group in the way that Yoda did, though Jedi like Jaro Tapal were among those who did, which may have led such Jedi to escape to safety."}, {"tag": "p", "text": "The entrance to the Jedi Temple on Lothal, as well as its gateway to the World Between Worlds, and the holocrons used by both Jedi and Sith, could only be opened via the Force, which protected them from outside intrusion. The painting of the Ones on Lothal, that granted access to the World Between Worlds, could only be opened with the light side of the Force. The only other way of entering was through a bond with a light side user, as demonstrated by Darth Sidious when he used the fiery energy generated by a Sith ritual to latch onto Ezra Bridger and gain temporary access to the World Between Worlds."}, {"tag": "p", "text": "Extremely powerful Force users and Force entities had access to a variety of unique abilities. For example, the Father, one of the Ones, was so powerful in the Force that he was able to touch a lightsaber blade without suffering any harm, while the Son was able to possess others. Both the Son and the Daughter were also able to shapeshift. Bendu, \"the one in the middle,\" who was neither light nor dark, could appear and disappear at will, and create massive storms with the Force."}, {"tag": "p", "text": "Strong Force users could teleport, like the Force wielders, the Nightsisters or Dorwin Corvax. The latter had the ability to suspend time."}, {"tag": "h2", "text": "Light side abilities"}, {"tag": "p", "text": "The ability to retain consciousness as Force spirit after death was a rare Force power known only to certain orders such as the Force Priestesses and a select few Jedi. Use of this ability required special training, but one who mastered it could continue to have an influence in the realm of the living even upon the death of their physical body. This influence extended to Force use, as evidenced by Yoda destroying Ahch-To's uneti tree with lightning."}, {"tag": "p", "text": "Yoda, when fighting Count Dooku and Darth Sidious, was able to absorb Force lightning with his hands, and, in his duel with Dooku, deflect it back toward the Sith. It was also possible to deflect Force lightning with a lightsaber, though even Windu, an extremely powerful Jedi, had difficulty doing so."}, {"tag": "p", "text": "Several Jedi, like Quinlan Vos and Cal Kestis, had an ability called psychometry, which allowed the user to sense the events associated with an object or location. This ability could be quite vivid, and could include visuals and sounds. The ability was innate, though practice was required to master the skill."}, {"tag": "p", "text": "It was possible for Jedi to tame animals with the Force."}, {"tag": "p", "text": "At least one Jedi, Sta-Den Eekin, was able to use his power to cloud the minds of large crowds."}, {"tag": "p", "text": "Luke Skywalker believed that the Force manifested itself in Leia as her strength of will."}, {"tag": "p", "text": "At least one Jedi, Cere Junda, was capable of producing Force barriers, such as the one used to protect Cal Kestis from Darth Vader."}, {"tag": "h2", "text": "Dark side abilities"}, {"tag": "p", "text": "Users of the dark side of the Force, such as the Sith, drew upon feelings of hatred and anger, as well as thoughts of greater power, to make use of abilities not practiced by those such as the Jedi."}, {"tag": "p", "text": "Darth Plagueis was a powerful Sith Lord so skilled in the dark side of the Force that he was able manipulate midi-chlorians to create life itself and to prevent death."}, {"tag": "p", "text": "Force lightning was a powerful dark-side ability in which a Force user emitted pure Force energy, in the form of electricity, from his or her fingers. This lighting had the ability to cause serious pain, permanent damage, and, if a target was exposed to enough, death. The lightning was so powerful that even the caster of lightning was not immune to it. Darth Vader was never able to use Force lightning because of his injuries in the Duel on Mustafar. Ordinarily, Force lightning was blue, though other colors were possible; for example, the Son's lightning was red."}, {"tag": "p", "text": "Some Sith, including Palpatine, had an ability called Dark Aura, which was a form of Force lightning that formed a miasma that damaged and slowed enemies. Another dark side battle ability was focused rage, which increased the user's aggression and potency while simultaneously decreasing the damage they sustained."}, {"tag": "p", "text": "The dark side was also the source of both Sith and Nightsister magick. Sith magic (or Sith alchemy), which could take the form of blue flames, was used by Palpatine to access the World Between Worlds and to create illusions. Sith alchemy was also used to reinforce Kylo Ren's mask when it was rebuilt by Albrekh. Unlike other Force techniques, Sith alchemy sometimes required the Sith's blood. Nightsister magick generally took the form of green mist and had many uses. For example, it could temporarily reanimate corpses as \"zombies\" and was used by Mother Talzin to show Savage Opress that his brother Darth Maul had survived the duel on Naboo. The Nightsisters also had the ability to teleport themselves and others. Additionally, their magick could be used as a shield that could repel blaster bolts, to levitate, and even to grant invisibility."}, {"tag": "p", "text": "Palpatine used the dark side of the Force to transfer his consciousness into a clone after he was betrayed by Darth Vader."}, {"tag": "p", "text": "The Inquisitor known as the Second Sister was able to use the Force to move at incredibly high speeds for short periods of time."}, {"tag": "h2", "text": "Force usage in the Unknown Regions"}, {"tag": "p", "text": "Because of a series of long-ago supernovae, the Unknown Regions were extremely difficult to navigate. However, a number of beings were able to use the Force power of precognition to navigate. Many of these Force-sensitives, such as Qilori of Uandualon, were employed by the Navigators' Guild, where were hired by other entities such as the Chiss Ascendancy. It was also possible for humans to navigate with the Force. After receiving encouragement from Grand Admiral Mitth'raw'nuruodo, Darth Vader was able to learn the skill and guide the Star Destroyer Chimaera through hyperspace."}, {"tag": "p", "text": "The Chiss also had Force-sensitive navigators, whom they referred to as ozyly-esehembo, Cheunh for \"sky-walkers.\" However, this fact was kept secret from non-Chiss, and the Ascendancy often hired outside navigators. Sky-walkers were almost exclusively female, unlike in most species, where Force powers were evenly distributed. Additionally, and likewise unusually, sky-walkers almost always lost their powers by adulthood, except in Vah'nya's case. Sky-walkers could use two powers, called Second Sight and Third Sight. Second Sight referred to telepathy, while Third Sight referred to precognition. The latter was far more common."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}