{"url": "Force_sabacc", "categories": ["Category:Legends articles", "Category:Sabacc"], "nodes": [{"tag": "h1", "text": "Force sabacc"}, {"tag": "p", "text": "The use of the term Force in Force sabacc (or Jhabacc) does not relate to using the Force for the purpose of play. The term is instead used to denote the battle between the Light Side and Dark Side at the table, and also in reference to the fact that the face cards typically carried Jedi and Sith themed graphics. The Moderation card, for example, carried the graphic of a Jedi Knight. Han Solo won the planet of Dathomir as a gift for Princess Leia Organa during a particular high-stakes game in the seedy underworld of Coruscant."}, {"tag": "h2", "text": "Rules"}, {"tag": "p", "text": "Force sabacc differs from its parent game in that, unlike sabacc, randomization is provided as a function of the choice made by each player during the first round of play. In traditional sabacc, players work toward achieving a score of either 23 or -23, and the player closest to it without going over it in either direction, wins. Force sabacc, however, requires the players to declare whether their hand will be light (positive) or dark (negative) sided as soon as they draw their first card. Play proceeds in order until all players have four cards each, at which point the game ends. A player could actually call the game after the third round of betting, though this was an option, not a requirement. In such a case, the dealer automatically deals a fourth card to each player, and no further betting is allowed. Before the scores can be tallied, however, each player has the option of discarding a single card from their hand, which is revealed at the call."}, {"tag": "p", "text": "At the end of play, the side with more combined points would be considered the winning side, with the player who's hand held the most value on that side being the individual winner of the pot. The exception to the rule, however, was a pure sabacc. If either side held either form of a pure sabacc, that side was automatically the winning side, with a positive 23 trumping a -23, as in typical sabacc. This exception won Han both the hand pot and the sabacc pot for a combined total of over eight hundred million credits. Omogg then played Han in a heads-up format, bartering Han's eight hundred million for a one-third share of Dathomir, losing the planet to Han at the conclusion of the game."}, {"tag": "p", "text": "Another notable exception to the standard play process of sabacc is that cards could be dealt inverted to any player after the first card was out. The presence of an inverted card signified to the table that the player in question had switched sides to the opposing faction. This potentially game-shifting surprise could easily be offset by the player discarding this card at the end of play, but doing so removed the ability for the player to discard other, potentially disastrous cards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}