{"url": "Force_spirit", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Force entities", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Force spirit"}, {"tag": "p", "text": "Force spirits, also known as Force ghosts were beings who gained immortality through the preservation of their consciousness after death. When lifeforms died, they became one with the Force. Through special training, however, deceased Force-sensitives could retain their identity and, therefore, communicate with the living. By achieving spiritual immortality, a person's physical form would vanish upon their death. This knowledge could be learned only by those who fully embraced the light side of the Force, such as the Jedi who lived by a code of selflessness and sacrifice. The followers of the dark side of the Force, such as the Sith, were incapable of learning this power."}, {"tag": "p", "text": "Before the Fall of the Republic, Jedi Master Qui-Gon Jinn learned the ability to become a Force spirit from the Shaman of the Whills, but was killed by Darth Maul before he could complete his training. As a result, for a time he could only commune with the living only as a disembodied voice. Near the end of the Clone Wars, a conflict in which the Galactic Republic and Jedi Order were at war with the Separatists, Grand Master Yoda embarked on a spiritual journey that brought him to the planets Dagobah and Moraband—as well as the birthplace of the midi-chlorians—and ultimately learned how to retain his identity after death. This ability was also learned by Jedi Master Obi-Wan Kenobi during the rise of the Galactic Empire. Qui-Gon subsequently mastered the ability to manifest in an almost solid form. Although Anakin Skywalker—a fallen Jedi Knight and the Chosen One of the Force—never received the training that allowed his mentors to become Force spirits, his redemption and sacrifice made it possible for his consciousness to be preserved after death by Kenobi and Yoda. In 34 ABY and 35 ABY respectively, Luke and Leia—Skywalker's children—attained immortality like their father."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Through the light side of the Force, certain beings with special training were able to allow their consciousness to persist after death and appear as Force spirits, made possible by energy from the Living Force flowing into the Cosmic Force."}, {"tag": "p", "text": "The knowledge was open only to those who followed the light side, so only certain individuals, such as Jedi and the Force Priestesses, beings who dwelled within the Wellspring of Life, a location said to be the origin of the midi-chlorians, were able to learn the ability to manifest after death. The dangerous level to become a Force spirit was low, but only possible for a rare few Jedi."}, {"tag": "p", "text": "The first known Jedi to learn the secret was Qui-Gon Jinn, who learned it from a Shaman of the Whills. Unfortunately, his training was incomplete at the time of his death, so he could only manifest as a disembodied voice. However, Qui-Gon was later able to complete his training even in death, thereby allowing him to appear to Obi-Wan Kenobi on Tatooine in an almost corporeal form. The secret was later passed on to Obi-Wan Kenobi, Yoda, and Anakin Skywalker."}, {"tag": "p", "text": "Force spirits were not only able to appear anywhere in the galaxy with a strong presence in the Force, but were also able to use the Force at a much stronger degree than most living beings. This was demonstrated by Yoda's capability of either manipulating weather to create lightning strikes, or summoning such strikes himself. Additionally, he was also shown to be capable of striking Luke Skywalker with his walking stick, demonstrating an ability to physically interact with the living world despite both Yoda and the stick being ostensibly non-corporeal. This power was also shown by the Force spirit of Luke Skywalker himself, who grabbed his lightsaber from being burned in the crashed TIE whisper by Rey, and used telekinesis to raise Red Five from the waters of Ahch-To."}, {"tag": "p", "text": "Upon becoming one with the Force, the physical body of a Jedi vanished from existence either immediately or after a short period of time, leaving their clothes behind. After death, the Jedi's spirit would go to the Netherworld of the Force, another realm of existence. Despite not being physically part of a Jedi's body, cybernetics could also vanish if attached to a physical body, like was the case of Luke Skywalker, whose cybernetic hand disappeared alongside his body when he died."}, {"tag": "p", "text": "Not only was preserving one's consciousness reserved for the Jedi, but also for users of the light side not affiliated with the Order. One year following her brother's death, Leia Organa was the only known individual to retain their self-awareness without technically being a Jedi, and her body did not vanish until the subsequent death of her son and the simultaneous disappearance of his body. The clothes worn by Leia during her death were no longer sported by her spirit, supplanted by white garments."}, {"tag": "p", "text": "In contrast to individuals committed to the light, the Sith were unable to manifest themselves after death, causing them to concentrate on gaining earthly power only. One Sith, the Presence, was able to preserve part of her conscious essence so long as it was bound to an object like a Sith holocron on the Sith temple of Malachor. Darth Momin had part of his consciousness preserved in his mask until he was crushed to death by Darth Vader after betraying him. Via their mystical power combined with the dark side, the Nightsisters could speak when dead, and in addition to manifesting themselves in the character of greenish figures under certain circumstances, they were occasionally able to haunt and possess a person invading their rest in peace. Darth Sidious, in turn, transferred his soul into a clone body shortly prior to the destruction of his original one. In the search of a new vessel to host his consciousness, he futilely endeavored to persuade his granddaughter Rey to slay him in order for his spirit to pass on to her alongside all the Sith living in him."}, {"tag": "p", "text": "Albeit unable to manifest themselves as Force spirits, some Jedi could directly address Force-sensitive individuals as voices in their postmortem existence. Having undergone the training overseen by Leia Organa, Rey invoked the power of all the Jedi of the past in 35 ABY, which awakened her inner power to overcome the Emperor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the rough draft of the 1983 film Star Wars: Episode VI Return of the Jedi, it was revealed by a resurrected Obi-Wan Kenobi that if Darth Vader became one with the dark side of the Force, he would not be able to retain his identity after death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}