{"url": "Force_wielder/Legends", "categories": ["Category:Legends articles", "Category:Articles to be merged", "Category:Cleanup", "Category:Races and species stubs", "Category:Force-sensitive species", "Category:Force wielders"], "nodes": [{"tag": "h1", "text": "Force wielder"}, {"tag": "p", "text": "Force wielders were an enigmatic species of highly Force-sensitive immortal beings with no fixed form. The varying shapes they embodied were nothing but reflections of the life force around them."}, {"tag": "p", "text": "The Ones were a family of Force wielders who lived as anchorites on the realm of Mortis, having withdrawn from the temporal world at some point prior to the Clone Wars. According to the Thuruht Killik hive, \"the Ones were what the Celestials become.\" Again according to Thuruht, a mortal being could become like the Ones by drinking from the Font of Power and bathing in the Pool of Knowledge, as Abeloth did. Few knew of the Ones' existence, and their power was highly sought after by the Sith, among others. The Father claimed that his children could \"tear the very fabric of the universe.\""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, the Father realized that he was dying. Facing his impending demise, he needed to find another to keep the balance between the Son, the embodiment of the dark side, and the Daughter, the embodiment of the light side. Around the second year of the Clone Wars, a transmission containing a Jedi distress code unused for more than 2,000 years was received by Admiral Tenant in the remote Chrelythiumn system. The High Council sent Obi-Wan Kenobi, Anakin Skywalker and Ahsoka Tano to investigate; the three Jedi were drawn into the mysterious Mortis monolith, where they met the Ones."}, {"tag": "p", "text": "After Anakin Skywalker successfully passed a test by subduing both the Son and the Daughter, the Father recognized him as the Chosen One who was destined to take his place as warden of the children."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In \"Overlords,\" the Father used the term \"Force wielder\" interchangeably with Force-sensitive when describing himself and his children to Anakin Skywalker. However, the \"Force wielder\" was classified as The Ones' official species by the StarWars.com Encyclopedia."}, {"tag": "p", "text": "James Luceno's 2012 novel Darth Plagueis contains a possible mention of the Ones. Fate of the Jedi: Apocalypse, by Troy Denning, revealed that the Thuruht hive believed this group of Force-wielders to be \"what the Celestials become.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}