{"url": "Forcesaber", "categories": ["Category:Legends articles", "Category:Infinite Empire technology", "Category:Lightsaber variations"], "nodes": [{"tag": "h1", "text": "Forcesaber"}, {"tag": "p", "text": "The Forcesaber was a Rakatan invention in which powerful dark side energy was channeled through laboratory-grown crystals in glowing energy blades."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Force Hounds were required to construct these weapons, which required the use of a special form of crystal along with the use of alchemy to shape it. The process involved the construction of a hilt and the presence of adequate resources for the task. Some Forcesaber versions, the ones used by Force hounds, were like regular lightsabers, while others, used by Rakata themselves, were similar to lightsaber pikes."}, {"tag": "p", "text": "A vision experienced by Daegen Lok during his travel into the Chasm on Tython saw him witness a blade made of fire that had never been seen before. His dark vision saw the Je'daii Masters banish him to the moon of Bogan. Lok would only discover that the weapon was called a Forcesaber when the Force Hound Xesh had been exiled to the Tythonian moon. He would ask the Force Hound to construct a new Forcesaber in order to show it as proof of his vision to the Je'daii Order."}, {"tag": "p", "text": "The basic principles of this technology would later be developed into the prototype lightsabers used by the Jedi Order."}, {"tag": "p", "text": "Forcesabers, like lightsabers, could come in a variety of colors. Xesh and Daegan Lok both utilized purple, Trill a light blue. In Lok's vision, a shadowy army of warriors were seen to wield red, while in Kwa Master A'nang's and Xesh's flashbacks, Rakatan warriors seemed to favor orange. The Flesh Raiders, mutated Rakata themselves, used yellow."}, {"tag": "h3", "text": "Risks"}, {"tag": "p", "text": "Because of its ties to the dark side, any and all Je'daii were at great risk of succumbing with each and every use of the Forcesaber. During the Rakatan invasion of the Tython system, the Je'daii Order showed signs of a great divide of those who wished to use the Forcesaber, and those who wished not to. It can be said that the Forcesaber was the catalyst of the great divide between the light and dark side of the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}