{"url": "Form_%22Zero%22", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with non-canon elements", "Category:Lightsaber combat"], "nodes": [{"tag": "h1", "text": "Form \"Zero\""}, {"tag": "p", "text": "Form \"Zero\", while not an actual form of lightsaber combat per se but rather an ethical principle, was the idea that Jedi should know when to use their lightsaber and when to find an alternative means of solving a problem. This millennium principle is mentioned by Jedi battlemaster Skarch Vaunk in The Jedi Path: A Manual for Students of the Force and was supported by Jedi Master Yoda to address the need of the Jedi to restrain themselves when tempted to use \"aggressive negotiations,\" and instead use another well-developed Jedi skill, such as the Jedi mind trick. This was a form used to arrive at a solution without resorting to violence; one that was favored by Felanil Baaks."}, {"tag": "p", "text": "Yoda used to quote of the Tythonese Sky Judge Culoph who said:"}, {"tag": "p", "text": "In the days of the New Jedi Order, Jedi Master Kyle Katarn would teach his students, among whom were Jaden Korr and Rosh Penin, that often the sight of an unignited lightsaber would be enough to cause individuals that might be potential enemies to become more cooperative. Katarn had applied this principle himself years earlier to extract information from an uncooperative bartender in Reelo Baruk's cantina on Nar Shaddaa."}, {"tag": "p", "text": "Fay was also famous for never raising a lightsaber. She used the Force to bring harmony rather than fighting, and if needed, fought using only the Force. In fact, it is unknown whether she actually carried a lightsaber."}, {"tag": "p", "text": "In Roan Novachez's second year of instruction at the Jedi academy on Coruscant, Mr. Garfield gave his students a take-home quiz on lightsaber dueling skills. Roan received a \"B\" on the quiz, having incorrectly answered the question \"What is the first Form to use in a real life lightsaber duel?\" He answered \"Form II - Makashi Form\" but Mr. Garfield felt the correct answer was \"Form Zero: Find a nonviolent solution.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "See also"}, {"tag": "h2", "text": "Sources"}]}