{"url": "Form_III/Legends", "categories": ["Category:Legends articles", "Category:Lightsaber combat forms"], "nodes": [{"tag": "h1", "text": "Form III"}, {"tag": "p", "text": "Form III, also known as Soresu, the Way of the Mynock, or the Resilience Form, was the third of the seven classic forms of lightsaber combat that was recognized by the Jedi Council prior to and during the Clone Wars. Soresu was developed during the widespread emergence of blasters as an offensive weapon. Essentially a development on Form I blast-deflect training, Soresu relied on tight bladework and subtle dodges to provide maximum defensive coverage, minimizing exposure to ranged weaponry. Over time, Soresu transcended this basic origin, and came to be considered the ultimate expression of non-aggressive Jedi philosophy."}, {"tag": "p", "text": "Like Makashi, Soresu relied on economy of motion and energy efficiency, keeping up constant blade movement to build up momentum and minimize energy expenditure. Form III focused on strong defensive technique to essentially outlast an opponent, waiting until he/she began making mistakes due to frustration or fatigue, before taking advantage of these lapses and countering. Despite its effectiveness, Soresu was heavily criticized for its lack of offensive capabilities, as it facilitated survival rather than victory. As an answer to these weaknesses, the highly aggressive Ataru and Shien forms were developed side by side."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Soresu form was devised to counter the widespread emergence of blasters, weapons that the previous Makashi form wasn't equipped to combat. The pragmatic Form III became the most defensive of the seven forms, and utilized tight moves, consisting of subtle dodges and efficient parries, intended to provide maximum defensive coverage, and minimize exposure to ranged fire. Over time, Form III came to transcend this basic and pragmatic origin, and became an expression of non-aggressive Jedi philosophy."}, {"tag": "p", "text": "Soresu utilized tight motions, lightsaber moving every second in an attempt to achieve near-total protection, and expend as little energy in the process as possible. Form III stressed quick reflexes and fast positional transition, in order to overcome the rapidity with which a blaster could be fired. This technique minimized the body's exposure, making a well-trained practitioner practically invincible, which allowed Soresu to be effective against both single enemies and multiple opponents, as well as blasters and lightsabers. Form III involved preparation for prolonged battles where the user observed and learned as much as possible about their adversary's technique while engaged in combat. Also, being more optimized for lengthy battles, a Soresu user had the ability to gain control of a combat situation, creating multiple options for the Jedi employing the form. A Form III user could choose to kill, disarm, or even reason with their opponent."}, {"tag": "p", "text": "The core tenets of Soresu encouraged duelists to place themselves \"within the eye of the storm\": to maintain a calm center, undistracted and undisturbed by the conflict around them. In keeping with this idea, Soresu incorporated powerful defensive techniques that were flexible enough to adapt to almost any circumstance, at the cost of never reaching past the figurative \"eye of the storm.\" In other words, Soresu focused almost entirely on self-defense, often at the expense of offensive capabilities. The tactics encouraged by the style involved the reliance on pure defense while essentially waiting out the opponent, holding back until his frustration or fatigue inevitably caused his defense to lapse, then employing an alternate, more aggressive attack to take advantage of this. Overall, the whole point of Soresu was to deflect blaster fire out of harm's way and safely prolong a lightsaber fight in hopes of wearing an opponent down."}, {"tag": "p", "text": "Truly focused masters of Soresu were extremely formidable due to their strong defensive technique, as well as the well-rounded nature of the form itself, effective against both blasters and lightsabers. However, Form III facilitated survival rather than victory, as Soresu possessed no dedicated offensive sequences of its own. Form III initiates were more than capable of defending themselves from attack, but they needed considerable experience to effectively counterattack and entrap opponents. Masters had to maintain an incredibly strong focus on the center of the combat circle, since the defensive tactics of the form included guards and parries that engaged very close to the body. Jedi with small lapses in their otherwise strong defense left little room to avoid injury. As a result of this defensive mindset, Soresu practitioners often had great difficulty seizing the offensive initiative in combat. Also, the goal of many Soresu practitioners was to prolong the fight, the idea being to cause the enemy to become fatigued or frustrated as they attempted to keep up their offense. However, this tactic ran the risk of fatiguing the user if said user faced an adversary who could maintain an aggressive but cautious offense."}, {"tag": "h3", "text": "Known Moves and Maneuvers"}, {"tag": "p", "text": "For the Soresu opening stance, the duelist held the blade back in a one-handed grip, angled forwards with the blade arm held parallel, the other hand held up in a challenge. The dominant foot was positioned back. The brace-ready stance had much in common with the \"Ataru guard,\" with the hilt held at waist height on the dominant side in a two-handed grip for greater control, extended vertically upwards. The dominant foot was placed back while the other was extended forwards and to the side in a brace position. A variation on this stance featured the blade held high in a drop-parry position, though the foot positions were the same."}, {"tag": "p", "text": "Against individual shooters, Form III duelists were encouraged to apply the \"deflecting slash.\" This move served the dual purposes of allowing a Jedi to redirect the momentum generated by deflecting an enemy projectile into a slashing attack at an adjacent target, and allowing the Jedi to advance and close the distance before the attacker could fire another shot. A careful application allowed a Jedi to redirect the shot back at the attacker, though this skill was more commonly applied by Shien practitioners. Against multiple blaster-wielding attackers, the \"circle of shelter\" was advised. This technique allowed a Soresu practitioner to hold off as many as twenty shooters by dropping into a moving meditation, relying on the Force to perceive the various positions of the attackers and the necessary movements to evade or deflect their shots. As this maneuver was executed while in a meditative state, prolonged use could open a Force-adept's mind to visions of the future."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "When Darth Bane first began training Zannah as his apprentice, he pragmatically judged that her small size and light build removed the more aggressive lightsaber forms from her potential repertoire. Teaching her to wield a saberstaff, he trained her to redirect an opponent's attacks rather than directly blocking in order to maintain her own energy. She took to twirling her weapon in order to maintain momentum and to set up a defensive shield against enemy attacks."}, {"tag": "p", "text": "In combat, Zannah also relied just as much on tactical know-how as lightsaber skills. As evidenced during the Duel on Tython, Zannah sought out strategically advantageous positions on the field, able to make do with a simple room corner, using the two walls to cover her flanks. Also, she was skilled at playing her opponents against one another, allowing lesser combatants to continue fighting in order to inadvertently hinder their fighting partners, as when she played Johun Othone against Sarro Xaj. However, Zannah was not without her weaknesses; her defense was designed to counter all-out assaults, a method devised from her experience sparring with Darth Bane. Sarro Xaj's powerful attacks were tempered by caution, and Zannah was forced to expend huge amounts of energy to fend him off without finding any openings for her to exploit. She only succeeded in killing her opponent because he was momentarily distracted."}, {"tag": "p", "text": "Obi-Wan Kenobi originally specialized in Form IV, trained in the form by Qui-Gon Jinn. However, upon witnessing his master's death due to Ataru's lack of defensive capabilities, Kenobi decided to switch his focus to Soresu in order to eliminate this weakness in his own technique. Kenobi's resulting skill in Form III stood him in good stead against masterful gunslingers such as Jango Fett, or during the chaotic firefight on Geonosis. His tight defense and energy-efficient moves enabled him to pull through and survive where most of the Jedi strike team could not. However, when confronting Dooku, Kenobi's skill in Soresu was insufficient to effectively counter Dooku's mastery of Form II lightsaber combat. Though Kenobi was a skilled Soresu practitioner, he was unable to match Dooku's precision and economy of motion. During their duel, many of Kenobi's cutting parries outright missed Dooku's blade, forcing Kenobi into numerous scramble situations and rapidly fatiguing him. Kenobi was ultimately brought down by light, incapacitating cuts across his left arm and leg."}, {"tag": "p", "text": "Over the course of the Clone Wars, Kenobi continued to develop his skills. His blast-deflection technique advanced to the point where Kenobi could walk \"unscathed through hornet-swarms of blasterfire.\" Kenobi's skill as a lightsaber duelist also improved considerably, developed by thousands of hours in lightsaber sparring with Anakin Skywalker and others, and hardened by numerous engagements with enemy duelists, such as General Grievous, Asajj Ventress, and even Dooku himself. Even unarmed, Kenobi was a formidable opponent, evading enemy attacks and working his way inside an opponent's defense to physically assault them, demonstrating this tactic against the likes of Ventress and Pre Vizsla."}, {"tag": "p", "text": "By the end of the war, Kenobi's mastery of Soresu had developed to the point where he could compete with Dooku. In their final duel with Dooku aboard the Invisible Hand, Kenobi and Skywalker both initially utilized basic lightsaber techniques and strategies, aiming to lull Dooku into a false sense of confidence. When they suddenly shifted to the advanced fighting methods they had practiced and developed during the interim, Kenobi displayed his full mastery of Soresu. Dooku was astounded by the simplicity and efficiency of his bladework, but also his bewildering speed and precision. Caught off guard and forced to retreat, Dooku only succeeded in defeating Kenobi thanks to his superior mastery of the Force. In his final duel with Grievous, Kenobi provided one of his purest demonstrations of Soresu. His blade's intricate pattern of blocks and parries moved just fast enough to subtly interfere with Grievous' multiple strikes, while his slight dodges and shifts of stance facilitated his evasion of the rest. As a frustrated Grievous ramped up the intensity of his assault, Kenobi countered by altering the angle of his parries, clipping off two of Grievous' mechanical wrists. However, Grievous had been badly injured by Mace Windu during the Battle of Coruscant and had had virtually no time to recuperate before facing Kenobi, which may have contributed to Kenobi's victory. Kenobi proved to be one of the only Jedi able to engage Darth Vader and emerge victorious, as his Soresu mastery perfectly countered Vader's angry Form V. Kenobi simply deflected and blocked Darth Vader's relentless rain of blows, returning counter-blows himself to disrupt Vader's onslaught, all the while guiding the battle to a location of his choice, before finally dismembering the hapless and enraged Sith Lord when his defense lapsed."}, {"tag": "p", "text": "However, during his long isolation on Tatooine, Kenobi's skills as a swordsman atrophied, as he engaged in only one lightsaber duel during his exile. Despite this, he remained a formidable Form III practitioner, and he was able to hold off Darth Vader for a short time during their rematch aboard the Death Star. However, unlike their bout on Mustafar, Vader maintained a cautious, controlled offense instead of a reckless onslaught, and Kenobi was unable to find any openings to exploit. As a result of Vader's alterations to his technique and his own advanced age, Kenobi tired rapidly, and ultimately chose to sacrifice himself in order to distract Vader from his fleeing compatriots."}, {"tag": "p", "text": "The key to truly mastering Soresu seemed to come from grasping the concepts and philosophy of the form rather than adhering to its tactics and maneuvers. While Kenobi displayed a strong preference for Soresu, he continued to apply elements of the relentlessly dogged Form I as well as the erratic strokes and acrobatics of Ataru. At one point just before the conclusion of the Clone Wars, Mace Windu acknowledged Obi-Wan Kenobi as \"the master of Soresu.\""}, {"tag": "h2", "text": "Practitioners"}, {"tag": "p", "text": "Developed to combat blasters, Form III existed for thousands of years. One of the early practitioners of the form was Meetra Surik. Her tutor during her rehabilitation, Kreia, also knew Soresu."}, {"tag": "p", "text": "By the time of the New Sith Wars, the Sith Blademaster Kas'im had mastered Form III as well as the six other forms. Kas'im trained several apprentices in the style, including Fohargh, who used it against Bane's Form V. Bane himself possessed considerable skill in the Form, training his apprentice, Darth Zannah, in it."}, {"tag": "p", "text": "Almost a millennium later, Soresu was mastered by the Jedi Battlemaster Cin Drallig, who in turn trained many in its use. Grand Master Yoda was also a master of its usage, as he was said to have achieved full mastery over every single form of lightsaber combat and their techniques and stances. It can be presumed he used his skill in Soresu to defend himself against blaster-wielding opponents, as Ataru was weak against such adversaries. Swordmaster Mace Windu was also a master of Soresu, as he, like Yoda, had fully mastered all forms of lightsaber combat, even though he never displayed his usage of it. In fact, towards the end of the Clone Wars, Soresu was the most common lightsaber form in the Jedi Order, with notables such as Luminara Unduli and Barriss Offee studying it. Jedi Master Ki-Adi-Mundi was also proficient in Soresu, as was Council member Coleman Trebor, whose focus on the purely defensive form ironically proved to be his undoing when pitted against the gunslinging skills of Jango Fett. Dooku maintained an impressive knowledge of Soresu, sufficient to train Grievous and his IG-100 MagnaGuards in it. During this period, one of the highest masters of Soresu was Obi-Wan Kenobi."}, {"tag": "p", "text": "After his defeat and mutilation, Darth Vader studied Form III and incorporated elements of its defensive bladework in his personal variant of Form V. Although at first his skills were only just enough to defend from what would be fatal attacks when he was still applying the clumsy method he used while having not adjusted to the armor, by the time of his adjustment to the armor, Vader's study of Soresu had granted him enough advanced knowledge and ability that he even managed to create an unorthodox personalized application of Soresu that he applied effectively in protecting the weak points of his suit, fighting with a two-handed grip, elbows pressed tightly to his sides with the blade held straight out in front of him, manipulating it deftly with his wrists only. He eventually extended it fully to his whole body and had became proficient enough to leave no openings behind while also attacking with great ferocity, allowing him to overwhelm even Kenobi, the so called master of Soresu, by ferociously attacking while also adequately defending enough to leave not a single opening for his old master to exploit. During his duel with Starkiller, Vader, having learned his lesson of underestimating Marek, utilized his skill in Soresu to maintain an effective defensive while also retaining immense offensive formidability, allowing him to eventually bring down the clone. Vader's apprentice, Galen Marek, was also familiar and highly skilled with Soresu and used it on numerous occasions against highly aggressive opponents, allowing him to tire them out by repeatedly blocking their blows skillfully while maintaining enough stamina to overwhelm the exhausted opponent. Marek's lightsaber-training holodroid, PROXY, replicated Soresu with his Obi-Wan Kenobi combat module, doing so with such accuracy that Marek used it as reference when he studied the form. Luke Skywalker had some skill in Form III, using it to deflect blaster bolts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sora Bulq is theorized to have practiced Soresu, based on statements in the official Databank."}, {"tag": "p", "text": "Soresu has also been included in several Star Wars games of various types. Examples include Star Wars Galaxies, where it is among moves and techniques employable by Jedi characters, though this has not definitively been declared canonical; or the Star Wars Miniatures game, where a player with a Soresu Style Mastery can roll to block all attacks that hit the character, though a character with the Makashi Style Mastery can avoid having their attacks blocked by this ability."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}