{"url": "Form_I/Legends", "categories": ["Category:Legends articles", "Category:Lightsaber combat forms"], "nodes": [{"tag": "h1", "text": "Form I"}, {"tag": "p", "text": "Form I, also known as Shii-Cho, The Way of the Sarlacc, or The Determination Form, was the first of the seven forms of lightsaber combat. This combat form was developed during the transitional period within the Jedi Order from ancient metal swords to more contemporary lightsabers. Shii-Cho was intended to cater to these new weapons, establishing the basic motions and target zones utilized with a lightsaber. As Shii-Cho was effectively an experimental combat form, and was created prior to the emergence of Dark Jedi and Sith Lords, it did not address the issue of lightsaber-to-lightsaber combat, and was quickly replaced by Form II. Despite this, Shii-Cho continued to find a niche as a training form, with almost every Jedi duelist receiving some instruction in it, and including elements in their own combat styles. Shii-Cho was considered an effective fall-back option when no other form or combat style would do."}, {"tag": "p", "text": "In combat, Form I lightsaber combat was wild and raw, relying on deliberate tactics and being primarily aimed towards disarming rather than injuring foes, in keeping with Jedi philosophy. Basic initiates in the style demonstrated rather clumsy performance, though in the hands of a master, Shii-Cho was fluid but highly randomized and unpredictable."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Original lightsabers were unstable and cumbersome weapons, used merely for ceremonial purposes, and requiring no specialized fighting methods for such usage. However, as lightsaber technology developed and they became usable in combat, a combat form tailored to make use of the advantages offered by lightsabers and compensate for their weaknesses became needed. Thus, the first form of lightsaber combat was developed."}, {"tag": "p", "text": "As the most ancient style of lightsaber combat, Shii-Cho was developed during the transition period from swords to lightsabers. Lightsabers were wielded in a manner similar to swords, so many of the maneuvers, such as attacks or parries, remained unchanged, as the key principles of the old sword-fighting methods continued to be incorporated. The simplicity and persistent methods of the form led it to being dubbed the \"Way of the Sarlacc\" and the \"Determination Form\"."}, {"tag": "p", "text": "As Shii-Cho was developed prior to either the emergence of Dark Jedi or Sith Lords, it was not created with lightsaber-to-lightsaber combat in mind. Despite this, it was the preferred form of such groups when they began appearing, as it was quite simply the only option. As lightsaber duels between practitioners of the Force became increasingly common, Form I was judged as being inadequate for the task, leading to the development of the second form of lightsaber combat, also known as Makashi."}, {"tag": "p", "text": "Despite the development of a combat form tailored to lightsaber dueling, Shii-Cho was not rendered obsolete. Its simplicity and basic focuses left the form ideally suited for basic training, and it was used to provide initiates with an early introduction to lightsaber combat. Shii-Cho remained an effective form of combat for thousands of years, its simplicity making it a good fallback option when no other form would do. However, a true master of the form could use it in both lightsaber combat and battlefield situations to great effect, as demonstrated by Kit Fisto on numerous occasions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As Shii-Cho was an extension of traditional sword-fighting styles, it retained the basics of attacks, parries, and body zones established by such ancient methods. Shii-Cho fostered an emotionally-heated mindset, which resulted in the considerable temptation to execute combat with lethal intent, requiring great restraint to exercise the form without going too far. Despite the pull to kill, the style was designed for the purpose of disarming without seriously injuring."}, {"tag": "p", "text": "Shii-Cho swordplay was simplistic and raw. In the hands of a master, the bladework was described as \"like watching water flow over the falls.\" However, less adept practitioners displayed much more basic and somewhat clumsy performance. In combat, Form I encouraged deliberate tactics, calling for continuous, step-by-step advancement while cutting off the opponent's angles."}, {"tag": "p", "text": "Shii-Cho was specialized towards engaging multiple opponents, the wide, sweeping motions being ideally suited towards attacking numerous adversaries. However, Form I was not as useful against single opponents, as such enemies had complete mobility and could find a weakness in Shii-Cho's comparatively clumsy bladework."}, {"tag": "h3", "text": "Training and practice"}, {"tag": "p", "text": "As the most simplistic form, Shii-Cho was the first form taught to initiates within the Jedi Order. Form I training provided the basic knowledge of the sword-fighting principles and blast-deflection skill that was required for practice of all the other forms."}, {"tag": "p", "text": "In order to teach students to draw upon the Force rather than rely on their senses, early level Shii-Cho blast-deflect training was conducted with a blindfold, forcing the initiate to rely upon his/her instincts. Later training was conducted through the use of sequences and velocities, the continuous repetition making the moves instinctive reflexes. These training regimens were carried over to all following lightsaber combat forms, which used similar methods."}, {"tag": "h3", "text": "Known moves and maneuvers"}, {"tag": "p", "text": "The basic rules of attacks, parries, and body target zones were established by Shii-Cho combat. Shii-Cho also had two methods of combat which determined how these moves were executed; Ideal-Form and Live Combat Form."}, {"tag": "p", "text": "Ideal Form 1 was mainly used in sparring, and all the moves and maneuvers were executed at perfect horizontal/vertical angles, with attacks and parries being perpendicular to one another. The Live Combat Form was much more functional, the attacks being diagonal strikes at each respective body zone, the goal being to increase speed and reduce actual movement."}, {"tag": "p", "text": "The body target zones were numbered as follows; 1 - head, 2 - right arm and side, 3 - left arm and side, 4 - back, 5 - right leg, 6 - left leg."}, {"tag": "p", "text": "Shii-Cho philosophy emphasized victory without injury and as such, the sun djem mark of contact was traditionally employed by Form I practitioners. Keeping with the use of sun djem, one of the attacks utilized by Form I practitioners was referred to as the \"Disarming Slash\", consisting of a strike directed at the opponent's weapon in an attempt to rip it out of their grasp. Another of the techniques utilized by Shii-Cho was dubbed the \"Sarlacc Sweep\", a wide sweeping attack in which the duelist struck against multiple enemies. Other maneuvers included the basic Form I horizontal slash."}, {"tag": "h3", "text": "Applications"}, {"tag": "p", "text": "Among the skilled warriors who utilized Shii-Cho in combat were Lucien Draay and Meetra Surik. Draay was trained by the failed Jedi Haazen, who took over due to the neglectful behavior of Lucien's mother, Krynda. Despite Haazen's lack of power or skill, he was able to mold Lucien into a formidable duelist, proven when Lucien took on the four Seers Raana Tey, Feln, Xamar, and Q'Anilia simultaneously in a group sparring match and beat them all. However, Draay was not invincible, as shown during his final confrontation with his former pupil, Zayne Carrick, whom Draay tried to kill after falling under Haazen's influence when the latter's identity as a Sith Acolyte was revealed. Despite Carrick's comparative lack of skill, and his self-described \"awkward\" relationship with the Force, he was able to match Lucien blow for blow and hold him off. However, Lucien's skill was still enough that Carrick could not defeat him, and Carrick only survived because he managed to convince Lucien to back down."}, {"tag": "p", "text": "As for Surik, she received training in Shii-Cho during her time in the Jedi Order. However, after she left the Order in the aftermath of the Mandalorian Wars, she cut herself off from the Force and accordingly \"forgot\" all her knowledge regarding it, including her skill in Shii-Cho. As she began reawakening to it, she instinctively regained her skills with Form I. Her application of the style was highly versatile, applied with numerous weapons. She used the form in a manner that allowed her to fare well against multiple opponents, but not to detract from her ability to deal with a single adversary."}, {"tag": "p", "text": "A Form I specialist who lived during the Clone Wars was Kit Fisto, who was credited as one of the best duelists in the Jedi Order. His mastery of the form was advanced, and he applied it in many battles and duels, always with his trademark smile. He went head to head with many of the most dangerous adversaries of the Clone Wars and survived. A notable opponent was General Grievous, whom Fisto proved able to hold his own against and nearly defeat, as Form I's specialization against multiple foes was well-suited to holding off the four lightsabers Grievous' bizarre mechanical anatomy allowed him to wield. Fisto's quick thinking and speedy reflexes enabled him to recognize vulnerable body zones on his opponents and react immediately, as shown when he cut off Grievous' legs and later one of his hands during their duels. His versatility with Shii-Cho was such that he could ably apply it towards the usage of dual-blades, or even lightwhips."}, {"tag": "p", "text": "However, Kit Fisto was not without his weaknesses. Form I was ideal when heavily outnumbered and effective against many opponents, but a single opponent was able to find flaws in it, and this proved to be Kit Fisto's downfall. Against Asajj Ventress on Ord Cestus, he simply wasn't quick enough with his blade to deal with the Makashi specialist, and Shii-Cho was considered weak against Form II in any case. His final battle against Darth Sidious ended with Fisto's death, as—despite Fisto's own power and skill—he simply wasn't able to compete with Sidious. However, Fisto managed to last longer than his fellow combatants, Agen Kolar and Saesee Tiin, being able to block several of Sidious' vicious blows before falling."}, {"tag": "p", "text": "Obi-Wan Kenobi commented Form I was wild, raw, and deadly, requiring much emotional heat, and Kit Fisto noted how hard it was to control the pull of Form I, disabling opponents rather than killing them. However, Kenobi was nevertheless versed to a degree in Shii-Cho, able to infuse elements of the Form into his swordplay, including the rematch with Count Dooku onboard the Invisible Hand. Qui-Gon Jinn, Kenobi's master, also displayed a level of mastery over the form. Dooku himself, who had enough knowledge in Form I to train others on it, described Shii-Cho swordplay as \"deliberate as a lumberdroid, moving step by step, cutting off the angles, clumsy but relentlessly dogged.\""}, {"tag": "h2", "text": "Notable practitioners"}, {"tag": "p", "text": "As Shii-Cho had been in existence for millennia, and was used to provide early training in lightsaber combat, almost all lightsaber duelists received some level of training in it and included aspects of the form in their own fighting methods."}, {"tag": "p", "text": "Other than Lucien Draay, Meetra Surik, Obi-Wan Kenobi, and Kit Fisto, Shii-Cho had many advanced and/or specialist practitioners. In more recent years, the form was mastered by the Jedi swordmaster Cin Drallig along with the other six forms. Grand Master Yoda and Swordmaster Mace Windu were also proficient in its usage, as they were said to have fully mastered all the seven forms of lightsaber combat. Master Kirlocca of the Almas Academy was also credited as having mastered Form I. Kento Marek was a Shii-Cho practitioner, and his son, Galen Marek, also known as Starkiller, maintained a familiarity with the form, able to recognize it in his opponent's technique."}, {"tag": "p", "text": "Dooku himself had sufficient knowledge in Shii-Cho that he personally trained General Grievous and his IG-100 MagnaGuards in the style. Darth Vader incorporated elements of Shii-Cho into his personal variant of Form V, and his son, Luke Skywalker, received instruction in basic Form I velocities during his early training under Obi-Wan Kenobi."}, {"tag": "p", "text": "Shii-Cho, like the other six forms, would eventually be rediscovered by the New Jedi Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Shii-Cho was first described in the Fightsaber: Jedi Lightsaber Combat article in Star Wars Insider 62, written by David West Reynolds and fencer Jack \"Stelen\" Bobo, identified it as Form I lightsaber combat. The proper name of the form, \"Shii-Cho\", as well as its alternate titles as the \"Determination Form\" and the \"Way of the Sarlacc\" would be specified in later sources."}, {"tag": "p", "text": "While every Jedi-trained duelist would have received training in Form I, there are few specialist practitioners. However, there are some individuals theorized to be adherents, like Sora Bulq, based on statements in the official Databank, which credits him as a master of all known lightsaber forms, though Shii-Cho isn't explicitly mentioned."}, {"tag": "p", "text": "Shii-Cho, along with the other lightsaber forms, appears in Star Wars Galaxies as part of moves and techniques employable by Jedi characters. This has not been clarified to be canonical."}, {"tag": "p", "text": "Shii-Cho shares some similarities to real life Kendo, Japanese sword fighting, with the main targets being the body and head."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}