{"url": "Form_II", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Lightsaber combat forms"], "nodes": [{"tag": "h1", "text": "Form II"}, {"tag": "p", "text": "Form II, also known as Makashi (pronounced muh-KAA-shee), was the second form of lightsaber combat invented by the Jedi Order. A graceful combat style, it became a specialist form for duels with opponents belonging to the Sith Order. Form II relied on careful and controlled strikes instead of power and strength. Count Dooku was a master of this form and trained the Sith assassin Asajj Ventress in its use, though hers was less elegant than her master's. The Grand Inquisitor was a proficient Form II practitioner. Jedi Master Ki-Adi-Mundi was another who used the technique and also taught it to others in the Order at the Jedi Temple on Coruscant. Crossguard lightsabers were once common among Makashi practitioners, many of whom fought at the Great Scourge of Malachor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The second lightsaber form, known as Makashi, arose in direct response to the appearance of enemies who themselves wielded lightsabers; the Sith. The techniques of Shii-Cho, derived from traditional blade-to-blade combat, did not account for the unique qualities of a lightsaber pitted against another lightsaber. In particular, a lightsaber beam's omnidirectional \"edge\" and lack of mass opened up new avenues of attack that the parries and other defensive maneuvers of Shii-Cho simply could not counter. Form II took full advantage of these same traits from a defensive standpoint. Once established, it remained the standard for lightsaber duelists until the end of the Jedi Order."}, {"tag": "p", "text": "Prior to the emergence of the Sith, the Jedi had never faced adversaries on truly equal terms. These new foes were the counterparts of the Jedi in every way, from their use of lightsabers to their mastery of the Force. In fact, the first Sith were fallen Jedi who possessed intimate knowledge of all the Jedi's ways, including the techniques of Shii-Cho. Both sides of the conflict that would come to be known as the Hundred-Year Darkness swiftly found their existing techniques insufficient for defending against lightsaber-wielding opponents. The early duels between Jedi and Sith were often quite brief, and the casualty rate early in the war was appallingly high."}, {"tag": "p", "text": "The Jedi and Sith sought every advantage in the struggle, which soon led combatants on both sides to experiment with the use of a second lightsaber. The techniques of Shii-Cho were entirely unsuited to wielding two lightsabers, and Jedi had previously fought exclusively with a single blade. Even as the Makashi form began to take shape, duelists found wielding\ndual lightsabers awkward and impractical for the precise movements needed. This led to the development of the first shotos, which some early practitioners of Makashi wielded as off-hand weapons, a practice that endured throughout the age of the Republic. Even on a battlefield where dozens of Jedi and Sith clashed, most warriors focused on a single foe at a time. These lightsaber duels arose organically as combatants sought to engage one another on equal terms as much as possible, or else were swiftly overwhelmed. The prevalence of duels was yet another unique element of the unprecedented conflict, and the lessons the Jedi learned defined Form II."}, {"tag": "p", "text": "Unlike Shii-Cho, which prepared warriors to face superior numbers, Makashi focused primarily on combat with a single foe, and its defensive maneuvers reflected this. Of course, a duelist still might have been called upon to face numerous foes, and so must have practiced other techniques. For many Jedi, Makashi represented the most refined and elegant form of lightsaber combat. In contrast to the broad sweeps of Shii-Cho, Form II required unerring precision in every movement. This was a relic of the form's origins, when the stakes could not be higher and a single misstep could mean a sudden death at the blade of a lightsaber. Consequently, Makashi placed a high focus on techniques to avoid being disarmed, while disarming one's opponent in turn."}, {"tag": "h3", "text": "Makashi in practice"}, {"tag": "p", "text": "Form II presented a graceful, even balletic approach to wielding a lightsaber. For many observers of Makashi, even Jedi in training, this elegance was the defining feature of Makashi, even more so than the form's effectiveness. This reflected the importance many Makashi practitioners placed on the psychological and interpersonal aspects of a duel. Unlike other forms of battle, a duel represented a highly personal, almost intimate interaction. Achieving an understanding of one's opponent was key, as was concealing one's own intentions. For a master of Form II, projecting the right appearance and attitude could be as vital as any feint of the blade. Consequently, of all the forms, Makashi most assumed and encouraged personalization on the part of the practitioner, for only with a unique flair and style could a duelist master their opponents' perception."}, {"tag": "p", "text": "As part of this battle of personalities, Form II duelists carefully but continuously probed an opponent's defenses, both mental and physical-testing for the opening in which to deliver a potentially final blow. This approach stood in contrast to the barrage of powerful blows that was a hallmark of Shii-Cho. In another departure from the first lightsaber form, Makashi emphasized retreat as much as advance; practitioners continuously closed with and withdrew from an opponent in response to the intensity of the foe's offense."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}