{"url": "Form_VII/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Lightsaber combat forms"], "nodes": [{"tag": "h1", "text": "Form VII"}, {"tag": "p", "text": "Form VII, also known as Juyo, the Way of the Vornskr, or the Ferocity Form, was the seventh of seven forms recognized as canon for lightsaber combat by the last Jedi Council of the Old Jedi Order. In use, millennia prior to the Battle of Yavin, the Juyo incarnation of Form VII was described as the most vicious form of lightsaber combat and was said to involve significant internal focus on the part of the user. Juyo had many practitioners throughout the years, including Jedi Masters Kavar, Zez-Kai Ell, and Vrook Lamar. As time passed, knowledge of Form VII became restricted among the Jedi Order, whose members were worried that its precepts would lead practitioners toward the dark side. In contrast, members of the Sith, such as Darth Maul, employed Juyo without reservation, as did Dark Jedi such as Galen Marek."}, {"tag": "p", "text": "In the later days of the Galactic Republic, a new variation of Form VII, dubbed Vaapad after a creature native to the planet Sarapin, was created by Jedi Masters Mace Windu and Sora Bulq. Vaapad was explained as being a state of mind rather than just a fighting style, allowing the wielder to channel his own inner darkness into the duel, and accept the fury of the opponent. Windu, Bulq, Windu's former Padawan Depa Billaba, and Quinlan Vos were four notable practitioners of the Vaapad variant. Records of both Juyo and Vaapad survived the Great Jedi Purge and were recovered by the New Jedi Order, who preserved the records of Form VII into the Sith–Imperial War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "There were two variations of Form VII, Juyo and Vaapad, but both utilized bold, direct movements. According to accounts compiled by the New Jedi Order, use of Form VII was more demanding in terms of energy used due to a broader focus and deeper utilization of emotion. A Form VII practitioner was said to maintain a calm exterior appearance, but they were also stated to experience significant internal pressure, while using the Ferocity Form. In addition, it was described as sometimes paradoxical and unpredictable, as well as filled with concepts that made the form too difficult and unattractive to many students."}, {"tag": "h3", "text": "Juyo"}, {"tag": "p", "text": "Juyo was described as the most vicious form of lightsaber combat, and was said to be filled with both fury and \"malignant grace.\" The form was given the title of the most difficult and demanding form in all of lightsaber combat. Skilled combatants with Juyo were said by Jedi Master Vrook Lamar to be able to \"eviscerate a lone enemy\"; in fact, it was designed for such a purpose in one-on-one lightsaber duels. According to the Sith Lord Darth Traya, the form was both chaotic and erratic, with a heavy focus on offense, and using techniques believed to have been rejected from Shii-Cho in the earliest days of the Jedi Order. Juyo's use was controversial among the Jedi Order, as many felt that Juyo violated the \"there is no emotion, there is peace\" tenet of the Jedi Code due to its requirement to fight under the guidance of controlled passion. The Sith had no such inhibition, and Darth Sidious went so far as to label it a \"Sith style\"."}, {"tag": "p", "text": "Jedi Battlemaster Cin Drallig listed bold, direct motions as characteristics of Juyo, qualifying them as more open and kinetic than Form V, but with a less elaborate appearance than Ataru. Drallig contrasted the tactics of Juyo as not nearly as graceful or linked as those of Ataru, instead referring to them as \"seemingly unconnected staccato sequences.\" He also listed one of the strengths of the form as its unpredictability. The form was said to necessitate greater energy than Form V, due to a broader wielding of a user's focus and a deeper emotional link. Despite the challenges inherent in the use of the form, it could serve as a pathway to considerable power."}, {"tag": "h3", "text": "Vaapad"}, {"tag": "p", "text": "Vaapad was described as more than a fighting style; it was a state of mind that led through the penumbra of the dark side, requiring the user to enjoy the fight, and relish the satisfaction of winning. The practitioner of Vaapad would accept the fury of their opponent, transforming themselves into one half of a superconducting loop, with the other half being the power of darkness inherent in the opponent. The form was also mentioned with a cautionary warning by the Jedi that use of Vaapad led the user perilously close to the dark side due to its focus on physical combat. Vaapad required a constant and sizable stream of Force use from the user, with a barely contained explosion of Force power essential to all variations of Form VII as another prerequisite for its use. The form's attacks appeared to be unconnected, its motions seemingly unpolished to an untrained observer."}, {"tag": "p", "text": "During the later years of the Republic, Jedi Master Mace Windu developed Vaapad with the aid of fellow master Sora Bulq, by drawing inspiration from the movements of a creature, known as both the Vaapad and the Juyo, native to the planet Sarapin. Vaapad users appeared to wield many lightsabers at once, moving too fast to see, just as the vaapad creature would attack with blindingly fast tentacles that were impossible to count until the vaapad was dead. A Vaapad user's attacks would flow into each other with liquid precision, creating the constant near-invisible weave of energy which was the ready-stance of Vaapad. It was also possible to apply Vaapad in unarmed combat, with the user's arms becoming too fast to see, as well as in the use of dual lightsabers. While observing the duel between Darth Sidious and Mace Windu, Anakin Skywalker considered Windu's Vaapad bladework to be \"an oblate sphere of purple fire\" which contained dozens of blades attacking from every angle."}, {"tag": "p", "text": "After his fall to the dark side prior to the Clone Wars, Count Dooku described the power of Vaapad as skirting the dark side of the Force, but stated during a duel with Sora Bulq that the form was bridled and weak without direct use of the dark side. Dooku later subverted Bulq to his cause. After Bulq fell to the dark side, he claimed that he had perfected the form, which Windu disputed while engaging Bulq in a lightsaber duel. While Bulq had previously practiced Vaapad with Windu, he was unable to defeat him in combat and their duel ended in a stalemate. Though Windu and Bulq were credited with the creation of the Vaapad variant, the seventh lightsaber form was known, albeit obscurely, by the name Vaapad as early as the end of the New Sith Wars by the Sith Blademaster Kas'im."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "Millennia prior to the Galactic Civil War, Juyo was ascribed the moniker of the \"Ferocity form\" due to its aggressive nature. Jedi Master Zez-Kai Ell claimed that Juyo was highly effective against an armed opponent, though much less against a foe skilled with the use of the Force. Master Kavar, a colleague of Zez-Kai Ell, advised Juyo for use in quickly overwhelming a single foe as well, but cautioned that it left one vulnerable to Force attacks such as those employed by Dark Jedi. Jedi of this era prescribed caution and control when using Juyo, and were loath to teach it to those with known recklessness, as the form's ferocity could lead them to the dark side. Juyo was said to be able to destroy even the defenses of a Form III master, but the practitioner was left vulnerable to counter-attack in the process, particularly from multiple opponents and Force powers."}, {"tag": "p", "text": "According to Jedi battlemaster Cin Drallig, who served in the final days of the Old Republic, Form VII was sufficiently demanding that only masters skilled in practicing multiple other forms were capable of utilizing it effectively. Drallig stated that the mastery required to learn Form VII was such that only a select few would be allowed to utilize it; he forbade its study to all others. At least two users of its Vaapad variant during Drallig's tenure described the form as dangerous due to its focus on physical combat and intensity. For his part, Drallig refused to allow Anakin Skywalker to study Juyo, while Obi-Wan Kenobi was likewise forbidden to learn Vaapad by Qui-Gon Jinn. Windu also discouraged Quinlan Vos from learning Vaapad when Vos used it in a practice duel, learning from Vos that he had learned the move from Bulq and warning him against using it again, due to Vos already being perilously close to the dark side."}, {"tag": "p", "text": "Jedi Master Mace Windu, who developed Vaapad along with Weequay Jedi Sora Bulq, stated that Vaapad was an answer for his own weakness, allowing him to channel his own internal darkness into something positive. Furthermore, he said that he would not allow the use of the form without his permission, something that he had only given to his apprentice, Depa Billaba. Jedi Master Siri Tachi once explained to her Padawan, Ferus Olin, that the reason Mace Windu was able to dismiss the pleasure in power which Vaapad brought was by acknowledging it and being constantly aware of it. Windu wielded the form in numerous battles, especially in the Petranaki arena against bounty hunter Jango Fett, where his relentless use of Vaapad overpowered Fett."}, {"tag": "p", "text": "While dueling Darth Sidious in 19 BBY, Mace Windu's three Jedi companions were quickly brought down by the Sith Lord. In order to combat Sidious' furious technique, Windu gave himself completely over to Vaapad. He allowed it to fully channel his own inner darkness, as well as accepting and using the darkness of Sidious. When fully immersed in his form, Windu's fighting prowess was such that he could allow his body to fight automatically for him without needing to direct it with his mind. Sidious' own fury was used and redirected by Windu via the use of Vaapad, a process which Windu mentally likened to a lightsaber deflecting a blaster bolt back at its source. After Windu disarmed Sidious, the Sith Lord attempted to blast him with Force lightning, but Windu responded by once more employing Vaapad techniques to channel the dark power of the lightning through him without it affecting him; he then redirected it back to its source. However, Windu believed that his use of Vaapad alone was insufficient to defeat Sidious, as he felt it would only result in a stalemate."}, {"tag": "h2", "text": "Known moves and maneuvers"}, {"tag": "p", "text": "It should be noted that while the sequences and maneuvers of Form VII could be practiced and drilled, a duelist would not be truly executing the style unless they allowed the excitement and passion of battle to color their actions. The Form VII opening stance was a one-handed high guard with the blade held horizontally above the head and pointed to the side. The body was half-twisted, with the off-hand swept across and down. Juyo users were proficient in a technique called \"Assured Strike\", wherein they traded sheer power for a near-certainty of landing a hit. Another technique they used was referred to as \"Vornskr's Ferocity\", which involved \"ferocious\" attacking of an opponent. Wielders of Juyo were capable of employing this move without allowing the influence of the dark side to pervade their aggression."}, {"tag": "p", "text": "Those skilled in the Vaapad form were known for their use of the \"Swift Flank\" technique, where they leaped or dashed around an opponent to make a quick strike. The speed of the maneuver was intended to catch opponents off guard. They were also skilled in \"Tempered Aggression\", a term used to describe the ferocity of the Vaapad form, but with more control against succumbing to the dark side even in the heat of battle."}, {"tag": "h2", "text": "Practitioners"}, {"tag": "h3", "text": "Juyo"}, {"tag": "p", "text": "Juyo was an established form of combat four millennia prior to the Battle of Yavin. Jedi Masters Vrook Lamar, Zez-Kai Ell, and Kavar were all skilled in its use and were able to pass on their experience to others. Jedi Master Atris, who fell to the dark side during the First Jedi Purge, was also known to employ the form. Jaric Kaedan, a Jedi Master who fought in the Great Galactic War, was a master of the form—which was known as Juyo-Kos by that time—and he was considered a living weapon guided by the will of the Force itself. Other Great Galactic War combatants, Jedi Master Gnost-Dural and the Sith Lord Scourge, also employed Juyo. The Sith Blademaster Kas'im was a master of all seven forms of lightsaber combat near the end of the New Sith Wars, and the Sith apprentice Sirak, who was stationed on Korriban during Kas'im's tenure there, was known to incorporate Juyo thrusts and jabs into his fighting style. Another Sith Lord of that era, Darth Bane, was proficient in the use of Juyo. During the conflict, use of Juyo caused many Jedi to fall to the dark side and join forces with the Sith. As a result the Jedi Council restricted the use of the Form, and in the time following the end of the conflict, the Jedi battlemaster Skarch Vaunk trained Juyo to only a few hand-picked students each year."}, {"tag": "p", "text": "Darth Sidious had achieved mastery of Juyo and his competence was great enough to train Darth Maul in its use. Maul's inner aggression complimented his use of the form and he used it as his primary method of lightsaber combat, drawing heavily on the dark side to gain the ability to overwhelm opponents through sheer ferocity. His most notable usage was during 32 BBY, when battling Jedi Master Qui-Gon Jinn and Jedi Padawan Obi-Wan Kenobi in Theed, Maul showed the ability to adapt Juyo into the use of a double-bladed lightsaber. Maul's use of the form was enough for him to fight both highly skilled Jedi at once despite Juyo's weakness to multiple foes and when he engaged them one-on-one, Maul quickly broke through Qui-Gon Jinn's defenses, allowing him to slay the Jedi Master. However, Maul was devoted to the physical aspect of Form VII, as the Sith sought a purely physical victory over any enemy no matter how numerous, but by the Clone Wars, Maul grew out of this, now incorporating the Force, and he was able to fully master Juyo. His skills could overwhelm the defenses of even Kenobi, one of the greatest masters of Soresu. In fact, Form VII had fewer practitioners than other styles, due to its difficulty, complexity, and demands."}, {"tag": "p", "text": "Jedi Battlemaster Cin Drallig and Grand Master Yoda had knowledge and mastery of all seven forms, including Juyo, befitting Drallig's role as lightsaber combat instructor at the Jedi Temple and Yoda's reputation of having mastered all forms of lightsaber combat as did Anoon Bondara, another lightsaber instructor. Lannik Jedi Master Even Piell was familiar with all seven forms of lightsaber combat, including Form VII. Furthermore, his Padawan, Jax Pavan, had some knowledge of the Juyo form, which he learned during his time in the Jedi Order. Another practitioner of Juyo was the grizzled Jedi General Rahm Kota, who survived both Order 66 and the Great Jedi Purge. Mace Windu and Sora Bulq, who co-created the Vaapad variant of Form VII, were particularly skilled and knowledgeable in the use of Juyo, enough to together perfect the form into Vaapad."}, {"tag": "p", "text": "Darth Vader's secret apprentice, Galen Marek, was proficient in the use of Juyo, with his concentration and aggression being enough to bring down opponents with sheer tenacity. His application of Juyo was also laced with sudden Force-based attacks in the midst of complex lightsaber sequences, making him highly unpredictable. Marek used the form against both a vision of himself while on the planet Kashyyyk and against the fallen Jedi Maris Brood on Felucia in 2 BBY. Marek's droid companion, PROXY could use an imitation of the form, albeit without the Force, which he fought with while dueling Marek in the guise of Anakin Skywalker. After his defeat in the Duel on Mustafar, Vader himself studied Form VII and became versed in it, at times applying elements of Juyo as part of his customized variant of Form V, employing some of its techniques when he killed the resistance fighter, Roan Lands, who was a good friend of the former Jedi Ferus Olin. Knowledge of Juyo in the book The Jedi Path: A Manual for Students of the Force and records compiled by Jedi Master Cin Drallig was passed on to the New Jedi Order after the Great Holocron was recovered. The New Jedi Order then preserved this information into the Sith–Imperial War."}, {"tag": "h3", "text": "Vaapad"}, {"tag": "p", "text": "Weequay Jedi Master Sora Bulq, already considered one of the Jedi Order's finest lightsaber practitioners and skilled in all seven forms, helped Mace Windu perfect Vaapad in the later years of the Republic. After the Battle of Geonosis, Bulq became disillusioned with the Galactic Republic and the Jedi Order and fell to the dark side. As was later said by Windu, Bulq did not master Vaapad; Vaapad mastered him."}, {"tag": "p", "text": "Before falling, Bulq also taught Quinlan Vos some maneuvers from Vaapad when the amnesiac Kiffar needed retraining. Vos would later demonstrate his new talents inadvertently during a practice session with Mace Windu, who immediately recognized his move as part of Vaapad. Windu abruptly halted the duel, warning Vos not to use Vaapad again, as Vos was already considered to tread too closely to the dark side for him to safely employ Vaapad. However, while Vos was serving as a double agent for Count Dooku during the Clone Wars, he was encouraged by Bulq, who had by that time allied with Dooku, to take up Vaapad's power again. Mace Windu, in his private memoir, expressed concerns and suspected Vos had mastered Vaapad to a degree greater than the Kiffar revealed. During the Siege of Saleucami, Dooku, Bulq and Tol Skorr prodded Quinlan Vos to give himself over to the dark side and to Vaapad; Vos thereby demonstrated his level of mastery of Vaapad in his duels with Skorr and Bulq, defeating both in lightsaber combat and completing his mastery of the flow of light and dark mastery of Vaapad requires as exemplified when Vos was freed from Bulq's Force illusions."}, {"tag": "p", "text": "The only student Mace Windu ever taught Vaapad to was his own Padawan, Depa Billaba. Under Windu's instruction, Billaba became a master of Vaapad, with Windu considering her virtually unbeatable in personal combat. While on a mission with her master to Nar Shaddaa, Billaba and Windu were forced into a deadly confrontation with mutated giant akks. They barely survived the encounter, and Windu would later comment that on that day, Billaba had shown blade work that surpassed his own. While on a mission to Haruun Kal, Billaba fell to the dark side, allowing the blood fever of the jungle and the pull of Vaapad to take over. Mace Windu was forced to travel to Haruun Kal and face his student in a duel. Windu discovered that the only way he could survive against his former Padawan was to give all of himself to Vaapad, but realized that if he did, he would fall to the dark side as well. Turning away from the dark side, Windu conceded the fight, purposely opening himself up for Billaba's killing strike. However, Billaba, seeing what she had become, attempted to take her own life but was stopped by timely outside intervention."}, {"tag": "p", "text": "While fighting the cyborg General Grievous on Coruscant, Windu again displayed his mastery of Vaapad. Grievous responded by mimicking Windu's style, which resulted in what Windu considered a passable imitation of the form. Grievous had instructed his personal IG-100 MagnaGuard droids in all seven forms of lightsaber combat, including Form VII. As with Juyo, knowledge of Form VII was recovered from The Jedi Path and the Great Holocron by the New Jedi Order, who preserved the information into the Sith-Imperial War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Form VII was first mentioned as part of the Star Wars: Attack of the Clones: The Visual Dictionary, though little information was given as to its characteristics or users, other than that it was employed by Jedi Master Mace Windu. Along with the other six classical saber forms, it was heavily described by David West Reynolds and fencer Jack \"Stelen\" Bobo for the \"Fightsaber: Jedi Lightsaber Combat\" part of Star Wars Insider 62. This same source also retconed Darth Maul's use of Form VII in Star Wars: Episode I The Phantom Menace, while a StarWars.com web page derived from the Fightsaber piece later established that Mace Windu had wielded Vaapad against Jango Fett in Star Wars: Episode II Attack of the Clones. Windu's Vaapad-inspired fighting style was to be first mentioned in the reference book The Essential Guide to Episode I by Daniel Wallace and was later revealed in other sources after that book's cancellation."}, {"tag": "p", "text": "Form VII was then expounded upon in numerous other sources, including Darth Bane: Path of Destruction, Star Wars: Knights of the Old Republic II: The Sith Lords, and numerous supplementary works and RPG guides, which expanded its list of practitioners and established Juyo as a known form circa the Jedi Civil War. The Clone Wars novel Shatterpoint had a large focus and considerable description on the Vaapad variant, as two of the chief characters, Mace Windu and Depa Billaba, were masters of the form. Several issues of comics set during the Clone Wars, including Trackdown from the Star Wars: Republic story arc, as well as Jedi: Mace Windu and Jedi: Count Dooku, featured Vaapad in a substantial role, due to the involvement of Mace Windu and Sora Bulq."}, {"tag": "p", "text": "Both Juyo and Vaapad were extensively described in the 2007 reference book Jedi vs. Sith: The Essential Guide to the Force, which provided an entry for Form VII, as well as a longer description of Vaapad. The Essential Guide to the Force established that knowledge of the seven forms, including Juyo and Vaapad survived into the Legacy era."}, {"tag": "p", "text": "In the video game Star Wars: Knights of the Old Republic II: The Sith Lords, the Jedi Masters could teach the Jedi Exile the Juyo form only if she was Jedi Guardian or its corresponding prestige classes, the Jedi Weapon Master or the Sith Marauder."}, {"tag": "p", "text": "The Sith apprentice Sirak in Darth Bane: Path of Destruction was stated to be a Vaapad practitioner, long before the style was created by Mace Windu. At a book signing in Huntington Beach, California, author Drew Karpyshyn said, \"I meant Juyo, but it was a late night when I wrote that and didn't catch it until it was too late. That's one mistake I wish to God I could change. So when you read it and see 'Vaapad', just pretend it says 'Juyo.'\" Star Wars Insider 92 later explained it by stating that \"juyo\" was another term for the vaapad creature the form was named after."}, {"tag": "p", "text": "Form VII, along with the other lightsaber forms, appears in Star Wars Galaxies as part of moves and techniques employable by Jedi characters. This has not definitively been clarified to be canonical."}, {"tag": "p", "text": "Form VII is displayed as part of the non-canonical guest appearance of Darth Vader in the fighting game Soulcalibur IV as part of Vader's repertoire of moves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}