{"url": "Form_V/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Lightsaber combat forms"], "nodes": [{"tag": "h1", "text": "Form V"}, {"tag": "p", "text": "Form V, also known by its two primary disciplines of Shien and Djem So, as well as The Way of the Krayt Dragon or The Perseverance Form, was the fifth of seven forms recognized as canon by the last Jedi Council for lightsaber combat. It was developed by practitioners of Form III who felt that the defensively minded form unnecessarily extended time spent in combat by forcing its users to wait for an opportunity to strike rather than create their own openings. Form V combat was characterized by power attacks and defense immediately followed by a counterstrike."}, {"tag": "p", "text": "Shien, considered the classical variant of Form V, was more adept at blocking blaster bolts than for blade-to-blade combat, whereas Djem So was developed later and was specifically intended for use in lightsaber combat. Both Shien and Djem So were designed to use an opponent's attack against them, as evidenced by Shien's focus on returning blaster bolts to their origin and Djem So's emphasis on immediate counterattacks. Although some Jedi felt that Form V encouraged aggression and domination, that sentiment did not stop many Jedi from practicing the form."}, {"tag": "p", "text": "Form V was developed sometime prior to the Great Sith War, which began in 3996 BBY, and it continued to be used for millennia, during the Jedi Civil War, New Sith Wars, Clone Wars, and beyond. Like the other lightsaber forms, it saw use among both the Sith and Jedi. Knowledge of the form survived the Great Jedi Purge initiated in 19 BBY and into the era of the New Jedi Order. Practitioners of Form V included Jedi Masters Aayla Secura, Adi Gallia, Plo Koon and Luke Skywalker, Jedi Knights Anakin Skywalker and Ulic Qel-Droma, and Dark Lord of the Sith Darth Bane."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Form V, also known as the Way of the Krayt Dragon, was created by Form III masters who desired a more offensive style, since the defensive nature of Form III often led to prolonged combat, which was potentially dangerous for its practitioners. Form V evolved into an accepted style by combining the defensive maneuvers of Form III with the more aggressive philosophy and tactics of Form II. Form V required a higher level of physical strength than the other lightsaber forms, due to its focus on complete domination of its practitioners' opponents. It was considered the most physically demanding of all the forms."}, {"tag": "p", "text": "The form was developed alongside Ataru at a time when the Jedi were increasingly called upon to actively keep the peace. Some Jedi, noting its dedication to domination and strength, felt that Form V encouraged an inappropriate focus on controlling one's assailants. Other Jedi, including the Jedi Battlemaster Cin Drallig, were somewhat ambivalent regarding the form. Nevertheless, the Form's proponents maintained that Form V was an effective and powerful tool for the Jedi Order. Form V had two distinct variations: Shien and Djem So, and most users had a preference for one or the other."}, {"tag": "h3", "text": "Shien"}, {"tag": "p", "text": "The Jedi of the Old Republic who developed and employed the classical Form V variant Shien dubbed it the Perseverance Form. Shien was described as being well-adapted to guard against blaster fire and enemy strikes without compromising one's ability to launch powerful counterattacks. The style worked best when countering attacks from multiple opponents, and was typically less effective against a single adversary. Shien existed at least as early as the Jedi Civil War, which began in 3959 BBY. With its focus on repelling blaster fire, Shien kept in mind that Jedi were often outnumbered by their opponents and needed to defend themselves while retaining offensive capability. Additionally, there was a Sith variant of the form called Sith Shien, though it is not specified how this form might have differed from its Jedi counterpart."}, {"tag": "p", "text": "The Shien opening stance was a high guard position, with the lightsaber hilt held in a two-handed grip above the user's head and the blade angled upward and behind the user. The dominant leg was held back, enabling powerful step-through strikes to be utilized. Shien users were also proficient in a maneuver referred to as the \"Barrier of Blades,\" which defended the user from blaster fire and redirected some of the incoming blasts. \"Shien Deflection\" was another technique familiar to users of that Form V variant, allowing practitioners to simultaneously deflect weapons fire and leap toward an opponent. However, Shien was not without its shortcomings—it was particularly weak against a single opponent."}, {"tag": "p", "text": "Some users used the reverse Shien grip, an unorthodox variation of Shien where the wielder would hold the lightsaber hilt in a backward position, exposing the front. This grip allowed the user to perform long, sweeping strikes to take down several enemies at a time, whipping the blade forward with the movement of throwing a punch. This variation was rarely seen and, indeed, almost a matter of controversy among lightsaber masters."}, {"tag": "h3", "text": "Djem So"}, {"tag": "p", "text": "Djem So was the creation of a group of Form III masters who felt that Soresu was too passive a form. It addressed the shortcomings of Form III, in which a Jedi Master could maintain a prolonged defense but was likewise unable to overcome a skilled opponent. Utilizing a combination of blocks and parries, a Djem So user maintained a proper foundation of defense against both ranged and melee attacks. While a Soresu user stayed on the defensive and only counterattacked when necessary or when an opening appeared in the opponent's defense, a Djem So practitioner was not as passive. Immediately after defending against an opponent's strike, a Djem So stylist followed with an attack of their own, bringing the force of the opponent's own blow against them and seeking to dominate the duel. Djem So placed a heavy focus on brute strength and pure power, with wide, powerful strikes and parries followed immediately by a counterattack."}, {"tag": "p", "text": "Unlike Soresu or Ataru, Djem So required the user not only to counterattack, but also to press the assault, combining Force-enhanced strength with powerful blade combinations to overpower and overwhelm an opponent's defenses. Djem So's sheer power, when combined with physical and Force-imbued strength, was capable of defeating a user of Makashi, a lightsaber form focused on dueling, finesse, and elegance, when employed by a skilled practitioner."}, {"tag": "p", "text": "The Djem So attack stance consisted of holding the lightsaber above the head, angled back and down at an approximately forty-five degree angle. The characteristic Djem So attack was dubbed the \"Falling Avalanche,\" an overhand power blow that crashed down upon an opponent with exceptional force. Djem So users also employed a tactic known as the \"Fluid Riposte,\" which involved a smooth transition from parrying an attack to a counterstrike. Whereas a failing of Shien was its weakness against a single opponent, Djem So was known for having a lack of mobility."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "Jedi of large stature often chose to use Form V, because it required less agility than other forms of lightsaber combat and made use of their natural strength and reach advantages. It was for this reason that the Sith Blademaster Kas'im advised the Sith apprentice Bane to learn Djem So. Bane's imposing size and strength served to complement the form; his power attacks were able to knock his opponents back just through sheer kinetic force, throwing them off balance and leaving them vulnerable to further brute-force strikes and power blows that sought not just to penetrate his opponents' defense, but also to push them back and leave them unable to counter blows. However, Anakin Skywalker later commented that all Jedi could enhance their strength with the Force and thus make use of Form V."}, {"tag": "p", "text": "Jedi Padawan Anakin Skywalker initially employed Shien in his duel against the Sith Lord Dooku on the planet Geonosis, although he later employed Form IV while wielding two blades. Once Dooku managed to destroy one of the weapons, Skywalker was forced to revert to his Form V practices. While his skill enabled him to hold his own against Dooku, he was unable to overcome the Count's elegant Form II bladework, and was defeated. The many engagements of the Clone Wars, against both mechanical opponents as well as lightsaber-wielding Dark Jedi, honed Skywalker's skills. During his final match against Dooku aboard the Separatist flagship Invisible Hand, Skywalker deceived the Sith with a Shien opening stance and Ataru acrobatics, but during the duel he returned to his own preferred Djem So strokes. The Sith Lord was barely able to deflect the Jedi Knight's blows and was eventually scorched when his own blade was forced back onto his shoulder. Using Form V, Skywalker pushed Dooku back with powerful blows, bolstered by use of rage in the fight, until he eventually disarmed and killed the Sith."}, {"tag": "p", "text": "After turning to the dark side in 19 BBY, Anakin Skywalker, now known as Darth Vader, dueled and was nearly killed by his former Jedi Master, Obi-Wan Kenobi, on the planet Mustafar. Afterward, Vader employed a new variant of Form V, even more focused on sheer power, in his service to the dark side and quest to destroy the Jedi. His defeat on Mustafar and subsequent internment in life-support armor forced him to alter his style into a new conglomeration, and he incorporated elements of Form VII, Form IV, Form III, and Makashi into his fighting style. Vader again employed Form V on the Death Star against his former master in their final duel—but rather than continuing to fight, Kenobi sacrificed himself. Eventually, the same techniques used by Vader against Kenobi were mirrored and used against him by Vader's son, Luke Skywalker."}, {"tag": "p", "text": "In Cloud City on Bespin, Luke Skywalker was able to hold his own against Darth Vader for a time, despite his minimal training. Ultimately, unable to stand against Vader's aggressive barrage, Luke was driven back and disarmed, losing his hand. After the duel, he further studied lightsaber skills that he found in a journal left to him by Obi-Wan Kenobi and advanced his abilities. Later, aboard the second Death Star, Luke was able to duel Vader on an even footing, mirroring Vader's Form V technique. When Vader attempted to taunt Luke by suggesting that he would tempt Skywalker's sister to join the dark side, the tactic provoked the Jedi into a fury, and in that state he was able to defeat the experienced Sith Lord. Luke responded to his father's aggressive usage with his own furious demonstration of Form V technique, battering Vader down before refusing to continue the fight. More than a decade afterwards, he commented that Form V needed to have its aggression and desire to dominate balanced with compassion."}, {"tag": "p", "text": "At times, other weapons beyond standard lightsabers were wielded effectively by Form V practitioners. For example, Dark Lord of the Sith Darth Bane wielded a curved-hilt lightsaber—a weapon traditionally associated with Form II. Bane noted that curved lightsabers fit better into the palm, allowing greater power without costing precision. They also altered the angle of attacks slightly, which gave Bane a unique dueling style. Other weapon types wielded by Form V practitioners include lightsaber pikes, as shown by the Shien practitioner Kazdan Paratus, and saberstaffs, as utilized by the Jedi Master Zez-Kai Ell."}, {"tag": "h2", "text": "Practitioners"}, {"tag": "p", "text": "By the time of the Battle of Yavin, Form V had been in existence for millennia. The Djem So variant of Form V was developed sometime before 4000 BBY, and the Jedi Knight Ulic Qel-Droma utilized the form during the Great Sith War. Shien was practiced by Jedi Masters Kavar, Zez-Kai Ell, and Vrook Lamar during the Jedi Civil War, while Ulic Qel-Droma, who lived a few decades prior to the Jedi Civil War, favored Djem So. The Cold War–era Jedi Rojo Trace was also versed in Djem So, drawing on his knowledge during a brief bout with Sith Blademaster Shak'Weth. During the New Sith Wars, Form V was mastered by the Sith Brotherhood of Darkness' Blademaster Kas'im, who instructed numerous apprentices and acolytes in its use, including Darth Bane. On the Jedi side, Jedi Battlemaster Skarch Vaunk was also versed in Form V. To the Jedi of the Clone Wars era, the most prominent practitioner of Form V was Anakin Skywalker, who mastered both Form V variants."}, {"tag": "p", "text": "During the waning years of the Old Republic, Jedi Padawans often spent a year or two studying each Form from II to V. During the Invasion of Naboo, Obi-Wan Kenobi showed a basic knowledge of Shien, utilizing it in conjunction with the rare reverse grip to skillfully deflect blaster bolts, overcoming Ataru's weakness against blaster-wielding opponents, as he had yet to learn Soresu. Yoda was also a practitioner of Form V, as he had mastered all forms of lightsaber combat. Later, during the Clone Wars, Form V practitioners included Jedi Knights Khaat Qiyn, Aayla Secura, Devan For'deschel (Djem So), and Zelice Sturm, the Dark Jedi Garth Ezzar and Sora Bulq, Jedi Masters Adi Adi Gallia, Plo Koon, Even Piell, Luminara Unduli, Kazdan Paratus (Shien), and Cin Drallig, and the Padawans Ahsoka Tano, who liked to use the reverse Shien grip, and Jax Pavan. Additionally, despite their lack of Force sensitivity, the Separatist General Grievous and his IG-100 MagnaGuards learned Form V from Count Dooku during the Clone Wars."}, {"tag": "p", "text": "After turning to the dark side and joining the Sith, Vader continued to employ Form V. His secret apprentice, Galen Marek, was also familiar with the form, having been personally trained in its usage by Vader. Vader's son, Luke Skywalker, learned Form V in part by mirroring the swordplay of his father in their first duel, and the younger Skywalker ultimately defeated his father with his use of Form V during their second duel. When Luke Skywalker later formed the New Jedi Order, he and the Order learned of the seven combat forms from the book The Jedi Path: A Manual for Students of the Force, holocrons and recordings, particularly the Great Holocron, which included a recording by Cin Drallig that explained the lightsaber forms. One practitioner of the Djem So form in the New Jedi Order was Jedi battlemaster Kyle Katarn."}, {"tag": "p", "text": "There were considerably fewer practitioners of the controversial horizontal, or \"reverse,\" grip variation of Shien. Around the time of the Clone Wars, Jedi Master Adi Gallia and Padawan Ahsoka Tano were two of few Jedi known to actively practice it, though master Gallia favored both grips for her aggressive hybrid blend of Shien and Djem So during the Clone Wars. Ahsoka's master, Anakin Skywalker, even discouraged Tano from using it. Jedi Master Luminara Unduli occasionally also used Form V with a horizontal grip. The Anzat Nikkos Tyris also practiced the style, and trained his followers in the form before he died."}, {"tag": "p", "text": "Other Force-users known to employ this rare grip variation were the Jedi Knight turned Sith Lord Revan and Jedi Master Quinlan Vos,  as well as Darth Vader's apprentices Galen Marek, Starkiller and the Dark Apprentice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Form V, along with the other six classical saber forms, was invented by David West Reynolds and fencer Jack \"Stelen\" Bobo for the Fightsaber part of Star Wars Insider 62. The saber forms were retconned into both the original trilogy and prequel trilogy movies up through Attack of the Clones by assigning practitioners and instances of form usage to the movie characters. Since then, numerous Expanded Universe sources, including the Jedi Academy Training Manual, The Clone Wars Campaign Guide, and Jedi vs. Sith: The Essential Guide to the Force, have further elaborated on the saber forms and the Force-users who employed them."}, {"tag": "p", "text": "Form V—both Shien and Djem So—appears along the other lightsaber forms in the Star Wars Galaxies video game as part of the moves and techniques employable by Jedi characters. Form V also had a non-canonical appearance as part of Darth Vader's role in the fighting game Soulcalibur IV, wherein it comprises part of Vader's fighting style."}, {"tag": "p", "text": "It is possible for the player character in Star Wars: Knights of the Old Republic II: The Sith Lords, the Jedi Exile, to learn Form V from either Kreia or Jedi Masters Kavar, Zez-Kai Ell, or Vrook Lamar after her return from exile. In order to unlock the form, the player must select a character class geared toward lightsaber combat, such as the Jedi Guardian or Jedi Sentinel classes. However, it is also possible for the player character to choose the path of Jedi Consular and learn the Force forms instead. Form V is the second form unlocked by a lightsaber-focused character and the Exile learns it from either Kreia or the second missing Jedi Master encountered, depending on whether the player took the light or the dark side path."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}