{"url": "Form_VI/Legends", "categories": ["Category:Legends articles", "Category:Lightsaber combat forms"], "nodes": [{"tag": "h1", "text": "Form VI"}, {"tag": "p", "text": "Form VI, also known as Niman, the Way of the Rancor, the Moderation Form, and the diplomat's form, was the sixth form of the seven forms of lightsaber combat. This fighting style was a hybrid martial art created by effectively combining elements of the preceding lightsaber forms into a single, generalized form. Niman balanced out between the various specializations of the other forms, covering many of the basic moves, but focusing on overall moderation. This resulted in a fighting style that lacked a significant advantage, but also lacking any serious drawbacks, and thereby not leaving adherents as exposed as some of the more aggressive or specialized forms. Overall, Niman had a fairly relaxed focus on bladework, designed as a simple, easily mastered fighting form for Jedi who preferred to devote most of their time to study and diplomacy. Despite this, it could be absolutely deadly in the hands of a skilled practitioner, as demonstrated by such notables as Exar Kun."}, {"tag": "p", "text": "To compensate for the relaxed focus on bladework and lack of significant specialization, Niman training regimens encouraged the inclusion of Force-based attacks in combat, such as telekinetic pulls and shoves used in sync with lightsaber strikes. Also, as Niman was developed from two pre-existing martial arts fighting forms that both emphasized the use of dual-blades, it provided a firm foundation for duelists looking to study into such practices. Ultimately, Niman's success in combat was dependent on a practitioner's intuition and creativity in combat, rather than the rote responses common to the other forms."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The original Niman fighting style was practiced by the Royale Macheteros of the Kashi Mer Dynasty, who named it for the dual triumvirate of the Kashi deities. The style was adopted by the Legions of Lettow, a group of Dark-siders involved in the First Great Schism of the Jedi Order. After the defeat of the Legion at the hands of the Jedi, Niman was adopted by the Jedi Order, eventually being refined into the sixth form of lightsaber combat, referred to by the same name. While Form VI was largely adapted from this earlier fighting style, several noted Jedi considered the pure root of Form VI to be Form III. Being a \"jack-of-all-trades\" style with broad emphasis and little need for continuous and dedicated practice, Niman found a niche amongst Jedi Consulars who instead preferred to focus on diplomacy and meditation on the Force rather than combat. Ironically, Niman became the chosen discipline of the fallen Jedi-turned-Sith Lord, Exar Kun."}, {"tag": "p", "text": "During the various wars against the Sith, Niman was prized by some for its general versatility on the battlefield, though heavily criticized by others for being insufficiently demanding. Over time, it became the standard in lightsaber training, and by the start of the Clone Wars, was one of the most common forms in the Jedi Order. However, Niman demonstrated itself to be inadequate for the open battlefields of the Clone Wars, proven when all the Form VI adherents involved in the First Battle of Geonosis died in combat. In the post-war years, Niman remained studied and practiced amongst the Sith while the Jedi were hunted down in the Great Jedi Purge. Form VI lightsaber combat would eventually be rediscovered by the New Jedi Order, though until then, it was effectively replaced as the favored \"jack-of-all-trades\" fighting style by the Medium style of lightsaber combat."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A hybrid fighting style, Niman incorporated elements from the previous forms, mainly Forms I through V, excluding Form II, but balanced out between their various specializations, in keeping with the Jedi quest to achieve harmony and justice without resorting to the rule of power. Form VI covered many of the various moves of lightsaber combat, but due to its emphasis on overall moderation, its focus on bladework was somewhat relaxed. Thusly, the form was easily mastered by those who preferred to devote a high percentage of their time to study and peacekeeping, which made it the preferred form of Jedi Consulars. While the generalization made it ill-suited for lightsaber dueling or fighting on the open battlefield, it was perfectly adequate for facing down criminals and thugs. Due to its \"jack-of-all-trades\" nature, the success of this form was largely dependent on the practitioner's intuition, improvisation, and creativity in combat rather than the rote responses derived from other forms."}, {"tag": "p", "text": "To compensate for this relaxed focus on bladework, Niman training regimens encouraged adherents of the style to incorporate Force powers into combat. Proper management of these tools allowed a Form VI master to control and eliminate an entire group of enemies, though many lower level initiates experienced difficulty attempting this. As Form VI lightsaber combat was derived from the dual-bladed Niman style practiced by the Royale Macheteros of the Kashi Mer, it provided a foundation for the challenging practice. However, while hailed as a practical, all-around fighting form, it was heavily criticized by many for being insufficiently demanding. It should be noted that while Niman provided no decisive edge in battle, it achieved its worth by not leaving its wielder as exposed as some of the more aggressive forms. Due to the relaxed bladework of the form, it was said that most Niman practitioners would find it almost impossible to defeat a Makashi practitioner."}, {"tag": "p", "text": "According to Jedi Battlemaster Cin Drallig, if a duelist dedicated himself exclusively to Form VI, he could expect to study the style for at least ten years before achieving mastery."}, {"tag": "h3", "text": "Moves and Maneuvers"}, {"tag": "p", "text": "The opening stance of the Niman form was wide and open, with the blade held out from the body in a one-handed grip, the blade angled upwards and back, while the off-hand was folded across the chest. The feet were evenly spaced. Another Niman stance featured the blade held at head-height in a two-handed grip, angled upwards and slightly in, with the dominant foot placed forwards. A third position was a two-handed low guard, with the hilt held at waist height in both hands, blade held back and to the side, angled downwards, with the feet closely spaced."}, {"tag": "p", "text": "In keeping with the tactic of incorporating Force powers into combat, two primary Form VI maneuvers, the \"draw closer\" and the \"pushing slash\", were conjunctions between lightsaber moves and telekinetic attacks. Effectively polar opposites of one another, the \"draw closer\" involved telekinetically seizing an opponent and pulling the enemy into the path of his blade, while the \"pushing slash\" slammed the opponent with a Force push after scoring an attack."}, {"tag": "h3", "text": "Applications"}, {"tag": "p", "text": "Derived from a fighting form centered around the use of dual-blades, Niman was considered a foundation for this challenging practice, and became something of a gateway form to Jar'Kai. Form VI dual-blade training encouraged the use of the shoto short lightsaber in the off-hand, as the smaller blade was easier to handle. A notable Jar'Kai master was the Priapulin Jedi Master Skwelli, who carried six lightsabers. He was renowned for his skill in his era, and recordings of his fighting form were considered a wonder to behold. Many modern Jedi mirrored this attitude, though Dooku was a notable exception, who, in his copy of The Jedi Path, labeled Skwelli's form and footwork as sloppy. Obi-Wan Kenobi simply commented on his hope that he never had to face a duelist with such an array of weapons. Niman was commonly studied by duelists looking to brush up on dual-blade combat, though few actually mastered Niman itself, as this required at least ten years of study."}, {"tag": "p", "text": "Exar Kun chose to specialize in Niman, and while there was little doubt that he found the dual-blade training regiments useful when he converted his lightsaber into a double-bladed weapon, he often preferred to fight with a single blade. His skill marked him as one of the finest duelists of his era, demonstrated when he defeated his instructor, renowned Jedi Weapon Master Vodo-Siosk Baas, in a sparring match, indicating his mastery of the fighting form. However, rather than adhere to its philosophy of moderation over aggression, Kun was a vicious duelist who favored brutal power moves and had little compunction against lashing out against his foes with physical attacks. These tendencies were exacerbated by his turn to the dark side of the Force, when he actively took to drawing on his rage in combat. However, while he failed to observe the core concepts of Form VI, Kun was never defeated in a lightsaber duel, and only his fellow Darksider, Ulic Qel-Droma, was able to match him on neutral ground. It should be noted however that, aside from sparring matches, Kun was only known to have participated in three lightsaber duels over the course of his career."}, {"tag": "p", "text": "Many Niman maneuvers incorporated the use of Force powers chained into the combat sequences, to compensate for the relaxed focus on bladework. While he favored Form V lightsaber combat, Anakin Skywalker had studied Niman and occasionally favored such practices. His master, Obi-Wan Kenobi, also occasionally applied such skills, having studied Niman to learn this tactic. Kenobi commented in his copy of The Jedi Path that he found this practice extremely difficult, indicating his need for more practice. During the Invasion of Naboo, Kenobi had evidently developed an advanced level of skill in this application, frequently blasting aside battle droids with Force pushes while in combat."}, {"tag": "h2", "text": "Practitioners"}, {"tag": "p", "text": "Ironically for a fighting form designed to encourage moderation over aggression, Niman was the chosen discipline of the fallen Jedi-turned-Sith Lord Exar Kun. Trained by famed Jedi Weapon Master Vodo-Siosk Baas, Kun was one of the finest duelists of the age, even defeating his own master in a sparring match. Adhering more closely to the philosophy of Form VI were Zez-Kai Ell, Vrook Lamar, and Kavar, Jedi Council Masters active during the Jedi Civil War and First Jedi Purge who had mastered Niman sufficiently to act as instructors in the style. They typically taught the form to Jedi Sentinels."}, {"tag": "p", "text": "During the New Sith Wars, Niman was practiced amongst both the Jedi and the Sith forces. A notable Jedi adherent was Johun Othone, who took full advantage of Form VI's inherent versatility during the pitched battles of the war. However, during the post-war years, he made little effort to maintain his skills as a swordsman, instead focusing on his diplomatic talents, and his skills atrophied considerably. The Sith Blademaster, Kas'im, included full mastery of Niman in his repertoire of skills, and trained many Sith apprentices in the style. It should be noted that while Kas'im was versed in dual-blade combat, using it to great effect against Darth Bane during their duel to the death, Kas'im instead relied on Form IV dual-blade training rather than Niman."}, {"tag": "p", "text": "Darth Sidious may have mastered Niman just as he had mastered all the other six forms of lightsaber combat. In addition to being extremely well-versed in Niman's dual-bladed variant, he was also outstandingly adept in incorporating force attacks in his lightsaber style. His knowledge was competent enough to adequately teach his student, Darth Maul, the art of Niman, causing the latter to become decently capable at it, especially in its function of incorporating Force attacks into his dueling style. Obi-Wan Kenobi studied Niman during his apprenticeship under Qui-Gon Jinn, attempting to learn how to apply the Force while in the midst of combat, a practice he commented as being difficult but eventually mastered enough to seamlessly Force Push droids. Kenobi's own student, Anakin Skywalker, studied Form VI to develop his skills with dual-blades, though he commented that he was working on this mostly as an exercise in control, and was doubtful that he would ever need to apply it. Skywalker's assumption was proven wrong when he wielded dual lightsabers against Dooku during the First Battle of Geonosis, and several other times during the Clone Wars. Anakin frequently used his Niman training to incorporate use of the Force into his dueling style and also had advanced his abilities in the form enough to instruct his Padawan Ahsoka Tano in the lower levels of the style as a training exercise. As Darth Vader, he started incorporating elements of Niman swordplay alongside the other forms after retooling his dueling style and retained his advanced skill in Niman's techniques of incorporating the use of the Force in combat. Dooku also possessed considerable skill in Niman from his time as a Lightsaber Instructor of the Jedi Temple, enough so to instruct the Kaleesh cyborg Grievous in it, as well as to coach Grievous while he passed his training on to his IG-100 MagnaGuard bodyguards. Dooku applied his mastery of Niman to masterfully use the Force in conjunction with lightsaber combat."}, {"tag": "p", "text": "While Form VI was not a weak fighting style, it was an inadequate form for the open battlefields of the Clone Wars. Notably, all adherents of the style involved in the Battle of Geonosis perished, prominent practitioners including Sarrissa Jeng, Sar Labooda, and Joclad Danva. Danva's death was an especially sore loss for the Jedi Order, as he was among their most renowned duelists and martial artists, and master of Jar'Kai dual-blade fencing, one of the styles that Form VI lightsaber combat was derived from. However, Form VI adherents and trainees remained, with Anakin Skywalker instructing his Padawan, Ahsoka Tano, in the lower levels of the style as a training exercise. Tano would later take to wielding a shoto in her off-hand, in keeping with Niman dual-blade training. Grandmaster Yoda and Swordmaster Mace Windu were also proficient in Niman, as they were said to have fully mastered all forms of lightsaber combat, although only Windu ever displayed proficiency in the form's function of incorporating Force Attacks into his lightsaber combat. Jedi Master Cin Drallig was considered the most prolific instructor of Form VI, as he was of the five forms below it, teaching Niman to thousands of students during his Jedi career. However, despite his skills and mastery, although he put up a fierce fight, Drallig was ultimately cut down by the Form V specialist Darth Vader during Operation Knightfall, part of the Great Jedi Purge."}, {"tag": "p", "text": "Students of Niman active during the Purge include Rachi Sitra, and Vader's apprentice, Galen Marek. However, Marek chose to devote himself to Forms III and VII rather than VI, though he still incorporated powerful telekinetic attacks into his lightsaber sequences, a common element in Form VI training. His clone, Starkiller, made much more avid use of Niman, actively specializing in the style to develop his skills with dual-blades. Starkiller's knowledge of the form was based off of inherited memory flashes from his genetic template. Despite the limited battlefield benefits provided by Form VI, it remained in use up until and beyond the resurgence and takeover of the Galactic Empire, a notable practitioner being the Dark Lord of the Sith, Darth Krayt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Niman was first described in the Fightsaber: Jedi Lightsaber Combat article in Star Wars Insider 62, written by David West Reynolds and fencer Jack \"Stelen\" Bobo, identified it as Form VI lightsaber combat. The proper name of the form, \"Niman\", as well as its alternate titles as the \"Moderation Form\" and the \"Way of the Rancor\" would be specified in later sources. Notably, the Fightsaber article would fail to specifically name any practitioners of Form VI, only mentioning that all Niman duelists involved in the Battle of Geonosis died. A number of characters are theorized to be Niman practitioners, based on statements from other sources. Sora Bulq was described as a master of every fighting form, though skill in Niman was never explicitly mentioned."}, {"tag": "p", "text": "In the video game Star Wars: Knights of the Old Republic II: The Sith Lords, the Jedi Masters could teach the Jedi Exile the Niman form only if she was a Jedi Sentinel or the Sentinel's corresponding prestige classes, the Jedi Watchman or Sith assassin. Niman, along with the other lightsaber forms, appears in Star Wars Galaxies as part of moves and techniques employable by Jedi characters. This has not definitively been clarified to be canonical."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}