{"url": "Formidable", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Imperial II-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Formidable"}, {"tag": "p", "text": "The Formidable was an Imperial II-class Star Destroyer used by the Imperial Navy during the Imperial Era. During bounty hunter Beilert Valance's hunt for Darth Vader, the Formidable was under the Sith Lord's command. Under Vader's control, the Star Destroyer arrived at the world Heva to engage Valance and his team of bounty hunters, but it was ultimately destroyed in the skirmish by bot-drones controlled by the slicer Chio Fain."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An Imperial II-class Star Destroyer, the Formidable measured 1,600 meters in length and was equipped with engines, a solar ionization reactor, two deflector shield generator domes, a communications tower, and a hangar. The Star Destroyer carried with it numerous TIE fighters, as well as Darth Vader's personal TIE Advanced x1."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial Era, the Formidable served in the Imperial Navy, under the command of the Dark Lord of the Sith Darth Vader. At some point prior to the Battle of Hoth in 3 ABY, the cyborg Beilert Valance led a team of bounty hunters on a hunt for Vader, although team member Dengar was secretly an informant to the Sith Lord. After Dengar alerted Vader that Valance and his crew were on Heva, the Sith arrived at the world aboard the Formidable."}, {"tag": "p", "text": "Upon spotting the Star Destroyer in the air, Valance and members of his team engaged the vessel aboard their cruiser, the Broken Wing. Meanwhile, on the Formidable, Vader ordered a general to deploy TIE fighters to engage the enemy ship, before departing himself to join the skirmish in his personal TIE Advanced x1. During the fight, Valance's slicer, Chio Fain, took control of a group of bot-drones—which the Empire had originally intended to use but abandoned due to their unstable technology—that the bounty hunters had acquired from the arms dealer Wef. Fain had the bot-drones ram into the Formidable's command tower, severing it, killing the Imperial general, and sending the vessel crashing into the ground below."}, {"tag": "p", "text": "Following the skirmish, another Star Destroyer, under the command of General Gollin, arrived at Heva. An Imperial captain aboard the vessel reported the Formidable's destruction to the general, although she was already aware of the event."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Formidable first appeared in the new Star Wars canon in the third issue of the 2019 comic-book miniseries Star Wars: Target Vader, which was written by Robbie Thompson, illustrated by Stefano Landini, and published by Marvel Comics on September 25, 2019. It was identified by name in the fourth issue, which was also written by Thompson and published on October 9, 2019."}, {"tag": "p", "text": "In the Star Wars Legends continuity, the Formidable was an Imperial I-class Star Destroyer that first appeared in the 1993 video game Star Wars: X-Wing and was first identified in Daniel Wallace's 2014 reference book, Star Wars: Imperial Handbook: A Commander's Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}