{"url": "Forris", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Males", "Category:Mantellian Army personnel"], "nodes": [{"tag": "h1", "text": "Forris"}, {"tag": "p", "text": "Forris was a Human male who served in the Mantellian Army during the Cold War, fought between the Galactic Republic and the reconstituted Sith Empire. Sometime before the year 3643 BBY, Forris attained the rank of lieutenant and was stationed on Ord Mantell, where a group of Separatists had started a conflict known as the Separatist War in an attempt to overthrow the planet's government. While on Ord Mantell, Lieutenant Forris was assigned to Fort Garnik, a Republic-controlled stronghold on the island of Avilatan. Forris served as one of the instructors at a combat instructor academy, which was located inside the fort. Forris and the other instructors provided combat training for the soldiers stationed at the fort, including a sergeant named Jaynes, who sent new arrivals to Forris, because he believed that the training he received had saved his life during combat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Forris was alive during the Cold War, a period of unrest between the Galactic Republic and Sith Empire. During the war, Forris served in the Mantellian Army. By the year 3643 BBY, Forris had received the rank of lieutenant and had been assigned to Ord Mantell, a planet whose government was embroiled in the Separatist War with a group of Separatists. By that year, Forris was a veteran soldier who had learned a great deal about combat tactics and military equipment. During his time on the planet, Forris was stationed at Fort Garnik, a Republic stronghold on the island of Avilatan. There, Forris served as an instructor at a combat instructor academy, where he and other instructors provided combat training and tactics to soldiers who were stationed at the fort. One soldier who received training from the academy was a sergeant named Jaynes, who credited the instructors with providing training that he believed had saved his life during combat. In 3643 BBY, Jaynes was stationed at one of the entrances to Fort Garnik, where he directed newly arrived soldiers to Lieutenant Forris for training."}, {"tag": "p", "text": "One soldier whom Jaynes had sent to Forris for training was a newly recruited sergeant of the Republic Special Forces unit known as Havoc Squad. Believing that even a soldier from one of the elite squads of the Republic could learn from an experienced veteran, Forris provided the sergeant with training during the time the soldier spent at the fort."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Forris had fair skin, green eyes, and brown hair. By the time he was serving at Fort Garnik, Forris had obtained a great deal of experience and knew enough about combat tactics, training, and technology to instruct others in their use. He attempted to pass his knowledge on to other soldiers and thought that even members of elite units could gain from what a veteran soldier like him had to say. Sergeant Jaynes believed that Forris and the other instructors at the combat instructor academy had given him the training that allowed him to survive the war on Ord Mantell."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While at Fort Garnik, Forris wore the blue-colored chest armor, light-colored pants, and brown boots that were worn by many of the Republic soldiers serving on Ord Mantell. In addition, Forris wore a pair of black gloves and a blue helmet with a visor that covered his eyes but left the rest of his face exposed. While at the fort, Forris carried a blaster cannon on his back. He also carried a device that was capable of projecting a spherical shield that could envelop his entire body."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lieutenant Forris first appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. He is located in Fort Garnik, the central location for beginning Republic characters starting on the planet Ord Mantell. In the game, Forris is the first skill trainer for players of the Trooper class and is featured in the Trooper quest \"Best of the Best,\" in which Sergeant Jaynes directs the characters to Forris for training. In the game, Forris has the same lines of dialogue as other Trooper trainers. While the player is not required to take the quest and can train with Forris without completing it, this article is written with the assumption of 100 percent game completion. Although not identified by name, Forris's location as a Trooper trainer in Fort Garnik is shown on the maps for Ord Mantell in Star Wars: The Old Republic Explorer's Guide, a book that was released at the same time as the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}