{"url": "Fort_Anaxes", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Anaxes locations", "Category:Asteroid bases", "Category:Galactic Republic military bases"], "nodes": [{"tag": "h1", "text": "Fort Anaxes"}, {"tag": "p", "text": "Fort Anaxes was a Galactic Republic military base built inside a cave on the planet Anaxes during the Clone Wars. After the planet's destruction, the facility remained intact on PM-1203, one of the asteroids in the newly created asteroid belt."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Fort Anaxes was located in a valley on the planet Anaxes, mostly built into a cavern inside a sheer cliff face, with a landing pad and outbuildings outside. After Anaxes' destruction early in the Imperial Era, the fort miraculously survived, remaining intact on an asteroid eventually designated PM-1203."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Battle of Anaxes, the fort was the base for Jedi Generals Mace Windu, Obi-Wan Kenobi and Anakin Skywalker. After getting permission to infiltrate a Separatist Cyber Center to discover why the Separatist Droid Army had been consistently maintaining the upper hand, Clone Commander Cody, Clone Captain Rex, ARC trooper Jesse and clone medic Kix departed from the fort along with the recently-arrived clone commando squad Clone Force 99. The infiltration led to the discovery that Echo, an ARC trooper believed killed during the Battle of Lola Sayu, was still alive, with the Separatists using him for a strategy algorithm that accounted for their success on Anaxes. Captain Rex, General Skywalker and Force 99 subsequently departed from the fort on an unauthorized mission to Skako Minor to rescue Echo. After his rescue, Echo went through medical treatment at Fort Anaxes before proving instrumental in a plan to defeat the Separatist forces besieging Anaxes once and for all."}, {"tag": "p", "text": "After the war, Anaxes was subjected to a cataclysm that broke apart the planet, but the fort remained preserved, becoming a rhydonium fuel depot and a popular choice for secret meetings. At least four years prior to the Battle of Yavin, a colony of fyrnocks had nested in the remains of the base, which were encountered by Hera Syndulla and Sabine Wren when they had planned to meet \"Fulcrum.\""}, {"tag": "p", "text": "A minor skirmish between the Jedi Padawan Kanan Jarrus, his apprentice Ezra Bridger and a small force of stormtroopers led by the Grand Inquisitor took place here roughly four years before the Battle of Yavin. Although the Inquisitor was able to defeat Kanan, his apprentice used the dark side of the Force to summon a giant fyrnock to combat the Inquisitor. Both Jedi were able to escape on the Phantom, destroying the Inquisitor's Sentinel-class shuttle in the process to prevent pursuit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fort Anaxes first appeared in the Star Wars Rebels episode \"Out of Darkness.\" It was conceived for the \"Bad Batch\" arc of Star Wars: The Clone Wars, which had been in production prior to the series' initial cancellation in 2013."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}