{"url": "Fortitude_(Valor-class_cruiser)", "categories": ["Category:Legends articles", "Category:Flagships", "Category:Galactic Republic starships", "Category:Valor-class cruisers"], "nodes": [{"tag": "h1", "text": "Fortitude (Valor-class cruiser)"}, {"tag": "p", "text": "The Fortitude was a Valor-class cruiser in the Republic Navy, in service around 3643 BBY."}, {"tag": "p", "text": "The Fortitude was designated as a Republic flagship for a meeting with the Rift Alliance, a group that threatened secession from the Galactic Republic in protest of the events following the Great Galactic War between the Republic and the Sith Empire. Supreme Chancellor Dorian Janarus, seeking to prevent the inevitable collapse of the Republic that would result from their departure, convinced several leaders and representatives of the Alliance to meet with his personal representative onboard the Fortitude in orbit of Deralia. That representative would be a newly-minted Jedi Master, recently appointed Barsen'thor of the Jedi Order in light of their recent victory over Lord Vivicar."}, {"tag": "p", "text": "The Barsen'thor took their Defender-class light corvette to the rendezvous point with the Fortitude over Deralia, only to be informed by Nadia Grell, daughter of Senator Tobas Grell, that the ship had been sabotaged by Sith agents. The ship's life support and fire control systems were disabled by the Sith, and the navigational computer was locked into a collision course with Deralia's surface, which would result in the planet's destruction. Defeating the Sith apprentice Arrax on the Fortitude's bridge, the Barsen'thor and the members of the Alliance were able to divert the ship's course from Deralia before making their escape from the dying cruiser onboard the Jedi's vessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Fortitude is the first area visited by the Jedi Consular player at the beginning of Act II of their class storyline. The ship's fate is dependent on the choices made. Tobas Grell suggests overloading one of the ship's engines, crashing the ship into Deralia's moon; this idea is advocated by the Selkath representative Shuuru. Nadia, however, protests this idea, as she fears that the impact with the moon will result in severe tidal changes, possibly causing widespread flooding. As a result, overloading the engine is considered the dark side choice. The light side choice, as Nadia suggests, is to use the ship's thrusters to steer the ship into orbit without crashing it into Deralia or its moon; this would require all the Rift Alliance representatives working together at the manual control consoles around the ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}