{"url": "Fortress/Legends", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Articles needing additional sources", "Category:Building types", "Category:Fortresses"], "nodes": [{"tag": "h1", "text": "Fortress"}, {"tag": "p", "text": "The term fortress, or the more causal fort, usually referred to a rudely-constructed building used for army purposes, especially to one used by lower-end technological civilizations. More often, however, it was used to describe a heavily armored ground installation built on a battlefield or strategic location to act as a command center or palace. Some fortresses were used by the Separatist leader Nute Gunray during the Clone Wars on planets like Cato Neimoidia and other worlds. The installations were used by the Trade Federation, Gungans, Royal Naboo Security Forces, Wookiees, Galactic Republic, Confederacy, Galactic Empire, the Rebel Alliance and the New Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Fortresses were built by a variety of civilizations throughout galactic history. Fort Tusken was constructed on the planet Tatooine in 98 BBY, becoming the namesake of the Tusken Raiders."}, {"tag": "p", "text": "During the war for the moon Alaris Prime fought between the Wookiee colonists and the Trade Federation between 39 BBY and 36 BBY, the Trade Federation's main base contained a fortress. The Wookiees recognized that the fortress had to be destroyed to drive the corporation from Alaris Prime. Jedi Master Qui-Gon Jinn requested permission from the Jedi High Council to personally aid the Wookiees in the battle, which was granted on the condition that the Wookiees build a fortress. To do so the Wookiees had to upgrade their level of technology and collect enough ore to build it. After Wookiee workers constructed the fortress Jinn landed at the Wookiee base."}, {"tag": "p", "text": "The Jedi informed the Wookiees of various military individuals available at the fortress, including the training of berserkers, aggressive warriors who dual-wielded ryyk blades, the hiring of bounty hunters, and the construction of Decimator cannons. The Trade Federation fortress was destroyed in the Battle for Alaris Prime by Wookiee energy pummels."}, {"tag": "p", "text": "Fortresses were also constructed at the order of commander battle droid OOM-9 during the Invasion of Naboo in 32 BBY. These fortresses were also constructed in the city of Spinnaker. They were destroyed by elements of the Gungan Grand Army. Two more were destroyed in Harte Secur while the Gungan Grand Army liberated their fambaas from Camp Six."}, {"tag": "p", "text": "Darth Vader had a fortress on the planet Vjun called Bast Castle."}, {"tag": "p", "text": "One Imperial fortress was destroyed by the Wookiees and Rebel Alliance on the Avatar Orbital Platform, also killing Moff Darcc and Trandoshan slaver Pekt in the process, during the liberation of Kashyyyk. Another was also destroyed during the battle of Hanoon near the city of Magentic to free the city from Imperial control in exchange for the Vor'Na'Tu shard. Another Imperial fortress was present on Coruscant near the Imperial Palace, along with an airbase and war center."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the 2001 LucasArts video game Star Wars: Galactic Battlegrounds, fortresses take the role of castles that originated in the video game Age of Empires II, costing identical resources and offering similar units and research. Fortresses cost 550 units of ore to build, and are only available to the player once they have reached the third technology level. A fortress is equipped with a turret that automatically shoots enemy ground units, as well as anti-air missiles. Each of the game's civilizations can create a unique unit to their civilization, bounty hunters, and blaster cannons. In the 2002 expansion Clone Campaigns air cruisers were added to fortresses."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}