{"url": "Fortress_world", "categories": ["Category:Legends articles", "Category:Fortress worlds", "Category:Planetary types"], "nodes": [{"tag": "h1", "text": "Fortress world"}, {"tag": "p", "text": "A Fortress world was a massively-protected planet. Most fortress-worlds were designed to serve as military and political strongholds of various factions. They played a particularly important element in Imperial strategy after the Battle of Endor, designed to resist New Republic assault and—at least in theory—provide the basis for a subsequent Imperial reconquest."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "The term \"fortress world\" dated back at least as far as the early days of the Galactic Republic, when it described worlds like Anaxes, which held massive concentrations of warships and defensive emplacements."}, {"tag": "p", "text": "The term gained prominence during the Clone Wars, when the Confederacy of Independent Systems concentrated armies of battle droids, self-replicating war factories and large fleets around planets in the Outland Regions, in order to draw the Republic into the costly and protracted Outer Rim Sieges. Sullust, Siskeen, Boz Pity and Xagobah were examples of Separatist fortress worlds. The Republic also had fortress worlds, located in the Core Worlds region. Protection of Republic fortress worlds was among the duties of the V-wing starfighter squadrons during the war."}, {"tag": "h2", "text": "Imperial developments"}, {"tag": "p", "text": "The fortress worlds of the Galactic Empire, however, were created not to force battle on the defenders' terms, but to discourage attack altogether."}, {"tag": "p", "text": "The first Imperial fortress worlds were established in the heyday of the New Order as models of Palpatine's political vision, exemplified by planets such as Prakith and Byss which were colonized in the Deep Core. They were peopled with loyalist Human settlers and nonhuman slaves, all living in order and security under the watchful gaze of the Inquisitorius and behind massive orbital defenses almost comparable to those of Coruscant itself, capable of protecting these worlds from any potential threat."}, {"tag": "p", "text": "Coruscant, of course, acquired many of the trappings of a fortress world in its own right, including a massive grid of orbital battle stations and an entire Sector Fleet with a Super Star Destroyer command ship deployed to the system. The renaming of the planet as \"Imperial Center\" was designed to stress its new status as the center of the New Order, but the teeming reality of Coruscant could only be constrained by force or the threat of force, never fully ordered and controlled in the way that was attempted on the fortress worlds."}, {"tag": "h2", "text": "From Endor to the collapse of the Ruling Council"}, {"tag": "p", "text": "After the deaths of Palpatine and Darth Vader, the term \"fortress world\" gained new importance as the Empire was forced into a defensive strategy by the Rebel Alliance."}, {"tag": "p", "text": "Led by Ars Dangor, surviving members of the Imperial Ruling Council recalled fleet elements to the Core and concentrated them around key planets. Kuat, for instance, was guarded by fifteen Imperial Star Destroyers, while Tangrene was always covered by at least two Imperial-class ships and ten smaller warships. The planets chosen for protection were worlds with significant roles in Galactic geopolitics, often major hyperspace junctions or key elements of the Empire's military-industrial and commercial infrastructure. Although members of the Ruling Council had long been working to subject these same worlds to their own private authority, their retrenchment was strategically sound."}, {"tag": "p", "text": "Fortress worlds served as bastions of the New Order: beacons of stability and control or centers of tyrannical power, depending on one's point of view. The concentrations of Imperial forces around these heavily-defended strongholds could not be dislodged in the short term, while their repositioning simultaneously compelled the nascent New Republic to fill the gap in territory they had abandoned. Many in the Empire continued to believe that the Rebels could not form a viable government; their political system would inevitably collapse, and the galaxy would greet an Imperial reconquest with the same relief that they had shown in the aftermath of the Clone Wars."}, {"tag": "p", "text": "However, it would be wrong to suggest that the fortress worlds served simply as the expression of an organized strategy with the ultimate goal of galactic reconquest. Even the most blindly committed of the Empire's leaders must have questioned whether they would truly win the war, and fortress worlds served as strongholds raised against an anarchic galaxy, where a governor, commander or opportunist could sustain an ideal of order and discipline, or a vicious personal autocracy. As a result, it seems that many individual warlords and Moffs began to imitate the Ruling Council on a local scale, bringing together forces and resources from the sectors they controlled, acting on their own initiative to turn selected planets into personal redoubts."}, {"tag": "p", "text": "A temporary pause was marked by the return of Grand Admiral Thrawn: as the Empire once again went on the offensive, the Grand Admiral ordered Star Destroyers to redeploy from planetary-defense duties to join his front-line fleets, replacing them with Dreadnaught Cruisers with Imperial Army crews. This was, in fact, nothing more than the second stage of the Empire's reconquest strategy, to which the creation of the fortress worlds had always been intended as a prelude."}, {"tag": "p", "text": "But while the Ruling Council and the Navy continued with their strategy after Thrawn's death at the Battle of Bilbringi, many Moffs and warlords turned once again to building up their planetary bastions, and the process of fortification gathered pace once again during the period leading up to the Imperial Mutiny. Examples of this second wave of fortress worlds included Gyndine, guarded by thirty capital ships, and Aargau with at least two hundred. Many of these new fortress worlds had planetary shields, and where possible, these were surrounded by outer layers of defenses, including antimatter minefields and airless moons converted into military bastions with batteries of heavy turbolasers and ion cannons."}, {"tag": "h2", "text": "Endgame and aftermath"}, {"tag": "p", "text": "After the final death of Palpatine's last clone and the collapse of the rump Ruling Council on Ord Cantrell, the fortress worlds drew in upon themselves. The New Republic claimed that the Empire had been destroyed, but the reality was that, although no central authority existed, the defenses of planets like Prakith and Carida discouraged immediate assault, and the Navy lacked the resources to round up the garrisons on backwater planets. Thus, the fortress worlds remained intact as the primary expression of the New Order, their population further swollen by loyalist refugees from across known space."}, {"tag": "p", "text": "The remnants of the Empire gradually coalesced under the authority of the Council of Moffs, who handed over strategic command to Gilad Pellaeon, the former flag captain of Grand Admiral Thrawn. Pellaeon's instincts as a commander were to face the Rebels with maneuver warfare and fleet battles, and while political considerations saw heavy defenses built up around besieged outposts such as Orinda, conventional fortress worlds became rare in what remained of Imperial space. The planet that conformed most closely to the model was Yaga Minor, with its massive military presence and native population of alien laborers—although even here the defenses were designed to protect the system's shipyard facilities, not the world itself. The economic powerhouse at Muunilinst was guarded only by three Golan battlestations, while the capital at Bastion lacked such orbital defenses altogether, instead relying on the thirteen Star Destroyers of the local sector fleet for its protection."}, {"tag": "p", "text": "While the First Fleet and Third Fleet faced Pellaeon's forces on the battle plane, the New Republic created the Fifth Fleet as a strike force which could take even the most heavily-defended fortress worlds. During the New Republic's offensive after the Almanian Crisis, several perimeter fortress worlds fell to New Republic forces, and after the signing of the Bastion Accords, the Republic continued to liberate isolated strongholds, particularly in the Deep Core. By the time of the Yuuzhan Vong War, it seems that most of the fortress worlds had been conquered, their defenses dismantled."}, {"tag": "p", "text": "A number of planets along the frontier of Imperial Space, such as Borosk, were fortified as frontier redoubts, but of the major fortress worlds, only Yaga Minor now remained—and it can be noted, somewhat bleakly, that whereas the invaders overwhelmed Bastion and Muunilinst with terrifying speed, the defenses of the Empire's key shipyard threw off the Yuuzhan Vong with remarkable ease, no less than twice."}, {"tag": "p", "text": "As of 130 ABY, Bastion had become known as the best-defended fortress world in the galaxy, making a direct attack by Darth Krayt's Galactic Empire against the capital of Roan Fel's Empire-in-exile virtually impossible."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}