{"url": "Fortressa", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance to Restore the Republic starships", "Category:Confederacy of Independent Systems starships", "Category:Lucrehulk-class battleships", "Category:Lucrehulk-class LH-3210 cargo freighters", "Category:Trade Federation starships"], "nodes": [{"tag": "h1", "text": "Fortressa"}, {"tag": "p", "text": "The Fortressa was a modified Hoersch-Kessel Drive, Inc. Lucrehulk-class LH-3210 cargo freighter commissioned by the Trade Federation megacorp. Converted to a battleship as part of the Federation's desire to better protect its cargo convoys, the Fortressa was later part of the naval forces of the Confederacy of Independent Systems—with whom the Trade Federation had allied themselves—which fought against the Galactic Republic during the Clone Wars. The Fortressa survived the war, and it was decommissioned and sold off when the Galactic Empire—the successor state to the Republic—nationalized the Trade Federation. Falling into the hands of the Alliance to Restore the Republic, the Fortressa served as starfighter carrier and anchored the Alliance Fleet's main battle line. In 0 BBY, the Fortressa engaged the Death Star battlestation in the Horuz system in an effort to destroy the immense superweapon before it became operational. The Death Star used its superlaser on the Fortressa, destroying the vessel in a single shot."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Fortressa was a modified Hoersch-Kessel Drive, Inc. Lucrehulk-class LH-3210 cargo freighter, converted by the Trade Federation megacorp into a battleship as part of its military build-up. The vessel was officially classed as a Star Destroyer despite the fact that the Anaxes War College System classified Star Destroyers as vessels measuring between 1,000 and 2,000 meters while the Fortressa measured around three kilometers in diameter, 3,356.9 meters long, 3,009 meters wide, and 1,028.77 meters high. Lucrehulk-class vessels resembled a ring with a gap in the front, ending in two truncated prongs that housed massive hangars and cargo holds. A spherical command section sat in the center of the ring, attached to the rest of the vessel by a rear mounted spar. The reactor core was located in the command sphere, and the engines were positioned at the rear of the ship. By 0 BBY, the Fortressa served as a starfighter carrier for the Alliance to Restore the Republic, and it housed five hundred T-65 X-wing starfighters in its hangars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally commissioned as a cargo freighter by the Trade Federation, the Fortressa was modified to serve as a warship when the megacorp gained approval from the Galactic Senate to raise a military arm to better defend its convoys. The Fortressa was upgraded, joining the ranks of vessels that would become known as Lucrehulk-class battleships. During the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems that raged from 22 BBY to 19 BBY, the Fortressa served in the Confederate Navy as the Trade Federation had pledged its allegiance to the Confederacy. The war ended with the enactment of Order 66—a contingency order that mandated the termination of the Republic's Jedi commanders if they were ever deemed to be a threat to the Republic itself—and the execution of the Separatist Council on Mustafar. Supreme Chancellor Palpatine announced that the Republic was being reorganized into the Galactic Empire, with himself as Galactic Emperor. The Empire nationalized the Trade Federation and sold off its fleet of Lucrehulks, including those converted battleships like the Fortressa that had survived the war."}, {"tag": "p", "text": "While most of the Lucrehulk fleet ended up in commercial hands, the Fortressa was acquired by the Alliance to Restore the Republic, a resistance movement against the tyrannical and oppressive Empire. The ship served as a starfighter carrier, with five hundred X-wing starfighters stationed aboard. Although the early Alliance Fleet relied heavily on starfighter operations, Alliance Chief of State Mon Mothma insisted on building a naval battle line, which was anchored by the Fortressa alongside the Mon Calamari flagship Independence and the modified Providence-class carrier/destroyer Rebel One."}, {"tag": "p", "text": "In 0 BBY, the Alliance learned of the location of the Death Star, an immense battlestation armed with a superlaser capable of destroying planets. The Death Star was under guard in the Horuz system, located in the Atrivis sector of the Outer Rim Territories, and the Fortressa was assigned to attack the station before it became operational and attempt to destroy it using its starfighter complement. From a tactical viewpoint, the Fortressa presented the best option of success. Rather than use the Alliance Fleet in an attempt to engage the Star Destroyer force guarding the Death Star, which would have been costly in terms of manpower and material for the nascent Rebellion, the large number of starfighters from the Fortressa had a greater chance of slipping through the defensive screen and inflicting damage upon the battlestation. Even if the attack only delayed the construction of the superweapon, the Alliance could claim a tactical victory."}, {"tag": "p", "text": "Decanting from hyperspace, the Fortressa was faced with the Death Star, a Star Destroyer escort, and ten squadrons of TIE/LN starfighters in the middle of a training exercise. When the Fortressa registered on Imperial sensors, the TIE fighters and Star Destroyers were immediately ordered to intercept, while a further thousand TIEs were launched from the battlestation. The Fortressa responded by launching 250 X-wings in the first wave, followed by a further wave of equal numbers, totaling five hundred. A squadron of Alliance fighters broke off from the main group to engage a starship carrying Admiral Natasi Daala to the station. The Imperial ship was able to destroy its attackers, but it lost its bridge deflector shields in the process. An explosion on the command deck caused by the attack injured Admiral Daala, leaving her with a head wound."}, {"tag": "p", "text": "Grand Moff Wilhuff Tarkin, in command of the Death Star, had initially planned to engage the Alliance ship in a conventional space battle, but reconsidered the approach and ordered the TIEs and Star Destroyers to break off their intercept. Instead, he communicated with the gunnery crew manning the superlaser and ordered them to target the Fortressa. The crew complied, and—using only four percent of the weapon's capability—vaporized the Fortressa in a single shot. The fighters that the carrier had launched continued their mission; the first wave of X-wings outnumbered the initial TIE picket line by two-to-one, and they flew in a non-evasive pattern in an attempt to punch through the TIE defensive screen and attack the Death Star directly. The defending TIEs employed a zone defense, and the X-wings did not attempt to engage the Imperial force, only shooting at TIEs if they were in their path to the battlestation. Around eighty X-wings broke through the first TIE line, but they were soon destroyed by the second wave of Imperial fighters launched from the station. None of the X-wings from the second wave broke through the TIE defensive line."}, {"tag": "p", "text": "The Fortressa was the Death Star's first kill, and the first successful test of the battlestation's superlaser. However, the carrier's attack led to Tarkin choosing to relocate the Death Star to avoid detection and a possible full-scale battle with the Alliance Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Fortressa first appeared in Death Star, written by Michael Reaves and Steve Perry in 2007. It was later mentioned in The Essential Atlas by Jason Fry and Daniel Wallace in 2009, and in 2012's The Essential Guide to Warfare, written again by Fry and Paul R. Urquhart."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}