{"url": "Fortune,_Fate,_and_the_Natural_History_of_the_Sarlacc", "categories": ["Category:Real-world articles", "Category:Articles from unlicensed sources", "Category:Star Wars Tales 6"], "nodes": [{"tag": "h1", "text": "Fortune, Fate, and the Natural History of the Sarlacc"}, {"tag": "p", "text": "Fortune, Fate, and the Natural History of the Sarlacc is a 9-page comic featured in Star Wars Tales #6. It was written by Mark Schultz, the artwork was done by Kellie Strom and it was edited by Philip Amara."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Grubbat Fhilch gambled with his life and lost. Above a sarlacc pit, he curses Jabba the Hutt and the bounty hunter Boba Fett, while a Gamorrean Guard pushes Grubbat into the pit. Grubbat vows to have his revenge, though Fett finds this to be an unlikely prospect."}, {"tag": "p", "text": "Later, the Sarlacc releases its offspring to the wind. The Sarlacc \"baby\" attaches itself to a dewback ridden by Imperial sandtroopers, and sucks blood from the animal to feed itself."}, {"tag": "p", "text": "Later on, the troopers order a group of Jawas to clean their dewbacks. A Jawa removes the \"baby\" from one of the dewbacks and puts it in a bottle of water. Unknowing of what it may be, the Jawa uses it as a cleaning sponge on a droid. At the Jawa camp, the \"baby\" manages to escape the bottle when the Jawa is called into a nearby tent for his supper, and clasps itself to a birdlike creature, feeding itself on its catch."}, {"tag": "p", "text": "As the sarlacc \"baby\" grows, it challenges a larger, spider-like creature with three heads. It seems to lose, with the other creature eating the sarlacc larva. However, as the creature eventually lies down to sleep for the night, it dies and is eaten from the inside by the sarlacc. After finishing its meal, the sarlacc digs itself into a pit."}, {"tag": "p", "text": "In 4 ABY, Jabba the Hutt and Boba Fett take Luke Skywalker, Chewbacca, and Han Solo to the Great Pit of Carkoon, to be thrown into the very sarlacc whose life cycle has been told in the story. The story ends with the assertion that Grubbat will soon have his unexpected revenge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While the details of a sarlacc's growth are canon, the story itself is not, as the sarlacc at Carkoon had been alive for over four thousand years before it encountered Boba Fett."}, {"tag": "p", "text": "The story implies that Grubbat gets his revenge for Boba Fett when the sarlacc eats him. However, the story A Barve Like That: The Tale of Boba Fett reveals that Fett later escaped from the belly of sarlacc."}, {"tag": "p", "text": ""}]}