{"url": "Foundling", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Foundlings"], "nodes": [{"tag": "h1", "text": "Foundling"}, {"tag": "p", "text": "A foundling was a term used in Mandalorian culture for children who were adopted by the warriors of Mandalore."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "By their creed, Mandalorians could not leave abandoned children to their fate if they encountered them, whether on the battlefield or on any other mission. By creed, any Mandalorian warrior who had a foundling in their care was duty-bound to either reunite them with their kind or raise them until they were of age, acting as the child's parent. When the foundling came of age, if he had not yet been reunited with its kind, it could decide to leave or join the Mandalorians. Mandalorians who had been foundlings were treated no differently than any other Mandalorians, possessing the right to bear their armor and even to form their own clans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to the Galactic Empire's Great Purge, the foundlings would be taken to Mandalore and raised among the warrior kind. Following these events however, the remaining Mandalorians were forced into hiding, such as a band of warriors who called themselves the Tribe and who followed the ancient Way of the Mandalore. The Tribe hid in a covert on the planet Nevarro, only emerging one at a time to avoid detection. Due to their limited numbers, the Tribe viewed its foundlings as the future of Mandalorian culture."}, {"tag": "p", "text": "A member of the Tribe called Din Djarin, himself a former foundling, worked as a bounty hunter for the Bounty Hunters' Guild on Nevarro. In 9 ABY, Djarin accepted a contract from an Imperial remnant operating on Nevarro to recover a bounty for which he was paid in beskar, Mandalorian steel that was stolen by the Empire. However, the bounty turned out to be a child from an unidentified species. After turning over the child to the Imperials, Djarin had a change of heart and rescued the child, with help from the Tribe."}, {"tag": "p", "text": "Weeks later and following a confrontation with the Imperial remnant on Nevarro, Djarin re-encountered the Tribe's leader, a mysterious Mandalorian known as \"The Armorer,\" in the ruins of the enclave. There, she told him that the child was as he had been, a foundling of the Mandalorians. She instructed Djarin to follow the ancient creed of the Mandalorians and return the child to its own kind or raise him as his own until he came of age. By accepting the charge, Djarin earned the right to form his own clan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}