{"url": "Foundry_(space_station)", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Republic space stations", "Category:Kurost sector", "Category:Manufacturing technology", "Category:Mid Rim space stations", "Category:Rakata culture", "Category:Rakatan space stations"], "nodes": [{"tag": "h1", "text": "Foundry  (space station)"}, {"tag": "p", "text": "The Foundry was an engineering marvel that was built into a massive asteroid situated in the long-forgotten Nanth'ri system. It consisted of at least twelve manufacturing levels according to data obtained by Imperial Intelligence that were each capable of producing thousands of droids. A series of vast tunnels honeycombed the asteroid which suggested that automated mining droids were used to excavate the interior of any useful ores. It was believed by the Imperial Reclamation Service that the facility used a network of tractor beams to capture and break down nearby asteroids to provide new raw material for its endless mass production."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This facility was believed to be at least twenty to thirty thousand years old and was built by a long forgotten alien species. The specifications matched those of three other space stations that had been discovered by the Sith Empire with all of these possessing tremendous power. These stations included the Star Forge and another facility that was capable of xenoforming entire worlds. The full extent of the production capabilities of the Foundry were unknown though it was believed it was able to change the entire galaxy."}, {"tag": "p", "text": "Revan was aware of the existence of the Foundry and kept that knowledge hidden from the Sith Emperor. After he was rescued from the Maelstrom prison, he traveled to the facility where he intended to unleash an army of extermination droids against the Sith Empire to eliminate the threat posed by the Emperor. However, Darth Malgus learned of Revan's location and ordered Moff Phennir to assemble a strike force. After the Attack on the Dorin's Sky the Imperials acquired a way to sneak inside the station on the captured Republic ship. Helm officer Martos stayed behind while a strike team stormed through Foundry, defeating Revan's personal droid HK-47. Eventually the strike team reached Revan and engaged him in a fierce fight, at the end of which the Master of the Foundry disappeared in a bright flash of light. The Battle of the Foundry was won by the Empire and Darth Malgus handed it over to the Schism Collective, who rebuilt HK-47 from its remains and later incorporated several of the Foundry's capabilities into the Emperor's personal space station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}