{"url": "18", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles that are known by a nickname", "Category:Clone trooper lieutenants"], "nodes": [{"tag": "h1", "text": "18"}, {"tag": "p", "text": "18, nicknamed \"Ace\", was a clone trooper lieutenant, who served in Excelsior Company, under Clone Commander Vargus during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "18 was the nickname of a clone trooper lieutenant that served in Excelsior Company, under Clone Commander Vargus. As a young man, he sometimes played the game Banthas and mynocks. He was assigned as a lieutenant on Kamino, and chosen to be one of the six rookies chosen to aid Excelsior company on Ando Prime. Their mission was to discover the whereabouts of the 313th Legion, which had begun a routine attack operation on a CIS base there three days ago. Twenty-four hours before 18's assignment the 313th had disappeared without a trace and sent no emergency transmissions, though all comm equipment was verified to be operational. Before entering hyperspace, 18's squad were de-moralized by a seasoned clone trooper named Dom, or Bruiser, after he said that they were \"expendable\". 18, however, tried to keep up up his squads morale by saying that Dom was probably only trying to \"ride\" the rookies. During the Hyperspace trip 18 used the squad medic's scalpel to give himself a crew-cut."}, {"tag": "p", "text": "18 also wondered where to get dye, as he would like to dye his hair red. When 18 and his squad landed on Ando Prime, they were introduced to an ARF trooper named Falco. 18 and two other clones—57 and 44—were also chosen to accompany Falco on a first sweep of the area of the 313th legion's last known transmission. At this time 44 was given a nickname, \"Slug,\" due to the fact he was twenty meters behind the rest of the group. 18 was jealous of this, as 44 now has a nickname. After more trekking, Falco orders 18, 57 and 44 (Slug) to wait at the base of a mountain while he investigates alone. The three troopers waited an hour, and 18 wondered if Falco was playing a joke on them. Commander Vargus contacts them and asks their status. 18 said Falco had gone on alone, but doesn't mention that Falco had been gone over an hour. After persuasion by the other two troopers, 18 contacted Vargus and informed him of Falco's long absence. Commander Vargus brought the rest of the squad, but before they could reach 18, Slug, and 57, the trio are attacked by snow beasts much like the Wampas on the planet Hoth. 18 and 57 get out of the way of a beast jumping at them, but Slug was grabbed by the beast. Commander Vargus fired on the beast, but all it does was enrage the creature, and made it head for Vargus. 18 fired at it, but his blaster does no damage to the beast."}, {"tag": "p", "text": "Commander Vargus was swiped at with one of the beast's claws, then stepped on by it. 18 approached the beast and shot at it at close-range, which made it drop Slug. The squad medic checked on Vargus, and discovers he had some broken bones. 18 organized a trek to get a transport vehicle from the ship. He orders Slug and 16 to stay with 57 to protect Vargus. He would go back to the ship with 23, 15 and Dom. They were approaching the ship when three more snow beasts came toward them and block them from reaching the ship. 18 ordered Dom to set off a sonic charge, hoping that like Wampas, these creatures are sensitive to some sound frequencies. They were, and they leave due to the sonic charge. Once inside the ship they find Falco's BARC speeder. 18 rigged a platform on the back to bring Vargus back on. Dom was sent out to get Vargus. 18, 23 and 35 stay behind. The speeder returns with 57 and Vargus. 57 tells 18 the rest are returning on foot. In the ship's medical bay 57 sets Vargus's broken bones with assistance from a portable FX-3 medical droid. 18 and the squad check on Vargus, who had nicknamed 57 \"Patch.\" 18 now felt left out of not getting a nickname. Vargus informed 18 that he received a transmission from Falco, who had found the CIS outpost. Vargus tells 18 to organize a squad at first light to go to the outpost. The next morning 18 takes Dom, 23 and 35 with him to go to a Confederate outpost. 18 decided to avoid the mountains, because of the snow beasts. Instead, the group walked across a plain and reaches a very large canyon."}, {"tag": "p", "text": "Across it is a racetrack, and two abandoned podracers. Although all the other members of the squad wanted to use the podracers to get across, 18 insisted they were too dangerous and makes them walk around the canyon. A few hours later they reach the other side, and the Confederate outpost. Inside the outpost, made of several different huts, Falco tells them to come into building 46-beta. Inside, the group of clones met two men: Clone Commander Cody, who was admired by 18, and Jedi Master Obi-Wan Kenobi. Kenobi told 18 what happened to the 313th Legion. He explained that he and Cody detected a massive hyperspace rift in the CIS outpost and traced to to a machine. The machine was able to instantly transport large amounts of troops across the galaxy. Kenobi guessed that the machine was accidentally activated in battle and transported the 313th Legion, as well as the droid army, to a planet beyond the Outer Rim. If a homing device was taken to the legion, it can bring them back as long as they are all in a 1 km radius. Dom, Falco and 18 are selected to accompany Cody and Kenobi to go to the 313th legion. The squad is lead to the machine, and moved to the other planet. There they find the 313th legion engaged in battle with the battle droid army. They cannot get them back without transporting the droids as well, so they must concentrate the clones away from the droids. Cody discovers a droid comm station and suggested they destroy it. Kenobi believed that it was a priority to find General Bandis, leader of the 313th Legion. Kenobi asked 18 if he felt able to lead an attack on the comm station or let Kenobi destroy the station and instead go into battle with Cody."}, {"tag": "h3", "text": "Last stands"}, {"tag": "p", "text": "Ace decided to assist Cody in battle and let Kenobi destroy the comm station. Cody discovered General Bandis's unit. 18 and Cody charged into the droids, fighting their way to General Bandis. Cody told Bandis the rescue plan. After Kenobi destroyed the comm station, making the droids confused, the droids were defeated, and the legion was transported back to Ando Prime by using the homing device. Back at the ship, Cody suggested 18 is ranked up to lieutenant for his work. Alternatively, 18 accepted the mission of destroying the comm station with Dom and Falco. When they reached the comm station they discovered that it is heavily guarded by droid forces. It was also guarded by a modified Hailfire droid. Unlike a Hailfire, however, the tank was operated by two B1-Series battle droids, instead of being self-aware, like usual. Dom wanted to blow the place up, but 18 says that they will have to get closer. He then asks Falco to do reconnaissance on the perimeter of the station, to see if there is a weak spot."}, {"tag": "p", "text": "A few minutes later Falco came back and told 18 that the battle droids are all around. Faclo suggested that they could storm the place, but 18 figured that they would be destroyed by the tank. Dom still wants to risk it, but 18 suggests that they could reprogram some guard droids to commandeer the tank for them. Falco believed that reprogramming droids would be too tricky. Instead, he suggested that they storm the tank and steal it. 18 agreed and decided to storm while the tank was rolling away from them. They did, and managed to remove the battle droids from the tank. They approached the comm station in the tank, and Dom threw two pulse grenades into the comm station. They escaped in the tank, and the comm station was destroyed. Afterward, they destroyed many droids with the stolen tank. The rest of the operation went well, and a few hours later the 313th legion is back on Ando Prime, as well as 18 and the rest of the squad. In the ship, Falco gives 18 the nickname \"Ace\", for his work."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This article assumes that a specific path is taken in a choose-your-own-adventure book."}, {"tag": "h2", "text": "Appearances"}]}