{"url": "Fourth_Battle_of_Mygeeto", "categories": ["Category:Canon articles", "Category:Battles in the Outer Rim", "Category:Battles of the Great Jedi Purge", "Category:Battles of the Outer Rim Sieges"], "nodes": [{"tag": "h1", "text": "Fourth Battle of Mygeeto"}, {"tag": "p", "text": "The Fourth Battle of Mygeeto was a battle fought during the final days of the Clone Wars on the planet Mygeeto. It was part of a three year-long campaign by the Galactic Republic to oust the Confederacy of Independent Systems from the strategically important world. The battle was mere months after the Third Battle of Mygeeto."}, {"tag": "p", "text": "After the death of Jedi General Ki-Adi-Mundi during Order 66, which was enacted during the battle, Marshal Commander CC-1138 and the 21st Nova Corps continued fighting to destroy the last of the Separatist positions on the world."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A strategically important yet frigid world in the Outer Rim Territories, Mygeeto was controlled by the InterGalactic Banking Clan during the Clone Wars, but it was also sought by both the Confederacy of Independent Systems and Galactic Republic. A number of battles were waged by the Republic to remove the Confederacy's presence on Mygeeto, making the struggle into a three year long campaign."}, {"tag": "p", "text": "The Third Battle of Mygeeto involved Jedi General Depa Billaba's battalion of clone troopers and the Republic's Mandalorian allies in Skull Squadron, yet even then the Republic was outnumbered by the battle droid forces on planet. General Grievous himself oversaw the Separatist Droid Army during the battle, but he was forced into a retreat, turning the Third Battle of Mygeeto into a Republic victory."}, {"tag": "p", "text": "Nevertheless, only months later, the war returned to the world when the Republic sought to take out entrenched Banking Clan forces on Mygeeto, throwing it into the Fourth Battle of Mygeeto. The Fourth Battle was also part of the Outer Rim Sieges campaign. Jedi General Ki-Adi-Mundi and Clone Marshal Commander CC-1138 \"Bacara,\" who had served under Mundi throughout the Mygeeto campaign and often at other points during the war, were assigned to lead their 21st Nova Corps into the battle. Previously in the sieges, Bacara had been leading Republic forces against the Confederacy, leading to the Republic attack on Mygeeto. At one point, Mundi and Bacara appeared via hologram at a meeting about the sieges."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "During the fighting, Mundi led his forces against Separatist positions on Mygeeto, the entrenched positions of the Banking Clan's forces. Thus, he fought alongside the Galactic Marines and Unstable Terrain Artillery Transports on a bridge against the Droid Army. While fighting several B1 units, Mundi yelled to his troops that they needed to take control of the bridge, unaware that Bacara then received Order 66 from Supreme Chancellor Sheev Palpatine, branding the entire Jedi Order as traitors to the Republic and ordering their instant execution. Although the Clone Commander hesitated briefly from disbelief, his obedience, like all clones, was enforced by his behavioral modification biochip, turning Bacara and the rest of the 21st against their own leader."}, {"tag": "p", "text": "As Mundi and the clones fought the droids, losing one UT-AT to a blast from a Octuptarra tri-droid, the Jedi General yelled for his troops to follow him into battle against B2-series super battle droids, only to notice that his squad had instead stopped when he heard them priming their blasters. Bacara and his marines suddenly opened fire, and, though he managed to block some of their blaster bolts, Mundi was killed by their attack, dropping his lightsaber to the group."}, {"tag": "p", "text": "Having achieved victory in the Bracca Invasion, Jedi General Jaro Tapal's 13th Battalion was supposed to provide aid to the battle on Mygeeto, but the execution of Order 66 ended with the destruction of their Venator-class Star Destroyer, the Albedo Brave. Following Mundi's execution, Bacara and the 21st continued the battle against the droids, fighting with the intention of wiping out the Confederacy's remaining positions on Mygeeto."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Clone Wars ended with the mission to Mustafar, during which Sith apprentice Darth Vader murdered the Executive Separatist Council and shut down the Droid Army, and Palpatine transformed the Republic into the Galactic Empire. Mygeeto became a part of the Empire, but the Banking Clan was able to continue to work from the planet. Vice Chairman Anolo came to own Mundi's lightsaber. While speaking with a Givin codebreaker, Anolo compared its wielder to the Banking Clan, as the Banks were involved in a series of trade wars with the Hutt Clan. Shortly afterward, Anolo was killed during the bounty hunter Greedo's mission to Mygeeto, and the Rodian escaped with Mundi's lightsaber. After Greedo returned to Tatooine, it was purchased by collector Dok-Ondar, who kept it in his Den of Antiquities on Batuu."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}