{"url": "Fragmentation_grenade/Legends", "categories": ["Category:Legends articles", "Category:Fragmentation grenades"], "nodes": [{"tag": "h1", "text": "Fragmentation grenade"}, {"tag": "p", "text": "Fragmentation grenades, also known as frag grenades, were cheap and low-damage grenades which were used mainly by military personnel, mercenaries, adventurers, and bounty hunters."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Frag grenades consisted of explosive detonite wrapped in a chrome shell. They could be set to detonate on impact or set with a timer that lasted several seconds before detonating. Frag granades unleashed metal shrapnel and dealt slashing damage. This made them highly effective against unarmored targets. The typical blast radius was about 3 to 4 meters. These items were highly restricted despite their common use. Because of their small size and weight, about 0.5 kilograms, detection of these weapons could be difficult."}, {"tag": "p", "text": "The frag grenade was similar to the thermal detonator, although it was far less powerful. The low cost of frag grenades made them available in large numbers for soldiers. For comparison, a thermal detonator cost between 2,000 and 4,000 Republic credits; the frag grenade cost between 50 and 200 credits."}, {"tag": "p", "text": "Frag grenades were usually thrown, however they could be loaded into a grenade launcher for a far greater range. Grenade launchers themselves could be mounted on vehicles to create an effective anti-infantry weapon."}, {"tag": "p", "text": "The Merr-Sonn C-22 fragmentation grenade was a typical example of a frag grenade, although the C-22 had a longer timer of up to two minutes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Frag grenades were carried as standard armament by many types of soldiers throughout the ages, as well as Planetary Security Forces."}, {"tag": "p", "text": "During the Old Republic era, they were used by Republic troopers, Sith troopers, and various Mandalorian warriors."}, {"tag": "p", "text": "During the Rise of the Empire era and subsequent Rebellion era, frag grenades were carried by various Clone troopers, as well as most types of Stormtroopers, scout troopers, Radtroopers, SpecForce soldiers, CompForce Assault troopers, Rebel troopers, and by those serving as the Emperor's Hands. The agents of the Zann Consortium criminal organization, known as Defilers, also carried frag grenades."}, {"tag": "p", "text": "New Republic soldiers used the C-16 fragmentation grenade. During the Legacy era, frag grenades were carried by Joker Squad Stormtroopers."}, {"tag": "p", "text": "Individuals who used frag grenades included Dengar, a Corellian bounty hunter. Vehicles were occasionally equipped with grenade launchers that fired frag grenades, such as the AT-ST and the AT-KT."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Frag grenades in Star Wars: Knights of the Old Republic were beige in color and were a more basic type of grenades. They dealt piercing damage and were moderately effective. The damage they did wasn't great, but the player could use them without concern of running out, due to how common they were in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}