{"url": "Alderaanian_consular_security", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Incomplete lists", "Category:Alliance to Restore the Republic military units", "Category:Culture of Alderaan", "Category:Law enforcement"], "nodes": [{"tag": "h1", "text": "Alderaanian consular security"}, {"tag": "p", "text": "Alderaanian consular security, with its members known as Fleet Troopers, was the security force present on Alderaan and on its consular vessels, responsible for guarding and escorting senators and other dignitaries. When the Viceroy Bail Organa became a leading member in the Alliance to Restore the Republic, these forces also played a part in fighting the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 0 BBY, many Alderaanian consular security soldiers were based at the Alliance to Restore the Republic's main base on Yavin 4. There they worked as mainly security for the base and it's personnel with one watching starships fly in and out on an elevated viewing platform and others attending the meetings with the Alliance High Command. As well as the ground base, many soldiers were seen on starships such as the MC75 star cruiser Profundity and the CR90 corvette Tantive IV. Among the consular security soldiers on the ground was Gale Torg, who was assigned to guard and escort senators and dignitaries who visited the Alliance. Shortly after a meeting of the High Command, where many consular security personnel were posted, Torg was walking with the former senator Mon Mothma and General Antoc Merrick when Private Tenzigo Weems, from the Rebel Alliance Intelligence Service, ran to Mothma and Merrick. He told them about a rebel attack on Scarif and when they asked of Admiral Raddus and he claimed he was already on his way there with a large portion of the Alliance Fleet."}, {"tag": "h3", "text": "Battle of Scarif"}, {"tag": "p", "text": "Raddus had been notified of the attack by a consular security soldier on the Profundity. His swift response meant he and the Alliance Fleet managed to win at Scarif, although with the cost of the Profundity being disabled by the Imperial-class Star Destroyer Devastator. Aboard the Profundity, many consular security soldiers were rushing to get onto the Tantive IV, which was docked into the hanger of the cruiser. However, before making for the Tantive IV, one of the soldiers stopped at a terminal to extract the plans for the Death Star, the very plans they had obtained during the battle, on a datacard. As he did that, another soldier prompted him to get going and they took the drive and ran down to the next security door. The door malfunctioned and failed to open completely, with the lights turning off simultaneously from the damage made to the ship. After failing to pull it open, the soldier tried to knock for the retreating soldiers on the other side until the twelve trapped men realized there was a sound behind them."}, {"tag": "p", "text": "The dozen consular security soldiers pointed their guns at the darkness until it lit up to show Darth Vader standing before them with his lightsaber glowing. The soldiers opened fire and Vader began picking them off. The soldier with the plans continued knocking on the door until Toshma Jefkin came from the other side of the door to help. As Vader slaughtered the last of the soldiers, Jefkin was given the plans through the gap in the door and he ran into the Tantive IV as Vader broke through the door, his lightsaber stabbed through the plan's former holder. Jefkin closed the airlock and ordered the corvette to launch. The Tantive IV descended from the Profundity and made a quick escape from the system."}, {"tag": "h3", "text": "Escorting the Death Star plans"}, {"tag": "p", "text": "Unfortunately, the Tantive IV was leaking from its hyperdrive which left a trail for the Devastator to follow. Captain Raymus Antilles ordered for the consular security soldiers to secure the airlock and prepare the escape pods. The Tantive IV arrived at  Tatooine and was quickly followed by the Devastator which pulled it into its main hanger. Several soldiers took position to defend the airlock, where stormtroopers blasted their way in, pushing the defenders back. After taking heavy losses, the soldiers were in full retreat, and several were captured. Antilles was captured and interogated by Darth Vader. Antilles denied that they had the Death Star plans and Vader choked him to death in his anger."}, {"tag": "p", "text": "Although the Death Star plans barely escaped the Tantive IV, the Death Star went and destroyed Alderaan later that day. Soon after, the plans made it to the Alliance's main base, although they were tracked and followed by the Death Star. With the battle station on its way to destroy Yavin 4, the Alliance swiftly put together an attack that targeted the station's main weakness. With numerous consular security soldiers still present to guard the base, the attack commenced and became a major success, with the Death Star ultimately being destroyed. A large number of consular security soldiers attended the Royal Award Ceremony that awarded the heroes of the battle. These included Captain Miara Larte and Jessamyn, who were still in mourning for their friends on Alderaan. Gale Torg too was present as well, but as an Honor Guard."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After the Empire fell, the Alliance transitioned into the New Republic. At least one New Republic soldier used the same helmet type as the Alderaanian consular security soldiers."}, {"tag": "h2", "text": "Uniforms and equipment"}, {"tag": "p", "text": "The troopers of consular security wore pale blue shirts, grey trousers, and black calf length boots. Over the shirts was worn a multi-pocketed black spacer vest of Corellian cut. The distinctive white service helmet featured a flash visor as well as, in many cases, an integrated comlink. They were known to utilize DH-17 blaster pistols. Officers in consular security wore a similar uniform, but instead sported a light brown jacket, shirt and pants along with a brown belt."}, {"tag": "p", "text": "Many aspects and variants of these uniforms saw service with Rebel troopers, especially on Yavin 4's Base One in 0 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Alderaanian consular security first appeared in Star Wars: Episode IV A New Hope, directed by George Lucas and released in 1977. They were later identified as fleet troopers in the game Defend the Fleet on the Fantasy Flight Games website. In 2016, the troopers appeared in Rogue One: A Star Wars Story and were identified as the Alderaanian consular security in the Star Wars: Rogue One: The Ultimate Visual Guide that came out simultaneously."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}