{"url": "Frangawl_Temple", "categories": ["Category:Canon articles", "Category:Bardottan locations", "Category:Temples"], "nodes": [{"tag": "h1", "text": "Frangawl Temple"}, {"tag": "p", "text": "The Frangawl Temple was an ancient stronghold of the Frangawl Cult on the planet Bardotta. Following the collapse of the Frangawl culture and their political control of the planet, the thriving Dagoyan Order seized the Temple and erected their Royal Palace atop the natural spire that capped the Temple."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Constructed within natural labyrinth beneath a towering spire on Bardotta, the Frangawl Temple was a stronghold of the ancient warrior cult that once controlled the planet and waged unending war. A testament to the cult's violent history, the Temple cave was decorated with carved symbols of war, painted murals of conflicts fought over centuries, and rusted cages dangling from the cavern ceiling. The center of the cavern was dominated by the carved likeness of Malmourral, the war demon of the Frangawl. Angled downward, the dragon-like statue's tail ended in a pool of magma that emerged from deep within the planet. When the Frangawl practiced their arcane rituals, the mouth of the dragon statue would swirl with mystic energy that would strip the Living Force from anyone that was tossed into the maw of Malmourral. The lifeless body of the sacrificial offering would tumble through the statue's bowels before being consumed by the molten lava at the terminus of the dragon's tail."}, {"tag": "p", "text": "Abandoned after the defeat of the Frangawl society circa 2000 BBY, the Temple's entrance was located at the base of a towering natural spire. When the Royal Palace was constructed into the slopes of the spire high above, the entrance to the cave system was considered a sacred site, and was adorned with prayer flags and Dagoyan banners. Entrance into the catacombs was not forbidden, but few entered the caves or pondered the mystical significance that was lost to time."}, {"tag": "p", "text": "During the Clone Wars, the Frangawl Cult underwent a resurgence, abducting several prominent Dagoyan Masters and reconvening their order deep within the Temple cave. Using their knowledge of the rituals of Malmourral, the Frangawl cultists sacrificed several of the captured Masters in the dragon statues in order to create a power source for the mysterious offworlder called Talzin. Jedi Master Mace Windu, investigating the disappearances of the Dagoyan Masters, infiltrated the Temple and ended the ritual."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}