{"url": "Free_Virgillia-class_Bunkerbuster", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starship classes", "Category:Corellian Engineering Corporation products", "Category:Corvette classes", "Category:Resistance starship classes"], "nodes": [{"tag": "h1", "text": "Free Virgillia-class Bunkerbuster"}, {"tag": "p", "text": "The Free Virgillia-class Bunkerbuster, also known as the Bunker Buster, the Resistance Bunkerbuster, or the Resistance cruiser, was a type of corvette model constructed by the Corellian Engineering Corporation and used during the First Order/Resistance War by the Resistance. Vice Admiral Amilyn Holdo commanded a Bunker Buster known as the Ninka for the Resistance."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Free Virgillia was a class of corvette. It was armed with powerful bunker buster plasma bombs, turbolaser turrets that had dedicated power outputs, and a complement of bomber craft or a squadron of A-wing starfighters that could dock on its reinforced pylons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They were in use as of 4 ABY.[source?] The Resistance used the bunkerbuster Ninka commanded by Vice Admiral Amilyn Holdo in 34 ABY. The Ninka served as an escort for the Resistance flagship Raddus during the attack on the Resistance fleet, where it was destroyed when it ran out of fuel and fell into range of the pursuing Supremacy."}, {"tag": "p", "text": "Many Free Virgillia-class corvettes responded to General Lando Calrissian's call to action against the Sith Eternal forces, and fought with the citizens' fleet during the Battle of Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Free Virgillia-class Bunkerbuster first appeared in the the 2017 video game Star Wars Battlefront II as part of the The Last Jedi season."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}