{"url": "Freedom", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:Imperial II-class Star Destroyers of the Galactic Empire", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Freedom"}, {"tag": "p", "text": "Freedom was an Imperial II-class Star Destroyer that served in the New Republic's starfleet. Prior to this she had served in the Imperial Navy under the name Avarice."}, {"tag": "h2", "text": "Imperial service"}, {"tag": "p", "text": "Little is known of the early history of the Avarice. The ship came to be commanded by Sair Yonka. After the Battle of Endor, Warlord Zsinj attempted to recruit Yonka and the Avarice into his fleet, but Yonka refused to take any orders other than those coming from Coruscant. Yonka sided with Ysanne Isard, feeling that she represented the best chance to reestablish the Empire."}, {"tag": "p", "text": "After Coruscant was captured by the New Republic, Yonka traveled to Thyferra. During this time he became increasingly disillusioned by Isard, and was disturbed over the use of biological weapons such the Krytos virus by Isard and the destruction of the Halanit colony."}, {"tag": "p", "text": "Yonka was successfully bribed by Wedge Antilles to leave Imperial service. He and the crew of the Avarice, which was renamed the Freedom, confronted Isard's agents in the crew. These agents hijacked a shuttle and forced the Freedom's crew to destroy the shuttle."}, {"tag": "h2", "text": "New Republic service"}, {"tag": "p", "text": "Following the defection of the Freedom, Yonka went on to assist Rogue Squadron in the Bacta War, and the Star Destroyer played a pivotal role in the Battle of Thyferra."}, {"tag": "p", "text": "When entering the Thyferra system, the captain of the Lusankya believed it was the Star Destroyer Virulence, which sacrificed itself when the Rogues had caught it in a gravity well and tractor beams back at the Yag'Dhul Station. After opening of comm system, the Star Destroyer revealed itself to be the Avarice, renamed Freedom. The Freedom attacked and distracted the Lusankya while Rogue Squadron did the damage to the Lusankya."}, {"tag": "p", "text": "The Freedom was heavily damaged in battle with the Lusankya. After the Bacta War ended, the Freedom was integrated into the New Republic Defense Fleet. Yonka remained in command, and was given the rank of Commander. The ship was taken to the shipyards at Sluis Van for repair and refitting."}, {"tag": "p", "text": "The Freedom was still being retrofitted at the Sluis Van Shipyards at the time they were hit by Grand Admiral Thrawn's forces. The Freedom escaped targeting by the mole miners, and fought in the ensuing Battle of Sluis Van. It later fought in the Battle of Bilbringi, where it once more survived undamaged (although at least one of its support craft were destroyed), and again in the campaign against Prince-Admiral Delak Krennel's Ciutric Hegemony forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}