{"url": "Freedom_Day", "categories": ["Category:Legends articles", "Category:Events"], "nodes": [{"tag": "h1", "text": "Freedom Day"}, {"tag": "p", "text": "The Freedom Day celebrations were organized on the planet of Naboo following the victory against the Trade Federation's invasion forces in 32 BBY. Back by popular demand, a triumph parade was scheduled to be the high point of those celebrations two days after the decisive battle. Queen Amidala, the Monarch of Naboo, first intended to call off the parade, arguing that the loss of the Jedi Master Qui-Gon Jinn during the conflict demanded mourning rather than revelry. However, the Queen experienced a change of heart after a discussion with Obi-Wan Kenobi, Master Jinn's former apprentice. The triumphal parade moved through the streets of Theed, reaching its endpoint at the steps of the Royal Palace. In addition to the parade, a number of artistic venues of Theed opened their doors to the general public, offering Gungan sling painting perfomances, puppet shows and concerts. For their part, the Gungans organized a funfair in Otoh Gunga, their underwater capital."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 32 BBY, the Trade Federation conducted an illegal blockade of planet Naboo, a member world of the Galactic Republic. The Neimoidian leaders of the Trade Federation sent their droid army to the surface of the planet. With the help of two Jedi Knights, Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi, the two native peoples of the planet, the Naboo and the Gungans, united against the invasion. In effect, two battles were fought simultaneously. While the Gungans confronted the bulk of the droid infantry on the Great Grass Plains, the pilots of the Nabooian Bravo Squadron sought to destroy the Vuutun Palaa, the Federation's control Ship, which commanded the droid army down on Naboo. The victory was sealed when the young Anakin Skywalker unexpectedly landed a N-1 starfighter into the heart of the Control Ship, firing proton torpedoes into its reactor. The resulting explosion destroyed the ship, hereby rendering the mechanized army useless."}, {"tag": "p", "text": "Together, the Naboo resistance had driven the Trade Federation out of their homeland. The Queen of Naboo Padmé Amidala, who had shown heroic conduct throughout the crisis, had formed an newfound alliance with the Gungans represented by Boss Rugor Nass. The victory on Naboo was a major one, but at an enormous cost in lives. No less than 543 Gungans had lost their lives on the battlefield, and Master Qui-Gon Jinn had been killed by the Sith Lord known as Darth Maul while dueling in Theed's plasma Refinery Complex."}, {"tag": "h3", "text": "Preparations"}, {"tag": "p", "text": "In the aftermath of the decisive battle that was fought on the Great Grass Plains, the prison camps built by the Trade Federation were quickly dismantled, and the people of Naboo expected an official time of revelry. Their call was heard, and a triumph parade was planned. However, before anything else could be done, the Queen had to organize a decent funeral for the late Jedi Master Jinn. On the day after the battle, Jinn's body was cremated on a solemn pyre in the Funeral Temple of Theed, a quiet building with an open ceiling. When Queen Amidala attended the funeral ceremony, she was deeply affected; she thought a day of parade would come too soon and would feel inappropriate when a great hero such as Qui-Gon Jinn had died. The Queen then asked the young Obi-Wan Kenobi for advice, confessing she wished to cancel the parade out of respect for the deceased. However, Kenobi comforted the sorrowful queen and told her Master Jinn would have wanted the parade to happen, calling for life to regain its rights over death and sadness. Amidala reconsidered her decision, now committed to let a triumph ceremony take place the day after the funeral."}, {"tag": "h3", "text": "The parade"}, {"tag": "p", "text": "The Grand Army and the Great Municipal Band led by Augara Jowil gathered to form a massive Gungan procession through the streets of Theed. For their part, citizens of the Naboo capital gathered on the sides of the Palace Plaza with arms full of colored ribbons and cut flowers. On the city's grandest square, columns of Gungan warriors and musicians marched through Theed to the sounds of cheering and singing. While marching toward the steps of the Palace, the Great Municipal Band played the first movement of the \"Symponik Nabooalla\"—literally \"the epic for all of Naboo\"—a musical piece composed by Jowil for this event. On the sides, children threw flowers, and the streets were full of laughters. The marching Gungans were led by Boss Nass, who rode a ceremonial falumpaset. Bombad General Jar Jar Binks and Captain Roos Tarpals acted as their Boss' guard of honor, mounting their own kaadu. The old Tarpals had been given a senior position in the parade, which filled him with deserved pride, following his heroic participation in the Battle of the Grassy Plains."}, {"tag": "p", "text": "Queen Amidala stood at the top of the stone steps, with the newly elected Supreme Chancellor Palpatine, the twelve members of the Jedi High Council, Obi-Wan Kenobi and the young Anakin Skywalker. The Queen's own guards, the pilots of the Naboo Space Fighter Corps and a few dignitaries also watched the parade approach from the Palace's steps, in the shadow of the statues of ancient Naboo philosophers. Several members of the Chancellor's Blue Guard also stood at attention."}, {"tag": "p", "text": "The Queen presented her Gungan counterpart with the Globe of Peace, a hallowed Naboo artifact from the days of yore. Nass, who was extremely skilled at public displays, knew how to send an assembly wild with excitement. He turned to the crowds and lifted the Globe in a dramatic gesture, shouting the keyword of the day: \"Peace!\" The assembled Gungans, thrilled with joy, immediately broke columns and started dancing about on the plaza. Whereas some people had initially doubted Amidala's leadership abilities due to her young age, the Queen knew that such distrust had melted away when she gazed at the citizens of Naboo, Humans and Gungans together. The joint victory ceremony between the Gungans and the Naboo was the largest and grandest ever recorded on that planet."}, {"tag": "h3", "text": "The public attractions"}, {"tag": "p", "text": "While the parade itself was meant to represent the formal side of the celebration, popular merry-making was also organized in the streets of Theed and Otoh Gunga, the underwater capital city of the Gungans. In Theed, the entertainment venues of the Coliseum Plaza threw open their doors to visitors. In the city's funnel-shaped Coliseum, a performance of sling painting by the Gungan Sling Brigade was held, to the delight of the crowd. The Theed Music Hall and the Naboo Puppet Theater also offered free spectacles within their fields. Meanwhile, at the Gungan funfair, visitors were invited to dance the deesco with Jar Jar Binks at the \"Deesco Bubble,\" try to dunk Boss Nass in a clear water tank at the \"Dunk Boss Nass Bubble\", or search hidden clams in a water-filled cave with the Jedi Knight Obi-Wan Kenobi—who had accepted to play the game with enthusiasm. Although he was now a Jedi apprentice under the tutelage of Kenobi, the young Anakin Skywalker also enjoyed his share of amusement in the lively streets of Theed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The triumphal parade featured at the end of the 1999 movie Star Wars: Episode I The Phantom Menace was already present in the first version of the script. In this version, the Viceroy of the Trade Federation Nute Gunray and his aide Rune Haako were brought before the Queen, in chains and under the surveillance of Gungan guards. Additionally, Amidala would not offer the Globe of Peace to Rugor Nass, although it was still obvious that the Naboo and Gungans had become allies. While the scene seems like a happy ending, it marks Palpatine's first step toward galactic domination. Accordingly, the cheerful music played by the band was actually a reworking of \"The Emperor's Theme\", a dark vocal piece first heard in Star Wars: Episode VI Return of the Jedi. The video game Star Wars: Episode I The Phantom Menace video game also contains the celebration scene at the end of its last mission, but it utilizes the track \"Hail to the, Winner, Anakin Skywalker\" instead of \"Augie's Great Municipal Band.\""}, {"tag": "p", "text": "Most of the scene was realized in CGI by an Industrial Light & Magic visual effects team under the direction of Scott Squires. The team added many CGI characters and creatures, increased the quantity of colorful confetti and modified the lighting so the parade appeared to take place at sunset."}, {"tag": "p", "text": "In the 2010 book of artworks Star Wars Art: Visions, the American classic painter Allan R. Banks depicted the children of Theed rejoicing during the victory parade. Banks' artwork title was Celebration of Naboo Youth on Freedom Day, which suggests the official name of the victory celebration was \"Freedom Day.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}