{"url": "Freedon_Nadd_Uprising", "categories": ["Category:Legends articles", "Category:Battles of the Freedon Nadd Uprising", "Category:Conflicts involving the Galactic Republic", "Category:Rebellions and uprisings"], "nodes": [{"tag": "h1", "text": "Freedon Nadd Uprising"}, {"tag": "p", "text": "The Freedon Nadd Uprising, also called the Naddist Revolt or the Naddist Uprising, was a series of battles fought during the Old Sith Wars, that occurred on the planet Onderon in 3998 BBY. The Uprising began when, in an attempt to cleanse Onderon of the dark side, the Jedi confiscated the remains of the ancient Sith Lord Freedon Nadd from Onderon's Queen Amanoa."}, {"tag": "p", "text": "During the funeral for Queen Amanoa of Onderon, the Jedi-led procession was interrupted when the Naddists temporarily gained the upper hand by, not only capturing the remains of Freedon Nadd and Amanoa, but also capturing Jedi Master Arca Jeth when they seized control of the city of Iziz. Eventually the Jedi and a fleet of Republic ships were sent to the planet to end the uprising and free Jedi Master Arca Jeth."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Several centuries prior to the conclusion of the Beast Wars, Freedon Nadd, the fallen Jedi turned Sith Lord, had used his knowledge of Sith magic to install himself as leader of the planet Onderon. Based out of the city of Iziz, Nadd's reign was marked by his iron fist and his institution of martial law to help bring the world under his control. During this time, Nadd made the decision that all criminals were to be banished outside the walls of the city where they would be hunted and killed by the predators that roamed free there."}, {"tag": "p", "text": "However, contrary to Nadd's planning, some of them managed to survive and learned to domesticate the predators, eventually building a large force which they then used to attack Nadd and his followers, thus starting an enormous war which engulfed the whole of Onderon. The Beast Wars soon grew out of the control of Freedon Nadd, who was ultimately unable to stop them, thus allowing them to continue well after his death—the war would not end until 4000 BBY."}, {"tag": "p", "text": "Following the events surrounding his death, Freedon Nadd's remains were buried on Onderon beneath the royal palace in Iziz, eventually becoming a focal point of dark side energy to be used and exploited by his descendant's. Approximately six hundred years later, near the end of the Beast Wars, the two brothers Ulic and Cay Qel-Droma, both Jedi students of Jedi Master Arca Jeth, discovered that the Queen of Onderon, a woman named Amanoa, was the descendant of Freedon Nadd and had been using his dark influences to further her own lust for power."}, {"tag": "p", "text": "Eventually, several Jedi, led by Master Jeth, followed Amanoa to the secret location of Freedon Nadd's tomb, where the dark side sorceress was attempting to call up Nadd's spirit for help. Realizing that Amanoa could no longer serve his purposes, Nadd pulled his dark side support from Amanoa, and thus causing her to die. The Beast Wars had effectively come to an end."}, {"tag": "p", "text": "Following the end of the Beast Wars in 3998 BBY, Master Jeth and his Jedi students attempted to move the sarcophagus containing the remains of Freedon Nadd and Queen Amanoa from the capital city Iziz to deprive anyone from any further corruption."}, {"tag": "h3", "text": "The uprising"}, {"tag": "p", "text": "The Naddist Sith cult, attempted to overthrow the pro-Old Republic government of Queen Galia, and her husband, King Oron Kira during the funeral procession. Several hundred Naddists, led by Sith Acolyte Warb Null used an underground war machine to attack the procession. During the battle, the Naddists were able to capture the remains of Freedon Nadd and Queen Amanoa. When they had what they came for they retreated to the sub levels of the city."}, {"tag": "p", "text": "Master Jeth, Ulic Qel-Droma and Queen Galia then searched the sub levels for King Ommin, who was rumored to live there, in search for a way to remove the darkness from the planet. When they found Ommin, Freedon Nadd's spirit appeared and the King revealed that he was the leader of the Naddists. While Qel-Droma fought Warb Null, King Ommin was able to capture Master Jeth and escape. The Jedi and Beast Riders were forced to leave Iziz, they retreated to Fortress Kira."}, {"tag": "p", "text": "Jedi Knight Ulic Qel-Droma was forced to call for assistance, meanwhile King Ommin attempted to turn Master Jeth to the dark side. After receiving Qel-Droma's message, the Galactic Senate's Defense Committee engaged in a heated debate about sending the Republic fleet to Onderon or not. Some of the senators felt that fighting the dark side was a matter for the Jedi, not the Republic. The Tchuukthai Jedi Master Thon managed to convince the senators to come to the Jedi's aid and Republic battlecruisers and troop transports converged on Onderon, together with a team of handpicked Jedi Knights from Ossus."}, {"tag": "p", "text": "Republic rocket-jumpers attacked the Naddists in Iziz while the Jedi Knights Dace Diath, Qrrrl Toq, Shoaneb Culu, Kith Kark, and Nomi Sunrider, who used her Battle meditation against the Naddists, assisted in the defense of Fortress Kira and drove back the Naddists. Kith Kark was killed during the battle, and Nomi was knocked from her feet by the Dark Side, but was unharmed. The Jedi then returned to Iziz to rescue Master Jeth, when they entered Ommin's lair they destroyed several Sith war droids. Cay Qel-Droma lost his droid arm while his brother and Sunrider attacked Ommin, who proved to be a formidable opponent. But the Jedi eventually triumphed when Qel-Droma destroyed Ommin's mechanical exoskeleton and the King fell to the ground like an Arkanian jellyfish. Ommin asked Freedon Nadd's spirit for assistance, but the Sith Lord abandoned the King."}, {"tag": "p", "text": "The arrival of Republic and Jedi reinforcements from Coruscant and Ossus marked a turning of the tide, and the rebellion ended with the death of Ommin at the hands of Ulic Qel Droma. The transfer of corpses was carried out without further incident."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the Naddists were put down, during the revolt two members of the Keto family, Satal and Aleema, arrived on Onderon and gained valuable Sith knowledge, texts and artifacts from Nadd's spirit and Ommin. They would use those materials in the establishment of the Krath cult."}, {"tag": "h2", "text": "Battles"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}