{"url": "Freighter_tramper", "categories": ["Category:Canon articles", "Category:Occupations"], "nodes": [{"tag": "h1", "text": "Freighter tramper"}, {"tag": "p", "text": "Freighter trampers, or just trampers, were terms used to describe the economic migrants who felt they had no choice but to leave their homes on the planet Coruscant to search for work elsewhere due to the economic impact on Coruscant caused by the Separatist Crisis, making them some of the first victims of the Clone Wars that followed. Trampers came from many different species and professions, including talented artisans and technicians, being united only by the harsh reality in which they found themselves. They hopped from one job to another on different planets and when promised work failed to materialize some freighter trampers found themselves constantly on the move, causing their once-pristine work gear to become more and more battered and improvised over time."}, {"tag": "p", "text": "AA-9 Freighter-Liners that were refitted to transport refugees displaced by the Separatist Crisis off of Corsucant became an economic life line for freighter trampers, who would travel alongside the refugees, huddled together carrying what little owned and dreaming of a better life. In 22 BBY, several freighter trampers, including Gondrin Upal, Kaycee Kollenz, Nar Hida, and a group of Donovian rainmen, traveled on the AA-9 freighter Jendirian Valley from Westport on the planet Coruscant to the planet Naboo. Senator Padmé Amidala and Anakin Skywalker also traveled onboard the vessel, disguised as refugee freighter trampers from the Thousand Moon system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Freighter trampers first appeared in the 2002 prequel trilogy film, Star Wars: Episode II Attack of the Clones. In the current Star Wars canon the term was first used in the \"Starship Fact File\" department of the 2015 magazine Star Wars: Build the Millennium Falcon 50, which was written by Tim Veekhoven. It originated in the Star Wars Legends continuity, where it was first mentioned in the 2002 reference book Star Wars: Attack of the Clones: The Visual Dictionary, which was written by David West Reynolds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}