{"url": "Fresia/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Fresia locations", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Torranix sector planets", "Category:Type I atmosphere planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Fresia"}, {"tag": "p", "text": "Fresia was a Core World that served as headquarters for Incom Corporation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Fresia was the second planet from the star Fre'ji in the Fre'ji system of the Torranix sector in the Core Worlds region of the galaxy. Located between Galand and Cal-Seti on the hyperlane known as the Agricultural Circuit, it was a terrestrial world 10,308 kilometers in diameter, with a breathable atmosphere and standard gravity. As a result of extremely slow axial rotation, Fresia's day lasted 528 standard hours, while its year lasted 132 standard days."}, {"tag": "p", "text": "Fresia had seven moons, which produced complex and extreme tidal cycles. The world's climate was temperate but varied wildly, with violent storms occurring often, and its mean temperature was cool. The planet featured oceans, and its terrain included rocky islands and fractured archipelagoes. Fresia featured an abundance of indigenous wildlife, including the Coromon headhunter, but reptiles and amphibians were rare due to the climate."}, {"tag": "p", "text": "The world served as the headquarters of Incom Corporation. The Galactic Empire brought in many nonhuman slaves to work for nationalized Incom, most of whom lived on the Coromon Islands."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Some time before 3650 BBY Fresia made starships, namely shuttles. Shigar Konshi parent's were killed in a Fresian shuttle when a vacuum seal malfunctioned."}, {"tag": "p", "text": "Fresia was an uninhabited planet when investors purchased it in 2000 BBY. The Galactic Empire occupied Fresia shortly after Incom completed the first prototypes of the X-wing starfighter. Due to the high concentration of aquatic environments on Fresia, the Empire maintained a platoon of aquatic stormtroopers on the planet."}, {"tag": "p", "text": "Early in the Galactic Civil War, the X-wing prototypes were held there by Incom and, according to instructions by Incom, the newly-formed Alliance to Restore the Republic carried out an operation in order to obtain them led by Raymus Antilles. After the battle, Captain Raymus Antilles wanted to liberate Fresia and rid it of Imperial control. However, Mon Mothma countermanded this decision, stating that it would present too much of a target to the Empire and endanger the citizens of Fresia."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Fresia lacked a native sentient species. Humans comprised 96% of the planet's population of 2.3 million, which made it one of the least-populated habitable Core Worlds. The exceptional length of Fresia's days and nights affected the mood of its inhabitants dramatically."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}