{"url": "Friends_and_Enemies", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Friends and Enemies"}, {"tag": "p", "text": "\"Friends and Enemies\" is the sixteenth episode of the Star Wars: The Clone Wars television series' fourth season. This is the second episode in a four-part storyline about Obi-Wan Kenobi's undercover story to unveil the assassination plot against Chancellor Palpatine, which began with the previous episode \"Deception.\" It aired on January 27, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Fleeing across the galaxy with criminal fugitives, a disguised Obi-Wan, Cad Bane, and Moralo Eval are tenaciously pursued by Anakin and Ahsoka, who have no idea they're chasing their friend.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After eluding immediate Republic pursuit, \"Rako Hardeen\" (still Obi-Wan Kenobi in disguise) crash-lands the ship in the swamps of Nal Hutta to further throw any pursuers off their tracks, and he, Moralo Eval and Cad Bane proceed to the Bilbousa Bazaar to purchase new equipment and a ship. During their shopping trip, however, Bane treats the Rodian owner of a local pawnshop, Pablo, very roughly by nearly killing him with a toothpick when he can't keep his mouth shut. Subsequently, in order to avoid attracting undue attention, Bane sends Kenobi to buy a new ship while he and Eval procure some weapons."}, {"tag": "p", "text": "Once the deal is complete, however, Bane abandons Obi-Wan to the local authorities, who were alerted by Pablo's assistant, since he still does not trust him. But Obi-Wan, anticipating betrayal, had previously attached a homing beacon to the ship's hull, and when questioned by the Hutt's henchmen, he reveals the tracking frequency and, while the guards proceed to shoot down the ship, escapes the dungeon. After contacting Yoda and Mace Windu and asking them to lift the manhunt in order to allow them free movement and provide some money for a new ship, Obi-Wan is rejoined by Eval and and an irate Bane, who have only barely escaped the Hutt's forces, just in time to present them with their new ship."}, {"tag": "p", "text": "In the meantime, on Coruscant, Palpatine is asked by Mace Windu to rescind the hunt for the fugitives. However, Anakin, who is visiting the Chancellor and is still unaware of the secret mission, does not take this decision well, and Palpatine exploits this by deliberately sending him and Ahsoka to Nal Hutta. After some brutal questioning of the locals on Anakin's part, the two Jedi learn about the next likely whereabouts of the fugitives' ship, since the ship seller decided to fuel up the ship only just enough to force them to seek out his brother's refueling station on Orondia. After spotting their quarry as they prepare to leave, Anakin decides to ram the ship into submission and board it in midflight, but is foiled by Bane and a subsequent crash-landing of both parties during their furious chase through a local fuel-processing facility."}, {"tag": "p", "text": "Obi-Wan leaves the ship to tell Anakin the truth behind the matter, but is almost killed when his friend attacks him in a rage. Bane snares Anakin and prepares to kill him, but fails, and in the ensuing struggle, Obi-Wan ends up wrestling with Anakin and addressing him by name before Anakin loses consciousness. Ahsoka arrives just when Bane prepares to finish off Anakin, but with her master unconscious and the fugitives' ship still operational, she cannot prevent the three from escaping. But as Anakin awakes soon afterwards, he relates his discovery that Obi-Wan is still alive and undercover, and decides to find out the reason for this. At the same time, Yoda and Windu learn from Palpatine that he has sent Anakin after the fugitives, and so the two Jedi Masters decide to reveal the truth to Skywalker, lest he endanger the mission or end up even worse..."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The helmet of Obi-Wan's disguise is a recolored version of an early concept drawing for the helmet of Boba Fett."}, {"tag": "p", "text": "When Cad Bane, Eval and Obi-Wan are in Pablo's shop, a Phase I clone trooper helmet can briefly be seen with other equipment."}, {"tag": "p", "text": "When Cad Bane is looking for a new hat, he briefly considers Indiana Jones' iconic fedora."}, {"tag": "p", "text": "When Obi Wan asks to be freed after giving the tracking frequency on Eval´s ship, the hunchmen answers: \"The deal has changed\", paying homage to Darth Vader on The Empire Strikes Back."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}