{"url": "Friendship_motif", "categories": ["Category:Real-world articles", "Category:Articles with conjectural titles", "Category:Real world music stubs", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Friendship motif"}, {"tag": "p", "text": "A friendship motif was written by John Williams for the 2019 film Star Wars: Episode IX The Rise of Skywalker. The leitmotif features alongside the victory motif in the track The Rise of Skywalker in the film's soundtrack, with both motifs being in major key. The friendship motif is played in the tracks \"The Rise of Skywalker\" as well as \"To Kijimi.\""}, {"tag": "p", "text": "The motif is used in The LEGO Star Wars Holiday Special, which was scored by Michael Kramer and released in 2020. In the first scene, when Yoda begins to narrate, Williams' friendship motif is combined with Kramer's new connection motif—which represents the bonds formed between sentients and the celebration of such life, Life Day, as well as the key that enabled travel through time and space. Where the two are played in succession, the connection motif is played preceding the frienship motif. The two motifs are played when Rey Skywalker speaks of her intentions to travel to Kordoku to help with the training of her friend, Finn, and when Jedi Master Yoda teaches Rey Skywalker to be mindful of her connections with others, showing visions of the past of a master and an apprentice being not only learners in the Force, but also friends—the most important thing. The two motifs are played again for when Rey Skywalker creates a portal through time and space without the use of the key, and again when Rey Skywalker and Luke Skywalker part ways aboard the second Death Star after defeating the Sith together by adhering to the Jedi tenet of letting go. The two motifs are again played combined in the final scene of the Holiday Special, when Yoda narrates that Life Day was a time of joy—friendship and family—as celebrants gather together in a circle in the day of life, before transitioning into the end credits."}]}