{"url": "Friends_of_the_Republic", "categories": ["Category:Legends articles", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Friends of the Republic"}, {"tag": "p", "text": "The Friends of the Republic were a group of individuals dedicated to the preservation of the ideals of the Galactic Republic, which many believed had begun to crumble in the wake of the Clone Wars."}, {"tag": "h2", "text": "Alderaanian Negotiations with Chandrila"}, {"tag": "p", "text": "One year prior to the First Battle of Geonosis, the Friends of the Republic contacted Senator Bail Organa when the government of Alderaan had entered negotiations with Chandrila for a joint mining venture on Aridus. Bail's wife, Breha Antilles Organa, had several connections with the Corporate Sector via her family, and some of those connections were involved in the project, which it appeared would have been successful. The information provided by the Friends of the Republic helped avert a diplomatic and humanitarian disaster that would have engulfed not only Alderaan and Chandrila, but the rest of the Republic, as well."}, {"tag": "p", "text": "The negotiations that followed occurred on such a lofty political scale that not even the Jedi Order was informed of the proceedings."}, {"tag": "h2", "text": "Mission to Zigoola"}, {"tag": "p", "text": "During the Clone Wars the Friends of the Republic contacted Senator Bail Organa, warning him of a potential Sith assault on the Jedi Order and a dangerous temple on Zigoola. Using fellow Senator Padmé Amidala as a go-between, Organa used the information to get in touch with Jedi Master Obi-Wan Kenobi, who accompanied the Senator on an arduous mission, which ended in the destruction of the temple and all of its Sith artifacts."}, {"tag": "h2", "text": "Contact and Communication"}, {"tag": "p", "text": "In order to preserve their secret status, the Friends of the Republic possessed a complex and cautious method of conveying information to their contacts. Contacts were provided with a small comlink that they were to keep on their person at all times. When the Friends wished to reach an individual possessing one of their comlinks, they simply contacted them through that comlink. The relayed message was channeled through a worn and battered datareader, internally fitted with extremely advanced communication equipment. The message is then run through the datareader, and the receiver uses a code, which they have committed to memory, to translate the transmission."}, {"tag": "h2", "text": "Appearances"}]}