{"url": "Frigate/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Incomplete lists", "Category:Capital ship classifications", "Category:Frigate classes", "Category:Frigates"], "nodes": [{"tag": "h1", "text": "Frigate"}, {"tag": "p", "text": "A frigate was a type of military spaceship. Recorded usage of the term varied extensively, but it typically denoted a capital ship designed to serve in a skirmishing role to protect larger ships, or more generally, a ship designed to serve in a support role. Frigates lacked maneuverability in battle, although some were armed with weaponry and carried starfighters."}, {"tag": "h2", "text": "Standard designation"}, {"tag": "p", "text": "According to the standard system of ship-classifications, a frigate was a ship with a crew of between 200 and 1,000 beings, and an approximate size of 200-400m long, defined by the maximum size of smaller system patrol craft and the minimum size of larger cruisers. This was the definition that was officially used by the Old Republic, the Galactic Empire, the Alliance to Restore the Republic, and the New Republic, although formal exceptions were made for ships like the heavily-armed 350m Carrack-class light cruiser, and many other classification systems were used simultaneously throughout the galaxy."}, {"tag": "p", "text": "Frigates were armed to defend themselves effectively against smaller and more maneuverable warships, and with a limited attack capacity against larger capital ships; they could sometimes carry up to three squadrons of starfighters, and were often deployed in small groups to protect larger vessels."}, {"tag": "p", "text": "Some frigate types, like the anti-starfighter Lancer design, were specifically designed to support larger warships, but others were intended primarily to defend unarmed freighters and transports, including the most famous frigate type of the Galactic Civil War, the Nebulon-B escort frigate."}, {"tag": "p", "text": "The escort frigate was designed by the Empire to combat Rebel \"piracy,\" with the dual role of protecting Imperial transport ships and hunting down Alliance forces; but captured ships also came to be used extensively by the Rebellion against Imperial Forces during the Galactic Civil War, where they were used as raiders, and as screening vessels within combat squadrons."}, {"tag": "p", "text": "Escort frigates had a stark, stripped-down hull form, not particularly fast or maneuverable, but carrying a typical frigate armament and two squadrons of TIE Fighters. However, because they were designed to operate independently of larger capital ships, they were also equipped with powerful HoloNet transmitters and impressive command facilities, and this led to them becoming popular as command ships for squadrons containing more powerful warships. On both sides of the war, escort frigates are recorded as the flagships of task forces containing ships as large as 600m heavy cruisers."}, {"tag": "p", "text": "On one side or the other, escort frigates saw action in countless engagements throughout the Galactic Civil War, and they were still in use during the Yuuzhan Vong War and the Corellian secession crisis."}, {"tag": "p", "text": "Although primarily designed for a combat role, frigate-sized warships could be adapted to carry out a wide variety of duties. Some types, such as the Imperial Navy's Star Galleon, were purpose-designed as armed cargo ships, while others were modified for cargo duty as military transports. Some Nebulon-B frigates were also known to have been converted into hospital ships, such as the one that Luke Skywalker was treated on after having lost his hand in dueling Darth Vader; these ships were known as Medical Frigates, although this term was also applied to ships that in no way conformed to the standard definition of a combat frigate—a reminder that there were many ships in the Galaxy which were described as frigates even though they fell outside the standard designation."}, {"tag": "h2", "text": "Other types of frigates"}, {"tag": "p", "text": "Historically, space frigates evolved from aquatic war vessels called Frigates. Their purpose was to protect aquatic transports from the Destroyer warships."}, {"tag": "p", "text": "Ships described as \"medical frigates\" range from the thirty-meter Sprint-class rescue craft to the two-kilometer hospital ship Mercy, and a \"winged\" variant of the MC80 Star Cruiser, probably the same type as the Liberty, which must have been at least 1200m long."}, {"tag": "p", "text": "Other small frigates are known, such as the 35m Imperial Customs Frigate and the 150m Interceptor-class frigate, an adaptation of a civilian design; but the term was in rather more widespread use as a designation for relatively large ships that would be designated as cruisers under the standard system, such as later variants of the Acclamator-class assault ship."}, {"tag": "p", "text": "Some ships in larger size brackets are called frigates rather than cruisers. The 825m Munificent-class star frigates were designed around high-powered HoloNet transceivers to ensure secure interstellar communications for the InterGalactic Banking Clan, but came to be used as combat warships by the Confederacy of Independent Systems during the Clone Wars. The Rebel Alliance rebuilt 600m Dreadnaught-class heavy cruisers as Assault Frigates, powerful, brawling combat warships that remained in use for many years under the New Republic."}, {"tag": "p", "text": "Apart from large hospital ships, the largest ship to be described as a \"frigate\" is probably the Home One, used as the fleet flagship of the Alliance and New Republic by Admiral Gial Ackbar, which was widely known as the Headquarters Frigate. It is possible that other large command ships were also described as headquarters frigates, but no definite references are known."}, {"tag": "p", "text": "Whilst not a specific frigate type of ship the Derriphan-class battleship was later used by Darth Revan's/Darth Malak's Sith Empire as a frigate analogue, due to its speed and size."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In origin, the term \"frigate\" referred to a fast, long-hulled sailing warship. In the seventeenth century, the term could be applied to even the most powerful battleships, like the Sovereign, but in the eighteenth and nineteenth centuries, it came to denote less powerful ships which carried their main guns along a single gun deck, rather than in multiple tiers like a ship of the line. The classic frigates of the age of sail served as cruisers, capable of scouting and raiding ahead of a battlefleet, or carrying out long-range operations on their own. In the late eighteenth century, big frigates began to appear which were about as large and as heavily armed as small ships of the line, although they were mostly designed as very large cruisers, and kept out of the line of battle."}, {"tag": "p", "text": "The earliest seagoing ironclads, which entered service around 1860, were based on the wooden frigate design, as the old ship-of-the-line with its multiple gun decks was generally seen as too top-heavy for adaptation as an armored warship. The first ironclad, La Gloire, launched in 1859, was a wooden ship-of-the-line redesigned with iron armor and a single main gun deck, but HMS Warrior in 1860 was designed from the outset as an armored iron frigate. This type of frigate was the most powerful warship of its day, and developed rapidly into the steam-powered, steel-hulled battleship, but the term \"frigate\" quickly passed out of use as changes in armament and technology rendered the old classifications obsolete."}, {"tag": "p", "text": "In 1941, the British Royal Navy revived the name of \"frigate\" for a class of anti-submarine warship, larger than the corvettes, but, in a reversal of the historical pre-1860 usage, smaller than sloops; the United States Navy generally called ships of this type destroyer escorts, but the British-influenced Tacoma-class were designated as \"patrol frigates\". The key distinction from contemporary destroyers was that frigates, with a more defensive role, required less powerful and complex engines."}, {"tag": "p", "text": "In 1950, both the British and Americans revised their designations, but whereas the RN reclassified all its escorts as frigates, the United States Navy renamed them as \"ocean escorts\", and adopted the term frigate instead for larger and faster cruiser-sized warships with destroyer leader hull-numbers, harking back to the exceptionally large frigates which had been the centerpiece of the early US Navy in the age of sail."}, {"tag": "p", "text": "The discrepancy was ended in 1975, when the USN redesignated its large frigates as cruisers, and the ocean escorts were renamed as frigates. Today, there is a general agreement that frigates should be smaller than destroyers, and perhaps specifically tasked with an anti-submarine role, but whether a ship is designated as a frigate or a destroyer often depends on the subjective decisions of the naval architects, uniformed officers and politicians involved."}, {"tag": "p", "text": "The \"standard\" usage of the frigate designation in Star Wars combines elements of the historical cruiser role with the modern picket concept; larger \"frigates\" have more in common with ironclad frigates and the 1950-1975 USN usage, although they could also be seen as \"small\" ships in terms of a designation system which restricts designations such as \"dreadnaught\" to multi-kilometer cruisers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}