{"url": "Frija_Torlock", "categories": ["Category:Legends articles", "Category:Agents of the Galactic Empire", "Category:Corulag residents", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Frija Torlock"}, {"tag": "p", "text": "Frija Torlock was the daughter of Imperial Governor Lexhannen Torlock, and part of a two-pronged conspiracy to take control of the Imperial world of Corulag."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Frija was secretly dating Admiral Droon and was able to convince him to help her seize control of Corulag. Their plan was to incriminate Governor Torlock as a traitor so that he would be removed from power. The removal of Torlock would allow Droon to take the Governor's seat."}, {"tag": "p", "text": "However, the plan was found out by Governor Torlock and he made plans to flee Corulag. He was able to escape but not before he activated two Human replica droids disguised as himself and his daughter. Admiral Droon's men eventually captured the droid replica of Torlock, but quickly realized that the real Torlock had escaped. Interrogating the droid, they also learned of the droid copy of Frija. Frija was concerned about her droid counterpart and ordered that Droon dismantle the droid. To do this, Droon hired Black Sun assassins to destroy both droids and make it appear as though the Rebellion was to blame. Droon believed that the ruse would throw off all suspicion as to the whereabouts of the real Torlock and leave him free to take the Governor's spot."}, {"tag": "p", "text": "However, Frija and Droon did not count on the interference of Darth Vader and his agent, Wrenga Jixton. Jix infiltrated the base and discovered the plan. After a runabout in which Droon tried to destroy all evidence and Jix as well, Jix escaped Imperial clutches and confronted the traitorous pair. In the final showdown, Droon tried to blame the entire plan on Frija. In retaliation Frija grabbed a blaster and tried to shoot her backstabbing lover. Jix was too fast for her and shot her in the chest. Jix captured Droon and presented him to Vader. Meanwhile, Frija's replica droid escaped with her \"father\" and the two made their way to the remote world of Hoth."}, {"tag": "p", "text": "After the Battle of Endor, the Mind-witch S'ybll used an illusion of Frija to trap Luke Skywalker on the planet Tarnoonga. Skywalker eventually realized the truth and the illusion was dropped. The mind-witch wanted to propose an alliance with the nascent Jedi Knight to overthrow the Emperor. When Skywalker refused, he was forced to kill the witch."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}