{"url": "Friz_Harammel", "categories": ["Category:Legends articles", "Category:Cities on Genarius"], "nodes": [{"tag": "h1", "text": "Friz Harammel"}, {"tag": "p", "text": "Friz Harammel was a floating city on the gas giant Genarius. It was the first successful city constructed on the planet. It was one of about a dozen gas mining complexes built around the galaxy at the same time. The mix of gases within Genarius made Friz Harammel one of the most profitable."}, {"tag": "p", "text": "Friz Harammel was built and owned by Daedalus Gas Mines. Daedalus's board of directors initially balked at the idea because the Cularin system was a complete economic unknown at the time. Several cities had already failed on Genarius, most notably Nub Saar. The Daedala family perservered, and finally convinced their investors to go ahead with the project. DGM's projections showed that even a small yield would allow the company to break even, and they could turn a profit if they could survive a year mining the minimum of key gases. The investors insisted on a hefty penalty from DGM should the project fail."}, {"tag": "p", "text": "The plan for mining Genarius required special ships—AR-25 Bubbleship transports and VA-13 Sweepers. Friz Harammel survived that first year, and to the great surprise of many, it was hugely profitable success. Friz Harammel proved to others that floating cities on Genarius could work, after all, and soon other cities were constructed."}, {"tag": "p", "text": "The Daedalas, a Twi'lek family, hired almost one hundred Twi'lek engineers, including Hid Toqema to work in Friz Harammel gas mines to appeal a cultural movement of Korbin."}, {"tag": "p", "text": "The number of storms Genarius had increased since the start of Daedalus operations. There were concerns about the gas mines removing many of the stabilizing elements from the atmosphere of Genarius, and thus causing the storms."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}