{"url": "From_Trenches_to_Wrenches:_The_Roger_Story", "categories": ["Category:Canon articles", "Category:Stub", "Category:Journals and memoirs"], "nodes": [{"tag": "h1", "text": "From Trenches to Wrenches: The Roger Story"}, {"tag": "p", "text": "From Trenches to Wrenches: The Roger Story was a memoir written by the B1-series battle droid Roger, who worked for the Freemakers, a family of scavengers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "LEGO Star Wars"}, {"tag": "p", "text": "It was considered by Wick Cooper, a Freemaker customer, to be tedious and boring. According to Roger, it was for sale on the Holonet for \"an extremely reasonable price.\" The book consisted of at least 482 chapters."}, {"tag": "p", "text": "The first chapter began with Roger's creation at the Geonosian droid factories followed by his subsequent service during the Battle of Naboo and the Clone Wars. In Chapter 18, Roger and his master Pace Freemaker escaped Dathomir on an Ugly. In Chapter 48, Roger encountered Rebel alliance operatives K-2SO and Cassian Andor while picking up some 30 weight oil. In Chapter 129, Roger was kidnapped by several Jawas, but escaped during a job to service Ben Quadinaross podracer."}, {"tag": "p", "text": "In Chapter 202, Roger and Chopper rescued several decommissioned droids being sent to be melted down by the Galactic Empire. In Chapter 299, Roger learned about persistence from a young Ewok. In Chapter 317, Roger accidentally wreaked havoc in Takodana Castle when he lost control of his rocket pack. In Chapter 482, Roger helped the Freemakers repair Lieutenant Valeria's T-47 airspeeder during the Battle of Jakku. These chapters are told as flashbacks in eight short episodes, which were later compiled as the LEGO Star Wars: All-Stars episode \"From Trenches to Wrenches\", which premiered on November 10, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}