{"url": "From_World_War_to_Star_Wars", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Star Wars Blog"], "nodes": [{"tag": "h1", "text": "From World War to Star Wars"}, {"tag": "p", "text": "From World War to Star Wars is a blog series written by Cole Horton, inspired by his World War II and Star Wars comparison presentation at Celebration Europe II."}, {"tag": "p", "text": "The first part compared general elements of Star Wars with those of World War II."}, {"tag": "p", "text": "The second part compared the Millennium Falcon with various World War II planes, specifically the B-17 Superfortress."}, {"tag": "p", "text": "The third part cited events from World War II and compared them to Star Wars: The Clone Wars."}, {"tag": "p", "text": "The fourth part compared submarine warfare with the events of The Clone Wars episode Cat and Mouse."}, {"tag": "p", "text": "The fifth part compared the pink astromech droids R2-KT and QT-KT to the pink-colored reconnaissance fighters used by the British Royal Navy."}, {"tag": "p", "text": "The sixth part compared the events of the hunt and destruction of the German battleship Wikipedia:Bismarck with that of the Malevolence story arc from The Clone Wars."}, {"tag": "p", "text": "The seventh part compared the events of the Declaration of a New Order and Palpatine's rise to power to that of Adolf Hitler's rise to power."}, {"tag": "p", "text": "The eighth part compared the various uniforms and methods of Nazi officers to that of the Imperial officers."}, {"tag": "p", "text": "The ninth part compared the Wikipedia:B-17 bomber jet to that of the Ghost from Star Wars: Rebels."}, {"tag": "p", "text": "The tenth part compared the Stormtroopers to their namesake German special forces."}, {"tag": "p", "text": "The eleventh part revealed how several props for the various films in the original trilogy, including the makeup of the Lars' Family Speeder, the Death Star's superlaser, items at the Mos Eisley Cantina, IG-88, Obi-Wan's lightsaber, and the Millennium Falcon were derived from the retired and dismantled World War II plane Gloster Meteor."}, {"tag": "p", "text": "The twelfth part compared World War II-era propaganda to that used in Star Wars."}, {"tag": "p", "text": "The thirteenth part compared the Tarkintowns in Star Wars: Rebels to that of Hoovervilles during the Great Depression."}, {"tag": "p", "text": "The fourteenth part compared the various Bars, Cafes and Cantinas from World War II to those used in the Star Wars franchise."}, {"tag": "p", "text": "The fifteenth part announced that it was returning for Star Wars Celebration 2015."}, {"tag": "p", "text": "The sixteenth part discussed similarities between the Battle of Yavin to the turning point of the Pacific Theater on May 4, 1942, that date's influence on George Lucas and Star Wars, as well as the similarities between Return of the Jedi and the liberation of Denmark and the Netherlands from Nazi Germany on the same day of 1945, coincidentally the same date as May the 4th."}, {"tag": "p", "text": "The seventeenth part discussed the similarities between World War II-era dogfights and starfighter combat."}, {"tag": "p", "text": "The eighteenth part discussed the connection between World War II-era propaganda comics such as Captain America and Star Wars."}, {"tag": "p", "text": "The nineteenth part discussed the similarities to World War II-era nightclubs to the Cantina from Episode IV."}, {"tag": "p", "text": "The twentieth part discussed how Erich Wolfgang Korngold's musical score inspired John Williams' score for Star Wars."}, {"tag": "p", "text": "The twenty-first part discussed how several weapons from the Star Wars were derived from actual World War II-era weapons."}, {"tag": "h2", "text": "Sources"}]}