{"url": "Frong", "categories": ["Category:Canon articles", "Category:Frong", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Frong"}, {"tag": "p", "text": "The Frong were a species hailing from a planet of the same name. Tightly-knit and clannish, the Frong had little to offer the galaxy, although looked to the New Republic and criminal organizations such as Black Sun and the Red Key Raiders for protection during the events leading to the Battle of Jakku."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Frong had face-tubules which trembled and twitched in stressful situations, and curled inwards with fear. They had big, glossy black eyes, and long, blue forearms lined with contracting suckers. The species was capable of speaking Galactic Basic Standard."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Frong hailed from the planet Frong, located in a fringe star system orbiting a dim star in the Outer Rim Territories. The species was insular and clannish, and remained tightly-knit through bloodlines that verged on the incestuous. The Frong became intimately familiar with concepts such as shame and exile."}, {"tag": "p", "text": "The Frong had little to offer the wider galaxy except for fruit, spice, and clean water. The species had no navy or defense fleet, and looked to governments such as the New Republic for protection."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Senator Rethalow represented his homeworld in the Galactic Senate of the New Republic during the lead-up to the Battle of Jakku. He entered into a trade deal with Black Sun and the Red Key Raiders, giving over his vote in the decision to attack the Galactic Empire at Jakku in order to protect his people. He was kidnapped from a deprivation chamber in Quarrow's poma-club by Jom Barell, and interrogated aboard the Millennium Falcon by Sinjir Rath Velus and his cohorts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}