{"url": "Front_Runners", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Front Runners"}, {"tag": "p", "text": "\"Front Runners\" is the third episode of the Star Wars: The Clone Wars television series' fifth season. It aired on October 13, 2012."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Supervised by Ahsoka, the Onderon rebels infiltrate the capital and carry out a series of strikes on targets throughout the city. As the Separatist-aligned king comes under increasing pressure to deal with the growing rebellion, the rebels choose a new leader.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Onderon rebels, under the supervision of the Jedi Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, and clone trooper Rex, have begun striking at the Separatist droid forces in Iziz, wrecking them in droves while taking painstaking care not to endanger innocent civilians, and inching their way closer to the Unifar Temple with each step. Seeing this as a direct threat on his life and position, Sanjay Rash, the usurper King of Onderon, has his predecessor Ramsis Dendup brought from the palace dungeons, self-indulgently accusing him of having caused this uprising. Dendup argues that this was triggered by Rash's submission to the Separatists, and that only he - as the acting king - has the power to end this, by first ending the droid occupation."}, {"tag": "p", "text": "Meanwhile, the Jedi and rebels gather in a safehouse to discuss their strategies for the near future. While the rebels and Anakin are confident, Obi-Wan cautions them by noting that the attacks have left the populace fearful of them, and Lux and Steela agree that the rebels must win their people's trust first. Following this, Anakin, Obi-Wan, and Rex decide to return to Coruscant and report to the Jedi High Council, while Ahsoka stays behind as an advisor and supervisor so that the rebels will learn to continue the struggle on their own feet, albeit with further material support from the Republic."}, {"tag": "p", "text": "In order to win the confidence of the Onderon people, Lux suggests attacking the city's main power station in order to prevent the droids from recharging and thus deal the occupation army a crippling blow. In order to obtain information for the attack, Saw ambushes a battle droid straggler and takes off its head, which he downloads the defense formations at the station. After finding the defenses too heavy to risk a direct assault, the rebel leaders devise a plan to harass the droids so much that they call in heavy reinforcements, then use a hijacked tank to blow up the facility."}, {"tag": "p", "text": "The rebels execute an ambush on a droid patrol inside the city, giving them just enough opportunity to request backup before they destroy the last of them. The first wave consists of two Droidekas, but these are brought down by the combined efforts of Lux, Saw and Steela. The next group includes the much-wanted tank, and while Steela takes out the droid escort with precise sniper fire, Lux and Saw succeed in bringing down the tank's droid crew without damaging their prize. But during their attempts to get the tank back into operation, tensions begin to ensue between Lux and Steela against Saw, who is still playing on his ego."}, {"tag": "p", "text": "Before the group approaches the generator, Steela and Ahsoka separate from Lux and Saw to draw away the droid guards' attention, and the tank successfully penetrates the generator's defense perimeter. Although hampered by a squad of commando droids, they succeed in destroying the generator, causing a major power outage in the city. Under the cover of darkness, the rebels begin to target every droid unit they find within the city, winning the citizens' adoration and support. During their celebration in their safehouse, Ahsoka becomes once more painfully aware of the attraction that seems to arise between Lux and Steela, but Anakin, who attends the celebration along with Obi-Wan and Rex via holographic projection, both gives her moral support and reminds her to put the purpose before her personal feelings."}, {"tag": "p", "text": "Then the Jedi address the rebels, warning them of the retribution Count Dooku will surely let follow against them, and in order to present the Onderon people with an idol they can rally to, they propose that the rebels elect a leader from their ranks. Following a brief discussion about their plans for the immediate future, the lower rebel ranks unanimously elect Steela as their leader, much to Saw's resentment. In the meantime, a distraught Rash must give his report to Dooku, who agrees to send more and better droid reinforcements, but also a more capable general, Kalani, to deal with the uprising."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}