{"url": "Frontier_Justice", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Galactic Republic starships", "Category:Jedi starships", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Frontier Justice"}, {"tag": "p", "text": "The Frontier Justice was a starship captained by a Jedi Knight who was personally selected by Supreme Chancellor Leontyne Saresh. The Jedi was given an order to recall Colonel Jace Malcom from the planet Kalandis Seven, where the soldier was fighting on the front lines of the Galactic War between the Galactic Republic and the resurgent Sith Empire, and the Knight was assigned the Frontier Justice as a transport to bring Malcom back to the Core Worlds. The Jedi flew the Frontier Justice and battled through half a dozen blockades to reach the Kalandis system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Frontier Justice was a Jedi starship equipped with a hyperdrive, a cockpit, and a spartan barracks that doubled as personal guest quarters with a cot."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Frontier Justice was given as a transport to a male Jedi Knight in 3640 BBY. The Jedi had been ordered by Supreme Chancellor Leontyne Saresh to recall Colonel Jace Malcom of the Republic Special Forces Division from the planet Kalandis Seven, where Malcom was fighting in the Galactic War between the Galactic Republic and the resurgent Sith Empire, and transport him back to the Core Worlds. The Jedi Knight flew the Frontier Justice and had to battle through six blockades to arrive at Kalandis Seven on schedule. After collecting his passenger, the Knight set in their destination and proceeded to repair the ship's damaged engineering console, which had sustained damaged at some point."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Frontier Justice was first mentioned, albeit indirectly, in author Pablo Hidalgo's reference book The Essential Reader's Companion, which was released on October 2, 2012. The ship first appeared and was identified as the Frontier Justice in Alexander Freed's short story, The Last Battle of Colonel Jace Malcom, which was published in Star Wars Insider 137 and was released on October 23, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}