{"url": "181st_Imperial_Fighter_Wing", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Imperial fighter wings"], "nodes": [{"tag": "h1", "text": "181st Imperial Fighter Wing"}, {"tag": "p", "text": "The 181st Imperial Fighter Wing was a fighter wing of the Galactic Empire's Imperial Starfighter Corps. The group was known for the red stripes that adorned their starfighters, a menacing display to their victims that inspired fellow Imperial squadrons to adopt similar designs."}, {"tag": "p", "text": "At some point before the Dissolution of the Imperial Senate in 0 BBY, a member of the senatorial body advocated for the 181st to execute a raid on the Alliance to Restore the Republic. The mission proved to be disastrous, with the wing losing at least two men, including Hedrian, the younger brother of fellow TIE fighter pilot Havina Vonreg. She held the senator accountable for her brothers' deaths just as much she did the rebels. Around 4 ABY, the pilot later mentioned the doomed mission to another member of her own starfighter unit, Titan Squadron."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 181st Fighter Wing was mentioned in the current Star Wars canon continuity in the 2020 video game Star Wars: Squadrons, developed by Motive Studios. The \"Ashen Cardinal,\" a paint job based on the wing's signature red stripes, is available as a \"Rare\" skin for the Imperial faction's starfighters in multiplayer modes. It can be unlocked by spending 400 Glory, one of the game's currencies."}, {"tag": "p", "text": "The 181st Imperial Fighter Wing first debuted in the Star Wars Legends continuity through the 1997 comic X-Wing Rogue Squadron 21, written by Michael A. Stackpole. In Legends, they were notably portrayed as an elite Imperial TIE/IN interceptor unit known as the 181st Imperial Fighter Group, commanded by Baron of the Empire Colonel Soontir Fel. The group was also led at different points by Colonel Evir Derricote and General Turr Phennir. The trademark bloodstripes that donned the unit's TIE Interceptors were awarded to pilots with over ten kills."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}