{"url": "Frozian/Legends", "categories": ["Category:Legends articles", "Category:Core Worlds species", "Category:Frozians", "Category:Mammalian sentient species"], "nodes": [{"tag": "h1", "text": "Frozian"}, {"tag": "p", "text": "Frozians were furry sentient Humanoids from the planet Froz. They were taller and thinner than Humans, and an extra joint in each limb gave them an off putting aspect. They also had whiskers reaching beyond the sides of their faces. Standard gravity was too strong for them, speeding their aging process and preventing them from breeding. They also needed flora from Froz for this last process."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "Frozians were sentient Humanoid mammals. These bipedal beings had an extra joint in each limb that, to Human eyes, looked like a breach in a bone. The movements of a Frozian were perceived as off putting and their gait was seen as weird, partly because they trotted like the animals they evolved from, and because they moved faster than Humans. Frozians were clumsier than Humans, but they had more acute senses and were better abstract thinkers."}, {"tag": "p", "text": "Thin and reedy, adult Frozians reached a height of between two and three meters, with the mean approaching the latter figure. Males and females were similarly built and had no appreciable difference in height. The whole body of a Frozian was covered in short fur that could be of a range of color, including blond, reddish blond, chestnut, brown and golden brown."}, {"tag": "p", "text": "The head of a Frozian showed no external ears and a small, lipless mouth. A Frozian also had two wide-apart brown, big eyes, one to each side of the snout to provide the Frozian with good peripheral sight. The end of the snout had an identifiable nose that the Frozian could swing. Some Frozians showed a feline head, with others having a pear-shaped head and even others having a Human-like head, except for the big moustache."}, {"tag": "p", "text": "Thick, black, long whiskers grew to each side of the snout, creating a huge moustache that reached beyond the cheeks. Whenever a Frozian moved his or her nose, the moustache bounced. Frozians consciously moved the nose in elaborated gestures to underline an opinion when in a debate, and this caused the moustache to move from one side to the other."}, {"tag": "p", "text": "Experiencing the standard gravity found on most inhabitable planets was particularly difficult for a Frozian. While a Frozian can reach one century of age under light gravity conditions, eighty years of age would mean death to Frozians under standard gravity. Furthermore, Frozians could only breed in light gravity conditions and under the influence of some specific vegetables from the planet Froz. A Frozian's body showed the first changes of adolescence at nine years of age, and a fourteen-year-old Frozian was considered an adult. At forty-one, age was starting to ravage a Frozian body, and at sixty-one Frozians were considered old. A Frozian of eighty-five years of age was venerable."}, {"tag": "p", "text": "Frozians could use the power of the Force, and some of them showed potential to become members of the Jedi Order."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "Frozians had a well-deserved reputation for probity, honesty and diligence. They were proud hard-workers and respected the letter of a promise to death, even if the other party had already betrayed it. These virtues made Frozian highly valued civil servants wherever they were, specially as they not only held the virtues of their society, but also the virtues and laws of any civilization they were working for."}, {"tag": "p", "text": "Easily integrating in alien societies, they tended to speak the official language of the place they called home, although they were also fluent in their native Frozian. Frozian language did not share grammar with Galactic Basic Standard: Frozians tended to repeat the same sentence for emphasis, and sometimes they did so when speaking Basic. This language was spoken not only by Frozians: Maki Salak, a Ho'Din environmental extremist who had lived on Sacorria, was fluent in Frozian language."}, {"tag": "p", "text": "A strong-willed, good-willing people, Frozians tended to help whoever was in need, and could become worried for those around them. Frozians tended to make an extra effort to take care of people they perceived as needing it."}, {"tag": "p", "text": "A trait common to the species was melancholy: Frozians tended to see the worst possible outcome of everything, resigning themselves to their own doom, or accepting any government ruling them, even if they dislike it. They had a tendency to depress, except sometimes when helping other people, and they had a natural skill to wreak havoc on the mood of anyone around them—even if the Frozians would never intend or want that. Frozians tended to reject contact with other Frozians."}, {"tag": "p", "text": "A Frozian individual had a single name, such as Carlisgontoris, Rocatrinicel, Scorylance or Micamberlecto. They were known to swear with the expression \"I wish to Froz\"."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Frozians evolved from high trotting creatures that moved through the prairies of Froz and used their double-jointed limbs to reach fruits in treetops. Frozians eventually were visited by alien beings. Frozian learned from these people and they built their own starships. They intended to visit other planets in their system, and then in other systems, learning from the universe. Soon, Frozians discovered they were the only sentient life in their system."}, {"tag": "p", "text": "Froz, in the Corellian sector, became a peaceful planet where most Frozians lived. Eventually the Frozians joined the galactic community, but the dominant culture in the sector, the Corellians from the planet Corellia, treated the Frozians and other aliens in their sector (including the Corraguts and the Nosaurians) less-than-optimally as a client species."}, {"tag": "p", "text": "In 3951 BBY, during the First Jedi Purge, Frozians were known to the galaxy. They used the Frozian scout belt to make up for their usual clumsiness; but this item was exported so that aliens could use it too: The bounty hunter Mira was a known user of the Frozian belt."}, {"tag": "p", "text": "When the Alliance to Restore the Republic was founded in 2 BBY, Frozians and Duros were two of the first species to become its supporters. During the Galactic Civil War, too many Frozians were known to sympathize with the Alliance, rejecting its opponent, the ruling Galactic Empire. Duros suffered no retaliation for their position, but Frozians did: The  Moff of the Corellian sector, ordered to attack Froz with a devastating orbital bombing to make an example for other systems and to discourage insurrection."}, {"tag": "p", "text": "Through a series of raids, Star Destroyers annihilated almost all the life on the planet's surface. Few Frozians were off-planet at that point. Those Frozian survivors openly joined the Alliance in response, devoting their lives to overthrow the Empire."}, {"tag": "p", "text": "A scientific discovery made soon afterward showed that Frozians were sterile without Froz's flora and gravity conditions. The Galactic Empire was fragmented in 4 ABY and a number of Frozians joined the New Republic, but the generation of Frozians seeing their victory would be the last one ever, with estimations giving the species only a century of life. A number of Frozian scientists began a desperate, against-the-clock research to re-create the environment of Froz before that."}, {"tag": "h2", "text": "Frozians in the galaxy"}, {"tag": "p", "text": "Micamberlecto was a Frozian member of the New Republic. In 12 ABY, he was appointed Governor-General of the Corellian system. He accepted the job, believing that it would fill other Frozians with pride and dignity. However, Micamberlecto was assassinated in 18 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Frozian species first appeared through the character of Micamberlecto in Ambush at Corellia, the first installment of Star Wars: The Corellian Trilogy, by Roger MacBride Allen. Micamberlecto was also the first Frozian to be graphically depicted, in an image by Storn Cook for the role-playing guide Cracken's Threat Dossier (1997) that showed a pear-headed officer. Joe Bavitz drew a generic Frozian with an oversized moustache for Alien Encounters (1998). In Alien Anthology (2001), Sam Wood provided the first colored image of the species, showing a pair of Frozians with less Humanoid, more grazer-like faces and a less apparent moustache—although the whiskers were still apparent. A very tall Frozian with a similarly grazer face, drawn by an unknown artist, appeared in Ultimate Alien Anthology (2003). Those two last book provide different role-playing stats for a generic Frozian commoner."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}