{"url": "Fuel_for_the_Fire", "categories": ["Category:Real-world articles", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "Fuel for the Fire"}, {"tag": "p", "text": "\"Fuel for the Fire\" is the fourth episode of the first season of the animated series Star Wars Resistance and aired on October 21, 2018 on Disney Channel."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Kaz befriends a sky racer named Rucklin who pressures him to take some rare and dangerous hyperfuel hidden in Yeager's office."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Juggling chores and racing"}, {"tag": "p", "text": "The episode opens with Ace Squadron flying through the rings above the Colossus. At Jarek Yeager's repair shop, Kazuda Xiono finishes fixing an engine and cheers. Yeager asks if the others are ready to be impressed. Tam Ryvora derisively says she is \"completely ready\". By contrast, Neeku Vozo says he is always ready. BB-8 beeps cheerfully, while \"Bucket\" shakes his head."}, {"tag": "p", "text": "Kaz powers up the engine, but it still emits smoke. Tam mockingly asks if this is the impressive part. Kaz adjusts the engine with the spanner and changes the setting on the power generator. Before he can do another test run, the announcer announces that the race is about to start. Kaz tries to start the engine, but Neeku reminds Kaz that the engine is not sentient."}, {"tag": "p", "text": "Kaz thanks him for the reminder and starts the engine again, only for it to belch out smoke. Tam says this has been tons of fun but that she has a race to watch. She tells Neeku to come along. Kaz wants to go to the race, and come back and sort out the engine later. Yeager doesn't allow him to leave, and tells him to finish up the engine before the end of the day."}, {"tag": "h3", "text": "The engine debacle"}, {"tag": "p", "text": "Kaz protests, but Yeager tells him to get back to work. Kaz grumbles, but BB-8 suggests that he can work on the engine outside the garage, where he can see the starfighters racing above. As he watches the starfighters racing, the hoversled carrying the engine vibrates and begins moving towards the edge of the platform. Despite Kaz's efforts to pull it back, the cable snaps and it falls overboard."}, {"tag": "p", "text": "Kaz uses a crane to retrieve the engine. Yeager chastises Kaz for allowing himself to be distracted by the race, and Kaz apologizes. Yeager understands that Kaz is preoccupied with racing and spying, but tells him to remember that to everyone else here he is just a mechanic. Kaz protests that he is not a mechanic, but Yeager warns him that everyone else will know that if he is not careful. If he gets caught, Yeager warns that it would be the end of Team Fireball and that it isn't a game."}, {"tag": "p", "text": "Kaz says he knows that it's not a game, but Yeager isn't sure that Kaz understands the gravity of the situation. Kaz argues that he took the mission to help the Resistance and not to work in a garage. Kaz says that he is sorry if him wanting to help the galaxy is inconveniencing him. Kaz walks away."}, {"tag": "h3", "text": "Enter Jace Rucklin"}, {"tag": "p", "text": "Later at Aunt Z's Tavern, Kaz asks her if she has had the experience of saying something and immediately regretting it. Aunt Z says she regrets greeting Kaz the first time. He suggests that Yeager may not be his best option. Aunt Z suggests looking for other accommodation and that he will eventually find his place. A creepy blue-skinned Arcona named Garma suggests that Kaz can live with him, but he declines the offer."}, {"tag": "p", "text": "Shortly later, a blond human lad named Jace Rucklin comes up to Kaz and says that he and his friends were talking about him. Rucklin recalls that Kaz flew in that race against Torra Doza and that he has some skill. He asks what is his name. Kaz introduces himself as Kazuda Xiono, but tells him he can call him Kaz. Rucklin introduces himself and says that he is trying to be a racer."}, {"tag": "p", "text": "Over some drinks, Rucklin introduces Kaz to his friends, a human woman named Lin Gaava and a Sullustan named Gorrak Wiles. He describes them as the hardest working crew on this side of the Western Reaches. Gorrak quips about hard work, and remarks this is the best job of his career. He says that he can practically take days off. Lin says of course they do, because they are not droids."}, {"tag": "p", "text": "Kaz says that his boss Yeager does not really give any breaks. Gorrak says Yeager is a strange one, and could be the top racer if he wanted to be. He says that he only saw Yeager race once, but that he blew the competition away. Lin says it's because he uses fuel boost. Rucklin asks Kaz if Yeager ever showed him his racer, saying that he's been dying to see it."}, {"tag": "p", "text": "Kaz asks if it's the Fireball, but Rucklin says that Yeager has another racer, which he describes as a real racer. Kaz says he thought that Yeager was just a mechanic, and that he didn't know he was once a racer. Rucklin suggests they get out of here and do something fun. He invites Kaz along, an offer which Kaz accepts."}, {"tag": "h3", "text": "The swoop bike race"}, {"tag": "p", "text": "While walking through the corridors, Rucklin tells Kaz that he is a good pilot and gave Torra Doza a run for her money. He asks Kaz if he wants to race, or if he wants to back out and chum down. Kaz accepts Jace's offer and asks what they will see. Rucklin leads him down a manhole into his hangar, where he's stored two speeder bikes. Kaz is impressed by the bikes. Rucklin asks if he can handle them, and Kaz says yes. The two power up their speeders and drop down into the sea and race. Gorrak and Lin watch from above."}, {"tag": "p", "text": "While riding his bike, Rucklin presses a yellow button. He tells Kaz that the first one to reach that sky ring is a winner. Rucklin's modification allows him to race ahead of Kaz, and he teases him that there is nothing wrong with second place. Kaz accelerates his speeder bike and jumps above Rucklin. However, Kaz's bike's engine begins to break down and emit smoke. Kaz tries to tell Jace there is something wrong with his bike, but Rucklin thinks he is bluffing at first."}, {"tag": "p", "text": "Kaz tells him that he is losing control of the speeder bike. Rucklin manages to grab on to Kaz, who climbs aboard Rucklin's speeder bike moments before his speeder bike crashes and sinks into the ocean. Kaz thanks Rucklin for saving his life. Rucklin says it's no problem, because that is what friends do. Later, Lin tells Kaz that was a close call and asks if he is okay. Kaz thanks Rucklin and says that he owes him a bike. Rucklin says that the bike is not important, and that he is glad that Kaz is okay."}, {"tag": "p", "text": "At that point, an irate Yeager arrives and tells Kaz that he has been looking for him for the past two hours. Kaz tells Yeager that he has just been with friends. Yeager asks if he is working for him or them. Kaz admits they are not paying him for the lost time, and apologizes to Rucklin and his friends. After Kaz and Yeager have left, Rucklin thanks his friends for sabotaging Kaz's bike and says that they have him where they want him."}, {"tag": "h3", "text": "Spurning Neeku's advice"}, {"tag": "p", "text": "Back at the repair shop, Yeager tells Kaz that his delay in fixing the engine is unacceptable, and asks if he was going to fix the engine next month or next year. Tam, Neeku, and BB-8 are also present. Kaz argues back that he didn't think going on a long break would be a problem. Tam and Bucket giggle that Kaz is now in trouble."}, {"tag": "p", "text": "Yeager tells Kaz that he told Poe Dameron that he promised he would take him in, and not to make him regret that decision. Kaz is about to argue, but Bucket blocks his path. Kaz grumbles that Bucket is now on his case. Kaz considers rejoining Rucklin, but Neeku warns him that those young people are not what they seem to be. He describes them as \"lazy, always laughing, pulling pranks on others, and not focusing on their work.\" He adds that they have all kinds of fun and are the worst."}, {"tag": "p", "text": "Kaz brushes off Neeku's advice, and asks him if he can fetch a tool from that case. However, he says he can't remember what it's called. BB-8 beeps. Neeku asks which tool it is, and shows Kaz various tools. While Neeku is distracted, Kaz takes the opportunity to sneak off with BB-8. Neeku keeps listing the tools, unaware that Kaz has left the repair shop."}, {"tag": "h3", "text": "Into Rucklin's web"}, {"tag": "p", "text": "There is a shot of several starfighters flying above the Colossus. Kaz returns to Rucklin's hangar, where he finds them fixing a racer. Rucklin is pleased to see Kaz, and asks if Yeager gave him a hard time. Kaz says he tried. Gorrak says this is what he likes to hear, and shows Kaz that they have been making modifications to Rucklin's new racer."}, {"tag": "p", "text": "Lin says they have been stripping out all unnecessary systems to reduce the ship's weight. Rucklin says that when they are done, this baby will be primed for speed. Gorrak adds that they could use some Corellian hyperfuel, which he describes as an unstoppable \"hot sauce\". Rucklin explains the ship is fast, but is not even close to Yeager's racer. He tells Kaz that he would love to see Yeager's ship up close. Rucklin asks Kaz if he could sneak him a peek. BB-8 squeaks in disapproval."}, {"tag": "p", "text": "Kaz says that he has never snuck into Yeager's private hangar, and that it seems risky, warning that there would be trouble if he gets caught. Lin says they will wait here till he takes his break, and that she and Gorrak will be on the lookout. BB-8 tries to warn Kaz this is not a good idea by rubbing at his shoes. Kaz is uncomfortable, but says he owes them for saving his life. He asks if they are just going to look. Rucklin nods, and Kaz obliges."}, {"tag": "h3", "text": "Rucklin's heist"}, {"tag": "p", "text": "Later, Kaz is working on the engine. When Bucket goes off, Kaz tells BB-8 to keep a watch and not to argue. Kaz lets Rucklin in through a side blast door as his friends keep watch. Kaz and Rucklin follow Bucket into Yeager's office and hide behind a table. Bucket can't see them with his periscope-like visual sensors, and leaves the room after checking a second time."}, {"tag": "p", "text": "Kaz says that the hangar has got to be back here, and notes that Yeager has won many racing awards. Kaz finds a hologram image of Yeager as a New Republic fighter pilot during the Battle of Jakku, something that he has not disclosed to Kaz. He also sees another image of Yeager with a wife and child, and realises that he once had a family. Kaz says he feels bad about sneaking in here, but Rucklin asks him how that door is coming."}, {"tag": "p", "text": "Kaz searches for the door, but finds it is locked up tight. He apologizes that they won't get to see Yeager's racer after all. Kaz suggests they get out of here. Just then, they hear Yeager's voice. With Bucket unable to find the macro-fuser, Yeager decides to order a new one and says that he is not too worried about it."}, {"tag": "p", "text": "The two try to sneak out, but Tam enters the office and asks Yeager if he has seen Kaz. She tells him that he still hasn't fixed that engine, and asks where he is. Yeager tells Tam to go for a break, and looks at the hologram images of his family and time as a New Republic starfighter pilot during the Battle of Jakku."}, {"tag": "p", "text": "After looking at the holo-frame, Yeager leaves with Bucket. Rucklin steals a canister of Corellian hyperfuel while Kaz isn't looking and sneaks out, saying that they will see Yeager's racer another time. After Rucklin has left, BB-8 expresses his concern to Kaz. Kaz thinks that no harm was done since Rucklin didn't get to see the racer. Kaz and BB-8 go off to join Rucklin and company."}, {"tag": "h3", "text": "Moment of truth"}, {"tag": "p", "text": "Rucklin shows his friends the stolen Corellian hyperfuel. Lin is excited at Rucklin's stolen fuel, while Gorrak praises his boss for the heist. Just then, Kaz arrives and invites them for a meal at Aunt Z's. Rucklin apologizes and claims that he has a race starting soon. He and his associates hide their stolen hyperfuel from Kaz's sight. Kaz wishes them good luck with the race, but BB-8 is suspicious."}, {"tag": "p", "text": "Meanwhile, Bucket is checking Yeager's office when he finds the hyperfuel canister missing. He panics and throws his datapad up in the air. Bucket tells Tam and Neeku that the hyperfuel is gone. Neeku says this is very bad, and Tam says they need to find that hot sauce. When Kaz asks about the hot sauce, Neeku explains that it is hyperfuel and that it is highly unstable and causes terminal blowouts. He says that Yeager had a batch that he was safekeeping, but that someone stole it. BB-8 squeaks."}, {"tag": "p", "text": "Kaz realizes that Rucklin has stolen it for the race. Tam tells Kaz that if anyone tries to use it without knowing how, more than a shot can turn a ship into a giant bomb. Kaz realizes that Rucklin is in danger, and tells his colleagues that he has to go and that he will be back soon. Tam and Neeku watch while Bucket enters the hangar."}, {"tag": "p", "text": "Meanwhile, Rucklin pours some of the hyperfuel into his racer's tank. Lin warns him to be careful, but Rucklin boasts that it will be his ticket to the big time because he has the fastest ship in this race. Elsewhere, Kaz rushes through the hallways, bumping into pedestrians, including Garma asking him about considering his offer for lodging."}, {"tag": "h3", "text": "Saving Rucklin from himself"}, {"tag": "p", "text": "Rucklin preps the racer's system's for flight while Lin and Gorrak watch. As he descends down the launching bay, Kaz tells BB-8 they have to hurry before they get a chance to use the fuel. The announcer announces that the race is about to start, as Kaz brushes past the Rodian Glem."}, {"tag": "p", "text": "Finding their path blocked by a cleaning crew, Kaz decides to use a maintenance shaft. Kaz lowers BB-8 into the shaft, but is noticed by Yeager. Yeager asks him what he is doing, and Kaz tells him that his friend is going to blow himself up before goes down the shaft. Yeager calls for Kaz and realizes something is afoot. The two make their way through the maintenance shaft."}, {"tag": "p", "text": "Meanwhile, over the deafening roar of the racer's engines in Rucklin's hangar, Lin tells Gorrak that Rucklin's racer's engines are about to blow. Gorrak tells Rucklin to fire it up. Rucklin is ready to launch. Kaz, running in, tells them to stop and leaps onto Rucklin's racer. He tells Rucklin to shut it down just as the announcer begins the countdown. Kaz opens the hatch to the canopy, and Rucklin asks if he has lost his mind and tells him to get off his ship. The two struggle as the ship drops from the launch pad. Kaz manages to eject with Rucklin before the racer explodes in mid-air."}, {"tag": "p", "text": "As the ejection seat descends into the sea, Kaz asks Rucklin where his parachute is. Rucklin says that it was too heavy for racing. Kaz is shocked that he took it out. Before they fall into the sea, BB-8 catches them with his grappling hook. BB-8 struggles against their weight as Kaz and Jace struggle to hold on to the grappling hook. Fortunately, Yeager intervenes and helps BB-8 pull the young men up the platform."}, {"tag": "h3", "text": "True friendship"}, {"tag": "p", "text": "Kaz thanks Yeager, who is upset about Rucklin's theft of the hyperfuel. Yeager tells him not to forget BB-8, who beeps, and Kaz thanks him. As Yeager walks into the corridor, Kaz tries to explain, but he walks away. Rucklin is angry, but Kaz counters that he saved him from himself. Rucklin says that was his racer, and that he poured all of his life and savings into that ship. He pushes Kaz's arms away. He says that he built every part of the ship. Rucklin is furious that it is gone."}, {"tag": "p", "text": "Kaz chastises him for stealing the hyperfuel and blaming him. Rucklin's companions look at Kaz fiercely while Yeager turns his back. Rucklin says that they can't prove anything and says that it would have been fine if Kaz didn't interfere. He tells Kaz that it isn't over before storming away."}, {"tag": "h3", "text": "A life lesson and second chance"}, {"tag": "p", "text": "Yeager, watching Captain Doza's silhouette in Doza Tower, tells Kaz that the last thing they need now is to attract attention, before walking back to the repair shop. Kaz and BB-8 follow him back. Kaz accepts responsibility and tells Yeager that he will understand if he wants to fire him. Yeager tells him to get back to work."}, {"tag": "p", "text": "Kaz is surprised that Yeager is not kicking him out. Yeager tells Kaz that he may not be the greatest mechanic and is a questionable spy at best, but that he is a good person. Yeager tells Kaz that Jace was lucky to have him as a friend. When Kaz surmises that he is good at being a person, Yeager tells him to get better at being a mechanic."}, {"tag": "p", "text": "He tells him to start by cleaning those engine parts. Kaz sighs, but BB-8 bumps him in the shins. While starfighters fly over the rings, Neeku greets Kaz and asks if he has come to watch the race. Kaz says that Yeager told him to clean the engines outside where he can watch the race. Tam says that maybe Yeager likes him after all. The three watch the race as the hoversled carrying the engine parts falls off the platform, to Kaz's horror."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External Links"}, {"tag": "p", "text": ""}]}