{"url": "Fulcrum", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Aliases, nicknames, and pseudonyms", "Category:Alliance to Restore the Republic intelligence organizations", "Category:Fulcrum", "Category:Titles"], "nodes": [{"tag": "h1", "text": "Fulcrum"}, {"tag": "p", "text": "Fulcrum was a title used by several Rebel informants in the years leading up to the Battle of Yavin. Former Jedi Padawan Ahsoka Tano proposed the idea, and was the most notable Fulcrum agent. Imperial Security Bureau Agent Alexsandr Kallus became another Fulcrum after becoming disillusioned with the Empire, and informed the rebellion that several Imperial cadets at the elite Skystrike Academy wanted to defect to the rebels. Captain Cassian Andor of the Alliance to Restore the Republic was a Fulcrum recruitment agent in the Albarrio sector."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The title of Fulcrum was used by spies in the rebel network. Their purpose was to gather and distribute intelligence, and recruit new members to the rebel cause. Fulcrums were supposed to keep their identities as secret as possible, and to that aim, usually modulated their voices on their transmissions. They also used avatars when speaking via hologram. The most common avatar was that of the Fulcrum symbol, a white design based on Ahsoka Tano's forehead markings. As the title's creator, she was also known to use an avatar of a cloaked figure."}, {"tag": "p", "text": "Fulcrums were both agents and commanders, as they investigated Imperial activity and gave missions to their subordinates, they also directed forces and oversaw associated cells. The use of Fulcrum as a single codename allowed for the confusion of Imperial intelligence operations if an individual agent was uncovered."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "\"Fulcrum\" was originally the name of a subspace communications frequency used by Jedi General Anakin Skywalker during the Clone Wars. Among those aware of the frequency were Skywalker's former Master Obi-Wan Kenobi, Admiral Wullf Yularen, Onderonian freedom fighter Saw Gerrera and Skywalker's former Padawan Ahsoka Tano. When Tano and Bo-Katan Kryze used the frequency to contact Skywalker and Kenobi during the Battle of Yerbana, Skywalker initially assumed that Gerrera was the one attempting to get in touch, regarding the ongoing siege at Onderon."}, {"tag": "p", "text": "Following the establishment of the Galactic Empire, Tano, having survived Order 66, took over Senator Bail Organa's intelligence network, which was part of the early rebel network. She adopted the codename Fulcrum, which later became the standard alias for other rebel operatives within the network. By 9 BBY, Tano and the other Fulcrums were using a symbol derived from her forehead markings. Most people did not know the significance of the symbol, but rebel pilot Miara Larte, who had once been rescued by Tano, did. She knew to keep the secret, however, even from her sister Kaeden, who had also known Tano."}, {"tag": "h3", "text": "The Spectres"}, {"tag": "p", "text": "By 5 BBY, the Spectres rebel cell leader Hera Syndulla kept in touch with Fulcrum, who supplied her cell with information about Imperial targets. While Syndulla was somewhat privy to Fulcrum's true identity, although not her real name, she kept this information a secret from the rest of her team members, including the Mandalorian weapons expert Sabine Wren. Following an attack on an Imperial convoy, Wren demanded to know Fulcrum's identity and insisted on accompanying Syndulla on a supply mission to Fort Anaxes on the asteroid PM-1203."}, {"tag": "p", "text": "After the Spectres rescued the Imperial defector Tseebo from Lothal in 4 BBY, Syndulla arranged for him to be spirited away into hiding aboard one of Fulcrum's CR90 corvettes. Following the capture of the Spectres rebel and Jedi Padawan Kanan Jarrus, Fulcrum contacted Syndulla by hologram and counseled her not to rescue Jarrus in order to avoid exposing the rebellion's existence to the Empire. However, the Spectres persisted with their rescue mission, destroying Grand Moff Wilhuff Tarkin's Star Destroyer, the Sovereign, in the process. After the Spectres' astromech droid Chopper contacted her, Fulcrum dispatched members of Phoenix Cell to rescue the rebels. It was also at this point that she finally chose to reveal herself to the rest of Syndulla's team, including her real name."}, {"tag": "h3", "text": "Building a rebellion"}, {"tag": "p", "text": "Although Tano was presumed dead after her duel with Darth Vader on Malachor, her codename survived and was still in use by several other rebel spies and operatives, including the disillusioned Imperial Security Bureau Agent Alexsandr Kallus and the Rebel Alliance recruiting agent Cassian Andor. Another rebel recruiting agent, former Partisan Xosad Hozem, knew of the Fulcrum agents, and upon encountering fellow ex-Partisan Jyn Erso, attempted to discern if she was aware of them. As Erso had never heard of the Fulcrums, she did not know what he was talking about."}, {"tag": "p", "text": "Between 2 BBY and 0 BBY, Cassian Andor used the Fulcrum symbol when transmitting information to and later receiving information from agents sent on the Mission to Mustafar."}, {"tag": "p", "text": "In 2 BBY, Kallus used his Fulcrum pseudonym to inform Phoenix Squadron about the presence of Imperial cadets seeking to defect to the rebellion at Skystrike Academy. As a result, Wren mounted a rescue mission and managed to recruit the starfighter pilots Wedge Antilles and Derek Klivian. During the mission, Kallus actively helped the trio escape from the academy by telling them which levels to avoid and which hangar bay they could get a ship from. When Wren, not suspecting that he was their new Fulcrum, demanded to know why they should trust him, he simply told her to \"Tell Garazeb Orrelios, we're even.\" Orrelios, a member of the Spectres, had unwittingly gotten Kallus to reconsider his allegiance to the Empire after saving his life during an incident with an escape pod on the Geonosian moon Bahryn."}, {"tag": "p", "text": "Kallus later tipped off Phoenix Squadron that the Empire was planning to place the planet Mykapo under martial law, prompting the rebels, including the Spectres, to go there to evacuate all of the rebels and rebel sympathizers. Some time after, when Bridger, Jarrus, and Chopper undertook an undercover mission to infiltrate and steal plans for Grand Admiral Thrawn's TIE Defender initiative, the rebels were aided by Kallus. He identified himself as a Fulcrum operative using the code phrase \"by the light of Lothal's moons,\" and helped the rebels escape with the plans. After studying the rebel infiltration, Thrawn realized that the Empire had a spy within their ranks who was leaking information to the rebels. Due to their many past encounters with Kallus, most of the Spectres were skeptical that his change of allegiance was genuine."}, {"tag": "p", "text": "Kallus later used his Fulcrum pseudonym to aid the Phoenix rebels by leaking intelligence about Thrawn's E-XD-series infiltrator droids. Using this information, the rebels Orrelios, Chopper, and AP-5 overpowered EXD-9 before it could reveal Chopper Base's location to the Empire. They then reprogrammed the droid into an improvised warhead and used it to destroy a Star Destroyer. Fulcrum later contacted the Spectres to thank them for their creativity in tackling the infiltrator droids. However, Thrawn was able to use this incident to narrow down his search for Phoenix Squadron's base to 94 systems."}, {"tag": "p", "text": "Afterwards, Thrawn and Governor Arihnda Pryce intercepted one of Kallus' Fulcrum transmissions and realized that Fulcrum was the code name of the mole in the Lothal sector command staff. They monitored his next transmission to learn his identity. Because only a highly-ranked Imperial could access the classified information Kallus sent in the transmission, they realized that the Fulcrum in the Lothal sector was not only a spy for the rebel network, but also a traitor to the Empire as well, and solicited the help of the head of the ISB Colonel Wullf Yularen in hunting down and identifying Fulcrum by screening staff from Sector Command. Thrawn and Yularen believed that the spy was an Imperial officer who was highly placed enough to have had access to classified information, and low enough to send his transmissions to the rebel network without the Empire's knowledge. After learning that Thrawn was monitoring Fulcrum's transmissions, the Spectres mounted a mission to rescue Kallus. During the course of the mission, the rebels also deleted Atollon from Thrawn's star chart. Kallus managed to stall the investigation by implicating Lieutenant Yogar Lyste as Fulcrum. However, Thrawn privately deduced that Kallus was actually Fulcrum because he had concealed the arrest of Bridger. The Grand Admiral decided to keep this secret, as he felt that Kallus would be more useful as a spy than he ever was when he was still loyal."}, {"tag": "p", "text": "On the eve of Phoenix Cell's long-planned attack on Lothal's Imperial factories, Thrawn arrived on the planet to warn Pryce of the impending attack. Kallus, who was not invited to the meeting, used a mouse droid to spy on Thrawn from the ventilation system. At the meeting, Thrawn informed Pryce, Admiral Kassius Konstantine and Tarkin, who was attending by hologram, of the impending attack and that Phoenix Squadron was being reinforced by the fleet of General Jan Dodonna. Via the mouse droid, Kallus overheard everything, and set out for an old communications tower outside of Lothal City. When he tried to transmit a message, he found that his signal was being blocked, and was shortly ambushed by Thrawn. Kallus managed to destroy the Grand Admiral's jammer, letting the partial message be sent, before Thrawn and his death troopers arrested him. Thrawn explained to Kallus that the rogue agent's message was the final piece of the puzzle he needed to locate the rebel base, as its trajectory intersected with that of Dodonna's fleet. The art of the ancient people of the Lothal sector showed a star system at those coordinates, which was not on Imperial charts."}, {"tag": "p", "text": "At Chopper Base on Atollon, the rebel commanders received Fulcrum's warning in enough time for them to place all personnel on alert before the arrival of the Seventh Fleet. During the battle that followed, Kallus was held prisoner on the bridge of the Chimaera and forced to watch. After the rebels were forced to retreat back to the planet, and the orbital bombardment that followed, Thrawn left Pryce in charge of the fleet while he led a ground assault. One of the rebel ships, Bridger's Gauntlet, had escaped during the initial attack, and returned with reinforcements to destroy the Imperial fleet's remaining Interdictor, the other having been destroyed during the first stage of the battle. As the remaining rebel ships raced towards the blockade, Kallus took advantage of Pryce's reaction to the second Interdictor's destruction to taunt her about the mess she was making of Thrawn's fleet, causing her to order him thrown out of the airlock. He neutralized his stormtrooper guards in the turbolift and escaped the Chimaera in an escape pod, transmitting his coordinates to the Ghost, which picked him up before the remaining rebels escaped into hyperspace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Fulcrum title first appeared in \"Out of Darkness,\" a first-season episode of Star Wars Rebels. Ahsoka Tano was not revealed to be the person behind it until the first season finale, \"Fire Across the Galaxy.\" The novel Ahsoka revealed the circumstances under which she created the title, while The Clone Wars season 7 episode \"Old Friends Not Forgotten\" revealed Tano's inspiration for the title. The third season episode \"The Antilles Extraction\" later revealed that the title had come to be used by multiple agents."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}