{"url": "Fulkrehm_Protial", "categories": ["Category:Legends articles", "Category:Alliance Intelligence members", "Category:Alliance Starfighter Corps personnel", "Category:Humans", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Fulkrehm Protial"}, {"tag": "p", "text": "Fulkrehm Protial was a male Human who originally served the Alliance to Restore the Republic as a starfighter pilot during the Galactic Civil War. However, after he was injured, he was forced to give up flying and transferred to Alliance Intelligence."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Protial was a promising Y-wing pilot for the Rebel Alliance during the Galactic Civil War. During an Imperial attack on the world Kostra, he crashed and was exposed to trosilon, a nerve gas that was used by the Empire. Protial was rescued by the natives of Kostra, who treated him for his injuries; however, they lacked sufficient medical knowledge to allow him a full recovery. His motor control skills were irreparably damaged, so Protial could no longer fly or even walk properly."}, {"tag": "p", "text": "Determined to still serve the Alliance, Protial joined Alliance Intelligence. He was assigned desk work, and although his work was valued, he began to see the office he worked in as a prison. One night, he noticed a group of drunken pilots returning from a nearby town and he realized that their drunken movements matched his own. The next morning he volunteered to go undercover in Sangorn's Net, a bar that was popular with criminals. Protial's superior, Captain Rondell, was at first uninterested in sending the former pilot on the assignment, but eventually realized that Protial felt trapped in his current assignment and agreed to it."}, {"tag": "p", "text": "Disguised as a freighter captain, Protial would spend his nights in various bars throughout the Kriz sector, where he would listen to the conversations of those around him. Most patrons of the bars just thought of him as a drunk. He used the identification code \"trosilon.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Protial was a Human male who had suffered severe neurological damage from his exposure to an Imperial nerve agent. As a result his movements and speech were heavily impacted so he would stumble and weave as he walked and his speech was heavily slurred. His mental facilities were unimpaired, however, and he remained eager to serve the Rebel Alliance on the front lines as opposed to being confined to an office."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Due to the trosilon damage it was very difficult for Protial to do anything involving fine motor control. He was a good liar and kept his eyes and ears open as he stumbled from bar to bar, and as a result he had a decent knowledge of local criminal activities."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Protial carried four fragmentation grenades with smartfuses, an audio recorder disguised as a mini-datapad, a blaster pistol and a comlink. The comlink had a prerecorded distress call and autolocate feature."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fulkrehm Protial was designed by Chuck Truett for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Doug Schuler."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}