{"url": "Fully_Operational", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Book stubs", "Category:Incomplete lists", "Category:Star Wars: Age of Rebellion sourcebooks"], "nodes": [{"tag": "h1", "text": "Fully Operational"}, {"tag": "p", "text": "Fully Operational is a sourcebook for Fantasy Flight Games' Star Wars: Age of Rebellion roleplaying game offering new rules, locations, gear, and adventure scenarios for the Engineer class. It was released on March 29, 2018."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Design. Build. Repair. Destroy. The struggle against the Empire isn't only for those who carry the biggest blasters or fly the fastest starfighters. No war can be carried on without the tools to wage it, and Engineers serve the Rebellion and their comrades by designing, building, and maintaining all the equipment necessary to end the Empire's reign of terror in the galaxy. Weapons, droids, vehicles, and gear of all varieties are more than just plasteel and bolts; they represent the will of the free people of the galaxy made corporeal in defiance of the Emperor."}, {"tag": "p", "text": "Fully Operational is a 96-page sourcebook for Engineers in the Star Wars™: Age of Rebellion Roleplaying Game™. Featuring three new specialization talent trees and new races to populate your campaigns, Fully Operational is an essential addition to your collection. It includes detailed rules for vehicle and starship construction as well as sample campaigns that emphasize the role Engineers play in the Galactic Civil War beyond being simple background support. A livery of new ships and vehicles also awaits you, ready to be included in your Age of Rebellion campaign."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}