{"url": "Funeral/Legends", "categories": ["Category:Legends articles", "Category:Ceremonies", "Category:Funerals"], "nodes": [{"tag": "h1", "text": "Funeral"}, {"tag": "p", "text": "A funeral was a ceremony held following the death of an individual amongst the various cultures of the galaxy. Funeral customs varied widely based on the culture and beliefs of the deceased individual. Groups such as the Jedi also had their own special funeral customs. Funerals were held usually just before the final disposition of a person's remains, which was often burial or cremation. In most cases the person's body was present at the funeral, unless their body was destroyed, could not be retrieved, or in the case of the Jedi became discorporeal after death."}, {"tag": "h2", "text": "Cultures"}, {"tag": "p", "text": "The people of Naboo believed that the body of a deceased must be cremated within two days time in order to return the deceased's spirit to the planet. A popular location for Naboo funerals was the Theed Funeral Temple, near the banks of the Solleu River. The Jedi Qui-Gon Jinn's remains were cremated in this temple after his death in 32 BBY. For important individuals, a procession through the streets of Theed was part of the funeral service. After her death in 19 BBY, the body of Padmé Amidala was carried in a procession through Theed."}, {"tag": "p", "text": "The Gran had their own funeral customs. Aks Moe was given such a funeral after his death in 22 BBY, which was disrupted by Dug activists."}, {"tag": "p", "text": "The Jedi had their own funeral customs for deceased Jedi who had not become one with the Force following their deaths. This most often involved cremating the deceased on a pyre. From time to time the Jedi also practiced burial."}, {"tag": "p", "text": "On Bastion, the government rehearsed the state funeral ceremonies of certain Imperial leaders on a regular basis. By 40 ABY, as Grand Admiral Gilad Pellaeon was over 90 years old, the government of Bastion regularly rehearsed his funeral. Pellaeon witnessed these rehearsals and found it sobering to witness his own funeral."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}]}