{"url": "Funeral_of_Han_Solo", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Events during the First Order–Resistance war", "Category:Funerals"], "nodes": [{"tag": "h1", "text": "Funeral of Han Solo"}, {"tag": "p", "text": "Following the Battle of Starkiller Base, a funeral was held by the Resistance on D'Qar for the smuggler Han Solo."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Battle of Starkiller Base, Han Solo attempted to turn his son Kylo Ren away from the First Order and the dark side of the Force, trying to convince him that Supreme Leader Snoke was just using him for his power. Ren refused and fatally impaled Solo with his lightsaber. In Solo's last moments, he looked in his son's eyes and touched his son's face, before falling down a shaft towards the core of Starkiller Base to his death. Not long after, the thermal oscillator was destroyed by the Resistance pilot Poe Dameron, starting a chain reaction of explosions across the planet's surface. Within minutes, the planet imploded and then exploded."}, {"tag": "h2", "text": "The funeral"}, {"tag": "p", "text": "The memorial service started during the early hours of the evacuation of D'Qar. Though Leia Organa realized that setting aside a few moments to remember a fallen hero wasn't the right thing to do at that moment, she thought that it would provide a chance to inspire troops with the old rebel spirit from the days of the Galactic Civil War, even though she knew that Solo himself would have hated the ceremony, knowing that he didn't have patience for memorials and speeches as a man who was allergic to politics and suspicious of causes. Other guests at the funeral who showed their respects were Admiral Gial Ackbar, protocol droid C-3PO, Lieutenant Kaydel Ko Connix, Commander Larma D'Acy, General Caluan Ematt, and the Resistance pilot Nien Nunb."}, {"tag": "p", "text": "During her speech, Organa spoke about Solo, including the fact that he always hated bullies, injustice and cruelty, reason for which he always stood against them, throughout all his life, from his youth on Corellia, when he fought at both Yavin and Endor, and even in his final moments at Starkiller. Organa noted that when she boarded the Millennium Falcon the only personal touch she found was a pair of golden dice. She also recalled the occasion when Solo helped to liberate Kashyyyk. Organa also took the opportunity to read out the names of the pilots who never made it back from Starkiller, such as Ello Asty, Furillo, or Red One."}, {"tag": "p", "text": "While the other Resistance members resumed the evacuation and returned to their positions, Organa placed a wooden figurine carved by Solo the night before the Battle of Endor along with other items amongst the roots of a tree, ending the funeral."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Though Solo's funeral had been celebrated, moments to remember him still happened after the memorial service's end. When the Force-sensitive Rey was trying to convince Organa's brother and Solo's brother-in-law, Jedi Master Luke Skywalker to train her on Ahch-To, Skywalker, who had cut himself from the Force, asked her and Chewbacca about Solo, leading them to reveal what happened at Starkiller Base. Subsequently, while Organa remembered Solo aboard the Raddus, Luke did the same at his hut, crying for the loss of Solo, whom Luke had wanted to see once more."}, {"tag": "p", "text": "Following the Battle of Crait, before becoming one with the Force, Skywalker reminded Ren that Han would always be with him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The funeral of Han Solo first appeared in the novelization of the 2017 film Star Wars: Episode VIII The Last Jedi, directed and written by Rian Johnson. The decision to include Solo's funeral in the novel came from the novel's author Jason Fry and his editor Elizabeth Schaefer. Johnson stated that the reason for not including the funeral in the film was that it didn't have a place in it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}