{"url": "Funeral_of_Luke_Skywalker", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Non-canon Legends articles", "Category:Jedi funerals"], "nodes": [{"tag": "h1", "text": "Funeral of Luke Skywalker"}, {"tag": "p", "text": "During the Battle of Hoth, a funeral was held for the ace pilot Luke Skywalker, hero of the Battle of Yavin, who died one day before following a wampa's attack."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Before the beginning of the Battle of Hoth, Commander Luke Skywalker was tasked to do a recon mission with his tauntaun. However, a wampa appeared to assault Skywalker, knocking him unconscious and dragging him to his cave. Though Skywalker managed to escape and slain another wampa at the cave, he was injured and freezing in the cold. Shortly thereafter, Commander Han Solo arrived after his tauntaun died. Unfortunately, there was no more salvation for Skywalker. Before dying, Luke asked Han to go to Dagobah, meet the legendary Jedi Master Yoda and train as a Jedi. Then, Skywalker passed away on the Corellian's arms. Immediately after Skywalker's death, the Alliance Starfighter Corp Zev Senesca, member of the Rogue Squadron, asked Skywalker about his position, only for having Solo, who put Skywalker's corpse to rest on a tent, to inform him about what happened to their Rogue Leader."}, {"tag": "h2", "text": "The funeral"}, {"tag": "p", "text": "The next day, during the Battle of Hoth, a funeral was held by the Rebels in the memory of Skywalker, famous for being the hero of the Battle of Yavin in which he destroyed the Galactic Empire's superweapon the Death Star. Among the guests to the funeral, were Princess Leia Organa, General Carlist Rieekan and Solo's First Mate the Wookiee Chewbacca. After the funeral's end, the Rebels reasumed their positions at the battle, in which Wedge Antilles and Wes Janson had already been shot down by Imperial forces leaded by General Maximilian Veers."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the memorial's service end, Solo said to Organa that he had the fault of Skywalker's death, saying that maybe if he had arrived earlier Skywalker would still be alive, but Leia comforted him saying that it wasn't his fault. Then, Solo informed Leia that he needed to go to Dagobah to be trained as a Jedi by Master Yoda. Once at Dagobah, however, Yoda informed Han that it was Leia who needed to be trained instead of him. Ultimately, Leia occupied what his brother's place was going to be and became a Jedi Knight."}, {"tag": "p", "text": "On the other hand, the Imperials didn't found any exact evidence regarding Skywalker's death, leading them to leave his demise as a rumor. Darth Vader, however, not aware of Luke's fate, was sure that Skywalker was still alive and went to search him. Eventually, Vader managed to track down Leia to Dagobah, but during his confrontation against Yoda, shortly before being killed by Solo, he learned about what really happened to Skywalker at Hoth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}