{"url": "Funeral_of_Mara_Jade_Skywalker", "categories": ["Category:Legends articles", "Category:Jedi funerals"], "nodes": [{"tag": "h1", "text": "Funeral of Mara Jade Skywalker"}, {"tag": "p", "text": "The Funeral of Mara Jade Skywalker was a Jedi Funeral to mark the passing of Mara Jade Skywalker. This ceremony took place in 40 ABY, approximately one week after Mara's death on Kavan. The funeral was held in the Morning Court—a large atrium in the Jedi Temple on Coruscant."}, {"tag": "p", "text": "For the funeral, Mara's body was wrapped in white gauze and set on top of a cremation pyre. The Jedi Knights who attended the funeral all dressed in white robes, and assembled in an area in front of the pyre. The Masters of the Order entered, escorting Luke Skywalker and his son Ben Skywalker—who were dressed in gray robes with the hoods pulled over their heads—to the head of the pyre. A large number of government officials and other dignitaries filled the remainder of the space in the Morning Court."}, {"tag": "p", "text": "Han Solo and his wife Leia Organa Solo tried to attend the funeral, but were accosted by a Galactic Alliance Guard squadron, who attempted to arrest them. The two were forced to leave prior to the funeral and escape from Coruscant. Originally Leia was going to give the eulogy at the funeral, but as she was forced to leave Saba Sebatyne agreed to give the eulogy instead."}, {"tag": "p", "text": "Shortly after Master Sebatyne began her eulogy, Jacen Solo arrived at the funeral - those assembled did not know that he had killed Mara and as a result became the Sith Lord Darth Caedus. His arrival created a stir at the funeral, and he had the Masters upset by taking a place next to Luke and Ben Skywalker. The Masters felt that he should either stand with the other Jedi, or if he was present as a government official to take his place with the other dignitaries. Luke intervened, and allowed Jacen to stand with him and Ben as family. Master Sebatyne resumed her eulogy, turning it in to a message about the dangers of the dark side of the Force. While Master Sebatyne was speaking, Mara's body began to disappear, and by the time she had finished Mara's body had returned to the Force. Master Sebatyne led the assembly in reciting the Jedi Code."}, {"tag": "p", "text": "Jacen left soon after the eulogy was finished while many of the other participants gathered for a remembrance feast in the Hall of Peace."}, {"tag": "h2", "text": "Guests"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}