{"url": "Funeral_of_Padm%C3%A9_Amidala", "categories": ["Category:Legends articles", "Category:Funerals"], "nodes": [{"tag": "h1", "text": "Funeral of Padmé Amidala"}, {"tag": "p", "text": "The funeral of Padmé Amidala was the ceremonial funeral procession of Senator Padmé Amidala. It took place after her death in 19 BBY in Naboo's capital city, Theed."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "After her death in childbirth on Polis Massa, Amidala's body was returned to Naboo for the proper funeral rites. In order to hide the fact that Amidala's twins survived, her body was prepared to still appear pregnant. Her maternal grandmother, Ryoo Thule, oversaw Amidala's funeral, as per Naboo custom."}, {"tag": "p", "text": "Drawn through the streets of Theed in a four-gualaar carriage, Amidala's body was seen as drowning in a watery casket, as her funeral gown was several different shades of blue and her hair was fanned appropriately. The japor snippet given to her by her secret husband, Anakin Skywalker, thirteen years earlier rested in her folded hands as well. Thousands of mourners witnessed or followed the procession, which was led by Queen Apailana, Boss Rugor Nass, Representative Jar Jar Binks, Governor Sio Bibble, Amidala's family and her former handmaidens, who acted as pallbearers. Jedi Masters Obi-Wan Kenobi and Yoda watched Amidala's funeral from Senator Bail Organa's starship, the Sundered Heart. They didn't want to take the risk to come any closer and be found by the Empire, as they were certain that Emperor Palpatine's attention would be fixed on the funeral."}, {"tag": "p", "text": "Although Naboo custom dictated that the deceased was to be cremated at the Theed Funeral Temple and their ashes cast into the Solleu River before plunging off the cliff from the bridge between the Livet Tower and the temple, Padmé Amidala's lifeless body was subsequently entombed in a stone sarcophagus ornated with the Naboo emblem and located in a private mausoleum."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Amidala's friend and colleague, Senator Silya Shessaun, attempted to start an investigation to look further into Amidala's untimely death. Shessaun's efforts were thwarted by the newly-appointed Emperor Palpatine, citing \"security concerns\"."}, {"tag": "p", "text": "Amidala's former handmaiden, Sabé, was equally frustrated by what little she knew of her friend and former mistress's death. She eventually befriended Senator Bail Organa and became one of his principal agents. She was also asked by Organa to tutor Amidala's daughter, Leia, and her companion Winter in a variety of subjects, from etiquette and bureaucracy to the more esoteric arts."}, {"tag": "p", "text": "Six months after the funeral, Inquisitor Malorum traveled to Naboo seeking information on Amidala and her pregnancy, suspecting that her offspring might have survived. He interrogated Ryoo Thule, since she had overseen her granddaughter's funeral. When she refused to give him the information he sought, he killed her."}, {"tag": "p", "text": "Additionally, Amidala's head of security, Captain Gregar Typho, began an investigation into the late Senator's mysterious death, as he had developed an unrequited love for her. Typho eventually came to the conclusion that Darth Vader had killed Amidala. When he finally confronted the Sith Lord, the latter struck him down. Before dying, Typho took some satisfaction in the obvious pain that Amidala's name caused Vader. Vader himself would eventually pay a visit to the mausoleum housing her remains, proceeding to grieve at the location."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}