{"url": "Funeral_of_Qui-Gon_Jinn/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Jedi funerals"], "nodes": [{"tag": "h1", "text": "Funeral of Qui-Gon Jinn"}, {"tag": "p", "text": "The funeral of Qui-Gon Jinn took place in the city Theed, capital of the planet Naboo, after his death at the hands of Darth Maul in 32 BBY."}, {"tag": "p", "text": "Once he defeated the Sith Lord, Obi-Wan Kenobi moved his master's body to the city's funeral temple, where a traditional Jedi funeral was held in his honor.[source?] Many Jedi were in attendance, including Grand Master Yoda, Mace Windu, and several members of the Jedi High Council. Non-Jedi attendees included Queen Amidala, Boss Rugor Nass, newly-elected Supreme Chancellor Palpatine, Anakin Skywalker, and Jar Jar Binks, among several others. The events of the funeral nearly caused Queen Amidala to cancel the victory celebrations that had been planned for the following day out of respect for the late Jedi Master, but she reconsidered after Kenobi informed her that Jinn would have wanted her to continue with the celebration."}, {"tag": "p", "text": "The death of Qui-Gon left Anakin feeling depressed. The separation from his mother and the realization that Padmé was the Queen of Naboo left him feeling insecure about his future direction. Obi-Wan promised Anakin that he would become a Jedi. Likewise, during the funeral, Windu and Yoda acknowledged that the Sith had indeed returned and began to speculate that there was likely another Sith Lord in adherence with the Rule of Two, though they were unsure as to whether the Sith who had killed Qui-Gon had been the master or the apprentice. Unknown to the two Jedi Masters at the time, however, the Sith Master, Darth Sidious, was present at the funeral under the public persona of Palpatine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}