{"url": "Furlac", "categories": ["Category:Canon articles", "Category:Non-canon articles", "Category:Aqualish", "Category:Landlords", "Category:Males"], "nodes": [{"tag": "h1", "text": "Furlac"}, {"tag": "p", "text": "Furlac was the Aqualish landlord of the Freemakers, a family of scavengers who operated a starship and repair business called Freemaker Salvage and Repair on the space station the Wheel. He had a difficult relationship with his tenants who were unable to pay their rent."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Furlac was an Aqualish landlord who lived on a space station called the Wheel in the Abrion system during the Age of the Empire. He lived on the affluent Upper Ring of the space station. One of his tenants was the Freemakers, a family of scavengers who operated a garage called Freemaker Salvage and Repair. The Freemakers consisted of the three Human siblings Zander, his sister Kordi, their youngest brother Rowan, and the B1-series battle droid R0-GR. Furlac owned their garage and received rent payments from them. At some point following the Battle of Hoth, the Freemakers became indebted and fell behind in their rent payments."}, {"tag": "p", "text": "After the Freemakers had come back from a salvaging run during a dogfight, Furlac used a large Flood droid to block the Freemakers from entering their garage. Furlac corresponded with Kordi and Zander via hologram and reminded them that their rent was overdue. Due to Kordi's charm, he relented and gave them another day to pay their rent but threatened to flush them out the airlock. Furlac then withdrew his flood droid. After Rowan accidentally destroyed a cobbled-up starfighter that Zander and Kordi had built, the Freemakers traveled to the planet Nal Kapok to retrieve Clone Wars-era salvage material. After returning from Nal Kapok with the Great Jedi Purge survivor Naare, Furlac came to collect his rent but Naare played a mind trick on him and convinced him that the Freemakers had paid their rent in full. She also told him to let her rent the garage opposite for one Credit."}, {"tag": "p", "text": "The mind trick later wore off and Furlac contacted the Freemakers by hologram to remind them that they were behind in their rent payments. As a result, the Freemakers embarked on a trip to Kashyyyk to obtain a piece of Wroshyr wood for the starship captain Ignacio Wortan in an unsuccessful attempt to obtain funds. Later, the Freemakers fled The Wheel after discovering that Naare was actually an undercover Sith agent who was working for Darth Sidious and Darth Vader."}, {"tag": "p", "text": "After being separated from Rowan and Roger, Zander and Kordi returned to the Freemaker Garage. Upon arriving, they were greeted by Furlac who demanded their rental payment and additional compensation for damage to their door. At that point, Naare entered the Garage accompanied by the Hutt crime lord Graballa and his henchmen Dengar, Baash, and Raam. When Naare and the gangsters proceeded to interrogate Kordi and Zander about the whereabouts of Rowan, Furlac took the opportunity to leave the room. Shortly later, a battle broke out between the Freemakers, Naare, and Graballa's forces."}, {"tag": "p", "text": "Furlac later bumped into the Freemakers on the wheel, they were wearing disguises trying to sneak into the Freemaker Salvage and Repair shop. Kordi Freemaker tried to convince him that they were part of Midnight Care Repair Services there for a work order on a manufacturing Kammino Cappuchino Machine. He pretended to be convinced and let them in. Furlac then told Graballa that they were on the wheel."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Furlac appeared to be solely concerned with extracting overdue rent payments from the Freemakers. He also appeared to be weak-minded and was susceptible to mind tricks. He was displeased when the Freemakers were unable to keep up with their rent payments and also sought to exact further compensation for damage to the door of their garage. He also had a degree of self-preservation when he retreated after the Freemakers were cornered by Naare and Graballa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Furlac first appeared in the non-Canon Disney XD television series LEGO Star Wars: The Freemaker Adventures as a tertiary character. He was voiced by Gregory Baldwin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}