{"url": "Alec_(Jedi)", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Guardians", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Alec  (Jedi)"}, {"tag": "p", "text": "Alec was a male Human Jedi Knight who served the Jedi Order during the final years of the Galactic Republic and operated before the Clone Wars started. He began training a Padawan learner, Saren Valek, but lost him to the dark side and then spent several years tracking the person who had seduced Valek."}, {"tag": "p", "text": "Although respected by his peers, Alec was a loner among the Jedi Order, working undercover instead of doing so in tandem with other Jedi. However, he developed a vast array of non-Jedi contacts, including outlaws and spies who helped him in his goals."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Alec was a little-known but respected Jedi Knight active in the last years of the Old Republic. He was training a Padawan learner by the name of Saren Valek until 34 BBY. At that point, Valek was seduced by the dark side of the Force thanks to Karae Nalvas, a fallen Jedi. Valek abandoned his master and took Alec's lightsaber with him."}, {"tag": "p", "text": "From that point onwards, Alec began tracking Nalvas. The Jedi High Council approved Alec's self-imposed mission, confirming that Alec was in no danger of falling to the dark side himself because he only wanted to capture Nalvas to stop him from committing further evils, not to get revenge. As such, the Jedi Order graciously moved out of Alec's way, allowing him to perform his mission anyway he would want, but they were also ready to provide him with backup should he asked for it."}, {"tag": "p", "text": "During the following three years, Alec tracked Nalvas but was unable to stop him. In 31 BBY, Alec discovered Nalvas in the Cularin system, acting under the pseudonym of entrepreneur Fesvk Wefos. The Cularin system had its own praxeum, the Almas Academy, but Alec contacted the Academy and they agreed not to take action until Alec or the Council asked them to."}, {"tag": "p", "text": "Alec discovered that Nalvas was building a city-sized flying fortress in the gas giant Genarius, and Alec theorized that Nalvas would use it to destroy the other cities in the planet, which were the main business, industrial and distribution centers in the Cularin system, and provoke a war. Alec stole the blueprints of this artifact, known as the Conkesta, and disappeared in the Genariusan city of Depatar."}, {"tag": "p", "text": "Depatar, the City of Masks, required any outsider to dress in disguise full time, so Alec got a mask of albino Wookiee. The city was also a bureaucratic conundrum, so outsiders hired specialized permitors to get them the required permits for anything. Alec hired Delan, a very good Twi'lek permitor. He also hired Danil, a guide and pilot, although Alec provided his own ship."}, {"tag": "p", "text": "During his stay in Depatar, Alec researched about the local economy in the Grande Game casino, while at the same time he obtained a good profit. He then visited a bar, Club 111, where he danced and drank Ithorian brandy before leaving with Danil to go the Five Star Entertainment theater. As Alec needed to remain in Depatar for a time, Danil looked for a side-job as theater porter, and Alec used a theater box to hide himself and his earnings. Alec also hired several soldiers to provide him with sniper cover if needed but, as he felt he had no more need for a permitor, he paid Delan a week of vacation in Dorumaa."}, {"tag": "p", "text": "Meanwhile, Nalvas understood what had happened, and recognized the presence of his old sparring. Pretending to be Wefos, Nalvas hired a team of adventurers in nearby planet Cularin to find Alec and the blueprints. Two weeks after Alec's arrival to Depatar, Nalvas told his employees that Alec was a missing courier who was carrying important documents of a new resource extraction device, and his company would suffer without them. Nalvas knew that, should his people find Alec, Alec would tell them the truth. He only wanted to keep Alec busy while Nalvas himself took the blueprints from his supposedly secret hideout."}, {"tag": "p", "text": "Alec noticed the newcomers sent by Nalvas following his tracks through Club 111 and Grande Game. He hired a group of out-of-town thugs to dissuade them, and a permitor for the thugs, Sadana. However, the newcomers were not persuaded and tracked Alec to the theater. Alec met personally with them, with his soldiers providing cover as intended, revealed himself as a Jedi and told them the truth about Nalvas. He refused to hand the blueprints, but offered to greet \"Wefos\". Alec convinced Nalvas's people to join him."}, {"tag": "p", "text": "Danil, Alec and his new friends went to Cularin to their rendezvous with \"Wefos\" in a local tavern, Bath Rabbud's. Nalvas did not appear, sending instead an astromech droid with a hologram of himself mocking and showing the blueprints, and a frag grenade with which he intended to kill his enemies. The explosive was not as effective as Nalvas had expected. Alec survived, and promised to call his new acquaintances as soon as he could form a plan against Nalvas."}, {"tag": "p", "text": "In the following two weeks, Alec discovered that the Conkesta was almost operative and hidden near the core of Genarius. Alec recruited Doctor Shilaea Motacc, an expert in planetary propulsion who had been working for the false Wefos without knowing his real plans. Alec provided Motacc with several slicers, with whom she developed a computer virus to send the non-spaceworthy Conkesta to the outer space, where it should be destroyed. This would require for someone to sneak into the Conkesta and operate the propulsion main control."}, {"tag": "p", "text": "Alec also dealt with a couple of Bothans, who provided them with information: The Conkesta had a deal with a local pirate gang, The Red Fury Brotherhood, with the Brotherhood supplying the Conkesta with consumables and technology. Many of the pirates would be in the annual SoroSuub party of nearby city of Tolea Biqua, leaving their base with an skeleton crew. Alec decided that a small team could steal a shuttle from the pirate base, and then go to the Conkesta in a ship that Nalvas would be waiting."}, {"tag": "p", "text": "Alec contacted with some independent adventurers, the heroes of Cularin, sending a holomessage in a droid. He and Dr. Motacc met with them in the Bath Rabbud's, in the supposed 'fans of foreign drinks' meeting. Alec and Motacc asked the heroes to help them with his plan: If they could raid the Conkesta and load the virus, then Alec himself could go after Nalvas and try to capture him. Alec told them that, should the alarms activate, then they should escape and try again another day; however, Alec's plan included sneaking himself in the Conkesta and activate the virus during the chaos."}, {"tag": "p", "text": "While the heroes of Cularin were performing their task, Alec found and chased Nalvas from the moment Nalvas left the Cularin system asteroid belt, but Nalvas managed to lose Alec. Alec then went to Tolea Biqua, discovered that the heroes of Cularin had successfully finished their mission, and greeted them during the city-wide party. Alec managed a honor reception for his friends, including Jedi from the Almas Academy and authorities from Genarius."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although he knew how to go unnoticed, Alec was a charismatic person who could easily attract other people to work with them, including Shilaea Motacc and several slicers and Bothans, as well as at least ten soldiers or mercenaries during his stay in Depatar. He was nevertheless a lone wolf, rejecting the help of the Jedi Order or the Almas Academy in favor of a one-man approach to the mission — even if his mission, the capture of Karae Nalvas, had been avoiding him for several years. Some people considered Alec to be a paranoid and simply ignored him."}, {"tag": "p", "text": "Contrarily to other Jedi, Alec used both a blaster pistol and a lightsaber, which is believed to have been built by someone other than himself. Even then, he was very respected among the Jedi: The Almas Academy, recognizing that Nalvas was a threat, agreed to not move against Nalvas until Alec (or the Jedi Council) asked them to."}, {"tag": "p", "text": "Alec was a dedicated warrior, relentlessly tracking Nalvas to bring him to justice, but refusing any personal vendetta against him and avoiding so the dark side of the Force. At the same time, he apparently considered Valek to be a lost cause, not worth a tear in his state as a servant of the darkness: Alec only talked about Valek as a powerful enemy to be vanquished. When Valek was killed, Alec asked for Valek's lightsaber, but this might have been because it had been built by Alec himself."}, {"tag": "p", "text": "Alec was in good terms with many Jedi, including several Jedi Twi'leks. He had never met Nerra Ziveri."}, {"tag": "p", "text": "Alec hired some of his helpers, including Danil, his personal pilot and guide to Depatar; and Delan, his permitor in Depatar. This staff was qualified, handsomely rewarded and ready to stay with Alec for unexpected lengths of time, suggesting that Alec had access to money to pay them. He was known to earn money gambling, and he might use his Force skills to influence the randomness of the games. He did own a ship, but lacked the skills to pilot it."}, {"tag": "p", "text": "Although Alec's fighting skills and general prowess were well below his enemy Nalvas's, Nalvas chose to run away from the system instead of dueling him. Later, Alec left the system to track Nalvas again."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}