{"url": "Furies_Gate", "categories": ["Category:Legends articles", "Category:Tython system planets"], "nodes": [{"tag": "h1", "text": "Furies Gate"}, {"tag": "p", "text": "Furies Gate was the outermost planet of the Tython system that was located within the galaxy's Deep Core region. The cold and barren world was colonized more than thirty-six thousand years before the Battle of Yavin by the non–Force-sensitive settlers of the planet Tython. Several thousand years before 25,793 BBY, a space station called Fury Station was established in orbit around Furies Gate and for a long period of time served as a launch point of Tythan sleeper ships traveling into the Deep Core. By 25,793 BBY, the station still orbited Furies Gate and served as a scientific outpost."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Furies Gate was a planet with no moons that was located within the Tython system of the galaxy's Deep Core region, at galactic coordinates L-10. The world occupied the eleventh—the outermost—orbital position around its sun Tythos, and was a cold, mostly barren planet that appeared to be brown in color from space. A space station called Fury Station orbited Furies Gate, with the station's crew being the only sentient presence on the desolate world."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "More than a millennium after the year 36,453 BBY, Furies Gate was colonized by the non–Force-sensitive settlers of Tython—the fifth planet of the Tython system—traveling to Tython's neighboring worlds. Several thousand years before 25,793 BBY, Fury Station was established in orbit around Furies Gate, and, over the millennia since its establishment, the station was used as a launch point of several Tythan sleeper ships that traveled into the Deep Core. By 25,793 BBY, Fury Station still orbited Furies Gate and was run as a scientific outpost under strict treaty by the Settled Worlds of the Tython system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Furies Gate was first pictured in the entry for Tython in The Holonet feature of the official website for Star Wars: The Old Republic—a 2011 massively multiplayer online roleplaying game developed by BioWare. The planet was depicted in a schematic of the Tython system. Since its establishment in 2008, The Old Republic's website has gone through a number of changes, resulting in the removal of some of the features and images that were originally located there, including the aforementioned schematic. Furies Gate's name and additional information on it were provided in Star Wars: Dawn of the Jedi 0, a preview issue of the Star Wars: Dawn of the Jedi series of comic books. The issue was published on February 1, 2012, and was written by John Ostrander and penciled by Jan Duursema. The planet was also mentioned in the first issue of the series and made its first in-universe appearance in the second issue—published on February 15 and March 21 of the same year, respectively."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}