{"url": "Alec_Efran", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Coruscant Security Force officers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Alec Efran"}, {"tag": "p", "text": "Alec Efran was a Human male who served as a police officer with the Coruscant Security Force during the Cold War between the Galactic Republic and the Sith Empire. Around 3643 BBY, Efran arrested a Gand criminal who was wanted for questioning by the Jedi Order for the theft of the Noetikon of Science, a special holocron. Efran held the Gand until the arrival of the Jedi Consular Barsen'thor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Alec Efran lived on the planet Coruscant during the Cold War between the Galactic Republic and the Sith Empire. At that time, he served as a police officer in the Coruscant Security Force. Around 3643 BBY, Efran engaged in a fight with and was able to arrest a Gand criminal who was connected to the theft of one of the Jedi Order's prized special holocrons, called noetikons, the Noetikon of Science. He held the Gand in the Old Galactic Market for questioning by a Jedi."}, {"tag": "p", "text": "A young Jedi Consular arrived not long afterward to question the Gand. While the Gand had not been forthcoming with Efran, the Consular was able to get him to talk and reveal the information on the Neotikon's location."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A short and younger-looking Human, Efran had blue eyes, blond hair, and light-colored skin. While a competent officer who did not have difficulty engaging in fights to make arrests, Efran was uncomfortable around Jedi, having had little experience interacting with them. When he was in the presence of a Jedi, Efran spoke in a quieter and softer voice than usual and frequently stumbled through his sentences."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While on duty, Efran wore his CSF uniform with a blast vest. He also wore a utility belt, which carried his blaster and stun cuffs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alec Efran appears in the Jedi Consular mission \"Secret Signals\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. The player undertakes a mission to discover the missing Noetikon of Science and, through the course of the mission, interacts with Efran. Instead of choosing the light side questions and methods during the questioning, the player can opt for more forceful questioning and thereby receive dark side points."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}