{"url": "Fury-class_Imperial_interceptor", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Fury-class Imperial interceptors", "Category:Sith Empire starfighter classes", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Fury-class Imperial interceptor"}, {"tag": "p", "text": "The Fury-class Imperial Interceptor was a starship used by the reconstituted Sith Empire during the Great Galactic War and its resultant Cold War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Fury-class transports were commonly utilized by prominent Sith Warriors and Sith Inquisitors as their bases of operations throughout important missions on which they were assigned. For this the interior included a large communications room with a holoprojector, as well as cabins for the ship's crew and a conference room."}, {"tag": "p", "text": "The bridge was located in the center at the front of the ship. It featured numerous computer panels as well as seats for the pilot and co-pilot, all overlooked by the commanding officer's seat in the center of the bridge. The weaponry of the Imperial interceptor was four high powered laser cannons and missiles to inflict a large amount of damage in a short time along with military grade shielding in order to survive space battles and starfighter combat situations. The Imperial Interceptor was also easily upgradable for a variety of situations whether to destroy an enemy shuttle to stripping the weaponry of the larger Republic warships in order to lessen damage for the allied forces."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At least three of these transports were present when the Empire retook Korriban in the early years of the Great Galactic War, one of them carrying Vindican and his apprentice, Malgus, to the space station near the planet. The transports were stationed in the hangars of Imperial battlecruisers and used by personnel within the Empire. One such owner was Teneb Kel, who used his Fury-class transport during his hunt for Exal Kressh."}, {"tag": "p", "text": "The Fury-class Imperial Interceptor was widely produced and used regularly within the Imperial Armada during the reconquest of Ord Radama along with a force of 4 Harrower-class dreadnoughts, 45 Fury Imperial Interceptors and 192 ISF interceptors was present and under the command of Darth Malgus prior to an assault on the Core Worlds during the Great Galactic War. Near the end of the Cold War, another ship of this class was given to a promising young Sith Lord under the apprenticeship of Darth Baras called the Emperor's Wrath. They would use the ship as a transport to numerous worlds in order to do his master's bidding until Quesh where the Wrath was betrayed. The ship would later become the mobile base for the Wrath and their allies leading up to the events that would have them defeat their former master."}, {"tag": "p", "text": "Around the beginning of the Galactic War, another Fury-class ship was given to a Sith Inquisitor by the newly promoted Darth Zash in order to find the lost artifacts of Tulak Hord that would help Zash steal her apprentice's body for her own. After the death of Zash in the aftermath of a battle between the master and the apprentice that the inquisitor used the ship as their mobile base of operation to fight against Darth Thanaton and in the search of Force ghosts to gain more power to defeat him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The Fury-class interceptor was designed by the concept art team under Ryan Dening, the senior concept artist for Star Wars: The Old Republic. When they began developing the vessel, the team had already decided on a geometric style of smooth surfaces and a large number of angles for the Imperial ships, and they were unable to deviate a great deal from this style as the ship was intended to be factory-issue."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}