{"url": "Fury_Station", "categories": ["Category:Legends articles", "Category:Deep Core space stations", "Category:Orbital stations", "Category:Tython system"], "nodes": [{"tag": "h1", "text": "Fury Station"}, {"tag": "p", "text": "Fury Station was a space station that orbited the planet Furies Gate in the Tython system of the galaxy's Deep Core region. The station featured an observatory that could be used to look outward at the rest of the Deep Core, and it was equipped with sensor and communications systems. Fury Station's crew, which numbered at least two, was the sole sentient presence on Furies Gate. The space station was constructed by the settlers of the Tython system several millennia before the year 25,793 BBY, and, over the thousands of years since its establishment, the station was used as a launch point of Tythan sleeper ships traveling into the Deep Core."}, {"tag": "p", "text": "By 25,793 BBY, Fury Station was used as a scientific outpost and was run under strict treaty by the Settled Worlds of the Tython system, with the Human Gost serving as the station's captain. That year, the Devourer—a starship of the Infinite Empire—approached Fury Station and was detected by the station's sensors. Unexpectedly, the Devourer vanished from Fury Station's sensors, and the Twi'lek Je'daii Ranger Hawk Ryo, who was present on the station's bridge at that time, left Fury Station in his starfighter to notify the planet of Tython of the situation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Fury Station was a space station that orbited Furies Gate—the outermost planet of the Tython system that was located within the galaxy's Deep Core region. The station consisted of a rounded central part from which four long modules extended at right angles. In addition, three long components also extended from the lower part of the central module. Fury Station featured a command bridge and at least one starship hangar capable of housing a Hunter-class starfighter, as well as an observatory that could be used to look outward at the rest of the Deep Core. The space station was equipped with sensors that were used to monitor the space for any incoming starships, and communications systems were also installed on the station and were used to send messages to the rest of the Tython system worlds."}, {"tag": "p", "text": "By the year 25,793 BBY, Fury Station's crew numbered at least two—the station's captain and a sensor officer. Nine other individuals were also on the station's bridge that year. The space station's crew wore gray-colored uniforms and were the only sentient presence on the desolate world of Furies Gate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Fury Station was constructed by the settlers of the Tython system several millennia before 25,793 BBY, and, over the thousands of years since its establishment, the station was used as a launch point of Tythan sleeper ships traveling into the Deep Core, however none of the starships returned to the star system. By 25,793 BBY, Fury Station was used as a scientific outpost and was run under strict treaty by the Settled Worlds of the Tython system, with the Human Gost serving as the station's captain."}, {"tag": "p", "text": "That year, the Devourer—a starship of the Infinite Empire—approached Fury Station and was detected by the station's sensors. The space station's Sith sensor officer notified Gost of the approaching vessel and suggested that a Tythan sleeper ship was finally returning home, however both of them expressed their concern regarding the starship's lack of response to Fury Station's hails and the fact that the vessel's sensor readouts didn't match any of the Tythan starships. Suddenly, the Devourer vanished from Fury Station's sensors, and Gost ordered the sensor officer to notify the other worlds of the Tython system about the situation. The Twi'lek Je'daii Ranger Hawk Ryo, who was also present on the station's bridge at that time, then proceeded to Fury Station's hangar where his starfighter was docked. From there, Ryo sent a warning message to Je'daii Temple Master Ketu on the planet of Tython, and then left the space station for Tython in his fighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fury Station was first mentioned in Star Wars: Dawn of the Jedi 0, a preview issue of the Star Wars: Dawn of the Jedi series of comic books. The issue was published on February 1, 2012, and was written by John Ostrander and penciled by Jan Duursema. The space station made its first in-universe appearance in the second issue of the series, published on March 21 of the year 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}