{"url": "Fuzzy_as_an_Ewok", "categories": ["Category:Real-world articles", "Category:Ewok Adventure books"], "nodes": [{"tag": "h1", "text": "Fuzzy as an Ewok"}, {"tag": "p", "text": "Fuzzy as an Ewok was a touch and smell book for young readers published the same time as Shiny as a Droid. According to Bantha Tracks #31, the book allowed very young children to \"be able to sniff the Ewoks' \"rainbow berries\".\" It was one of two \"Things to See, Touch, and Smell from a Galaxy Far, Far Away\" books, the other being Shiny as a Droid."}, {"tag": "p", "text": "The story invites the reader to help Wicket and Kneesaa search for items for the sacred Festival of the Wisties."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Now young children can travel to the fantastic forest moon of Endor and scratch and sniff rainbow berries, touch a fuzzy fungus, search for a lantern bird feather—and more—while helping Wicket and his Ewok friends prepare for the Wistie Festival."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The day before the Festival of the Wisties (another favorite holiday of the Ewoks), Shaman Logray enlists the help of Wicket and Kneesaa to gather items for the festival. The Ewoks gather brilliba tree fungus for a bonfire, a lantern bird feather for Chief Chirpa's headdress, a gwanda gourd for a Wistie Dance rattle, four starchains for decoration, and some ripe rainbow berries."}, {"tag": "p", "text": "The night of the festival, the Ewoks and Wisties celebrated around a bonfire and enjoyed some Wistie Fest pie. Chief Chirpa heralded it as \"the best Wistie Fest ever!\" and thanked Logray, but the wizard passed credit on to the two young Ewoks who had helped him prepare for the festival."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Timeline"}, {"tag": "p", "text": "Like most of the Ewoks books, the timeline placement of Fuzzy as an Ewok is still somewhat ambiguous, but given the appearances of the characters, it is possible that it takes place somewhere around the time of the first season of Ewoks."}, {"tag": "h2", "text": "Bibliography"}]}