{"url": "Alec_Pradeux", "categories": ["Category:Legends articles", "Category:Bureaucrats of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Alec Pradeux"}, {"tag": "p", "text": "Alec Pradeux was a privy advisor to Emperor Palpatine."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Imperial advisor"}, {"tag": "p", "text": "Alec Pradeux was an advisor to Emperor Palpatine during the Galactic Civil War. A charismatic man who knew how to deal with the media, he was one of Palpatine's closest advisors, and was reputed to have had the Emperor's ear. He wielded as much power as many a Grand Moff, including Vilim Disra, and was considered a political powerhouse, and was very well known. Pradeux was Palpatine's official liaison with the newsnet, often providing the media with propagandized information that put the Empire in a better light and dispelling rumors and inaccuracies with regular statements. Pradeux also carried out various other roles for the Emperor."}, {"tag": "h3", "text": "The Candorian plague"}, {"tag": "p", "text": "In 1 ABY, the people of the Imperial-controlled world of Dentaal ousted the Empire from their homeworld and declared themselves independent. Crix Madine and the newly-founded Imperial storm commandos surreptitiously released the deadly Candorian plague on the world in retaliation. The plague, which had once engulfed almost the entire galaxy, over a thousand years prior, had not been seen in dozens of years, but the Empire had kept samples of it for such use. Airborne, quick-spreading, and extremely contagious, no cure was known for it, and within a matter of weeks Dentaal had become an uninhabited, desolate wasteland, over ten billion people having died of the disease. Pradeux was tasked with leading a faux investigation into the outbreak and informing the media of his supposed findings."}, {"tag": "p", "text": "Some weeks later, Pradeux made a statement to Imperial HoloVision on the affair. The Empire had conceived a story blaming the outbreak on the Alliance to Restore the Republic, and Pradeux duly delivered it to Imperial citizens, spreading lies that the Rebels had engineered the disease in their labs on Alderaan. According to Pradeux's report, the Emperor had made efforts to terminate the Rebels' samples of the disease, but he had not been quick enough to act before some quantities of it had been smuggled offworld. Pradeux alleged that the samples, contained in small canisters, had found their way to Dentaal, but that that was not their intended target; he stated that the Rebels had accidentally released the deadly disease, with galactic capital Coruscant their intended target. While Pradeux maintained that the events on Dentaal were a tragedy, he told viewers to be aware of how close the Rebels had come to killing off the population of Coruscant, and told them that more canisters containing samples of the Candorian plague might still exist elsewhere. Praduex's statement discredited and vilified the Rebel Alliance, and kept the Imperial citizens in fear, and thus easier to rule, according to the Imperial Doctrine of Fear."}, {"tag": "h3", "text": "New allies"}, {"tag": "p", "text": "In the following months, Pradeux became one of numerous Imperial advisors to join the emerging Imperial court faction of Grand Admiral Rufaan Tigellinus, who had decided to try his hand at court politics. Tigellinus' alliance with Pradeux was a key aspect of his rise to power, and one that was well documented by the media. The two would stay allies for a number of years."}, {"tag": "p", "text": "During the New Year Fete Week of 3 ABY, Pradeux was once again in the media spotlight. Palpatine was unable to attend the festivals for the second year in a row, and Pradeux was the one to deliver the message to the masses. He informed the public that Palpatine was in good health and spirit, but would be unable to attend celebrations because he was conducting official Imperial business in the Deep Core; Pradeux also implied that the Emperor was finalizing plans to wipe out the Rebel Alliance. Addressing the issue that many other notable Imperials, such as Pradeux's ally, Tigellinus, and Darth Vader, had not deigned to attend either, the newsnet liaison stated that the Empire required constant and careful supervision to ensure that everything ran efficiently and order was maintained. In Palpatine's stead, Pradeux and fellow advisors Kren Blista-Vanee, Sate Pestage and Bregius Golthan presided over the majority of the Fete Week celebrations."}, {"tag": "p", "text": "Palpatine returned to Coruscant approximately three weeks later, and one of his first acts was to meet with Imperial advisor Bregius Golthan. Immediately thereafter, Golthan was made Imperial Minister of Security and dispatched to the Core Worlds. His promotion was not made public, but Pradeux informed news reporters of it around a week later, during a press conference. He made a statement, ostensibly to dispel persistent rumors that Golthan was ill, and to inform the public of his appointment; he made it clear that Golthan's role with the military was purely an advisory one."}, {"tag": "h3", "text": "Later activities"}, {"tag": "p", "text": "Pradeux's ally Tigellinus—now a Grand Moff—was once again in the news a number of months later, though not for the usual reasons. He had been appointed to oversee investigations into the financial activities of Brentaal IV Governor Jerrod Maclain, which surprised court observers, who did not expect to see such a high-flying and prominent Imperial—and a member of the prestigious, exclusive Order of the Canted Circle relegated to such mundane duties. Pradeux made a statement on the matter, stating that the Emperor's choice was final, and pointing out that Tigellinus' appointment merely highlighted the severity of the matter."}, {"tag": "p", "text": "He allied himself with Tigellinus after the Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}