{"url": "Fw%27Sen-class_picket_ship", "categories": ["Category:Legends articles", "Category:Gunship classes", "Category:Ssi-ruuvi starship classes"], "nodes": [{"tag": "h1", "text": "Fw'Sen-class picket ship"}, {"tag": "p", "text": "The Fw'sen-class picket ships were small gunships used by the Ssi-ruuvi Imperium. Although the vessel's main role was to disable enemy vessels and guard Ssi-ruuvi fleets, their delicate frameworks and inefficient shields resulted in them frequently being used in suicide missions."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Each Fw'sen-class picket ship was crewed by thirteen P'w'ecks and six enteched servant droids, although the ships could be remotely piloted by Ssi-ruuk cruisers. This remote piloting option, combined with the design choice to forgo thick hull plating for shield generators, demonstrated a Ssi-ruuvi intention to sacrifice the picket ships where tactically necessary."}, {"tag": "p", "text": "The Fw'sen-class took the ovoid overlapping shell shape of other Ssi-Ruuvi starships, although it featured a set of four small wings for stabilization during atmospheric flight."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Bakura Incident, and subsequent Invasion of Bakura, the Ssi-Ruuk fielded twenty Fw'sen-class picket ships. The Imperial defenses destroyed five of the ships during the preliminary battle, while the rest were destroyed or captured by the Rebel Alliance relief force that arrived to rescue Bakura. Years later, Fw'sen-class picket ships were used during a second invasion of Bakura."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Truce at Bakura Sourcebook lists the ship's length at 45 meters, while the The Essential Guide to Vehicles and Vessels lists it at 50 meters. The two sources also differ on the armament of the picket ship. The former lists the armament of the ships as a pair of bow laser cannons, fin- and keel-mounted turbolasers and six ion cannons, while the later excludes the Super-Charged Turbolaser batteries in description (but not the blueprints)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}