{"url": "Fy-Tor-Ana", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Jedi instructors", "Category:Jedi Purge victims", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Fy-Tor-Ana"}, {"tag": "p", "text": "Fy-Tor-Ana was a female Human Jedi Master who served the Jedi Order as an instructor at the Coruscant Jedi Temple during the waning years of the Galactic Republic. After the start of the Great Jedi Purge and establishment of the New Order, Solace was the name she gave herself when she hid underneath the bedrock of Coruscant. Believed to be a location, Solace was discovered by former Jedi Ferus Olin to be the Jedi Master."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human Force-sensitive, Fy-Tor-Ana was trained in the ways of the Force by the Jedi Order, ascending to the rank of Jedi Master after crafting a green-bladed lightsaber and completing the Trials of Knighthood. While a respected Jedi she was known as reclusive, rarely interacting with her fellow instructors and refusing to take a Padawan for herself. Renowned for her split-second reflexes, her grace, and her agility, Master Ana was appointed as an instructor at the Coruscant Jedi Temple by the Jedi High Council. Teaching the technique known as the Art of Movement to Jedi Initiates at the Temple academy, Master Ana's classes occupied the obstacle course. During her time as an instructor, Master Ana instructed countless Initiates, including a young Obi-Wan Kenobi."}, {"tag": "p", "text": "A survivor of the Clone Wars, a bloody conflict between the Republic and the Confederacy of Independent Systems, Master Ana was forced into hiding when Supreme Chancellor Palpatine issued Contingency Order 66 to the Grand Army of the Republic, effectively disbanding the Jedi Order. Fleeing the slaughter of the Great Jedi Purge, Master Ana took shelter on the Jedi-world Ilum with fellow Master Garen Muln. Hiding amongst the frozen wastelands' Crystal Caves, Ana was not able to remain ignorant of the state of the Republic for long and soon departed Ilum alone for Coruscant. When Ana did not return, Master Muln feared that she was dead. Muln relayed his information on Fy-Tor-Ana's plans to former Jedi Ferus Olin who had visited Ilum in search of survivors; Olin then left for Coruscant to find the missing Jedi."}, {"tag": "p", "text": "In fact, Master Ana had made it to Coruscant and, finding the Jedi Temple in ruins, was forced underground. Delving deep into the crust of the ecumenopolis, Master Ana assumed control of a settlement established above an expansive subterranean ocean. Taking the name of Solace, Master Ana's existence became mythical, leaving the Jedi behind her and striving to assist those fleeing persecution by the Galactic Empire. When Ferus Olin arrived on Coruscant, he heard rumors that Ana was held in the bowels of the Temple. Finding the Temple occupied by stormtroopers but vacant of all Jedi, he followed rumors down to the crust and began seeking what he believed to be a settlement known as Solace. A guide met him at the mouth of the subterranean passage and led Olin down to the hidden city, only then revealing her identity as the former Jedi Master."}, {"tag": "p", "text": "Rather derisive when Olin attempted to get her to return to the Temple, Ana was finally convinced when Olin explained that Imperial Inquisitor Malorum had planted a spy in her midst. Agreeing to help Olin and his associate Trever Flume infiltrate the Jedi Temple and eliminate Malorum's chances of locating them, she led them into the Temple's heart only to find themselves trapped by Imperials. When they were ambushed, Ana was forced to abandon Olin while escorting the young Flume back out of the Temple, returning to her settlement in the midst of an attack. With her new world burning, she was able to rally survivors and flee to the surface. Master Ana and Flume, joined by the Bothan Oryon and former reporter Keets Freely journeyed to Dexter Jettster's hideout and asked him for help finding Olin. They located him on a ship with his friend Clive Flax, escaping the prison world of Dontamo. They followed Malorum to the planet of Naboo and were aided by Boss Rugor Nass and the Gungans in their attempt to take back Naboo."}, {"tag": "p", "text": "Later, when Olin had to help Emperor Palpatine on the planet Samaria, Master Ana went to Bellassa to rescue Roan Lands and Dona Telamark, two of Olin's friends, from execution. She went with Oryon and Flume and got help from The Eleven, and was able to succeed. They went to Samaria to help Olin save Astri Oddo and her son Lune from stormtroopers. They all escaped except Olin, who stayed on the planet, knowing that Palpatine would have more things for him to do. In their down time, the Jedi and their crew of misfits based themselves on a hidden asteroid near to Bellassa, preparing it for Olin's dream to locate Jedi survivors there."}, {"tag": "p", "text": "When the asteroid was finally discovered by the Empire, Masters Ana and Muln assured that the young Lune Divinian made it off before the Imperials unleashed the fury of their secret superweapon, destroying the asteroid and the Jedi. Before her death, Master Ana was at peace with the Force and her allies, proud to die as a Jedi amongst friends."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}