{"url": "Fyg_Boras", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Wookieepedia Good articles under probation", "Category:Males", "Category:New Republic Senators", "Category:Vors"], "nodes": [{"tag": "h1", "text": "Fyg Boras"}, {"tag": "p", "text": "Fyg Boras was a Vor male senator of the New Republic who represented the planet Vortex in the New Republic Senate in 27 ABY. During the Yuuzhan Vong invasion of the galaxy, Vortex was among the many worlds that fell to the invaders. Eventually, the galactic capital Coruscant was also captured, forcing Boras and the other surviving members of the New Republic to take refuge on the planet Mon Calamari."}, {"tag": "p", "text": "When former smuggler-turned-businessman Lando Calrissian and Smugglers' Alliance leader Talon Karrde arrived on Mon Calamari with relief supplies, the pair approached Boras and struck an arrangement with him. They would provide him with twenty-five tons of relief supplies that were to be distributed to the refugees; in return, Boras was to vote for an amendment authorizing the New Republic to purchase Calrissian's YVH 1 battle droids."}, {"tag": "p", "text": "However, Boras decided to sell the supplies for his own profit rather than giving them freely. Knowing that he would not be reelected to the Senate while his homeworld was under Yuuzhan Vong occupation, Boras chose to prioritize his future well being instead. On their next meeting, Calrissian and Karrde were able to blackmail the Vor senator into switching his vote for the next Chief of State from Fyor Rodan to Cal Omas by producing a holo-recording of their initial meeting with Boras."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "The Vor male Fyg Boras was a New Republic senator who represented his homeworld of Vortex in the New Republic Senate sometime in the middle of the Yuuzhan Vong War, a galaxy-wide conflict between the New Republic and the warlike Yuuzhan Vong."}, {"tag": "p", "text": "In 27 ABY , during the war, Vortex was captured by the Yuuzhan Vong, leaving many of its inhabitants as refugees. Later on in the year, the galactic capital planet Coruscant was also captured by the Vong, causing Boras to flee the doomed capital and make his way to the planet Mon Calamari along with the other surviving members of the New Republic government."}, {"tag": "p", "text": "Due to former Chief of State Borsk Fey'lya's recent death during the attack on Coruscant, an election for the next Chief of State was held. Boras was part of a faction of senators who supported Fyor Rodan, a senator known for his dislike of the Jedi Order headed by Luke Skywalker. When former smuggler Lando Calrissian—now running the battle droid-manufacturing corporation Tendrando Arms—and Smugglers' Alliance chief Talon Karrde arrived on the planet, they offered their services to Skywalker in making sure that Cal Omas, a senator who supported Jedi involvement in the war, would win the election."}, {"tag": "h3", "text": "Election of a New Chief of State"}, {"tag": "p", "text": "The pair arranged a private meeting with Boras, as well as several senators from Rodan's faction. Calrissian and Karrde offered Boras twenty-five metric tons of refugee supplies to be given out to the Vor survivors on Mon Calamari. In return, they asked that the senator cast his vote for an amendment in an upcoming military appropriations bill, which would see the New Republic Military purchase YVH 1 battle droids from Tendrando Arms. Boras agreed to the request, and, with the support of other similarly bribed senators, the amendment was approved in a rapid manner."}, {"tag": "p", "text": "Having been given the supplies, however, Boras decided to sell them for his own profit. Thinking of his future, Boras realized that with his homeworld under Yuuzhan Vong occupation, and without a homeworld to vote for him, his chances of being reelected were slim. However, Boras did not anticipate that Karrde and Calrissian would bribe a large number of other senators and flood the market with their own relief supplies, which kept the price of commodities low. With this turn of events, Boras was barely making profits while paying the warehouses that stored his own stock of relief supplies."}, {"tag": "p", "text": "Shortly after the amendment was passed, Calrissian and Karrde met with Boras once more to convince him to throw his support for Omas. When Boras declined and reaffirmed his commitment to Rodan, Karrde showed him a holo-recording of their initial meeting, which showed Boras accepting the bribe to vote for the amendment. Boras argued that if the holo was publicly revealed, Calrissian and Karrde would also be guilty of bribery."}, {"tag": "p", "text": "Calrissian informed the Vor senator that what they intended to show was the fact that the relief supplies were supposed to be distributed for free to the refugees, not sold. He also reminded Boras that if such an act was proven, it would be considered illegal. To prevent the holo from being circulated, Boras ultimately announced public support for Omas's bid for Chief of State. With a large number of Rodan supporters—whom Calrissian and Karrde bribed or blackmailed—changing their votes, Omas won the election."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Having lost his homeworld to the Yuuzhan Vong, and worried that he wouldn't be reelected as a senator, Boras grew corrupt and readily accepted a bribe from Lando Calrissian and Talon Karrde in order to secure his financial future. Even though Calrissian explained that the relief supplies they were giving the senator were intended for the Vor refugees on Mon Calamari, Boras felt no remorse in secretly selling the supplies instead."}, {"tag": "p", "text": "When Calrissian and Karrde flooded the local market with supplies, thus bringing the prices down, Boras was more concerned that his sale profits were barely breaking even with the costs of warehousing his own stock, as opposed to caring about the welfare of his people. Boras favored a type of cologne with a discreet mint scent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Fyg Boras is a character created by author Walter Jon Williams for the 2002 novel The New Jedi Order: Destiny's Way, the fourteenth installment in Star Wars: The New Jedi Order series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}