{"url": "Fxz%27Et", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Class 720 freighters"], "nodes": [{"tag": "h1", "text": "Fxz'Et"}, {"tag": "p", "text": "The Fxz'Et was a Ghtroc Industries Class 720 freighter that had been abandoned on the planet Kal'Shebbol in the Kathol sector of the Outer Rim Territories prior to 8 ABY. Recovered by the Verpine technician Kyli Ned'Ix, the vessel was heavily modified and enhanced using spare junk components. Ned'Ix used the vessel to tail the New Republic CR90 corvette FarStar during its expedition to find Moff Kentor Sarne, an Imperial warlord who had fled Kal'Shebbol following its liberation by the New Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Fxz'Et was a thirty-five meter long Ghtroc Industries Class 720 freighter, considered to be \"ancient\" by 8 ABY. The vessel was heavily modified by the Verpine technician Kyli Ned'Ix for use as his own personal ship. The Fxz'Et was equipped with a Class Two hyperdrive, with a slower Class Ten back-up module, and had a navigation computer installed. The ship could attain speeds of 800 kmh in atmosphere. Ned'Ix enhanced the ship using junk components that he had personally modified to increase the performance of the craft, and added a single small laser cannon and a pair of proton torpedo launchers with a magazine of three torpedoes each for defense. The hold of the vessel was full of scavenged junk—including disassembled droids, fused turbolaser circuit boards, and ion drive power couplings—that Ned'Ix used to create new gadgets. Ideally, the ship was designed to be operated by a crew of three, with room for a single passenger, although Ned'Ix crewed the Fxz'Et on his own during his time in the Kathol sector. The Fxz'Et could carry 135 metric tons of cargo, and could store enough consumables to last two months."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point, the vessel that would become the Fxz'Et was abandoned on the planet Kal'Shebbol, sector capital of the Kathol sector. In 8 ABY, the New Republic launched an assault on the planet in an effort to oust the Imperial warlord Moff Kentor Sarne. The mission was partially successful; the planet was freed, but Sarne escaped into the Kathol sector with the majority of his forces."}, {"tag": "p", "text": "The New Republic authorized a mission to track down Sarne and neutralize any threat he may still have posed, assigning the CR90 corvette FarStar to the task. Due to manpower shortages, the New Republic was forced to call for civilian volunteers from Kal'Shebbol to crew the vessel. Ned'Ix applied, but was turned down by the command crew since they felt his penchant for jury-rigging equipment would be a liability. Undeterred, he recovered and repaired the abandoned freighter, modifying the vessel using junk components left behind by both Imperial and New Republic forces. Making the vessel spaceworthy, he named the ship \"Fxz'Et\" and launched after the FarStar. Ned'Ix used the vessel as he traveled through the Kathol sector, assisting the New Republic expedition when he was able to."}, {"tag": "h2", "text": "Owners and operators"}, {"tag": "p", "text": "The Fxz'Et was owned and operated by the Verpine master technician Kyli Ned'Ix. Ned'Ix also fancied himself as an adventurer, and—having failed to join the FarStar mission—resolved to follow the ship in his freighter and offer any assistance he may have been able to render."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Fxz'Et's only appearance was in the \"Rogues Gallery\" section of The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}