{"url": "Fyor_Rodan", "categories": ["Category:Legends articles", "Category:Commenori", "Category:Confederation officials", "Category:Humans", "Category:Males", "Category:New Republic Senators", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Fyor Rodan"}, {"tag": "p", "text": "Fyor Rodan was a Human male who served as a New Republic Senator, and a member of Chief of State Borsk Fey'lya's Advisory Council. Rodan was believed to have connections to smuggling interests on his homeworld Commenor when in reality it was his elder brother Tormak who did. Most believed his supposed smuggling interests to be the root of his anti-Jedi politics; however, it was merely due to the fact that they demanded government favors where the Senate had no oversight as to what the Jedi did. After Fey'lya's death he supported self-appointed Chief of State Pwoe. The senate however denounced Pwoe in 28 ABY and Rodan ran to replace Fey'lya as the legitimate New Republic Chief of State. Rodan led after the first two floor votes but, due to Talon Karrde and Lando Calrissian's threats of bribery accusations against some of Rodan's supporters he was defeated by the pro-Jedi Cal Omas. He was Prime Minister of Commenor as of 40 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "During the Yuuzhan Vong War Rodan was part of the anti-Jedi majority, and possibly the most anti-Jedi member of the New Republic Advisory Council, calling it a quaint philosophy right in front of Jedi Master Luke Skywalker. During the Battle of Coruscant, Rodan acted rather bravely, staying at his post until he was evacuated by the military at the last moment. Rodan was one of the few members of the New Republic Advisory Council to reach Borleias after escaping Coruscant, where he supported Pwoe, who had proclaimed himself Chief of State after Borsk Fey'lya's death on Coruscant. He soon realized that Pwoe had proclaimed himself Chief of State for his own personal gain, and rejoined the rest of the Senate on Mon Calamari, where the Senate planned to elect a legitimate Chief of State. Rodan was rumored to be connected to smuggling interests on Commenor, which many believed was the source of his opposition to the Jedi. In truth, it was actually his elder brother, Tormak, whom he absolutely hated, as it was a hindrance to his political career. Rodan's opposition to the Jedi stemmed from a belief that they demanded government favors, while the Senate had no oversight."}, {"tag": "h3", "text": "Running for Chief of State"}, {"tag": "p", "text": "On Mon Calamari Rodan became a candidate to succeed Borsk Fey'lya as Chief of State. Rodan was considered to be the anti-Jedi candidate in the election. Rodan's competitiors in the election were the pro-Jedi Senator Cal Omas, Twi'lek Senator Cola Quis, and Senator Ta'laam Ranth of Antar 4 whom many thought would trade his supporters for political favors. The first round of voting saw Rodan with 35% of the vote, Omas with 28%, Ranth with 18%, and Quis with 10%. Quis subsequently dropped out of the election. At this point smugglers Talon Karrde and Lando Calrissian arrived with 16 ships full of supplies and YVH 1 war droids. They decided that they wanted to help Omas win the election by donating the supplies to Rodan's more questionable allies in exchange for their support in purchasing the YVH's in an upcoming military appropriations bill. This saw the next round of voting with Rodan still leading with 37%, Omas with 35% and with Ranth 22%. Calrissian and Karrde made one more round to senators they had donated the supplies to. They revealed that they had recorded the conversation and in order to avoid accusations of bribery they would have to vote for Omas in the upcoming election. In the third round of voting Omas took the lead with 46%, Rodan dropped to 24% of the vote and Ranth to 20% of the vote. Ranth was convinced to support Omas in exchange for his continued chairmanship of the justice council. The next day Omas won the election with 85% of the vote, while Rodan had just 12%. Omas formed the High Council, which included 6 Jedi and 6 government members. Rodan was offered the option of retaining his seat on the Advisory Council, but he refused both the appointment or to consider Omas the legitimate Chief of State. Nevertheless, he remained loyal to the New Republic and its successor the Galactic Federation of Free Alliances."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "By the time of the Second Galactic Civil War in 40 ABY, Rodan was the Prime Minister of Commenor and had openly expressed sympathies for the Corellian cause. He was manipulated by a disguised Lumiya, who convinced him with outdated but detailed plans held by the Galactic Alliance to invade Commenor, to overtly join forces with the Corellians by lending Commenor's fleet alongside the Bothans in an effort to break the Galactic Alliance blockade."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Fyor Rodan was a honorable and politically skilled man. During the Battle of Coruscant he stayed at his post until the last second when he was evacuated by the military. Rodan was extremely anti-Jedi. This was due to the fact that he felt that they demanded government favors while the senate had to oversight as to what they did (which Luke acknowledge wasn't entirely unfounded). In spite of this, Rodan had a strong sense of pride and an inability to concede when he was wrong; even after the Jedi took his criticisms into account he continued to believe that they wanted power and after he was defeated he refused to consider Omas the legitimate Chief of State. He was also somewhat hypocritical, accusing Omas of taking favors by pushing the YV hunter droids through even though he himself had voted in favor as well. His willingness to join the Confederacy was motivated in part by spite at being beaten by Cal Omas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Rodan's first appearance in canon is in the first novel of the Star Wars: The New Jedi Order series, The New Jedi Order: Vector Prime. Rodan's only substantial role in is the book The New Jedi Order: Destiny's Way. He also appears in the Star Wars: Legacy of the Force series novel Legacy of the Force: Exile."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}