{"url": "Aleema_Keto", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Females", "Category:Humans", "Category:Keto family", "Category:Krath", "Category:Members of the Sith Brotherhood", "Category:Rulers of the Empress Teta system", "Category:Sith acolytes and apprentices", "Category:Sith sorcerers", "Category:Tetans", "Category:Torturers and interrogators", "Category:Treasure keepers"], "nodes": [{"tag": "h1", "text": "Aleema Keto"}, {"tag": "p", "text": "Aleema Keto was a Human female, the daughter of Lady Magda Keto and niece of the elder Lord Keto, as well as the cousin of Satal Keto. As she progressed down the path of the dark side of the Force, Aleema became a Sith sorceress, gaining proficiency in the arts of Sith magic. She and Satal also co-founded the Krath, a secret dark side society, and together they succeeded in overthrowing the Tetan Monarchy just prior to the Great Sith War."}, {"tag": "p", "text": "As co-rulers of the Empress Teta system, Aleema and her cousin instigated the Krath Holy Crusade, the opening battle of which revealed the measure of their Sith powers at work in Tetan space. The Krath then launched a bold ambush against the Jedi during a convocation on the planet Deneba, which resulted in the death of Jedi Master Arca Jeth. In response, his apprentice, the Jedi Knight Ulic Qel-Droma, infiltrated the Krath in an attempt to destroy them from within. Aleema immediately realized his intentions and seduced him while offering him a position within the Krath organization. She then masterminded the death of her cousin Satal at Qel-Droma's hands, at which time the fallen Jedi assumed Satal's position as leader of the Krath."}, {"tag": "p", "text": "Together with Qel-Droma, Aleema joined forces with Dark Lord Exar Kun and held position as his senior ally in Kun's Sith Brotherhood. War was waged against the Jedi and the Republic, though during an assault on Coruscant, Keto betrayed Qel-Droma to the enemy. She was later killed by her own actions when she used her Sith powers to cause a massive supernova in the Cron Cluster during the Battle of Kemplex IX, having been tricked into the affair by both Kun and Qel-Droma."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Coruscant endeavor"}, {"tag": "p", "text": "The daughter and son—though not siblings—of the then-rulers of Empress Teta, Aleema and her cousin Satal were next in line for the throne of the Empress Teta system. Bored and spoiled, she, Satal, and some of their aristocrat friends formed a secret society called the Krath, so named after a fairy-tale magician-god. The cousins learned much from their tutors about the ancient Sith Empire, which instigated the Great Hyperspace War in 5000 BBY—so much so that they were compelled to explore the history further on their own."}, {"tag": "p", "text": "The Keto children took a trip to the Galactic Museum on Coruscant in search of more knowledge on the Sith. In the museum, they perused a hall dedicated to Sith history and managed to steal a book of Sith lore, only to find that they could not understand the ancient text. Dejected, they went back to their hotel, and while scanning the news reports, heard about dark side adepts on Onderon who were terrorizing the populace with their dark powers."}, {"tag": "p", "text": "Intrigued by this new knowledge, the pair traveled to the war-torn planet aboard the Tetan Royal Space Yacht known as the Krath Enchanter, with hopes of locating any Sith affiliate who might aid them in unlocking the secrets of the book. They arrived on Onderon to find a massive battle taking place between Galactic Republic forces and the Naddists, a cult following of the ancient Sith Lord Freedon Nadd. Their yacht was shot down in the midst of a Republic rocket-jumper deployment, and crashed in the Onderonian capital of Iziz, where they just barely escaped their exploding vessel into the streets. After spending some time showing their acquisition around and inquiring about the Sith, they were finally brought before Onderon's monarch, King Ommin."}, {"tag": "p", "text": "Ommin was curious about these two potential Sith initiates and their ancient Sith text, and so agreed to help them. Satal openly expressed his apprehension, fearing that the old King did not possess the knowledge they sought. All that changed however, when King Ommin worked his dark magic on Satal, rendering him ill and opening Aleema further to the dark side. Ommin then showed them his prized collection of Sith amulets, one in particular that allowed them to read Sith writings. The decrepit King agreed to give Satal the amulet, but under one condition: Ommin must be allowed to take a copy of the spell book for himself. Satal acquiesced, and while a scribe transcribed the text, Ommin showed them the captive Jedi Master Arca Jeth, hung on a wall and suffering heavily under Sith magic. As Ommin leaned in close to taunt Jeth, a team of Jedi Knights crashed the royal palace to free him. Ommin was caught off-guard as his forces were soundly defeated by Jeth's rescuers."}, {"tag": "p", "text": "The Jedi quickly triumphed, and just as Jedi Knight Ulic Qel-Droma smashed Ommin's durasteel exoskeleton to incapacitate him, the ancient spirit of the Dark Lord Freedon Nadd appeared. With Republic forces and the Jedi Knights now in complete control of the city, Nadd realized Ommin had failed in his task of restoring the glory of the Sith; instead, the Sith Lord convinced Aleema and Satal that they held the key to building a new Sith Empire and that he would guide them. Eventually, the Jedi freed Arca Jeth, and Qel-Droma slew Ommin."}, {"tag": "h3", "text": "Trouble for the Republic"}, {"tag": "p", "text": "Aleema and Satal then fled Onderon with a collection of ancient Sith artifacts and texts and used them to become proficient in Sith sorcery. Now the way was clear for the Krath to immediately begin plotting their rise to power. Armed with her new Sith knowledge, Aleema was instrumental in bringing down their parents, the legitimate rulers of the Empress Teta system. During a visit to her uncle's carbonite processing facility, Aleema, along with Satal, caused an uproar when their escort, Korus, revealed that Aleema replaced his tongue with an Adegan eel. Reeling with confusion and anger, Lord Keto demanded that she and Satal be arrested. Aleema, however, stopped Lord Keto's guards by using her Sith talents to transform the guardsmen's weapons into illusory snakes."}, {"tag": "p", "text": "With the guards out of the way, she even went so far as to have Lord Keto lowered into a vat of molten carbonite, leaving her and Satal as the unchallenged rulers of Empress Teta. Korus did not survive the upstaging either; Aleema used the Force and burned him alive simply for spilling a drink on her. After the Krath had successfully staged their political coup, Aleema and Satal took up residence in the Iron Citadel, the building where Lord Keto formally held court, making it their base of operations. They immediately began a plan to unify the worlds of the Tetan system under their heel. However, the system's citizens, specifically the Krath's home planet of Empress Teta, rebelled against their new Krath rulers."}, {"tag": "p", "text": "In an effort to restore order in the Tetan system, a joint Jedi and Republic battalion was sent to deal with the usurpers. Aleema and Satal were more than prepared for the Republic, and took up command from a space station orbiting Empress Teta. As the Republic forces emerged from hyperspace, the Krath met them head-on. Aleema used her sorcery to create illusions of space grazers, legendary creatures that roamed the galaxy preying upon interstellar spacecraft. The space grazer illusions were lifelike enough to fool Captain Vanicus and the Republic fleet during the Battle for Empress Teta, almost forcing the panicking commanders into retreat. However, the Jedi Nomi Sunrider saw through the deception, and used her battle meditation to confound Aleema, thus allowing the Republic forces to ignore the apparitions. Drawing upon the sum of her powers, Aleema created a mass illusion to conceal a screen of CX-133 Chaos fighter suicide bombers launched by Satal. The Chaos fighters harassed the Republic fleet, and Jedi Knight Ulic Qel-Droma was injured when one of the Krath vessels plunged into the command ship he was on. Although Sunrider was able to distract and defeat Aleema, the Republic detachment was forced to withdraw in the face of such a blatant attack, leaving the Krath in complete control of the system."}, {"tag": "h3", "text": "Seducing a Jedi"}, {"tag": "p", "text": "Some time later, Aleema and Satal used Krath war droids disguised as service droids to attack the Conclave on Deneba, where the Jedi had gathered to discuss the growing Krath threat. During the assault, Master Arca Jeth was slain, and his student, Ulic Qel-Droma, swore revenge on the Krath. Consumed by grief over the death of Jeth, Qel-Droma soon after attempted to infiltrate the Krath in hopes of destroying them from within. He arrived on Empress Teta and made his way to Cinnagar, the capital city. Aleema sensed Qel-Droma's great strength in the Force and was wary of him, but she devised a plan for turning him to the dark side. During a skirmish in Cinnagar, she let Qel-Droma \"save\" her from a fake assassination attempt, and managed to take him as her lover to win his trust. However, Satal grew jealous and suspicious, and he had Qel-Droma interrogated and tortured in the dungeons of the Iron Citadel. Despite Qel-Droma denying that he was a Jedi spy, Satal injected him with a Sith poison, which played off and amplified an individual's rage. By doing this, Satal was confident that Qel-Droma's anger would activate his poison, and ensure the Jedi's fall to the dark side."}, {"tag": "p", "text": "After a failed attempt by Nomi Sunrider and her Jedi cohorts to rescue Qel-Droma, Satal again questioned Qel-Droma's loyalty and attempted to have him assassinated. The vengeful Jedi repelled the attack and then confronted Satal, striking him down in anger. Qel-Droma also rebuked Sunrider and the Jedi, and despite their pleas, refused to leave Cinnagar with them. Aleema knew her seduction was successful, and that Qel-Droma was falling further and further to the dark side. She revealed to Qel-Droma that she was aware of his infiltration scheme all along, and saw it as a challenge for the both of them. Now convinced that he could not turn away from the dark path even if he wanted to, she took him as her official partner, and they became the new co-rulers of the Krath."}, {"tag": "p", "text": "Unbeknownst to them, the Dark Jedi Exar Kun was also in Cinnagar in search of them. Before Freedon Nadd died his second death, he warned Aleema of Kun's treachery. Kun was aware of this and saw Nadd's other students as potential threats to his work in restoring the Sith Empire. Arriving in the Iron Citadel, Kun caught Aleema and Qel-Droma by surprise as he confronted them. Aleema attempted to halt Kun's advance, but he quickly incapacitated her with a blast of dark side energy. He then dueled Qel-Droma, and during their contest the matching Sith amulets that each man wore began to interact, stirring the ancient spirit of the long-dead Sith Lord Marka Ragnos. Ragnos halted the duel and issued a proclamation, initiating both men as Dark Lords of the Sith. Aleema awoke to see a changed Qel-Droma, one with a new tattoo stamped on his forehead and in allegiance with the Dark Jedi Kun. Kun planned to restore the Sith, and together with Aleema's Krath, a new Sith Brotherhood was born."}, {"tag": "p", "text": "Six months later, Qel-Droma confronted Mandalore the Indomitable in a duel to the death on the planet Kuar. Qel-Droma was triumphant, and instead of cutting Mandalore down, Qel-Droma made the warlord and his forces swear fealty to him. The Krath, along with the Dark Lord Exar Kun and their Mandalorian allies, then laid out plans for toppling the Republic. After successfully capturing a fleet of battleships during an attack on the planet Foerost, Qel-Droma planned to use them in an attempt to wrest power from the government on Coruscant. Kun was against this idea, as he sought to first train twenty Dark Jedi to also join the Brotherhood. Qel-Droma, however, had no intentions of waiting for Kun. He and Aleema proceeded with their assault on Coruscant without their partner, who continued with his new students. Aleema used this opportunity to further her own plans for power, and as Qel-Droma prepared to take the Republic command center, Aleema ordered Mandalore to withdraw their troops. Qel-Droma was unaware of Aleema's treachery as his former Jedi companions stormed the command center. The Jedi imprisoned him in a wall of light side energy and whisked him away to be put on trial for his crimes against the Republic. Qel-Droma was brought before the Galactic Senate to be judged for his actions."}, {"tag": "h3", "text": "Fatal betrayal"}, {"tag": "p", "text": "Back in the Iron Citadel, Aleema sided up next to Mandalore in an attempt break his loyalty to Qel-Droma. She ordered him to ready their forces for the next assault, which would be on the valuable Kemplex IX relay station in the Auril sector. Mandalore was not content with taking orders solely from the sorceress Aleema, and so he left in search of Exar Kun on Yavin 4 to request his assistance in rescuing Qel-Droma. Together Mandalore and Kun successfully rescued Qel-Droma and returned with him to Yavin 4. Aleema and Qel-Droma were reunited, and although Aleema feigned affection for him once he returned, she was unaware that Mandalore told Qel-Droma of her treachery. Qel-Droma was outwardly unaffected, but secretly he began plotting his revenge."}, {"tag": "p", "text": "Qel-Droma proceeded with the plan to attack the relay station at Kemplex IX, sending Aleema and the Jedi traitor Crado to personally oversee the mission. The idea was to lure the combined Republic and Jedi fleet out into the Cron Cluster, where it would walk into a trap and be destroyed. Kun then introduced Aleema to the Corsair, an antiquated Sith warship once commanded by the ancient Dark Lord Naga Sadow. He showed her how to operate the vessel and gave her specific instructions in using the Sith crystals that powered the ship. These same crystals were used generations ago by Sadow when he eluded the Republic fleet by passing between the binary star known as the Denarii Nova, and used his Sith magic to agitate solar flares as Republic ships followed. The Republic pursuers were destroyed in the conflagration."}, {"tag": "p", "text": "After Kun taught her how to harness the Corsair's power, Aleema intended to use Sadow's crystals to rip the core from a nearby star and hurl it at the fleet. Aleema and Crado left for Kemplex IX, and the Republic fleet followed just as she had hoped. When the moment was right, Aleema activated the Sith crystal-weapon aboard the Corsair and tore free the heart of one of the ten stars of the Cron Cluster. The Jedi and Republic ships in pursuit were all destroyed as the solar core was hurtled towards them. Although she succeeded in destroying most of the starships, she failed to fully control the power she wielded, as Qel-Droma had deliberately calculated; Aleema, the betrayer, was now the one betrayed. The liberated solar core ignited the hearts of the surrounding suns and created an intense, multi-star supernova, which engulfed three Auril sector star systems and later the planet Ossus. Caught in the blaze, Aleema and Crado were killed along with their Jedi pursuers Dace Diath, Shoaneb Culu, and Qrrrl Toq, just as Qel-Droma and Kun had planned. Light-years away on Yavin 4, both Kun and Qel-Droma felt the disturbance in the Force that was the death of Aleema Keto."}, {"tag": "p", "text": "Aleema and Satal's legacy would be realized many thousands of years later in the form of Satal's descendant, Sebban Keto. Sebban was a Tetan businessman who, like his ancestors, practiced dark side magic and used it to reestablish the Krath traditions on Empress Teta."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Aleema Keto was a rather privileged youth, having grown up as royalty amidst the aristocracy of Empress Teta. To this end she was bored with the normal goings-on of high society and sought to amuse herself by dabbling in the lore of Sith magic. She showed quite a thirst for forbidden knowledge and so traveled with her cousin to Onderon solely for the purpose of discovering the mysteries of the Sith. She was naïve to the fact that the dark side had a corrosive nature, and would surely twist and corrupt her."}, {"tag": "p", "text": "As a Sith sorceress, Aleema had a penchant for treating individuals as worthless inferiors, often devising cruel punishments for subordinates who tried her patience. She had a short temper, striking out at subordinates with little provocation, using her powers to horrify and terrorize those of her choosing."}, {"tag": "p", "text": "Aleema was sneaky, cunning, and conniving, often using deception and manipulation to further her goals. She used her womanly wiles to seduce Ulic Qel-Droma, who was already on a path to the dark side, and then further manipulated him into ultimately murdering her cousin. Aleema then governed the Krath exclusively, and with Qel-Droma by her side she became even more brash and arrogant, fully believing in the strength of her powers. Her dishonesty was further realized when she betrayed Qel-Droma to the Jedi, but when he returned, she resumed her romantic deceptions. Her naïvete was again evident as she was unaware that Mandalore had warned Qel-Droma of her treachery. It would prove her undoing, since Qel-Droma's own deception ultimately ended in Aleema's demise."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Even before becoming a Sith witch, Aleema showed a considerable connection to the Force. She endured the strong dark side energies emanating from Onderon, while her cousin Satal was stricken with malaise upon feeling the same power. Aleema also had a propensity for precognition, demonstrated on numerous occasions in which she displayed a vague awareness of how immediate events would unfold. She was able to calm Satal's fear of impending doom while aboard the Krath Enchanter by assuring him that they were going to survive what seemed like an inevitable crash. When they finally touched down, Aleema instinctively knew that they were in the right place. Her Force sense was also strong, more so than Satal's, since she was able to sense the strong dark side aura emanating from Onderon and the strong dark side presences of both Qel-Droma and Exar Kun."}, {"tag": "p", "text": "After receiving instruction from both Freedon Nadd and King Ommin, Aleema developed her unique connection with the dark side into a considerable mastery of Sith magic. When performing her magical incantations, an aqua glow of dark side energy shone over her right eye. Her greatest ability was in creating illusions, something she mastered to a high degree. Aleema used Sith magic to conjure apparitions of creatures that seemed alive, but in reality were not. During the First Battle of Empress Teta, she created mass illusions of space grazers and giant starships, and also used her illusory talents to conceal her cousin's Chaos fighters' assault on the Galactic Republic fleet. The Jedi Knight Nomi Sunrider was on more than one occasion able to pinpoint Aleema as the source of the deception and assaulted her mind directly, an attack Aleema was unprepared for and could not withstand."}, {"tag": "p", "text": "To amuse herself, Aleema often tortured her lackeys with her magic, turning technology into vile organic perversions or serving guests with platters of severed heads. When swords were raised against her, she brushed off the attack and then turned her adversaries' weapons against them, transforming their blades into snakes. She was also able to project concentrated blasts of pure dark side energy, even without the use of a Sith amulet."}, {"tag": "p", "text": "From Kun she learned to harness the dark side through Naga Sadow's technology on the Corsair with her sorcery, and used it to destroy the ten stars of the Cron Cluster. Her overconfidence in this new-found ability was her undoing, just as Qel-Droma foresaw; the ensuing supernovae consumed her as well since she was not able to fully control the dark power of Sadow's vessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Aleema Keto was first conceived and written by Tom Veitch and drawn by Tony Akins for the Tales of the Jedi comic series, first appearing in the issue The Freedon Nadd Uprising: Initiates of the Sith, published in 1994. However, she was first mentioned in the Dark Empire endnotes, a series of short essays that provided back stories for several Star Wars topics, including Ulic Qel-Droma and the Krath. The endnotes' mention of the Krath laid the foundation for Keto's involvement in the upcoming Tales of the Jedi story arcs. For the Tales of the Jedi audio drama, Keto was voiced by Garet Scott, and again by Jocelyn Blue for the Dark Lords of the Sith audio drama. Even though her involvement was minimal, Veitch's creation of Aleema Keto for the Freedon Nadd Uprising allowed for the character to be further explored in the Dark Lords of the Sith and The Sith War stories, respectively. The Knights of the Old Republic II: The Sith Lords: Prima Official Game Guide, a game guide for the video game Star Wars: Knights of the Old Republic II: The Sith Lords in which Keto's robe is a wearable item, incorrectly states that Keto began training as a Jedi before she became enthralled with the Sith during research."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}