{"url": "G0-T0_infrastructure_planning_system", "categories": ["Category:Legends articles", "Category:Analysis droid models", "Category:G0-T0 infrastructure planning systems"], "nodes": [{"tag": "h1", "text": "G0-T0 infrastructure planning system"}, {"tag": "p", "text": "The G0-T0 infrastructure planning system was a second-degree planning droid produced by the Aratech Repulsor Company and designed and programmed to serve as a central organizational hub for planetary rebuilding efforts."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Aratech Repulsor Company began research and development of the G0-T0 droid following the devastation of the Great Sith War and during the years leading up to the Mandalorian Wars, when the Galactic Republic needed assistance in rebuilding the galaxy's infrastructure. As a part of the company's investment in the Republic's restoration efforts under the Coruscant Financial Exchange Establishment Act in 3985 BBY, the first prototype G0-T0 models helped with the reconstruction efforts after the Great Sith War. It was not until 3955 BBY that Supreme Chancellor Cressa put the droids to greatest use by assigning them to rebuilding the galaxy after the Jedi Civil War."}, {"tag": "p", "text": "Each G0-T0 droid was given a unique identifier corresponding with the planet it assisted. It could plug directly into planetary computer networks and thus oversee construction efforts across the entire planet, using its specialized software to maximize efficiency and minimize mistakes. The G0-T0 had a high level of artificial intelligence, with enough authority to manage planetary administration and request supplies and command organic workers. It could also consider options that would benefit the entire Republic within the confines of law and regulation, thus expanding its scope yet further. Unfortunately, the massive amounts of data flowing through a G0-T0 often corrupted the droid's memory, causing it to rapidly develop both a personality and independent motivations."}, {"tag": "p", "text": "This presented something of a worry for the designers at Aratech. Such a massive intelligence was obviously of great use to the Republic, but if not checked, it could become unstable and threaten security. Thus, Aratech limited its machine interface capabilities by placing the G0-T0's circuitry into the body of a spherical repulsorlift droid."}, {"tag": "p", "text": "Despite this, fears over the G0-T0's capabilities became founded when the unit assigned to the Telos IV Restoration Project happened upon a paradox in his duties. The droid felt it was unable to effectively help the Republic within its programmed parameters, and so broke free of his restrictions in order to follow his primary directive. G0-T0 set about eliminating threats to galactic stability, and to this end, began posting bounties on Jedi and Sith with the help of HK-50 assassin droids produced from a droid factory G0-T0 had set up on Telos. G0-T0's secret agenda became masked behind a public face; that of the crime lord \"Goto\", an alter ego projected as a hologram by the droid while he continued work on Telos. Ultimately, G0-T0 was destroyed on Malachor V, but his actions seemed to have set a precedent for G0-T0 units around the galaxy."}, {"tag": "p", "text": "Within five years, other G0-T0 droids had also broken free of their programming, such as G0-T0-Telerath, who temporarily seized control over one of the galaxy's most prominent financial institutions, causing an economic emergency when it demanded control of the Coruscant Financial Exchange, or those stationed in the Gordian Reach, who set themselves up as dictators, cutting off all connections to the HoloNet and blockading in-system hyperlanes. They then announced their takeover of the sixteen worlds now part of the independent territory known as 400100500260026. It took the might of the Republic Navy to put down this insurrection, in a highly-publicized campaign."}, {"tag": "p", "text": "The repercussions of such actions had a devastating impact, not only on the Aratech company, but also the citizens of the galaxy. From then on, the image of these spherical, black droids conjured thoughts of fear and dread, and was partially responsible for the reputation of the IT-O Interrogator, whose design echoed that of the G0-T0 droid for maximum psychological effect."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic II: The Sith Lords, G0-T0 states that he changed his droid shell into something more intimidating. This idea conflicts with the information above, as it implies that the Republic Infrastructure Droid has always had the IT-O droid shell (despite the significant size difference between the two models). Furthermore, within the game, particularly aboard Goto's yacht, there are several \"guard droids\" that share the IT-O and G0-T0 frame."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}