{"url": "G2-4T", "categories": ["Category:Legends articles", "Category:G2 repair droids", "Category:Star Tours personnel"], "nodes": [{"tag": "h1", "text": "G2-4T"}, {"tag": "p", "text": "G2-4T was a G2 repair droid that worked for the Star Tours travel agency. He claimed G2-4T was short for G2-4TT45579982DWP-40PST, which was just his first name."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early stages of the Galactic Civil War, G2-4T acted as a security officer manning the thermal scanning area of Spaceport THX1138. In order to ensure the safety of the passengers, he also was programmed to recognize suspicious behavior within Humans, including sweating, blinking, talking, laughing, and breathing. However, the programming performed too well, causing the G2 droid to be overzealous in suspicion regarding passengers. He often made small talk with tourists and passengers as they passed his security station, but he had a surly attitude towards coworkers and passengers, much to his superiors' dismay."}, {"tag": "p", "text": "By the time of the Battle of Death Star III, G2-9T served as the foreman of the repair droids in the Droidnostics Center at the Tomorrowland Starport. He maintained his surly attitude, often talking back to his supervisor and making fun of passing guests. He continued his work up to 4 ABY when the agency went out of business. After the company closed, the droid found work with Talon Karrde."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This droid can be seen at Star Tours. Hasbro released G2-4T as an exclusive Star Tours action figure, which was sold only in Disneyland. He was voiced by Imagineer Mike West, who served as the ride's show producer."}, {"tag": "p", "text": "In Star Tours: The Adventures Continue, he is recast as a security officer and his voice is provided by Patrick Warburton."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}