{"url": "Aleen/Legends", "categories": ["Category:Legends articles", "Category:Aleen locations", "Category:Bright Jewel sector planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Rocky planets", "Category:Type I atmosphere planets", "Category:Type II atmosphere planets"], "nodes": [{"tag": "h1", "text": "Aleen"}, {"tag": "p", "text": "Aleen was a planet located in the Mid Rim that contained two unique environs: the surface world inhabited by the Aleena and the Underworld, the domain of the Kindalo."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A desert world on the surface, Aleen's upper crust contained a second major environ that contained a series of complex caverns with its own unique atmosphere. Formed by the growth of the unique arbozoic trees, the caverns were also comprised of tunnels carved by water, lava, and tectonic sheering. Maintaining a unique climate and an atmosphere dangerous to the surface-dwelling Aleena, the Underworld was inhabited by the tree-like Kindalo and the mystical being, Orphne. Just as the Aleena could not breathe in the Underworld environment, Kindalo were harmed by the unfiltered oxygen of the surface world. To this end, the planet's two sentient species made the conscious decision to recognize the divide between the two environs and remained separated. Aleena colossi dotted the surface of the planet, standing as relics of their ancient society abandoned in favor of a simpler lifestyle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The homeworld of both the Aleena and the Kindalo species, Aleen was a world of two distinct environs that had a shared, yet separate history. Establishing a strong culture and a fierce army, the Aleena built towering monoliths that were vital to the religious orders that formed on the planet. The Infinite Empire controlled the planet at its height, and the Aleena and the Kindalo served as client species the reigning Rakata."}, {"tag": "p", "text": "After the Infinite Empire collapsed, the Aleena experienced an expansionist era, during which they settled other worlds and spread out into the greater galaxy. Aleen Minor became a major colony of the Aleena species, and would go on to become the center of Aleena culture in the distant future. The Aleena came into conflict with the Kindalo that lived beneath the surface of the world, and the two cultures waged a terrible civil war that caused great damage to both societies through the use of technological weapons. When life on Aleen was nearly destroyed by the fighting, a compact was formed that secured the notion that neither society would interfere with the other again. To this end, the Great Seal was forged to serve as a reminder of the compact, and was placed within a primary tunnel opening that allowed access to the Underworld."}, {"tag": "p", "text": "Vowing to leave behind the society that caused the near apocalypse on Aleen, the Aleena entered into an era of self-imposed seclusion and scaled back development considerable. Forming into kinship clades known as tahikos, the individual settlements maintained contact with a planetary government that advised the King of Aleen. Over the course of the millennia, Duros spacers discovered Aleen and eventually introduced the Jedi Order to the world. Establishing a chapter house over top of the Great Seal, the Jedi protected the world for a time, before abandoning their chapter house and allowing it to fall into disrepair."}, {"tag": "p", "text": "Around 21 BBY during the Clone Wars, the planet began suffering from groundquakes caused by the Kindalo because the Great Seal had been opened under mysterious circumstances. The Kindalo thought the Aleena were responsible, and so caused massive groundquakes in retaliation, prompting the Republic to send a squad of clones led by Wolffe, also accompanied by C-3PO and R2-D2 for translation, to undergo a relief mission. There, the droids discovered the Underworld and were able to seal the breach and restore balance to Aleen. Although the clones were skeptical, the Aleena were overjoyed. When the Galactic Empire came to power at the end of the war, the Empire established a observation post on the moon of Trohlu."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Due to the discrepancies between the previous sources and the planet described in The Clone Wars TV series, Jason Fry stated that those Aleen are two different worlds. The old Aleen is now Aleen Minor and the new is Aleen. This was later formalized in The Essential Atlas Online Companion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}