{"url": "Aleen_Minor/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Inner Rim planets", "Category:Jedi planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Aleen Minor"}, {"tag": "p", "text": "Aleen Minor, often inaccurately referred to as just Aleen, was a temperate planet located in the Inner Rim Territories. A colony world of the Aleena species, Aleen Minor was often mistaken as the species' homeworld."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Aleen Minor was a world located in the Inner Rim. It was the homeworld of the Aleena and had a harsh and difficult environment. The extremely fast predators known as sagcatchers represented a constant threat for the Aleena."}, {"tag": "p", "text": "Aleena appreciated speed sports very much so they built many arenas on Aleen Minor. The Aleen Classic, a popular podracing event, was held on the world."}, {"tag": "p", "text": "Aleena from Aleen Minor were also known as master crafter of artisanal laroon wood, marble, and granite furniture."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Aleen Minor was founded by members of the Aleena species during the an expansionist era experienced on Aleen. Taking with them the high technologies developed on their homeworld, Aleen Minor developed further as Aleen entered into a self-imposed end to technological advancement and eliminated all industry on their world. Aleen Minor was discovered by Galactic Republic scouts during the Great Manifest Period. Granted direct representation in the Galactic Senate."}, {"tag": "p", "text": "Over the years aligned with the Senate, the world welcomed the construction of a chapter house of the Jedi Order. The world was represented by Senator Bogg Tyrell during the waning days of the Republic. Aleen Minor remained neutral during the Clone Wars."}, {"tag": "p", "text": "Aleen Minor was the homeworld of Podracer pilot Ratts Tyerell."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Due to the discrepancies between the previous sources and the planet described in The Clone Wars TV series, Jason Fry stated that those Aleen are two different worlds. The old Aleen is now Aleen Minor and the new is Aleen. This was later formalized in The Essential Atlas Online Companion. The Star Wars: Force and Destiny Core Rulebook mistakenly places both Aleen and Aleen Minor in the Mid Rim, and claims that the Jedi chapter house on Aleen Minor is on Aleen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}