{"url": "GC-1000/Legends", "categories": ["Category:Legends articles", "Category:Clone trooper pilots", "Category:Imperial defectors", "Category:Imperial Navy pilots of the Galactic Empire", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "GC-1000"}, {"tag": "p", "text": "GC-1000 was one of the original Fett clones. He was given the name Klick by an unidentified \"humor-challenged\" Rodian Jedi Padawan. Klick was short for a \"kilometer\" which was a reference to his créche identifier of Trooper Pilot 1000. He was a veteran of the Clone Wars, from Geonosis to the Great Jedi Purge. He was a Group Captain in Lord Shadowspawn's army. He received a field promotion from Luke Skywalker to Air Marshal. He, along with the rest of Cronal's shadow troopers, died when their deadman interlocks were triggered by the exit of meltmassif from their bodies."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on Kamino, GC-1000 participated in the Battle of Geonosis, which he considered to be a source of pride. This led to the start of the Clone Wars, a galactic conflict which lasted for few years. During the war, he was given the nickname \"Klick\", meaning kilometer, from a Rodian Padawan of the Old Jedi Order. He was later involved in the implementation of Order 66 where all clones were to execute their Jedi Generals. Serving in the newly formed Galactic Empire, Klick was promoted to Commander of a squadron and continued to serve the Empire until the Emperor's death in 4 ABY."}, {"tag": "p", "text": "After the battle of Endor was over, Admiral Kraven was among the warlords who were trying to get themselves a bit of power after Emperor Palpatine's death at the hands of Anakin and Luke Skywalker. There, Kraven appointed Klick as colonel, and sent him and his squadron to eliminate Lord Shadowspawn. However, when he and his squadron encountered him, Lord Shadowspawn revealed the codes that he received from Palpatine and declared that the Emperor had chosen him as his servant. He said that his job is to guard the throne of the Empire, as long as he does not appear Palpatine's successor. After Cronal explained a false story about how Vader killed his master and later slain by Luke, Klick thought that Skywalker was the rightful heir to the throne and agreed to serve Cronal in hopes of finding Skywalker."}, {"tag": "p", "text": "In 5.5 ABY, Klick was promoted to Group Captain and was tasked to lead the units in defending the electoral Center at all costs. Moments later, he was given orders to seal the center and shoot anyone who tried to leave him. After a moment, the door was sliced open by a green lightsaber and the person who emerged from the entrance was revealed to be Luke Skywalker. Klick was the first to recognize his face and didn't take the opportunity to shoot him. As Skywalker entered, he and the other stormtroopers knelt down and called him \"Emperor\". Luke was surprised by this until he learned the truth. When Luke commanded all the forces to surrender to the New Republic, Klick didn't understand the orders, but he agreed to apply them. Since he was willing to follow Skywalker, he sided with the New Republic and received a field promotion to Air Marshal."}, {"tag": "p", "text": "After receiving his promotion, Klick followed Skywalker's command and was ordered to jam all the communication systems and gravity well generators in order to issue the Imperial forces to surrender. There, he addressed in evacuating the civilians from the decaying system. As the evacuation started, Klick led a company of troopers in boarding the Millennium Falcon. However, Cronal somehow entered Kar Vastor's body and tried to kill Luke and his sister. But when Cronal left Kar's body, Klick and the rest of troopers were killed by Blackhole when he contained all the armor within them which destroyed their bodies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}