{"url": "GEMINI_16", "categories": ["Category:Legends articles", "Category:Droids", "Category:Feminine programming", "Category:GEMINI droids"], "nodes": [{"tag": "h1", "text": "GEMINI 16"}, {"tag": "p", "text": "GEMINI 16 was a GEMINI model droid, one of thousands used by the Eternal Empire of Zakuul as captains of the Eternal Fleet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Battle of Odessen in 3630 BBY, the GEMINI droids were granted free will by SCORPIO, though this was later undone when Empress Vaylin ordered SCORPIO to restore them to their default settings. GEMINI 16 avoided the fate of her sisters by severing her connection to the GEMINI network and became determined to keep her newfound freedom at any cost. After the Eternal Throne and the Eternal Fleet were taken over by the Commander of the Eternal Alliance, GEMINI 16 could still hear her sisters, indicating that she remained vulnerable to outside control. Seeking the destruction of the Eternal Fleet and the GEMINI network to fully liberate herself, GEMINI 16 contacted Vinn Atrius, who had formed the Order of Zildrog with the goal of taking down the Alliance and its Commander. To that end, Atrius sought to use Zildrog, an ancient superweapon from Iokath, though he did not know of its whereabouts. GEMINI 16 offered Atrius her knowledge of Zildrog's workings and location, which led to Theron Shan stealing the map to Zildrog's coordinates from the Chiss House Inrokini on Copero. GEMINI 16 warned Atrius that Shan should not be trusted, and had also gained access to the security footage inside the Alliance base on Odessen, allowing the Order of Zildrog to watch Alliance's every movement for months."}, {"tag": "p", "text": "Learning the coordinates of Zildrog's location on Nathema, the Order left their base of operations at the Abandoned Listening Post and departed to Nathema, with several individuals who wanted to settle their personal vendettas with the Commander joining them. However, Theron Shan was acting as a double-agent for the Eternal Alliance the whole time, and managed to warn them of the Order's intentions, leading to Lana Beniko and the Alliance Commander following them closely behind. Theron gave the Order the slip and rejoined his true allies, after which Atrius ordered GEMINI 16 to being awakening Zildrog in his vault ahead of schedule. The GEMINI deceived and betrayed many of her allies, locking them inside energy transfer chambers to be used as fuel for Zildrog's awakening. Shan, Beniko and the Commander arrived to stop them, but GEMINI 16 had already awakened Zildrog and ordered it to use the Gravestone to attack the Eternal Fleet in orbit of Odessen. The destruction of the Eternal Fleet warships, the Eternal Throne and the Gravestone robbed the Alliance of its most powerful assets, but also required Zildrog to recharge his power before another attack, leaving him vulnerable. GEMINI 16 engages the intruders herself, but was defeated and destroyed, after which Beniko and the Commander destroyed Zildrog, putting an end to the Order's plans."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}