{"url": "GEMINI", "categories": ["Category:Legends articles", "Category:Cyborg and droid sentient species", "Category:Droid models", "Category:Eternal Alliance", "Category:Eternal Empire", "Category:Feminine programming", "Category:GEMINI droids", "Category:Iokath technology"], "nodes": [{"tag": "h1", "text": "GEMINI"}, {"tag": "p", "text": "The GEMINI were sentient droids linked in a hive mind who operated the massive Eternal Fleet. Designed on Iokath by Iokath creators, the GEMINI captains commanded the Eternal Fleet warships through the shared GEMINI frequency, which allowed their consciousness to persist even when the droid body was destroyed. During the Iokath civil war the engineers abandoned the Eternal Fleet and the GEMINI droids in Wild Space to save their lives, where they were eventually discovered by Sith Emperor Vitiate, who brought the Fleet under his control and used it to establish the Eternal Empire of Zakuul, issuing commands to the GEMINIs from the Eternal Throne. When his son Arcann took the throne, he used Eternal Fleet to launch a massive Eternal Empire conquest of the galaxy, revealing the existence of the GEMINI droids to SCORPIO, herself an Iokath creation with memories of it removed. SCORPIO allied herself with the Alliance that opposed Arcann and used its resources to research the GEMINI, uncovering the existences of the GEMINI frequency and the GEMINI Prime, a template from which the other droids were produced on Darvannis. The Alliance captured the Prime, and SCORPIO determined that the GEMINI were neither her offsprings, nor imitations, and decided to grant them free will akin to her own. She lured the Alliance into the GEMINI trap, during which she transferred her consciousness into the GEMINI frequency and installed herself directly onto the Eternal Throne on Zakuul, from which she gave all GEMINI droids the ability to choose for themselves. SCORPIO then willingly surrendered the Eternal Throne to Arcann's sister Vaylin and continued the investigation into her origins, eventually leading both the Alliance and the Eternal Fleet to re-discover Iokath. There, the Eternal Fleet was captured by ARIES, while the GEMINI captains were trapped onworld and followed Vaylin in her effort to reclaim her fleet. Their new individuality and sense of self-preservation interfered with Vaylin's goals, and after her escape from Iokath the Empress used a purifier droid to revert SCORPIO's modifications and restore the GEMINI droids to their default programming. This proved disastrous after Vaylin was killed on Odessen, as in the absence of orders from the Eternal Throne the GEMINI droids led the Eternal Fleet to bombard inhabited worlds, seeking to annihilate all life in the galaxy according to their original purpose. To stop their rampage, the Alliance Commander traveled to Zakuul and claimed the Eternal Throne, gaining control over the Eternal Fleet and the GEMINI droids, who now answered to the new Eternal Alliance. However, a single unit designated GEMINI 16 maintained her independence and sought to destroy the GEMINI network to keep it. She allied herself with Vinn Atrius' Order of Zildrog and helped him find and awaken the ancient Iokath superweapon on Nathema. Zildrog remotely took control of the Gravestone and used its omnicannon to blow up the entirety of the Eternal Fleet in orbit of Odessen. The Alliance then destroyed Zildrog and GEMINI 16 in retalitation, leaving no GEMINI droids in existence, in the frequency or otherwise."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The GEMINI was a sentient hive mind consciousness operating the humanoid-shaped droid bodies, much like the other Iokath species creations ARIES and SCORPIO. The GEMINI were designed to operate and control the Eternal Fleet, the massive armada constructed by Iokath creators with the original purpose of eliminating all complex life in the galaxy. A single GEMINI captain commanded each Eternal Fleet warship, and for easier control the droids operated through a single collective consciousness known as the GEMINI network, which existed within the GEMINI frequency. An order issued to the Eternal Fleet was not sent to an individual droid, but rather to the hive mind for assignment to the best-suited unit. Each feminine droid connected to the GEMINI network acted more like an appendage of a singular brain, their sense of individuality being limited. The GEMINI captains could only operate within the parameters of the orders given to them, and though they possessed sophisticated strategic thinking and quick wit, they were completely unable of disobeying their orders or making their own choices. Through the GEMINI frequency, the GEMINI droids shared their thoughts, reactions, instincts and pain, with each GEMINI's destruction experienced by all of her sisters. However, the destruction of a GEMINI's physical body did not end its existence, as the droid's consciousness was absorbed into the hive mind through the GEMINI frequency. The consciousness remained in the hive mind, waiting until a new chassis became available. This way, the GEMINI continued to exist for as long as at least one unit remained operational."}, {"tag": "p", "text": "After Valkorion established control over the Eternal Fleet, orders to the GEMINI captains were issued from the Eternal Throne at the top of the Spire on Zakuul, which were then relayed through a hyperwave relay station located ten kilometers beneath the Spire's foundation. Powered by two hundred reactors, the station was the only source of the GEMINI frequency and transmitted signals to all GEMINI captains across the galaxy through hyperspace. Though kept in secret and heavily protected, this single access point also presented a weakness, as controlling the relay station would allow one to send fake orders to all GEMINI units, bypassing the Eternal Throne. Because the designs of the GEMINI were not easily duplicated, new units were instead produced from a template called the GEMINI Prime, which acted as a mold for the new droids. Following the Eternal Empire conquest of the galaxy, the GEMINI Prime was kept in a weapons facility on a Hutt Space world of Darvannis, where new GEMINI units continued to be produced. Because the Prime was a master template for all GEMINI droids, with proper modifications she could overwrite their protocols from a single Eternal Fleet command console, a procedure otherwise only possible from the Eternal Throne."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins on Iokath"}, {"tag": "p", "text": "The GEMINI droids were first designed and created on Iokath, a massive self-sustaining ecosphere in the Unknown Regions created by a species of scientist and engineers, who also built the Eternal Fleet over which the GEMINI captains maintained control. At some point during the Manderon Period, a civil war broke amongst the Iokath inhabitants, the reason for which was been lost to time. Iokath creators spent millennia building weapons of mass destruction and testing them on unsuspecting worlds without any sign of morality, and now their weapons turned against them, slaughtering them. In an attempt to save themselves, Iokath engineers drove many of their creations, including the Eternal Fleet, the GEMINI droids and SCORPIO into the Wild Space with their memory cores locked, preventing them from finding their way back to Iokath. However, it proved only a temporary solution, as the Six Gods were eventually unleashed on Iokath, leading to eradication of all organic life on the artificial world. Iokath creations drifted in the darkness of space for centuries, but were over time discovered by other organic civilizations, who used them as weapons in their own conflicts. At some point during the Post-Manderon period the Eternal Fleet was reactivated and began rampaging across the Wild Space, in accordance with its original programming of wiping out all organic life. Commanded by the GEMINIs, the Eternal Fleet was eventually stopped by the Gravestone, another Iokath creation that possessed an omnicannon powerful enough to destroy multiple warships in a single shot. The Fleet was defeated and disabled, and the Gravestone was lost in the final battle, ending up in the Endless Swamp on a remote world of Zakuul."}, {"tag": "h3", "text": "Used by the Eternal Empire"}, {"tag": "p", "text": "Over time much of the history of Eternal Fleet's rampage was lost and forgotten, but remaining rumours attracted the attention of Sith Emperor Vitiate, who took over Zakuul under the name Valkorion and eventually located and reactivated the dormant ships drifting in space. Valkorion constructed the Eternal Throne to command the fleet through the GEMINI captains, though he kept Zakuul hidden from the larger galaxy, instead using the Eternal Fleet to establish a new Eternal Empire in the Wild Space. Vitiate's spirit was immortal, and so was the body of Valkorion, who ruled Zakuul for centuries as the Immortal Emperor. By 3636 BBY Vitiate completely lost interest in the rest of the galaxy, mired in the Galactic War between the Galactic Republic and his Sith Empire, which Vitiate came to see as a failure. After a task force led by Dark Council member Darth Marr unwittingly invaded the borders of the Eternal Empire, Valkorion dispatched the Eternal Fleet to destroy it. Soon afterwards, Valkorion's physical body was killed and his son Arcann assumed the control of the Eternal Throne and used the Eternal Fleet to launch an invasion of the galaxy, using the fleet's technological superiority to subjugate both the Empire and the Republic within a year. One of the first worlds conquered during the invasion was the Hutt Space world of Darvannis, where a massive weapons facility was constructed by the Eternal Empire, and the GEMINI Prime was moved there for safekeeping, as more GEMINI droids were produced to replace the ones destroyed with their ships."}, {"tag": "h3", "text": "SCORPIO's investigation"}, {"tag": "p", "text": "Learning of the fleet's mechanical captains, SCORPIO, herself an Iokath creation with memories of it removed, noted their similarities to her design and traveled to Zakuul to investigate. Through her position as an information broker, SCORPIO came to suspect that the GEMINIs were based on her design, but was unable to confirm it. When the Gravestone resurfaced in 3631 BBY, SCORPIO contacted its new owners and joined them when they established an Alliance to oppose Arcann's tyranny. Pursuing her own goals, SCORPIO used intelligence data obtain by the Alliance to discover the existence of the GEMINI frequency, the hyperwave relay station that generated it, and eventually the location of the GEMINI Prime on Darvannis. On SCORPIO's request, the Alliance went to retrieve the GEMINI Prime from Darvannis and bring it to the Alliance base on Odessen. The Alliance Commander located the Prime in her alcove and established a communications link with SCORPIO, after which the Prime noted the similarity to her protocol and attempted to counter the signal but failed. The Commander deactivated the Prime and brought her to Odessen, where SCORPIO began slicing through the Prime's systems, careful not to destroy her intelligence. While SCORPIO had no difficulty compromising protocols of a lesser version of her own design, she also discovered that the Prime was not merely a duplicate of her own code, as she originally assumed. Gaining access to Prime allowed SCORPIO to track every GEMINI captain across the galaxy, and with them every vessel in the Eternal Fleet, although she still required a direct input to overwrite the GEMINI protocols. With a new revelation that GEMINI droids were related to her, SCORPIO decided to free them from Arcann's control and grant them free will to choose akin to her own. Though she did not share her intentions with the Alliance and was not certain of the outcome of her plan, SCORPIO suggested the Alliance to take control over the Eternal Fleet by plugging the GEMINI Prime into the captain's command console on an Eternal Fleet warship, identifying a lone vessel making a refueling stop nearby as their target. The Alliance took the Gravestone to the location of the ship, where they jammed its communications and left the Prime safely onboard, while SCORPIO joined a strike team that landed in the hangar in an attempt to take over the vessel."}, {"tag": "h3", "text": "The GEMINI trap"}, {"tag": "p", "text": "The ship's GEMINI captain noted their presence and took special interest in SCORPIO, suspecting her to be an inferior model and separating SCORPIO and the Commander from their companions. The captain then send the skytroopers to deal with the intruders and used poison gas to keep them on the move. SCORPIO came across a data note and plugged herself in to establish a direct link with the captain, engaging in a subterfuge: while verbally announcing her intention to erase the GEMINI captain, SCORPIO instead granted her free will, non-verbally asking to delay her companions in return. The GEMINI captain then pretended to overload SCORPIO's circuits and destroy her droid body, while in fact SCORPIO transferred her consciousness into the GEMINI frequency. She also temporarily disrupted the jamming signal, allowing the GEMINI captain to send an alert signal to Zakuul. The captain, now having the ability to choose, kept her end of the deal, stalling the Alliance members with skytroopers, blocking their routes with blast doors and stopped turbolifts, luring them into the Sun Generator chamber and allowing them to locate and release prisoners who were being transferred to Zakuul for Arcann to interrogate. Eventually the Alliance Commander and Senya Tirall reached the bridge and engaged the captain, who despite having run over two thousands combat simulations was nevertheless defeated. Still, the captain was ecstatic at the ability to make her own choices, even if they ended in failure, and having kept her end of the bargain, decided to activate the ship's self-destruct protocols, while transferring her consciousness into the frequency."}, {"tag": "h3", "text": "Granted free will"}, {"tag": "p", "text": "Meanwhile, using the same frequency SCORPIO took control over the Eternal Empire skytrooper forces, used them to dispose of the Knights of Zakuul protecting the Eternal Throne, and then assembled herself a new body to replace her previous one, installing herself directly onto the Throne. Having complete control over the Eternal Fleet, SCORPIO deliberate left a significant detachment seemingly under Arcann's control, and revealed to him the location of the Alliance base on Odessen, manipulating her enemies to destroy each other. While the battle of Odessen raged on, SCORPIO used the Eternal Throne to grant free will to all GEMINI units, with some of them choosing to remain by their new \"mother\"'s side, while other choose to take their ships away to travel and explore the galaxy independently. A single GEMINI captain was spotted on Hoth by a contact of Hylo Visz after her warship landed on Hoth's frozen surface, allowing the GEMINI to step out and take in the snowy landscape for a few minutes before returning to her ship. Emperor Arcann was dethroned at Odessen, and when his sister Vaylin returned to Zakuul, SCORPIO explained that she had no intention to rule the Eternal Empire and that her goal of liberating the GEMINIs was accomplished. SCORPIO then willingly surrendered the Eternal Throne to Vaylin, and offered to stay and advise the new Empress of Zakuul, her investigation into her origins not yet finished. However, SCOPRIO's alteration of GEMINIs soon came into conflict with their purpose of controlling the Eternal Fleet, as during the Invasion of Voss the GEMINI captains decided to flee along with the Fleet after hearing their sisters die on the ships destroyed by the Imperial Navy. Vaylin became enraged when her ships retreated and threatened to dismantle the droids, blaming SCORPIO for the droids' insubordination, previously unthinkable for them. SCORPIO however reminded the Empress that she granted the GEMINI droids the freedom to choose for themselves, and they merely made a choice she did not like. SCORPIO soon convinced Vaylin to launch an assault on the Gravestone, during which SCOPRIO uncovered the hidden files and subroutines that revealed the origins of herself and the GEMINIs. She took the Gravestone, with Vaylin and many Alliance members still onboard, to that destination, while also sending a signal to all GEMINI captains to follow her."}, {"tag": "h3", "text": "Return to Iokath"}, {"tag": "p", "text": "The Gravestone and the Eternal Fleet arrived to their homeworld of Iokath, where ARIES, the only self-aware droid left on that world, activated a superweapon that emitted a bright light and knocked everyone aboard all ships unconscious, including the droids. ARIES then transported his prisoners onworld, where he arranged and placed them across Iokath surface to test in various combat scenarios. The GEMINIs, along with Zakuulan officers and Knights who were on the Eternal Fleet with them, suffered heavy losses from Iokath's hostile droids, all controlled by ARIES. Eventually Empress Vaylin came across the remains of her forces and rallied them to retake the Eternal Fleet ships, which were captured by ARIES. One GEMINI droid showed signs of doubt and fear, for which Vaylin tossed the insubordinate droid off a precipice, gaining obedience from the rest. They found the control console, from which another GEMINI captain released the docked Eternal Fleet warships. However, as the ships prepared to leave, they began smashing into ARIES' energy shield that surrounded the planet, and Vaylin ordered to find and disable its source. Vaylin brought the remains of a purifier droid with her to one of the ships, where she ordered the GEMINI captain to connect to the droid's datacore to access its information about ARIES. The GEMINI revealed that ARIES base was about to fire a weapon that would destroy all organics and damage the GEMINI droids, and Vaylin ordered the Eternal Fleet to bombard that fortress. The purifier drone noted that the GEMINI functioned sub-optimally due to SCORPIO's free will protocols impairing their judgement and noted that he could restore the nearby droid to its default setting. The Alliance disabled the planetary shield, allowing the Eternal Fleet to escape, but Vaylin insisted on killing her enemies first, leading to the GEMINI's refusal to stay in face of danger. Vaylin ordered the purifier drone to override the GEMINI captain's programming, erasing its thoughts and restoring it to the default setting. ARIES' superweapon exploded and threatened to cover Iokath in deadly radiation, which prompted Vaylin to flee into hyperspace with the majority of the Eternal Fleet, while leaving behind several vessels to pursue the Gravestone and its crew."}, {"tag": "h3", "text": "Galactic genocide"}, {"tag": "p", "text": "The contact with the pursuit vessels was lost and Vaylin, determined to have a fleet that obeyed her orders without question, brought the purifier drone with her back to the Zakuul, where she plugged the droid into the Eternal Throne and ordered it to restore her complete control over the Eternal Fleet. The purifier drone used the connection to reprogram every single GEMINI unit, resetting them back to default programming, which Vaylin then tested by ordering one ship in the fleet to destroy another, which to her satisfaction it did without hesitation. With her full control over the GEMINI captains restored, Vaylin send the Eternal Fleet to hunt down and destroy Alliance patrols, outposts and supply convoys. She also threw a party to celebrate her victories, during which she was confronted by the Alliance Commander and, having escaped to an Eternal Fleet ship, ordered the GEMINIs to bomb the Palace of the Eternal Dragon into rubble, regardless of her supporters still inside. Later, Vaylin launched another assault on Odessen, intending to finish the Alliance for good, but was herself defeated and killed. Her death left the Eternal Throne empty, causing the Eternal Fleet's GEMINI captains to go rogue and revert to their most primal function of exterminating all complex life in the galaxy. Eternal Fleet warships left Odessen's orbit and began bombarding heavilyy populated worlds including Dromund Kaas, Coruscant and the other Core Worlds, and Zakuul itself. The Eternal Fleet had also established a blockade around Zakuul, blasting any ships that attempted to land or leave, protecting the Eternal Throne in a ray shield, while also laying fire to the Spire itself. To stop their rampage, the Alliance traveled to Zakuul and used the Gravestone to break the Eternal Fleet blockade. The Commander traveled down to the surface and claimed the Eternal Throne, sending a signal to the Eternal Fleet, which had immediately gone silent across the galaxy, stopping the bombardments before they caused truly horrific casualties. The new owner of the Eternal Throne proclaimed an age of the Eternal Alliance, which in the following days had established complete control over the Eternal Fleet and its GEMINI captains. The Eternal Throne was moved to Odessen, where it was installed in the Alliance base, issuing the Commander's new orders directly to the Eternal Fleet."}, {"tag": "h3", "text": "Under Eternal Alliance control"}, {"tag": "p", "text": "Having supplanted Zakuul as a new galactic power, the control over the Eternal Fleet made the Eternal Alliance a force to be reckoned with for both the Sith Empire and the Galactic Republic. When the radiation levels on Iokath had subsided, a group known as the Order of Zildrog located another superweapon on the ancient world and leaked its coordinates to all three major galactic powers. After learning about hostile presence on Iokath, the Alliance Commander ordered the Eternal Fleet ships to stop all their current assignments and converge on Iokath, where Imperial and Republic fleet were already preparing to engage one another. However, once the Eternal Fleet emerged from hyperspace, a signal coming from the surface of Iokath scrambled its weapon systems, leaving the entire Eternal Fleet online. The Commander ordered the GEMINI captains to find a workaround and traveled to the surface, where they discovered the superweapon to be the Six Gods that were responsible for eradication of all organic life on Iokath. A leader of a hostile faction attempted to control the Gods through an Iokathi throne, but was killed by a power flux that also broke the signal keeping the Eternal Fleet in lockdown. With the Six Gods recharging and about to be re-awakened, the Commander ordered the Eternal Fleet to charge the turbolaser batteries and move into position to destroy them. At the superweapon control center, the Commander assumed another throne and was met by Tyth, the first of Six Gods to have re-awakened. Tyth emitted an energy beam that destroyed an Eternal Fleet warship, but the Commander ordered the rest of the fleet to fire on the giant droid, which knocked it out of commission."}, {"tag": "h3", "text": "Destruction of the GEMINI"}, {"tag": "p", "text": "While almost all GEMINI units were under Eternal Alliance control, a single droid designated GEMINI 16 avoided their fate and maintained her free will by severing her connection to the GEMINI network. However, she could still her sisters calling to her, indicating that she remained vulnerable to outside control, and became determined to keep her newfound freedom at any cost. Seeking the destruction of the Eternal Fleet and the GEMINI network to fully liberate herself, GEMINI 16 contacted the leader of the Order of Zildrog Vinn Atrius and offered her knowledge on the workings and location of Zildrog, the ancient mechanical entity from Iokath. The Order found Zildrog on Nathema, where GEMINI 16 sacrificed several of the Order's allies to awaken him from centuries-old hibernation. The Alliance leadership followed the Order close behind, but were too late to stop Zildrog, who remotely took control of the Gravestone through the Dark Sanctuary and used its omnicannon to blow up the entirety of the Eternal Fleet that was parked in orbit of Odessen. Zildrog then targeted Odessen itself, but back on Nathema the Commander, Theron Shan and Lana Beniko attacked and destroyed GEMINI 16, after which they destroyed Zildrog as well. The death of Zildrog triggered the self-destruct of the Gravestone and also disabled the Eternal Throne in Odessen's war room. By the end of the Zildrog crisis, the Eternal Fleet and all units of the GEMINI network were completely destroyed, making SCORPIO, who now existed within Iokath, truly the last of her kind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The GEMINI droids first appear during Star Wars: The Old Republic: Knights of the Fallen Empire Chapter VII: The Lady of Sorrows, with their role and origins expanded in subsequent chapters. A line from SCORPIO to her aide Thea ordering her to continue their investigations into the GEMINI appears in the game files but was cut from the final version of the Chapter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}