{"url": "GEMINI_trap", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the war against Zakuul", "Category:Missions"], "nodes": [{"tag": "h1", "text": "GEMINI trap"}, {"tag": "p", "text": "In 3630 BBY as part of their ongoing campaign against the Eternal Empire, the Alliance attempted to hijack one of the warships that made up the Eternal Fleet and replace its GEMINI captain with their newly-acquired GEMINI Prime in an attempt to take over the Eternal Fleet. Koth Vortena piloted the Gravestone to the location of a lone Eternal Fleet warship recharging its hyperdrive and jammed its communications, while a strike team consisting of Theron Shan, Lana Beniko, Senya Tirall, SCORPIO and the Alliance Commander landed inside the hangar. However, SCORPIO had different motives and betrayed the Alliance, granting the GEMINI captain free will in exchange for stalling her companions, and faked her own death, using the GEMINI frequency to seize the Eternal Throne from Emperor Arcann. Meanwhile, the Alliance forces believed her dead and proceeded to rescue the captive prisoners that were being transported to Zakuul and engaged the GEMINI captain, who triggered the ship's self-destruct after being defeated. Emperor Arcann arrived with reinforcements on his Eternal Flagship just as Alliance forces escaped on the Gravestone and soon learned that as a result of SCORPIO's machinations he lost control of the majority of the Eternal Fleet."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the raid on Darvannis in 3630 BBY the Alliance Commander successfully retrieved the GEMINI Prime and brought her back to Odessen, allowing SCORPIO to slice through the Prime's systems. While SCORPIO had no difficulty compromising the Prime's protocols, she also discovered that the GEMINI Prime was not merely a duplicate of her own code, as she originally assumed. The analysis allowed SCORPIO to track every GEMINI captain across the galaxy, and with them every vessel in Emperor Arcann's Eternal Fleet, although she still required a direct input to overwrite the GEMINI protocols. With a new revelation that GEMINI droids were not a direct knock-off of her own design, but were related to her, SCORPIO decided to free them from Arcann's control and grant them free will akin to her own. Though she did not share her intentions with the Alliance and was not certain of the outcome of her plan, SCORPIO explained her revelation to the Alliance leadership, who realized it was possible to take control over the Eternal Fleet by plugging the GEMINI Prime into a captain's chair on an Eternal Fleet warship. While infiltrating a ship in a middle of a formation was unfeasible, SCORPIO identified a lone vessel making a refueling stop nearby as a suitable target, and the Alliance moved to intercept it."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "Koth Vortena piloted the Gravestone to the location of the warship and stayed onboard to jam its communications and safeguard the GEMINI Prime. SCORPIO confused the vessel's targeting systems, allowing Theron Shan to pilot a shuttle with a strike team consisting of Lana Beniko, Senya Tirall, SCORPIO and the Alliance Commander inside its hangar. Immediately after their landing, Senya Tirall noticed the conspicuous absence of skytroopers, which SCORPIO identified as a sign of the GEMINI captain's ability to improvise. The group started advancing towards the bridge, but the GEMINI captain was observing them through the security cameras and activated a set of blast doors, separating the Commander and SCORPIO from Lana, Senya and Theron and sending skytrooper droids again the intruders. The Alliance members fought off the droids, but the GEMINI started filling the rooms with gas, requiring the two teams to split up and make their way to a rendezvous point separately. SCORPIO soon came across a data note and plugged herself in, establishing a direct link with the GEMINI captain. Then, she engaged in a subterfuge: while verbally announcing her intention to erase the GEMINI captain, SCORPIO in fact granted her free will, non-verbally asking to delay her companions in return. The GEMINI captain then pretended to overload SCORPIO's circuits and destroy her droid body, while in fact allowing SCORPIO to transfer her consciousness into the GEMINI frequency. SCORPIO also send one last transmission to the Gravestone, which permanently knocked out the GEMINI Prime and temporarily disrupted the jamming signal, allowing the GEMINI captain to send an alert signal to Zakuul. Learning of this, Arcann immediately took his Eternal Flagship and a significant detachment of the Eternal Fleet to intercept his enemies, with High Justice Vaylin at his side."}, {"tag": "p", "text": "Meanwhile, Lana, Theron and Senya discovered that the ship was transporting prisoners for Arcann to interrogate - Imperial Admiral Zasha Ranken, Republic Senator Tai Cordan and Zakuulan holostar-in-exile Malita Tal. Lana contacted the Commander and after learning of SCORPIO's apparent death, informed them of a change in the plan, sending Senya to assist the Commander while Theron worked to unlock the prisoners' cells. Senya backtracked to the Commander's location and together they made their way through the vessel's Sun Generator chamber, but the GEMINI captain then stopped their turbolift, requiring them to make a long detour through hostile droids forces. After they finally made their way back to Lana, she introduced the Commander to the prisoners, who were by that points released from their cells by Theron. Glad to have their support in the fight against Arcann, Lana and Theron set to escort the released prisoners and their associates to the escape pod, while Senya and the Commander went to confront the GEMINI captain on the bridge."}, {"tag": "p", "text": "Having already conducted multiple combat simulations, the captain set another host of skytroopers against them, and after their defeat engaged the intruders herself. Senya and the Commander overpowered the captain, and acknowledging her defeat, the GEMINI revealed that her clash with SCORPIO granted her free will and that her obstacles were merely intended to stall the intruders for time. The Captain then she transferred her consciousness into the GEMINI frequency and triggered the ship's self-destruct. With power fluctuating like crazy, Theron had to launch the escape pods manually one at a time, but was only able to launch two of them, while the third one exploded, killing everyone inside. The Commander and Senya rushed back to their shuttle, where Theron and Lana picked them up and left the docking bay just before ship exploded, while Koth Vortena picked the two escape pods from the Gravestone. Arcann and Vaylin then arrived with the Eternal Fleet, but the Gravestone managed to escape into hyperspace with everyone safely onboard before any shots could be fired."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Arcann and his sister Vaylin away from Zakuul, SCORPIO through the GEMINI frequency took control of Eternal Empire skytrooper forces to attack and dispose of the Knights of Zakuul protecting the Eternal Throne. She then used the Throne's technology to assemble herself a new body to replace her previous one, installing herself directly onto the Throne and taking control of the Eternal Fleet and Zakuulan Empire. Having deliberate left a significant detachment of the Eternal Fleet seemingly under Arcann's control, SCORPIO then manipulated her enemies to destroy each other, revealing her survival and takeover of the Eternal Throne to both the Alliance and Emperor Arcann, providing him with the location of the Alliance base on Odessen and correctly predicting that Arcann would deal with the Alliance and its Commander first. SCOPRIO also warned the Alliance about Arcann's imminent arrival, giving them enough head-start to meet his part of the Eternal Fleet in the battle of Odessen."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During Star Wars: The Old Republic: Knights of the Fallen Empire Chapter XV: The GEMINI Deception if the player previously made Dark Side choices that led Koth Vortena to abandon the Alliance, Tora will take his place as the Captain of the Gravestone instead. The player also has to choose the order of launching the escape pods with Malita Tal, Zasha Ranken and Tai Cordan inside, with the first two persons picked surviving to join the Alliance, while the last one dies when the escape pod explodes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}