{"url": "GR-75_medium_transport", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starship classes", "Category:GR-75 medium transports", "Category:New Republic starship classes", "Category:Resistance starship classes", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "GR-75 medium transport"}, {"tag": "p", "text": "The GR-75 medium transport, sometimes referred to as the Gallofree transport, was a transport designed and constructed by Gallofree Yards, Inc.. They were lightly armed with a clamshell-like hull to protect the cargo pods it carried. They could not reach anymore than 650 kilometers per hour and had a class 4 hyperdrive."}, {"tag": "p", "text": "They were used by the Rebel Alliance before and during the Galactic Civil War. In the early days of the rebellion, one was destroyed on a supply mission to Teralov and two more were destroyed in the Battle of Atollon. At least ten transports served at the Battle of Scarif, and later in the war thirty served as escape craft during a partially successful attempt to evacuate rebel forces from an assault on Hoth, in which thirteen were able to escape. At least sixteen also participated in the decisive Battle of Endor, where three were engulfed in the explosions of the Liberty and Nautilian. Many GR-75 transports served in the Battle of Jakku, and by the time of the Cold War, several GR-75 medium transports were in the service of Jinata Security, which were modified with additional laser cannons."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "GR-75 medium transports, sometimes referred to as Gallofree transports, were dedicated transports built by Gallofree Yards, Inc. at a length of ninety meters. Equipped with a class 4 hyperdrive and a class 15 backup they were able to reach speeds of 650 KPH. The defenses of a GR-75 transport consisted of both deflector shields, but the GR-75 Combat Retrofit program subsidized by Gallofree Yards meant four twin laser cannons could be added. Unlike the more protective dorsal armor, the cargo pods and their containment fields offered little protection for the transport's internal systems."}, {"tag": "p", "text": "GR-75 transports had a clamshell-like durasteel hull consisting of a central spar and keel. They could carry up to 19, 000 metric tons, 1,000 more as encumbrance, of cargo pods which are held in place by heavy magnetic shields. Other than cargo, livestock and passenger could also be carried in ray shielded pods. The transport was controlled from a small bridge situated towards the rear of the craft, and it had seven sublight engines at its rear. The average crew of a GR-75 transport consisted of a pilot and co-pilot, an engineer, a cargo master and three more crew members."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "GR-75 transports were used for both military and commercial purposes and were common among bulk freighters in spacelanes. Military or paramilitary organizations occasionally used them for evacuation or underway replenishment purposes. The Rebel Alliance incorporated many into their growing fleet as medical ships, fireships, communications ships, rescue ships, resupply ships and troop transports. It was principle for the transports to be kept at the rear in battle as they were too slow and weakly armored for frontline engagements. Combat retrofits could be used to draw fire from the enemies, much to the concern of their captains. The Jinata Security similarly used more armed variants as escorts during the Cold War."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early service with the rebellion"}, {"tag": "p", "text": "The GR-75 medium transport was designed and built by Gallofree Yards, Inc. It was designed similarly to the older GR-45 medium transport. Gallofree Yards went bankrupt and was taken over by Kuat Drive Yards by 5 BBY."}, {"tag": "p", "text": "Following the blockade of Ibaar, the fugitive Mon Calamari Admiral Raddus sent a document written by his aides, Caitken and Shollan, to Mon Mothma, leader of one of the leading rebel cells, about the current status of the starships part of the early rebellion against the Galactic Empire. It had details of the fleet's major composition, including GR-75 transports as well as Pelta-class frigates, CR90 corvettes, CR70 corvettes, Sphyrna-class Hammerhead corvettes, and Braha'tok-class gunships."}, {"tag": "p", "text": "A while later, Phoenix Cell, one of the early rebel groups against the Empire, used these one of these transports on a mercy mission to the planet Teralov, and was escorted by Green Squadron. However, they were ambushed by an Arquitens-class command cruiser which deployed TIE interceptors to fight the rebels. The A-wing starfighters of Green squadron engaged the TIEs but were quickly picked off one by one. Once Green squadron were wiped out, the TIEs then destroyed the transport despite its surrender."}, {"tag": "p", "text": "Sometime after, around 2 BBY,[source?] Mon Mothma declared the formation of the Rebel Alliance, to unite the rebel cells against the Empire. As a result, a fleet of rebel starships traveled to her location at Dantooine. Two GR-75 transports were among the vessels that rendezvoused there following the speech."}, {"tag": "p", "text": "Shortly after, two GR-75 transports were stationed with Phoenix Cell above the planet Atollon as they amassed with a portion of the larger rebel cell known as the Massassi Group. Intending to launch an assault on the TIE defender project on Lothal, their plan was foiled by Grand Admiral Thrawn, who was able to locate the rebels as well. Before the two cells were able to travel to Lothal, the Seventh Fleet, led by Thrawn, ambushed them. Although the rebels tried to break the blockade, they lost a great deal of their starships in the process. Following the loss of both of their flagships, the remaining of the cells, including the two GR-75s, were forced to retreat back to Phoenix Cell's base on the surface of Atollon."}, {"tag": "p", "text": "The rebel starships hid under the cover of Chopper base, the headquarters of Phoenix Cell, and its shield. After a brief bombardment on the shield, Thrawn sent his ground forces down to defeat the rebels. In the ensuing fight, the remaining rebel forces found themselves overwhelmed and the shield was soon destroyed. One GR-75 transport tried to escape but was shot down and destroyed by Imperial All Terrain Armored Transports. Other rebel forces were soon able to escape the base and run the blockade above, but without the final GR-75."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "In 0 BBY, at least twelve GR-75 transports traveled to Scarif with Admiral Raddus to assist ground forces who were trying to steal the plans the Empire's new superweapon, the Death Star. While fighting above the now closed Shield Gate, TIE fighters ravaged a GR-75 during their attack run on the fleet. Once the Death Star plans had been sent to the rebel flagship, the Profundity, Raddus ordered the fleet to escape. As the rebel ships began jumping into hyperspace, the Imperial-class Star Destroyer Devastator arrived and cut them off. One GR-75 was too close to the Star Destroyer to avoid it and almost immediately crashed into it. Other GR-75 transports that had also been cut off avoid the volley of turbolaser firing on the Profundity."}, {"tag": "p", "text": "Following the Battle of Yavin, a GR-75 transport traveled with a large number of ships to Espirion to help Princess Leia Organa. More of them were with the rebel fleet when Mon Mothma, Admiral Gial Ackbar and General Jan Dodonna receive a distress call from the droid R2-D2. Another was present when Organa left the rebel fleet for Vrogas Vas. One helped evacuate Sunspot Prison following a massacre there. A GR-75 was traveling in concert with an EF76 Nebulon-B escort frigate before the Siege on Tureen VII. Following an attack on the Rebel Fleet, GR-75 transports landed on the surface of Baraan-Fa while the Organa and Mothma discussed having new rebel base. As a result, Organa traveled to Crait aboard the Millennium Falcon with a GR-75."}, {"tag": "p", "text": "In 3 ABY thirty GR-75 transports were stationed at the Alliance's secret base on Hoth. After an Imperial probe droid discovered the rebel presence there, Darth Vader traveled there with his fleet, Death Squadron. The rebels began evacuating, assigning two X-wing starfighters as escort to each GR-75. The Quantum Storm left first, under the cover of the rebels' V-150 Planet Defender. The Thon's Orchard and Dutyfree also escaped Hoth. The final transport to leave was the Bright Hope, which was meant to have Organa aboard before she was cut off from reaching it by a tunnel blockage. By the time it had escaped, seventeen of the transports had been destroyed. After, several GR-75 transports were stationed at the Backup Rendezvous Point Gamma-Nine, where Luke Skywalker received a new cybernetic hand inside the Nebulon-B frigate Redemption."}, {"tag": "p", "text": "In 4 ABY, the Alliance fleet amassed near Sullust in preparation to attack the second Death Star. At least sixteen GR-75 transports were among the starships present. They soon traveled to the Endor system to begin their assault, but were ambushed by Death Squadron. In the following battle, the explosion of the MC80 Star Cruiser Liberty claimed a GR-75. Another transport was engulfed by the explosion of the Nautilian. However, in a turn of events, rebel starfighters were able to fly into the Death Star via its exhaust ports and destroy it. Following the Battle of Cawa City seventeen days after, GR-75 transports were stationed with the rebel flagship Home One at Muster Point: Vergence. An additional GR-75 carrying Shara Bey and a number of other rebels arrived and docked into the flagship. The fleet, still including GR-75 transports was later at Muster Point: Stalwart. By 5 ABY, the Alliance, now the New Republic, had chased remaining loyalist forces of the Empire to Jakku. The New Republic Defense Fleet, including GR-75 transports, engaged the Empire in an assault that claimed some of the GR-75s present. Nevertheless, the New Republic won, and the Empire surrendered shortly after."}, {"tag": "h3", "text": "Cold War"}, {"tag": "p", "text": "After the Galactic Civil War, groups within the New Republic continued to use the GR-75 for aid and supply missions. At least one of these GR-75s was painted with several blue markings, and was present above Hosnian Prime while it was escorted by a trio of T-70 X-wing starfighters. During the Cold War, the Jinata Security used modified GR-75 transports which were equipped with additional laser cannons. Three escorted the Nebulon-B frigate Opportunity when it engaged Iden Versio and the Corvus above Athulla. They were destroyed by Versio's X-wing."}, {"tag": "p", "text": "In 35 ABY, GR-75 transports were part of a fleet assembled by Lando Calrissian to assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The GR-75 transport first appeared in Star Wars: Episode V The Empire Strikes Back. Ultimate Star Wars, published on April 28, 2015, identifies it as the GR-75 transport, but the official Databank entry lists it as a \"GR-75 medium transport.\" In Star Wars Legends, the ship was identified by the 2004 reference book Inside the Worlds of Star Wars Trilogy, written by James Luceno and illustrated by Richard Chasemore and Hans Jenssen."}, {"tag": "p", "text": "During production of The Empire Strikes Back, the GR-75 transports were nicknamed \"tuna ships,\" and the model had a slight pink cast. Despite being transports, they were included in the battle scenes of Star Wars: Episode VI Return of the Jedi because more ships were needed, but no in-universe explanation of their presence has been given."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}