{"url": "GR-75_medium_transport/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starship classes", "Category:Galactic Empire starship classes", "Category:Galactic Republic starship classes", "Category:GR-75 medium transports", "Category:New Republic starship classes", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "GR-75 medium transport"}, {"tag": "p", "text": "The GR-75 medium transport, also known as the Gallofree medium transport or Rebel transport, was a clamshell-hulled transport produced by Gallofree Yards, Inc. Many of these transports served the Alliance Fleet during the Galactic Civil War, including playing a pivotal role in the evacuation of the Rebellion's Echo Base during the Battle of Hoth."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A sister design to the civilian GR-45 model, the GR-75 was used by freight drivers and shipping firms to haul cargo."}, {"tag": "p", "text": "The transport's outer hull was like a thick shell with the interior entirely open for cargo pods. This open-space design could fit up to 19,000 metric tons of cargo into the 90 meter long ship. Modular cargo pods greatly sped up the loading and unloading process."}, {"tag": "p", "text": "When the transport was at its cargo capacity, a magnetic shield locked the modules in place, while at the same time kept out the vacuum of space. The factory model included space for forty passengers, but almost all ships traded it for increased cargo storage."}, {"tag": "p", "text": "Focused entirely on maximizing cargo space, GR-75 transports were armed with four turreted twin laser cannons, a deflector shield produced by the shield generator pod above the stern, a meager Class 4 hyperdrive, and a sublight engine array capable of achieving a top atmospheric speed of 650 kilometers per hour. While inexpensive, the GR-75 was notorious for its high maintenance requirements."}, {"tag": "p", "text": "Some of these transports were used as shuttles for high ranking Rebel Alliance personnel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The design proved popular with Galactic Republic forces, and the ships were used as resupply vessels during the Clone Wars."}, {"tag": "p", "text": "The Galactic Empire used at least one known unit, the Shackles of Nizon, which saw service as a slave ship."}, {"tag": "p", "text": "Many GR-75 transports were acquired by the Rebel Alliance due to their low cost and ready access to spare parts. The transports had hulls impenetrable by Imperial sensors and were additionally equipped with sensor jammers, making them undetectable to Imperial sensors, thus reducing the chances of Imperials detecting Rebel supply runs. Not intended for combat, GR-75s were commonly placed at the center of Alliance fleet formations and relied on starfighter support in blockade-running missions. After Gallofree Yards went bankrupt in 3 BBY, the majority of the remaining stock of ships found its way into the Alliance fleet."}, {"tag": "p", "text": "Several GR-75 transports were part of a fleet led by the Salvation in 1 BBY. The fleet was attacked by Boba Fett, who was trying to capture Juno Eclipse. The fleet then jumped to Kamino on the order of General Rahm Kota to take out the Timira City Cloning Facility. After the battle, several GR-75s were used as decoys while the imprisoned Darth Vader was taken to the Dantooine base aboard the Rogue Shadow"}, {"tag": "p", "text": "One of the most famous actions performed by GR-75s was the evacuation of Rebel personnel during the Battle of Hoth. More than half of the GR-75s were destroyed, as the Imperial blockade proved too much for the Rebel defenses, though thirteen escaped safely, due to the escort afforded by the X-wings of Rogue Squadron, as well as the covering fire provided by the V-150 anti-orbital ion cannon."}, {"tag": "p", "text": "The Alliance used the GR-75s for almost any purpose they could find and the ships became so ubiquitous that they became commonly known as Rebel medium transports. They were primarily used to transport supplies, equipment, and troops. Some were modified to be fuel tankers for long range starfighter missions or for smaller ships. They also were used as kamikaze vessels, as demonstrated during the assault on the Fondor shipyards and the Battle of Endor, where they functioned as fire ships and were loaded with explosives."}, {"tag": "p", "text": "Several vessels fell into the hands of the Hutt Cartel who used them to land troops and attack vehicles on Hypori for the Ground Battle on Hypori."}, {"tag": "p", "text": "At least one GR-75 was used to make up a secret retreat in 137 ABY, and several were used during the Evacuation of Dac."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The GR-75 first appeared with the release of Star Wars: Episode V The Empire Strikes Back and its tie-ins."}, {"tag": "p", "text": "The GR-75 has been re-imagined in LEGO form with the release of LEGO Star Wars II: The Original Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}