{"url": "GRZ-6B_wrecker_droid", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Droid stubs", "Category:Construction droid models", "Category:Serv-O-Droid, Inc. products"], "nodes": [{"tag": "h1", "text": "GRZ-6B wrecker droid"}, {"tag": "p", "text": "The GRZ-6B wrecker droid, also known as GRZ-6B demolition droid, was a wrecker droid developed by Serv-O-Droid, Inc.. Like the EVS Construction Droid, it was used for demolishing and recycling structures. However, it had a reputation of doing its job recklessly and creating large amounts of industrial waste to the like of rubble or slag."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A typical GRZ-6B unit stood at six meters with four massive hydraulic arms and legs which were attached to a wide squarish torso. The torso was heavily plated with three layers of heavy durasteel shielding the droid from heat, impacts and explosions resulting from the work. The joints of the arms and legs were covered in flexible sleeves made from plasteel bands and a polymerical coating."}, {"tag": "p", "text": "For a better balance, the droid's metallic feet were splayed at the cost of some maneuverability. Hinged plates fixed to the hands likened to those of the many species of the galaxy allowed a GRZ-6B to take hold of objects. These could also be magnetized for removing ferrous metals. An industrial-grade plasma torch fitted into the left palm and a laser cutter in the right palm allowed the droid to dismantle complex constructs, such as an old abandoned building or a wrecked vehicle."}, {"tag": "p", "text": "A GRZ-6B's front view, or \"face\", was dominated by a colossal maw consisting of two grooved shearing plates. If ground together with full force, these plates could easily crush even the thickest of cables or the hardest chunks of metal. Behind the maw lay a large internal fusion furnace which took up nearly the entirety of the torso. There, chunks of scrap metal were melted down into alloys which could be removed for recycling or disposal."}, {"tag": "p", "text": "All instructions were entered into a GRZ-6B via a rear access panel which allowed a unit to operate without much supervision though simple directional orders or emergency cutoff signals could be transmitted from even a hand-held control."}, {"tag": "h2", "text": "Operational History"}, {"tag": "p", "text": "The GRZ-6B wrecker droids were introduced during the last decades of the Old Republic. By the time of the Galactic Empire's peak of power, the GRZ-6B had been out of production for over three decades with the majority of surviving units being rewired and jury-rigged. However, they could easily be maliciously programmed due to the rear access panel in their design."}, {"tag": "p", "text": "At Hosk Station in the Kalarba system, the criminal Olag Greck used a sabotaged GRZ-6B called Grozbok to rampage the surrounding area in coordination with his theft of an ash-ore shipment. However, the station's Unit Zed constable disabled the droid by throwing a stun stick into the access panel which disabled the droid quickly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}