{"url": "GT-series_construction_droid", "categories": ["Category:Canon articles", "Category:Construction droid models", "Category:Veril Line Systems products"], "nodes": [{"tag": "h1", "text": "GT-series construction droid"}, {"tag": "p", "text": "The GT-series construction droid was a construction droid produced by Veril Line Systems. With a burly design, the GT-series possessed numerous tools and could undertake various tasks on construction sites. While GT-series droids were focused in their tasks, units could develop personalities and act overly talkative when not at work."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A class five droid, the GT-series construction droid was part of a line of construction droids that dated back to the AM-Mk II, utilized during the mid-Republic Era. Standing at two meters tall, the GT-series had a burly appearance, with broad shoulders and a narrow waist. The droid possessed powerful limbs that contained a number of construction tools, as well as a fusioncutter."}, {"tag": "p", "text": "The GT-series construction droid's programming allowed it to perform common functions on construction sites. It could carry out basic labor and other tasks such as logistics, planning, problem solving, and supervising other construction droids. Possessing a programming suite that allowed it to interface with the I-C4a combat construction droid, the GT-series was often used to replace the droid vehicle's organic crew."}, {"tag": "p", "text": "Generally quietly competent, the GT-series carried out its tasks and followed orders with little fuss. The construction droids were quiet and focused while on their job sites, but while not working, they tended to be garrulous and didactic. Some units developed personalities, enjoying to work with organics in the field."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The GT-series construction droid was manufactured by Veril Line Systems and was available for 17,500 credits during the Galactic Civil War. The droids were used by Rebel Alliance engineering units, and could develop personalities as a result."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The GT-series construction droid was mentioned in Fully Operational, a 2018 sourcebook for Fantasy Flight Games' Star Wars: Age of Rebellion roleplaying game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}