{"url": "187th_Legion", "categories": ["Category:Legends articles", "Category:Grand Army of the Republic legions"], "nodes": [{"tag": "h1", "text": "187th Legion"}, {"tag": "p", "text": "The 187th Legion, also known as Mace Windu's Attack Battalion, was a legion of elite clone troopers that served under High Jedi General Mace Windu and a Clone Commander. They were distinguished by the purple markings on their armor which matched Mace Windu's hurrikaine lightsaber crystal in color."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Siege of Dantooine"}, {"tag": "p", "text": "Specifically trained to be capable of supporting their High Jedi General in battle, the 187th Legion participated in many strategic missions throughout the Clone Wars."}, {"tag": "p", "text": "At the onset of the Clone Wars, immediately after the Battle of Muunilinst, the Confederacy of Independent Systems began using the planet of Dantooine as a staging ground against the Republic. Learning of this Separatist presence, Master of the Order Mace Windu dispatched an army of clone troopers to take back the planet. During the battle, the 187th Legion secured an important victory for the clone army, which allowed the Republic to take control of the planet."}, {"tag": "h3", "text": "Battle of Coruscant"}, {"tag": "p", "text": "During the final stages of the war, the Confederacy of Independent Systems launched a full scale invasion on the Republic's capital. During the battle, the droid army began an assault on the Jedi Temple. The 187th Legion, led by their Clone Commander, fought to protect the temple."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Troopers of the 187th Legion wore phase II clone trooper armor equipped with a communications antennae, and a command sash similar to CC-8826's. Their armor was adorned with light blue and purple markings, in a pattern very similar to that of clone shock troopers. Some troopers also wore clone airborne armor, which included their clone commander. They carried BlasTech Industries DC-15S blaster carbines, DC-15A blaster rifles, and DC-17 hand blasters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In late 2007, Hasbro released an action figure box set, within their Ultimate Battles line, containing this legion of clone troopers. The set contained three troopers of the 187th Legion, and their clone commander."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}