{"url": "GUHL-JO387O", "categories": ["Category:Canon articles", "Category:Planet stubs", "Category:Desert planets", "Category:Outer Rim Territories planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "GUHL-JO387O"}, {"tag": "p", "text": "GUHL-JO387O was a planet located on the edge of the galaxy's Outer Rim Territories that was covered in craters, deserts, mountains, and mud. At some point before the attack on Tuanul, in 34 ABY, the First Order Resurgent-class Star Destroyer Finalizer was posted in orbit over GUHL-JO387O."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "GUHL-JO387O was a remote planet located in a remote sector of the galaxy's Outer Rim Territories. Craters, deserts covered mostly the entire planet, but the planet also featured mountains, mud, and volcanoes. The planet had an atmosphere breathable to oxygen-breathers, such as humans. The planet was also inhabited by purple like creatures, which had four arms, and four ears."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Cold War, before the attack on Tuanul, around 34 ABY, the First Order Resurgent-class Star Destroyer Finalizer was posted in orbit over GUHL-JO387O. On aboard the Finalizer, Kylo Ren and three other First Order generals, including  General Armitage Hux were discussing a attack on Jakku. Later, after the discussion, Kylo Ren commanded captain Phasma in investigate for in resistance activity on GUHL-JO387O. Later, instead of finding resistance activity, Phasma, FN-2187, and other stormtroopers ran into the natives of GUHL-JO3870 that were about to attack, but left the planet before attacking them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "GUHL-JO387O was first introduced in Pest Control, a story in the Star Wars Adventures series, which was written by Landry Q. Walker with art by Eric Jones and released on October 18, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}