{"url": "GU-series_Guardian_police_droid", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Coruscant Security Force", "Category:Security droid models", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "GU-series Guardian police droid"}, {"tag": "p", "text": "The GU-series Guardian police droid, also known as the 501-Z police droid or Coruscant police model, was a model of police droid utilized by the Coruscant Security Force on the capital planet of Coruscant in the later years of the Galactic Republic. The Guardian police droid was ideally suited to patrol the vast cityscape of Galactic City since it could not be affected by corruption and fatigue and was thereby able to greatly supplement the work of sentient police officers. Programmed for law enforcement tasks, the droid was able to use force against sentients if certain perimeters were met such as the possible harm occurring to citizens or if laws are broken. For this, the droid was armed with an SS-410 Police Special blaster pistol and a baton. However, the rather rigid thinking of the droid also meant it could be outsmarted. Painted in a blue-gray color scheme, the police droid had a masculine programming and a humanoid shape; the head formed into a cylindrical helmet with a vocabulator as a mouth and photoreceptors for eyes."}, {"tag": "p", "text": "Police droids were mostly stationed on Coruscant's upper levels and while they could be at times found on a few of the top tier levels of the Coruscant Underworld, the planet's lowest and most violent levels were firmly the domain of the underworld police division. Police droids largely performed the function of patrol officers such as conducting routine checks of their assigned areas to deter criminal activity and they would respond to emergency calls either on foot or in BARC speeders and Panther police interceptors. Once on scene, the police droids took initial steps and created perimeters, detained suspects, and questioned witnesses. In depth investigations were handed over to sentient police investigators who the droids would assist by collecting evidence and performing crowd management. During the Clone Wars, the Guardian police droids assisted in investigating the kidnapping of Che Amanwe and Chi Eekway, the daughters of Chairman Papanoida of Pantora. They also assisted Police Lieutenant Tan Divo during the homicide investigation of Rodia Senator Onaconda Farr. They collected evidence, secured the crime scene, and assisted in arresting the murderer. By the end of the Republic, the police droids were largely phased out and their functions taken over by stormtroopers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Coruscant Security Force utilized a model of police droid known as the GU-series Guardian police droids on the capital planet Coruscant to assist organic police officers in maintaining order on the urban world leading up to and during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Specifically, the police droids were deployed on the upper levels of the city, while the rougher underworld police officers patrolled the lower levels. While given combat programming, their primary function was to prevent people from being harmed."}, {"tag": "p", "text": "The police droids were humanoid in shape, with arms and five-fingered hands, legs, a central torso, and a head. The top of the head formed into a tall, cylindrical helmet. The head also sported glowing, yellow-white photoreceptors and a tiny mouth, which allowed the droids to intake fluids. The units were painted in a blue-gray color scheme and wore the Coruscant police symbol on their helmet, as well as the upper left section of the breastplate. They were programmed as masculine and could speak Galactic Basic Standard. When shut down, the droids could be activated remotely through devices such as a datapad. The droids could also intake fluids through their vocabulator."}, {"tag": "p", "text": "Police droids were equipped with SS-410 Police Special blaster pistols and batons to defend themselves. Their duties included setting up a perimeter, collecting evidence, preliminary interrogations, and holding and arresting suspects. When on patrol, the police droids either traveled on foot or used BARC speeders and Panther police interceptors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The police droids performed included assisting in the investigation of the kidnapping of Che Amanwe and Chi Eekway, the daughters of Chairman Papanoida of Pantora. They also assisted Lieutenant Tanivos Exantor Divo during the homicide investigation of Rodia Senator Onaconda Farr. They collected evidence, secured the crime scene, and assisted in arresting the murderer. By the end of the Republic, the police droids began to be phased out.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Guardian police droids first appeared in the Star Wars: The Clone Wars television series episode \"Lightsaber Lost,\" where their voices were performed by Tom Kane. The \"Senate Murders\" episode commentary states that the police droids had been used by the Coruscant police for a long time when the Clone Wars began, and that they were phased out by the time of the events of Revenge of the Sith. They also appeared and played a prominent role in the episodes \"Senate Murders\" and \"Pursuit of Peace.\""}, {"tag": "p", "text": "The police droids were based on the Keystone Kops, a series of silent film comedies about an incompetent group of policemen. In \"Pursuit of Peace,\" a droid sitting in a police speeder is seen drinking a liquid before spilling it when spotting the speeding Padmé Amidala. Whether this was meant to factually describe the need for the droids to intake fluids or if it was simply comic relief has not been clarified."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}