{"url": "GX1_short_hauler", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Republic starship classes", "Category:GX1 Short Haulers", "Category:New Republic starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "GX1 short hauler"}, {"tag": "p", "text": "The GX1 short hauler, also known as the GX1 hauler, GX1 diplomatic ship, Lantillian short hauler, Lantillian Hauler, or Lantillian shuttle, was a shuttle model manufactured by Lantillian ShipWrights. During the Clone Wars, the Galactic Republic used several top-of-the-line GX1 short haulers, including the Phoenix and the Valorous, as diplomatic vessels. During the Age of the Empire, GX1 shuttles were used as starbuses to ferry commuters from one location to another. Although the diplomatic variant was equipped with turret-mounted double laser cannons, the civilian starbus variant had no weapons."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Measuring 37.28 meters long, the GX1 short hauler was a model of shuttle designed for long, extended missions and tours of constituencies. As such, it was equipped with a Class 2 hyperdrive. One of its variants, which was used during diplomatic missions, was fitted with a turret-mounted double laser cannon. It also had a pilotable secondary pod that detached from the primary hull and was equipped with its own compact hyperdrive, allowing delegates to escape the most uncomfortable situations. A civilian variant, which was used as a starbus for interplanetary travel, was devoid of armament and piloted by an RX-Series pilot droid. GX1 starbuses were also equipped with a pair of docking tubes that extended from either side of the ship like an accordion and replaced the detachable pod with a cargo bay door."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Manufactured by Lantillian ShipWrights, GX1 short haulers existed as far back as the time of Clone Wars, which pitted the Galactic Republic against the Confederacy of Independent Systems. During that conflict, the Republic utilized the Phoenix, a red-hulled top-of-the-line GX1, as a diplomatic vessel. It was notably used to bring Republic envoys to the neutral planet of Mandalore, where talks with the Confederacy would take place. Later in the Clone Wars, a GX1 known as the Valorous transported Senator Padmé Amidala, who was accompanied by her handmaiden Teckla Minnau and Nix Card of the InterGalactic Banking Clan, to the planet Scipio, where she was to secure a loan from the Banking Clan on the Republic's behalf."}, {"tag": "p", "text": "After the conclusion of the Clone Wars when the Republic transitioned into the Galactic Empire, the GX1 short haulers were utilized as civilian transports and often seen throughout the Outer Rim Territories. During the ensuing Age of the Empire, a number of weaponless GX1s were used as interplanetary starbuses. In the spaceport of Garel City, on the Outer Rim planet of Garel, there were a number of such starbuses. One of them was hijacked by the freedom fighter Sabine Wren, who was supposed to deliver the power droid EG-86 to Havoc Outpost."}, {"tag": "p", "text": "Eventually, the Empire was defeated at Endor. Shortly thereafter, an armed GX1 shuttle was used to transport Leia Organa and Shara Bey, on behalf of the fledgling New Republic, to the planet Naboo for negotiations."}, {"tag": "p", "text": "At least one short hauler responded to General Lando Calrissian's call to action against the Sith Eternal forces and fought with the Citizens' fleet during the Battle of Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The GX1 short hauler first appeared in Star Wars Campaign Pack, a 1988 Star Wars Legends book written by Paul Murphy for West End Games' Star Wars: The Roleplaying Game. Its design was derived from an early concept of what would become the Lambda-class shuttle, drawn by Nilo Rodis-Jamero in 1981."}, {"tag": "p", "text": "It became canon after its inclusion in \"A Friend in Need,\" the fourteenth episode of the Star Wars: The Clone Wars television series' fourth season. The name \"GX1 short hauler,\" however, was only introduced in canon after the ship was given an official Databank entry on StarWars.com, following the release \"Blood Sisters,\" the sixth episode of the Star Wars Rebels animated television series' second season."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}