{"url": "GX1_Short_Hauler", "categories": ["Category:Legends articles", "Category:Galactic Republic starship classes", "Category:GX1 Short Haulers", "Category:Yacht classes"], "nodes": [{"tag": "h1", "text": "GX1 Short Hauler"}, {"tag": "p", "text": "The GX1 Short Hauler was a starship model produced by Lantillian ShipWrights."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The GX1 was a rugged and well-engineered vessel. Originally designed as a pleasure craft, it featured several amenities geared towards the comfort of its owner, such as a well-designed galley, a holotheater, and large living quarters. For defense, the basic configuration was armed with a civilian-graded turbolaser cannon and some modest shielding. These defenses however, often proved inadequate against attacks from pirates and other attackers, so most owners quickly upgraded them."}, {"tag": "p", "text": "The GX1 was easily converted from pleasure craft to cargo hauler, by removing most \"pleasure\" amenities. Its solid construction and reliability made it a good choice for cargo transport, and many smuggler captains retrofitted them to serve as smuggling vessels."}, {"tag": "p", "text": "One of its most infamous flaws was that its landing gear was extremely complex and maintenance-heavy. Obstructions such as dust and corrosion could easily jam its mechanisms and prevent it from retracting or deploying properly."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The GX1 original marketing targets were affluent retirees interested in cruising the starlanes in a well-equipped and comfortable vessel without the high price tags of other larger star yachts."}, {"tag": "p", "text": "The Lantillies-based design team of engineers led by Project Engineer Shil Tervo intended to produce a model that would compete with the more popular designs from the Corellian Engineering Corporation that were in high demand during that time. They did not succeed in that respect, but unintentionally managed to create one of the first luxury pleasure craft that was within the average consumer's financial reach."}, {"tag": "p", "text": "In 22 BBY, the corporation had to recall all GX1s with serial prefixes TRE-0034 through TRE-5215 due to faulty electronics. Shil Tervo released an apologetic statement and revealed that thousands of GX1s had left the assembly line with malfunctioning Fabritech 7Y4 sensor suites, although Fabritech officials claimed that it was Lantillian's mishandling that resulted in the hardware problems. To alleviate this issue, Lantillian allowed owners to bring their starships to any Lantillian Spacers' Brotherhood guild office to get their electronics upgraded free of charge."}, {"tag": "h3", "text": "Notable starships"}, {"tag": "p", "text": "The Ithorian Captain Ixsthmus flew a modified GX1 called Long Shot for the Alliance to Restore the Republic during the Galactic Civil War. Another notable modified GX1 was the Nova Whisper, a ship that had over the years accumulated a long list of owners."}, {"tag": "p", "text": "A group of Rebels discovered the Desolate on Otherspace while flying a short hauler."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}