{"url": "Gaarn", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Gaarn"}, {"tag": "p", "text": "Gaarn was an admiral in the Galactic Empire during the Galactic Civil War. Shortly after the Battle of Endor, Gaarn was tasked with protecting the Eclipse, a Super Star Destroyer orbiting Kuat, when it was attacked by the forces of the Zann Consortium, led by the crime lord Tyber Zann. Commanding from the Executor-class Star Dreadnought Annihilator, Gaarn led a small fleet of three Imperial-class Star Destroyers and attempted to repel the Consortium forces. However, the Imperial forces were defeated, and the Annihilator was destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gaarn served the Galactic Empire as an admiral during the time of the Galactic Civil War. In 4 ABY, shortly after the Battle of Endor, the Zann Consortium—a criminal organization led by crime lord Tyber Zann—attacked the Imperial shipyards above the planet Kuat to capture the Super Star Destroyer Eclipse. Gaarn, along with the Admiral's flagship, the Executor-class Star Dreadnought Annihilator, led a small fleet of three Imperial-class Star Destroyers to assist the struggling Imperial forces over Kuat."}, {"tag": "p", "text": "Gaarn's fleet attacked the forces of the Zann Consortium, which had already boarded and seized control of the Eclipse. The Annihilator focused on destroying the massive warship before the enemy could use it to destroy the Imperial fleet. However, the Consortium forces were able to destroy the Annihilator and all other Imperial ships, allowing Zann to gain access to the data archives of the Eclipse."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gaarn was created for the the 2006 LucasArts real-time strategy video game Star Wars: Empire at War: Forces of Corruption, an expansion for the video game Star Wars: Empire at War. Gaarn does not directly appear in Forces of Corruption, but rather is mentioned in the Annihilator's infobox, which can be seen if the player moves the cursor over the ship itself during gameplay. Gaarn's ship appears in the last level of the campaign and serves as the final boss. While the Annihilator has to be destroyed in the game, Gaarn's fate is not revealed, but most likely they died."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}