{"url": "Gacerite", "categories": ["Category:Legends articles", "Category:Races and species stubs", "Category:Expansion Region species", "Category:Mammalian sentient species"], "nodes": [{"tag": "h1", "text": "Gacerite"}, {"tag": "p", "text": "The Gacerites were bipedal sapients indigenous to Gacerian."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Gacerites were thin humaniods with spindly limbs. Their eyes were small to protect against the bright sunlight of their world, but their ears were oversized. In addition to a set of highly efficient lungs, the species had a secondary set of air-intake holes in their necks that were directly connected to a third lung. This allowed them to sing without having to pause to take in a breath. They spoke in musical tones, and higher pitches meant they were happier."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Gacerite society was classless, and focused heavily on etiquette and music. They were known to sing songs that would encapsulate their feelings. Gacerite soldiers would use the song \"Aria Callet'dira\" for motivation. Hearing and the sense of sound were the most important thing to them. Silence was akin to death and atonal sounds were considered vulgarities.  Gacerites were very interested in learning customs and manners of different cultures, and expected any visitors to Gacerian to at least attempt to meet their standards of etiquette. Due to their dedication to manners, they made excellent diplomats and translators. They were also very skilled at improving the programming of 3P0 droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the reign of the Galactic Empire, the Gacerites welcomed Imperial rule as they were very bad at self-governance. Once a week, the Governor would meet with local officials to go over routine matters. The  governor Gostech permitted the Gacerites to rule themselves with little oversight. This encouraged them to take a liking to Imperial rule, and they happily followed their governor's laws."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Notes and references"}]}