{"url": "Gaege_Xarran", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Humans", "Category:Imperial Army generals of the Galactic Empire", "Category:Males", "Category:Royal Guard"], "nodes": [{"tag": "h1", "text": "Gaege Xarran"}, {"tag": "p", "text": "A military man, Gaege Xarran served in the Imperial Army, first as a member of the Emperor's Royal Guard, and later as a general. Dedicated to the armed forces, Xarran was placed in command of an Imperial garrison on the planet Vryssa during the height of the Galactic Empire. With his base on the planet protected by advanced technology, as well as a complement of troops and starfighters in which Xarran had total confidence, the Imperial general offered asylum to his wayward brother, Rivo Xarran, who had crossed the Hutt crime lord Jabba Desilijic Tiure and was fleeing bounty hunters. Upon Rivo's arrival, however, it soon emerged that General Xarran's garrison had come in the way of Boba Fett, who was pursuing the bounty on Xarran's brother."}, {"tag": "p", "text": "Xarran's prideful statement that the garrison on Vryssa could withstand any intruder was taken as a challenge by Fett, who set to work on eliminating or evading the base's many troops and defenses. After Xarran saw two of his military detachments destroyed at the hands of the bounty hunter, and his starfighters thwarted by a diversion, the general grew frenzied, putting the lives of his subordinates at risk in unsuccessful attempts to rid himself of his opponent. Eventually, Xarran evacuated his base, took up arms, and went after Fett alone, ambushing and injuring the bounty hunter deep within the garrison. During the short confrontation that ensued, the former Royal Guardsman was killed by his quarry."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and military service"}, {"tag": "p", "text": "Gaege Xarran grew up alongside his younger brother, Rivo Xarran, and proved himself the favorite in the eyes of his parents. Obedient, successful and possessing a spotless record, Xarran was opposite to his brother in every way, as his parents often proclaimed. The two brothers diverged once again when Rivo was thrown in jail for a minor theft, and Xarran entered the Imperial Academy. Rivo subsequently ran away from home, earning a living as a criminal and a slicer. Xarran rarely heard from his brother over the years, except when his younger sibling needed something. Xarran excelled in the military, serving first in the Imperial Army before he went on to enter the elite Imperial Royal Guard. Xarran's brief time as a Guardsman left him well-trained in close-quarters battle. He returned to the regular army, rising through the ranks rapidly and soon becoming a general."}, {"tag": "p", "text": "As a general, Xarran was placed in command of an Imperial garrison on the forested planet Vryssa. The garrison complex was well-defended, not only by an electric \"death fence,\" as Xarran liked to refer to it, but also by shielding, tractor beams, watchtowers, sensors, and droids. To complement the passive defenses, Xarran also had forty TIE/LN starfighters, several All Terrain Armored Transports and their All Terrain Scout Transport counterparts, and the requisite squads of stormtroopers. With this array of firepower at his disposal, Xarran grew confident of the abilities of himself and those who served under him."}, {"tag": "h3", "text": "Assault on the Vryssa garrison"}, {"tag": "p", "text": "When Xarran's brother found himself in trouble once more, the Imperial general was again contacted by Rivo, who petitioned for aid. The slicer had stolen over 150,000 credits from Hutt crime lord Jabba Desilijic Tiure, and had thus been marked for capture and subsequent execution before Jabba. Aware that his brother was at risk of death, Xarran offered Rivo asylum on Vryssa, certain in the fact that even if the slicer's location was discovered, the garrison could protect him from any intrusion. Rivo arrived by shuttle at the base's landing platform, whereupon Xarran and an honor guard of stormtroopers received him. When Xarran saw his brother was a nervous wreck, the disciplined general grew disgusted, and berated Rivo in front of his men. Xarran struck his brother out of anger, and was shocked as Rivo responded by drawing a hold-out blaster. Once the general had comforted his brother and disarmed him, he encouraged Rivo, claiming that even if a bounty hunter had tracked the slicer to Vryssa, the garrison would provide protection against any foe. Xarran then led his brother into the garrison complex. Unbeknownst to Xarran, a bounty hunter had indeed tracked Rivo to Vryssa—Boba Fett, an infamous professional who listened in on the general's conversation and took Xarran's statement on his garrison's supposed impregnability as a challenge."}, {"tag": "p", "text": "In the command center of the base, shortly after his brother's arrival, Xarran was alerted by Commander Tyrix that a patrol had failed to report in. The general, despite his sibling's immediate panic, failed to acknowledge that anything was amiss. When Tyrix reported that all four members of the patrol had been found killed, without having fired a single shot to defend themselves, Xarran could no longer deny the facts. He dispatched two detachments—Alpha and Delta Group, each composed of one AT-AT, three AT-STs and several squads of stormtroopers—out into the forests to find the bounty hunter, who Rivo proclaimed was Boba Fett. Remaining confident in the overwhelming strength of his force in comparison to one man, Xarran ordered the intruder brought before him, preferably alive. The general watched proudly as the search was coordinated. Then, without warning, the base's entire communications network went down, preventing Xarran and his subordinates in the command center from contacting the detachments. For little under an hour, the communications black-out remained, driving Xarran into a rage as he ordered Tyrix to remedy the situation. Once Fett's jamming device had run its course, communications were restored, and Xarran had Tyrix set up a link with Alpha and Delta groups. With no response forthcoming from either unit, Xarran himself began to panic; at first blaming Tyrix for not fixing the communications network, he then struck his brother when Rivo announced that Fett had doubtlessly destroyed both detachments."}, {"tag": "p", "text": "After Xarran had apologized to his brother, Tyrix reported that a lone AT-AT had returned. The image of the walker was brought up on the tactical screen but, as with earlier attempts, the general received no response when he tried to open communications. In front of the control room staff, including the Xarran brothers, the AT-AT then blew up, destroyed by a thermal detonator, as a message for the garrison's occupants. Disgusted, Xarran retreated to his office, where he was joined by Rivo. The general decided on a change of strategy, ordering a total lockdown of the base and relying on his \"death fence\" to keep Fett out. Although Xarran criticized his brother for his actions in crossing Jabba, the former Royal Guard was still convinced that his bounty hunter opponent would ultimately fail. As night fell, his prediction appeared, to the general, to have come true. Fett's personal starship, Slave I, initiated a series of strafing runs on the base, which Xarran pronounced, from the safety of the command center, to be a desperate suicide run. When the base's turbolaser turrets failed to prevent the craft from inflicting heavy damage on the deflector shields, a furious Xarran ordered Tyrix to scramble the base's forty TIE Fighters. Testimony to his stubbornness, Xarran refused to issue an alarm, even as the starfighters proved unable to destroy the bounty hunter's ship. Eventually, however, as the starfighters were drawn further and further away from the base, Xarran realized that Fett was not even on the Slave I—he had already penetrated the \"death fence\" and was inside the complex. The general issued an intruder alarm."}, {"tag": "h3", "text": "Hunt and death"}, {"tag": "p", "text": "When Tyrix alerted the general to the fact that someone was using an old code to access a base computer to shut down the power to the complex, Xarran ordered the intruder's location sealed and gassed with Chemtrox, ignoring the risk to any nearby technicians. Fett still managed to shut down all power to the base, before killing Tyrix inside the base command center. Whipped into a frenzy by Fett's seeming invulnerability, Xarran ordered his command crew to leave, then activated the base's self-destruct system and set out to ambush and kill Fett. Having equipped himself with a carbine and its attached grenade launcher, Xarran lurked near the barracks, waiting for the bounty hunter to approach. As Fett moved past the general and used explosives to destroy the barracks door, Xarran seized the moment and fired upon his quarry, wounding the bounty hunter in the side and prompting a short firefight that left both participants injured. The general gradually approached the doorway to the room into which Fett retreated, unaware that the spot-luma mounted on his carbine was giving away his location. As Xarran leaped through the entrance to the room, one of Fett's thermal detonators landed at his feet and exploded, instantly killing the general."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Xarran's self-destruct destroyed his garrison, without killing Boba Fett. The elimination of the Imperial force on Vryssa, accomplished without any outside help, reaffirmed Fett's reputation following a recent failure, and was later considered the most impressive feat in the bounty hunter's long career. Despite Fett's rout of his forces and evasion of his prized defenses, however, Xarran's mission to protect his brother was ultimately successful. Distracted by events in the garrison and the general's ambush, Fett was unaware of Rivo Xarran's escape."}, {"tag": "p", "text": "The slicer contacted the bounty hunter and negotiated a deal that allowed him temporary amnesty while he fled. Rivo eventually journeyed to the backwater world of Ladarra, where he lived as a storyteller. Fett finally caught up with Gaege Xarran's brother some years later—coincidentally at the same time as Rivo was relating the events on Vryssa to an audience of children—but did not kill the former slicer, as Jabba the Hutt had died in the interim."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A prideful man, Gaege Xarran did not suffer disobedience or hesitation among his subordinates. The general despised being ignored, and was prone to lecture and criticize his brother from the moral high ground he saw in an honorable military career. Nevertheless, Xarran loved Rivo, despite the flaws he saw in his criminal sibling, and offered asylum and the promise of protection. When Boba Fett threatened this, Xarran's pride in his garrison and himself led him to underestimate the bounty hunter several times. The general's anger, which he usually managed to conceal, came to the fore during Fett's assault, along with fear, defeatism, nervousness and stress."}, {"tag": "p", "text": "The general perceived a challenge in Fett's actions; as his prized troops and technology failed him, Xarran first grew obsessive, risking the lives of his technicians to stop Fett's progress, and later became frenzied and erratic, shooting his own commander and setting up the base's self-destruct in an attempt to get even. In his unstable state of mind, the well-trained Xarran made mistakes, forgetting the disadvantage of the spot-luma on his rifle. Although he did die at the hands of the bounty hunter, Xarran was able to acquit himself while dueling Fett, despite being past his physical prime, as he managed to wound and trap his quarry, driving Fett to the brink of suicide."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gaege Xarran was introduced by author Paul Danner in the short story No Disintegrations, Please, which has remained his sole appearance to date. The majority of Danner's story is structured as a flashback to the events on Vryssa, related by an aged Rivo Xarran to a group of children on the planet of Ladarra. In the flashbacks, Gaege Xarran is presented as Fett's opponent. The Xarran brothers were depicted, along with other events from the short story, in Star Wars Adventure Journal 14, a role-playing publication that included No Disintegrations, Please. The short story's tagline alluded to the tale told by Rivo Xarran in his guise as The Storyteller, and the possibility of it simply being a fabrication. Indeed, although the tale of Vryssa is related by Rivo, there exists in the story moments that the slicer could not possibly have witnessed. Its in-universe veracity, however, is confirmed when Boba Fett appears at the end and speaks with The Storyteller, referring to him as Rivo. Thus, the Vryssa episode, while related by Rivo Xarran, is simply presented to the reader as an extended flashback to the past, told from many perspectives."}, {"tag": "p", "text": "Along with the images of the Xarran brothers and other moments from the story, a short blurb was included in Adventure Journal 14 that detailed facts about Gaege Xarran's early life and relationship with his brother. The general was later indirectly referenced in The New Essential Guide to Characters, under the entry for Boba Fett. Author Daniel Wallace provided the Vryssa episode with some chronological context, placing Fett's destruction of the garrison—and thus the death of Gaege Xarran—between Imperial General Rom Mohc's downfall in 1 ABY and the Battle of Hoth two years later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}