{"url": "Gaevril_Daraada", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gaevril Daraada"}, {"tag": "p", "text": "Major Gaevril Daraada was often described as a vicious man. While talented, he generally suffered from bad luck which severely slowed his ascendancy through the Imperial ranks."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the death of Palpatine during the Battle of Endor, Daraada found himself stationed on the Mid Rim backwater world Venaari where he was put in charge of the security of the secret Project Orrad in the city of Ven-Kav."}, {"tag": "p", "text": "Daraada hated his assignment, and he hated Venaari and its inhabitants often referring to them as \"so-called citizens of the festering backwater planet\". But most of all, he hated the Imperial governor of Venaari, Governor Vaerganth, who did not seem to care about project Orrad at all, forever turning down Daraada's requests for better equipment and better security. This annoyed Daraada immensely who feared that eventually the agents of the New Republic would interfere with Orrad. Generally frustrated with his situation, Daraada would take it out on the citizens of Venaari as well as on his Imperial subjects, whom he frequently scolded and abused verbally."}, {"tag": "p", "text": "As he saw it, his only hope of getting off Venaari lay in his interrogation and torture skills, which he was quite adept at. He hoped that those particular talents of his would some day earn him enough recognition for a reassignment."}, {"tag": "p", "text": "While on Venaari he discovered a cell of New Republic operatives who had stolen a data card with details about Project Orrad. He led an attack on them at the Binary Bar where Shandria L'hnnar was hiding out. Despite his best efforts, she managed to escape with the help of Sienn Sconn and headed towards Ven-Kavi Starport. Daraada gave chase in a Venaarian Strike Speeder. During the pursuit, Daraada reached out to Vaerganth to request that the governor redirect the Star Destroyer Retaliator to prevent L'hnnar from leaving the planet. When that was denied, Daraada instead contacted the bounty hunter Pentix Graphyt to intercept the New Republic agent. L'hnnar and Sconn managed to enter the starport and Daraada followed the New Republic agent was unable to capture anyone."}, {"tag": "h2", "text": "Appearances"}]}