{"url": "Gaiana", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Females", "Category:Humans", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Gaiana"}, {"tag": "p", "text": "Gaiana was a Human female Jedi Padawan who attended the Jedi academy on Coruscant at the same time of Roan Novachez's attendance there. She had already been training at the Academy when he came. The two were generally on friendly terms, though during Roan's second year a series of misunderstandings caused them to drift apart for a time, after which they became friends again. In her second year, she also organized a class pet program. In Roan's third year, they started fully dating."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "First year"}, {"tag": "p", "text": "In her first year, Gaiana already had several friends. This was the year she met Roan for the first time outside the docking bay and asked where he came from. They did not spend much time together until Gaiana met up with him during the school dance. They shared many classes. Gaiana also succeeded in the tryouts for the Lightsaber Fencing Tournament, and defeated Greer when the event occurred."}, {"tag": "h3", "text": "Second year"}, {"tag": "p", "text": "In her second year, Gaiana organized a class pet program, in which students took turns caring for a Voorpak from Naboo. This was the year she and Roan were on unfriendly terms, as Roan had hit her in the face with a ball, kidnapped the voorpak, and failed to find her at the dance, none of which had Roan intended to do. Roan also started having weird thoughts about Gaiana, after he caught her and Pasha holding hands, and seemingly spending a lot of time together. This led to her ignoring him entirely. Eventually they made up with each other, possibly after she saw his merciful aptitude for Pasha, despite them not being any more fruitful in their relationship. Gaiana also flew with Shi-Fara during the final flight exam."}, {"tag": "h3", "text": "Third year"}, {"tag": "p", "text": "In her third year, Gaiana still shared a lot of classes with Roan, minus her training with Librarian Lackbar. Generally, she and Lackbar were on good terms with each other, in contrast to Roan and Mr. Garfield. This was also the time Gaiana and Roan fully started dating. In her second semester, she got braces, embarrassing her. In the final exam for the semester, Gaiana worked with Roan, Shi-Fara, and Pasha, and they finished in 20 minutes. In the exam for the year, Gaiana finished first, as Ronald Rinzler had cheated to beat her quicker and no one else had finished the trials as quickly. After the party, Roan and Gaiana met up, and Gaiana said she got her braces off, and after some playful banter, she raced up and kissed him on the lips, surprising him. Gaiana later met up with him again, and they kissed each other."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gaiana was hard-working, thoughtful, and kind. Overall she was an extrovert, and was quite responsible, perfectionistic and well put-together. She was also compassionate, often attempting to help others, to varying levels of success. Gaiana was not afraid to stand up to her friends when she thought it was in their best interests, or when she felt they had done wrong. Gaiana was very determined and focused; while in class, she was quiet and collected throughout. Despite being calm overall, Gaiana was capable of fits of rage, though usually for good reason."}, {"tag": "p", "text": "Because of her compassionate and loving nature, Gaiana was popular, to an extent. Her sustained attitude masked deep insecurities and fear of failure and loss. Most of the students liked her, with the exception of Cyrus and Cronah, and especially Jo-Ahn, though Roan was their primary target. She did not pay much attention to them, however, and ignored Cronah even about her braces. Despite her confidence in her abilities, she was not arrogant or conceited, and helped her classmates with their schoolwork whenever she could."}, {"tag": "p", "text": "She was extremely loyal to her friends, though she was also sensitive to their misdeeds, especially when they were against her specifically. This also provided evidence that she might have been quick to jump to conclusions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}