{"url": "Gaib_%26_TK-0_Inc.", "categories": ["Category:Legends articles", "Category:Service industry companies"], "nodes": [{"tag": "h1", "text": "Gaib & TK-0 Inc."}, {"tag": "p", "text": "Gaib & TK-0 Inc. was a private technological bounty hunting company, owned and operated by the slicer Gaib and his droid TK-0. The pair specialized in the acquisition of dificult to come by information and technology for their clients. Gaib & TK-0 Inc. operated throughout and after the galaxy-spanning Clone Wars, during which time several employers hired the company's various services. Among the bounty hunting duo's numerous clients were the Hutt crime lord Jabba Desilijic Tiure, members of the Mandalorian Skirata clan, and even the Imperial Army, following the rise of the Galactic Empire."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Gaib & TK-0 Inc. was a bounty hunter organization that was formed by two individuals: a male Human slicer by the name of Gaib, and a droid known as TK-0, which resembled a taller, armored version of a standard R2-series astromech droid. Considered \"tech-hunters,\" the company focused on the acquisition of information and technology for its clients, and specialized in locating more obscure data and hard-to-source hardware. TK-0 was looked upon to provide computing power, data correlation, and for his talents in accessing local networks. At the same time, Gaib was responsible for overall logistics, TK-0's necessary maintenance, and for directing the droid's searches."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, following the kidnapping of the young Huttlet Rotta from his home on Tatooine, the services of Gaib & TK-0 Inc. were called upon by the criminal empire of Rotta's father, Jabba Desilijic Tiure. In order to locate the Hutt's missing son, Gaib and TK-0 utilized air traffic control records, comlink relay records, and medical database access records, in order to determine that the pilot of a ship leaving Tatooine around the time of the abduction had accessed the Galactic All-Species Self-Help Database, requesting information on Hutt healthcare and sickness. That same ship later landed on the planet Teth, in Wild Space. The two contractors reported to Jabba's estate on Tatooine with their findings, leading the Hutt crime lord to dispatch a team of bounty hunters to Teth. Gaib and TK-0 were subsequently paid for their services, though Jabba offered the two a substantial retainer's fee should they make themselves available to him whenever he needed, noting that should they decline his offer, the alternative would be death. The pair accepted, and while the mercenaries dispatched by Jabba failed to retrieve young Rotta from Teth, the Huttlet was ultimately rescued and returned to his father by Jedi Knight Anakin Skywalker and his new Padawan, Ahsoka Tano."}, {"tag": "p", "text": "A year later, in 21 BBY, Gaib & TK-0 Inc. was contracted by the Null-class Advanced Recon Commandos N-7 and N-11—also known as \"Mereel\" and \"Ordo\", respectively—on behalf of the clones' adoptive father, Kal Skirata. Mereel had originally contacted the bounty hunting duo as a means of acquiring hardware upgrades for Skirata's recently purchased submersible, Aay'han. He then put the company to work tracking shipments of laboratory equipment being illegally transported to circumvent the Republic Senate's ban on commercial cloning, as part of Skirata's search for the rogue Kaminoan scientist Ko Sai. The information and leads gathered by Gaib & TK-0 Inc. led Mereel and Skirata to Dorumaa, the moon of Almas in the Cularin system, where they found and captured Ko Sai. The two technological bounty hunters were summarily paid one hundred thousand credits for their equipment and informational services."}, {"tag": "p", "text": "Gaib & TK-0 Inc. again found itself in the employ of Kal Skirata and his clan in the year 19 BBY, in the weeks following the transformation of the Galactic Republic into the new Galactic Empire. During the events of the night Order 66 had been issued by then-Chancellor Palpatine, the clone troopers and commandos associated with Clan Skirata had attempted to desert the Grand Army of the Republic for Mandalore, when unfortunate circumstances necessitated that the commandos Darman and Niner be left behind on Coruscant. In payment of a favor owed to Mereel, Gaib secured a contract for service work with the new Imperial Army, during which time he was able to spy on the Imperial Commando Special Unit of the 501st Legion, and therein determine the status of both commandos. For additional payment, TK-0 infiltrated the 501st Legion headquarters and modified the helmets of both Darman and Niner to allow for secure communication between the two Imperial commandos and Clan Skirata's base of operations on Mandalore."}, {"tag": "p", "text": "When the Skirata clan decided to extract Niner and Darman, Gaib & TK-0 Inc. was called upon to acquire four sets of Imperial stormtrooper armor to allow the clan's clone members to infiltrate the 501st; Gaib and TK-0 delivering a full ten sets of stormtrooper armor into the clan's custody, in case their employers should have need of them in the future. Having been awarded an Imperial contract for servicing suit systems, the two tech-hunters found themselves with the ability to mark suits of armor they deemed to be defective to be returned to the manufacturer. The incredibly large scale of Imperial Army operations, however, allowed for a lack of oversight that enabled the pair of bounty hunters to simply keep what suits they marked as defective for later resale. Clan Skirata's plans to rescue their left-behind comrades proved ultimately unsuccessful, although Gaib & TK-0 Inc. was handsomely paid with a substantial stack of credit chips. TK-0 also stated that it was billing the Empire two hundred credits for every servodriver they needed for their armor servicing contract."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Both Gaib and TK-0 were first introduced to the Star Wars universe in the 2007 novel Republic Commando: True Colors by author Karen Traviss, the third book in the Republic and Imperial Commando series. They were later given a brief role in Traviss' novelization of the 2008 film Star Wars: The Clone Wars, but it was only upon the release of Imperial Commando: 501st that their tech-hunter company was finally given the name \"Gaib & TK-0 Inc.\" during the third chapter's epigraph."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}