{"url": "Galactic_Alliance_Core_Fleet", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Galactic Alliance fleets"], "nodes": [{"tag": "h1", "text": "Galactic Alliance Core Fleet"}, {"tag": "p", "text": "The Galactic Alliance Core Fleet, also known as the Core Forces, Galactic Alliance Remnant Fleet, or commonly the Galactic Alliance Fleet, was a major Galactic Alliance Navy fleet during the Sith–Imperial War that was formed to protect the Core Worlds under the command of Admiral Gar Stazi, part of this force escaped the ambush at the climactic Battle of Caamas, and became the basis for Stazi's Galactic Alliance Remnant. Because of this, the GA remnant was sometimes referred to as the Core Forces, in reference to the fleet that helped to create it."}, {"tag": "h2", "text": "Starships"}, {"tag": "h3", "text": "Capital Ships"}, {"tag": "p", "text": "During its history, the Galactic Alliance Core Fleet was equipped with various classes of capital ships. Most notably were the Scythe-class main battle cruisers, Pellaeon-class Star Destroyers and one Imperious-class Star Destroyer."}, {"tag": "h3", "text": "Starfighters"}, {"tag": "p", "text": "The CF9 Crossfire starfighter served as the Galactic Alliance's primary starfighter during the Sith–Imperial War and the Second Imperial Civil War."}, {"tag": "h3", "text": "Smaller crafts"}, {"tag": "p", "text": "The Core Fleet maintained an assortment of smaller crafts such as corvettes and frigates. Examples of corvettes used were the CR90 corvette. Examples of Frigates used were the ShaShore-class, Tri-Scythe-class and EF76 Nebulon-B escort frigates"}, {"tag": "h3", "text": "Other vessels"}, {"tag": "p", "text": "The Core Fleet also used Sabertooth-class assault/rescue vessels, a YT-2400 light freighter, a YZ-2500 heavy transport and Venator-class Star Destroyers"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}