{"url": "Galactic_Alliance_Fourth_Fleet", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Alliance fleets"], "nodes": [{"tag": "h1", "text": "Galactic Alliance Fourth Fleet"}, {"tag": "p", "text": "The Fourth Fleet of the Galactic Alliance Defense Fleet was one of the five main fleets of the Galactic Alliance government. It first saw service during the latter stages of the Yuuzhan Vong War. It was formed out of the New Republic Fourth Battle Group. The fleet was nicknamed the \"Fearless Fourth\" due to the skill of its crews."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the reorganization of the New Republic into the Galactic Alliance, four strategic fleets were assembled, modeled after the five strategic fleets of the old New Republic Defense Fleet."}, {"tag": "p", "text": "During the Battle of Yuuzhan'tar, the fleet was under the command of Grand Admiral Gilad Pellaeon, commanding from the Star Destroyer Right to Rule. The Fourth Fleet was the first Alliance fleet to arrive in-system, responsible for inserting Alliance troops onto the planet's surface to meet up with local resistance groups. The fleet was a mix of Alliance warships and ships of the Imperial Remnant."}, {"tag": "p", "text": "Under Admiral Ratobo and then-Admiral Gavin Darklighter after Ratobo's death, the Fourth Fleet took an active role in defending the Core during the Second Galactic Civil War, fighting the Confederation at Balmorra and Kuat in 40 ABY. Half of the Fourth Fleet fought under Jacen Solo at the Second Battle of Fondor."}, {"tag": "p", "text": "The Fourth remained loyal to Jacen Solo now operating openly as Darth Caedus. The Fourth would later support the Imperial Remnant in its occupation of the Roche system guarding convoys from Jedi StealthX raids. They would later constitute the Galactic Alliance element of the Second Battle of Roche between Imperial, Alliance-in-exile, Confederation, Jedi Coalition, Galactic Alliance and Maw Irregular Fleet forces."}, {"tag": "h2", "text": "Known Ships"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}