{"url": "Galactic_Alliance_Fleet_Intelligence", "categories": ["Category:Legends articles", "Category:Galactic Alliance intelligence organizations", "Category:Galactic Alliance military units"], "nodes": [{"tag": "h1", "text": "Galactic Alliance Fleet Intelligence"}, {"tag": "p", "text": "Galactic Alliance Fleet Intelligence, also known as Galactic Alliance Military Intelligence or Defense Force Intelligence, was the intelligence service of the Galactic Alliance Defense Force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Galactic Alliance Fleet Intelligence was formed from New Republic Fleet Intelligence and continued with the duties of providing intelligence and security services for the GA fleet. In 40 ABY, it was tasked to keep an eye on Thrackan Sal-Solo's plans for Centerpoint Station during the Second Galactic Civil War."}, {"tag": "p", "text": "During the administration of Chief of State Natasi Daala, a conspiracy sought to remove Daala from office. To do so, the conspirators including Moff Drikl Lecersen, General Merratt Jaxton and Senator Fost Bramsin, pretended that they had been poisoned along with the attempted poisoning of the Senate District water supply. This caused Daala to no longer trust Galactic Alliance Security with the protection of herself as well as the Senate Building. As the conspirators had hoped, Daala turned to the organization she trusted most, the GA Navy to provide security. Fleet officers took overall command of the Senate Building's security with GA Security in a support role, much to their displeasure. Fleet Intelligence specifically was given the task of protecting Daala as the conspirators had planned."}, {"tag": "p", "text": "On the day of the planned coup, Admiral Sallinor Parova entered the Chief of State's office and replaced the two Fleet Intelligence guards who were loyal to the GA, with two Fleet Intelligence guards who were loyal to the conspiracy. However, before Admiral Parova could move in to arrest Daala, the New Jedi Order launched their operation to remove Daala. With the added amount of Fleet officers, the Jedi had been able to easily infiltrate the Senate Building with both Fleet Intelligence and GA Security remaining unaware. As the Jedi attack began, the two Fleet Intelligence guards stunned Daala unconscious as Jedi Knight Leia Organa Solo and her husband Han Solo seized the outer office. When they forced open the door, the two Fleet Intelligence guards began firing at them but were stunned by the Solos. The Jedi then took Daala into custody with Admiral Parova claiming Daala had been stunned during the shooting."}, {"tag": "h2", "text": "Appearances"}]}