{"url": "Galactic_Alliance_Remnant", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Galactic Alliance", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Galactic Alliance Remnant"}, {"tag": "p", "text": "The Galactic Alliance Remnant, also known as the Alliance Remnant, or simply the Galactic Alliance, was a military resistance movement founded in 130 ABY from units of the Galactic Alliance Defense Force following the surrender of the Galactic Alliance government in the Sith–Imperial War. Under the command of Duros Admiral Gar Stazi, the Galactic Alliance Remnant was a major player during the subsequent civil war against Darth Krayt's Sith-controlled Empire. Seven years of hit and run operations against the Imperial Navy, including the capture of the Advanced Star Destroyer prototype, made the defeat of the Alliance Remnant forces a top priority for Darth Krayt and his Sith regime."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Antebellum"}, {"tag": "p", "text": "Prior to and throughout the Sith–Imperial War, the Galactic Alliance, once the New Republic, was the main power in the galaxy. Based on Coruscant and stretching as far as to the Outer Rim world of Dac, the Alliance government had been in power since the end of the Yuuzhan Vong invasion in the year 29 ABY. When Darth Krayt's Sith Order sabotaged the joint Jedi/Yuuzhan Vong Ossus Project, the Fel Empire invoked the Treaty of Anaxes and declared war on the Galactic Alliance. Although somewhat hobbled by the defection of some Alliance worlds due to anti-Yuuzhan Vong sentiments, the first year of the war went well for Alliance forces. The support of the Jedi Order on Ossus gave the Alliance an edge over Imperial forces in numerous engagements. However, once the Sith Order publicly revealed itself and openly pledged their support to the Empire, the tide of battle began to shift. Many military operations ordered by the Triumvirate ended in failure, which further eroded the confidence of Alliance member worlds. Desperate for a major decisive victory, Triumvirs Nu Toreena and Bail Antilles authorized a bold action proposed by Rear Admiral Piers Petan to capture Emperor Roan Fel over Caamas. Overriding the concerns of fellow Triumvir Gial Gahan, Jedi Master Kol Skywalker, and Galactic Alliance Core Fleet commander Admiral Gar Stazi, the Alliance government assembled a majority of their Core based warships, including Admiral Stazi's fleet, at Caamas to ambush Fel's forces and bring a swift end to the war."}, {"tag": "h3", "text": "Defeat at Caamas"}, {"tag": "p", "text": "Unfortunately for the Galactic Alliance, the Battle of Caamas proved to be an elaborate trap set up by Imperial forces under Grand Admiral Morlish Veed. Surrounding the system with numerous gravity mines, Alliance forces were trapped and surrounded by a superior force of Imperial starships. As the battle raged and both sides suffered heavy damage, news arrived that the Jedi Order would be unable to send assistance, due to a Sith attack on the Alliance capital of Coruscant. Jedi forces were able to prevent a Sith victory, though at the cost of heavy casualties. Sensing that victory was within his grasp, Grand Admiral Veed offered the Alliance terms for a complete surrender. Feeling that the battle was lost, Admiral Petan called on all GA forces to stand down. Unwilling to surrender and abandon the cause of the Galactic Alliance, Admiral Stazi called on all Alliance forces still willing to fight to join him in a strategic withdrawal. In addition to the warships of the Core Fleet, other GA commanders like Admiral Nict linked up with Stazi, who utilized his knowledge of local hyperspace routes to escape with a large fleet of Alliance warships. Mere days later, the Galactic Alliance government had finally fallen after over a hundred years of galactic rule: capitulated to the Imperial forces and absorbed into the newly formed Sith-controlled Galactic Empire."}, {"tag": "h3", "text": "Formation of the Alliance Remnant"}, {"tag": "p", "text": "Following the defeat at Caamas, Stazi's Core Fleet forms the foundation of the Galactic Alliance Remnant. Numerous other surviving Alliance warships and commanders and forces from all branches of Galactic Alliance Defense force linked up with Stazi, bolstering his forces considerably. As the highest authority in the fleet, Admiral Stazi was involved in every aspect of his fleet's operations. From the bridge of his flagship, the Scythe-class battle cruiser Indomitable, Stazi ensured that the beings serving under him abided by Galactic Alliance laws and military codes, treating situations in the belief that the Galactic Alliance would one day regain power and restore democracy to the galaxy. Former triumvir Gial Gahan covertly aided the Alliance Remnant, using his position on Dac to provide the Alliance with fresh recruits, weapons, supplies, and bacta. Deep space stations, such as the Black Redoubt, were assembled to serve as repair facilities and as a haven for Alliance forces."}, {"tag": "p", "text": "Deprived of any visible support from former Alliance member worlds absorbed by the new Empire, the Alliance Remnant fleet adopted tactical strategy similar to the one operated by Admiral Gial Ackbar and the Rebel Alliance Fleet against the Empire nearly 130 years prior during the Galactic Civil War. Hit and run operations, covert operations, and starship acquisition became the Alliance's top priorities. Given the complexities of running a major space-going navy without a safe home port, the Alliance focused much of its efforts on securing badly needed supplies to keep the fleet running at peak efficiency. Commando raids on supply depots, as well as a fleet supply train including repair ships, tankers, and bulk freighters, ensured that the GA Remnant's forces did not lack anything that would affect their combat readiness. Meanwhile, a considerable number of Imperial forces were deployed to track down the Alliance fleet, such as the Outer Rim Third Fleet under the overall command of the merciless Sith Lord Darth Azard."}, {"tag": "h3", "text": "Diplomatic overtures"}, {"tag": "p", "text": "As the galaxy fell under the increasing control of Darth Krayt, both the remnants of the Galactic Alliance and Fel's Empire-in-exile realized that they were competing for the same equally scare resources. In 137 ABY, deposed Emperor Roan Fel approached the Galactic Alliance Remnant with talk of a military alliance against Krayt's forces. Admiral Stazi chose to represent the Alliance directly, traveling to the Wheel to meet with Fel's representative Captain Mingo Bovark. Stazi was initially distrustful of Captain Bovark, as well as dismissive of the value of an alliance with Fel. The revelation that Fel's forces held Bastion was enough to convince Stazi of discussing an alliance, given the strategic value of the world and its status as one of the galaxy's best defended fortress worlds. The talks never finished, as Sith assassin Jor Torlin and Imperial agent Morrigan Corde sabotaged the meeting. Using C.O.L.D technology, the Sith-Imperial agents made it appear that Bovark's Imperial shuttle opened fire on Admiral Stazi's Crix-class diplomatic shuttle. As Galactic Alliance Intelligence agents faced off with Imperial Knights, Wheel administrator Pol Temm ordered the Imperials to leave the Wheel, as it appeared that their shuttle was the first to open fire. Both sides returned to their respective ships without having achieved any real progress towards forming a united front against the Sith."}, {"tag": "h3", "text": "Victory at Mon Calamari"}, {"tag": "p", "text": "The Alliance scored a major victory at the Battle of Mon Calamari. Despite what appeared to be a trap set by Admiral Dru Valan, Alliance forces were able to inflict heavy damaged on the Outer Rim Third Fleet, steal the Advanced Star Destroyer Imperious, and inflict crippling damage on the Mon Calamari Shipyards. Strategically, this action deprived the Sith Empire of a major shipyard and a significant source of new starship construction. However, the Sith didn't accept the theft of their most powerful ship well. Sith Emperor Darth Krayt led a party of Sith Lords and stormtroopers to the Mon Calamari Council, and declared that ten percent of the Mon Calamari would be executed for their support of Admiral Stazi and the rest would be placed in work camps. Because the Mon Calamari had been longtime supporters of the Galactic Alliance, many of Stazi's officers urged their commanding officer to take the entire fleet back to Dac. However, Stazi realized that his forces could not afford to be tied up defending Mon Calamari, as mobility was his fleet's best asset. The Imperious was inoperative, as Alliance technicians worked to bring the ship's weapon systems on. Unknown to the Alliance, the Imperious had been sabotaged by Imperial Knights before the battle of Mon Calamari to prevent its use by the Sith. However, after rescuing several downed Rogue Squadron pilots on Dac, Imperial Knight Sigel Dare revealed how to disarm the bombs on the Imperious. Impressed by their actions, Stazi agreed to reopen negotiations with Fel's forces for coalition against the Sith."}, {"tag": "h3", "text": "Joint operations with Fel"}, {"tag": "p", "text": "Following the death of Darth Krayt, a number of allied systems allowed ships from their planetary fleets to join the Remnant. Admiral Stazi led the fleet of Alliance warships in a joint naval operation against an Imperial stronghold at Ralltiir with forces loyal to deposed emperor Roan Fel. The purpose of the attack was to take the ships to bolster their fleets, while at the same time strain the Siths' ability to maintain control in the Outer Rim."}, {"tag": "p", "text": "The Bastion Second Fleet then came to assist, having held back to see if Stazi would commit to the attack. The fleet's Admiral, Edouard Fenel, reminded the opposing Imperials of the Coruscant Third Fleet, under the command of Admiral Peto Kelsan, of their duty to Roan Fel and ordered them to surrender their ships and kill those who disagreed under the threat of attacking. Seeing his forces outnumbered, Kelsan agreed. However, there was one ship that adamantly refused to, the Steadfast, under the command of Captain Vaclen Tor. Tor who understood Stazi and Fenel's plans, refused Fenel's orders, causing the Fel loyalist Admiral to ordered all of his Fleet, as well as that of Admiral Kelsan, to fire on the Steadfast."}, {"tag": "p", "text": "Admiral Kelsan refused to fire on his own people and, not before rescinding his previous order to surrender, ordered his subordinates to self-destruct and abandon their respective ships. Refusing to tolerate such insubordination, Fenel threatened to fire on any escape pods and demanded that Stazi follow suit, not realizing he was overplaying his hand. Refusing to be pushed around, Stazi instead protected the Sith-loyal pods as the ships self-destructed. Nevertheless, Fenel was adamant on destroying the Steadfast and recommended that Stazi move out of the way. However, determined to prove that they would not not vassals of the Empire, Stazi orders his fleet to use suppressant fire to wards off Fenel's forces. Also, by standing up to Fel and his Admirals, Stazi made it clear that the two heads of state would address each other as equals and that neither of their forces would lower themselves to employ the tactics employed by Sith-Imperial forces."}, {"tag": "h3", "text": "Evacuation of Dac"}, {"tag": "p", "text": "Eventually Darth Wyyrlok issued the Final Protocol to Sith scientist Vul Isen. To this end Isen poisoned the water world of Dac. Three days later Rogue Squadron was dispatched on a routine recon mission when they noticed the millions of dead Mon Calamari.After a dog fight with Imperial Predators, the Rogues headed back to the fleet to inform Stazi of the situation on Dac. Stazi, now alerted to the situation on Dac, immediately contacted General Oron Jaeger and informed him of the situation. General Jaeger informed Stazi that he was unable to commit the Fel's loyalist fleet without a direct order from the emperor himself. Undeterred Stazi was determined to act. Still on board the Alliance following the ambush in the Arkanis sector, Jedi Master Te Corso offered the assistance of the New Jedi Order. In addition to offering the a Jedi fighter group, Master Corso informed the admiral that the Order knew of a safe world were the refugees of Dac would be safe. Encouraged, Stazi put his plan into motion. Stazi dispatched elements of Rogue Squadron led by Ronto and Sword Squadron led by Master Drok to infiltrate the yards and disable the planets defenses. On the planets surface, Jedi Master Asaak Dan, Captain Tanquar and the Mon Calamari Rangers engaged Imperial stormtroopers on Heurkea, securing the cities docks to serve as the base of operations for the evacuation."}, {"tag": "p", "text": "With the shipyard defenses disabled and Heurkea secured, Stazi and the Galactic Alliance fleet emerged from hyperspace. The Alliance, backed up by multiple Scythe-class battle cruisers, captured Pellaeon-class Star Destroyers, and numerous frigates, engaged a token Sith force of five Star Destroyers. Outnumbered and overwhelmed by superior firepower, the surviving Sith warships retreated. With the space around Dac cleared, Stazi signaled the evacuation fleet. The genocide of the Mon Calamari and Wyyrlok's final protocol had angered citizens from across the galaxy. A fleet of private starships descended en masse on Dac to rescue the world's population."}, {"tag": "p", "text": "With the Galactic Alliance fleet engaged in rescue operation, the Sith Imperials sprung their trap. The Outer Rim Third Fleet, under the command of Admiral Krion Grail and supervised by Moff Geist and Sith Fist Darth Stryfe, dropped out of hyperspace behind the Alliance fleet. After a short fight it looked like Sith victory was soon at hand. General Jaeger, now with his Emperor's approval, arrived with a fleet of Fel loyalist, Star Destroyers and the two fleets worked together to drive back back the Sith. Stazi's forces managed to rescue 20 percent of the population."}, {"tag": "h3", "text": "Galactic Federation Triumvirate"}, {"tag": "p", "text": "In a daring attempt to overthrow the Galactic Empire once and for all, the Galactic Alliance Remnant and its allies launched a daring assault to liberate Coruscant and the entire galaxy from Sith dominance. With the aid of their Imperial and Jedi allies, the Alliance engaged the Sith-Imperial forces in a final battle to decide the fate of the galaxy. While Admiral Gar Stazi oversaw the fighting that occurred in Coruscant's orbit, the Jedi Cade Skywalker fought the Sith planet-side until he confronted Darth Krayt, the Dark Lord of the Sith and Emperor of the Galaxy."}, {"tag": "p", "text": "Despite heavy casualties on the allies' side, Skywalker completed his objective and killed Krayt, thus leaving the empire without its emperor. As the remnants of the One Sith rallied around the leadership of Darth Nihl, Krayt's self-proclaimed successor, the Galactic Empire completely fell apart with its crushing defeat at Coruscant. Under the rule of a new Triumvirate, composed of Admiral Gar Stazi, Empress Marasiah Fel and Jedi Master K'Kruhk, the triumvirs reunited the known galaxy in the year 138 ABY."}, {"tag": "h2", "text": "Government and politics"}, {"tag": "p", "text": "As a military resistance movement, the ultimate authority in the Galactic Alliance Remnant lay in its Supreme Commander, Gar Stazi. However, Stazi ensured that those serving in the Galactic Alliance Remnant fleet observed all prior military codes and Galactic Alliance laws, as laid down in the Galactic Alliance Common Charter. All members of the GA Remnant, from Admiral Stazi to the newest recruit, carried out their duties in the belief that they would be able to restore the Galactic Alliance government and return the galaxy to democratic rule."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Galactic Alliance Remnant had personnel from virtually every species in the galaxy, including beings from worlds that were not part of the Galactic Alliance. The largest single group in the GA Remnant was humans, though the majority of Alliance personnel were non-human. Mon Calamarians also had significant numbers in Alliance uniform, with the species possessing an even greater number of recruits following the genocide on Dac carried out by the Sith. Other species, including Bothans, Weequays, Klatooinians, Dugs, Duros, Ithorians, and Sullustans were also found in Alliance ranks as well."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The basis of the Galactic Alliance Remnant military was the Galactic Alliance Core Fleet. Following the fighting withdrawal from Caamas, numerous other Alliance units and individual warships joined up with Stazi's forces. The main warship of Alliance forces continued to be the Scythe-class battle cruiser. These impressive battle cruisers were backed up by numerous large escorts, frigates, and various support ships. The CF9 Crossfire was the Alliance's primary space superiority fighter. The Alliance also possessed numerous elite fighter groups, including the famous Rogue Squadron. Following the capture of the Advanced Star Destroyer prototype, the newly rechristened Alliance became the fleet's flagship and command ship of Admiral Stazi. While the majority of the Galactic Alliance Army was absorbed in the Imperial Army or was mostly disbanded following the surrender of the Triumvirate, army units attached to the Core Fleet became the basis of the GA Remnant's ground forces. The majority of these personnel became Galactic Alliance Commandos or GAC teams. These units varied from ad hoc teams formed for a specific mission to specialized units like the Venom assault squads."}, {"tag": "h3", "text": "Capital ships"}, {"tag": "h3", "text": "Support craft"}, {"tag": "h3", "text": "Transports/shuttles"}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h3", "text": "Elite starfighter units"}, {"tag": "h3", "text": "Elite commando units"}, {"tag": "h3", "text": "Known bases"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During an online chat conducted by TheForce.net, Jan Duursema was asked several questions regarding the Galactic Alliance Remnant. One chat participant asked \"Who are they\", to which Duursema replied, \"Galactic Alliance Core Forces? We'll see more of them later on.\""}, {"tag": "p", "text": "During the same online chat, another participant asked \"I would presume GACF is the 'remnant' of the Galactic Alliance… the rebels of the day? :D\". Ms. Duursema then replied \"like that.\""}, {"tag": "p", "text": "Randy Stradley confirmed in a thread on the Jedi Council Forums that the GACF has several other ships designed by Sean Cooke: \"Sean has designed a very cool looking main battle cruiser for the Legacy Era Galactic Alliance, and is in the process of designing a fleet of smaller support craft, missile cruisers, and the like. You'll be seeing the first of the GA craft in Legacy #8, And then more and more of them after that.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}