{"url": "Galactic_Basic_Standard", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Dialects of Galactic Basic", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Galactic Basic Standard"}, {"tag": "p", "text": "Galactic Basic Standard (or Galactic Basic, Galactic Standard, Galaxy Standard or just Basic) was the most prevalent language in the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the shattering of the Infinite Empire, the Rakatan's former slaves exterminated them and started to build their own empires with their masters' technology. Once the Core Worlds were joined by renewed communication channels and trade, they united as the first Galactic Republic. To allow easy communication among the new government's members, a trade language later known as Old Galactic Standard was chosen as the new official language of government and commerce. While Old Galactic Standard was mostly derived from Old Coruscanti, the mother tongue of the Humans of Coruscant, its vocabulary incorporated many words from over a dozen other languages, including Durese and Bothese."}, {"tag": "p", "text": "By the lifetime of Peshosloc, a holowright who lived between 15,762 BBY and 15,609 BBY, the language had evolved significantly enough to be considered a distinct historical division, which was latter dubbed Mid-Galactic Standard. Galactic Basic was further influenced by Dromnyr after the Vultans joined the Republic around 14,000 BBY, resulting ultimately in the modern Galactic Basic Standard."}, {"tag": "p", "text": "Under the Galactic Empire, a version of the language was known as Imperial Basic. The language was adopted by the Rebel Alliance, and as such was spoken in the Alliance of Free Planets, the New Republic, the Imperial Remnant, the Galactic Alliance, and the Fel, Sith and True Empires."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "Most sentient species that made galactic contact could and did speak Basic in addition to whatever native or regional language they might have used on a daily basis. Some beings normally did not possess the organs necessary to speak Basic, including Polis Massans, Ssi-ruuk, P'w'ecks, Wookiees, and a number of insectoid races. Most Gamorreans could not speak Basic, though there were exceptions (such as Governor Kugg). Whether or not a being could speak Basic, it was usually in their best interest to comprehend it, and most did."}, {"tag": "h2", "text": "Known accents and dialects"}, {"tag": "p", "text": "Various cultures created different accents around the galaxy, each with its own unique set of pronunciations. Some also used distinct dialects, which could have vocabularies or grammatical structures that different from the standard."}, {"tag": "p", "text": "The Wookiee Ralrracheen spoke Shyriiwook with a speech impediment. Due to the differences in the vocal abilities of Ralrra, his dialect was more clearly understandable by non-Wookiees learning the language; it was further suggested that some Wookiees with this condition could speak Basic, at the loss of all forms of Shyriiwook."}, {"tag": "p", "text": "Basic-speaking Rodians tended to suffer from speech impediments as well, most notably a lisp. Avaro Sookcool and Teeloo were two such Rodians; the phonemes [ɹ], [ɫ] and [s] proved to be the most problematic to vocalize."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Basic's relation to English"}, {"tag": "p", "text": "In Star Wars media, Basic is the same as English, with the exception of a few words and phrases devised by authors."}, {"tag": "p", "text": "StarWars.com has suggested that languages of the Star Wars universe like Ewokese in the animated series and the language spoken by the Towanis in Caravan of Courage: An Ewok Adventure and Ewoks: The Battle for Endor have been translated to English."}, {"tag": "p", "text": "In translations into non-English languages, Basic is assumed to be English but translated to the other language."}, {"tag": "p", "text": "While the letters are different in Basic than English, there are multiple examples where Latin alphabet letters are mentioned, such as in Obi-Wan Kenobi's quote, \"Do you have a plan B?,\" Mission Vao's habitual reference to Zaalbar as \"Big Z,\" and most droid designations (in-universe, this is referred to as the High Galactic alphabet). Greek letters (Old Tionese letters in the Star Wars universe) are used at times, examples including Delta Squad."}, {"tag": "h3", "text": "Accents"}, {"tag": "p", "text": "Dialects in English correspond to different in-universe accents in the movies. Ewan McGregor's and Ian McDiarmid's faint upper-class Scottish accents are, for example, Coruscanti accents in the movies. As a general rule, Imperial characters speak with RP-like British accents while Rebels usually have American accents. However, this is perhaps a representation of social class, as stormtroopers and other low-ranking Imperials speak with American accents, while some Rebels (Mon Mothma, for instance) speak with British accents. There are several exceptions to the rule: several high-ranking Imperial officers, such as Admiral Motti and Siward Cass, clearly have American accents. (Indeed, in A New Hope, a slight majority of Imperial officer accents are American.)"}, {"tag": "p", "text": "Other accents are also heard, such as:"}, {"tag": "h3", "text": "Original etymology"}, {"tag": "p", "text": "Star Wars authors have coined original English-like words derived from real English elements but which don't exist in the English language; they seem useful to a space-driven civilization of the Star Wars characters, but totally useless for our daily language. Some such words are  \"gentlebeing\" (equivalent to \"gentleman,\" but applicable to all species, including non-humanoid ones), \"offworlder,\" \"bird\" (slang for spaceship, similar to how an aircraft is a \"bird\" in US military slang), \"hyperspace,\" \"homeworld,\" \"spacer,\" \"sentientologist,\" \"youngling\" (\"young\" plus suffix \"-ling,\" meaning \"person\") and other technological terms like blaster, midi-chlorian, droid (from android), durasteel, astrogation, etc."}, {"tag": "p", "text": "However, Basic vocabulary includes some totally original words, of unexplainable etymology, unrelated to English, like Moff, Jedi, Padawan, Darth, etc., or even compounds like Twi'lek (\"twin lekku\"). It is possible that such terms are loanwords or are derived from other languages."}, {"tag": "h3", "text": "Notes"}, {"tag": "p", "text": "Basic is usually written from left to right; however, it can also be written from top to bottom (as seen in Junior Jedi Knights: Lyric's World, in the Massassi inscriptions)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}