{"url": "Galactic_Basic_Standard/Canon", "categories": ["Category:Canon articles", "Category:Language stubs", "Category:Incomplete lists", "Category:Dialects of Galactic Basic", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Galactic Basic Standard"}, {"tag": "p", "text": "Galactic Basic Standard, also known as Galactic Basic, Basic, or galactic standard, was the name of the most prevalent language in the galaxy. It was spoken by species including—but not limited to—humans, Pantorans, and Toydarians, but not by Ithorians or Talz. The Gungans of Naboo spoke a heavily accented dialect of Basic, with many differences in grammar and vocabulary. Diplodialect was a specific register of Basic used in the diplomatic circles of the Galactic Republic."}, {"tag": "p", "text": "Most stormtroopers, the elite soldiers of the Galactic Empire, could only speak and understand Basic, despite the commonness of other languages such as Huttese. With vocal cords that were quite different from those of many other species, Wookiees and Ithorians were entirely unable to speak Basic, though they could learn to understand it. Many Ithorians used translator collars to simulate speaking Basic. Tasu Leech, leader of the Kanjiklub, was unwilling to speak Basic, which he dismissed as a \"soft language for soft people.\" Basic could be written in several forms, including Aurebesh, High Galactic,\nand Outer Rim Basic."}, {"tag": "h2", "text": "Accents"}, {"tag": "p", "text": "Basic could also be spoken with a variety of accents. Imperial officer Piers Roddance spoke in a clipped and cultured manner that student Zare Leonis knew was a Core Worlds accent, or at least an imitation of one. His fellow student Merei Spanjaf also spoke with a Core Worlds accent due to her upbringing on the planet Corulag. The accents of individuals from other planets within the Core were also aristocratic, including the Chandrilan accent, as spoken by the droid R-K77, the accent of pilot Nash Windrider of Alderaan, the clipped tones of Armitage and Brendol Hux of Arkanis, and the Coruscanti accent as spoken by Coruscant natives Pax Maripher and Chassellon Stevis."}, {"tag": "p", "text": "The Coruscanti accent was that of the Imperial elite and their propaganda broadcasts, as well as Rebel satire. Imperial governor Everi Chalis, a human originally from an impoverished colonial backwater, had a natural accent that was higher in pitch, with a subtle drawl, stretched vowels, and less enunciation than Coruscanti, but adopted what Imperial Captain Tabor Seitaron considered an awful, over-enunciated, and exaggerated \"schoolgirl\" Coruscanti accent while in the service of the Empire. Grand Moff Wilhuff Tarkin, originally from the Outer Rim world Eriadu, and many senior Imperial officers spoke with an aristocratic accent, which Princess Leia Organa mockingly imitated during their final meeting. The criminal Bala-Tik spoke with the clipped tones of the Core Worlds, but with a harsher edge."}, {"tag": "p", "text": "The accent of the Outer Rim world Serenno was aristocratic and similar to those of Chandrila and Coruscant. The people of the Outer Rim planet Lothal typically spoke with an Outer Rim accent, and Core Worlds accents were rarely heard there. Lothal native Governor Arihnda Pryce naturally spoke with such an accent, but like Chalis, adopted an aristocratic accent while serving the Empire. Professor Sahali of the Republic Special Weapons Group spoke with a heavy Outer Rim accent. Eli Vanto of the Wild Space world Lysatra spoke with a notable Wild Space accent that he was mocked for at the Royal Imperial Academy on Coruscant. The accent of those native to the Outer Rim planet Pamarthe was thick and had the burr of it settle on the r's. Pilot Norra Wexley spoke with a subtle Myrran accent from her homeworld and Jedi Rael Averross spoke with a strong Ringo Vindan accent that he never lost while growing up on Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Basic is the name given to the English language in the Star Wars saga, although in dubbed versions of the films it will for all intents and purposes resemble those languages. As a result, Basic comes in as many accents as those of the actors in the films, television series and video games. For example, when she filmed the original Star Wars, Carrie Fisher spoke with Received Pronunciation during her first day of shooting (which was the scene where Leia confronts Wilhuff Tarkin). \"I had a British accent,\" she explained. \"Who could say those lines? 'I thought I recognized your foul stench when I was brought on board.' What? Say that like an American and I'll pay you.\""}, {"tag": "p", "text": "The book Bloodline identifies Tarkin's accent and that of other senior Imperial officers as aristocratic, as such Wookieepedia treats all characters speaking with a Received Pronunciation British accent, as Tarkin does in A New Hope, as having an aristocratic accent. The audiobooks of Aftermath: Empire's End and Battlefront: Twilight Company establishes that the Chandrilan accent and Coruscanti accent respectively are both also the aristocratic Received Pronunciation. The real-world Scottish accent used by Bala-Tik in Star Wars: Episode VII The Force Awakens is described as a Core Worlds accent with a harsher edge in Star Wars: The Force Awakens: The Visual Dictionary. Master & Apprentice describes Rael Aveross's real world southern American drawl as a Ringo Vindan accent."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}