{"url": "Galactic_Bazaar", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Magazine article stubs", "Category:Star Wars Galaxy Magazine departments"], "nodes": [{"tag": "h1", "text": "Galactic Bazaar"}, {"tag": "p", "text": "Galactic Bazaar, formerly named The Galactic Bazaar, was a regular department in Star Wars Galaxy Magazine that provided a look at Star Wars collectibles. It was primarily compiled by Stephen J. Sansweet. There were also subsections on \"Fantastic Fans\" and \"Collectors' Comlink\" beginning with Star Wars Galaxy Magazine 7. With Star Wars Galaxy Magazine 8, the first section of the Bazaar was named Star Wars Stuff. The \"Design An Alien\" contest was also located in this segment, announced in Star Wars Galaxy Magazine 3."}, {"tag": "h2", "text": "Editions"}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 1: \"Drinking with Chewbacca, Snacking with R2\""}, {"tag": "p", "text": "A look at ceramic collectible tankards from California Originals designed by Jim Rumph, cookie jars from Roman Ceramics, and a variety of figurines, bookends, and a teapot from Sigma the Tastesetter"}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 2: \"Tales of Phantom Toys\""}, {"tag": "p", "text": "A look at Kenner's canceled 1986 The Epic Continues toy line, which Lucasfilm opted not to produce"}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 3: \"Strange Tales of Collecting Aliens\""}, {"tag": "p", "text": "A look at alien action figures from Kenner, plus the California Originals tankards, Galoob's Micro Machines, Illusive Originals sculptures, Don Post masks, and the Sigma line of collectibles."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 4: \"The Empire Sells Out\""}, {"tag": "p", "text": "A look at toys from The Empire Strikes Back from Kenner. Kenner's executive VP of marketing, David Mauer talked about the failed Howard Bollinger's Micro Collection."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 5: \"...As in Quarren, Vader, Corellian?\""}, {"tag": "p", "text": "A look at QVC, the cable TV home shopping channel based out of Philadelphia, from their first Star Wars based show on October 28, 1992 with Mark Hamill as a special guest, through to how merchandise is chosen for the show by Ann Teasdale from The Scoreboard and Lucasfilm's Julia Russo."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 6: \"Going Global\""}, {"tag": "p", "text": "Collectibles around the world, including the different things available in other countries, different versions of games, and unique items."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 7: \"That's Kits, Not Kitsch\" / \"Shadows on Shelves\" / \"Where Ewoks Go to Retire\""}, {"tag": "p", "text": "The first segment discussed model kits from companies such as Ertl (and its various names including MPC/Ertl and AMT/Ertl)."}, {"tag": "p", "text": "The second segment discussed the upcoming Shadows of the Empire toy line."}, {"tag": "p", "text": "The third segment was the first Fantastic Fans subsection, and it covered Cyndy and Tom Ganschow and their stuffed Ewok collection."}, {"tag": "p", "text": "The Collectors' Comlink subsection was also introduced in this issue."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 8: \"Stamp it First Class, to Coin a Phrase\" / \"On-line, with Gus(to)\""}, {"tag": "p", "text": "The first section, now subtitled \"Star Wars Stuff\", covers stamp and coin collecting as it related to Star Wars"}, {"tag": "p", "text": "The second section, another entry in Fantastic Fans, profiled Gus Lopez and his Star Wars collectors homepage."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 9: \"Snap! Crackle! Pop!\" / \"Ship Shapers\""}, {"tag": "p", "text": "Star Wars themed breakfast cereals were the focus of this issue's \"Star Wars Stuff\" section."}, {"tag": "p", "text": "Fantastic Fans focuses on J.P. and David Hyde, collectors of Star Wars model kits, including creating their own custom-built model of an Imperial Star Destroyer."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 10: \"The Cardboard Galaxy\" / \"Super Sleuths\""}, {"tag": "p", "text": "\"Star Wars Stuff\" looks at trading cards, especially those from Topps, mentioning Gary Gerani, who was in charge of assembling the original trading card sets for the company, and Ingar Westburg, who worked on the Special Edition sets in the late 1990s."}, {"tag": "p", "text": "Don Sucher is the focus of Fantastic Fans along with his collection of Kenner action figures."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 11: \"Vader Rules Collectibles\" / \"Size Matters Not\""}, {"tag": "p", "text": "This edition of \"Star Wars Stuff\" looks at Darth Vader collectibles through the years."}, {"tag": "p", "text": "Fantastic Fans is written by Pete Fletzer and profiles Bob Lippman, a lawyer who customizes action figures."}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 12: \"Leia Rules\" / A Keeper of the Star Wars Flame\""}, {"tag": "p", "text": "\"Star Wars Stuff\" looks at collectibles related to Princess Leia."}, {"tag": "p", "text": "Pete Fletzer writes a profile of Laura Kyro for this issue's Fantastic Fans, discussing her newsletter, The Star Wars Collection Trading Post"}, {"tag": "h3", "text": "Star Wars Galaxy Magazine 13: \"Special Effects\" / \"The Fine Artist of Collecting\""}, {"tag": "p", "text": "Specialty collectibles are the focus on this edition of \"Star Wars Stuff\" as the Star Wars: The Magic of Myth exhibition was being put on."}, {"tag": "p", "text": "Shane Morrissey writes a Fantastic Fans profile on Catherine Scholtz from Australia, and her vast collection of Star Wars memorabilia."}]}