{"url": "Galactic_City", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Capital cities", "Category:Coruscant locations", "Category:Galactic Empire cities", "Category:Galactic Republic cities", "Category:New Republic cities"], "nodes": [{"tag": "h1", "text": "Galactic City"}, {"tag": "p", "text": "Galactic City was the name of the planet-wide city of Coruscant. During the Galactic Republic, it was also known as Republic City or the City of Spires. During the Clone Wars the city was referred to as Triple Zero in military slang due to Coruscant's hyperspace code Zero Zero Zero (0,0,0). Galactic City was also called Imperial City (or, rarely, Coruscant City) under the Galactic Empire and New Republic City under the New Republic with the city remaining the same much in structure and style as millennia earlier. Although technically applying to all of Coruscant, in common usage its name seems to have referred to the Senate, Temple and Ambassadorial Districts—the areas of the planet which housed the Senate Building, the Jedi Temple, the Republic Executive Building, the Imperial Palace, and other main organs of the Republic government."}, {"tag": "p", "text": "The only major physical change to the city was when the Yuuzhan Vong conquered the planet in 27 ABY and had its surface terraformed with vegetation from their home galaxy and then renamed it as Yuuzhan'tar."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Pre-Republic"}, {"tag": "p", "text": "As of 100,000 BBY, Coruscant's indigenous Human population had grown to such an extent that the entire planet was enveloped in a worldwide ecumenopolis consisting of vast cities and industrial districts. It can be presumed that it was founded thousands of years before that—possibly as the first Human city in the galaxy—although no records stretch back that far. Its development would have begun after the Human victory over the Taungs."}, {"tag": "p", "text": "New buildings were built on the old. As a result, there was virtually no exposed land. In the forgotten underlevels of the city, there was darkness, pollution and crime. Higher up, there were government offices and penthouses owned by the elite."}, {"tag": "p", "text": "Around 30,000 BBY, Coruscant was conquered by the Rakatan Infinite Empire who enslaved its Human inhabitants. Under Rakatan domination, the Humans of Coruscant's colonization attempts were limited to sleeper ships, which ended up on Alderaan, in the Tion Cluster, Seoul 5, Kuat, Alsakan, Axum, Anaxes, Atrisia, Metellos, Corulag, and many other worlds. The Rakata were eventually decimated by a massive plague, leading to slave revolutions on Coruscant and other subjected worlds."}, {"tag": "h3", "text": "The Republic"}, {"tag": "p", "text": "Over the next two centuries, Coruscant was linked to the rest of the Core Worlds, including Corellia and Duro, by hyperspace cannons which were later developed into the hyperdrive proper. It was during this time that the Coruscant government peacefully absorbed the nearby Azure Imperium. By 25,053 BBY, Coruscant had become the capital of a democratic union—the Galactic Republic."}, {"tag": "p", "text": "In past times, it was also referred to as Republic City, although that seems to have dropped out of usage sometime after the Great Hyperspace War of 5000 BBY. In 12,000 BBY, the famous Galactic Museum was constructed and became a key tourist attraction for visitors to the capital while the Jedi Order established their Temple following the Hyperspace War which became their headquarters for the following millennia. At some point, the Senate Rotunda was founded, replacing the previous assembly place. The exterior of this massive structure would survive the planet's transformation into the new Yuuzhan'tar."}, {"tag": "p", "text": "However, Republic City's key strategic location made it the primary objective in several wars including the Tionese War with the Honorable Union of Desevro & Tion in 24,000 BBY in which Coruscant was bombarded with Tionese pressure bombs, the Alsakan Conflicts, the Duinuogwuin Contention, the Great Hyperspace War, the Third Great Schism, the Great Droid Revolution, and the Great Sith War. At the time of the Great Sith War, Galactic City's densest population points were around Coruscant's equator."}, {"tag": "p", "text": "In 23 BBY, near the end of the Separatist Crisis, the Confederacy of Independent Systems began to become a significant threat against the Republic, causing several systems to secede, including Ando and Sy Myrth, resulting in a mass exodus of Aqualish and Sy Myrthians from Galactic City."}, {"tag": "p", "text": "During most of the Clone Wars, Galactic City was subject to frequent Separatist terrorist acts, assassinations of leading Republic figures, and military strikes including the Coruscant Insurrection and the Battle of Coruscant which were both won by the Republic. The latter attack which took place towards the end of the conflict in 19 BBY saw a large scale space battle between the Republic and Confederate navies while a nearly-successful kidnapping attempt was made on the Supreme Chancellor Palpatine himself."}, {"tag": "p", "text": "Such incidents prompted the Republic to implement numerous changes on Galactic City in the name of increased security. Huge stretches of the cityscape were transformed into military staging areas, and clone troopers were seen everywhere. The fanatical pro-Human COMPOR was founded, the local SAGroup led by Nenevanth Tion marching in a patriotism parade. COMPOR pressured Tannon Praji into deporting from the capital all members of species whose homeworld had joined the Confederacy. Vice-Admiral Terrinald Screed was placed in charge of Coruscant Planetary Defense."}, {"tag": "h3", "text": "Imperial Complications"}, {"tag": "p", "text": "During the time of the Galactic Civil War, Trey Duna was the mayor of Imperial City; presumably the position was similar to that of governors on other Imperial worlds. The city's security was handled by a succession of several Moffs, one of them being Kadir."}, {"tag": "p", "text": "Under the Empire, the alien residents of the planet-wide city were forced into ghettos, also known as \"ethnic neighborhoods\" such as Invisec. Emperor Palpatine ruled with a rod of iron over his citizens."}, {"tag": "p", "text": "In 7 ABY, Ysanne Isard tore a hole in the cityscape using her Super Star Destroyer Lusankya and then escaped into hyperspace. As a result, large areas of the planet-wide city was destroyed and millions were killed. Later, the Krytos virus took the lives of millions of aliens before being controlled by the occupying New Republic authorities."}, {"tag": "p", "text": "More calamity would befall Imperial City during the reborn Emperor Palpatine's insurrection in 10 ABY."}, {"tag": "p", "text": "When Emperor Palpatine took control, he renamed the capitol Imperial City (and the planet Imperial Center) and it became the ruling seat of the new order. After the battle of Endor, Imperial City was declared the capitol of the New Republic, although its name has not been changed again. A cosmopolitan, it was always crowded. The Emperor late in his reign, closed to it to nearly all nonhumans."}, {"tag": "p", "text": "The ancient Senate Hall fills part of the city, its carved stone pillars surrounding seemingly endless tiers of benches. The massive Imperial Palace loomed over the hall, its tapered spires and fragile looking towers assaulted the eye from every surface. The cities architecture gives the impression of one endless structure that spreads from the base of the Manarai Mountains and covers a huge part of Coruscant's main continent."}, {"tag": "p", "text": "Basically unscarred during the Galactic Civil War, the city was severely damaged when attacked by Imperial Forces led by surviving members of the Emperor's Ruling Circle and former Imperial Commanders. It was painstakingly reconstructed by the New Republic, aided by many soldiers and giant construction droids. Most sentient life-forms have been evacuated from the deep underworld of the ancient metropolis. Some creatures found living in the darkest corridors were descendants of those who long ago fled political persecution and could no longer be classified as fully human."}, {"tag": "h3", "text": "The New Republic"}, {"tag": "p", "text": "After Palpatine's final death in 11 ABY at the Battle of Onderon, the New Republic retook the planet and used EVS Construction Droids to clear the rubble and create new gleaming, skyscrapers. As an attempt to leave their mark on the galactic capital, the New Republic government renamed the city as New Republic City."}, {"tag": "p", "text": "However, much of Coruscant's population had fled as result of the fighting and the planet's population during the New Republic era may have been lower. Thus, many of New Republic City's midlevel apartments were unoccupied but still serviceable. However, the shadowy lower levels remained unaffected by the reconstruction program and would still remain the haunt of various crime syndicates including the Lost Ones. Many still struggled to survive in the lower forty or fifty levels which was the domain of dangerous mutated lifeforms like the Cthon and Corridor ghouls."}, {"tag": "h3", "text": "Yuuzhan Vong"}, {"tag": "p", "text": "Coruscant's darkest hour was at the peak of the Yuuzhan Vong War. During the Fall of Coruscant, the extragalactic Yuuzhan Vong overwhelmed the Republic defenses in three attack waves and conquered the planet. Coruscant, which had been completely covered in city sprawl for millennia, was devastated during the assault. Billions of lives were also lost during the battle."}, {"tag": "p", "text": "Also, many of the landmarks that made Coruscant unique either met their end or were altered to suit the invaders' needs. The Imperial Palace was destroyed when Chief of State Borsk Fey'lya detonated a suicide bomb in his office; the Manarai Mountains, the last part of the planet untouched by cityscape, were blasted into giant craters; the Western Sea, the planet's sole body of water, was turned into a giant Succession pool; the Senate Building became the location of the World Brain, which was in charge of the terraforming of the planet."}, {"tag": "p", "text": "The Yuuzhan Vong designated it Yuuzhan'tar, after their homeworld, the name of their species, and their chief deity Yun-Yuuzhan, and terraformed it to overwhelm the city covering its surface and restore a natural ecology. In order to get Coruscant to match their homeworld, large dovin basals pulled the planet closer to Coruscant Prime and biological processes were set forth to create the jungle including increasing the temperature and releasing more moisture into the atmosphere. Soon, nearly the entire planetwide city was covered beneath vegetation while rivers filled canyons where airspeeders had once roamed before. The lower levels were the domain of wildlife brought in from the Yuuzhan Vong galaxy and was where most of the outcast Shamed Ones lived."}, {"tag": "p", "text": "Coruscant's three smaller moons were dragged from their original orbits by dovin basals while its largest moon was destroyed by tidal stress created by pulses from other yammosk-linked dovin basals. A similar technique dragged the resulting expanse of dust, rock and hardening magma into a wide spreading asteroid belt known as the \"Rainbow Bridge\", that they were familiar with. The Rainbow Bridge orbited Coruscant around at an angle of 17 degrees from the ecliptic."}, {"tag": "p", "text": "The vast majority of the planet's non-Yuuzhan Vong population was shipped offworld in massive refugee ships, though some people did stay behind in the substructure of the city; they called the \"new\" Coruscant Necropolis."}, {"tag": "p", "text": "When the living planet Zonama Sekot suddenly arrived in the system, it collapsed the Rainbow Bridge, caused another of Coruscant's moons to be \"slingshotted\" out of orbit, and pulled Coruscant closer to its original orbit, causing volcanic eruptions and groundquakes for the first time in two thousand years. The Galactic Alliance eventually retook Coruscant from the Yuuzhan Vong during the Battle of Yuuzhan'tar in 29 ABY."}, {"tag": "h3", "text": "Galactic Alliance"}, {"tag": "p", "text": "The Galactic Alliance and the Yuuzhan Vong then signed a peace treaty in 30 ABY, thus ending the Yuuzhan Vong War. It was decided that Coruscant would be rebuilt as the capital of the Galactic Alliance, returning to the ecumenopolis-style whenever possible while leaving the Yuuzhan Vong terraforming wherever it was as yet unfeasible to change. The World Brain would still remain in the Senate Building, as there was as yet no way to remove it without causing further damage to the planet."}, {"tag": "p", "text": "A new Jedi Temple was also constructed, with Fellowship Plaza leading to both the Temple and the Galactic Justice Center as a symbol of the Jedi and the Alliance's commitment to each other. A large park called Unity Green was also constructed to symbolize the treaty between the Yuuzhan Vong and the Galactic Alliance. As the government transferred back to the world from Denon, additional new buildings were constructed, such as the new Senate building, Executive building, and Defense Force headquarters."}, {"tag": "p", "text": "Around the time of the Second Galactic Civil War in 40 ABY, the Galactic Alliance Guard, a secret police organization was formed by the Galactic Alliance to spy and monitor on Corellian terrorist activity on Coruscant. The Guard was lead by Jacen Solo, a Jedi Knight, a Colonel of the Galactic Alliance military and also an aspiring Sith Lord."}, {"tag": "p", "text": "The GAG would be responsible for interning and deporting Corellian citizens in Galactic City, and in some cases, murdered those taken during the raids. Thus, because of these harsh actions and their dark military uniforms, members of the Guard earned a fast reputation as a uncompromising band of hard-liners among the population. Many of their prey referred to them as \"Stormies,\" thus drawing inevitable comparisons of Jacen Solo to the late Darth Vader and the troops themselves to stormtroopers."}, {"tag": "p", "text": "Under Jacen's leadership the soldiers saw a likeness within Jacen with Darth Vader's own command style noting that he \"never asked of them what he would not do himself.\" Though necessary in some respects, the GAG's actions were mainly a vehicle for Jacen's rise as a Sith. This would only deepen the rift between the Galactic Alliance and the Corellian-led secessionist movement."}, {"tag": "h3", "text": "Fel Empire / Darth Krayt's Sith Empire"}, {"tag": "p", "text": "As of 130 ABY, control of Coruscant had been wrested from the grip of the Galactic Federation of Free Alliances, and was now in the hands of the resurgent Empire, under the command of Emperor Roan Fel. The planet became the new Imperial throne-world."}, {"tag": "p", "text": "Coruscant began to appear as bustling and thriving as it once did during the Old Republic with the effects of the Yuuzhan Vong War still a reminder, from the growth on skyscrapers, to the altered night sky. Air traffic in skylanes was still the primary mode of transportation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}]}