{"url": "Galactic_Civil_War/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Alliance to Restore the Republic", "Category:Civil wars", "Category:Conflicts of the Aparo sector", "Category:Conflicts of the Colonies", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Deep Core", "Category:Conflicts of the Expansion Region", "Category:Conflicts of the Greater Javin", "Category:Conflicts of Hutt Space", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Unknown Regions", "Category:Conflicts of Wild Space", "Category:Extragalactic conflicts", "Category:Galactic Civil War", "Category:Galactic Empire"], "nodes": [{"tag": "h1", "text": "Galactic Civil War"}, {"tag": "p", "text": "The Galactic Civil War, (2 BBY–19 ABY) known as the First Galactic Civil War by the year 43 ABY, was a major galactic conflict fought primarily between the Galactic Empire and the Alliance to Restore the Republic. The Alliance was a rebel faction dedicated to the restoration of the Galactic Republic, the government that the Empire had supplanted at the culmination of the Clone Wars in 19 BBY."}, {"tag": "p", "text": "The origins of the conflict could be traced to the Galactic Senate during the final days of the Old Republic, sometime after the end of the Clone Wars, where dissenting and prominent Senators, such as Bail Organa and Mon Mothma, secretly opposed the powers and authority that Supreme Chancellor Palpatine continued to accumulate under the guise of security and war-time measures."}, {"tag": "p", "text": "The war did not begin in its real sense, that of an Alliance against the Empire with its goals and ideals laid out for the galaxy, until nearly two decades after the rise of the Empire, when various Rebel leaders signed the Corellian Treaty and issued the Declaration of Rebellion. Likewise, several Imperial citizens, despite the Empire's atrocities, ended up siding with the Empire as they were reluctant to join a group similar to the Separatists from the Clone Wars. Initially, the Empire, especially Palpatine, did not consider the Alliance a significant threat, but rather as a political tool to further consolidate power that would eventually lead to the dissolution of the Imperial Senate and a massive, unprecedented military build-up. Resistance was galvanized after the Empire obliterated the planet Alderaan for Rebel sympathies, and after Luke Skywalker destroyed the first Death Star at the fateful Battle of Yavin. Thereafter that the threat posed by the Alliance became real to the Empire and more serious measures were drafted to restore Imperial control over the galaxy."}, {"tag": "p", "text": "The decisive moment came at the Battle of Endor, when the Alliance, against overwhelming odds, defeated the Imperial Military and destroyed the second Death Star, killing Emperor Palpatine, Darth Vader and some of the best minds in the Imperial High Command. From there, the Empire began to gradually decay and fragment, and despite resurgences under Ysanne Isard, Grand Admiral Thrawn, the clone of Emperor Palpatine, and Admiral Daala, over a period of fifteen years it was reduced to a mere remnant of its former-self, while the Alliance evolved and grew into the New Republic. Peace between the two warring factions was realized in 19 ABY with the signing of the Bastion Accords between Grand Admiral Gilad Pellaeon and Chief of State Ponc Gavrisom, ending over two decades of constant struggle. The Empire continued to exist as an autonomous entity in the years succeeding the war's end, and would eventually enter into an alliance with its former enemy during the Yuuzhan Vong War, and emerge as the galaxy's leading government over one hundred years later, seemingly bringing history back full-circle; however, the exploits of the Alliance and the New Republic were not forgotten, and the galaxy was still very different from what it had been during the Empire's reign."}, {"tag": "h2", "text": "The Origins of the Galactic Civil War"}, {"tag": "h3", "text": "Disturbance in the Senate"}, {"tag": "p", "text": "The emergence of the Galactic Empire was brought about by decades of engineering, manipulation, and deceit, masterminded by the cunning and elusive Dark Lord of the Sith, Darth Sidious, and carried out by his various apprentices and willing (and not-so-willing) agents and puppets. Under the guise of the charismatic Senator Palpatine of Naboo, Sidious took full-advantage of the corruption and inefficiencies in the Republic bureaucracy to have himself elected Supreme Chancellor. Once in office, Palpatine proceeded to engineer the galaxywide Clone Wars, secretly controlling both the Republic and the Confederacy of Independent Systems, as a means to further draw powers to his office. Citing special emergency war-time powers and mandates required to maintain security against the Separatist threat, Palpatine accrued autocratic power over the Republic. At the war's end, Palpatine did not relinquish his powers, instead instigating the Great Jedi Purge by fabricating evidence that the Jedi Council had attempted to assassinate him. Palpatine declared a New Order and announced the creation of the Galactic Empire to much applause from the Senate, the culmination of the Order of the Sith Lords' thousand-year Grand Plan to seize control of the galaxy."}, {"tag": "p", "text": "Taking the title of Galactic Emperor, Palpatine set out to establish his authoritarian regime and end his Order's millennia-old feud with the Jedi Order with the total annihilation of the Jedi. Palpatine used the \"Jedi Rebellion\" as his means of turning public opinion against the Jedi, thus allowing him to enact Order 66, a secret contingency order that had clone troopers turn their weapons on their Jedi commanders. Of the several thousand Jedi in the galaxy, very few survived the execution of Order 66 and the subsequent Great Jedi Purge in 19 BBY, most notably Jedi Masters Obi-Wan Kenobi and Yoda."}, {"tag": "p", "text": "During this tumultuous time, two children, the offspring of Anakin Skywalker and Padmé Amidala, were born. Luke and Leia Skywalker would grow up to lead the Alliance against the Empire and become heroes on their own right; at the time, however, they were separated at birth to escape the wrath of their father, Anakin, who had transformed into Palpatine's third apprentice, Darth Vader. Leia was adopted by Bail Organa, and Luke was cared for by his family on Tatooine, Beru and Owen Lars. Vader became Palpatine's chief enforcer and carried out his will with terrifying results; he hunted down and killed the remaining Jedi, all the while unaware that his children were alive, assuming they had died with his wife on Mustafar."}, {"tag": "p", "text": "With the Empire firmly established, Imperialization began throughout the galaxy. The Senate was reorganized into the Imperial Senate, its powers and influence reduced as to become nothing more than a rubber-stamp assembly. Many Senators were all too willing to allow the Empire to come to pass, as many were under Palpatine's influence or saw it as necessary to secure galactic peace after the events of the Clone Wars. Much of the Galactic populace even saw the early Galactic Empire as an improvement on the Old Republic, particularly following the celebrated Reconquest of the Rim from 19 BBY to 17 BBY, which in years to come many Imperial Loyalists would remember fondly as the final removal of Separatists and criminals and the long-overdue restoration of the rule of law in the Outer Rim Territories."}, {"tag": "p", "text": "A few Senators, however, began to sow the seeds of dissent that would grow into the Rebel Alliance in the years to come; Bail Organa and Mon Mothma were some such Senators, including the late Amidala, who urged patience in defying Palpatine's regime. If they acted too quickly, too overtly, Palpatine would crush them, and lingering fears of Separatism and disorder meant that it would take nearly twenty years for organized resistance against the Empire to be realized. While Organa and Mothma planned their resistance in a series of meetings at Cantham House on Coruscant, during this time Palpatine and his cabal had nearly free-reign in instituting the various new changes to the galaxy. Humanocentric policies became prominent, advocating human supremacy. Some species, such as the Wookiees, Mon Calamari, Yuzzem, and Lurrians were reclassified as non-sentient and subjected to slavery (or \"domestication\", as Imperial policy officially stated). State-sponsored terrorism soon became a policy of the Empire, with such notions as the concept of rule through fear, popularized by then-Moff Wilhuff Tarkin's Doctrine. Examples such as the pacification of the Nembus sector and the Kwymar Suppressions exemplified this brutal approach to stifling dissent in the Empire. Finally, the Ghorman Massacre and the very concept of the Death Star made it clear that the Empire was willing to use any means necessary to maintain its power and control over the galaxy, with no regard towards sentient rights. But the Empire's own disregard for its citizens and implementation of the Tarkin Doctrine would prove to be its undoing, as many citizens became enraged by the sheer oppressiveness of the Imperial regime, causing dissent to spread like wildfire."}, {"tag": "h3", "text": "Ferus Olin's adventures"}, {"tag": "p", "text": "When the Empire subjugated the Core World Bellassa in 17 BBY, former Jedi Padawan Ferus Olin started an underground resistance movement by forming the group known as The Eleven. Eventually, Imperial forces captured Olin and his business partner Roan Lands and imprisoned them in the Empire's garrison/prison facility in Ussa. But Olin managed to escape to go into hiding. The resistance movement had such an impact on the Bellassans that nearly all of Ussa became devoted to protecting him, a fact that greatly displeased Inquisitor Malorum, the chief of security in Ussa."}, {"tag": "p", "text": "Obi-Wan Kenobi eventually tracked down Ferus and decided to help him. Not long after Obi-Wan located Ferus, Malorum issued Contingency Order 37. Mass arrests were made in Ussa when this order was issued and an ultimatum was issued over the HoloNet: if Ferus wasn't turned in within 48 hours after Order 37 was issued, all of the civilians would be executed. Though Ferus planned to give himself up, his safehouse was discovered by Boba Fett and D'harhan, a pair of bounty hunters in Malorum's employ. Ferus and Obi-Wan managed to evade the bounty hunters and return to Ussa to devise a plan to rescue to civilians with the other members of the Eleven. The plan succeeded, but Obi-Wan and Ferus were exposed, and they, along with a boy named Trever Flume, fled Bellassa."}, {"tag": "p", "text": "Ferus and Obi-Wan eventually split up. After his association with the Jedi Master, Ferus decided to return to the Jedi Order and locate Jedi that survived Order 66, creating a safehouse for Jedi on an uncharted asteroid in the middle of an atmospheric storm."}, {"tag": "p", "text": "During his search for Jedi refugees from the Empire, he was blackmailed into aiding Emperor Palpatine, but would act as a double-agent, seeking information and attempting to undermine the Empire from the inside, eventually confronting Darth Vader himself. His resistance movement spanned the galaxy from Bellassa, Acherin, Coruscant, Naboo, and Samaria to Alderaan as well as other planets. This lasted until the Empire thwarted his plans for early rebellion by destroying his secret asteroid base. He eventually accepted a mission from Obi-Wan to watch over Princess Leia Organa on Alderaan, where he would reside for many years. He would ultimately end up sacrificing himself to save Leia and her brother Luke from Vader, dying at the hands of the latter."}, {"tag": "h3", "text": "Starkiller's mission"}, {"tag": "p", "text": "Since 18 BBY, Darth Vader had secretly been training an apprentice, Galen Marek, who had been captured as a child during the suppression of surviving Jedi on Kashyyyk. Around 3 BBY, Marek was knighted as a Sith Lord and received the codename of \"Starkiller\", and was sent on numerous missions to eliminate surviving Jedi and disparate rebel groups. At a TIE Fighter Construction Facility over Nar Shaddaa, Starkiller destroyed the militia led by Jedi Master Rahm Kota and left their leader for dead. On Raxus Prime, he killed the insane Aleena Jedi Kazdan Paratus. Finally, in a mission on Felucia, he killed Jedi Master Shaak Ti. Starkiller expected to overthrow the Emperor and rule the galaxy at Vader's side, but Palpatine had discovered his identity and ordered Vader to kill him. Upon Starkiller's return, Vader savagely injured him and cast his body into space."}, {"tag": "p", "text": "Palpatine, however, came to think that Marek could be useful to him. Marek's body was recovered and sent for extensive medical treatment aboard the hospital ship Empirical. Around 2 BBY, Marek had recovered and was to be used to round up senators and leaders that were speaking against Empire in the Senate. Vader utilized Marek as an unwitting double agent, letting him believe that he was still working against the Emperor. Marek recovered the blinded and despondent Rahm Kota from Bespin and convinced him to resume his fight against the Empire. He then returned to Kashyyyk, where Princess Leia Organa was being held hostage by Governor Ozzik Sturn, and successfully rescued Organa, killed Sturn, and disrupted the Empire's slaving operations against the Wookiees. Returning to Felucia, Marek fought against the Empire's attempted genocide of the Felucians and rescued Bail Organa from Maris Brood, Shaak Ti's grief-stricken apprentice. On Vader's advice, Marek subsequently destroyed a shipyard over Raxus Prime as a symbolic blow against the Empire"}, {"tag": "p", "text": "Marek then gathered Senators such as Bail Organa, Bail's daughter Leia, Garm Bel Iblis, and Mon Mothma, as well as Jedi Master and General Rahm Kota, on Corellia. In a swift series of Meetings, they agreed to form the Alliance to Restore the Republic, signing the Corellian Treaty with other rebel organizations and organizing into one Alliance."}, {"tag": "p", "text": "However, Vader, along with Imperial forces, raided the meeting, captured the rebels, and revealed to Marek that he had only been used to rally the Empire's enemies. Marek tracked the Dark Lord and the Alliance leaders to the Death Star in the Horuz system. There he dueled both Vader and Sidious. The former Sith apprentice sacrificed himself, allowing the rebels to be rescued by his pilot, Captain Juno Eclipse. Escaping to Kashyyyk, the senators, inspired by what he had done, vowed to continue with the Rebellion he had started."}, {"tag": "h3", "text": "The Declaration of Rebellion"}, {"tag": "p", "text": "Following the signing of the Corellian Treaty, the new Alliance's leaders made a public Declaration of Rebellion in 2 BBY. The Declaration was an overtly political one, intended to combat the Empire's propaganda that the Rebellion was nothing more than a new breed of Separatists. In it, the Rebels recognized the necessity of Galactic Government, but also declared that \"when a Government displays a history of usurpation, abuse and moral atrocity, displaying a clear design to subjugate totally and absolutely beings born free under the auspices of nature, it is our right — our duty — to depose of that Government.\""}, {"tag": "p", "text": "In addition to the symbolism of the Declaration, the Alliance also took on a new emblem in the form of the Marek family crest, in memory of Galen Marek's sacrifice. Thus began the war that would last two decades and see the loss of billions of lives."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early campaigns (2-1 BBY)"}, {"tag": "h4", "text": "The first strikes (2-1 BBY)"}, {"tag": "p", "text": "The Declaration of Rebellion had mixed results: some systems enthusiastically declared their support for the Alliance. Branded the \"Secession Worlds\" by the Empire, they were swiftly crushed by the Imperial Navy in engagements like the Battle of Chabosh. Additionally, while Mon Mothma, Garm Bel Iblis and Bail Organa were united in their determination to defeat the Empire, they were divided on how to achieve that goal: Mothma feared that the new Alliance was too weak to risk its forces in pursuing even symbolic strikes, while Bel Iblis feared that inaction would lead to frustrated Rebels going their own way. Early victories were gained in battles at Mantooine and the Silken Asteroids, and the frigate Salvation was captured in a skirmish over Ylesia. A decisive moment was the liberation of Gial Ackbar from slavery in the Eriadu system. The Mon Calamari had been kept as a valet by Grand Moff Wilhuff Tarkin and had been secretly feeding the Alliance Imperial Military secrets for months. Party to a great deal of information on Imperial Military doctrine, Ackbar would go on to be one of the Alliance's most successful naval commanders. However, at this early stage the Alliance's successes were few and far between."}, {"tag": "p", "text": "One year after the Declaration of Rebellion, General Rahm Kota, tired of inaction, formed his own commando squad, believing that tactical strikes made by small forces against critical targets could effectively disrupt Imperial forces throughout an entire region. Kota successfully struck at Imperial targets on several worlds, including Druckenwell, Selonia, and Kuat, against the orders of Alliance High Command, with the assistance of Captain Juno Eclipse aboard the Salvation. In a raid at Cato Neimoidia, however, Kota was caught in an ambush and thought dead by the Alliance, though was in fact captured and forced into gladiatorial combat by the Imperial administrator, Baron Merillion Tarko."}, {"tag": "p", "text": "Suspended from active duty over Cato Neimoidia, Juno Eclipse continued to support Kota's philosophy and enlisted the aid of Gial Ackbar to make a mission to Dac, which was still under Imperial occupation. Eclipse believed that a display of resistance would galvanize the Dac rebels and bring them and the shipyards of the Calamari sector into the Alliance fold. The successful mission humiliated Grand Moff Tarkin, who had believed that he could use the opportunity to recapture Ackbar and split the Mon Calamari Resistance, brought Dac closer to the Alliance, and united both the Mon Calamari and the Quarren in resisting the Empire, laying the grounds for their eventual successful revolt."}, {"tag": "p", "text": "Unbeknownst to the Alliance, Darth Vader had spent the past six months attempting to clone Galen Marek, ultimately succeeding in producing and training a stable clone known as Starkiller, whom he planned to send to kill Kota. However, after Starkiller began to have visions of Juno Eclipse, whom Galen Marek had come to love, Vader dismissed him as an aberrant clone and attempted to kill him. Starkiller managed to escape from the cloning facility on Kamino and resolved to join the Alliance and find Eclipse. Rescuing Rahm Kota from Tarko-se on Cato Neimoidia, the two attempted to rejoin the Rebel fleet in the Itani Nebula, but the fleet was engaged by Imperial forces led by the bounty hunter Boba Fett, whom Vader had contracted to capture Eclipse, knowing Starkiller would seek to rescue her."}, {"tag": "p", "text": "Abducting Eclipse and bringing her to Kamino, Starkiller and the Alliance pursued and battled the Empire over the ocean planet, taking heavy casualties. The battle culminated with the Salvation being used as a ramship to take down the shield around Timira City, allowing Starkiller and Kota's troops to enter the city, rescue Eclipse and even capture Darth Vader."}, {"tag": "p", "text": "Though Vader would ultimately escape, Alliance morale soared in the aftermath of the victory on Kamino. Additionally, Mon Mothma came to accept the need for greater action against the Empire, and began to seriously consider adopting Eclipse and Kota's tactics."}, {"tag": "h4", "text": "Operation Domino (1 BBY)"}, {"tag": "p", "text": "Later in 1 BBY, the Alliance crafted its first war plan, Operation Domino. This envisioned the Rebellion's newly-organized Sector Forces defeating Imperial garrisons in showpiece ground battles across the galaxy, then digging in behind their planetary shields. It was expected that such examples would inspire a galaxywide revolution against the Empire."}, {"tag": "p", "text": "In the event, Operation Domino met with disaster: the vast majority of the Sector Forces were ill-equipped, ill-trained, or lacked essential elements like air support. Virtually every uprising was swiftly put down by the Imperial Military. At Dalron Five, Imperial forces besieged the planet and broke through to the surface using siege techniques developed by Jan Dodonna, resulting in heavy civilian casualties. The operation prompted Dodonna to defect to the Alliance. The Alliance was vastly outmanned and outgunned by the well-organized and powerful Imperial Military. Sporting a vast Fleet supplied by such companies as Kuat Drive Yards and an Army and Stormtrooper Corps that numbered in the billions, the Empire secured a stranglehold on the galaxy that was impossible to challenge conventionally."}, {"tag": "p", "text": "However, Operation Domino did contain a few bright spots that in the long term would be enormously decisive: the liberation of Dac was one of the few successes of the campaign, and the Calamari sector became a potent Rebel redoubt for nearly the entirety of the war. Calamari warships that had escaped the Imperial occupation, led by the Independence, were added to the Alliance arsenal. The Mon Calamari Council nominally declared neutrality and heavily mined the routes leading into their sector, thus ensuring that any campaign to reclaim the region would be incredibly costly for the Empire. The Empire was hesitant to engage in such a campaign, fearing that anything other than a quick victory would embolden other rebellious systems. Early efforts by the Empire to reclaim Dac ultimately developed into fiascos. The Mon Calamari became an essential source of ships and supplies for the Rebellion, formally declaring for the Alliance in 0 ABY."}, {"tag": "p", "text": "This helped the Alliance's chances of survival, but it was still too small to engage in a direct confrontation with the might of the Imperial Navy. The Rebels' bravery also inspired a surge of sympathy for them across the galaxy, including within the ranks of the Imperial Military. Numerous officers, including General Jan Dodonna, Admiral Adar Tallon, and General Kryll had seen their faith in the Empire sorely tested by its increasingly-brutal and arbitrary conduct, and defected to the Alliance."}, {"tag": "h4", "text": "The Alliance strategy"}, {"tag": "p", "text": "The failure of Operation Domino convinced Mon Mothma that the Alliance could not win the Civil War if it fought conventionally. This prompted a divide between Mothma and her officers in Alliance High Command: as former Republic officers or Imperial defectors, they saw the struggle in terms of territory, and envisioned an advance from the fortified redoubt of Mon Calamari to seize the restless Tion Cluster, and from there move down the Perlemian Trade Route to capture restive worlds like Roche, Contruum and Kashyyyk. Mon Mothma saw this as inevitably leading to a repeat of the Outer Rim Sieges, which would end with the Alliance's territories being ground down by the Empire's superior industrial base. Mothma thus favored a stateless strategy: the Alliance was relegated to hit-and-run tactics, designed to harass Imperial shipping and operations."}, {"tag": "p", "text": "The Alliance Army was reorganized around the SpecForces: optimized for commando warfare and numbering barely one hundred thousand beings, the SpecForces became a flexible backbone for the entire Rebellion. Barracks regiments acted as specialist support echelons for other branches of the Alliance Military, while temporary task forces were detached for missions. Often, both regiments and task forces were used to buttress the weaknesses of the Alliance's local Sector Forces."}, {"tag": "p", "text": "As ground tactics shifted, Starfighter Command came to the fore, championed by General Jan Dodonna of Commenor. A proponent of the largely-unfashionable view that the starfighter corps should be a separate branch of the military, Dodonna believed that hyperspace-capable starfighters could undermine the Empire's control of space. He demonstrated this with raids conducted by BTL Y-wing starfighters that destroyed Star Destroyer fleets at Denab, Vnas and Tarawa. Thereafter, finding suitable targets for the Alliance Starfighter Corps became the priority for Alliance Intelligence, while Dodonna geared Ordnance and Supply and the Support Services to providing the materiel and men for raiding."}, {"tag": "p", "text": "As the Rebellion grew, starfighters became its primary combat force, though the majority of fighter squadrons were attached to Sector Forces, or to the increasingly-powerful Fleet Command. In the Alliance's early years, the brunt of space combat was borne by local Sector Forces, particularly Garm Bel Iblis' Corellian Resistance. Fleet Command was created to oversee the ragtag collection of cruisers that had escaped their home sectors, most notably the Alliance flagship Independence, which had escaped the occupation of Dac. The success of their starfighter tactics led many Rebel commanders to distrust cruiser warfare, but Mothma insisted on building up a battle line, led by the old CIS warships Rebel One and Fortressa. The new Alliance Fleet was under Dodonna's overall command, with its senior admirals including Gial Ackbar of Dac. The Fleet would roam the galaxy, challenging Imperial authority merely by existing, and waiting for the chance of a decisive battle with the Galactic Empire."}, {"tag": "p", "text": "Finally, diplomatic efforts were made by such rebel leaders as Leia Organa to win the hearts and minds of species across the galaxy to add to the rebel cause. Under the guise of mercy missions delivering aid to planets in need, Leia conducted her missions under secrecy aboard the Tantive IV, her membership of the Imperial Senate giving her diplomatic immunity. Leia's missions in support of rebel groups took her to Kostra, Belassar, and Gendrah-Narvin. She secretly supported an uprising on Solaest, and helped General Carlist Rieekan coordinate an evacuation of Rebel assets at Nentan."}, {"tag": "p", "text": "With the war still in its infancy, the Alliance and Empire both fought each other across an ever-widening playing field. The Alliance could not hope to make a direct stand against the Empire and thus spread out across the galaxy, planting cells and sowing dissent amongst population centers. The Empire, with its vast resources, fought to keep up and hunt the Alliance down. Fighting erupted on Barkhesh, Immalia, Ord Torrenze, and even at Salline on Mon Mothma's homeworld of Chandrila. Alliance outposts, such as one on Kashyyyk, were located and destroyed."}, {"tag": "p", "text": "As the Rebellion grew, so too did the ferocity with which it was hunted. Entire sectors were set upon by Imperial forces, whenever they were identified as hotbeds for Rebel activity. At Bompreil, efforts to root out a Rebel cell resulted in heavy civilian casualties. The Sullustan moon of Sulon was violently subjugated by Inquisitor Jerec after the inhabitants asserted independence from the corporate control of the SoroSuub Corporation, killing all the Rebels and desecrating their bodies. Shortly afterwards, a Rebel communications center on the asteroid AX-456 was destroyed by Stormtroopers led by Cadet Leader Kyle Katarn, who ultimately defected to the Rebel Alliance after he learned that his father had been killed on Sulon. The smuggler shadowports of Datar and Nar Shaddaa were attacked in separate battles in an effort to destroy the Rebels' smuggling-based supply network."}, {"tag": "h4", "text": "The X-wing and Turkana (1 BBY)"}, {"tag": "p", "text": "In 1 BBY, a pivotal moment in the war occurred occurred when the Empire nationalized the Incom Corporation. This caused a stir throughout the corporation that led designers and staff to offer their help to the Alliance. Through this, the Alliance learned of the T-65 X-wing starfighter and a holding facility on Fresia where four prototypes of the starfighter were held. Seeking to replace the aging Z-95 Headhunters, Alliance Command thus launched the Fresian campaign, aimed at stealing the X-wing prototypes in hopes of eventually mass-producing the starfighter for use against the Empire. Led by Raymus Antilles, a diversionary assault was made on Kuat, and a second on Wayland, to draw the Imperial forces away from Fresia. The Alliance was then able to make a landing on Fresia and in the battle that followed succeeded in capturing the prototypes. The Alliance subsequently rescued the Incom design team from Imperial captivity in the Kessel system."}, {"tag": "p", "text": "With the X-wing in possession, an Alliance task force led by Gial Ackbar was able to defeat Imperial units at the Battle of Turkana; surprised by the Alliance's \"secret weapon,\" the Imperial forces led by Xamuel Lennox and Firmus Piett were destroyed. The Empire retaliated with Operation Strike Fear, an offensive operation intended to pacify Rebel systems in the restless Tion Cluster. The Alliance discovered the operation in two reconnaissance missions in the Dellalt system led by Keyan Farlander, forcing them to evacuate their base on Brigia. The Alliance successfully delayed the operation with the capture of an Imperial convoy, but the Imperials recovered with victories at Rudrig and Orion IV. Elsewhere, Rebel Y-wings successfully broke the Imperial siege of Ank Ki'Shor, saving its population from an orbital bombardment."}, {"tag": "p", "text": "Imperial forces were drawn away from the Tion Cluster after the Sullustan Resistance overthrew the SoroSuub-dominated corporate government of Sullust, which was backed by the Empire. In response, Imperial reinforcements in the Sullust system captured numerous Sullustan technicians, who were subsequently rescued by Alliance forces, paving the way for diplomatic negotiations between Sullust and the Alliance. With the Sullustans in the Alliance's fold, together with information supplied by Commander Crix Madine, a disaffected Imperial officer who was considering defection, the Alliance was able to destroy the Star Destroyer Invincible, the flagship of the operation."}, {"tag": "p", "text": "In the aftermath of Turkana, Ackbar was invited back to the Calamari sector to lead the rebuilt Calamari Defense Force. Ackbar resigned from the Alliance Fleet, but continued to supervise the Shantipole Project - the Alliance's effort to create the B-wing starfighter - from afar, and worked to secure Dac's commitment to the Rebel cause. With the rescue of the Incom design team, Alliance was able to begin mass production of the X-wing starfighter, sharing the plans with sympathetic governments and species, including the Verpine and the Mon Calamari, assembling the craft in secret hangars and clandestine dry docks across the galaxy. The superlative fighter proved its worth in the subsequent Fei Hu campaign of 1 BBY, where the Lightspeed Panthers fighter wing destroyed 286 TIE Fighters in nine months for the loss of only four T-65s. The humiliating destruction of three Imperial capital ships by the unsupported X-wings of Renegade Flight at the Battle of Ton-Falk prompted the Empire to begin development of the Ton Falk-class escort carrier. While later campaigns were less one-sided, with the Imperial introduction of the Ton Falk-class, the TIE/IN interceptor and the Lancer-class frigate, the Galactic Empire was never seriously able to challenge Rebel dominance in the air."}, {"tag": "h3", "text": "The Ultimate Power in the Universe (1-0 BBY)"}, {"tag": "h4", "text": "The Death Star and the Tarkin Doctrine"}, {"tag": "p", "text": "The Death Star project and other Imperial superweapons were the Empire's attempts to correct the Rebels' stateless strategy. Even with the immense size of the Imperial Navy, the galaxy was still far too large to be effectively policed, and the Rebel Alliance was able to undermine the Empire through hit-and-run strikes launched from hidden bases. The Empire's response was a policy of reprisal, a system of state terror that was institutionalized in the Tarkin Doctrine. However, the policy of overwhelming force in an effort to deny the Rebels safe haven did more to foment resistance than eliminate it."}, {"tag": "p", "text": "The creation of the Death Star was intended to reverse such a state of affairs by introducing the possibility of a reprisal so terrifying - namely, the destruction of entire planets - that no world would risk aiding the Rebellion. It came about in a roundabout way, first being suggested as the Expeditionary Battle Planetoid by then-Commander Wilhuff Tarkin to Supreme Chancellor Palpatine in 29 BBY as a means of correcting lawlessness on the Outer Rim. As his alter ego Darth Sidious, Palpatine ordered Geonosian Industries and Poggle the Lesser to begin conceptualizing the \"Ultimate Weapon\". When Geonosis fell to the Republic in the first battle of the Clone Wars, Count Dooku delivered the plans to Sidious on Coruscant. Construction of the First Death Star began over occupied Geonosis in the weeks after the Clone Wars ended. Tarkin's involvement in the development of the Death Star came full circle in 18 BBY, when he presented his fully-formed Tarkin Doctrine to Emperor Palpatine. Impressed, Palpatine promoted Tarkin to the new rank of Grand Moff and placed in command of the Death Star project."}, {"tag": "p", "text": "Construction of the Death Star was slow: the necessity of keeping such a project a secret meant that it was beset by supply problems, and uprisings by slave laborers and sabotage meant that the construction site had to be moved multiple times. The battlestation took nearly nineteen years to complete, but when it was finally operational in 0 BBY it was the largest starship ever built: the First Death Star was 120 kilometers in diameter and boasted a superlaser main weapon that could destroy an entire planet, and was utterly invulnerable to even the largest fleet attacks."}, {"tag": "p", "text": "However, the Death Star, and the strategy of terror it implied, caused strong frictions within the Imperial Military's hierarchy. The \"Generationals\" of the Imperial Navy—those whose families had done military service for centuries—saw the fleet as a tool for establishing stability and order, and through it bring peace. They were horrified by the Tarkin Doctrine's principle of \"rule through fear of force\". The Death Star project even led Moff Kalast to defect to the Rebellion. In contrast, up-and-coming officers like Tarkin and Admiral Conan Antonio Motti despised the Generationals for their commitment to traditional strategies and believed in the power of example to cow the rest of the galaxy into submission. Motti's arguments won Tarkin's ear and he was appointed commander of Naval Operations aboard the Death Star."}, {"tag": "p", "text": "The concerns of the Navy were, ironically enough, best articulated by High General Cassio Tagge of the Imperial Army, and commander of Army Operations aboard the Death Star. Tagge believed that the traditional model of the Navy commanding space to protect the Army in ground assaults was a proven, efficient and flexible strategy. He also considered the Alliance to be far more dangerous than the Empire realized, and that the Death Star was drawing away resources from more valuable endeavors like the stalled Sarlacc Project, the development of a new class of gargantuan Star Dreadnoughts. Motti's response was that the mere existence of the Death Star left the Army free to act, and that if it met serious resistance on the ground, the Army could withdraw and the Death Star destroy the planet. Tagge's arguments that this was an inflexible strategy and Motti's flippant attitude, mockingly referring to the Navy as \"your starfleet\" to bait the General, habitually complicated operations on the Death Star."}, {"tag": "h4", "text": "Kalast's insurrection (1 BBY)"}, {"tag": "p", "text": "The Death Star project led the Imperial Moff Kalast to contemplate defection to the Rebel Alliance, slipping information on the Death Star to the Bothans and the Alliance at large from his Star Destroyer. Kalast hid on Thyferra, and Vader was personally assigned the task of hunting down and bringing the treacherous Moff to Imperial justice. After escaping arrest at Thyferra, Kalast began fomenting uprisings against the Empire, first with an insurrection on Fondor, and then a battle on Jabiim."}, {"tag": "p", "text": "With information obtained from Jabiim, Vader learned that Kalast had fled to his base on Atzerri. Two battles were fought over Atzerri, the first between the Empire, Alliance, and a pirate who offered to sell information on the Rebellion to the Empire, and the second in an attempt by Vader to arrest Kalast. However, the elusive Moff managed to escape. Enraged at yet another failure, Vader established a task force complete with a newly minted Immobilizer 418 cruiser to scour the galaxy and find Kalast. In an effort to protect Kalast, the Alliance Fleet engaged the Empire in a string of battles at Shola, Dantooine, and Nal Hutta. After perhaps months of actively pursuing the traitor, Vader was able to finally pin Kalast down and capture him. Kalast was brought before Palpatine and executed after he was forced to divulge his dealings with the Bothans, which led to the deaths of many Bothans in a punitive mission to Bothawui."}, {"tag": "h4", "text": "Operation Skyhook (1-0 BBY)"}, {"tag": "p", "text": "A project as massive as the Death Star could not be kept entirely secret. Through a combination of rumors, raids and an efficient and widespread intelligence network of Bothan spies, the Alliance learned of the construction of the Death Star. The Alliance thus launched Operation Skyhook, one of the widest-ranging operations in its history, aimed at acquiring a complete set of plans for the Death Star so that they might locate and exploit a weakness. All resources were poured into the effort; if such a weapon was unleashed upon the galaxy, it would spell certain doom for the Alliance."}, {"tag": "p", "text": "Construction of the Death Star had thus far taken many years; supervised by Tarkin, the project had hit many standstills, some of which included a shortage of labor, which was alleviated through the Subjugation of Geonosis and the enslavement of the Geonosians. Soon after, a riot erupted aboard the Death Star, led by Rebel prisoners. They managed to steal a technical readout of the battle station; while many of the rioters were killed, some were able to escape with the plans to the Rebel base on Polis Massa, where they were transferred to Alliance Command amid a raid on the base by the 501st Legion. The Alliance received fresh confirmation of the progress of the Death Star project from an informant recovered by Princess Leia Organa under the guise of a mercy mission during the Subjugation of Ralltiir, which was later corroborated by the Imperial officer Commodore Lord Tion."}, {"tag": "p", "text": "The Polis Massa plans, combined with another set acquired by Kyle Katarn at Danuta, and another acquired during the Battle of Toprawa, allowed the Alliance to conceive a full technical readout of the Death Star that could be analyzed for weaknesses. The complete plans, however, were trapped on Toprawa by Imperial reinforcements led by Darth Vader. Under the guise of a mercy mission, Princess Leia arrived in the Toprawa system and the plans were beamed to the Tantive IV. The Signal branch of Imperial Intelligence's Analysis Bureau, however, tracked the transmission from Toprawa to Leia Organa's ship and Darth Vader's Star Destroyer, the Devastator, began an immediate pursuit."}, {"tag": "p", "text": "Hoping to enlist the help of Obi-Wan Kenobi, Leia Organa rushed towards Tatooine with the plans in hand; however, Vader was able to catch up and captured the Tantive IV in a short space battle. As Vader's forces entered her ship, Leia Organa made a last desperate gamble and hid the plans of the Death Star aboard the astromech droid R2-D2. R2-D2, along with C-3PO, a protocol droid on the ship, used an escape pod to travel to Tatooine, where they were purchased from the Jawa scavengers who found them by Owen Lars, uncle of Luke Skywalker. Stormtrooper units, including the 501st Legion and the Desert Sands were deployed to Tatooine to find the missing droids, while Rebel forces in the Tatoo system began a desperate series of skirmishes in an effort to waylay the Imperial search."}, {"tag": "p", "text": "Skywalker soon discovered a portion of the message in R2-D2 and became interested. However, R2-D2, operating under programming included with the plans, escaped and tried to find Obi-Wan Kenobi. Skywalker, who encountered Kenobi in the Jundland Wastes, tracked him down. R2-D2 then played back for them Leia Organa's desperate plea for help. The two discovered that Imperial stormtroopers had attacked the Jawas who had sold them the two droids in a search for the plans. Luke returned to his home to find his aunt and uncle slaughtered at Imperial hands. He then accompanied Kenobi to Mos Eisley, where, after evading Imperial troops, the two negotiated with smuggler Han Solo and his first mate Chewbacca to take them and the plans to Alderaan aboard the Millennium Falcon."}, {"tag": "h4", "text": "The Destruction of Alderaan (0 BBY)"}, {"tag": "p", "text": "In the meantime, Emperor Palpatine used the ongoing war as a pretext for dissolving the Imperial Senate. With the Death Star shortly to become operational, Palpatine felt that he no longer had any need of the last remnants of the Republic's bureaucracy to control the Outer Rim. The fear engendered by the battle station would be the principle source of Imperial control in the Outer Rim."}, {"tag": "p", "text": "Leia Organa was transferred to the Death Star by Vader and interrogated for the location of the Alliance's hidden base. Leia refused to yield to torture, but was forced into a difficult position when Tarkin threatened to destroy Alderaan, her homeworld, if she did not reveal the base's location. Fearing the loss of Alderaan, but understanding she could not betray her allies on Yavin 4, Leia lied to Tarkin and declared that the base was on distant Dantooine, isolated from the galaxy at-large. A smirking Tarkin, confident in his victory, continued with the operation to destroy Alderaan regardless, stating that Dantooine was \"far too remote for an effective demonstration.\" Thus, Alderaan was destroyed by a single blast from the Death Star, an act of mundicide that killed billions of sentients, including Bail Organa, and sealed the fate of the Empire."}, {"tag": "p", "text": "Tarkin still had matters with the Rebel base; a scout team was sent to Dantooine to ascertain whether or not there was indeed a base there. Meanwhile, the Millennium Falcon arrived in-system, carrying Luke Skywalker, Obi-Wan Kenobi, and R2-D2, who still had the Death Star's technical readouts. Trapped aboard the Death Star due to the massive array of tractor beams, Luke sought to rescue Leia while Obi-Wan went alone to disable the tractor beam generator and confront Darth Vader."}, {"tag": "p", "text": "Tarkin ordered Leia's execution when he learned of her deceit; however, before the order could be carried through, she was rescued by Luke. A daring escape through the Death Star's corridors commenced. As they made it to the hangar to escape aboard the Falcon, a concerned Luke watched as Obi-Wan Kenobi faced off against his former apprentice, Darth Vader. With a knowing smile, Obi-Wan purposefully let down his guard and allowed himself to be cut down by Vader's lightsaber, immediately becoming one with the Force as his physical form disappeared."}, {"tag": "h4", "text": "The Battle of Yavin (0 BBY)"}, {"tag": "p", "text": "The Millennium Falcon escaped soon after, pursued by several TIE Fighters but ultimately allowed to escape by Tarkin, as he hoped that the Falcon would lead straight to the Rebel's hidden base. His plan proved effective; with a homing beacon secured aboard the ship, the Empire learned that the rebels were hiding on Yavin 4. After sending a platoon of Stormtroopers to the moon to confirm Rebel activity, course was set to the Yavin system to destroy the Alliance."}, {"tag": "p", "text": "In the Great Temple, the technical readouts were analyzed and an attack plan was conceived by Jan Dodonna. With the Death Star looming overhead and entering into range to unleash its superlaser, Rebel ships took off in a desperate attempt to destroy the behemoth battle station. The plan called for cutting across the Death Star's equatorial trench and following it down to a small thermal exhaust port, where a single proton torpedo would be able to reach the Death Star's main reactor and set off a chain reaction, should it hit. In an intense battle, Rebel pilots attempted to stave off Imperial starfighters while attack runs were made against the exhaust port. Tarkin, underestimating the Alliance's chances, refused to send out more than a squadron of starfighters to deal with the Rebel problem; he ignored Chief Moradmin Bast's warnings of a threat to the exhaust port and continued with his descent upon Yavin IV."}, {"tag": "p", "text": "As Rebel pilots continued to be destroyed one-by-one by Darth Vader and other Imperial pilots, Luke Skywalker, Biggs Darklighter, and Wedge Antilles made one last run against the trench. Vader killed Biggs and forced Wedge to retreat, and was moments away from shooting down his son, Luke, before Han Solo entered the fight with the Millennium Falcon. Solo managed to drive Vader out of the battle, giving Luke one shot at the thermal port. The attack succeeded, and moments later the Death Star exploded, taking with it millions of Imperial lives. Yavin 4, and the Alliance, was saved."}, {"tag": "p", "text": "This pivotal moment secured Luke Skywalker's journey towards being a Jedi Knight, and marked a major turning point in the galactic war against the Empire. From then on, the Empire no longer took the Rebellion for granted; Palpatine issued directives to drastically increase the size of the military, expanding the armed forces to unprecedented levels to counter the threat of the Alliance and growing dissent across the galaxy."}, {"tag": "h3", "text": "After Yavin (0-2 ABY)"}, {"tag": "h4", "text": "The Blockade of Yavin (0 ABY)"}, {"tag": "p", "text": "The Battle of Yavin gave the Rebel Alliance credibility as a legitimate military threat to the Empire. With the Death Star's loss over Yavin, the Destruction of Alderaan and the murder of billions was no longer an object lesson, but a rallying cry for the resistance. The Empire began to rely increasingly more on acts of terror to stamp out dissent, for example, the release of the Candorian plague on Dentaal. In the Tion Hegemony, Clariv was subjugated for Rebel sympathies."}, {"tag": "p", "text": "The Rebel commanders knew that their celebrations would be short-lived. Because of the destruction of the Death Star, the Empire would focus all of its military might into destroying the Rebels. Preparations were made for a full-scale evacuation of Massassi Station and relocation to another secure hideout. The Empire expected the Rebels to flee Yavin immediately, but instead much of the base remained intact. Jan Dodonna supervised evacuation efforts, but while some heavy equipment and critical supplies were removed, he convinced Mon Mothma that most of the base's personnel and equipment could be hastily evacuated at short notice. He saw making a stand on Yavin 4 as a powerful statement of defiance and a recruiting tool."}, {"tag": "p", "text": "In turn, the Empire countered with a propaganda effort of its own: just prior to Yavin, the planet Ord Biniir had been taken by a force of Rebel Y-wings. The second squadron of the 181st Imperial Fighter Wing, led by Captain Soontir Fel, was sent to retake the planet. Under Fel's expert leadership, the Second Battle of Ord Biniir was an utter rout. But for the fact it had happened on the same day as the Battle of Yavin, Ord Biniir would have been a terrible Rebel defeat. However, the Empire heavily-publicized the victory to distract from Yavin, and Fel was publicly promoted to Major and given de facto command of his unit, which was rebuilt as an elite group. The 181st Imperial Fighter Group would become one of the most celebrated units of the Galactic Empire's Starfighter Corps, and one of the most feared by the Alliance."}, {"tag": "p", "text": "The Imperial Navy established a loose blockade around the Yavin system, but it was complicated by a lack of ships. The starfleet was spread thin searching for the roving Alliance Fleet, and to commit too many ships to Yavin would allow the Rebels to make major strikes elsewhere and make the Empire look impotent. Alternatively, if too few were committed, Mon Mothma and Admiral Ackbar might arrive in strength to break the blockade and win a second battle of Yavin. Darth Vader, meanwhile, was committed to leading the attack on Yavin personally from the bridge of his nearly-complete Star Dreadnought Executor, a colossal warship designed to be so powerful that its mere existence would pacify multiple sectors. As the Executor was completed, the blockade would fix the Rebels in place."}, {"tag": "p", "text": "However, the Yavin blockade was riven by infighting between Baron Orman Tagge and Moff Nox Vellam of the Bright Jewel Oversector. Consequently, during the siege, Luke Skywalker and other Rebel pilots were successful in slipping through the blockade to perform covert missions and attempt to find a suitable planet to relocate from Yavin. One such mission took Luke to Fondor where he was able to see the final stages of the Executor's construction before its departure to Yavin. A subsequent mission took Luke to Aridus, where he assisted the Chubbit resistance in destroying an Imperial signal amplifier known as the Iron Tower. On his return from this mission, Luke stumbled upon the ice world of Hoth after an accident with a comet, which he reported back to Alliance Command as the perfect spot to relocate after Yavin was evacuated."}, {"tag": "p", "text": "With the Executor's launch, the Alliance launched a formal evacuation of Yavin. The 501st Legion descended upon the moon with elements of the Imperial Army and began a siege of the Alliance temple and headquarters; during a series of skirmishes that lasted some time, many Alliance commanders and personnel were killed and Dodonna himself was captured, and presumed killed by the surviving Alliance personnel who managed to escape through the Imperial blockade."}, {"tag": "p", "text": "In order to help evacuation efforts, Admiral Ackbar led the Mon Calamari fleet in a diversionary assault on the nearby planets Kli'aar, Pinoora, and the Vallusk Cluster; the assault was a success, with a significant portion of the Imperial fleet diverting its resources to deal with Ackbar. However, the assault showed to Mon Mothma and other Alliance commanders the need for a stronger and unified fleet. Ackbar was promoted to Supreme Commander of the Rebel Fleet and military, and efforts were made to increase the size of the standard military. The Massassi leadership, meanwhile, prepared to escape down a series of secret routes to the Hydian Way via the uninhabited Tertiary Feswe system. However, the Empire managed to cut off the Tertiary Feswe and Feswe Minor routes, forcing the Rebels to make a risky escape around the unstable star Feswe Prime, assisted by Luke Skywalker's use of the Force. Vader moved the Executor to intercept, but was thwarted when the over-eager Admiral Amise Griff rushed to engage, causing three of his Star Destroyers to come out of hyperspace right on top of the Executor and slam into its shields. In the confusion, the Alliance escaped."}, {"tag": "h4", "text": "Alliance on the Run (0-1 ABY)"}, {"tag": "p", "text": "Subsequent Rebel operations were driven by the need to replenish supplies before they could relocate to a new base. Contact was made with Imperial Overlord Ghorin of the Greater Plooriod Cluster, who offered his defection and aid along with badly-needed shipments of grain. However, Ghorin had no intentions of defecting; his grain was poisoned and he intended to betray the Alliance. Unfortunately for Ghorin, the Alliance discovered his plan, and through Operation Grain Snatch turned the tables on the Imperial Overlord. Through careful manipulation by the Alliance, Ghorin was seen as a traitor to the Empire; after the success of the operation, Vader paid a visit to Ghorin and, taken in by the Alliance ruse, killed the Overlord."}, {"tag": "p", "text": "Subsequent to the Yavin evacuation was the Reytha campaign, a Rebel operation on one of the Empire's most productive agriworlds to acquire its food supplies. For a time, it succeeded owing to the complicity or incompetence of Governor Antes Belladar, however, after the capture of Yavin, Darth Vader managed to extract information from Jan Dodonna about the Rebel operation on Reytha and dispatched his Fleet to the Reytha system. He made contact with Governor Belladar, who sought help against the Rebel forces. Vader was suspicious of the Governor, but nonetheless proceeded to annihilate the Rebel outpost. After the last of the Rebels were routed, Vader killed Belladar and installed a new Governor."}, {"tag": "p", "text": "A raid on an Imperial base at Milvayne caused deep ructions in the Alliance that would not be mended until 9 ABY. With Bail Organa's death in the destruction of Alderaan, Mon Mothma and Garm Bel Iblis became the two most senior figures in the Rebellion. However, Bel Iblis began to suspect that Mothma was accruing power to herself and that she would declare herself Empress in Palpatine's place should the Empire be defeated. Mothma later gave approval for the attack on an Milvayne, without seeking the approval of Bel Iblis or any of her other military advisors. Before the attack was enacted, Bel Iblis requested that she postpone and reconsider the attack. Mothma overruled him, but a livid Bel Iblis questioned her motives in ordering the attack, claiming it was simply part of a grab for power on her part. The two traded thinly-veiled insults, with Bel Iblis eventually stating that none of his troops would have a part in the attack. He felt that Mothma's Intelligence was flawed, as his own sources informed him it was in fact a heavily fortified Imperial Ubiqtorate base, which his men would be unable to deal with. For his dissent, Mothma told Bel Iblis that the Rebellion no longer required his services. In response, the Corellian leadership withdrew from the Alliance and began its own private war against the Empire."}, {"tag": "p", "text": "The Alliance suffered a near-catastrophe with the Disaster at Deepspace Besh. The Empire had successfully reprogrammed the captured Rebel mathematician Jorin Sol to act as an Imperial agent. After he was rescued from Kalist VI by Luke Skywalker, Sol was cleared to return to duty, but he transmitted the Rebel fleet's location at a point codenamed Tingel Deepspace Besh to the Empire, as well as its escape vectors. The Imperial fleet dropped out of hyperspace right after Jorin Sol's attempted assassination of the commanders on board Rebel One and began firing on the Rebel fleet, destroying transports and smaller capital ships en masse. However, Sol managed to fight off his programming long enough convince Tungo Li to order all Rebel ships to scatter into hyperspace rather than follow the now-revealed escape algorithms, which would only bring them to another Imperial fleet. Despite this, much of the fleet was deemed lost, possibly for good."}, {"tag": "p", "text": "The disaster at Deepspace Besh might have been a mortal blow to the Rebellion, but the Alliance was saved by two things. Firstly, the Bothan political leader Borsk Fey'lya committed his sizeable faction of the Bothan Spynet to the Rebellion. Fey'lya had been impressed by the victory at Yavin, but many recognized that he had made his move not for ideological reasons, but to gain more status and power. Secondly, at Admiral Ackbar's urging, the Mon Calamari formally entered the war on the side of the Alliance. In the aftermath of Yavin, Admiral Ackbar had traveled to his homeworld to convince the Mon Calamari Council to back the Rebellion, and after being rescued by the Heroes of Yavin from the Empire at the Battle of Daluuj, the Mon Calamari donated their entire naval strength to the Alliance. Mon Calamari Star Cruisers became the backbone of the Alliance Fleet, under the command of Admiral Ackbar as Supreme Commander. Ackbar reorganized and trained the ragtag group of ships and crews into a fighting force capable of facing the Empire. Ackbar shared with Mon Mothma an unease towards the Alliance's excessive reliance on raids by the Special Forces and Starfighter Corps, while at the same time rejecting the insistence of traditional strategists in the Alliance that the Rebellion should seek to seize territory."}, {"tag": "p", "text": "Ackbar and Mothma drafted a new \"fleet-first\" strategy for the Rebellion. The traditionalists in the Alliance hailed Ackbar's reorganization of the fleet into a single armada powerful enough to challenge any battle squadron of the Imperial Navy, but Ackbar looked at the fleet beyond its tactical role: his strategic thinking was cautious, conservative, and perfectly suited for the Alliance's guerrilla operations. He saw capital ships as the decisive force of space warfare, which, like the mighty ocean predators of his homeworld, would hide in the deeps and strike when the enemy showed weakness. The Alliance Fleet would roam the galaxy, holding back from combat and building up its strength, becoming an ever-greater psychological threat to the New Order and undermining its authority merely by continuing to exist."}, {"tag": "p", "text": "The Rebellion continued to stage guerrilla strikes on the Empire over the next year, including Operation Ram's Head, which demolished four Star Destroyers in drydock. The Alliance Fleet remained scattered, however, and the military leadership continued to search for a new base. For fear of losing both in a single Imperial strike, Mon Mothma refused to join the Alliance's civilian government with the military leadership. Even though the Alliance's strategists warned that this increased the cost of operations enormously, it was a strategy that paid dividends during the near-disaster at Tingel Deepspace Besh. The jungle planet of Thila was briefly used, but it was abandoned when it was suggested that the Empire would expect the Rebels to move to another jungle world like Yavin 4."}, {"tag": "h4", "text": "The Dark Trooper Project (1 ABY)"}, {"tag": "p", "text": "The Dark Trooper Project was a secret Imperial weapons program developed by Rom Mohc to create the Empire's next-generation of Stormtroopers. The Dark Trooper was a highly-advanced battle droid that would, in time, succeed the Stormtrooper as the main fighting unit of the Imperial Military."}, {"tag": "p", "text": "The Project was run from Mohc's production facility, the factory ship Arc Hammer. After a devastating attack on Talay, which saw the destruction of Tak Base, the Dark Troopers proved their effectiveness in their first combat operation. Kyle Katarn and Jan Ors, mercenaries under the Alliance's employment, made famous for their previous efforts at collecting the data for the Death Star, were assigned by Mon Mothma to investigate the Dark Trooper Project and stop it at all costs."}, {"tag": "p", "text": "Katarn and Ors were successful in their mission; infiltrating the Arc Hammer through Vader's Executor, Katarn killed Mohc in a fierce confrontation and then destroyed the factory ship with several thermal detonator charges. With the Arc Hammer destroyed and Mohc dead, the project was a disaster; so furious was Palpatine that so many credits and resources were wasted on the failed project that he canceled the project entirely. The threat of the Dark Troopers ended."}, {"tag": "p", "text": "Katarn was assisted in his mission by Crix Madine: after his help during Operation Strike Fear, Madine decided to fully leave the Empire after the release of the Candorian plague on Dentaal. However, he was discovered by the Empire and held on Orinackra, scheduled for execution. The timely arrival of Katarn saw Madine rescued. Madine returned to Corellia, where he was scheduled to meet with Carlist Rieekan to finalize his defection to the Alliance. However, the meeting was ambushed by the Empire, but due to the intervention of Rogue Squadron and the Millennium Falcon, Madine was saved and shuttled off the planet."}, {"tag": "p", "text": "Madine's intimate knowledge of Imperial tactics and operations earned a spot on the Rebel Alliance Advisory Council and role as Supreme Commander of Alliance Special Forces."}, {"tag": "h4", "text": "Renegade Squadron's Exploits (0-1 ABY)"}, {"tag": "p", "text": "Renegade Squadron was originally created by Han Solo shortly after the Battle of Yavin, but many of its exploits occurred after the Evacuation of Yavin 4. During that battle, Renegade Squadron was instrumental in helping many members of the Alliance escape. Next, they travelled to the Graveyard, the remains of what used to be Alderaan, in order to collect a holocron made by Bail Organa and encased in phrik, one of the strongest substances in the galaxy, strong enough even, to survive the destruction of Alderaan. The holocron had a list of potential bases for the Rebel Alliance, in the case of the evacuation of the base on Yavin IV. After retrieving the holocron and escaping into hyperspace, they met up with Solo on Ord Mantell. Renegade Squadron fought off Imperial forces and IG-88 while Han worked on the Millennium Falcon, escaping with their lives."}, {"tag": "p", "text": "Shortly afterwards, Admiral Ackbar, who had been investigating Boz Pity as a potential site for a Rebel base, was captured by Boba Fett and handed over to the Empire. Renegade Squadron quickly acted to rescue Ackbar over Kessel before relocating to Tatooine in order to find the soldiers who had been captured with Ackbar."}, {"tag": "p", "text": "The squadron headed back to their base on Boz Pity, but they were unaware that Boba Fett had put a tracker in one of their droids. Fett discovered their base, and a few hours after Renegade Squadron landed on Boz Pity, an Imperial planetary strike force, with an AT-AT, attacked. During the battle, the Squadron learned that Ackbar had been wounded during the battle, and they saved his life by bringing him a bacta tank. Soon after, they successfully evacuated, still looking for a new base."}, {"tag": "h4", "text": "Rogue Squadron (0-3 ABY)"}, {"tag": "p", "text": "Months after the Battle of Yavin, two of its famous survivors, Luke Skywalker and Wedge Antilles, formed an X-wing squadron that would arguably become the most famous in the galaxy—Rogue Squadron. The squadron's origins laid within Red Squadron, then under the command of Arhul Narra, as Rogue Flight, working in tandem with Renegade Flight. Rogue Flight's early missions included aiding evacuation efforts at Yavin 4 and assisting Tycho Celchu defect to the Alliance on Dantooine. Early victories on planets such as Tatooine, Barkhesh, and Chorax earned the Rogues a quick reputation amongst Alliance and Imperial pilots alike, going as far as to convince Kasan Moor, commander of the 128th TIE Interceptor Squadron to defect. Moor's defection led to vital raids on Imperial production facilities, including Balmorra and Kile II. These victories did not come without a price, however; Moff Kohl Seerdon took note of the Rogue's performance and personally took interest in seeing the Squadron's destruction after their attack on Fest, site to Seerdon's research facility. Seerdon launched attacks on Chandrila and Thyferra in retaliation, but his plans were foiled by Rogue Squadron; over the skies of Thyferra, Seerdon's personal attack craft was shot down by Rogue Squadron, ending his reign of terror."}, {"tag": "p", "text": "On Ralltiir, a team of scientists working with the Alliance were discovered by Imperial agents. The scientists were able to activate a deflector shield around the city, thus temporarily saving them from Imperial reprisal. Two Star Destroyers in orbit began to open fire on the shield as ground units, including AT-ATs, descended upon the planet to shut down the shield and capture the scientists. Rogue Squadron was dispatched to Ralltiir to rescue the scientists; led by Skywalker, the Rogues utilized tow cables to destroy the walkers and halted the Imperial offensive. Using explosives constructed by the scientists, the bridges connected to the city were destroyed, thus cutting off Imperial forces from reinforcements to temporarily buy time to escape. During the rescue, Sarkli, a disgruntled Rogue pilot and nephew to Imperial Admiral Firmus Piett, defected to the Empire, taking with him one of the scientists. Despite the last minute surprise defection, the Rebels were able to escape with the surviving scientists."}, {"tag": "p", "text": "During a convoy escort relocating supplies to Echo Base, an ambush by Imperial forces at Derra IV all but wiped out Renegade Flight, killing Commander Narra. As a result, Rogue Flight was transformed into Rogue Squadron and Luke Skywalker was given full command over the squadron."}, {"tag": "h3", "text": "The Empire strikes back (2-3 ABY)"}, {"tag": "h4", "text": "Death Squadron (2-3 ABY)"}, {"tag": "p", "text": "Eventually, Mon Mothma agreed to establish the new Rebel command headquarters at Echo Base on the frozen planet of Hoth. The planet seemed like a superb find for the Alliance: located in the isolated Anoat sector in the Greater Javin, Hoth was situated on the Ison Corridor, a decaying hyperspace bypass of the Corellian Trade Spine whose only common destination was Bespin. The difficulties of traversing the Ivax Nebula and the debris field of the Ison Rimward meant that ships invariably reached Bespin from the Coreward end of the Corridor from Indellian. Very few ships passed beyond Bespin to Anoat, Hoth, or Ison itself. Hoth was therefore secluded, largely unknown, but gave the Alliance quick access to the Corellian Trade Spine for raiding. Nevertheless, the base commander, General Carlist Rieekan, demanded a permanent state of readiness to evacuate should Echo Base be discovered."}, {"tag": "p", "text": "Rieekan had good reason to worry: inspired by the victory at Yavin IV, many worlds had begun to pledge their allegiance—openly or behind closed doors—to the Alliance cause. Some planets, such as Zaloriis, instead fought for their own independence from Imperial rule. After the Zaloran declaration of independence, they battled against their Imperial rulers, capturing Major General Maximilian Veers of the Imperial Army in the process. Vader himself descended upon Zaloriis and enacted swift devastation upon the populace; during the battle, Veers was rescued and, after analysis of the Zaloran archives, the Empire discovered that the new Rebel base was located in the vicinity of Elrood."}, {"tag": "p", "text": "With this new information in hand, Vader assembled a personal task force; Death Squadron. Led by the Executor, it was formally composed of five other Star Destroyers but had the authority to attach warships from other sector groups if necessary. Beginning at Centares, Vader intensified his search for the Rebel base and his new obsession, the pilot who had destroyed the Death Star who bore the name of Vader's former self, Luke Skywalker."}, {"tag": "p", "text": "Death Squadron advanced through the Outer Rim along the Triellus Trade Route, destroying smugglers' hideaways and shadowports. The strategy, developed by Grand Admiral Thrawn, was to disrupt the Rebels' smuggling-based supply network and so discover the location of Alliance High Command. Captured smugglers were interrogated, and a battle in the Ulkantha asteroids tipped Death Squadron off to a Rebel-affiliated Sakiyan smuggling ring operating out of the Syvris shadowport. Thrawn's analysis of Rebel equipment captured at the Battle of the Poln system indicated that Rebels had chosen a barren, cold planet as their next base of operations. Additionally, Thrawn uncovered a Corellian smuggling operation on the Hydian Way and masterminded the interception of a Rebel supply convoy at Derra IV. The Battle of Derra IV was a disaster for the Alliance: the 181st Imperial Fighter Group led by Soontir Fel severely disrupted Rebel supply lines and killed Commander Arhul Narra of Renegade Flight."}, {"tag": "p", "text": "By 3 ABY, Death Squadron's strategy of terror began to have results: Rebel forces in numerous Outer Rim sectors abandoned their bases and resistance cells dispersed. Admiral Ackbar relocated the Alliance Fleet repeatedly. The Derra IV convoy's supplies had been ticketed for Echo Base on Hoth in the Greater Javin, and the information recovered from the convoy allowed Death Squadron to narrow its search to the Outer Rim sectors of the Western Reaches. Thousands of probe droids were dispatched throughout the region in an attempt to discover the Rebel base. Reports came in daily from the probes, but many turned up more smugglers' encampments, uncharted settlements, or otherwise nothing of value. However, then-Captain Firmus Piett of the Executor came upon one report from the Hoth system; after analysis of the feed by Piett, and then Vader, Hoth was confirmed as the site of the Rebel base."}, {"tag": "h4", "text": "The Battle of Hoth (3 ABY)"}, {"tag": "p", "text": "Advancing from the Qeimet system, Death Squadron was reinforced by four Star Destroyers from the Juris sector and traveled down the Ison Corridor into the Hoth system. The Battle of Hoth commenced soon after, with the Rebels fighting a stalling effort to allow base personnel and command to evacuate with as many supplies as possible and regroup with the main Alliance fleet. If Imperial Admiral Kendal Ozzel, who was soon relieved as commander of Darth Vader's Death Squadron for his error, had not come out of hyperspace so close to the Hoth system, the Rebels could have been caught unaware and bombarded from orbit, but instead they managed to erect a small planetary shield. Vader ordered General Maximilian Veers to lead a walker assault on Echo Base, which the Rebels could not effectively counter."}, {"tag": "p", "text": "The Rebel base was overrun and destroyed, seventeen of thirty escaping Rebel medium transports were totally destroyed as they attempted to traverse the Imperial blockade, and an intense pursuit of the escaping Millennium Falcon through the Hoth asteroid field was conducted on Vader's seemingly erratic orders. Despite much Imperial effort, the Falcon escaped to Cloud City on Bespin, seeking asylum from Han's old friend, Lando Calrissian. Unknown to Solo and his companions, the Empire had forced Calrissian into cooperating with its efforts to capture the Falcon's outlaw crew. Vader, bounty hunter Boba Fett, and a squadron of stormtroopers apprehended the Rebels and prepared a trap for Luke Skywalker, whom Vader knew would come to investigate."}, {"tag": "p", "text": "As the Alliance Fleet regrouped at a secret point above the galactic plane, Luke Skywalker, under the advice of the Force ghost of Obi-Wan Kenobi, had traveled to Dagobah and had become a Jedi apprentice to Jedi Master Yoda. Through the Force, Luke became aware of his friends' suffering and, despite the pleas of Yoda and Kenobi to stay and complete his Jedi training, left Dagobah for Cloud City in an attempt to save his friends, who ended up saving him after he confronted Darth Vader. Vader also revealed to Luke in their battle that he was his father. At the last second, the friends escaped aboard the Millennium Falcon, though Han Solo was taken in carbonite to Jabba the Hutt on Tatooine by the bounty hunter Fett."}, {"tag": "h4", "text": "New superweapons"}, {"tag": "p", "text": "The Battle of Yavin was not the end of the Tarkin Doctrine. Following the loss of the First Death Star, the Empire began the construction of the Tarkin, a stripped-down superlaser testbed named in honor of the martyred Grand Moff. Assembled in the Patriim system, it was destroyed by a Rebel strike team led by the Heroes of Yavin in 3 ABY shortly after the Battle of Hoth. The Tarkin fired its superlaser only once in its existence: to destroy the planet Aeten II to release Stygium crystals for Grand Admiral Martio Batch's Phantom TIE Project."}, {"tag": "p", "text": "Batch's project sought to develop invisible starfighters utilizing cloaking technology developed from Stygium crystals. Vader was impressed by the Phantom's demonstration in the Dreighton Nebula, and mass-production of the starfighter began at a factory attached to Imdaar Alpha. However, Ru Murleen and Rookie One were able to steal a TIE Phantom and infiltrate the Star Dreadnought Terror; through their actions they destroyed the Terror and the TIE Phantom production facility, putting an end to the short-lived Phantom project. At the conclusion of the mission, the Alliance sought to mass-produce their own Phantoms based on the starfighter retrieved by Rookie One; however, this plan was quickly eliminated, as Vader activated the self-destruct on all remaining TIE Phantoms, thus ensuring the end to the TIE Phantom line."}, {"tag": "p", "text": "Admiral Mils Giel launched his own project of a more arcane nature soon afterwards, aimed at using the mysterious Teezl creature to greatly enhance Imperial communications and fleet coordination. A secret armada led by the Helmsman was assembled to transport the creature from the Valtha Divide to Coruscant. In response, the Alliance launched Operation Earplug. The first part of the plan concerned the procurement of four black-market TIE Fighters, which would be modified into hyperspace-capable starfighters and used by the Flying Bantha Squadron in subsequent missions. As part of their test-run, the squadron's TIE fighters were used in an attack on Spindrift Station, an Imperial outpost said to hold the route coordinates for the fleet transporting the Teezl. With the coordinates secured, the entrance codes to the armada were next. These would be secured in an ambush on a TIE patrol, near the Imperial fleet's flight-path. They assigned four Flying Bantha Squadron pilots to perform the final task of the operation: an almost certain suicidal infiltration mission that would culminate in the destruction of the Teezl. Gaining access, the Rebel TIEs split off, chose random ships to target, and begun the mayhem and confusion which would spread throughout the Imperial fleet. The commanders of the damaged vessels followed standard procedure and counterattacked, but since it was unclear which ships had hit the targets, the warships lashed out at random, hitting dozens of TIE fighters and even other capital ships. Admiral Giel quickly realized the Rebel attack plan, and thus ordered the Teezl to be used to fill all available comm channels with static, to prevent further communication between the Rebels. The Teezl's jamming forced Luke Skywalker to rely only on the Force to identify friend from foe, as he finally reached the area of Giel's vessel where the Teezl was located. Being fired upon by defensive guns, he noticed a TIE fighter between him and the flagship. Using the Force to identify the pilot as an enemy, he fired on it and cleared the way for the main, powered-up shot. It struck the vessel, smashing through the hull and killing the Teezl instantly. After the battle, Luke fled the area, using a patrol ship as a temporary shield from pursuing enemy fighters before escaping into hyperspace. As a result of the loss of the Teezl, Giel was demoted to Lieutenant and reassigned."}, {"tag": "h4", "text": "Imperial explorations"}, {"tag": "p", "text": "Perhaps the Empire's most enduring and dangerous military creations were not weapons at all, but rather explorations. Palpatine opened great swathes of territory to new explorations, most significantly being the Deep Core and the Unknown Regions. New routes like the Byss Run were blazed into the Galactic Core at incredible expense and were kept open with non-mass S-thread boosters. Worlds like the Emperor's redoubt at Byss and the headquarters of the Inquisitorius at Prakith were settled by enthusiastic Imperial citizens, and the region remained fanatically loyal to the Empire for years afterwards. The Deep Core was a refuge for Imperial forces after Endor, the site of the rebirth of Emperor Palpatine into a clone body, and from it he led Operation Shadow Hand. The Deep Core was the refuge of the Empire's last significant warlords before they abandoned it for the Imperial Remnant in the Outer Rim."}, {"tag": "p", "text": "The other significant region of Imperial exploration was the Unknown Regions, the vast quarter of the galaxy west of the core that had always defied colonization. Following his discovery by Voss Parck in 19 BBY, the Chiss Imperial officer Mitth'raw'nuruodo, better remembered as Thrawn, spent years charting this region of his birth at Palpatine's personal order, for which he received the rank of Grand Admiral. From a fortress known as the Hand of Thrawn on Nirauan in Wild Space, Thrawn established a Loyalist confederation known as the Empire of the Hand. Re-establishing contact with the Chiss Ascendancy, Thrawn won the admiration of many young Chiss with his defeats of a myriad of threats, including the encroaching Yuuzhan Vong. He returned to the Unknown Regions shortly before Endor, continuing his mapping mission and settling a vast new swath of territory and resources that could fuel the Empire. In 8 ABY, before he returned to the galaxy one last time to fight his final campaign, Thrawn swore to Voss Parck, now his second in command, that if he died he would return ten years later."}, {"tag": "h4", "text": "The Sepan campaign (3 ABY)"}, {"tag": "p", "text": "Concurrent to Death Squadron's operations against Hoth was the Sepan campaign, a series of battles initiated by the Empire in 3 ABY with the objective of bringing an end the Sepan Civil War, which had raged for nearly three decades between the Ripoblus and Dimok. Imperial forces, led by Admiral Harkov, started by intercepting both Dimok and Ripoblus attack forces, halting their attacks on one another. Unfortunately for the Empire, the result was that both the Ripoblus and Dimok aligned and declared war on the Empire, an ironic turn of events."}, {"tag": "p", "text": "After a series of battles, the Empire defeated the Sepan forces and forced a peace treaty upon the two, ending the civil war. Harkov urged cooperation with the Empire for greater prosperity for all. Under Imperial rule, hostilities on Sepan ended, but in 40 ABY, with the ongoing strife brought upon by the Second Galactic Civil War, tensions flared up once more, and Sepan would find itself in civil war again."}, {"tag": "h3", "text": "The Alliance regroups (3-4 ABY)"}, {"tag": "h4", "text": "Task Force Vengeance (3 ABY)"}, {"tag": "p", "text": "The Battle of Hoth nearly crippled the Rebellion, with untold amounts of military materiel being lost aboard the seventeen destroyed transports. A number of Stormtroopers within the Empire's 501st Legion even believed that they had ended the Rebellion for good. Though Alliance Command and the fleet stayed intact, more disasters were to follow. After the formation of Task Force Vengeance, the Rebel Alliance was forced to give up its permanent assets in the Elrood sector in favor of the more remote and less strictly controlled Airam sector. In the opening battle of the campaign, many assets in Elrood sector were evacuated, most notably XQ5 Platform-turned-hospital Hormuuz in the Gelgelar system. Most places were able to avoid Imperial attention, but Hormuuz attracted the attention of Admiral Wooyou Senn, who deployed a strike team to capture any Rebels in the system. Although the Rebels, who had learned to react quickly after losing over half of its Echo Base assets to Death Squadron in the Hoth system, succeeded in avoiding major losses, many Z-95 starfighters were sacrificed to cover the escape of base staff and several vital cargo containers were left floating in space."}, {"tag": "p", "text": "After stocking up on consumables and warheads, the Alliance went on to find out their enemies strength—a reconnaissance mission was flown by Rogue Squadron in order to scan the ships of Task Force Vengeance and destroy any freighter carrying warhead supplies. This culminated in a diversionary strike by the Calamari Cruiser Liberty herself, intended to lure away some of the Imperial warships into an ambush set in the Goff system. Rogue Squadron led a strike team to capture an Imperial interdictor while it was undergoing repairs. The attempt was successful, and despite the Empire's attempts to scuttle the Compellor, the Rogues were able to bring the ship safely to the Mobetta system. By maintaining tight patrols around the factory, Gallofree, the Rebels managed to keep the modifications performed on the Strike-class cruiser Peregrine a secret, prepping the Compellor for its final mission as well. The baptism of fire for the Peregrine came shortly thereafter in the Derilyn system, where it assisted Liberty in pinning down and destroying a reinforcement and resupply fleet headed for Task Force Vengeance. Meanwhile, an Imperial strike force located the Compellor—which blew up in full view of the Star Destroyers Titan and Juggernaut, according to the Rebels' plan, leading the Imperials to believe that neither they nor the Alliance had access to gravity well technology anymore."}, {"tag": "p", "text": "In the closing days of the campaign, Task Force Vengeance was already showing the effects of raids against their supply lines. In a last-ditch effort, Senn tried to acquire supplies from the traitorous Airam clan leader Ilay, but was foiled by the efforts of Rogue and Green Squadrons. The Alliance, intent on wearing down the remainders of the Imperial task force slowly but steadily, did not expect Admiral Senn to know the location of their most crucial asset in the Airam sector by this time: the shipyard Calenz. The Super Star Destroyer Vengeance, accompanied by the Star Destroyer Rage, attacked the shipyard directly. Not even the valiant efforts of Rogue and Green Squadrons, the Calamari Cruiser Liberty and an Airam suicidal armada could prevent the destruction of Calenz at the Battle of Nocto, but despite the hefty blow to its Airam sector infrastructure, the Rebel fleet did succeed in destroying the last remnants of Task Force Vengeance, including the titular Star Dreadnought, and killing Admiral Senn."}, {"tag": "h4", "text": "Rogue Squadron's exploits (3 ABY)"}, {"tag": "p", "text": "Rogue Squadron's daring operations during the Galactic Civil War became the stuff of legend. Following the Subjugation of Bespin, the Rebel Alliance set out to save any Rebel prisoners from the Battle of Hoth. Rogue Squadron besieged a small Imperial detention facility in the Maw system, freeing all captives. A distress transmission was intercepted coming from a group of captive scientists from a Bakura orbiting detention facility. Besieging the center, Rogue Squadron lost a group of scientists who were abducted by a rogue escort carrier. After being tracked to Geonosis, the attacker revealed himself to be Sarkli, a former Rebel. During the ensuring battle, he and Wedge Antilles ended up on the planet's surface. He was thought dead after Antilles shot his LAAT gunship down."}, {"tag": "p", "text": "Rogue Squadron provided air support to Rebel SpecForces during a raid on Bespin just prior to the Battle of Endor. The battle raged both in the air and on the floating settlements of the gas-giant, starting at the de-facto capital of Cloud City, and moving outwards across the various gas-refineries as the Rebels continued to gain ground. A point of confusion during the battle was the use of cloud cars on both sides, which led to several incidents of friendly fire. Wedge Antilles and Rogue Squadron attacked with their primary objective being to secure as many Tibanna gas platforms as possible. After destroying a large majority of the Empire's control systems, the squadron provided aerial support for those fighting on the ground, by disabling the city's power generators, which in turn deactivated the Imperial turbolasers, gun turrets, and communications. After the combined effort of the SpecForce and Rogue Squadron, the SpecForce moved on to capture the main Imperial mining platform. The Rebel forces landed and secured the gas extractor, and pushed the Imperials back to the other side of the platform. The Rebel forces moved in and captured the Imperial docks and landing platforms, trapping them in the main command center. Y-wings bombed the building, X-wings destroyed starfighters before they could lift off, and the enemy numbers dwindled. Teams of SpecForce soldiers moved in on the command building and secured it."}, {"tag": "p", "text": "When the Rebels discovered that prisoners taken from the Battle of Hoth were being held at Bakura, the Alliance sent Rogue Squadron to rescue them. After further prisoner rescue, a TIE Fighter disabled Hobbie Klivian's X-wing, sending him crashing on the surface of the planet. Wedge journeyed down onto the planet in a stolen TIE Bomber to pick him up. However, hundreds of Bakuran heavy missile batteries littered the surface. Using his bomber's lock on concussion missiles, Wedge managed to break through the defenses and saved Hobbie. Upon arrival back in orbit, he noticed that debris littered the area. Crix Madine informed him that an Imperial vessel made off with a batch of scientists and destroyed the rest of the transports, and it seemed he was headed toward Geonosis."}, {"tag": "p", "text": "The Rebellion managed to steal an Imperial TIE Hunter in order to destroy an Executor-class Star Dreadnought. The plan was to use an empty rebel transport and have ram it into one of the shield generator command deck. The Empire found out the transport was a decoy and sent TIE Fighters to destroy it but did not succeed. The frigate Redemption and several other squadrons, and two CR90 corvettes arrived to cover the attack on the generator. The generator was deactivated by Wedge Antilles' ion cannons, but he abandoned his TIE for a more stable A-wing interceptor. Antilles destroyed the shield generator and destroyed the Super Star Destroyer. Though this was a clear victory, the Emperor believed it would make the Rebels overconfident in the upcoming battles, thinking ahead to his plan to trap the Rebels at Endor."}, {"tag": "h4", "text": "Rescue of Han Solo (3-4 ABY)"}, {"tag": "p", "text": "The Rebel Alliance fought a small campaign to recover Han Solo, who after his capture on Cloud City remained imprisoned in carbonite for nearly a year between 3 and 4 ABY. The smuggler Dash Rendar confronted IG-88 on Ord Mantell and learned the whereabouts of Boba Fett, who had Han Solo as a captive; he was repairing his ship on Gall. Fett, the Rebels and the Empire engaged in the Battle of Gall as Luke Skywalker led the attempt to rescue Solo. Rogue Squadron and Rendar attacked the Fett on the moon. However, this rescue mission was confounded by the presence of an Imperial Enclave, with two Star Destroyers on patrol. Despite the piloting skills of the Rogues and Rendar, the Imperial numbers were too great and Fett escaped."}, {"tag": "p", "text": "Fett had to deal with other attacks by envious bounty hunters seeking to claim the money on Solo's head before he arrived at Tatooine to deliver Solo to Jabba the Hutt. Consequently, Luke Skywalker and Leia Organa planned what would be their final rescue attempt. The first phase had Lando Calrissian infiltrate Jabba's Palace, disguised as the guard Tamtel Skreej, as a contingency should anything go wrong. The second phase involved sending R2-D2 and C-3PO to the palace to peacefully offer Jabba the opportunity to release Han, with the droids themselves as a gift. When this failed, phase three involved Leia, posing as the bounty hunter Boushh, delivering a supposedly-captured Chewbacca to Jabba for a bounty. Leia would have then freed Han in the night, released Chewbacca and escaped with them and Lando. When Jabba saw through the attempted rescue and captured all three (excluding Lando, who remained in disguise), they were forced to move to the final phase. Luke Skywalker entered the palace and, by means of several Force techniques made his way to Jabba's throne room. He underestimated Jabba however and, after killing Jabba's pet rancor, wound up captured and sentenced to death in the gullet of the sarlacc, along with Han and Chewbacca."}, {"tag": "p", "text": "Luke, Han and Chewbacca were taken to the Great Pit of Carkoon in the Dune Sea. They were transported on a desert skiff while Jabba and his minions traveled on Khetanna, Jabba's luxury sail barge. Once there, Luke was able to free himself with the help of R2-D2, and after a pitched struggle that saw the destruction of Jabba and his criminal empire, as well as the supposed demise of Boba Fett, Luke, Leia, Han, Chewbacca, Lando, and the droids escaped unharmed and made their way back to the Rebel fleet."}, {"tag": "h3", "text": "Alliance Triumphant (3-4 ABY)"}, {"tag": "h4", "text": "The Second Death Star"}, {"tag": "p", "text": "After the destruction of the first Death Star, Palpatine ordered a new one to be designed, Bevel Lemelisk, the chief designer, removed the thermal exhaust port in favor of millions of millimeter-wide channels to disperse heat, eliminating the fatal flaw present in its predecessor. Additionally, the Second Death Star was vastly larger than its predecessor, and powerful enough to reduce its firing cycle to once every three minutes, allowing it to target capital ships. Once completed, the new battlestation would be almost invincible."}, {"tag": "p", "text": "However, since Despayre had been destroyed as the first Death Star's test, another isolated planetary body was needed as a construction site; Brenn Tantor, a General in the Imperial Army, was ordered to scout out a new world for the Empire to occupy for construction of a secret project. Tantor settled on Endor, the forested moon of a gas giant in the isolated, backwater Moddell sector, and led a light scout force to the planet's moon. However, the mission went astray from the start; native Ewoks assaulted the scout force. Tantor was reluctant to engage, as he did not know if they were indeed hostile or just nervous natives defending their territory. But Tantor was overruled by his superior, Grand General Malcor Brashin, and Tantor eliminated the Ewok threat and secured a site for Imperial engineers that would serve as the shield generator of the Death Star II and base for the Empire. Subsequently, an obscure hyperlane known as the Silvestri Trace was expanded at huge expense to create the Sanctuary Pipeline, a corridor for supply and construction ships to begin the development of the Second Death Star."}, {"tag": "h4", "text": "The road to Endor (3-4 ABY)"}, {"tag": "p", "text": "Emperor Palpatine intended the Second Death Star to be more than a symbol of the Tarkin Doctrine. Since Yavin, the Galactic Civil War had been a disaster for the Rebel Alliance, and a year after Hoth, the Rebels were still trying to regroup. Palpatine conceived the Second Death Star as part of a colossal trap to draw Admiral Ackbar's fleet into a final, decisive confrontation where it could be destroyed. Historians later remarked that had it not been for the disaster of the Battle of Hoth, the Rebels might not have been so desperate as to risk everything for a decisive battle at Endor."}, {"tag": "p", "text": "Palpatine deliberately leaked information about the Second Death Star to the Bothan Spynet through the Black Sun criminal organization. The Bothans learned that the Death Star II plans were being secretly transported on a freighter, the Suprosa. Commander Luke Skywalker, along with the smuggler Dash Rendar, traveled to Bothawui and met their contact Koth Melan in 3.5 ABY to train the Bothan's Blue Squadron to intercept the freighter. The Rebels intercepted the freighter, which was heavily armed, and lost six ships in the raid. Skywalker disabled the freighter, and Rendar boarded and took the data core containing the plans. The plans were then brought to the Bothan colony Kothlis."}, {"tag": "p", "text": "After a battle at Kothlis, the plans were smuggled offworld to Alliance Command, confirming the battlestation's existence but resulting in the deaths of many Bothans. The Rebels additionally learned that the Emperor himself would be overseeing the final construction of the Death Star. After an attempt by Renegade Squadron to ambush Palpatine on Korriban failed, the Rebel Alliance saw this as an immense opportunity to deal the Empire a mortal blow."}, {"tag": "p", "text": "As a preliminary to the battle, the Rebels aimed at stealing the Lambda-class Imperial Shuttle Tydirium to allow a strike team to infiltrate Endor and disable the Death Star's protective shield. General Madine, after their initial attempt at stealing the Tydirium backfired and resulted in it being confiscated by the Imperials, ordered Wedge Antilles to go to the Imperial Academy on Prefsbelt IV and steal the shuttle. Wedge neutralized/evaded all the Imperial scanners and made his way to the Imperial airbase. Wedge infiltrated the base and stole the Imperial Shuttle. He blew his cover at the shuttle's hangar, and later made a rendezvous with reinforcements who escorted the stolen Tydirium to safety."}, {"tag": "p", "text": "In the meantime, Death Squadron, reinforced to a strength of nearly thirty Star Destroyers, assembled at Endor to await the Rebel attack. Elsewhere the Empire assembled massive invasion fleets on the borders of Mon Calamari space and Mon Mothma's homeworld of Chandrila. Palpatine planned to smash Ackbar's fleet at Endor between the Death Star and Death Squadron while his fleets fixed the Mon Cals and Chandrila in place. Once the Death Star was completed, it would move to these worlds and destroy them to finally end the Rebellion."}, {"tag": "h4", "text": "The Battle of Endor (4 ABY)"}, {"tag": "p", "text": "After freeing Han Solo on Tatooine, Luke Skywalker, Leia Organa, Chewbacca, and Lando Calrissian (along with the droids R2-D2 and C-3PO) met up with the Rebel Alliance near the system of Sullust. The Rebels were amassing their entire fleet for the strike on the Second Death Star. Admiral Gial Ackbar along with General Crix Madine developed the plans for the battle: The Death Star was protected by a planetary shield generated from the forest moon of Endor. Han Solo, Chewbacca, Leia Organa, Luke Skywalker, R2-D2, and C-3PO led an expedition in the Tydirium to disable the shield and allow the attack to occur. Once on Endor however, Luke turned himself in to Darth Vader, his father, hoping to rescue him from the clutches of the Emperor and the dark side of the Force. Meanwhile, the Endor strike team was intercepted by Tempest Force, and the Alliance Fleet was trapped in space between the Death Star and Death Squadron, which had hidden in wait on the far side of Endor."}, {"tag": "p", "text": "Vader took Skywalker aboard the uncompleted Death Star and before the Emperor, who attempted to lure him to the Dark Side by placing him in combat with Vader, whom he defeated. However, instead of killing Vader, he renounced the Dark Side by declaring himself a Jedi, like his father before him. Palpatine then attempted to kill him with a shower of deadly Force lightning, but Darth Vader, becoming Anakin Skywalker once again, threw him into a reactor core shaft, killing the Emperor. Palpatine's spirit survived, however, and fled to his secure redoubt of Byss in the Deep Core, where it began a period of rebirth into a new clone body. On the Forest Moon, the Rebels managed to deactivate the shield by destroying the entire shield bunker with sequencer charges. The Battle of Endor led to the destruction of the Death Star, although Skywalker escaped with Anakin's body. Grand Admiral Nial Declann was killed when the Death Star was destroyed as he used battle meditation to direct the Imperial fleet, throwing the fleet into disarray. Admiral Firmus Piett died when the Executor was destroyed, while Grand Admiral Osvald Teshik unsuccessfully attempted to rally the fleet and fought on alone before being captured by the Rebels. He would later be executed by the New Republic for war crimes. Meanwhile, the ranking officer, Captain Gilad Pellaeon of the Star Destroyer Chimaera, ordered a retreat to Annaj. Despite this tremendous Rebel victory however, many long years would go by before the Galactic Empire truly surrendered."}, {"tag": "h3", "text": "After Endor (4 ABY)"}, {"tag": "h4", "text": "The Empire fragments"}, {"tag": "p", "text": "Following the Rebel Alliance's victory at the Battle of Endor and the death of Emperor Palpatine and Darth Vader, riots and uprisings took place on a multitude of Imperial-held worlds, as the news spread across the galaxy. Even Palpatine's homeworld of Naboo could not escape a liberation struggle. On Coruscant, billions reveled in their newfound freedom, and riots broke out from the non-Human-dominated sectors in which all Imperial patrols were attacked in the streets, statues of Palpatine were toppled and other Imperial symbols were desecrated."}, {"tag": "p", "text": "In the midst of all the celebrating and rioting, Imperial authorities ordered a massive crackdown on the rebellious elements in the city-planet's population and gave full power to the local military force to end the uprising and restore order to the system. The military retaliation was horrendous and the death-tolls rose as the Empire struck down the insurrectionists and brought the populace back under its control. Following this, Grand Vizier Sate Pestage assumed the title of Galactic Emperor and established control over Coruscant."}, {"tag": "p", "text": "However, Emperor Palpatine's death provoked a crisis of leadership within the Empire: Palpatine had never laid down a succession plan, and various members of the Inner Circle opposed Pestage's reign. He would later be betrayed by the Director of Imperial Intelligence Ysanne Isard. Meanwhile, Death Squadron regrouped and repaired at Annaj, the capital of the Moddell sector, and its remaining leadership fell to debating the next course of action. Gilad Pellaeon urged a return to Endor: three-quarters of the Rebel fleet holding position at the moon was in urgent need of repairs and he believed that despite their losses, Death Squadron remained powerful enough to overcome them. Pellaeon was countermanded by Admiral Blitzer Harrsk, who regarded Pellaeon's tactical command as nullified with the end of the battle. Command now belonged to Admiral Adye Prittick, who dithered for so long over what decision to make that Harrsk chose to break with the fleet, taking the battlecruiser Ilthmar's Fist and five Star Destroyers into the Deep Core until a clear chain of command could be established. Further defections to the Elrood sector left Death Squadron with just twelve Star Destroyers, a force that Prittick judged too small to guarantee victory. He ordered a withdrawal to Yag'Dhul to guard against a strike into the Core Worlds."}, {"tag": "p", "text": "Wary of further Rebel strikes against key targets, Sate Pestage and the Ruling Council adopted a fortress world strategy, fortifying key systems. This left the Rebellion, swiftly reconstituted as the Alliance of Free Planets, largely unopposed. Additionally, this defensive strategy caused many of the Empire's most ambitious Moffs and governors to think only of the safety of their homeworlds and power bases, causing them to de facto break with the Ruling Council and become the first warlords. Grand Moff Zsinj fortified his holdings in the Quelii Oversector. Tarkin's successor as the governor of Oversector Outer, Ardus Kaine, abandoned much of the Outer Rim to defend the New Territories in the north quadrant of the galaxy, forming the isolationist Pentastar Alignment around his homeworld of Sartinaynian. From Centares, Admiral Treuten Teradoc carved out the Greater Maldrood. Admiral Sander Delvardus proclaimed himself \"Superior General\" and established the Eriadu Authority, seeking to secure the Rimma Trade Route up to Yag'Dhul. Moff Par Lankin established his own fiefdom in the Lambda sector. In the Corellian sector, Grand Admiral Danetta Pitta bribed the diktat into appointing him \"Protector\" of the sector in preparation for a move against Coruscant. Utoxx Prentioch and Gaen Drommel fortified their home sectors of Sombure and Oplovis, while in the Deep Core, Harrsk established Zero Command."}, {"tag": "p", "text": "The Loyalist rump of the Imperial Starfleet that remained under Coruscant's control was led by capable officers like Betl Oxtroe, Uther Kermen, Gilad Pellaeon and Soontir Fel. Kermen commanded the entire fleet, which in practice was loyal to him rather than the Ruling Council. Pellaeon was a popular and respected officer but never considered himself a candidate for leadership, seeing his role as being that as a steward of the fleet. Fel was one of the Empire's greatest starfighter aces, a propaganda hero and a legend within the Empire. Fel's popularity and stature was such that, as the Galactic Empire's military situation deteriorated after Endor, Ysanne Isard began to suspect that a conspiracy of naval commanders was prepared to offer Fel the Imperial throne to replace her and Pestage."}, {"tag": "p", "text": "Wary of re-unifying the disintegrating Empire, the Alliance of Free Planets opted for diplomacy over military action to win over sectors. Bothawui and Dac declared themselves for the Alliance, as did representatives from Corellia, Duro, Kashyyyk, Sullust and Elom. Others, like Herglic Space and the Tapani sector and the Freeworlds Territory declared independence or neutrality, which the Alliance respected. A decisive moment was Mon Mothma issuing the Defense Declarations, which proclaimed the Alliance's intent to devolve control of the Planetary Security Forces, nationalized by the Empire, back to the sectors. Admiral Ackbar would later describe the Declarations as more decisive in delivering worlds from the Empire than any military campaign: members of the new government would be expected to support the common military, but could also now control their own planetary defense forces and at greater strength than under the Empire or the Republic. Imperial loyalist sectors dismissed the measure as illegal, but for others the Declarations caused many sectors that had been on the edge to side with the New Republic. Other sectors divided over whether to accept the Declarations, fomenting further warlordism and infighting and significantly reducing the number of enemies the Alliance had to fight."}, {"tag": "h4", "text": "The Ssi-ruuvi invasion"}, {"tag": "p", "text": "The Alliance's diplomatic approach was driven by the need to confront three new unexpected enemies that had arrived from the Unknown Regions. Just one day after the Battle of Endor, an Imperial Emissary Droid Ship arrived in the Forest Moon carrying a message from the Imperial outpost of Bakura, which was under attack by an unknown species from the Unknown Regions. In the chaos following the Emperor's death, no Imperial troops were available to come to its aid. In response, Mon Mothma gathered a small Rebel fleet to come to the defense of Bakura. Thus, Luke Skywalker was named the commander of a fleet of five Corellian gunships, one modified bulk cruiser Flurry, 20 starfighters, and the Millennium Falcon. Upon arriving, they discovered that the attackers were an unknown reptilian species called the Ssi-ruuk. The Ssi-ruuk practiced entechment, which involved transferring the life energies of a captive into a battle droid, starship or computer."}, {"tag": "p", "text": "At Bakura, the Rebel fleet signed a truce with the local Imperial garrison under Wilek Nereus. On the Ssi-ruuvi flagship Shriwirr, Admiral Ivpikkis prepared for battle. One of his officers owned a brainwashed Force-sensitive Human slave named Dev Sibwarra, who sensed the presence of Luke and alerted his masters. The Ssi-ruuk had intended to use his Force abilities to entech beings by proxy. To do this, Dev Sibwarra secretly contacted the Imperial governor Nereus and offered to leave Bakura alone if they handed Skywalker over. Skywalker was captured by the Ssi-ruuk and brought to a laboratory where they intended to entech him. However, he broke free and together with Dev Sibwarra, the duo defeated the Ssi-ruuk aboard the ship. The Ssi-ruuk abandoned the Shriwirr rather than face the Jedi Knight in battle and it was captured by the Rebel forces. The Ssi-ruuk were defeated, and then the Imperial Commander Pter Thanas, under orders from Nereus, turned the turbolaser batteries of his flagship Dominant on the Rebel Alliance ship Flurry, destroying it along with several Rebel starfighters. The Bakuran resistance cells, however, under leadership of Eppie Belden, overthrew their Imperial rulers. The Imperial garrison on Bakura surrendered to the Rebel Alliance and Bakura became a member of the fledgling Alliance of Free Planets. New Republic Intelligence later referred to the battle as the \"Bakura Incident\", and believed that it would be best if the New Republic attempted to prevent widespread public knowledge of the Ssi-ruuk - advice that was taken controversially at best."}, {"tag": "p", "text": "The Alliance sent a fleet consisting of Nebulon-B frigates and other smaller vessels under the captured Shriwirr which had been renamed Sibwarra into the Ssi-ruuk Star Cluster to counterattack. There, they discovered that the Ssi-ruuk had been attacked by an unknown foe, later revealed to be the Chiss Ascendancy. During an assault on the Ssi-ruuvi capital of Lwhekk, the Alliance fleet engaged Ivpikkis's fleet though both sides eventually reached a standstill. Seeing a weakened foe, the fleet retreated and assisted in the liberation of Clak'dor VII. It would be until years later during the the Yuuzhan Vong War that the Ssi-ruuk resurfaced."}, {"tag": "h4", "text": "The Nagai and the Tofs"}, {"tag": "p", "text": "Following the Ssi-Ruuk came the Nagai, fleeing from the satellite galaxy Companion Besh, known to them as Firefist. The Nagai invaded the galaxy's southern quadrant, assisted by stormtroopers loyal to the cyborg Dark Side Adept Lumiya. They secured a forward base at Kinooine before moving on to Terminus to gain access to the Hydian Way and the Corellian Trade Spine. The Nagai had an advantage in their navigation computers, which were far faster at calculating hyperspace jumps than standard galactic computers and utilized tachyonic observational sensors to map realspace hazards and landmarks much more efficiently than Imperial technology. Consequently, they were able to launch distant raids on Endor, Trenwyth and Kabray, and even reach as far as Iskalon, Mandalore and Zeltros."}, {"tag": "p", "text": "The Alliance of Free Planets prepared for war with the Nagai, but soon discovered that they were in fact fleeing another alien race, the Tofs. The Tofs had subjugated the Nagai in Firefist for centuries and had pursued them to the galaxy. The Tofs under Prince Sereno established a base at Saijo after devastating the surrounding sector, pursued the Nagai to Trenwyth and then tracked them to Zeltros, where they were defeated by a joint force of Alliance, Nagai, Zeltrons and Mandalorians under the command of Fenn Shysa. Concurrently, Luke Skywalker and the Alliance Star Destroyer Emancipator raided Saijo and captured Prince Sereno. These two battles ended the invasion and the Nagai left the galaxy to reclaim their homeworld."}, {"tag": "h3", "text": "The advance of the New Republic (4-6 ABY)"}, {"tag": "h4", "text": "The Republic strategy"}, {"tag": "p", "text": "One month after Endor, the Alliance of Free Planets reorganized and issued the Declaration of a New Republic, proclaiming a new galactic government to replace the Empire. The document was signed by Mon Mothma, Leia Organa, Borsk Fey'lya, and Admiral Ackbar, as well as representatives from Corellia, Duro, Kashyyyk, Sullust and Elom. These nine beings comprised the New Republic Provisional Council, with Mon Mothma being elected Chief Councilor. The expulsion of the Ssi-ruuvi, Nagai and Tof invasions had reassured citizens that the former Rebellion could defend the galaxy and legitimized the new government. Meanwhile, the New Republic's military leaders met on Dac to plan the invasion of the Galactic Empire."}, {"tag": "p", "text": "The campaigns against the Ssi-ruuk, the Nagai, and the Tofs had stretched the Alliance of Free Planets to the breaking point, so the New Republic would not make any overt military moves until nearly six months after Endor. Instead, they consolidated their holdings and won over hundreds of planets through diplomacy. News of Palpatine's death caused many worlds in the Rim territories to defect to the New Republic. Rogue Squadron acted as scouts, escorts and negotiators in this period. The nascent New Republic already had a number of advantages: the Empire had been split by both the Defense Declarations and warlordism, Ardus Kaine's powerful Pentastar Alignment remained isolationist, and the New Republic Intelligence Service's Shadow Operations under the command of Airen Cracken worked to exacerbate tensions within the Empire through sabotage, disinformation and assassination."}, {"tag": "p", "text": "To avoid re-unifying the Empire against a common enemy, Admiral Ackbar planned to isolate and marginalize the weaker Imperial warlords while Mon Mothma continued the campaign of diplomacy. Ackbar split his navy into four fleets: the First Fleet under the command of Admiral Firmus Nantz operated out of Saijo in the Western Reaches; the Second Fleet under Admiral Hiram Drayson defended the New Republic's redoubt in the Calamari sector; the Third Fleet operated out of Bothan Space into the Slice under Ackbar's personal command; and the Fouth Fleet under Admiral Voon Massa operated from Bothawui along the Corellian Run as a mobile reserve for the First and Third Fleets."}, {"tag": "h4", "text": "The early moves (4 ABY)"}, {"tag": "p", "text": "Moving from Saijo, Nantz' First Fleet moved against Delvardus and Prentioch. Nantz sent Lando's Commandos under the command of General Calrissian to liberate Bespin and then engage the Eiattu pirates at the Battle of Abraxas. The victory at the Abraxas system kept Prentioch fixed within his territories around Bomis Koori IV and separated him from Delvardus' Eriadu Authority. Meanwhile, General Tyr Taskeen defeated Delvardus at the Battle of Glova, which prevented him from linking up with Imperial forces Rimward in the Elrood and Minos sectors. With Delvardus and Prentioch contained, Nantz skirmished with Prentioch at Kriselist before bypassing him and securing a new forward base at Moorja. First Fleet then moved Spinward via Bannistar Station to Glom Tho, where it began the Hevvrol Sector Campaign against Par Lankin. The Battle of Glom Tho saw the capture of several key manufacturing facilities by Taskeen's forces and successfully isolated the Lambda sector, which held out until 8 ABY before it surrendered. From Glom Tho, Nantz captured Kalarba. Meanwhile, Voon Massa's Fourth Fleet moved from Bothawui to the key industrial world of Druckenwell, before moving up the Corellian Run to link up with the First Fleet."}, {"tag": "p", "text": "Emboldened by their successes, Ackbar's Third Fleet moved to liberate Kashyyyk: the planet was at the crossroads of six major hyperspace routes that could support a strike into the Core, and Moff Hindane Darcc had made a deal with Trandoshan leader Pekt to eliminate the Wookiee population of the planet. Han Solo and Chewbacca inserted on to Kashyyyk to stop Darcc and fought a campaign by both land and sea to destroy Imperial communications jammers. After destroying the signal jammers they sent a transmission to the New Republic, which was received by Lando Calrissian, before ascending to the Avatar Orbital Platform above Kashyyyk, where they managed to kill Moff Darcc and Pekt. In orbit, meanwhile, Ackbar's Third Fleet squared off with and destroyed an Imperial fleet under Grand Admiral Peccati Syn."}, {"tag": "h4", "text": "The Battle of Brentaal IV (4 ABY)"}, {"tag": "p", "text": "From Kashyyyk, Rogue Squadron moved via Base Delta-Nine at Recopia to attack Brentaal IV, the crossroads of the Hydian Way and the Perlemian Trade Route. The Battle of Brentaal IV was a propaganda struggle by both the Republic and the Empire: nine months after Endor, the New Republic needed to show its hand in the Core while Sate Pestage and the Imperial Ruling Council needed to show that the Empire was still powerful after the loss at Endor. However, the machinations of Ysanne Isard and the incompetence of Admiral Lon Isoto meant that Brentaal was lost to the New Republic and the TIE fighter ace Baron Soontir Fel was captured by the Rogues. On Coruscant, Pestage's position collapsed and he began secret negotiations with the New Republic, offering them Coruscant in exchange for immunity. Isard exposed his dealings and Pestage was forced to flee to the Ciutric Hegemony. Isard, meanwhile, proclaimed herself Empress and massacred much of the Ruling Council. An effort by Rogue Squadron to rescue Pestage from Ciutric IV failed and the former Grand Vizier was murdered by Delak Krennel."}, {"tag": "h4", "text": "The Hast Raid (4 ABY)"}, {"tag": "p", "text": "4 ABY was not as successful for the New Republic Second Fleet. Hiram Drayson and his three Mon Calamari subordinates, Kalback, Nammo and Ragab won an initial battle at Emmer and isolated the fortress world of Makem Te, but their plans for a push down the Hydian Way were derailed by an Imperial raid on the secret Hast Shipyards. Admiral Llon Banjeer destroyed or damaged more than thirty New Republic capital ships in the raid, halting New Republic plans for attacks on Zsinj and Teradoc. Concurrent to the New Republic's operations was the Yevethan Uprising, where Yevetha slaves seized the Black Fifteen shipyards over N'zoth and massacred or enslaved the Imperial crew. The newly-armed Yevetha would emerge from the Koornacht Cluster twelve years later in the Black Fleet Crisis."}, {"tag": "h4", "text": "Milagro and Trioculus (5 ABY)"}, {"tag": "p", "text": "5 ABY began with Massa's Fourth Fleet pushing up the Corellian Run and engaging in the three-month Milagro campaign, which ended when Imperial Admiral Uther Kermen launched a Base Delta Zero operation on the planet to deny its manufacturing facilities to the New Republic. Kerman regrouped at Spirana before raiding Milagro again, where Mon Mothma was meeting Fourth Fleet's commanders and establishing a new headquarters. Massa successfully repelled the raid and counterattacked, seizing Spirana and gaining a foothold in the Inner Rim. For his conduct in the defense of the Milagro system, Luke Skywalker was promoted to the rank of General."}, {"tag": "p", "text": "In the north, Admiral Drayson's Second Fleet sortied in an effort to stop the Stenax people slaughtering Imperial military personnel and civilians alike in the Thanium Worlds, the Gordian Reach, and the Spadja sector. The Stenax Massacres were halted by the Second Fleet at the Battle of Tharkos, though only after the loss of millions of lives."}, {"tag": "p", "text": "5 ABY was also marked by the Trioculus affair, in which the self-proclaimed Central Committee of Grand Moffs led by Bertroff Hissa attempted to pass off the three-eyed mutant Human Trioculus as Emperor Palpatine's illegitimate son in an effort to wrest power away from Empress Ysanne Isard. The scheme was in fact a sham orchestrated from afar by Darth Sidious, who used it to distract from his period of rebirth into a clone body on Byss. Trioculus' Empire ultimately fell apart owing to infighting with the false Supreme Prophet \"Kadann\" and ended with Trioculus' assassination by a New Republic Human replica droid disguised as Princess Leia. The crisis also saw the deaths of Grand Admirals Danetta Pitta and Josef Grunger, whose fleets suffered mutual annihilation at the Battle of Tralus, where Grunger attempted to claim the system for the Central Committee in preparation for a drive towards Coruscant, while Grand Admirals Miltin Takel and Rufaan Tigellinus had been executed by Trioculus after falling afoul of the Committee. The Grand Moffs involved in the conspiracy were executed, strengthening Isard's position as head of the Empire."}, {"tag": "h4", "text": "The Battle of Mindor (5 ABY)"}, {"tag": "p", "text": "The same year saw the Third Fleet, detached to the command of Kalback and Willham Burke, move from Kashyyyk against Warlord Teradoc. The Third Fleet halted an advance by Teradoc at Togoria and secured Lantillies and Contruum, gaining the New Republic a beachhead on the Perlemian Trade Route. Burke then pursued Admiral Ledre Okins' fleet along the Perlemian Trade Route, eventually defeating him at the Battle of Colla and opening the way to the New Republic salient at Brentaal."}, {"tag": "p", "text": "However, Kalback's attempt to drive up the Hydian Way was halted at the Battle of Corsin, where Warlord Zsinj's Star Dreadnought Iron Fist drove him into retreat. Kalback regrouped at Obroa-skai, where he joined forces with General Luke Skywalker's Rapid Response Task Force to eliminate the forces of Lord Shadowspawn, whose TIE Defenders had been launching damaging raids from Mindor into the Inner Rim, Expansion Region and Mid Rim. The Battle of Mindor was a protracted and bloody series of engagements that left thousands dead, including Kalback, despite the New Republic's eventual victory. The casualties prompted Skywalker to resign from the New Republic Army and concentrate on the restoration of the Jedi Order."}, {"tag": "h4", "text": "The Delvardus campaign (5 ABY)"}, {"tag": "p", "text": "Elswhere, Firmus Nantz' First Fleet moved from Moorja to capture Yag'Dhul, before moving on to Thyferra and liberating Cilpar and Mrlsst and opening negotiations with the Herglics, who had declared themselves neutral. Behind his lines in the Outer Rim, a desperate Warlord Delvardus attempted to break out with an attack on Sullust, but was defeated by First Fleet elements under the command of Captain Sien Sovv. With his Coreward front secure, Nantz sent a task force back down the Rimma Trade Route to counterattack Delvardus."}, {"tag": "p", "text": "The Delvardus campaign rapidly collapsed the borders of the Eriadu Authority with rapid attacks on Sanrafsix, Kabal, Sluis Van and Clak'dor VII (the task force here reinforced by the fleet ordered to return from Lwhekk after pursuing the Ssi-ruuk). Delvardus fled to the Imperial redoubt in the Deep Core, though Eriadu itself would not surrender to the New Republic until 9 ABY. The rapid campaign provided a needed boost to Republic morale after the attritional slogs of Milagro and Mindor."}, {"tag": "h4", "text": "Consolidation (6 ABY)"}, {"tag": "p", "text": "In 6 ABY, the New Republic consolidated its holdings. Nantz attacked and captured Prentioch at the Siege of Bomis Koori and eliminated his dominion, securing the entire Western Reaches. The Fourth Fleet captured Denon in a fierce battle that saw the death of Admiral Massa, advancing the Corellian Run front to the edge of the Colonies. From Kashyyyk, Admiral Ackbar led Third Fleet in the capture of Reytha, which forced the Empire to abandon Gyndine and Cyrillia. Ackbar then moved the encircle the Core, moving north up the Hydian Way to push back Zsinj and cut Coruscant off from the Imperial Loyalist systems in the New Territories and the Pentastar Alignment. Third Fleet won battles at Uviuy Exen and Drearia, but Admiral Ragab was halted by Zsinj's Raptors at the Battle of Paqualis."}, {"tag": "p", "text": "Ackbar switched his advance to Palanhi in preparation for an advance on Coruscant down the Namadii Corridor. Admiral Nammo aboard the Defiance was sent to capture the Bilbringi Shipyards secure the Republic's Rimward flank against the Imperial Loyalists in the north, but he was defeated by Admiral Teren Rogriss and Turr Phennir's 181st Imperial Fighter Group. As the year drew to a close, the New Republic had succeeded in keeping the Pentastar Alignment isolated, had marginalized Teradoc, and had driven up to the Core Worlds. However, Isard still held a number of significant Core fortress worlds in addition to Coruscant, among them Kuat and Balmorra, and Zsinj had emerged as a dangerous opponent."}, {"tag": "h4", "text": "The fall of Coruscant (6 ABY)"}, {"tag": "p", "text": "By the middle of 6 ABY, the New Republic had encircled the Core Worlds and was finally in a position to seize Coruscant from Imperial rule. The New Republic realized the importance of Coruscant beyond its mere designation as \"000\" in galactic charts. The planet was the most densely-populated ecumenopolis in the galaxy and controlled two of the galaxy's five most heavily-trafficked super-hyperroutes. Possession of the system would massively increase the New Republic's legitimacy."}, {"tag": "p", "text": "To this end, the New Republic began a complex campaign aimed at isolating Coruscant. Rogue Squadron moved to a new base on the uninhabited world of Talasea. There they were to being operations as a feint to draw the Empire away from Admiral Ackbar's true target, the Colonies world Borleias. En route to Talasea Base, however, Rogue Squadron was coincidentally pulled out of hyperspace in the Chorax system by an Interdictor cruiser. The resulting battle allowed the Empire to identify the X-wings as belonging to Rogue Squadron, and the Imperial Intelligence agent Kirtan Loor was tasked to locate and destroy the Squadron. Loor tracked Rogue Squadron to Talasea, and the Squadron only survived the subsequent Imperial raid on the planet thanks to Admiral Devlia's incompetence. Rogue Squadron was relocated to Noquivzor after a retaliatory raid that killed Devlia at Vladet."}, {"tag": "p", "text": "From Noquivzor, the New Republic advanced on Borleias. However, the First Battle of Borleias was a disaster: General Evir Derricote had secretly installed a much stronger deflector shield that rendered General Laryn Kre'fey's orbital bombardment of the planet ineffective, and the New Republic lost numerous starfighters and two capital ships before the Y-wings of Defender Wing allowed them to retreat. Miscommunication between Kirtan Loor and Ysanne Isard however, meant that the Imperial defenses were not as strong as they could have been: Loor mistakenly believed that Isard was aware of his conclusions that Borleias would be used as a stepping-stone to Coruscant by the New Republic after she ordered him to the planet, and so did not share that information with her (in fact, Isard had only sent Loor to spy on Derricote with the aim of seeing whether he could be of use in her Krytos virus project). Consequently, the New Republic force escaped total destruction."}, {"tag": "p", "text": "Following a feint at the Imperial missile production facility in the Venjagga system several weeks later, the New Republic at last captured the planet in the Second Battle of Borleias, allowing them to assault Coruscant directly. Before the invasion could begin, however, Coruscant's powerful planetary shield would have to be disabled. Wedge Antilles and Rogue Squadron were sent undercover into Imperial City to sabotage the shield generator. The Squadron decided that if they could condense a large amount of water and create a super storm, they could destroy the energy shield protecting Coruscant with lightning strikes. The Rogue operatives hijacked a construction droid to take them to the command building, where they took remote control of one of the orbiting solar mirrors. The tightly-focused light beam from the mirror rapidly boiled one of the planet's reservoirs, which caused a huge storm and the shields soon collapsed. With the shields down, a New Republic force led by Admiral Ackbar entered the Coruscant system. This task force easily overwhelmed the small Imperial defense force, since Ysanne Isard kept only a few Imperial-class Star Destroyers to defend the capital world. Very soon, Coruscant was in the hands of the New Republic."}, {"tag": "p", "text": "However, Isard was not to be found in the Imperial Palace. Worse, the planet's alien population was being killed by an artificial pathogen called the Krytos virus. The virus was Isard's final attempt to undermine the leadership of the New Republic. Isard fled to the bacta-producing world of Thyferra and supported a coup to be elected Head of State, allowing her to control the bacta supply and undermine the New Republic government's attempts to treat the Krytos plague."}, {"tag": "h3", "text": "Warlordism (7-8 ABY)"}, {"tag": "h4", "text": "The Bacta War (7 ABY)"}, {"tag": "p", "text": "The New Republic government found itself caught in a double-bind over Thyferra: Isard controlled the bacta supply needed to treat the Krytos virus, but it felt that it could not depose an elected planetary leader. Consequently, Wedge Antilles led the pilots of Rogue Squadron in resigning from the New Republic fleet, and they made it their goal to capture Isard and destroy her Star Dreadnought Lusankya. Though ostensibly conducting a private war against Isard, the New Republic Intelligence Service led by Airen Cracken was sympathetic and supported Rogue Squadron throughout their campaign."}, {"tag": "p", "text": "Based out of Yag'Dhul and enlisting the aid of the smugglers Booster Terrik and Talon Karrde, Rogue Squadron began raiding Isard's bacta convoys. The Rogues destroyed one of Isard's capital ships in the Alderaan Graveyard and convinced the captain of another to defect. Enraged, Isard resolved to counterattack at Yag'Dhul with the Lusankya, but was driven off by the threat of a massive proton torpedo attack. However, the torpedoes were in fact aboard the starfighters of Rogue Squadron heading to Thyferra, where the Rogues and the Lusankya fought a meeting engagement. At the Battle of Thyferra, the Lusankya was crippled by eighty proton torpedoes and was forced to surrender with the arrival of Booster Terrick aboard the captured Star Destroyer."}, {"tag": "p", "text": "Isard was believed killed when her escape shuttle was destroyed. However, Isard in fact engineered the incident to cover her tracks. She spent the next few years in hiding and putting herself together mentally and would not strike again until after the Thrawn campaign. With the New Republic's capture of the galaxy's bacta supply allowed it to resume effective treatment of the Krytos virus, and the Vratix of Thyferra successfully combined bacta with ryll kor spice to create a cure for the virus. The Lusankya was interned by the New Republic military. Rogue Squadron returned to Coruscant as heroes and were allowed to return to the New Republic military. After much wrangling, Booster Terrick was allowed to retain his captured Star Destroyer, which he renamed the Errant Venture and established as a mobile trading bazaar."}, {"tag": "h4", "text": "The Hunt for Zsinj (7 ABY)"}, {"tag": "p", "text": "With the Bacta War over and Isard believed dead, a new strategic geography emerged in 7 ABY that would define the rest of the Civil War. In the Northern Dependencies beyond the Colonies, Loyalist systems were controlled from Orinda by a reconstituted Ruling Council led by Ars Dangor and the few surviving Imperial Advisors that had escaped Coruscant. This stretch of territory became known as Imperial Space. Within this territory was Ardus Kaine's isolationist Pentastar Alignment, whose otherwise-powerful military based around the Star Dreadnought Reaper remained within its borders. On the Perlemian Trade Route stretching from Centares to the borders of Hutt Space was Warlord Teradoc's Greater Maldrood. Beyond these territories were isolated Imperial fortress worlds like Carida and Eriadu that had long-since been encircled by the New Republic."}, {"tag": "p", "text": "In 7 ABY, the Imperial Admiral Betl Oxtroe made secret entreaties to the New Republic in the hope of establishing a compromise peace. Oxtroe proposed to raise Emperor Palpatine's distant grand-niece, the 11-year-old Ederlathh Pallopides, as a figurehead constitutional monarch. In exchange for an amnesty to the Imperial Military, the New Republic Provisional Council would govern the galaxy in her name. The Republic proved receptive and talks began in earnest, but collapsed when Oxtroe was assassinated, apparently by a Noghri. The New Republic later speculated that Oxtroe was murdered on the orders of Grand Admiral Thrawn, still establishing his power base in the Unknown Regions in preparation for his return to the galaxy proper. With Oxtroe's death, the war continued."}, {"tag": "p", "text": "Between Imperial Space and the Greater Maldrood was Zsinj's Empire, which stretched along the Hydian Way from the Inner Rim to the Corporate Sector. The eccentric former Grand Moff affected the white uniform of a Grand Admiral and a handlebar mustache that led many in the New Republic to dismiss him as a buffoon. However, he possessed a powerful military built around the Super Star Destroyer Iron Fist and his elite units, the Raptors, had already halted New Republic incursions into his territory. After the capture of Coruscant, many Imperials saw him as the best hope for an Imperial resurgence."}, {"tag": "p", "text": "Commanding the Solo Fleet aboard the Mon Remonda, Han Solo and Wedge Antilles probed the borders of Zsinj's empire. A series of defeats at the hands of the Solo Fleet and Wraith Squadron slowly discredited Zsinj in the eyes of Imperial Loyalists, and the warlord became increasingly erratic and self-centered. In an effort to obtain a new Super Star Destroyer, the Razor's Kiss, Zsinj raided Kuat. However, Kuat was still an Imperial Loyalist world, and the raid incensed the Galactic Empire outside Zsinj's territory."}, {"tag": "p", "text": "In a attempt to destroy Zsinj, therefore, the New Republic made a loose alliance with the Empire's Admiral Teren Rogriss, slowly chipping away at Zsinj's territory. The campaign also brought the Hapes Consortium out of isolation, with the Chume'da Isolder lending aid in the hopes of winning Princess Leia Organa's hand in marriage. During the Battle of Dathomir the New Republic won and Zsinj was killed by Han Solo. Shortly thereafter, Organa married Solo. Despite this, Isolder and the Hapes Cluster entered into a limited alliance with the New Republic."}, {"tag": "h4", "text": "After Zsinj (8 ABY)"}, {"tag": "p", "text": "Though his reign lasted a mere four years, Zsinj's death had widespread repercussions. The greatest single threat to the New Republic was eliminated, but Zsinj's death also left the Empire free to return their focus to the New Republic. Even worse, Zsinj's forces remained active, but lacked direction. Much of his fleet was claimed by a number of independent warlords. In the fighting that followed, Treuten Teradoc attempted to claim Zsinj's former territory in the Gordian Reach, but was defeated by Ackbar at the Maridun and Thanos. Teradoc and his holdings in the Mid Rim were rescued by his younger brother Kosh, who set about joining what remained of the Greater Maldrood and his Deep Core holdings into the \"Federated Teradoc Union\". The disgraced elder Teradoc, meanwhile, fled into the Deep Core, where he entered into the service of the recovering Emperor Palpatine. Admiral Rogriss, meanwhile, expanded Imperial Space up to the Hydian Way."}, {"tag": "p", "text": "In the campaigns, the New Republic lost a significant portion of their military forces. Crynyd, Rebel Dream, and other Star Destroyers were either destroyed or recaptured by the Empire. The New Republic took Kuat, but the yards were heavily damaged and rife with Imperial partisans. Furthermore, the New Republic lost the core KDY design team when they leapt to the Deep Core with the half-completed Star Dreadnought Eclipse. Eventually, Rogriss and the Imperial forces began to back down from fighting the New Republic, and Teradoc and other warlords retreated into their pocket empires. Within a year from Zsinj's defeat, the galactic situation was more stable, with the New Republic in nominal control of three-quarters of the known galaxy. The stage was set for the next great conflict, and the re-emergence of the last Grand Admiral."}, {"tag": "h3", "text": "The Empire in Resurgence (9-11 ABY)"}, {"tag": "h4", "text": "The Thrawn Campaign (9 ABY)"}, {"tag": "p", "text": "Following Zsinj's defeat, Anaxes, the \"Defender of the Core\" and the site of the Navy War College surrendered to the New Republic after Admiral Feyet Kiez fled the system with the Star Dreadnought Whelm. Kiez had received orders from the reborn Palpatine to join him in the Deep Core, but the New Republic was as-yet unaware of Kiez's destination. Nevertheless, the loss of Anaxes badly-damaged Imperial hopes of reconquest. Imperial Space had been pushed back to a bare quarter of its former territory. Additionally, as the Empire lost ground, its sources of crewmen dried up. Instead of Academy graduates, Loyalist officers like Captain Gilad Pellaeon had to make do with recruits trained on the job, and were even forced to order conscription raids to press men into service."}, {"tag": "p", "text": "However, the New Republic was not in a much better state. During the relentless battles after Zsinj's death the Empire and the New Republic had both suffered appalling fleet losses. With the Kuat shipyards almost completely destroyed by KDY itself, both sides were forced to either capture each other's ships or rely on lesser, overstretched shipyards. Given the scale of the fighting and the Empire's ever increasing fragmentation, a speedy recovery for either was unlikely any time soon and fleet sizes on both sides were incredibly finely-balanced. Consequently, by the end of 8 ABY, Mon Mothma ordered a suspension of New Republic operations in order to rebuild its forces, entrench the government and integrate its territories. Imperial Space was poorly-developed economically, and she was content to let a strategy of economics slowly win over systems. Thus, the Empire continued to hold its territories beyond the Hydian Way in the New Territories, while Zsinj's former empire between the Hydian and the Perlemian Trade Route became a region of divided loyalties known as the Borderland Regions. Meanwhile, the New Republic occupied a salient along the Celanon Spur from Ord Mantell captured during the post–Zsinj campaigns, and nominally controlled the galaxy south of the Perlemian. However, many of these systems had yet to return representatives to Coruscant and the New Republic's authority was largely theoretical beyond the major trade routes. For a brief time, an uneasy peace existed."}, {"tag": "p", "text": "In 9 ABY, however, approximately two years after the capture of Coruscant, reports started to reach the New Republic of a Grand Admiral commanding the Imperial fleet. This man was Mitth'raw'nuruodo, a Chiss better known by his core name, Thrawn. Returning from the Unknown Regions, Thrawn had taken control of the Galactic Empire, and started a new campaign against the New Republic."}, {"tag": "p", "text": "Raising his flag on the Star Destroyer Chimaera, Thrawn took the popular and respected Captain Gilad Pellaeon as his second-in-command. Ars Dangor's Ruling Council on Orinda gave him the nominal position of Supreme Commander, but in reality the Council and the Moffs hoarded military assets as much in fear of each other as the New Republic. The force truly available to Thrawn consisted only of the dozen Star Destroyers still remaining in Death Squadron after the defeat at Endor, which he split into two fleets: a fleet of six Star Destroyers led by the Chimaera under his personal command, and a second force of six ships led by Captain Dorja aboard the Relentless."}, {"tag": "p", "text": "Thrawn's plan to defeat the Republic needed three things, the locations of which were provided by a raid on the library world of Obroa-skai. The raid gave Thrawn the location of Wayland, a trophy planet for Palpatine. Arriving on Wayland after a side trip to Myrkr, Thrawn was confronted by Joruus C'baoth, a clone of the Jedi Master Jorus C'baoth. Protected by Force-blocking ysalamiri taken from Myrkyr, Thrawn persuaded C'baoth to help him by promising C'baoth the Force-sensitive Skywalker twins, along with Leia's soon-to-be-born twins. On Wayland, Thrawn found an array of Spaarti cloning cylinders taken from Cartao during the Clone Wars. Using the ysalamiri, Thrawn was able to counteract the Force-induced \"clone madness\" inherent in any clone grown in less than a year. Consequently, Thrawn was able to greatly swell the numbers of troops available to him by creating new clones in a matter of days."}, {"tag": "p", "text": "Thrawn's first strike against the Republic were the shipyards at Sluis Van. Using stolen mole miners cloaked using a cloaking shield found at Wayland, Thrawn attempted to steal the capital ships in drydock. He was prevented by the timely intervention of Lando Calrissian and Luke Skywalker. Thrawn, however, planned for his loss at Sluis Van: though he did not have the warships, they were also denied to the New Republic, and through Imperial Intelligence, he planted data that incriminated Admiral Ackbar in leaking secrets to the Empire, leading to Ackbar's removal from command. This led his political rival, Borsk Fey'lya to take control of the government, polarizing the Senate and stalling a large-scale response to Grand Admiral Thrawn. In fact, Thrawn was relying on Delta Source, a Clone Wars-era audio surveillance system in the Imperial Palace installed in ch'hala trees to gain inside information."}, {"tag": "p", "text": "Meanwhile, Noghri Commando teams were ordered by Grand Admiral Thrawn to capture Leia Organa Solo for C'baoth. A failed raid on Kashyyyk led to the capture of one of the Noghri, who identified Leia as the heir of Darth Vader. After traveling to Honoghr, the Noghri homeworld, she exposed the Imperial attempts to keep the planet environmentally damaged, leading the Noghri to become supporters of the New Republic."}, {"tag": "p", "text": "With the government stalled and polarized, Luke Skywalker and Han Solo discovered Thrawn's new scheme to acquire ships: he planned to locate the Katana fleet a 200-ship strong force lost since before the Clone Wars. Solo and Skywalker led an unofficial mission to capture the Katana fleet before Thrawn. During the search, Solo and Calrissian met with the former Rebel leader Garm Bel Iblis, who had located a number of Dreadnaughts from the fleet several years previously. When the location of the Katana fleet was found, a small Republic force was sent to capture it. They met an Imperial force which had already taken the majority of the Dreadnaughts. However, with the help of Bel Iblis and Talon Karrde, the Republic force managed to escape. The battle, however, revealed the source of Thrawn's forces, and the revelation that Thrawn was using a clone army changed the Republic's first priority in the war - find Thrawn's cloning facility."}, {"tag": "p", "text": "The New Republic was unable to mount such a mission, however: Thrawn's capture of the Katana fleet had tilted the balance of fleet power in favor of the Empire, and his continued attacks on Republic worlds, such as the agricultural world of Ukio and the base at Ord Pardron, kept their fleets busy. These strikes culminated in a space battle over the New Republic capital, Coruscant. Using cloaked asteroids, Thrawn effectively kept the city-world under siege, thus crippling the New Republic. To defend the capital, Garm Bel Iblis was convinced to at last reconcile with Mon Mothma and returned to a leadership position in the New Republic military."}, {"tag": "p", "text": "Thrawn's campaign totally reversed the strategic geography of the Galactic Civil War, forcing the New Republic to adopt a fortress world strategy, with rapid reaction fleets deployed to defend Coruscant, Bothawui, Kashyyyk and Mon Calamari. Desperate for a victory, the New Republic organized a plan to end the siege of Coruscant - the capture of a CGT array from the Imperial shipyard of Bilbringi."}, {"tag": "p", "text": "Meanwhile, the search for the source of the clone army was held by Luke Skywalker. He found help in Talon Karrde, who organized the Smuggler's Alliance to help track down the source. The information didn't come from the work of Skywalker or Karrde, but from the knowledge of Mara Jade, former Emperor's Hand. When the location of Wayland was discovered, Luke Skywalker, Han Solo, Lando Calrissian and Mara Jade led an expedition that ended with the destruction of the cloning center and the defeat of Joruus C'baoth."}, {"tag": "p", "text": "The Battle of Bilbringi started badly for the Republic, with Interdictor cruisers pulling the Republic forces out of hyperspace. Help arrived in the Smuggler's Alliance, who aided the New Republic in the battle. Republic forces had just breached the shipyard when Grand Admiral Thrawn was killed by his Noghri bodyguard, Rukh. Captain Pellaeon, once again leader of the Imperial forces, ordered his second retreat."}, {"tag": "h4", "text": "The return of Palpatine (10-11 ABY)"}, {"tag": "p", "text": "After the death of Thrawn the New Republic Provisional Council decided to make a quick move against local warlords to show that they had not been as hamstrung by the Grand Admiral as might have appeared. Ackbar occupied the Imperial Ruling Council's capital of Orinda and struck at Delak Krennel of the Ciutric Hegemony. A New Republic force led by Rogue Squadron liberated the Hegemony and killed Krennel."}, {"tag": "p", "text": "With the New Republic Defense Fleet far out in the Outer Rim, however, the Core Worlds were left lightly defended. Meanwhile, the reborn Emperor Palpatine had been gathering his forces and in 10 ABY, the surviving Imperial warlords, assembled by Palpatine and encouraged by what Grand Admiral Thrawn had so recently accomplished with so little and in such a short time, agreed to organize under the Imperial Ruling Council for an offensive thrust into the Galactic Core. The New Republic could not match multiple attacks out of the Deep Core, led by twelve Star Dreadnoughts (including the missing Whelm), against which they had no counter. Subsequent attacks out of the New Territories by the re-unified Outer Rim Empire on Anaxes and Borleias collapsed the New Republic's defenses, and after a short, decisive campaign the Empire had retaken the former Imperial Center in the Second Battle of Coruscant. The New Republic government fled to Da Soocha V in Hutt Space."}, {"tag": "p", "text": "Having taken Coruscant, the Ruling Council decided the time had come to assemble a new Imperial Senate that would serve the Galactic Emperor. The governors, Moffs, and Grand Moffs agreed but with the requirement that they too would be granted seats in the Senate and that their votes would be weighted for the number of worlds they controlled. The Councilors, however, refused as this would in effect decentralize power and share it among local rulers. Matters quickly fell apart. The Imperial military sought to take power itself but a split between the Army and the Navy occurred. The latter insisted that it alone could choose a new Supreme Commander. Then the bureaucrats and COMPNOR attempted a coup, claiming that any change to the New Order would invalidate the Empire's existence. The ISB and Imperial Intelligence, in turn, embarked on a campaign of assassinations against each other. The Dark Side Adepts alone kept out of this inter-factional maneuvering."}, {"tag": "p", "text": "An armed conflict that became known as the Imperial Civil War soon broke out amongst the various Imperial factions on Coruscant. It laid much of the planet to waste and ended only when the reborn Emperor Palpatine declared his return several months later. While most of the rank-and-file returned to loyal service, few of the warlords did likewise. Most instead chose to flee for their lives as the Emperor was not expected to take kindly to their usurping of his throne. Palpatine may even have encouraged this internecine conflict through his use of the Dark side of the Force to remove powerful opponents, publicly referring to the Civil War as \"culling the weak\". The New Republic involved itself by stirring up regional hatred with attacks using captured Imperial starships on rival factions. It was on one of these missions that Luke Skywalker was swept up in a powerful Force storm, which brought him to the Deep Core world of Byss. It was there where Skywalker met the man whose demise led to the Rebellion's victory at Endor— the resurrected Emperor Palpatine."}, {"tag": "h4", "text": "Operation Shadow Hand (10-11 ABY)"}, {"tag": "p", "text": "Faced with a resurrected Emperor, Skywalker decided to do what many had tried in the past - to destroy the dark side from within. He agreed to become the Supreme Commander of the Imperial Fleet, and lead the new attack on the Republic. Using new weaponry, such as the World Devastators and the Eclipse-class dreadnought, the Empire attacked the temporary Republic capital-world of Dac. Skywalker attempted to sabotage the Imperial war effort from his position as Supreme Commander, smuggling the command codes of the World Devastators to the New Republic, thus enabling them to shut the otherwise-invincible machines down. Soon however, Skywalker found himself unable to free himself from the grasp of the Emperor. It was only with the help of his sister, Leia Organa Solo, that Luke Skywalker managed to free himself over the moon of Da Soocha V. The Skywalker twins then defeated the Emperor, turning the Emperor's Force storm against himself, destroying both him and his flagship, the Eclipse."}, {"tag": "p", "text": "Although Luke Skywalker was once again working with the New Republic, Palpatine was reborn in another clone body in 11 ABY. Imperial forces under the command of Executor Sedriss, a Dark Side Adept, invaded the planet of Balmorra, an important Imperial factory world sympathetic with the Republic. This battle was fought to a stalemate, and persuading the Governor of Balmorra to aid the New Republic, if only in secret. Sedriss also invaded the planet of Ossus, but was beaten by the indigenous Ysanna aided by Luke Skywalker and Kam Solusar. Sedriss himself was killed by the Neti Ood Bnar, who had survived in his tree-like form since the time of Exar Kun."}, {"tag": "p", "text": "In response to the near-continuous attacks by the Empire, the New Republic devised a counterattack on the Emperor's throne world of Byss. Using X-1 Viper Droids given to them by the Governor of Balmorra, they would attack the Emperor's Citadel. The battle on the planet started well for the Republic, with the Vipers destroying almost all Imperial opposition. Only the arrival of rancors mutated by Sith alchemy turned the tide of the battle against the Republic. The surviving Republic forces were quickly extracted off-planet by smugglers friendly to the Republic. In retaliation for this Rebel attack, Palpatine unleashed his newest superweapon, the Galaxy Gun. Capable of firing hyperspace-capable missiles that were capable of destroying an entire planet, Palpatine used the Galaxy Gun to destroy Da Soocha V."}, {"tag": "h4", "text": "Palpatine's final defeat (11 ABY)"}, {"tag": "p", "text": "With the new Galaxy Gun, Palpatine was able to force many more planets to submit to Imperial Rule. Yet despite his growing Empire, Palpatine's power in the dark side was slowly causing his mind to degenerate. Faced by the increasing insanity of their Emperor, a cabal composed of the Emperor's physician and the traitorous Royal Guard Carnor Jax, who wished to become Emperor in Palpatine's stead, poisoned the genetic material used to make Palpatine's clone bodies. Faced with this situation, Palpatine traveled to Korriban to consult the spirits of the Sith Lords there, who advised him to enter the body of Leia Organa Solo's newest son, Anakin."}, {"tag": "p", "text": "Palpatine brought his newest flagship, Eclipse II to the planet of Onderon to capture Anakin Solo. When the flagship engaged New Republic forces over Onderon, a team of Jedi led by Luke Skywalker boarded the ship to find the Emperor, but were too late, as the Emperor had already traveled to the surface of the planet to find Anakin. However, Lando Calrissian and R2-D2 had hijacked the hyperspace controls for the flagship, and sent it to the same co-ordinates as the Galaxy Gun over Byss. When the Eclipse II left hyperspace, the two superweapons collided, and the Galaxy Gun's final missile was pulled into Byss by the planet's own gravity, leading to its destruction."}, {"tag": "p", "text": "On the surface of Onderon, Palpatine battled with Leia Organa Solo over her son, Anakin. The arrival of Luke Skywalker with two other Jedi, Rayf Ysanna and Empatojayos Brand, eased Leia's burden, but Palpatine continued to better the Jedi, mortally wounding Ysanna and Brand. Palpatine was not defeated by either of the Skywalker twins however, but by Han Solo, who shot Palpatine in the back. Still, it was not over for Palpatine. As his last clone body died, his spirit flew towards Anakin Solo's body. However, the fatally-wounded Empatojayos Brand jumped in front of Anakin, shielding him from Palpatine. As Brand became one with the Force, he dragged down Palpatine's spirit with him into the depths of the Force. Palpatine, leader of the Empire, Dark Lord of the Sith, and scourge of the galaxy, was finally dead."}, {"tag": "h3", "text": "After Palpatine (11-14 ABY)"}, {"tag": "h4", "text": "The Crimson Empire and the Council of Blood (11 ABY)"}, {"tag": "p", "text": "Because the resurgent Empire had made no attempt at governance, most planets in occupied territory immediately announced their allegiance to the New Republic after the destruction of Byss and the final death of Palpatine. The New Republic quickly re-occupied the Core as the Emperor's fleets once again fell to infighting, and announced plans to rebuild the ruined surface of Coruscant. Elsewhere, however, Imperial control remained strong in the northern quadrant. Though Ardus Kaine had died in Operation Shadow Hand, the Pentastar Alignment remained, and it was around this core of territory, in a band stretching from Pantolomin in the Colonies to Birgis in the Outer Rim, that the traitorous Royal Guard Carnor Jax established his Crimson Empire."}, {"tag": "p", "text": "With the Empire's fleets shredded by the Imperial Civil War and the Deep Core reverting to warlordism, the Crimson Empire represented the only Imperial territory still answerable to central Imperial control: the Imperial Interim Ruling Council, nicknamed the \"Council of Blood\", was established and Carnor Jax proclaimed himself ruler of the Empire and head of the Council. Ruling from Ord Cantrell, Jax's council consisted of a number of alien members, a first for the traditionally anti-alien Empire, though racial prejudices still dominated. This allowed Jax to maintain isolated holdings in various galactic quadrants, as well as his core of territory in the north that included Qiilura, the Kol Huro system, Celanon, and the D'Astan sector, which gave him the support of the influential D'Asta family and the galaxy's largest private fleet."}, {"tag": "p", "text": "The Crimson Empire faced New Republic attack almost immediately, with the Super Star Destroyer Lusankya reactivated to strike at the empire's western flank and defeating Jax at Phaeda. In order to maintain his rule, Jax ordered his stormtroopers to kill all remaining members of the Royal Guards. One guard managed to escape, Kir Kanos, who was utterly sickened by the treachery of his fellow Guardsman and the Imperial Ruling Council. Carnor Jax used all his strength and resources to track down Kanos. On the planet Yinchorr, Jax managed to find Kanos. When they met, the former men of Palpatine's Royal Guard began to duel. Kanos won, killing Jax, and removed his helmet, saying he was not fit to wear it."}, {"tag": "p", "text": "After the battle Kanos was on the move again, as Black Sun was trying to sabotage the Council. A member of the council, Xandel Carivus, decided to disband the council and rule as Emperor alone. Carvius was soon killed by Kanos, and he eliminated the Council that had engineered the death of his Emperor soon afterwards."}, {"tag": "h4", "text": "Renewed warlordism (11-12 ABY)"}, {"tag": "p", "text": "Utter collapse of Imperial authority followed in the aftermath of Carvius' death. The warlords formed allegiances with several Deep Core planets and carved out personal fiefdoms there. Only the New Republic's relative weakness as it rebuilt its navy in the aftermath of Operation Shadow Hand prevented it from launching a campaign that could have swept away the Empire's Rim holdings for good. Consequently, the New Republic left most of the Imperial fortress worlds alone, believing that a lack of trade would force their surrender."}, {"tag": "p", "text": "Loyalist officers like Gilad Pellaeon despaired for the state of the Empire - Pellaeon had privately believed the Empire to be doomed with Thrawn's death. With no significant Empire left for him to serve, Pellaeon, now a Vice Admiral, took his own task force into the Deep Core to join Treuten Teradoc, who had the largest warlord fleet, and hoped that things would remain stable and secure in Teradoc's fleet until some sort of leadership emerged to unify the Empire's scraps. In the meantime, the warlords wasted their forces in petty quarrels in the heart of the galaxy."}, {"tag": "p", "text": "In 11 ABY, Admiral Natasi Daala emerged from the Maw after years of seclusion there. At Wilhuff Tarkin's orders, she had remained behind at the Imperial weapons research facility at Maw Installation when he departed for the Death Star, and had remained totally cut off from contact with the galaxy. Discovering only then that the Empire was no more, she launched a savage, vengeful campaign against the New Republic, despite possessing a bare three Star Destroyers. She attacked Dantooine and Dac before retreating into the Cauldron Nebula."}, {"tag": "p", "text": "The New Republic was distracted in its response to Daala by the machinations of Ambassador Furgan of the Imperial fortress world of Carida, one of the few Loyalist Core planets left. Furgan poisoned Mon Mothma to destabilize the Republic and attacked Anoth in an effort to kidnap the infant Anakin Solo to groom him as a new Emperor, though was unsuccessful. Additionally, the New Republic's military leadership was decapitated when Admiral Ackbar resigned in disgrace after it appeared that a piloting error had led him to crash his B-wing on Vortex, destroying the Cathedral of Winds and killing countless Vors. He returned to service after Leia Organa Solo retrieved evidence that Furgan had sabotaged his craft, and he led the defense against Daala at Dac. Worse still was the rampage of Kyp Durron, a student at Luke Skywalker's new Jedi Praxeum on Yavin 4 driven to the dark side by the spirit of the long-dead Sith Lord Exar Kun. Durron stole the Sun Crusher, a supernova-inducing superweapon from Admiral Daala and carved a swath of destruction through the Empire, ruining Daala's campaign by destroying the Cauldron Nebula, but killing billions of innocents as well. Durron's campaign came to an end when he destroyed the Carida system, destroying a significant Imperial training academy but killing his brother Zeth in the process. Overcome with remorse, Durron was induced to return to the light side of the Force, and participated in a New Republic attack on the Maw Installation to destroy the Sun Crusher and the other prototype superweapons stored there. Defeated, Daala escaped into the Deep Core aboard her sole remaining Star Destroyer, Gorgon."}, {"tag": "p", "text": "The next year saw the Ismaren plot, a complex plan by the former Emperor's Hand Roganda Ismaren and her son Irek to revitalize the Empire. Using a subelectronic converter in Irek's brain, Ismaren was able to use her son's strength in the Force to take control of the Eye of Palpatine, a battlemoon that had been one of the Galactic Empire's earliest superweapons and had lain dormant in the Moonflower Nebula since 18 BBY. Approaching the nobles of the Senex-Juvex, Ismaren presented Irek as Emperor Palpatine's son, and hoped to use both the Eye and their support to reclaim control of the galaxy. However, the plot was foiled when Luke Skywalker and his two Jedi students Cray Mingla and Nichos Marr destroyed the Eye of Palpatine over Belsavis, in the process rescuing the Order 66 survivor Callista Ming from imprisonment aboard the Eye."}, {"tag": "h4", "text": "Imperial Reunification (12 ABY)"}, {"tag": "p", "text": "In the Deep Core, Admiral Daala was revolted by the squabbling warlords she discovered there, and found an ally in Gilad Pellaeon. Following battles at Harrsk and Teradoc's headquarters, Daala forced the thirteen most powerful Imperial warlords to meet at Tsoss Beacon to reunify the Empire in 12 ABY. However, hours of arguing saw the warlords refuse to agree on anything, and a disgusted Daala poisoned them all and proclaimed herself Supreme Commander of the Imperial Fleet. Following the warlords' deaths, Daala took command of their forces and made Pellaeon her second-in-command, consolidating fleets of Victory-class and Imperial-class Star Destroyers, Skipray Blastboats, and even a single Executor-class Star Dreadnought, Knight Hammer, taken from the now-dead \"Superior General\" Delvardus. Additionally, Daala instituted societal reforms in the Imperial military, ending decades of oppression against women and non-humans."}, {"tag": "p", "text": "The Moffs in the New Territories did not formally ally with Daala's United Warlord Fleets, but supported her logistically and financially. However, a successful early campaign was undone by the humiliating defeat at Yavin 4. Seventeen Star Destroyers and the Knight Hammer came out of hyperspace in the system, but despite making a planetary landing, the vanguard was repelled by a wave of force energy focused through Dorsk 81, at the cost of Dorsk's life. Meanwhile, the Knight Hammer was crippled by the Jedi Knight Callista Ming and was lost to the gravity well of Yavin Prime. Following the defeat, Daala resigned her position and gave Vice Admiral Gilad Pellaeon the rank of full Admiral and made him Supreme Commander of the Empire."}, {"tag": "p", "text": "In the aftermath of the disastrous campaign, Pellaeon took the decision to abandon the Deep Core and re-establish the Empire by connecting the fortress worlds in the northern Rim. From the Deep Core armories he successfully recovered two Star Dreadnoughts, the Megador and the Dominion, which he combined with a third, Ardus Kaine's Reaper, recovered from the remnants of the Pentastar Alignment. He pledged this powerful fleet to the defense of the Imperial Rim factions provided they join his \"true Empire\". Many of the Moffs, with fond memories of Pellaeon's mentor Grand Admiral Thrawn, accepted and formed the new Council of Moffs. Thus was established an official \"Imperial Remnant\", though it continued to refer to itself as the Galactic Empire."}, {"tag": "h4", "text": "The Orinda Campaign (12 ABY)"}, {"tag": "p", "text": "A mere six months after Daala's resignation, Pellaeon, now commanding from the bridge of the Reaper, decided to campaign for the conquest of the planet of Orinda in the Mid Rim. The trade world had been one of the New Order's proudest holdings outside the Core and had been the refuge of the Imperial Ruling Council after the fall of Coruscant. However, the planet had been lost to the Empire since the Thrawn campaign, and Pellaeon saw the reconquest of the world as being an effective demonstration of renewed Imperial power."}, {"tag": "p", "text": "Pellaeon and General Turr Phennir struck Orinda and six other systems Coreward along the Entralla Route before digging in at Lonnaw. Pellaeon then offered terms to the New Republic, declaring that he had recaptured a world of great cultural importance to the Empire and offered mutual recognition of borders in exchange for a cessation in hostilities. However, the New Republic panicked with the reappearance of Star Dreadnoughts and saw the offensive as a preliminary to a new Imperial push into the Core Worlds. Coruscant responded by sending a fleet under the command of General Wedge Antilles aboard the Lusankya."}, {"tag": "p", "text": "The New Republic's performance in the subsequent campaign was hampered by political debate within the military over the value of smaller cruisers and starfighters versus larger battleships. After over a month of fighting, these arguments led to the New Republic's defeat at the Battle of Orinda: the fleet carrier Endurance was delayed in launching its E-wings, and was destroyed with the majority of its fighter complement still on board when the Dominion, kept secretly in reserve by Pellaeon, arrived in-system behind six Interdictor cruisers."}, {"tag": "p", "text": "The Orinda campaign secured the Imperial Remnant's southern border for another five years. The performance of the Lusankya and the threat of the Reaper also prompted a change in New Republic military philosophy. Whereas dreadnoughts had previous been considered wasteful, the New Republic now increased the development of new dreadnought-analogues, namely the Mediator-class battle cruiser and the Viscount-class Star Defender."}, {"tag": "h4", "text": "The Borderlands Campaign (13 ABY)"}, {"tag": "p", "text": "After the Orinda campaign, the battle lines along the Mid Rim would come to a stalemate as both sides fortified their acquisitions. Both sides constantly maneuvered for advantage in systems on each other's flanks, a notable action being the celebrated engagement between Rogue Squadron and the 181st Imperial Fighter Group at Adumar, which ultimately saw Adumar join the New Republic and the defection of Imperial Admiral Teren Rogriss."}, {"tag": "p", "text": "That same year, Moff Tol Getelles of the Antemeridian sector allied with Seti Ashgad of Nam Chorios, exiled there by Palpatine before the Clone Wars, to expand his influence into the Meridian sector. The Loronar Corporation sold arms to groups throughout the Meridian sector to foment uprisings while Ashgad promised to unleash a plague against the New Republic to leave the sector open to Getelles' conquest. However, Ashgad was in fact under the influence of Dzym, a hugely-mutated Droch who was using Getelles to spread the Death Seed plague across the galaxy. Luke Skywalker was alerted to the crisis by the plight of the Force-sensitive Tsil crystals, mined by Loronar from Nam Chorios to acted as CCIR matrices for Synthdroids and Needle starfighters. The New Republic defeated Getelles at the Battle of Nam Chorios, with the unexpected assistance of Callista Ming and Admiral Natasi Daala."}, {"tag": "p", "text": "With Getelles chased back to the Antemeridian sector and the Republic moving against the scattered Imperial systems in the Borderland Regions, the Moffs ordered Pellaeon to take the offensive again. The Moffs had been emboldened by the success of the Orinda campaign, but Pellaeon was uncertain. The Imperial Remnant launched a two-pronged attack from Celanon and Botajef, which began well enough with victories at Lucazec and Barison, but they were defeated in the north at Arda, and in the south at Quell, forcing a retreat to Celanon. At the Battle of Celanon, Pellaeon was defeated by Etahn A'baht and the Reaper was destroyed."}, {"tag": "p", "text": "In the aftermath, Pellaeon sought to rebuild the Remnant's defenses and establish a functioning state based on New Order principles. The New Republic chose not to press its advantage and opted to promote commerce in an effort to establish peace. The next five years proved relatively peaceful."}, {"tag": "h4", "text": "The Empire Reborn (12-14 ABY)"}, {"tag": "p", "text": "14 ABY saw the culmination of Lord Hethrir's Empire Reborn movement. Independent of Pellaeon's empire, Hethrir was one of the few surviving Firrerreos, a student of Darth Vader and the former Imperial Procurator of Justice. At Palpatine's order, prior to the Battle of Endor he had massacred his own people and had imprisoned the survivors, including his mate Rillao, aboard twenty-four sleeper ships. He sought to become Emperor in his own right at the head of an organization financed by slavery and powered by the influence of the mysterious Waru. Summoned via forbidden practices using the unique Force circumstances around the crystallizing white dwarf star Crseih, the Waru resembled nothing less than a slab of meat coated in gold scales. The creature was sentient, Force-sensitive and highly intelligent, however, and in exchange for Force-sensitive victims to feed on, Waru would give Hethrir absolute power over the Force, and so the galaxy."}, {"tag": "p", "text": "In pursuit of captives for Waru, Reborn forces planned to assault the Yavin Praxeum. The assault was launched from the Reborn's flagship, Doomgiver, led by Hethrir's chief lieutenants Galak Fyyar and Desann. However, the attack turned into an unmitigated disaster. Kyle Katarn had managed to infiltrate the ship just before it set out from the Cairn Installation. During the hyperspace leap, he confronted Galak Fyyar and killed him. Coming out of hyperspace, he rescued his partner Jan Ors, and alerted Rogue Squadron to the ship's location. Bringing down the shields, he helped the fighter squadron destroy the ship, including many of the full but un-deployed assault ships. What few forces managed to land on Yavin 4 were destroyed and Katarn killed Desann in the Great Temple. This drastically reduced the military forces of the Empire Reborn."}, {"tag": "p", "text": "Even with his two main lieutenants killed, Hethrir was not prepared to give up on his dream; he would just have to resort to more drastic and radical plans. After the Yavin plan failed, Hethrir kidnapped Han and Leia Organa Solo's children while they were on a diplomatic mission to Munto Codru. After the Solo children were kidnapped, Leia along Chewbacca were able to track Hethrir through the Force. They discovered Hethrir's sleeper ships and Rillao, who joined Leia and Chewbacca and led them to the Indexers of Chalcedon, a rival in the slave trade to Hethrir's own based at Crseih Station."}, {"tag": "p", "text": "On Crseih Station, Han Solo and Luke Skywalker were investigating reports of Waru, whom they believed to be a lost Jedi, leaked by con-artist and former acquaintance of Solo, Xaverri. Xaverri had been on the station for a number of years and was deeply concerned about the \"healer\" Waru, and wanted them to investigate. Luke, however, seemed to be taken by the strange being, his judgment and Force ability crippled by the resonance of the nearby crystallizing star. He became distrustful of Han and Xaverri and convinced that he needed Waru's help and healing."}, {"tag": "p", "text": "Arriving at Hethrir's worldcraft Rebirth, Leia, Chewbacca, and Rillao rescued Jacen, Jaina and the other children in the Alderaan. However they were too late to rescue Anakin Solo as Hethrir had already departed for Crseih Station intending to relaunch the Empire Reborn and sacrifice Anakin in the temple of Waru. Leia and her party met up with Luke, Han, and Xaverri at the temple of the Waru. In a grand ceremony surrounded by all his supporters, Lord Hethrir planned to sacrifice Anakin on the altar of Waru. Luke, affected by the nearby crystallizing star, dove into the altar in Anakin's place, forcing Han and Leia to follow. Hethrir, realizing that Luke was a better sacrifice than Anakin anyway, believed his plans were finally coming to fruition. Rillao, however, launched herself onto Hethrir in a furious attack."}, {"tag": "p", "text": "Inside the golden ichor of Waru, Han and Leia manage to draw Luke back, aided by the cries of the Solo children. Enraged by the missed opportunity and Hethrir's failure to fulfill his bargain, Waru consumed Hethrir instead. With Hethrir's Force power the being returned to its home dimension, killing Hethrir and ending the Empire Reborn."}, {"tag": "h3", "text": "Final campaigns (13-19 ABY)"}, {"tag": "h4", "text": "Republic difficulties (13-17 ABY)"}, {"tag": "p", "text": "The period that followed the Orinda campaign and the collapse of the Empire Reborn movement was marked by relative peace between the Galactic Civil War's belligerents. However, the frontier between the two sides, nicknamed \"Thunder Alley\", was subject to ceaseless patrols by the New Republic Defense Fleet. While Admiral Pellaeon assumed control of the Imperial Remnant, both sides faced a string of new threats."}, {"tag": "p", "text": "In 13 ABY, the Imperial Remnant weathered a near-civil war with the appearance of Ennix Devian's \"Restored Empire\" movement. A hyperconservative hardliner dedicated to \"the sacred Restoration of the True Empire of Palpatine\", Devian concocted a complex plot to seize control of the Imperial Remnant. In an effort to restart the Civil War, Devian organized the murder of Imperial and New Republic diplomats conducting peace talks. Pellaeon suspected New Republic betrayal, and his assembly of capital ships in preparation for a counterattack left Orinda poorly-defended, allowing Devian to capture the planet. With the assistance of Ragez D'Asta, however, the Restored Empire's fleet was defeated and the Remnant force sent to attack the New Republic swiftly recalled. Devian himself was killed in single combat with Kir Kanos."}, {"tag": "p", "text": "13 ABY also saw the end of the Federated Teradoc Union with Kosh Teradoc's death at the hands of Wraith Squadron. Ruling what little remained of the Greater Maldrood in the Mid Rim, Kosh had been devastated by his brother's murder by Daala at Tsoss Beacon and was not party to the reunification effort. Wraith Squadron travelled to Ryvester, and with the aid of Mulus Cheems, convinced Teradoc to purchase a supposedly-valuable statue. The piece had in fact been rigged with explosives and it detonated in the vaults below Teradoc's weapons research laboratories, killing the warlord."}, {"tag": "p", "text": "14 ABY saw the Disciples of Ragnos crisis, where a Sith cult calling itself the Disciples of Ragnos, backed by an Imperial Remnant faction and Invisible Market traders, attempted to resurrect the ancient Sith Lord Marka Ragnos. The cult, led by the Dark Jedi Tavion Axmis believed that Ragnos would give them unlimited power and bring the galaxy under their control. Their plans were thwarted, mostly due to the actions of Jedi Knight Jaden Korr, and they were defeated in a battle on Korriban."}, {"tag": "p", "text": "In 16 ABY as the New Republic sought to expand its diplomatic and economic relations, it entered negotiations with the Duskhan League of the Koornacht Cluster, which the local Yevetha had seized from their Imperial taskmasters in 4 ABY. During the meetings, Viceroy Nil Spaar manipulated New Republic politics to sow internal chaos while he initiated the xenocidal Great Purge, ethnically cleansing the entire Koornacht Cluster and completely depopulating worlds like Polneye. When confirmation reached Coruscant, Chief of State Leia Organa Solo extended her executive powers to send New Republic forces into the Cluster. The war in the Koornacht Cluster saw the deployment of the New Republic Defense Force's Fifth Battle Group under General Etahn A'baht, the first fleet to be wholly composed of New Class vessels. Despite Yevethan home advantage, unique thrustship technology and willingness to use civilians as living shields, the New Republic defeated the Yevethan fleet, aided by a group of Imperial military personnel held hostage by the Yevetha. At the conclusion of the Battle of N'zoth, Major Sil Sorannan and the Imperial prisoners seized the Black Fleet ships used by the Yevethan navy and fled into the Deep Core in search of what remained of the Empire."}, {"tag": "p", "text": "On the heels of the Black Fleet Crisis, a pair of Dark Jedi, Kueller and Brakiss, staged the Almanian Uprising in 17 ABY. The two former Jedi Praxeum students overthrew the Je'har ruling caste of Almania. Using the wealthy Brakiss' access to the droid factories of Telti, they planted bombs in droids to kill entire planetary populations, with the aim of sowing chaos so they could seize control of the New Republic. Like the Yevethan plot before them, the Dark Jedi applied pressure to the fragmented political state of the New Republic, using Organa Solo as a wedge to drive the state apart. Their terrorist campaign saw the genocide of the Pydyrians and the bombing of the Senate Hall on Coruscant itself before Luke Skywalker discovered his former student on Almania. However, Kueller captured the weakened Luke and threatened to kill him unless Leia Organa Solo surrendered control of the New Republic. While the plot was foiled by a combination of Jedi and New Republic Defense Force efforts at the Battle of Almania, it succeeded in driving Organa Solo from office, who resigned from her post despite surviving her second Vote of No Confidence."}, {"tag": "h4", "text": "The final Imperial campaign (17 ABY)"}, {"tag": "p", "text": "While the New Republic rebuilt, the Imperial Remnant's Moffs saw the bewildered Republic as ripe for picking. Since the Orinda campaign they had received an injection of forces from the Black Fleet fleeing the Yevetha, among them the prototype Star Destroyer EX-F, renamed the Rakehell. In 17 ABY, the New Republic lifted its ban on former Imperial officials holding elective office. The move was intended as a peace offering, but the Moffs saw it as the prelude to an invasion. The Council of Moffs contacted Admiral Daala, who'd returned to the Deep Core and unified the \"replacement warlords\", ambitious beings who had taken control of what little infrastructure remained after Pellaeon abandoned the Deep Core and replaced the officers Daala had killed at Tsoss Beacon. Daala was convinced to fight, and the Moffs ordered Pellaeon to begin another campaign against the New Republic. Pellaeon thought the plan mad, but hoped to that he could win a few quick victories to satisfy the Moffs before offering peace terms to the New Republic."}, {"tag": "p", "text": "What followed was an unmitigated disaster for the Imperial Remnant. Daala struck out of the Deep Core but her fleet was shattered by Garm Bel Iblis at the Battle of Columus. She was forced into a blind hyperspace jump and thought dead until she re-emerged in 40 ABY. Pellaeon's attack began well: he took Adumar and won surprise attacks on Taris and Champala on the Hydian Way, pushing all the way to the edge of the Core Worlds, but with Daala defeated, Ackbar and Bel Iblis were able to bring the full weight of the New Republic Defense Force to bear."}, {"tag": "p", "text": "The Second Battle of Champala was an Imperial rout. Pellaeon was chased back to Imperial Space, which was rapidly reduced after defeats at Ketaris and Tangrene. Hoping to salvage a victory, Pellaeon deployed his surviving dreadnoughts Dominion and Megador, as well as the Rakehell, at Anx Minor. The Battle of Anx Minor was a disaster, with the Megador and Dominion suffering severe damage in the detonation of the Rakehell's antimatter reservoir. Pellaeon ordered an immediate retreat to Sartinaynian, the last planet to be codenamed \"Bastion\". In mere weeks the Empire had been reduced to a rump of eight Outer Rim sectors with Bastion, Yaga Minor and Muunilinst the only planets of note. It would remain there for another two years before it finally offered surrender terms to the New Republic. The Republic kept the Imperial Remnant bottled up during the Corellian Crisis, and the Empire would never break out again; they were now an overlooked backwater."}, {"tag": "h4", "text": "The Caamas Document Crisis (19 ABY)"}, {"tag": "p", "text": "The Caamas Document Crisis was the final campaign of the Galactic Civil War, and still nearly tore the New Republic apart. In 19 ABY, Gilad Pellaeon approached the Council of Moffs and declared that the Galactic Empire had lost the war, making clear his intention to seek peace terms. In response, a diehard Sinister Triumvirate composed of Moff Vilim Disra, Major Grodin Tierce, and the con artist Flim planned to overturn the peace talks by provoking the Empire to a new campaign. To this end, Flim was disguised with blue skin dye and red contact lenses to make it appear that Grand Admiral Thrawn had returned from the dead."}, {"tag": "p", "text": "Tierce was in fact a clone of the real Major Tierce, who had died in the Thrawn campaign some years earlier, and had been flash-imprinted with Thrawn's memories. With Flim as \"Thrawn\", Disra's knowledge of politics and diplomacy and Tierce's grasp of strategy and tactics, the three believed that they could fake Thrawn's return. Elsewhere, in response to the spreading rumors that Thrawn had returned, Admiral Voss Parck of the Hand of Thrawn, the base of operations Thrawn had established in the Unknown Regions, sent out several Clawcraft to investigate. These were pursued back to Nirauan by Mara Jade and Luke Skywalker."}, {"tag": "p", "text": "Concurrently, datacard recovered from the ruins of Palpatine's Mount Tantiss storehouse on Wayland was discovered to contain a corrupted copy of the Caamas Document: this was a list of names of Bothan saboteurs that had assisted the Empire in collapsing the planetary shields of Caamas in the early years of the Empire, allowing it to exterminate the peaceful Caamasi people in a Base Delta Zero bombardment. A political firestorm erupted throughout the New Republic. After the Triumvirate leaked Thrawn's \"resurrection\" to the rest of the galaxy, the New Republic fell into panic, with planets fortifying, others re-declaring for the Empire, and a new civil war apparently about to begin. The only solution to the crisis was to find a complete copy of the Caamas Document. The smuggler Talon Karrde searched for Jorj Car'das' copy in the Kathol Rift, while Han Solo and Lando Calrissian infiltrated the Imperial archives on Bastion, the location of which was heretofore unknown to the New Republic."}, {"tag": "p", "text": "Disra and Tierce ensured Pellaeon was isolated from the crisis by kidnapping his emissary to the New Republic at Morishim. Consequently, Pellaeon was kept waiting for several weeks at Pesitiin while the New Republic had no idea that he wished to negotiate. Meanwhile, Disra altered the copies of the Caamas Document in the Imperial archives on Bastion and Yaga Minor. in the hopes of intensifying the crisis. On Disra's orders, the Cavrilhu Pirates attacked Pellaeon at Pesitiin to make him believe that the New Republic had betrayed him. However, Pellaeon was unconvinced by the tactics they displayed and concluded that factions within the Remnant were responsible."}, {"tag": "p", "text": "Meanwhile, the New Republic enlisted the aid of the smuggler Booster Terrik for a raid on Yaga Minor to obtain a copy of the Caamas Document. Terrik's vessel, the Imperial-class Star Destroyer Errant Venture, was refitted to impersonate an Imperial vessel, the Tyrannic on the run from a New Republic task force. This task force, led by the Peregrine, would jump out of hyperspace soon after, engaging the base's perimeter defenses. While the Imperials were distracted, a slicer team would be sent in to the orbiting Ubiqtorate station to download the Caamas Document. If the deception was uncovered, the Errant Venture would try to hold off the Imperial forces just long enough to transmit a copy of the document to the New Republic forces in the perimeter and surrender."}, {"tag": "p", "text": "At the very same time, in his disguise as Thrawn, Flim sent three Imperial-class Star Destroyers to the Both system. The lead vessel was the Tyrannic. The Obliterator and the Ironhand were also deployed, together with a few small scout vessels in civilian disguise. All three Star Destroyers were assigned to moor themselves to a comet and lie in wait, with their cloaking devices engaged. When Imperial saboteurs caused a failure in Bothawui's planetary shields and instigated a battle between pro- and anti-Bothan forces in Bothawui orbit, they would then be ready to destroy both fleets and devastate the surface of Bothawui. Soon, over fifty-six vessels had arrived in the Both system, either to threaten or to defend the Bothans over the Caamas Document. This number would quickly increase: by the time of the final battle, the combined pro- and anti-Bothan forces contained nearly two hundred capital ships. The New Republic only had a token force in-system to keep the two fleets apart. A larger New Republic force, commanded by General Garm Bel Iblis, was supposedly near Kothlis, but this force was really massing in the Mrisst system for the raid on Yaga Minor."}, {"tag": "p", "text": "At Yaga Minor, the Triumvirate saw through the Errant Venture's ruse instantly, since the Tyrannic had already been sent to Bothawui. Before they could attack the New Republic force, however, Pellaeon arrived in-system with Talon Karrde, who had learned from Jorj Car'das the truth about Flim and Tierce. Pellaeon exposed Flim as a fraud, killed Tierce and ordered Disra's arrest for treason, stopping the Battle of Yaga Minor from becoming a rout. At Bothawui, Lando Calrissian and the Republic's Chief of State Ponc Gavrisom exposed the three Star Destroyers hiding behind their cloaking devices and acting as agents provocateurs, and the fleet unified and chased them from the system."}, {"tag": "p", "text": "Meanwhile, at the Hand of Thrawn fortress on Nirauan, Voss Parck introduced the captured Luke Skywalker and Mara Jade to the Empire of the Hand, an immense swath of the Unknown Regions that Thrawn had mapped and settled in his service to the Emperor years earlier. Thrawn had told Parck years before that if he died he would return ten years after his death, and unaware that \"Thrawn's\" return was a fraud, Parck now planned to hand over the Hand's considerable territory and resources to Bastion and so restore the Galactic Empire. However, Luke Skywalker and Mara Jade escaped, destroying all spacecraft in the fortress to prevent an emissary being sent to Bastion and fled through the tunnels below. In the bottommost chamber, unknown even to Parck, they found what Thrawn had truly meant when he said he would return: floating inside a single Spaarti cloning cylinder was a fully-grown clone of Mitth'raw'nuruodo. Debating on whether or not to kill the clone, they were set upon by guard droids, and the ensuing fight led to the chamber being flooded with water and destroying the cylinder. Escaping via a stolen Clawcraft, they discovered that R2-D2 had sliced Thrawn's personal archive and downloaded a complete, unaltered copy of the Caamas Document."}, {"tag": "h3", "text": "Bastion Accords (19 ABY)"}, {"tag": "p", "text": "With the Crisis defused, the New Republic and the Imperial Remnant at last began peace negotiations, beginning, inauspiciously enough, at the hologame table of the Millennium Falcon in the Pesitiin system. The resulting peace treaty was signed above Bastion aboard the Star Destroyer Chimaera by the Imperial Remnant's Supreme Commander of the Imperial Fleet, Fleet Admiral Gilad Pellaeon, and the New Republic's Acting Chief of State, Ponc Gavrisom, in 19 ABY, marking the formal end of the Galactic Civil War."}, {"tag": "p", "text": "The Bastion Accords did not outline a surrender of any sort on the side of the Imperial Remnant; it instead put forth terms that would leave what remained of the Galactic Empire intact but with an end of hostilities between the two rival parties. It additionally opened the Imperial Remnant to trade and commerce with the New Republic, and put forth limitations on smuggling for both nations to enforce. The Galactic Civil War was finally over."}, {"tag": "h2", "text": "Legacy of the Galactic Civil War"}, {"tag": "p", "text": "The Rebels formed the New Republic after the Battle of Endor, which eventually encompassed much of the galaxy. It included a new Senate and a more powerful chief executive, the first of which was Mon Mothma. However, it was hampered by both fear of dictatorship and corruption, proving that the Galactic Civil War had not completely succeeded in its quest to restore the Old Republic, but did succeed in other areas, such as promoting democracy and restoring hope."}, {"tag": "p", "text": "A few Imperial bitter-enders refused to recognize the Bastion Accords and conducted a campaign of piracy and guerrilla operations against the New Republic. The New Republic Defense Force fought a low-level campaign against these Imperial holdouts, among them the Deep Core military colony of Prakith, from 19 to around 25 ABY. The most significant of these insurgencies was the Second Imperium Crisis in 23 ABY, a short, small war where a final die-hard faction led by Brakiss rejected the Bastion Accords and attempted to create an army of Dark Jedi aboard the roving Shadow Academy space station. The final expression of the Galactic Empire through violence, the Second Imperium fought only four important battles which were small in comparison to those in the Civil War, and came to a decisive end at the Third Battle of Yavin."}, {"tag": "p", "text": "The New Republic ended with the invasion of the alien Yuuzhan Vong in 25 ABY, where both the incompetence of Chief of State Borsk Fey'lya and the unwillingness of the New Republic Senate to commit to war eventually discredited the Republic's system of governance. It was reorganized into the Galactic Federation of Free Alliances by Cal Omas, which in a way completed the original goals of the Rebel Alliance. In response to the horrifying brutality of the Yuuzhan Vong and inefficiency of the Republic, many in the Imperial Remnant expressed the belief that the Galactic Empire would have been more effective in repelling the invasion. Vana Dorja believed that Emperor Palpatine would have rapidly annihilated the Yuuzhan Vong with overwhelming force, while in 55 ABY Lenang O'Pali wrote that Thrawn and Palpatine were misunderstood heroes for trying to prepare the galaxy to face the invasion, and held the Rebellion to be a tragic mistake that left the galaxy defenseless. It should be noted that both were speaking from highly partisan positions."}, {"tag": "p", "text": "Owing to Luke Skywalker and Mara Jade's mission to Nirauan in the Caamas Document Crisis, the Empire of the Hand, and through it the Chiss Ascendancy, were exposed to the galaxy at large. The Empire of the Hand was believed to be absorbed by the Chiss after the death of Thrawn's clone, and through the Household Phalanx was involved in the Yuuzhan Vong War. However, the Empire still existed in some capacity by 44 ABY as an ally of Jagged Fel."}, {"tag": "p", "text": "A more negative legacy was revealed during the time of the Second Galactic Civil War: since the Defense Declarations of 4 ABY had devolved control of the Planetary Security Forces to the systems, wealthier planets had been seeking ever-larger and more powerful navies that by 37 ABY gave the Galactic Alliance cause for concern. The Sector Defense Limits aimed to limit the scale of the Planetary Security Forces, prickling the pride of Corellia and triggering a Second Corellian Crisis and eventually a Second Galactic Civil War. Another negative legacy was the establishment of the Galactic Alliance Guard, a secret police organization aimed at spying on possible Corellian subversives. Its brutal methods and hard-line views made it comparable in some respects to the Stormtrooper Corps of decades past."}, {"tag": "p", "text": "The damage wrought by the Galactic Civil War, along with the further ravages of the Yuuzhan Vong War, also inspired the Sith Lord Darth Krayt into planning the eventual rise of a new Sith Empire, with himself as Emperor. Krayt believed this would prevent further destabilization of the galaxy like the one he had experienced while growing up."}, {"tag": "h2", "text": "Politics of the Civil War"}, {"tag": "p", "text": "Many different species and planets supported the Rebel Alliance's bid to overthrow the Emperor, including the Mon Calamari and Bail Organa's own home planet of Alderaan. Although early on the Rebels used positions in the Imperial Senate to gain influence and took advantage of the diplomatic immunity provided, the Senate was abolished in 0 BBY and many Rebel Senators were discovered. Mon Mothma, leader of the Rebel Alliance, barely escaped capture by the Imperial Security Bureau, the Empire's ruthless secret police force."}, {"tag": "p", "text": "Unfortunately, planets could only rarely support the Rebellion openly, aside from small (usually uninhabited except by secret rebel bases) planets outside the usual scope of the Empire. Goods had to be produced secretly, either in factories built away from their usual areas or through bureaucratic trickery, although piracy was a common means of funding the Rebellion. Not until around the time of Endor and afterwards, when the Rebellion possessed enough support to challenge the Imperial Navy conventionally, could planets openly declare without fear of orbital razing or a firm put down by ruthless Stormtroopers."}, {"tag": "p", "text": "The Empire continued to erode freedoms during this period, using the conflict as an excuse. Under Tarkin's suggestion, the Emperor mandated the Tarkin Doctrine, which stated that the Empire would use fear of force rather than force itself to control dissent. This culminated in the construction of the first Death Star. Its use at Alderaan was to be one of its only uses; its purpose was to demonstrate Imperial power, not to eliminate countless worlds. The Emperor also began to come under the influence of what became known as his Inner Circle. These men, including the devious Sate Pestage, eventually took control of the day-to-day operations of the Empire. Although evil enough in his own right, Palpatine allowed his bureaucracy to grow exceedingly large and corrupt under the influence of these men."}, {"tag": "h3", "text": "The Alliance and Separatism"}, {"tag": "p", "text": "The memory of the Separatist Crisis and the Clone Wars was one that took a long time to disappear from the minds of the galaxy's citizens. When the New Order was declared in 19 BBY, many in the galaxy were tired of war and disorder, and the fear of the return of Separatism meant that it took seventeen years before Mon Mothma, Bail Organa and Garm Bel Iblis could establish a unified resistance movement. Even in the Declaration of Rebellion, the Rebel Alliance had to couch their criticisms of the Empire as those of Republic Loyalists to avoid accusations of Separatism. Even after the Empire's atrocities were exposed, many chose to stay with the Empire out of fear of disorder."}, {"tag": "p", "text": "Nevertheless, despite the Empire's attempted eradication of Separatist holdouts, many former Separatists came to support the nascent Rebellion, leading to disagreements within the Alliance leadership as to what role they should play. Bel Iblis argued for the acceptance of those Separatists that had not committed war crimes, nothing that other groups seeking regional independence had been accepted by the Rebellion. Organa disagreed, contending that all Alliance members must accept the Rebellion's primary goal of the Republic's restoration. Mon Mothma conceded Bel Iblis' point, but worried that accepting Separatists would be a target for Imperial propaganda."}, {"tag": "p", "text": "Some former Separatists would join the Alliance after publicly disavowing their pasts: the former CIS General Horn Ambigene and his Bryx Freedom Fighters came under the Rebellion as the Bryx Sector Force, though at the cost of the subjugation of the Bryx sector by the Empire. More generally, however, the Rebels and Separatists settled on a policy of tacit acceptance, quiet mutual support, and non-interference. The Neimoidian Trade Defense Force Captain Blox Hatha was refused formal Alliance membership but became a renowned privateer bearing a Rebel letter of marque and reprisal. In the Atravis sector, however, a three-way war broke out between the Alliance, Separatists and the Empire that lasted for years."}, {"tag": "h3", "text": "Inter-species politics"}, {"tag": "p", "text": "Prejudice towards alien species was common under the Human-dominated Galactic Empire. The Inner Council practiced Human High Culture, which denied nonhumans entry into formal Imperial organizations like the government or the military. They were also often the target of exclusionary policies, perhaps as a result of the stigma surrounding the alien-based Confederacy of Independent Systems. Several pro-Human organizations like the Commission for the Protection of the Republic and its chapter SAGroup had also originated on Coruscant and other Human worlds during the Clone Wars."}, {"tag": "p", "text": "Other species were enslaved because of their strength or their talents. Examples of these enslaved species include the Mon Calamari, who were enslaved for their prowess in shipbuilding skills, and the Wookiees of Kashyyyk, who were enslaved for their strength and were used as laborers for various Imperial projects including the Death Star and the Maw Installation. In some cases, sentient aliens had been virtually exterminated by the Empire (infamously, the Empire occasionally used an ecological act permitting the eradication of dangerous species to justify military operations against sentient species)."}, {"tag": "p", "text": "The discrimination against nonhumans encouraged many species to join the Rebel Alliance. Many of the Rebel's strongest supporters were of the alien species who were enslaved by the Empire including the Mon Calamari, the Wookiees and the Sullustans. Two of the Rebel Alliance's greatest heroes—Admiral Ackbar and Chewbacca—had escaped from Imperial slavery. However, the early Rebel Alliance was mostly made up of Humans, and the commanders that led the Rebels into battles against the Empire were almost always Human."}, {"tag": "p", "text": "As the Rebel Alliance grew into the New Republic, more and more species became its allies. There was, however, tensions arising between the Human and alien members of the New Republic. Non-Humans were disappointed at how many of the New Republic's top government positions were given to Humans, notably Mon Mothma and Leia Organa Solo. Many began to suspect that the New Republic was practicing its own form of 'Human High Culture' while many more remembered the prejudice practiced by the Empire. Both Ysanne Isard and Warlord Zsinj tried to exploit these tensions. Ysanne Isard used the Krytos virus - a bio-engineered disease that affected only non-human species - to cause a split within the New Republic between alien species, and the immune humans. Warlord Zsinj started Project Funeral, a brainwashing scheme whose purpose was to cause distrust towards some of the New Republic's trusted non-human species, including Twi'leks, Gotals and Sullustans. However, both schemes were defeated before they achieved the desired effect. Late into the Galactic Civil War, an alien paramilitary group called the Diversity Alliance was formed, whose aim was to eliminate all Humans in the galaxy. Although their public face was as an alien-rights movement, investigation by the New Jedi Order in 24 ABY confirmed it to be otherwise, and was subsequently defeated by the New Republic."}, {"tag": "p", "text": "As the Galactic Civil War moved into its final stage, many of the inter-species tensions on both sides of the conflict were loosened. The New Republic elected the Calibop Ponc Gavrisom as Interim Chief of State, the first nonhuman to fill the post. The crisis with the Diversity Alliance led to the formation of the Cooperative Council of Independent Planetary Governments—a group committed to improving relations between the various species of the New Republic. However, the biggest reform came from the Galactic Empire. When Admiral Daala took charge of the Imperial Remnant, she allowed both women and nonhumans to join the Empire's military forces, thus ending over thirty years of Human High Culture."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Galactic Civil War has been for decades the titular Star Wars that defines the saga. Most of the fiction created in Star Wars was, for years, set during the Galactic Civil War. Even with the Expanded Universe moving into conflicts that happened after it, or long before it, it still remains the most well-known plot point. After being introduced in Star Wars: Episode IV A New Hope, the course of the Galactic Civil War was elaborated by early Expanded Universe materials like 1978's Splinter of the Mind's Eye, the first Star Wars novel, and the Star Wars comic series produced by Marvel. The first comic series ran from 1977 to 1986, and introduced elements like the Yavin blockade, Luke Skywalker's discovery of Hoth, and the Tarkin superweapon."}, {"tag": "p", "text": "With so little canon material to work on, however, early works related to the Galactic Civil War were largely unstructured and unrefined. With the Galactic Empire's apparent defeat in 1983's Star Wars: Episode VI Return of the Jedi, Marvel moved towards creating new antagonists, leading to the introduction of such concepts as the Nagai–Tof War. In 1987, however, West End Games produced Star Wars: The Roleplaying Game, and the internal consistency required by an RPG meant that the game's sourcebooks became a substantial source of Expanded Universe material related to the Galactic Civil War. Indeed, The Roleplaying Games's sourcebooks were used by Timothy Zahn as background material when he wrote Heir to the Empire in 1991. Zahn's Thrawn Trilogy, and the Star Wars: Dark Empire comic series released the same year, expanded the course of the Galactic Civil War in the aftermath of the Battle of Endor, detailing the continued resistance of the Galactic Empire and introducing such characters as Grand Admiral Thrawn, Gilad Pellaeon, Mara Jade, and Emperor Palpatine's clone."}, {"tag": "p", "text": "Dark Empire and The Thrawn Trilogy both influenced Kevin J. Anderson's 1994 Jedi Academy Trilogy, which detailed the efforts of Luke Skywalker to restore the Jedi Order, the reconstruction in the aftermath of the Reborn Emperor's campaign, and introduced the Imperial exile Admiral Daala. 1994 also saw the release of The Truce at Bakura, which introduced the Ssi-ruuvi invasion in the immediate aftermath of Endor, and The Courtship of Princess Leia, which introduced the character of Warlord Zsinj, though in an undeveloped form, and the concept of post-Endor Imperial warlordism and faction fighting. Kevin J. Anderson's subsequent 1995 novel Darksaber detailed Daala's reunification of the Imperial warlords left scattered and feuding by Palpatine's defeat, with the help of Gilad Pellaeon, concluding with Daala's resignation and appointment of Pellaeon as Supreme Commander."}, {"tag": "p", "text": "1996 saw the release of Star Wars: Shadows of the Empire, a multimedia project intended to bridge the gap between The Empire Strikes Back and Return of the Jedi, which detailed the Rebel Alliance's efforts to rescue Han Solo from Boba Fett while seeking to acquire the plans to the Second Death Star. That same year saw the release of the first of Michael A. Stackpole's X-Wing novels, detailing and expanding the lives and personalities of the pilots of Rogue Squadron. Rogue Squadron, Wedge's Gamble, and The Krytos Trap related the New Republic's actions from Endor up to the liberation of Coruscant, and introduced the character of Ysanne Isard and expanded Warlord Zsinj as a background threat."}, {"tag": "p", "text": "Other fiction released around this time tended to move away from the Galactic Empire as an enemy, with The Black Fleet Crisis, Young Jedi Knights, and Star Wars: The Corellian Trilogy viewing the post-Daala Empire as either neutered or even utterly defeated. 1997's X-Wing: The Bacta War filled out the earlier history of the Galactic Civil War with Rogue Squadron's continued actions against Ysanne Isard in the aftermath of the capture of Coruscant. November of that year, however, saw the return of Timothy Zahn to write Specter of the Past, set fifteen years after the events of Return of the Jedi and depicting Gilad Pellaeon now in command of an exhausted Imperial Remnant, outnumbered by the New Republic and ready to sue for peace. Subsequent X-Wing novels released from 1998 to 1999 saw the expansion of the early campaign against Zsinj and developing the warlord into a wily and dangerous opponent. Zahn's Hand of Thrawn Duology concluded in September 1998 with the release of Vision of the Future, which saw the Imperial Remnant and the New Republic finally conclude peace, bringing the Galactic Civil War to a close and introducing concepts that would unfold in the later New Jedi Order novels, including the Chiss, the Empire of the Hand, and the upcoming Yuuzhan Vong invasion."}, {"tag": "p", "text": "Though after 1999 the Expanded Universe largely moved on to works related to the prequel trilogy and The New Jedi Order series, the Galactic Civil War's narrative was further fleshed out in various reference guides such as RPG sourcebooks and the Essential Guides. 2000's The Essential Chronology introduced the Orinda campaign and the Imperial Skirmishes as actions that took place between Daala's reunification and Pellaeon's peace treaty, with the latter being described as the Imperial Remnant's death blow. The narrative was subsequently expanded in 2005's The New Essential Chronology, while 2009's The Essential Atlas and 2012's The Essential Guide to Warfare related the campaigns of the war to newly-produced maps of the galaxy and developed coherent strategies for the Rebellion, the Empire, and the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}