{"url": "Galactic_Credit_Standard", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Currency", "Category:Galactic Republic"], "nodes": [{"tag": "h1", "text": "Galactic Credit Standard"}, {"tag": "p", "text": "The Galactic Credit Standard, simply called a credit or abbreviated to cred, colloquially referred to as Republic Dataries, and later known as the Imperial Credit, was the main currency in use in the galaxy since the time of the Galactic Republic."}, {"tag": "p", "text": "The galactic credit standard was established on Sojourn. From its inception, the credit was backed by the immense wealth of the planet Muunilinst and the InterGalactic Banking Clan (IGBC). During the Clone Wars, the IGBC backed the currencies of both sides, as it would do so again decades later for the New Republic and Imperial Remnant."}, {"tag": "p", "text": "One tenth of a credit was called a decicred."}, {"tag": "h2", "text": "Form"}, {"tag": "p", "text": "The credit was a form of digital currency with cards in circulation. Although they were about the same size, credits sometimes came in different patterns or designs, most likely depending on how much they were worth. Sometime during the height of the Galactic Republic, credit chips became popular. During the Clone Wars, the credit also came in the form of small metallic ingots. There were also cubes that were presumably similar to chips. Near the end of the Galactic Empire's reign, physical currency enjoyed an increase in popularity as denizens of the galaxy awaited resolution to the Galactic Civil War. Many were wary that credit chips could become worthless following the war."}, {"tag": "p", "text": "In some places, such as the first Death Star, credits could be accessed via a debit code. Credits could be transferred or withdrawn from an account card. These were usually used by sabacc or pazaak players. Bounty hunters also received an agreed amount of credits after completing a task or mission."}, {"tag": "h2", "text": "Decline"}, {"tag": "p", "text": "During the Clone Wars, and even before, many of the galaxy's inhabitants were worried about the war's outcome and the effect it would have on the galactic economy. Because of this, an overwhelming majority of planets outside the Core and Inner Rim would not accept credits. These planets and regions began minting their own special currencies. In 22 BBY, the InterGalactic Banking Clan was creating new currencies at a rate of twenty per day, with the InterGalactic Currency Exchange System managing the currency."}, {"tag": "p", "text": "The Empire continued to use the credit, now called the Imperial Credit, as its main currency, and during the reign of Emperor Palpatine, there were few who would not accept it. Even the Alliance to Restore the Republic used it, along with their own Alliance Credit, as it was the most used and easiest-to-use currency in the galaxy. Imperial credits existed in coins and chips of varying denominations: 0.1, 0.2, 0.5, 1, 2, 5, 10, 20, 50, 100, 200, 500, 1000, 2000 and 5000. In addition, the Imperial credits also had pictures on one side relating to important elements within the Empire. For example, a credit coin that was worth 1000 had an image of the Imperial Palace. While larger denominations coins existed, they weren't widely circulated throughout the galaxy."}, {"tag": "p", "text": "After the fracturing of the Empire at the Battle of Endor, many different currencies came into existence. Though the New Republic had reclaimed the credit, it was by no means the most accepted monetary unit in the galaxy. Many regions, including the Imperial Remnant, again began printing their own currencies. During this time exchange rates fluctuated wildly, and indeed it was hard at times to find anyone that would exchange one for another. Traders, smugglers, and legitimate freighters dealt in precious metals and commodities as neither the New Republic nor the Imperial Remnant would accept the other's currency."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In supplemental material George Lucas wrote in 1977 for the use of licenses, he described the \"Coin of the Galactic Realm\" as having two forms: a \"credit unit,\" which is left undescribed, and a flat square coin made out of crystal. The crystal coin was unreproducible by anyone other than the Empire."}, {"tag": "p", "text": "The credit symbol () follows the widespread tradition in real life of governments using a letter from the alphabet crossed by one or two lines to denote a currency. The credit sign is the letter Resh crossed by two lines in the upper left, with the Resh possibly standing for \"Republic.\" Real-world currency symbols following this tradition include those for the British pound sterling (£), the European Union euro (€), the American dollar ($), and the cent (¢)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}