{"url": "Alet_Komain", "categories": ["Category:Legends articles", "Category:Galactic Republic senators", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Alet Komain"}, {"tag": "p", "text": "Alet Komain was a male Human, who was born on the planet Daimar during the waning years of the Galactic Republic. He later became its senator and represented it in the Galactic Senate."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Komain was born on Daimar into a poor family and in about 54 BBY, he was drafted into Daimar's military, to fight in the Trade Conflicts. He quickly rose through the ranks and after years of success as a military leader, King Mitar, the monarch of Daimar, appointed Komain to become a senator and represent Daimar in the Galactic Senate on Coruscant, the galaxy's capital world. When Palpatine replaced Finis Valorum as Supreme Chancellor of the Republic, Komain hoped that this would end all the bickering that took place in the senate. However, his hope for a better senate was shattered in 19 BBY, when Palpatine declared himself Emperor and reformed the Republic into the Galactic Empire. Komain returned to Daimar, who refused to cooperate with Palpatine's New Order."}, {"tag": "p", "text": "The Empire began a blockade of Daimar, bringing the planet close to surrender. With defeat imminent, Mitar ordered Komain and some other important figures to flee the the planet Byrsym, where Mitar's son Torrin was leading an anti-Imperial resistance group, so that they wouldn't fall into Imperial hands. Komain and the others were able to breech to blockade and travel to Byrsym, where they successfully found and joined forces with Torrin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Komain had a lot of admiration for his father. As a soldier, he demonstrated that he was a skilled tactician and quick to act, enabling him to rise through the ranks. As a senator, he acted on his conscience and had an impeccable reputation among the other senators. However, he disliked the bickering and pettiness of the other senators, so wasn't popular among them. Following the formation of the Galactic Empire, he was disgusted that many worlds had accepted Palpatine's rule. He disliked being ordered to leave Daimar, but did not question the order, as he had great respect for Mitar and the monarchy."}, {"tag": "p", "text": "Komain was bilingual and could speak both Basic and Rodese, the language spoken by the Rodian species. He also weighed 105 kilograms."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}