{"url": "Aleth_Par", "categories": ["Category:Legends articles", "Category:Males"], "nodes": [{"tag": "h1", "text": "Aleth Par"}, {"tag": "p", "text": "Aleth Par was an individual who had an interest in the Heroes of Cularin during the waning years of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Aleth Par was a male individual who lived during the waning years of the Galactic Republic. In about 31 BBY, Merik Darou, the assistant of Senator Lavina Wren of the planet Cularin, was hospitalized after consuming some tainted ryll. Wren subsequently hired the Heroes of Cularin, a group of local freelance agents, to track down the drug dealer from which Darou had obtained the drugs and obtain a sample of the substance, and the agents traveled to Darou's apartment in the city Hedrett on Cularin. Par had an interest in the matter for his own personal reasons and for those of his employers, and he followed the agents to the apartment, tailing them from a distance. A short time later, the agents learned that Darou had purchased the drugs from the dealer Kelkan D'vrosh, and Par again followed the agents from a distance as they headed for D'vrosh's apartment in the city Gadrin. Par arrived at the apartment before the agents and he found a broken datapad inside the building. He repaired the device and learned from it that D'vrosh had paid for a berth aboard the star liner White Nova. Par then re-broke the datapad and waited in a nearby building, to see if the agents would pick up on the clues contained within the device."}, {"tag": "p", "text": "Circa 21 BBY, during the time of the Clone Wars, the gas Trinex-M was inadvertently dispersed in the city Oluna Biqua on the planet Genarius, and the effects of the gas caused the city's population to gain Force powers. The Heroes of Cularin were sent by the city's comptroller, Nestin Thokor, to obtain a pure sample of the gas, and Par trailed the agents from a distance while they performed their mission."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Par wore a long black coat, a hooded, dark gray-colored jumpsuit, and a black metal mask that obscured the upper half of his face. He carried a set of macrobinoculars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aleth Par was created by August Hahn and appeared in the Living Force roleplaying adventure Oblivion's Kiss. The module portrayed Par as a mysterious character who had an interest in the player characters, the Heroes of Cularin, and it stated that Par was set to appear in future Living Force modules. Par later made a brief appearance the Living Force adventure No Place Like Home, which was also written by Hahn, which also stated that more about Par would be revealed in future Living Force adventures. However, none of the subsequent Living Force modules included any mention of him. While neither Oblivion's Kiss of No Place Like Home explicitly confirmed Par's species, No Place Like Home stated that he was possibly Human."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}