{"url": "Galactic_Emperor/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Galactic Emperors", "Category:Galactic Empire", "Category:Titles of monarchs"], "nodes": [{"tag": "h1", "text": "Galactic Emperor"}, {"tag": "p", "text": "Galactic Emperor, sometimes referred to simply as Emperor, or Grand Emperor, was the title of the Head of State of the Galactic Empire and, later, the Fel and Sith Empires. The position and title was first formed, alongside the Galactic Empire itself, in 19 BBY during Palpatine's Declaration of a New Order immediately after the end of the Clone Wars. The female holder of this position, at least post-Palpatine, is generally referred to as Empress. The office was often referred to abstractly as the Imperial Executive or the Imperial throne."}, {"tag": "h2", "text": "Powers and functions"}, {"tag": "h3", "text": "Governance"}, {"tag": "p", "text": "The Galactic Emperor's power and authority were mainly derived from those of the Supreme Chancellor and the additional rights, responsibilities, and powers bestowed upon that office by the Senate during the Separatist Crisis and Clone Wars. It also derived power (at least nominally) from the Senate itself. The Emperor was the ultimate head of the Imperial Ruling Council, and was, at least nominally or symbolically, advised by the Imperial Senate. Officially, the Galactic Emperor does not directly interfere with local politics. During the reign of Palpatine, the Emperor was effectively an absolute monarch."}, {"tag": "p", "text": "The Emperor was the Head of State, Head of Government, and the Commander-in-Chief of the Galactic Empire, and had absolute authority over the Imperial Military, the bureaucracy, and the entire Empire and sectors itself. The Emperor had sole power to appoint, dismiss, approve, and supervise the regional governors. The Emperor organized and declared the budget, economy, taxes, and trade, ordered the Imperial Senate into session, dismissed it from meeting at will, declared its agenda, and proposed, rejected, and initiated all Senatorial bills. The Emperor also controlled, supervised, and disbanded the Courts and had the final judicial say. As such, the Emperor's mere word was enough for the Imperial hierarchy to enact his will. Those members of the Imperial government that saw particular favor with the Galactic Emperor often saw themselves elevated to positions of significant galactic power. Largely due to Palpatine's usage of these promotions, those within his inner circle formed a society composed of twisted sycophants and back-stabbers. In addition, he also issued via the Imperial Senate Intergalactic Passports to allow their bearers access to various planets controlled by the Empire, as well as the six primary galaxies."}, {"tag": "p", "text": "As Emperor, Palpatine retained the emergency powers that had been voted to him during the Clone Wars, allowing him to rule under what amounted to martial law. He could execute, imprison, exile, banish, or confiscate anyone or anything solely on his authority. The Emperor could also issue executive orders, and proclamations with the legal force of law in the Empire, even more powerful than those issued by the Senate. The Emperor supervised, directed, appointed, and dismissed all officials in the government, and created, disbanded, supervised, and directed all governmental administrations, agencies, commissions, and boards. He could also confiscate all assets from defeated worlds at his order, something most especially seen in the first year of the Galactic Empire's formation. He can also redirect funds from various departments for weapons development, even when such actions are illegal."}, {"tag": "p", "text": "In addition to processing judgment to criminals via the Judiciary system, the Emperor, should the charge be serious enough, such as high treason, can also personally deliver the sentenced punishment to the criminal in question. The Emperor can also preside over the Shaldania Parade from the Palatial Balcony, as well as observe and direct the public executions of \"Enemies of the Empire\" during Carnival Week and New Year Fete Week, the latter of which the Emperor also has the authority to force in the execution proceedings during the festivities."}, {"tag": "p", "text": "Regarding marriages to the Galactic Emperor, the legal details of a potential Emperor's wedding were specifically included in Imperial law, and in fact specified that the bride would forfeit her rights and become the groom's property—although that particular law may have been a Church of the Dark Side fabrication."}, {"tag": "h3", "text": "Military"}, {"tag": "p", "text": "In addition to his virtually absolute actions within the governance within the Empire, he also had near-total control within the Imperial Military. The Emperor is the one who gives orders to at the very least the Imperial Army, which are transmitted from Army Command down via a hierarchy. The development of superweapons under the Emperor's reign often necessitated that he visit the site development to personally inspect the development, evidenced by Palpatine's visitation of both Death Stars. As such, while the first Death Star was run by a triumvirate composed of Battle Station Command, Naval Command, and Army Command, the Emperor superceded their authority when he made direct visits to the battle station, and also supplied inputs to the development of the station, including adding in a contingency plan to make either the tower throne room or one of the lesser sections assume command if the Overbridge was irreparably damaged. He also can give inputs to the designs of various weaponry, as evidenced by his personally suggesting that the superdreadnought Eye of Palpatine specifically resemble an asteroid complete with impact craters, insisting it was necessary camouflage for baffling scanners. In addition, the Emperor alongside Imperial High Command were the ones who gave explicit authorization of using the Death Star's superlaser, even against targeted worlds, with any unauthorized usage of the superlaser being forbidden, and the Emperor is also the one to provide current codes for firing the superlaser. He can also place various weapons and vehicles into lockdown should there be a grave security risk with them, as evidenced by his suspending the Missile Boat's deployment due to then-current events. He can also oversee the development of new weapons and training new personnel besides superweapons should they be deemed important enough, such as his personally observing the development of the Cuis clones, as well as his observance of the final test to become members of his royal guard. The Emperor could also personally lead the military forces into direct warfare should the battle or even military operation be important enough to require his presence, even operating his own personal fleet of starships for the occasion. The Emperor can also redirect virtually the entire Imperial Navy (and possibly the entire Imperial Military) back to Coruscant when giving a speech to his military and citizens, having done so once in 3 ABY. The Emperor can also attend and present starfighter squadrons, such as the 181st Imperial Fighter Wing, should they be exceptionally renowned and skilled during ceremonies. The Emperor can even, should the actions of one of his soldiers be extraordinary enough, personally award medals, including the coveted Emperor's Will, to the recipient at his palace. The Emperor also has the power to promote Grand Admirals and Grand Moffs. Likewise, the Emperor can also redirect segments of the military, such as the 501st Legion, to other sectors, whether it be for a conflict or to sell people into the slave market. In addition, if the Emperor demands to make contact with one of his officers, even in the middle of a military operation, the officer is obliged to temporarily disengage from his current assignment, even physically relocate if they were currently in a difficult environment to ensure a clear transmission. This was made especially apparent in the aftermath of the Battle of Hoth, where Vader, who at the time was having Death Squadron hunt down the Millennium Falcon in the Hoth asteroid field, ordered for the Executor to move out of the asteroid field after learning that Palpatine had demanded for Vader to contact him. He can also order purges within his own military, especially if some officers were showing signs of anti-Imperial sentiments."}, {"tag": "p", "text": "Whenever the Emperor arrived on a military installation, he was frequently met with an air parade of Imperial starfighter wings, especially TIE fighters, and also had thousands of massed troops, including Stormtroopers, and technicians standing at attention. The Emperor's Royal Guard often preceded out before the Emperor. In addition, his shuttle is often escorted by some squadrons of TIE fighters, including the Emperor's Sword and Emperor's Shield squadrons. Although Emperor Palpatine acted as the Commander-in-Chief of the Imperial Military, he rarely left his palace on Coruscant, which resulted in relatively few Imperial personnel ever actually seeing their leader."}, {"tag": "h2", "text": "Succession"}, {"tag": "p", "text": "Palpatine was the first and only official Emperor of the first Galactic Empire—most of the Imperial leaders who followed were not recognized by all Imperials or never made use of the title of Emperor. One, Sate Pestage, seems to have legitimately held the title in the interim between Palpatine's death at Endor and his expected return. Pestage was possibly killed before Palpatine did return, leaving the throne apparently unoccupied. In addition, the supposed son of Emperor Palpatine, Trioculus, had been coronated, although it was left disputed as to whether it was valid."}, {"tag": "p", "text": "Emperor Palpatine's official heir would normally be Darth Vader, as he was Palpatine's third Sith apprentice. There were indications that he never intended for this to happen—he wanted Vader's secret apprentice Starkiller, and later Vader's son, Luke Skywalker, to take Vader's place at Palpatine's side by killing Vader. Palpatine had also prepared clone bodies of himself to take his place after his death, reducing the likelihood of needing an heir even further. In addition, he also stated prior to his final death to various Sith spirits that he intended to rule the Galaxy for all eternity, making it completely unlikely that he ever intended to have a line of succession. Despite this, however, Palpatine nonetheless arranged for the Dark Empire to be run on autopilot in the event that he ended up killed before he could utilize soul transference."}, {"tag": "p", "text": "In the Declaration of a New Order, Palpatine's speech had indicated that the Imperial Senate would elect the Galactic Emperor, but no one in the Imperial High Command had any desire to restore a body that would probably dissolve the Empire, so many Imperial commanders became rogue warlords after the Battle of Endor."}, {"tag": "p", "text": "There were also attempts to have successions via lineage, which either involved blood lineage from remote relatives (such as Ederlathh Pallopides, the great-niece of Palpatine), or from people rumored to have been sired by Palpatine himself (such as Irek Ismaren). Most of the latter instances were done to act as power-brokers."}, {"tag": "p", "text": "After the final death of Palpatine in 11 ABY, Xandel Carivus proclaimed himself the Emperor, but was soon killed by Kir Kanos."}, {"tag": "p", "text": "Under the Imperial Remnant, the role of Imperial Head of State was assumed by Supreme Commander of the Imperial Fleet."}, {"tag": "p", "text": "It was unclear what led to the appointment of Jagged Fel as Emperor, but the title became a hereditary one, passed on among members of the Fel dynasty such as Roan Fel, though the Emperor shared power with a Council of Moffs rather than holding absolute authority. In addition, the Emperor was also constantly at the mercy of the Imperial Knights, where the Emperor will be summarily executed if the Emperor started showing signs of adopting Dark Side behavior and was unwilling to go back from the Dark Side. This policy was implemented in order to ensure they not have a repeat of Palpatine's actions during his rule of the first Galactic Empire."}, {"tag": "p", "text": "When the One Sith took over, Darth Krayt abolished the hereditary system and claimed the title of Galactic Emperor for his version of the Galactic Empire. Roan Fel still claimed the title from his Empire-in-exile during the Second Imperial Civil War, and upon the conclusion of the war the deaths of both Krayt and Roan Fel resulted in Princess Marasiah Fel rising to become Empress of a now reunited Empire."}, {"tag": "h2", "text": "Style of office"}, {"tag": "p", "text": "Under the rule of Palpatine, the Galactic Emperor was formally referred to as \"His Imperial Majesty, Emperor Palpatine\" (as well as simply \"His Imperial Majesty\") or \"His Excellency, Emperor Palpatine.\" Both \"Your Majesty,\" and \"Your Highness\" were accepted forms of oral address. Governor Wilek Nereus was known to refer to the Emperor as his \"Most Excellent Imperial Master Palpatine\" in his messages. While Nereus used the third person in direct address as a mark of courtesy, Grand Moff Wilhuff Tarkin did not. At any rate, Palpatine was usually referred to as just \"the Emperor\" in the context of non-official, everyday conversations, even between military officers. The official title of \"The Galactic Emperor\" was also enclosed in the official statements included in issued Intergalactic Passports. At least one other official title was \"Grand Emperor.\""}, {"tag": "p", "text": "Certain individuals had their own, non-official way to address their Imperial sovereign. Being outside of the Imperial hierarchy, Darth Vader used to call the Emperor \"my master,\" when meeting with the Emperor in person, a sign of their master–disciple relation in the dark arts of the Force. Vader would also use the pronoun \"thy\" instead of the more common \"your,\" when asking what the Emperor's bidding was. Prince Xizor, a Falleen noble and the leader of the Black Sun criminal organization, addressed Palpatine as \"my Emperor.\" Yoda, an enemy of the Empire, when encountering Palpatine in his senate rotunda chamber, sarcastically referred to Palpatine as simply \"Emperor.\" Luke Skywalker, a member of the Alliance to Restore the Republic and fledgling Jedi Knight, when rejecting Palpatine's request for him to induct himself into the Sith as his apprentice shortly after Luke defeated Vader, referred to Palpatine as \"Your Highness,\" with Galen Marek at one point referring to Palpatine by that title under similar circumstances during their duel. Finally, those who knew that Palpatine was a Dark Lord of the Sith usually called him \"my Lord,\" as did Jeng Droga, one of the Emperor's Hands. The Sith spirits on Onderon, when addressing Palpatine when he entered the Tomb of Darth Vader, also referred to him as the \"Emperor of numberless worlds.\""}, {"tag": "p", "text": "By the time of Operation Shadow Hand, Palpatine was also given the title of \"His Immortal Majesty,\" in reference to his revival from his death at Endor via transfer essence. Although not an official title of office, Palpatine after his revival also adopted the title of Omnipotent Battle Leader, which he used to sway several feuding warlords into joining him before officially unveiling his revival."}, {"tag": "p", "text": "During the time of the Fel Empire, the reigning Emperor (or Empress) is often addressed as \"His Imperial Majesty,\" or in the case of the Empress, \"Her Imperial Majesty,\" with it also being used for any ships belonging to the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The title of Galactic Emperor was first mentioned — although without the 'Galactic' adjective — in the novelization of A New Hope, ghostwritten by Alan Dean Foster and published in 1976. The full title was first used with the Intergalactic Passport backstage pass for filming of Star Wars: Episode V The Empire Strikes Back."}, {"tag": "p", "text": "In the JC Penny catalogue description for the Darth Vader Star Destroyer playset, the portrait of the Grand Vizier was misidentified as \"Grand Emperor\"."}, {"tag": "p", "text": "Kyle Katarn becomes the new Emperor in the alternative non-canon option of Star Wars: Jedi Knight: Dark Forces II, succeeding Jerec. Similarly, Anakin Skywalker, under the influence of the Son, became both the founder and Emperor of the Galactic Empire upon defeating both Yoda and Sidious when the latter two teamed up in the Infinities comic \"Clone Wars: Infinities: What if the Father never rescued Anakin from the Dark Side?\" in Star Wars: The Clone Wars Magazine 7. The Dark Side ending of the Revenge of the Sith video game has Vader effectively assuming command of the Empire after Sidious, having already become Emperor, gave him his new lightsaber and using it to skewer his master before the latter could react."}, {"tag": "p", "text": "There is some confusion as to whether Ysanne Isard actually claimed the title Empress or not. While Evil Never Dies: The Sith Dynasties referred to her as Empress, other works such as X-Wing: Wedge's Gamble contradict this (indeed, she claims it would be premature to name an Emperor while the New Republic still exists), and it is possible that this reference was figurative."}, {"tag": "p", "text": "In the novelization of Star Wars, Obi-Wan mentions that there have been multiple emperors, with only the later ones becoming corrupt and with the original Emperor having been assassinated earlier. It also establishes that the man once named Senator Palpatine was a mere puppet dictator. This was inspired by the first draft of the film, where there had never been a Republic, only an originally-benign Empire which fell to evil.\nThere was originally going to be a plot point involving the successor to the title of Galactic Emperor in the game The New Emperor. However, this plot development was cut when the game itself ended up cancelled. Similarly, concept art for what was going to be Star Wars: Battlefront IV revealed that one what-if concept involved Darth Vader becoming the Galactic Emperor, with his possessing at least two variants of his armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}