{"url": "Galactic_Empire_(The_Star_Wars)", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Interplanetary governments"], "nodes": [{"tag": "h1", "text": "Galactic Empire (The Star Wars)"}, {"tag": "p", "text": "The Galactic Empire, otherwise known simply as the Empire, was a long-lasting government that was in existence for at least 100,000 years. Until the Great Rebellion, the bodyguards of its head of state, the Emperor, were the Jedi-Bendu."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Galactic Empire and their leader had been protected by the Jedi-Bendu for at least 100,000 years. However, the Knights of Sith, a rival faction of the Jedi-Bendu, took over the Galactic Empire and forced the Jedi-Bendu survivors into hiding. This eventually culminated in the Empire hunting down the Jedi-Bendu, as well as their attempted campaign against the planet Aquilae in the Aquilaean System. Other positions in the government of the Empire were governors."}, {"tag": "h2", "text": "Government"}, {"tag": "p", "text": "The ruler of the Galactic Empire, known as the Emperor, acted as the head of state and commander-in-chief of its forces. The Empire also was protected by the Jedi-Bendu for at least 100,000 years, eventually being superseded by the Knights of Sith."}, {"tag": "h3", "text": "Military"}, {"tag": "p", "text": "One of the Galactic Empire's most powerful forces was the Imperial Space Force, which, while under the control of the Jedi-Bendu, was invincible. However it was eventually taken over by the Knights of Sith. Several of their military vehicles included two-man ships called Stardestroyers, hovertanks, and the Space Fortress."}, {"tag": "p", "text": "Ranks in the Galactic Empire included First Lord of the Aquilaean System and Surrounding Territories."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "By the time of the present, in large part because of the efforts of the Jedi-Bendu and the Imperial Space Force, the Galactic Empire's borders consisted of the galaxy's celestial equator and the farthest reaches of the Great Rift. Afterwards, the only system that wasn't under direct Imperial control was the Aquilaean System."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This incarnation of the Galactic Empire first appeared in the 1974 rough draft of Star Wars. In this story treatment, there had been no Galactic Republic preceding it, and the Jedi (named Jedi-Bendu here) acted as bodyguards for the Emperor. The ruler at the time of the draft was named Cos Dashit, who was implied to have been installed as a puppet ruler shortly after the ousting of the Jedi-Bendu, and which Darth Vader and Crispin Hoedaack planned to usurp control from throughout the story. In the final version, the Galactic Empire was given an entirely different backstory for the most part, although its predecessor, the Galactic Republic, did share similar details, such as the Jedi Knights acting as the guardians of the Republic as a whole."}, {"tag": "p", "text": "From 2013 to 2014, Dark Horse Comics published a comic-book adaptation of George Lucas' rough draft, titled The Star Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}