{"url": "Galactic_Hunters", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxies Trading Card Game"], "nodes": [{"tag": "h1", "text": "Galactic Hunters"}, {"tag": "p", "text": "Galactic Hunters is the second expansion of Star Wars Galaxies Trading Card Game, released on March 12, 2009. It includes more than 200 new cards, including more than 20 new Loot cards, such as the exclusive Merr-Sonn JT-12 jetpack."}, {"tag": "p", "text": "This set focuses on the bounty hunters, introducing classic characters like Boba Fett, IG-88, Bossk, Zuckuss and 4-LOM with enhanced keyword abilities Target, Shield and Sentry."}, {"tag": "p", "text": "The story mode of this set, represented in Scenarios, revolves around a bounty-themed quest arc. Disturbed by the recent successes of Rebel espionage activities within the Corellian system, Darth Vader has lost confidence in the integrity of the Imperial Army. Determined to squash this Rebel activity once and for all, Vader has contracted the most notorious bounty hunters in the galaxy to capture key Rebel officials, a task his own Imperial forces have been unable to accomplish. The efforts of the cunning bounty hunters have been successful, leaving the leadership of the Rebel Alliance in disarray. To ensure the survival of the Rebellion, the captured leaders must be located and freed. The Alliance quickly regroups and deploys a team of less-than-desirable operatives of its own to defeat the bounty hunters and rescue the Rebel leaders."}, {"tag": "p", "text": "The Heroic Encounter of this set focuses on a group of spacers trying to defeat Exar Kun and his cult, after Professor Cornelius Wagglehorn sends them to learn about the fate of University of Corellia students, recruited from the Corellia University research outpost on Talus to join the cult on Yavin 4."}, {"tag": "h2", "text": "Card List"}, {"tag": "h3", "text": "Fixed cards"}, {"tag": "h3", "text": "Promo cards"}, {"tag": "h3", "text": "Heroic Encounter Special Cards"}, {"tag": "h3", "text": "Loot cards"}, {"tag": "h2", "text": "Artists"}, {"tag": "p", "text": "This is the list of notable artists who provided original art for the third game expansion."}, {"tag": "p", "text": "The complete list of artists can be found here."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}