{"url": "Galactic_Marines", "categories": ["Category:Legends articles", "Category:Clone trooper variants", "Category:Grand Army of the Republic corps", "Category:Imperial military units"], "nodes": [{"tag": "h1", "text": "Galactic Marines"}, {"tag": "p", "text": "The Galactic Marines, originally known as the 21st Nova Corps of the 4th Sector Army, was an elite unit that was created as the Grand Army of the Republic diversified during the Clone Wars. Following the formation of the Galactic Empire in 19 BBY, they became known as Imperial Galactic Marines."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Specialized armor"}, {"tag": "p", "text": "Galactic Marines wore special body armor with maroon coloration — and a backplate of which protected them from light blaster fire. They were usually armed with DC-15A blaster rifles and DC-15S blasters. The Marines were distinguished by their unique visor gear: synthmesh designed to keep out various hazards such as snow, sand, airborne fungus, and ash."}, {"tag": "h3", "text": "Vehicles"}, {"tag": "p", "text": "The Marines were known to utilize several walkers including the Unstable Terrain Artillery Transports, All Terrain Open Transports, and All Terrain Recon Transports.  These were painted with purple markings to identify their corps affiliation."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "Under the leadership of Jedi General Ki-Adi-Mundi and Clone Marshal Commander CC-1138, the 21st Nova Corps of the 4th Sector Army was made independent and became known as the Galactic Marines."}, {"tag": "p", "text": "The Marines were cross-trained to fight on a variety of environments in ground and space, making them extremely versatile. They specialized in boarding and capturing enemy starships as well as planetary assault, and were deployed on many planets such as Rhen Var, Aargonar, Boz Pity and Mygeeto."}, {"tag": "p", "text": "Bacara demanded the absolute best of his men, and would tolerate nothing less, unilaterally reassigning marines who did not meet his high standards, much to the dismay of General Ki-Adi-Mundi. The two maintained a respectful but contentious relationship, right up until the end of the war."}, {"tag": "p", "text": "The Marines training consisted of three phases."}, {"tag": "p", "text": "These training courses made the Marines one of the most elite fighting forces in the Grand Army of the Republic."}, {"tag": "p", "text": "At the Battle of New Bornalex, the Galactic Marines made use of prototype spacetrooper powersuits. Although the weapon systems on their new suits failed, the Marines continued to fight on. They engaged B2 super battle droids in hand-to-hand combat, using the enhanced strength granted to them by their powersuits. Their actions at New Bornalex earned the Marines a fierce reputation, making them one of the Republic's most feared clone military units."}, {"tag": "p", "text": "Commander Bacara (CC-1138) and a squad of Galactic Marines fought alongside Ki-Adi-Mundi during the Battle of Mygeeto. After receiving Order 66 from Supreme Chancellor Palpatine, Bacara and his squad turned on the Jedi and fired upon him. Although he was able to defend himself briefly, Ki-Adi-Mundi was overwhelmed by numerous blaster shots and killed."}, {"tag": "p", "text": "Following the formation of the Galactic Empire, Galactic Marines became known as Imperial Galactic Marines. During the Empire Day festivities following the Battle of Yavin in 0 BBY, they served as sentries in the city of Theed and participated in the ceremonial parades. Staff Sergeant Rothax was an Imperial Galactic Marine who operated out of the Imperial Outpost on Talus. Imperial soldiers who fought valiantly in battle earned the right to receive Galactic Marine armor from Rothax. This armor would at times be painted in completely different colors, including blue, gray, and brighter shades of red. BO-661 was another Imperial Galactic Marine who guarded an Imperial Detainment Facility on Yavin 4, but he was killed by a Rebel agent during that year's Empire Day festivities."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Battlefront II, clone troopers in Galactic Marine armor are known as \"clone commanders,\" However, the Battlefront II clone pack by Hasbro identifies them as \"Galactic Marines,\" so this might be a retcon. They also use chainguns in the game, however are normally seen in the films using DC-15A blaster rifles and DC-15S blasters. The armor also shares a resemblance to the later Galactic Empire's snowtrooper armor."}, {"tag": "p", "text": "In the Star Wars Miniatures game, miniatures representing the military group are called Elite Clone Troopers. The second edition of the figure is called a Galactic Marine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}