{"url": "Galactic_Museum", "categories": ["Category:Legends articles", "Category:CoCo Town locations", "Category:Coruscant places of learning", "Category:Museums"], "nodes": [{"tag": "h1", "text": "Galactic Museum"}, {"tag": "p", "text": "The Galactic Museum, also known as the Imperial Museum, was a museum and a vast repository of data that was established on Coruscant over twelve thousand years before the Galactic Civil War. A branch of it was located in CoCo Town near the Dewback Inn, and it had archives on the Frozen Moon of Improcco."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "This museum contained various artifacts and relics from thousands of different cultures; both still living and those that were long lost. The body's membership consisted of teams of anthropologists, librarians, scientists, historians and archaeologists all of whom were dedicated for the quest for knowledge. Their efforts allowed for a constant addition to the museum's archives which meant that expansion was an ongoing process as new halls were added in order to store new artifacts as well as lore. The Galactic Museum was a large complex structure that was divided into numerous halls with artifacts devoted to a single individual culture or instead contain either physical or historical relics of close civilizations which held only a small number of surviving artifacts."}, {"tag": "p", "text": "The different exhibit wings took days to explore and contained information on the Annals of the Galactic Republic, the History of Hyperdrive, the Jedi Order, Masterpieces of Expression, Flora and Fauna, as well as Planetary Cultures. The collective number of artifacts numbered in the billions though only one percent was ever on display. Instead, the millions of other artifacts were stored within the archive building within the CoCo District. Another location for the storage of such artifacts was in underground vaults of immense size that were located in the frozen moon of Improcco. A security system were used to take pictures of anyone entering within the residence of the museum in order to deter and capture any thieves that sought to steal treasured artifacts."}, {"tag": "p", "text": "One of the more infamous halls within the Galactic Museum was the Sith Hall. This wing of the complex was located forty levels below the top most structures and individuals seeking it had to navigate a twisting series of corridors. It contained various artifacts recovered from the fall of the Sith Empire, including Sith books, amulets and talismans. After being created, it was known that these dark side tainted artifacts sent whispers of their influence through the Force. However, the Jedi Order overlooked this fact as they believed that the combined presence of so many Force users simply drowned out the temptations of the artifacts. Unknown to many, a number of such artifacts had, however, come to the museum through illegal means which meant no administrator or Jedi had managed to inspect them. Many individuals that sought to learn of the Sith such as their knowledge, beliefs, civilization and magic often came to this branch of the Galactic Museum."}, {"tag": "p", "text": "One of the positions within the museum included the title of Master Curator."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally, the Galactic Museum was established more than twelve thousand years before the reign of the Galactic Empire. Its purpose was to contain information and artifacts from almost every known planet in the Galaxy with the intention of preserving worthy relics and thus make the museum the premier repository of knowledge in known space. Following the destruction of the Sith Empire, many artifacts relating to the ancient Sith came to the museum and led to the creation of the Sith Hall which was devoted to finding information about the Sith. A sealed wing contained Jedi artifacts, including Nejaa Halcyon's lightsaber. There was also some darker, obscure pieces of information that could be found in the Galactic Museum, including the near-extinction of the Ewoks (caused by falling debris from the second Death Star). However, much of this information may have simply been Imperial propaganda."}, {"tag": "p", "text": "During the Clone Wars, the Master Curator of the Galactic Museum was Asran Headows. After the rise of the Empire, Emperor Palpatine had the Jedi Order wing of the Galactic Museum closed off and renamed the Annals of the Republic into \"The New Order: The Glories of the Next Generation\". Despite the Emperor's purges, only a few artifacts were destroyed during this age. The Galactic Museum's new display on Imperial Intelligence was toured by several members of Rogue Squadron prior to the fall of Coruscant, and provided them with much insight into the Empire, especially the Empire's propaganda machine. The display featured holograms of Vyn Narcassan, Armand and Ysanne Isard."}, {"tag": "p", "text": "Upon the restoration of the Republic, the new government ensured that the Galactic Museum was restored to its original state. It was later destroyed during the fall of Coruscant, however it was rebuilt eventually, detailing a fairly neutral depiction of the Galactic Civil War."}, {"tag": "h2", "text": "Divisions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}