{"url": "Galactic_Republic_Chancery_election,_3640_BBY", "categories": ["Category:TOR dates usages without act argument", "Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Chancery elections"], "nodes": [{"tag": "h1", "text": "Galactic Republic Chancery election, 3640 BBY"}, {"tag": "p", "text": "In 3640 BBY, an emergency session of the Galactic Senate was called to elect a new Supreme Chancellor, following the assassination of Chancellor Dorian Janarus by a renowned bounty hunter onboard his personal transport, the Founder, in orbit of the Core World of Corellia. Janarus' chosen successor was former Governor Leontyne Saresh of Taris."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Chancellor Janarus had become embroiled in a scandal involving the bounty hunter who would eventually kill him - the most recent Grand Champion of the Great Hunt. His closest aide, Jedi Master Jun Seros, had created a long list of false charges against the Champion and put out a bounty of one million credits, making the hunter the \"Republic's Most Wanted\". However, the hunter would be hired by Darth Tormen to lure Janarus and Seros from the Republic capital of Coruscant, where the Hunter could avenge this slight. In order to lure them into the open, Tormen sought to exploit the ongoing battle for Corellia by influencing leaders of the Corellian resistance to back the Corellian Council's decision to leave the Republic. If the planet formally joined the Sith Empire of its own accord, the Chancellor would be forced to use diplomacy and come to Corellia in person."}, {"tag": "p", "text": "With the trap set, Janarus took the bait as expected, traveling to Corellia aboard the Founder. Seros, attempting to rally the Green Jedi to combat the Sith invasion, was struck down by the Champion, who used Seros' access codes to infiltrate the Founder. Confronted in his cabin by the hunter, Janarus condemned Seros' action and revealed that he had publicly denounced his former ally, effectively clearing the Champion's name. Although Janarus gave the hunter the option to slay Tormen in exchange for full immunity, the Champion decided to shoot the Chancellor on the spot."}, {"tag": "h2", "text": "Candidates"}, {"tag": "p", "text": "Leontyne Saresh had been one of Janarus' political rivals, a former Imperial slave descended from survivors of Taris, who had risen to a position of considerable influence in the Senate. However, her vocal criticism of the Sith and her calls for the complete destruction of the Empire led the Senate to appoint her as governor of the Taris Resettlement Initiative, considered to be a career-destroying job. However, Saresh embraced the project and put all the effort she could muster into solving the myriad problems of the ravaged planet, and made some considerable headway in the waning days of the Cold War."}, {"tag": "h2", "text": "Election and aftermath"}, {"tag": "p", "text": "Despite the ultimate destruction of the resettlement initiative, Saresh was elected to succeed Janarus just as the battle for Corellia reached its climax. Shortly after her election, Republic forces on Corellia reclaimed the Corellian Parliament, arrested the turncoat members of the Corellian Council, and slew three members of the Dark Council - Darth Acharon, Darth Hadra, and the supreme Imperial commander on Corellia, Darth Decimus. At around the same time, the Barsen'thor of the Jedi Order, commanding the separatist Rift Alliance after being charged by Janarus to take steps to bring the Alliance worlds back into the Republic, managed to foil the plans of the Children of the Emperor to destabilize the war effort on Corellia and defeat the First Son. In a formal ceremony on Coruscant, Chancellor Saresh promised reparations to the Rift Alliance both in recognition of the wrongs committed by the Republic government, and in gratitude for their invaluable contributions in defense of the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Janarus' fate is determined by the bounty hunter player character in Star Wars: The Old Republic. The implied canon choice, as the bounty hunter is an Imperial class, is that the player chooses the dark side option and kills Janarus. However, the hunter also has the option of sparing Janarus and instead killing Darth Tormen in exchange for immunity. Janarus then voluntarily retires, paving the way for Saresh's election."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}