{"url": "Galactic_Republic_Chancery_election,_3653_BBY", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Chancery elections"], "nodes": [{"tag": "h1", "text": "Galactic Republic Chancery election, 3653 BBY"}, {"tag": "p", "text": "In 3653 BBY, the Galactic Senate of the Republic convened to elect a new Supreme Chancellor to lead the democratic government. After the assassination of the previous Chancellor during an assault on the planet of Coruscant perpetrated by the Sith Empire, Cerean Senator Paran Am-Ris took control of Senate activities for an interim period. When the time came to elect the Chancellor formally, the Senate voted unanimously to install Senator Dorian Janarus of Coruscant, in recognition of his strong leadership of the planet in the crisis's aftermath."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The Galactic Republic had been enmeshed in the Great Galactic War with the Sith Empire for a number of decades by the year 3653 BBY, when the Empire ended the war with a surprise attack. The Empire's forces invaded the Republic's capital world, Coruscant, while the Republic's military forces were focused on outlying areas of the galaxy and the two factions had envoys negotiating a peace treaty. The Sith overwhelmed Coruscant quickly. The Jedi Temple was ransacked, Supreme Chancellor Berooken was assassinated, and the devastated ecumenopolis was held for ransom by the Sith so they could compel the Republic's peace envoy to sign the Treaty of Coruscant that forced it to divide the galaxy between the two factions and abandon allies in the outer regions in exchange for ending hostilities. This brought about a Cold War between the two factions. Until an election could be held to formally select a new Chancellor, Senator Paran Am-Ris of the planet Cerea was appointed for the interim."}, {"tag": "h2", "text": "Candidates"}, {"tag": "p", "text": "Senator Dorian Janarus was a representative of Coruscant in the Galactic Senate for many years before the emergence of the Sith Empire in 3681 BBY and the beginning of the Great Galactic War, but the war made him a prominent figure. While he felt his position was fulfilling, he always aspired to gain the Chancellorship and the prestige that came with it. Having survived the Sacking of Coruscant himself, Janarus took charge in its aftermath, assessing the damage and directing efforts to help the people in their time of need. He was viewed as a great leader not only to the Coruscanti, but also to the entire Republic for these deeds."}, {"tag": "h2", "text": "Election and aftermath"}, {"tag": "p", "text": "The Coruscanti people and the Republic's politicians were glutted by hope in response to the leadership of Senator Janarus. The thousands of representatives in the Galactic Senate voted unanimously to promote Janarus to Supreme Chancellor, and he relieved Am-Ris to begin the office's four year term."}, {"tag": "p", "text": "In the years after his election to the position, Janarus's support waned as the costs to rebuild Coruscant grew: many of the Republic's representative star systems were strained economically by this. He was also disliked by the military, who were irritated by his refusal to combat sedition in the government. Despite this, Janarus was re-elected to his position in 3649 and 3645 BBY. These were small affairs as the candidates feared assassination by the Sith Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dorian Janarus was an influential character in Star Wars: The Old Republic, a 2011 video game released by BioWare. To hype their game, BioWare released a number of articles through the game's official website, in the Holonet section, that provided background information on various subjects. Janarus's article documented his unanimous election to the position of Supreme Chancellor, which he occupied until his death in the game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}