{"url": "Galactic_Republic%E2%80%93Mugaari_war", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Conflicts of the Greater Javin", "Category:Conflicts of the Mid Rim"], "nodes": [{"tag": "h1", "text": "Galactic Republic–Mugaari war"}, {"tag": "p", "text": "The Galactic Republic defeated the humanoid Mugaari species in a brief, one-sided war roughly a thousand years before the Galactic Civil War. The victorious Republic forcibly annexed the eleven member worlds of Mugaari Space along the Corellian Trade Spine and established the new Javin sector in the Outer Rim Territories. Although the region enjoyed a resulting economic boom as commerce developed over the following centuries, the Mugaari resented Humans for their encroachment."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "A thousand years before the events of the Galactic Civil War, the Corellian Trade Spine hyperlane extended as far as the planet Javin at the edge of the Mid Rim, which divided the Galactic Republic from what was then considered to be Wild Space. This imperfectly surveyed frontier region of the galaxy attracted only scouts and the bravest of traders. Javin itself belonged to Mugaari Space, a semi-independent collection of eleven worlds ruled for millennia by the humanoid Mugaari, who were wary of the Republic."}, {"tag": "p", "text": "The region's traders journeyed across the Mid Rim frontier to the outer reaches of Mugaari Space and sometimes beyond in order to make contact with worlds controlled by two other relatively nearby alien civilizations, the Lutrillians and Nothoiin. These natives had traded sporadically with the Republic for centuries, but their respective homeworlds of Lutrillia and Nothoiin could only be reached by taking painfully slow detours around the region's sprawling Twin Nebulae gas clouds and by surrendering major profit shares to the Mugaari."}, {"tag": "h2", "text": "The war"}, {"tag": "p", "text": "The Republic defeated the Mugaari in a brief, one-sided war, forcibly annexing the eleven member worlds of Mugaari Space as Republic cartographers established the sprawling new Javin sector in the Outer Rim Territories. Still, despite the efforts of countless hyperspace explorers, a shorter route to Lutrillia and Nothoiin would remain elusive for centuries."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Republic seizure of regional power over the former holdings of Mugaari Space allowed for many newly settled worlds along the Corellian Trade Spine, including Mexeluine, Gerrenthum, Indellian, Bendeluum, Ione, Darlyn Boda, Orn Kios, and Isde Nada. Launching from Gerrenthum, scout ships of entrepreneur Ecclessis Figg eventually succeeded in blazing new star lanes straight through the Twin Nebulae to connect the Trade Spine with Lutrillia and Nothoiin. Figg's miraculous achievement turned the collective region into an economic powerhouse."}, {"tag": "p", "text": "Following their species' defeat at the hands of the Republic, most Mugaari left the planet Javin, formerly the most populous Mugaari world after Mugaar itself. The Mugaari resented Humans as invaders and occupiers, and contemned Lutrillians and Nothoiin as collaborators."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Galactic Republic–Mugaari war was established in \"Galactic Gazetteer: Hoth and the Greater Javin,\" a 2004 online supplement for Wizards of the Coast's Star Wars Roleplaying Game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}