{"url": "Galactic_Senate_Building", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Structure stubs", "Category:Incomplete lists", "Category:Coruscant government buildings", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Senate Building locations"], "nodes": [{"tag": "h1", "text": "Galactic Senate Building"}, {"tag": "p", "text": "The Galactic Senate Building,, also known as the Senate Building, Senate Rotunda, or the Senate Dome, was an immense building located on the planet Coruscant that served as the seat of the Galactic Republic Senate and later the Imperial Senate of the Galactic Empire."}, {"tag": "p", "text": "Located in the heart of Coruscant, the Galactic Senate Building was surrounded by the Senate District, including the Senate Office Building where the Supreme Chancellor had his offices. With its iconic domed shape, the mighty structure was easy to spot. The building and the Senate district were protected by the blue robed Senate Guards who stood watch and blended in with the formal surroundings of the Senate Building. They could also be found at the entrances to many of the delegate platforms and at the entrances to the building itself. Colossal statues outside the building commemorated the Republic's ancient founders."}, {"tag": "p", "text": "At the center of the building was the large, rotund Galactic Senate Chamber. It held seats on circular platforms for the hundreds of senators and delegates who would meet to pass laws and discuss legislation. When a member wished to speak, the platform could disconnect from the wall, allowing the member to be seen and heard by all others. In the center was a podium from which the Supreme Chancellor would direct the business of the Senate. The Senate Building also contained many smaller meeting rooms, senatorial offices, including the working office of the chancellor, and  other administrative facilities. To allow easy access for diplomats, a docking bay was built along one side of the building."}, {"tag": "p", "text": "The building later became obsolete with the dissolution of the Imperial Senate shortly before the Battle of Yavin, though it was still standing after the Battle of Endor. When the New Republic was formed, the restored Galactic Senate chose to move their headquarters among member worlds, which were selected through an election, rather than remaining only on Coruscant.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}