{"url": "Galactic_Senate_Medcenter", "categories": ["Category:Legends articles", "Category:Coruscant medical facilities", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:New Republic locations"], "nodes": [{"tag": "h1", "text": "Galactic Senate Medcenter"}, {"tag": "p", "text": "The Galactic Senate Medcenter, also called the Senate Hospital or the Galactic Center Medcenter, was a medical facility located several stories below the Senate Building and Senate Plaza in the Senate District of Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed as a private and exclusive recovery and healing facility for the senators and bureaucrats; it was open day and night. During the era known to history as the Golden Age of the Old Republic, the medcenter's patients ranged from senators who had to much to drink to those injured in recreational activities like scoopball."}, {"tag": "p", "text": "While general members of the populace were also admitted, they were quickly rushed out if a politician required immediate attention or high security, as in 33 BBY when Finis Valorum was admitted to the Medcenter after the first attempt on his life by the Nebula Front."}, {"tag": "p", "text": "In 44 ABY, Admiral Nek Bwua'tu was hospitalized in the Galactic Senate Medcenter following his attempted assassination."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Occupying the top five stories of a nondescript, mid-level building, the Galactic Senate Medcenter was accessible via turbolift from the Senate Building or by airspeeder access at one of the various species-specific entrances. Surrounded by Hospital Plaza, civilian bombardment shelters were located at the base of the building, several hundred meters below the medcenter; the entrances were positioned right below the medcenter's main docking level. A skybridge connected the Medcenter with Embassy Mall."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}