{"url": "Galactic_Standard_Calendar", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cleanup", "Category:Calendars"], "nodes": [{"tag": "h1", "text": "Galactic Standard Calendar"}, {"tag": "p", "text": "The Galactic Standard Calendar or Galactic Standard Time was the standard measurement of time in the galaxy. It was based on the Coruscant solar cycle. The Coruscant solar cycle was 368 days long with a day consisting of 24 standard hours. Numerous epochs were used to determine calendar eras. The most recent of these calendar eras used the Battle of Yavin as its epoch, or \"year zero.\" BBY stands for Before the Battle of Yavin, and ABY stands for After the Battle of Yavin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The calendar, also referred to as the Coruscant Standard Calendar,[source?] was the main calendar in use in the galaxy since the time of the Galactic Republic. Presumably the Old Republic dated years from its founding in 25,053 BBY.[source?] Over time, however, historians have used numerous galaxy-changing events as epochs to mark new calendar eras."}, {"tag": "p", "text": "One particularly notable epoch is the Treaty of Coruscant of 3653 BBY. The calendar eras before and after this event (referred to as \"BTC\" and \"ATC,\" respectively) were popularized by the famous Jedi historian Gnost-Dural. His holographic records, which used this numbering system, contained some of the most complete records of numerous important events such as the Hundred-Year Darkness, the Great Hyperspace War, the Great Sith War, the Mandalorian Wars, the Jedi Civil War, and the Great Galactic War against the returned Sith Empire. For this reason, this method of numbering years remains important to historians."}, {"tag": "p", "text": "Other notable epochs used were the Ruusan Reformation of 1000 BBY, the Great ReSynchronization of 35 BBY, the formation of the Galactic Empire in 19 BBY, and the Battle of Endor in 4 ABY.[source?] With the exception of the Ruusan Reformation, the later epochs were all within the same century and stemmed from the events and upheavals surrounding the rise and fall of the Galactic Empire. They were short-lived and used by various historians at the time. In 25 ABY, the New Republic commissioned the New Republic Historical Council to re-standardize the Galactic Calendar.[source?] The historical council chose the Battle of Yavin, instead of the Battle of Endor, calling the former the more significant galactic event. From that point on, the year in which the Battle of Yavin occurred was the epoch used for the dating system. It was used by the New Republic, as well as the subsequent Galactic Alliance. Many regions, however, kept their own calendars, including the Imperial Remnant.[source?]"}, {"tag": "h2", "text": "Time measurement"}, {"tag": "p", "text": "The calendar was based on the size and rotation of the planet Coruscant. It was a luno-solar calendar based both on Coruscant's orbit around its sun, and the orbit of its primary satellite, Centax-1. The standard unit of time was the standard second. Sixty standard seconds made up each standard minute, and sixty minutes made up each standard hour. Each day consisted of 24 standard hours. A standard week was 5 standard days, and each month was seven weeks (making 35 standard days each month). A standard year was 368 days, composed of ten months, three fete weeks, and three holidays. As the Hyperdrive Theory allowed space travelers to bypass relativity, a single duration of time passed at all locations equally over a given interval.[source?]"}, {"tag": "p", "text": "During the Old Republic, at least twenty variants of the Galactic Standard Calendar were in use, with the Republic Measures & Standards Bureau hotly debating which to use. One subset of the calendar, known as the 10-month standard calendar, was used by the Republic Judiciary during the time right before the Clone Wars. Another, composed of 11 months, was utilized by the archivists, and yet another, being hexadecimal based, was utilized by infrastructure.[source?]\nIn 23 BBY, the Republic Measures & Standards Bureau debated whether to keep this calendar as one of the twenty or so official calendars of the Republic, with Keelen Ma commenting that the various researchers were getting tired of needing calendar converters on their pads."}, {"tag": "h2", "text": "Days of the week"}, {"tag": "p", "text": "Some locales had other names for days of the week, including Thursday and Saturday."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BBY/ABY is sometimes known as BSW4/ASW4, which means \"before/after Star Wars: Episode IV.\" The BSW4/ASW4 notation was used in the timeline of the second edition of A Guide to the Star Wars Universe and The Essential Guide to Vehicles and Vessels. The Essential Guide to Planets and Moons eschewed acronyms altogether and listed dates as YEARS, with 0 YEARS being the events depicted in Episode IV. The first Essential Guide to use the BBY/ABY notation was The Essential Chronology. This practice continued in The Essential Guide to Alien Species and beyond."}, {"tag": "p", "text": "Material promoting The Thrawn Trilogy and other contemporary works dated those works by specifying how much time had passed since the Battle of Endor. This practice began to change after the release of The Truce at Bakura."}, {"tag": "p", "text": "In 2005 and 2006, Karen Traviss stated that she used the 10-month calendar when writing her Republic Commando novels."}, {"tag": "p", "text": "The Essential Atlas featured years of 12 months and months of 30 or 31 days, as did The New Essential Chronology."}, {"tag": "p", "text": "Star Wars 7 mentioned Sunday school, but gave no indication it was named for a day of the week."}, {"tag": "h3", "text": "12-month/368-day year structure"}, {"tag": "p", "text": "The number of days in every month has yet to be revealed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}