{"url": "Galactic_Voyager", "categories": ["Category:Legends articles", "Category:Flagships", "Category:Galactic Alliance starships", "Category:MC90 Star Cruisers", "Category:New Republic starships"], "nodes": [{"tag": "h1", "text": "Galactic Voyager"}, {"tag": "p", "text": "The Galactic Voyager was a Mon Calamari MC90 Star Cruiser that served as the flagship of Admiral Gial Ackbar."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The second ship produced under the MC90 line, the Galactic Voyager was in orbit over Mon Calamari following the attack on Mon Calamari. When New Republic Chief of State Leia Organa Solo traveled to the world to find the location of Anoth from Admiral Gial Ackbar, the pair traveled to the secret location to save young Anakin Solo from being captured by Imperial ambassador Furgan. The Galactic Voyager engaged the Imperial Dreadnaught Vendetta, which was subsequently destroyed."}, {"tag": "p", "text": "The following year Admiral Ackbar chose the Galactic Voyager to be his new flagship. The vessel first traveled to Nal Hutta, as part of a mock New Republic war game designed to frighten the Hutts prior to a diplomatic visit from Chief of State Leia Organa Solo."}, {"tag": "p", "text": "Upon receiving a distress call from Jedi Knight Kyp Durron, which alerted the New Republic to a new Imperial offensive, the Galactic Voyager and a task force of four Corellian Gunships headed to Yavin 4, site of the Jedi academy and currently under siege by Imperial Admiral Daala and a substantial fleet, including the Executor-class Star Dreadnought Knight Hammer and numerous smaller Victory II-class Star Destroyers."}, {"tag": "p", "text": "The ensuing engagement, the Assault on Yavin 4, found the Galactic Voyager and her escorts outnumbered tremendously. The warship managed to knock out several Victory Star Destroyers, but it was the timely arrival of a large New Republic fleet that saved the cruiser and Ackbar from death."}, {"tag": "p", "text": "Years later, during the Second Galactic Civil War, the Galactic Voyager was used as a command vessel by Admiral Cha Niathal during the Galactic Alliance ambush of the false Confederation summit at Gilatter VIII."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}