{"url": "Galantos", "categories": ["Category:Legends articles", "Category:Galactic Alliance planets", "Category:Galantos locations", "Category:Low-gravity planets", "Category:New Republic planets", "Category:Type I atmosphere planets", "Category:Utos system planets"], "nodes": [{"tag": "h1", "text": "Galantos"}, {"tag": "p", "text": "Galantos was the second planet in the Utos system on the Widek Bypass, near the Koornacht Cluster. Its first contact with the galactic community was quite ancient, as at least one Fian served as a Jedi 500 years before the First Great Schism."}, {"tag": "p", "text": "The planet's surface was covered in smooth, pale green gelatinous bodies with continental islands. During large storms, the surface of Galantos would roll and shift. Because Galantos' crust was severed into drifting tectonic plates, the islands were wracked with regular seismic vibrations known as gelquakes. Like many other planets in the Farlax sector, Galantos was rich with chromite deposits."}, {"tag": "p", "text": "The gelatin was an organic substance which provided life-giving nutrients to all life on the planet, including the indigenous sentient Fia. To protect their cities, the Fia built reinforced structures and developed a transportation system built on balloons to avoid groundquake-sensitive roads. Despite their ingenuity, the Fia preferred the gelatin and only took to the landmasses to interact with outsiders."}, {"tag": "p", "text": "Most non-Fia lived in the capital city of Gal'fian'deprisi where the planet's major starport was located. It was there that the Black Hammer Pirates made their headquarters."}, {"tag": "p", "text": "After escaping the Purge and Vector in 1 BBY, Han Solo landed on the planet, accompanied by Zahara Cody, Chewbacca and Trig Longo. He and Chewbacca went one way, to go and find the Millennium Falcon and retrieve it. Cody and Trig sought out transport to the planet Chandrila after separating from Solo and Chewbacca."}, {"tag": "p", "text": "During the Black Fleet Crisis, Jobath Knox, the Councilor of Galantos, went to Coruscant to appeal directly to Chief of State Leia Organa Solo, waiting outside the Solo Family apartment for an audience. Leia, acting outside the defined powers of the Chief of State, admitted Galantos to the New Republic. During the Yuuzhan Vong War, it was almost attacked by the Yuuzhan Vong despite a Fian deal made with the Peace Brigade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}