{"url": "Galaxies_Opera_House", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Coruscant entertainment buildings", "Category:Music venues", "Category:Theatrical venues"], "nodes": [{"tag": "h1", "text": "Galaxies Opera House"}, {"tag": "p", "text": "The Galaxies Opera House was an opera theater located in the Uscru District on the planet Coruscant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Galaxies Opera House was located in the upper levels of the Uscru District, overlooking the levels below it. It had two, large arching entrances where speeders could unload their passengers. Within the entrances, steps led to the inside corridors wrapped around the main theater performance arena that was circular with seating areas on all sides. In the waning days of the Galactic Republic, Supreme Chancellor Palpatine maintained a private viewing box which had a premier view of the performance arena. As visiting the opera house was a chance for patrons to stand out from the crowd, they followed the philosophy that the more extravagant their clothing was the better, wearing luxurious cloaks, elaborate headdresses, bold prints, and form-fitting dresses."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly after the Battle of Coruscant, the Mon Calamari play Squid Lake was performed at the Galaxies Opera House. Chancellor Palpatine attended the performance when he invited Jedi Knight Anakin Skywalker to join him. Palpatine, secretly the Dark Lord of the Sith Darth Sidious, told Skywalker the tale of Darth Plagueis and his attempts to cheat death. The story and Palpatine's manipulations were a major step in bringing Skywalker closer to the dark side of the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Galaxies Opera House first appeared in the 2005 film Star Wars: Episode III Revenge of the Sith. Ian McDiarmid stated that the Galaxies Opera House scene was one of his favorite scenes of the saga and one of the best scenes George Lucas had ever written in his opinion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}