{"url": "Galaxy%27s_Edge_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Galaxy's Edge (comic series)"], "nodes": [{"tag": "h1", "text": "Galaxy's Edge 3"}, {"tag": "p", "text": "Galaxy's Edge 3 is the third issue of the canon comic book miniseries Star Wars: Galaxy's Edge, which ties in to the theme park of the same name. The issue was written by Ethan Sacks, illustrated by Will Sliney, and published on June 26, 2019 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THE JEDHA CONNECTION! During the height of the EMPIRE, DOK-ONDAR hired an unlikely team to pull off an impossible score — to steal a relic out of the occupied HOLY CITY OF JEDHA. With FIRST ORDER troops now blanketing the BLACK SPIRE OUTPOST on BATUU, history may finally be catching up to the notorious procurer of the unprocurable. Guest starring fan favorite Outer Rim pirate HONDO OHNAKA! Based on Star Wars: Galaxy's Edge, the new themed land coming this year to Disney Land and Walt Disney World."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Meeting with Hondo Ohnaka"}, {"tag": "p", "text": "A group of First Order stormtroopers were chasing Remex Io through the streets of Black Spire Outpost. While shooting at Remex as stray bullet hit a Zeltron, killing him. The stormtroopers have an arrest warrant on Remex and were told to take him in alive until Remex started to shot back at them, killing one of them. Remex changed his form to a human sitting on the street. When asked where Remex went, he told the stormtroopers that he ran toward the spaceport. After changing back to his regular form, Remex was quickly grabbed by the throat and by Varg, Dok-Ondar's \"fixer\". Varg said he was here fix a big problem for Dok-Ondar."}, {"tag": "p", "text": "Shortly after at Oga's Cantina, Remex managed to meet up with Kendoh Voss and Wooro. Remex told Kendoh that Dok-Ondar had found out about the heist and they must abort the plan. Kendoh told Remex that they are still going forward with the plan and walked over to a booth to go meet with a fortune teller. The fortune teller told the person in the booth behind them all about Kendoh and her gang. The person asked Kendoh to go over to him and introduced himself as the Weequay pirate, Hondo Ohnaka. Kendoh says they need a pilot who can make a run through a First Order blockade. Back at the bar, Remex was skeptical about hiring Hondo as their pilot. But Wooro told him it was all part of their ploy. At the booth, Hondo reassures Kendoh that he is the right person for the job and mentioned a job that he and Dok-Ondar took and escaped the Guardians of the Whills and escaped an Imperial blockade. At another location, Dok-Ondar is holding a recording of Hondo talking to Kendoh, and he told Hondo to just try to get Kendoh to pump information about her plan."}, {"tag": "h3", "text": "A heist from the Temple of the Kyber"}, {"tag": "p", "text": "Sometime before, Hondo Ohnaka, Dok-Ondar and Quadoro broke into the tunnels of the Temple of the Kyber to steal a statue. They were stopped by a guardian who they quickly stunned. Quadoro questioned Captain Ohnaka on why he has to be in the front, to which he was quickly gunned down by more guardians. While Hondo continued to fight the guardians, Dok-Ondar located their target and began to admire the history of it. He felt that it brought him closer to his parents. Dok-Ondar used a laser torch to break off the statue from the rest of it's base but the lasers deflected off and shot to the ceiling which caused part of the ceiling to fall and take a guardian Hondo was fighting with it. Dok-Ondar used Ki-Adi-Mundi's lightsaber instead to break off the statue. After doing so, Hondo quickly grabbed the Ithorian and they made their way to the exit. They were stopped by another guardian, this one introduced himself as Chirrut Îmwe and refused to let them pass by. Hondo underestimated the blind man and started to shoot at him. Chirrut dodged the blaster fire and knocked out Hondo. Hondo got back up and started to duel Chirrut with his own staff. Dok-Ondar intervened and stated that this statue was a clue to figuring out the murder of his parents. Chirrut let them go and the two returned to the ship."}, {"tag": "p", "text": "As they left they were spotted a Imperial starfighter who was on patrol. Hondo started to fly toward the Star Destroyer over head stating that the starfighters will not fire on their own ship. As he flew closer to the ship, he took off into hyperspace."}, {"tag": "h3", "text": "Sword of Khashyun"}, {"tag": "p", "text": "Back at Oga's Cantina, Kendoh Voss showed Hondo a tablet with a picture of the Sword of Khashyun which Kendoh's gang wanted to get passed the First Order blockade. Hondo said that he has seen it before to which Dok-Ondar told him over an earpiece to stop answering her but Hondo continues on and talks about a person that they left behind when getting the sword. She was a well know as an archaeologist and was known to have conned Darth Vader."}, {"tag": "p", "text": "A long time before, Doctor Chelli Lona Aphra with her protocol droid 0-0-0 met with Hondo Ohnaka to get a ship so they could find the Sword of Khashyun."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}