{"url": "Galaxy%27s_Edge_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Galaxy's Edge (comic series)"], "nodes": [{"tag": "h1", "text": "Galaxy's Edge 2"}, {"tag": "p", "text": "Galaxy's Edge 2 is the second issue of the canon comic book miniseries Star Wars: Galaxy's Edge, which ties in to the theme park of the same name. The issue was written by Ethan Sacks, illustrated by Will Sliney, and published on May 22, 2019 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Across the galaxy, DOK-ONDAR is known as the procurer of the rarest antiquities in the universe. But the most priceless of his relics come with a darker cost. And with the First Order's hunt for the hidden Resistance heating up, planet Batuu might soon turn into the most dangerous place in the galaxy. Journey to BLACK SPIRE OUTPOST and discover an early look at the themed land coming to Walt Disney World and Disneyland this year. Guest starring the bounty hunter GREEDO and notorious gangster JABBA THE HUTT!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Ki-Adi-Mundi's lightsaber"}, {"tag": "p", "text": "In a flashback, Jedi Master Ki-Adi-Mundi was fighting with his clone trooper unit when Order 66 is activated and the clone troopers killed the Cerean. Back to the present, a First Order stormtrooper sergeant was at Dok-Ondar's Den of Antiquities holding Ki-Adi-Mundi's lightsaber and threatening Dok-Ondar. During their conversation a hidden cam droid placed there by Remex Io recorded the conversation for Remex and his fellow bounty hunters, Kendoh Voss and Wooro. Kendoh Gang had planned to heist a mysterious object from Dok-Ondar but needed the location of it. After Wooro leaves to go for a walk, Kendoh and Remex Io discuss what they would do with the credits they would earn from this heist. While discussing this, Remex Io changed his form to the First Order stormtrooper sergeant, before being told to quiet down by Kendoh. Back at Dok-Ondar's shop the stormtrooper sergeant told Dok-Ondar to report any Resistance contact and it would be a pity to have to destroy all the relics in the shop. Dok-Ondar understood that the sergeant didn't care much about history but told him the story of how he got his hands on Ki-Adi-Mundi's lightsaber."}, {"tag": "h3", "text": "Greedo's bounty"}, {"tag": "p", "text": "On Mygeeto the Banking Clan held Ki-Adi-Mundi's lightsaber which they viewed as a relic. Vice Chairman Anolo had hired a Givin codebreaker to crack codes needed for a war with the Hutts. As they were discussing this a shot came through the window causing it to break and for the Vice Chairman to start an evacuation of the tower in which they were in. The shot had come from the Rodian bounty hunter Greedo who was with a Kadas'sa'Nikto named Takvaa. They were sent on a mission by Jabba Desilijic Tiure to kidnap the codebreaker. Back at the tower the Givin and Anolo continued to run with some Muun guards, when they stopped and the codebreaker noticed that the wall was thinner then the walls in Anolo's office. Suddenly an explosion appeared with Greedo and Takvaa appearing. They opened fire on the guards but started to get overwhelmed. Greedo then used Takvaa as a shield to block against an attack, killing Takvaa in the process. Greedo then swiftly killed Anolo and dragged the Givin along with him as more guards appeared. Greedo proceeded to lock himself and the codebreaker up Anolo's office but time was running out as the guards started to get the door open. As the codebreaker continued to calculate their odds of success, Greedo told his other crewmates to move the rendezvous point to his location. He then grabbed Ki-Adi-Mundi's lightsaber and proceeded to shatter the window. A grappling hook was launched from a skiff in order to get the codebreaker and Greedo across. The reluctant Givin told Greedo that the grappling line would not be able to hold his weight but Greedo pushed him on it anyways, causing the codebreaker to fall to his death."}, {"tag": "p", "text": "Shortly after at Jabba's Palace, Jabba the Hutt was very disappointed in Greedo. Greedo was on his knees pleading for his life. Right before Jabba was going to throw Greedo into the rancor pit, Dok-Ondar offered to take Ki-Adi-Mundi's lightsaber from Greedo for double its worth to Jabba. Jabba agreed and spared Greedo before sending him out on another more simpler mission."}, {"tag": "h3", "text": "Causing a distraction"}, {"tag": "p", "text": "Many years later, Wooro was walking the market of Black Spire Outpost when he encountered a Wookiee standing in his way. Wooro went ahead and knock the Wookiee over before leaving, but the Wookiee came back and tried to attack Wooro and was again knocked out. But this time the Wookiee got up and hit back at Wooro. Wooro then proceeded to club the head with a BB-series astromech droid toy. Wooro reported the Wookiee to the authorities as a member of the Resistance in order to cause a distraction and get the stormtroopers to leave so they can collect a Sith artifact the next day."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}