{"url": "Galaxy_Dragon", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Heavy cruisers", "Category:Kuat Drive Yards products", "Category:Starships of the Galactic Empire", "Category:Starships of the Imperial splinter factions"], "nodes": [{"tag": "h1", "text": "Galaxy Dragon"}, {"tag": "p", "text": "The Galaxy Dragon was the prototype ship in the Dragon-class heavy cruiser line, and the only ship of its kind known to have been created. It was created in the Imperial-controlled Kuat Drive Yards assembly line in the Karavis system. The Dragon had a midnight-black hull so as to make it nearly invisible against the vacuum of space. To inspire terror in any opponents, exterior lights could illuminate the hull, causing the Galaxy Dragon to glow evily."}, {"tag": "p", "text": "Moff Delurin supervised the final test run of the ship, then immediately took it from the Karavis system to the Sorella system's planet Miko. It sped through hyperspace to crush Miko's troublesome inhabitants who refused to bow to Emperor Palpatine's will. Moff Delurin watched happily as the prototype lived up to its promise, raining turbolaser fire down on the planet, and hammering the cities with concussion missiles. The perfect day was ruined, however, when news of the Emperor's death came over the comm systems. Upon hearing this, Delurin immediately declared himself a Warlord, using the Dragon as his flagship."}, {"tag": "p", "text": "Delurin's first act as self-proclaimed Warlord of Wild Space was to take the planet Bormter, which provided him with dragon troopers, which would then make up the remaining troop contingent on the Dragon. The Dragons TIE/LN starfighters were all equipped with shields, as Delurin understood the fact that he no longer had an unlimited supply to replace them with."}, {"tag": "p", "text": "Under the command of Delurin, the Galaxy Dragon was known to have attacked a New Republic diplomatic ship carrying an important diplomat. He caused the ship to crash land on a strange planet in the uncharted regions of Wild Space, where Delurin and his men followed them. Fortunately for the diplomat, a team of rebels located and rescued him before the Dragon Troopers managed to capture them."}, {"tag": "p", "text": "After this, the diplomat headed toward the planet Miko, to arrange for the Mikoans to join the Republic. Delurin came on board the Dragon to put an end to this, but a joint Mikoan/Republic force managed to repel the Dragon and his Dragon Troopers from the planet."}, {"tag": "p", "text": "Delurin was also known to have ordered the Dragon to attack the pleasure cruiser Wendiri Nightstar, and demanded that all occupants surrender and place the vessel under his command. However, upon trying to board he was repelled by a group of passengers who managed to hold back his Dragon Troopers long enough for the Nightstar to get her hyperdrive engines operational again, and managed to flee into hyperspace."}, {"tag": "h2", "text": "Sources"}]}