{"url": "Galaxy_Guide_1:_A_New_Hope_(Second_Edition)", "categories": ["Category:Real-world articles", "Category:Galaxy Guides"], "nodes": [{"tag": "h1", "text": "Galaxy Guide 1: A New Hope (Second Edition)"}, {"tag": "p", "text": "The second edition of Galaxy Guide 1: A New Hope is a supplement to Star Wars: The Roleplaying Game published by West End Games 1995. Based on the First Edition written by Grant S. Boucher, this edition was revised and expanded by Michael Stern and Paul Sudlow. The book is written in an in-universe perspective, as though it were the research project of a Rebel historian."}, {"tag": "p", "text": "The guide features character profiles with gaming stats for main and some secondary characters from the film Star Wars: Episode IV A New Hope. Like the First Edition, this book supplies backgrounds, races, planets, and names for many elements appearing in the film, many of which were reintroduced following the 2014 Legends announcement and are now a part of the modern Star Wars canon."}, {"tag": "p", "text": "The new edition adapts the book's gaming stats to the Second Edition rules. Articles were also extended to include vehicles, starships, and equipment, not only characters like in the original guide."}, {"tag": "h2", "text": "From the publisher"}, {"tag": "p", "text": "The Battle of Yavin marked the first dramatic triumph for the Rebel Alliance which set the crusade to restore the Republic on its path to ultimate victory. Join the grand quest to explore the locales and meet the people which had an impact on the outcome of that first important conflict!"}, {"tag": "p", "text": "Galaxy Guide 1 contains the definitive collection of backgrounds, statistics, and information on the heroes and villains from the original Star Wars movie, as well as a new adventure set on Tatooine suitable for new characters. This comprehensive guide to the Star Wars galaxy, featuring the art of Ralph McQuarrie, Michael Manley, and Al Williamson, and stills from the movie, details the aliens, Imperials, and Rebels that figured in those crucial weeks leading up to the Battle of Yavin."}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Introduction"}, {"tag": "h3", "text": "Chapter One: Tatooine Wilderness"}, {"tag": "h3", "text": "Chapter Two: Mos Eisley"}, {"tag": "h3", "text": "Chapter Three: The Death Star"}, {"tag": "h3", "text": "Chapter Four: Yavin"}, {"tag": "h3", "text": "Chapter Five: The Heroes of Yavin"}, {"tag": "h3", "text": "Chapter Six: The Battle of Wayfar (New)"}, {"tag": "h3", "text": "A Long Time Ago..."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}