{"url": "Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)", "categories": ["Category:Real-world articles", "Category:Galaxy Guides"], "nodes": [{"tag": "h1", "text": "Galaxy Guide 3: The Empire Strikes Back (Second Edition)"}, {"tag": "p", "text": "The second edition of Galaxy Guide 3: The Empire Strikes Back is a supplement to Star Wars: The Roleplaying Game, published by West End Games in 1996. Based on the First Edition written by Michael Stern, this edition was revised and expanded by Pablo Hidalgo."}, {"tag": "p", "text": "The guide features character profiles with game stats for main and some secondary characters from the film Star Wars: Episode V The Empire Strikes Back. This book supplies Expanded Universe backgrounds for many characters appearing in the film."}, {"tag": "p", "text": "This edition expands upon characters only mentioned in the previous edition, and includes a new adventure as the last chapter of the guide. It is illustrated with photos from the film, replacing the artwork from the previous edition. A short story from the first edition, Little Girl Lost, is not included here."}, {"tag": "h2", "text": "From the publisher"}, {"tag": "p", "text": "Galaxy Guide 3 is the comprehensive guide to Episode V of the Star Wars saga, compiling information and facts from the movie, radio play, novels, and comics. You'll find within these pages a definitive collection of backgrounds, statistics, and information on the heroes and villains from The Empire Strikes Back, many of whom make their first appearance in a roleplaying supplement. Plus, join the adventure in an all-new scenario set in the luxury mining town of Cloud City."}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Introduction"}, {"tag": "h3", "text": "Chapter One: Hoth Wastes"}, {"tag": "h3", "text": "Chapter Two: Echo Base"}, {"tag": "h3", "text": "Chapter Three: The Battle of Hoth"}, {"tag": "h3", "text": "Chapter Four: Imperial Fleet Profiles"}, {"tag": "h3", "text": "Chapter Five: Bounty hunters"}, {"tag": "h3", "text": "Chapter Six: Dagobah"}, {"tag": "h3", "text": "Chapter Seven: Bespin"}, {"tag": "h3", "text": "Chapter Eight: The Heroes of Yavin"}, {"tag": "h3", "text": "Chapter Nine: Freedom No More (adventure) (New)"}, {"tag": "h3", "text": "It is a Dark Time"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}