{"url": "Galaxy_Gun", "categories": ["Category:Legends articles", "Category:Imperial Department of Military Research products", "Category:Space station superweapons", "Category:Starship superweapons", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Galaxy Gun"}, {"tag": "p", "text": "The Galaxy Gun, or Galaxy Weapon, was a superweapon built by the Galactic Empire in 10 ABY. It was commissioned by the \"reborn\" Emperor Palpatine and designed by Umak Leth."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Galaxy Gun was a 7,250-meter-long tube-shaped space station built above Byss. It was a superweapon capable of firing large, destructive projectiles equipped with particle disintegrator warheads capable of destroying an entire planet. It was also equipped with hyperdrive and sublight thrusters."}, {"tag": "p", "text": "Each of these projectiles was capable of traveling through hyperspace with a speed equivalent to at least a Class .75 hyperdrive, allowing for quick traversal of interstellar distances and difficulty in detecting them until they struck. Upon exiting hyperspace and homing in on its target, the projectile's automated defenses would activate to deter enemy forces. Automated laser cannon turrets exchanged laser fire with warships while thick armor plating and powerful energy shields deflected even the most advanced ion cannons and turbolasers."}, {"tag": "p", "text": "Having reached its target, powered by the missile's power core, the particle disintegrator warhead exploded, triggering immense nuclear cloud reactions that encircled the targeted world's surface within minutes. At the projectile's full power setting, the nuclear reactions were sustained until all matter had been converted into energy, effectively wiping the planet and its inhabitants off the face of the galaxy. However, there were low power settings allowing them to destroy selected cities and military bases while leaving the rest of the planet untouched. Luke Skywalker, when reflecting on these capabilities, noted that Galaxy Guns were the most destructive superweapons at the time of the conflict."}, {"tag": "h2", "text": "Operational history"}, {"tag": "p", "text": "Like the Death Stars before it, the Galaxy Gun could have been used by the reborn Emperor Palpatine to rule with a Tarkin Doctrine-like policy of fear. To ward off New Republic attacks and restore the Galactic Empire's rule, the Galaxy Gun was constructed and maintained over the orbit of Byss which was surrounded by the massed Imperial fleet."}, {"tag": "p", "text": "In retaliation for the New Republic attack on his citadel and the escape of the surviving Rebels into hyperspace along with a group of smugglers, Palpatine ordered the launch of the first projectile against the New Republic base on Pinnacle Moon."}, {"tag": "p", "text": "Within hours, Pinnacle Moon had been wiped off the face of the galaxy. However, due to the presence of spies in Byss itself, the New Republic forces along with some of the native Ixlls managed to escape the doomed moon in a fleet of transports."}, {"tag": "p", "text": "In response, New Republic commando and sabotage teams attacked the Galaxy Gun, but were annihilated by the massed Imperial fleet. The Emperor continued to launch projectiles, destroying entire unruly worlds and nearly crippling the New Republic. Krinemonen and Hirsi were devastated by the gun. As a result of this terrifying tactic, the Empire regained key territories in the Inner and Outer Rims in a relatively short time. Other known targets included Nespis VIII's space city, where even the New Republic's Kuat V-200 ion cannons were unable to penetrate the shielding of the projectiles, as well as the New Republic troopship Pelagia under the command of Captain Tekba, which was carrying a hundred thousand troops at the time of its destruction."}, {"tag": "p", "text": "Ironically, Palpatine's excessive usage of the Galaxy Gun would end up being one of the major factors that led to his downfall: several Imperial officers, disturbed at their clone Emperor's erratic behavior, arranged for Royal Guard and member of Lumiya's Sith Carnor Jax to have the Emperor's genetic material tampered with down to the source material."}, {"tag": "p", "text": "Despite the vast firepower possessed by the superweapon, the Galaxy Gun would be destroyed in 11 ABY along with Byss and much of the massed Imperial fleet. With the Emperor's final death at the Battle of Onderon, the famed astromech droid R2-D2 took control of the immense Eclipse-variant super star destroyer Eclipse IIs computer banks and set the ship on a collision course with the Galaxy Gun. The Galaxy Gun was too clumsy and slow to evade the colliding Super Star Destroyer, which had devastating consequences."}, {"tag": "p", "text": "The resulting explosion destroyed both superweapons. One of the victims killed in the destruction of the Galaxy Gun was Umak Leth, the engineer who designed the superweapon. However, one last projectile exited the firing tube just before its destruction. The unguided missile was pulled in by Byss's gravitational field and drifted toward it. Then, the particle disintegrator warhead detonated and destroyed Byss, crushing the majority of the reborn Emperor's forces and loyal officers. The destruction of Byss and its inhabitants by the Galaxy Gun was a major factor for the ending of Operation Shadow Hand."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Nearly fifteen years later during the Yuuzhan Vong War, Luke Skywalker would almost regret the destruction of the Galaxy Gun, as it could have helped the New Republic wipe out thousands of Yuuzhan Vong Koros-Strohna worldships. Over a century after Palpatine's death and the Yuuzhan Vong invasion, Vul Isen of the One Sith created viral spores that could poison planets. After being confronted by Cade Skywalker, Isen boasted over the Galactic Empire no longer needing the Galaxy Gun or the Death Star to destroy planets compared to his science."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the online game Death Star Designer, Galaxy Guns can be added to a player's Death Star model. It could be developed for 300 billion credits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}