{"url": "Galaxy_at_War", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Wizards of the Coast sourcebooks"], "nodes": [{"tag": "h1", "text": "Galaxy at War"}, {"tag": "p", "text": "Galaxy at War is a hardcover supplement to the Star Wars Roleplaying Game Saga Edition Core Rulebook by Wizards of the Coast. It was published on September 15, 2009."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Warfare is a common theme throughout the Star Wars saga. From the Clone Wars to the Galactic Civil War to the Sith–Imperial War, soldiers have their work cut out for them. This supplement gives players and Gamemasters everything they need to run games or play characters in a war-torn galaxy. This book provides rules for military units as well as new character options, new gear and starships, and a host of adventure hooks and campaign seeds that can be used to inject military flavor into campaigns of all eras."}, {"tag": "h2", "text": "Back Cover Summary"}, {"tag": "p", "text": "\"Prepare for ground assault.\""}, {"tag": "p", "text": "Get ready to dig into the trenches of Hoth or charge across the open plains of Geonosis, standing shoulder to shoulder with your fellow warriors. War has come to the galaxy. and the deeds of soldiers and generals will determine the fates of billions of lives. Remember your training, and don't stop fighting until the enemy is down."}, {"tag": "p", "text": "GALAXY AT WAR PRESENTS A VARIETY OF OPTIONS FOR BOTH PLAYERS AND GAMEMASTERS, INCLUDING:"}, {"tag": "p", "text": "*New talents, feats, weapons and equipment for soldiers and military heroes."}, {"tag": "p", "text": "*Exclusive information on new material from The Clone Wars television series."}, {"tag": "p", "text": "*Guidelines for running military campaigns."}, {"tag": "p", "text": "*Rules for designing bases and battlestations for your heroes to raid or defend."}, {"tag": "p", "text": "*New campaign content, including a full-length adventure."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}