{"url": "Galaxy_Ways", "categories": ["Category:Legends articles", "Category:Amusement parks"], "nodes": [{"tag": "h1", "text": "Galaxy Ways"}, {"tag": "p", "text": "Galaxy Ways was an amusement park on the planet Aralia. It offered a variety of rides, shops, restaurants, and hotels. Its mascot was Ronnie the Rocketpack Rodent. Eventually the park developed problems with Aralia's Ranat population. The park administrators managed to keep the rodents at bay for a time, but the creatures eventually attacked en masse."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Galaxy Ways was located on the planet Aralia. The resort offered varied attractions, including thrill rides, restaurants, hotels, and shops. Sections of the park were often closed down, especially after sightings of Ranats became more common. The park mascot was a character known as Ronnie the Rocketpack Rodent. In-park shops offered Ronnie merchandise, including full-body costumes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The developers of Galaxy Ways constructed the park on the planet Aralia after another park, known as Project Aralia, was completed. Afterward, much of the world's landmass was devoted to resorts and tourism. As offworlders flocked to Aralia, Galaxy Ways helped project an image of a world with unusual rides, fine dining, and thrifty shopping."}, {"tag": "p", "text": "Meanwhile, Aralia's Ranat populations continued digging out their warrens beneath the park. Unbeknownst to Galaxy Ways' management, the new resort had provided the rodent-like species with a new source of food: its patrons. As the problem became evident, the park administrators tried to combat the Ranats with exterminators. Nevertheless, the Ranats killed them. Management then adopted a quick-response system by which they closed portions of the park where Ranat activity had been detected."}, {"tag": "p", "text": "During one off-season, however, these measures proved futile. Several Ranat tribes joined forces and planned a massive assault on the park and its patrons. They first cut through the park's power supplies with their sharp incisors, then they saw to it that any starships near the park were made inoperable. Finally, they attacked, ten Ranats to each guest."}, {"tag": "p", "text": "The Ranats carried away any tourists they could find, leaving nothing but bloodied strips of clothing, tell tale claw marks, and shrieks of horror to warn the rest of the park's guests. For their part, the park visitors had no weapons with which to defend themselves. Escaping their grisly fate became the order of the day."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galaxy Ways appears in an adventure seed in the Star Wars Gamemaster Screen, a West End Games product for Star Wars: The Roleplaying Game.\nThe seed places the player characters in the park as guests who must themselves escape the Ranat hordes and make it to safety. The book's author, Bill Olmesdahl, suggests that the adventure should have the tone of a zombie film, with the characters unsure whether they will be eaten by the ghoulish Ranats at any moment. Nevertheless, he suggests that such a scenario may be too dark for some gaming groups and offers variants accordingly. He proposes, for instance, that instead of being driven by hunger, the Ranats might instead have adopted Ronnie the Rocketpack Rodent as their new deity. They are thus stealing Ronnie merchandise, including any hapless characters who happen to be wearing a full Rocketpack Rodent costume."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}