{"url": "Galderian/Legends", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Galderians", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Galderian"}, {"tag": "p", "text": "Galderians were goat-like sapients indigenous to Galdar."}, {"tag": "h2", "text": "Appearance"}, {"tag": "p", "text": "Galderians were average size and medium build, with \"skin\" that both looked and felt like tanned leather and was just as tough. Their facial appearance was goat-like, with long, curving horns protruding from the tops of their heads. They also had short tusks, which came out from the bottom of their mouths, pointing upwards, and upturned black noses. Much of their faces, including the tusks and horns, was as hard as bone compared to the rest of their skin, which was simply tough."}, {"tag": "h2", "text": "Temperament"}, {"tag": "p", "text": "Whenever Galderians were encountered, they were rather unruly and obnoxious and treated other races as nothing more than trade merchandise. This stemmed from the entire race being slavers or scavengers. Their speech consisted of short, sharp bursts, which added to their loathsome appearance."}, {"tag": "h2", "text": "History and culture"}, {"tag": "p", "text": "Galderians originally came from the planet Galdar, though most if not all of the species left their home planet to become slavers at some point in their lives. For centuries they scoured the galaxy, looking for nothing other than profit and the pleasure they received from raids, which gained them a well-deserved reputation as slavers. Though not known for sure, it is assumed that the Galderians either stole or hijacked all of their ships and equipment. Most of their space force consisted of Space ARCs loaded with I-BEAM Star Fighters. It is possible the creators of these ships were a slave race to the Galderians, or possibly wiped out by them, as the Galderians do not appear to have the ability to create such technological marvels, the likes of which could possibly match that of the Mon Calamari."}, {"tag": "h2", "text": "Sources"}]}