{"url": "Galduran_Calrissian%27s_smuggling_ring", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Smuggling organizations"], "nodes": [{"tag": "h1", "text": "Galduran Calrissian's smuggling ring"}, {"tag": "p", "text": "A male smuggler named Galduran Calrissian led a smuggling ring in Hutt Space by the year 3956 BBY. Despite its location, Calrissian's organization was not sanctioned by the Hutt species, who controlled the region. Due to the ring's unsanctioned nature, Calrissian became infamous and was forced to sell his belongings to avoid becoming the last of his line."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Jedi Civil War fought between the Galactic Republic and the Sith Empire, a smuggling ring had been run by a smuggler named Galduran Calrissian in the region of the galaxy known as Hutt Space. By the year 3956 BBY, the organization had made Calrissian's name infamous, because the ring was not sanctioned by the Hutts, the species who controlled Hutt Space. The infamy eventually placed Calrissian in a situation in which he was forced to sell his personal effects, including his utility belt, to keep from becoming the last of the Calrissian line."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galduran Calrissian's smuggling ring was first mentioned in Star Wars: Knights of the Old Republic, a 2003 video game produced by BioWare. The ring was briefly mentioned in the game through the description for Calrissian's belt, which was a unique item that the player could purchase from Crattis Yurkal on Dantooine. However, the item description did not specify the fate of Calrissian's smuggling ring. An entry on the belt, which did not mention the smuggling ring, was included in Knights of the Old Republic: Prima's Official Strategy Guide by Prima Games and spelled Calrissian's first name \"Garduran.\" This article was written with the assumption that the spelling in the game was correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}