{"url": "Galen_Marek%27s_lightsaber", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Galen Marek's lightsaber"}, {"tag": "p", "text": "Galen Marek's lightsaber was the Sith weapon of the Dark Lord Darth Vader's secret apprentice, a Force-sensitive assassin codenamed Starkiller. The apprentice's lightsaber was of a skeletal and utilitarian design. Intended for both training and combat purposes, it served multiple purposes such as the many sparring matches between the apprentice and his holodroid PROXY, as well as meditation sessions in which he concentrated on telekinetically reassembling his lightsaber."}, {"tag": "p", "text": "As his training neared completion by 3 BBY, the apprentice was dispatched on a series of tasks to assassinate three fugitive Jedi Masters—Rahm Kota, Kazdan Paratus and Shaak Ti. Upon the completion of his final trials, Vader betrayed his apprentice on the orders of Emperor Palpatine, and cast him out into space. As a result, Marek's lightsaber was lost in the vacuum of space, though he was ultimately saved from death by his Sith Master in order to be redeployed on several new missions that would lead to the formation of the Rebel Alliance. Due to the loss of his apprentice's lightsaber, Darth Vader provided Marek with another lightsaber as a replacement."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "Galen Marek's first lightsaber appeared to be based on the design utilized by Darth Vader, featuring an emitter shroud and a mostly solid casing. However, rather than follow the over-sized, bulky design of his master's weapon, Marek opted for a considerably more skeletal make. His weapon featured an exposed crystal chamber, and rather than include a handgrip, the whole of the weapon was sheathed in somewhat tarnished looking bare-metal. The blade utilized a set of red crystals supplied by Vader."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Like much of Galen Marek's training, the circumstances of the lightsabers creation were brutal. As a child, Marek once ordered PROXY to chain him up and not give him food or water until he could take apart and rebuild the lightsaber using only the Force. He did not succeed, and PROXY was forced to release him from his bonds. While this early effort was a failure, Marek did eventually succeed in crafting a lightsaber, and it saw frequent use in training duels with his droid, PROXY, and even with Vader himself. One such match lasted for hours, with Vader simply holding off Marek until the apprentice collapsed from exhaustion. At one point, Marek was sent on a mission to Yuzzem homeworld Ragna III, where he discovered that Vader had sabotaged the lightsaber, forcing Marek to fight off the Yuzzem with his Force powers."}, {"tag": "p", "text": "Marek wielded the lightsaber against a Jedi for the first time when he was sent to eliminate Rahm Kota, who was attacking an Imperial shipyard above Nar Shaddaa. Carving his way through the facility, killing Imperials and Kota's men alike, as per Vader's orders to leave no witnesses, Marek finally engaged Kota within the command center of the shipyard. After a heated duel, Marek bested Kota by blinding him with his own blade, pushing it into his face during a blade-lock. The lightsaber would subsequently see use against Kazdan Paratus on Raxus Prime, though Marek would be forced to best Paratus with his Force abilities, due to Paratus' lightsaber skills."}, {"tag": "p", "text": "On his way to reporting back to Vader, Marek telekinetically dismantled and reassembled his lightsaber while in meditation, though he was interrupted by a communication from Vader, breaking his concentration and scattering the lightsaber components across the floor of his ship's onboard training room. Marek was ordered to travel to Felucia and eliminate Shaak Ti, one of the last surviving members of the Jedi Council. Confronting Ti, Marek only narrowly managed to defeat her, impaling her with his own blade while only barely blocking her attack with telekinesis. Returning to Vader to report his success, Marek was betrayed, his existence having been found out by Emperor Palpatine. On Palpatine's orders, Marek was thrown into the vacuum of space, and lost the lightsaber to the void."}, {"tag": "p", "text": "Galen Marek's near dead body was quickly retrieved, and after a recovery period, he resumed his service to Vader, wielding Kota's lightsaber as a replacement for his original weapon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The loss of Galen Marek's lightsaber is a plot element exclusive to the novelization of Star Wars: The Force Unleashed, with the various game versions and the graphic novel adaptation depicting Marek continuing to use his original lightsaber, albeit with a blue blade. Likewise, versions of the game allowed Marek to replace the hilt and crystals with others that could be collected by the player. However, due to the inconsistencies between the various game versions of the story on numerous plot points, the novelization is generally accepted as the final word, so the loss of Marek's lightsaber is considered part of Legends canon."}, {"tag": "p", "text": "In the non-canon dark side alternate ending, Marek slays Darth Vader, but is defeated by Darth Sidious on the Death Star and reconstructed as a cyborg to serve as his apprentice. In the Ultimate Sith Edition DLC, Lord Starkiller can be seen with his old lightsaber on his belt, along with those of Vader, Kota, Darth Maul and Kazdan Paratus. By this point, the Sith Lord has taken to using a new lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}