{"url": "Galena_Rans", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Females", "Category:Mirialans", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Galena Rans"}, {"tag": "p", "text": "Galena Rans was a female Mirialan who served as Supreme Chancellor of the Galactic Republic succeeding Jebevel Madon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Before her political career, Galena Rans used to be a bomber wing commander in the Republic Navy four-thirty-ninth bomber wing. She would eventually marry Supreme Commander Rans and earned her status of veteran. This allowed her to keep close ties with the Republic Military. Galena Rans was a fierce critic of Leontyne Saresh, and following her attempt to assassinate the Alliance Commander, Rans rose to power. After Chancellor Jebevel Madon resigned, she became Supreme Chancellor of the Galactic Republic. She counted with the support of Supreme Commander Jace Malcom, which strengthened the Republic's position across the galaxy. Her military background as a bomber wing commander allowed her to gain support from Republic hardliners, and her desire to give the Senate more power earned her support from people that believed that Saresh was a dictator."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Following Galena Rans rise to chancellorship, she kept a charismatic attitude, a no-challenge-too-big confidence and the casual demeanor of a fighter pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galena Rans was first mentioned in the Star Wars Legends continuity in BioWare's 2011 massively multiplayer online role-playing video game Star Wars: The Old Republic, specifically the 2017 5.6 A Traitor Among the Chiss update for the 2016 Knights of the Eternal Throne expansion."}, {"tag": "p", "text": "Rans first appearance was in the 2016 Star Wars: The Old Republic: Onslaught expansion. Rans only appears in the Republic plotline of the expansion."}, {"tag": "h3", "text": "Gameplay alternatives"}, {"tag": "p", "text": "If the player aligns with the Sith Empire and kills Jace Malcom during the Iokath storyline, a news broadcast in the flashpoint \"A Traitor Among the Chiss\" states that Chancellor Madon resigned, and the Republic had an interim chancellor named Galena Rans. Alternatively, if the player sided with the Republic during the Iokath storyline and into the Onslaught expansion, Galena Rans will still be Supreme Chancellor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}