{"url": "Galen_Torg", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alderaanians", "Category:Alliance Army personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Galen Torg"}, {"tag": "p", "text": "Galen Torg was a Human male native of the planet Alderaan, who served as a military officer on his homeworld. By some point surrounding his planet's destruction by the Galactic Empire's DS-1 Orbital Battle Station in 0 BBY, Torg joined the Rebel Alliance, and retained his ceremonial dress uniform during his service. That year, the Alliance managed to destroy the DS-1 Orbital Battle Station in the Yavin system. Torg was selected to serve as a Rebel Honor Guard sentry for the ceremony held to honor the Heroes of Yavin at the Alliance's headquarters on the moon Yavin 4."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Galen Torg hailed from the planet Alderaan during the Galactic Civil War, a conflict between the Rebel Alliance and the Galactic Empire. At some point by 0 BBY, Torg served as a military officer on Alderaan. That year, the Empire used their DS-1 Orbital Battle Station superweapon—code named the Death Star—to destroy Torg's homeworld. Torg was among the surviving Alderaanians, and also retained his ceremonial dress uniform. By then, he had also joined the Alliance, and continued to use his uniform in the Alliance."}, {"tag": "p", "text": "In 0 BBY, the Battle of Yavin occurred, during which the Alliance's starfighters destroyed the Death Star in the Yavin system. Following the battle, a ceremony was held in the Grand Audience Chamber of the Great Temple, the Alliance's headquarters on the moon of Yavin 4. Torg was among the soldiers selected to serve as Rebel Honor Guard sentries for the occasion. Torg stood in front of the Chamber's entrance during the ceremony, which honored the Heroes of Yavin: pilots Luke Skywalker, Han Solo, and Chewbacca."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Galen Torg was loyal to the Rebellion, and typical of the Alliance's hard-working, unsung heroes. As a survivor of Alderaan, and as a reward for his dedication and courage, he was selected to serve as part of the honor guard at the award ceremony as thanks for the Heroes of Yavin's destruction of the Death Star. Torg stood at a height of 1.8 meters and had fair skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Torg wielded an electropole, along with a blaster pistol and grenades. He also owned a comlink and a pair of macrobinoculars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galen Torg first appeared as an uncredited honor guard extra visible during the ending award ceremony scene of 1977's Star Wars: Episode IV A New Hope. In 1989, the first edition of West End Games' Galaxy Guide 1: A New Hope sourcebook mentioned the name \"Galen Torg\" as an example of a standard Rebel soldier for use with Star Wars: The Roleplaying Game, providing him mainly roleplaying statistics. The book did not establish that Torg was any Rebel character who appeared in A New Hope. In 1995, the Premiere Limited edition of the Star Wars Customizable Card Game was the first source to identify Galen Torg as one of the honor guard extras seen at the end of the film."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "In 1987, the comic Droids 8 depicted the award ceremony scene, and included Galen Torg and the other sentry guarding the entrance to the Grand Audience Chamber. However, they are depicted with significantly different uniforms than what was shown in the A New Hope film."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "A re-imagining of the award ceremony which included sentries standing at the entrance was included in the 2006 non-canon video game LEGO Star Wars II: The Original Trilogy, along with 2007's LEGO Star Wars: The Complete Saga. However, their uniforms are the uniforms of Rebel troopers belonging to the Alliance Fleet, as opposed to the canonical Honor Guard uniforms."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}