{"url": "Galiir_Ac_Yandar", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Mercenaries", "Category:Talusians"], "nodes": [{"tag": "h1", "text": "Galiir Ac Yandar"}, {"tag": "p", "text": "Galiir Ac Yandar was a Human male who lived on Talus during the Galactic Civil War. He was the leading member of the Nightstrike Soldier Hegemony, a mercenary organization."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Galiir Ac Yandar was the leader of the Nightstrike Soldier Hegemony, a mercenary organization that operated on the planet Talus. During the Galactic Civil War between the Galactic Empire and the Rebel Alliance, the N.S.H. was affiliated with the Galactic Empire and directly involved in the fight against the Rebellion."}, {"tag": "p", "text": "After the Battle of Yavin, Galiir Ac Yandar was seeking to make his unit a full military branch of the Imperial armed forces rather than a separate entity. Circa 1 ABY, Ac Yandar met Imperial Colonel Braedic Ekirk in his office in Dearic to negotiate the new operational status of the Nightstrike Soldier Hegemony. Ekirk deeply despised Galiir but considered that the N.S.H. could be a valuable asset for the Empire. However, the negotiations were disturbed when slicers of the Aggregate Civil Liberties Organization, an anti-Imperial movement, planted information in Ac Yandar's computer that almost ruined his reputation with the Empire. Colonel Ekirk thus dispatched a spacer to raid the A.C.L.O. office. The spacer was recommended by CorSec officer Dathnaeya Loessin who wanted to determine what kind of people the Rebellion and the Empire had chosen to work with. Colonel Ekirk tasked the spacer to slain A.C.L.O. terrorists who sabotaged Imperial shipments. In addition, Galiir Ac Yandar ordered the spacer to kill Leeta Poandeu, the slicer who was responsible for slicing his system. Furthermore, Galiir Ac Yandar requested the spacer to assist Mark Hieks, a N.S.H. covert operative infiltrated in the A.C.L.O. office, in placing monitoring devices on the A.C.L.O's computers. The spacer eventually achieved all those objectives and was rewarded by Galiir Ac Yandar for the assistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galiir Ac Yandar appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Galiir Ac Yandar was added to the game as part of the \"Crisis of Allegiance\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}