{"url": "Gall_Trayvis", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Humans", "Category:Imperial Senators", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gall Trayvis"}, {"tag": "p", "text": "Gall Trayvis was a male human politician who served as a member of the Imperial Senate during the reign of the Galactic Empire. He left the Imperial Senate and posed as a dissident Senator, one critical of the Imperial regime, in order to lure rebellious forces towards destruction."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gall Trayvis served as a member of the Imperial Senate after the rise of the Galactic Empire. According to rebel fighter Hera Syndulla, Trayvis was the only Imperial Senator who spoke out against the Galactic Empire. In reality, Trayvis remained an Imperial agent and simply posed as a dissident and exiled politician, which allowed him to gain the loyalty of rebel forces and lead them towards their destruction."}, {"tag": "p", "text": "Five years before the Battle of Yavin, Trayvis sent a message via a hacked HoloNet News transmission stating that Jedi Master Luminara Unduli had survived the Clone Wars and was being imprisoned on Stygeon Prime. The rebels mounted a rescue mission, but found that Unduli was dead and that it was a trap by the Grand Inquisitor. He later broke into Kastle's report on the death of Master Unduli telling citizens not to trust the Empire's account and to keep her memory alive, though his loyalties meant that the message was a ruse."}, {"tag": "p", "text": "A short time later, Trayvis sent out another broadcast, this one on the fifteenth anniversary of the rise of the Empire. Trayvis' message, which was seen in such establishments as Old Jho's Pit Stop on Lothal, urged Imperial citizens to boycott celebrations associated with Empire Day as a form of protest against what Trayvis decried as the injustices of the Imperial regime. Given his loyalties, this message was also likely a ruse, possibly to lure out protestors against the Empire and get them arrested."}, {"tag": "p", "text": "After the events of Empire Day, he broadcasted a message hoping to lure the Lothal rebels to the Lothal City Capitol Building on Lothal. In reality, Agent Kallus of the Imperial Security Bureau and Minister Maketh Tua were orchestrating a covert operation to capture the Lothal rebels. The Lothal rebels managed to find Senator Trayvis in the building, but were quickly ambushed by stormtroopers. While Trayvis tried to convince the rebels to surrender, the rebels managed to escape after Sabine Wren and Garazeb Orrelios dropped smoke bombs from the rafters. Travyis and his rebel would-be rescuers then fled into the old sewers beneath Lothal's Capital City. During the escape, Trayvis feigned exhaustion in order to buy time for the stormtrooper pursuers. They eventually split up, and the senator was escorted by Ezra Bridger and Hera Syndulla."}, {"tag": "p", "text": "When they reached a large fan generator Hera, who suspected Travyis' treachery, handed him her blaster. Travyis then took the opportunity to show his true colors and attempted to take them captive. Travyis told Hera and Ezra that he was actually helping the Empire to find and hunt down rebels. He also revealed that he had known Ezra's parents and claimed responsibility for their deaths, mocking the Bridgers for recklessly throwing their lives away in the name of freedom rather than submission. As he tried to kill them, he discovered that Hera had not charged her blaster, having suspected his true loyalties from his recent actions. Hera then punched him, knocking him out. When Trayvis came to, the rebels had escaped and Kallus looked at him with disgust."}, {"tag": "p", "text": "Following the failed Imperial operation, Trayvis was interviewed by the HoloNet News anchor Alton Kastle. During the interview, Trayvis confirmed that he had \"recommitted\" himself to the Empire and claimed that he wanted to make the Empire a better place through peaceful means. He also took the opportunity to denounce that the Lothal rebels, whom he labeled insurgents, for twisting his message into something violent and frightening. At the end of the broadcast, Travyis announced that he was offering a reward for their capture. Travyis' broadcast prompted the Lothal rebels to hijack the Imperial Communications Center at Jalath in order to broadcast their own message to the people of Lothal."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gall Trayvis was a human male with fair skin and blue eyes. Five years before the Battle of Yavin, his appearance was that of an older man, with dark but graying hair. He posed as a dissident Senator who despised the Empire and its authoritarian regime, and one who applauded any and all rebellious activity. In reality, however, he was still loyal to the Empire and secretly enjoyed the terrible fates that rebels would suffer due to his actions. When meeting Ezra Bridger, he coldly mocked his parents for their dissidence and cruelly revealed that he had had a hand in their disappearance. He was also a coward, as he had an arrogant and self-assured demeanour when he had the rebels at gunpoint, which dissolved into snivelling weakness when disarmed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gall Trayvis first appeared as a voice over the HoloNet in \"Rise of the Old Masters,\" the fifth episode of the first season of the animated television series Star Wars Rebels. He was voiced by Brent Spiner, who is known for playing Lieutenant Commander Data in Star Trek: The Next Generation."}, {"tag": "p", "text": "Initially, Trayvis was to be featured in Claudia Gray's novel Leia, Princess of Alderaan, in which his homeworld would have been revealed as Osk-Trill. However, in the final version of the book, he was replaced by Cinderon Malpe of Derella."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}