{"url": "Gall/Legends", "categories": ["Category:Legends articles", "Category:Arboreal moons", "Category:Cadavine sector", "Category:Galactic Empire moons", "Category:Gall locations", "Category:Outer Rim Territories moons", "Category:Type I atmosphere moons"], "nodes": [{"tag": "h1", "text": "Gall"}, {"tag": "p", "text": "Gall was a terrestrial moon of the gas giant Zhar in the Zhar system. It had a population of 57 million, mainly Humans."}, {"tag": "p", "text": "The moon was dotted by forests and canyons. One such canyon, the Smuggler's Canyon, was the location of an Imperial Enclave. A species of bioengineered Wampa were known to inhabit the canyon."}, {"tag": "p", "text": "During the Clone Wars Gall was the location of a naval supply depot and factories that made parts for Rothana Heavy Engineering. The factories were overseen by the clan of Cacique Jans Coorsa. The Council of Elders decided to secede from the Galactic Republic and join the Confederacy of Independent Systems. The Republic couldn't afford to lose such an important planet and lay siege to the planet. Jans Coorsa led the resistance against the Republic and gained the nickname 'Phantom of Gall' for his ability to plan complex operations and correctly guess Republic responses. The resistance continued even when the Republic turned into the Galactic Empire. The Empire managed to find out the identity of the 'Phantom of Gall' and massacred Coorsa's village."}, {"tag": "p", "text": "Prior to the Battle of Yavin, Gall contained a Regional Naval Supply Area used by the Imperial Navy to resupply ships assigned to oversee construction of the first Death Star."}, {"tag": "p", "text": "Following a dogfight with IG-88D over Tatooine, the Imperials granted Boba Fett access to the ship docks of the Enclave to repair the Slave I. Leia Organa hired Dash Rendar to scout out the Smuggler's Canyon in search of the rogue bounty hunter, who was still carrying his hostage and prize, Han Solo. Rendar made his way through the station and located Fett's hangar bay, where he damaged Slave I, requiring Fett to stay on the moon longer."}, {"tag": "p", "text": "This gave the Rebel Alliance an advantage. The Alliance Fleet moved into the system, where they engaged the Imperial Navy. Dash led the Millennium Falcon to Fett, where he abandoned his allies."}, {"tag": "p", "text": "Two assassination attempts on Luke Skywalker occurred during the battle; Wes Janson's droid opened fire on Luke's fighter, and Viera Cheran nearly killed Luke on Kile."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}