{"url": "19,000_BBY", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Years in the Great Manifest Period"], "nodes": [{"tag": "h1", "text": "19,000 BBY"}, {"tag": "p", "text": "19,000 before the Battle of Yavin (BBY) was a year in the Galactic Republic's Great Manifest Period. The era, having begun 1,000 years earlier, featured rapid expansion out from the Core Worlds and into the areas of Wild Space east of the galactic center. Outside the galactic disc, the isolated world of Kamino underwent a dramatic climate change. There, the surface ice began to melt and flood the planet, forcing the native sentient species to relocate their cities."}, {"tag": "h2", "text": "Proem"}, {"tag": "p", "text": "In the years prior to 19,000 BBY, the planet Kamino was a terrestrial world outside the galactic disc that featured only small narrow oceans. Landlocked, the oceans were overpopulated with eels and cetaceans that choked the waters. On land, small marshes and low-lying areas had given rise to the tall, sleek Kaminoan species. The natives developed cities along the oceanic coastal areas, such as the community Derem."}, {"tag": "h2", "text": "The galaxy in 19,000 BBY"}, {"tag": "p", "text": "Around the year 19,000 BBY, Kamino began a dramatic climate shift. The surface ice, which was confined to the planetary glaciers, began to melt. As it melted, the low-lying marshes that gave rise to the Kaminoans and the narrow oceans began to flood, covering the then-extant land area. Elsewhere, in the Galactic Republic, the Great Manifest Period was continuing. The Republic continued its expansion and settlement of the areas east of the Core Worlds, into the area that eventually came to be known as \"the Slice.\""}, {"tag": "h2", "text": "Impact"}, {"tag": "p", "text": "Within two centuries, all the surface land on Kamino was buried under water, which was hundreds of meters deep at places. The former cities, such as Derem, and architectural wonders, such as the Clock Spires of Harai Nova, were submerged. For survival, the Kaminoans adapted the technology they possessed to build their cities on stilts above the water level. Furthermore, the Kaminoans turned to genetic engineering to preserve many of the species that drowned in the rising waters. In the broader Republic, the expansion of the Great Manifest Period continued for another 2,000 years, until the rival Core Worlds began a series of conflicts for supremacy."}, {"tag": "h2", "text": "Notable events"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The year 19,000 BBY receives its only appearance in The Essential Atlas, published in 2009. While the Great Manifest Period is outlined in other sources, such as The New Essential Chronology, the year 19,000 BBY is not specifically mentioned. In the Atlas, the year is specifically mentioned in the discussion of the planet Kamino, where the detailing of the planet's climactic shift is documented. Elsewhere in the Atlas, the year is merely alluded to in discussion of the Great Manifest Period."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}