{"url": "Alexem", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Squibs"], "nodes": [{"tag": "h1", "text": "Alexem"}, {"tag": "p", "text": "Alexem was the elder of a village of Squibs on the planet Holador. His tribe was descended from a group of Squibs who crash landed on the world circa 221 BBY and had since adopted a primitive lifestyle. Alexem was a respected member of the tribe, the protector of its Holy Icon—a nonfunctional comms relay—and a resolver of his tribe's disputes."}, {"tag": "p", "text": "In 21 BBY, a Twi'lek woman named Kelyan appeared in the village with tales of a band of evil offworlders who were close behind her. While the village warriors itched to defend their loved ones, Alexem urged caution and sent warriors to invite the strangers to come and explain their presence to him. Once they arrived, Alexem weighed both parties' stories. He declared that the Twi'lek had been lying and that the outsiders were to be treated as guests before letting them continue on their way unmolested."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Alexem was a male Squib born in a primitive village on the planet Holador. His people were descended from Squib spacers who survived their vessel's crash landing on the world circa 221 BBY. Despite their distress signals, no rescue came for the survivors, and their technology slowly failed. Over seven generations, they adapted to primitive living conditions and learned to eke out an existence by hunting and gathering. That they would someday be saved from their lot by people from the stars became an intrinsic part of their mythology. Technological items were recycled for more basic purposes, and the comms relay came to be seen as a Holy Icon. Alexem was one of the last Squibs in his tribe to retain knowledge of Basic, and he rose to be the elder of the 50-Squib village in the later days of the Galactic Republic."}, {"tag": "p", "text": "In 21 BBY, an outsider appeared, a Twi'lek named Kelyan. At first, the Squibs were skittish around her, but she spoke Squibbian and used it to regale the tribe with the exploits of her companions and their battle with a group she referred to as the Assassin Lords and their minions. The villagers slowly came to trust the stranger, even to like her, but Alexem was not so sure of her intentions. There was something about her that he did not like, and he hid his ability to speak Basic from her. He thought it better to hear both sides of the debate before making up his mind."}, {"tag": "p", "text": "Some days later, a scout returned from the tunnels neighboring the village with news of another group of offworlders. Kelyan warned that these were the evil beings whose misdeeds she had been recounting, and the edgy Squib warriors called out for the strangers' blood. Nevertheless, Alexem ordered a group of warriors to find these outsiders, invite them to the village, and escort them back to the Squibs' home. Alexem did not intend to treat the outsiders with violence—unless they proved the woman's story to be correct."}, {"tag": "p", "text": "That evening, the warriors returned with the so-called villains in tow, and the Twi'lek woman chided them for their supposed misdeeds. The village warriors seemed more on edge than ever, but Alexem ordered them to hold off. Revealing his knowledge of Basic, he told the outsiders to explain who they were and what they were doing on Holador. A bitter back-and-forth ensued with the Twi'lek and the strangers arguing for their respective innocence and the other side's duplicity. In particular, the group of strangers claimed to have crash-landed on Holador as part of an elaborate trap set by the Twi'lek and her companions, a band of bounty hunters who were trying to kill them."}, {"tag": "p", "text": "Alexem weighed both sides' words carefully and came to his decision: The outsiders appeared to mean no harm to his people, so they would be allowed to leave in peace. He decided that his village would even aid them in whatever way they required. As for Kelyan, Alexem declared that despite her mendacity, she was a guest of the village and had not actually broken any of the tribal laws."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Alexem was old for his species. During village business, he sat in a decrepit flight chair near the fire pit at the center of the village with the Holy Icon to his back. The elder wrapped himself in thick blankets that left only his eyes and ears visible. He was wise and patient, calming his warriors' tempers and insisting on hearing both sides of a dispute before coming to a decision. Alexem spoke Basic, albeit imperfectly: his accent was thick and his command of vocabulary and usage were far from perfect."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alexem appears in Strike III, an adventure for the Living Force campaign of the Star Wars Roleplaying Game from Wizards of the Coast. The Squib and his village are part of an encounter in which the player characters are expected to rely on roleplaying and non-combat abilities to advance their quest. Meanwhile, they must contend with Kelyan, who is doing her best to convince Alexem and his tribe that the player characters are dangerous and should not be allowed to leave the village alive."}, {"tag": "p", "text": "In an encounter with a Squib scout from Alexem's village, the player characters may react cautiously and amicably, or they may treat the scout aggressively. Should they choose force and intimidation, Alexem's warriors attack them rather than escort them to the village. The scenario considers fighting to be the wrong course of action, however, and penalizes such behavior by pushing such characters further toward the dark side of the Force."}, {"tag": "p", "text": "Once at the village, the outcome of the encounter depends on players making good die rolls and thinking of ways to curry favor with the elder and the Squibs, such as offering technological items, rations, or medical assistance. Should they do poorly, the Squib warriors attack. Success means that Alexem and his companions decide that the outsiders are in fact harmless and befriend them. As the best possible outcome, this is considered the canonical path."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}