{"url": "Alexi_Garyn", "categories": ["Category:Legends articles", "Category:Force-sensitives", "Category:Humans", "Category:Males", "Category:Ralltiiri", "Category:Vigos"], "nodes": [{"tag": "h1", "text": "Alexi Garyn"}, {"tag": "p", "text": "Alexi Garyn, nicknamed \"Lex\", was a male Human member of the criminal syndicate Black Sun. Serving as a Vigo for decades, Garyn eventually attained the rank of Underlord, the highest position in the organization. Leading the Vigos in the years before the return of the Order of the Sith Lords during the last decades of the Galactic Republic, Garyn saw the syndicate grow to great strength during his reign. Garyn and the rest of the Black Sun leadership were brutally slaughtered during an attack by the Sith Darth Maul in 33 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Human male Force-sensitive born on Ralltiir, Alexi Garyn was not identified by the Jedi Order at an early enough age, resulting in him being passed over by the Order as he was too old to begin the training. His dream of joining the ranks of Jedi Knights diminished, Garyn decided to develop his talents in a different way, turning to crime and becoming a member of the crime syndicate Black Sun."}, {"tag": "p", "text": "By the year 76 BBY, the Vigos of Black Sun were already preparing young Garyn to take control of the organization; having already attained the rank of Vigo himself, it would only be a matter of years before he won the position from his competition, such as Boss Cabra. Despite some conflict between Damask Holdings and their support for Boss Cabra, Garyn attained the position of Underlord which he had desired and began to make many friends among the galaxy. Under his leadership, Black Sun built a reign of fear felt on every planet from the Core Worlds to the Outer Rim Territories. Even with thousands of soldiers to execute his every order, Garyn kept himself in his fortress on Ralltiir surrounded by a cadre of elite guards. Under his direct command were the nine Vigos, his own personal bodyguard, an extremely skilled female warrior called Mighella, and his trusted secretary Oolth."}, {"tag": "h3", "text": "Enemy of the Sith"}, {"tag": "p", "text": "During the reign of King Ars Veruna of Naboo, Garyn earned a seat at his royal table during a feast to drown out the applause outside Theed Palace for Veruna's competitor Padmé Naberrie; the feast coincided with the infamous Trade Summit on Eriadu. Taking over the export of Naboo's rare plasma, Garyn supported Veruna's staunch opposition of Magister Hego Damask, whom Garyn felt had betrayed the trust of the Vigos of Black Sun but who also threatened to usurp the possibility for the self-same lucrative plasma-export contract with Naboo."}, {"tag": "p", "text": "Unbeknownst to Garyn, Naboo's Senator Palpatine—who had (on his way to the Eriadu Summit) stopped briefly to also attend the feast in Veruna's court—was Darth Sidious, Sith apprentice of Magister Damask, the alter-ego of Darth Plagueis. In Palpatine's view, Garyn's presence at the feast marked him for death, as his dark master had viewed Garyn's relationship with Veruna as a clear signal of betrayal—just as the Black Sun overlord's subsequent collusion in Veruna's catastrophic nuclear attack on the Muun's fortress on Sojourn would irreversibly seal his fate. Although Sidious himself was the true mastermind behind the attack (which surprisingly failed in its aim to assassinate Damask), he and his master agreed that the Zabrak assassin Darth Maul (who himself, also ironically, had originally secured the proscribed nuclear device) should be sent to eliminate the Vigos and Garyn in swift retribution for their treacherous involvement—an untraceable Sith attack that would effectively cripple the formidable crime syndicate for many years to come and make it exceedingly difficult for them to regroup. Plagueis and Sidious believed that Black Sun, as it existed, was too much of a threat and an unnecessary hindrance to the Grand Plan, to a swift Sith achievement of galactic conquest."}, {"tag": "p", "text": "Ordering Maul to hunt down two Vigos at first, Sidious anticipated that Garyn would detect the coming purge and order the surviving Vigos to his fortress on Ralltiir, believing they would be safe inside the impregnable castle. Following the deaths of Vigos Darnada and Morn, Garyn did just that; bring all the remaining Vigos to one location. Fortifying the complex in hopes of killing the Zabrak assassin, the Vigos and Garyn were gathered when Maul arrived, swiftly cutting through the bodyguards without suffering a single blow. As the Vigos attempted to escape, Garyn sealed them in the audience chamber while he, Mighella, and Oolth, escaped down a turbolift. As his Vigos met their deaths at the end of Maul's lightsaber, Garyn attempted to reach his yacht below the fortress but was caught by the assassin before boarding."}, {"tag": "p", "text": "Igniting his crimson lightsaber, Maul attacked the Nightsister Mighella, who was able to identify him as a Nightbrother of Dathomir before cutting her in half at the waist. While Oolth fled, Maul focused on Garyn and prepared to kill the man. Revealing himself as a Sith, Maul was distracted by his own pride and arrogance, and Garyn managed to attack the Zabrak, drawing blood. Enraged, Maul grabbed Garyn by the throat and drove him under the water, drowning Garyn and leaving his lifeless body in the small reservoir."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following the death of Garyn and the other Vigos, Black Sun spiraled out of control and all but collapsed, the few remaining members scattering over the next decade. Despite their apparent killing blow, Black Sun remained and several Vigos vied for power. An attempt to regulate bota with the Hutts during the Clone Wars failed and crippled the organization further. However, Black Sun would recover and emerge stronger then ever under the leadership of Underlord Dal Perhi, with help from a Falleen named Xizor, during the reign of the Galactic Empire. Despite this, surviving members of the organization's upper-tier who had served under Garyn would join together circa 0 ABY to form a group called the Garyn Raiders. Operating off of a base on the moon Rori, the Raiders targeted Imperial ships, avenging their fallen leader by harassing the Sith-governed Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}