{"url": "Galt", "categories": ["Category:Legends articles", "Category:Dagobah residents", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Galt"}, {"tag": "p", "text": "Galt was a Human man who grew up on Dagobah. His parents were part of a survey team from the Galactic Republic that arrived on the planet 40 BBY. However, all their equipment broke down and they were unable to leave the planet. They were forgotten by the Republic and were forced to make do on the hostile planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Galt was the oldest of 25 descendants from this survey team. The last of the original team died when he was seven years old, due to a fever that the children had developed an immunity to. Galt had stringy hair, pale skin, and was missing many teeth. He was extremely thin and the skin tightly stretched across his head made it appear skull-like. He dressed in rags."}, {"tag": "p", "text": "He and a companion were the first to encounter Platt Okeefe, Mammon Hoole, and their companions on Dagobah. The group were exploring the swamp when Zak Arranda fell into the slimy waters. Galt and his friend rose up from the waters to help but were mistaken for attackers. Okeefe quickly shot and killed Galt's companion, before Hoole ordered her to hold fire."}, {"tag": "p", "text": "Galt then led the team back to his home, a village they called The Shelter. There, he offered from hospitality he could, including a thin stew containing small strips of meat. Okeefe and her team were stranded on the planet for a few days while they dug their ship out of the swamp. During that time, Galt and the Children served as guides, showing them around the swamp. This was of vital importance when it was discovered that the legendary bounty hunter Boba Fett had followed Hoole to the planet. The Children tried to help the smugglers hunt down Fett, to no avail."}, {"tag": "p", "text": "Despite the hospitality of the Children, it turned out that they were cannibals, a habit they had learned from their parents. Stranded on Dagobah with few sources of meat, the parents had fed the dead to their children to keep them alive. The survivors saw this as the natural way of life. Galt himself converted his hut into a kitchen to cook his companion killed in the swamp, and then two limbs from the smuggler Traut which had been amputated. Zak Arranda realized what was happening when he found Traut's promise ring in his stew. Galt responded by locking Zak up in a cage—alongside the captive Boba Fett."}, {"tag": "p", "text": "Together Fett and Zak escaped the village, but the hunter took the boy captive—Zak and his sister Tash Arranda were the bounties he was pursuing. However, Okeefe and her crew managed to rescue Zak, who revealed the truth about Galt and the Children. Taking pity on them, Mammon Hoole rounded up all the Children when they left the planet. Okeefe put him in contact with the Rebel Alliance who would help him reintegrate Galt and his tribe back into galactic society."}, {"tag": "h2", "text": "Appearances"}]}