{"url": "Galtea", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Kathol sector planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Galtea"}, {"tag": "p", "text": "Galtea was a planet in the system of the same name, located within the Outer Rim Territories' Kathol sector. The world was situated near the edge of known space, on the border of the Marcol Void, an empty region of space thirty light-years across. Neutral in galactic politics, Galtea was only of cursory interest to the Galactic Empire, which established a small outpost on the planet and allowed the population a degree of autonomy."}, {"tag": "p", "text": "In 8 ABY, Galtea played host to the New Republic CR90 corvette FarStar when it laid over at the planet for repair and resupply. Due to the actions of an Imperial saboteur known as the Wraith who had become part of the corvette's crew, an Imperial task force of three ships arrived at Galtea to engage the FarStar. Outnumbered, the FarStar was forced to retreat."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Galtea was a terrestrial planet located in the system of the same name, in the Kathol sector of the Outer Rim Territories, situated at grid coordinates M-21. It was connected via hyperlane to the Pembric, Sebiris, and Timbra Ott systems. At Class One hyperdrive speeds, travel to Pembric II took a day and eight hours, transit to Sebiris took a day and three hours, while ships going to Timbra Ott had to follow the Galtea Run across the Marcol Void, which lasted fourteen days and six hours. A single moon orbited the planet."}, {"tag": "p", "text": "Galtea had a temperate climate with standard gravity and a Type I atmosphere that was breathable by Humans and other comparable races. At least two continents were present on the planet, and there was abundant arable land in the form of fertile open plains for farming. Untamed forests and mountain ranges covered the rest of the land mass of the planet. A day on Galtea lasted for twenty-two standard hours, and a year was composed of 277 local days. A small colony of 890,000 Humans lived on Galtea, ruled by agricultural and mining guilds. Computers, droids, luxury goods, and weapons were in high demand for import, while foodstuffs, medicinal goods, metals, and minerals were exported off-planet. A single spaceport with limited facilities on the northernmost continent served visiting starships, while a small Imperial outpost was located on the southern continent."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Galtea was settled as an agricultural colony due to the climate and accessibility of fertile land suited to farming. The Galteans were ruled by agricultural and mining guilds, and turned most of the fertile plains on the northern continent into cultivated land. Being on the limits of known space, Galtea was relatively untouched by the Galactic Empire during its reign. In exchange for access to the abundant natural resources on the planet, the Empire allowed the Galteans autonomy in their daily affairs. The Empire also established a small outpost on the planet's southern continent, which was their sole presence on Galtea."}, {"tag": "p", "text": "In 8 ABY, Imperial Moff Kentor Sarne, who had taken control of the Kathol sector four years previously after the death of Galactic Emperor Palpatine at the Battle of Endor and the fracturing of the Empire into various warlord states, was ousted from his capital on Kal'Shebbol by the New Republic. Escaping with the majority of his forces, the Moff fled the region. During his retreat, the Imperial outpost on Galtea was abandoned and destroyed."}, {"tag": "p", "text": "In the same year, the New Republic CR90 corvette FarStar arrived at the planet on the advice of procurement specialist Loh'khar the Finder to take on supplies and perform repairs before heading into the Marcol Void, an area of space thirty light-years across and devoid of any planetary systems. The Galteans welcomed the FarStar and its crew, and were happy to help in any way they could as long as the New Republic delegation could pay in hard currency. The FarStar also dropped off refugees whom they had acquired after an adventure on Pembric II, although the majority of them had agreed to sign onto the ship's crew. Captain Kaiya Adrimetrum, commander of the FarStar, intended to stay on the planet for a few days and permitted the crew to take shore leave."}, {"tag": "p", "text": "Unknown to the crew of the FarStar, one of the individuals who had joined them on Pembric II, a bouncer by the name of Drenn, was secretly an Imperial saboteur known as the Wraith who had been assigned by Moff Sarne to infiltrate the Bombaasa Cartel. After the events that saw Sarne retreat from Kal'Shebbol, the Wraith concluded that his mission was no longer needed and sought to rejoin with the Moff's forces. To that end, while on shore leave on Galtea, he gained access to a transmitter and sent a coded message that broadcast the FarStar's location, defensive capabilities, and his intent to hinder the chain of command by assassinating Adrimetrum. Having gained a position on the vessel's maintenance crew to obtain access to the ship's systems, the Wraith subverted one of the K4 security droids that guarded the bridge and installed a small projectile gun loaded with a miniature dart coated in a poison from the planet Sebiris within one of the droid's recessed cavities. He also placed a shaped charge near a power conduit on the bridge."}, {"tag": "p", "text": "At sunrise, the FarStar's crew became aware that three Imperial ships—a Strike-class medium cruiser, a Lancer-class frigate, and an Ton-Falk-class escort carrier—had entered the system. Adrimetrum immediately ordered the ship cleared for action and launched from the planet, leaving some of the crew on the surface to avoid being caught on the ground. The Imperial force engaged the FarStar, and the corvette began to take mounting damage from the offensive. Outnumbered, Adrimetrum ordered a retreat; the Wraith put his plan into motion, triggering both the hijacked security droid and shaped charge on the bridge. Both achieved their objectives; Adrimetrum was incapacitated by the dart's toxin and lapsed into a coma, and the FarStar's bridge lost power when the charge ruptured the conduit. The crew managed to restore power to the bridge by rerouting the flow through the life support backups, and the FarStar was able to withdraw to a nearby binary system to regroup and allow the crew to treat their commander."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Galtea supported 890,000 Galteans who considered themselves to be neutral and were largely indifferent as to the state of galactic politics. They had no problems dealing with either the Empire or the New Republic as long as they had the credits to pay for the services they needed."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Galtea supported a small limited-services spaceport on the northern continent that included a farmers market and a merchant's bazaar. A small Imperial outpost was located on the southern continent until its destruction in 8 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galtea first appeared in Traitor in our Midst, the sixth RPG adventure in The DarkStryder Campaign in 1995. It was written by Eric S. Trautmann and Paul Sudlow, with illustrations by Philip Tan. Galtea later received an entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "During the adventure, five minutes is allotted for the crew to return to the FarStar from shore leave before it will launch to engage the Imperial force. In this time, eighty-four crew members will reboard the vessel. The players can choose to delay takeoff for an extra five minutes to allow more crew members to board the ship, for a total of 114 returnees. However, if the takeoff is delayed, the escort carrier will be able to deploy its TIE/LN starfighters before the FarStar can launch its own T-65 X-wing starfighters. If there is no delay in launching, then the corvette's X-wings will be able to launch first. Regardless of which option is taken, some members of the FarStar's crew are left behind, as established by bridge Operations Officer Darryn Thyte in a narrative section."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}