{"url": "Gambler%27s_World", "categories": ["Category:Real-world articles", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "Gambler's World"}, {"tag": "p", "text": "Gambler's World is a comic strip that was distributed by the Los Angeles Times Syndicate and published in U.S. and Canadian newspapers. The series was written and drawn by Russ Manning. It was collected in Classic Star Wars: The Early Adventures 1–3, and was also available in the Webstrips section of Hyperspace."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "An Imperial fleet is chasing a Rebel fleet. Darth Vader is watching the battle from the ground and working on figuring out the Rebel strategy. Vader receives a call from Blackhole. Blackhole has the strategy Vader was seeking to learn. The Rebels are trying to spread their cause across the galaxy. Blackhole's orders are to go to Vorzyd V to stop Luke Skywalker and Leia Organa from disrupting the Imperial operation there."}, {"tag": "p", "text": "Luke, Leia, C-3PO and R2-D2 land on Vorzyd V. They will make the rounds of the casinos until they are contacted. They begin at the Casino Royale, but the droids are not allowed to follow them inside. Luke sees the game Cosmic Chance and has to play it. In this game, players rarely hit a target once, though Luke hits one twice causing a crowd to gather. They take their winnings and leave before they draw too much attention."}, {"tag": "p", "text": "Upon exiting the casino, Luke and Leia are spotted by one of Blackhole's men. Luke and Leia decide to head to the next casino. They take the tunnel to the next casino, when suddenly the lights go out. Shadow stormtroopers capture Luke and Leia and take them to a hologram of Blackhole. They then head to the spaceport, though they were seen by the droids."}, {"tag": "p", "text": "C-3PO talks to police droid R-55, but is unable to get help from him. The droids take a tunnel to the spaceport, but are stopped by a group of Freelies. They try taking the droids to their den, when they are stopped by a police droid and flee. They arrive at the spaceport and figure that they need to find a Hrakian ship based on the accents. The droids aren't allowed aboard the ship, so they go off to find a Hrakian that will let them on board."}, {"tag": "p", "text": "Blackhole is interrogating Luke, Leia and other Rebels, trying to get the name of their contact. Meanwhile, the droids go to a bar and find a drunk Hrakian named Branox. They give false orders to return to his ship and escort him out of the bar. They take him to the ship, and once aboard they break Luke, Leia and the other Rebels free from the paralysis beams."}, {"tag": "p", "text": "They defeat the stormtroopers in the room, and Blackhole's hologram shuts off. The Rebels run into more stormtroopers, but the droids help them escape by using fire-suppression foam. However, Falud is killed before they escape. As they escape the ship, they see Blackhole and more stormtroopers coming from another ship, but they do not fire due to it being too public a location."}, {"tag": "p", "text": "C-3PO stops telling his story to the supercomputer Mistress Mnemos briefly and gives her the most powerful memory he has of Blackhole, then goes back to telling the story."}, {"tag": "p", "text": "Blackhole has to report his failings to Darth Vader. R2-D2 wanted to tell his suspicions about Darth Vader's involvement to Luke. The droids stumble into a weapon shop where the owner starts to fit them with automatic weapons. The Freelies see the droids and want to take them, but their weapons systems start going off. The Freelies track the droids from a distance, though they enter a spaceship."}, {"tag": "p", "text": "The Rebels draw straws to see who will meet their contact. Luke draws the short straw and makes his way to the contact. Imperial spies, however, are keeping an eye on Luke and following him. While following the directions Luke was given, someone helps him get through unseen, by destroying cameras following Luke. Luke makes it to the contact, who happens to be the Vorzydiak President."}, {"tag": "p", "text": "Luke and the president talk and come up with a plan, though they come under attack. Luke is taken away from the battle and makes his way back to the ship. At the ship he discovers from C-3PO that R2-D2 and Leia have been captured by Freelies. They want credits for her return. R2-D2 has a tracker unit from the weapon store, so Luke can find him. Blackhole is told of Leia's capture and orders his spy to capture one of the Freelies."}, {"tag": "p", "text": "Leia is talking with the Freelies trying to get them to let her go. Luke is following the tracker signal when he comes across some stormtroopers interrogating a Freelie. Luke defeats the stormtroopers and makes their way into the Freelies base. The base becomes surrounded by more stormtroopers. The Freelies fight the stormtroopers and Merf show Luke and Leia the secret exit. As they escape, Merf is killed, but Luke and Leia escape to a hovercab."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Four strips were deleted from Gambler's World. The first two dealt with C-3PO arriving to converse with Mistress Mnemos, where he was stopped at the last checkpoint by a spherical droid to step on a white line until his identity was verified, causing 3PO to ask whether the Rebel Alliances' security measures were extreme. Upon his identity being verified, he then comments when Mnemos requires 3PO to step to the edge of the platform and divulge his identity that someone as big and smart as Mnemos should recognize her friends by now."}, {"tag": "p", "text": "The second two had Leia, Luke, 3PO, and R2-D2 on a roller coaster with the car briefly disengaging from the tracks, only to land at the bottom of the loop-de-loop. After that, Leia expressed that she can't handle any more of it even for the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}