{"url": "Gamorrean", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Gamorreans", "Category:Mammalian sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Gamorrean"}, {"tag": "p", "text": "Gamorreans were a sentient species of green-skinned pig-like humanoids that hailed from the Outer Rim planet of Gamorr. They grouped themselves in clans, each of which was led by a warlord and a Clan Matron. A number of Gamorrean guards were employed by the crime lord Jabba the Hutt throughout his career."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A species of tall, strong bipeds, the Gamorreans had porcine traits, like an upturned, large-nostriled cartilaginous snout, jowls, and upturned tusks. Their hulking bodies were covered in green or rarely pink, thick and hairless skin. They had five digits on every extremity, each sporting a hard nail. The digits of their hands included an opposable thumb, which allowed the Gamorreans to easily grasp and handle objects. The species had two sexes: the males, referred to as boars, and the females, called sows."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Gamorreans had a clan-based society. Each clan was ruled by a female leader, the Clan Matron, and a male leader, the Warlord. Although the sows farmed and hunted while the boars waged wars, the Gamorrean society was in fact a matriarchy. Indeed, a Warlord held his position by way of marriage to a Matron rather than force, although Matrons did make their selections based on the boars' combat skills. Gamorreans saw war as glorious, and violent clashes between clans were rife."}, {"tag": "p", "text": "Because of their low intelligence, Gamorreans tended to be both stubborn and loyal; philosophically, they believed that any problem could be solved by hitting it with brute force. They had a language of their own that sounded like mere grunts and squeals to outsiders. Although they could understand other languages, such as Galactic Basic Standard, they found most of them too difficult to pronounce."}, {"tag": "p", "text": "Technologically speaking, the Gamorreans were primitive, and they favored melee weapons like vibro-axes and vibro-lances over blasters. They never discovered space travel on their own. Moreover, Gamorrean boars failed to maintain personal hygiene, rarely changing their clothes or wiping the streaming mucus from under their snouts. Gamorreans chopped down areas of their natural forest habitat to make room for farming."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Gamorreans evolved on the planet of Gamorr in the Outer Rim Territories."}, {"tag": "h2", "text": "Gamorreans in the galaxy"}, {"tag": "p", "text": "Offworld Gamorreans were a common sight, be they mercenaries or enforcers working for crime lords. Most notably, the Hutt gangster Jabba Desilijic Tiure employed Gamorrean guards throughout his career. In underground gladiator matches, they often served as powerhouse fighters. Uncharacteristically, a Gamorrean worked as a clown in Preigo's Traveling World of Wonder at the time of the Clone Wars. By around 9 ABY, two Gamorreans could be found dueling with vibro-axes for sport in an arena as an organized sport."}, {"tag": "h3", "text": "Creations of Restin"}, {"tag": "p", "text": "According to a tale told by Acolyte of the Beyond Vaneé, at some point after the destruction of the planet Alderaan, Doctor Restin of the Tarkin Initiative vowed to have revenge on the Sith Lord Darth Vader for the deaths of his family and friends. Working with his droids, he created a genetic serum that, after injection, would turn its subject into a Gamorrean after hearing a certain soundwave; a Gamorrean squeal. This infection could then spread by touch. Upon learning of this, the scientist's assistant, Cranwell, contacted Vader's Star Destroyer to warn him of Restin's betrayal and then tried to stop the doctor's work, though this only resulted in his capture. When Vader arrived, feigning ignorance of the doctor's true intentions and, after witnessing Restin turn Cranwell into a Gamorrean, suggesting they could use the infection against the Rebel Alliance, Restin released his unstable Gamorrean against the Sith Lord."}, {"tag": "p", "text": "The former assistant transformed Vader's stormtroopers into Gamorreans, but the Dark Lord of the Sith effortlessly lifted the infected and Restin into the air with the Force. After forcing the scientist to confess, Vader revealed that he had only come to be a first-hand witness to his defeat, as the Sith Lord then used the Force to push the Gamorreans into the doctor, making them infect their very creator. Vader then departed aboard his Lambda-class T-4a shuttle, leaving the infected Restin at the mercy of his creations. When he told the story, Vaneé explained Vader had not been afraid of turning into a Gamorrean because, as he put it, Vader already was a monster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}